{
  "url": "https://voxday.net/2018/02/15/baa-aaa-aaa-warned-the-conservative/",
  "scraped_at": "2025-12-19T10:43:32.829460",
  "title": "Baa-aaa-aaa, warned the conservative",
  "date_display": "February 15, 2018",
  "date_iso": "2018-02-15T16:16:47+00:00",
  "date_from_url": "2018-02-15",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>Kurt Schlichter <a href=\"https://townhall.com/columnists/kurtschlichter/2018/02/15/progressives-must-stop-using-terror-to-try-and-intimidate-conservatives-n2448847\">sternly warns liberals</a> for the 37,479,842nd time that they are now treading DANGEROUSLY near to some very thin ice. Again.</p><blockquote><p>Do you liberals really want new rules allowing violence and terrorism?</p><p>Do you liberals really want new rules allowing denormalizing your political opponents?</p><p>Do you liberals really want new rules allowing dehumanizing your political opponents?</p><p>You may think you do now, but trust me, you really don’t.</p><p>Take heed: You are going to hate the new rules.</p><p>There is a way out, a way that is obvious to anyone of good faith and common sense, and since it’s always a leftist attacking Republicans, the Democrat leadership needs to lead the way. The way out is to join together with the President and other conservatives and unequivocally reject violence and terror.</p><p>Not obliquely.</p><p>Not with clichés.</p><p>No with a smirk and a wink.</p><p>Nancy Pelosi, Chuck Schumer, and all the other key Democrat leaders must stand on a stage beside Donald Trump and Don Jr. and say, without qualification that this is unacceptable and wrong.</p></blockquote><p>The “dire warning” column is a longtime staple for conservative columnists. I’ve been hearing conservatives issuing dire warnings to liberals about the dreadful consequences of their actions for nearly 40 years now.  And do you know what I have concluded as a result? Conservatives are not going to do anything at all to resist liberal or government violence, ever. They never have.</p><p>They didn’t resist when their children were bused. They didn’t resist when their schools were secularized. They didn’t resist when their country was invaded by 130 million foreigners. They didn’t resist when their churches were converged. They didn’t resist when their right to carry cash was restricted. They didn’t resist when their rights to speech were removed. They didn’t resist when their wives left them and divorce-raped them. They didn’t resist when their children were kidnapped by judicial fiat.</p><p>I no longer believe they will resist even when their guns are confiscated or when their religion is outlawed. What evidence do we have that conservatives will do anything at all except complain about liberals, vote for do-nothing Republicans, and carefully distance themselves from anyone who looks even remotely possible of actually doing anything?</p><p>I’m not saying that no one will ever resist gun confiscations. But I am entirely confident that no one who calls himself a conservative will. Conservatives are tough-talking cowards who simply will not disobey whatever they are told by an authority figure is the law. And liberals figured this out a <i>long time ago.</i> That’s why they targeted all of the positions of perceived authority. That’s why they have to hide their smiles every time someone like Kurt Schlichter waxes dramatic and solemnly warns them… again. Why would anyone expect them to heed yet another dire warning, when every single previous warning has proved to be an empty one?</p><p>The last conservative will be still be shaking his finger and warning the cannibals that they had better watch out if they don’t change their ways <i>or else </i>while he is being thrown into the boiling cookpot.</p></div>",
  "content_text": "Kurt Schlichter\nsternly warns liberals\nfor the 37,479,842nd time that they are now treading DANGEROUSLY near to some very thin ice. Again.\nDo you liberals really want new rules allowing violence and terrorism?\nDo you liberals really want new rules allowing denormalizing your political opponents?\nDo you liberals really want new rules allowing dehumanizing your political opponents?\nYou may think you do now, but trust me, you really don’t.\nTake heed: You are going to hate the new rules.\nThere is a way out, a way that is obvious to anyone of good faith and common sense, and since it’s always a leftist attacking Republicans, the Democrat leadership needs to lead the way. The way out is to join together with the President and other conservatives and unequivocally reject violence and terror.\nNot obliquely.\nNot with clichés.\nNo with a smirk and a wink.\nNancy Pelosi, Chuck Schumer, and all the other key Democrat leaders must stand on a stage beside Donald Trump and Don Jr. and say, without qualification that this is unacceptable and wrong.\nThe “dire warning” column is a longtime staple for conservative columnists. I’ve been hearing conservatives issuing dire warnings to liberals about the dreadful consequences of their actions for nearly 40 years now.  And do you know what I have concluded as a result? Conservatives are not going to do anything at all to resist liberal or government violence, ever. They never have.\nThey didn’t resist when their children were bused. They didn’t resist when their schools were secularized. They didn’t resist when their country was invaded by 130 million foreigners. They didn’t resist when their churches were converged. They didn’t resist when their right to carry cash was restricted. They didn’t resist when their rights to speech were removed. They didn’t resist when their wives left them and divorce-raped them. They didn’t resist when their children were kidnapped by judicial fiat.\nI no longer believe they will resist even when their guns are confiscated or when their religion is outlawed. What evidence do we have that conservatives will do anything at all except complain about liberals, vote for do-nothing Republicans, and carefully distance themselves from anyone who looks even remotely possible of actually doing anything?\nI’m not saying that no one will ever resist gun confiscations. But I am entirely confident that no one who calls himself a conservative will. Conservatives are tough-talking cowards who simply will not disobey whatever they are told by an authority figure is the law. And liberals figured this out a\nlong time ago.\nThat’s why they targeted all of the positions of perceived authority. That’s why they have to hide their smiles every time someone like Kurt Schlichter waxes dramatic and solemnly warns them… again. Why would anyone expect them to heed yet another dire warning, when every single previous warning has proved to be an empty one?\nThe last conservative will be still be shaking his finger and warning the cannibals that they had better watch out if they don’t change their ways\nor else\nwhile he is being thrown into the boiling cookpot.",
  "tags": [
    "cuckservative"
  ],
  "categories": [],
  "sitemap_lastmod": "2018-02-15T16:16:47+00:00"
}