{
  "url": "https://voxday.net/2018/02/18/barnes-noble-the-beginning-of-the-end/",
  "scraped_at": "2025-12-19T10:43:52.523503",
  "title": "Barnes & Noble: the beginning of the end",
  "date_display": "February 18, 2018",
  "date_iso": "2018-02-18T15:05:27+00:00",
  "date_from_url": "2018-02-18",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>The end of the Barnes &amp; Noble bookstore chain has not yet arrived. But it is <a href=\"https://techcrunch.com/2018/02/16/barnes-noble-is-killing-itself/\">now in sight</a>:</p><blockquote><p>I’ve been chronicling the slow demise of B&amp;N for years now, watching the company bleed out, drop by drop, until it has become a shell of its former value. B&amp;N was a cultural center in places without cultural centers. It was a stopover on rainy days in New York, Chicago, and Cleveland and it was a place you could go to get your kids’ first books.</p><p>That’s mostly over now. On Monday the company laid off 1,800 people. This offered a cost savings of $40 million. But that’s particularly interesting. That means each of those people made an average of $22,000 or so per year and minimum wage workers – hourly folks who are usually hit hardest during post-holiday downturns – would be making $15,000. In fact, what B&amp;N did was fire all full time employees at <strike>781</strike> 632 stores. From a former employee:</p><p><i>On Monday morning, every single Barnes &amp; Noble location told their full-time employees to pack up and leave. The eliminated positions were as follows: the head cashiers (those are the people responsible for handling the money), the receiving managers (the people responsible for bringing in product and making sure it goes where it should), the digital leads (the people responsible for solving Nook problems), the newsstand leads (the people responsible for distributing the magazines), and the bargain leads (the people responsible for keeping up the massive discount sections). A few of the larger stores were able to spare their head cashiers and their receiving managers, but not many.</i></p><p>Further, the company laid off many shipping receivers around the holidays, resulting in bare shelves and a customer escape to Amazon. In December 2017, usually B&amp;N’s key month, sales dropped 6 percent to $953 million. Online sales fell 4.5 percent.</p><p>It is important to note that when other big box retailers, namely Circuit City, went the route of firing all highly paid employees and bringing in minimum wage cashiers, stockers, and salespeople it signaled the beginning of the end.</p></blockquote><p>It’s actually worse than was originally reported, because Barnes &amp; Noble had already shut down 149 of those 781 stores.</p><p>The decline of Barnes &amp; Noble is both sad and exciting, as far as I’m concerned. Sad, because the bookstore was an important part of my early adulthood. I used to go to the original Roseville store after work on payday to spend most of my monthly $50 book budget on what gradually became an impressive collection of SF/F paperbacks, augmented by an eclectic assortment of hardcovers picked up on remainder. That’s why I still have all the Dorset Press books, like <i>The Kingdom of Armenia</i> by M. Chahin and <i>The Mabinogion</i>, translated and introduced by Jeffrey Gantz, on the bookshelves in my office.</p><p>A few years later, Spacebunny and I used to spend almost every Friday night at the Har Mar Barnes &amp; Noble after working out and having dinner with the guys at Khan’s Mongolian BBQ. That was also where, as a newly published SF author, I participated in the store’s biggest-ever book-signing with David Arneson, Gordon R. Dickson, Joel Rosenberg, and David Feintuch, all of whom have since left us. For more than a decade, Barnes &amp; Noble was a touchstone for me.</p><p>But the incipient failure of the chain also means that new opportunities are in store. It means that Amazon’s influence over the book world will grow stronger and the power of the Big Five will be further weakened. It means chaos and excitement and danger, and an environment in which the most nimble and adroit can profit most.</p><p>So, it’s going to be an interesting ride ahead. I hope you will join us on it. And since I’m often asked how our readers can most effectively support us when you buy our books, the answer is <a href=\"https://www.aerbook.com/store/castalia/CASTALIA_HOUSE/6072\">buying our print edition books through the Castalia Direct Store</a>. The interface absolutely sucks and the prices are not always as good as Amazon, but we are working with our partners are Aerio on improving both. The alternative is to be completely dependent upon Amazon, which strikes me, for one, as a risky idea.</p></div>",
  "content_text": "The end of the Barnes & Noble bookstore chain has not yet arrived. But it is\nnow in sight\n:\nI’ve been chronicling the slow demise of B&N for years now, watching the company bleed out, drop by drop, until it has become a shell of its former value. B&N was a cultural center in places without cultural centers. It was a stopover on rainy days in New York, Chicago, and Cleveland and it was a place you could go to get your kids’ first books.\nThat’s mostly over now. On Monday the company laid off 1,800 people. This offered a cost savings of $40 million. But that’s particularly interesting. That means each of those people made an average of $22,000 or so per year and minimum wage workers – hourly folks who are usually hit hardest during post-holiday downturns – would be making $15,000. In fact, what B&N did was fire all full time employees at\n781\n632 stores. From a former employee:\nOn Monday morning, every single Barnes & Noble location told their full-time employees to pack up and leave. The eliminated positions were as follows: the head cashiers (those are the people responsible for handling the money), the receiving managers (the people responsible for bringing in product and making sure it goes where it should), the digital leads (the people responsible for solving Nook problems), the newsstand leads (the people responsible for distributing the magazines), and the bargain leads (the people responsible for keeping up the massive discount sections). A few of the larger stores were able to spare their head cashiers and their receiving managers, but not many.\nFurther, the company laid off many shipping receivers around the holidays, resulting in bare shelves and a customer escape to Amazon. In December 2017, usually B&N’s key month, sales dropped 6 percent to $953 million. Online sales fell 4.5 percent.\nIt is important to note that when other big box retailers, namely Circuit City, went the route of firing all highly paid employees and bringing in minimum wage cashiers, stockers, and salespeople it signaled the beginning of the end.\nIt’s actually worse than was originally reported, because Barnes & Noble had already shut down 149 of those 781 stores.\nThe decline of Barnes & Noble is both sad and exciting, as far as I’m concerned. Sad, because the bookstore was an important part of my early adulthood. I used to go to the original Roseville store after work on payday to spend most of my monthly $50 book budget on what gradually became an impressive collection of SF/F paperbacks, augmented by an eclectic assortment of hardcovers picked up on remainder. That’s why I still have all the Dorset Press books, like\nThe Kingdom of Armenia\nby M. Chahin and\nThe Mabinogion\n, translated and introduced by Jeffrey Gantz, on the bookshelves in my office.\nA few years later, Spacebunny and I used to spend almost every Friday night at the Har Mar Barnes & Noble after working out and having dinner with the guys at Khan’s Mongolian BBQ. That was also where, as a newly published SF author, I participated in the store’s biggest-ever book-signing with David Arneson, Gordon R. Dickson, Joel Rosenberg, and David Feintuch, all of whom have since left us. For more than a decade, Barnes & Noble was a touchstone for me.\nBut the incipient failure of the chain also means that new opportunities are in store. It means that Amazon’s influence over the book world will grow stronger and the power of the Big Five will be further weakened. It means chaos and excitement and danger, and an environment in which the most nimble and adroit can profit most.\nSo, it’s going to be an interesting ride ahead. I hope you will join us on it. And since I’m often asked how our readers can most effectively support us when you buy our books, the answer is\nbuying our print edition books through the Castalia Direct Store\n. The interface absolutely sucks and the prices are not always as good as Amazon, but we are working with our partners are Aerio on improving both. The alternative is to be completely dependent upon Amazon, which strikes me, for one, as a risky idea.",
  "tags": [
    "declineandfall"
  ],
  "categories": [],
  "sitemap_lastmod": "2018-02-18T15:05:27+00:00"
}