{
  "url": "https://voxday.net/2018/02/03/beyond-imagining/",
  "scraped_at": "2025-12-19T10:41:55.210702",
  "title": "Beyond imagining",
  "date_display": "February 3, 2018",
  "date_iso": "2018-02-03T17:02:47+00:00",
  "date_from_url": "2018-02-03",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>It’s understandably hard for ordinary Americans to take seriously the overwrought claims of Hollywood actors and actresses that shady people are trying to kill them or destroy them. Then you read things like <a href=\"https://archive.fo/9hKKr\">this story about Uma Thurman’s treatment</a> at the hands of Harvey Weinstein and his team, and you realize that it is simply an alien world every bit as foreign as a civil war in Malawi or ethnic conflict in the former Yugoslavia.</p><blockquote><p>Since the revelations about Weinstein became public last fall, Thurman has been reliving her encounters with him — and a gruesome episode on location for “Kill Bill” in Mexico made her feel as blindsided as the bride and as determined to get her due, no matter how long it took.</p><p>With four days left, after nine months of shooting the sadistic saga, Thurman was asked to do something that made her draw the line.</p><p>In the famous scene where she’s driving the blue convertible to kill Bill — the same one she put on Instagram on Thanksgiving — she was asked to do the driving herself.</p><p>But she had been led to believe by a teamster, she says, that the car, which had been reconfigured from a stick shift to an automatic, might not be working that well.</p><p>She says she insisted that she didn’t feel comfortable operating the car and would prefer a stunt person to do it. Producers say they do not recall her objecting.</p><p>“Quentin came in my trailer and didn’t like to hear no, like any director,” she says. “He was furious because I’d cost them a lot of time. But I was scared. He said: ‘I promise you the car is fine. It’s a straight piece of road.’” He persuaded her to do it, and instructed: “ ‘Hit 40 miles per hour or your hair won’t blow the right way and I’ll make you do it again.’ But that was a deathbox that I was in. The seat wasn’t screwed down properly. It was a sand road and it was not a straight road.” (Tarantino did not respond to requests for comment.)</p><p>Thurman then shows me the footage that she says has taken her 15 years to get. “Solving my own Nancy Drew mystery,” she says.</p><p>It’s from the point of view of a camera mounted to the back of the Karmann Ghia. It’s frightening to watch Thurman wrestle with the car, as it drifts off the road and smashes into a palm tree, her contorted torso heaving helplessly until crew members appear in the frame to pull her out of the wreckage. Tarantino leans in and Thurman flashes a relieved smile when she realizes that she can briefly stand.</p></blockquote><p>If a car can’t go 40 MPH on a straight stretch of road, you don’t need a stunt driver, you need a crash team investigation and a prosecutor. I doubt Tarantino tried to kill Thurman, but either she is the worst driver in the world or someone did.</p><p><i>Two weeks after the crash, after trying to see the car and footage of the incident, she had her lawyer send a letter to Miramax, summarizing the event and reserving the right to sue. Miramax offered to show her the footage if she signed a document “releasing them of any consequences of my future pain and suffering,” she says. She didn’t.</i></p></div>",
  "content_text": "It’s understandably hard for ordinary Americans to take seriously the overwrought claims of Hollywood actors and actresses that shady people are trying to kill them or destroy them. Then you read things like\nthis story about Uma Thurman’s treatment\nat the hands of Harvey Weinstein and his team, and you realize that it is simply an alien world every bit as foreign as a civil war in Malawi or ethnic conflict in the former Yugoslavia.\nSince the revelations about Weinstein became public last fall, Thurman has been reliving her encounters with him — and a gruesome episode on location for “Kill Bill” in Mexico made her feel as blindsided as the bride and as determined to get her due, no matter how long it took.\nWith four days left, after nine months of shooting the sadistic saga, Thurman was asked to do something that made her draw the line.\nIn the famous scene where she’s driving the blue convertible to kill Bill — the same one she put on Instagram on Thanksgiving — she was asked to do the driving herself.\nBut she had been led to believe by a teamster, she says, that the car, which had been reconfigured from a stick shift to an automatic, might not be working that well.\nShe says she insisted that she didn’t feel comfortable operating the car and would prefer a stunt person to do it. Producers say they do not recall her objecting.\n“Quentin came in my trailer and didn’t like to hear no, like any director,” she says. “He was furious because I’d cost them a lot of time. But I was scared. He said: ‘I promise you the car is fine. It’s a straight piece of road.’” He persuaded her to do it, and instructed: “ ‘Hit 40 miles per hour or your hair won’t blow the right way and I’ll make you do it again.’ But that was a deathbox that I was in. The seat wasn’t screwed down properly. It was a sand road and it was not a straight road.” (Tarantino did not respond to requests for comment.)\nThurman then shows me the footage that she says has taken her 15 years to get. “Solving my own Nancy Drew mystery,” she says.\nIt’s from the point of view of a camera mounted to the back of the Karmann Ghia. It’s frightening to watch Thurman wrestle with the car, as it drifts off the road and smashes into a palm tree, her contorted torso heaving helplessly until crew members appear in the frame to pull her out of the wreckage. Tarantino leans in and Thurman flashes a relieved smile when she realizes that she can briefly stand.\nIf a car can’t go 40 MPH on a straight stretch of road, you don’t need a stunt driver, you need a crash team investigation and a prosecutor. I doubt Tarantino tried to kill Thurman, but either she is the worst driver in the world or someone did.\nTwo weeks after the crash, after trying to see the car and footage of the incident, she had her lawyer send a letter to Miramax, summarizing the event and reserving the right to sue. Miramax offered to show her the footage if she signed a document “releasing them of any consequences of my future pain and suffering,” she says. She didn’t.",
  "tags": [
    "movies"
  ],
  "categories": [],
  "sitemap_lastmod": "2018-02-03T17:02:47+00:00"
}