{
  "url": "https://voxday.net/2018/02/25/california-democrats-are-the-new-holocaust/",
  "scraped_at": "2025-12-19T10:44:50.118170",
  "title": "California Democrats are the New Holocaust",
  "date_display": "February 25, 2018",
  "date_iso": "2018-02-25T15:50:19+00:00",
  "date_from_url": "2018-02-25",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>Identity politics <a href=\"https://www.politico.com/story/2018/02/25/california-democrats-feinstein-leon-423452\">are reshaping the Democratic Party</a>, more or less as I predicted. Though apparently <a href=\"https://www.politico.com/story/2018/02/25/california-democrats-feinstein-leon-423452\">the nature of that reshaping</a> is coming as an unpleasant surprise to the (((white))) progressives who rose to power largely on the basis of their self-serving, self-appointed championing of the New Americans:</p><blockquote><p>In a sharp rebuke of Sen. Dianne Feinstein, the California Democratic Party has declined to endorse the state’s own senior senator in her bid for reelection. Riven by conflict between progressive and more moderate forces at the state party’s annual convention here, delegates favored Feinstein’s progressive rival, state Senate leader Kevin de León, over Feinstein by a 54 percent to 37 percent margin, according to results announced Sunday.</p><p>Neither candidate reached the 60 percent threshold required to receive the party endorsement for 2018. But the snubbing of Feinstein led de León to claim a victory for his struggling campaign.</p><p>“The outcome of today’s endorsement vote is an astounding rejection of politics as usual, and it boosts our campaign’s momentum as we all stand shoulder-to-shoulder against a complacent status quo,” de León said in a prepared statement. “California Democrats are hungry for new leadership that will fight for California values from the front lines, not equivocate on the sidelines.”</p><p>A centrist Democrat, Feinstein has long maintained an uneasy relationship with activists who dominate state party conventions, and the vote this weekend — while embarrassing — was not unexpected. The result followed two days of lobbying by the candidates in convention speeches and throughout the convention halls.</p></blockquote><p>Just as Minnesota’s (((Democrats))) are already being replaced by Somalis, California’s (((Democrats))) will be replaced by Asians and Hispanics. Or, in the case of Mr. de León, both at the same time. After all, how can one minor interest group successfully represent the interests of a rival interest group, even if they happen to share an ideology?</p><p>What should prove mildly amusing for the cynical observer is watching the shift from a “hello, fellow white people” strategy to <a href=\"https://infogalactic.com/info/Eric_Garcetti\">“hello, fellow bronze people”</a>. That will likely prove moderately successful, given both the low average Hispanic IQ as well as the way in which the Mexican elite has historically been genetically distinct from the masses of <i>la raza cosmica</i>, but I tend to doubt the inevitable attempt to adopt a “hello, fellow yellow people” strategy will similarly succeed, Amy Chua’s Mandarin-speaking Jewish tiger cubs notwithstanding.</p></div>",
  "content_text": "Identity politics\nare reshaping the Democratic Party\n, more or less as I predicted. Though apparently\nthe nature of that reshaping\nis coming as an unpleasant surprise to the (((white))) progressives who rose to power largely on the basis of their self-serving, self-appointed championing of the New Americans:\nIn a sharp rebuke of Sen. Dianne Feinstein, the California Democratic Party has declined to endorse the state’s own senior senator in her bid for reelection. Riven by conflict between progressive and more moderate forces at the state party’s annual convention here, delegates favored Feinstein’s progressive rival, state Senate leader Kevin de León, over Feinstein by a 54 percent to 37 percent margin, according to results announced Sunday.\nNeither candidate reached the 60 percent threshold required to receive the party endorsement for 2018. But the snubbing of Feinstein led de León to claim a victory for his struggling campaign.\n“The outcome of today’s endorsement vote is an astounding rejection of politics as usual, and it boosts our campaign’s momentum as we all stand shoulder-to-shoulder against a complacent status quo,” de León said in a prepared statement. “California Democrats are hungry for new leadership that will fight for California values from the front lines, not equivocate on the sidelines.”\nA centrist Democrat, Feinstein has long maintained an uneasy relationship with activists who dominate state party conventions, and the vote this weekend — while embarrassing — was not unexpected. The result followed two days of lobbying by the candidates in convention speeches and throughout the convention halls.\nJust as Minnesota’s (((Democrats))) are already being replaced by Somalis, California’s (((Democrats))) will be replaced by Asians and Hispanics. Or, in the case of Mr. de León, both at the same time. After all, how can one minor interest group successfully represent the interests of a rival interest group, even if they happen to share an ideology?\nWhat should prove mildly amusing for the cynical observer is watching the shift from a “hello, fellow white people” strategy to\n“hello, fellow bronze people”\n. That will likely prove moderately successful, given both the low average Hispanic IQ as well as the way in which the Mexican elite has historically been genetically distinct from the masses of\nla raza cosmica\n, but I tend to doubt the inevitable attempt to adopt a “hello, fellow yellow people” strategy will similarly succeed, Amy Chua’s Mandarin-speaking Jewish tiger cubs notwithstanding.",
  "tags": [
    "declineandfall"
  ],
  "categories": [],
  "sitemap_lastmod": "2018-02-25T15:50:19+00:00"
}