{
  "url": "https://voxday.net/2018/02/05/celebrated-creeps-and-criminals/",
  "scraped_at": "2025-12-19T10:42:15.816866",
  "title": "Celebrated creeps and criminals",
  "date_display": "February 5, 2018",
  "date_iso": "2018-02-05T22:10:53+00:00",
  "date_from_url": "2018-02-05",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>I had no doubt whatsoever that one of the major figures of science fiction fandom and <a href=\"https://archive.fo/4orjt\">Lifetime Member of SFWA</a>, Forrest Ackerman, was a seriously creepy pervert who preyed upon any young women foolish enough to hang around that environment. The way the man named “Uncle Forry” used to <a href=\"http://www.vampilore.co.uk/pix/models/heidisaha006.jpg\">publicly drool</a> over a young cosplayer named Heidi Saha should have sufficed to lock him up and instigate a multi-agency crime scene investigation of his garage, basement, and garden. But now there is eyewitness evidence that “Mr. Science Fiction” was exactly the creepy molester he appeared to be, courtesy of one Lucy Chase Williams, <a href=\"https://www.tapatalk.com/groups/monsterkidclassichorrorforum/forrest-j-ackerman-s-metoo-moment-t68925.html?sid=7ad1c94be145c2b836735d0bc4891668#p1344476\">who posted this indictment</a> of the man last week.</p><blockquote><p>I and other young women like me were subjected to a different kind of “Forry worship.” How differently would any of you have felt, when all you wanted was to talk about monsters with the “over eager editor” of your favorite monster magazine, if your Uncle Forry had forced wet kisses on you? If he had put his hands all over you, pinching your “naughty bottom” and squeezing your “boobies”? If he had enthusiastically related with a big grin how he wanted to strip off your clothes with everybody watching?</p><p>And if, in the face of your total refusal of any of his attentions every single time you saw him in person, he never didn’t try again, and again, and again? And if for years, in between those times, he mailed you letters with pornographic photos, and original stories about how naughty you were, and how he wanted to hurt and abuse you, yet all the while make you weep and beg for more? And if he continued that behavior, despite written and verbal demands to cease, entirely unabashed for more than two decades?</p><p>No, I can’t forget him either — or how he turned my childhood love of monsters into something adult and truly monstrous.</p></blockquote><p>I’m not sure what is more appalling, the fact that so many of the famous figures of the recent science fiction past were deviants and sex criminals or the fact that the current science fiction community still resolutely refuses to stop celebrating them or to root out the deviants and sex criminals currently in their midst.</p><p>Like Marion Zimmer Bradley, <a href=\"https://www.tapatalk.com/groups/monsterkidclassichorrorforum/download/file.php?id=4278&amp;t=1\">Forrest Ackerman is still celebrated</a> by the SFWA as well as the freaks of science fiction fandom.</p><p>UPDATE: Beyond creepy. <a href=\"https://junglefrolics.blogspot.com/2013/06/heidi-saha-addendum.html\">“Obsessed”</a> doesn’t even begin to describe it.</p><blockquote class=\"tr_bq\"><p>AN ILLUSTRATED HISTORY OF HEIDI SAHA was assembled by Forry Ackerman and sent off to the printer prior to Heidi’s summer 1973 appearances as Vampirella at the New York Comic Art Convention and TorCon 2.</p></blockquote><p>She was 14 years old.</p></div>",
  "content_text": "I had no doubt whatsoever that one of the major figures of science fiction fandom and\nLifetime Member of SFWA\n, Forrest Ackerman, was a seriously creepy pervert who preyed upon any young women foolish enough to hang around that environment. The way the man named “Uncle Forry” used to\npublicly drool\nover a young cosplayer named Heidi Saha should have sufficed to lock him up and instigate a multi-agency crime scene investigation of his garage, basement, and garden. But now there is eyewitness evidence that “Mr. Science Fiction” was exactly the creepy molester he appeared to be, courtesy of one Lucy Chase Williams,\nwho posted this indictment\nof the man last week.\nI and other young women like me were subjected to a different kind of “Forry worship.” How differently would any of you have felt, when all you wanted was to talk about monsters with the “over eager editor” of your favorite monster magazine, if your Uncle Forry had forced wet kisses on you? If he had put his hands all over you, pinching your “naughty bottom” and squeezing your “boobies”? If he had enthusiastically related with a big grin how he wanted to strip off your clothes with everybody watching?\nAnd if, in the face of your total refusal of any of his attentions every single time you saw him in person, he never didn’t try again, and again, and again? And if for years, in between those times, he mailed you letters with pornographic photos, and original stories about how naughty you were, and how he wanted to hurt and abuse you, yet all the while make you weep and beg for more? And if he continued that behavior, despite written and verbal demands to cease, entirely unabashed for more than two decades?\nNo, I can’t forget him either — or how he turned my childhood love of monsters into something adult and truly monstrous.\nI’m not sure what is more appalling, the fact that so many of the famous figures of the recent science fiction past were deviants and sex criminals or the fact that the current science fiction community still resolutely refuses to stop celebrating them or to root out the deviants and sex criminals currently in their midst.\nLike Marion Zimmer Bradley,\nForrest Ackerman is still celebrated\nby the SFWA as well as the freaks of science fiction fandom.\nUPDATE: Beyond creepy.\n“Obsessed”\ndoesn’t even begin to describe it.\nAN ILLUSTRATED HISTORY OF HEIDI SAHA was assembled by Forry Ackerman and sent off to the printer prior to Heidi’s summer 1973 appearances as Vampirella at the New York Comic Art Convention and TorCon 2.\nShe was 14 years old.",
  "tags": [
    "SFWA"
  ],
  "categories": [],
  "sitemap_lastmod": "2018-02-05T22:10:53+00:00"
}