{
  "url": "https://voxday.net/2018/02/20/dc-will-never-be-the-same/",
  "scraped_at": "2025-12-19T10:44:08.186755",
  "title": "DC will never be the same",
  "date_display": "February 20, 2018",
  "date_iso": "2018-02-20T15:15:53+00:00",
  "date_from_url": "2018-02-20",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p><i>“What we did today is going to change DC Comics forever. Forever. There’s no going back anymore.”</i><br>– John Cunningham, Senior Vice-President of Sales, Vice-President of Content Strategy, and Vice-President of Marketing at DC Comics/Warner Bros.</br></p><p>Music to my ears, though long-suffering DC Comics fans will probably disagree. <a href=\"https://www.bleedingcool.com/tag/asa/\">This is why</a>:</p><ol><li>Before he was Batman, he was Bruce Wayne. A reckless boy willing to break the rules for a girl who may be his worst enemy.</li><li>DC announced <i>Wonder Woman: Tempest Tossed</i> by the <i>Speak and Chains</i> writer Laurie Halse Anderson. With a 15-year-old Wonder Woman on Paradise Island who sees drowning refugees and disobeys her mother Hippolyta to rescue them. She becomes caught up in their struggle, becoming a refugee herself. Washing up on a foreign shore, she is met by two UN workers — one called Steve and another called Trevor.</li><li>Melissa de la Cruz’s Gotham High: a Multicultural Love Triangle Between Batman, Catwoman, and Joker. A Bruce Wayne high school graphic novel with a 17-year-old part-Chinese Bruce Wayne and DC villains as high school teenagers.</li><li>Mariko Tamaki and Steve Pugh’s Harley Quinn is an Intersectional Activist Comic About Drag Queens</li><li>Beautiful Creatures’ Kami Garcia Starts Line of Teen Titans Graphic Novels, Before They Were Superheroes. She will explore the Teen Titans lives before they realise they have powers, as a series of coming-of-age graphic novels.</li><li>Minh Lê introduced us to the youngest Green Lantern, the 13-year-old Tai. Tai  discovers that his grandmother was a secret Green Lantern, and he inherits her jade ring. Tai then goes on to uncover his grandmother’s life’s secrets as well as grapple with the new powers he has. Lê he has drawn on his own life in an immigrant family and his own grandmother and her life story, and it has become a very personal story to him.</li><li>His <i>Super Sons</i> story out in April next year, featuring Jonathan Kent and Damian Wayne, the sons of Superman and Batman, will be about climate disruption. With Lower Metropolis under twelve feet of water, with super storms cycling around the world destroying farmland and with what Ridley described as “a coastal ambush” of refugees heading to Denver and Lincoln, Nebraska as the coastline get flooded.</li><li>DC Comics gave some more details of the <i>Superman Smashes the Klan</i> graphic novel by Gene Luen Yang, and how it ties directly into the Superman vs The Klan radio serial from the forties. Because that is why the comic is set in 1946: it tells the story of an American Chinese girl who moves to Metropolis to find herself and her family’s ethnicity targeted by the Ku Klux Klan. Through her experience with Superman and the radio serial, she learns to overcome some of the trials and understand what it means to be American.</li></ol><p>Perhaps DC should consider changing its motto from whatever it is to “comics by transgender immigrants with an unhealthy interest in high school teenagers for transgender immigrants with an unhealthy interest in high school teenagers.”</p><p>Now, perhaps DC is attempting to safely wall off its SJW insanity in a series of low-budget comics intended to distract the media and divert the focus of its internal SJWs. But the fact that some of these writers are established names in YA fiction combined with the fact that it brought in Marvel’s lead SJW and handed him its most important properties tends to indicate that DC is simply doing what converged companies do and doubling down on social justice.</p><p>I agree with Mr. Cunningham. What they have done will change DC Comics forever. <i>Forever</i>. But what they have also done is to ensure that Arkhaven will become at least the #2 publisher in the comics industry. <i>At least</i>. This panel from the forthcoming <i>Chuck Dixon’s Avalon #1</i> should serve as an accurate metaphor of the eventual outcome.</p><div class=\"separator\" style=\"clear: both; text-align: center;\"><a href=\"https://pbs.twimg.com/media/DWeV9uBX0AAg0PB.jpg:large\" imageanchor=\"1\" style=\"margin-left: 1em; margin-right: 1em;\"><noscript><img border=\"0\" data-original-height=\"770\" data-original-width=\"512\" decoding=\"async\" src=\"https://pbs.twimg.com/media/DWeV9uBX0AAg0PB.jpg:large\"/></noscript><img border=\"0\" class=\"lazyload\" data-original-height=\"770\" data-original-width=\"512\" data-src=\"https://pbs.twimg.com/media/DWeV9uBX0AAg0PB.jpg:large\" decoding=\"async\" src=\"data:image/svg+xml,%3Csvg%20xmlns=%22http://www.w3.org/2000/svg%22%20viewBox=%220%200%20512%20770%22%3E%3C/svg%3E\"/></a></div></div>",
  "content_text": "“What we did today is going to change DC Comics forever. Forever. There’s no going back anymore.”\n– John Cunningham, Senior Vice-President of Sales, Vice-President of Content Strategy, and Vice-President of Marketing at DC Comics/Warner Bros.\nMusic to my ears, though long-suffering DC Comics fans will probably disagree.\nThis is why\n:\nBefore he was Batman, he was Bruce Wayne. A reckless boy willing to break the rules for a girl who may be his worst enemy.\nDC announced\nWonder Woman: Tempest Tossed\nby the\nSpeak and Chains\nwriter Laurie Halse Anderson. With a 15-year-old Wonder Woman on Paradise Island who sees drowning refugees and disobeys her mother Hippolyta to rescue them. She becomes caught up in their struggle, becoming a refugee herself. Washing up on a foreign shore, she is met by two UN workers — one called Steve and another called Trevor.\nMelissa de la Cruz’s Gotham High: a Multicultural Love Triangle Between Batman, Catwoman, and Joker. A Bruce Wayne high school graphic novel with a 17-year-old part-Chinese Bruce Wayne and DC villains as high school teenagers.\nMariko Tamaki and Steve Pugh’s Harley Quinn is an Intersectional Activist Comic About Drag Queens\nBeautiful Creatures’ Kami Garcia Starts Line of Teen Titans Graphic Novels, Before They Were Superheroes. She will explore the Teen Titans lives before they realise they have powers, as a series of coming-of-age graphic novels.\nMinh Lê introduced us to the youngest Green Lantern, the 13-year-old Tai. Tai  discovers that his grandmother was a secret Green Lantern, and he inherits her jade ring. Tai then goes on to uncover his grandmother’s life’s secrets as well as grapple with the new powers he has. Lê he has drawn on his own life in an immigrant family and his own grandmother and her life story, and it has become a very personal story to him.\nHis\nSuper Sons\nstory out in April next year, featuring Jonathan Kent and Damian Wayne, the sons of Superman and Batman, will be about climate disruption. With Lower Metropolis under twelve feet of water, with super storms cycling around the world destroying farmland and with what Ridley described as “a coastal ambush” of refugees heading to Denver and Lincoln, Nebraska as the coastline get flooded.\nDC Comics gave some more details of the\nSuperman Smashes the Klan\ngraphic novel by Gene Luen Yang, and how it ties directly into the Superman vs The Klan radio serial from the forties. Because that is why the comic is set in 1946: it tells the story of an American Chinese girl who moves to Metropolis to find herself and her family’s ethnicity targeted by the Ku Klux Klan. Through her experience with Superman and the radio serial, she learns to overcome some of the trials and understand what it means to be American.\nPerhaps DC should consider changing its motto from whatever it is to “comics by transgender immigrants with an unhealthy interest in high school teenagers for transgender immigrants with an unhealthy interest in high school teenagers.”\nNow, perhaps DC is attempting to safely wall off its SJW insanity in a series of low-budget comics intended to distract the media and divert the focus of its internal SJWs. But the fact that some of these writers are established names in YA fiction combined with the fact that it brought in Marvel’s lead SJW and handed him its most important properties tends to indicate that DC is simply doing what converged companies do and doubling down on social justice.\nI agree with Mr. Cunningham. What they have done will change DC Comics forever.\nForever\n. But what they have also done is to ensure that Arkhaven will become at least the #2 publisher in the comics industry.\nAt least\n. This panel from the forthcoming\nChuck Dixon’s Avalon #1\nshould serve as an accurate metaphor of the eventual outcome.",
  "tags": [
    "SJW"
  ],
  "categories": [],
  "sitemap_lastmod": "2018-02-20T15:15:53+00:00"
}