{
  "url": "https://voxday.net/2018/02/24/do-not-question-the-narrative/",
  "scraped_at": "2025-12-19T10:44:44.204031",
  "title": "Do NOT question the Narrative!",
  "date_display": "February 24, 2018",
  "date_iso": "2018-02-24T17:29:56+00:00",
  "date_from_url": "2018-02-24",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>YouTube <a href=\"https://edition.cnn.com/2018/02/23/us/infowars-youtube-videos-trnd/index.html\">threatens Infowars</a> with account termination:</p><blockquote><p>InfoWars, a far-right media organization run by Alex Jones and known for peddling unfounded conspiracy theories, is on thin ice with YouTube after it posted a video that portrayed the survivors of the Parkland school shooting as actors.</p><p>The Alex Jones Channel, Infowar’s biggest YouTube account, received one strike for that video, a source with knowledge of the account told CNN. YouTube’s community guidelines say if an account receives three strikes in three months, the account is terminated.</p><p>That video focused on David Hogg, a strong voice among survivors of the mass shooting at Marjory Stoneman Douglas High School. The attention has given him a powerful platform — but it has also made him the subject of demonstrably false conspiracy theories that claim he is so simply too skilled as public speakers not to be a paid actor.</p><p>On Wednesday, YouTube removed the video from InfoWars’ page for violating its policies on harassment and bullying. The video was titled, “David Hogg Can’t Remember His Lines In TV Interview.”</p></blockquote><p>The fact that the mainstream media and Youtube are peddling pure propaganda is underlined by their over-the-top reaction to the accusations that people like David Hogg are crisis actors playing a role to create a false narrative for the public.</p><p>If it was actually a “demonstrably false” charge, they wouldn’t be threatened by it. If it were simply nonsense, they wouldn’t be so desperate to shut it down.</p><p>From the article: <i>Conspiracy believers think false flags are government operations that seek to divert or steer public discussion and policy.</i><br><i><br/></i>From the <a href=\"https://infogalactic.com/info/False_flag\">online encyclopedia</a>: <i>The contemporary term <b>false flag</b> describes covert operations that are designed to deceive in such a way that activities appear as though they are being carried out by entities, groups, or nations other than those who actually planned and executed them. </i><br><i><br/></i>The conspiracy believers are correct. That’s exactly what false flags are, <a href=\"https://infogalactic.com/info/Operation_Northwoods\">Operation Northwoods</a> being but one of many historical examples.</br></br></p><p>Notice the ludicrously false claims in the linked piece. It’s rather shocking that they actually seem to expect people not to notice them. Their “debunking” is incoherent. Literally <u>no one</u> claims that David Hogg is “simply too skilled” as a public speaker to not be a paid actor. In fact, the headline quoted <i>right in the linked piece</i> points out the precise opposite! It points out that Hogg is such a <u>bad</u> actor that he can’t even remember his scripted lines. As I have repeatedly pointed out, it is very clear to any professional fiction editor that these actors are reciting lines from a script. A very bad and poorly written script that doesn’t sound even remotely like the way real people actually speak in high-pressure situations.</p><p>Q is right. These people are stupid. These people are <i>government employees</i>. This is what happens when people with an average IQ of 95 try to produce a live-action movie. And that is why the media has to try to shut down all dubious and skeptical voices, because the obvious questions that are naturally raised are so destructive of the Narrative that the mere asking of them is sufficient to destroy the Official Story that the media is trying, and failing, to uphold.</p><p><i>Who do you think is leaking the info?</i><br><i>Take a wild guess.</i><br><i>Analyze shooter (pawn).</i><br><i>Voices in his head?</i><br><i>We know.</i><br><i>We are taking action behind the scenes.</i><br><i>CNN was set up.</i><br><i>STUPID.</i></br></br></br></br></br></br></br></p><p><u>All</u> of these emotionally manipulative events, from <a href=\"https://archive.fo/Mmgij\">Sandy Hook</a> to Parkland, are fake. They’re not even remotely credible, and the more the media tries to clamp down on everyone who is simply asking obvious questions, the more obvious it is that they are in on it.</p><p><i>$45 million, in total, has flowed into Sandy Hook in the last two years.</i></p><p>This is why those who are committed to the truth must build our own platforms. And this is why the God-Emperor would be wise to put a special military commission together to investigate the Deep State’s corruption and control of the mainstream media.</p><p>UPDATE: This is <a href=\"https://gopreload.org/wp-content/uploads/2018/02/David-Hogg-stumbling-on-rehearsed-lines.mp4?_=2\">the video of David Hogg flubbing his lines</a> that the media doesn’t want you to see. Notice that he’s not breaking down, he’s just not remembering how to say them correctly. It’s also interesting to note that Reddit is now threatening to ban redditors who so much as mention his name.</p></div>",
  "content_text": "YouTube\nthreatens Infowars\nwith account termination:\nInfoWars, a far-right media organization run by Alex Jones and known for peddling unfounded conspiracy theories, is on thin ice with YouTube after it posted a video that portrayed the survivors of the Parkland school shooting as actors.\nThe Alex Jones Channel, Infowar’s biggest YouTube account, received one strike for that video, a source with knowledge of the account told CNN. YouTube’s community guidelines say if an account receives three strikes in three months, the account is terminated.\nThat video focused on David Hogg, a strong voice among survivors of the mass shooting at Marjory Stoneman Douglas High School. The attention has given him a powerful platform — but it has also made him the subject of demonstrably false conspiracy theories that claim he is so simply too skilled as public speakers not to be a paid actor.\nOn Wednesday, YouTube removed the video from InfoWars’ page for violating its policies on harassment and bullying. The video was titled, “David Hogg Can’t Remember His Lines In TV Interview.”\nThe fact that the mainstream media and Youtube are peddling pure propaganda is underlined by their over-the-top reaction to the accusations that people like David Hogg are crisis actors playing a role to create a false narrative for the public.\nIf it was actually a “demonstrably false” charge, they wouldn’t be threatened by it. If it were simply nonsense, they wouldn’t be so desperate to shut it down.\nFrom the article:\nConspiracy believers think false flags are government operations that seek to divert or steer public discussion and policy.\nFrom the\nonline encyclopedia\n:\nThe contemporary term\nfalse flag\ndescribes covert operations that are designed to deceive in such a way that activities appear as though they are being carried out by entities, groups, or nations other than those who actually planned and executed them.\nThe conspiracy believers are correct. That’s exactly what false flags are,\nOperation Northwoods\nbeing but one of many historical examples.\nNotice the ludicrously false claims in the linked piece. It’s rather shocking that they actually seem to expect people not to notice them. Their “debunking” is incoherent. Literally\nno one\nclaims that David Hogg is “simply too skilled” as a public speaker to not be a paid actor. In fact, the headline quoted\nright in the linked piece\npoints out the precise opposite! It points out that Hogg is such a\nbad\nactor that he can’t even remember his scripted lines. As I have repeatedly pointed out, it is very clear to any professional fiction editor that these actors are reciting lines from a script. A very bad and poorly written script that doesn’t sound even remotely like the way real people actually speak in high-pressure situations.\nQ is right. These people are stupid. These people are\ngovernment employees\n. This is what happens when people with an average IQ of 95 try to produce a live-action movie. And that is why the media has to try to shut down all dubious and skeptical voices, because the obvious questions that are naturally raised are so destructive of the Narrative that the mere asking of them is sufficient to destroy the Official Story that the media is trying, and failing, to uphold.\nWho do you think is leaking the info?\nTake a wild guess.\nAnalyze shooter (pawn).\nVoices in his head?\nWe know.\nWe are taking action behind the scenes.\nCNN was set up.\nSTUPID.\nAll\nof these emotionally manipulative events, from\nSandy Hook\nto Parkland, are fake. They’re not even remotely credible, and the more the media tries to clamp down on everyone who is simply asking obvious questions, the more obvious it is that they are in on it.\n$45 million, in total, has flowed into Sandy Hook in the last two years.\nThis is why those who are committed to the truth must build our own platforms. And this is why the God-Emperor would be wise to put a special military commission together to investigate the Deep State’s corruption and control of the mainstream media.\nUPDATE: This is\nthe video of David Hogg flubbing his lines\nthat the media doesn’t want you to see. Notice that he’s not breaking down, he’s just not remembering how to say them correctly. It’s also interesting to note that Reddit is now threatening to ban redditors who so much as mention his name.",
  "tags": [
    "#AltTech"
  ],
  "categories": [],
  "sitemap_lastmod": "2018-02-24T17:29:56+00:00"
}