{
  "url": "https://voxday.net/2018/02/11/excerpt-a-history-of-strategy/",
  "scraped_at": "2025-12-19T10:43:00.110231",
  "title": "EXCERPT: A History of Strategy",
  "date_display": "February 11, 2018",
  "date_iso": "2018-02-11T00:18:00+00:00",
  "date_from_url": "2018-02-11",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p><i>This passage about the beginning of the Age of Air Power seemed relevant in light of my earlier musings on the possibility that we are beginning to see the signs of its end. From the excellent <b><a href=\"http://amzn.to/1OjgvUu\">A History of Strategy</a></b> by Martin van Creveld, a true must-read for any student of war.</i></p><p>Throughout history, all too often the end of an armed conflict has served as a prelude to the next one. Never was this more true than at the end of World War I. Though it was sometimes described as “the war to end all wars,” all it did was provide a temporary respite. Scarcely had the guns fallen silent when people started looking into the future on the assumption that the Great Powers had not yet finished fighting each other. This naturally gave rise to the question, how would the next war be waged?</p><p>To virtually all of those who tried, the point of departure was the need to minimize casualties. True to its name, the Great War had been fought with greater ferocity, and resulted in more dead and injured, than many of its predecessors put together. Confirming the predictions of some pre-war writers, such as the Jewish-Polish banker Ivan Bloch, this was the direct result of the superiority of the defense as brought about by modern firepower. Hence the most pressing problem was to find ways to bypass, or overcome, that firepower and that defense. Failure to do so might render the next war as unprofitable as the struggle of 1914–1918 had been (to say nothing of the possibility that the dreadful losses and destruction suffered), and might cause it to end in revolution, as had already occurred in Russia, Austria-Hungary, and Germany.</p><p>In any event, the first serious theoretical treatise designed to solve the problem was written by an Italian general, Giulio Douhet. An engineer by trade, during the early years of the century Douhet had become fascinated with the military possibilities of the internal combustion engine. A little later he was also found dabbling in futurist ideas concerning the spiritual qualities allegedly springing from those two speedy new vehicles, the motor car and the aircraft, claiming that they had the ability to rejuvenate the world and Italy in particular. As a staff officer in 1915–18, he was in a position to observe no fewer than twelve Italian offensives directed against the Austrians across the river Isonzo. All twelve failed, producing hundreds of thousands of casualties for little or no territorial gain. He imagined there had to be a better way of doing things. One of those, which he had already promoted during the war itself, was the creation of a massive bomber force to be used against the enemy. Douhet’s masterpiece, <i>Il dominio del aereo</i> (<i>Command of the Air</i>) was published in 1921. Though it took time to be translated, a survey of the interwar military literature shows that its leading ideas were widely studied and debated.</p><p>To Douhet, then, “the form of any war … depends upon the technical means of war available.” In the past, firearms had revolutionized war. Next it was the turn of small caliber rapid fire guns, barbed wire and, at sea, the submarine. The most recent additions were the air arm and poison gas, both of them still in their infancy but with the potential to “completely upset all forms of war so far known.” In particular, so long as war was fought only on the surface of the earth it was necessary for one side to break through the other’s defenses in order to win. Those defenses, however, tended to become stronger and stronger until, in the conflict that had just ended, they had extended over practically the entire battlefield and barred the troops of both sides from moving forward. Behind the hard crusts presented by the fronts the populations of the various states carried on civilian life almost undisturbed. Mobilizing those populations, the states in question were able to produce the wherewithal of total war and sustain the struggle for years on end.</p><p>The advent of the aircraft was bringing this situation to an end. Capable of overflying both fronts and natural obstacles, and possessing a comparatively long range, aircraft would be used to attack civilian centers of population and industry. The air could be traversed in all directions with equal ease, nor was there a way to predict which target would be hit next. That was why no effective defense against such attacks was possible. Each attacking aircraft would have to be countered by twenty defensive ones; or else, if the job were entrusted to guns, hundreds if not thousands of them.</p><p>Extrapolating from the raids that had taken place in 1916–1918, Douhet showed that forty aircraft dropping eighty tons of bombs might have “completely destroyed” a city the size of Treviso, leaving alive “very few” of its 17,000 inhabitants. A mere three aircraft could deliver as much firepower as could a modern battleship in a single broadside, whereas a thousand aircraft could deliver ten times as much firepower as could the entire British Navy—counting 30 battleships—in ten. Yet the price-tag of a single battleship was said to be about equal to that of a thousand aircraft. To use modern terminology, the differential in cost/effectiveness between the two arms was little less than phenomenal. As Douhet pointed out, moreover, even these calculations failed to take account of the fact that the career of military aviation had just begun and that aircraft capable of lifting as much as ten tons each might soon be constructed.</p><p>Under such circumstances, investments in armies and navies would come to a gradual halt. The resources freed in this way should be diverted to the air arm, regarded as the decisive one in any future conflict. Properly used, it could bring about a quick decision—so quick, indeed, that there might scarcely be sufficient time for the two remaining ones to be mobilized and deployed. Given that the character of the new weapon was inherently offensive, most of the aircraft ought to be not fighters but bombers. Instead of forming part of the army and navy, as was then the case in all major armed forces except those of Britain, they should be assembled in an independent air force.</p><p>At the outbreak of the next war that air force should be launched like a shell from a cannon, mounting an all-out attack against the enemy’s air bases with the objective of gaining “command of the air.” Once command of the air had been attained—meaning that the enemy, his bases destroyed, was no longer able to interfere with operations—the attackers should switch from military objectives to civilian ones, knocking them out one by one. Industrial plants as well as population centers ought to be attacked; the attackers’ principal weapon ought to be gas, the aim not merely to kill but to demoralize. Leaping over and ignoring the usual forces that defend a country, a war waged by such means might be over almost before it had begun. In so far as it would minimize the casualties of both the attacker and the defender (whose population, driven to the point of madness, would force the government to surrender) it also represented a more humane modus operandi than an endless struggle of attrition.</p><p>Like Mahan, to whom he owed much, Douhet has been accused of overstating his case. When the test came in World War II it was found that his calculations, made in terms of a uniform bomb pattern dropping on an area of 500 by 500 meters, did not allow for the practical difficulties of accurately landing ordnance on target. As a result, far more bombs and aircraft would be needed to obliterate a given objective than he thought. Perhaps because gas was not used, by and large the populations which found themselves at the receiving end of those bombs proved much more resilient than he had expected. This caused one critic to quip that Douhet could not be blamed for the fact that the people whom he used as the basis for his calculations were, after all, Italians, whom everyone knew to be lousy soldiers. Finally, once radar had been introduced the air-weapon turned out to be much better adapted for defensive purposes than its original prophet—he died in 1930—had foreseen. In the air, as on land, World War II developed into a prolonged and extremely deadly struggle of attrition.</p><p>Nevertheless, given that it is with the evolution of military thought that we are dealing here, it should be said at once that no other treatise written on the subject of air warfare has ever presented nearly as coherent a picture as did <i>Il dominio del aereo</i>, nor has any other treatise been nearly as influential. In part, this was for institutional reasons. Engaging in close air support (CAS) and interdicting enemy lines of communication were missions which might conceivably be undertaken by an army air force. But gaining command of the air and attacking the other side’s homeland were clearly independent missions which called for an equally independent air force. Be this as it may, the mirage of dealing a rapid and all-powerful blow from the air—so rapid and so powerful that the need for the remaining armed forces would be all but obviated—has continued to fascinate airmen. It did so right through World War II and into the nuclear age when, but for the fact that nuclear weapons were too powerful to use, it might have been realized.</p></div>",
  "content_text": "This passage about the beginning of the Age of Air Power seemed relevant in light of my earlier musings on the possibility that we are beginning to see the signs of its end. From the excellent\nA History of Strategy\nby Martin van Creveld, a true must-read for any student of war.\nThroughout history, all too often the end of an armed conflict has served as a prelude to the next one. Never was this more true than at the end of World War I. Though it was sometimes described as “the war to end all wars,” all it did was provide a temporary respite. Scarcely had the guns fallen silent when people started looking into the future on the assumption that the Great Powers had not yet finished fighting each other. This naturally gave rise to the question, how would the next war be waged?\nTo virtually all of those who tried, the point of departure was the need to minimize casualties. True to its name, the Great War had been fought with greater ferocity, and resulted in more dead and injured, than many of its predecessors put together. Confirming the predictions of some pre-war writers, such as the Jewish-Polish banker Ivan Bloch, this was the direct result of the superiority of the defense as brought about by modern firepower. Hence the most pressing problem was to find ways to bypass, or overcome, that firepower and that defense. Failure to do so might render the next war as unprofitable as the struggle of 1914–1918 had been (to say nothing of the possibility that the dreadful losses and destruction suffered), and might cause it to end in revolution, as had already occurred in Russia, Austria-Hungary, and Germany.\nIn any event, the first serious theoretical treatise designed to solve the problem was written by an Italian general, Giulio Douhet. An engineer by trade, during the early years of the century Douhet had become fascinated with the military possibilities of the internal combustion engine. A little later he was also found dabbling in futurist ideas concerning the spiritual qualities allegedly springing from those two speedy new vehicles, the motor car and the aircraft, claiming that they had the ability to rejuvenate the world and Italy in particular. As a staff officer in 1915–18, he was in a position to observe no fewer than twelve Italian offensives directed against the Austrians across the river Isonzo. All twelve failed, producing hundreds of thousands of casualties for little or no territorial gain. He imagined there had to be a better way of doing things. One of those, which he had already promoted during the war itself, was the creation of a massive bomber force to be used against the enemy. Douhet’s masterpiece,\nIl dominio del aereo\n(\nCommand of the Air\n) was published in 1921. Though it took time to be translated, a survey of the interwar military literature shows that its leading ideas were widely studied and debated.\nTo Douhet, then, “the form of any war … depends upon the technical means of war available.” In the past, firearms had revolutionized war. Next it was the turn of small caliber rapid fire guns, barbed wire and, at sea, the submarine. The most recent additions were the air arm and poison gas, both of them still in their infancy but with the potential to “completely upset all forms of war so far known.” In particular, so long as war was fought only on the surface of the earth it was necessary for one side to break through the other’s defenses in order to win. Those defenses, however, tended to become stronger and stronger until, in the conflict that had just ended, they had extended over practically the entire battlefield and barred the troops of both sides from moving forward. Behind the hard crusts presented by the fronts the populations of the various states carried on civilian life almost undisturbed. Mobilizing those populations, the states in question were able to produce the wherewithal of total war and sustain the struggle for years on end.\nThe advent of the aircraft was bringing this situation to an end. Capable of overflying both fronts and natural obstacles, and possessing a comparatively long range, aircraft would be used to attack civilian centers of population and industry. The air could be traversed in all directions with equal ease, nor was there a way to predict which target would be hit next. That was why no effective defense against such attacks was possible. Each attacking aircraft would have to be countered by twenty defensive ones; or else, if the job were entrusted to guns, hundreds if not thousands of them.\nExtrapolating from the raids that had taken place in 1916–1918, Douhet showed that forty aircraft dropping eighty tons of bombs might have “completely destroyed” a city the size of Treviso, leaving alive “very few” of its 17,000 inhabitants. A mere three aircraft could deliver as much firepower as could a modern battleship in a single broadside, whereas a thousand aircraft could deliver ten times as much firepower as could the entire British Navy—counting 30 battleships—in ten. Yet the price-tag of a single battleship was said to be about equal to that of a thousand aircraft. To use modern terminology, the differential in cost/effectiveness between the two arms was little less than phenomenal. As Douhet pointed out, moreover, even these calculations failed to take account of the fact that the career of military aviation had just begun and that aircraft capable of lifting as much as ten tons each might soon be constructed.\nUnder such circumstances, investments in armies and navies would come to a gradual halt. The resources freed in this way should be diverted to the air arm, regarded as the decisive one in any future conflict. Properly used, it could bring about a quick decision—so quick, indeed, that there might scarcely be sufficient time for the two remaining ones to be mobilized and deployed. Given that the character of the new weapon was inherently offensive, most of the aircraft ought to be not fighters but bombers. Instead of forming part of the army and navy, as was then the case in all major armed forces except those of Britain, they should be assembled in an independent air force.\nAt the outbreak of the next war that air force should be launched like a shell from a cannon, mounting an all-out attack against the enemy’s air bases with the objective of gaining “command of the air.” Once command of the air had been attained—meaning that the enemy, his bases destroyed, was no longer able to interfere with operations—the attackers should switch from military objectives to civilian ones, knocking them out one by one. Industrial plants as well as population centers ought to be attacked; the attackers’ principal weapon ought to be gas, the aim not merely to kill but to demoralize. Leaping over and ignoring the usual forces that defend a country, a war waged by such means might be over almost before it had begun. In so far as it would minimize the casualties of both the attacker and the defender (whose population, driven to the point of madness, would force the government to surrender) it also represented a more humane modus operandi than an endless struggle of attrition.\nLike Mahan, to whom he owed much, Douhet has been accused of overstating his case. When the test came in World War II it was found that his calculations, made in terms of a uniform bomb pattern dropping on an area of 500 by 500 meters, did not allow for the practical difficulties of accurately landing ordnance on target. As a result, far more bombs and aircraft would be needed to obliterate a given objective than he thought. Perhaps because gas was not used, by and large the populations which found themselves at the receiving end of those bombs proved much more resilient than he had expected. This caused one critic to quip that Douhet could not be blamed for the fact that the people whom he used as the basis for his calculations were, after all, Italians, whom everyone knew to be lousy soldiers. Finally, once radar had been introduced the air-weapon turned out to be much better adapted for defensive purposes than its original prophet—he died in 1930—had foreseen. In the air, as on land, World War II developed into a prolonged and extremely deadly struggle of attrition.\nNevertheless, given that it is with the evolution of military thought that we are dealing here, it should be said at once that no other treatise written on the subject of air warfare has ever presented nearly as coherent a picture as did\nIl dominio del aereo\n, nor has any other treatise been nearly as influential. In part, this was for institutional reasons. Engaging in close air support (CAS) and interdicting enemy lines of communication were missions which might conceivably be undertaken by an army air force. But gaining command of the air and attacking the other side’s homeland were clearly independent missions which called for an equally independent air force. Be this as it may, the mirage of dealing a rapid and all-powerful blow from the air—so rapid and so powerful that the need for the remaining armed forces would be all but obviated—has continued to fascinate airmen. It did so right through World War II and into the nuclear age when, but for the fact that nuclear weapons were too powerful to use, it might have been realized.",
  "tags": [
    "war"
  ],
  "categories": [],
  "sitemap_lastmod": "2018-02-11T00:18:00+00:00"
}