{
  "url": "https://voxday.net/2018/02/16/excerpt-awake-in-the-night-land/",
  "scraped_at": "2025-12-19T10:43:35.774118",
  "title": "EXCERPT: Awake in the Night Land",
  "date_display": "February 16, 2018",
  "date_iso": "2018-02-16T01:21:30+00:00",
  "date_from_url": "2018-02-16",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p><i>This is a selection from John C. Wright’s incredible classic, <b><a href=\"http://amzn.to/29eLpuL\">AWAKE IN THE NIGHT LAND</a></b>. If you have not yet had the very great pleasure of reading it yet, you are fortunate indeed. Read the reviews, lest you think I exaggerate.</i></p><p>The monsters still howl for him, months after he fell. In the gloom, I can sometimes see one or the other, sometimes both together, wolfish beasts with leathery hides and dark bristles, and they raise their grinning, shark-like mouths to the black clouds above and utter their cries.</p><p>Impossible that such horrors could love a child of Man, and be faithful; impossible. Yet they do not molest the body, nor even approach it.</p><p>My brother Polynices lies in plain view on the baked black salt of the Night Land. The hollow where he fell has a smoke-hole in its center, some five yards beyond his motionless, outflung hand, and the smolder from the hole casts a light across his form.</p><p>He lies many miles below the armored windows of our redoubt, but even so, the spy-glasses and instruments of the Monstruwacans (those scholars whose business it is to watch the horrors of the Night) leaning from the balconies, can pick out minute details.</p><p>The fingers of his gauntlet are stretched out, as if he were reaching for the little warmth of the smoke hole as he perished. He lays on a slight incline, for a circle of salty mineral surrounds the smoke hole and slopes toward it. His boots are toward us. The smoke hole is to his left. His helmet fell from his head, and rolled a yard down the salty slope. The little trail the helmet made as it fell is still visible. There has been no wind, no earth tremors, to disturb the salt crystals and erode the trail. The haft and great wheel of his disk-ax weapon lay to his right, and the shadow of his body falls across it, making details difficult to make out, even under the immense magnifications of the Great Spy Glass. The hair I used to tousle has continued to grow as the months have passed, and now falls across the shoulder-plates of his armor and spills onto the salt. I cannot see those wild locks without wishing for my comb of nacre to put the tangles right. He was always careless of his appearance.</p><p>Because of the angle of his fall, I cannot make out his face. Did he die calmly? Or is a rictus of hollow terror and despair frozen forever on his features?</p><p>His right forearm is hidden under his body, as if his teeth were seeking the lethal capsule buried under the flesh of his forearm when he fell. Did he fall too swiftly to bite the capsule, and slay himself wholesomely, before his soul and spirit were Destroyed?</p><p>There is no blood visible. There is no sign of wounds.</p><p>When we were young, my brother and I found a long-deserted balcony lock, and from a previous life he remembered the word to open it.</p><p>He and I would climb through the broken armor of the window in one of the abandoned cities in the base level of the Pyramid. With fearless hearts and unsteady feet we would pick among the tilted slabs of imperishable metal, and find a little niche, about five hundred yards above the Night Land, open to the thin air and stinking fumes. We would sit with our lunch basket and spyglass on the corroded lip of some ancient corbel, our legs dangling and kicking above the smoke and darkness of the Land, and we would hear the voices of monsters muttering and hissing underfoot, see the glinting eyes of remote and cyclopean faces, or feel the dull throb of their malice beating against the sheath of energized air surrounding the Pyramid.</p><p>There was a series of irregular stairs leading down and down from a little ways below that spot, but we never dared to venture down.</p><p>I remember I wore short-pants then, like a boy’s. During my childhood, before I had a name, I was called Païs or Meirax, or something of the sort; the servants called me Annasa, of course.</p><p>Because my father was the Castellan, the nurses and tutors had no credible threat to make when I defied them, or tore my girlish pink bloomers to shreds. Later, when I was old enough to know what grief my antics caused my father, or what pleasure my father’s critics in the Opposition Seats, I dressed more demurely outwardly, though inwardly, I suppose, I was much the same.</p><p>From the steles we found on that hidden cleft, at the top of those forbidden stairs, we knew this place had been made by the Labdaciteans, great-grandfather’s people. The locks recognized our life-patterns, and called us by his name.</p><p>We knew the tale. Before even grandfather was born, Labdacus eroded the power of the Architects, by making climbing paths not shown on their charts, to run from window to window between the levels, that his loyal retainers might circumvent the blockades, when Architects cut power to the inter-municipal Doors, or grounded the great Lifts. Grandfather Laius, when he came of age, rose to preeminence on the promise that all such unlawful paths and places would be destroyed, and the Last Redoubt brought once more into honest conformity with the Great Central Survey of the Architectural Order.</p><p>As an adult, I know the horror of wondering if there is some gallery, portal, or open window, unwatched and unlocked against the subtle malice of the enemy, a hole a spider could wriggle through, or a crack to admit a weft. Even we, young as we were, were scandalized to see the breach of Labdacus. His crime was solid before our eyes, as plain to touch as the smooth hole cut in the armor. The massive, ill-made blocks of crooked stair lead down from it as a blood trail leads down from a wound. But it was a pleasing scandal, and our fear made us grin sickly grins, for it was our great-grandfather who had committed, not a petty crime, but a great one.</p><p>We promised each other we would never do anything so wicked as meddle with the walls and wards by which Man lives.</p><p>But we were also pleased to have a secret known to none, a place only those of the blood of Labdacus could pass. We considered our promise fulfilled by vowing to tell no one of our find. The idea that we should have immediately sent for the Architects, or the local Officer of the Watch, never crossed our young minds.</p><p>We were the children of the Castellan, after all.</p><p>Not long after my age of majority, not long after my father’s death and the ascension of Creon to power, I came to tread these same broken slabs of ancient metal again.</p><p>This time, my footsteps were not as sure as a thoughtless child’s would have been, nor was my costume as suited for the adventure. I wore a skirt to my ankles and a blouse buttoned to my throat, and my hair was pinned up and coiffed in a fashion I envied when it was forbidden to me, but which was now a bother to dress and maintain. My gloves clutched the corroded wall as I inched in my foolishly heeled shoes across the sloping face of the armor, a dizzying drop to the lands of darkness opening up behind and below my bustle.</p><p>The child I had been would not have known me. Païs had been so unafraid, and I was so fearful now.<br>Once only I looked over my shoulder. In the light of a recent volcano, I could glimpse the tall shadows of two kiln-giants, their heads together as if in consultation. One of them raised a heavy hand and pointed at me, while its lamp-eyed companion nodded. This unnerved me, so I clutched the metal beneath my gloves more firmly, and returned my eyes to the task.</br></p><p>I made it around the last turn and came with relief to the sturdier footing and broader step of the ancient and unused corbel.</p><p>Polynices was in his armor, standing where once he’d lunched as a child. The long handle of his disk-ax weapon was in his hand, and he leaned upon it in an attitude of alertness, his head staring down at the darkened Land.</p><p>He was listening.</p><p>Up from the gloom underfoot came the mournful, haunting sound of a Night-Hound, baying.<br>Having found his hiding place, I did not wish to speak, lest I startle him. I had the mental image of him dropping his Diskos over the side, or, worse, himself.</br></p><p>He said, “Rightly or wrongly, the dogs are mine, and I must feed them.”</p><p>I said quietly, “They are monsters. They are howling because they thirst for your blood, not because they love you.”</p><p>Polynices shook his head grimly, not bothering to look back at me. “Draego saved my life from the Abhumans. I fed him from my hand, and he knows not how to eat from any other. See! Even now he will not hunt among the crags and chasms of the Night Land, or worry pale flesh of slug-things from their lightless holes or blind fish from poisoned lakes. He starves, and stands before the gates of the Last Redoubt, and howls his love and sorrow for me. Dracaina is often with him, and joins her weeping voice to his.”</p><p>“Monsters. Do you not understand the word? Enemies of Man.”</p><p>“Not these. Love can break even the power of the Night. My dogs are my friends.”</p><p>“They are not dogs! They are Night-Hounds!”</p><p>He said nothing, but listened to the mournful howling of the monsters far below.</p><p>On and on they wailed. Once, both Night-Hounds fell silent, when the Great Laughter began to issue from a buried country to the east, a deep trench whose upper crumbling banks are visible from the Last Redoubt. Another time, the Hounds were silenced again when a deep and monstrous Voice from a cold volcano cone called out in a long-forgotten language, uttering a rough shout that traveled and echoed across the Night Land like a clap of thunder, traveling away to the North. The Night-Hounds were hushed for a while, perhaps cowering in terror, but then their howling and lamenting began again.</p><p>“I had a dream that you would die.” I told him.</p><p>He said, “I will find a way to smuggle food out to them. I do not fear the law.”</p><p>The Great Laughter issued from the eastern hills and canyons at that moment, trembling across the strange and barren landscapes of the Night, and this seemed a fitter answer than anything I could devise.</p></div>",
  "content_text": "This is a selection from John C. Wright’s incredible classic,\nAWAKE IN THE NIGHT LAND\n. If you have not yet had the very great pleasure of reading it yet, you are fortunate indeed. Read the reviews, lest you think I exaggerate.\nThe monsters still howl for him, months after he fell. In the gloom, I can sometimes see one or the other, sometimes both together, wolfish beasts with leathery hides and dark bristles, and they raise their grinning, shark-like mouths to the black clouds above and utter their cries.\nImpossible that such horrors could love a child of Man, and be faithful; impossible. Yet they do not molest the body, nor even approach it.\nMy brother Polynices lies in plain view on the baked black salt of the Night Land. The hollow where he fell has a smoke-hole in its center, some five yards beyond his motionless, outflung hand, and the smolder from the hole casts a light across his form.\nHe lies many miles below the armored windows of our redoubt, but even so, the spy-glasses and instruments of the Monstruwacans (those scholars whose business it is to watch the horrors of the Night) leaning from the balconies, can pick out minute details.\nThe fingers of his gauntlet are stretched out, as if he were reaching for the little warmth of the smoke hole as he perished. He lays on a slight incline, for a circle of salty mineral surrounds the smoke hole and slopes toward it. His boots are toward us. The smoke hole is to his left. His helmet fell from his head, and rolled a yard down the salty slope. The little trail the helmet made as it fell is still visible. There has been no wind, no earth tremors, to disturb the salt crystals and erode the trail. The haft and great wheel of his disk-ax weapon lay to his right, and the shadow of his body falls across it, making details difficult to make out, even under the immense magnifications of the Great Spy Glass. The hair I used to tousle has continued to grow as the months have passed, and now falls across the shoulder-plates of his armor and spills onto the salt. I cannot see those wild locks without wishing for my comb of nacre to put the tangles right. He was always careless of his appearance.\nBecause of the angle of his fall, I cannot make out his face. Did he die calmly? Or is a rictus of hollow terror and despair frozen forever on his features?\nHis right forearm is hidden under his body, as if his teeth were seeking the lethal capsule buried under the flesh of his forearm when he fell. Did he fall too swiftly to bite the capsule, and slay himself wholesomely, before his soul and spirit were Destroyed?\nThere is no blood visible. There is no sign of wounds.\nWhen we were young, my brother and I found a long-deserted balcony lock, and from a previous life he remembered the word to open it.\nHe and I would climb through the broken armor of the window in one of the abandoned cities in the base level of the Pyramid. With fearless hearts and unsteady feet we would pick among the tilted slabs of imperishable metal, and find a little niche, about five hundred yards above the Night Land, open to the thin air and stinking fumes. We would sit with our lunch basket and spyglass on the corroded lip of some ancient corbel, our legs dangling and kicking above the smoke and darkness of the Land, and we would hear the voices of monsters muttering and hissing underfoot, see the glinting eyes of remote and cyclopean faces, or feel the dull throb of their malice beating against the sheath of energized air surrounding the Pyramid.\nThere was a series of irregular stairs leading down and down from a little ways below that spot, but we never dared to venture down.\nI remember I wore short-pants then, like a boy’s. During my childhood, before I had a name, I was called Païs or Meirax, or something of the sort; the servants called me Annasa, of course.\nBecause my father was the Castellan, the nurses and tutors had no credible threat to make when I defied them, or tore my girlish pink bloomers to shreds. Later, when I was old enough to know what grief my antics caused my father, or what pleasure my father’s critics in the Opposition Seats, I dressed more demurely outwardly, though inwardly, I suppose, I was much the same.\nFrom the steles we found on that hidden cleft, at the top of those forbidden stairs, we knew this place had been made by the Labdaciteans, great-grandfather’s people. The locks recognized our life-patterns, and called us by his name.\nWe knew the tale. Before even grandfather was born, Labdacus eroded the power of the Architects, by making climbing paths not shown on their charts, to run from window to window between the levels, that his loyal retainers might circumvent the blockades, when Architects cut power to the inter-municipal Doors, or grounded the great Lifts. Grandfather Laius, when he came of age, rose to preeminence on the promise that all such unlawful paths and places would be destroyed, and the Last Redoubt brought once more into honest conformity with the Great Central Survey of the Architectural Order.\nAs an adult, I know the horror of wondering if there is some gallery, portal, or open window, unwatched and unlocked against the subtle malice of the enemy, a hole a spider could wriggle through, or a crack to admit a weft. Even we, young as we were, were scandalized to see the breach of Labdacus. His crime was solid before our eyes, as plain to touch as the smooth hole cut in the armor. The massive, ill-made blocks of crooked stair lead down from it as a blood trail leads down from a wound. But it was a pleasing scandal, and our fear made us grin sickly grins, for it was our great-grandfather who had committed, not a petty crime, but a great one.\nWe promised each other we would never do anything so wicked as meddle with the walls and wards by which Man lives.\nBut we were also pleased to have a secret known to none, a place only those of the blood of Labdacus could pass. We considered our promise fulfilled by vowing to tell no one of our find. The idea that we should have immediately sent for the Architects, or the local Officer of the Watch, never crossed our young minds.\nWe were the children of the Castellan, after all.\nNot long after my age of majority, not long after my father’s death and the ascension of Creon to power, I came to tread these same broken slabs of ancient metal again.\nThis time, my footsteps were not as sure as a thoughtless child’s would have been, nor was my costume as suited for the adventure. I wore a skirt to my ankles and a blouse buttoned to my throat, and my hair was pinned up and coiffed in a fashion I envied when it was forbidden to me, but which was now a bother to dress and maintain. My gloves clutched the corroded wall as I inched in my foolishly heeled shoes across the sloping face of the armor, a dizzying drop to the lands of darkness opening up behind and below my bustle.\nThe child I had been would not have known me. Païs had been so unafraid, and I was so fearful now.\nOnce only I looked over my shoulder. In the light of a recent volcano, I could glimpse the tall shadows of two kiln-giants, their heads together as if in consultation. One of them raised a heavy hand and pointed at me, while its lamp-eyed companion nodded. This unnerved me, so I clutched the metal beneath my gloves more firmly, and returned my eyes to the task.\nI made it around the last turn and came with relief to the sturdier footing and broader step of the ancient and unused corbel.\nPolynices was in his armor, standing where once he’d lunched as a child. The long handle of his disk-ax weapon was in his hand, and he leaned upon it in an attitude of alertness, his head staring down at the darkened Land.\nHe was listening.\nUp from the gloom underfoot came the mournful, haunting sound of a Night-Hound, baying.\nHaving found his hiding place, I did not wish to speak, lest I startle him. I had the mental image of him dropping his Diskos over the side, or, worse, himself.\nHe said, “Rightly or wrongly, the dogs are mine, and I must feed them.”\nI said quietly, “They are monsters. They are howling because they thirst for your blood, not because they love you.”\nPolynices shook his head grimly, not bothering to look back at me. “Draego saved my life from the Abhumans. I fed him from my hand, and he knows not how to eat from any other. See! Even now he will not hunt among the crags and chasms of the Night Land, or worry pale flesh of slug-things from their lightless holes or blind fish from poisoned lakes. He starves, and stands before the gates of the Last Redoubt, and howls his love and sorrow for me. Dracaina is often with him, and joins her weeping voice to his.”\n“Monsters. Do you not understand the word? Enemies of Man.”\n“Not these. Love can break even the power of the Night. My dogs are my friends.”\n“They are not dogs! They are Night-Hounds!”\nHe said nothing, but listened to the mournful howling of the monsters far below.\nOn and on they wailed. Once, both Night-Hounds fell silent, when the Great Laughter began to issue from a buried country to the east, a deep trench whose upper crumbling banks are visible from the Last Redoubt. Another time, the Hounds were silenced again when a deep and monstrous Voice from a cold volcano cone called out in a long-forgotten language, uttering a rough shout that traveled and echoed across the Night Land like a clap of thunder, traveling away to the North. The Night-Hounds were hushed for a while, perhaps cowering in terror, but then their howling and lamenting began again.\n“I had a dream that you would die.” I told him.\nHe said, “I will find a way to smuggle food out to them. I do not fear the law.”\nThe Great Laughter issued from the eastern hills and canyons at that moment, trembling across the strange and barren landscapes of the Night, and this seemed a fitter answer than anything I could devise.",
  "tags": [
    "Excerpts"
  ],
  "categories": [],
  "sitemap_lastmod": "2018-02-16T01:21:30+00:00"
}