{
  "url": "https://voxday.net/2018/02/07/excerpt-hitler-in-hell/",
  "scraped_at": "2025-12-19T10:42:27.754883",
  "title": "EXCERPT: Hitler in Hell",
  "date_display": "February 7, 2018",
  "date_iso": "2018-02-07T01:50:18+00:00",
  "date_from_url": "2018-02-07",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p><i>This is an excerpt from <b><a href=\"http://amzn.to/2u1kg8A\">HITLER IN HELL</a></b> by Martin Van Creveld. We expect the hardcover edition to be available in March.</i></p><p>If the years 1919-22 were bad for Germany, 1923 in many ways was much worse. Our poor country was reeling from the aftereffects of the largest, bloodiest war in history until then. To top it all, our enemies were plundering our exhausted people for all they were (not) worth. In December 1922 the German government, forced by necessity, defaulted on a payment of 135,000 meters of telegraph poles. That, nota bene, is almost enough to cover the entire distance from Magdeburg to Berlin or from Philadelphia to New York. In the next month the French and Belgian governments used this fact as an excuse to send in troops to occupy the Ruhr, our most important industrial district by far. On their way they killed approximately 130 German civilians who dared protest. Military resistance was impossible; after all, we no longer had an army. Instead, a general strike was proclaimed.</p><p>The occupation did not pass without impacting the rest of the country. Before the war, the mark had been valued at 4.20 to the dollar. By the end of 1919 the figure stood at 32, rising to 800 two and a half years later. With the occupation of the Ruhr all attempts to slow the fall came to a halt. In November 1923 4,210,500,000 marks were needed to buy a single dollar. Countless decent people who had worked and saved all their lives were ruined. So fast did the cost of living index rise that, as noon came, weekly wages paid in the morning no longer sufficed to buy a loaf of bread at noon. People used bank billets to cover their walls or to kindle their hearths. Unable to trust the Reich, many communities started printing their own Notgeld, or emergency money. It took the form of printed bills and cardboard “coins” (many were quite humorous, by the way).</p><p>But there was nothing funny about large numbers of people who lost their jobs, froze, starved, and were forced to resort to barter in order to survive. Amidst all this misery a few souls were fortunate enough to have foreign currency. Native or foreign, they spent pennies while living like kings at the expense of all the rest.</p><p>Economic collapse was accompanied by artistic degeneration. The so-called avant-gardists of 1914 had become the heroes of the day. They called themselves rebels. Rebels, that is, against everything wholesome, healthy, and clean. They attacked the existing social order, covering both Munich and other cities with their filth. Sculptors, dramatists, and musicians, who imitated the American Negro “music” known as jazz, participated in the orgy. Decent citizens, decent Germans, could no longer recognize their own cities. It made me feel sick then just as, looking at the hordes of criminal “refugees” who are again flooding Germany, it does right now.</p><p>That, in turn, contributed to, though it certainly did not cause, the prevailing civil unrest. Wherever one looked troops were being made ready, arms stored, and conspiracies hatched. Some originated on the Left, others on the Right. What ought to be done no one knew. That something would have to be done everyone knew or thought he knew. The man to whom most people looked in this context was, once again, Ludendorff. As early as February 1919 he was able to return from Sweden, where he had gone after the armistice. Now he lived in Munich, where every sort of right-wing movement did its best to harness him to its cart. It was Hess who, in 1921, introduced me to him. He was, however, no longer the man he had been. One problem was his friend, and subsequent second wife, Mathilde. A feminist she was (she believed the future would prove that men and women were equal, intellectually), as well as a trained mad-doctor and self-appointed philosopher. Dressed in a sort of chiffon tent, she made a strange spectacle. But that did not prevent him from accepting her and allowing her to (mis)lead him into all sorts of bizarre directions.</p><p>Another more important one was that Herr General Ludendorff, like so many German officers, was very bad at politics. He was too rigid and too concerned about his personal honor as a one-time Feldherr. His name was useful and brought us some supporters. But not many. After all, he was a Prussian. And in Bavaria Saupreussen, “Swinish Prussians,” were not exactly beloved.</p><p>Ludendorff or no Ludendorff, amidst the general chaos our Party flourished. By the end of 1923 we had 55,000 registered members. Early in September, joining forces with some veteran organizations, we were even able to hold a rally attended by 100,000 people, no less. Scant wonder I was becoming known, quite rightly, as “the king of Munich.” Then and later, we differed from the traditional parties in that we turned to, and succeeded in attracting, people from every class of the population. By my estimate, about a third were workers. They were rough men—I shall say more about the women later—equipped with hard fists they were quite ready to use when necessary. About half came from a petite bourgeoisie background; craftsmen, shopkeepers, teachers, white-collar employees, and farmers. And somewhat more than a tenth belonged to the upper middle and professional classes.</p><p>Prominent among the last-named was Herman Göring. Göring was the son of the first governor of German West Africa. He had grown up in a castle, Burg Mauterndorf, not far from Salzburg. Ex-fighter pilot, war hero, and holder of the Pour le Mérite, he had ties with “high society” that proved very useful to us. Later on he became my deputy in all but name. We even had a few real blue-blooded aristocrats. If there were proportionally fewer of them than in the general population, then that was due to the fact that, as a rule, I did not like them much. The best-known one was our future youth leader and Gauleiter of Vienna, Baldur von Shirach. Another was Count Wolf-Heinrich von Heldorf, the Berlin chief of police who was later involved in the plot of 20 July 1944 and whom we hanged for his pains.</p><p>Who first suggested the idea of mounting a Putsch I can no longer remember. Nor does it matter since in the end it was I, and I alone, who took responsibility and gave the relevant orders. The Bavarian Prime Minister at this time was Eugen von Knilling, a civil servant and parliamentarian who had long served the Wittelsbach Dynasty. He, in turn, appointed Gustav von Kahr General State Commissar with near dictatorial powers. Those powers he could, and intended to, use to put down any kind of civil unrest. To help him do so the government in Berlin put the Reichswehr units in Bavaria, with General Otto von Lossow at their head, at his disposal. Colonel Hans von Seisser, who commanded the powerful Bavarian State police, was the third member of the unholy trio.</p><p>Lossow had a reputation for being a “strong man” who would mercilessly crush any opposition he met. True to his image, one of the first things he did was to ban fourteen meetings we had planned for the evening of 27 September. This was a move we National Socialists simply could not take lying down. My close collaborators, including both Scheubner-Richter and the commander of the fledgling SA, Wilhelm Brückner, told me their men were calling for action. But they might also, if nothing was done, turn their back on the Party and slink away. They might even go over to the Communists, who were very active at the time. Given the terrible economic climate, who could blame them if they did?</p><p>Our first plan, proposed by Rosenberg, was as follows. On Memorial Day, 4 November, a parade was going to be held. Among the participants would be an SA battalion, which was more or less all we had. To take the salute there would be Kahr and Crown Prince Rupprecht, who had commanded an army group during the war and was considered Bavaria’s number-one soldier, as well as several other high-ranking officers. We were going to make our faithful SA men assemble early so as to seize them. Next, it would be my task to approach them and persuade them to join us in marching on Berlin, toppling the government there, and setting up a new one. The SA men did in fact show up, only to find the guests of honor protected by a strong police force. There was nothing we could do except withdraw with our tails between our legs. So bad was the fiasco that our would-be targets never even realized that they had been targeted.</p><p>We fixed the next attempt for the night of 10 November. The date was chosen because it was a weekend when all officials would be at home and government would come to a halt. Again, however, our plans were frustrated when Kahr announced that he was going to hold a major speech two days earlier. Rumor had it that he was about to declare Bavaria’s independence from the Reich. That was something we could not allow to happen. So we moved the date forward to the night of 8 November.</p><p>The final meeting was held in Rosenberg’s house, but this time we took care not to let him participate in the planning. Instead, we had Captain Ernst Röhm. Röhm was a rough but very competent officer who had fought at Verdun, among other places. In one of those battles he had the upper part of his nose shot off. In 1923 he led a paramilitary organization known as the Reichskriegsflagge (Reich-War Banners).</p><p>Röhm’s connections in the Reichswehr proved invaluable to us. Cajoling and tricking his colleagues, he succeeded in obtaining sufficient arms and ammunition for his men and ours. We were even able to set up a heavy machine gun company under Göring. The total number of fighters was about 4,000, of whom 1,500 were SA men. The rest were provided by other organizations. Kahr’s speech was supposed to start at 20:00. The location was the Bürgerbräukeller, the largest of its kind in Munich. It offered enough room for 3,000 people.</p><p>When the evening came, the hall was packed to overflowing. In addition, many people, feeling that something dramatic was about to happen, gathered in the nearby streets. Kahr had been speaking in his lackluster way for half an hour when my special bodyguard, with Göring in charge, burst into the hall. Pandemonium broke out, and ere I could reach the podium, I had to mount a chair and fire my pistol into the air. That got their attention and quieted everyone down.</p><p>Making use of every ounce of drama at my disposal, I announced that the National Revolution had broken out.</p></div>",
  "content_text": "This is an excerpt from\nHITLER IN HELL\nby Martin Van Creveld. We expect the hardcover edition to be available in March.\nIf the years 1919-22 were bad for Germany, 1923 in many ways was much worse. Our poor country was reeling from the aftereffects of the largest, bloodiest war in history until then. To top it all, our enemies were plundering our exhausted people for all they were (not) worth. In December 1922 the German government, forced by necessity, defaulted on a payment of 135,000 meters of telegraph poles. That, nota bene, is almost enough to cover the entire distance from Magdeburg to Berlin or from Philadelphia to New York. In the next month the French and Belgian governments used this fact as an excuse to send in troops to occupy the Ruhr, our most important industrial district by far. On their way they killed approximately 130 German civilians who dared protest. Military resistance was impossible; after all, we no longer had an army. Instead, a general strike was proclaimed.\nThe occupation did not pass without impacting the rest of the country. Before the war, the mark had been valued at 4.20 to the dollar. By the end of 1919 the figure stood at 32, rising to 800 two and a half years later. With the occupation of the Ruhr all attempts to slow the fall came to a halt. In November 1923 4,210,500,000 marks were needed to buy a single dollar. Countless decent people who had worked and saved all their lives were ruined. So fast did the cost of living index rise that, as noon came, weekly wages paid in the morning no longer sufficed to buy a loaf of bread at noon. People used bank billets to cover their walls or to kindle their hearths. Unable to trust the Reich, many communities started printing their own Notgeld, or emergency money. It took the form of printed bills and cardboard “coins” (many were quite humorous, by the way).\nBut there was nothing funny about large numbers of people who lost their jobs, froze, starved, and were forced to resort to barter in order to survive. Amidst all this misery a few souls were fortunate enough to have foreign currency. Native or foreign, they spent pennies while living like kings at the expense of all the rest.\nEconomic collapse was accompanied by artistic degeneration. The so-called avant-gardists of 1914 had become the heroes of the day. They called themselves rebels. Rebels, that is, against everything wholesome, healthy, and clean. They attacked the existing social order, covering both Munich and other cities with their filth. Sculptors, dramatists, and musicians, who imitated the American Negro “music” known as jazz, participated in the orgy. Decent citizens, decent Germans, could no longer recognize their own cities. It made me feel sick then just as, looking at the hordes of criminal “refugees” who are again flooding Germany, it does right now.\nThat, in turn, contributed to, though it certainly did not cause, the prevailing civil unrest. Wherever one looked troops were being made ready, arms stored, and conspiracies hatched. Some originated on the Left, others on the Right. What ought to be done no one knew. That something would have to be done everyone knew or thought he knew. The man to whom most people looked in this context was, once again, Ludendorff. As early as February 1919 he was able to return from Sweden, where he had gone after the armistice. Now he lived in Munich, where every sort of right-wing movement did its best to harness him to its cart. It was Hess who, in 1921, introduced me to him. He was, however, no longer the man he had been. One problem was his friend, and subsequent second wife, Mathilde. A feminist she was (she believed the future would prove that men and women were equal, intellectually), as well as a trained mad-doctor and self-appointed philosopher. Dressed in a sort of chiffon tent, she made a strange spectacle. But that did not prevent him from accepting her and allowing her to (mis)lead him into all sorts of bizarre directions.\nAnother more important one was that Herr General Ludendorff, like so many German officers, was very bad at politics. He was too rigid and too concerned about his personal honor as a one-time Feldherr. His name was useful and brought us some supporters. But not many. After all, he was a Prussian. And in Bavaria Saupreussen, “Swinish Prussians,” were not exactly beloved.\nLudendorff or no Ludendorff, amidst the general chaos our Party flourished. By the end of 1923 we had 55,000 registered members. Early in September, joining forces with some veteran organizations, we were even able to hold a rally attended by 100,000 people, no less. Scant wonder I was becoming known, quite rightly, as “the king of Munich.” Then and later, we differed from the traditional parties in that we turned to, and succeeded in attracting, people from every class of the population. By my estimate, about a third were workers. They were rough men—I shall say more about the women later—equipped with hard fists they were quite ready to use when necessary. About half came from a petite bourgeoisie background; craftsmen, shopkeepers, teachers, white-collar employees, and farmers. And somewhat more than a tenth belonged to the upper middle and professional classes.\nProminent among the last-named was Herman Göring. Göring was the son of the first governor of German West Africa. He had grown up in a castle, Burg Mauterndorf, not far from Salzburg. Ex-fighter pilot, war hero, and holder of the Pour le Mérite, he had ties with “high society” that proved very useful to us. Later on he became my deputy in all but name. We even had a few real blue-blooded aristocrats. If there were proportionally fewer of them than in the general population, then that was due to the fact that, as a rule, I did not like them much. The best-known one was our future youth leader and Gauleiter of Vienna, Baldur von Shirach. Another was Count Wolf-Heinrich von Heldorf, the Berlin chief of police who was later involved in the plot of 20 July 1944 and whom we hanged for his pains.\nWho first suggested the idea of mounting a Putsch I can no longer remember. Nor does it matter since in the end it was I, and I alone, who took responsibility and gave the relevant orders. The Bavarian Prime Minister at this time was Eugen von Knilling, a civil servant and parliamentarian who had long served the Wittelsbach Dynasty. He, in turn, appointed Gustav von Kahr General State Commissar with near dictatorial powers. Those powers he could, and intended to, use to put down any kind of civil unrest. To help him do so the government in Berlin put the Reichswehr units in Bavaria, with General Otto von Lossow at their head, at his disposal. Colonel Hans von Seisser, who commanded the powerful Bavarian State police, was the third member of the unholy trio.\nLossow had a reputation for being a “strong man” who would mercilessly crush any opposition he met. True to his image, one of the first things he did was to ban fourteen meetings we had planned for the evening of 27 September. This was a move we National Socialists simply could not take lying down. My close collaborators, including both Scheubner-Richter and the commander of the fledgling SA, Wilhelm Brückner, told me their men were calling for action. But they might also, if nothing was done, turn their back on the Party and slink away. They might even go over to the Communists, who were very active at the time. Given the terrible economic climate, who could blame them if they did?\nOur first plan, proposed by Rosenberg, was as follows. On Memorial Day, 4 November, a parade was going to be held. Among the participants would be an SA battalion, which was more or less all we had. To take the salute there would be Kahr and Crown Prince Rupprecht, who had commanded an army group during the war and was considered Bavaria’s number-one soldier, as well as several other high-ranking officers. We were going to make our faithful SA men assemble early so as to seize them. Next, it would be my task to approach them and persuade them to join us in marching on Berlin, toppling the government there, and setting up a new one. The SA men did in fact show up, only to find the guests of honor protected by a strong police force. There was nothing we could do except withdraw with our tails between our legs. So bad was the fiasco that our would-be targets never even realized that they had been targeted.\nWe fixed the next attempt for the night of 10 November. The date was chosen because it was a weekend when all officials would be at home and government would come to a halt. Again, however, our plans were frustrated when Kahr announced that he was going to hold a major speech two days earlier. Rumor had it that he was about to declare Bavaria’s independence from the Reich. That was something we could not allow to happen. So we moved the date forward to the night of 8 November.\nThe final meeting was held in Rosenberg’s house, but this time we took care not to let him participate in the planning. Instead, we had Captain Ernst Röhm. Röhm was a rough but very competent officer who had fought at Verdun, among other places. In one of those battles he had the upper part of his nose shot off. In 1923 he led a paramilitary organization known as the Reichskriegsflagge (Reich-War Banners).\nRöhm’s connections in the Reichswehr proved invaluable to us. Cajoling and tricking his colleagues, he succeeded in obtaining sufficient arms and ammunition for his men and ours. We were even able to set up a heavy machine gun company under Göring. The total number of fighters was about 4,000, of whom 1,500 were SA men. The rest were provided by other organizations. Kahr’s speech was supposed to start at 20:00. The location was the Bürgerbräukeller, the largest of its kind in Munich. It offered enough room for 3,000 people.\nWhen the evening came, the hall was packed to overflowing. In addition, many people, feeling that something dramatic was about to happen, gathered in the nearby streets. Kahr had been speaking in his lackluster way for half an hour when my special bodyguard, with Göring in charge, burst into the hall. Pandemonium broke out, and ere I could reach the podium, I had to mount a chair and fire my pistol into the air. That got their attention and quieted everyone down.\nMaking use of every ounce of drama at my disposal, I announced that the National Revolution had broken out.",
  "tags": [
    "Excerpts"
  ],
  "categories": [],
  "sitemap_lastmod": "2018-02-07T01:50:18+00:00"
}