{
  "url": "https://voxday.net/2018/02/04/false-flag-at-the-super-bowl/",
  "scraped_at": "2025-12-19T10:42:02.574589",
  "title": "False flag at the Super Bowl?",
  "date_display": "February 4, 2018",
  "date_iso": "2018-02-04T13:51:31+00:00",
  "date_from_url": "2018-02-04",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>The fact that NFL security is in the hands of the woman who botched the Seth Rich murder investigation is not exactly confidence inspiring. On the other hand, perhaps we can hope that Roger Goodell knows something about Hillary Clinton.</p><div class=\"separator\" style=\"clear: both; text-align: center;\"><a href=\"https://pbs.twimg.com/media/DVLC9HoU0AAEYP7.jpg:large\" imageanchor=\"1\" style=\"margin-left: 1em; margin-right: 1em;\"><img border=\"0\" data-original-height=\"545\" data-original-width=\"800\" decoding=\"async\" fetchpriority=\"high\" height=\"272\" src=\"https://pbs.twimg.com/media/DVLC9HoU0AAEYP7.jpg:large\" width=\"400\"/></a></div><p>Let’s face it, if the sort of people who arrange these false flags ever did decide to put on a show at the Super Bowl, you know they would prefer to do it in Minneapolis or some other flyover city that they couldn’t tell you is in Indiana, Minnesota, or Nebraska. And given how much trouble the Deep State appears to be in, it would be astonishing if they didn’t wave a few false flags in the next month or two in order to “prove” to the American people how the corrupt federal agencies are keeping them safe and how important it is that faith in these massive, unaccountable secret organizations <a href=\"https://politics.theonion.com/fbi-warns-republican-memo-could-undermine-faith-in-mass-1822639681\">not be undermined</a>.</p><p>Seriously, though, what is with all of these Clintonistas in positions of corporate power at entertainment industry companies like Warner Bros, DC Comics, and the NFL?</p></div>",
  "content_text": "The fact that NFL security is in the hands of the woman who botched the Seth Rich murder investigation is not exactly confidence inspiring. On the other hand, perhaps we can hope that Roger Goodell knows something about Hillary Clinton.\nLet’s face it, if the sort of people who arrange these false flags ever did decide to put on a show at the Super Bowl, you know they would prefer to do it in Minneapolis or some other flyover city that they couldn’t tell you is in Indiana, Minnesota, or Nebraska. And given how much trouble the Deep State appears to be in, it would be astonishing if they didn’t wave a few false flags in the next month or two in order to “prove” to the American people how the corrupt federal agencies are keeping them safe and how important it is that faith in these massive, unaccountable secret organizations\nnot be undermined\n.\nSeriously, though, what is with all of these Clintonistas in positions of corporate power at entertainment industry companies like Warner Bros, DC Comics, and the NFL?",
  "tags": [
    "sports"
  ],
  "categories": [],
  "sitemap_lastmod": "2018-02-04T13:51:31+00:00"
}