{
  "url": "https://voxday.net/2018/02/01/google-exec-threatens-whistleblowers/",
  "scraped_at": "2025-12-19T10:41:37.246494",
  "title": "Google exec threatens whistleblowers",
  "date_display": "February 1, 2018",
  "date_iso": "2018-02-01T21:18:09+00:00",
  "date_from_url": "2018-02-01",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>Urs Hölzle, Senior Vice President at Google, <a href=\"http://dailycaller.com/2018/01/31/google-exec-threatens-whistleblowers/\">is determined</a> to hunt down every employee who isn’t 100 percent SJW-converged.</p><blockquote><p>Sometimes, like yesterday, I am…saddened? taken aback? disgusted? by the thought that there are Googlers coming to work filled with gate towards their colleagues. I’m not even sure what adjective to use….but it’s sad. No matter the topic, there’s just no room for hate at Google.</p><p>But then again, I remind myself that 99.99{f34b2ed14022567e3962d98ceb517f14c2acb643b80147bdb11c1357fe49acc6} of our colleagues do not fall into that group, and that we can’t let a small fraction of employees dominate our thoughts, feelings, and culture. That makes me hopeful that we can overcome the attempts to create a culture of hate and fear.</p><p>But that is little comfort to the Googlers who are being doxxed or harassed. I hope we will identify those behind this reprehensible conduct. All Googlers are responsible for upholding a workplace and culture that is free of harassment, discrimination, misconduct, bullying, and retaliation.</p></blockquote><p>So tragic, all these gate-filled Googlers. Of course, if Google wants to uphold a workplace free of harassment, discrimination, misconduct, bullying, and retaliation, the very first person they should fire is Urs Hölzle. The man is a genuinely nasty little thought-Nazi, full of the very worst kinds of gate.</p><div class=\"separator\" style=\"clear: both; text-align: center;\"><a href=\"https://gallery.mailchimp.com/a6f8e769979ec2637baadac27/images/569ffee1-5fec-4f00-8819-a1629a9bce8a.jpg\" imageanchor=\"1\" style=\"margin-left: 1em; margin-right: 1em;\"><noscript><img border=\"0\" data-original-height=\"320\" data-original-width=\"512\" decoding=\"async\" src=\"https://gallery.mailchimp.com/a6f8e769979ec2637baadac27/images/569ffee1-5fec-4f00-8819-a1629a9bce8a.jpg\"/></noscript><img border=\"0\" class=\"lazyload\" data-original-height=\"320\" data-original-width=\"512\" data-src=\"https://gallery.mailchimp.com/a6f8e769979ec2637baadac27/images/569ffee1-5fec-4f00-8819-a1629a9bce8a.jpg\" decoding=\"async\" src=\"data:image/svg+xml,%3Csvg%20xmlns=%22http://www.w3.org/2000/svg%22%20viewBox=%220%200%20512%20320%22%3E%3C/svg%3E\"/></a></div><p>Urs, did you really not realize that <i>everything</i> that passes through your corporate communication system gets leaked outside now? Just because outsiders don’t post very much of it doesn’t mean they don’t have it. You see, even your employees who are on the Left are totally freaked out by their legitimate concerns about what sort of insanity you lunatic SJWs are going to get up to next. They know it’s only a matter of time before you go after them as well. Once you root out the evil 0.01 percent, it’s on to the next 0.1 percent <i>undsoweiter</i>.</p><p>Sure, you’ve got access to all our emails and our browser histories. We know that. But are you absolutely certain<i> that we don’t have yours? </i>Beware the many heads of the Medusa!<br><i><br/></i>By the way, <i>Wired</i>‘s Nitasha Tika denied coordinating her story, which SJWS at Google are circulating inside the company to try to intimidate suspected whistleblowers, with Jessica Guynn of <i>USA Today</i>. Just another one of those mysterious coincidences that seem to happen *COUGHGAMEJOURNOPROS* from time to time whenever SJW interests intersect, right? Actually, she is telling the truth, because it was a very small group of Google-SJWs coordinating their defense by press who were responsible for the near-simultaneous appearance of the articles.</br></p><p>Amateur effort, really. Even the SJWs at Tor managed to drum up international coverage from <i>Entertainment Weekly</i> to the <i>New Zealand Herald</i> after we blew up the Hugos the first time. But, as we’ve learned, the grunts at Google aren’t nearly as smart as they think they are.</p><p>Speaking of which, this email made me laugh.</p><blockquote class=\"tr_bq\"><p>I think you meant Hydra not Medusa in your Google post.  The hydra was a multi headed serpent.  Medusa looked like a cross between Grendel’s mother and Hillary Clinton.</p></blockquote><p><a href=\"https://1.bp.blogspot.com/-dDfljcwvHGk/Wm2o5zsKpjI/AAAAAAAAC68/e-BPqRh34EMegZAFVmpuWxoLWkg5i_FlwCEwYBhgL/s1600/medusa.jpg\">You don’t say…. </a></p></div>",
  "content_text": "Urs Hölzle, Senior Vice President at Google,\nis determined\nto hunt down every employee who isn’t 100 percent SJW-converged.\nSometimes, like yesterday, I am…saddened? taken aback? disgusted? by the thought that there are Googlers coming to work filled with gate towards their colleagues. I’m not even sure what adjective to use….but it’s sad. No matter the topic, there’s just no room for hate at Google.\nBut then again, I remind myself that 99.99{f34b2ed14022567e3962d98ceb517f14c2acb643b80147bdb11c1357fe49acc6} of our colleagues do not fall into that group, and that we can’t let a small fraction of employees dominate our thoughts, feelings, and culture. That makes me hopeful that we can overcome the attempts to create a culture of hate and fear.\nBut that is little comfort to the Googlers who are being doxxed or harassed. I hope we will identify those behind this reprehensible conduct. All Googlers are responsible for upholding a workplace and culture that is free of harassment, discrimination, misconduct, bullying, and retaliation.\nSo tragic, all these gate-filled Googlers. Of course, if Google wants to uphold a workplace free of harassment, discrimination, misconduct, bullying, and retaliation, the very first person they should fire is Urs Hölzle. The man is a genuinely nasty little thought-Nazi, full of the very worst kinds of gate.\nUrs, did you really not realize that\neverything\nthat passes through your corporate communication system gets leaked outside now? Just because outsiders don’t post very much of it doesn’t mean they don’t have it. You see, even your employees who are on the Left are totally freaked out by their legitimate concerns about what sort of insanity you lunatic SJWs are going to get up to next. They know it’s only a matter of time before you go after them as well. Once you root out the evil 0.01 percent, it’s on to the next 0.1 percent\nundsoweiter\n.\nSure, you’ve got access to all our emails and our browser histories. We know that. But are you absolutely certain\nthat we don’t have yours?\nBeware the many heads of the Medusa!\nBy the way,\nWired\n‘s Nitasha Tika denied coordinating her story, which SJWS at Google are circulating inside the company to try to intimidate suspected whistleblowers, with Jessica Guynn of\nUSA Today\n. Just another one of those mysterious coincidences that seem to happen *COUGHGAMEJOURNOPROS* from time to time whenever SJW interests intersect, right? Actually, she is telling the truth, because it was a very small group of Google-SJWs coordinating their defense by press who were responsible for the near-simultaneous appearance of the articles.\nAmateur effort, really. Even the SJWs at Tor managed to drum up international coverage from\nEntertainment Weekly\nto the\nNew Zealand Herald\nafter we blew up the Hugos the first time. But, as we’ve learned, the grunts at Google aren’t nearly as smart as they think they are.\nSpeaking of which, this email made me laugh.\nI think you meant Hydra not Medusa in your Google post.  The hydra was a multi headed serpent.  Medusa looked like a cross between Grendel’s mother and Hillary Clinton.\nYou don’t say….",
  "tags": [
    "SJW"
  ],
  "categories": [],
  "sitemap_lastmod": "2018-02-01T21:18:09+00:00"
}