{
  "url": "https://voxday.net/2018/02/16/homeschool-or-die-part-345/",
  "scraped_at": "2025-12-19T10:43:37.265387",
  "title": "Homeschool or die, part 345",
  "date_display": "February 16, 2018",
  "date_iso": "2018-02-16T10:09:18+00:00",
  "date_from_url": "2018-02-16",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>Like clockwork, <a href=\"http://www.dailymail.co.uk/news/article-5397743/Florida-shooting-victims-mom-begs-Trump-act-guns.html\">the media is using the latest school shooting</a> to try to create an unlikely groundswell for unconstitutional federal gun control. And like every other time, it will completely fail to the point that even Democrats won’t actually push for it.</p><blockquote><p>The devastated mother of a 14-year-old girl killed in the Florida high mass shooting has unleashed on President Donald Trump, screaming for him to do something to prevent another massacre.</p><p>‘President Trump, please do something! Do something. Action! We need it now! These kids need safety now,’ a grieving Lori Alhadeff begged during a live CNN broadcast on Thursday.</p><p>As tears streamed down her face, Alhadeff told of how her daughter Alyssa was among the 17 shot dead at Marjory Stoneman Douglas High School on Wednesday. She glared into the cameras as she furiously demanded answers and urged Trump to take action on gun control.</p><p> Alyssa was among the 17 shot dead at Marjory Stoneman Douglas High School on Wednesday</p><p>‘How do we allow a gunman to come into our children’s school? How do they get through security? What security is there?’ she yelled.  ‘The gunman – a crazy person – just walks right into the school, knocks down the window of my child’s door and starts shooting. Shooting her! And killing her! I just spent the last two hours putting together the burial arrangements for my daughter’s funeral, who is 14. President Trump, you say what can you do? You can stop the guns from getting into these children’s hands. What can you do? You can do a lot! This is not fair to our families and our children to go to school and have to get killed!’</p></blockquote><p>While one has to make allowances for a distraught mother (assuming she is not a crisis actor, which is far from a certain assumption), the idea that the President of the USA can do anything to prevent people from shooting up schools is absurd. Why not simply have him ban poverty, drugs, and teenage pregnancy while he’s at it? It’s not like there is a law against murder or anything, right?</p><p>The truth is that there is only one solution to the problem of school shootings: homeschool.</p><p>Although not putting boys on psychotropic medications would probably help.</p><p>In the meantime, if the God-Emperor were cruel, he would use the heightened media scrutiny to challenge Democrats to publicly endorse strict gun control legislation. If Democrats are so concerned about school shootings and the American people are so desperate for gun control, why aren’t House and Senate Democrats doing anything about it? The answer is that the Democrats don’t want to be <i>completely </i>wiped out in the Congressional elections later this year.</p><p>And as long as the media is paying attention to guns, President Trump should take the opportunity to declare no gun control will ever be passed on his watch and that any state that does not respect the carry laws of other states will no longer receive federal highway funding. Such a forthright statement, and the massively popular response it would generate, would crush the gun control movement for a generation.</p><p>As for the possibility that the woman is a crisis actor, I have to say that the last sentence of the quote rings very, very false to me. I am a professional editor. I know poorly written dialogue when I see it. Also, actual mothers in distress don’t usually say things like “my child’s door”. I can’t say it’s fake with certainty, but I can certainly say it looks more than a little sketchy when read cold.</p><div style=\"text-align: left;\">And here we go again….</div><div style=\"text-align: center;\"></div><div style=\"text-align: center;\"><iframe allow=\"autoplay; encrypted-media\" allowfullscreen=\"\" frameborder=\"0\" height=\"284\" src=\"https://www.youtube.com/embed/LmRG-fVi1iE\" width=\"512\"></iframe></div></div>",
  "content_text": "Like clockwork,\nthe media is using the latest school shooting\nto try to create an unlikely groundswell for unconstitutional federal gun control. And like every other time, it will completely fail to the point that even Democrats won’t actually push for it.\nThe devastated mother of a 14-year-old girl killed in the Florida high mass shooting has unleashed on President Donald Trump, screaming for him to do something to prevent another massacre.\n‘President Trump, please do something! Do something. Action! We need it now! These kids need safety now,’ a grieving Lori Alhadeff begged during a live CNN broadcast on Thursday.\nAs tears streamed down her face, Alhadeff told of how her daughter Alyssa was among the 17 shot dead at Marjory Stoneman Douglas High School on Wednesday. She glared into the cameras as she furiously demanded answers and urged Trump to take action on gun control.\nAlyssa was among the 17 shot dead at Marjory Stoneman Douglas High School on Wednesday\n‘How do we allow a gunman to come into our children’s school? How do they get through security? What security is there?’ she yelled.  ‘The gunman – a crazy person – just walks right into the school, knocks down the window of my child’s door and starts shooting. Shooting her! And killing her! I just spent the last two hours putting together the burial arrangements for my daughter’s funeral, who is 14. President Trump, you say what can you do? You can stop the guns from getting into these children’s hands. What can you do? You can do a lot! This is not fair to our families and our children to go to school and have to get killed!’\nWhile one has to make allowances for a distraught mother (assuming she is not a crisis actor, which is far from a certain assumption), the idea that the President of the USA can do anything to prevent people from shooting up schools is absurd. Why not simply have him ban poverty, drugs, and teenage pregnancy while he’s at it? It’s not like there is a law against murder or anything, right?\nThe truth is that there is only one solution to the problem of school shootings: homeschool.\nAlthough not putting boys on psychotropic medications would probably help.\nIn the meantime, if the God-Emperor were cruel, he would use the heightened media scrutiny to challenge Democrats to publicly endorse strict gun control legislation. If Democrats are so concerned about school shootings and the American people are so desperate for gun control, why aren’t House and Senate Democrats doing anything about it? The answer is that the Democrats don’t want to be\ncompletely\nwiped out in the Congressional elections later this year.\nAnd as long as the media is paying attention to guns, President Trump should take the opportunity to declare no gun control will ever be passed on his watch and that any state that does not respect the carry laws of other states will no longer receive federal highway funding. Such a forthright statement, and the massively popular response it would generate, would crush the gun control movement for a generation.\nAs for the possibility that the woman is a crisis actor, I have to say that the last sentence of the quote rings very, very false to me. I am a professional editor. I know poorly written dialogue when I see it. Also, actual mothers in distress don’t usually say things like “my child’s door”. I can’t say it’s fake with certainty, but I can certainly say it looks more than a little sketchy when read cold.\nAnd here we go again….",
  "tags": [
    "guncontrol"
  ],
  "categories": [],
  "sitemap_lastmod": "2018-02-16T10:09:18+00:00"
}