{
  "url": "https://voxday.net/2018/02/04/ill-take-things-that-will-never-happen/",
  "scraped_at": "2025-12-19T10:41:58.150385",
  "title": "I’ll take “things that will never happen”",
  "date_display": "February 4, 2018",
  "date_iso": "2018-02-04T02:24:17+00:00",
  "date_from_url": "2018-02-04",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>It’s amusing to see SF-SJW Foz Meadows <a href=\"http://file770.com/?p=40357\">running around demanding apologies</a> from everyone who believed zher legal spouse is Camestros Felapton. Now, of course I can understand even such a visually repellent, talentless creature as Foz taking massive offense at being accused of having sufficiently low standards as to engage in any form of congress, be it marital or otherwise, with Felapton, but then, Foz is an unrepentant liar who doesn’t merit apologies from anyone for anything. Who gives a quantum of a damn what Foz wants, expects, appreciates, or demands?</p><blockquote><p>Foz Meadows@fozmeadows<br>Related to all the recent Puppy kerfuffle, I would like the record to note that @davefreersf, a self-professed Sad Puppy, has unequivocally admitted that siccing Vox Day on someone is a tactic meant to cause “serious harm” to the target.</br></p><p>Foz Meadows@fozmeadows<br>Replying to @fozmeadows<br>Like. There’s been so many occasions when I’ve had Sad Puppy acolytes in my mentions frothing about how VD and the Rabid Puppies are a TOTALLY DIFFERENT AND UNRELATED THING TO THEM and how DARE I suggest that the Sads be held in any way accountable for the Rabids!</br></br></p><p>Foz Meadows@fozmeadows<br>I would also like to note that while, as far as I know, Freer didn’t email VD about my husband being Camestros – a falsehood now acknowledged as such by @LouAntonelli – VD has nonetheless run with Freer and Antonelli’s original claims on his blog.</br></p><p>Foz Meadows@fozmeadows<br>Replying to @fozmeadows<br>I won’t subject anyone here to quotes from the salient comment thread on VD’s blog; sufficed to there’s a fucktonne of homophobic abuse directed at me, plus the odd wish for physical violence, and my husband’s workplace being disparaged as an institution. So, you know. The usual.</br></br></p><p>Foz Meadows@fozmeadows<br>What I will say is that, in the event Dave Freer *does* admit he was wrong &amp; that my husband isn’t Camestros, I won’t be accepting any apology he might make. His gross, homophobic speculation about my marriage &amp; identity, &amp; his slander of my husband, was always a separate issue.</br></p><p>Foz Meadows@fozmeadows<br>Replying to @fozmeadows<br>None of what Freer has said about my personal life is excused or justified by his belief that Toby is Camestros. It has literally nothing to do with anything, and not only has he doubled down on it multiple times, he has actively encouraged others to speculate, too.</br></br></p><p>Foz Meadows@fozmeadows<br>The only type of apology I’ll even *consider* accepting from Freer is one that involves an admission of homophobia, an acknowledgement that none of his personal comments were either correct or appropriate, and a pledge to actively educate himself. Anything less is meaningless.</br></p><p>Foz Meadows@fozmeadows<br>Replying to @fozmeadows<br>Regardless of whether he does that, however – and I rather suspect he won’t – the absolute fucking LEAST he can do, as per Antonelli, is to acknowledge that he was wrong in thinking Toby was Camestros, and to apologise TO EVERYONE for spreading the lie.</br></br></p><p>Foz Meadows@fozmeadows<br>I’d also appreciate a similar apology from Brad Torgersen. I have zero expectation of Vox Day doing anything remotely conciliatory or charitable, but I’ll do Torgersen the kindness of assuming him capable of admitting error.</br></p></blockquote><p>First of all, no one sics me on anyone. I act as I see fit. I am more than happy to publicly deride that wretched creature and I will continue to do so until zhe either a) dies or b) publicly retracts all of zher claims that I am a Nazi or other derivation thereof.</p><p>Second, I am confident that I speak for everyone when I say that I am truly and deeply relieved to hear that Foz Meadows is not married to Camestros Felaptron. Sweet St. Darwin, <i>what if those two had spawned? </i>The human race may be in genetic decline, but that’s one evolutionary branch we really don’t need to explore. Shades of Innsmouth, anyone?</p><p>Third, Dave Freer didn’t sic me on anyone about anything. I don’t recall having any communication with him in years. I just checked my email and I haven’t received even a single email from him since I set up my current machine in April 2016. Nor have I spoken to him.</p><p>But I require no apologies. Foz should instead be apologizing to the entire human gene pool for whatever horrific accident of evolution or malevolent fate led to zher existence.</p><p>UPDATE: <a href=\"http://file770.com/?p=40357#comment-774165\">This comment</a> at File 770 from Laura Resnick was particularly funny.</p><blockquote class=\"tr_bq\"><p>I took a look at the VD post and comments Ms. Meadows references… and, yep, I can see why she chose not to link to it. Very ugly and bigoted—gosh, contain your shocked surprise. And, as always, you could search high and low, far and wide, without finding people stupider than VD and his blog followers. The absence of intelligent life there seems almost scientifically astounding.</p></blockquote><p>Classic midwit posturing. Resnick is a mediocre fantasy writer who can’t even figure out how to stop stuffing <a href=\"http://www.lauraresnick.com/wp-content/uploads/2014/10/author-laura-resnick.jpg\">her fat face</a>, but that’s not going to stop her from trying to strike a laughable pose as an intellectual superior to literally everyone here.</p></div>",
  "content_text": "It’s amusing to see SF-SJW Foz Meadows\nrunning around demanding apologies\nfrom everyone who believed zher legal spouse is Camestros Felapton. Now, of course I can understand even such a visually repellent, talentless creature as Foz taking massive offense at being accused of having sufficiently low standards as to engage in any form of congress, be it marital or otherwise, with Felapton, but then, Foz is an unrepentant liar who doesn’t merit apologies from anyone for anything. Who gives a quantum of a damn what Foz wants, expects, appreciates, or demands?\nFoz Meadows@fozmeadows\nRelated to all the recent Puppy kerfuffle, I would like the record to note that @davefreersf, a self-professed Sad Puppy, has unequivocally admitted that siccing Vox Day on someone is a tactic meant to cause “serious harm” to the target.\nFoz Meadows@fozmeadows\nReplying to @fozmeadows\nLike. There’s been so many occasions when I’ve had Sad Puppy acolytes in my mentions frothing about how VD and the Rabid Puppies are a TOTALLY DIFFERENT AND UNRELATED THING TO THEM and how DARE I suggest that the Sads be held in any way accountable for the Rabids!\nFoz Meadows@fozmeadows\nI would also like to note that while, as far as I know, Freer didn’t email VD about my husband being Camestros – a falsehood now acknowledged as such by @LouAntonelli – VD has nonetheless run with Freer and Antonelli’s original claims on his blog.\nFoz Meadows@fozmeadows\nReplying to @fozmeadows\nI won’t subject anyone here to quotes from the salient comment thread on VD’s blog; sufficed to there’s a fucktonne of homophobic abuse directed at me, plus the odd wish for physical violence, and my husband’s workplace being disparaged as an institution. So, you know. The usual.\nFoz Meadows@fozmeadows\nWhat I will say is that, in the event Dave Freer *does* admit he was wrong & that my husband isn’t Camestros, I won’t be accepting any apology he might make. His gross, homophobic speculation about my marriage & identity, & his slander of my husband, was always a separate issue.\nFoz Meadows@fozmeadows\nReplying to @fozmeadows\nNone of what Freer has said about my personal life is excused or justified by his belief that Toby is Camestros. It has literally nothing to do with anything, and not only has he doubled down on it multiple times, he has actively encouraged others to speculate, too.\nFoz Meadows@fozmeadows\nThe only type of apology I’ll even *consider* accepting from Freer is one that involves an admission of homophobia, an acknowledgement that none of his personal comments were either correct or appropriate, and a pledge to actively educate himself. Anything less is meaningless.\nFoz Meadows@fozmeadows\nReplying to @fozmeadows\nRegardless of whether he does that, however – and I rather suspect he won’t – the absolute fucking LEAST he can do, as per Antonelli, is to acknowledge that he was wrong in thinking Toby was Camestros, and to apologise TO EVERYONE for spreading the lie.\nFoz Meadows@fozmeadows\nI’d also appreciate a similar apology from Brad Torgersen. I have zero expectation of Vox Day doing anything remotely conciliatory or charitable, but I’ll do Torgersen the kindness of assuming him capable of admitting error.\nFirst of all, no one sics me on anyone. I act as I see fit. I am more than happy to publicly deride that wretched creature and I will continue to do so until zhe either a) dies or b) publicly retracts all of zher claims that I am a Nazi or other derivation thereof.\nSecond, I am confident that I speak for everyone when I say that I am truly and deeply relieved to hear that Foz Meadows is not married to Camestros Felaptron. Sweet St. Darwin,\nwhat if those two had spawned?\nThe human race may be in genetic decline, but that’s one evolutionary branch we really don’t need to explore. Shades of Innsmouth, anyone?\nThird, Dave Freer didn’t sic me on anyone about anything. I don’t recall having any communication with him in years. I just checked my email and I haven’t received even a single email from him since I set up my current machine in April 2016. Nor have I spoken to him.\nBut I require no apologies. Foz should instead be apologizing to the entire human gene pool for whatever horrific accident of evolution or malevolent fate led to zher existence.\nUPDATE:\nThis comment\nat File 770 from Laura Resnick was particularly funny.\nI took a look at the VD post and comments Ms. Meadows references… and, yep, I can see why she chose not to link to it. Very ugly and bigoted—gosh, contain your shocked surprise. And, as always, you could search high and low, far and wide, without finding people stupider than VD and his blog followers. The absence of intelligent life there seems almost scientifically astounding.\nClassic midwit posturing. Resnick is a mediocre fantasy writer who can’t even figure out how to stop stuffing\nher fat face\n, but that’s not going to stop her from trying to strike a laughable pose as an intellectual superior to literally everyone here.",
  "tags": [
    "PinkSF"
  ],
  "categories": [],
  "sitemap_lastmod": "2018-02-04T02:24:17+00:00"
}