{
  "url": "https://voxday.net/2018/02/08/mailvox-the-deadly-high-end/",
  "scraped_at": "2025-12-19T10:42:37.212916",
  "title": "Mailvox: the deadly high end",
  "date_display": "February 8, 2018",
  "date_iso": "2018-02-08T01:29:50+00:00",
  "date_from_url": "2018-02-08",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>Just to be clear, I’m most definitely <u>NOT</u> singling out L’Aristokrato here. He is very, very far from the only person to blithely suggest going out and hiring other artists for our various comics, he just happens to be the individual to whom I responded on the subject. This is actually an important lesson in entrepreneurship concerning a very common misapprehension, so there is no need to get defensive or argumentative, just pay attention and think through what I’m telling everyone. My original response is in italics.</p><blockquote class=\"tr_bq\"><p>More importantly, however, I believe you need to look into getting at least one, or two high level artists as part of your crew.</p></blockquote><p><i>Your beliefs are absolutely wrong and indicate a complete lack of business experience. No one ever successfully disrupts a market from above. As a matter of fact, there is a new company that is going about it your way. Top artists, paying them all top page rates. I will bet they’re gone within 18 months of their first publication. Sure, you get more attention. Lots of critical praise. But it only lets you hit a double instead of a single, and you need to hit a home run just to stay afloat.</i></p><blockquote class=\"tr_bq\"><p>I’m not sure why you’ve taken my comment so personally as to feel the need to add a baseless jab at me, instead of simply pointing out why you think I’m wrong. Though your observation is amusing, considering both that you know nothing about me, and that I’ve created and owned several successful businesses for sixteen years. More to the point though, it’s true, I don’t know much about “disrupting a market”; That’s not an angle I’ve ever tried, or had to try, given the areas I work with, so it’s entirely likely my observation is incorrect.</p></blockquote><p>However, I didn’t take it personally. He just said something very, very stupid that I have heard dozens of people say since October. It is irritating and unasked-for advice, and it is frequently offered in a smug, knowing tone: “You know what you need to do…” No, I don’t fucking <i>need </i>to do that. To the contrary, following that idiotic advice would be fatal.</p><p>I have seen more than a few people, including my father, try to start a new business aimed at the high end of the market. Every single one of them failed. Not most of them, ALL of them. Every single one.</p><p>Now, L’Aristokrato may never have disrupted a market personally, but he has certainly seen new companies enter new markets throughout his life. When Honda entered the US car market, did they aim at the high end or the low end? How about Kia? When Diamond entered the video card market, did they come in as a low-cost provider or a high-end one? This is basic Business 102 stuff.</p><p>If you want to succeed in entering an existing market, the first and foremost objective <i>has to be</i> staying alive to play in the next round. And your ability to stay alive depends upon your resources. Sure, Mercedes can enter at the high end. So can Samsung. But a startup? No. See, we could have spent all the money from the Alt-Hero kickstarter on a single, beautiful, gold-plated 24-page issue using the most expensive artists we could hire. It would have been talked about and critically praised… and we would have gone out of business almost immediately.</p><p>Do you know how many pages of top-quality illustration $250,000 buys? 200 pages. And that’s without script, without color, without lettering, without print charges and without shipping. We are committed to producing 576 pages (990 with Will Caligan’s comics), and we have already finished the illustrations for about 80 of them.</p><p>Do. The. Math.</p><p>Look, I’m not at all sensitive about this and I’m not trying to be harsh. The problem is that this advice is not merely ill-considered and ignorant, it is downright <i>lethal</i>. If we were clueless enough to follow it, we would almost certainly fail. Unlike most people, I’ve actually seen this approach play out up close and personal. My father briefly published a magazine called <i>People &amp; Politics</i> in the 1980s. He spent lavishly on it. It was beautiful, it was the highest-quality political journalism anyone had ever seen at the time, it featured in-depth interviews with every major political player from both parties, and it was universally praised for its ruthlessly even-handed approach. It even sold well, remarkably well for a brand new local magazine.</p><p>But it didn’t sell enough to break even. Not even close. I don’t think it even lasted a year.</p><p>And then, I saw one low-end Taiwanese company after another enter the graphics board business. None of their products were even close to as good as my father’s cards. We kept retreating to the high end, from 1024 to 1280 to 1600 resolution. And our market share kept shrinking, until in desperation they tried to make a move into the chip market before the boards were replaced entirely by GPUs on the motherboard. It failed, for reasons that I’ve mentioned before. That company, once an $80 million company, has been dead for 20 years. That is why I know all about how markets are, and are not, successfully disrupted.</p><p>So we’re not trying to compete with Marvel, DC, Image, and everyone else on the art. We don’t have the resources for that yet. Sure, we want the art to be as good as we can make it, and that’s why I’ve hired a number of industry vets like Chuck, Frank, and others whose names you would recognize. But we’re not going to compete on the art, we’re going to compete on a) the characters, b) the storytelling, c) the worldbuilding, d) the price, and, e) discount and availability.</p><p>And, of course, we’re not going to shove the latest SJW Narrative in your face, unlike Batgirl, Superman, Thor, and whatever other comics have been converged lately. Will we succeed? Only time will tell. But if you want to give me advice, please have the courtesy to know what you are talking about, understand what the logical consequences are, and at the very least, <i>be sure that your numbers add up</i>.</p><p>In answer to some related questions from Scotty:</p><blockquote class=\"tr_bq\"><p>Why handicap a book with less appeal? Isn’t this part of the problem with SJW comics? Why not give it every strength and every advantage to increase success? You want to compete with Batman and Spider-man, right?</p></blockquote><ol><li>Cost vs expected sales.</li><li>No, that’s a totally different issue.</li><li>Because maximizing strengths and advantages means maximizing cost and maximizing risk. That is not how to maximize one’s chance of success.</li><li>Hell no! We absolutely don’t want to compete with Batman and Spider-man yet. We know we can’t. We want to compete with the comics that are in the #200 range, not the top 10.</li></ol></div>",
  "content_text": "Just to be clear, I’m most definitely\nNOT\nsingling out L’Aristokrato here. He is very, very far from the only person to blithely suggest going out and hiring other artists for our various comics, he just happens to be the individual to whom I responded on the subject. This is actually an important lesson in entrepreneurship concerning a very common misapprehension, so there is no need to get defensive or argumentative, just pay attention and think through what I’m telling everyone. My original response is in italics.\nMore importantly, however, I believe you need to look into getting at least one, or two high level artists as part of your crew.\nYour beliefs are absolutely wrong and indicate a complete lack of business experience. No one ever successfully disrupts a market from above. As a matter of fact, there is a new company that is going about it your way. Top artists, paying them all top page rates. I will bet they’re gone within 18 months of their first publication. Sure, you get more attention. Lots of critical praise. But it only lets you hit a double instead of a single, and you need to hit a home run just to stay afloat.\nI’m not sure why you’ve taken my comment so personally as to feel the need to add a baseless jab at me, instead of simply pointing out why you think I’m wrong. Though your observation is amusing, considering both that you know nothing about me, and that I’ve created and owned several successful businesses for sixteen years. More to the point though, it’s true, I don’t know much about “disrupting a market”; That’s not an angle I’ve ever tried, or had to try, given the areas I work with, so it’s entirely likely my observation is incorrect.\nHowever, I didn’t take it personally. He just said something very, very stupid that I have heard dozens of people say since October. It is irritating and unasked-for advice, and it is frequently offered in a smug, knowing tone: “You know what you need to do…” No, I don’t fucking\nneed\nto do that. To the contrary, following that idiotic advice would be fatal.\nI have seen more than a few people, including my father, try to start a new business aimed at the high end of the market. Every single one of them failed. Not most of them, ALL of them. Every single one.\nNow, L’Aristokrato may never have disrupted a market personally, but he has certainly seen new companies enter new markets throughout his life. When Honda entered the US car market, did they aim at the high end or the low end? How about Kia? When Diamond entered the video card market, did they come in as a low-cost provider or a high-end one? This is basic Business 102 stuff.\nIf you want to succeed in entering an existing market, the first and foremost objective\nhas to be\nstaying alive to play in the next round. And your ability to stay alive depends upon your resources. Sure, Mercedes can enter at the high end. So can Samsung. But a startup? No. See, we could have spent all the money from the Alt-Hero kickstarter on a single, beautiful, gold-plated 24-page issue using the most expensive artists we could hire. It would have been talked about and critically praised… and we would have gone out of business almost immediately.\nDo you know how many pages of top-quality illustration $250,000 buys? 200 pages. And that’s without script, without color, without lettering, without print charges and without shipping. We are committed to producing 576 pages (990 with Will Caligan’s comics), and we have already finished the illustrations for about 80 of them.\nDo. The. Math.\nLook, I’m not at all sensitive about this and I’m not trying to be harsh. The problem is that this advice is not merely ill-considered and ignorant, it is downright\nlethal\n. If we were clueless enough to follow it, we would almost certainly fail. Unlike most people, I’ve actually seen this approach play out up close and personal. My father briefly published a magazine called\nPeople & Politics\nin the 1980s. He spent lavishly on it. It was beautiful, it was the highest-quality political journalism anyone had ever seen at the time, it featured in-depth interviews with every major political player from both parties, and it was universally praised for its ruthlessly even-handed approach. It even sold well, remarkably well for a brand new local magazine.\nBut it didn’t sell enough to break even. Not even close. I don’t think it even lasted a year.\nAnd then, I saw one low-end Taiwanese company after another enter the graphics board business. None of their products were even close to as good as my father’s cards. We kept retreating to the high end, from 1024 to 1280 to 1600 resolution. And our market share kept shrinking, until in desperation they tried to make a move into the chip market before the boards were replaced entirely by GPUs on the motherboard. It failed, for reasons that I’ve mentioned before. That company, once an $80 million company, has been dead for 20 years. That is why I know all about how markets are, and are not, successfully disrupted.\nSo we’re not trying to compete with Marvel, DC, Image, and everyone else on the art. We don’t have the resources for that yet. Sure, we want the art to be as good as we can make it, and that’s why I’ve hired a number of industry vets like Chuck, Frank, and others whose names you would recognize. But we’re not going to compete on the art, we’re going to compete on a) the characters, b) the storytelling, c) the worldbuilding, d) the price, and, e) discount and availability.\nAnd, of course, we’re not going to shove the latest SJW Narrative in your face, unlike Batgirl, Superman, Thor, and whatever other comics have been converged lately. Will we succeed? Only time will tell. But if you want to give me advice, please have the courtesy to know what you are talking about, understand what the logical consequences are, and at the very least,\nbe sure that your numbers add up\n.\nIn answer to some related questions from Scotty:\nWhy handicap a book with less appeal? Isn’t this part of the problem with SJW comics? Why not give it every strength and every advantage to increase success? You want to compete with Batman and Spider-man, right?\nCost vs expected sales.\nNo, that’s a totally different issue.\nBecause maximizing strengths and advantages means maximizing cost and maximizing risk. That is not how to maximize one’s chance of success.\nHell no! We absolutely don’t want to compete with Batman and Spider-man yet. We know we can’t. We want to compete with the comics that are in the #200 range, not the top 10.",
  "tags": [
    "mailvox"
  ],
  "categories": [],
  "sitemap_lastmod": "2018-02-08T01:29:50+00:00"
}