{
  "url": "https://voxday.net/2018/02/26/max-boot-molts-again/",
  "scraped_at": "2025-12-19T10:44:59.106428",
  "title": "Max Boot molts again",
  "date_display": "February 26, 2018",
  "date_iso": "2018-02-26T14:12:56+00:00",
  "date_from_url": "2018-02-26",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>Fake (((conservative))) now <a href=\"https://archive.fo/wLMaE\">wants to pass himself off as a fake (((classical liberal)))</a> because Trump.</p><blockquote class=\"tr_bq\"><p>In the past I would have been indignant at such attacks and eager to assert my conservative credentials. I spent years writing for conservative publications such as the Wall Street Journal editorial page and Commentary magazine and working as a foreign policy adviser for three Republican presidential campaigns. Being conservative used to be central to my identity. But now, frankly, I don’t give a damn. I prefer to think of myself as a classical liberal, because “conservative” has become practically synonymous with “Trump lackey.”</p></blockquote><p>Like Richard Spencer, Max Boot is Fake Right. Boot was <u>never</u> a conservative in any sense whatsoever, not even in the Jewish religious sense. He is not even close to anything resembling a “classical liberal” either. What sort of “conservative” writes for the <i>Washington Post</i>?  These wormtongues speak as if words have literally no intrinsic meaning.</p><p>Remember, the neocons were communists who only turned against the Soviet Union in the 1960s when it became apparent that the USA would remain the dominant military power. From Infogalactic: <i>The term “neoconservative” refers to those who made the ideological journey from the anti-Stalinist left to the camp of American conservatism. The movement had its intellectual roots in the Jewish monthly review magazine Commentary, published by the American Jewish Committee.</i></p><p>That ideological journey was always a sham. These (((fill-in-the-blanks))) are parasitical snakes, shedding their ideological skins in order to maximize their political influence while always advocating globalism, war, and Israel no matter what they happen to call themselves at the moment. The (((Ben Shapiros))) and (((Mona Charens))) and (((Max Boots))) are nothing but interest-group infiltrators and media operatives. There is no truth in them, and they are finally being revealed for the enemies of America, Christianity, and the West that they have always been.</p><p>Speaking of parasitical snakes, look at how <a href=\"https://life.spectator.co.uk/2018/02/the-intellectual-dark-web/\">The Spectator tries to put Ben Shapiro in the “fearless freethinker” category</a> with Camille Paglia and Jordan Peterson. Notice how they featured him in the primary photo, even though he is almost the precise opposite of the philosophical, truth-seeking Peterson.</p><blockquote><p>Consider Ben Shapiro. The conservative pundit has become known over the past decade for his whippet-fast intellect and fearless debating style. College campuses began to see protests whenever this young conservative speaker was promised to appear. Far-leftist students repeatedly denounced the 34-year-old kippah-wearing Orthodox Jew as a racist and otherwise tried to silence him. Campuses promised students extra counselling to cope after hearing his arguments.</p><p>And last September, after earlier riots on campus, the University of Berkeley shelled out $600,000 to make the campus secure for his talk there. Again the audience tuned in for the scandal and stayed to hear his smart, funny and thoughtful opinions. Today he has more than a million Twitter followers and makes news whenever he speaks.</p></blockquote><p>The bit about his “fearless debating style” is particularly amusing considering how he has repeatedly run from debate with both Milo and myself. And the Littlest Chickenhawk isn’t part of “the intellectual dark web” at all. He has been nationally syndicated in the mainstream media <i>for nearly two decades</i>! To the contrary, he is part of the Fake Right along with Max Boot, Mona Charon, David Frum, Jon Podhoretz, Bill Kristol, Cathy Young, and the rest of the Never-Trump (((conservatives))). The media loves to anoint these fake “opinion leaders” in order to divert public attention away from the actual freethinkers, which is why they ignored Jordan Peterson until it was no longer possible to do so.</p></div>",
  "content_text": "Fake (((conservative))) now\nwants to pass himself off as a fake (((classical liberal)))\nbecause Trump.\nIn the past I would have been indignant at such attacks and eager to assert my conservative credentials. I spent years writing for conservative publications such as the Wall Street Journal editorial page and Commentary magazine and working as a foreign policy adviser for three Republican presidential campaigns. Being conservative used to be central to my identity. But now, frankly, I don’t give a damn. I prefer to think of myself as a classical liberal, because “conservative” has become practically synonymous with “Trump lackey.”\nLike Richard Spencer, Max Boot is Fake Right. Boot was\nnever\na conservative in any sense whatsoever, not even in the Jewish religious sense. He is not even close to anything resembling a “classical liberal” either. What sort of “conservative” writes for the\nWashington Post\n?  These wormtongues speak as if words have literally no intrinsic meaning.\nRemember, the neocons were communists who only turned against the Soviet Union in the 1960s when it became apparent that the USA would remain the dominant military power. From Infogalactic:\nThe term “neoconservative” refers to those who made the ideological journey from the anti-Stalinist left to the camp of American conservatism. The movement had its intellectual roots in the Jewish monthly review magazine Commentary, published by the American Jewish Committee.\nThat ideological journey was always a sham. These (((fill-in-the-blanks))) are parasitical snakes, shedding their ideological skins in order to maximize their political influence while always advocating globalism, war, and Israel no matter what they happen to call themselves at the moment. The (((Ben Shapiros))) and (((Mona Charens))) and (((Max Boots))) are nothing but interest-group infiltrators and media operatives. There is no truth in them, and they are finally being revealed for the enemies of America, Christianity, and the West that they have always been.\nSpeaking of parasitical snakes, look at how\nThe Spectator tries to put Ben Shapiro in the “fearless freethinker” category\nwith Camille Paglia and Jordan Peterson. Notice how they featured him in the primary photo, even though he is almost the precise opposite of the philosophical, truth-seeking Peterson.\nConsider Ben Shapiro. The conservative pundit has become known over the past decade for his whippet-fast intellect and fearless debating style. College campuses began to see protests whenever this young conservative speaker was promised to appear. Far-leftist students repeatedly denounced the 34-year-old kippah-wearing Orthodox Jew as a racist and otherwise tried to silence him. Campuses promised students extra counselling to cope after hearing his arguments.\nAnd last September, after earlier riots on campus, the University of Berkeley shelled out $600,000 to make the campus secure for his talk there. Again the audience tuned in for the scandal and stayed to hear his smart, funny and thoughtful opinions. Today he has more than a million Twitter followers and makes news whenever he speaks.\nThe bit about his “fearless debating style” is particularly amusing considering how he has repeatedly run from debate with both Milo and myself. And the Littlest Chickenhawk isn’t part of “the intellectual dark web” at all. He has been nationally syndicated in the mainstream media\nfor nearly two decades\n! To the contrary, he is part of the Fake Right along with Max Boot, Mona Charon, David Frum, Jon Podhoretz, Bill Kristol, Cathy Young, and the rest of the Never-Trump (((conservatives))). The media loves to anoint these fake “opinion leaders” in order to divert public attention away from the actual freethinkers, which is why they ignored Jordan Peterson until it was no longer possible to do so.",
  "tags": [
    "FakeRight"
  ],
  "categories": [],
  "sitemap_lastmod": "2018-02-26T14:12:56+00:00"
}