{
  "url": "https://voxday.net/2018/02/27/she-had-to-go-back/",
  "scraped_at": "2025-12-19T10:45:03.914523",
  "title": "She had to go back",
  "date_display": "February 27, 2018",
  "date_iso": "2018-02-27T14:12:54+00:00",
  "date_from_url": "2018-02-27",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>And she is glad she did. To paraphrase the Israeli who sent me this link, her grandfather should resign from the U.S. Senate <a href=\"https://www.israelnationalnews.com/News/News.aspx/242481\">and follow suit</a>:</p><blockquote><p>Nesya Lieberman, the granddaughter of former United States Senator Joe Lieberman, made Aliyah today from Atlanta, Georgia through Nefesh B’Nefesh, in cooperation with the Ministry of Aliyah and Integration, the Jewish Agency of Israel, Keren Kayemeth LeIsrael and JNF-USA. The 20-year-old will be attending Ulpan at Kibbutz Sde Eliyahu upon her arrival to improve her Hebrew skills in preparation of beginning a year volunteering for National Service.</p><p>She grew up attending Jewish day schools, and has spent a significant amount of time regularly visiting the country with her family as well as participating in various touring and learning programs in Israel.</p><p>Nesya has been planning to move to Israel for some time, as she feels a responsibility to live in Israel and strengthen the country through her Aliyah.</p></blockquote><p>In case it still isn’t obvious to you that individuals such as Joe Lieberman are not, and never were, Americans, the actions of his granddaughter should suffice to prove the point once and for all. Lieberman and company are just passing through, and regardless of whatever propaganda they have successfully sold to the American people over time, they have known that all along.</p><p><i>“Jews have been praying for a return to Israel for millennia, and I’m fortunate enough to live in a time when such a return is possible. Why would I live anywhere else? Israel is my home….<span style='font-family: \"arial\"; font-size: 16px;'>”</span></i><br>– Nesya Lieberman</br></p><p>Joe Lieberman’s grandparents immigrated to the United States. His grandaughter emigrated. That is only three generations that were even fully resident in the USA! Giving a nomadic people <u>any</u> voice in government isn’t merely a potentially fatal mistake, it is objectively and observably insane! Doing so is absolutely guaranteed to lead to conflict and the adoption of policies that are not in the interest of the nation, as we have repeatedly witnessed throughout 19th, 20th, and 21st century American history.</p><p>This is why immigrants should not be permitted to vote for the subsequent three generations and should not be permitted to hold government office until the sixth generation that is fully resident there. Immigrants and their descendants don’t have “dual loyalties”. They don’t have any loyalty to the nation through which they are passing at all. They may well have affection for it. They may well have great respect for it. They may well be grateful to it and wish it well.</p><p>But whether they do or not, they are not <i>members </i>of it. They don’t identify with it. They cannot, by the Aristotelian principle of non-contradiction. If Nesya Lieberman is a member of the Jewish nation, and there is no reason to deny that, then neither she nor any of her forebears were ever members of the American nation.</p><p>A man cannot serve two masters.</p></div>",
  "content_text": "And she is glad she did. To paraphrase the Israeli who sent me this link, her grandfather should resign from the U.S. Senate\nand follow suit\n:\nNesya Lieberman, the granddaughter of former United States Senator Joe Lieberman, made Aliyah today from Atlanta, Georgia through Nefesh B’Nefesh, in cooperation with the Ministry of Aliyah and Integration, the Jewish Agency of Israel, Keren Kayemeth LeIsrael and JNF-USA. The 20-year-old will be attending Ulpan at Kibbutz Sde Eliyahu upon her arrival to improve her Hebrew skills in preparation of beginning a year volunteering for National Service.\nShe grew up attending Jewish day schools, and has spent a significant amount of time regularly visiting the country with her family as well as participating in various touring and learning programs in Israel.\nNesya has been planning to move to Israel for some time, as she feels a responsibility to live in Israel and strengthen the country through her Aliyah.\nIn case it still isn’t obvious to you that individuals such as Joe Lieberman are not, and never were, Americans, the actions of his granddaughter should suffice to prove the point once and for all. Lieberman and company are just passing through, and regardless of whatever propaganda they have successfully sold to the American people over time, they have known that all along.\n“Jews have been praying for a return to Israel for millennia, and I’m fortunate enough to live in a time when such a return is possible. Why would I live anywhere else? Israel is my home….\n”\n– Nesya Lieberman\nJoe Lieberman’s grandparents immigrated to the United States. His grandaughter emigrated. That is only three generations that were even fully resident in the USA! Giving a nomadic people\nany\nvoice in government isn’t merely a potentially fatal mistake, it is objectively and observably insane! Doing so is absolutely guaranteed to lead to conflict and the adoption of policies that are not in the interest of the nation, as we have repeatedly witnessed throughout 19th, 20th, and 21st century American history.\nThis is why immigrants should not be permitted to vote for the subsequent three generations and should not be permitted to hold government office until the sixth generation that is fully resident there. Immigrants and their descendants don’t have “dual loyalties”. They don’t have any loyalty to the nation through which they are passing at all. They may well have affection for it. They may well have great respect for it. They may well be grateful to it and wish it well.\nBut whether they do or not, they are not\nmembers\nof it. They don’t identify with it. They cannot, by the Aristotelian principle of non-contradiction. If Nesya Lieberman is a member of the Jewish nation, and there is no reason to deny that, then neither she nor any of her forebears were ever members of the American nation.\nA man cannot serve two masters.",
  "tags": [
    "Zion"
  ],
  "categories": [],
  "sitemap_lastmod": "2018-02-27T14:12:54+00:00"
}