{
  "url": "https://voxday.net/2018/02/02/sjw-hit-piece-on-dc-artist/",
  "scraped_at": "2025-12-19T10:41:47.817300",
  "title": "SJW hit piece on DC artist",
  "date_display": "February 2, 2018",
  "date_iso": "2018-02-02T19:08:18+00:00",
  "date_from_url": "2018-02-02",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>Bleeding Cool is the most embarrassingly SJW of the comics fan sites that try to pose as real journalistic organizations. They don’t cover much actual news, they prefer to devote their efforts to fan-squee over failing Marvel comics and striking blows for social justice at every opportunity. They’ve run hit pieces on <a href=\"http://voxday.blogspot.com/2018/01/forget-moderation-stand-up-and-fight.html\">my erstwhile opponent Ethan Van Sciver</a> before, but now <a href=\"https://www.bleedingcool.com/2018/02/02/ethan-van-sciver-dc-comics/\">Rich Johnston is jumping on the campaign</a> by four minor artists that has the objective of getting Van Sciver fired from DC.</p><blockquote><p>Ethan Van Sciver is a successful superhero comic book artist. Beginning with his own character Cyberfrog, he would go on to draw New X-Men, written by Grant Morrison; Green Lantern Rebirth by Geoff Johns; go exclusive with DC Comics; and more recently draw the DC Rebirth series Hal Jordan &amp; The Green Lantern Corps.</p><p>Van Sciver has also continuously exhibited a rather fractious online personality, and has been accused of being an agitator and a troll. Over the course of much of his professional career, he has generally characterized such behavior simply as over-the-top, often ironic, bombastic banter, but last year even he seemed to accept the notion that it was something beyond that.</p><p>“I’m going to try to focus on being kinder. I try every day, but I have this mean streak…”, he said in part, at a candid moment in May 2017.</p><p>While Van Sciver has echoed that desire for a kinder focus on social media in more recent times, there are many who would say that this mean streak still in large part defines him, and guides his current intent in ways not too far removed from that pivotal moment last year.</p><p><b>Public and Private</b></p><p>At that time, some of his privately posted comments became subject to public scrutiny. While in a heated discussion, Van Sciver suggested that another user — someone who had been suffering from depression — should kill themselves.</p><p>View image on Twitter</p><p>This seemed to be a critical moment for the artist, and for the people around him. Many creators spoke out about the incident, and he seemed to realize he’d gone too far. Indeed, DC Entertainment President Diane Nelson was made aware of the situation, and responded to it in private email that was CC’d to Dee Dee Myers, the head of corporate communications at Warner Brothers, which we are running for the first time here. Replying to concerns that a fan expressed to her, Nelson stated that Van Sciver’s comments were offensive, did not meet their standards for their creators, and that his actions did not speak for DC Comics.</p><p><i>Dear Deeply Concerned Individual,</i></p><p><i>Thank you for taking the time to write. I couldn’t agree more that the comments Ethan van Sciver made on Facebook were offensive. His actions do not meet the high standards we strive for from our creative community. They are inconsistent with the values of Warner Bros. and DC Entertainment, as well as those of the pantheon of the DC superhero characters.</i><br><i><br/></i><i>Ethan is just one of hundreds of members of DC’s freelance creative community, and I assure you his actions do not speak for the rest of us. That said, I completely understand if fans choose not to purchase Ethan’s work.</i><br><i><br/></i><i>Thanks again for taking the time to craft such a thoughtful email. It’s appreciated.</i><br><i><br/></i><i>Best,</i><br><i><br/></i><i>Diane</i><br><i>President, DC Entertainment</i></br></br></br></br></br></p><p><a href=\"https://www.bleedingcool.com/2017/05/11/ethan-van-sciver-apologises-suicide-jibe-vows-not-vent-social-media-anymore/\">He publicly apologised</a> and committed to changing his ways, vowing “not to vent” on social media anymore. He also closed two of his three Facebook pages and withdrew, stating, <i>“I’m going to try to focus on being kinder. I try every day, but I have this mean streak… I’m sorry. Truly. I’ll be a better man.”</i></p><p>So, the question is: has Van Sciver made good on that apology and promise? Or has his “mean streak” gotten the better of him?</p><p><b>Friends In Low Places</b></p><p>Van Sciver has shown glimpses of the better man he vowed to be in that dark moment. He has spoken up against instances of abuse directed at LGBTQ comic book creators. He has tweeted about the need to treat each other with kindness. But overshadowing those glimpses, he has continually invested considerable effort into elevating voices whose intent seems in direct opposition to those words.</p><p>He started a YouTube channel, ostensibly to share the secrets of comic book artists, to present his commentary on the industry and engage with figures from Vox Day to Chuck Dixon to Mark Waid — but more often, Richard C. Meyer, the commentator behind the Diversity &amp; Comics YouTube channel, which stands accused of propagating bigotry, hate speech, and harassment. Meyer’s followers have aimed abuse against many members of the comic book community.</p><p>For transparency, that often includes me.<br>Van Sciver has hosted a number of videos with Meyer now, equivocating away Meyer’s actions, past and present.</br></p><p>It was in the light of this that Van Sciver openly posted an invite to one of his critics, cartoonist and comic store employee Darryl Ayo, to come onto a live YouTube show to debate comic artist Jon Malin, with Ethan as moderator. Malin recently found himself at the centre of criticism after comparing Hitler’s ideology to that of “social justice warriors”. Ayo declined. But the requests kept coming.</p><p>Ayo, also a heavy critic of Bleeding Cool, nevertheless invited me to look into this. I reached out to Van Sciver, who initially agreed to take and answer questions about this and other matters. But before I could begin, he rescinded his agreement (more on that later). So I talked to Ayo.</p><p>Rich Johnston: Darryl, what is your history with Ethan Van Sciver?</p><p>Darryl Ayo: I don’t have a history with Ethan Van Sciver prior to January 23rd, 2018. He is a known superhero artist and I’m a minicomics creator and comics critic. I’ve never interacted with Ethan Van Sciver and haven’t made any attempt to interact with him. We are from different parts of the comics art form and industry.</p><p>RJ:  So what led to his recent invite to you?</p><p>DA: In professional terms, nothing. There was no reason for Ethan Van Sciver to even be thinking about me, much less talking to me.</p><p>That said, Ethan Van Sciver decided to invite me (and I don’t necessarily see it as an “invitation,” per se) to appear on his show after I had been highlighted and targeted for harassment by an online person called “Diversity and Comics.” At the time, “Diversity and Comics” had been focusing his attention on me and targeting me for abuse by his fans for about a week.</p><p>The supposed purpose of Ethan Van Sciver’s initiation of contact was to discuss a superhero artist named Jon Malin, who had made bizarre comments earlier that day about Hitler being an “SJW,” which is a derisive term applied to liberals, progressives and leftists. The idea of Hitler, one of the most notorious and brutal right wing thugs in the twentieth century being equated with a term that essentially means “progressive” was appalling and many people throughout the comics industries, including, but not limited to me, expressed disgust at the comments of this Jon Malin person.</p><p>As I was about to shut off my computer and go to bed, I noticed a string of notifications to my twitter account. There was a discussion and there were replies. The origin was Ethan Van Sciver, who I had never spoken with before, mentioning me on his twitter and asking/telling/pleading/demanding that I join some debate that he was currently having on a podcast that he apparently hosts. This is the first time that I had any contact with Ethan Van Sciver and therefore, the casual tone of his tweets was disturbing as they seemed to indicate a familiarity or at least a preexisting relationship between us. There was no preexisting relationship. I had never agreed to appear on this podcast and I certainly was not going to be coaxed or goaded or railroaded into appearing in public in such a manner. I made a post to my own twitter account, not as a reply to Ethan, but a plain text post, indicating that I was not appearing on an Ethan Van Sciver podcast.  Ethan pressed the issue by tweeting to me and attempting to sustain the illusion that there was a mutual agreement about a desire to debate. There was no agreement. There was no prior discussion or contact.</p><p>RJ: How did this invite and the repeated requests affect you?</p><p>DA: I thought it was all quite annoying and unprofessional. And since it opened me up to further trolling and harassment by the same parties that have already been attacking me, I was furious.</p><p>The entire affair was manipulative and frankly, insulting. The notion that anyone would drop everything and appear on a podcast to argue with a stranger at midnight just because someone goaded them is preposterous. The more Ethan tried to talk me into this nonsensical idea, the more certain I was that it was an attempt to publicly humiliate me. All of this became even more obvious after Ethan Van Sciver eventually dropped his pretense and admitted that he was angry with me about a comment that I had made months prior regarding reports that he, Ethan Van Sciver, had named a book of his after Hitler’s book.</p><p>As Ethan Van Sciver continued to tweet about me and at me, he would exaggerate this to his audience, spinning a fantasy that I had personally led a mob of hatred against him. Nonsense; many people publicly expressed disgust about Ethan Van Sciver’s Hitler-referencing title at the time of that particular report. However, since I was designated as the enemy of the moment by “Diversity and Comics,” Ethan sought to lie to his twitter followers and insist that I had led a hate campaign against him “for six months.” In other words, a comment *made* six months prior was recast as an ongoing campaign *lasting* for six months. Lies, outright lies. Flagrant lies. And of course, this further enflamed the angry bigots who, as I have said above, were already targeting me and friends of mine for abuse and harassment.</p><p>RJ: What outcome would you like to see come from this?</p><p>DA: Who cares. I’m already a target of abuse by the “Diversity and Comics” person’s followers. I’m already a target of abuse by the alt right. I don’t see any outcome. If you’re asking me whether Ethan Van Sciver, for his part, should lose his contract with DC Comics: absolutely. This reckless and dishonest behavior would get anybody fired from a traditional employer. But since that’s not going to happen, I don’t care. They should all definitely stay away from me and everyone I know.</p><p><b>A New Age Of Heroes</b></p><p>Van Sciver is a freelance artist working for DC Comics, and discussions with the publisher have focused on the difference between this role and that of a staffer, in regards to how the company would view their actions.</p><p>However, I have been made aware that senior DC creators have been vocal within the publisher, some going as far as refusing to work in any project Van Sciver was affiliated with, in a similar manner as some refused to work under editor Eddie Berganza. Berganza was a champion of Van Sciver’s work before he was fired following several allegations of sexual harassment. I understand that a number of letters by senior DC creators have been sent up the chain, objecting to Van Sciver’s behavior online.</p><p>It is notable that despite his critical reputation, Van Sciver was not part of the DC New Age of Heroes lineup, alongside peers of a similar background such as Tony S. Daniel or Kenneth Rocafort.</p><p>Regardless, the subject has been getting more heated. Comic book creators have again been making public statements — some about Van Sciver and some about Meyer, whom they see Van Sciver as supporting and promoting. And these creators have called on comic book publishers to do something:</p><p>I approached Van Sciver to discuss all of these issues. He initially agreed to participate, but after I asked that he not screencap or post extracts of our conversation before publication, he declined to proceed.</p><p>If Van Sciver had continued, I would have asked him about the reaction from his fellow comic book professionals, from DC President Diane Nelson, senior DC employees and other freelancers and commentators. I would have asked him if, like Trump, he saw “very fine people on both sides” regarding this.</p><p>Most of all, I’d have asked him if he felt that he was living up to his promise to be a better man. And if his expressed desire to bring unity was working.</p><p>Because it seems to be having quite the opposite effect. And I am told by a number of DC sources not to expect to see Ethan Van Sciver’s name on any other upcoming DC projects after his current run on Hal Jordan &amp; Green Lantern Corps.</p><p>Many comic book fans enjoy Ethan’s artwork and he has a solid body of work behind him. But his self-described “mean streak” has blunted his own creative potential.  It has ruled him, rather than served him. I suspect even Ethan knows that too. I’d have liked the chance to ask.</p><p>As of yesterday, he has deleted his Twitter account with the apparent intent to move his comics commentary and work to YouTube.</p><p>Neither DC Comics nor Van Sciver chose to comment on this story.</p></blockquote><p>There are a lot of interesting details to be mined from the SJW behavior here, but among other things, this is yet <i>another </i>lesson in <i>never apologizing</i>. And notice how heavily converged DC Comics is. The Hillary Clinton fundraiser who runs the show reports to Dee Dee Myers, who you may recall served as the White House Press Secretary during the first two years of the Clinton administration, worked for Alan Sorkin as a consultant on <i>The West Wing</i>, and wrote the book <i>Why Women Should Rule the World</i>.</p><p>Who better to know what young men want to read, right? As bad as Marvel’s convergence has been of late, you can be very confident that DC’s will be even worse within 18 months.</p><p>Anyhow, this is simply more of the same SJW DARVO that we saw the busted Googlers attempting via <i>Wired </i>and <i>USA Today</i> last week. They swarm and harass until their target hits back, then run screaming to Mommy Media that the bad mans hit them because Nazi. It’s the same disingenuous routine every time; notice that the media never quotes what provoked the initial response from the target.</p><p>And if the comics-SJWs think that <i>Ethan Van Sciver</i>, of all people, is far Right and has a mean streak, well, then the VFM and the Dread Ilk are going to have a seriously GOOD TIME these next few years. The poor sensitive bastards clearly have no idea what the Evil Legion of Evil has in store for them. Ethan and his fans aren’t the bad guys.</p><p><a href=\"https://scontent-frx5-1.xx.fbcdn.net/v/t1.0-9/27067102_406125823134706_3809240281492964420_n.png?oh=48d97597a721ae3827a86999f0b22537&amp;oe=5ADFFB92\">We are the bad guys.</a></p></div>",
  "content_text": "Bleeding Cool is the most embarrassingly SJW of the comics fan sites that try to pose as real journalistic organizations. They don’t cover much actual news, they prefer to devote their efforts to fan-squee over failing Marvel comics and striking blows for social justice at every opportunity. They’ve run hit pieces on\nmy erstwhile opponent Ethan Van Sciver\nbefore, but now\nRich Johnston is jumping on the campaign\nby four minor artists that has the objective of getting Van Sciver fired from DC.\nEthan Van Sciver is a successful superhero comic book artist. Beginning with his own character Cyberfrog, he would go on to draw New X-Men, written by Grant Morrison; Green Lantern Rebirth by Geoff Johns; go exclusive with DC Comics; and more recently draw the DC Rebirth series Hal Jordan & The Green Lantern Corps.\nVan Sciver has also continuously exhibited a rather fractious online personality, and has been accused of being an agitator and a troll. Over the course of much of his professional career, he has generally characterized such behavior simply as over-the-top, often ironic, bombastic banter, but last year even he seemed to accept the notion that it was something beyond that.\n“I’m going to try to focus on being kinder. I try every day, but I have this mean streak…”, he said in part, at a candid moment in May 2017.\nWhile Van Sciver has echoed that desire for a kinder focus on social media in more recent times, there are many who would say that this mean streak still in large part defines him, and guides his current intent in ways not too far removed from that pivotal moment last year.\nPublic and Private\nAt that time, some of his privately posted comments became subject to public scrutiny. While in a heated discussion, Van Sciver suggested that another user — someone who had been suffering from depression — should kill themselves.\nView image on Twitter\nThis seemed to be a critical moment for the artist, and for the people around him. Many creators spoke out about the incident, and he seemed to realize he’d gone too far. Indeed, DC Entertainment President Diane Nelson was made aware of the situation, and responded to it in private email that was CC’d to Dee Dee Myers, the head of corporate communications at Warner Brothers, which we are running for the first time here. Replying to concerns that a fan expressed to her, Nelson stated that Van Sciver’s comments were offensive, did not meet their standards for their creators, and that his actions did not speak for DC Comics.\nDear Deeply Concerned Individual,\nThank you for taking the time to write. I couldn’t agree more that the comments Ethan van Sciver made on Facebook were offensive. His actions do not meet the high standards we strive for from our creative community. They are inconsistent with the values of Warner Bros. and DC Entertainment, as well as those of the pantheon of the DC superhero characters.\nEthan is just one of hundreds of members of DC’s freelance creative community, and I assure you his actions do not speak for the rest of us. That said, I completely understand if fans choose not to purchase Ethan’s work.\nThanks again for taking the time to craft such a thoughtful email. It’s appreciated.\nBest,\nDiane\nPresident, DC Entertainment\nHe publicly apologised\nand committed to changing his ways, vowing “not to vent” on social media anymore. He also closed two of his three Facebook pages and withdrew, stating,\n“I’m going to try to focus on being kinder. I try every day, but I have this mean streak… I’m sorry. Truly. I’ll be a better man.”\nSo, the question is: has Van Sciver made good on that apology and promise? Or has his “mean streak” gotten the better of him?\nFriends In Low Places\nVan Sciver has shown glimpses of the better man he vowed to be in that dark moment. He has spoken up against instances of abuse directed at LGBTQ comic book creators. He has tweeted about the need to treat each other with kindness. But overshadowing those glimpses, he has continually invested considerable effort into elevating voices whose intent seems in direct opposition to those words.\nHe started a YouTube channel, ostensibly to share the secrets of comic book artists, to present his commentary on the industry and engage with figures from Vox Day to Chuck Dixon to Mark Waid — but more often, Richard C. Meyer, the commentator behind the Diversity & Comics YouTube channel, which stands accused of propagating bigotry, hate speech, and harassment. Meyer’s followers have aimed abuse against many members of the comic book community.\nFor transparency, that often includes me.\nVan Sciver has hosted a number of videos with Meyer now, equivocating away Meyer’s actions, past and present.\nIt was in the light of this that Van Sciver openly posted an invite to one of his critics, cartoonist and comic store employee Darryl Ayo, to come onto a live YouTube show to debate comic artist Jon Malin, with Ethan as moderator. Malin recently found himself at the centre of criticism after comparing Hitler’s ideology to that of “social justice warriors”. Ayo declined. But the requests kept coming.\nAyo, also a heavy critic of Bleeding Cool, nevertheless invited me to look into this. I reached out to Van Sciver, who initially agreed to take and answer questions about this and other matters. But before I could begin, he rescinded his agreement (more on that later). So I talked to Ayo.\nRich Johnston: Darryl, what is your history with Ethan Van Sciver?\nDarryl Ayo: I don’t have a history with Ethan Van Sciver prior to January 23rd, 2018. He is a known superhero artist and I’m a minicomics creator and comics critic. I’ve never interacted with Ethan Van Sciver and haven’t made any attempt to interact with him. We are from different parts of the comics art form and industry.\nRJ:  So what led to his recent invite to you?\nDA: In professional terms, nothing. There was no reason for Ethan Van Sciver to even be thinking about me, much less talking to me.\nThat said, Ethan Van Sciver decided to invite me (and I don’t necessarily see it as an “invitation,” per se) to appear on his show after I had been highlighted and targeted for harassment by an online person called “Diversity and Comics.” At the time, “Diversity and Comics” had been focusing his attention on me and targeting me for abuse by his fans for about a week.\nThe supposed purpose of Ethan Van Sciver’s initiation of contact was to discuss a superhero artist named Jon Malin, who had made bizarre comments earlier that day about Hitler being an “SJW,” which is a derisive term applied to liberals, progressives and leftists. The idea of Hitler, one of the most notorious and brutal right wing thugs in the twentieth century being equated with a term that essentially means “progressive” was appalling and many people throughout the comics industries, including, but not limited to me, expressed disgust at the comments of this Jon Malin person.\nAs I was about to shut off my computer and go to bed, I noticed a string of notifications to my twitter account. There was a discussion and there were replies. The origin was Ethan Van Sciver, who I had never spoken with before, mentioning me on his twitter and asking/telling/pleading/demanding that I join some debate that he was currently having on a podcast that he apparently hosts. This is the first time that I had any contact with Ethan Van Sciver and therefore, the casual tone of his tweets was disturbing as they seemed to indicate a familiarity or at least a preexisting relationship between us. There was no preexisting relationship. I had never agreed to appear on this podcast and I certainly was not going to be coaxed or goaded or railroaded into appearing in public in such a manner. I made a post to my own twitter account, not as a reply to Ethan, but a plain text post, indicating that I was not appearing on an Ethan Van Sciver podcast.  Ethan pressed the issue by tweeting to me and attempting to sustain the illusion that there was a mutual agreement about a desire to debate. There was no agreement. There was no prior discussion or contact.\nRJ: How did this invite and the repeated requests affect you?\nDA: I thought it was all quite annoying and unprofessional. And since it opened me up to further trolling and harassment by the same parties that have already been attacking me, I was furious.\nThe entire affair was manipulative and frankly, insulting. The notion that anyone would drop everything and appear on a podcast to argue with a stranger at midnight just because someone goaded them is preposterous. The more Ethan tried to talk me into this nonsensical idea, the more certain I was that it was an attempt to publicly humiliate me. All of this became even more obvious after Ethan Van Sciver eventually dropped his pretense and admitted that he was angry with me about a comment that I had made months prior regarding reports that he, Ethan Van Sciver, had named a book of his after Hitler’s book.\nAs Ethan Van Sciver continued to tweet about me and at me, he would exaggerate this to his audience, spinning a fantasy that I had personally led a mob of hatred against him. Nonsense; many people publicly expressed disgust about Ethan Van Sciver’s Hitler-referencing title at the time of that particular report. However, since I was designated as the enemy of the moment by “Diversity and Comics,” Ethan sought to lie to his twitter followers and insist that I had led a hate campaign against him “for six months.” In other words, a comment *made* six months prior was recast as an ongoing campaign *lasting* for six months. Lies, outright lies. Flagrant lies. And of course, this further enflamed the angry bigots who, as I have said above, were already targeting me and friends of mine for abuse and harassment.\nRJ: What outcome would you like to see come from this?\nDA: Who cares. I’m already a target of abuse by the “Diversity and Comics” person’s followers. I’m already a target of abuse by the alt right. I don’t see any outcome. If you’re asking me whether Ethan Van Sciver, for his part, should lose his contract with DC Comics: absolutely. This reckless and dishonest behavior would get anybody fired from a traditional employer. But since that’s not going to happen, I don’t care. They should all definitely stay away from me and everyone I know.\nA New Age Of Heroes\nVan Sciver is a freelance artist working for DC Comics, and discussions with the publisher have focused on the difference between this role and that of a staffer, in regards to how the company would view their actions.\nHowever, I have been made aware that senior DC creators have been vocal within the publisher, some going as far as refusing to work in any project Van Sciver was affiliated with, in a similar manner as some refused to work under editor Eddie Berganza. Berganza was a champion of Van Sciver’s work before he was fired following several allegations of sexual harassment. I understand that a number of letters by senior DC creators have been sent up the chain, objecting to Van Sciver’s behavior online.\nIt is notable that despite his critical reputation, Van Sciver was not part of the DC New Age of Heroes lineup, alongside peers of a similar background such as Tony S. Daniel or Kenneth Rocafort.\nRegardless, the subject has been getting more heated. Comic book creators have again been making public statements — some about Van Sciver and some about Meyer, whom they see Van Sciver as supporting and promoting. And these creators have called on comic book publishers to do something:\nI approached Van Sciver to discuss all of these issues. He initially agreed to participate, but after I asked that he not screencap or post extracts of our conversation before publication, he declined to proceed.\nIf Van Sciver had continued, I would have asked him about the reaction from his fellow comic book professionals, from DC President Diane Nelson, senior DC employees and other freelancers and commentators. I would have asked him if, like Trump, he saw “very fine people on both sides” regarding this.\nMost of all, I’d have asked him if he felt that he was living up to his promise to be a better man. And if his expressed desire to bring unity was working.\nBecause it seems to be having quite the opposite effect. And I am told by a number of DC sources not to expect to see Ethan Van Sciver’s name on any other upcoming DC projects after his current run on Hal Jordan & Green Lantern Corps.\nMany comic book fans enjoy Ethan’s artwork and he has a solid body of work behind him. But his self-described “mean streak” has blunted his own creative potential.  It has ruled him, rather than served him. I suspect even Ethan knows that too. I’d have liked the chance to ask.\nAs of yesterday, he has deleted his Twitter account with the apparent intent to move his comics commentary and work to YouTube.\nNeither DC Comics nor Van Sciver chose to comment on this story.\nThere are a lot of interesting details to be mined from the SJW behavior here, but among other things, this is yet\nanother\nlesson in\nnever apologizing\n. And notice how heavily converged DC Comics is. The Hillary Clinton fundraiser who runs the show reports to Dee Dee Myers, who you may recall served as the White House Press Secretary during the first two years of the Clinton administration, worked for Alan Sorkin as a consultant on\nThe West Wing\n, and wrote the book\nWhy Women Should Rule the World\n.\nWho better to know what young men want to read, right? As bad as Marvel’s convergence has been of late, you can be very confident that DC’s will be even worse within 18 months.\nAnyhow, this is simply more of the same SJW DARVO that we saw the busted Googlers attempting via\nWired\nand\nUSA Today\nlast week. They swarm and harass until their target hits back, then run screaming to Mommy Media that the bad mans hit them because Nazi. It’s the same disingenuous routine every time; notice that the media never quotes what provoked the initial response from the target.\nAnd if the comics-SJWs think that\nEthan Van Sciver\n, of all people, is far Right and has a mean streak, well, then the VFM and the Dread Ilk are going to have a seriously GOOD TIME these next few years. The poor sensitive bastards clearly have no idea what the Evil Legion of Evil has in store for them. Ethan and his fans aren’t the bad guys.\nWe are the bad guys.",
  "tags": [
    "media"
  ],
  "categories": [],
  "sitemap_lastmod": "2018-02-02T19:08:18+00:00"
}