{
  "url": "https://voxday.net/2018/02/25/the-skinsuit-comes-off/",
  "scraped_at": "2025-12-19T10:44:48.615300",
  "title": "The skinsuit comes off",
  "date_display": "February 25, 2018",
  "date_iso": "2018-02-25T12:17:25+00:00",
  "date_from_url": "2018-02-25",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p><a href=\"http://www.washingtonexaminer.com/cpac-speaker-mona-charen-stuns-with-fiery-rebuke-of-trump-marine-le-pen/article/2649965\">CPAC is now the Holocaust</a>, if longtime “conservative” columnist Mona Charen is to be believed:</p><blockquote><p>A conservative columnist was escorted out of the Conservative Political Action Conference on Saturday after slamming President Trump and conservatives for behaving like “hypocrites” when it comes to women’s issues…. Declining to mention Trump by name, Charen said conservatives are guilty of “look[ing] the other way” when it comes to the president and other Republican men who have faced allegations of sexual misconduct.</p><p>“This was a party that was ready to … endorse Roy Moore for Senate in the state of Alabama even though he was a credibly accused child molester,” Charen said. “You cannot claim that you stand for women, and put up with that,” she told the crowd, as several members of the audience shouted, “Not true!”</p><p>Charen’s comments were met with heavy boos inside the conference hall, and she was later spotted leaving the conference with a three-person security detail. Earlier on in the panel, she issued a strong rebuke of Marion Le Pen, the niece of former French right-wing presidential candidate Marine Le Pen, whose own appearance at CPAC drew scrutiny from some conservatives who have accused her of enabling far-right groups with racist views.</p><p>“There was quite an interesting person who was on this stage the other day. Her name is Marion Le Pen,” Charen told the crowd, suggesting Le Pen was only invited because of her surname.</p><p>“And the Le Pen name is a disgrace,” she added. “Her grandfather is racist and a Nazi. She claims that she stands for him. And the fact that CPAC invited her is a disgrace,” Charen said.</p></blockquote><p>No, the fact that the likes of Charen were ever taken at face value as conservatives, as Republicans, or as Americans is ludicrous. One of the things that will be hardest for many longtime conservatives to accept as identity politics increasingly rise to the fore is the realization that about one-third of their long-time “opinion leaders” are not, and were never, on their side. Just as those “opinion leaders” have done, conservatives are going to have to make a choice between being pro-American and pro-Christian, and being globalist and philosemitic. The “creedal nation of immigrants with Judeo-Christian values upheld by the Zeroth Amendment” dodge is now finally understood to be the anti-American propaganda that it was from the start.</p><p>If you look at <a href=\"http://amzn.to/2l6XqHo\">my columns dating back to 2001</a>, one glaring omission that you may notice now is how, with the exception of Jonah Goldberg, there is no praise for, or quoting of, an entire subset of leading conservative columnists. Nor did I ever call myself a conservative or a Republican. It was always obvious to me, <i>even at the time</i>, that Ms Charen’s interest group that somehow happened to be remarkably overrepresented in the “conservative media” reliably put self-interest above ideology and operated in a shamelessly nepotistic fashion.</p><p>Remember, I was there when the Littlest Chickenhawk was a supposed child prodigy playing violin and regurgitating mainstream Republican talking points. I saw how he was nationally syndicated by Creator’s Syndicate despite not being one of the 20 most-read columnists on WND, and how those columns were picked up by big city newspaper editors around the country while mine, 4x more popular and syndicated by the much more respected Universal Press Syndicate, were not. I even commented, <a href=\"http://voxday.blogspot.com/2005/02/jews-in-conservative-news.html\">13 years ago</a>, that it was very strange how more than one-fifth of the nominally “conservative media” happened to be members of the group that was the second-most inclined to the Democratic Party and only represented 0.68 percent of the Republican voters in 2000. Once more, pattern recognition proves more reliable than experts and credentials.</p><p>As Bill Kristol, Ben Shapiro, Mona Charen, and various others have now made abundantly clear, they were intended to be a leash on conservative nationalism all along. And now that conservatives across the West are <a href=\"https://www.lewrockwell.com/2018/02/jack-kerwick/the-big-con-and-why-the-left-will-continue-to-win/\">waking up to the Big Con</a> and are wisely choosing their nations over anti-Western globalist interests, they are going to have to deal with the fact that they are going to be attacked as Hitlers and Nazis and Holocausts just like Brexit, AfD, La Lega, Viktor Orban, Donald Trump, Marion Le Pen, and every other individual who stands up to defend America, Christianity, and the West.</p><p>Because the “conservative Republican” Mona Charens of the world <i>are against all three</i>.</p></div>",
  "content_text": "CPAC is now the Holocaust\n, if longtime “conservative” columnist Mona Charen is to be believed:\nA conservative columnist was escorted out of the Conservative Political Action Conference on Saturday after slamming President Trump and conservatives for behaving like “hypocrites” when it comes to women’s issues…. Declining to mention Trump by name, Charen said conservatives are guilty of “look[ing] the other way” when it comes to the president and other Republican men who have faced allegations of sexual misconduct.\n“This was a party that was ready to … endorse Roy Moore for Senate in the state of Alabama even though he was a credibly accused child molester,” Charen said. “You cannot claim that you stand for women, and put up with that,” she told the crowd, as several members of the audience shouted, “Not true!”\nCharen’s comments were met with heavy boos inside the conference hall, and she was later spotted leaving the conference with a three-person security detail. Earlier on in the panel, she issued a strong rebuke of Marion Le Pen, the niece of former French right-wing presidential candidate Marine Le Pen, whose own appearance at CPAC drew scrutiny from some conservatives who have accused her of enabling far-right groups with racist views.\n“There was quite an interesting person who was on this stage the other day. Her name is Marion Le Pen,” Charen told the crowd, suggesting Le Pen was only invited because of her surname.\n“And the Le Pen name is a disgrace,” she added. “Her grandfather is racist and a Nazi. She claims that she stands for him. And the fact that CPAC invited her is a disgrace,” Charen said.\nNo, the fact that the likes of Charen were ever taken at face value as conservatives, as Republicans, or as Americans is ludicrous. One of the things that will be hardest for many longtime conservatives to accept as identity politics increasingly rise to the fore is the realization that about one-third of their long-time “opinion leaders” are not, and were never, on their side. Just as those “opinion leaders” have done, conservatives are going to have to make a choice between being pro-American and pro-Christian, and being globalist and philosemitic. The “creedal nation of immigrants with Judeo-Christian values upheld by the Zeroth Amendment” dodge is now finally understood to be the anti-American propaganda that it was from the start.\nIf you look at\nmy columns dating back to 2001\n, one glaring omission that you may notice now is how, with the exception of Jonah Goldberg, there is no praise for, or quoting of, an entire subset of leading conservative columnists. Nor did I ever call myself a conservative or a Republican. It was always obvious to me,\neven at the time\n, that Ms Charen’s interest group that somehow happened to be remarkably overrepresented in the “conservative media” reliably put self-interest above ideology and operated in a shamelessly nepotistic fashion.\nRemember, I was there when the Littlest Chickenhawk was a supposed child prodigy playing violin and regurgitating mainstream Republican talking points. I saw how he was nationally syndicated by Creator’s Syndicate despite not being one of the 20 most-read columnists on WND, and how those columns were picked up by big city newspaper editors around the country while mine, 4x more popular and syndicated by the much more respected Universal Press Syndicate, were not. I even commented,\n13 years ago\n, that it was very strange how more than one-fifth of the nominally “conservative media” happened to be members of the group that was the second-most inclined to the Democratic Party and only represented 0.68 percent of the Republican voters in 2000. Once more, pattern recognition proves more reliable than experts and credentials.\nAs Bill Kristol, Ben Shapiro, Mona Charen, and various others have now made abundantly clear, they were intended to be a leash on conservative nationalism all along. And now that conservatives across the West are\nwaking up to the Big Con\nand are wisely choosing their nations over anti-Western globalist interests, they are going to have to deal with the fact that they are going to be attacked as Hitlers and Nazis and Holocausts just like Brexit, AfD, La Lega, Viktor Orban, Donald Trump, Marion Le Pen, and every other individual who stands up to defend America, Christianity, and the West.\nBecause the “conservative Republican” Mona Charens of the world\nare against all three\n.",
  "tags": [
    "media"
  ],
  "categories": [],
  "sitemap_lastmod": "2018-02-25T12:17:25+00:00"
}