{
  "url": "https://voxday.net/2018/02/26/the-parkland-narrative-unravels-further/",
  "scraped_at": "2025-12-19T10:44:57.649774",
  "title": "The Parkland narrative unravels further",
  "date_display": "February 26, 2018",
  "date_iso": "2018-02-26T09:25:36+00:00",
  "date_from_url": "2018-02-26",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>In addition to the <strike>one</strike> four Broward County deputies who were sitting on their hands rather than intervene in the recent school shooting, eyewitness reports are increasingly disproving every aspect of the Official Story. Why, for example, was the son of a police officer <a href=\"https://archive.fo/8MfoN\">wearing a bulletproof vest</a> during the attack?</p><blockquote class=\"tr_bq\"><p>In the classroom where Mackenzie Hill had been hiding, police broke through the door. As the officers were guiding students out, they noticed something odd: One of the students had put on a bulletproof vest. The student said he’d been given the vest by his father, a police officer. Even in the safest city in Florida, he’d brought it to school with him, just in case.</p></blockquote><p>Just in case. Right. Occam’s Razor dictates that the father knew something was happening that day, and had his suspicions that the scheduled “drill” was there to cover something more ominous. <a href=\"https://archive.fo/pbKJd\">Such as the attack by the real shooter</a>, who was probably the reason that the Broward County deputies were ordered to stand down.</p><blockquote><p>Marjory Stoneman Douglas High School teacher Stacy Lippel was grazed by a hot bullet which left the chamber of the shooter’s gun as she closed the door to her classroom after letting a number of students file into what would presumably be safety. However, nothing could have prepared the teacher for what she was to witness next.</p><p>“I suddenly saw the shooter about twenty feet in front of me standing at the end of the hallway actively shooting down the hallway, just a barrage of bullets, and I’m staring at him thinking why are the police here,this is strange because he’s in full metal garb, helmet, face mask, bulletproof armor, shooting this rifle that I’ve never seen before,” Lippel told Good Morning America last Wednesday.</p><p>The brave teacher said she told fellow Stoneman Douglas H.S. teacher Scott Beigel, 35, to get back in his room just before the shooter fired a number of rounds into his room killing him and other students.</p></blockquote><div style=\"text-align: center;\"><iframe allow=\"autoplay; encrypted-media\" allowfullscreen=\"\" frameborder=\"0\" height=\"284\" src=\"https://www.youtube.com/embed/cPvYxTa1ph4\" width=\"512\"></iframe></div><p>At this point, it wouldn’t surprise me to learn that Cruz’s AR-15 was never even fired. And frankly, this false flag appears to have been so ineptly staged that it also wouldn’t be a surprise to be informed that the ballistics eventually prove the rounds that were fired at the school were neither .223 Remington nor 5.56×45mm NATO. Which may be the reason why the school is being demolished.</p><p>Gun experts, what rifle or carbine that is standard issue for the Florida police fires .223 Remington or 5.56x45mm cartridges? I mean, one would naturally assume that whoever staged the false flag would be competent enough to use ammunition that is AR-15 compatible, but then, as Q informs us, these people are stupid.</p></div>",
  "content_text": "In addition to the\none\nfour Broward County deputies who were sitting on their hands rather than intervene in the recent school shooting, eyewitness reports are increasingly disproving every aspect of the Official Story. Why, for example, was the son of a police officer\nwearing a bulletproof vest\nduring the attack?\nIn the classroom where Mackenzie Hill had been hiding, police broke through the door. As the officers were guiding students out, they noticed something odd: One of the students had put on a bulletproof vest. The student said he’d been given the vest by his father, a police officer. Even in the safest city in Florida, he’d brought it to school with him, just in case.\nJust in case. Right. Occam’s Razor dictates that the father knew something was happening that day, and had his suspicions that the scheduled “drill” was there to cover something more ominous.\nSuch as the attack by the real shooter\n, who was probably the reason that the Broward County deputies were ordered to stand down.\nMarjory Stoneman Douglas High School teacher Stacy Lippel was grazed by a hot bullet which left the chamber of the shooter’s gun as she closed the door to her classroom after letting a number of students file into what would presumably be safety. However, nothing could have prepared the teacher for what she was to witness next.\n“I suddenly saw the shooter about twenty feet in front of me standing at the end of the hallway actively shooting down the hallway, just a barrage of bullets, and I’m staring at him thinking why are the police here,this is strange because he’s in full metal garb, helmet, face mask, bulletproof armor, shooting this rifle that I’ve never seen before,” Lippel told Good Morning America last Wednesday.\nThe brave teacher said she told fellow Stoneman Douglas H.S. teacher Scott Beigel, 35, to get back in his room just before the shooter fired a number of rounds into his room killing him and other students.\nAt this point, it wouldn’t surprise me to learn that Cruz’s AR-15 was never even fired. And frankly, this false flag appears to have been so ineptly staged that it also wouldn’t be a surprise to be informed that the ballistics eventually prove the rounds that were fired at the school were neither .223 Remington nor 5.56×45mm NATO. Which may be the reason why the school is being demolished.\nGun experts, what rifle or carbine that is standard issue for the Florida police fires .223 Remington or 5.56x45mm cartridges? I mean, one would naturally assume that whoever staged the false flag would be competent enough to use ammunition that is AR-15 compatible, but then, as Q informs us, these people are stupid.",
  "tags": [
    "guncontrol"
  ],
  "categories": [],
  "sitemap_lastmod": "2018-02-26T09:25:36+00:00"
}