{
  "url": "https://voxday.net/2018/02/04/the-secret-of-bill-belichick/",
  "scraped_at": "2025-12-19T10:41:59.632868",
  "title": "The secret of Bill Belichick",
  "date_display": "February 4, 2018",
  "date_iso": "2018-02-04T10:34:22+00:00",
  "date_from_url": "2018-02-04",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>I’ve been very impressed by Bill Belichick over the years. He is one of the greatest NFL coaches of all time, if not the greatest. But one thing has always confused me about him. He is both a superlative strategist AND a superlative tactician. This is not normal. In fact, this should not even be <i>possible</i>, due to the way that two entirely different types of thought processes are involved.</p><p>Now, an intelligent man can certainly perform both functions at an above-average level, but to be better than nearly everyone else at both is so unlikely that it borders on the impossible. However, it turns out that Belichick is not the rare exception after all, that he is merely a great tactician. How, then, has he become known as such a great football strategist as well?</p><p>The answer is that there are two Bill Belichicks. Or rather, there is a brilliant strategist who is entirely content to remain in Belichick’s shadow. The two best friends have been a team since their year together at Phillips Exeter Academy, but it is Ernie Adams, not Bill Belichick, who is the literal genius. The interesting thing is that neither the sports media nor most of the Patriots players truly understand <a href=\"http://www.weei.com/blogs/ryan-hannable/ernie-adams{f34b2ed14022567e3962d98ceb517f14c2acb643b80147bdb11c1357fe49acc6}E2{f34b2ed14022567e3962d98ceb517f14c2acb643b80147bdb11c1357fe49acc6}80{f34b2ed14022567e3962d98ceb517f14c2acb643b80147bdb11c1357fe49acc6}99-role-patriots-appears-be-discovered\">the nature of their incredibly effective partnership</a>.</p><blockquote><p>Ernie Adams is a man of mystery with the Patriots. He’s been with Bill Belichick for virtually his entire coaching career, but no one knows exactly what he does, even though he is at every practice and every game. We asked a number of Patriots players and coaches at media availability over the course of Super Bowl week what they know about him.</p><p>“I think he’s quality control,” rookie defensive tackle Adam Butler said. “He’s like checks and balances. I feel like he just checks and makes sure everyone is on the same page and is making sure we do things the way we want to.”</p><p>“Not much,” offensive lineman Ted Karras said. “He’s a guy that is around every day and does his job.”</p><p>Added safety Duron Harmon: “Ernie does a lot for this team. He helps obviously the coaching staff prepare for the games. I can’t give you too much information, but that is just what I would say. He does a good job helping the coaching staff make sure we’re prepared for our weekly matchups. Probably one of the smartest people in the building. He knows probably every rule in the rule book. That shows you how smart he is, how in-tune he is to the game and I think he’s a big part of what we accomplish here.”</p></blockquote><p>Unlike the other two, Harmon knows what’s up. Belichick is the leader and the tactical genius, and Adams is the strategic brain. He is a statistics quant who “helps the coaching staff” by writing the weekly game plans which Belichick then implements. In game development terms, Adams is the designer and Belichick is the producer. That’s how the Patriots are able to completely change their style from week to week. That’s also why it has almost been irrelevant who has been serving as offensive or defensive coordinator over the years, and why very successful OCs and DCs have struggled after leaving New England.</p><p><i>I remember I asked him about a play and he recalled a play from like the early 2000s and the game and the score. I was like, ‘Oh my Gosh.’</i></p><p>Bingo. Thanks to Adams, New England has led the way in the statistical analysis of pro football for nearly 20 years, which is why they always seem to be able to counter even the most effective opposition game plans and make adjustments to defeat it. The Patriots have been racing with intellectual turbo technology while all the other teams are normally aspirated. It’s a bit amusing to note that the sports media made a big deal about how Cleveland’s now-jettisoned management team was going with a quant-heavy approach two years ago when New England has been using it all along.</p><p>How do I know this? Well, you see, I have my own connections at Phillips Exeter Academy, both friends and family. And that’s why we’re not likely to see Brady leave New England before he retires, no matter what scenarios the media happens to concoct. Brady, more than anyone, understands how important Adams is to his historic success.</p><p>This also may explain why Belichick never talks much about football strategy. First, it’s really not his thing. And second, doing so would almost certainly reveal his unexpected limitations on the subject.</p></div>",
  "content_text": "I’ve been very impressed by Bill Belichick over the years. He is one of the greatest NFL coaches of all time, if not the greatest. But one thing has always confused me about him. He is both a superlative strategist AND a superlative tactician. This is not normal. In fact, this should not even be\npossible\n, due to the way that two entirely different types of thought processes are involved.\nNow, an intelligent man can certainly perform both functions at an above-average level, but to be better than nearly everyone else at both is so unlikely that it borders on the impossible. However, it turns out that Belichick is not the rare exception after all, that he is merely a great tactician. How, then, has he become known as such a great football strategist as well?\nThe answer is that there are two Bill Belichicks. Or rather, there is a brilliant strategist who is entirely content to remain in Belichick’s shadow. The two best friends have been a team since their year together at Phillips Exeter Academy, but it is Ernie Adams, not Bill Belichick, who is the literal genius. The interesting thing is that neither the sports media nor most of the Patriots players truly understand\nthe nature of their incredibly effective partnership\n.\nErnie Adams is a man of mystery with the Patriots. He’s been with Bill Belichick for virtually his entire coaching career, but no one knows exactly what he does, even though he is at every practice and every game. We asked a number of Patriots players and coaches at media availability over the course of Super Bowl week what they know about him.\n“I think he’s quality control,” rookie defensive tackle Adam Butler said. “He’s like checks and balances. I feel like he just checks and makes sure everyone is on the same page and is making sure we do things the way we want to.”\n“Not much,” offensive lineman Ted Karras said. “He’s a guy that is around every day and does his job.”\nAdded safety Duron Harmon: “Ernie does a lot for this team. He helps obviously the coaching staff prepare for the games. I can’t give you too much information, but that is just what I would say. He does a good job helping the coaching staff make sure we’re prepared for our weekly matchups. Probably one of the smartest people in the building. He knows probably every rule in the rule book. That shows you how smart he is, how in-tune he is to the game and I think he’s a big part of what we accomplish here.”\nUnlike the other two, Harmon knows what’s up. Belichick is the leader and the tactical genius, and Adams is the strategic brain. He is a statistics quant who “helps the coaching staff” by writing the weekly game plans which Belichick then implements. In game development terms, Adams is the designer and Belichick is the producer. That’s how the Patriots are able to completely change their style from week to week. That’s also why it has almost been irrelevant who has been serving as offensive or defensive coordinator over the years, and why very successful OCs and DCs have struggled after leaving New England.\nI remember I asked him about a play and he recalled a play from like the early 2000s and the game and the score. I was like, ‘Oh my Gosh.’\nBingo. Thanks to Adams, New England has led the way in the statistical analysis of pro football for nearly 20 years, which is why they always seem to be able to counter even the most effective opposition game plans and make adjustments to defeat it. The Patriots have been racing with intellectual turbo technology while all the other teams are normally aspirated. It’s a bit amusing to note that the sports media made a big deal about how Cleveland’s now-jettisoned management team was going with a quant-heavy approach two years ago when New England has been using it all along.\nHow do I know this? Well, you see, I have my own connections at Phillips Exeter Academy, both friends and family. And that’s why we’re not likely to see Brady leave New England before he retires, no matter what scenarios the media happens to concoct. Brady, more than anyone, understands how important Adams is to his historic success.\nThis also may explain why Belichick never talks much about football strategy. First, it’s really not his thing. And second, doing so would almost certainly reveal his unexpected limitations on the subject.",
  "tags": [
    "sports"
  ],
  "categories": [],
  "sitemap_lastmod": "2018-02-04T10:34:22+00:00"
}