{
  "url": "https://voxday.net/2018/02/11/the-anti-churchian-alt-right/",
  "scraped_at": "2025-12-19T10:43:03.123519",
  "title": "The anti-Churchian Alt-Right",
  "date_display": "February 11, 2018",
  "date_iso": "2018-02-11T13:12:26+00:00",
  "date_from_url": "2018-02-11",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>First Things gets the Alt-Right wrong by concentrating solely <a href=\"https://www.firstthings.com/article/2018/03/the-anti-christian-alt-right\">on the anti-Christian, media-dancing minority</a>:</p><blockquote><p>Almost everything written about the “alternative right” in mainstream outlets is wrong in one respect. The alt-right is not stupid. It is deep. Its ideas are not ridiculous. They are serious. To appreciate this fact, one needs to inquire beyond its presence on social media, where its obnoxious use of insult, obscenity, and racism has earned it a reputation for moral idiocy. The reputation is deserved, but do not be deceived. Behind its online tantrums and personal attacks are arguments of genuine power and expanding appeal. As political scientist George Hawley conceded in a recent study, “Everything we have seen over the past year suggests that the alt-right will be around for the foreseeable future.”</p><p>To what is the movement committed? The alt-right purports to defend the identity and interests of white people, who it believes are the compliant victims of a century-long swindle by liberal morality. Its goals are not conventionally conservative. It does not so much question as mock standard conservative positions on free trade, abortion, and foreign policy, regarding them as principles that currently abet white dispossession. Its own principles are not so abstract, and do not pretend to neutrality. Its creed, in the words of Richard Spencer, is “Race is real. Race matters. Race is the foundation of identity.” The media take such statements as proof of the alt-right’s commitment to white supremacy. But this is misleading. For the alt-right represents something more nefarious, and frankly more interesting, than white identity politics.</p><p>The alt-right is anti-Christian. Not by implication or insinuation, but by confession. Its leading thinkers flaunt their rejection of Christianity and their desire to convert believers away from it. Greg Johnson, an influential theorist with a doctorate in philosophy from Catholic University of America, argues that “Christianity is one of the main causes of white decline” and a “necessary condition of white racial suicide.” Johnson edits a website that publishes footnoted essays on topics that range from H. P. Lovecraft to Martin Heidegger, where a common feature is its subject’s criticisms of Christian doctrine. “Like acid, Christianity burns through ties of kinship and blood,” writes Gregory Hood, one of the website’s most talented essayists. It is “the essential religious step in paving the way for decadent modernity and its toxic creeds.”</p><p>Alt-right thinkers are overwhelmingly atheists, but their worldview is not rooted in the secular Enlightenment, nor is it irreligious. Far from it. Read deeply in their sources—and make no mistake, the alt-right has an intellectual tradition—and you will discover a movement that takes Christian thought and culture seriously. It is a conflicted tribute paid to their chief adversary. Against Christianity it makes two related charges. Beginning with the claim that Europe effectively created Christianity—not the other way around—it argues that Christian teachings have become socially and morally poisonous to the West. A major work of alt-right history opens with a widely echoed claim: “The introduction of Christianity has to count as the single greatest ideological catastrophe to ever strike Europe.”</p></blockquote><p>This is little more than Churchian virtue-signaling. The author should be embarrassed by making a mistake very similar to the one that he criticizes the mainstream media for making. Nor is his attempt to marginalize the Alt-Right as an intrinsically anti-Christian philosophy even remotely coherent, as one cannot both a) characterize its Spencerian aspects as defining its limits while simultaneously b) claiming that it is 100 years old and traces its intellectual roots back to Oswald Spengler.</p><p>What most people don’t realize is that the mainstream media still regularly contacts me for “the Alt-Right perspective” on current events. However, I no longer talk to them because <i>they never, ever, quoted me </i>in the pieces on the Alt-Right they subsequently ran, even when I provided <i>The New York Times</i>, or <i>The Atlantic</i>, or <i>CBS </i>with direct, substantive, and unevasive answers to their questions. The reason they never ran any quotes, of course, is that my words did not fit their preconceived narrative, while the media-dancing performance art of Richard Spencer and Andrew Anglin did, just as Greg Johnson’s anti-Christianity and homosexuality fits the narrative that Matthew Rose and <i>First Things</i> are pushing in order to discredit and demonize the Alt-Right in the eyes of its readership.</p><p>But their efforts will fail and they will only discredit themselves, because they are observably not rooted in the easily verifiable truth. The Alt-Right doesn’t just stand for the European races, but for the West. And Christianity is as <i>integral </i>and <i>irreplaceable </i>an element of Western civilization as the European races; it is one of the three pillars of the West. The Alt-Right supports genuine Bible-based traditional Christianity, not the evil globalist Churchianity that presently wears so many nominally Christian organizations like a demon-possessed skinsuit.</p><p>To be clear, I’m not blaming Greg, Richard, or Andrew for the fact that both the mainstream media and the Christian media happen to find their particular perspectives to be useful. I am simply pointing out that, once again, the media simply <i>cannot be trusted</i> to report on philosophical matters such as these in an accurate, honest, or intelligent manner.</p><p>The Alt-Right is not an anti-Christian philosophy. It is pro-Christian and anti-Churchian. And as Instapundit noted, “with most churches being temples of social justice”, the open enmity between the globalist Judeo Christ-worshiping Churchians and both the Christian and non-Christian factions of the Alt-Right is hardly a surprise.</p></div>",
  "content_text": "First Things gets the Alt-Right wrong by concentrating solely\non the anti-Christian, media-dancing minority\n:\nAlmost everything written about the “alternative right” in mainstream outlets is wrong in one respect. The alt-right is not stupid. It is deep. Its ideas are not ridiculous. They are serious. To appreciate this fact, one needs to inquire beyond its presence on social media, where its obnoxious use of insult, obscenity, and racism has earned it a reputation for moral idiocy. The reputation is deserved, but do not be deceived. Behind its online tantrums and personal attacks are arguments of genuine power and expanding appeal. As political scientist George Hawley conceded in a recent study, “Everything we have seen over the past year suggests that the alt-right will be around for the foreseeable future.”\nTo what is the movement committed? The alt-right purports to defend the identity and interests of white people, who it believes are the compliant victims of a century-long swindle by liberal morality. Its goals are not conventionally conservative. It does not so much question as mock standard conservative positions on free trade, abortion, and foreign policy, regarding them as principles that currently abet white dispossession. Its own principles are not so abstract, and do not pretend to neutrality. Its creed, in the words of Richard Spencer, is “Race is real. Race matters. Race is the foundation of identity.” The media take such statements as proof of the alt-right’s commitment to white supremacy. But this is misleading. For the alt-right represents something more nefarious, and frankly more interesting, than white identity politics.\nThe alt-right is anti-Christian. Not by implication or insinuation, but by confession. Its leading thinkers flaunt their rejection of Christianity and their desire to convert believers away from it. Greg Johnson, an influential theorist with a doctorate in philosophy from Catholic University of America, argues that “Christianity is one of the main causes of white decline” and a “necessary condition of white racial suicide.” Johnson edits a website that publishes footnoted essays on topics that range from H. P. Lovecraft to Martin Heidegger, where a common feature is its subject’s criticisms of Christian doctrine. “Like acid, Christianity burns through ties of kinship and blood,” writes Gregory Hood, one of the website’s most talented essayists. It is “the essential religious step in paving the way for decadent modernity and its toxic creeds.”\nAlt-right thinkers are overwhelmingly atheists, but their worldview is not rooted in the secular Enlightenment, nor is it irreligious. Far from it. Read deeply in their sources—and make no mistake, the alt-right has an intellectual tradition—and you will discover a movement that takes Christian thought and culture seriously. It is a conflicted tribute paid to their chief adversary. Against Christianity it makes two related charges. Beginning with the claim that Europe effectively created Christianity—not the other way around—it argues that Christian teachings have become socially and morally poisonous to the West. A major work of alt-right history opens with a widely echoed claim: “The introduction of Christianity has to count as the single greatest ideological catastrophe to ever strike Europe.”\nThis is little more than Churchian virtue-signaling. The author should be embarrassed by making a mistake very similar to the one that he criticizes the mainstream media for making. Nor is his attempt to marginalize the Alt-Right as an intrinsically anti-Christian philosophy even remotely coherent, as one cannot both a) characterize its Spencerian aspects as defining its limits while simultaneously b) claiming that it is 100 years old and traces its intellectual roots back to Oswald Spengler.\nWhat most people don’t realize is that the mainstream media still regularly contacts me for “the Alt-Right perspective” on current events. However, I no longer talk to them because\nthey never, ever, quoted me\nin the pieces on the Alt-Right they subsequently ran, even when I provided\nThe New York Times\n, or\nThe Atlantic\n, or\nCBS\nwith direct, substantive, and unevasive answers to their questions. The reason they never ran any quotes, of course, is that my words did not fit their preconceived narrative, while the media-dancing performance art of Richard Spencer and Andrew Anglin did, just as Greg Johnson’s anti-Christianity and homosexuality fits the narrative that Matthew Rose and\nFirst Things\nare pushing in order to discredit and demonize the Alt-Right in the eyes of its readership.\nBut their efforts will fail and they will only discredit themselves, because they are observably not rooted in the easily verifiable truth. The Alt-Right doesn’t just stand for the European races, but for the West. And Christianity is as\nintegral\nand\nirreplaceable\nan element of Western civilization as the European races; it is one of the three pillars of the West. The Alt-Right supports genuine Bible-based traditional Christianity, not the evil globalist Churchianity that presently wears so many nominally Christian organizations like a demon-possessed skinsuit.\nTo be clear, I’m not blaming Greg, Richard, or Andrew for the fact that both the mainstream media and the Christian media happen to find their particular perspectives to be useful. I am simply pointing out that, once again, the media simply\ncannot be trusted\nto report on philosophical matters such as these in an accurate, honest, or intelligent manner.\nThe Alt-Right is not an anti-Christian philosophy. It is pro-Christian and anti-Churchian. And as Instapundit noted, “with most churches being temples of social justice”, the open enmity between the globalist Judeo Christ-worshiping Churchians and both the Christian and non-Christian factions of the Alt-Right is hardly a surprise.",
  "tags": [
    "media"
  ],
  "categories": [],
  "sitemap_lastmod": "2018-02-11T13:12:26+00:00"
}