{
  "url": "https://voxday.net/2018/02/09/the-horrors-of-the-lgbt-household/",
  "scraped_at": "2025-12-19T10:42:46.509783",
  "title": "The horrors of the LGBT household",
  "date_display": "February 9, 2018",
  "date_iso": "2018-02-09T01:42:33+00:00",
  "date_from_url": "2018-02-09",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>Lifesite profiles <a href=\"https://www.lifesitenews.com/news/daughter-of-famed-sci-fi-author-reveals-sexual-horrors-she-suffered-growing?utm_content=bufferbaefc&amp;utm_medium=WCDM{f34b2ed14022567e3962d98ceb517f14c2acb643b80147bdb11c1357fe49acc6}2BBuffer&amp;utm_source=facebook&amp;utm_campaign=WCDM\">Moira Greyland’s autobiographical memoir</a>:</p><blockquote><p>The daughter of famed science fiction author Marion Zimmer Bradley has written an autobiographical account revealing the horrors of growing up in a home raised by LGBT parents who repeatedly sexually abused her and her brothers.</p><p>“I have heard all the customary protestations. ‘Your parents were evil because they were evil, not because they were gay,’ but I disagree,” writes Moira Greyland in her new book, <i><b><a href=\"http://amzn.to/2C8tpQl\">The Last Closet: The Dark Side of Avalon</a></b></i>.</p><p>“The underlying problem is a philosophical one that is based on beliefs that are not only common to gay culture but to popular culture. And this is the central belief: All Sex is Always Right No Matter What,” she wrote.</p><p>“I had both biological parents in the home, but both refused to act like traditional parents,” writes Greyland. “I needed my father to protect me and to see me as a girl instead of refusing to protect me and seeing me as an amorphous nothing who competed with him for boys. I needed my mother to love me and hold me and comfort me instead of being a terrifying, angry dictator. Worse than that, I was expected to not want them to love me and protect me, or to act like normal parents. I was supposed to be happy that they were doing their own thing, no matter what they did to us.”</p><p><i>The Last Closet </i>has been an Amazon bestseller for weeks as a Kindle e-book, and is scheduled to be published as a print book this month. Over one hundred readers have reviewed it, and virtually all have given it five stars.</p><p>The book recounts Greyland’s life with her mother, who was the author of <i>The Mists of Avalon</i> and many other famous works of science fiction and fantasy, and her father, Walter Breen, who was a world-renowned authority on numismatics. Both identified as “gay,” both abused drugs and were involved in occult practices, and both were pedophiles, Greyland says, a claim that has been confirmed by her only surviving brother.</p></blockquote><p>Man people desperately want to believe homosexuals Are Just Like Everybody Else. <a href=\"http://www.dailymail.co.uk/news/article-5057913/Gay-father-murdered-adopted-daughter-jailed.html\">But they are not</a>. Just ask a policeman. Or ask a child of gay parents. Once an individual decides that he no longer has to abide by traditional morality because he has certain urges, it becomes considerably easier to violate even the most outrageous moral norms when he feels the need or even just the desire.</p><p>That doesn’t mean that gays can’t abide by traditional moral standards, or that all straights do, only that the probabilities observably differ. A gay man is 14 times more likely to abuse a child than a straight man. Even worse, gay priests are <a href=\"http://voxday.blogspot.com/2004/02/and-this-is-surprise-how.html\">198 times more likely</a> to abuse children than straight men. One of the ugliest aspects of <i>The Last Closet </i>is the way in which Moira’s parents intellectually rationalized even their most abhorrent behavior. They were not unique in their ability to do that.</p><p>You can shriek “bigot” and “homophobe” if you like. But reality doesn’t care. No amount of denial will eliminate the logic, the probabilities, the statistics, or the pain of the abused children.</p></div>",
  "content_text": "Lifesite profiles\nMoira Greyland’s autobiographical memoir\n:\nThe daughter of famed science fiction author Marion Zimmer Bradley has written an autobiographical account revealing the horrors of growing up in a home raised by LGBT parents who repeatedly sexually abused her and her brothers.\n“I have heard all the customary protestations. ‘Your parents were evil because they were evil, not because they were gay,’ but I disagree,” writes Moira Greyland in her new book,\nThe Last Closet: The Dark Side of Avalon\n.\n“The underlying problem is a philosophical one that is based on beliefs that are not only common to gay culture but to popular culture. And this is the central belief: All Sex is Always Right No Matter What,” she wrote.\n“I had both biological parents in the home, but both refused to act like traditional parents,” writes Greyland. “I needed my father to protect me and to see me as a girl instead of refusing to protect me and seeing me as an amorphous nothing who competed with him for boys. I needed my mother to love me and hold me and comfort me instead of being a terrifying, angry dictator. Worse than that, I was expected to not want them to love me and protect me, or to act like normal parents. I was supposed to be happy that they were doing their own thing, no matter what they did to us.”\nThe Last Closet\nhas been an Amazon bestseller for weeks as a Kindle e-book, and is scheduled to be published as a print book this month. Over one hundred readers have reviewed it, and virtually all have given it five stars.\nThe book recounts Greyland’s life with her mother, who was the author of\nThe Mists of Avalon\nand many other famous works of science fiction and fantasy, and her father, Walter Breen, who was a world-renowned authority on numismatics. Both identified as “gay,” both abused drugs and were involved in occult practices, and both were pedophiles, Greyland says, a claim that has been confirmed by her only surviving brother.\nMan people desperately want to believe homosexuals Are Just Like Everybody Else.\nBut they are not\n. Just ask a policeman. Or ask a child of gay parents. Once an individual decides that he no longer has to abide by traditional morality because he has certain urges, it becomes considerably easier to violate even the most outrageous moral norms when he feels the need or even just the desire.\nThat doesn’t mean that gays can’t abide by traditional moral standards, or that all straights do, only that the probabilities observably differ. A gay man is 14 times more likely to abuse a child than a straight man. Even worse, gay priests are\n198 times more likely\nto abuse children than straight men. One of the ugliest aspects of\nThe Last Closet\nis the way in which Moira’s parents intellectually rationalized even their most abhorrent behavior. They were not unique in their ability to do that.\nYou can shriek “bigot” and “homophobe” if you like. But reality doesn’t care. No amount of denial will eliminate the logic, the probabilities, the statistics, or the pain of the abused children.",
  "tags": [
    "books"
  ],
  "categories": [],
  "sitemap_lastmod": "2018-02-09T01:42:33+00:00"
}