{
  "url": "https://voxday.net/2018/02/01/the-crime-of-noticing/",
  "scraped_at": "2025-12-19T10:41:32.171394",
  "title": "The crime of noticing",
  "date_display": "February 1, 2018",
  "date_iso": "2018-02-01T14:15:19+00:00",
  "date_from_url": "2018-02-01",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p><a href=\"http://www.dailymail.co.uk/sport/sportsnews/article-5335207/West-Ham-director-sparks-race-row-African-stars.html\">West Ham United is under fire</a> because the director of transfers is both astute enough to realize that fielding an all-African soccer team is sub-optimal player management and naive enough to have explained his reasoning.</p><blockquote><p>Henry sent an email on January 27 — in response to an inquiry about a footballer of Cameroonian descent — to another senior West Ham official and an agent. In the email, Henry wrote: ‘We don’t want any more Africans and he’s not good enough. I sent Thomas to watch him and the other lad last week and he said no. If Palace take them good luck.’ Sportsmail knows the identity of both recipients but a stipulation before being sent the email was that they should remain anonymous.</p><p>Henry was asked if there is a club policy regarding African players. Initially he replied ‘no’, only to be informed that we understand he has told more than one agent in the last month that the club does not want any more African players.</p><p>Henry then confirmed it was true and suggested it was a policy supported by club management. ‘Yeah,’ Henry replied. ‘Because we had three and we felt we didn’t particularly want any more African players.’</p><p>Asked why, Henry replied: ‘Erm, no reason. It’s nothing racist at all. It’s just sometimes they can have a bad attitude.</p><p>‘We had problems with Sakho, with Diafra Sakho. We find that when they are not in the team they cause mayhem. It’s nothing against the African race at all.</p><p>‘I mean, look, there are top African players. There’s not a problem with them. It’s just sometimes they cause a lot of problems when they are not playing, as we had with Diafra. He’s left, so great. It’s nothing personal at all.’</p><p>Asked if he thought his view was discriminatory towards African players, Henry asked: ‘In what way?’</p><p>Asked then if he thought his comments amounted to a slight on African players, he replied: ‘No. I don’t know what you are trying to get at here. All I said was, look, we have a great lad in Kouyate, he’s brilliant, a great player for us, he’s a good lad.</p><p>‘But the likes of Sakho have caused mayhem. When he’s not playing … he always wants a new deal. That’s all it was. It was nothing discriminatory at all.</p><p>‘I could say we get offered Russian players. I just find with Russian players that they don’t settle in England. It’s like Italians. How many Italians come and settle in England? As a club we are not discriminatory at all.</p><p>‘If you’ve got too many, they all sit together and it becomes a situation where you can have problems. But then you can have problems with English players. I don’t know what you are driving at.’</p></blockquote><p>The ironic thing is that West Ham already has six Africans on the first team that the director brought in. So, the man is clearly not racist or unwilling to employ Africans. What is he supposed to do, bring in more players they think aren’t good enough to start and are likely to cause trouble because they have too much time on their hands?</p><p>This is one reason I never explain myself or my reasoning to anyone anymore, except when I feel that doing so is going to serve my objectives in some way. I certainly don’t explain myself in response to questions, much less demands that I do so. It is almost as important to never explain your reasons for your actions as it is to never apologize. Just as an apology is taken by some as an admission of guilt, an explanation is taken as an invitation to a debate.</p><p>Consider the difference when you’re asked if you are going to go somewhere you don’t want to go.</p><ol><li><i>Are you going to the meeting?</i> No. <i>Why not?</i> I am not going. <i>Um, well, okay….</i></li><li><i><i>Are you going to the meeting?</i> </i>No. <i>Why not?</i> Well, I’m busy. <i>Come on, I can see that you’re not that busy.</i> Well, also, I don’t like so-and-so. <i>I don’t think he’s going to be there. And even if he is, you can just ignore him.</i> But… but I don’t want to go! <i>Well, you have no reason not to go. Disqualified. See you there at three!</i></li></ol><p>No matter what reasoning you provide, someone can <i>always </i>invent an excuse to not accept that reasoning and then insist that you have to do what you don’t want to do or that you truly are what you deny being. So don’t give them the opening. All Henry should have said was “no, we don’t want him.” That would have saved him his job and his club a considerable amount of trouble.</p><p>And when people ask “why”, just tell them “what part of ‘no’ did you find hard to understand? I am not in the habit of explaining myself.” While there are those to whom we owe explanations, the vast majority of people who ask for explanations do not merit them. I get emails every day asking me to explain my position on X, Y, or Z. In most cases, I simply ignore them.</p><p>The only correct response to “I don’t understand why you believe XYZ” is “I don’t care what you understand.” The vast majority of people demanding explanations are not seeking to learn, they are seeking to <i>argue</i>.</p></div>",
  "content_text": "West Ham United is under fire\nbecause the director of transfers is both astute enough to realize that fielding an all-African soccer team is sub-optimal player management and naive enough to have explained his reasoning.\nHenry sent an email on January 27 — in response to an inquiry about a footballer of Cameroonian descent — to another senior West Ham official and an agent. In the email, Henry wrote: ‘We don’t want any more Africans and he’s not good enough. I sent Thomas to watch him and the other lad last week and he said no. If Palace take them good luck.’ Sportsmail knows the identity of both recipients but a stipulation before being sent the email was that they should remain anonymous.\nHenry was asked if there is a club policy regarding African players. Initially he replied ‘no’, only to be informed that we understand he has told more than one agent in the last month that the club does not want any more African players.\nHenry then confirmed it was true and suggested it was a policy supported by club management. ‘Yeah,’ Henry replied. ‘Because we had three and we felt we didn’t particularly want any more African players.’\nAsked why, Henry replied: ‘Erm, no reason. It’s nothing racist at all. It’s just sometimes they can have a bad attitude.\n‘We had problems with Sakho, with Diafra Sakho. We find that when they are not in the team they cause mayhem. It’s nothing against the African race at all.\n‘I mean, look, there are top African players. There’s not a problem with them. It’s just sometimes they cause a lot of problems when they are not playing, as we had with Diafra. He’s left, so great. It’s nothing personal at all.’\nAsked if he thought his view was discriminatory towards African players, Henry asked: ‘In what way?’\nAsked then if he thought his comments amounted to a slight on African players, he replied: ‘No. I don’t know what you are trying to get at here. All I said was, look, we have a great lad in Kouyate, he’s brilliant, a great player for us, he’s a good lad.\n‘But the likes of Sakho have caused mayhem. When he’s not playing … he always wants a new deal. That’s all it was. It was nothing discriminatory at all.\n‘I could say we get offered Russian players. I just find with Russian players that they don’t settle in England. It’s like Italians. How many Italians come and settle in England? As a club we are not discriminatory at all.\n‘If you’ve got too many, they all sit together and it becomes a situation where you can have problems. But then you can have problems with English players. I don’t know what you are driving at.’\nThe ironic thing is that West Ham already has six Africans on the first team that the director brought in. So, the man is clearly not racist or unwilling to employ Africans. What is he supposed to do, bring in more players they think aren’t good enough to start and are likely to cause trouble because they have too much time on their hands?\nThis is one reason I never explain myself or my reasoning to anyone anymore, except when I feel that doing so is going to serve my objectives in some way. I certainly don’t explain myself in response to questions, much less demands that I do so. It is almost as important to never explain your reasons for your actions as it is to never apologize. Just as an apology is taken by some as an admission of guilt, an explanation is taken as an invitation to a debate.\nConsider the difference when you’re asked if you are going to go somewhere you don’t want to go.\nAre you going to the meeting?\nNo.\nWhy not?\nI am not going.\nUm, well, okay….\nAre you going to the meeting?\nNo.\nWhy not?\nWell, I’m busy.\nCome on, I can see that you’re not that busy.\nWell, also, I don’t like so-and-so.\nI don’t think he’s going to be there. And even if he is, you can just ignore him.\nBut… but I don’t want to go!\nWell, you have no reason not to go. Disqualified. See you there at three!\nNo matter what reasoning you provide, someone can\nalways\ninvent an excuse to not accept that reasoning and then insist that you have to do what you don’t want to do or that you truly are what you deny being. So don’t give them the opening. All Henry should have said was “no, we don’t want him.” That would have saved him his job and his club a considerable amount of trouble.\nAnd when people ask “why”, just tell them “what part of ‘no’ did you find hard to understand? I am not in the habit of explaining myself.” While there are those to whom we owe explanations, the vast majority of people who ask for explanations do not merit them. I get emails every day asking me to explain my position on X, Y, or Z. In most cases, I simply ignore them.\nThe only correct response to “I don’t understand why you believe XYZ” is “I don’t care what you understand.” The vast majority of people demanding explanations are not seeking to learn, they are seeking to\nargue\n.",
  "tags": [
    "sports"
  ],
  "categories": [],
  "sitemap_lastmod": "2018-02-01T14:15:19+00:00"
}