{
  "url": "https://voxday.net/2018/02/17/usmc-lowers-officer-standards/",
  "scraped_at": "2025-12-19T10:43:45.110237",
  "title": "USMC lowers officer standards",
  "date_display": "February 17, 2018",
  "date_iso": "2018-02-17T10:53:07+00:00",
  "date_from_url": "2018-02-17",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>Because gender equality <a href=\"http://tribunist.com/news/the-marine-corps-drops-major-obstacle-to-female-infantry-officers/\">is more important</a> than winning wars. And why not? Seriously. It’s not as if the US Armed Forces have been defending the nation or its borders for the last 60 years anyhow.</p><blockquote><p>The Marine Corps has made a major change to its Infantry Officer Course. The first big challenge for many was a test of physical fitness. If you passed, you moved on. If you didn’t, you washed out. The test was especially difficult for women who had to meet the same standard as the men. Not anymore.</p><p>The Infantry Officer Course now uses the physical fitness test as an exercise, and not a pass/fail requirement.</p><p>Officials with Marine Corps Training and Education Command told Military.com “that Marine Corps Commandant Gen. Robert Neller had made a decision in November to transform the test from a high-stakes hurdle to an assessment from which students can drop without risking their place in the course.”</p><p>“[Neller] approved modifications to the IOC [program of instruction] to better tie student evaluation and graduation requirements to published infantry training and readiness manual, military occupational specialty specific performance standards, and operating force requirements,” TECOM officials said in a statement.</p></blockquote><p>As the student evaluation and graduation requirements gravitate towards female-friendly subjective homework and classroom attendance standards rather than objective physical standards, we can expect women to increasingly not only complete the Infantry Officer Course, but excel in it. Which, over time, will lead to the consequences explained by Martin Van Creveld and quoted in <i>SJWs Always Double Down</i>:</p><p><i>As Martin van Creveld, the Israeli military historian has noted, the more women enter any professional field, the more men leave it. And as the men depart, so to do the prestige and the economic rewards provided by the field. This creates a vicious cycle that both expels existing men from the field while repelling new men from entering it.</i></p><p>If the universities can be considered a reliable model, we’re about three decades away from a majority female Marine Corps. No wonder China is content to patiently wait for its opportunity. This marks the second step in the end of the USMC’s historical prestige. Even current female Marine officers understand this.</p><blockquote class=\"tr_bq\"><p>“Changing this rite of passage will be doing female Marines no favors in trying to be infantry officers,” Marine 2nd Lt. Emma Stokien, a Marine Corps intelligence officer, wrote. “Female Marines often have to work much harder than their peers to earn the same respect, and entering the infantry under the dark cloud of even perceived lowered standards will make this a practically impossible challenge and potentially cause real harm to unit cohesion and the faith between leader and led.”</p></blockquote><p>Permitting women to join the Marine Corps was the first mistake. Unqualified female officers are the second one. But the empire is in decline, and so these events are not even remotely surprising. There will be more unnecessary mistakes in the future and they will be more and more disastrous, until the empire “unexpectedly” crumbles for “no reason at all.”</p></div>",
  "content_text": "Because gender equality\nis more important\nthan winning wars. And why not? Seriously. It’s not as if the US Armed Forces have been defending the nation or its borders for the last 60 years anyhow.\nThe Marine Corps has made a major change to its Infantry Officer Course. The first big challenge for many was a test of physical fitness. If you passed, you moved on. If you didn’t, you washed out. The test was especially difficult for women who had to meet the same standard as the men. Not anymore.\nThe Infantry Officer Course now uses the physical fitness test as an exercise, and not a pass/fail requirement.\nOfficials with Marine Corps Training and Education Command told Military.com “that Marine Corps Commandant Gen. Robert Neller had made a decision in November to transform the test from a high-stakes hurdle to an assessment from which students can drop without risking their place in the course.”\n“[Neller] approved modifications to the IOC [program of instruction] to better tie student evaluation and graduation requirements to published infantry training and readiness manual, military occupational specialty specific performance standards, and operating force requirements,” TECOM officials said in a statement.\nAs the student evaluation and graduation requirements gravitate towards female-friendly subjective homework and classroom attendance standards rather than objective physical standards, we can expect women to increasingly not only complete the Infantry Officer Course, but excel in it. Which, over time, will lead to the consequences explained by Martin Van Creveld and quoted in\nSJWs Always Double Down\n:\nAs Martin van Creveld, the Israeli military historian has noted, the more women enter any professional field, the more men leave it. And as the men depart, so to do the prestige and the economic rewards provided by the field. This creates a vicious cycle that both expels existing men from the field while repelling new men from entering it.\nIf the universities can be considered a reliable model, we’re about three decades away from a majority female Marine Corps. No wonder China is content to patiently wait for its opportunity. This marks the second step in the end of the USMC’s historical prestige. Even current female Marine officers understand this.\n“Changing this rite of passage will be doing female Marines no favors in trying to be infantry officers,” Marine 2nd Lt. Emma Stokien, a Marine Corps intelligence officer, wrote. “Female Marines often have to work much harder than their peers to earn the same respect, and entering the infantry under the dark cloud of even perceived lowered standards will make this a practically impossible challenge and potentially cause real harm to unit cohesion and the faith between leader and led.”\nPermitting women to join the Marine Corps was the first mistake. Unqualified female officers are the second one. But the empire is in decline, and so these events are not even remotely surprising. There will be more unnecessary mistakes in the future and they will be more and more disastrous, until the empire “unexpectedly” crumbles for “no reason at all.”",
  "tags": [
    "declineandfall"
  ],
  "categories": [],
  "sitemap_lastmod": "2018-02-17T10:53:07+00:00"
}