{
  "url": "https://voxday.net/2018/02/02/were-2/",
  "scraped_at": "2025-12-19T10:41:41.863731",
  "title": "We’re #2",
  "date_display": "February 2, 2018",
  "date_iso": "2018-02-02T13:14:43+00:00",
  "date_from_url": "2018-02-02",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>Things have been quiet at Infogalactic lately, and they will continue to be quiet even as we continue to improve performance, until DONTPANIC is ready to bring the noise, but you can bet that Wikipedia is aware that it exists now. This is #2 on Breitbart’s list of <a href=\"http://www.breitbart.com/tech/2018/02/01/five-of-the-best-examples-of-left-wing-bias-on-wikipedia-in-2017/\">the Best Examples of Left-wing Bias on Wikipedia in 2017</a>:</p><blockquote><p><b>2. Burying CNN’s Blackmail controversy and other scandals at the network</b></p><p>Shortly after CNN’s blackmail controversy, an editor created a page on the topic. Other editors promptly had the story buried by moving the content  into the bottom section of an article about CNN controversies. Roughly two dozen editors, mostly left-wing, supported this move citing a policy that says Wikipedia is not for news. Five of these editors showed a double standard, having previously voted to keep an article on Trump’s disclosure of intelligence about ISIS threats in a meeting with Russia where the same policy would apply.</p><p>A few editors went even further by cutting out critical information on the blackmail controversy from even the general CNN controversies article, as well as gutting nearly a third of the article’s content covering a variety of scandals that gripped the network, despite much of it being backed by sources considered reliable by Wikipedia standards. These removals included a section on CNN New Year’s Eve host Kathy Griffin’s firing from the network, which was justified by claiming it wasn’t a CNN controversy. The same argument was used to keep out mention of undercover journalist James O’Keefe’s video series on CNN, itself denied its own article by many of the same editors.</p><p>Only a small amount of the removed content had been restored after the flurry of deletions. When the situation was mentioned on the Vox Popoli blog of science fiction author Vox Day, the founder of Wikipedia alternative Infogalactic, an editor sought to restore noteworthy content about the blackmail controversy and was immediately reverted.</p></blockquote><p>Scandalous! The mainstream media won’t cover this, of course, but that’s fine. More and more people are routing around them every day.</p><p>But this underlines the importance of Infogalactic. Do take the trouble to thank the Burn Unit, which make it run. And if you’re using Infogalactic, <a href=\"http://infogalactic.com/info/Infogalactic:Donations\">consider joining it</a>. The thing about foundational structures like Infogalactic is that they’re neither sexy nor exciting. That’s why people pay so little attention to them even when they rely upon them heavily. The thing is, they are<i> absolutely vital</i>. Which, of course, is why I prioritized it in the first place.</p><p>Note that only 561 of Wikipedia’s 1,237 administrators are active now. We have a LONG way to go, but it is doable. And the more that Wikipedia is converged by its admins, the easier our long march becomes.</p></div>",
  "content_text": "Things have been quiet at Infogalactic lately, and they will continue to be quiet even as we continue to improve performance, until DONTPANIC is ready to bring the noise, but you can bet that Wikipedia is aware that it exists now. This is #2 on Breitbart’s list of\nthe Best Examples of Left-wing Bias on Wikipedia in 2017\n:\n2. Burying CNN’s Blackmail controversy and other scandals at the network\nShortly after CNN’s blackmail controversy, an editor created a page on the topic. Other editors promptly had the story buried by moving the content  into the bottom section of an article about CNN controversies. Roughly two dozen editors, mostly left-wing, supported this move citing a policy that says Wikipedia is not for news. Five of these editors showed a double standard, having previously voted to keep an article on Trump’s disclosure of intelligence about ISIS threats in a meeting with Russia where the same policy would apply.\nA few editors went even further by cutting out critical information on the blackmail controversy from even the general CNN controversies article, as well as gutting nearly a third of the article’s content covering a variety of scandals that gripped the network, despite much of it being backed by sources considered reliable by Wikipedia standards. These removals included a section on CNN New Year’s Eve host Kathy Griffin’s firing from the network, which was justified by claiming it wasn’t a CNN controversy. The same argument was used to keep out mention of undercover journalist James O’Keefe’s video series on CNN, itself denied its own article by many of the same editors.\nOnly a small amount of the removed content had been restored after the flurry of deletions. When the situation was mentioned on the Vox Popoli blog of science fiction author Vox Day, the founder of Wikipedia alternative Infogalactic, an editor sought to restore noteworthy content about the blackmail controversy and was immediately reverted.\nScandalous! The mainstream media won’t cover this, of course, but that’s fine. More and more people are routing around them every day.\nBut this underlines the importance of Infogalactic. Do take the trouble to thank the Burn Unit, which make it run. And if you’re using Infogalactic,\nconsider joining it\n. The thing about foundational structures like Infogalactic is that they’re neither sexy nor exciting. That’s why people pay so little attention to them even when they rely upon them heavily. The thing is, they are\nabsolutely vital\n. Which, of course, is why I prioritized it in the first place.\nNote that only 561 of Wikipedia’s 1,237 administrators are active now. We have a LONG way to go, but it is doable. And the more that Wikipedia is converged by its admins, the easier our long march becomes.",
  "tags": [
    "Infogalactic"
  ],
  "categories": [],
  "sitemap_lastmod": "2018-02-02T13:14:43+00:00"
}