{
  "url": "https://voxday.net/2021/11/10/and-now-we-know-why/",
  "scraped_at": "2026-01-08T12:58:37.875115",
  "title": "And Now We Know Why",
  "date_display": "November 10, 2021",
  "date_iso": "2021-11-10T10:21:51+00:00",
  "date_from_url": "2021-11-10",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>A few years ago, in 2015, I presented <a href=\"https://voxday.net/2015/12/28/mailvox-where-are-connections/\">evidence that strongly suggested</a> that the rumors concerning Arthur C. Clarke being a pedophile were correct. However, the initial public reports by a reporter working for <em>News of the World</em> and the <em>Sunday Mirror</em> were never followed up on by the media and were subsequently dismissed as aberrations without anyone ever actually being refuted. <a href=\"https://www.independent.co.uk/news/media/press/notw-editor-spiked-paedophilia-scoop-on-arthur-c-clarke-for-fear-of-murdoch-7920816.html\">Now we know why</a> they never led anywhere.</p><blockquote class=\"wp-block-quote is-layout-flow wp-block-quote-is-layout-flow\"><p>The News of the World spiked an exclusive story exposing the science fiction writer Arthur C Clarke as a paedophile, according to a new book about life inside the newspaper whose closure was announced a year ago today.</p><p>In Hack, an account of his nerve-shredding days as a reporter on the News of the World and then the Sunday Mirror, Graham Johnson claims that although the NOTW prided itself on outing pederasts, editors made an exception for Mr Clarke because he was a friend of Rupert Murdoch.</p><p>Through BSkyB, the tycoon commercially exploited the futurologist’s theory that satellites would be ideal for communications and praised him in public. As a result, according to Mr Johnson, who by that time had been sacked by the NOTW and had joined the Sunday Mirror, a story by reporter Roger Insall about Mr Clarke’s alleged abuse of adolescent boys was never published for fear of upsetting the proprietor.</p><p>Tipped off about the story, the Sunday Mirror sent Mr Johnson to Colombo, where he extracted an confession from the author that he paid boys for sex. “I have never had the slightest interest in children – boys or girls. They should be treated in the same way. But once they have reached the age of puberty, then it is OK,” Mr Clarke was quoted as saying in the Sunday Mirror. “If the kids enjoy it and don’t mind it doesn’t do any harm … there is a hysteria about the whole thing in the West.”</p><p>Mr Clarke subsequently denied he was a paedophile, saying: “The allegations are wholly denied.” But he never sued the Sunday Mirror and died aged 90 at his Sri Lanka home in 2008.</p><p>Speaking to The Independent yesterday, Mr Johnson said: “Roger [Insall] said that because Arthur C Clarke was a mate of Rupert Murdoch, the editor wasn’t having any of it and despite Roger getting a lot of evidence that Clarke was a paedophile they wouldn’t publish it.”</p></blockquote><p>It’s probably not a coincidence that Murdoch has himself been accused of harboring similar predilections.</p><p>Full disclosure: Castalia House publishes several Clarke stories in the <a href=\"https://www.amazon.com/dp/B078MN9XSJ?binding=paperback&amp;ref=dbs_dp_rwt_sb_tpbk\" rel=\"noreferrer noopener\" target=\"_blank\">THERE WILL BE WAR series</a>. We will continue to publish them despite our belief in Mr. Clarke’s misdeeds because a) they are very good stories, b) I do not believe the work is inseparable from the author, and c) Mr. Clarke derives zero benefit from their publication.</p><p>In like manner, we will not refuse to publish H.P. Lovecraft because he is accused of racism, John C. Wright because he is accused of Catholicism, Vox Day because he is accused of white supremacism, or Owen Benjamin because he is accused of heightism, regardless of how substantive or insubstantial the accusations may be.</p><p><strong>UPDATE:</strong> A reader writes about his experience meeting Mr. Clarke in Sri Lanka.</p><p><em>Very interesting post about Arthur C. Clarke. I actually met him in spring 1988 at his house in Colombo, Sri Lanka, where I found him simply by looking in the phone book, called the number, and he answered and invited me over straightaway. I was delighted to meet him, but very surprised to see something like ten to fifteen 11-year-olds running around the house like pets. I was 19 at the time, and made no question of it, just noted it in my head. </em></p><p><em>A few weeks later I met an expat living in Sri Lanka who said there were two reasons why Arthur C. Clarke moved to the remote island nation of Sri Lanka, the official reason, and the actual reason. The official reason: the sacred mountain was visible from space, and this was where the aliens would land when they came to earth, and he didn’t want to miss it. The actual reason: loads of 11-year-old boys, and very little legal consequence for taking advantage of them. He said that “everyone” in Sri Lanka knew this, but nobody talked about it except in knowing smirks and nods.</em></p></div>",
  "content_text": "A few years ago, in 2015, I presented\nevidence that strongly suggested\nthat the rumors concerning Arthur C. Clarke being a pedophile were correct. However, the initial public reports by a reporter working for\nNews of the World\nand the\nSunday Mirror\nwere never followed up on by the media and were subsequently dismissed as aberrations without anyone ever actually being refuted.\nNow we know why\nthey never led anywhere.\nThe News of the World spiked an exclusive story exposing the science fiction writer Arthur C Clarke as a paedophile, according to a new book about life inside the newspaper whose closure was announced a year ago today.\nIn Hack, an account of his nerve-shredding days as a reporter on the News of the World and then the Sunday Mirror, Graham Johnson claims that although the NOTW prided itself on outing pederasts, editors made an exception for Mr Clarke because he was a friend of Rupert Murdoch.\nThrough BSkyB, the tycoon commercially exploited the futurologist’s theory that satellites would be ideal for communications and praised him in public. As a result, according to Mr Johnson, who by that time had been sacked by the NOTW and had joined the Sunday Mirror, a story by reporter Roger Insall about Mr Clarke’s alleged abuse of adolescent boys was never published for fear of upsetting the proprietor.\nTipped off about the story, the Sunday Mirror sent Mr Johnson to Colombo, where he extracted an confession from the author that he paid boys for sex. “I have never had the slightest interest in children – boys or girls. They should be treated in the same way. But once they have reached the age of puberty, then it is OK,” Mr Clarke was quoted as saying in the Sunday Mirror. “If the kids enjoy it and don’t mind it doesn’t do any harm … there is a hysteria about the whole thing in the West.”\nMr Clarke subsequently denied he was a paedophile, saying: “The allegations are wholly denied.” But he never sued the Sunday Mirror and died aged 90 at his Sri Lanka home in 2008.\nSpeaking to The Independent yesterday, Mr Johnson said: “Roger [Insall] said that because Arthur C Clarke was a mate of Rupert Murdoch, the editor wasn’t having any of it and despite Roger getting a lot of evidence that Clarke was a paedophile they wouldn’t publish it.”\nIt’s probably not a coincidence that Murdoch has himself been accused of harboring similar predilections.\nFull disclosure: Castalia House publishes several Clarke stories in the\nTHERE WILL BE WAR series\n. We will continue to publish them despite our belief in Mr. Clarke’s misdeeds because a) they are very good stories, b) I do not believe the work is inseparable from the author, and c) Mr. Clarke derives zero benefit from their publication.\nIn like manner, we will not refuse to publish H.P. Lovecraft because he is accused of racism, John C. Wright because he is accused of Catholicism, Vox Day because he is accused of white supremacism, or Owen Benjamin because he is accused of heightism, regardless of how substantive or insubstantial the accusations may be.\nUPDATE:\nA reader writes about his experience meeting Mr. Clarke in Sri Lanka.\nVery interesting post about Arthur C. Clarke. I actually met him in spring 1988 at his house in Colombo, Sri Lanka, where I found him simply by looking in the phone book, called the number, and he answered and invited me over straightaway. I was delighted to meet him, but very surprised to see something like ten to fifteen 11-year-olds running around the house like pets. I was 19 at the time, and made no question of it, just noted it in my head.\nA few weeks later I met an expat living in Sri Lanka who said there were two reasons why Arthur C. Clarke moved to the remote island nation of Sri Lanka, the official reason, and the actual reason. The official reason: the sacred mountain was visible from space, and this was where the aliens would land when they came to earth, and he didn’t want to miss it. The actual reason: loads of 11-year-old boys, and very little legal consequence for taking advantage of them. He said that “everyone” in Sri Lanka knew this, but nobody talked about it except in knowing smirks and nods.",
  "tags": [
    "Castalia House",
    "history",
    "media",
    "SFWA"
  ],
  "categories": [],
  "sitemap_lastmod": "2021-11-10T19:29:08+00:00"
}