{
  "url": "https://voxday.net/2021/11/26/black-friday-books/",
  "scraped_at": "2026-01-08T13:00:36.484877",
  "title": "Black Friday Books",
  "date_display": "November 26, 2021",
  "date_iso": "2021-11-26T16:28:47+00:00",
  "date_from_url": "2021-11-26",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>In honor of Black Friday and Cyber Monday, indie and small press authors have banded together to offer a sample of their best work and related stories at discount prices. Everyone of the more than one hundred fifty novels in the sale is either $0.99 or free. <a href=\"http://aetherczar.com/?p=5224\">The sale is live</a> at the blog of one of the participating authors and runs through Tuesday, November 30.</p><p>Relying on themselves and a handful of friendly blogs and media outlets, the authors are achieving a reach previously possible only to trad-pub insiders. A week-long sale with a hundred titles in September aligned with the debut of <a href=\"https://basedcon.com/\">the BasedCon science fiction convention</a>. That sale moved 7000 copies, equally divided between free and paid $0.99 copies, according to sale organizer, Hans G. Schantz, a scientist, inventor, and author of the Hidden Truth trilogy. Top sellers moved over a hundred copies each and shot up the Amazon sales charts generating even more sales.</p><p> “This week’s sale is half-again larger, with about seventy favorite books from previous sales, fifty new additions, and another thirty offerings from Terror House Press,” Schantz explained.</p></div>",
  "content_text": "In honor of Black Friday and Cyber Monday, indie and small press authors have banded together to offer a sample of their best work and related stories at discount prices. Everyone of the more than one hundred fifty novels in the sale is either $0.99 or free.\nThe sale is live\nat the blog of one of the participating authors and runs through Tuesday, November 30.\nRelying on themselves and a handful of friendly blogs and media outlets, the authors are achieving a reach previously possible only to trad-pub insiders. A week-long sale with a hundred titles in September aligned with the debut of\nthe BasedCon science fiction convention\n. That sale moved 7000 copies, equally divided between free and paid $0.99 copies, according to sale organizer, Hans G. Schantz, a scientist, inventor, and author of the Hidden Truth trilogy. Top sellers moved over a hundred copies each and shot up the Amazon sales charts generating even more sales.\n“This week’s sale is half-again larger, with about seventy favorite books from previous sales, fifty new additions, and another thirty offerings from Terror House Press,” Schantz explained.",
  "tags": [
    "books"
  ],
  "categories": [],
  "sitemap_lastmod": "2021-11-26T16:28:49+00:00"
}