{
  "url": "https://voxday.net/2021/11/26/deadly-from-the-start/",
  "scraped_at": "2026-01-08T13:00:35.022388",
  "title": "Deadly From the Start",
  "date_display": "November 26, 2021",
  "date_iso": "2021-11-26T13:00:00+00:00",
  "date_from_url": "2021-11-26",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><ul class=\"wp-block-list\"><li><em>The clinical trials of Pfizer’s coronavirus vaccine found that <a href=\"https://dailyexpose.uk/2021/11/25/official-fda-report-finds-all-cause-death-rate-is-higher-among-the-vaccinated/\">the all-cause mortality rate of the vaccinated group was higher</a> than that of the control group, months after the trials were launched, according to a recently released FDA report. According to the report – which was released by the US Food and Drug Administration to provide background information on its questionable decision to grant full approval for the Pfizer-BioNTech Covid-19 mRNA injection, after initially offering limited emergency use authorisation just six months after the vaccine’s clinical trial began – the total number of deaths reported in the vaccinated group was nearly one-quarter higher than the number of deaths in the placebo group.</em></li><li><em>Health experts have been left <a href=\"https://archive.ph/H8kw7\">baffled by a big rise</a> in a common and potentially fatal type of heart attack in the west of Scotland. During the summer there was a 25 per cent rise in the number of people rushed to the Golden Jubilee National Hospital in Clydebank with partially blocked arteries cutting blood supply to the heart.</em></li><li><em><a href=\"https://thecovidblog.com/2021/11/17/reap-what-you-sow-doctors-dropping-like-flies-died-suddenly-unexpectedly/\">Doctors dropping like flies</a> in deaths described as “died unexpectedly” and “died suddenly” since mid-October. Booster shots commenced on September 22. That could also be a coincidence. But all of the following doctors died on October 13 or later. We could literally include 100 doctors in this story if time permitted. All of these happened in the last four weeks. The youngest is 32. The oldest is 59.</em></li></ul><p>These doctors, who have so slavishly pushed the deadly killshots on everyone else, should have kept in mind that evil never hesitates to cast its servants aside once they cease to be useful.</p><p>It’s best to reject the Covid vaccines. But if you were foolish enough to get vaccinated, at least do yourself the favor of rejecting the boosters, no matter how big the next fear campaign over the “Botswana variant” or the “Uruguayan mutation” happens to be.</p><p>And let’s face it, what were the odds of a “dangerous new variant” being discovered at the same time the focus has shifted from the vaccinating the unvaccinated to a third vaccination for the twice-vaccinated? 100 percent, if you understand that the “pandemic” is merely cover for the global war being waged against humanity.</p><blockquote class=\"wp-block-quote is-layout-flow wp-block-quote-is-layout-flow\"><p><em>Evil shall slay the wicked: and they that hate the righteous shall be desolate.</em></p><cite>Psalm 34:21</cite></blockquote><p><em><a href=\"https://social.infogalactic.com/micropost/41c17f14-da93-4dc4-9008-8fe6a1ebc2b1\">DISCUSS ON SG</a></em></p></div>",
  "content_text": "The clinical trials of Pfizer’s coronavirus vaccine found that\nthe all-cause mortality rate of the vaccinated group was higher\nthan that of the control group, months after the trials were launched, according to a recently released FDA report. According to the report – which was released by the US Food and Drug Administration to provide background information on its questionable decision to grant full approval for the Pfizer-BioNTech Covid-19 mRNA injection, after initially offering limited emergency use authorisation just six months after the vaccine’s clinical trial began – the total number of deaths reported in the vaccinated group was nearly one-quarter higher than the number of deaths in the placebo group.\nHealth experts have been left\nbaffled by a big rise\nin a common and potentially fatal type of heart attack in the west of Scotland. During the summer there was a 25 per cent rise in the number of people rushed to the Golden Jubilee National Hospital in Clydebank with partially blocked arteries cutting blood supply to the heart.\nDoctors dropping like flies\nin deaths described as “died unexpectedly” and “died suddenly” since mid-October. Booster shots commenced on September 22. That could also be a coincidence. But all of the following doctors died on October 13 or later. We could literally include 100 doctors in this story if time permitted. All of these happened in the last four weeks. The youngest is 32. The oldest is 59.\nThese doctors, who have so slavishly pushed the deadly killshots on everyone else, should have kept in mind that evil never hesitates to cast its servants aside once they cease to be useful.\nIt’s best to reject the Covid vaccines. But if you were foolish enough to get vaccinated, at least do yourself the favor of rejecting the boosters, no matter how big the next fear campaign over the “Botswana variant” or the “Uruguayan mutation” happens to be.\nAnd let’s face it, what were the odds of a “dangerous new variant” being discovered at the same time the focus has shifted from the vaccinating the unvaccinated to a third vaccination for the twice-vaccinated? 100 percent, if you understand that the “pandemic” is merely cover for the global war being waged against humanity.\nEvil shall slay the wicked: and they that hate the righteous shall be desolate.\nPsalm 34:21\nDISCUSS ON SG",
  "tags": [
    "science",
    "vaccines"
  ],
  "categories": [],
  "sitemap_lastmod": "2021-11-26T14:42:23+00:00"
}