{
  "url": "https://voxday.net/2021/11/09/did-you-get-a-hot-shot/",
  "scraped_at": "2026-01-08T12:58:27.908645",
  "title": "Did You Get a Hot Shot?",
  "date_display": "November 9, 2021",
  "date_iso": "2021-11-09T13:14:31+00:00",
  "date_from_url": "2021-11-09",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>An explanation of how the vaccinated can see if the vaccine lot from which they received their shot <a href=\"https://threadreaderapp.com/thread/1458049945588621321.html\">was one of the hot ones</a> or not. This is important, because ALL of the reported Pfizer deaths come from just 5 percent of the lots.</p><blockquote class=\"wp-block-quote is-layout-flow wp-block-quote-is-layout-flow\"><p>1) Go to: wonder.cdc.gov/vaers.html<br/>2) Read the disclaimer and click “I agree” at the bottom of the page.<br/>3) Click on “VAERS Data Search”<br/>Image<br/>4) Scroll down to section 3. Enter in your vaccine lot number. For instance, a friend got ER8727 which left him sick for over a week. Click “Send” on one of the section divider bars.</p></blockquote><p>The author recommends looking this up before you get vaccinated against Covid. Even better, don’t get vaccinated at all.</p></div>",
  "content_text": "An explanation of how the vaccinated can see if the vaccine lot from which they received their shot\nwas one of the hot ones\nor not. This is important, because ALL of the reported Pfizer deaths come from just 5 percent of the lots.\n1) Go to: wonder.cdc.gov/vaers.html\n2) Read the disclaimer and click “I agree” at the bottom of the page.\n3) Click on “VAERS Data Search”\nImage\n4) Scroll down to section 3. Enter in your vaccine lot number. For instance, a friend got ER8727 which left him sick for over a week. Click “Send” on one of the section divider bars.\nThe author recommends looking this up before you get vaccinated against Covid. Even better, don’t get vaccinated at all.",
  "tags": [
    "vaccines"
  ],
  "categories": [],
  "sitemap_lastmod": "2021-11-09T13:14:34+00:00"
}