{
  "url": "https://voxday.net/2021/11/18/gatekeeper-u/",
  "scraped_at": "2026-01-08T12:59:32.653221",
  "title": "Gatekeeper U",
  "date_display": "November 18, 2021",
  "date_iso": "2021-11-18T11:18:06+00:00",
  "date_from_url": "2021-11-18",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>Because the universities don’t <a href=\"https://www.rt.com/op-ed/540347-bari-weiss-university-austin/\">already have enough thought police, the world-healers are setting up a new fake alternative</a>, featuring a fake conservative <em>New York Times</em> journalist as the nominal figurehead:</p><blockquote class=\"wp-block-quote is-layout-flow wp-block-quote-is-layout-flow\"><p>The University of Austin has been hailed as a milestone for open discourse, but it’s hard to be too enthusiastic about it when you consider high-profile backer Bari Weiss’ track record of not welcoming dissenting views.</p><p>Writer Bari Weiss has become a figurehead among the left-leaning intelligentsia who eschew modern “wokeness” in favor of classical liberalism. She solidified her status as a bold defender of diversity of thought when she publicly resigned from The New York Times, citing a hostile work environment rife with pressure for ideological conformity. Following that, she was called a “self-styled free speech martyr” by the <em>Financial Times</em>, and is reported to have even compared herself to Galileo Galilei, who was forced by the Catholic Church to renounce his scientific views, lest he be burned at the stake.</p><p>Now, Weiss has announced she will be part of a team of similarly disaffected intellectuals in founding a new institution, the University of Austin (UATX). Other figures involved include enlightened liberals™ such as Steven Pinker and Jonathan Haidt. Currently, the project is in its early stages and hopes to offer a summer program for students in 2021, but graduate programs are planned for launch in 2022 and 2023, with an undergraduate college to follow in 2024.</p><p>However, while many supporters welcomed news of the university and its claim to stand for free expression and open conversation, one can’t help but notice the ironic ideological homogeneity of those involved. And similarly, despite her rebranding as a stalwart defender of free speech, those familiar with Weiss’ career will note that she has not always been so welcoming of dissenting views.</p><p>And interestingly, it’s not just those to the left of Weiss who so far have been excluded from UATX, but those to the right as well. Many conservatives may view Weiss’ condemnation of the woke left as a tacit embrace of right-wing thought, but as recently as 2018, that is far from the case.</p><p>In a piece on the Intellectual Dark Web (IDW) for the <em>New York Times</em>, Weiss spoke disparagingly of Stefan Molyneux, Milo Yiannopoulos, Mike Cernovich, and Alex Jones, and even repudiated Dave Rubin, a popular interviewer who frequently engages with figures who have views different than his own, simply for platforming those she views as “controversial.”</p><p>Weiss’ tenure at The New York Times may have been a lifetime ago as far as the internet is concerned, but a quick glance through her cohorts at the university raises doubts as to whether her disdain for the dissident right has changed with her new-found appreciation for diversity of thought.</p><p>As conservative commentator Michael Knowles pointed out, despite the attempt by leftist publications to paint UATX as some right-wing thought experiment, in actuality, there are only two conservatives currently attached to the project, neither of whom has been known to stray from the right-wing talking points deemed acceptable.</p><p>This omission by the university’s team is especially strange considering the statement of principle put out by Kanelos specifically decries the treatment of conservatives in academic institutions: “Over a third of conservative academics and PhD students say they had been threatened with disciplinary action for their views. Four out of five American PhD students are willing to discriminate against right-leaning scholars.”</p><p>For a group that seems to lament the exclusion of right-wing thought from academia, the team at the University of Austin have so far done little to remedy it.</p></blockquote><p>This so-called “University of Austin” is simply the latest, and grandest, gatekeeper grift intended to intrigue clueless conservatives and direct them and their resources away from Christian nationalism. The pseudointellectuals who serve as the poster children are complete mediocrities – you can read my 13-part response to Peter Boghossian’s hapless and unconvincing effort to redefine the concept of faith, entitled <a href=\"https://voxday.net/tag/fifth-horseman/\">The Fifth Horseman</a>, if you want a detailed look at the quality of thinkers on offer – and this is little more than another attempt to invade the territory they used to deride as flyover country.</p><p><em>D<a href=\"https://social.infogalactic.com/micropost/9dc2fd8b-3c08-4d05-83f0-30f9cc7ccedb\">ISCUSS ON SG</a></em></p></div>",
  "content_text": "Because the universities don’t\nalready have enough thought police, the world-healers are setting up a new fake alternative\n, featuring a fake conservative\nNew York Times\njournalist as the nominal figurehead:\nThe University of Austin has been hailed as a milestone for open discourse, but it’s hard to be too enthusiastic about it when you consider high-profile backer Bari Weiss’ track record of not welcoming dissenting views.\nWriter Bari Weiss has become a figurehead among the left-leaning intelligentsia who eschew modern “wokeness” in favor of classical liberalism. She solidified her status as a bold defender of diversity of thought when she publicly resigned from The New York Times, citing a hostile work environment rife with pressure for ideological conformity. Following that, she was called a “self-styled free speech martyr” by the\nFinancial Times\n, and is reported to have even compared herself to Galileo Galilei, who was forced by the Catholic Church to renounce his scientific views, lest he be burned at the stake.\nNow, Weiss has announced she will be part of a team of similarly disaffected intellectuals in founding a new institution, the University of Austin (UATX). Other figures involved include enlightened liberals™ such as Steven Pinker and Jonathan Haidt. Currently, the project is in its early stages and hopes to offer a summer program for students in 2021, but graduate programs are planned for launch in 2022 and 2023, with an undergraduate college to follow in 2024.\nHowever, while many supporters welcomed news of the university and its claim to stand for free expression and open conversation, one can’t help but notice the ironic ideological homogeneity of those involved. And similarly, despite her rebranding as a stalwart defender of free speech, those familiar with Weiss’ career will note that she has not always been so welcoming of dissenting views.\nAnd interestingly, it’s not just those to the left of Weiss who so far have been excluded from UATX, but those to the right as well. Many conservatives may view Weiss’ condemnation of the woke left as a tacit embrace of right-wing thought, but as recently as 2018, that is far from the case.\nIn a piece on the Intellectual Dark Web (IDW) for the\nNew York Times\n, Weiss spoke disparagingly of Stefan Molyneux, Milo Yiannopoulos, Mike Cernovich, and Alex Jones, and even repudiated Dave Rubin, a popular interviewer who frequently engages with figures who have views different than his own, simply for platforming those she views as “controversial.”\nWeiss’ tenure at The New York Times may have been a lifetime ago as far as the internet is concerned, but a quick glance through her cohorts at the university raises doubts as to whether her disdain for the dissident right has changed with her new-found appreciation for diversity of thought.\nAs conservative commentator Michael Knowles pointed out, despite the attempt by leftist publications to paint UATX as some right-wing thought experiment, in actuality, there are only two conservatives currently attached to the project, neither of whom has been known to stray from the right-wing talking points deemed acceptable.\nThis omission by the university’s team is especially strange considering the statement of principle put out by Kanelos specifically decries the treatment of conservatives in academic institutions: “Over a third of conservative academics and PhD students say they had been threatened with disciplinary action for their views. Four out of five American PhD students are willing to discriminate against right-leaning scholars.”\nFor a group that seems to lament the exclusion of right-wing thought from academia, the team at the University of Austin have so far done little to remedy it.\nThis so-called “University of Austin” is simply the latest, and grandest, gatekeeper grift intended to intrigue clueless conservatives and direct them and their resources away from Christian nationalism. The pseudointellectuals who serve as the poster children are complete mediocrities – you can read my 13-part response to Peter Boghossian’s hapless and unconvincing effort to redefine the concept of faith, entitled\nThe Fifth Horseman\n, if you want a detailed look at the quality of thinkers on offer – and this is little more than another attempt to invade the territory they used to deride as flyover country.\nD\nISCUSS ON SG",
  "tags": [
    "atheism",
    "education",
    "Judeochristianity"
  ],
  "categories": [],
  "sitemap_lastmod": "2021-11-18T11:20:54+00:00"
}