{
  "url": "https://voxday.net/2021/11/06/isolation-is-not-conquest/",
  "scraped_at": "2026-01-08T12:58:02.923125",
  "title": "Independence is Not Imperialism",
  "date_display": "November 6, 2021",
  "date_iso": "2021-11-06T09:08:00+00:00",
  "date_from_url": "2021-11-06",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>The ignorant Chi-Com haters, whose perspective on China is literally 43 years out of date and who stubbornly project their own imperialism on the world’s largest nation, have now managed to completely misunderstand Xi Jinping’s <a href=\"https://thebl.com/world-news/china/foreigners-flee-china-the-separation-is-almost-complete.html\">policy of pursuing economic independence</a>:</p><blockquote class=\"wp-block-quote is-layout-flow wp-block-quote-is-layout-flow\"><p>The Financial Times reported that the head of the U.S. business lobbying agency in China warned that as the Chinese Communist Party (CCP) tightens its control of COVID-19, Western executives are withdrawing from the world’s largest consumer market.</p><p>Today, as the rest of the world has reopened, American business leaders, including Mr. Ker Gibbs and Alan Beebe, Presidents of the American Chambers of Commerce in Shanghai and Beijing, are warning the CCP that the evacuation of foreigners from China may accelerate.</p><p>The British Financial Times also cites a recent survey of 338 American Chamber of Commerce members in Shanghai. The survey shows that more than 70% of companies have difficulty in attracting and retaining foreign talent. “Restrictions related to travel visas,” have become the main issue.</p><p>China’s strict entry quarantine policies include the abolition of tax incentives enjoyed by foreigners for decades; the rising cost of living in Chinese cities. Power shortages, power cuts, and increases in electricity prices, along with the CCP’s relentless surveillance, are also essential factors in driving foreign executives to return to their home countries.</p><p>China is still conducting a policy of “Zero COVID-19”. Anxious foreigners, uncertain of how long they would be locked up in their houses, quickly fled.</p><p>TFI Global points out that the flight of investors from China is due to the strict blockade by COVID-19, government surveillance, and a series of repressive economic policies implemented by the authorities.</p><p>Since last November, China has launched an all-out attack against businesses, companies, and entrepreneurs. The technology industry, education and training, private schools, and most private companies are “harvested” by the government. In the face of such anti-trade measures, investors will inevitably flee from China to escape the dictatorship.</p><cite>Foreigners flee China, the separation is almost complete?, 3 November 2021</cite></blockquote><p>This has very little, if anything, to do with “Covid-19”. That’s merely a code word for the international financial regime, in both China and the West. And the self-deportation of foreigners is a feature, not a bug. Literally every nation in the West, beginning with America, would benefit greatly from the same behavior on the part of the foreign peoples who have invaded them. How anyone can look at the ongoing collapse of the USA due to its evil policies of mass immigration, free trade, and free speech and conclude that the failing state provides a functional model worthy of imitation, much less an ideal model that morally requires installation by force, completely mystifies me.</p><p>China is voluntarily choosing the fate that was imposed upon Russia by angry neocon imperialists who wished to punish the Putin regime for expelling its elite servants who were financializing and parasitizing the Russian economy. China is doing so because it has seen the way in which the Russian people and the Russian economy have greatly benefited from being expelled from the evil and vampiric neo-liberal world order, which in any event is in the process of collapsing. Hence all the “Great Reset” talk, which is the financial elite’s attempt to succeed itself in the aftermath of their own failure.</p><p>Unlike the Boomer-tier China critics, I have read the writings of Lee Kuan Yew, Xi Jinping, and Wang Huning. They are not only far more intelligent than their critics, they are great and admirable men who have taken on incredibly challenging burdens on behalf of their people that bear an almost unfathomable degree of difficulty. Xi and Wang may fail, like Donald Trump, or they may succeed, like Vladimir Putin. But the entire world should wish them well in their endeavors.</p><p>China does not seek world dominance any more than Russia does. That is pure projection on the part of people who not only want to rule the world, but believe it is their Satan-given right to do so. When you read stories of Chinese hunger for global domination in the media, <em>consider the fucking source!</em> Both Russia and China simply seek to be powerful enough to rule themselves and keep the evil globalists at bay; both countries have already suffered at their hands and both countries already possess sufficient military power to invade and occupy their neighbors more easily than the USA invaded and occupied Iraq.</p><p>What China is doing is exactly what Americans should be doing as a nation, but can’t because they have been the victims of the largest invasion in world history, and because they are demoralized, denationalized, and subjected. And it should be obvious to even the most slow-witted right now that the USA is currently on a path that will, if it is not abandoned, lead to the same horrors that both China and Russia endured in the 20th century.</p><p>UPDATE: China experts recognize that China <a href=\"https://www.rt.com/op-ed/539456-taiwan-faces-travel-bans-prosecution/\">is beginning to utilize its increasingly formidable economic power</a> in pursuit of its geostrategic ends.</p><blockquote class=\"wp-block-quote is-layout-flow wp-block-quote-is-layout-flow\"><p>Beijing is using legislative power to punish supporters of “Taiwan independence” (again, deliberately undefined) with travel bans and prosecutions. Some people might argue back, “Well, just don’t go to China”- but it’s not as simple as that. On a business and organizational level, this is a move with huge ramifications. If you have a business, you could lose access to the huge Chinese market and never has that been more relevant in Taiwan, whose largest economic and trading partner is China. Both geography and commerce talk.</p><p>In addition, China has extradition treaties with 59 countries. While the majority of those are outside the West, this creates a legal reach stretching beyond China’s borders. Certain countries near China are willing to comply with this kind of request due to their own mutual interests in anti-separatism and unrest. Consider, for example, how Hong Kong activist Joshua Wong was banned from both Thailand and Malaysia. This means that vocal supporters of Taiwan who end up blacklisted should not assume they are safe just because they do not have a stake in China or Hong Kong, or wish to go there. Beijing is using long-arm jurisdiction.</p></blockquote><p><em><a href=\"https://social.infogalactic.com/micropost/f04c0085-4ee8-437e-b906-428d22a539ec\">DISCUSS ON SG</a></em></p></div>",
  "content_text": "The ignorant Chi-Com haters, whose perspective on China is literally 43 years out of date and who stubbornly project their own imperialism on the world’s largest nation, have now managed to completely misunderstand Xi Jinping’s\npolicy of pursuing economic independence\n:\nThe Financial Times reported that the head of the U.S. business lobbying agency in China warned that as the Chinese Communist Party (CCP) tightens its control of COVID-19, Western executives are withdrawing from the world’s largest consumer market.\nToday, as the rest of the world has reopened, American business leaders, including Mr. Ker Gibbs and Alan Beebe, Presidents of the American Chambers of Commerce in Shanghai and Beijing, are warning the CCP that the evacuation of foreigners from China may accelerate.\nThe British Financial Times also cites a recent survey of 338 American Chamber of Commerce members in Shanghai. The survey shows that more than 70% of companies have difficulty in attracting and retaining foreign talent. “Restrictions related to travel visas,” have become the main issue.\nChina’s strict entry quarantine policies include the abolition of tax incentives enjoyed by foreigners for decades; the rising cost of living in Chinese cities. Power shortages, power cuts, and increases in electricity prices, along with the CCP’s relentless surveillance, are also essential factors in driving foreign executives to return to their home countries.\nChina is still conducting a policy of “Zero COVID-19”. Anxious foreigners, uncertain of how long they would be locked up in their houses, quickly fled.\nTFI Global points out that the flight of investors from China is due to the strict blockade by COVID-19, government surveillance, and a series of repressive economic policies implemented by the authorities.\nSince last November, China has launched an all-out attack against businesses, companies, and entrepreneurs. The technology industry, education and training, private schools, and most private companies are “harvested” by the government. In the face of such anti-trade measures, investors will inevitably flee from China to escape the dictatorship.\nForeigners flee China, the separation is almost complete?, 3 November 2021\nThis has very little, if anything, to do with “Covid-19”. That’s merely a code word for the international financial regime, in both China and the West. And the self-deportation of foreigners is a feature, not a bug. Literally every nation in the West, beginning with America, would benefit greatly from the same behavior on the part of the foreign peoples who have invaded them. How anyone can look at the ongoing collapse of the USA due to its evil policies of mass immigration, free trade, and free speech and conclude that the failing state provides a functional model worthy of imitation, much less an ideal model that morally requires installation by force, completely mystifies me.\nChina is voluntarily choosing the fate that was imposed upon Russia by angry neocon imperialists who wished to punish the Putin regime for expelling its elite servants who were financializing and parasitizing the Russian economy. China is doing so because it has seen the way in which the Russian people and the Russian economy have greatly benefited from being expelled from the evil and vampiric neo-liberal world order, which in any event is in the process of collapsing. Hence all the “Great Reset” talk, which is the financial elite’s attempt to succeed itself in the aftermath of their own failure.\nUnlike the Boomer-tier China critics, I have read the writings of Lee Kuan Yew, Xi Jinping, and Wang Huning. They are not only far more intelligent than their critics, they are great and admirable men who have taken on incredibly challenging burdens on behalf of their people that bear an almost unfathomable degree of difficulty. Xi and Wang may fail, like Donald Trump, or they may succeed, like Vladimir Putin. But the entire world should wish them well in their endeavors.\nChina does not seek world dominance any more than Russia does. That is pure projection on the part of people who not only want to rule the world, but believe it is their Satan-given right to do so. When you read stories of Chinese hunger for global domination in the media,\nconsider the fucking source!\nBoth Russia and China simply seek to be powerful enough to rule themselves and keep the evil globalists at bay; both countries have already suffered at their hands and both countries already possess sufficient military power to invade and occupy their neighbors more easily than the USA invaded and occupied Iraq.\nWhat China is doing is exactly what Americans should be doing as a nation, but can’t because they have been the victims of the largest invasion in world history, and because they are demoralized, denationalized, and subjected. And it should be obvious to even the most slow-witted right now that the USA is currently on a path that will, if it is not abandoned, lead to the same horrors that both China and Russia endured in the 20th century.\nUPDATE: China experts recognize that China\nis beginning to utilize its increasingly formidable economic power\nin pursuit of its geostrategic ends.\nBeijing is using legislative power to punish supporters of “Taiwan independence” (again, deliberately undefined) with travel bans and prosecutions. Some people might argue back, “Well, just don’t go to China”- but it’s not as simple as that. On a business and organizational level, this is a move with huge ramifications. If you have a business, you could lose access to the huge Chinese market and never has that been more relevant in Taiwan, whose largest economic and trading partner is China. Both geography and commerce talk.\nIn addition, China has extradition treaties with 59 countries. While the majority of those are outside the West, this creates a legal reach stretching beyond China’s borders. Certain countries near China are willing to comply with this kind of request due to their own mutual interests in anti-separatism and unrest. Consider, for example, how Hong Kong activist Joshua Wong was banned from both Thailand and Malaysia. This means that vocal supporters of Taiwan who end up blacklisted should not assume they are safe just because they do not have a stake in China or Hong Kong, or wish to go there. Beijing is using long-arm jurisdiction.\nDISCUSS ON SG",
  "tags": [
    "China",
    "economics"
  ],
  "categories": [],
  "sitemap_lastmod": "2021-11-06T12:37:00+00:00"
}