{
  "url": "https://voxday.net/2021/11/19/that-failed-fast/",
  "scraped_at": "2026-01-08T12:59:41.128849",
  "title": "That Failed Fast",
  "date_display": "November 19, 2021",
  "date_iso": "2021-11-19T10:26:00+00:00",
  "date_from_url": "2021-11-19",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>In less than one week, Austria has already discovered that locking down the unvaccinated <a href=\"https://www.rt.com/news/540714-austria-lockdown-for-everyone/\">won’t keep the virus from spreading</a>.</p><blockquote class=\"wp-block-quote is-layout-flow wp-block-quote-is-layout-flow\"><p>Austria will introduce a full lockdown that could last for three weeks on Monday in an attempt to tackle a new wave of Covid-19 infections. The government has also ordered the entire population to get vaccinated from February 1.</p><p>On Friday, conservative Chancellor Alexander Schallenberg told a news conference that a complete lockdown of the nation would begin on Monday and last for an initial 10 days. He stated that the restrictions could be extended if infection rates did not start to fall, but he insisted the lockdown would not exceed 20 days.</p><p>The measures concern the entire Austrian population. The government has already imposed a partial lockdown on the unvaccinated in an effort to reduce hospitalization rates amid a surge in Covid-19 cases.</p><p>When the full lockdown ends, restrictions will remain in place for the unvaccinated.</p></blockquote><p>Of course, that last sentence reveals the true and coercive objective of the targeted aspect of the lockdown, which is trying to force the unvaccinated to pollute their pure blood. But it’s not going to work, as even the coercion itself is inspiring stronger resistance to the vaccines.</p><p>Despite the Austrian debacle, Greece, the Czech Republic, and Germany are all following Austria’s lead in locking down the unvaccinated; one can safely expect that these targeted lockdowns will fail within days as well.</p><p><strong>UPDATE: </strong>Despite the complete failure of the targeted lockdown, Austria is actually going to try imposing compulsory vaccinations. This announcement follows the recent visit of the Soroses to Austria, which is probably not a coincidence. While the Austrians tend to be an obedient people, it would be surprising if this attempt to forcibly vaccinate the entire population did not lead to revolutionary violence.</p><blockquote class=\"wp-block-quote is-layout-flow wp-block-quote-is-layout-flow\"><p>Austria’s Chancellor Alexander Schallenberg and Health Minister Wolfgang Mückstein both said a lockdown alone was not enough to end the “vicious circle” of increasing spread of the virus and repeated lockdowns. They announced that the government would begin preparing for a general vaccination requirement to come into effect in February 2022 at the latest. Mückstein said: “The lockdown will break the fourth wave; the way out of the fifth wave is vaccination, vaccination, vaccination.”</p><p>The new measures were announced after Austria recorded another all-time high for new daily cases on Thursday, with 15,145 cases reported in 24 hours.</p></blockquote></div>",
  "content_text": "In less than one week, Austria has already discovered that locking down the unvaccinated\nwon’t keep the virus from spreading\n.\nAustria will introduce a full lockdown that could last for three weeks on Monday in an attempt to tackle a new wave of Covid-19 infections. The government has also ordered the entire population to get vaccinated from February 1.\nOn Friday, conservative Chancellor Alexander Schallenberg told a news conference that a complete lockdown of the nation would begin on Monday and last for an initial 10 days. He stated that the restrictions could be extended if infection rates did not start to fall, but he insisted the lockdown would not exceed 20 days.\nThe measures concern the entire Austrian population. The government has already imposed a partial lockdown on the unvaccinated in an effort to reduce hospitalization rates amid a surge in Covid-19 cases.\nWhen the full lockdown ends, restrictions will remain in place for the unvaccinated.\nOf course, that last sentence reveals the true and coercive objective of the targeted aspect of the lockdown, which is trying to force the unvaccinated to pollute their pure blood. But it’s not going to work, as even the coercion itself is inspiring stronger resistance to the vaccines.\nDespite the Austrian debacle, Greece, the Czech Republic, and Germany are all following Austria’s lead in locking down the unvaccinated; one can safely expect that these targeted lockdowns will fail within days as well.\nUPDATE:\nDespite the complete failure of the targeted lockdown, Austria is actually going to try imposing compulsory vaccinations. This announcement follows the recent visit of the Soroses to Austria, which is probably not a coincidence. While the Austrians tend to be an obedient people, it would be surprising if this attempt to forcibly vaccinate the entire population did not lead to revolutionary violence.\nAustria’s Chancellor Alexander Schallenberg and Health Minister Wolfgang Mückstein both said a lockdown alone was not enough to end the “vicious circle” of increasing spread of the virus and repeated lockdowns. They announced that the government would begin preparing for a general vaccination requirement to come into effect in February 2022 at the latest. Mückstein said: “The lockdown will break the fourth wave; the way out of the fifth wave is vaccination, vaccination, vaccination.”\nThe new measures were announced after Austria recorded another all-time high for new daily cases on Thursday, with 15,145 cases reported in 24 hours.",
  "tags": [
    "politics",
    "trainwreck",
    "vaccines"
  ],
  "categories": [],
  "sitemap_lastmod": "2021-11-19T14:29:03+00:00"
}