{
  "url": "https://voxday.net/2021/11/25/the-salvation-army-converges/",
  "scraped_at": "2026-01-08T13:00:27.692538",
  "title": "The Salvation Army Converges",
  "date_display": "November 25, 2021",
  "date_iso": "2021-11-25T10:25:41+00:00",
  "date_from_url": "2021-11-25",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>Racism is not, and has never been, a sin. You can always tell the Churchians from genuine Christians because former flat-out lie and insist that it is. And the Churchians have infiltrated, and now run, <a href=\"https://www.rt.com/usa/541282-salvation-army-racial-woke/\">the Salvation Army</a>:</p><blockquote class=\"wp-block-quote is-layout-flow wp-block-quote-is-layout-flow\"><p>Some donors have been withdrawing their support for the Salvation Army over its switch to woke ideology, saying that a Christian charity shouldn’t promote what they see as “the most serious threat” to their faith. A number of its supporters are apparently increasingly unhappy with an initiative called “Let’s Talk About Racism,” which Salvation Army CEO General Brian Peddle announced in February. It’s a discussion guide aimed at promoting “courageous conversations about racism” within the organization of 1.7 million. Its authors, heavily influenced by critical race theory (CTR), speak of “detrimental divisions” that they believe were created by racism in all fields of life, including in the Christian Church, and offer members advice on how to tackle inequality through an “anti-racist” perspective.</p><p>When asked about the rift over the woke curriculum by Newsweek, the Salvation Army’s spokesman, Joseph Cohen, insisted the organization hadn’t changed its ideology in any way.</p><p><em>“Our beliefs have always been rooted in scripture, and they still are. That includes our complete rejection of racism, which is in stark contrast to the biblical principle that we’re all created in the image of God,” </em>he pointed out.</p><p>As for <em>“Let’s Talk About Racism,”</em> he said such <em>“voluntary discussion guides certainly are not required, and they never take the place of our Positional Statements. For us, the Truth in scripture is always supreme.”</em></p></blockquote><p>The main reason racism cannot be a sin is because in the Bible, both God and Jesus Christ speak in a manner that is clearly and observably racist by every modern usage of the term. So, either God and Jesus Christ are capable of sin and have sin in them, or racism cannot be a sin.</p><p>Which is it, Churchians?</p><p>Furthermore, we are told that we shall judge things “by their fruit”. And what have the consequences of multiple generations of a fixation on racism and the attempts to eliminate it been, for both the world and for the Church?</p><p><em><a href=\"https://social.infogalactic.com/micropost/f44b39a1-7db9-42b0-b8df-7ab4c9930b80\">DISCUSS ON SG</a></em></p></div>",
  "content_text": "Racism is not, and has never been, a sin. You can always tell the Churchians from genuine Christians because former flat-out lie and insist that it is. And the Churchians have infiltrated, and now run,\nthe Salvation Army\n:\nSome donors have been withdrawing their support for the Salvation Army over its switch to woke ideology, saying that a Christian charity shouldn’t promote what they see as “the most serious threat” to their faith. A number of its supporters are apparently increasingly unhappy with an initiative called “Let’s Talk About Racism,” which Salvation Army CEO General Brian Peddle announced in February. It’s a discussion guide aimed at promoting “courageous conversations about racism” within the organization of 1.7 million. Its authors, heavily influenced by critical race theory (CTR), speak of “detrimental divisions” that they believe were created by racism in all fields of life, including in the Christian Church, and offer members advice on how to tackle inequality through an “anti-racist” perspective.\nWhen asked about the rift over the woke curriculum by Newsweek, the Salvation Army’s spokesman, Joseph Cohen, insisted the organization hadn’t changed its ideology in any way.\n“Our beliefs have always been rooted in scripture, and they still are. That includes our complete rejection of racism, which is in stark contrast to the biblical principle that we’re all created in the image of God,”\nhe pointed out.\nAs for\n“Let’s Talk About Racism,”\nhe said such\n“voluntary discussion guides certainly are not required, and they never take the place of our Positional Statements. For us, the Truth in scripture is always supreme.”\nThe main reason racism cannot be a sin is because in the Bible, both God and Jesus Christ speak in a manner that is clearly and observably racist by every modern usage of the term. So, either God and Jesus Christ are capable of sin and have sin in them, or racism cannot be a sin.\nWhich is it, Churchians?\nFurthermore, we are told that we shall judge things “by their fruit”. And what have the consequences of multiple generations of a fixation on racism and the attempts to eliminate it been, for both the world and for the Church?\nDISCUSS ON SG",
  "tags": [
    "Christianity",
    "SJW"
  ],
  "categories": [],
  "sitemap_lastmod": "2021-11-25T11:26:55+00:00"
}