{
  "url": "https://voxday.net/2021/11/21/the-next-lie/",
  "scraped_at": "2026-01-08T12:59:54.423516",
  "title": "The Next Lie",
  "date_display": "November 21, 2021",
  "date_iso": "2021-11-21T10:53:43+00:00",
  "date_from_url": "2021-11-21",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>The British vaccine regime is attempting to get on top of the growing number of excessive all-cause deaths by <a href=\"https://www.dailymail.co.uk/health/article-10224691/Has-jab-farce-landed-hundreds-intensive-care.html\">blaming them on a FAILURE to provide the third shot</a> to “vulnerable” people with cancer who are supposedly dying “of Covid” in the hospital rather than the cancer itself.</p><blockquote class=\"wp-block-quote is-layout-flow wp-block-quote-is-layout-flow\"><p>Now campaigners fear some vulnerable patients are paying the ultimate price for the bungled rollout.</p><p>‘It’s been a complete shambles,’ said Gemma Peters, chief executive of the charity Blood Cancer UK. ‘It is very likely the rise in the proportion of intensive care admissions for Covid patients with blood cancer since mid-October is at least partly due to empty Government promises about giving a third jab to everyone in this group. It is almost inevitable some people will have caught Covid and become seriously ill – maybe even died – as a result.’</p><p>Figures from the Intensive Care National Audit And Research Centre show that Covid-related ICU admissions for blood cancer patients rose from 20 each week at the end of September to 33 a week by early November – a jump of more than 50 per cent. Overall, ICU admissions initially dropped during that period, before beginning to rise again in recent weeks.</p><p>Campaigners say given that only one person in 130 has blood cancer, the admissions with Covid are disproportionately high. Similarly, ICU admissions for transplant patients with Covid rose to about 34 a week by early November, up from a usual 20 to 25.</p><p>According to experts and campaigners, vaccine delays are the most likely reason behind these sky-high figures.</p><p>‘We’re seeing more and more immuno-compromised patients being admitted to intensive care, despite having had two jabs,’ says Dr Ron Daniels, an intensive care consultant at University Hospitals Birmingham NHS Foundation Trust.</p><p>‘By the time they end up here, their prospects are very bleak – at least half of them will die.’</p></blockquote><p>What’s much more likely happening is that the two vaccinations these cancer patients received has triggered the rapid growth of their cancers; even people in remission who have been vaccinated are seeing their cancers return with a vengeance and killing them within weeks. This weak and convoluted attempt to provide an alternative explanation less fatal to the vaccine narrative is going to go down in flames as soon as these unfortunate victims start receiving the third shot and the fatality rates climb even higher.</p><p>More damning data is coming out on a regular basis, including a large-scale study that concludes “the mRNA vacs dramatically increase inflammation on the endothelium and T cell infiltration of cardiac muscle” and <a href=\"https://www.ahajournals.org/doi/10.1161/circ.144.suppl_1.10712\">more than doubles the risk of a heart attack</a> within the next five years.</p><blockquote class=\"wp-block-quote is-layout-flow wp-block-quote-is-layout-flow\"><p>Our group has been using the PLUS Cardiac Test (GD Biosciences, Inc, Irvine, CA) a clinically validated measurement of multiple protein biomarkers which generates a score predicting the 5 yr risk (percentage chance) of a new Acute Coronary Syndrome (ACS). The score is based on changes from the norm of multiple protein biomarkers including IL-16, a proinflammatory cytokine, soluble Fas, an inducer of apoptosis, and Hepatocyte Growth Factor (HGF)which serves as a marker for chemotaxis of T-cells into epithelium and cardiac tissue, among other markers. Elevation above the norm increases the PULS score, while decreases below the norm lowers the PULS score.The score has been measured every 3-6 months in our patient population for 8 years. Recently, with the advent of the mRNA COVID 19 vaccines (vac) by Moderna and Pfizer, dramatic changes in the PULS score became apparent in most patients.This report summarizes those results. A total of 566 pts, aged 28 to 97, M:F ratio 1:1 seen in a preventive cardiology practice had a new PULS test drawn from 2 to 10 weeks following the 2nd COVID shot and was compared to the previous PULS score drawn 3 to 5 months previously pre- shot. Baseline IL-16 increased from 35=/-20 above the norm to 82 =/- 75 above the norm post-vac; sFas increased from 22+/- 15 above the norm to 46=/-24 above the norm post-vac; HGF increased from 42+/-12 above the norm to 86+/-31 above the norm post-vac. These changes resulted in an increase of the PULS score from 11% 5 yr ACS risk to 25% 5 yr ACS risk. At the time of this report, these changes persist for at least 2.5 months post second dose of vac.</p><cite>Mrna COVID Vaccines Dramatically Increase Endothelial Inflammatory Markers and ACS Risk as Measured by the PULS Cardiac Test: a Warning, Steven R. Gundry</cite></blockquote><p>And finally, the White Wall of Silence may be cracking under the strain of the guilt and shame being borne by the medical community, as the head of one of Germa<a href=\"https://archive.md/qQRso#selection-877.14-877.29\">ny’s largest hospitals recently committed suicide</a> over his refusal to continue participating in what he described as “a genocide” and “a crime against humanity”.</p><blockquote class=\"wp-block-quote is-layout-flow wp-block-quote-is-layout-flow\"><p>According to <em>Las repúblicas</em>, In the lengthy farewell letter Dr. Thomas Jendges wrote before his suicide and demanded its publication, he is said to have harshly criticized the information policy of governments in dealing with the dangerousness of Covid vaccines. The constant lies and deceit to the patient and the vaccinated that the vaccines are supposedly harmless, he could no longer bear them, it is said in the letter.</p><p>He condemns vaccinating the population with experimental and lethal vaccines against Covid-19, which is in fact more of a biological warfare agent created and manipulated for that use, than for any other known utility. For Dr. Thomas Jendges a genocide and a crime against humanity is taking place, they report that he says the letter, according to the German press such as the <em>Bild </em>newspaper.</p><p>Because the mayor threatened to fire him if he no longer stayed in the submissive line imposed by government order and refused to vaccinate patients at the clinic, there were presumably no more options for Jendges. This director has not wanted to support a crime of the federal government, the state government and his faithful henchmen.</p><cite>Dr Thomas Jendges Head of Clinic, Commits Suicide “COVID-19 Vaccine Is a Genocide”</cite></blockquote><p><strong>UPDATE: </strong>Latest figures from the Office for National Statistics showed that England and Wales registered 20,823 more deaths than the five-year average in the past 18 weeks.</p><p><em><a href=\"https://social.infogalactic.com/micropost/0ca1d8de-a4eb-4315-85c8-af7744204cff\">DISCUSS ON SG</a></em></p></div>",
  "content_text": "The British vaccine regime is attempting to get on top of the growing number of excessive all-cause deaths by\nblaming them on a FAILURE to provide the third shot\nto “vulnerable” people with cancer who are supposedly dying “of Covid” in the hospital rather than the cancer itself.\nNow campaigners fear some vulnerable patients are paying the ultimate price for the bungled rollout.\n‘It’s been a complete shambles,’ said Gemma Peters, chief executive of the charity Blood Cancer UK. ‘It is very likely the rise in the proportion of intensive care admissions for Covid patients with blood cancer since mid-October is at least partly due to empty Government promises about giving a third jab to everyone in this group. It is almost inevitable some people will have caught Covid and become seriously ill – maybe even died – as a result.’\nFigures from the Intensive Care National Audit And Research Centre show that Covid-related ICU admissions for blood cancer patients rose from 20 each week at the end of September to 33 a week by early November – a jump of more than 50 per cent. Overall, ICU admissions initially dropped during that period, before beginning to rise again in recent weeks.\nCampaigners say given that only one person in 130 has blood cancer, the admissions with Covid are disproportionately high. Similarly, ICU admissions for transplant patients with Covid rose to about 34 a week by early November, up from a usual 20 to 25.\nAccording to experts and campaigners, vaccine delays are the most likely reason behind these sky-high figures.\n‘We’re seeing more and more immuno-compromised patients being admitted to intensive care, despite having had two jabs,’ says Dr Ron Daniels, an intensive care consultant at University Hospitals Birmingham NHS Foundation Trust.\n‘By the time they end up here, their prospects are very bleak – at least half of them will die.’\nWhat’s much more likely happening is that the two vaccinations these cancer patients received has triggered the rapid growth of their cancers; even people in remission who have been vaccinated are seeing their cancers return with a vengeance and killing them within weeks. This weak and convoluted attempt to provide an alternative explanation less fatal to the vaccine narrative is going to go down in flames as soon as these unfortunate victims start receiving the third shot and the fatality rates climb even higher.\nMore damning data is coming out on a regular basis, including a large-scale study that concludes “the mRNA vacs dramatically increase inflammation on the endothelium and T cell infiltration of cardiac muscle” and\nmore than doubles the risk of a heart attack\nwithin the next five years.\nOur group has been using the PLUS Cardiac Test (GD Biosciences, Inc, Irvine, CA) a clinically validated measurement of multiple protein biomarkers which generates a score predicting the 5 yr risk (percentage chance) of a new Acute Coronary Syndrome (ACS). The score is based on changes from the norm of multiple protein biomarkers including IL-16, a proinflammatory cytokine, soluble Fas, an inducer of apoptosis, and Hepatocyte Growth Factor (HGF)which serves as a marker for chemotaxis of T-cells into epithelium and cardiac tissue, among other markers. Elevation above the norm increases the PULS score, while decreases below the norm lowers the PULS score.The score has been measured every 3-6 months in our patient population for 8 years. Recently, with the advent of the mRNA COVID 19 vaccines (vac) by Moderna and Pfizer, dramatic changes in the PULS score became apparent in most patients.This report summarizes those results. A total of 566 pts, aged 28 to 97, M:F ratio 1:1 seen in a preventive cardiology practice had a new PULS test drawn from 2 to 10 weeks following the 2nd COVID shot and was compared to the previous PULS score drawn 3 to 5 months previously pre- shot. Baseline IL-16 increased from 35=/-20 above the norm to 82 =/- 75 above the norm post-vac; sFas increased from 22+/- 15 above the norm to 46=/-24 above the norm post-vac; HGF increased from 42+/-12 above the norm to 86+/-31 above the norm post-vac. These changes resulted in an increase of the PULS score from 11% 5 yr ACS risk to 25% 5 yr ACS risk. At the time of this report, these changes persist for at least 2.5 months post second dose of vac.\nMrna COVID Vaccines Dramatically Increase Endothelial Inflammatory Markers and ACS Risk as Measured by the PULS Cardiac Test: a Warning, Steven R. Gundry\nAnd finally, the White Wall of Silence may be cracking under the strain of the guilt and shame being borne by the medical community, as the head of one of Germa\nny’s largest hospitals recently committed suicide\nover his refusal to continue participating in what he described as “a genocide” and “a crime against humanity”.\nAccording to\nLas repúblicas\n, In the lengthy farewell letter Dr. Thomas Jendges wrote before his suicide and demanded its publication, he is said to have harshly criticized the information policy of governments in dealing with the dangerousness of Covid vaccines. The constant lies and deceit to the patient and the vaccinated that the vaccines are supposedly harmless, he could no longer bear them, it is said in the letter.\nHe condemns vaccinating the population with experimental and lethal vaccines against Covid-19, which is in fact more of a biological warfare agent created and manipulated for that use, than for any other known utility. For Dr. Thomas Jendges a genocide and a crime against humanity is taking place, they report that he says the letter, according to the German press such as the\nBild\nnewspaper.\nBecause the mayor threatened to fire him if he no longer stayed in the submissive line imposed by government order and refused to vaccinate patients at the clinic, there were presumably no more options for Jendges. This director has not wanted to support a crime of the federal government, the state government and his faithful henchmen.\nDr Thomas Jendges Head of Clinic, Commits Suicide “COVID-19 Vaccine Is a Genocide”\nUPDATE:\nLatest figures from the Office for National Statistics showed that England and Wales registered 20,823 more deaths than the five-year average in the past 18 weeks.\nDISCUSS ON SG",
  "tags": [
    "rhetoric",
    "science",
    "vaccines"
  ],
  "categories": [],
  "sitemap_lastmod": "2021-11-21T13:27:22+00:00"
}