{
  "url": "https://voxday.net/2021/11/28/the-facts-on-the-ground/",
  "scraped_at": "2026-01-08T13:00:46.785170",
  "title": "The Facts on the Ground",
  "date_display": "November 28, 2021",
  "date_iso": "2021-11-28T09:45:19+00:00",
  "date_from_url": "2021-11-28",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>Karl Denninger reminds us of <a href=\"https://market-ticker.org/akcs-www?post=244342\">what we now know from experience</a>, rather than theory, as the media begins its latest round of fearmongering over the so-called “omicron” variant which supposedly emerged in Botswana. Or South Africa. Or, possibly, Australia.</p><blockquote class=\"wp-block-quote is-layout-flow wp-block-quote-is-layout-flow\"><p><strong>This “variant” has been found all over the world already</strong>. Therefore its already everywhere. Locking down travel after it is already in your nation is stupid and does nothing. The variant is either going to become dominant or it will not. You cannot alter that course once it gets to you — and no matter where you are it already has.</p><p><strong>This “variant” has no evidence of being more deadly; it may in fact be less-so. Indeed that is the natural mutational pattern coronaviruses follow over time. </strong>There is no evidence in the form, for example, of higher hospital admissions, ICU utilization and death in those in which this variant has been detected. In other words thus far all the scaremongering has been based on….. exactly nothing as there are no facts currently in evidence to support such fear.</p><p><strong>The vaccines clearly do not work.</strong> International travel has been vaccinated-only everywhere for quite some time. So the person(s) who brought the virus into your nation with this “variant” were vaccinated. The market, of course, responded to this news by spiking the vaccine companies, specifically Moderna. You have to wonder what sort of stupidity would drive someone to consider a firm that has one product which clearly did not work a “buy” in a situation like this. Mass psychosis is the only reasonable explanation.</p><p><strong>Lockdowns and constraints clearly do not work either.</strong> The virus mutated because that’s what viruses do, and specifically coronaviruses do this all the time. It’s common. Further, vaccinating into an outbreak promotes vaccine-resistant strains because that’s just how natural selection works. You want the opposite but you can’t get there from here by vaccinating people while an outbreak is going on so the better option is to focus on early treatments and even prophylaxis which does not place immune pressure on the virus to evade your jabs.</p><p><strong>Meanwhile the evidence continues to mo</strong>unt that prior infection confers better resistance than vaccines. Perfect immunity? No. But much better immunity and, to three nines, perfect protection against critical illness and death.<br/><em>There were no cases of critical disease at reinfection and 28 cases at primary infection (Table S3), for an odds ratio of 0.00 (95% CI, 0.00 to 0.64). There were no cases of death from Covid-19 at reinfection and 7 cases at primary infection resulting in an odds ratio of 0.00…</em></p><p>So which do you prefer, since while the jabs do appear to provide some protection it wanes and it certainly does not prevent 100% of the severe and fatal outcomes.</p><p>Never mind the jab side effect profiles, which are quite dangerous, the evidence is mounting that the intermediate and long-term dangers are very significant and, in addition, there is mounting evidence that if you get jabbed and then are infected, and you will get infected, you are likely to not build “N” protein recognition so you can get infected again and again until you get the bad case that screws you. This is due to a well-recognized phenomena called “OAS” (“Original Antigenic Sin”) and is directly caused by the vaccines as they “train” your body to produce “S” antibodies, which is all they contain coding for and not “N” protein antibodies which are critical as the virus cannot mutate in that part to any material degree and remain a viable virus.</p><p>On the other hand the evidence is that beating the disease without a jab once means you have durable protection against critical and fatal outcomes on an extremely reliable basis including potential mutations since the “N” protein does not and cannot undergo substantial change.</p><p>The latter, by the way, is the pattern <strong>for every serious viral disease outbreak through history.</strong></p></blockquote><p>It’s becoming increasingly obvious that this entire two-year global anti-virus campaign has been a charade. Whatever the true objective was, neither saving lives nor health care was actually the purpose. Which reminds us, once again, that the one thing we can be absolutely certain is not true is whatever the official story being pushed by the government-media complex is.</p><p><em><a href=\"https://social.infogalactic.com/micropost/b8db1eb5-5192-426a-bda6-a7bfe6622a1e\">DISCUSS ON SG</a></em></p></div>",
  "content_text": "Karl Denninger reminds us of\nwhat we now know from experience\n, rather than theory, as the media begins its latest round of fearmongering over the so-called “omicron” variant which supposedly emerged in Botswana. Or South Africa. Or, possibly, Australia.\nThis “variant” has been found all over the world already\n. Therefore its already everywhere. Locking down travel after it is already in your nation is stupid and does nothing. The variant is either going to become dominant or it will not. You cannot alter that course once it gets to you — and no matter where you are it already has.\nThis “variant” has no evidence of being more deadly; it may in fact be less-so. Indeed that is the natural mutational pattern coronaviruses follow over time.\nThere is no evidence in the form, for example, of higher hospital admissions, ICU utilization and death in those in which this variant has been detected. In other words thus far all the scaremongering has been based on….. exactly nothing as there are no facts currently in evidence to support such fear.\nThe vaccines clearly do not work.\nInternational travel has been vaccinated-only everywhere for quite some time. So the person(s) who brought the virus into your nation with this “variant” were vaccinated. The market, of course, responded to this news by spiking the vaccine companies, specifically Moderna. You have to wonder what sort of stupidity would drive someone to consider a firm that has one product which clearly did not work a “buy” in a situation like this. Mass psychosis is the only reasonable explanation.\nLockdowns and constraints clearly do not work either.\nThe virus mutated because that’s what viruses do, and specifically coronaviruses do this all the time. It’s common. Further, vaccinating into an outbreak promotes vaccine-resistant strains because that’s just how natural selection works. You want the opposite but you can’t get there from here by vaccinating people while an outbreak is going on so the better option is to focus on early treatments and even prophylaxis which does not place immune pressure on the virus to evade your jabs.\nMeanwhile the evidence continues to mo\nunt that prior infection confers better resistance than vaccines. Perfect immunity? No. But much better immunity and, to three nines, perfect protection against critical illness and death.\nThere were no cases of critical disease at reinfection and 28 cases at primary infection (Table S3), for an odds ratio of 0.00 (95% CI, 0.00 to 0.64). There were no cases of death from Covid-19 at reinfection and 7 cases at primary infection resulting in an odds ratio of 0.00…\nSo which do you prefer, since while the jabs do appear to provide some protection it wanes and it certainly does not prevent 100% of the severe and fatal outcomes.\nNever mind the jab side effect profiles, which are quite dangerous, the evidence is mounting that the intermediate and long-term dangers are very significant and, in addition, there is mounting evidence that if you get jabbed and then are infected, and you will get infected, you are likely to not build “N” protein recognition so you can get infected again and again until you get the bad case that screws you. This is due to a well-recognized phenomena called “OAS” (“Original Antigenic Sin”) and is directly caused by the vaccines as they “train” your body to produce “S” antibodies, which is all they contain coding for and not “N” protein antibodies which are critical as the virus cannot mutate in that part to any material degree and remain a viable virus.\nOn the other hand the evidence is that beating the disease without a jab once means you have durable protection against critical and fatal outcomes on an extremely reliable basis including potential mutations since the “N” protein does not and cannot undergo substantial change.\nThe latter, by the way, is the pattern\nfor every serious viral disease outbreak through history.\nIt’s becoming increasingly obvious that this entire two-year global anti-virus campaign has been a charade. Whatever the true objective was, neither saving lives nor health care was actually the purpose. Which reminds us, once again, that the one thing we can be absolutely certain is not true is whatever the official story being pushed by the government-media complex is.\nDISCUSS ON SG",
  "tags": [
    "conspiracy",
    "globalism",
    "science",
    "vaccines"
  ],
  "categories": [],
  "sitemap_lastmod": "2021-11-28T09:45:24+00:00"
}