{
  "url": "https://voxday.net/2021/11/11/the-jfg-vd-debate/",
  "scraped_at": "2026-01-08T13:08:49.230269",
  "title": "The JFG-VD Debate",
  "date_display": "November 11, 2021",
  "date_iso": "2021-11-11T16:36:00+00:00",
  "date_from_url": "2021-11-11",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p><em>A complete transcript of my debate with JF Gariepy on the mathematical legitimacy of evolution by natural selection.</em></p><p>JF: “Hello everyone and welcome to the evolution debate with Vox Day. I was explaining to the crowd that, with my voice extinction, I almost want to abandon and just recognize that God did it all.”</p><p>VD: “Well, I don’t think that divine intervention is responsible for that, I doubt that, He is excessively concerned with whatever result we release tonight. But, you know my suggestion is we’re all familiar, or at least most of us are familiar, especially those of us who have read your very interesting book The Revolutionary Phenotype, we’re familiar with the orthodox argument. So what might be interesting is if I simply present to you the stuff that I’ve been putting together, and with your help explaining some of the concepts that, quite honestly are not terribly familiar to me. Perhaps we can reach some interesting conclusions.”</p><p>JF: “Absolutely, and the more you can speak the better, it helps my voice and my throat, so you can feel free to take a lot of space in the discussion. I would say that as far as I’m concerned, the Theory of Natural Selection is a mathematical truth. It is a truth that applies to anything that makes imperfect copies of itself, and one just has to realize that the life forms on earth right now, they <em>are</em> replicators, they are respecting the conditions for Natural Selection to apply to them.”</p><p>VD: “Well I think that it’s a fascinating choice of words there, because it’s specifically the mathematical aspect of the theory that I’m addressing. I’ll read to you my little intro in a minute here, and I would encourage anyone who’s listening to not leap to any assumptions, because some of the stuff you’re going to hear at first is going to make you conclude that I’m going to go in a certain direction, but I can promise and assure you that I’m not going in any of the places these arguments usually go.”</p><p>JF: “Alright, let’s hear it.”</p><p>VD: “Okay, well first of all, one thing that I’d like to point out is that when we address these topics that have been addressed many times before over the course of hundreds of years it’s quite normal to believe that nobody’s going to come up with anything terribly interesting new to say about that. What I’d like everybody to keep in mind is that both JF and I have in fact come up with new ways of looking at very old, very accepted theories. JF has done so with his <em>Revolutionary Phenotype</em>. For those of you who are not familiar with me, my background is economics, and I came up with a very effective, some would say conclusive, demolition of David Ricardo’s theory of Free Trade which is some fifty-seven years older than Evolution by Natural Selection in the Darwinian sense. So all I’m saying is that, as ridiculous as it might sound, that some of the stuff we’re going to be discussing here might not necessarily have been discussed before. Both JF and I have in the past demonstrated an ability to do this.</p><p>JF: “Absolutely.”</p><p>VD: “So, the tautological nature of the Theory of Evolution by Natural Selection means that it is unfalsifiable, unscientific, and entirely unable to serve as the basis of a reliable predictive model. That said, it’s not my objective to convince JF or anyone else of that, or to rehash any arguments that we’ve all encountered many times before. The case that I’m presenting tonight doesn’t have anything to do with the fossil record, it doesn’t have anything to do with Fyodor, or Chomsky, or logic in that context. What I’m addressing is the idea, what I’m proposing is the idea that Natural Selection is not just statistically improbable, but that it is statistically IMPOSSIBLE due to the way it’s directly contradicted by the relevant genetic evidence.</p><p>Now, I have to point out that I am an economist by training, not a biologist, and so I’m going to have to ask JF some questions about some of these things, and I’m not doing so in a Socratic manner. It’s not any sort of Euthyphro, trying to play it fast and loose and get him to agree to something. These are going to be honest questions about a subject that he knows much better than I do. If that’s okay with you.”</p><p>JF: “Absolutely, I’m all for it. Yeah we can see tonight’s discussion as trying to build your case against the Theory of Natural Selection.”</p> <span id=\"more-50884\"></span><p>VD: “I fully admit that there is a possibility that there is something that I am missing, something that I am not understanding, and that would, obviously, tend to destroy my case, <em>but</em> I don’t have any way of destroying it myself. You know, it’s a sound case to the extent that I understand it, <em>but</em> it’s possible that I don’t understand something, and that’s why I’m relying on JF to hop in and correct me if I’m wrong on something.”</p><p>JF: “Alright. I’ve myself played for the last week on genes, I’ve been trying to make genes evolve, and I’ve been looking at different life forms just to be sure it was possible within the numbers that I have, and personally I concluded that it’s very realistic, the kind of mutations that we see in eukaryotes, mammals, prokaryotes – I’ve reproduced them all.”</p><p>VD: “Well, I’m going to begin by quoting an author, a biologist, the author of <em>The Revolutionary Phenotype</em>, and he wrote,</p><p><em>“Natural Selection is the mechanism by which phenotypes, across generations, become more</em> <em>and more servile to the replicators. Simply put, the replicators are able to create good</em> <em>phenotypic machines, replace other replicators by outnumbering them. If you extrapolate this</em> <em>principle over millions or billions of generations, you can understand why a bacteria could</em> <em>progressively evolve into a bird.”</em></p><p>Now that’s what got me thinking, because that’s what got me looking at this from the context of an economist, and economists, like biologists, are forced to deal with very very complex issues that are very very hard to measure. It’s extremely difficult to track the billions of transactions that are taking place at any one time, in the same way that it’s very very difficult to track the millions or billions of generations that have taken place over time.</p><p>JF: “Absolutely.”</p><p>VD: “So let’s accept for the sake of argument that this principle can be not-unreasonably extrapolated. What I’m saying is I’m accepting JF’s idea that we can extrapolate this principle over millions or billions of generations. That’s fine. This raises what I believe to be an obvious question, which is precisely how many of those millions or billions of generations did we have? It’s a very very difficult question to answer. It’s like saying, how many dollar transactions, in cash, took place across the United States yesterday. It’s very hard to say.</p><p>JF: “Absolutely. It’s very hard, because even the multiplications rates of bacteria today may not be representative of what they were two billion years ago.”</p><p>VD: “Precisely. But I submit that we can come up with estimates that, rather like the Newtonian physics model, are imperfect, but they’re close enough for practical purposes like launching rockets into space or figuring out when the next solar eclipse is.”</p><p>JF: “Absolutely.”</p><p>VD: “So I want to start by establishing a few points of agreement and clarification. I have four questions, and again, this is not a Socratic prosecution, I’m just trying to understand and clarify for everyone the orthodox perspective. So, the first one: In <em>The Revolutionary Phenotype</em> you wrote,</p><p><em>“By the end of this book, the RNA-world hypothesis will have been demonstrated as a</em> <em>certainty.”</em></p><p>My question is, is it correct to say that in order to demonstrate that certainty about events that took place so long ago, you are relying primarily upon logic rather than the conventional scientific method?”</p><p>JF: “Absolutely. I’m relying on the principle of Everlasting Fingerprint, which states that, essentially, any genetic layer you see in an organism today has been the reflection of a past phenotypic evolution. Therefore, because RNA has a genetic layer, we must conclude that it was a life form before DNA.”</p><p>VD: “Right, and that is intrinsically a logical syllogism, and so we’re just establishing the principle here that for the sake of this discussion we will accept tight logical syllogisms to establish certainty.</p><p>Number two, do you accept the legitimacy of mathematics as a reliable foundation for a similar logical argument? What I mean by that is do you accept in principle the concept of mathematical impossibility like the Five-Sigma rule?”</p><p>JF: “I don’t know the Five-Sigma rule, but I would say mathematical proofs are valid to me. The only question when you apply them to empirical matters is whether you are doing the mapping correctly. For example if I was to say two plus three equal five, I could prove it in mathematics. I could also do it with tomatoes and apples. The only error that could happen is, if my mathematical model does not reflect the initial reality, then I will have a different result in the universe, but that is an error of mapping.”</p><p>VD: “Correct. Right. Just to explain, the Five-Sigma rule is actually a 0.00006% chance. It’s equivalent to twenty-two coin flips in a row coming up heads. So, that’s what we’re using as a standard here.”</p><p>JF: “Well, it’s an arbitrary threshold, I would point out that it’s simply an arbitrary threshold.”</p><p>VD: “Agreed. Right, and I’m not actually concerned about that, I just wanted to establish the fact that you accept mathematics as a reasonable form of logic.”</p><p>JF: “Yep.”</p><p>VD: “Now, what do you consider to be a reasonable estimate for an average number of generations per fixed mutation? I’m talking about bacteria – we’re talking about generations, not time. So what would you – there’s a number of studies that range – that have a fairly wide range depending upon the species and so-so, but I’m just wondering, what would you consider to be a reasonable estimate? By fixed mutation I mean a mutation that has successfully percolated through the species to the point that it has become permanently established at one hundred percent frequency in the population and is now part of the dominant form of the species.”</p><p>JF: “Well, this question has two components, but I’m going to give you the two answers.”</p><p>VD: “Okay.”</p><p>JF: “The problem is that the first criteria is whether the mutation appears, and that, I have relatively precise numbers. Let me just open my document here, I’ve been noting this. So, for a single letter of DNA to mutate in a eukaryote life form, which is a single cell – and of course this varies, this mutation rate will vary, it’s not the same in bacteria, it’s not the same in mammals – but it happens 0.000000004 times per generation that a mutation will occur on a given letter.”</p><p>VD: “Right.”</p><p>JF: “So that’s a lot of generations before a single letter of DNA will be mutated. So that is the first rate, it is the rate of a single site of DNA mutating. Now, whether this will spread across the population, there’s actually a range of answers that depend on how fit that change is, and it goes from disappearing from the population if it’s unfit, to slowly gaining into the population if it’s just neutral, and to totally dominating the population within three, four generations if it’s extremely more fit.”</p><p>VD: “Okay. So, you don’t have an average, but you have a range that like the minimum would be three or four generations.”</p><p>JF: “Yeah, let’s say that the fastest evolutionary pressures that I can think of, which would be literally a gene which makes you make ten times more babies than your neighbor, and in fact those babies also kill a hundred of your neighbor’s too, we can imagine this spreading across the population in a few generations. Very little numbers.”</p><p>VD: “Right. I’ll get to that later, I just wanted to get your general idea. So, we’ll say three generations is the absolute maximum, but the more realistic average is probably considerably higher.”</p><p>JF: “Yes, but it’s not even the absolute maximum. I can imagine a mutation that literally annihilates everything around it, it’s just I don’t have a natural example of this, but we cannot exclude that mathematically, that in a single generation all bearers of a gene would survive and all the others would be eliminated. One example are natural events like meteorites, they probably do something along those lines. They select genes that were already predisposed to survive a meteorite.”</p><p>VD: “Fair enough. I have no quibbles there. I want to point out – this is just straight-up from Wikipedia – in population genetics, fixation is the change in a gene pool from a situation where there exist at least two variants of a particular gene in the population to a situation where only one of the variants remains. That’s why we talk about fitness – any variant must eventually be lost completely from the population, or fixed. That’s not my definition, that’s just from Wikipedia.</p><p>Just to put some lab studies into the mix, the McGill Evolutionary Rescue study found that it took a hundred generations to fix a single yeast mutation. The E-Coli in the lab can take – they found that it tended to take around fifty thousand generations for that. So there’s a big range.</p><p>And again, I’m not trying to – when I get to the math that I’m gonna present, I’m trying to present the situation that is most optimal – I’m trying to make a case for the fastest possible case.”</p><p>JF: “Perfect.”</p><p>VD: “Now my last question, before I get into it, how many fixed mutations would you estimate separate humans from the common ancestor shared with chimpanzees? We’ve been told that the Chimpanzee Genome Project catalogs genetic differences between human and chimpanzee, with thirty-five million single nucleotide changes, five million insertion/deletion events, and various – so helpful – various chromosomal rearrangements. That’s, how many would you – again, I’m not going to hold you to this, I just want to get a general idea – how many fixed mutations would you estimate roughly?”</p><p>JF: “I’m not a specialist of that, but the numbers you just stated I would tend to believe them, they seem realistic to me.”</p><p>VD: “Okay. Here’s another way of looking at it that may be too crude, but again, coming at it from an economics perspective, both humans and chimpanzees have roughly three billion base pairs, and we’re told that they are….”</p><p>JF: “Three billion?”</p><p>VD: “Three billion.”</p><p>JF: “Okay.”</p><p>VD: “We’re told that they are 98% identical in terms of DNA. So that would imply that there are sixty million different base pairs, which would tell us, because it’s two different paths, we’re talking each – they both have thirty million mutations since the common ancestor. And that’s kind of close to that other number, with the thirty-five million plus the five million.</p><p>JF: “Absolutely.”</p><p>VD: “Would you consider that to be a reasonable number?”</p><p>JF: “Yes, without having any authority in this area, but it’s definitely within the range I expect.”</p><p>VD: “Okay, very good. Again, I have no idea whatsoever, my level of knowledge is Wikipedia. Now, here’s where it starts to get interesting, because if we take the numbers we’re discussing here, and we start looking, we start breaking the matter down the way that economists do, we start with the amount of time involved, and according to The New Scientist, the first bacteria started to appear 3.8 billion years ago. So the number of – whatever happens has to fit within 3.8 billion years. We know this, this is not controversial except to the Young Earth creationists, which I am not.</p><p>Now again, we’re just going with the best information we have, but the – in Nature, a study was published in 2009, and they sequenced nineteen whole genomes, and they detected twenty-five mutations that were fixed in forty thousand generations. And so that indicates that a reasonable rate – that comes to sixteen hundred generations per fixed mutation. Granted this is bacteria, granted this is E-Coli, etc, etc. They have seen faster rates of mutation, but this is an actual rate of fixed mutations. Now, we’re not going to hold to this, this is just a starting point.”</p><p>JF: “Yeah, I’m gonna raise some problems here though.”</p><p>VD: “Okay.”</p><p>JF: “The first thing is sexual transmission of genes is vastly different, in terms of fixation, because you can have genes that were spread across the population extremely fast, and they don’t even have to be naturally selected, they don’t even have to be advantageous sometimes, they will just come in a package with other genes that are advantageous, and the sexual partners who just transmit the whole package will have an edge in spreading throughout the population. That’s the difference with E-Coli which did not probably use sexual mutations of any kind.</p><p>I will also say that fixation is not the standard by which you should go, because it’s not the case that every mutation which makes the chimpanzee differ from the human – they don’t have to fixate each of them, there could be fixation by package if you will, there could be an accumulation of, I don’t know, a hundred thousand differences, and then boom, fixation of all of these differences.</p><p>VD: “Oh, certainly, there’s a number of different perspectives, but what I’m trying to do here, is we’re building the basis for a mathematical model that we can make more complex eventually. These are things that we know. So if we assume – if we take this nature-based number of 1,600 generations per fixed mutation, and that’s what the study was designed to do, to figure out how quickly these genes get fixed in the population.</p><p>Now, these bacteria live very very quickly, and so the estimated time per generation is only thirty-seven point five minutes. So now what we’re looking at is .000071347 years per generation. That means that there are 14,016 generations per year. So that means that even though it takes sixteen hundred generations per fixed mutation, that it only takes one tenth of a year per fixed mutation, which means over the course of 3.8 billion years, that gives us a maximum number of fixed mutations at that rate of 33.3 billion fixed mutations.</p><p>JF: “Yeah, the – it’s….”</p><p>VD: “That gives us a lot of room for evolution.”</p><p>JF: “I think that the fact that you start with fixed mutation is a bad way to go at it. What you would have to go is go through mutational frequency of every single letter of DNA, because they can all happen and they can all get fixed later. Really the fixation problem is a separate problem in Evolution.”</p><p>VD: “Right, but the point is that, all we’re dealing with here is it gives us a fixed point at which we can start building the model. We can build complexity, we can build speed, we can build all of those things on top – you know, this is how we approach things with economics, first you start with just the C+I+G, +X-M, but we don’t leave it there.</p><p>So here’s where it starts to get even more interesting is that, if you – what we’re trying to look at there is that’s a very fast rate of population changes. The genes are getting fixed very very quickly. Now, but that’s also in the laboratory, and that’s in a different setting. In the stomach, the same bacteria actually tends to take longer to mutate, the generations are longer, the generations were actually measured at twelve hours per generation in your stomach. So it takes .625 hours, it takes twelve hours, if you run through the exact same math then that reduces the number of maximum mutations to 1.15 million, <em>but</em> now we’re saying okay well, twelve hours per fixed mutation, that’s too long, for bacteria, on average.</p><p>And in fact with bacteria we don’t really know how this all works, there’s so many different bacteria and stuff, but we can take the same principle, and we can now apply it to mammals. You know, mammals we’re dealing with 200 million years rather than 3.8 billion years, and mammals, if you analyze the 5,427 extant species, they average 4.3 years per generation. Again, these are straight-up, scientific facts. And I’m willing to grant you – we’ll get into the whole whether we can use fixed mutations as meaningful or not – but with the mammals, if we were to apply the same 1,600 generations per fixed mutation, which I agree is too long, that would mean that it takes 6,880 years per fixed mutation, which leaves a grand total of 29,070 mutations between the very first mammal and homo sapiens sapiens.”</p><p>JF: “Well, okay, what is the number again?”</p><p>VD: “200 million years, 4.3 years per generation, 1,600 generations per fixed mutation – but that’s based on bacteria – so that leads us to 6,880 years per fixed mutation, and a maximum number of 29,070 mutations.”</p><p>JF: “Alright, yeah, I mean, it sucks, but I still disagree with the premise. I think that the model you built is almost there, it’s just that you cannot use fixed mutations, because it’s a fallacy to believe that every mutation has to be fixed. Every mutation has to <em>happen.</em>”</p><p>VD: “No, I agree, I agree it needs to be improved, in fact, that was the very point that – I’m impressed that you landed on it so quickly, because that was the very point that I was concerned about, was, how many mutations can be simultaneously fixing at the same time? And so that’s the obvious next question, but let’s just go through this so that I can demonstrate where the central issue’s going to be.</p><p>Again, I’m not claiming that I can prove anything, tonight. I don’t have the necessary information about biology and genetics to do that, but what we can do is at least point to where the mathematical model has to be improved, because this will – could be – very significant in that regard.</p><p>I think that the 1,600 generations per mutation for mammals is excessive, because I don’t think that the bacteria is necessarily relevant. You know, if you start thinking what we’re actually talking about, we’re talking about how quickly does the entire population change? And there are two different ways we can look at that. One of them is, if we look at some laboratory studies of yeast, which is a little bit more complicated than the bacteria.</p><p>Another way, and this is something that I developed to maximize speed of population change, is what I call the minimum viable population. So, if you simply look at what the minimum viable population is, and how quickly a minimum viable population can completely change over at the basis of the fastest observed reproduction advantage, which is about 1.7 so a 70% advantage.</p><p>If you look at it from the yeast perspective, it gets better. 200 million years, 4.3 years per generation, but only seventy-five generations to fix a mutation. That’s the speed that they’ve observed with the yeast. That means that it’s only 323 years for a mutation to be fixed, which allows for 620,155 mutations, and it gets even better for the Theory of Natural Selection if you look at the minimum viable population, because that would allow for a complete transformation of the population and fixation within 15.7 generations, which is extremely fast. Scientists usually consider 50-100 generations to be very fast. Fifteen is practically at your catastrophic level speed of three generations, and that would allow for 2.962 fixed mutations in between the first mammal and man.</p><p>Now obviously, that’s not enough, and this is where it starts to get a little bit negative, or actually considerably negative for the natural selection idea, or even other gene-mutation ideas, because there are a broad range of estimates for the time between the CHLCA which is the Chimp/Human Last Common Ancestor. I’m going to read the – it was kind of amusing to me – I’m going to read the different estimates.</p><p>The first estimate was 25 million years, then in the 70s protein studies reduced that to 8 million years. A comparison to orangutans and gibbons dropped it to 5 million years, The Molecular Clock reduced it to 4 million years, then a 1998 study increased it to 13 million years, a 2009 study dropped it to 7 million years, and the current estimate is a study by somebody named Morgiani, which is a genetic-based one, and it estimates 6-12 million years. So I just split the difference and said nine.</p><p>So now if we look at primates, we take the oldest period there, 25 million years, the primate generations are 20 years according to that same mammal study. If we use the fast, minimum viable population rate of 15.7 generations per fixed mutation, that leads 314 years per fixed mutation, and allows for 79,618 mutations. If we go to the other extreme, the most disadvantaged one that we can use based on these numbers, we have 4 million years from the last common ancestor, 20 years per generation, 1,600 generations per fixed mutation, 32,000 years per mutation, and that would leave room for only 125 mutations between the CHLCA and today.</p><p>Now obviously, if those final numbers are to be considered legitimate, then the Theory of Evolution by Natural Selection cannot possibly be true. But what I think is interesting is that this shows you how many – if TENS is to remain viable, this shows you how many mutations have to be happening either simultaneously or so fast that we should be able to observe them more easily than we do.</p><p>JF: “Well, it’s about time for me to be crushing your dreams Vox….”</p><p>VD: “Go for it.”</p><p>JF: “The thing is, this little axiom that I’ve been trying to talk to you about since the beginning, which is the difference between a fixed mutation rate, and a mutation rate which is what most scientists who ask these questions will work with is – it will multiply your numbers by millions and billions. Just look at this for example…” *Brings up table.* “…this is the number people actually work with, it is insertion and deletion events per site per generation, and mutation rate per site per generation.</p><p>Now, contrary to what instinctive thinking about this would tell us, homo sapiens is actually having a very high rate of mutation per site per generation, 135×10^-10. The reason you have to multiply these, and not think of fixed event, is that no your entire population does not have to conform to each other, there is nothing in Natural Selection that forces your population to have some sort of homogeneity. Everyone is developing mutations at the same time, in parallel. That is one of the power of Natural Selection, is that you don’t need the whole population to reach a floor after which the next mutation can come in.</p><p>All of these mutation are happening on all of DNA, and we see them happen. We see them happen between a father and a daughter, we see their genome and we will see that there is maybe sixty letters of DNA that differ between the father and the daughter, and these sixty letters of DNA will differ between one father and one daughter, but if you take another couple it’s going to be a different set of mutations. So we see them happening all the time, but that’s why, if you work with your fixed mutation rates, you are essentially working with the hypothesis that every time your mutation must be preserved to the next generation, it must spread to the entire population, when it doesn’t. It doesn’t because we know that in humans the entire population differs vastly.”</p><p>VD: I understand that, but in order to get to the point where everybody has those features that are dependent upon those specific genetic changes – not all of the genes have to be fixed, but if we all have the same eye, then all of the genes related to that have to have been fixed at some point in time, by the point that we all are shown to have that eye, correct?”</p><p>JF: “I mean, we don’t have the same eye, that’s the problem, but your thinking is not wrong there, it’s just that we don’t have the same eyes, we don’t have the same hairs, we don’t have the same intelligence – some of us look more like chimpanzees, you know?</p><p>VD: “But the chimpanzees don’t have any of that 2% of genes that are different, correct?”</p><p>JF: “Well, I mean if you were to take a bunch of humans on a specific gene, some of them would actually be closer to the chimpanzees than others.”</p><p>VD: “Okay, so what you’re saying is that there’s this whole genetic spectrum from human to chimpanzee that still exists, that is not fixed.”</p><p>JF: “Um, well, it’s a spectrum, but there is a division, which is there’s not a single human who can reproduce with a chimpanzee right now, so we know that the two groups have diverged enough to be different enough, but it remains the case – and I think you mentioned that on your own stream, you said that whiteness, for example, has evolved later in human populations, and it is true, at least based on the data you were showing and the study you were showing, if we believe that study, then yes, whiteness of the skin has emerged later. Now, you called it a more evolved trait, we have a more polite word for it, we say a derived trait.”</p><p>VD: “Fair enough. The interesting thing here is that, right, there’s no possible way that every single mutation has to get fixed before the next one does.”</p><p>JF: “Exactly.”</p><p>VD: “I understand that, but when we start looking at the problem from this situation, what we see is that in order for there to have been time, for enough of these mutations to have been fixed across the entire population – not all of them, I understand that – but enough of them have to have been fixed in order to create the speciation that we see, that it puts the theory between a rock and a hard place. Either we can see enough of it happening that we can predict it, that we can make use of it as a predictive model, or the process simply requires too much time, more time than we are permitted by our current understanding, which would tend to indicate that there is something else going on, some other force, some other – you know, we already know there are other forces going on, that’s why we talk about, you know, gene drift, and genetic flow, and sexual selection, and all that sort of thing.</p><p>We already know that there are these other forces, but my point is that we can, we know exactly the maximum number of generations that existed over these periods of time, and if we start building a model from this way and look at – again, I don’t have the genetic background to build that mathematical model, but if you start looking at what percentage of genes have to be fixed, and what percentage can be propagating at the same time. Because what what we’re really talking about – we’re not talking about the problem of mutations – we’re talking about the problem of mutational propagation throughout the population required for speciation.”</p><p>JF: “Well, I think that, attacking this problem, it shows that you have been doing a lot of thinking, and you are a very intelligent and logical person, however, I’ve been doing that too, and I’ve found this to be a dead end of thinking.</p><p>The big problem of speciation is that species are not a natural category. Species are something we observed and it’s – they could be there, they could not be there, and there are continuums across time, that’s why most people who actually think of evolution of genes across billions of years, they don’t think in species, because species makes sense when you are within a slice of time. These people cannot reproduce with these people, therefore separate species.</p><p>The reality is that a species switch could occur on a single mutation. You don’t need all of the mutations that make these species different for them not to be able to breed. You just need a mutation that will make their sexual organs incompatible, or their pheromone system contradictory in some way, and we’ve seen it happen in certain fish populations you know, where we look and – this I’ve detailed in my video called Speciation: When Races Become Species, and it’s essentially a single mutation, or a single series of mutations that will be enough to break the chain of reproduction such that one population that was kind-of able to reproduce with the other becomes totally unable.</p><p>Now, I have a gift for you today, Vox Day. It’s my program, I’ve been making it since my video replies to you. I’ve called it even Voxolution. So, it’s an evolutionary program that actually frames these questions properly, with per site frequency of mutation, and here I’ve taken the per site mutation frequency taken in the literature, and I’ve taken two specimens. So that’s a sequence of DNA that comes from one bacteria, and that’s a sequence of DNA that comes from one eukaryote that shows up probably a billion years later or more, and I asked, what is the fastest way to get from that sequence to that sequence, if those mutations are occurring in all sorts of orders. And in fact the answer that this program give – and you can insert really any gene in there, you could insert the gene of a human and a chimpanzee, and you could get your answer, but it’s really – those life forms are separated by a billion year according to current theoretical calculation, and the minimal chain of mutation needed could occur in 35 million per year. So we have plenty of space, we – these mutation must occur, to the extent that they keep occurring, in all sorts of millions of individuals across millions of generations, the shortest path for it to occur is a fraction of the total time that it took for it to occur.”</p><p>VD: “That’s exactly what I would expect to see, I mean, when we’re talking about – that’s what I wanted to find out, I wanted to find out what is the fastest number of generations that these things can take place, so I will be more than happy to play with your program, and see if we can apply it to this model, to further develop it, because, again, when you look at the number of generations involved, especially with regards to – the more recent we get, when we go to the chimpanzee thing, and so forth, the time clock becomes tighter and tighter to the point, and that’s why I refer to the rock and the hard place, because if we’re able to make that level of change in the number of generations we talked about with regards to the 4-25 million years to the chimpanzee and the human, then we should be able to develop better Natural Selection-based predictive models than we currently have, which as a game designer interests me.</p><p>JF: “Well, that’s a long shot I would say, but essentially the key of my program in comparison with your hypothesis which you laid out is that, when I have this letter of G trying to change to A, that doesn’t stop this other letter to be working toward modifying itself toward this. So essentially, the key to the difference between our two models, which differ by billions of years probably, if we were to ultimately make calculations with them, is that my model allows parallel evolution of different genes, whereas yours kind of makes a step, you need a step, you wait for the mutation to be fixed and then you need another step, but it’s not totally useless, your view.</p><p>Kind of brings back – it seems that it’s a model that you would have developed with the goal of attacking Natural Selection, because the general model that scientists work with in their mind is, okay, there’s a small mutation, it gains the entire population, and then it leads to a floor upon which other mutations can build. That’s indeed how people express it to elementary school children, but that’s not necessarily how it happens. What happens is that a <em>massive</em> parallel development, such that people who subject two different species today, they come from a single ancestor and a chain of events that have occurred all in parallel. Sometimes the population was not totally separated. Sometimes they were coming back together, they were having some babies with some frequencies, the same way we see it with, for example, Neanderthals. They have had sex with homo sapiens, but not enough to completely change or fix the population.”</p><p>VD: I understand that, but that’s exactly the point that I’m addressing, is that once we take a look at measuring the amount of parallel processing that is taking place and we compare it to the propagation, then we have the ability to compare it to what we actually observe and see whether those two things are viable. And that’s where I think the interesting point is, because, again, my skepticism is – it’s the same reason that I was skeptical of Free Trade, you know everybody has – for two hundred years, everyone had certain assumptions about things, but once we actually had the opportunity to observe the level – what happens when labor actually becomes mobile, the theory ended up melting down.</p><p>I understand you’re very confident that it’s possible for the level of parallel processing to allow for this very very fast propagation that’s necessary to fit within the time frames. I’m a little bit more skeptical about that obviously.”</p><p>JF: “All right, so, I think that we can end for tonight. It was a really fun conversation, but given that my voice is tired I don’t think that I can go on much more. I’ll be sending you a copy of the program, and let’s do that again in the future, once you’ve had time to play with it.”</p><p>VD: “Absolutely. Thanks so much.</p><p>JF: “All right. Vox, bye bye, and thank you so much for coming.”</p><p><em><a href=\"https://social.infogalactic.com/micropost/49b9f50a-ec7a-4a8a-8c83-7263839d77f4\">DISCUSS ON SG</a></em></p></div>",
  "content_text": "A complete transcript of my debate with JF Gariepy on the mathematical legitimacy of evolution by natural selection.\nJF: “Hello everyone and welcome to the evolution debate with Vox Day. I was explaining to the crowd that, with my voice extinction, I almost want to abandon and just recognize that God did it all.”\nVD: “Well, I don’t think that divine intervention is responsible for that, I doubt that, He is excessively concerned with whatever result we release tonight. But, you know my suggestion is we’re all familiar, or at least most of us are familiar, especially those of us who have read your very interesting book The Revolutionary Phenotype, we’re familiar with the orthodox argument. So what might be interesting is if I simply present to you the stuff that I’ve been putting together, and with your help explaining some of the concepts that, quite honestly are not terribly familiar to me. Perhaps we can reach some interesting conclusions.”\nJF: “Absolutely, and the more you can speak the better, it helps my voice and my throat, so you can feel free to take a lot of space in the discussion. I would say that as far as I’m concerned, the Theory of Natural Selection is a mathematical truth. It is a truth that applies to anything that makes imperfect copies of itself, and one just has to realize that the life forms on earth right now, they\nare\nreplicators, they are respecting the conditions for Natural Selection to apply to them.”\nVD: “Well I think that it’s a fascinating choice of words there, because it’s specifically the mathematical aspect of the theory that I’m addressing. I’ll read to you my little intro in a minute here, and I would encourage anyone who’s listening to not leap to any assumptions, because some of the stuff you’re going to hear at first is going to make you conclude that I’m going to go in a certain direction, but I can promise and assure you that I’m not going in any of the places these arguments usually go.”\nJF: “Alright, let’s hear it.”\nVD: “Okay, well first of all, one thing that I’d like to point out is that when we address these topics that have been addressed many times before over the course of hundreds of years it’s quite normal to believe that nobody’s going to come up with anything terribly interesting new to say about that. What I’d like everybody to keep in mind is that both JF and I have in fact come up with new ways of looking at very old, very accepted theories. JF has done so with his\nRevolutionary Phenotype\n. For those of you who are not familiar with me, my background is economics, and I came up with a very effective, some would say conclusive, demolition of David Ricardo’s theory of Free Trade which is some fifty-seven years older than Evolution by Natural Selection in the Darwinian sense. So all I’m saying is that, as ridiculous as it might sound, that some of the stuff we’re going to be discussing here might not necessarily have been discussed before. Both JF and I have in the past demonstrated an ability to do this.\nJF: “Absolutely.”\nVD: “So, the tautological nature of the Theory of Evolution by Natural Selection means that it is unfalsifiable, unscientific, and entirely unable to serve as the basis of a reliable predictive model. That said, it’s not my objective to convince JF or anyone else of that, or to rehash any arguments that we’ve all encountered many times before. The case that I’m presenting tonight doesn’t have anything to do with the fossil record, it doesn’t have anything to do with Fyodor, or Chomsky, or logic in that context. What I’m addressing is the idea, what I’m proposing is the idea that Natural Selection is not just statistically improbable, but that it is statistically IMPOSSIBLE due to the way it’s directly contradicted by the relevant genetic evidence.\nNow, I have to point out that I am an economist by training, not a biologist, and so I’m going to have to ask JF some questions about some of these things, and I’m not doing so in a Socratic manner. It’s not any sort of Euthyphro, trying to play it fast and loose and get him to agree to something. These are going to be honest questions about a subject that he knows much better than I do. If that’s okay with you.”\nJF: “Absolutely, I’m all for it. Yeah we can see tonight’s discussion as trying to build your case against the Theory of Natural Selection.”\nVD: “I fully admit that there is a possibility that there is something that I am missing, something that I am not understanding, and that would, obviously, tend to destroy my case,\nbut\nI don’t have any way of destroying it myself. You know, it’s a sound case to the extent that I understand it,\nbut\nit’s possible that I don’t understand something, and that’s why I’m relying on JF to hop in and correct me if I’m wrong on something.”\nJF: “Alright. I’ve myself played for the last week on genes, I’ve been trying to make genes evolve, and I’ve been looking at different life forms just to be sure it was possible within the numbers that I have, and personally I concluded that it’s very realistic, the kind of mutations that we see in eukaryotes, mammals, prokaryotes – I’ve reproduced them all.”\nVD: “Well, I’m going to begin by quoting an author, a biologist, the author of\nThe Revolutionary Phenotype\n, and he wrote,\n“Natural Selection is the mechanism by which phenotypes, across generations, become more\nand more servile to the replicators. Simply put, the replicators are able to create good\nphenotypic machines, replace other replicators by outnumbering them. If you extrapolate this\nprinciple over millions or billions of generations, you can understand why a bacteria could\nprogressively evolve into a bird.”\nNow that’s what got me thinking, because that’s what got me looking at this from the context of an economist, and economists, like biologists, are forced to deal with very very complex issues that are very very hard to measure. It’s extremely difficult to track the billions of transactions that are taking place at any one time, in the same way that it’s very very difficult to track the millions or billions of generations that have taken place over time.\nJF: “Absolutely.”\nVD: “So let’s accept for the sake of argument that this principle can be not-unreasonably extrapolated. What I’m saying is I’m accepting JF’s idea that we can extrapolate this principle over millions or billions of generations. That’s fine. This raises what I believe to be an obvious question, which is precisely how many of those millions or billions of generations did we have? It’s a very very difficult question to answer. It’s like saying, how many dollar transactions, in cash, took place across the United States yesterday. It’s very hard to say.\nJF: “Absolutely. It’s very hard, because even the multiplications rates of bacteria today may not be representative of what they were two billion years ago.”\nVD: “Precisely. But I submit that we can come up with estimates that, rather like the Newtonian physics model, are imperfect, but they’re close enough for practical purposes like launching rockets into space or figuring out when the next solar eclipse is.”\nJF: “Absolutely.”\nVD: “So I want to start by establishing a few points of agreement and clarification. I have four questions, and again, this is not a Socratic prosecution, I’m just trying to understand and clarify for everyone the orthodox perspective. So, the first one: In\nThe Revolutionary Phenotype\nyou wrote,\n“By the end of this book, the RNA-world hypothesis will have been demonstrated as a\ncertainty.”\nMy question is, is it correct to say that in order to demonstrate that certainty about events that took place so long ago, you are relying primarily upon logic rather than the conventional scientific method?”\nJF: “Absolutely. I’m relying on the principle of Everlasting Fingerprint, which states that, essentially, any genetic layer you see in an organism today has been the reflection of a past phenotypic evolution. Therefore, because RNA has a genetic layer, we must conclude that it was a life form before DNA.”\nVD: “Right, and that is intrinsically a logical syllogism, and so we’re just establishing the principle here that for the sake of this discussion we will accept tight logical syllogisms to establish certainty.\nNumber two, do you accept the legitimacy of mathematics as a reliable foundation for a similar logical argument? What I mean by that is do you accept in principle the concept of mathematical impossibility like the Five-Sigma rule?”\nJF: “I don’t know the Five-Sigma rule, but I would say mathematical proofs are valid to me. The only question when you apply them to empirical matters is whether you are doing the mapping correctly. For example if I was to say two plus three equal five, I could prove it in mathematics. I could also do it with tomatoes and apples. The only error that could happen is, if my mathematical model does not reflect the initial reality, then I will have a different result in the universe, but that is an error of mapping.”\nVD: “Correct. Right. Just to explain, the Five-Sigma rule is actually a 0.00006% chance. It’s equivalent to twenty-two coin flips in a row coming up heads. So, that’s what we’re using as a standard here.”\nJF: “Well, it’s an arbitrary threshold, I would point out that it’s simply an arbitrary threshold.”\nVD: “Agreed. Right, and I’m not actually concerned about that, I just wanted to establish the fact that you accept mathematics as a reasonable form of logic.”\nJF: “Yep.”\nVD: “Now, what do you consider to be a reasonable estimate for an average number of generations per fixed mutation? I’m talking about bacteria – we’re talking about generations, not time. So what would you – there’s a number of studies that range – that have a fairly wide range depending upon the species and so-so, but I’m just wondering, what would you consider to be a reasonable estimate? By fixed mutation I mean a mutation that has successfully percolated through the species to the point that it has become permanently established at one hundred percent frequency in the population and is now part of the dominant form of the species.”\nJF: “Well, this question has two components, but I’m going to give you the two answers.”\nVD: “Okay.”\nJF: “The problem is that the first criteria is whether the mutation appears, and that, I have relatively precise numbers. Let me just open my document here, I’ve been noting this. So, for a single letter of DNA to mutate in a eukaryote life form, which is a single cell – and of course this varies, this mutation rate will vary, it’s not the same in bacteria, it’s not the same in mammals – but it happens 0.000000004 times per generation that a mutation will occur on a given letter.”\nVD: “Right.”\nJF: “So that’s a lot of generations before a single letter of DNA will be mutated. So that is the first rate, it is the rate of a single site of DNA mutating. Now, whether this will spread across the population, there’s actually a range of answers that depend on how fit that change is, and it goes from disappearing from the population if it’s unfit, to slowly gaining into the population if it’s just neutral, and to totally dominating the population within three, four generations if it’s extremely more fit.”\nVD: “Okay. So, you don’t have an average, but you have a range that like the minimum would be three or four generations.”\nJF: “Yeah, let’s say that the fastest evolutionary pressures that I can think of, which would be literally a gene which makes you make ten times more babies than your neighbor, and in fact those babies also kill a hundred of your neighbor’s too, we can imagine this spreading across the population in a few generations. Very little numbers.”\nVD: “Right. I’ll get to that later, I just wanted to get your general idea. So, we’ll say three generations is the absolute maximum, but the more realistic average is probably considerably higher.”\nJF: “Yes, but it’s not even the absolute maximum. I can imagine a mutation that literally annihilates everything around it, it’s just I don’t have a natural example of this, but we cannot exclude that mathematically, that in a single generation all bearers of a gene would survive and all the others would be eliminated. One example are natural events like meteorites, they probably do something along those lines. They select genes that were already predisposed to survive a meteorite.”\nVD: “Fair enough. I have no quibbles there. I want to point out – this is just straight-up from Wikipedia – in population genetics, fixation is the change in a gene pool from a situation where there exist at least two variants of a particular gene in the population to a situation where only one of the variants remains. That’s why we talk about fitness – any variant must eventually be lost completely from the population, or fixed. That’s not my definition, that’s just from Wikipedia.\nJust to put some lab studies into the mix, the McGill Evolutionary Rescue study found that it took a hundred generations to fix a single yeast mutation. The E-Coli in the lab can take – they found that it tended to take around fifty thousand generations for that. So there’s a big range.\nAnd again, I’m not trying to – when I get to the math that I’m gonna present, I’m trying to present the situation that is most optimal – I’m trying to make a case for the fastest possible case.”\nJF: “Perfect.”\nVD: “Now my last question, before I get into it, how many fixed mutations would you estimate separate humans from the common ancestor shared with chimpanzees? We’ve been told that the Chimpanzee Genome Project catalogs genetic differences between human and chimpanzee, with thirty-five million single nucleotide changes, five million insertion/deletion events, and various – so helpful – various chromosomal rearrangements. That’s, how many would you – again, I’m not going to hold you to this, I just want to get a general idea – how many fixed mutations would you estimate roughly?”\nJF: “I’m not a specialist of that, but the numbers you just stated I would tend to believe them, they seem realistic to me.”\nVD: “Okay. Here’s another way of looking at it that may be too crude, but again, coming at it from an economics perspective, both humans and chimpanzees have roughly three billion base pairs, and we’re told that they are….”\nJF: “Three billion?”\nVD: “Three billion.”\nJF: “Okay.”\nVD: “We’re told that they are 98% identical in terms of DNA. So that would imply that there are sixty million different base pairs, which would tell us, because it’s two different paths, we’re talking each – they both have thirty million mutations since the common ancestor. And that’s kind of close to that other number, with the thirty-five million plus the five million.\nJF: “Absolutely.”\nVD: “Would you consider that to be a reasonable number?”\nJF: “Yes, without having any authority in this area, but it’s definitely within the range I expect.”\nVD: “Okay, very good. Again, I have no idea whatsoever, my level of knowledge is Wikipedia. Now, here’s where it starts to get interesting, because if we take the numbers we’re discussing here, and we start looking, we start breaking the matter down the way that economists do, we start with the amount of time involved, and according to The New Scientist, the first bacteria started to appear 3.8 billion years ago. So the number of – whatever happens has to fit within 3.8 billion years. We know this, this is not controversial except to the Young Earth creationists, which I am not.\nNow again, we’re just going with the best information we have, but the – in Nature, a study was published in 2009, and they sequenced nineteen whole genomes, and they detected twenty-five mutations that were fixed in forty thousand generations. And so that indicates that a reasonable rate – that comes to sixteen hundred generations per fixed mutation. Granted this is bacteria, granted this is E-Coli, etc, etc. They have seen faster rates of mutation, but this is an actual rate of fixed mutations. Now, we’re not going to hold to this, this is just a starting point.”\nJF: “Yeah, I’m gonna raise some problems here though.”\nVD: “Okay.”\nJF: “The first thing is sexual transmission of genes is vastly different, in terms of fixation, because you can have genes that were spread across the population extremely fast, and they don’t even have to be naturally selected, they don’t even have to be advantageous sometimes, they will just come in a package with other genes that are advantageous, and the sexual partners who just transmit the whole package will have an edge in spreading throughout the population. That’s the difference with E-Coli which did not probably use sexual mutations of any kind.\nI will also say that fixation is not the standard by which you should go, because it’s not the case that every mutation which makes the chimpanzee differ from the human – they don’t have to fixate each of them, there could be fixation by package if you will, there could be an accumulation of, I don’t know, a hundred thousand differences, and then boom, fixation of all of these differences.\nVD: “Oh, certainly, there’s a number of different perspectives, but what I’m trying to do here, is we’re building the basis for a mathematical model that we can make more complex eventually. These are things that we know. So if we assume – if we take this nature-based number of 1,600 generations per fixed mutation, and that’s what the study was designed to do, to figure out how quickly these genes get fixed in the population.\nNow, these bacteria live very very quickly, and so the estimated time per generation is only thirty-seven point five minutes. So now what we’re looking at is .000071347 years per generation. That means that there are 14,016 generations per year. So that means that even though it takes sixteen hundred generations per fixed mutation, that it only takes one tenth of a year per fixed mutation, which means over the course of 3.8 billion years, that gives us a maximum number of fixed mutations at that rate of 33.3 billion fixed mutations.\nJF: “Yeah, the – it’s….”\nVD: “That gives us a lot of room for evolution.”\nJF: “I think that the fact that you start with fixed mutation is a bad way to go at it. What you would have to go is go through mutational frequency of every single letter of DNA, because they can all happen and they can all get fixed later. Really the fixation problem is a separate problem in Evolution.”\nVD: “Right, but the point is that, all we’re dealing with here is it gives us a fixed point at which we can start building the model. We can build complexity, we can build speed, we can build all of those things on top – you know, this is how we approach things with economics, first you start with just the C+I+G, +X-M, but we don’t leave it there.\nSo here’s where it starts to get even more interesting is that, if you – what we’re trying to look at there is that’s a very fast rate of population changes. The genes are getting fixed very very quickly. Now, but that’s also in the laboratory, and that’s in a different setting. In the stomach, the same bacteria actually tends to take longer to mutate, the generations are longer, the generations were actually measured at twelve hours per generation in your stomach. So it takes .625 hours, it takes twelve hours, if you run through the exact same math then that reduces the number of maximum mutations to 1.15 million,\nbut\nnow we’re saying okay well, twelve hours per fixed mutation, that’s too long, for bacteria, on average.\nAnd in fact with bacteria we don’t really know how this all works, there’s so many different bacteria and stuff, but we can take the same principle, and we can now apply it to mammals. You know, mammals we’re dealing with 200 million years rather than 3.8 billion years, and mammals, if you analyze the 5,427 extant species, they average 4.3 years per generation. Again, these are straight-up, scientific facts. And I’m willing to grant you – we’ll get into the whole whether we can use fixed mutations as meaningful or not – but with the mammals, if we were to apply the same 1,600 generations per fixed mutation, which I agree is too long, that would mean that it takes 6,880 years per fixed mutation, which leaves a grand total of 29,070 mutations between the very first mammal and homo sapiens sapiens.”\nJF: “Well, okay, what is the number again?”\nVD: “200 million years, 4.3 years per generation, 1,600 generations per fixed mutation – but that’s based on bacteria – so that leads us to 6,880 years per fixed mutation, and a maximum number of 29,070 mutations.”\nJF: “Alright, yeah, I mean, it sucks, but I still disagree with the premise. I think that the model you built is almost there, it’s just that you cannot use fixed mutations, because it’s a fallacy to believe that every mutation has to be fixed. Every mutation has to\nhappen.\n”\nVD: “No, I agree, I agree it needs to be improved, in fact, that was the very point that – I’m impressed that you landed on it so quickly, because that was the very point that I was concerned about, was, how many mutations can be simultaneously fixing at the same time? And so that’s the obvious next question, but let’s just go through this so that I can demonstrate where the central issue’s going to be.\nAgain, I’m not claiming that I can prove anything, tonight. I don’t have the necessary information about biology and genetics to do that, but what we can do is at least point to where the mathematical model has to be improved, because this will – could be – very significant in that regard.\nI think that the 1,600 generations per mutation for mammals is excessive, because I don’t think that the bacteria is necessarily relevant. You know, if you start thinking what we’re actually talking about, we’re talking about how quickly does the entire population change? And there are two different ways we can look at that. One of them is, if we look at some laboratory studies of yeast, which is a little bit more complicated than the bacteria.\nAnother way, and this is something that I developed to maximize speed of population change, is what I call the minimum viable population. So, if you simply look at what the minimum viable population is, and how quickly a minimum viable population can completely change over at the basis of the fastest observed reproduction advantage, which is about 1.7 so a 70% advantage.\nIf you look at it from the yeast perspective, it gets better. 200 million years, 4.3 years per generation, but only seventy-five generations to fix a mutation. That’s the speed that they’ve observed with the yeast. That means that it’s only 323 years for a mutation to be fixed, which allows for 620,155 mutations, and it gets even better for the Theory of Natural Selection if you look at the minimum viable population, because that would allow for a complete transformation of the population and fixation within 15.7 generations, which is extremely fast. Scientists usually consider 50-100 generations to be very fast. Fifteen is practically at your catastrophic level speed of three generations, and that would allow for 2.962 fixed mutations in between the first mammal and man.\nNow obviously, that’s not enough, and this is where it starts to get a little bit negative, or actually considerably negative for the natural selection idea, or even other gene-mutation ideas, because there are a broad range of estimates for the time between the CHLCA which is the Chimp/Human Last Common Ancestor. I’m going to read the – it was kind of amusing to me – I’m going to read the different estimates.\nThe first estimate was 25 million years, then in the 70s protein studies reduced that to 8 million years. A comparison to orangutans and gibbons dropped it to 5 million years, The Molecular Clock reduced it to 4 million years, then a 1998 study increased it to 13 million years, a 2009 study dropped it to 7 million years, and the current estimate is a study by somebody named Morgiani, which is a genetic-based one, and it estimates 6-12 million years. So I just split the difference and said nine.\nSo now if we look at primates, we take the oldest period there, 25 million years, the primate generations are 20 years according to that same mammal study. If we use the fast, minimum viable population rate of 15.7 generations per fixed mutation, that leads 314 years per fixed mutation, and allows for 79,618 mutations. If we go to the other extreme, the most disadvantaged one that we can use based on these numbers, we have 4 million years from the last common ancestor, 20 years per generation, 1,600 generations per fixed mutation, 32,000 years per mutation, and that would leave room for only 125 mutations between the CHLCA and today.\nNow obviously, if those final numbers are to be considered legitimate, then the Theory of Evolution by Natural Selection cannot possibly be true. But what I think is interesting is that this shows you how many – if TENS is to remain viable, this shows you how many mutations have to be happening either simultaneously or so fast that we should be able to observe them more easily than we do.\nJF: “Well, it’s about time for me to be crushing your dreams Vox….”\nVD: “Go for it.”\nJF: “The thing is, this little axiom that I’ve been trying to talk to you about since the beginning, which is the difference between a fixed mutation rate, and a mutation rate which is what most scientists who ask these questions will work with is – it will multiply your numbers by millions and billions. Just look at this for example…” *Brings up table.* “…this is the number people actually work with, it is insertion and deletion events per site per generation, and mutation rate per site per generation.\nNow, contrary to what instinctive thinking about this would tell us, homo sapiens is actually having a very high rate of mutation per site per generation, 135×10^-10. The reason you have to multiply these, and not think of fixed event, is that no your entire population does not have to conform to each other, there is nothing in Natural Selection that forces your population to have some sort of homogeneity. Everyone is developing mutations at the same time, in parallel. That is one of the power of Natural Selection, is that you don’t need the whole population to reach a floor after which the next mutation can come in.\nAll of these mutation are happening on all of DNA, and we see them happen. We see them happen between a father and a daughter, we see their genome and we will see that there is maybe sixty letters of DNA that differ between the father and the daughter, and these sixty letters of DNA will differ between one father and one daughter, but if you take another couple it’s going to be a different set of mutations. So we see them happening all the time, but that’s why, if you work with your fixed mutation rates, you are essentially working with the hypothesis that every time your mutation must be preserved to the next generation, it must spread to the entire population, when it doesn’t. It doesn’t because we know that in humans the entire population differs vastly.”\nVD: I understand that, but in order to get to the point where everybody has those features that are dependent upon those specific genetic changes – not all of the genes have to be fixed, but if we all have the same eye, then all of the genes related to that have to have been fixed at some point in time, by the point that we all are shown to have that eye, correct?”\nJF: “I mean, we don’t have the same eye, that’s the problem, but your thinking is not wrong there, it’s just that we don’t have the same eyes, we don’t have the same hairs, we don’t have the same intelligence – some of us look more like chimpanzees, you know?\nVD: “But the chimpanzees don’t have any of that 2% of genes that are different, correct?”\nJF: “Well, I mean if you were to take a bunch of humans on a specific gene, some of them would actually be closer to the chimpanzees than others.”\nVD: “Okay, so what you’re saying is that there’s this whole genetic spectrum from human to chimpanzee that still exists, that is not fixed.”\nJF: “Um, well, it’s a spectrum, but there is a division, which is there’s not a single human who can reproduce with a chimpanzee right now, so we know that the two groups have diverged enough to be different enough, but it remains the case – and I think you mentioned that on your own stream, you said that whiteness, for example, has evolved later in human populations, and it is true, at least based on the data you were showing and the study you were showing, if we believe that study, then yes, whiteness of the skin has emerged later. Now, you called it a more evolved trait, we have a more polite word for it, we say a derived trait.”\nVD: “Fair enough. The interesting thing here is that, right, there’s no possible way that every single mutation has to get fixed before the next one does.”\nJF: “Exactly.”\nVD: “I understand that, but when we start looking at the problem from this situation, what we see is that in order for there to have been time, for enough of these mutations to have been fixed across the entire population – not all of them, I understand that – but enough of them have to have been fixed in order to create the speciation that we see, that it puts the theory between a rock and a hard place. Either we can see enough of it happening that we can predict it, that we can make use of it as a predictive model, or the process simply requires too much time, more time than we are permitted by our current understanding, which would tend to indicate that there is something else going on, some other force, some other – you know, we already know there are other forces going on, that’s why we talk about, you know, gene drift, and genetic flow, and sexual selection, and all that sort of thing.\nWe already know that there are these other forces, but my point is that we can, we know exactly the maximum number of generations that existed over these periods of time, and if we start building a model from this way and look at – again, I don’t have the genetic background to build that mathematical model, but if you start looking at what percentage of genes have to be fixed, and what percentage can be propagating at the same time. Because what what we’re really talking about – we’re not talking about the problem of mutations – we’re talking about the problem of mutational propagation throughout the population required for speciation.”\nJF: “Well, I think that, attacking this problem, it shows that you have been doing a lot of thinking, and you are a very intelligent and logical person, however, I’ve been doing that too, and I’ve found this to be a dead end of thinking.\nThe big problem of speciation is that species are not a natural category. Species are something we observed and it’s – they could be there, they could not be there, and there are continuums across time, that’s why most people who actually think of evolution of genes across billions of years, they don’t think in species, because species makes sense when you are within a slice of time. These people cannot reproduce with these people, therefore separate species.\nThe reality is that a species switch could occur on a single mutation. You don’t need all of the mutations that make these species different for them not to be able to breed. You just need a mutation that will make their sexual organs incompatible, or their pheromone system contradictory in some way, and we’ve seen it happen in certain fish populations you know, where we look and – this I’ve detailed in my video called Speciation: When Races Become Species, and it’s essentially a single mutation, or a single series of mutations that will be enough to break the chain of reproduction such that one population that was kind-of able to reproduce with the other becomes totally unable.\nNow, I have a gift for you today, Vox Day. It’s my program, I’ve been making it since my video replies to you. I’ve called it even Voxolution. So, it’s an evolutionary program that actually frames these questions properly, with per site frequency of mutation, and here I’ve taken the per site mutation frequency taken in the literature, and I’ve taken two specimens. So that’s a sequence of DNA that comes from one bacteria, and that’s a sequence of DNA that comes from one eukaryote that shows up probably a billion years later or more, and I asked, what is the fastest way to get from that sequence to that sequence, if those mutations are occurring in all sorts of orders. And in fact the answer that this program give – and you can insert really any gene in there, you could insert the gene of a human and a chimpanzee, and you could get your answer, but it’s really – those life forms are separated by a billion year according to current theoretical calculation, and the minimal chain of mutation needed could occur in 35 million per year. So we have plenty of space, we – these mutation must occur, to the extent that they keep occurring, in all sorts of millions of individuals across millions of generations, the shortest path for it to occur is a fraction of the total time that it took for it to occur.”\nVD: “That’s exactly what I would expect to see, I mean, when we’re talking about – that’s what I wanted to find out, I wanted to find out what is the fastest number of generations that these things can take place, so I will be more than happy to play with your program, and see if we can apply it to this model, to further develop it, because, again, when you look at the number of generations involved, especially with regards to – the more recent we get, when we go to the chimpanzee thing, and so forth, the time clock becomes tighter and tighter to the point, and that’s why I refer to the rock and the hard place, because if we’re able to make that level of change in the number of generations we talked about with regards to the 4-25 million years to the chimpanzee and the human, then we should be able to develop better Natural Selection-based predictive models than we currently have, which as a game designer interests me.\nJF: “Well, that’s a long shot I would say, but essentially the key of my program in comparison with your hypothesis which you laid out is that, when I have this letter of G trying to change to A, that doesn’t stop this other letter to be working toward modifying itself toward this. So essentially, the key to the difference between our two models, which differ by billions of years probably, if we were to ultimately make calculations with them, is that my model allows parallel evolution of different genes, whereas yours kind of makes a step, you need a step, you wait for the mutation to be fixed and then you need another step, but it’s not totally useless, your view.\nKind of brings back – it seems that it’s a model that you would have developed with the goal of attacking Natural Selection, because the general model that scientists work with in their mind is, okay, there’s a small mutation, it gains the entire population, and then it leads to a floor upon which other mutations can build. That’s indeed how people express it to elementary school children, but that’s not necessarily how it happens. What happens is that a\nmassive\nparallel development, such that people who subject two different species today, they come from a single ancestor and a chain of events that have occurred all in parallel. Sometimes the population was not totally separated. Sometimes they were coming back together, they were having some babies with some frequencies, the same way we see it with, for example, Neanderthals. They have had sex with homo sapiens, but not enough to completely change or fix the population.”\nVD: I understand that, but that’s exactly the point that I’m addressing, is that once we take a look at measuring the amount of parallel processing that is taking place and we compare it to the propagation, then we have the ability to compare it to what we actually observe and see whether those two things are viable. And that’s where I think the interesting point is, because, again, my skepticism is – it’s the same reason that I was skeptical of Free Trade, you know everybody has – for two hundred years, everyone had certain assumptions about things, but once we actually had the opportunity to observe the level – what happens when labor actually becomes mobile, the theory ended up melting down.\nI understand you’re very confident that it’s possible for the level of parallel processing to allow for this very very fast propagation that’s necessary to fit within the time frames. I’m a little bit more skeptical about that obviously.”\nJF: “All right, so, I think that we can end for tonight. It was a really fun conversation, but given that my voice is tired I don’t think that I can go on much more. I’ll be sending you a copy of the program, and let’s do that again in the future, once you’ve had time to play with it.”\nVD: “Absolutely. Thanks so much.\nJF: “All right. Vox, bye bye, and thank you so much for coming.”\nDISCUSS ON SG",
  "tags": [
    "debate",
    "evolution"
  ],
  "categories": [],
  "sitemap_lastmod": "2022-02-08T15:24:19+00:00"
}