{
  "url": "https://voxday.net/2021/11/12/the-4th-ideology/",
  "scraped_at": "2026-01-08T12:58:47.004816",
  "title": "The 4th Ideology",
  "date_display": "November 12, 2021",
  "date_iso": "2021-11-12T13:00:00+00:00",
  "date_from_url": "2021-11-12",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>Very, very few in the West will understand the significance of <a href=\"https://www.bbc.com/news/world-asia-china-59229935\">the historic resolution</a> passed by the CPC at its most recent plenary session:</p><blockquote class=\"wp-block-quote is-layout-flow wp-block-quote-is-layout-flow\"><p>The Chinese Communist Party has passed a “historical resolution”, cementing Xi Jinping’s status in political history.</p><p>The document, a summary of the party’s 100-year history, addresses its key achievements and future directions.</p><p>It is only the third of its kind since the founding of the party – the first was passed by Mao Zedong in 1945 and the second by Deng Xiaoping in 1981.</p><p>It was passed on Thursday at the sixth plenary session, one of China’s most important political meetings.</p><p>As only the third Chinese leader to have issued such a resolution, the move aims to establish Mr Xi as an equal to party founder Mao and his successor Deng.</p><p>“Just like the previous two resolutions, [this resolution] will play an important role in helping to unite the theory, will and action of the party – to achieve future progress and in realising the second centenary goal and the great Chinese dream of rejuvenation,” senior party official Qu Qingshan said at a press conference on Friday.</p></blockquote><p>What this action signifies is that China’s ideology, which has not been Maoist since 1978, is officially no longer Dengist either. <a href=\"https://asia.nikkei.com/Politics/Full-text-of-Chinese-Communist-Party-s-6th-plenum-communique\">This third adaptation</a> marks the triumph of the brilliant Wang Huning, China’s chief ideologist and the architect of the new Xiist ideology that rejects the Western-influenced Dengist economics-first approach that has been the official party line since Mao’s successor rejected doctrinaire Marxist-Leninism and publicly declared “to get rich is glorious” in 1978.</p><p>The CPC has historically recognized three political cultures:</p><ul class=\"wp-block-list\"><li>Traditional Confucianism</li><li>Marxist-Leninism as interpreted by Mao</li><li>Communo-Corporatism as interpreted by Deng</li></ul><p>The globalists of the neo-liberal world order loved Dengism and were intimately involved in its formation. Consider <a href=\"https://archive.md/Br3sE#selection-3647.5-3647.50\">how George Soros described his own involvement</a> with “the bold reform agenda” and Deng’s conception of “China’s place in the world.”</p><blockquote class=\"wp-block-quote is-layout-flow wp-block-quote-is-layout-flow\"><p>Mr. Xi came to power in 2013, but he was the beneficiary of the bold reform agenda of his predecessor Deng Xiaoping, who had a very different concept of China’s place in the world. Deng realized that the West was much more developed and China had much to learn from it. Far from being diametrically opposed to the Western-dominated global system, Deng wanted China to rise within it. His approach worked wonders. China was accepted as a member of the World Trade Organization in 2001 with the privileges that come with the status of a less-developed country. China embarked on a period of unprecedented growth. It even dealt with the global financial crisis of 2007-08 better than the developed world.</p><cite><em>Xi’s Dictatorship Threatens the Chinese State</em>, George Soros, 14 August 2021</cite></blockquote><p>However, the highly influential Wang pointed out the flaws inherent to the third political culture in his famous text known as <em>The Structure of China’s Changing Political Culture</em>:</p><blockquote class=\"wp-block-quote is-layout-flow wp-block-quote-is-layout-flow\"><p>The bourgeois revolution in the West promoted the basic values of freedom, equality, fraternity, and democracy, and on this basis a political culture evolved over the succeeding centuries. The ancient Chinese core values emphasizing the respective roles and duties of ruler, subject, father, and son similarly dominated the political culture at that time. But there are no core values in China’s most recent structure. This lack has multiple meanings: it may mean that the value itself has yet to evolve; it may mean that the value exists but has not universally entered political culture; and it may mean that we do not have vehicles to carry out the transmission of values. Since 1949, we have criticized the core values of the classical and modern structures, but have not paid enough attention to shaping our own core values. In and of itself, Marxism transcended the Western rule-based worldview, but in China, which never possessed that worldview, the results of the adoption of Marxism were not always positive. Therefore, to forge core values today means grasping the overall process of transformation from a culturally oriented political culture to an institutionally oriented political culture, and to choose core values conducive to this transformation.</p><cite><em>The Structure of China’s Changing Political Culture</em>, Wang Hunin</cite></blockquote><p>What the elevation of Xiism – Xi Jinping Thought on Socialism with Chinese Characteristics for a New Era, to be specific – to equal status with Maoism (Mao Zedong Thought) and Dengism (Deng Xiaoping Theory) signifies is the complete rejection of what presently passes for “democracy” as well as the neo-liberal world order. That is why the international corporations <a href=\"https://techcrunch.com/2021/11/02/as-yahoo-leaves-china-an-accelerating-stream-of-exits/\">are fleeing China</a>, why the chief executives of major Chinese corporations <a href=\"https://archive.md/ofKdy\">are stepping down in disgrace</a>, and why globalist figures <a href=\"https://www.rediff.com/news/column/xi-is-the-21st-centurys-version-of-hitler/20200630.htm\">are furiously denouncing Xi</a> as the latest “new Hitler”. Like Vladimir Putin, and unlike Donald Trump, Xi Jinping has successfully overcome the agents of the neo-liberal world order in defense of his nation.</p><p>This official declaration marks the completion of the rejection of the globalists that first became apparent in 2015, when <a href=\"https://shanghaiist.com/2015/10/03/xi_jinping_refuses_to_name_zuckerberg_child/\">Xi publicly declined to provide</a> what was intended to be a symbol of Sino-Globo unity by giving the offspring of Priscilla Chan and Mark Zuckerberg an honorary Chinese name.</p><p>Nationalism is rising, in China as elsewhere, and this is a development to be celebrated by nationalists everywhere. While the Christian West is not China, and while China is not necessarily a friend to the Christian West, neither is China an enemy. To the contrary, China is now the most formidable enemy of the ancient evil that has subjugated the Christian West. And what is the enemy of one’s enemy, if not a friend?</p><p><em><a href=\"https://social.infogalactic.com/micropost/89a11031-ebbe-45a2-b29e-6cda4a0becd0\">DISCUSS ON SG</a></em></p></div>",
  "content_text": "Very, very few in the West will understand the significance of\nthe historic resolution\npassed by the CPC at its most recent plenary session:\nThe Chinese Communist Party has passed a “historical resolution”, cementing Xi Jinping’s status in political history.\nThe document, a summary of the party’s 100-year history, addresses its key achievements and future directions.\nIt is only the third of its kind since the founding of the party – the first was passed by Mao Zedong in 1945 and the second by Deng Xiaoping in 1981.\nIt was passed on Thursday at the sixth plenary session, one of China’s most important political meetings.\nAs only the third Chinese leader to have issued such a resolution, the move aims to establish Mr Xi as an equal to party founder Mao and his successor Deng.\n“Just like the previous two resolutions, [this resolution] will play an important role in helping to unite the theory, will and action of the party – to achieve future progress and in realising the second centenary goal and the great Chinese dream of rejuvenation,” senior party official Qu Qingshan said at a press conference on Friday.\nWhat this action signifies is that China’s ideology, which has not been Maoist since 1978, is officially no longer Dengist either.\nThis third adaptation\nmarks the triumph of the brilliant Wang Huning, China’s chief ideologist and the architect of the new Xiist ideology that rejects the Western-influenced Dengist economics-first approach that has been the official party line since Mao’s successor rejected doctrinaire Marxist-Leninism and publicly declared “to get rich is glorious” in 1978.\nThe CPC has historically recognized three political cultures:\nTraditional Confucianism\nMarxist-Leninism as interpreted by Mao\nCommuno-Corporatism as interpreted by Deng\nThe globalists of the neo-liberal world order loved Dengism and were intimately involved in its formation. Consider\nhow George Soros described his own involvement\nwith “the bold reform agenda” and Deng’s conception of “China’s place in the world.”\nMr. Xi came to power in 2013, but he was the beneficiary of the bold reform agenda of his predecessor Deng Xiaoping, who had a very different concept of China’s place in the world. Deng realized that the West was much more developed and China had much to learn from it. Far from being diametrically opposed to the Western-dominated global system, Deng wanted China to rise within it. His approach worked wonders. China was accepted as a member of the World Trade Organization in 2001 with the privileges that come with the status of a less-developed country. China embarked on a period of unprecedented growth. It even dealt with the global financial crisis of 2007-08 better than the developed world.\nXi’s Dictatorship Threatens the Chinese State\n, George Soros, 14 August 2021\nHowever, the highly influential Wang pointed out the flaws inherent to the third political culture in his famous text known as\nThe Structure of China’s Changing Political Culture\n:\nThe bourgeois revolution in the West promoted the basic values of freedom, equality, fraternity, and democracy, and on this basis a political culture evolved over the succeeding centuries. The ancient Chinese core values emphasizing the respective roles and duties of ruler, subject, father, and son similarly dominated the political culture at that time. But there are no core values in China’s most recent structure. This lack has multiple meanings: it may mean that the value itself has yet to evolve; it may mean that the value exists but has not universally entered political culture; and it may mean that we do not have vehicles to carry out the transmission of values. Since 1949, we have criticized the core values of the classical and modern structures, but have not paid enough attention to shaping our own core values. In and of itself, Marxism transcended the Western rule-based worldview, but in China, which never possessed that worldview, the results of the adoption of Marxism were not always positive. Therefore, to forge core values today means grasping the overall process of transformation from a culturally oriented political culture to an institutionally oriented political culture, and to choose core values conducive to this transformation.\nThe Structure of China’s Changing Political Culture\n, Wang Hunin\nWhat the elevation of Xiism – Xi Jinping Thought on Socialism with Chinese Characteristics for a New Era, to be specific – to equal status with Maoism (Mao Zedong Thought) and Dengism (Deng Xiaoping Theory) signifies is the complete rejection of what presently passes for “democracy” as well as the neo-liberal world order. That is why the international corporations\nare fleeing China\n, why the chief executives of major Chinese corporations\nare stepping down in disgrace\n, and why globalist figures\nare furiously denouncing Xi\nas the latest “new Hitler”. Like Vladimir Putin, and unlike Donald Trump, Xi Jinping has successfully overcome the agents of the neo-liberal world order in defense of his nation.\nThis official declaration marks the completion of the rejection of the globalists that first became apparent in 2015, when\nXi publicly declined to provide\nwhat was intended to be a symbol of Sino-Globo unity by giving the offspring of Priscilla Chan and Mark Zuckerberg an honorary Chinese name.\nNationalism is rising, in China as elsewhere, and this is a development to be celebrated by nationalists everywhere. While the Christian West is not China, and while China is not necessarily a friend to the Christian West, neither is China an enemy. To the contrary, China is now the most formidable enemy of the ancient evil that has subjugated the Christian West. And what is the enemy of one’s enemy, if not a friend?\nDISCUSS ON SG",
  "tags": [
    "China",
    "globalism",
    "nationalism"
  ],
  "categories": [],
  "sitemap_lastmod": "2021-11-12T14:58:23+00:00"
}