{
  "url": "https://voxday.net/2021/11/13/what-is-so-hard-to-understand/",
  "scraped_at": "2026-01-08T12:58:54.053174",
  "title": "What is So Hard to Understand?",
  "date_display": "November 13, 2021",
  "date_iso": "2021-11-13T12:47:21+00:00",
  "date_from_url": "2021-11-13",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>What part of “don’t talk to the media” is so hard to understand? When even experienced and highly successful members of the media regularly <a href=\"https://www.outkick.com/dave-portnoy-challenges-business-insiders-role-in-rough-sex-allegations/\">find themselves publicly impaled</a> by their colleagues, how do you think that you, a totally inexperienced member of the public who has never, ever even spoken with a member of the mainstream media before, are going to fare?</p><blockquote class=\"wp-block-quote is-layout-flow wp-block-quote-is-layout-flow\"><p>On Thursday, Barstool Sports founder Dave Portnoy broadcasted a livestream presser to pick apart <em>Business Insider</em>‘s recent report on him.</p><p>Last week, <em>Insider </em>released a report — behind its paywall — that describes purported violent sexual encounters between Portnoy, 44, and two women in their early 20s. In essence, Insider accuses Portnoy of raping women, which Portnoy has denied.</p><p>Portnoy begins the broadcast by showing a screenshot of the initial email Julia Black, the author of the Insider story, sent him eight months ago. In it, Black claims the original story idea didn’t have an angle or agenda, that the outlet simply planned to focus on Portnoy’s career.</p><p>Here’s a look at the email Black sent Portnoy:</p><p>Portnoy says that Black and <em>Business Insider</em> then quickly shifted away from a look into Portnoy’s career to another, more explosive story idea that would incite reader interest and still protect the publication itself in court since Portnoy could win a lawsuit only if he could prove malice. The new idea? That Portnoy had raped young women. Portnoy says the outlet purposely implies rape throughout the story without using the exact term so as to avoid libel charges.</p><p>“As I’ve come to learn, this was Julia covering her tracks to write a hit piece,” Portnoy says. “They knew what [they were] writing from the beginning. But if I could prove that [they were] always out to make me look like a sexual monster deviant, then I can sue [them]. This is like ‘No, no, we had good intentions.’ Yeah, right.”</p><p>Portnoy also says immediately following the release of the article, an Insider staffer contacted Barstool’s advertisers asking whether they stand by Portnoy. According to Portnoy, Insider was not seeking comment about the story but rather reactions from sponsors after the story was already published, presumably to pressure them into parting ways with Barstool.</p></blockquote><p>I can’t tell you how many times the morons who are practically wetting their pants over the fact that the media actually wants to talk to them for the first time in their otherwise-unremarkable lives tell me the same thing in order to justify their attention-seeking desire to see their name in print:</p><ul class=\"wp-block-list\"><li>No, it’s okay, they just want to hear my side of the story.</li><li>No, it’s okay, it’s just a story about X.</li><li>No, it’s okay, the reporter was really friendly.</li><li>No, it’s okay, the reporter was really nice.</li><li>No, it’s okay, I think the reporter is really on our side.</li><li>No, it’s okay, the reporter promised it wouldn’t be a hit piece.</li><li>No, it’s okay, I’m going to record the interview myself.</li></ul><p>It never works. It NEVER works. FFS, look at how Portnoy, who has a very large media megaphone himself and is now attempting to use it in self-defense, got completely hornswoggled by thinking the story was about his career – which wasn’t at all implausible – when the reporter was actually setting him up for a hit piece alleging that he is a rapist intended to serve as the basis for a deplatforming campaign targeting his organization’s advertisers.</p><p>Never, ever talk to the media. Just don’t do it. You’re not too smart for them. You’re not too clever for them. They know what they are doing. They are very experienced at using people just like you. They’ve done it HUNDREDS of times to people who thought exactly the same thing as you and learned to regret it. There is no point whatsoever, because if you somehow manage to avoid giving them what they want to support the hit piece, they simply won’t run the story.</p><p>Now it is true that I do, very occasionally, talk to personal acquaintances, authors that we publish, and organizations that sell our products. If you are a three-time nationally syndicated columnist who has been on the board of a news organization and runs a publishing operation, then perhaps you can justify the occasional exception when you actually know the individuals involved well enough to accurately discern their true intentions. But note that even with that caveat, I still never talk to anyone in the mainstream media, not even to individuals I have known for decades.</p><p>As a side note, the Portnoy situation is why we never seek advertisers or accept advertising offers. We rely solely upon sales and subscriptions, because doing so eliminates an entire line of attack against us.</p><p><em><a href=\"https://social.infogalactic.com/micropost/da019c66-a967-4837-bd6f-c13518fa1bbf\">DISCUSS ON SG</a></em></p></div>",
  "content_text": "What part of “don’t talk to the media” is so hard to understand? When even experienced and highly successful members of the media regularly\nfind themselves publicly impaled\nby their colleagues, how do you think that you, a totally inexperienced member of the public who has never, ever even spoken with a member of the mainstream media before, are going to fare?\nOn Thursday, Barstool Sports founder Dave Portnoy broadcasted a livestream presser to pick apart\nBusiness Insider\n‘s recent report on him.\nLast week,\nInsider\nreleased a report — behind its paywall — that describes purported violent sexual encounters between Portnoy, 44, and two women in their early 20s. In essence, Insider accuses Portnoy of raping women, which Portnoy has denied.\nPortnoy begins the broadcast by showing a screenshot of the initial email Julia Black, the author of the Insider story, sent him eight months ago. In it, Black claims the original story idea didn’t have an angle or agenda, that the outlet simply planned to focus on Portnoy’s career.\nHere’s a look at the email Black sent Portnoy:\nPortnoy says that Black and\nBusiness Insider\nthen quickly shifted away from a look into Portnoy’s career to another, more explosive story idea that would incite reader interest and still protect the publication itself in court since Portnoy could win a lawsuit only if he could prove malice. The new idea? That Portnoy had raped young women. Portnoy says the outlet purposely implies rape throughout the story without using the exact term so as to avoid libel charges.\n“As I’ve come to learn, this was Julia covering her tracks to write a hit piece,” Portnoy says. “They knew what [they were] writing from the beginning. But if I could prove that [they were] always out to make me look like a sexual monster deviant, then I can sue [them]. This is like ‘No, no, we had good intentions.’ Yeah, right.”\nPortnoy also says immediately following the release of the article, an Insider staffer contacted Barstool’s advertisers asking whether they stand by Portnoy. According to Portnoy, Insider was not seeking comment about the story but rather reactions from sponsors after the story was already published, presumably to pressure them into parting ways with Barstool.\nI can’t tell you how many times the morons who are practically wetting their pants over the fact that the media actually wants to talk to them for the first time in their otherwise-unremarkable lives tell me the same thing in order to justify their attention-seeking desire to see their name in print:\nNo, it’s okay, they just want to hear my side of the story.\nNo, it’s okay, it’s just a story about X.\nNo, it’s okay, the reporter was really friendly.\nNo, it’s okay, the reporter was really nice.\nNo, it’s okay, I think the reporter is really on our side.\nNo, it’s okay, the reporter promised it wouldn’t be a hit piece.\nNo, it’s okay, I’m going to record the interview myself.\nIt never works. It NEVER works. FFS, look at how Portnoy, who has a very large media megaphone himself and is now attempting to use it in self-defense, got completely hornswoggled by thinking the story was about his career – which wasn’t at all implausible – when the reporter was actually setting him up for a hit piece alleging that he is a rapist intended to serve as the basis for a deplatforming campaign targeting his organization’s advertisers.\nNever, ever talk to the media. Just don’t do it. You’re not too smart for them. You’re not too clever for them. They know what they are doing. They are very experienced at using people just like you. They’ve done it HUNDREDS of times to people who thought exactly the same thing as you and learned to regret it. There is no point whatsoever, because if you somehow manage to avoid giving them what they want to support the hit piece, they simply won’t run the story.\nNow it is true that I do, very occasionally, talk to personal acquaintances, authors that we publish, and organizations that sell our products. If you are a three-time nationally syndicated columnist who has been on the board of a news organization and runs a publishing operation, then perhaps you can justify the occasional exception when you actually know the individuals involved well enough to accurately discern their true intentions. But note that even with that caveat, I still never talk to anyone in the mainstream media, not even to individuals I have known for decades.\nAs a side note, the Portnoy situation is why we never seek advertisers or accept advertising offers. We rely solely upon sales and subscriptions, because doing so eliminates an entire line of attack against us.\nDISCUSS ON SG",
  "tags": [
    "media",
    "trainwreck"
  ],
  "categories": [],
  "sitemap_lastmod": "2021-11-13T12:52:59+00:00"
}