{
  "url": "https://voxday.net/2010/01/07/as-i-have-repeatedly-warned-pos/",
  "scraped_at": "2026-01-08T23:16:22.723701",
  "title": "Post-Christian culture shock",
  "date_display": "January 7, 2010",
  "date_iso": "2010-01-07T11:49:00+00:00",
  "date_from_url": "2010-01-07",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>As I have repeatedly warned, post-Christianity <a href=\"http://www.telegraph.co.uk/news/worldnews/africaandindianocean/uganda/6944292/Human-sacrifices-on-the-rise-in-Uganda-as-witch-doctors-admit-to-rituals.html\">isn’t necessarily that shiny, sexy, secular science fiction society</a> that so many atheists fantasize about.  Secularism is merely a transition phase from civilization to barbarism:</p><blockquote><p>Witch doctors in Uganda have admitted their part in human sacrifice amid concerns that the practice is spreading in the African country….  The African country’s government claimed human sacrifice was on the increase.  According to officials trying to tackle it, the crime is directly linked to rising levels of development and prosperity – and an increasing belief that witchcraft can help people get rich quickly.</p></blockquote><p>It is all to telling that so many clueless atheists <a href=\"http://www.atheistpropaganda.com/2009/12/atheism-religion-and-genocide-part-1.html\">are more worried about prospective Ugandan laws banning homosexuality</a> than they are about <i>the rise of human sacrifice!</i> And it’s interesting to see yet another example smashing the progressive notion that rising levels of development and prosperity will suffice to create a more civilized society.</p></div>",
  "content_text": "As I have repeatedly warned, post-Christianity\nisn’t necessarily that shiny, sexy, secular science fiction society\nthat so many atheists fantasize about.  Secularism is merely a transition phase from civilization to barbarism:\nWitch doctors in Uganda have admitted their part in human sacrifice amid concerns that the practice is spreading in the African country….  The African country’s government claimed human sacrifice was on the increase.  According to officials trying to tackle it, the crime is directly linked to rising levels of development and prosperity – and an increasing belief that witchcraft can help people get rich quickly.\nIt is all to telling that so many clueless atheists\nare more worried about prospective Ugandan laws banning homosexuality\nthan they are about\nthe rise of human sacrifice!\nAnd it’s interesting to see yet another example smashing the progressive notion that rising levels of development and prosperity will suffice to create a more civilized society.",
  "tags": [
    "freakshow"
  ],
  "categories": [],
  "sitemap_lastmod": "2010-01-07T11:49:00+00:00"
}