{
  "url": "https://voxday.net/2010/01/04/bernanke-and-housing-bubble/",
  "scraped_at": "2026-01-08T23:16:06.145307",
  "title": "Bernanke and the housing bubble",
  "date_display": "January 4, 2010",
  "date_iso": "2010-01-04T14:30:00+00:00",
  "date_from_url": "2010-01-04",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>In which Ben Bernanke throws Barney Frank under the bus.  Even if you’re not an economist, Ben Bernanke’s attempt to excuse the Federal Reserve for any responsibility in creating the housing bubble really has to be read to be believed.  Here’s the one of the more damning paragraphs <a href=\"http://www.nytimes.com/2010/01/04/business/economy/04fed.html\">in the 36-page PDF</a>:</p><blockquote><p>First, the cumulative increase in housing prices shown in Slide 5 is quite large. Can accommodative monetary policies during this period reasonably account for the magnitude of the increase in house prices that we observed? If not, what does account for it? Second, house prices rose significantly during this period in many industrialized countries, not just in the United States. If monetary policy was an important source of house price appreciation in the United States, it seems reasonable to expect that, in an international comparison, countries with easier monetary policies should have been more likely to have significant rises in house prices as well. Is that the case?</p><p>With respect to the magnitude of house-price increases: Economists who have investigated the issue have generally found that, based on historical relationships, only a small portion of the increase in house prices earlier this decade can be attributed to the stance of U.S. monetary policy. This conclusion has been reached using both econometric models and purely statistical analyses that make no use of economic theory.</p></blockquote><p>This is extraordinarily deceptive on several levels.  Bernanke is first leaving out the fact that regulation of the banks is the specific responsibility of the Federal Reserve and is an inherent part of monetary policy given the fact that most of the money in the system is created by bank loans under the fractional-reserve system.  He is, of course, limiting his implicit definition of “monetary policy” to interest rate targets, which is acceptable in general economic discussions but not in a specific one of this sort.</p><p>Second, it should be no surprise that Bernanke feels justified by the use of econometric models based on the Taylor Rule because the Taylor Rule is the very rule that was used to justify the Fed’s actions in the first place.  As Mike Shedlock shows <a href=\"http://2.bp.blogspot.com/_nSTO-vZpSgc/Slwpr_ost3I/AAAAAAAAGds/96fAxwPHnCo/s1600-h/cpi-case-shiller-2009-06.png\">using Case-Shiller housing prices in the place of Owner-Equivalent Rent</a> to calculate CPI-U, the Taylor Rule is fundamentally flawed because it is based on CPI-U.  In RGD, I demonstrate a few of the many ways CPI-U considerably underestimates the real rate of price changes; the fact that <i>it doesn’t even take real housing prices into account</i> renders it entirely useless as a basis for defending the Federal Reserve’s actions or comparing the U.S. housing market with international housing markets.</p><p>No doubt there will be a lot of detailed critiques of this paper in the coming month.  I may even write one myself.  But in summary, “Monetary Policy and the Housing Bubble” is a shameless and deceptive attempt by a failed economist to justify his spectacular failure by using the very models that failed him in the first place.</p><p>I recognized the housing bubble in 2002; that is a matter of public record.  Bernanke, on the other hand, was still denying it existed in October 2005, less than a year prior to its 2006 peak! <i>“House prices have risen by nearly 25 percent over the past two years. Although speculative activity has increased in some areas, at a national level these price increases largely reflect strong economic fundamentals, including robust growth in jobs and incomes, low mortgage rates, steady rates of household formation, and factors that limit the expansion of housing supply in some areas.”</i></p><p>Calculated Risk <a href=\"http://www.calculatedriskblog.com/2010/01/what-bernanke-didnt-say.html\">points out two more things</a> that Bernanke conveniently avoided mentioning:</p><p><i>“Bernanke used data from other countries to suggest monetary policy was not a huge contributor to the bubble … however, Bernanke didn’t discuss if non-traditional mortgage products contributed to housing bubbles in other countries. This would seem like a key missing part of the speech.</i></p><p>Bernanke didn’t discuss how the current regulatory structure missed this “protracted deterioration in mortgage underwriting standards” (even though many people were pointing it out in real time). And Bernanke didn’t discuss specifically how the new regulatory structure would catch this deterioration in standards.”</p><p>The truth is that the Fed knew about the “protracted deterioration in mortgage underwriting standards” prior to the start: <b>“Even before economic prophets of doom such as Marc Faber, Nouriel Roubini, and Peter Schiff became famous for their correct warnings of imminent crisis, Edward Gramlich, a governor at the Federal Reserve, told Fed Chairman Alan Greenspan that making home mortgages available to low income borrowers would lead to widespread loan defaults having extremely negative effects on the national economy. This extraordinarily specific warning was given in 2000, amidst the wreckage of the dot-com bomb and before the housing bubble even began. Those possessed of a mordant sense of humor may appreciate how Greenspan rejected Gramlich’s recommendation to audit consumer finance companies on the basis of his fear that it might undermine the availability of subprime credit.”</b><br> – Vox Day, <i>The Return of the Great Depression</i>, x.</br></p></div>",
  "content_text": "In which Ben Bernanke throws Barney Frank under the bus.  Even if you’re not an economist, Ben Bernanke’s attempt to excuse the Federal Reserve for any responsibility in creating the housing bubble really has to be read to be believed.  Here’s the one of the more damning paragraphs\nin the 36-page PDF\n:\nFirst, the cumulative increase in housing prices shown in Slide 5 is quite large. Can accommodative monetary policies during this period reasonably account for the magnitude of the increase in house prices that we observed? If not, what does account for it? Second, house prices rose significantly during this period in many industrialized countries, not just in the United States. If monetary policy was an important source of house price appreciation in the United States, it seems reasonable to expect that, in an international comparison, countries with easier monetary policies should have been more likely to have significant rises in house prices as well. Is that the case?\nWith respect to the magnitude of house-price increases: Economists who have investigated the issue have generally found that, based on historical relationships, only a small portion of the increase in house prices earlier this decade can be attributed to the stance of U.S. monetary policy. This conclusion has been reached using both econometric models and purely statistical analyses that make no use of economic theory.\nThis is extraordinarily deceptive on several levels.  Bernanke is first leaving out the fact that regulation of the banks is the specific responsibility of the Federal Reserve and is an inherent part of monetary policy given the fact that most of the money in the system is created by bank loans under the fractional-reserve system.  He is, of course, limiting his implicit definition of “monetary policy” to interest rate targets, which is acceptable in general economic discussions but not in a specific one of this sort.\nSecond, it should be no surprise that Bernanke feels justified by the use of econometric models based on the Taylor Rule because the Taylor Rule is the very rule that was used to justify the Fed’s actions in the first place.  As Mike Shedlock shows\nusing Case-Shiller housing prices in the place of Owner-Equivalent Rent\nto calculate CPI-U, the Taylor Rule is fundamentally flawed because it is based on CPI-U.  In RGD, I demonstrate a few of the many ways CPI-U considerably underestimates the real rate of price changes; the fact that\nit doesn’t even take real housing prices into account\nrenders it entirely useless as a basis for defending the Federal Reserve’s actions or comparing the U.S. housing market with international housing markets.\nNo doubt there will be a lot of detailed critiques of this paper in the coming month.  I may even write one myself.  But in summary, “Monetary Policy and the Housing Bubble” is a shameless and deceptive attempt by a failed economist to justify his spectacular failure by using the very models that failed him in the first place.\nI recognized the housing bubble in 2002; that is a matter of public record.  Bernanke, on the other hand, was still denying it existed in October 2005, less than a year prior to its 2006 peak!\n“House prices have risen by nearly 25 percent over the past two years. Although speculative activity has increased in some areas, at a national level these price increases largely reflect strong economic fundamentals, including robust growth in jobs and incomes, low mortgage rates, steady rates of household formation, and factors that limit the expansion of housing supply in some areas.”\nCalculated Risk\npoints out two more things\nthat Bernanke conveniently avoided mentioning:\n“Bernanke used data from other countries to suggest monetary policy was not a huge contributor to the bubble … however, Bernanke didn’t discuss if non-traditional mortgage products contributed to housing bubbles in other countries. This would seem like a key missing part of the speech.\nBernanke didn’t discuss how the current regulatory structure missed this “protracted deterioration in mortgage underwriting standards” (even though many people were pointing it out in real time). And Bernanke didn’t discuss specifically how the new regulatory structure would catch this deterioration in standards.”\nThe truth is that the Fed knew about the “protracted deterioration in mortgage underwriting standards” prior to the start:\n“Even before economic prophets of doom such as Marc Faber, Nouriel Roubini, and Peter Schiff became famous for their correct warnings of imminent crisis, Edward Gramlich, a governor at the Federal Reserve, told Fed Chairman Alan Greenspan that making home mortgages available to low income borrowers would lead to widespread loan defaults having extremely negative effects on the national economy. This extraordinarily specific warning was given in 2000, amidst the wreckage of the dot-com bomb and before the housing bubble even began. Those possessed of a mordant sense of humor may appreciate how Greenspan rejected Gramlich’s recommendation to audit consumer finance companies on the basis of his fear that it might undermine the availability of subprime credit.”\n– Vox Day,\nThe Return of the Great Depression\n, x.",
  "tags": [
    "economics"
  ],
  "categories": [],
  "sitemap_lastmod": "2010-01-04T14:30:00+00:00"
}