{
  "url": "https://voxday.net/2010/01/17/conspicuous-charity/",
  "scraped_at": "2026-01-08T23:17:10.285784",
  "title": "Conspicuous charity",
  "date_display": "January 17, 2010",
  "date_iso": "2010-01-17T14:08:00+00:00",
  "date_from_url": "2010-01-17",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>Richard Dawkins and the Reason Project have <a href=\"http://givingaid.richarddawkins.net/\">ulterior motives for helping Haiti</a>:</p><blockquote><p>Help for Haiti</p><p>It is widely imagined that, in times of crisis, religious people render aid in disproportion to their numbers. Richard Dawkins has now created an opportunity for non-believers to put the lie to this myth.</p><p>One hundred percent of the funds raised will go to Doctors Without Borders and/or The Red Cross (you decide). But giving in this way will send an additional message: one need not believe in God to care about one’s fellow human beings.</p></blockquote><p>First, it’s not “widely imagined”, it is an established fact.  I think it would have been much more effective if Richard Dawkins had set up the No Religion Emergency Response Squad to directly help the Haitian people instead of relying upon atheists to give money.  That way, they could at least burn all the copies of <i>The God Delusion</i> and <i>The End of Faith</i> that would be donated for warmth and heat.  And I’m sure the three Haitians lucky enough to score the sticks of gum from the near-empty pack of Juicy Fruit that was also contributed would particularly appreciate the effort.</p><p>Dawkins is such an unmitigated and self-centered ass that he can’t even permit a natural disaster to take place without attempting to turn it into a statement about atheists.  If you want to help someone, then just shut up, do it, and spare the press release.  Let not your right hand etc etc.  The point is: it’s not about you or your godless ideology, you narcissistic wanker.</p><p>I happen to think it is stupid and pointless to “help” Haiti.  I oppose all government aid; as for private giving, it’s no business of mine how you choose to spend your money.  My point is simply that the Haitian people are in this desperate position due to all the “help” they’ve received in the past.  Neither individuals nor societies change when others prevent them from experiencing the predictable consequences of their actions.  This doesn’t prevent me from respecting those who believe otherwise, especially those like the four ex-military guys who took it upon themselves to fly to the Dominican Republic in order to personally deliver medical supplies to Haiti.  I don’t respect those who give exactly like the Pharisees did; in order to find favor in the eyes of men.</p><p>The cynic’s reaction to this conspicuous charity is confirmed when Dawkins, or whoever wrote the appeal on his behalf, writes: <i>“It goes without saying that your donations will only be passed on to aid organizations that do not have religious affiliations.”</i> This is a clear admission that this “charitable effort” isn’t about helping Haitians, it’s merely about advancing the atheist cause.</p></div>",
  "content_text": "Richard Dawkins and the Reason Project have\nulterior motives for helping Haiti\n:\nHelp for Haiti\nIt is widely imagined that, in times of crisis, religious people render aid in disproportion to their numbers. Richard Dawkins has now created an opportunity for non-believers to put the lie to this myth.\nOne hundred percent of the funds raised will go to Doctors Without Borders and/or The Red Cross (you decide). But giving in this way will send an additional message: one need not believe in God to care about one’s fellow human beings.\nFirst, it’s not “widely imagined”, it is an established fact.  I think it would have been much more effective if Richard Dawkins had set up the No Religion Emergency Response Squad to directly help the Haitian people instead of relying upon atheists to give money.  That way, they could at least burn all the copies of\nThe God Delusion\nand\nThe End of Faith\nthat would be donated for warmth and heat.  And I’m sure the three Haitians lucky enough to score the sticks of gum from the near-empty pack of Juicy Fruit that was also contributed would particularly appreciate the effort.\nDawkins is such an unmitigated and self-centered ass that he can’t even permit a natural disaster to take place without attempting to turn it into a statement about atheists.  If you want to help someone, then just shut up, do it, and spare the press release.  Let not your right hand etc etc.  The point is: it’s not about you or your godless ideology, you narcissistic wanker.\nI happen to think it is stupid and pointless to “help” Haiti.  I oppose all government aid; as for private giving, it’s no business of mine how you choose to spend your money.  My point is simply that the Haitian people are in this desperate position due to all the “help” they’ve received in the past.  Neither individuals nor societies change when others prevent them from experiencing the predictable consequences of their actions.  This doesn’t prevent me from respecting those who believe otherwise, especially those like the four ex-military guys who took it upon themselves to fly to the Dominican Republic in order to personally deliver medical supplies to Haiti.  I don’t respect those who give exactly like the Pharisees did; in order to find favor in the eyes of men.\nThe cynic’s reaction to this conspicuous charity is confirmed when Dawkins, or whoever wrote the appeal on his behalf, writes:\n“It goes without saying that your donations will only be passed on to aid organizations that do not have religious affiliations.”\nThis is a clear admission that this “charitable effort” isn’t about helping Haitians, it’s merely about advancing the atheist cause.",
  "tags": [
    "atheism"
  ],
  "categories": [],
  "sitemap_lastmod": "2010-01-17T14:08:00+00:00"
}