{
  "url": "https://voxday.net/2010/01/09/economics-and-evolution/",
  "scraped_at": "2026-01-08T23:16:33.646536",
  "title": "Economics and evolution",
  "date_display": "January 9, 2010",
  "date_iso": "2010-01-09T12:21:00+00:00",
  "date_from_url": "2010-01-09",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>Scott Hatfield <a href=\"http://monkeytrials.blogspot.com/\">of Monkey Trials</a> brings <a href=\"http://scienceblogs.com/evolution/2009/12/economics_and_evolution_as_dif.php\">an interesting series of posts</a> by David Sloan Wilson to our attention:</p><blockquote><p>One important theme that emerged was the yawning gap between economic theory and evolutionary theory. Economists are very smart people, but when smart people take off in the wrong direction, they go a very long way. As Eric Beinhocker (one of the participants) recounts in his book The Origin of Wealth, neoclassical economics was originally inspired by physics and led to an enormous body of formal theory based on assumptions that are required for mathematical tractability but that make no sense from an evolutionary perspective….  If economics and evolution are different paradigms with a yawning gap between them, then it will be very difficult to get from one to another in an incremental fashion. Every time we try to make one assumption in economic theory more realistic from an evolutionary perspective, it will conflict with the other assumptions and will be resisted by those accustomed to the economic paradigm. Scientific progress will require comparing the two paradigms as package deals and accepting or rejecting them on that basis.</p></blockquote><p>I have to say that it is refreshing to see an evolutionist admitting that perhaps economists may actually be intelligent, (their recent performance notwithstanding), and simply have a different way of looking at things.  This is much preferable to the defensive shrieking and finger pointing we have come to expect from biologists forced to confront basic economic concepts.  Unfortunately, the response to perfectly reasonable questions like “what is the average rate of evolution?” tends to be some variant of “You know nothing about evolution or science and the reason I can’t answer any of your questions is because you’re stupid!”</p><p>Well, that’s helpful.  I’m much more convinced that you know what you’re talking about now….</p><p>Now, the Walrasian-Keynesian neoclassical formalist paradigm to which Wilson refers was a detour from the earlier and in many ways superior economics of Turgot and the School of Salamanca and it certainly has many weaknesses.  Since I favor the Austrian School, I am by no means wedded to the mathematical assumptions and artificial equilibria which Wilson implicitly questions.  However, despite the gaps, I also see many similarities between what has now evolved into a Samuelsonite Neo-Keynesian macroeconomic orthodoxy and the Neo-Darwinian orthodoxy of the evolutionists.  Both scientific consensuses are highly intolerant of criticism, produce predictive models that are reliably wrong, and take an approach that should be labeled “Kuhn’s Ostrich” toward anything that might threaten their current dogma.</p><p>Unfortunately for the sake of evolutionists who are actually interested in improving their theories rather than defending their dogma, the time scale on which they operate prevents their theoretical flaws from being exposed as rapidly as is the case with illegitimate economic orthdoxies.  Pure Keynesian general theory was vanquished during the recession of the 1970s, the two Japanese Lost Decades eviscerated the monetarist heretics of the Chicago School, and the current contraction should cause the collapse of the SNK synthesis over the next decade.  The false dichotomy of monetarism vs Neo-Keynesianism has already been exposed; whether the successor is some Minskyite Post-Keynesian doctrine, the Austrian school, or, as I expect, a blending of the two with a strong dash of behavioral economics, economics will be greatly transformed.</p><p>While I have hopes for genetics eventually putting the final stake through the tattered remnants of TENS that still survive the modern synthesis, it’s quite clear that in the absence of an unexpected Kuhnian crisis, biology will continue to be handicapped by its reliance on what is at its core nothing more than a quasi-medieval philosophical foundation rather than a properly scientific one.  But Wilson’s perspective is an unusual one and I expect to follow his Paradigm series with interest.</p><p>I am, however, more than a little dubious of Wilson’s attempt to construct an analogy fitting paradigms into evolutionary stable strategy. <i>“Intriguingly, paradigms can be regarded as the intellectual equivalent of local stable equilibria in complexity theory and adaptive peaks in evolutionary theory.”</i> This sounds suspiciously like Dawkins’s “meme” nonsense to me, especially in light of Wilson’s obvious awareness of the risks inherently involved in adapting concepts from one discipline into another.</p></div>",
  "content_text": "Scott Hatfield\nof Monkey Trials\nbrings\nan interesting series of posts\nby David Sloan Wilson to our attention:\nOne important theme that emerged was the yawning gap between economic theory and evolutionary theory. Economists are very smart people, but when smart people take off in the wrong direction, they go a very long way. As Eric Beinhocker (one of the participants) recounts in his book The Origin of Wealth, neoclassical economics was originally inspired by physics and led to an enormous body of formal theory based on assumptions that are required for mathematical tractability but that make no sense from an evolutionary perspective….  If economics and evolution are different paradigms with a yawning gap between them, then it will be very difficult to get from one to another in an incremental fashion. Every time we try to make one assumption in economic theory more realistic from an evolutionary perspective, it will conflict with the other assumptions and will be resisted by those accustomed to the economic paradigm. Scientific progress will require comparing the two paradigms as package deals and accepting or rejecting them on that basis.\nI have to say that it is refreshing to see an evolutionist admitting that perhaps economists may actually be intelligent, (their recent performance notwithstanding), and simply have a different way of looking at things.  This is much preferable to the defensive shrieking and finger pointing we have come to expect from biologists forced to confront basic economic concepts.  Unfortunately, the response to perfectly reasonable questions like “what is the average rate of evolution?” tends to be some variant of “You know nothing about evolution or science and the reason I can’t answer any of your questions is because you’re stupid!”\nWell, that’s helpful.  I’m much more convinced that you know what you’re talking about now….\nNow, the Walrasian-Keynesian neoclassical formalist paradigm to which Wilson refers was a detour from the earlier and in many ways superior economics of Turgot and the School of Salamanca and it certainly has many weaknesses.  Since I favor the Austrian School, I am by no means wedded to the mathematical assumptions and artificial equilibria which Wilson implicitly questions.  However, despite the gaps, I also see many similarities between what has now evolved into a Samuelsonite Neo-Keynesian macroeconomic orthodoxy and the Neo-Darwinian orthodoxy of the evolutionists.  Both scientific consensuses are highly intolerant of criticism, produce predictive models that are reliably wrong, and take an approach that should be labeled “Kuhn’s Ostrich” toward anything that might threaten their current dogma.\nUnfortunately for the sake of evolutionists who are actually interested in improving their theories rather than defending their dogma, the time scale on which they operate prevents their theoretical flaws from being exposed as rapidly as is the case with illegitimate economic orthdoxies.  Pure Keynesian general theory was vanquished during the recession of the 1970s, the two Japanese Lost Decades eviscerated the monetarist heretics of the Chicago School, and the current contraction should cause the collapse of the SNK synthesis over the next decade.  The false dichotomy of monetarism vs Neo-Keynesianism has already been exposed; whether the successor is some Minskyite Post-Keynesian doctrine, the Austrian school, or, as I expect, a blending of the two with a strong dash of behavioral economics, economics will be greatly transformed.\nWhile I have hopes for genetics eventually putting the final stake through the tattered remnants of TENS that still survive the modern synthesis, it’s quite clear that in the absence of an unexpected Kuhnian crisis, biology will continue to be handicapped by its reliance on what is at its core nothing more than a quasi-medieval philosophical foundation rather than a properly scientific one.  But Wilson’s perspective is an unusual one and I expect to follow his Paradigm series with interest.\nI am, however, more than a little dubious of Wilson’s attempt to construct an analogy fitting paradigms into evolutionary stable strategy.\n“Intriguingly, paradigms can be regarded as the intellectual equivalent of local stable equilibria in complexity theory and adaptive peaks in evolutionary theory.”\nThis sounds suspiciously like Dawkins’s “meme” nonsense to me, especially in light of Wilson’s obvious awareness of the risks inherently involved in adapting concepts from one discipline into another.",
  "tags": [
    "economics",
    "evolution"
  ],
  "categories": [],
  "sitemap_lastmod": "2010-01-09T12:21:00+00:00"
}