{
  "url": "https://voxday.net/2010/01/09/gay-pedophiles-and-their-atheis/",
  "scraped_at": "2026-01-08T23:16:35.456596",
  "title": "Pederasts and their atheist enablers",
  "date_display": "January 9, 2010",
  "date_iso": "2010-01-09T16:23:00+00:00",
  "date_from_url": "2010-01-09",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>I found it difficult to believe that Uganda was on the verge of passing a law that would require the death penalty for merely being homosexual as various atheist sites have been reporting, especially since by all reports it is an extremely popular law.  Unsurprisingly, <a href=\"http://wthrockmorton.com/wp-content/uploads/2009/10/anti-homosexuality-bill-2009.pdf\">about thirty seconds of research</a> revealed that the critics of the law have played a little fast and loose in their portrayal of it.  While homosexuality is illegal in Uganda and has been for more than 100 years, the death penalty attached to the new law is primarily intended to stop <i>the homosexual rape of children and the disabled</i> and passing on the HIV virus.</p><p>Given that Uganda is one of the third-world countries presently targeted by sex tourists and the country also <a href=\"http://allafrica.com/stories/200904070181.html\">passed laws against cannibalism and sex tourism</a> recently, it should be perfectly clear that the law involves more than societal hatred for homosexuals.  Now, I don’t support capital punishment in criminal law because I believe giving the state the power of life or death over its citizens is an inherently dangerous idea.  Nor do I understand how locking up homosexuals in same-sex prisons is supposed to be an effective deterrent.  I would not support a law like the anti-homosexuality bill being enacted in the United States since legality is not morality and homosexuals should be free to choose Hell in their own way, just like everyone else is.</p><p>However, the more pressing question is not why some Western Christians would fail to denounce this law, but rather, why those who so vehemently oppose it <i>are defending the right of gay pedophiles to rape children</i>.  Now, it’s perfectly reasonable to take a position opposing the long-term jailing of individuals for the crime – and in Uganda, it has long been a crime – of engaging in homosexual acts, although it’s not actually all that reasonable unless you are normally in the position of expressing your opinion regarding Ugandan law.  But life sentences for practicing homosexuals is clearly not the only thing most of these sites are complaining about because they are specifically referencing the death penalty.</p><p>This reaction against what is clearly a very popular law in Uganda highlights the anti-democratic aspect of Western progressivism.  If the great majority of people in Uganda don’t want to put up with homosexuality, why should they?  It’s clearly the sacred Will of the People, after all.  And more importantly, how is this of concern to anyone who doesn’t live in Uganda, barring those who will have to give up their pedophile safaris in the future?  Given their opposition to such laws, you would think that banning the mass importation of Ugandans and other like-minded third-worlders who will support similar laws here in the United States would be a more urgent issue, but ironically, importing third-worlders is a policy favored by most progressives.</p><p>There is, of course, a perfectly rational solution to the situation.  Since Uganda doesn’t want its gays, and American progressives insist that gays and immigrants are good for a community, why don’t progressive communities across America simply encourage gay immigration from Uganda?  Everyone wins!  And it’s eminently practical too, since Uganda’s estimated 500,000 gays would make up less than one-third of the 1.8 million foreigners who annually immigrate to America.</p></div>",
  "content_text": "I found it difficult to believe that Uganda was on the verge of passing a law that would require the death penalty for merely being homosexual as various atheist sites have been reporting, especially since by all reports it is an extremely popular law.  Unsurprisingly,\nabout thirty seconds of research\nrevealed that the critics of the law have played a little fast and loose in their portrayal of it.  While homosexuality is illegal in Uganda and has been for more than 100 years, the death penalty attached to the new law is primarily intended to stop\nthe homosexual rape of children and the disabled\nand passing on the HIV virus.\nGiven that Uganda is one of the third-world countries presently targeted by sex tourists and the country also\npassed laws against cannibalism and sex tourism\nrecently, it should be perfectly clear that the law involves more than societal hatred for homosexuals.  Now, I don’t support capital punishment in criminal law because I believe giving the state the power of life or death over its citizens is an inherently dangerous idea.  Nor do I understand how locking up homosexuals in same-sex prisons is supposed to be an effective deterrent.  I would not support a law like the anti-homosexuality bill being enacted in the United States since legality is not morality and homosexuals should be free to choose Hell in their own way, just like everyone else is.\nHowever, the more pressing question is not why some Western Christians would fail to denounce this law, but rather, why those who so vehemently oppose it\nare defending the right of gay pedophiles to rape children\n.  Now, it’s perfectly reasonable to take a position opposing the long-term jailing of individuals for the crime – and in Uganda, it has long been a crime – of engaging in homosexual acts, although it’s not actually all that reasonable unless you are normally in the position of expressing your opinion regarding Ugandan law.  But life sentences for practicing homosexuals is clearly not the only thing most of these sites are complaining about because they are specifically referencing the death penalty.\nThis reaction against what is clearly a very popular law in Uganda highlights the anti-democratic aspect of Western progressivism.  If the great majority of people in Uganda don’t want to put up with homosexuality, why should they?  It’s clearly the sacred Will of the People, after all.  And more importantly, how is this of concern to anyone who doesn’t live in Uganda, barring those who will have to give up their pedophile safaris in the future?  Given their opposition to such laws, you would think that banning the mass importation of Ugandans and other like-minded third-worlders who will support similar laws here in the United States would be a more urgent issue, but ironically, importing third-worlders is a policy favored by most progressives.\nThere is, of course, a perfectly rational solution to the situation.  Since Uganda doesn’t want its gays, and American progressives insist that gays and immigrants are good for a community, why don’t progressive communities across America simply encourage gay immigration from Uganda?  Everyone wins!  And it’s eminently practical too, since Uganda’s estimated 500,000 gays would make up less than one-third of the 1.8 million foreigners who annually immigrate to America.",
  "tags": [
    "politics"
  ],
  "categories": [],
  "sitemap_lastmod": "2010-01-09T16:23:00+00:00"
}