{
  "url": "https://voxday.net/2010/01/03/gdp-and-recession/",
  "scraped_at": "2026-01-08T23:16:02.459418",
  "title": "GDP and recession",
  "date_display": "January 3, 2010",
  "date_iso": "2010-01-03T21:30:00+00:00",
  "date_from_url": "2010-01-03",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><blockquote><p>A total of 157.5 million persons worked at some point during 2008, the U.S. Bureau of Labor Statistics reported today. The proportion of workers who worked full time, year round in 2008 was 65.6 percent, down from 68.4 percent in 2007. The number of persons who experienced some unemployment in<br> 2008 increased by 6.1 million to 21.2 million. This sharp increase reflects weak labor market conditions due to <a href=\"http://www.bls.gov/news.release/work.nr0.htm\">a recession that began in December 2007</a>.</br></p></blockquote><p>I found that last sentence to be interesting.  Here are the latest GDP numbers from Q407 to Q308:  2.1, -0.7, 1.5, 2.7.  Now, if the recession began before Q408, while the average quarterly GDP was 1.4 percent, how does 2.2 percent GDP growth indicate economic recovery?  Especially when it is known that between two-thirds and three-fourths of that “growth” was related to the Cash for Clunkers program.</p></div>",
  "content_text": "A total of 157.5 million persons worked at some point during 2008, the U.S. Bureau of Labor Statistics reported today. The proportion of workers who worked full time, year round in 2008 was 65.6 percent, down from 68.4 percent in 2007. The number of persons who experienced some unemployment in\n2008 increased by 6.1 million to 21.2 million. This sharp increase reflects weak labor market conditions due to\na recession that began in December 2007\n.\nI found that last sentence to be interesting.  Here are the latest GDP numbers from Q407 to Q308:  2.1, -0.7, 1.5, 2.7.  Now, if the recession began before Q408, while the average quarterly GDP was 1.4 percent, how does 2.2 percent GDP growth indicate economic recovery?  Especially when it is known that between two-thirds and three-fourths of that “growth” was related to the Cash for Clunkers program.",
  "tags": [
    "economics"
  ],
  "categories": [],
  "sitemap_lastmod": "2010-01-03T21:30:00+00:00"
}