{
  "url": "https://voxday.net/2010/01/06/iceland-defies-vampire-squids/",
  "scraped_at": "2026-01-08T23:16:19.071593",
  "title": "Iceland defies the vampire squids",
  "date_display": "January 6, 2010",
  "date_iso": "2010-01-06T14:30:00+00:00",
  "date_from_url": "2010-01-06",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>A few politicians are finally <a href=\"http://www.bloomberg.com/apps/news?pid=20601087&amp;sid=aujWzg8.dcs4&amp;pos=6\">beginning to listen to the people</a> rather than the banksters:</p><blockquote><p>Iceland will hold a referendum on a depositor accord with the U.K. and Netherlands after President Olafur R. Grimsson blocked the bill in a move that threatens to undermine the island’s efforts to repair international relations.</p><p>“The constitution is very clear about the need for a referendum in this situation,” Prime Minister Johanna Sigurdardottir told reporters in Reykjavik today.</p><p>Grimsson vetoed the so-called Icesave accord after more than 60,000 of Iceland’s 320,000 inhabitants signed a petition urging him to reject the legislation.  The bill, which polls show about 70 percent of the population opposes, had obliged Iceland to use $5.5 billion in borrowed funds from the U.K. and Netherlands to cover depositor claims from the two countries after the failure of Landsbanki Islands hf in October 2008. The absence of clear cross-border regulatory rules on depositor insurance has allowed settlement of the claims to drag on and left Icelandic taxpayers disgruntled over having to pay for the failure of a private bank.</p></blockquote><p>Why should all the people of Iceland be responsible for paying <i>40 percent of their annual GDP</i> on behalf of the 22 people who owned the failed Icelandic bank?  Why should they be held responsible for paying off the Dutch and UK governments just because the Dutch and UK politicians decided to prevent Dutch and UK investors from suffering the negative consequences of their bad investment decisions?  The truth is that there is no reason whatsoever, and the Icelandic people should call the banking community’s bluff; the banks need borrowers more than the borrowers need banks.  And even in the unlikely event that the financial isolation threat is carried out, in the long run the Icelandic people will be much better off without having the vampire squids constantly draining their economy of its profits.  They will be even better off if they use this incident <a href=\"http://www.timesonline.co.uk/tol/news/world/europe/article6977152.ece\">to stay out of the EU</a>.</p><p><i>“Britain warned Iceland that it would be frozen out of the European Union after its President abruptly vetoed the repayment of a £3.6 billion loan.”</i></p><p>I seem to recall that 70% of the American public opposed TARP.  And I imagine an even higher percentage will oppose SuperTARP once they realize that the White House just opened up the floodgates for a continuous banking bailout via Fannie and Freddie.  So, it’s interesting to see this demonstration in real-time of which countries are genuinely democratic and which are not.</p></div>",
  "content_text": "A few politicians are finally\nbeginning to listen to the people\nrather than the banksters:\nIceland will hold a referendum on a depositor accord with the U.K. and Netherlands after President Olafur R. Grimsson blocked the bill in a move that threatens to undermine the island’s efforts to repair international relations.\n“The constitution is very clear about the need for a referendum in this situation,” Prime Minister Johanna Sigurdardottir told reporters in Reykjavik today.\nGrimsson vetoed the so-called Icesave accord after more than 60,000 of Iceland’s 320,000 inhabitants signed a petition urging him to reject the legislation.  The bill, which polls show about 70 percent of the population opposes, had obliged Iceland to use $5.5 billion in borrowed funds from the U.K. and Netherlands to cover depositor claims from the two countries after the failure of Landsbanki Islands hf in October 2008. The absence of clear cross-border regulatory rules on depositor insurance has allowed settlement of the claims to drag on and left Icelandic taxpayers disgruntled over having to pay for the failure of a private bank.\nWhy should all the people of Iceland be responsible for paying\n40 percent of their annual GDP\non behalf of the 22 people who owned the failed Icelandic bank?  Why should they be held responsible for paying off the Dutch and UK governments just because the Dutch and UK politicians decided to prevent Dutch and UK investors from suffering the negative consequences of their bad investment decisions?  The truth is that there is no reason whatsoever, and the Icelandic people should call the banking community’s bluff; the banks need borrowers more than the borrowers need banks.  And even in the unlikely event that the financial isolation threat is carried out, in the long run the Icelandic people will be much better off without having the vampire squids constantly draining their economy of its profits.  They will be even better off if they use this incident\nto stay out of the EU\n.\n“Britain warned Iceland that it would be frozen out of the European Union after its President abruptly vetoed the repayment of a £3.6 billion loan.”\nI seem to recall that 70% of the American public opposed TARP.  And I imagine an even higher percentage will oppose SuperTARP once they realize that the White House just opened up the floodgates for a continuous banking bailout via Fannie and Freddie.  So, it’s interesting to see this demonstration in real-time of which countries are genuinely democratic and which are not.",
  "tags": [
    "banks",
    "politics"
  ],
  "categories": [],
  "sitemap_lastmod": "2010-01-06T14:30:00+00:00"
}