{
  "url": "https://voxday.net/2010/01/22/is-obama-serious/",
  "scraped_at": "2026-01-08T23:17:34.807559",
  "title": "Is Obama serious?",
  "date_display": "January 22, 2010",
  "date_iso": "2010-01-22T12:45:00+00:00",
  "date_from_url": "2010-01-22",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>He can come back in a big way <a href=\"http://www.telegraph.co.uk/finance/newsbysector/banksandfinance/7048406/Banks-reel-from-Barack-Obamas-30bn-speech.html\">if he is really going to take on the banks</a>.  But <a href=\"http://market-ticker.denninger.net/archives/1884-Did-The-President-FINALLY-Wake-Up.html\">the Market Ticker’s enthusiasm</a> for Obama’s so-called “declaration of war” notwithstanding, that’s a pretty big if.  However promising his populist rhetoric sounds, I strongly suspect this is nothing more than another smokescreen fired out of the Federal extend-and-pretend <i>Nebelwerfer</i>.  Nor am I alone in these suspicions:</p><blockquote><p>Senior staff at the investment banks themselves were determined to play down the significance of the speech. “What you are witnessing it a political panic,” said one. “Obama lost a crucial vote and is now trying to win back political ground by some serious bank bashing. This has to go through a long and complicated political process before it gets anywhere near being law.”…  Last night, David Viniar, Goldman’s chief financial officer, showed the first sign that President Obama faces a fight. “To put rules in place that roll back the financial system by 10 years is going to be a very, very hard thing to do,” he said.</p></blockquote><p>Translation: we will fight in the boardrooms, we will fight in the Congressional offices, we will fight in the Senatorial backrooms, we will never roll over and surrender our fraud, our theft, or our ill-gotten gains!  While Obama’s political survival instincts are leading him to take the right tack, Barney Frank has already made it clear that Congress, being largely owned by Wall Street, isn’t about to play ball.  When one considers the way Harry Reid and Nancy Pelosi rolled Obama last year, I wouldn’t bet the housing market against them doing it again, especially when they’ll have a lot of support from idiot Republicans defending the “free market” right of banks to collect federal subsidies, enjoy federal protection against competition, commit massive amounts of open fraud, and get bailed out when they still somehow manage to bankrupt themselves despite all those advantages.</p><p>There is an easy way to determine if Obama is genuinely declaring war on Wall Street or not.  If he fires Geithner and Summer, withdraws his support for Ben Bernanke, and promotes Paul Volcker to the Treasury, it’s on.  If he gets behind Ron Paul’s bill to audit the Fed, it’s nuclear.  But if he leaves all the usual suspects in place, and I have seen no indications that he will not, then this is just a bit of populist window dressing meant to alleviate his plunging poll numbers.</p><p>On a tangential note, speaking of those who have to go, check out <a href=\"http://huffpostfund.org/stories/2010/01/fdic-chief-got-bank-america-loans-while-working-its-rescue\">the latest piece of bank-related corruption</a> in the Obama administration: <i>“Sheila Bair, one of the chief regulators overseeing Bank of America’s federal rescue, took out two mortgages worth more than $1 million from the banking giant last summer during ongoing negotiations about the bank’s bailout and its repayment.   Mortgage documents for that 14-room home include a provision, known as a second-home rider, stating that Bair and her husband must keep the house for their “exclusive use and enjoyment” and may not use it as a rental or timeshare. Yet the couple has been renting out part of the house since they left for Washington, with Bair listing income from the “rental property” in Amherst as between $15,000 and $50,000 a year on her most recent financial disclosure form as head of the FDIC.”</i></p><p>These people belong in jail, not running massively influential financial agencies and deciding which corporations will live and which will die.  And yet we’re somehow supposed to believe they are capable of salvaging the economic situation?</p></div>",
  "content_text": "He can come back in a big way\nif he is really going to take on the banks\n.  But\nthe Market Ticker’s enthusiasm\nfor Obama’s so-called “declaration of war” notwithstanding, that’s a pretty big if.  However promising his populist rhetoric sounds, I strongly suspect this is nothing more than another smokescreen fired out of the Federal extend-and-pretend\nNebelwerfer\n.  Nor am I alone in these suspicions:\nSenior staff at the investment banks themselves were determined to play down the significance of the speech. “What you are witnessing it a political panic,” said one. “Obama lost a crucial vote and is now trying to win back political ground by some serious bank bashing. This has to go through a long and complicated political process before it gets anywhere near being law.”…  Last night, David Viniar, Goldman’s chief financial officer, showed the first sign that President Obama faces a fight. “To put rules in place that roll back the financial system by 10 years is going to be a very, very hard thing to do,” he said.\nTranslation: we will fight in the boardrooms, we will fight in the Congressional offices, we will fight in the Senatorial backrooms, we will never roll over and surrender our fraud, our theft, or our ill-gotten gains!  While Obama’s political survival instincts are leading him to take the right tack, Barney Frank has already made it clear that Congress, being largely owned by Wall Street, isn’t about to play ball.  When one considers the way Harry Reid and Nancy Pelosi rolled Obama last year, I wouldn’t bet the housing market against them doing it again, especially when they’ll have a lot of support from idiot Republicans defending the “free market” right of banks to collect federal subsidies, enjoy federal protection against competition, commit massive amounts of open fraud, and get bailed out when they still somehow manage to bankrupt themselves despite all those advantages.\nThere is an easy way to determine if Obama is genuinely declaring war on Wall Street or not.  If he fires Geithner and Summer, withdraws his support for Ben Bernanke, and promotes Paul Volcker to the Treasury, it’s on.  If he gets behind Ron Paul’s bill to audit the Fed, it’s nuclear.  But if he leaves all the usual suspects in place, and I have seen no indications that he will not, then this is just a bit of populist window dressing meant to alleviate his plunging poll numbers.\nOn a tangential note, speaking of those who have to go, check out\nthe latest piece of bank-related corruption\nin the Obama administration:\n“Sheila Bair, one of the chief regulators overseeing Bank of America’s federal rescue, took out two mortgages worth more than $1 million from the banking giant last summer during ongoing negotiations about the bank’s bailout and its repayment.   Mortgage documents for that 14-room home include a provision, known as a second-home rider, stating that Bair and her husband must keep the house for their “exclusive use and enjoyment” and may not use it as a rental or timeshare. Yet the couple has been renting out part of the house since they left for Washington, with Bair listing income from the “rental property” in Amherst as between $15,000 and $50,000 a year on her most recent financial disclosure form as head of the FDIC.”\nThese people belong in jail, not running massively influential financial agencies and deciding which corporations will live and which will die.  And yet we’re somehow supposed to believe they are capable of salvaging the economic situation?",
  "tags": [
    "banks"
  ],
  "categories": [],
  "sitemap_lastmod": "2010-01-22T12:45:00+00:00"
}