{
  "url": "https://voxday.net/2010/01/11/krugman-gets-it-wrong-again/",
  "scraped_at": "2026-01-08T23:16:44.628405",
  "title": "Krugman gets it wrong… again",
  "date_display": "January 11, 2010",
  "date_iso": "2010-01-11T19:29:00+00:00",
  "date_from_url": "2010-01-11",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>Imagine <a href=\"http://corner.nationalreview.com/post/?q=MzkyYWY0MWVmNzM2ODU1YmY3ZWQ4OGRmNWUwZjBkZjE=\">that</a>:</p><blockquote><p>Paul Krugman has weighed in to an ongoing debate sparked by Jonathan Chait’s criticism of a passage in my essay “Keeping America’s Edge.” I believe that I have responded to Mr. Chait’s assertions comprehensively. Unlike Chait, Professor Krugman has argued that I have presented incorrect data.</p><p>Krugman says this:</p><p><i>But I went back to Manzi’s source of data, and it turns out that it’s even worse than that. If you use the broad definition of Europe, which includes the USSR, it did indeed have 40 percent of world output in the early 1970s. But that share has not fallen to 25 percent — it’s still above 30 percent.</i></p><p>His assertion is flatly false.</p><p>First, Krugman has incorrectly identified my source of data.  I have never corresponded with Krugman concerning data sources and analysis for the passage in question (unlike Chait, who was careful to contact me prior to publishing his blog post, and to whom I sent data sources and calculation details), so I cannot know on what basis Krugman asserts that the dataset to which he links is my “source of data.” It is not. As per the blog post in which I reviewed multiple data sources for the analysis in question, I averaged multiple sources of data. Krugman has selected only one of these sources, presented it as if it were my sole source, and therefore (obviously) failed to replicate the published result. The error is his.</p><p>Second, Krugman incorrectly interpreted the economic dataset that he did identify.</p></blockquote><p>I know I’m shocked that A NOBEL-WINNING ECONOMIST could get it so wrong.  And speaking of errors and Krugman, a recent reviewer of RGD <a href=\"http://www.amazon.com/Return-Great-Depression-Vox-Day/product-reviews/1935071181/ref=cm_cr_dp_synop?ie=UTF8&amp;showViewpoints=0&amp;sortBy=bySubmissionDateDescending#R2UORQX9SMY5GK\">managed to impressively cock things up</a> in “correcting” my explanation of the loan multiplier in a fractional reserve system.  Amusingly, he seizes upon this “error”, combined with the fact that I dared to criticize <i>A NOBEL-WINNING ECONOMIST</i>, to claim that the book “Should Never Have Been Published”.   While I have to take responsibility for failing to distinguish between “the bank” and “the banking system”, our intrepid reviewer nevertheless managed to completely miss both the obvious context (the fractional reserve system) as well as the point (the increase in the money supply created by the loans).  I’ll explain this in more detail later this week for the six regulars who are actually interested in this sort of thing as well as any anklebiters who would like to revel in the possibility that I am wrong about something, but if you’d like to verify this for yourself, I would encourage you to plug a 0.75% reserve ratio into <a href=\"http://en.wikipedia.org/wiki/Fractional_reserve\">the table in the Wikpedia example</a> – note that I was completely unaware of this table until about two weeks ago – and compare it to the Loan Multiplier of 133.33x to determine for yourself whether Mr. Eskildson’s “correction” is on target or not.</p><p>It should be noted, that this method only provides an estimate for the amount of interest collected over the course of the year, since this completely depends upon the number of loan-and-deposit cycles that occur over the course of the year as well as the three caveats mentioned in the book.  Using the 10x example from Wikipedia would mean that $4.80 in annual interest is collected, which is neither the maximum $6.67 mentioned in RGD nor the $0.0599 which the reviewer claims is the correct amount.</p></div>",
  "content_text": "Imagine\nthat\n:\nPaul Krugman has weighed in to an ongoing debate sparked by Jonathan Chait’s criticism of a passage in my essay “Keeping America’s Edge.” I believe that I have responded to Mr. Chait’s assertions comprehensively. Unlike Chait, Professor Krugman has argued that I have presented incorrect data.\nKrugman says this:\nBut I went back to Manzi’s source of data, and it turns out that it’s even worse than that. If you use the broad definition of Europe, which includes the USSR, it did indeed have 40 percent of world output in the early 1970s. But that share has not fallen to 25 percent — it’s still above 30 percent.\nHis assertion is flatly false.\nFirst, Krugman has incorrectly identified my source of data.  I have never corresponded with Krugman concerning data sources and analysis for the passage in question (unlike Chait, who was careful to contact me prior to publishing his blog post, and to whom I sent data sources and calculation details), so I cannot know on what basis Krugman asserts that the dataset to which he links is my “source of data.” It is not. As per the blog post in which I reviewed multiple data sources for the analysis in question, I averaged multiple sources of data. Krugman has selected only one of these sources, presented it as if it were my sole source, and therefore (obviously) failed to replicate the published result. The error is his.\nSecond, Krugman incorrectly interpreted the economic dataset that he did identify.\nI know I’m shocked that A NOBEL-WINNING ECONOMIST could get it so wrong.  And speaking of errors and Krugman, a recent reviewer of RGD\nmanaged to impressively cock things up\nin “correcting” my explanation of the loan multiplier in a fractional reserve system.  Amusingly, he seizes upon this “error”, combined with the fact that I dared to criticize\nA NOBEL-WINNING ECONOMIST\n, to claim that the book “Should Never Have Been Published”.   While I have to take responsibility for failing to distinguish between “the bank” and “the banking system”, our intrepid reviewer nevertheless managed to completely miss both the obvious context (the fractional reserve system) as well as the point (the increase in the money supply created by the loans).  I’ll explain this in more detail later this week for the six regulars who are actually interested in this sort of thing as well as any anklebiters who would like to revel in the possibility that I am wrong about something, but if you’d like to verify this for yourself, I would encourage you to plug a 0.75% reserve ratio into\nthe table in the Wikpedia example\n– note that I was completely unaware of this table until about two weeks ago – and compare it to the Loan Multiplier of 133.33x to determine for yourself whether Mr. Eskildson’s “correction” is on target or not.\nIt should be noted, that this method only provides an estimate for the amount of interest collected over the course of the year, since this completely depends upon the number of loan-and-deposit cycles that occur over the course of the year as well as the three caveats mentioned in the book.  Using the 10x example from Wikipedia would mean that $4.80 in annual interest is collected, which is neither the maximum $6.67 mentioned in RGD nor the $0.0599 which the reviewer claims is the correct amount.",
  "tags": [
    "economics"
  ],
  "categories": [],
  "sitemap_lastmod": "2010-01-11T19:29:00+00:00"
}