{
  "url": "https://voxday.net/2010/01/31/mailvox-surmounting-gamma/",
  "scraped_at": "2026-01-08T23:18:19.540914",
  "title": "Mailvox: Surmounting Gamma",
  "date_display": "January 31, 2010",
  "date_iso": "2010-01-31T13:32:00+00:00",
  "date_from_url": "2010-01-31",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>An anonymous reader has a request:</p><blockquote><p>Your recent posts on the whole alpha/beta scale and specifically your post “Hierarchy test: the answer key” fits right into somethings I have been pondering in my life. In it you write “Gammas constantly sabotage their efforts to reach their goals because they want them so badly.” and “Gammas always engage in preemptive rejection.”</p><p>I have an IQ that is well above average and a somewhat rounded skillset/abilities but despite that I don’t find success and have determined that I am somehow self-sabotaging. Its an unconscious “gift” that I would really like to be rid of and something I have been pondering of late. And while I hadn’t thought of it previously I think that “preemptive rejection” ties right into it.</p><p>Now I realize that your post was more to do with Game but that isn’t really what I am looking at. Sure it would be nice to do better with women, but I have a child to take care of and so my focus is more on life in general and I was wondering what advice you might have for those of us who find far too much of your description of Gamma in our lives.</p></blockquote><p>As I have been repeatedly attempting to tell the Deltas, Gammas, and Omegas who wish to identify themselves as anything but what they are, the first step is to recognize clearly where you are perceived on the social hierarchy.  Ask five women and five men if you want to get a more objective perspective on it.  Others usually view us more clearly than we are able to see ourselves.</p><p>The first thing a Gamma has to do is <i>stop seeking the approval of others</i>.  Gammas are often easy to identify because when they talk, there is usually an unspoken question in their voice.  This can be indicated by hesitancy or a rising tone at the end of the sentence.  It’s not a coincidence that this is also how children talk, it’s an indication of instinctive approval-seeking.  Like Demosthenes getting rid of his stutter with his stones at the beach, this may require an amount of practice to eradicate.  Also note that rather like someone who normally represses his temper tends to lose it with a bang, the Gamma usually overdoes it when he attempts to speak with more authority; <i>inappropriate</i> overemphasis is a dead giveaway of low social status.</p><p>But that’s just the outward manifestation of the inner problem…. more later.  In the meantime, those of you with positive suggestions might consider offering them.</p></div>",
  "content_text": "An anonymous reader has a request:\nYour recent posts on the whole alpha/beta scale and specifically your post “Hierarchy test: the answer key” fits right into somethings I have been pondering in my life. In it you write “Gammas constantly sabotage their efforts to reach their goals because they want them so badly.” and “Gammas always engage in preemptive rejection.”\nI have an IQ that is well above average and a somewhat rounded skillset/abilities but despite that I don’t find success and have determined that I am somehow self-sabotaging. Its an unconscious “gift” that I would really like to be rid of and something I have been pondering of late. And while I hadn’t thought of it previously I think that “preemptive rejection” ties right into it.\nNow I realize that your post was more to do with Game but that isn’t really what I am looking at. Sure it would be nice to do better with women, but I have a child to take care of and so my focus is more on life in general and I was wondering what advice you might have for those of us who find far too much of your description of Gamma in our lives.\nAs I have been repeatedly attempting to tell the Deltas, Gammas, and Omegas who wish to identify themselves as anything but what they are, the first step is to recognize clearly where you are perceived on the social hierarchy.  Ask five women and five men if you want to get a more objective perspective on it.  Others usually view us more clearly than we are able to see ourselves.\nThe first thing a Gamma has to do is\nstop seeking the approval of others\n.  Gammas are often easy to identify because when they talk, there is usually an unspoken question in their voice.  This can be indicated by hesitancy or a rising tone at the end of the sentence.  It’s not a coincidence that this is also how children talk, it’s an indication of instinctive approval-seeking.  Like Demosthenes getting rid of his stutter with his stones at the beach, this may require an amount of practice to eradicate.  Also note that rather like someone who normally represses his temper tends to lose it with a bang, the Gamma usually overdoes it when he attempts to speak with more authority;\ninappropriate\noveremphasis is a dead giveaway of low social status.\nBut that’s just the outward manifestation of the inner problem…. more later.  In the meantime, those of you with positive suggestions might consider offering them.",
  "tags": [
    "society"
  ],
  "categories": [],
  "sitemap_lastmod": "2010-01-31T13:32:00+00:00"
}