{
  "url": "https://voxday.net/2010/01/26/mailvox-curiouser-and-curiouser/",
  "scraped_at": "2026-01-08T23:17:57.658433",
  "title": "Mailvox: curiouser and curiouser",
  "date_display": "January 26, 2010",
  "date_iso": "2010-01-26T17:39:00+00:00",
  "date_from_url": "2010-01-26",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>A professional energy analyst shares his professional perspective, which is an excerpt from a note he sends to their clients:</p><blockquote><p>Have you seen the report today? All the media sees out of this is that the economy is expanding. Two minutes of gazing at the stats shows the opposite. Manufacturing should rally from September through February as part of the seasonal cycle. To have December choke is a very negative indicator.</p><p>Here’s an excerpt of my daily note to clients: <i>Our longer-term bearish outlook on industrial natural gas demand continues after the Federal Reserve release today of industrial capacity utilization. The number rose from 71.5 in November (revised down) to 72. The optimists out there will tell you that 72% is the highest in a year. We’ll tell you that seasonality plays a part in that, manufacturing usually increases through February’s end. We’re also quick to point out that we were at 72.7 in December a year ago… and the economy was abysmal a year ago — we’re currently trailing even that. Even more disappointing is the fact that some industrial plants have permanently shuttered. That creates a smaller denominator in the capacity calculation and an appearance of greater growth than was really there.  A 7% annualized growth rate for Q409? That’s great. But annual output dropped 9.7%, the worst slide since 1946 when the WWII defense machine relaxed.</i></p><p>The real kicker to the report comes from the Fed itself: Industrial production increased 0.6 percent in December. The gain primarily resulted from an increase of 5.9 percent in electric and gas utilities due to unseasonably cold weather. Manufacturing production edged down 0.1 percent, while the output of mines rose 0.2 percent. That’s right. They’re telling you that manufacturing was down, but the number went up on utility output of energy. What does the media take away from this? An actual headline: “Industrial output rises for 6th month in a row.” That is a fact. A fact that smells like horse manure when you consider the implications on present industrial natural gas consumption.</p></blockquote><p>Being a complete amateur when it comes to this sort of sector analysis, I find it very interesting that the professional opinion happens to coincide rather closely with my take on the overall economy.  The numbers just seem to keep getting curiouser and curiouser….</p></div>",
  "content_text": "A professional energy analyst shares his professional perspective, which is an excerpt from a note he sends to their clients:\nHave you seen the report today? All the media sees out of this is that the economy is expanding. Two minutes of gazing at the stats shows the opposite. Manufacturing should rally from September through February as part of the seasonal cycle. To have December choke is a very negative indicator.\nHere’s an excerpt of my daily note to clients:\nOur longer-term bearish outlook on industrial natural gas demand continues after the Federal Reserve release today of industrial capacity utilization. The number rose from 71.5 in November (revised down) to 72. The optimists out there will tell you that 72% is the highest in a year. We’ll tell you that seasonality plays a part in that, manufacturing usually increases through February’s end. We’re also quick to point out that we were at 72.7 in December a year ago… and the economy was abysmal a year ago — we’re currently trailing even that. Even more disappointing is the fact that some industrial plants have permanently shuttered. That creates a smaller denominator in the capacity calculation and an appearance of greater growth than was really there.  A 7% annualized growth rate for Q409? That’s great. But annual output dropped 9.7%, the worst slide since 1946 when the WWII defense machine relaxed.\nThe real kicker to the report comes from the Fed itself: Industrial production increased 0.6 percent in December. The gain primarily resulted from an increase of 5.9 percent in electric and gas utilities due to unseasonably cold weather. Manufacturing production edged down 0.1 percent, while the output of mines rose 0.2 percent. That’s right. They’re telling you that manufacturing was down, but the number went up on utility output of energy. What does the media take away from this? An actual headline: “Industrial output rises for 6th month in a row.” That is a fact. A fact that smells like horse manure when you consider the implications on present industrial natural gas consumption.\nBeing a complete amateur when it comes to this sort of sector analysis, I find it very interesting that the professional opinion happens to coincide rather closely with my take on the overall economy.  The numbers just seem to keep getting curiouser and curiouser….",
  "tags": [
    "economics"
  ],
  "categories": [],
  "sitemap_lastmod": "2010-01-26T17:39:00+00:00"
}