{
  "url": "https://voxday.net/2010/01/10/mailvox-sam-harris-and-lost-sheep/",
  "scraped_at": "2026-01-08T23:16:39.136247",
  "title": "Mailvox: Sam Harris and the lost sheep",
  "date_display": "January 10, 2010",
  "date_iso": "2010-01-10T10:40:00+00:00",
  "date_from_url": "2010-01-10",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>In which a skeptic’s email is quoted:</p><blockquote><p>I’ve written you before as a skeptic.  Remember the topic about Sam Harris? I was a college student who lost his faith after reading Harris and reading atheist blogs.  Actually, I had been skeptical for some time before that, as some of you pointed out.  I have now graduated with a Master’s….  Anyway, last November I found Christ.  Before I was probably merely a nominal Christian. I thought I had to believe, not that I wanted to, to get into Heaven. But that’s all over. I had a personal experience after reading Darin Hufford’s book <i>The Misunderstood God</i>. I followed his instructions, and I felt Christ enter my life. My relationship with Christ has since deepened.</p></blockquote><p>It should come as no surprise that the spurious reasoning offered by the New Atheists holds an amount of appeal to nominal Christians who have been taught to hide from their doubts rather than to embrace and examine them.  Those who are not taught to think critically about the Christian faith, but are merely raised in it, are always going to be susceptible to the sophistry and faux rationality of the Sam Harrises of the world.  A license to do evil without ramifications or remorse is always going to be tempting no matter how shallow the justifications for it happen to be.  And Heaven is a very long way off in the eyes of the young, especially when more immediate earthly paradises are there for the taking.</p><p>Anyhow, I’m pleased to hear that another wayward sheep has elected to return to the Good Shepherd.  No doubt his faith will be all the stronger for experience of indulging his doubts.  Believing in belief is no substitute for actually possessing it.</p></div>",
  "content_text": "In which a skeptic’s email is quoted:\nI’ve written you before as a skeptic.  Remember the topic about Sam Harris? I was a college student who lost his faith after reading Harris and reading atheist blogs.  Actually, I had been skeptical for some time before that, as some of you pointed out.  I have now graduated with a Master’s….  Anyway, last November I found Christ.  Before I was probably merely a nominal Christian. I thought I had to believe, not that I wanted to, to get into Heaven. But that’s all over. I had a personal experience after reading Darin Hufford’s book\nThe Misunderstood God\n. I followed his instructions, and I felt Christ enter my life. My relationship with Christ has since deepened.\nIt should come as no surprise that the spurious reasoning offered by the New Atheists holds an amount of appeal to nominal Christians who have been taught to hide from their doubts rather than to embrace and examine them.  Those who are not taught to think critically about the Christian faith, but are merely raised in it, are always going to be susceptible to the sophistry and faux rationality of the Sam Harrises of the world.  A license to do evil without ramifications or remorse is always going to be tempting no matter how shallow the justifications for it happen to be.  And Heaven is a very long way off in the eyes of the young, especially when more immediate earthly paradises are there for the taking.\nAnyhow, I’m pleased to hear that another wayward sheep has elected to return to the Good Shepherd.  No doubt his faith will be all the stronger for experience of indulging his doubts.  Believing in belief is no substitute for actually possessing it.",
  "tags": [
    "Christianity"
  ],
  "categories": [],
  "sitemap_lastmod": "2010-01-10T10:40:00+00:00"
}