{
  "url": "https://voxday.net/2010/01/18/mailvox-dont-give-up-on-haiti/",
  "scraped_at": "2026-01-08T23:17:17.659747",
  "title": "Mailvox: don’t give up on Haiti",
  "date_display": "January 18, 2010",
  "date_iso": "2010-01-18T15:48:00+00:00",
  "date_from_url": "2010-01-18",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>RK writes in response to my column today:</p><blockquote><p>I agree and disagree with you at the same time. Sending only money to Haiti is useless and a complete waste because of the corrupt and inept government. However, sending people into Haiti who can help them help themselves is extremely effective. Our church has been working in rural areas for many years. We’ve set up vocational schools and have trained Haitian mothers how to sew items to sell while staying at home to raise their family. Along the way, we’ve set up several small orphanages for children who had no hope. With training they can become very productive citizens in their area.</p><p>This is just a very small area, so most of Haiti is not touched by this work. However, to them, it is a tremendous help.  As followers of Christ we must be good stewards of our resources, so we should not blindly send them money. However, we must give them a way out of poverty by teaching them how to use whatever talents and resources the Lord has given them.  This is much more difficult that just “sending money”, but it is what our Lord would have us do. Please don’t give up on the Haitians. Each one is a soul that Christ died for.</p></blockquote><p>Give up on the Haitians?  I can honestly say that I have never, ever given a moment’s thought to the Haitians one way or another.  I don’t believe that 99.99 percent of the people now professing great concern about Haiti have either, and I’m confident that 99.98 percent of them won’t have a single thought about Haiti flicker past their consciousness six months from now.  But I’m glad that there are those, like RK, who think otherwise.</p><p>I also think it’s great that the five men of Rubicon Rescue have taken it upon themselves <a href=\"http://www.blackfive.net/main/2010/01/rescue-mission.html\">to bring medical assistance to Haiti</a>.  That’s the only sort of help that means anything; it should be totally obvious that monetary contributions are nothing but self-congratulation considering that the various governments of the world are now making noises about injecting $1 billion into <s>keeping the people of Haiti dependent</s>saving the people of Haiti from themselves.</p><p>To me, the Help Haiti business is little more than another example of food rotting on the docks so third-world gangsters can enrich themselves as celebrities preen, musicians write ridiculous songs, and the mindless masses salve their momentarily guilty consciences.  And if you are convinced that money is the answer, then you should note that my suggested solution would provide the people of Haiti with far more money than anything proposed by even the most bleeding-heart aid activist and it wouldn’t cost the taxpayers a dime.</p><p>I’m a little amazed that people who want to help Haiti would see fit to criticize me when I’ve come up with a solution that would provide the people of Haiti with 10x more money than all the aid provided by the international community combined.  If Haiti needs money, why would you oppose my Haitian Taxation scheme?  Aren’t all the 10 million Haitians more important than a few thousand Goldman Sachs employees?  Why do you hate the people of Haiti, why?</p></div>",
  "content_text": "RK writes in response to my column today:\nI agree and disagree with you at the same time. Sending only money to Haiti is useless and a complete waste because of the corrupt and inept government. However, sending people into Haiti who can help them help themselves is extremely effective. Our church has been working in rural areas for many years. We’ve set up vocational schools and have trained Haitian mothers how to sew items to sell while staying at home to raise their family. Along the way, we’ve set up several small orphanages for children who had no hope. With training they can become very productive citizens in their area.\nThis is just a very small area, so most of Haiti is not touched by this work. However, to them, it is a tremendous help.  As followers of Christ we must be good stewards of our resources, so we should not blindly send them money. However, we must give them a way out of poverty by teaching them how to use whatever talents and resources the Lord has given them.  This is much more difficult that just “sending money”, but it is what our Lord would have us do. Please don’t give up on the Haitians. Each one is a soul that Christ died for.\nGive up on the Haitians?  I can honestly say that I have never, ever given a moment’s thought to the Haitians one way or another.  I don’t believe that 99.99 percent of the people now professing great concern about Haiti have either, and I’m confident that 99.98 percent of them won’t have a single thought about Haiti flicker past their consciousness six months from now.  But I’m glad that there are those, like RK, who think otherwise.\nI also think it’s great that the five men of Rubicon Rescue have taken it upon themselves\nto bring medical assistance to Haiti\n.  That’s the only sort of help that means anything; it should be totally obvious that monetary contributions are nothing but self-congratulation considering that the various governments of the world are now making noises about injecting $1 billion into\nkeeping the people of Haiti dependent\nsaving the people of Haiti from themselves.\nTo me, the Help Haiti business is little more than another example of food rotting on the docks so third-world gangsters can enrich themselves as celebrities preen, musicians write ridiculous songs, and the mindless masses salve their momentarily guilty consciences.  And if you are convinced that money is the answer, then you should note that my suggested solution would provide the people of Haiti with far more money than anything proposed by even the most bleeding-heart aid activist and it wouldn’t cost the taxpayers a dime.\nI’m a little amazed that people who want to help Haiti would see fit to criticize me when I’ve come up with a solution that would provide the people of Haiti with 10x more money than all the aid provided by the international community combined.  If Haiti needs money, why would you oppose my Haitian Taxation scheme?  Aren’t all the 10 million Haitians more important than a few thousand Goldman Sachs employees?  Why do you hate the people of Haiti, why?",
  "tags": [
    "WND"
  ],
  "categories": [],
  "sitemap_lastmod": "2010-01-18T15:48:00+00:00"
}