{
  "url": "https://voxday.net/2010/01/15/mailvox-atheist-economist-considers-tia_15/",
  "scraped_at": "2026-01-08T23:17:03.000693",
  "title": "Mailvox: an atheist economist considers TIA part II",
  "date_display": "January 15, 2010",
  "date_iso": "2010-01-15T09:58:00+00:00",
  "date_from_url": "2010-01-15",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>In which I reply to the remaining portion of <a href=\"http://www.milobookclub.com/2010/01/08/mailvox-atheist-economist-considers-tia/\">SS’s email from last week</a>:</p><blockquote><p>6) Your point about the way in which atheists construct our systems of morality is well made, and I take your argument about “moral parasitism” without offence. I am yet to be fully convinced, however- though I agree with both you and John Locke that atheists have a very hard time trying to prove that we are “moral”. (Given the awful record of atheists with political power, I think we’ve got a long way to go.) I think that the remarkable similarities that are found in the moral systems of various religions and civilisations demonstrates that it is possible for morality to “evolve”. This is not to say that all moral systems are equally acceptable. Suffice to say that I think I have a lot more reading to do in this area before I can fully agree or disagree with your argument.</p><p>7) I found your explanation of various aspects of Christian philosophy to be very enlightening. I was particularly interested to find out that Christians embrace the concept (at least in theory) of “many gods, one God”. It is the same in my country, where Indian Hindus see no contradiction whatsoever between offering alms to one of the millions of Vedic deities, and worshipping a unified Divine Power. The King James Bible is on my reading list and I’ll get around to it eventually; I think it’s past time to find out more about what the Bible actually says, instead of what the New Atheists think it says.</p><p>8) In your comments about omniderigence, I found myself wondering if Christian philosophy allows for a flawed Creator? If I understood your book, you do not believe in an omniderigent God. If God exists and is omniderigent, and is therefore capable of both good and evil, would this not obviate the need for Satan in Christian theology? (I think you may have already addressed this in a previous post; I’m just curious about your particular point of view on the subject.)</p><p>9) I liked your arguments about the hands-off “designer God” very much. It’s a concept that I’ve been thinking about for some time, and it seems no more or less silly than the “infinite Multiverses” idea. Since we have no idea (yet) about what exactly happened at the moment of the Big Bang, it’s as good a theory as any. I’m not personally convinced by the Designer God argument, but then the alternatives aren’t all that convincing either.</p><p>10) I’m curious about your arguments against evolution by natural selection. From what I’ve read of your blog posts, you don’t seem terribly enamoured of Creationism, but you slam TENS regularly. Is there room for any form of evolutionary theory in your view? I’m not trying to defend or oppose Darwinian natural selection; I’d like to know more about the theory’s weaknesses before coming to any conclusions. I just don’t know enough at this point to make a valid argument either way.</p><p>11) Your comments about Islam in the book dovetail very well with what I’ve been reading of late. I think atheists make some serious errors of judgement by attacking only Judaism and Christianity; as my own people have found out from very painful past experience, Islam isn’t exactly a friendly religion, and in many ways was less friendly to us than the Anglican British who invaded and conquered my country. If we atheists are going to attack religion, let’s do it consistently- and let’s attack religions on the basis of their merits alone.</p><p>12) What news of the Rational Response Squad’s work on refuting your arguments?</p><p>In conclusion, I’d like to thank you for providing some very good answers to some very important questions that I’ve been asking of myself for some time. After reading your book, I think I have a much better understanding of Christian theology in particular. I also think I have a lot more reading to do, which I generally regard as a Good Thing. And I will be looking with a great deal more scepticism at the arguments made by the New Atheists in the future. Thank you again for writing a most interesting and useful book; I look forward to reading more of your work in the future.</p></blockquote><p>6) I think “atheist morality” is a misnomer in that there is no such thing as an atheist moral system there is only the opinions of individual atheists about other people’s moral and ethical systems.  As for those moral and ethical systems, I think the similarities between the Christian systems and non-Christian systems are grossly exaggerated.  For example, despite all of the hysterical reactions to my apparently infamous column on historical attitudes towards rape, not a single person even attempted to argue with the substantive point I made.  So, color me dubious about the concept of moral evolution, which is a misleading concept anyhow.  What is the moral equivalent of the species, the beneficial mutation, or the allele?</p><p>7) I have never understood the common Christian inability to understand that other gods exist, but are not to be worshipped.  While I am aware of the tendency of Christians to cry “metaphor” every time a Biblical concept unsettles their assumptions, there is nothing inherently metaphorical about the statement “thou shalt have no other god before Me”; the obvious implication is that there are other gods.</p><p>8) Flawed by which standard?  God is, by many human standards, flawed.  Just ask Christopher Hitchens, who correctly observes that a human engaging in the various activities described in both the Old and New Testaments would be more than a little indictable by many human legal systems.  I don’t recall reading of Mary consenting to an ex vitro fertilization procedure, after all.  But this does not mean that He is flawed by the relevant standard, which is His.  It is almost a tautology to say that God is perfect, in that He is the Creator and therefore the definition of perfection would change according to His will.  So, to me the idea of a “flawed Creator” is essentially a contradiction in terms.</p><p>9) I would argue that it is markedly less silly.  To me, the logic and evidence of God’s design, and designed purpose, is almost inescapable.  I am always amused by those, like Richard Dawkins, who genuinely believe that flaws, perceived or real, somehow indicate an absence of design.  They quite clearly have never been witness or a participant in a technology design and development process.  Above all, keep in mind that you cannot correctly identify a supposed flaw <i>unless you know the designer’s intent.</i> The game designer can easily make a character in the game he designs immortal and impervious to harm.  Why doesn’t he?  Because it does not serve his purpose.</p><p>10) Despite the fervent denials of Young Earth Creationists and Darwinians alike, is plenty of room for evolution and creationism to coexist.  Just ask the Pope.  The core of my skepticism regarding Darwinian theory is that it is based on a logical concept that has not been sufficiently tested via science, the predictive and explanatory models it produces are either uselessly broad or wildly inaccurate, and the supporting evidence cited for it is reliably false.  Time will tell, but I expect genetic science to eventually cast aside the remaining tatters of Darwin’s long-outdated theory.  There’s very little left of Darwin’s original theory in the current synthesis, and much of what remains actually predated him. <i>E Conchis Omnia</i>, n’est-ce pas?</p><p>11) If secular humanists were one-tenth as rational as they like to think they are, they would be begging Christians to ally with them against a return to pre-Christian paganism.  But for the most part they’re not rational, they’re shallow hedonists, anti-Christian reactionaries, scienthological romantics, and larval-stage pagans.  Regardless, SS is correct.  Every idea and every belief system must stand or fall on its own merits.</p><p>12) It would appear Mount Chapter Four has claimed another victim.  My understanding is that Kelly is presently <i>hors de combat</i>.</p><p>SS is, of course, quite welcome and I appreciate his comments.  I’m pleased that he thought well of the book despite his atheism, and I was even more pleased to learn that it has inspired him to delve further into these philosophical and theological matters.  The primary conclusion I have reached after two years of intellectual dispute on this subject is that the vast majority of Christians and atheists alike would do well to read more, think more, and opine less.  The truth is nothing more or less than what it happens to be, and not a single one of us properly groks the elephant.  I’m merely hoping that I’m not the one with his head up the elephant’s rectum.</p></div>",
  "content_text": "In which I reply to the remaining portion of\nSS’s email from last week\n:\n6) Your point about the way in which atheists construct our systems of morality is well made, and I take your argument about “moral parasitism” without offence. I am yet to be fully convinced, however- though I agree with both you and John Locke that atheists have a very hard time trying to prove that we are “moral”. (Given the awful record of atheists with political power, I think we’ve got a long way to go.) I think that the remarkable similarities that are found in the moral systems of various religions and civilisations demonstrates that it is possible for morality to “evolve”. This is not to say that all moral systems are equally acceptable. Suffice to say that I think I have a lot more reading to do in this area before I can fully agree or disagree with your argument.\n7) I found your explanation of various aspects of Christian philosophy to be very enlightening. I was particularly interested to find out that Christians embrace the concept (at least in theory) of “many gods, one God”. It is the same in my country, where Indian Hindus see no contradiction whatsoever between offering alms to one of the millions of Vedic deities, and worshipping a unified Divine Power. The King James Bible is on my reading list and I’ll get around to it eventually; I think it’s past time to find out more about what the Bible actually says, instead of what the New Atheists think it says.\n8) In your comments about omniderigence, I found myself wondering if Christian philosophy allows for a flawed Creator? If I understood your book, you do not believe in an omniderigent God. If God exists and is omniderigent, and is therefore capable of both good and evil, would this not obviate the need for Satan in Christian theology? (I think you may have already addressed this in a previous post; I’m just curious about your particular point of view on the subject.)\n9) I liked your arguments about the hands-off “designer God” very much. It’s a concept that I’ve been thinking about for some time, and it seems no more or less silly than the “infinite Multiverses” idea. Since we have no idea (yet) about what exactly happened at the moment of the Big Bang, it’s as good a theory as any. I’m not personally convinced by the Designer God argument, but then the alternatives aren’t all that convincing either.\n10) I’m curious about your arguments against evolution by natural selection. From what I’ve read of your blog posts, you don’t seem terribly enamoured of Creationism, but you slam TENS regularly. Is there room for any form of evolutionary theory in your view? I’m not trying to defend or oppose Darwinian natural selection; I’d like to know more about the theory’s weaknesses before coming to any conclusions. I just don’t know enough at this point to make a valid argument either way.\n11) Your comments about Islam in the book dovetail very well with what I’ve been reading of late. I think atheists make some serious errors of judgement by attacking only Judaism and Christianity; as my own people have found out from very painful past experience, Islam isn’t exactly a friendly religion, and in many ways was less friendly to us than the Anglican British who invaded and conquered my country. If we atheists are going to attack religion, let’s do it consistently- and let’s attack religions on the basis of their merits alone.\n12) What news of the Rational Response Squad’s work on refuting your arguments?\nIn conclusion, I’d like to thank you for providing some very good answers to some very important questions that I’ve been asking of myself for some time. After reading your book, I think I have a much better understanding of Christian theology in particular. I also think I have a lot more reading to do, which I generally regard as a Good Thing. And I will be looking with a great deal more scepticism at the arguments made by the New Atheists in the future. Thank you again for writing a most interesting and useful book; I look forward to reading more of your work in the future.\n6) I think “atheist morality” is a misnomer in that there is no such thing as an atheist moral system there is only the opinions of individual atheists about other people’s moral and ethical systems.  As for those moral and ethical systems, I think the similarities between the Christian systems and non-Christian systems are grossly exaggerated.  For example, despite all of the hysterical reactions to my apparently infamous column on historical attitudes towards rape, not a single person even attempted to argue with the substantive point I made.  So, color me dubious about the concept of moral evolution, which is a misleading concept anyhow.  What is the moral equivalent of the species, the beneficial mutation, or the allele?\n7) I have never understood the common Christian inability to understand that other gods exist, but are not to be worshipped.  While I am aware of the tendency of Christians to cry “metaphor” every time a Biblical concept unsettles their assumptions, there is nothing inherently metaphorical about the statement “thou shalt have no other god before Me”; the obvious implication is that there are other gods.\n8) Flawed by which standard?  God is, by many human standards, flawed.  Just ask Christopher Hitchens, who correctly observes that a human engaging in the various activities described in both the Old and New Testaments would be more than a little indictable by many human legal systems.  I don’t recall reading of Mary consenting to an ex vitro fertilization procedure, after all.  But this does not mean that He is flawed by the relevant standard, which is His.  It is almost a tautology to say that God is perfect, in that He is the Creator and therefore the definition of perfection would change according to His will.  So, to me the idea of a “flawed Creator” is essentially a contradiction in terms.\n9) I would argue that it is markedly less silly.  To me, the logic and evidence of God’s design, and designed purpose, is almost inescapable.  I am always amused by those, like Richard Dawkins, who genuinely believe that flaws, perceived or real, somehow indicate an absence of design.  They quite clearly have never been witness or a participant in a technology design and development process.  Above all, keep in mind that you cannot correctly identify a supposed flaw\nunless you know the designer’s intent.\nThe game designer can easily make a character in the game he designs immortal and impervious to harm.  Why doesn’t he?  Because it does not serve his purpose.\n10) Despite the fervent denials of Young Earth Creationists and Darwinians alike, is plenty of room for evolution and creationism to coexist.  Just ask the Pope.  The core of my skepticism regarding Darwinian theory is that it is based on a logical concept that has not been sufficiently tested via science, the predictive and explanatory models it produces are either uselessly broad or wildly inaccurate, and the supporting evidence cited for it is reliably false.  Time will tell, but I expect genetic science to eventually cast aside the remaining tatters of Darwin’s long-outdated theory.  There’s very little left of Darwin’s original theory in the current synthesis, and much of what remains actually predated him.\nE Conchis Omnia\n, n’est-ce pas?\n11) If secular humanists were one-tenth as rational as they like to think they are, they would be begging Christians to ally with them against a return to pre-Christian paganism.  But for the most part they’re not rational, they’re shallow hedonists, anti-Christian reactionaries, scienthological romantics, and larval-stage pagans.  Regardless, SS is correct.  Every idea and every belief system must stand or fall on its own merits.\n12) It would appear Mount Chapter Four has claimed another victim.  My understanding is that Kelly is presently\nhors de combat\n.\nSS is, of course, quite welcome and I appreciate his comments.  I’m pleased that he thought well of the book despite his atheism, and I was even more pleased to learn that it has inspired him to delve further into these philosophical and theological matters.  The primary conclusion I have reached after two years of intellectual dispute on this subject is that the vast majority of Christians and atheists alike would do well to read more, think more, and opine less.  The truth is nothing more or less than what it happens to be, and not a single one of us properly groks the elephant.  I’m merely hoping that I’m not the one with his head up the elephant’s rectum.",
  "tags": [
    "atheism"
  ],
  "categories": [],
  "sitemap_lastmod": "2010-01-15T09:58:00+00:00"
}