{
  "url": "https://voxday.net/2010/01/08/mailvox-atheist-economist-considers-tia/",
  "scraped_at": "2026-01-08T23:16:30.003386",
  "title": "Mailvox: an atheist economist considers TIA",
  "date_display": "January 8, 2010",
  "date_iso": "2010-01-08T18:30:00+00:00",
  "date_from_url": "2010-01-08",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>SS writes back:</p><blockquote><p>Thank you for taking the time to answer <a href=\"http://www.milobookclub.com/2009/12/24/mailvox-from-rgd-to-tia/\">my last email</a> in considerable length on your blog. I wrote with questions about your latest book and professed an interest in reading The Irrational Atheist at some later date. I managed to finish it on a long flight back to the US a few days ago, and after a few days to think about it, I think you wrote a very good book that ought to be required reading for any atheist wanting to take on religion and especially Christianity.</p><p>While I can’t speak for the reactions of most atheists, I hope you won’t mind if I make a few observations and ask a few questions of my own.</p><p>(1) I think your tripartite criticism of the Dawkins-Harris-Hitchens group was both reasonable and accurate. I haven’t read either of Harris’s books (and have no intentions of doing so), and have been greatly underwhelmed by some of Hitchens’s public debates with people who actually know what they are talking about. I was not particularly convinced by Dawkins’s book either, but I didn’t quite realise how little he actually knows about religion until I read your dissection of his book.</p><p>(2) I particularly liked your division of atheism and atheists into the High Church and Low Church varieties. I started out as what you call a High Church atheist, but as my political beliefs changed to a more libertarian bent I found myself repulsed by just how militant many atheists- particularly the European variety- have become. In a recent interview with PJTV, author David Berlinski called atheism an “adolescent” view, and I think he’s got a point. If atheists really want to build a coherent argument, we have to stop sounding like a bunch of stroppy teenagers. I think your book makes this point very effectively.</p><p>(3) I am curious, though: why is it that in your chapter regarding the perceived Christian misdeeds of the past, you have excluded the Spanish conquest of the Americas, or the forceful introduction of Christianity into Scandinavia? If I understand your writing correctly, you argue that one should not judge a religion by its followers, and vice versa. But I think your argument would have been greatly strengthened by looking at one or both episodes, and at the reactions of the Catholic Church in particular to the grievous misdeeds carried out in its name in Central and South America during the 16th Century. I think that if you had addressed this, your argument would have been nearly airtight.</p><p>(4) Your point regarding the “red hand of atheism” is spot-on. It is an absolute travesty that my fellow atheists rarely, if ever, recognise that atheist Communism and Socialism is responsible for the deaths of tens of millions of innocent people. Since becoming a libertarian a few years ago I’ve been disgusted by the apologies made by atheists for the horrific abuses of Communism, particularly in China and Russia, and it is completely unacceptable that atheists cannot recognise their culpability in promoting an essentially evil view of government. Until we repudiate the hedonistic and left-wing philosophies that pass for considered thought among the New Atheists, we do not deserve to be taken seriously in questions of morality and government.</p><p>(5) Your point about the way in which atheists construct our systems of morality is well made, and I take your argument about “moral parasitism” without offence. I am yet to be fully convinced, however- though I agree with both you and John Locke that atheists have a very hard time trying to prove that we are “moral”. (Given the awful record of atheists with political power, I think we’ve got a long way to go.) I think that the remarkable similarities that are found in the moral systems of various religions and civilisations demonstrates that it is possible for morality to “evolve”. This is not to say that all moral systems are equally acceptable. Suffice to say that I think I have a lot more reading to do in this area before I can fully agree or disagree with your argument.</p></blockquote><p>In his email, SS also informed me that my surmise was correct and he is an LSE guy.  Which is unsurprising, given that he is obviously more intelligent than the run-of-the-mill Dawkinsian atheist – it’s interesting to see the very different way TIA is viewed when seen from the perspective of someone who has come to it by way of RGD.  I suspect economists will tend to be a little more open-minded than either physicists or biologists on average due to the speed with which the orthodox scientific consensus is regularly shown to be inadequate.  This makes it much more difficult to shut off one’s brain and accept a doxastic division of labor based on credentialed authority.  SS wrote later in his email: “Four years later, I’m convinced that the economic theory I learned is nearly useless.  Maths, though, was great fun- and rather more useful.”  He actually has 11 points, so I’ll address the first five today and save the rest for next week.</p><p>(1) I think one really has to read at least one of Harris’s books in order to appreciate how reliably awful his reasoning is.  Hitchens, on the other hand, can be skipped because he doesn’t even attempt to make a case.  His book is little more than a series of unconnected anecdotes, declarations, and complaints.</p><p>(2) One of my goals in writing TIA was to embarrass the atheist community into throwing out the likes of Dawkins and Harris in favor of developing a more intelligent, more rational atheism with a broader historical perspective.  This is important; I read an article in a UK paper recently that was calling for an alliance between European Christians and secularists to deal with the rising tide of Islam, and that’s simply never going to happen so long as the atheist community is dominated by the rabid Christian haters.  One of the more remarkable things I’ve noticed about atheists over the last few years is how utterly ignorant of history they tend to be.</p><p>(3)  Since TIA was a response to the various atheist books, not an general Christian apology, I saw no reason to introduce defenses that were outside that context.  The omission of such historical events initially surprised me when I read the books, given their goal of attacking Christianity, until I realized that the New Atheists know virtually nothing about the historical conversion of Northern Europe, the colonization of Central America, or the Belgian atrocities in the Congo.  As anyone who has read <i>Summa Elvetica</i> knows, some of the theological issues surrounding these events are of interest to me, but they weren’t relevant to TIA.</p><p>(4)  Yes, I tend to agree. The transparent attempts of militant atheists to disassociate the historical actions of militant atheists from their known atheism is intellectually shameful.  However, I don’t think the needed repudiation is particularly likely, despite the Randians and Michael Shermer’s pro-Austrian perspective, due to the logical consequences and philosophical implications of godlessness.</p><p>(5) The “remarkable similarities that are found in the moral systems of various religions and civilisations may demonstrate that it is possible for morality to ‘evolve'”.  Or they may indicate that God has written His Law in the human heart and the various divergences from it are to be expected as the result of societies falling away from it to varying degrees.  Or, as I contend, the similarities are not be anywhere nearly as similar as those who don’t study history believe them to be.</p></div>",
  "content_text": "SS writes back:\nThank you for taking the time to answer\nmy last email\nin considerable length on your blog. I wrote with questions about your latest book and professed an interest in reading The Irrational Atheist at some later date. I managed to finish it on a long flight back to the US a few days ago, and after a few days to think about it, I think you wrote a very good book that ought to be required reading for any atheist wanting to take on religion and especially Christianity.\nWhile I can’t speak for the reactions of most atheists, I hope you won’t mind if I make a few observations and ask a few questions of my own.\n(1) I think your tripartite criticism of the Dawkins-Harris-Hitchens group was both reasonable and accurate. I haven’t read either of Harris’s books (and have no intentions of doing so), and have been greatly underwhelmed by some of Hitchens’s public debates with people who actually know what they are talking about. I was not particularly convinced by Dawkins’s book either, but I didn’t quite realise how little he actually knows about religion until I read your dissection of his book.\n(2) I particularly liked your division of atheism and atheists into the High Church and Low Church varieties. I started out as what you call a High Church atheist, but as my political beliefs changed to a more libertarian bent I found myself repulsed by just how militant many atheists- particularly the European variety- have become. In a recent interview with PJTV, author David Berlinski called atheism an “adolescent” view, and I think he’s got a point. If atheists really want to build a coherent argument, we have to stop sounding like a bunch of stroppy teenagers. I think your book makes this point very effectively.\n(3) I am curious, though: why is it that in your chapter regarding the perceived Christian misdeeds of the past, you have excluded the Spanish conquest of the Americas, or the forceful introduction of Christianity into Scandinavia? If I understand your writing correctly, you argue that one should not judge a religion by its followers, and vice versa. But I think your argument would have been greatly strengthened by looking at one or both episodes, and at the reactions of the Catholic Church in particular to the grievous misdeeds carried out in its name in Central and South America during the 16th Century. I think that if you had addressed this, your argument would have been nearly airtight.\n(4) Your point regarding the “red hand of atheism” is spot-on. It is an absolute travesty that my fellow atheists rarely, if ever, recognise that atheist Communism and Socialism is responsible for the deaths of tens of millions of innocent people. Since becoming a libertarian a few years ago I’ve been disgusted by the apologies made by atheists for the horrific abuses of Communism, particularly in China and Russia, and it is completely unacceptable that atheists cannot recognise their culpability in promoting an essentially evil view of government. Until we repudiate the hedonistic and left-wing philosophies that pass for considered thought among the New Atheists, we do not deserve to be taken seriously in questions of morality and government.\n(5) Your point about the way in which atheists construct our systems of morality is well made, and I take your argument about “moral parasitism” without offence. I am yet to be fully convinced, however- though I agree with both you and John Locke that atheists have a very hard time trying to prove that we are “moral”. (Given the awful record of atheists with political power, I think we’ve got a long way to go.) I think that the remarkable similarities that are found in the moral systems of various religions and civilisations demonstrates that it is possible for morality to “evolve”. This is not to say that all moral systems are equally acceptable. Suffice to say that I think I have a lot more reading to do in this area before I can fully agree or disagree with your argument.\nIn his email, SS also informed me that my surmise was correct and he is an LSE guy.  Which is unsurprising, given that he is obviously more intelligent than the run-of-the-mill Dawkinsian atheist – it’s interesting to see the very different way TIA is viewed when seen from the perspective of someone who has come to it by way of RGD.  I suspect economists will tend to be a little more open-minded than either physicists or biologists on average due to the speed with which the orthodox scientific consensus is regularly shown to be inadequate.  This makes it much more difficult to shut off one’s brain and accept a doxastic division of labor based on credentialed authority.  SS wrote later in his email: “Four years later, I’m convinced that the economic theory I learned is nearly useless.  Maths, though, was great fun- and rather more useful.”  He actually has 11 points, so I’ll address the first five today and save the rest for next week.\n(1) I think one really has to read at least one of Harris’s books in order to appreciate how reliably awful his reasoning is.  Hitchens, on the other hand, can be skipped because he doesn’t even attempt to make a case.  His book is little more than a series of unconnected anecdotes, declarations, and complaints.\n(2) One of my goals in writing TIA was to embarrass the atheist community into throwing out the likes of Dawkins and Harris in favor of developing a more intelligent, more rational atheism with a broader historical perspective.  This is important; I read an article in a UK paper recently that was calling for an alliance between European Christians and secularists to deal with the rising tide of Islam, and that’s simply never going to happen so long as the atheist community is dominated by the rabid Christian haters.  One of the more remarkable things I’ve noticed about atheists over the last few years is how utterly ignorant of history they tend to be.\n(3)  Since TIA was a response to the various atheist books, not an general Christian apology, I saw no reason to introduce defenses that were outside that context.  The omission of such historical events initially surprised me when I read the books, given their goal of attacking Christianity, until I realized that the New Atheists know virtually nothing about the historical conversion of Northern Europe, the colonization of Central America, or the Belgian atrocities in the Congo.  As anyone who has read\nSumma Elvetica\nknows, some of the theological issues surrounding these events are of interest to me, but they weren’t relevant to TIA.\n(4)  Yes, I tend to agree. The transparent attempts of militant atheists to disassociate the historical actions of militant atheists from their known atheism is intellectually shameful.  However, I don’t think the needed repudiation is particularly likely, despite the Randians and Michael Shermer’s pro-Austrian perspective, due to the logical consequences and philosophical implications of godlessness.\n(5) The “remarkable similarities that are found in the moral systems of various religions and civilisations may demonstrate that it is possible for morality to ‘evolve'”.  Or they may indicate that God has written His Law in the human heart and the various divergences from it are to be expected as the result of societies falling away from it to varying degrees.  Or, as I contend, the similarities are not be anywhere nearly as similar as those who don’t study history believe them to be.",
  "tags": [
    "atheism"
  ],
  "categories": [],
  "sitemap_lastmod": "2010-01-08T18:30:00+00:00"
}