{
  "url": "https://voxday.net/2010/01/22/mailvox-in-fairness-you-do-prefer-bad/",
  "scraped_at": "2026-01-08T23:17:36.617373",
  "title": "Mailvox: In fairness, you do prefer bad boys",
  "date_display": "January 22, 2010",
  "date_iso": "2010-01-22T17:33:00+00:00",
  "date_from_url": "2010-01-22",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>In which we are amused by feminist complaints about <a href=\"http://melindatankardreist.com.au/2010/01/women-blindfolded-and-gagged-the-latest-in-men%E2%80%99s-fashion-from-roger-david/\">t-shirts expressing improper thoughts of which Women Do Not Approve</a>:</p><blockquote><p>The woman in the ‘Annie Hollywood’ t-shirt  (produced by ‘Blood Is The New Black’) looks as though she has been roughed up. She appears disheveled and exhausted, her image reminiscent of a crime scenes photo. The other two women have a strip across their eyes, suggesting a loss of identity and dehumanisation. Their semi-naked bodies are pimped through a t-shirt.</p><p>The designs are not iconic. They’re not retro (even if adapting a Roxy Music album cover). They’re not art.  What we are seeing here is the glamourising of abuse, the suggestion of sexual aggression, a hint that women want to be treated roughly.</p></blockquote><p>Somehow, I seem to have ended up on an Australian feminist mailing list… I can only suspect Jamie.  But the best part about the email was the comment that accompanied the link: <i>“This is really appalling and deserves attention.  Could they even be charged with inciting violence?  I’d be interested in a legal opinion.”</i></p><p>You can always trust a woman to attempt criminalizing opinions with which she disagrees.  No, you insanely cretinous would-be fascist, those t-shirt makers cannot reasonably “be charged with inciting violence” anymore than the makers of t-shirts featuring Che Guevara and Mao Tse-tung can.  And what did you expect the male reaction would be to the feminist attempt to transform every form of sex that falls short of explicit written consent confirmed by ex post facto notarization by a third party into rape anyway?  If rape has become a joke to men; it is only because women, specifically feminist women, have made it so.  For example, it would take a heart of stone not to find vast amusement in Amynda’s tale of her terrifying “near-rape” experience that involved neither rape nor actual sex.</p><p>It is simply absurd to pretend that no doesn’t often mean yes.  There is an abundance of evidence proving otherwise.  And there’s a word for men who take women at their collective word with regards to matters of sex, romance, and love.  The word is “lonely”.  Or, if you prefer, “loser”.  Women aren’t particularly attracted to nice men who treat them well, they’re primarily attracted to bastards who don’t give a damn about them, who simply want to nail them and nail them hard.</p><p>I don’t agree with everything that Roissy and the players write about Game; I find their interpretation to be a synthetic and subject-limited form of Alpha.  But Roissy is nevertheless dead-on correct with regards to what pushes the average woman’s buttons.*  This, of course, is exactly why a man wearing an “offensive” Roger David t-shirt is much more likely to score than a man wearing a female-approved Take Back the Night one.</p><p>And if you don’t find the tagline “Blood is the New Black” funny, well, there’s clearly something wrong with you.</p><p>* <i>NB: On behalf of women who don’t understand the concept of “average”: yes, we already know and acknowledge that there are women who belong to the statistical minority.  The group in which you personally happen to fall is totally irrelevant to the topic at hand.</i></p></div>",
  "content_text": "In which we are amused by feminist complaints about\nt-shirts expressing improper thoughts of which Women Do Not Approve\n:\nThe woman in the ‘Annie Hollywood’ t-shirt  (produced by ‘Blood Is The New Black’) looks as though she has been roughed up. She appears disheveled and exhausted, her image reminiscent of a crime scenes photo. The other two women have a strip across their eyes, suggesting a loss of identity and dehumanisation. Their semi-naked bodies are pimped through a t-shirt.\nThe designs are not iconic. They’re not retro (even if adapting a Roxy Music album cover). They’re not art.  What we are seeing here is the glamourising of abuse, the suggestion of sexual aggression, a hint that women want to be treated roughly.\nSomehow, I seem to have ended up on an Australian feminist mailing list… I can only suspect Jamie.  But the best part about the email was the comment that accompanied the link:\n“This is really appalling and deserves attention.  Could they even be charged with inciting violence?  I’d be interested in a legal opinion.”\nYou can always trust a woman to attempt criminalizing opinions with which she disagrees.  No, you insanely cretinous would-be fascist, those t-shirt makers cannot reasonably “be charged with inciting violence” anymore than the makers of t-shirts featuring Che Guevara and Mao Tse-tung can.  And what did you expect the male reaction would be to the feminist attempt to transform every form of sex that falls short of explicit written consent confirmed by ex post facto notarization by a third party into rape anyway?  If rape has become a joke to men; it is only because women, specifically feminist women, have made it so.  For example, it would take a heart of stone not to find vast amusement in Amynda’s tale of her terrifying “near-rape” experience that involved neither rape nor actual sex.\nIt is simply absurd to pretend that no doesn’t often mean yes.  There is an abundance of evidence proving otherwise.  And there’s a word for men who take women at their collective word with regards to matters of sex, romance, and love.  The word is “lonely”.  Or, if you prefer, “loser”.  Women aren’t particularly attracted to nice men who treat them well, they’re primarily attracted to bastards who don’t give a damn about them, who simply want to nail them and nail them hard.\nI don’t agree with everything that Roissy and the players write about Game; I find their interpretation to be a synthetic and subject-limited form of Alpha.  But Roissy is nevertheless dead-on correct with regards to what pushes the average woman’s buttons.*  This, of course, is exactly why a man wearing an “offensive” Roger David t-shirt is much more likely to score than a man wearing a female-approved Take Back the Night one.\nAnd if you don’t find the tagline “Blood is the New Black” funny, well, there’s clearly something wrong with you.\n*\nNB: On behalf of women who don’t understand the concept of “average”: yes, we already know and acknowledge that there are women who belong to the statistical minority.  The group in which you personally happen to fall is totally irrelevant to the topic at hand.",
  "tags": [
    "women"
  ],
  "categories": [],
  "sitemap_lastmod": "2010-01-22T17:33:00+00:00"
}