{
  "url": "https://voxday.net/2010/01/08/not-so-fas/",
  "scraped_at": "2026-01-08T23:16:28.189241",
  "title": "Not so fast",
  "date_display": "January 8, 2010",
  "date_iso": "2010-01-08T14:30:00+00:00",
  "date_from_url": "2010-01-08",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>Markku is under the impression that he managed to catch me making a mistake about God’s knowledge of the design imperfections of His Creation.  I think I can demonstrate that this is not correct:</p><blockquote><p><i>“I think Jesus was the fix for a design gone haywire.”</i></p><p>Can’t be.</p><p>1Pe 1:19-20 But with the precious blood of Christ, as of a lamb without blemish and without spot:  Who verily was foreordained before the foundation of the world, but was manifest in these last times for you.</p></blockquote><p>Now, Markku is correct to the extent that the verses make it clear that Jesus cannot have been a fix conceived subsequent to the problem.  However, I think Markku is making a mistake in equating Jesus Christ’s existence and potential mission with the actual sacrifice of his life here.  Since we already knew that the Word was with God from the start, his existence before the foundation of the world isn’t in question from a Biblical perspective.  However, we can also see that the foreordaining does not refer to his “precious blood”, although I agree that the reference is still in the context of him redeeming Man.  This distinction between the potential redemption and fact of the redeeming sacrifice is perhaps more apparent in other translations.</p><p>NIV: <i>For you know that it was not with perishable things such as silver or gold that you were redeemed from the empty way of life handed down to you from your forefathers, but with the precious blood of Christ, a lamb without blemish or defect. He was chosen before the creation of the world, but was revealed in these last times for your sake.</i></p><p>Now, Markku’s interpretation is potentially correct, as it indicates that God was aware from before the beginning of the possible need to send Jesus Christ to redeem Man.  The Redeemer was chosen from the start, but not revealed until later.  But this does not make his interpretation <i>necessarily</i> correct because it is perfectly plausible that God would have understood that Man was capable of falling and had a backup plan prepared in case of such an event.</p><p>As a programmer – a very good programmer, as a matter of fact – Markku is well-equipped to understand the concept of an if/then structure created during the design phase.  So, while these verses from 1st Peter certainly permit his interpretation of a scripted scenario of Fall and Redemption, they fall short of conclusively proving it.  This means that my interpretation of an unscripted scenario remains Biblically tenable and it is possible that Jesus was the predetermined fix for a design with multiple potential outcomes.</p></div>",
  "content_text": "Markku is under the impression that he managed to catch me making a mistake about God’s knowledge of the design imperfections of His Creation.  I think I can demonstrate that this is not correct:\n“I think Jesus was the fix for a design gone haywire.”\nCan’t be.\n1Pe 1:19-20 But with the precious blood of Christ, as of a lamb without blemish and without spot:  Who verily was foreordained before the foundation of the world, but was manifest in these last times for you.\nNow, Markku is correct to the extent that the verses make it clear that Jesus cannot have been a fix conceived subsequent to the problem.  However, I think Markku is making a mistake in equating Jesus Christ’s existence and potential mission with the actual sacrifice of his life here.  Since we already knew that the Word was with God from the start, his existence before the foundation of the world isn’t in question from a Biblical perspective.  However, we can also see that the foreordaining does not refer to his “precious blood”, although I agree that the reference is still in the context of him redeeming Man.  This distinction between the potential redemption and fact of the redeeming sacrifice is perhaps more apparent in other translations.\nNIV:\nFor you know that it was not with perishable things such as silver or gold that you were redeemed from the empty way of life handed down to you from your forefathers, but with the precious blood of Christ, a lamb without blemish or defect. He was chosen before the creation of the world, but was revealed in these last times for your sake.\nNow, Markku’s interpretation is potentially correct, as it indicates that God was aware from before the beginning of the possible need to send Jesus Christ to redeem Man.  The Redeemer was chosen from the start, but not revealed until later.  But this does not make his interpretation\nnecessarily\ncorrect because it is perfectly plausible that God would have understood that Man was capable of falling and had a backup plan prepared in case of such an event.\nAs a programmer – a very good programmer, as a matter of fact – Markku is well-equipped to understand the concept of an if/then structure created during the design phase.  So, while these verses from 1st Peter certainly permit his interpretation of a scripted scenario of Fall and Redemption, they fall short of conclusively proving it.  This means that my interpretation of an unscripted scenario remains Biblically tenable and it is possible that Jesus was the predetermined fix for a design with multiple potential outcomes.",
  "tags": [
    "Christianity"
  ],
  "categories": [],
  "sitemap_lastmod": "2010-01-08T14:30:00+00:00"
}