{
  "url": "https://voxday.net/2010/01/14/rare-mistake/",
  "scraped_at": "2026-01-08T23:16:57.538608",
  "title": "A rare mistake",
  "date_display": "January 14, 2010",
  "date_iso": "2010-01-14T12:30:00+00:00",
  "date_from_url": "2010-01-14",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>By <a href=\"http://profootballtalk.nbcsports.com/2010/01/13/oral-argument-in-american-needle-hints-at-nfls-broader-position/\">the NFL</a>:</p><blockquote><p>The National Football League has been careful not to suggest that the aim of its current effort to obtain a finding that, for the purposes of selling hats and shirts, the 32 teams are a “single entity” that cannot conspire with each other in dealing only with Reebok and shutting out companies like American Needle.  However, the transcript of Wednesday’s oral argument before the Supreme Court suggests that, if push comes to shove, chief NFL outside counsel Gregg Levy (a finalist for the position of Commissioner in 2006) believes that the league is a single entity, for all of its relevant business purposes.</p><p>The key moment in the exchange between Levy and the Court comes at page 47 of the transcript, when Justice Sonia Sotomayor poses this question to Levy:  “What decision could the sports teams make that would be subject to the antitrust scrutiny under your definition of the permissible range of the joint venture activities?  It seems to me that if the venture wanted to make sure all the teams hired secretaries at the same $1,000-a-year salary, that under your theory, that’s okay, because it’s a joint venture.”</p><p>In response, Levy didn’t say, “We are taking that position only as to matters relating to the promotion of the league,” which is what he basically said in the NFL’s written brief.    Instead, Levy said, “Your Honor, my view is that the — the NFL clubs are not separate sources of independent power.  As a result, they are a unit.  They are a single entity and it’s –“</p><p>At that point, Justice Sotomayor cut him off.</p><p>“So to the answer to my question is, there is — you are seeking through this ruling what you haven’t gotten from Congress:  An absolute bar to the antitrust claim.”</p></blockquote><p>Perhaps the Wise Latina isn’t quite as dim as I’d expected her to be.  And if the NFL is seriously attempting to parlay its antitrust exemption for <i>broadcasting</i> into a broader one covering everything from player salaries to logo gear, it is insane.  As an NFL fan, I’m hoping this does not turn out to be yet another example of an extremely successful organization sowing the seeds of its own destruction through foolish greed and overweening arrogance.</p><p>If I were an NFL owner, I would pull Levy off the case immediately.  And it’s worth noting that when it serves the NFL’s interest to argue the contrary, it claims precisely the opposite:</p><p><i>“The question is whether Minnesota law permits Pat and Kevin Williams to be suspended for a first positive test, and whether Minnesota law allows punishment to be imposed on an employee who uses an over-the-counter substance on his own time.  Among the league’s arguments is that the Vikings, not the NFL, employ the players.”</i></p></div>",
  "content_text": "By\nthe NFL\n:\nThe National Football League has been careful not to suggest that the aim of its current effort to obtain a finding that, for the purposes of selling hats and shirts, the 32 teams are a “single entity” that cannot conspire with each other in dealing only with Reebok and shutting out companies like American Needle.  However, the transcript of Wednesday’s oral argument before the Supreme Court suggests that, if push comes to shove, chief NFL outside counsel Gregg Levy (a finalist for the position of Commissioner in 2006) believes that the league is a single entity, for all of its relevant business purposes.\nThe key moment in the exchange between Levy and the Court comes at page 47 of the transcript, when Justice Sonia Sotomayor poses this question to Levy:  “What decision could the sports teams make that would be subject to the antitrust scrutiny under your definition of the permissible range of the joint venture activities?  It seems to me that if the venture wanted to make sure all the teams hired secretaries at the same $1,000-a-year salary, that under your theory, that’s okay, because it’s a joint venture.”\nIn response, Levy didn’t say, “We are taking that position only as to matters relating to the promotion of the league,” which is what he basically said in the NFL’s written brief.    Instead, Levy said, “Your Honor, my view is that the — the NFL clubs are not separate sources of independent power.  As a result, they are a unit.  They are a single entity and it’s –“\nAt that point, Justice Sotomayor cut him off.\n“So to the answer to my question is, there is — you are seeking through this ruling what you haven’t gotten from Congress:  An absolute bar to the antitrust claim.”\nPerhaps the Wise Latina isn’t quite as dim as I’d expected her to be.  And if the NFL is seriously attempting to parlay its antitrust exemption for\nbroadcasting\ninto a broader one covering everything from player salaries to logo gear, it is insane.  As an NFL fan, I’m hoping this does not turn out to be yet another example of an extremely successful organization sowing the seeds of its own destruction through foolish greed and overweening arrogance.\nIf I were an NFL owner, I would pull Levy off the case immediately.  And it’s worth noting that when it serves the NFL’s interest to argue the contrary, it claims precisely the opposite:\n“The question is whether Minnesota law permits Pat and Kevin Williams to be suspended for a first positive test, and whether Minnesota law allows punishment to be imposed on an employee who uses an over-the-counter substance on his own time.  Among the league’s arguments is that the Vikings, not the NFL, employ the players.”",
  "tags": [
    "sports"
  ],
  "categories": [],
  "sitemap_lastmod": "2010-01-14T12:30:00+00:00"
}