{
  "url": "https://voxday.net/2010/01/08/robbery-by-police/",
  "scraped_at": "2026-01-08T23:16:26.356870",
  "title": "Robbery by police",
  "date_display": "January 8, 2010",
  "date_iso": "2010-01-08T09:23:00+00:00",
  "date_from_url": "2010-01-08",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>Considering that highway robbery is in the job description, I don’t know why we’re supposed to be surprised when the occasional policeman <a href=\"http://www.startribune.com/local/80897097.html\">simply extends the logic</a> one step further:</p><blockquote><p>Minneapolis police officer Timothy Edward Carson’s shift on Wednesday started at 9 a.m. But he wasn’t there.  By the time he told a supervisor he was running late at 9:30, the FBI says, Carson had robbed an Apple Valley bank and was well on his way to getting caught.  Carson, 28, was arrested early Thursday and appeared in federal court Thursday afternoon, charged with bank robbery. More criminal charges are expected to follow; police sources familiar with the investigation say he could be connected to at least a dozen robberies in the metro area over the past two weeks.</p></blockquote><p>In the eyes of the police, his real crime wasn’t robbing banks.  It was robbing banks <i>for his personal benefit</i>.  Police robbery is supposed to be for the benefit of the department and the state, not the individual policeman.  If Carson had simply walked into the bank with his uniform on and arrested the money under the pretense of it being laundered drug money, he’d have won a medal and a bonus.</p></div>",
  "content_text": "Considering that highway robbery is in the job description, I don’t know why we’re supposed to be surprised when the occasional policeman\nsimply extends the logic\none step further:\nMinneapolis police officer Timothy Edward Carson’s shift on Wednesday started at 9 a.m. But he wasn’t there.  By the time he told a supervisor he was running late at 9:30, the FBI says, Carson had robbed an Apple Valley bank and was well on his way to getting caught.  Carson, 28, was arrested early Thursday and appeared in federal court Thursday afternoon, charged with bank robbery. More criminal charges are expected to follow; police sources familiar with the investigation say he could be connected to at least a dozen robberies in the metro area over the past two weeks.\nIn the eyes of the police, his real crime wasn’t robbing banks.  It was robbing banks\nfor his personal benefit\n.  Police robbery is supposed to be for the benefit of the department and the state, not the individual policeman.  If Carson had simply walked into the bank with his uniform on and arrested the money under the pretense of it being laundered drug money, he’d have won a medal and a bonus.",
  "tags": [
    "Americana"
  ],
  "categories": [],
  "sitemap_lastmod": "2010-01-08T09:23:00+00:00"
}