{
  "url": "https://voxday.net/2010/01/29/roissy-and-limits-of-game/",
  "scraped_at": "2026-01-08T23:18:10.285870",
  "title": "Roissy and the limits of Game",
  "date_display": "January 29, 2010",
  "date_iso": "2010-01-29T12:20:00+00:00",
  "date_from_url": "2010-01-29",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>I have a great deal of respect for <a href=\"http://roissy.wordpress.com/2010/01/18/better-a-bold-jerk-than-a-diplomatic-niceguy/\">Roissy’s analysis of the female psyche</a>.  Even the mere terms he applies, in addition to being hilarious, provide tremendous insight for the average, clueless man who finds himself bewildered by the behavior of women around him.  After all, what man could possibly assign much importance to the logical conclusions of a woman’s “rationalization hamster”.  And many of the techniques he recommends will significantly increase the average man’s ability to get off on the right foot with women regardless of whether a casual encounter or marriage is the goal.</p><p>However, it must be kept in mind that Roissy’s social construction of Game is intentionally limited in two ways.  The overly simplistic division of men into Alphas and Betas is the natural result of his laser-like focus on scoring vs not scoring.  Either you score or you don’t score; scoring is Alpha and not-scoring is Beta.  QED. And this singular, binary focus also leaves out the many other applications of the male social hierarchy that have nothing to do with women, much less sex.  Note that this is not a criticism of Roissy’s construct or his conclusions, but rather a tangential expansion of it.  Whereas in Game there are only Alphas who score and Betas who don’t, except for the Betas who learn the secret of becoming synthetic Alphas, I have come over time to view things in the following manner:</p><p>Alphas – the male elite, the leaders of men for whom women naturally lust.  Their mere presence sets women a-tingle regardless of whether she is taken or not.  Once you’ve seen beautiful married women ignoring tall, handsome, wealthy, and even famous men because that ugly old troll Henry Kissinger walked in the room, you simply can’t deny the reality of Alphadom.  Example: Captain Kirk, Big from Sex in the City.  Suggestion: Do you see a scoreboard?  Right, so relax already!</p><p>Betas – the lieutenants, the petty aristocracy.  They’re popular, they do well with women, they’re pretty successful in life, and they may even be exceptionally good-looking.  But they lack the Alpha’s natural self-confidence and strength of character.  They’re not leaders and they’re not the men to whom women are helplessly drawn.  Most men who like to think they’re Alphas because of their success are actually Betas.  Most Betas won’t change their game because they don’t really have any need or reason to do so.  This is probably the easiest social slot in which to find yourself, since the Beta enjoys many of the benefits of Alphadom without being trapped in the Alpha’s endless cycle of competition.  Example: Brad Pitt  Suggestion: Have some compassion for the less naturally fortunate.  Try to include them once in awhile.</p><p>Deltas – the great majority of men.  These are Roissy’s Betas.  Almost all of you reading this are Deltas despite the natural desire to believe that you are a brave and bold Alpha snowflake notwithstanding.  Deal with it.  There’s absolutely nothing wrong with being a Delta, it’s just a simple statistical and observable reality.  The sooner you accept the truth about yourself, the sooner you will be able to control your unconscious inclinations and modify your behavior in a manner that will help you achieve your goals.  I’ve gone out of alphabetical order here because delta symbolizes change, which most Deltas are capable to some extent.  Hence the synthetic alpha instruction set known as Game.  Example: Probably you.  Suggestion: Never forget that there are plenty of girls on the girl tree.</p><p>Gammas – the obsequious ones, the posterior puckerers, the nice guys who attempt to score through white-knighting, faux-chivalry, flattery, and omnipresence.  All men except true Alphas will occasionally fall into Gamma behavior from time to time, this is the behavior and attitude that Roissy is attempting to teach men to recognize and avoid.  The dividing line between a Gamma and a Delta is that the Gamma genuinely believes in the Gamma reality to the very core of his soul whereas the Delta is never truly comfortable with himself when he behaves in this manner despite being thoroughly indoctrinated in it by his culture.  Example: Probably you if you’ve found yourself complaining about your lack of female companionship over the last two years.  Suggestion: Remember that the statement “all are fallen” applies to women too.  She isn’t any more naturally pure or holy or ethereal than you are.</p><p>Lambdas – the gays.  They have their own social hierarchy.  They can fill any role from Alpha to Omega, but they tend to play the part rather than actually be it because the heterosexual social construct only encompasses the public part of their lives.  Example: Neil Patrick Harris.  Suggestion: Straights will be more tolerant if you keep the bathhouse behavior behind closed doors.</p><p>Sigmas – the lone wolves.  Occasionally mistaken for Alphas, particularly by women and Alphas, they are not leaders and will actively resist the attempt of others to draft them.  Alphas instinctively view them as challenges and either dislike or warily respect them.  Some Deltas and most Omegas fancy themselves Sigmas, but the true Sigma’s withdrawal from the pack is not a reaction to the way he is treated, it is pure instinct.  Example: Clint Eastwood’s movie persona.  Suggestion: Entertain the possibility that other people are not always Hell.  The banal idiocy is incidental, it’s not intentional torture.</p><p>Omegas – the losers.  Even the Gamma males despise them.  That which doesn’t kill them can make them stronger, but most never surmount the desperate need to belong caused by their social rejection.  Omegas can be the most dangerous of men because the pain of their constant rejection renders the suffering of others completely meaningless in their eyes.  Omegas tend to cluster in defensive groups; the dividing line between the Omega and the Sigma is twofold and can be easily recognized by a) the behavior of male Betas and Deltas and b) the behavior of women.  Women tend to find outliers attractive in general, but while they respond to  Sigmas almost as strongly as they do to Alphas, they correctly find Omega males creepier and much scarier than Gamma males.  Example: Eric Harris  Suggestion: Your rejection isn’t entirely personal.  Observe the difference in your own behavior and the way the Betas act.  And try not to start off conversations with women by sharing “interesting facts” with them.</p><p>I’m not claiming that this hierarchy is science or incontrovertible fact, it’s merely the lens through which I tend to view the current sexual-social hierarchy.  I think it is a little more broadly useful from a theoretical perspective than the Game construct, even if it is less immediately applicable from a tactical point of view.</p></div>",
  "content_text": "I have a great deal of respect for\nRoissy’s analysis of the female psyche\n.  Even the mere terms he applies, in addition to being hilarious, provide tremendous insight for the average, clueless man who finds himself bewildered by the behavior of women around him.  After all, what man could possibly assign much importance to the logical conclusions of a woman’s “rationalization hamster”.  And many of the techniques he recommends will significantly increase the average man’s ability to get off on the right foot with women regardless of whether a casual encounter or marriage is the goal.\nHowever, it must be kept in mind that Roissy’s social construction of Game is intentionally limited in two ways.  The overly simplistic division of men into Alphas and Betas is the natural result of his laser-like focus on scoring vs not scoring.  Either you score or you don’t score; scoring is Alpha and not-scoring is Beta.  QED. And this singular, binary focus also leaves out the many other applications of the male social hierarchy that have nothing to do with women, much less sex.  Note that this is not a criticism of Roissy’s construct or his conclusions, but rather a tangential expansion of it.  Whereas in Game there are only Alphas who score and Betas who don’t, except for the Betas who learn the secret of becoming synthetic Alphas, I have come over time to view things in the following manner:\nAlphas – the male elite, the leaders of men for whom women naturally lust.  Their mere presence sets women a-tingle regardless of whether she is taken or not.  Once you’ve seen beautiful married women ignoring tall, handsome, wealthy, and even famous men because that ugly old troll Henry Kissinger walked in the room, you simply can’t deny the reality of Alphadom.  Example: Captain Kirk, Big from Sex in the City.  Suggestion: Do you see a scoreboard?  Right, so relax already!\nBetas – the lieutenants, the petty aristocracy.  They’re popular, they do well with women, they’re pretty successful in life, and they may even be exceptionally good-looking.  But they lack the Alpha’s natural self-confidence and strength of character.  They’re not leaders and they’re not the men to whom women are helplessly drawn.  Most men who like to think they’re Alphas because of their success are actually Betas.  Most Betas won’t change their game because they don’t really have any need or reason to do so.  This is probably the easiest social slot in which to find yourself, since the Beta enjoys many of the benefits of Alphadom without being trapped in the Alpha’s endless cycle of competition.  Example: Brad Pitt  Suggestion: Have some compassion for the less naturally fortunate.  Try to include them once in awhile.\nDeltas – the great majority of men.  These are Roissy’s Betas.  Almost all of you reading this are Deltas despite the natural desire to believe that you are a brave and bold Alpha snowflake notwithstanding.  Deal with it.  There’s absolutely nothing wrong with being a Delta, it’s just a simple statistical and observable reality.  The sooner you accept the truth about yourself, the sooner you will be able to control your unconscious inclinations and modify your behavior in a manner that will help you achieve your goals.  I’ve gone out of alphabetical order here because delta symbolizes change, which most Deltas are capable to some extent.  Hence the synthetic alpha instruction set known as Game.  Example: Probably you.  Suggestion: Never forget that there are plenty of girls on the girl tree.\nGammas – the obsequious ones, the posterior puckerers, the nice guys who attempt to score through white-knighting, faux-chivalry, flattery, and omnipresence.  All men except true Alphas will occasionally fall into Gamma behavior from time to time, this is the behavior and attitude that Roissy is attempting to teach men to recognize and avoid.  The dividing line between a Gamma and a Delta is that the Gamma genuinely believes in the Gamma reality to the very core of his soul whereas the Delta is never truly comfortable with himself when he behaves in this manner despite being thoroughly indoctrinated in it by his culture.  Example: Probably you if you’ve found yourself complaining about your lack of female companionship over the last two years.  Suggestion: Remember that the statement “all are fallen” applies to women too.  She isn’t any more naturally pure or holy or ethereal than you are.\nLambdas – the gays.  They have their own social hierarchy.  They can fill any role from Alpha to Omega, but they tend to play the part rather than actually be it because the heterosexual social construct only encompasses the public part of their lives.  Example: Neil Patrick Harris.  Suggestion: Straights will be more tolerant if you keep the bathhouse behavior behind closed doors.\nSigmas – the lone wolves.  Occasionally mistaken for Alphas, particularly by women and Alphas, they are not leaders and will actively resist the attempt of others to draft them.  Alphas instinctively view them as challenges and either dislike or warily respect them.  Some Deltas and most Omegas fancy themselves Sigmas, but the true Sigma’s withdrawal from the pack is not a reaction to the way he is treated, it is pure instinct.  Example: Clint Eastwood’s movie persona.  Suggestion: Entertain the possibility that other people are not always Hell.  The banal idiocy is incidental, it’s not intentional torture.\nOmegas – the losers.  Even the Gamma males despise them.  That which doesn’t kill them can make them stronger, but most never surmount the desperate need to belong caused by their social rejection.  Omegas can be the most dangerous of men because the pain of their constant rejection renders the suffering of others completely meaningless in their eyes.  Omegas tend to cluster in defensive groups; the dividing line between the Omega and the Sigma is twofold and can be easily recognized by a) the behavior of male Betas and Deltas and b) the behavior of women.  Women tend to find outliers attractive in general, but while they respond to  Sigmas almost as strongly as they do to Alphas, they correctly find Omega males creepier and much scarier than Gamma males.  Example: Eric Harris  Suggestion: Your rejection isn’t entirely personal.  Observe the difference in your own behavior and the way the Betas act.  And try not to start off conversations with women by sharing “interesting facts” with them.\nI’m not claiming that this hierarchy is science or incontrovertible fact, it’s merely the lens through which I tend to view the current sexual-social hierarchy.  I think it is a little more broadly useful from a theoretical perspective than the Game construct, even if it is less immediately applicable from a tactical point of view.",
  "tags": [
    "women"
  ],
  "categories": [],
  "sitemap_lastmod": "2010-01-29T12:20:00+00:00"
}