{
  "url": "https://voxday.net/2010/01/27/sex-in-city-vs-science/",
  "scraped_at": "2026-01-08T23:17:59.476809",
  "title": "Sex in the City vs Science",
  "date_display": "January 27, 2010",
  "date_iso": "2010-01-27T09:32:00+00:00",
  "date_from_url": "2010-01-27",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>I found the juxtaposition of these two Telegraph articles to be more than a little amusing.  First is one Becky Pugh expressing an all-too-typical female opinion on the wisdom of settling for a husband rather than <a href=\"http://www.telegraph.co.uk/relationships/7073649/How-long-should-you-hold-out-for-Mr-Right.html?utm_source=telegraph.co.uk&amp;utm_medium=dating&amp;utm_campaign=mrright\">holding out for the Sex in the City dream</a> of a tame Alpha who is chastened by the near-loss of the precious snowflake he almost permitted to get away:</p><blockquote><p>Time and again, Sex and the City’s Carrie Bradshaw could have walked off into the sunset with kind, wholesome Aidan. But she didn’t. Instead, she valiantly endured years of pain while she listened to her instincts and waited for Mr Big. She was right: just look at them now (as far as we know they are living happily ever after, which is where we left them at the end of the first movie).  Like Jane Eyre and Carrie Bradshaw, most women would rather wait for Mr Right, and risk ending up alone, than settle for dependable, passionless Mr Second Best…. it’s easy to see how the temptation to skip down the aisle with Mr He’ll Have To Do Because He Is The Only Impregnator Available To Me is a strong one. But, even so, Gottlieb’s watershed age of 30 is fantastically mean.</p></blockquote><p>I note, with a straight face marred only by the occasional twitch to indicate the degree of silent inner mirth I feel, that Jane Eyre and Carrie Bradshaw are both <i>fictional characters</i> and it <i>just may possibly</i> be sub-optimal for a woman to base her relationship philosophy upon them.  Can you even imagine what women would say if a man wrote a column recommending men to base some of their most significant life decisions on the lifestyle choices of Aquaman and the Green Lantern?   And if she thinks Ms Gottlieb’s watershed age of 30 is “fantastically mean”, one wonders how she’ll describe <a href=\"http://www.telegraph.co.uk/health/healthnews/7079641/Women-lose-90-per-cent-of-eggs-by-30.html\">the latest scientific research on age and fertility</a>.</p><blockquote><p>While they may continue to produce eggs throughout their 30s and 40s, the reservoir of potential eggs from which they are taken has shrunk to almost nothing, it suggests.  As the body chooses the best eggs from the reserve, the likelihood is that the quality of the eggs will suffer as you get older increasing the difficulty of conception and the risk of an unhealthy baby….</p><p>It shows that on average women are born with 300,000 potential egg cells but this pool declines at a much faster rate than first thought.  By the age of 30 there is only 12 per cent left on average and by the age of 40 just three per cent.  Dr Hamish Wallace, the co-author, said: “Our research shows that they are generally over-estimating their fertility prospects.”</p></blockquote><p>If there is one thing that a single woman between the ages of 18-25 badly needs to understand, it is this: <i>there are plenty of girls on the girl tree</i>.  They make new ones every day.  And it probably wouldn’t hurt that single woman to keep in mind that while there will always be men who will be interested in her, the social status and perceived quality of those men will begin to decline drastically somewhere between the age of 25 and 30.  Ask a gamma male; they all know that a woman at 30 is much more in play for them than she was five years before.  In fact, that’s precisely the sort of thing they rely upon in order to land a halfway-attractive woman.</p></div>",
  "content_text": "I found the juxtaposition of these two Telegraph articles to be more than a little amusing.  First is one Becky Pugh expressing an all-too-typical female opinion on the wisdom of settling for a husband rather than\nholding out for the Sex in the City dream\nof a tame Alpha who is chastened by the near-loss of the precious snowflake he almost permitted to get away:\nTime and again, Sex and the City’s Carrie Bradshaw could have walked off into the sunset with kind, wholesome Aidan. But she didn’t. Instead, she valiantly endured years of pain while she listened to her instincts and waited for Mr Big. She was right: just look at them now (as far as we know they are living happily ever after, which is where we left them at the end of the first movie).  Like Jane Eyre and Carrie Bradshaw, most women would rather wait for Mr Right, and risk ending up alone, than settle for dependable, passionless Mr Second Best…. it’s easy to see how the temptation to skip down the aisle with Mr He’ll Have To Do Because He Is The Only Impregnator Available To Me is a strong one. But, even so, Gottlieb’s watershed age of 30 is fantastically mean.\nI note, with a straight face marred only by the occasional twitch to indicate the degree of silent inner mirth I feel, that Jane Eyre and Carrie Bradshaw are both\nfictional characters\nand it\njust may possibly\nbe sub-optimal for a woman to base her relationship philosophy upon them.  Can you even imagine what women would say if a man wrote a column recommending men to base some of their most significant life decisions on the lifestyle choices of Aquaman and the Green Lantern?   And if she thinks Ms Gottlieb’s watershed age of 30 is “fantastically mean”, one wonders how she’ll describe\nthe latest scientific research on age and fertility\n.\nWhile they may continue to produce eggs throughout their 30s and 40s, the reservoir of potential eggs from which they are taken has shrunk to almost nothing, it suggests.  As the body chooses the best eggs from the reserve, the likelihood is that the quality of the eggs will suffer as you get older increasing the difficulty of conception and the risk of an unhealthy baby….\nIt shows that on average women are born with 300,000 potential egg cells but this pool declines at a much faster rate than first thought.  By the age of 30 there is only 12 per cent left on average and by the age of 40 just three per cent.  Dr Hamish Wallace, the co-author, said: “Our research shows that they are generally over-estimating their fertility prospects.”\nIf there is one thing that a single woman between the ages of 18-25 badly needs to understand, it is this:\nthere are plenty of girls on the girl tree\n.  They make new ones every day.  And it probably wouldn’t hurt that single woman to keep in mind that while there will always be men who will be interested in her, the social status and perceived quality of those men will begin to decline drastically somewhere between the age of 25 and 30.  Ask a gamma male; they all know that a woman at 30 is much more in play for them than she was five years before.  In fact, that’s precisely the sort of thing they rely upon in order to land a halfway-attractive woman.",
  "tags": [
    "science",
    "women"
  ],
  "categories": [],
  "sitemap_lastmod": "2010-01-27T09:32:00+00:00"
}