{
  "url": "https://voxday.net/2010/01/25/skol-vikings/",
  "scraped_at": "2026-01-08T23:17:52.143495",
  "title": "I suppose it would hurt if I could still feel anything",
  "date_display": "January 25, 2010",
  "date_iso": "2010-01-25T17:26:00+00:00",
  "date_from_url": "2010-01-25",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>Sure, the more one thinks about how the Vikes gift-wrapped the game and gave it away, the more irritating it is.  But the angst, pain, and general soulsickness doesn’t even come close to comparing to 1998, 1975, or 1983.  As hard as it may be for younger Vikings fans to understand, this loss doesn’t even rank in the top ten.  And as Chev reminded me, I never expected anywhere nearly as much out of Favre as he delivered this season.  After all, this is how I answered when I was asked before the season if I was excited about Favre becoming a Viking:</p><p><i>“All I know is that as a Vikings fan, I never feared Brett Favre. Never. Sure, sometimes he’d beat you with a lightning strike from that cannon arm, but just as often – more often – he’d beat the Packers with an untimely interception.”</i></p><p>Upon reflection, I’m shocked that he didn’t do it more often this year.  The reality is that Favre is the anti-Manning, the anti-Elway, the anti-Two Minute Tommy Kramer.  For an elite quarterback, he’s actually a relative choke artist dating back to the Green Bay Super Bowl loss to Denver.  I’m glad we had him this year and I hope we have him the next year, but I’m not at all surprised that he would turn out to be the goat, insofar as any Minnesota player can be said to be the goat.  In my opinion, none of them were.  AD, for example, had either the best three-fumble or worst three-rushing TD game in playoff history.</p><p>I thought game itself went pretty much how I broke it down, barring all the crazy fumbles and the inability of the Minnesota defensive line to actually sack Brees.  I’ll go over each aspect later, but obviously the thing that I got most wrong was giving the Saints a +1 advantage for coaching.  It should have been a +3, enough to swing the balance in New Orleans favor.  The true goat of the game is Favre’s fellow choke artist Brad Childress.  While he did a pretty good job surmounting his natural tendencies over the season, under pressure he reverted to his terrible tendency towards hyper-controlling micromanagement.  The strategy on that last drive was terrible from the start; the seeds of the problem were planted before that dreadful timeout called after Chester Taylor’s first down at the Saints 37.  There were actually FIVE big coaching mistakes at the end that cumulatively cost the Vikings the game:</p><p>1.  Calling timeout.  The Saints were visibly reeling after the Taylor first down put the Vikes in field goal range.  AD probably could have gone off tackle and into the end zone, not just merely gained the 10 yards to make the field goal a gimme for Longwell, if Childress hadn’t given them the chance to regroup.  When the opponent’s morale is shaken, that’s the moment to strike and the very last thing you should do is give them time.  Military leaders have known this for more than two thousand years, so why don’t football coaches?</p><p>2.  After the timeout, the Saints stacked the line since Sean Payton knows that Chilly is from the Schottenheimer/Turner school of playing not to screw it up.  I was SCREAMING at the screen for a play-action pass to the FB in the slot or a WR on a buttonhook.  Naturally, they ran it up the middle twice for no gain, which makes one wonder if anyone on an NFL staff ever pays any attention to history.  That play was straight out of Schottenheimer’s “how to lose a playoff game” book.  You don’t play to win the conference championship on a 51-yard field goal.  You simply don’t.  It’s stupid.</p><p>3.  The 12-men penalty.  This is the one that everyone is talking about.  Yes, it’s stupid.  But no, it’s unfortunately not as surprising as it should be considering how the Vikings sideline was described as “chaos” at the end of last year’s playoff game against the Eagles.  The penalty was inexcusable and it was entirely on the coaching staff.</p><p>4.  The interception.  Yes, it was a classic Brett Favre choke; there is absolutely no question that he should have run the ball.  As a second option, he should have thrown it to the receiver who was in man coverage eight yards past the line of scrimmage.  But it shouldn’t have been news to Childress that his quarterback is Brett Favre, who tends to throw amazingly idiotic interceptions at critical moments like those. <a href=\"http://sportsillustrated.cnn.com/2010/images/01/25/FavreINT.mp3\">Every serious Vikings fan has known this </a>self-destructive flaw of Favre’s for years, so why didn’t Childress call the play accordingly?  The roll-out call was actually fine, but if you haven’t given explicit orders to a) run if they give you an opening and b) not throw across the field, you’re just not doing your job correctly.</p><p>5.  Griffin’s injury.  Why is your #1 cornerback (given Winfield’s injury), on the kickoff coverage team?  Would they have given up 50 instead of 40 if he wasn’t?</p><p>The fumbles were infuriating, but they weren’t the reason the Vikes lost.  They were the reason the Vikes didn’t win by 17.  A few of the penalties were ridiculous, especially the phantom pass interference call at the end, but the refs were shaky all night and they would have been irrelevant if Childress hadn’t pulled a Denny Green.  The dropped interception was bad, but that, too, should have been irrelevant.</p><p>The reason the Vikings lost was a frightened, micromanaging coach trying to play it safe instead of playing to finish off the opponent and win.  I expect Childress will probably learn from the experience – given his contract extension, I certainly hope he will – but that’s little consolation now.  Anyhow, I can’t fault the Saints for accepting Chilly’s Gift, and I’m pleased to see them finally get the chance to play in the Super Bowl instead of the NFC East teams of whom I am so thoroughly sick.  And let’s face it, this game looked suspiciously like playing for the right to play sacrificial lamb against the Manning-machine.  Even so, I’d like to congratulate the New Orleans Saints and their long-suffering fans on their NFC Championship and wish them the best of luck in upsetting the Colts.</p></div>",
  "content_text": "Sure, the more one thinks about how the Vikes gift-wrapped the game and gave it away, the more irritating it is.  But the angst, pain, and general soulsickness doesn’t even come close to comparing to 1998, 1975, or 1983.  As hard as it may be for younger Vikings fans to understand, this loss doesn’t even rank in the top ten.  And as Chev reminded me, I never expected anywhere nearly as much out of Favre as he delivered this season.  After all, this is how I answered when I was asked before the season if I was excited about Favre becoming a Viking:\n“All I know is that as a Vikings fan, I never feared Brett Favre. Never. Sure, sometimes he’d beat you with a lightning strike from that cannon arm, but just as often – more often – he’d beat the Packers with an untimely interception.”\nUpon reflection, I’m shocked that he didn’t do it more often this year.  The reality is that Favre is the anti-Manning, the anti-Elway, the anti-Two Minute Tommy Kramer.  For an elite quarterback, he’s actually a relative choke artist dating back to the Green Bay Super Bowl loss to Denver.  I’m glad we had him this year and I hope we have him the next year, but I’m not at all surprised that he would turn out to be the goat, insofar as any Minnesota player can be said to be the goat.  In my opinion, none of them were.  AD, for example, had either the best three-fumble or worst three-rushing TD game in playoff history.\nI thought game itself went pretty much how I broke it down, barring all the crazy fumbles and the inability of the Minnesota defensive line to actually sack Brees.  I’ll go over each aspect later, but obviously the thing that I got most wrong was giving the Saints a +1 advantage for coaching.  It should have been a +3, enough to swing the balance in New Orleans favor.  The true goat of the game is Favre’s fellow choke artist Brad Childress.  While he did a pretty good job surmounting his natural tendencies over the season, under pressure he reverted to his terrible tendency towards hyper-controlling micromanagement.  The strategy on that last drive was terrible from the start; the seeds of the problem were planted before that dreadful timeout called after Chester Taylor’s first down at the Saints 37.  There were actually FIVE big coaching mistakes at the end that cumulatively cost the Vikings the game:\n1.  Calling timeout.  The Saints were visibly reeling after the Taylor first down put the Vikes in field goal range.  AD probably could have gone off tackle and into the end zone, not just merely gained the 10 yards to make the field goal a gimme for Longwell, if Childress hadn’t given them the chance to regroup.  When the opponent’s morale is shaken, that’s the moment to strike and the very last thing you should do is give them time.  Military leaders have known this for more than two thousand years, so why don’t football coaches?\n2.  After the timeout, the Saints stacked the line since Sean Payton knows that Chilly is from the Schottenheimer/Turner school of playing not to screw it up.  I was SCREAMING at the screen for a play-action pass to the FB in the slot or a WR on a buttonhook.  Naturally, they ran it up the middle twice for no gain, which makes one wonder if anyone on an NFL staff ever pays any attention to history.  That play was straight out of Schottenheimer’s “how to lose a playoff game” book.  You don’t play to win the conference championship on a 51-yard field goal.  You simply don’t.  It’s stupid.\n3.  The 12-men penalty.  This is the one that everyone is talking about.  Yes, it’s stupid.  But no, it’s unfortunately not as surprising as it should be considering how the Vikings sideline was described as “chaos” at the end of last year’s playoff game against the Eagles.  The penalty was inexcusable and it was entirely on the coaching staff.\n4.  The interception.  Yes, it was a classic Brett Favre choke; there is absolutely no question that he should have run the ball.  As a second option, he should have thrown it to the receiver who was in man coverage eight yards past the line of scrimmage.  But it shouldn’t have been news to Childress that his quarterback is Brett Favre, who tends to throw amazingly idiotic interceptions at critical moments like those.\nEvery serious Vikings fan has known this\nself-destructive flaw of Favre’s for years, so why didn’t Childress call the play accordingly?  The roll-out call was actually fine, but if you haven’t given explicit orders to a) run if they give you an opening and b) not throw across the field, you’re just not doing your job correctly.\n5.  Griffin’s injury.  Why is your #1 cornerback (given Winfield’s injury), on the kickoff coverage team?  Would they have given up 50 instead of 40 if he wasn’t?\nThe fumbles were infuriating, but they weren’t the reason the Vikes lost.  They were the reason the Vikes didn’t win by 17.  A few of the penalties were ridiculous, especially the phantom pass interference call at the end, but the refs were shaky all night and they would have been irrelevant if Childress hadn’t pulled a Denny Green.  The dropped interception was bad, but that, too, should have been irrelevant.\nThe reason the Vikings lost was a frightened, micromanaging coach trying to play it safe instead of playing to finish off the opponent and win.  I expect Childress will probably learn from the experience – given his contract extension, I certainly hope he will – but that’s little consolation now.  Anyhow, I can’t fault the Saints for accepting Chilly’s Gift, and I’m pleased to see them finally get the chance to play in the Super Bowl instead of the NFC East teams of whom I am so thoroughly sick.  And let’s face it, this game looked suspiciously like playing for the right to play sacrificial lamb against the Manning-machine.  Even so, I’d like to congratulate the New Orleans Saints and their long-suffering fans on their NFC Championship and wish them the best of luck in upsetting the Colts.",
  "tags": [
    "sports"
  ],
  "categories": [],
  "sitemap_lastmod": "2010-01-25T17:26:00+00:00"
}