{
  "url": "https://voxday.net/2010/01/05/so-stop-writing-schlock/",
  "scraped_at": "2026-01-08T23:16:13.560777",
  "title": "So stop writing schlock",
  "date_display": "January 5, 2010",
  "date_iso": "2010-01-05T16:17:00+00:00",
  "date_from_url": "2010-01-05",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>Women <a href=\"http://www.omnivoracious.com/2010/01/farah-mendlesohn-on-joanna-russ-interviewed-by-graham-sleight.html\">continue to whine about writing</a>.  Apparently it’s not enough to have driven men away from the fantasy genre, it seems they want to win awards while destroying science fiction too:</p><blockquote><p>I take the absence of women on the Hugo ballots (the major award in the field) very seriously. I think it’s possible to make an argument that the SF world as a whole is actually less welcoming of women than it was twenty years ago.I don’t mean that men don’t read women, or discriminate against them consciously, but that too many men, when asked about good SF, don’t remember women (and I have evidence of this from the reader survey I undertook which can be found at the back of my most recent book, The Inter-Galactic Playground). This takes place at all levels: take a look at your local mass market bookshop or local library shelves. How many of the sf books stocked are written by women? For the purposes of this exercise, ignore the fantasy. In the UK, one publisher has decided it’s ok to produce nice repackaged sets of SF “classics” which include not a single woman: I am well aware that their argument is that they are repackaging their bestselling authors, but the effect is geometric and long lasting. It perpetuates the idea that women don’t write SF, and so makes it more of a “surprise” that they do, and hence reduces the chance of their work being bought. Women writing SF should be normal by now, but it actually feels less normal in the bookshops than ever.</p></blockquote><p>The salient point isn’t that women don’t write science fiction, it’s that they don’t write hard science fiction and, for the most part, they don’t write GOOD science fiction.  Other than Lois McMaster Bujold, who is there?  The award-winning Catharine Asaro writes strong independent woman space romance schlock.  Sheri Tepper writes feminist narcissism in space.  Elizabeth Moon writes horrible space romance schlock with risible military pretensions: <i>“Now combat-blooded and well on her way to the admiralty, young Kylara Vatta commands 40 far-future spacecraft…. surrounded by a convincing supporting cast, from feisty fruitcake-baking Aunt Grace, who runs Slotter Key’s defenses, to dashing Rafe Dunbarger, acting CEO of InterStellar Communications, who has lost his heart to Ky despite his best efforts at stoicism.”</i> Of course he did.  Now, Barbara Hambly has written some excellent fantasy with overtones of science… but apparently fantasy is off limits here because there are too many women being too successful writing good, bad, and awful fantasy for a feminist to get away with complaining about it.</p><p>The truth is that women usually write the same novel over and over again underneath the guise of a thin genre veneer.  The action, the plot, the world-building, the style, and the suspension of disbelief are all secondary to the feelings of the young, attractive female protagonist and her relationship with the dashing, accomplished man who is alternately threatened by her and attracted to her.  It’s boring.  It’s unoriginal.  It’s intellectually stultifying.  It’s not the sort of thing that any male or female reader with half a brain is going to respect.</p><p>Tangential note: I particularly liked this sentence, which demonstrates why feminist writers have such a difficult time creating believable alternate worlds; they can’t even accurately describe the world they presently inhabit.  “<i>this would be my cue to explain how we do too have ‘honour killings’ in Britain, and they happen in nice white families all the time.</i></p><p>Ah, perhaps that explains the absence of all the great female science fiction writers.  They were obviously all massacred very early in their careers by their nice white British families.</p></div>",
  "content_text": "Women\ncontinue to whine about writing\n.  Apparently it’s not enough to have driven men away from the fantasy genre, it seems they want to win awards while destroying science fiction too:\nI take the absence of women on the Hugo ballots (the major award in the field) very seriously. I think it’s possible to make an argument that the SF world as a whole is actually less welcoming of women than it was twenty years ago.I don’t mean that men don’t read women, or discriminate against them consciously, but that too many men, when asked about good SF, don’t remember women (and I have evidence of this from the reader survey I undertook which can be found at the back of my most recent book, The Inter-Galactic Playground). This takes place at all levels: take a look at your local mass market bookshop or local library shelves. How many of the sf books stocked are written by women? For the purposes of this exercise, ignore the fantasy. In the UK, one publisher has decided it’s ok to produce nice repackaged sets of SF “classics” which include not a single woman: I am well aware that their argument is that they are repackaging their bestselling authors, but the effect is geometric and long lasting. It perpetuates the idea that women don’t write SF, and so makes it more of a “surprise” that they do, and hence reduces the chance of their work being bought. Women writing SF should be normal by now, but it actually feels less normal in the bookshops than ever.\nThe salient point isn’t that women don’t write science fiction, it’s that they don’t write hard science fiction and, for the most part, they don’t write GOOD science fiction.  Other than Lois McMaster Bujold, who is there?  The award-winning Catharine Asaro writes strong independent woman space romance schlock.  Sheri Tepper writes feminist narcissism in space.  Elizabeth Moon writes horrible space romance schlock with risible military pretensions:\n“Now combat-blooded and well on her way to the admiralty, young Kylara Vatta commands 40 far-future spacecraft…. surrounded by a convincing supporting cast, from feisty fruitcake-baking Aunt Grace, who runs Slotter Key’s defenses, to dashing Rafe Dunbarger, acting CEO of InterStellar Communications, who has lost his heart to Ky despite his best efforts at stoicism.”\nOf course he did.  Now, Barbara Hambly has written some excellent fantasy with overtones of science… but apparently fantasy is off limits here because there are too many women being too successful writing good, bad, and awful fantasy for a feminist to get away with complaining about it.\nThe truth is that women usually write the same novel over and over again underneath the guise of a thin genre veneer.  The action, the plot, the world-building, the style, and the suspension of disbelief are all secondary to the feelings of the young, attractive female protagonist and her relationship with the dashing, accomplished man who is alternately threatened by her and attracted to her.  It’s boring.  It’s unoriginal.  It’s intellectually stultifying.  It’s not the sort of thing that any male or female reader with half a brain is going to respect.\nTangential note: I particularly liked this sentence, which demonstrates why feminist writers have such a difficult time creating believable alternate worlds; they can’t even accurately describe the world they presently inhabit.  “\nthis would be my cue to explain how we do too have ‘honour killings’ in Britain, and they happen in nice white families all the time.\nAh, perhaps that explains the absence of all the great female science fiction writers.  They were obviously all massacred very early in their careers by their nice white British families.",
  "tags": [
    "writing"
  ],
  "categories": [],
  "sitemap_lastmod": "2010-01-05T16:17:00+00:00"
}