{
  "url": "https://voxday.net/2010/01/15/stupid-party/",
  "scraped_at": "2026-01-08T23:17:04.845326",
  "title": "The Stupid Party",
  "date_display": "January 15, 2010",
  "date_iso": "2010-01-15T15:46:00+00:00",
  "date_from_url": "2010-01-15",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>I am really going to laugh if Brown <a href=\"http://corner.nationalreview.com/post/?q=YTUzNDE0YmY5NzAwNDI5ZDRmMjgyODQxMzEyNDA0ZDE=\">manages to blow the big Republican upset bid</a> in Massachusetts because he’s more interested in protecting the profits of the zombie banks than he is in being elected:</p><blockquote><p>It’s been five new attacks a day from the Coakley campaign, so it’s hard to say if they’ve settled on the final push. But it appears that they want the last four days to be about President Obama’s $90 billion bank tax.  She’s for the tax hike. Brown is against it.  On one level, there’s nothing new here for either candidate. Martha “We’ve Got To Get Taxes Up” Coakley is already on the record for billions in new taxes.  Scott Brown is the tax cutter.  What gives this a problematic wrinkle for Brown is that the energized part of his base, the “tea party” voters are very mad about the bailouts and the big banks.  This could be a wedge issue for Coakley to use to cool off some of his support.</p></blockquote><p>I am against taxes too, but this tax has nothing to do with taxes per se.  I’m 100 percent for a 100 percent tax on the profits and bonuses of the giant zombie banks and the pirate-class executives who run them for the next 20 years.  They are no longer private institutions and they are not capable of surviving in a free market without government support, so they should not benefit from crying capitalism and the free market.  And the claim to have repaid the TARP money is a red herring, <a href=\"http://market-ticker.denninger.net/archives/1858-The-Financial-Crisis-Responsibility-Fee.html\">as Karl Dennninger shows</a>, that’s only the frosting on the bailout cake.</p></div>",
  "content_text": "I am really going to laugh if Brown\nmanages to blow the big Republican upset bid\nin Massachusetts because he’s more interested in protecting the profits of the zombie banks than he is in being elected:\nIt’s been five new attacks a day from the Coakley campaign, so it’s hard to say if they’ve settled on the final push. But it appears that they want the last four days to be about President Obama’s $90 billion bank tax.  She’s for the tax hike. Brown is against it.  On one level, there’s nothing new here for either candidate. Martha “We’ve Got To Get Taxes Up” Coakley is already on the record for billions in new taxes.  Scott Brown is the tax cutter.  What gives this a problematic wrinkle for Brown is that the energized part of his base, the “tea party” voters are very mad about the bailouts and the big banks.  This could be a wedge issue for Coakley to use to cool off some of his support.\nI am against taxes too, but this tax has nothing to do with taxes per se.  I’m 100 percent for a 100 percent tax on the profits and bonuses of the giant zombie banks and the pirate-class executives who run them for the next 20 years.  They are no longer private institutions and they are not capable of surviving in a free market without government support, so they should not benefit from crying capitalism and the free market.  And the claim to have repaid the TARP money is a red herring,\nas Karl Dennninger shows\n, that’s only the frosting on the bailout cake.",
  "tags": [],
  "categories": [],
  "sitemap_lastmod": "2010-01-15T15:46:00+00:00"
}