{
  "url": "https://voxday.net/2010/01/12/there-is-still-no-global-warming-2/",
  "scraped_at": "2026-01-08T23:16:48.332516",
  "title": "There is still no global warming",
  "date_display": "January 12, 2010",
  "date_iso": "2010-01-12T13:06:00+00:00",
  "date_from_url": "2010-01-12",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>As I have said from the start, the significant point is not that Man is not causing global warming, although that is true, or that there are more important problems to be addressed than global warming, although that is true too.  The significant point is that the so-called climate scientists are all incorrect, <a href=\"http://www.dailymail.co.uk/sciencetech/article-1242011/DAVID-ROSE-The-mini-ice-age-starts-here.html\">there is no long-term global warming trend</a>, there is only a short-term and irrelevant warming spike, and all of the predictions of global warming based on the climacaustal’s scientific models will be proven totally incorrect over the next ten years.</p><blockquote><p>The bitter winter afflicting much of the Northern Hemisphere is only the start of a global trend towards cooler weather that is likely to last for 20 or 30 years, say some of the world’s most eminent climate scientists.</p><p>Their predictions – based on an analysis of natural cycles in water temperatures in the Pacific and Atlantic oceans – challenge some of the global warming orthodoxy’s most deeply cherished beliefs, such as the claim that the North Pole will be free of ice in<br> summer by 2013.</br></p><p>According to the US National Snow and Ice Data Centre in Colorado, Arctic summer sea ice has increased by 409,000 square miles, or 26 per cent, since 2007 – and even the most committed global warming activists do not dispute this.</p></blockquote><p>Of course, the mere fact of being completely wrong won’t slow down the global government crowd, their scientific enablers or the scienthological faithful.  I just wonder how long it will be before “global cooling is climate change too” becomes the new mantra.</p></div>",
  "content_text": "As I have said from the start, the significant point is not that Man is not causing global warming, although that is true, or that there are more important problems to be addressed than global warming, although that is true too.  The significant point is that the so-called climate scientists are all incorrect,\nthere is no long-term global warming trend\n, there is only a short-term and irrelevant warming spike, and all of the predictions of global warming based on the climacaustal’s scientific models will be proven totally incorrect over the next ten years.\nThe bitter winter afflicting much of the Northern Hemisphere is only the start of a global trend towards cooler weather that is likely to last for 20 or 30 years, say some of the world’s most eminent climate scientists.\nTheir predictions – based on an analysis of natural cycles in water temperatures in the Pacific and Atlantic oceans – challenge some of the global warming orthodoxy’s most deeply cherished beliefs, such as the claim that the North Pole will be free of ice in\nsummer by 2013.\nAccording to the US National Snow and Ice Data Centre in Colorado, Arctic summer sea ice has increased by 409,000 square miles, or 26 per cent, since 2007 – and even the most committed global warming activists do not dispute this.\nOf course, the mere fact of being completely wrong won’t slow down the global government crowd, their scientific enablers or the scienthological faithful.  I just wonder how long it will be before “global cooling is climate change too” becomes the new mantra.",
  "tags": [
    "AGW/CC"
  ],
  "categories": [],
  "sitemap_lastmod": "2010-01-12T13:06:00+00:00"
}