{
  "url": "https://voxday.net/2010/01/07/veni-perdi-clami/",
  "scraped_at": "2026-01-08T23:16:24.543517",
  "title": "Veni, perdi, clami",
  "date_display": "January 7, 2010",
  "date_iso": "2010-01-07T15:21:00+00:00",
  "date_from_url": "2010-01-07",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>Mikio is merely the latest in a tediously long series of would-be critics to show up, repeatedly make blatant errors of fact and logic in an attempt to criticize one of my posts, then whine and cry because I’m not inclined to indulge inept argumentation.  Since these critics, (who used to be feminists but of late have tended to be atheists), are more than a little handicapped when it comes to logic, it seems to escape their attention that the reason <a href=\"http://www.milobookclub.com/2009/01/01/rules-of-blog_01/\">the Rules of the Blog</a> exist is because their behavior is not only common, but reliably follows a predictable pattern.</p><p><b>Rule 14:</b> “It is my intention to give individual commenters up to three opportunities per post to criticize what I have posted there. Since I do not have any interest whatsoever in wasting time on futile attempts to explain things to the willfully obtuse, the intellectually underpowered, or the disingenuous, I will cease to engage with a commenter after he has committed three demonstrable errors of fact or logic in that comment thread. While I will identify those errors, I am not inclined to be drawn into tangential discussions of them. Attempts to claim that my refusal to further engage with a commenter whose arguments have repeatedly been demonstrated to be flawed are the result of cowardice or an inability to respond are false and will be deleted.”</p><p>Now, the fact that Mikio fell into the “intellectually underpowered” category was obvious from the start, but was underlined by his hapless attempt to quibble with my demonstration of his errors, which actually exceeded the requisite three.  The amusing thing was that he subsequently attempted to argue that my explication of his incompetence, which was amply demonstrated in the preceding comments, was an <i>ad hominem</i> dismissal.  As anyone who actually knows what the term means, it quite clearly was not.</p><p><i>Strike 1 – erroneous assumption confusing observation for fairy tale<br> Strike 2 – failed analogy<br> Strike 3 – false accusation of logical incapacity and unsupported assumptions</br></br></i></p><p>As is the social autistic’s wont, Mikio has proceeded to whine, complain, and even lie about why his later comments were deleted, despite the fact that they were treated precisely as the rules dictated they would be.  He has now asserted that because comments which violate the rules are deleted, there is a possibility that I am avoiding strong arguments that expose the flaws in my thinking.  He is not the first to suggest this; it is a common theme among those who find their comments getting deleted.  He has also claimed that the regular readers here are obsequious and clueless followers and that challenges to thinking are not welcome here.</p><p>Of course, it is easy to expose the numerous falsehoods in Mikio’s dishonest claims.  While it is theoretically possible that some strong arguments are being deleted, because I almost never delete the first few comments made by any commenter, we have sufficient evidence to judge the general quality of the arguments that have been presented as well as information about the intellectual capacity of the person presenting them.  For example, there is absolutely no reason to suspect that the same individual who made the panoply of errors that Mikio did in the post entitled <a href=\"http://www.milobookclub.com/2010/01/06/porker-principle/\">The Porker Principle</a> is capable of producing stronger and more effective arguments.</p><p>Second, dozens, if not hundreds of readers have the opportunity to read posts that are deleted.  While some masochists may enjoy such posts, no one has ever seen fit to argue that any of them have been deleted because they are <i>too effective</i> or because I am incapable of answering them.  Third, Mikio assumes that I do not have access to deleted comments for future use in the event that someone is foolish enough to claim that I was incapable of answering a specific argument they made in a comment that was deleted.  Fourth, the large number of critical comments contained in the comments over the last five years show that challenges to my thinking are far more welcome here than they are anywhere else on the Internet.  There is considerable evidence, both here and on other sites, that I am not one who fears debate and runs away from it.  Finally, the six thousand or so daily readers who are familiar with this blog all know very well what small minority of comments get deleted and why, since the behavior is so predictable.</p><p>Once someone demonstrates that he is either unable or unwilling to engage in rational, intelligent debate, there is no reason to waste any time on them or their comments since it is like dunking a basketball on a fifth-grader.  I have no reason to ban them, but neither do I have any interest in anything they have to say.  I understand that it’s difficult to accept that you’re not quite as intelligent as you were led to believe back when you were the smartest koi in the little garden pond, but it’s a lesson that you’re eventually going to learn one way or another.  And the sooner you learn it, the less of an ass you’re going to make of yourself in the future.</p></div>",
  "content_text": "Mikio is merely the latest in a tediously long series of would-be critics to show up, repeatedly make blatant errors of fact and logic in an attempt to criticize one of my posts, then whine and cry because I’m not inclined to indulge inept argumentation.  Since these critics, (who used to be feminists but of late have tended to be atheists), are more than a little handicapped when it comes to logic, it seems to escape their attention that the reason\nthe Rules of the Blog\nexist is because their behavior is not only common, but reliably follows a predictable pattern.\nRule 14:\n“It is my intention to give individual commenters up to three opportunities per post to criticize what I have posted there. Since I do not have any interest whatsoever in wasting time on futile attempts to explain things to the willfully obtuse, the intellectually underpowered, or the disingenuous, I will cease to engage with a commenter after he has committed three demonstrable errors of fact or logic in that comment thread. While I will identify those errors, I am not inclined to be drawn into tangential discussions of them. Attempts to claim that my refusal to further engage with a commenter whose arguments have repeatedly been demonstrated to be flawed are the result of cowardice or an inability to respond are false and will be deleted.”\nNow, the fact that Mikio fell into the “intellectually underpowered” category was obvious from the start, but was underlined by his hapless attempt to quibble with my demonstration of his errors, which actually exceeded the requisite three.  The amusing thing was that he subsequently attempted to argue that my explication of his incompetence, which was amply demonstrated in the preceding comments, was an\nad hominem\ndismissal.  As anyone who actually knows what the term means, it quite clearly was not.\nStrike 1 – erroneous assumption confusing observation for fairy tale\nStrike 2 – failed analogy\nStrike 3 – false accusation of logical incapacity and unsupported assumptions\nAs is the social autistic’s wont, Mikio has proceeded to whine, complain, and even lie about why his later comments were deleted, despite the fact that they were treated precisely as the rules dictated they would be.  He has now asserted that because comments which violate the rules are deleted, there is a possibility that I am avoiding strong arguments that expose the flaws in my thinking.  He is not the first to suggest this; it is a common theme among those who find their comments getting deleted.  He has also claimed that the regular readers here are obsequious and clueless followers and that challenges to thinking are not welcome here.\nOf course, it is easy to expose the numerous falsehoods in Mikio’s dishonest claims.  While it is theoretically possible that some strong arguments are being deleted, because I almost never delete the first few comments made by any commenter, we have sufficient evidence to judge the general quality of the arguments that have been presented as well as information about the intellectual capacity of the person presenting them.  For example, there is absolutely no reason to suspect that the same individual who made the panoply of errors that Mikio did in the post entitled\nThe Porker Principle\nis capable of producing stronger and more effective arguments.\nSecond, dozens, if not hundreds of readers have the opportunity to read posts that are deleted.  While some masochists may enjoy such posts, no one has ever seen fit to argue that any of them have been deleted because they are\ntoo effective\nor because I am incapable of answering them.  Third, Mikio assumes that I do not have access to deleted comments for future use in the event that someone is foolish enough to claim that I was incapable of answering a specific argument they made in a comment that was deleted.  Fourth, the large number of critical comments contained in the comments over the last five years show that challenges to my thinking are far more welcome here than they are anywhere else on the Internet.  There is considerable evidence, both here and on other sites, that I am not one who fears debate and runs away from it.  Finally, the six thousand or so daily readers who are familiar with this blog all know very well what small minority of comments get deleted and why, since the behavior is so predictable.\nOnce someone demonstrates that he is either unable or unwilling to engage in rational, intelligent debate, there is no reason to waste any time on them or their comments since it is like dunking a basketball on a fifth-grader.  I have no reason to ban them, but neither do I have any interest in anything they have to say.  I understand that it’s difficult to accept that you’re not quite as intelligent as you were led to believe back when you were the smartest koi in the little garden pond, but it’s a lesson that you’re eventually going to learn one way or another.  And the sooner you learn it, the less of an ass you’re going to make of yourself in the future.",
  "tags": [
    "freakshow"
  ],
  "categories": [],
  "sitemap_lastmod": "2010-01-07T15:21:00+00:00"
}