{
  "url": "https://voxday.net/2010/01/17/we-are-bud-gran/",
  "scraped_at": "2026-01-08T23:17:12.129464",
  "title": "We are Bud Grant",
  "date_display": "January 17, 2010",
  "date_iso": "2010-01-17T18:18:00+00:00",
  "date_from_url": "2010-01-17",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>Chad the Elder is a true Vikings fan. <a href=\"http://www.fraterslibertas.com/2010/01/sorrow-stone-and-snow.html\">He knows the drill</a>:</p><blockquote><p>I don’t get the impression that many true Vikings fans are all that confident that their squad will beat the Cowboys. Sure you hear a lot of false bravado on local talk radio stations and some of the younger cadre of Purple fans may honestly believe their team is Miami bound. But deep down the fans who have been around for a while, the ones who can all too clearly still recall the playoff and Super Bowl losses, know that when it comes to the Vikings letting us down it’s not a matter of if but when. The Vikes very well might defeat Dallas this week. All that will do is postpone the inevitable letdown.</p><p>What best describes this attitude? Some might say cynicism, others fatalism. I would say it’s more of a stoicism, taking the definition of the word commonly used today rather than the philosophy itself. We accept our destiny but continue to carry on anyway, impassive in the face of eventual defeat. It’s almost as if Viking fans have taken on the persona of Bud Grant, a man well-versed in hiding the pain of crushing losses….  So on Sunday we’ll put on our grim game faces, utter a stern “Skol!,” and await our fate.</p></blockquote><p>I didn’t bother posting about yesterday’s games because I wasn’t interested.  The Saints and Colts won, as I expected, although the Ravens put up a better show than I would have thought.  I’m not afraid of Dallas; the hype always favors the NFC East team and there is a reason teams that go 12-4 and 13-3 <i>usually</i> win.  New Orleans shellacked an Arizona team that was clearly better than Green Bay, the team that all the NFL chatterboxes were saying everyone should fear to face.  Dallas looked good in twice beating a Philadelphia team that was crushed by New Orleans this season, but the Cowboys are a good team, not a great one.</p><p>The Vikes should win.  But we’ve known them to fail to close the deal before.</p></div>",
  "content_text": "Chad the Elder is a true Vikings fan.\nHe knows the drill\n:\nI don’t get the impression that many true Vikings fans are all that confident that their squad will beat the Cowboys. Sure you hear a lot of false bravado on local talk radio stations and some of the younger cadre of Purple fans may honestly believe their team is Miami bound. But deep down the fans who have been around for a while, the ones who can all too clearly still recall the playoff and Super Bowl losses, know that when it comes to the Vikings letting us down it’s not a matter of if but when. The Vikes very well might defeat Dallas this week. All that will do is postpone the inevitable letdown.\nWhat best describes this attitude? Some might say cynicism, others fatalism. I would say it’s more of a stoicism, taking the definition of the word commonly used today rather than the philosophy itself. We accept our destiny but continue to carry on anyway, impassive in the face of eventual defeat. It’s almost as if Viking fans have taken on the persona of Bud Grant, a man well-versed in hiding the pain of crushing losses….  So on Sunday we’ll put on our grim game faces, utter a stern “Skol!,” and await our fate.\nI didn’t bother posting about yesterday’s games because I wasn’t interested.  The Saints and Colts won, as I expected, although the Ravens put up a better show than I would have thought.  I’m not afraid of Dallas; the hype always favors the NFC East team and there is a reason teams that go 12-4 and 13-3\nusually\nwin.  New Orleans shellacked an Arizona team that was clearly better than Green Bay, the team that all the NFL chatterboxes were saying everyone should fear to face.  Dallas looked good in twice beating a Philadelphia team that was crushed by New Orleans this season, but the Cowboys are a good team, not a great one.\nThe Vikes should win.  But we’ve known them to fail to close the deal before.",
  "tags": [
    "sports"
  ],
  "categories": [],
  "sitemap_lastmod": "2010-01-17T18:18:00+00:00"
}