{
  "url": "https://voxday.net/2010/01/02/why-rules-dont-work/",
  "scraped_at": "2026-01-08T23:15:56.920528",
  "title": "WhyThe Rulesdon’t work",
  "date_display": "January 2, 2010",
  "date_iso": "2010-01-02T12:29:00+00:00",
  "date_from_url": "2010-01-02",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>A perusal of the basic Rules set quickly shows why women who rely upon them to secure a man and/or marriage are likely going to fail.  As is often seen in social networking profiles and advice columns, women usually think that what works with women must also work with men.  This is not true.  Consider:</p><p><i>Rule 1: Be a “Creature Unlike Any Other”</i></p><p>Given that Playboy has spent five decades proving the near-universal male predilection for a slender, pretty, large-breasted, blue-eyed blonde, this rule is obviously insane.  In fact, most men have distinct preferences that anyone who knows them well can easily identify.  One of my college roommates always tended to date short, hippy women with long, dark, naturally curly hair named Mary.  Unsurprisingly, he ended up marrying a tall, hippy woman with long, dark, naturally curly hair named Mary.  Women are naturally attracted to outliers for the sheer sake of their novelty.  Men aren’t.</p><p><i>Rule 2: Show Up to Parties, Dances, and Social Events Even if You Do Not Feel Like It.</i></p><p>This makes sense, but you probably shouldn’t bother if you’re just going to be a tiresome bitch.  Unless it’s a Goth party, then feel free to mope and whine all you like, Lady Dolorous.</p><p><i>Rule 3: Don’t Stare at Men or Talk Too Much</i></p><p>The first part is completely wrong, the second part is completely right.  Staring at a man is the primary way a woman lets him know she wants to be approached.  On the other hand, about 90 percent of what women like to talk about is considered by heterosexual men to be inconsequential babble, so the less a woman expresses her opinion, the better.  On the other hand, intelligent, topical, and unopinionated speech will win respect simply because it is so rarely heard.  It may be useful to know that when men imitate women for other men, they often do it by beginning a sentence “Well <i>I</i> think….” in a high-pitched, clueless voice.</p><p><i>Rule 4: Don’t Meet Him Halfway or Go Dutch on a Date</i></p><p>Establishing an unwillingness to compromise right from the start is a very effective way of convincing intelligent men that you’re going to be a major pain in the posterior and convincing him you’re more trouble than you’re worth.  Very hot girls can get away with such intransigence with most men, but if you’re a Rules Girl, then you are obviously not a very hot girl or you wouldn’t think you needed them.  As for paying for the date, it depends.  If he asked you out, then he should pay.  But keep in mind that the “who pays” question is not anywhere nearly as big a deal to men as women seem to think.  Consider the contrast between the way groups of men and women approach paying the bill at a restaurant.  Men take half a minute to throw in a roughly equal amount and include a healthy tip, while women spend half an hour itemizing who ordered what, then stiff the wait staff.  The salient point is that men seldom give a damn one way or another.</p><p><i>Rule 5: Don’t Call Him &amp; Rarely Return His Calls</i></p><p>That’s fine.  He’ll be busy having sex with the woman who calls him at 11 PM to see if he happens to be free at the moment and you’re just another haughty bitch who can’t be bothered to call him back anyway.  This is easily the worst Rule, as it is designed to ensure that the only men who will continue to call you are terminally obsessed stalkers.</p><p><i>Rule 6: Always End Phone Calls First</i></p><p>This Rule is fine, because there isn’t a single man on the planet who keeps track of who hung up first.  Besides, he’s either reading his emails, surfing the Internet, or playing video games while you’re rambling on and on about who said what to whom anyhow.</p><p><i>Rule 7: Don’t Accept a Saturday Night Date after Wednesday</i></p><p>I have no idea what the point of this is supposed to be.  But it is correct insofar as it is always a horrendous mistake to attempt leaving your options open instead of simply accepting or rejecting a weekend date during the week.  It’s really not that hard for men to tell that you’re looking for something better but are willing to use them as a fall-back option in case nothing more interesting comes along in the next few days.  This puts you squarely in the “bitch who merits being treated as badly as I want” category in most men’s books.</p><p><i>Rule 8: Close the Deal – Do not date a man for more than two years.</i></p><p>Okay, this is actually a good one, although I’d cut it down to 12 months since it’s usually possible to at least see where things are going after a year.  If a man doesn’t show any sign of being interested in marrying you within a year, he’s probably not going to want to marry you unless nothing better happens to come along in whatever his long-term time frame happens to be.  And if he tends to groan, roll his eyes, or smoothly change the subject whenever the topic of marriage is broached, he simply isn’t the marrying kind and the sooner you move on, the better.  Remember, most men have very, very good reasons to avoid marriage under the present legal regime and a refusal to take the risk is a sign of intelligence, not personality flaws.</p><p><i>Rule 9: Buyer Beware – Observe his behavior so you do not end up with Mr. Wrong</i></p><p>This is sensible.  No objections.  Of course, keep in mind that if he has half a brain, he’ll be doing the same.</p><p><i>Rule 10: Keep doing The Rules even when things are slow</i></p><p>Alternatively, one could consider applying that pesky male logic and correctly conclude that things are slow BECAUSE of The Rules.  Now, here are some alternative guidelines – not rules – that are far more likely to produce positive results.</p><p>1.  If you find a man attractive, smile at him and meet his eyes.  If he returns the smile, he is attracted and will approach you if he is interested.  Don’t be bothered if he smiles but does not approach, this usually signifies that he is either polite but uninterested or is not interested even though he finds you attractive.  This lack of interest may be for a very good reason, such as marriage and children, so just let it go and find someone else at whom you can smile.</p><p>2.  Don’t play stupid games.  Men are goal-oriented and while some may enjoy the chase, that’s really not the point.  The reason men ditch women after scoring them isn’t because the chase was too short but because they’ve achieved their objective and are now making the logical next step of pursuing a new one.  Prolonging the chase isn’t likely to alter the ultimate result once the objective is attained, however long that takes.</p><p>3.  Learn to distinguish between a man who genuinely seeks a companion and a man who simply wants to have a good time.  If you are seeking the former sort, then waste absolutely no time on the latter type.</p><p>4.  Men don’t love drama.  We don’t watch it, we don’t read it, we don’t play it, and we certainly don’t want to live it.  The less you can create, the better.  If you crave excitement, go jump out of an airplane or find a way to test your skills against others.  It works fine for us.</p><p>5.  Bad boys play hard and they leave their mark.  You might not think your emotional scars show, but they do and they are seldom flattering.  Also, it’s difficult to “make the most of your youth” with the bad boys for five or ten years and then be happy settling for a nice, respectable beta provider.</p><p>6.  Above all, don’t try to be a mother.  He survived without you before so he knows he can survive just fine without you now.  There are plenty of girls on the girl tree and moreover, there is nothing less sexually attractive to the psychosexually normal adult male than a woman playing Mommy.  Men find it aggravating, irritating, and emasculating to have a woman attempting to order them about like a child.  And note that silent toleration does not indicate acceptance.</p><p>7.  If the man isn’t 30 pounds overweight, sex is always a more important priority than food.  This will be true until McDonalds opens a drive-through brothel or the first Victoria’s Secret line of sexbots becomes available.</p><p>8.  Never, ever, talk about anyone with whom you work.  Don’t even talk about anyone he hasn’t met unless it’s a genuinely funny story and you are one of the rare women who are able to tell a story without stopping in the middle and restarting, forgetting the punchline, or otherwise blowing it.  To put it in perspective, men care less about your faceless coworkers, family, and friends than you do about the Tuck Rule or the Bling Pro perk.  And yes, I know you don’t know what they are… how much do you care about them?  Exactly….</p></div>",
  "content_text": "A perusal of the basic Rules set quickly shows why women who rely upon them to secure a man and/or marriage are likely going to fail.  As is often seen in social networking profiles and advice columns, women usually think that what works with women must also work with men.  This is not true.  Consider:\nRule 1: Be a “Creature Unlike Any Other”\nGiven that Playboy has spent five decades proving the near-universal male predilection for a slender, pretty, large-breasted, blue-eyed blonde, this rule is obviously insane.  In fact, most men have distinct preferences that anyone who knows them well can easily identify.  One of my college roommates always tended to date short, hippy women with long, dark, naturally curly hair named Mary.  Unsurprisingly, he ended up marrying a tall, hippy woman with long, dark, naturally curly hair named Mary.  Women are naturally attracted to outliers for the sheer sake of their novelty.  Men aren’t.\nRule 2: Show Up to Parties, Dances, and Social Events Even if You Do Not Feel Like It.\nThis makes sense, but you probably shouldn’t bother if you’re just going to be a tiresome bitch.  Unless it’s a Goth party, then feel free to mope and whine all you like, Lady Dolorous.\nRule 3: Don’t Stare at Men or Talk Too Much\nThe first part is completely wrong, the second part is completely right.  Staring at a man is the primary way a woman lets him know she wants to be approached.  On the other hand, about 90 percent of what women like to talk about is considered by heterosexual men to be inconsequential babble, so the less a woman expresses her opinion, the better.  On the other hand, intelligent, topical, and unopinionated speech will win respect simply because it is so rarely heard.  It may be useful to know that when men imitate women for other men, they often do it by beginning a sentence “Well\nI\nthink….” in a high-pitched, clueless voice.\nRule 4: Don’t Meet Him Halfway or Go Dutch on a Date\nEstablishing an unwillingness to compromise right from the start is a very effective way of convincing intelligent men that you’re going to be a major pain in the posterior and convincing him you’re more trouble than you’re worth.  Very hot girls can get away with such intransigence with most men, but if you’re a Rules Girl, then you are obviously not a very hot girl or you wouldn’t think you needed them.  As for paying for the date, it depends.  If he asked you out, then he should pay.  But keep in mind that the “who pays” question is not anywhere nearly as big a deal to men as women seem to think.  Consider the contrast between the way groups of men and women approach paying the bill at a restaurant.  Men take half a minute to throw in a roughly equal amount and include a healthy tip, while women spend half an hour itemizing who ordered what, then stiff the wait staff.  The salient point is that men seldom give a damn one way or another.\nRule 5: Don’t Call Him & Rarely Return His Calls\nThat’s fine.  He’ll be busy having sex with the woman who calls him at 11 PM to see if he happens to be free at the moment and you’re just another haughty bitch who can’t be bothered to call him back anyway.  This is easily the worst Rule, as it is designed to ensure that the only men who will continue to call you are terminally obsessed stalkers.\nRule 6: Always End Phone Calls First\nThis Rule is fine, because there isn’t a single man on the planet who keeps track of who hung up first.  Besides, he’s either reading his emails, surfing the Internet, or playing video games while you’re rambling on and on about who said what to whom anyhow.\nRule 7: Don’t Accept a Saturday Night Date after Wednesday\nI have no idea what the point of this is supposed to be.  But it is correct insofar as it is always a horrendous mistake to attempt leaving your options open instead of simply accepting or rejecting a weekend date during the week.  It’s really not that hard for men to tell that you’re looking for something better but are willing to use them as a fall-back option in case nothing more interesting comes along in the next few days.  This puts you squarely in the “bitch who merits being treated as badly as I want” category in most men’s books.\nRule 8: Close the Deal – Do not date a man for more than two years.\nOkay, this is actually a good one, although I’d cut it down to 12 months since it’s usually possible to at least see where things are going after a year.  If a man doesn’t show any sign of being interested in marrying you within a year, he’s probably not going to want to marry you unless nothing better happens to come along in whatever his long-term time frame happens to be.  And if he tends to groan, roll his eyes, or smoothly change the subject whenever the topic of marriage is broached, he simply isn’t the marrying kind and the sooner you move on, the better.  Remember, most men have very, very good reasons to avoid marriage under the present legal regime and a refusal to take the risk is a sign of intelligence, not personality flaws.\nRule 9: Buyer Beware – Observe his behavior so you do not end up with Mr. Wrong\nThis is sensible.  No objections.  Of course, keep in mind that if he has half a brain, he’ll be doing the same.\nRule 10: Keep doing The Rules even when things are slow\nAlternatively, one could consider applying that pesky male logic and correctly conclude that things are slow BECAUSE of The Rules.  Now, here are some alternative guidelines – not rules – that are far more likely to produce positive results.\n1.  If you find a man attractive, smile at him and meet his eyes.  If he returns the smile, he is attracted and will approach you if he is interested.  Don’t be bothered if he smiles but does not approach, this usually signifies that he is either polite but uninterested or is not interested even though he finds you attractive.  This lack of interest may be for a very good reason, such as marriage and children, so just let it go and find someone else at whom you can smile.\n2.  Don’t play stupid games.  Men are goal-oriented and while some may enjoy the chase, that’s really not the point.  The reason men ditch women after scoring them isn’t because the chase was too short but because they’ve achieved their objective and are now making the logical next step of pursuing a new one.  Prolonging the chase isn’t likely to alter the ultimate result once the objective is attained, however long that takes.\n3.  Learn to distinguish between a man who genuinely seeks a companion and a man who simply wants to have a good time.  If you are seeking the former sort, then waste absolutely no time on the latter type.\n4.  Men don’t love drama.  We don’t watch it, we don’t read it, we don’t play it, and we certainly don’t want to live it.  The less you can create, the better.  If you crave excitement, go jump out of an airplane or find a way to test your skills against others.  It works fine for us.\n5.  Bad boys play hard and they leave their mark.  You might not think your emotional scars show, but they do and they are seldom flattering.  Also, it’s difficult to “make the most of your youth” with the bad boys for five or ten years and then be happy settling for a nice, respectable beta provider.\n6.  Above all, don’t try to be a mother.  He survived without you before so he knows he can survive just fine without you now.  There are plenty of girls on the girl tree and moreover, there is nothing less sexually attractive to the psychosexually normal adult male than a woman playing Mommy.  Men find it aggravating, irritating, and emasculating to have a woman attempting to order them about like a child.  And note that silent toleration does not indicate acceptance.\n7.  If the man isn’t 30 pounds overweight, sex is always a more important priority than food.  This will be true until McDonalds opens a drive-through brothel or the first Victoria’s Secret line of sexbots becomes available.\n8.  Never, ever, talk about anyone with whom you work.  Don’t even talk about anyone he hasn’t met unless it’s a genuinely funny story and you are one of the rare women who are able to tell a story without stopping in the middle and restarting, forgetting the punchline, or otherwise blowing it.  To put it in perspective, men care less about your faceless coworkers, family, and friends than you do about the Tuck Rule or the Bling Pro perk.  And yes, I know you don’t know what they are… how much do you care about them?  Exactly….",
  "tags": [
    "women"
  ],
  "categories": [],
  "sitemap_lastmod": "2010-01-02T12:29:00+00:00"
}