{
  "url": "https://voxday.net/2011/07/06/atheists-in-gamma-he/",
  "scraped_at": "2025-12-13T23:15:40.906720",
  "title": "Atheists in Gamma Hell",
  "date_display": "July 6, 2011",
  "date_iso": "2011-07-06T14:46:00+00:00",
  "date_from_url": "2011-07-06",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>I know, I know, it’s simply astonishing news that women hate atheists. <a href=\"http://scienceblogs.com/pharyngula/2011/07/oh_no_not_againonce_more_unto.php\">Even atheist women don’t like them</a>:</p><blockquote><p>Jen has slammed Richard Dawkins for some comments here. I can confirm that those comments were actually from Richard Dawkins. I also have to say that I agree with Jen and disagree with Richard.  Richard did make the valid point that there are much more serious abuses of women’s rights around the world, and the Islam is a particularly horrendous offender. Women have their genitals mutilated, are beaten by husbands without recourse to legal redress, are stoned to death for adultery, are denied basic privileges like the right to drive or travel unescorted. These are far more serious problems than most American women face.</p><p>However, the existence of greater crimes does not excuse lesser crimes, and no one has even tried to equate this incident to any of the horrors above. What these situations demand is an appropriate level of response: a man who beats a woman to death has clearly committed an immensely greater crime than a man who harrasses a woman in an elevator; let us fit the punishment to the crime. Islamic injustice demands a worldwide campaign of condemnation of the excesses and inhumanity of that religion.</p><p>The elevator incident demands…a personal rejection and a woman nicely suggesting to the atheist community that they avoid doing that. And that is what it got. That is all Rebecca Watson did. For those of you who are outraged at that, I ask: which part of her response fills you with fury? That a woman said no, or that a woman has asked men to be more sensitive?</p><p>I think reasonable men will be quite capable of both opposing Islamic fundamentalism with vigor and refraining from driving away their godless colleagues with petty harrassment, colleagues who may well be even more fervent and dedicated to our common cause of promoting equality all around the world.</p></blockquote><p>Look, it’s hardly news that atheist guys are creepy gammas, for the most part.  That’s why they are much less likely to get married or have children.  Even the small number of atheist girls don’t like atheist guys; the ludicrous internecine kerfluffle was kicked off by a male atheist hitting on female atheist in an elevator.  He actually <i>invited her for coffee</i>, which is the “lesser crime” to which the Fowl Atheist refers.</p><p>Dawkins, who as a scientific celebrity surmounted his natural gamma status some time ago, was naturally confused by all this extravagant feminized foolishness, and pointed out how stupid it all was.  This caused more hissy fits to be directed his way; Dawkins, being the coward that he has shown himself to be on numerous occasions, was naturally quick to crumble.</p><p>Now, I don’t think it’s absolutely necessary to be hapless with women to be an atheist, one need only look to Athol Kay, that godless Stud of Studs, Mr. Five Thousand Nights and a Night his own bad self, to see otherwise, but it is quite clear that it helps tremendously.  No wonder they’re so furious at God.  He created all those lovely women with those beautiful breasts and <i>they aren’t even allowed to even talk to them in elevators.</i></p></div>",
  "content_text": "I know, I know, it’s simply astonishing news that women hate atheists.\nEven atheist women don’t like them\n:\nJen has slammed Richard Dawkins for some comments here. I can confirm that those comments were actually from Richard Dawkins. I also have to say that I agree with Jen and disagree with Richard.  Richard did make the valid point that there are much more serious abuses of women’s rights around the world, and the Islam is a particularly horrendous offender. Women have their genitals mutilated, are beaten by husbands without recourse to legal redress, are stoned to death for adultery, are denied basic privileges like the right to drive or travel unescorted. These are far more serious problems than most American women face.\nHowever, the existence of greater crimes does not excuse lesser crimes, and no one has even tried to equate this incident to any of the horrors above. What these situations demand is an appropriate level of response: a man who beats a woman to death has clearly committed an immensely greater crime than a man who harrasses a woman in an elevator; let us fit the punishment to the crime. Islamic injustice demands a worldwide campaign of condemnation of the excesses and inhumanity of that religion.\nThe elevator incident demands…a personal rejection and a woman nicely suggesting to the atheist community that they avoid doing that. And that is what it got. That is all Rebecca Watson did. For those of you who are outraged at that, I ask: which part of her response fills you with fury? That a woman said no, or that a woman has asked men to be more sensitive?\nI think reasonable men will be quite capable of both opposing Islamic fundamentalism with vigor and refraining from driving away their godless colleagues with petty harrassment, colleagues who may well be even more fervent and dedicated to our common cause of promoting equality all around the world.\nLook, it’s hardly news that atheist guys are creepy gammas, for the most part.  That’s why they are much less likely to get married or have children.  Even the small number of atheist girls don’t like atheist guys; the ludicrous internecine kerfluffle was kicked off by a male atheist hitting on female atheist in an elevator.  He actually\ninvited her for coffee\n, which is the “lesser crime” to which the Fowl Atheist refers.\nDawkins, who as a scientific celebrity surmounted his natural gamma status some time ago, was naturally confused by all this extravagant feminized foolishness, and pointed out how stupid it all was.  This caused more hissy fits to be directed his way; Dawkins, being the coward that he has shown himself to be on numerous occasions, was naturally quick to crumble.\nNow, I don’t think it’s absolutely necessary to be hapless with women to be an atheist, one need only look to Athol Kay, that godless Stud of Studs, Mr. Five Thousand Nights and a Night his own bad self, to see otherwise, but it is quite clear that it helps tremendously.  No wonder they’re so furious at God.  He created all those lovely women with those beautiful breasts and\nthey aren’t even allowed to even talk to them in elevators.",
  "tags": [
    "atheism",
    "freakshow"
  ],
  "categories": [],
  "sitemap_lastmod": "2011-07-06T13:46:00+00:00"
}