{
  "url": "https://voxday.net/2011/07/10/bias-in-books/",
  "scraped_at": "2025-12-13T23:15:59.129785",
  "title": "Bias in book reading",
  "date_display": "July 10, 2011",
  "date_iso": "2011-07-10T21:03:00+00:00",
  "date_from_url": "2011-07-10",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>Is science fiction sexist?  Is adventure fantasy sexist?  Without bothering to go through all fifteen issues of Black Gate, I’m going to guess that there is not a perfect statistical match between the population demographics and the contributors to Black Gate.  Which, by the metric suggested by the woman horrified that Guardian readers have the sexist audacity <a href=\"http://www.guardian.co.uk/books/booksblog/2011/may/31/women-science-fiction-writers\">to prefer male SF writers</a> by a 24 to 1 margin, is ipso facto evidence that Black Gate, too, is a bastion of male privilege.</p><blockquote><p>Is science fiction sexist? A bald, potentially divisive and rather emotive question, there. But increasingly, science fiction and its close cousins, fantasy and horror, are being accused of an inherent downer on the female practitioners of the genre – and the latest offender appears to be the Guardian’s recent online poll to find readers’ favourite SF novels.  Earlier this month Damien G Walter asked guardian.co.uk/books users to suggest the best novels in the genre, following on from the Guardian’s special SF-slanted edition of its Saturday Review supplement.</p><p>The results went online last week, and displayed a great love for science fiction: more than 500 books, classic and contemporary, were suggested for inclusion. However, according to Seattle-based author Nicola Griffith, <a href=\"http://asknicola.blogspot.com/2011/05/shocking-uk-sf-favourites-score-men-500.html\">who did a bit of number-crunching on the stats</a>, there’s an overwhelming bias towards male authors.</p></blockquote><p>My response to this shocking non-news can be found <a href=\"http://www.blackgate.com/2011/07/10/we-dont-have-to-write-the-same-books/\">at the Black Gate</a>.  For those who are interested, the column to which various SF/F luminaries such as the Tor editors and the present of the SFWA took such exception can be <a href=\"http://www.wnd.com/index.php?pageId=29022\">found here</a>.</p></div>",
  "content_text": "Is science fiction sexist?  Is adventure fantasy sexist?  Without bothering to go through all fifteen issues of Black Gate, I’m going to guess that there is not a perfect statistical match between the population demographics and the contributors to Black Gate.  Which, by the metric suggested by the woman horrified that Guardian readers have the sexist audacity\nto prefer male SF writers\nby a 24 to 1 margin, is ipso facto evidence that Black Gate, too, is a bastion of male privilege.\nIs science fiction sexist? A bald, potentially divisive and rather emotive question, there. But increasingly, science fiction and its close cousins, fantasy and horror, are being accused of an inherent downer on the female practitioners of the genre – and the latest offender appears to be the Guardian’s recent online poll to find readers’ favourite SF novels.  Earlier this month Damien G Walter asked guardian.co.uk/books users to suggest the best novels in the genre, following on from the Guardian’s special SF-slanted edition of its Saturday Review supplement.\nThe results went online last week, and displayed a great love for science fiction: more than 500 books, classic and contemporary, were suggested for inclusion. However, according to Seattle-based author Nicola Griffith,\nwho did a bit of number-crunching on the stats\n, there’s an overwhelming bias towards male authors.\nMy response to this shocking non-news can be found\nat the Black Gate\n.  For those who are interested, the column to which various SF/F luminaries such as the Tor editors and the present of the SFWA took such exception can be\nfound here\n.",
  "tags": [
    "Black Gate",
    "writing"
  ],
  "categories": [],
  "sitemap_lastmod": "2011-07-10T20:03:00+00:00"
}