{
  "url": "https://voxday.net/2011/07/21/brilliance-of-us-strategery/",
  "scraped_at": "2025-12-13T23:16:45.025153",
  "title": "The brilliance of U.S. strategery",
  "date_display": "July 21, 2011",
  "date_iso": "2011-07-21T10:10:00+00:00",
  "date_from_url": "2011-07-21",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>Jim Lacey on <a href=\"http://www.nationalreview.com/articles/271678/death-military-strategy-jim-lacey\">the death of U.S. military strategy</a>:</p><blockquote><p>I teach strategy to Marines and other military officers for a living. The classes hear ad nauseam that if your plan does not include any directions as to how to carry it out, and how to obtain resources for it, then you do not have a strategy. You have an aspiration. The NMS has a lot of aspirations. There are several dozen of them in the first few pages alone. One has to wade through eight pages of aspirations before coming to: “The core task of our Armed Forces remains to defend our Nation and win its wars.” Wow! I would have led with that one.</p><p>Military strategists might wonder why the authors of the NMS made them wade through a third of the document before getting to the crucial reason of why we maintain a military in the first place. One might even wonder if the NMS authors really mean that winning wars is job number one, since elsewhere in the document you find: “Lastly, we will be prepared to act as security guarantor — preferably with partners and allies, but alone if necessary — to deter and defeat acts of aggression.” Lastly? Really? Since page one says, “Our foremost priority is the security of the American people, our territory, and our way of life,” one wonders what activities are so important that the military has moved defeating aggression to last in its order of concerns.</p></blockquote><p>In related news, the U.S. Army recently reported that its officers will no longer utilize wargames as part of their military training, but will instead incorporate a rigorous program that includes <i>The Ungame</i>, “a non-competitive learning game of conversation that fosters listening skills as well as self-expression”, <i>Dance Dance Revolution</i>, and the popular teen party game <i>Spin the Bottle</i>.  Two card games, <i>Uno </i> and <i>Mille Bournes</i>, were also given serious consideration, but the former was rejected as being “too competitive” while the latter was deemed to be a potentially negative influence on young officers due to its glorification of excess speed and failure to respect legal speed limits.</p><p>When asked for comment, Brigadier General Shaniqua Rodriguez expressed reservations about the new policy, saying:  “The Ungame be cool and I rockin the hells outta DDR, but I ain’t kissing no mans nohow.  I don’t play that shit.  And what the White Man got against Uno?  It be too brown and shit?  They raciss!”</p><p>UPDATE: General Martin Dempsey, U.S. Army Chief of Staff, announced that “Uno, Chinese Checkers, and that African game where they clap and hop over sticks” would be added to the Army’s new training schedule, effective immediately.  He also announced that he would not attempt to kiss Brigadier General Rodriguez even if the bottle pointed in her direction, commenting that “while she is fly, she is one crazy-ass Lebanese.”</p></div>",
  "content_text": "Jim Lacey on\nthe death of U.S. military strategy\n:\nI teach strategy to Marines and other military officers for a living. The classes hear ad nauseam that if your plan does not include any directions as to how to carry it out, and how to obtain resources for it, then you do not have a strategy. You have an aspiration. The NMS has a lot of aspirations. There are several dozen of them in the first few pages alone. One has to wade through eight pages of aspirations before coming to: “The core task of our Armed Forces remains to defend our Nation and win its wars.” Wow! I would have led with that one.\nMilitary strategists might wonder why the authors of the NMS made them wade through a third of the document before getting to the crucial reason of why we maintain a military in the first place. One might even wonder if the NMS authors really mean that winning wars is job number one, since elsewhere in the document you find: “Lastly, we will be prepared to act as security guarantor — preferably with partners and allies, but alone if necessary — to deter and defeat acts of aggression.” Lastly? Really? Since page one says, “Our foremost priority is the security of the American people, our territory, and our way of life,” one wonders what activities are so important that the military has moved defeating aggression to last in its order of concerns.\nIn related news, the U.S. Army recently reported that its officers will no longer utilize wargames as part of their military training, but will instead incorporate a rigorous program that includes\nThe Ungame\n, “a non-competitive learning game of conversation that fosters listening skills as well as self-expression”,\nDance Dance Revolution\n, and the popular teen party game\nSpin the Bottle\n.  Two card games,\nUno\nand\nMille Bournes\n, were also given serious consideration, but the former was rejected as being “too competitive” while the latter was deemed to be a potentially negative influence on young officers due to its glorification of excess speed and failure to respect legal speed limits.\nWhen asked for comment, Brigadier General Shaniqua Rodriguez expressed reservations about the new policy, saying:  “The Ungame be cool and I rockin the hells outta DDR, but I ain’t kissing no mans nohow.  I don’t play that shit.  And what the White Man got against Uno?  It be too brown and shit?  They raciss!”\nUPDATE: General Martin Dempsey, U.S. Army Chief of Staff, announced that “Uno, Chinese Checkers, and that African game where they clap and hop over sticks” would be added to the Army’s new training schedule, effective immediately.  He also announced that he would not attempt to kiss Brigadier General Rodriguez even if the bottle pointed in her direction, commenting that “while she is fly, she is one crazy-ass Lebanese.”",
  "tags": [
    "war"
  ],
  "categories": [],
  "sitemap_lastmod": "2011-07-21T09:10:00+00:00"
}