{
  "url": "https://voxday.net/2011/07/14/cackling-while-rome-drowns/",
  "scraped_at": "2025-12-13T23:16:15.561972",
  "title": "Cackling while Rome drowns",
  "date_display": "July 14, 2011",
  "date_iso": "2011-07-14T13:15:00+00:00",
  "date_from_url": "2011-07-14",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>Miss Coulter appears to be under the extraordinary impression that <a href=\"http://www.wnd.com/index.php?fa=PAGE.view&amp;pageId=321957\">preemptive surrender is a brilliant political tactic</a>:</p><blockquote><p>Sen. Mitch McConnell, R-Ky., has checkmated the Democrats. He has proposed a bill that will allow Obama to raise the debt ceiling three times, up to $2.4 trillion, over the next 18 months, but only provided Obama proposes equivalent cuts in spending each time.  Finally, the Democrats will be forced to pony up spending cuts – or default on the debt and crash the economy.</p><p>Contrary to some hysterical Republicans, McConnell’s bill does not forfeit any of Congress’ authority: The House and Senate will still have to decide whether to accept Obama’s proposed cuts when they write their appropriations bills.</p><p>But we will finally get some proposed cuts to federal programs from Obama, and not more nonsense about theoretical savings from “investing” in our children’s future with additional spending on Pell grants and prenatal counseling.</p><p>McConnell’s deal cleanly takes the debt-ceiling issue off the Republicans’ back and puts it on the president’s back. Either the Democrats tell us what they’ll cut or they’ll have to admit: “We will never cut anything. Everything Ann Coulter says about us is true!”</p></blockquote><p>McConnell’s “schooling” of Obama on the debt ceiling is an epic one and ranks with Chamberlain’s schooling of Hitler at Munich and King Guy’s schooling of Saladin at the Horns of Hattin.  Ann has clearly been spending far too much time orbiting around the New York-Washington axis as she has clearly failed to recognize how Americans who are paying attention to the issue, particularly Tea Party Republicans, are going to view the raising of the debt ceiling, not once, not twice, but three times <i>in advance</i>, with about the same degree of favor as neocons would view the US Air Force giving three SLBM-equipped nuclear submarines to Iran.</p><p>The idea that anything negative is going to be blamed on the president by his de facto press agency is completely absurd.  If recent articles are any indication, they’ll probably just keep blaming Bush and the people who get their news from the news will believe it.  It is astonishing that a media star such as Coulter still doesn’t understand that it doesn’t matter what actually happens, because the narrative remains.</p><p>Coulter also demonstrates that she knows literally nothing about economics.  A failure to raise the debt ceiling will not cause default but it will crash the economy.  Spending cuts will also crash the economy.  This is because the private economy has already crashed and all that is preventing this from being completely apparent to everyone is all the government spending, <a href=\"http://mercatus.org/publication/how-much-federal-spending-borrowed-every-dollar\">43% of which is presently borrowed</a>.</p><p>As I pointed out two years ago in RGD, this crash isn’t something that can be avoided.  It was inevitable.  It was eminently predictable and it was, in fact, predicted by numerous economic observers.  Raising the debt ceiling will only make things worse by digging the hole yet deeper and allowing the extension of the extend-and-pretend strategy.  But the strategy is not only logically absurd, we have 21 years of empirical evidence demonstrating that it hasn’t worked in Japan and are now approaching three years of showing that it hasn’t worked in Europe or the USA.</p><p>This is why the political considerations to which Coulter is appealing are not only incorrect – and they are incorrect as the public rejects a debt-ceiling increase by 58 to 36 percent, including <i>38 percent of Democrats</i> – more importantly, they are irrelevant.  The only responsible thing, the only relevant thing, that the House Republicans can do is to refuse to accept any deal that raises the debt ceiling for any reason.  The economy will crash, this is certain, but the vital point is that until it does, absolutely none of the necessary restructuring can begin to take place.</p></div>",
  "content_text": "Miss Coulter appears to be under the extraordinary impression that\npreemptive surrender is a brilliant political tactic\n:\nSen. Mitch McConnell, R-Ky., has checkmated the Democrats. He has proposed a bill that will allow Obama to raise the debt ceiling three times, up to $2.4 trillion, over the next 18 months, but only provided Obama proposes equivalent cuts in spending each time.  Finally, the Democrats will be forced to pony up spending cuts – or default on the debt and crash the economy.\nContrary to some hysterical Republicans, McConnell’s bill does not forfeit any of Congress’ authority: The House and Senate will still have to decide whether to accept Obama’s proposed cuts when they write their appropriations bills.\nBut we will finally get some proposed cuts to federal programs from Obama, and not more nonsense about theoretical savings from “investing” in our children’s future with additional spending on Pell grants and prenatal counseling.\nMcConnell’s deal cleanly takes the debt-ceiling issue off the Republicans’ back and puts it on the president’s back. Either the Democrats tell us what they’ll cut or they’ll have to admit: “We will never cut anything. Everything Ann Coulter says about us is true!”\nMcConnell’s “schooling” of Obama on the debt ceiling is an epic one and ranks with Chamberlain’s schooling of Hitler at Munich and King Guy’s schooling of Saladin at the Horns of Hattin.  Ann has clearly been spending far too much time orbiting around the New York-Washington axis as she has clearly failed to recognize how Americans who are paying attention to the issue, particularly Tea Party Republicans, are going to view the raising of the debt ceiling, not once, not twice, but three times\nin advance\n, with about the same degree of favor as neocons would view the US Air Force giving three SLBM-equipped nuclear submarines to Iran.\nThe idea that anything negative is going to be blamed on the president by his de facto press agency is completely absurd.  If recent articles are any indication, they’ll probably just keep blaming Bush and the people who get their news from the news will believe it.  It is astonishing that a media star such as Coulter still doesn’t understand that it doesn’t matter what actually happens, because the narrative remains.\nCoulter also demonstrates that she knows literally nothing about economics.  A failure to raise the debt ceiling will not cause default but it will crash the economy.  Spending cuts will also crash the economy.  This is because the private economy has already crashed and all that is preventing this from being completely apparent to everyone is all the government spending,\n43% of which is presently borrowed\n.\nAs I pointed out two years ago in RGD, this crash isn’t something that can be avoided.  It was inevitable.  It was eminently predictable and it was, in fact, predicted by numerous economic observers.  Raising the debt ceiling will only make things worse by digging the hole yet deeper and allowing the extension of the extend-and-pretend strategy.  But the strategy is not only logically absurd, we have 21 years of empirical evidence demonstrating that it hasn’t worked in Japan and are now approaching three years of showing that it hasn’t worked in Europe or the USA.\nThis is why the political considerations to which Coulter is appealing are not only incorrect – and they are incorrect as the public rejects a debt-ceiling increase by 58 to 36 percent, including\n38 percent of Democrats\n– more importantly, they are irrelevant.  The only responsible thing, the only relevant thing, that the House Republicans can do is to refuse to accept any deal that raises the debt ceiling for any reason.  The economy will crash, this is certain, but the vital point is that until it does, absolutely none of the necessary restructuring can begin to take place.",
  "tags": [
    "economics",
    "politics"
  ],
  "categories": [],
  "sitemap_lastmod": "2011-07-14T12:15:00+00:00"
}