{
  "url": "https://voxday.net/2011/07/28/campaigning-against-reality/",
  "scraped_at": "2025-12-13T23:17:21.116705",
  "title": "Campaigning against reality",
  "date_display": "July 28, 2011",
  "date_iso": "2011-07-28T18:26:00+00:00",
  "date_from_url": "2011-07-28",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>The New York Times “symposium” called “Will the Norway Massacre Deflate Europe’s Right Wing? features nine contributors, none of whom see fit to depart from the very pro-immigration multiculturalism that was the obvious causal factor behind the recent Norwegian killings. <a href=\"http://www.nytimes.com/roomfordebate/2011/07/27/will-the-norway-massacre-deflate-europes-right-wing/the-best-way-to-deal-with-xenophobia\">This is a typical example</a> of the “insight” on offer.</p><blockquote><p>Far right parties throughout Europe draw upon two distinct constituencies. The first is a core of hardline racist bigots — many of these parties, like the British National Party and the Sweden Democrats emerged out of the neo-fascist swamp and some still live there. The bigots, however, have been joined by a swathe of new supporters whose hostility toward immigrants, minorities and Muslims is shaped less by old-fashioned racism than by a newfangled sense of fear and insecurity. Many have traditionally supported social democratic parties but feel abandoned by organizations that have largely cut links with their working class constituencies. Polls have shown that, even more than the rest of the population, such supporters appear dissatisfied with their lives, anxious about the future and distrustful of any authority figure.</p><p>There is little that can be done to sway the opinions of the hardline racists. We need, however, politically to engage with the wider support that now surrounds far right organizations. This does not mean pandering to their prejudices. It means, to the contrary, challenging those prejudices openly and robustly. It means, for instance, challenging the idea that immigration is responsible for the lack of jobs and housing, or that lower immigration would mean a lower crime rate, or that Western societies are becoming “Islamized.”</p></blockquote><p>That sounds like a promising approach.  Combat prejudices which are founded on observation and experience by challenging reality.  It is both self- and empirically evident that immigration reduces the amount of jobs available as well as the wages paid for them, that immigration drives up housing costs and reduces the housing stock available to the native population, and that immigrants from nations with higher crime rates tend to increase the crime rate.  And it is both obvious and verifiable that entire sections of Western societies are becoming “Islamized” and “Hispanicized”.</p><p>The media is uniformly convinced that the Norwegian killings are going to harm the political prospects of the anti-immigration, anti-Islamic European Right.  But they are completely wrong.  More of the indoctrination and exposure to diversity to which Anders Breivik was subjected for his entire life obviously will not prevent any future actions, indeed, they will <i>ensure</i> them.  Therefore, it is the political parties that are capable of taking steps to reduce the likelihood of similar attacks in the future are the ones that will benefit from the natural desire of the various electorates to avoid them.</p><p>As a general rule, people don’t hate those they don’t know, have never met, and with whom they are not forced to associate.  Exposure to other groups does not foster tolerance, but hatred.  Few Minnesotans had any opinion about Somalis twenty years ago.  Now, many Minnesotans despise them.  Multiculturalism and mass immigration is nothing more than a recipe for separatist intra-societal war.</p><p>It is totally illogical for the global media and the European Left to claim that an “atmosphere of opinion” was capable of influencing Breivik while they ignore the much larger influence of actual environmental experience.  After all, what is more likely to radicalize an individual, reading demographic statistics and editorials or visiting your sister in the hospital after she was raped by a member of the vibrant community?</p><p>Kenan Malik wrote: <i>“The question many Europeans are asking is “How can we stop the far right?” The question they should be asking is “How can we challenge anti-immigrant and anti-Islamic sentiment?””</i></p><p>The answer should be completely obvious.  Send the immigrants back to their native countries.  Anti-immigrant and anti-Islamic sentiment will be reduced to the extent that the immigrant population is. <i>Die Gedanken sind frei</i>, but eventually they do have to deal with the brick wall of <i>Wirklichkeit</i>.</p></div>",
  "content_text": "The New York Times “symposium” called “Will the Norway Massacre Deflate Europe’s Right Wing? features nine contributors, none of whom see fit to depart from the very pro-immigration multiculturalism that was the obvious causal factor behind the recent Norwegian killings.\nThis is a typical example\nof the “insight” on offer.\nFar right parties throughout Europe draw upon two distinct constituencies. The first is a core of hardline racist bigots — many of these parties, like the British National Party and the Sweden Democrats emerged out of the neo-fascist swamp and some still live there. The bigots, however, have been joined by a swathe of new supporters whose hostility toward immigrants, minorities and Muslims is shaped less by old-fashioned racism than by a newfangled sense of fear and insecurity. Many have traditionally supported social democratic parties but feel abandoned by organizations that have largely cut links with their working class constituencies. Polls have shown that, even more than the rest of the population, such supporters appear dissatisfied with their lives, anxious about the future and distrustful of any authority figure.\nThere is little that can be done to sway the opinions of the hardline racists. We need, however, politically to engage with the wider support that now surrounds far right organizations. This does not mean pandering to their prejudices. It means, to the contrary, challenging those prejudices openly and robustly. It means, for instance, challenging the idea that immigration is responsible for the lack of jobs and housing, or that lower immigration would mean a lower crime rate, or that Western societies are becoming “Islamized.”\nThat sounds like a promising approach.  Combat prejudices which are founded on observation and experience by challenging reality.  It is both self- and empirically evident that immigration reduces the amount of jobs available as well as the wages paid for them, that immigration drives up housing costs and reduces the housing stock available to the native population, and that immigrants from nations with higher crime rates tend to increase the crime rate.  And it is both obvious and verifiable that entire sections of Western societies are becoming “Islamized” and “Hispanicized”.\nThe media is uniformly convinced that the Norwegian killings are going to harm the political prospects of the anti-immigration, anti-Islamic European Right.  But they are completely wrong.  More of the indoctrination and exposure to diversity to which Anders Breivik was subjected for his entire life obviously will not prevent any future actions, indeed, they will\nensure\nthem.  Therefore, it is the political parties that are capable of taking steps to reduce the likelihood of similar attacks in the future are the ones that will benefit from the natural desire of the various electorates to avoid them.\nAs a general rule, people don’t hate those they don’t know, have never met, and with whom they are not forced to associate.  Exposure to other groups does not foster tolerance, but hatred.  Few Minnesotans had any opinion about Somalis twenty years ago.  Now, many Minnesotans despise them.  Multiculturalism and mass immigration is nothing more than a recipe for separatist intra-societal war.\nIt is totally illogical for the global media and the European Left to claim that an “atmosphere of opinion” was capable of influencing Breivik while they ignore the much larger influence of actual environmental experience.  After all, what is more likely to radicalize an individual, reading demographic statistics and editorials or visiting your sister in the hospital after she was raped by a member of the vibrant community?\nKenan Malik wrote:\n“The question many Europeans are asking is “How can we stop the far right?” The question they should be asking is “How can we challenge anti-immigrant and anti-Islamic sentiment?””\nThe answer should be completely obvious.  Send the immigrants back to their native countries.  Anti-immigrant and anti-Islamic sentiment will be reduced to the extent that the immigrant population is.\nDie Gedanken sind frei\n, but eventually they do have to deal with the brick wall of\nWirklichkeit\n.",
  "tags": [
    "immigration"
  ],
  "categories": [],
  "sitemap_lastmod": "2011-07-28T17:26:00+00:00"
}