{
  "url": "https://voxday.net/2011/07/02/check-under-ma/",
  "scraped_at": "2025-12-13T23:15:22.640909",
  "title": "Check under the math",
  "date_display": "July 2, 2011",
  "date_iso": "2011-07-02T15:08:00+00:00",
  "date_from_url": "2011-07-02",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>It’s always a good idea to verify that you’re not being <a href=\"http://mises.org/daily/5413/How-Mathematics-Can-Make-Smart-People-Dumb\">subjected to a snow job</a>.  Or worse, subjecting yourself to one:</p><blockquote><p>One of the most common errors in applied mathematical analysis is to fail to notice when a mathematical argument proves too much. This occurs when the same argument can be deployed more generally than in the particular case being considered, and in other cases where it can be deployed it leads to conclusions that are clearly absurd.[2] Though this can occur more generally — in nonmathematical reasoning — it is a particularly acute danger in applied mathematics, due to the fact that understanding mathematical arguments generally requires a high level of training and intellectual effort. It is very easy to get lost in equations and theorems and fail to see the forest for the trees.<br> An Example of Applied Mathematics Going Horribly Wrong</br></p><p>Let me give you an example of this phenomenon in action. The Australian government recently announced that it will attempt to enact legislation to impose a tax on industrial carbon-dioxide emissions, with some of the revenue being earmarked as compensation for affected consumers. At a pro-government political rally in Sydney, a young activist proudly displayed what he clearly thought to be a devastating economic argument in favor of this “carbon-pricing” scheme.</p><p>To those readers who have not studied neoclassical microeconomics, this is probably just a big bunch of gibberish. But to those who have, it should look quite familiar. The graph is a “utility analysis,” which purports to show that imposing a tax on polluting products (which increases their price) and simultaneously giving compensation back to consumers would make them better off than they were initially — in other words, it purports to show that the Australian government’s proposed scheme, or something like it, would make people better off.</p><p>This is a classic example of a mathematical analysis that proves too much. Notice, in the graph in the sign, that the two products are labeled “C” (for clean products) and “P” (for polluting products). Although they are labeled in this way, the fact that the horizontal axis represents the consumption of polluting products plays absolutely no part in the analysis. There is nothing in the graph representing the pollution that these products cause, and so the label is merely a name. The letter “P” is nothing more than an algebraic symbol, one that could just as easily stand for pies, pastries, printers, pizzas, polka lessons, picture frames, pole dancing, ponies, popcorn, pool tables, poppy-seed muffins, pornography, postcards, potatoes, potpourri, poultry, pumpkins, puppies, pudding, or any other good or service (including goods and services that don’t start with the letter “P”).</p><p>Thus, by the exact same mathematical argument, the graph implicitly purports to show that a government can make people better off by taxing any good and then compensating the consumers of that good. Though the government taxes the polluting products in the graph, the sign maker could just as easily have switched the labels on the axes so that the government taxes the clean products, and the result, according to the same analysis, would still be a consumer who is better off.</p></blockquote><p>Actually, one of the problems that I occasionally encounter is that if I spend too long analyzing something, it eventually all starts to look completely nonsensical.  I thought I had finished a draft of the third inflation video last night, then found myself going back and checking on a few details… and eventually got to the point where even a simple calculation like the difference between nominal and real GDP was beginning to look like an ancient series of glyphs scratched out by the Mad Arab.  At one point, I had either proved that inflation cannot, in fact, exist, or that there has not been any economic growth since approximately 1566.  Color me skeptical.</p><p>I don’t think it helped that I’d been reading a few chapters from the Aristotle’s <i>Rhetoric</i> earlier in the day.  Which, I notice, makes it clear that the sign referenced in the article is an enthymeme attempting to pass itself off as a syllogism.  However, as Mr. O’Neill adroitly demonstrates, it is only an apparent syllogism and therefore the enthymeme is a false one.</p><p>Anyhow, I am prescribed a solution:  close the spreadsheets, put down the Aristotle, and find a nice, mindless novel to read.  As it happens, I’d been meaning to get around to R. Scott Bakker’s books anyhow.  So don’t expect much in the way of insight or brilliance this weekend.</p></div>",
  "content_text": "It’s always a good idea to verify that you’re not being\nsubjected to a snow job\n.  Or worse, subjecting yourself to one:\nOne of the most common errors in applied mathematical analysis is to fail to notice when a mathematical argument proves too much. This occurs when the same argument can be deployed more generally than in the particular case being considered, and in other cases where it can be deployed it leads to conclusions that are clearly absurd.[2] Though this can occur more generally — in nonmathematical reasoning — it is a particularly acute danger in applied mathematics, due to the fact that understanding mathematical arguments generally requires a high level of training and intellectual effort. It is very easy to get lost in equations and theorems and fail to see the forest for the trees.\nAn Example of Applied Mathematics Going Horribly Wrong\nLet me give you an example of this phenomenon in action. The Australian government recently announced that it will attempt to enact legislation to impose a tax on industrial carbon-dioxide emissions, with some of the revenue being earmarked as compensation for affected consumers. At a pro-government political rally in Sydney, a young activist proudly displayed what he clearly thought to be a devastating economic argument in favor of this “carbon-pricing” scheme.\nTo those readers who have not studied neoclassical microeconomics, this is probably just a big bunch of gibberish. But to those who have, it should look quite familiar. The graph is a “utility analysis,” which purports to show that imposing a tax on polluting products (which increases their price) and simultaneously giving compensation back to consumers would make them better off than they were initially — in other words, it purports to show that the Australian government’s proposed scheme, or something like it, would make people better off.\nThis is a classic example of a mathematical analysis that proves too much. Notice, in the graph in the sign, that the two products are labeled “C” (for clean products) and “P” (for polluting products). Although they are labeled in this way, the fact that the horizontal axis represents the consumption of polluting products plays absolutely no part in the analysis. There is nothing in the graph representing the pollution that these products cause, and so the label is merely a name. The letter “P” is nothing more than an algebraic symbol, one that could just as easily stand for pies, pastries, printers, pizzas, polka lessons, picture frames, pole dancing, ponies, popcorn, pool tables, poppy-seed muffins, pornography, postcards, potatoes, potpourri, poultry, pumpkins, puppies, pudding, or any other good or service (including goods and services that don’t start with the letter “P”).\nThus, by the exact same mathematical argument, the graph implicitly purports to show that a government can make people better off by taxing any good and then compensating the consumers of that good. Though the government taxes the polluting products in the graph, the sign maker could just as easily have switched the labels on the axes so that the government taxes the clean products, and the result, according to the same analysis, would still be a consumer who is better off.\nActually, one of the problems that I occasionally encounter is that if I spend too long analyzing something, it eventually all starts to look completely nonsensical.  I thought I had finished a draft of the third inflation video last night, then found myself going back and checking on a few details… and eventually got to the point where even a simple calculation like the difference between nominal and real GDP was beginning to look like an ancient series of glyphs scratched out by the Mad Arab.  At one point, I had either proved that inflation cannot, in fact, exist, or that there has not been any economic growth since approximately 1566.  Color me skeptical.\nI don’t think it helped that I’d been reading a few chapters from the Aristotle’s\nRhetoric\nearlier in the day.  Which, I notice, makes it clear that the sign referenced in the article is an enthymeme attempting to pass itself off as a syllogism.  However, as Mr. O’Neill adroitly demonstrates, it is only an apparent syllogism and therefore the enthymeme is a false one.\nAnyhow, I am prescribed a solution:  close the spreadsheets, put down the Aristotle, and find a nice, mindless novel to read.  As it happens, I’d been meaning to get around to R. Scott Bakker’s books anyhow.  So don’t expect much in the way of insight or brilliance this weekend.",
  "tags": [
    "trainwreck"
  ],
  "categories": [],
  "sitemap_lastmod": "2011-07-02T14:08:00+00:00"
}