{
  "url": "https://voxday.net/2011/07/27/confront-cow-destroy/",
  "scraped_at": "2025-12-13T23:17:13.743833",
  "title": "Confront, cow, destroy",
  "date_display": "July 27, 2011",
  "date_iso": "2011-07-27T11:48:00+00:00",
  "date_from_url": "2011-07-27",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>At times, even people who agree with me wonder why I have a tendency to utilize my superior intelligence as if it were a hammer to be applied to an interlocutor’s fragile teeth.  What they fail to understand that this has nothing to do with any personal insecurities or internal need to advertise the readily apparent, it is simply that it happens to be the rhetorical method I have found to be most effective.  That doesn’t mean I prefer it to the dialectical method when that is a legitimate option, but here is <a href=\"http://takimag.com/article/an_alien_pod_person_in_a_room_full_of_leftists\">an example</a> of the costs of eschewing any such technique:</p><blockquote><p>What happened next is what happens every time you depart from orthodoxy: group panic. We’ve all been there. You don’t want to wreck everyone’s good time and you wish everyone could keep cool, but allowing their hysteria to censor you is ridiculous, so you open your big mouth. “I’m dubious,” I said. He didn’t believe me. I assured him I wasn’t kidding. He remained skeptical. I finally convinced him I wasn’t playing devil’s advocate.</p><p>Bang! Tony is up on his feet and his finger is in my face. (They always do that.) “Do you realize that 60% of this country believes in creationism? That’s who you’re associating yourself with. Do you believe in creationism, too?” I stood up and tried to explain the logical fallacy of guilt by association, but now his wife and two other people were standing and finger-pointing, too. “Don’t you think it’s strange that the science against global warming is all funded by oil companies?” Then they did this thing liberals do where they make a sarcastic idiot face with their finger on their chin and say, “Hmm, I wonder why that could be? Gee, I guess they care about science. Yeah, that’s it.” I had to yell to be heard at this point and kept saying, “I don’t care who’s saying it or what anyone’s motive is to say anything. John Wayne Gacy can tell me murder is wrong, and it’s still wrong. All I care about is the facts.” I told them Hitler used toilet paper but that doesn’t mean we’re tied in with his shit just because we use it, too. I even yelled, “All cats are mammals. All dogs are mammals. All cats are not dogs.” But I couldn’t get a word in edgewise. This screaming match wasn’t meant to get to the truth. It was meant to wake me up from being an ignorant heretic who’d chosen the Dark Side. They allowed zero possibility I knew what I was talking about. I disagreed with them and therefore I was ignorant.</p></blockquote><p>In his <i>Rhetoric</i>, Aristotle noted that for some audiences, “not even the possession of the exactest knowledge will make it easy for what we say to produce conviction.”  I would go even further and suggest that for some audiences, conviction remains impossible.  The behavior that McInnes is describing is indicative of precisely such an audience.  Appeals to Aristotelian dialectic – otherwise known as logic – is useless and will accomplish absolutely nothing, as McInnes recounts in his story.  If you are reduced to explaining “all dogs are not cats”, you are most certainly dealing with an audience of the sort that Aristotle deemed susceptible only to rhetoric.</p><p>The rhetorical audience relies heavily, indeed, almost entirely, upon appeals to authority and emotion.  That is why they usually drift toward tangents concerning motivations, because they are attempting to impugn the authority to which they believe their opponent is appealing.  (The alternative is emotional appeals, which are self-evident.)  This makes little sense when the “authority” is mere factual reality, but since facts rely upon sources, any such sources provided can always be attacked, which in the eye of the rhetorical audience is somehow tantamount to refutation.  “I have rebutted it because I said it was wrong” is a commonly heard formulation.</p><p>The thing that must be kept in mind when dealing with a rhetorical audience is that it doesn’t know very much and isn’t very intelligent.  That’s why rhetoricians usually rely upon others to do their thinking for them.  Establish that you are not only more intelligent than they are, but more intelligent than their precious authorities as well, and they have literally no recourse beyond the usual game of evasion and aspersion.</p><p>The first step is confrontation.  Being accustomed to groupthink, this throws them immediately off-kilter.  They will respond with all the sarcasm and heated emotion that McInnes describes.  This is where many conservatives make a mistake and back down for fear of social disruption, but the important thing to remember is that you have not caused it and you are not responsible for it.  Barring job interviews, there is no situation wherein etiquette that demands mindless acquiescence to every provocative assertion.  But don’t meet heat with heat, meet it with ice, although calm words combined with a slight half-smile can be useful if you wish to entirely emotionally discombobulate the rhetorician.</p><p>The next step is to cow them.  This is best used through application of the Socratic method.  Don’t make any assertions, simply ask questions that will reveal, to them and everyone else, how devoid of actual knowledge they are.  This is frightfully easy because most rhetoricians are prone to instinctive lying.  If you are sufficiently well-informed, you can simply methodically expose each of their lies as they are presented.  Credentials can be useful at this point; remember, you’re not dealing with a dialectical audience here that is capable of recognizing logical fallacies.  I occasionally find it more amusing to “win” an argument using an argument I know to be fallacious because my interlocutor is too inept to spot the flaw in it than by using a correct one, but then, I am an Award-Winning Cruelty Artist so I don’t recommend this to the average dialectician.</p><p>Finally, once they have been sufficiently cowed, it is time to destroy them.  This comes in three forms, the Implosion, the Submission, or the Run Away Run Away.  I am always impressed when a rhetorical crowd is able to submit, because it indicates that they have at least understood that their position is wrong and they are theoretically capable of learning.  The Implosion is probably the most satisfying, simply because it is funny.  I enjoy few things more than watching an arrogant and overmatched individual publicly go into a complete emotional meltdown because he simply cannot bear to admit that he was wrong.  Of course, the point isn’t the pleasure one might take in it, but rather, that everyone who witnesses the Implosion will recognize that the position was untenable.</p><p>And then there is the response we see so often on this blog, which is the Run Away Run Away response, which in its Internet form is better described as the Retreat Into Silence.  PZ Myers is a good example of this response, which involves leaving your stunned well-wishers grasping at ever increasingly improbable explanations for your failure to even attempt to defend your position.</p><p>Anyhow, the next time a clueless member of the rhetorical crowd is emitting sarcastic commentaries, casting aspersions about your motivations, or showing signs of wanting to wave a finger in your face, just remember the acronym CCD.  Confront, Cow, Destroy.  The additional benefit, in addition to peace of mind, is that not only will rhetoricians soon become reluctant to so much as cluck any absurdities in your direction, but women also tend to view everyone else’s intellectual fear of you as social dominance, which naturally enhances your attractiveness to them.</p><p>Sure, they may well complain to all and sundry that you’re a jerk and so forth.  But remember, translated from chickspeak, all that means is that they wish you’d hit on them.</p></div>",
  "content_text": "At times, even people who agree with me wonder why I have a tendency to utilize my superior intelligence as if it were a hammer to be applied to an interlocutor’s fragile teeth.  What they fail to understand that this has nothing to do with any personal insecurities or internal need to advertise the readily apparent, it is simply that it happens to be the rhetorical method I have found to be most effective.  That doesn’t mean I prefer it to the dialectical method when that is a legitimate option, but here is\nan example\nof the costs of eschewing any such technique:\nWhat happened next is what happens every time you depart from orthodoxy: group panic. We’ve all been there. You don’t want to wreck everyone’s good time and you wish everyone could keep cool, but allowing their hysteria to censor you is ridiculous, so you open your big mouth. “I’m dubious,” I said. He didn’t believe me. I assured him I wasn’t kidding. He remained skeptical. I finally convinced him I wasn’t playing devil’s advocate.\nBang! Tony is up on his feet and his finger is in my face. (They always do that.) “Do you realize that 60% of this country believes in creationism? That’s who you’re associating yourself with. Do you believe in creationism, too?” I stood up and tried to explain the logical fallacy of guilt by association, but now his wife and two other people were standing and finger-pointing, too. “Don’t you think it’s strange that the science against global warming is all funded by oil companies?” Then they did this thing liberals do where they make a sarcastic idiot face with their finger on their chin and say, “Hmm, I wonder why that could be? Gee, I guess they care about science. Yeah, that’s it.” I had to yell to be heard at this point and kept saying, “I don’t care who’s saying it or what anyone’s motive is to say anything. John Wayne Gacy can tell me murder is wrong, and it’s still wrong. All I care about is the facts.” I told them Hitler used toilet paper but that doesn’t mean we’re tied in with his shit just because we use it, too. I even yelled, “All cats are mammals. All dogs are mammals. All cats are not dogs.” But I couldn’t get a word in edgewise. This screaming match wasn’t meant to get to the truth. It was meant to wake me up from being an ignorant heretic who’d chosen the Dark Side. They allowed zero possibility I knew what I was talking about. I disagreed with them and therefore I was ignorant.\nIn his\nRhetoric\n, Aristotle noted that for some audiences, “not even the possession of the exactest knowledge will make it easy for what we say to produce conviction.”  I would go even further and suggest that for some audiences, conviction remains impossible.  The behavior that McInnes is describing is indicative of precisely such an audience.  Appeals to Aristotelian dialectic – otherwise known as logic – is useless and will accomplish absolutely nothing, as McInnes recounts in his story.  If you are reduced to explaining “all dogs are not cats”, you are most certainly dealing with an audience of the sort that Aristotle deemed susceptible only to rhetoric.\nThe rhetorical audience relies heavily, indeed, almost entirely, upon appeals to authority and emotion.  That is why they usually drift toward tangents concerning motivations, because they are attempting to impugn the authority to which they believe their opponent is appealing.  (The alternative is emotional appeals, which are self-evident.)  This makes little sense when the “authority” is mere factual reality, but since facts rely upon sources, any such sources provided can always be attacked, which in the eye of the rhetorical audience is somehow tantamount to refutation.  “I have rebutted it because I said it was wrong” is a commonly heard formulation.\nThe thing that must be kept in mind when dealing with a rhetorical audience is that it doesn’t know very much and isn’t very intelligent.  That’s why rhetoricians usually rely upon others to do their thinking for them.  Establish that you are not only more intelligent than they are, but more intelligent than their precious authorities as well, and they have literally no recourse beyond the usual game of evasion and aspersion.\nThe first step is confrontation.  Being accustomed to groupthink, this throws them immediately off-kilter.  They will respond with all the sarcasm and heated emotion that McInnes describes.  This is where many conservatives make a mistake and back down for fear of social disruption, but the important thing to remember is that you have not caused it and you are not responsible for it.  Barring job interviews, there is no situation wherein etiquette that demands mindless acquiescence to every provocative assertion.  But don’t meet heat with heat, meet it with ice, although calm words combined with a slight half-smile can be useful if you wish to entirely emotionally discombobulate the rhetorician.\nThe next step is to cow them.  This is best used through application of the Socratic method.  Don’t make any assertions, simply ask questions that will reveal, to them and everyone else, how devoid of actual knowledge they are.  This is frightfully easy because most rhetoricians are prone to instinctive lying.  If you are sufficiently well-informed, you can simply methodically expose each of their lies as they are presented.  Credentials can be useful at this point; remember, you’re not dealing with a dialectical audience here that is capable of recognizing logical fallacies.  I occasionally find it more amusing to “win” an argument using an argument I know to be fallacious because my interlocutor is too inept to spot the flaw in it than by using a correct one, but then, I am an Award-Winning Cruelty Artist so I don’t recommend this to the average dialectician.\nFinally, once they have been sufficiently cowed, it is time to destroy them.  This comes in three forms, the Implosion, the Submission, or the Run Away Run Away.  I am always impressed when a rhetorical crowd is able to submit, because it indicates that they have at least understood that their position is wrong and they are theoretically capable of learning.  The Implosion is probably the most satisfying, simply because it is funny.  I enjoy few things more than watching an arrogant and overmatched individual publicly go into a complete emotional meltdown because he simply cannot bear to admit that he was wrong.  Of course, the point isn’t the pleasure one might take in it, but rather, that everyone who witnesses the Implosion will recognize that the position was untenable.\nAnd then there is the response we see so often on this blog, which is the Run Away Run Away response, which in its Internet form is better described as the Retreat Into Silence.  PZ Myers is a good example of this response, which involves leaving your stunned well-wishers grasping at ever increasingly improbable explanations for your failure to even attempt to defend your position.\nAnyhow, the next time a clueless member of the rhetorical crowd is emitting sarcastic commentaries, casting aspersions about your motivations, or showing signs of wanting to wave a finger in your face, just remember the acronym CCD.  Confront, Cow, Destroy.  The additional benefit, in addition to peace of mind, is that not only will rhetoricians soon become reluctant to so much as cluck any absurdities in your direction, but women also tend to view everyone else’s intellectual fear of you as social dominance, which naturally enhances your attractiveness to them.\nSure, they may well complain to all and sundry that you’re a jerk and so forth.  But remember, translated from chickspeak, all that means is that they wish you’d hit on them.",
  "tags": [
    "game theory"
  ],
  "categories": [],
  "sitemap_lastmod": "2011-07-27T10:48:00+00:00"
}