{
  "url": "https://voxday.net/2011/07/03/cruel-world-of-r-scott-bakker/",
  "scraped_at": "2025-12-13T23:15:26.275432",
  "title": "The Crüel World of R. Scött Bâkkër",
  "date_display": "July 3, 2011",
  "date_iso": "2011-07-03T10:54:00+00:00",
  "date_from_url": "2011-07-03",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>After <a href=\"http://www.milobookclub.com/2011/02/24/lets-try-this-one-more-time/\">some back-and-forth discussions</a> pursuant to my opining on the New Nihilism of George R.R. Martin, Joe Abercrombie and others in a post entitled <a href=\"http://www.blackgate.com/2011/02/20/the-decline-and-fall-of-the-fantasy-novel/\">The Decline and Fall of the Fantasy Novel</a>, I found myself interested in the works of my interlocutor, who happened to be the author of <em>The Prince of Nothing</em> series as well as a second series entitled <em>The Aspect Emperor</em>.  It’s too soon to write a review, as I have only finished the first book in the series, <i>The Darkness That Comes Before</i>.  However, there are already five things that are readily apparent about Mr. Bakker’s fiction:</p><p>Read the rest at <a href=\"http://www.blackgate.com/2011/07/03/the-cruel-world-of-r-scott-bakker/\">The Blâck Gátë</a></p></div>",
  "content_text": "After\nsome back-and-forth discussions\npursuant to my opining on the New Nihilism of George R.R. Martin, Joe Abercrombie and others in a post entitled\nThe Decline and Fall of the Fantasy Novel\n, I found myself interested in the works of my interlocutor, who happened to be the author of\nThe Prince of Nothing\nseries as well as a second series entitled\nThe Aspect Emperor\n.  It’s too soon to write a review, as I have only finished the first book in the series,\nThe Darkness That Comes Before\n.  However, there are already five things that are readily apparent about Mr. Bakker’s fiction:\nRead the rest at\nThe Blâck Gátë",
  "tags": [
    "Black Gate",
    "books"
  ],
  "categories": [],
  "sitemap_lastmod": "2011-07-03T09:54:00+00:00"
}