{
  "url": "https://voxday.net/2011/07/24/dance-with-dragons-review-no-spoilers/",
  "scraped_at": "2025-12-13T23:16:59.805396",
  "title": "A Dance with Dragons review – no spoilers",
  "date_display": "July 24, 2011",
  "date_iso": "2011-07-24T18:20:00+00:00",
  "date_from_url": "2011-07-24",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>It was interesting to read George R.R. Martin’s latest so soon after seeing HBO’s <em>A Game of Thrones</em> and reading two fantasy series that some have attempted to compare to Martin’s epic, <em>The First Law</em> by Joe Abercrombie and <em>The Prince of Nothing</em> by R. Scott Bakker.  My first thought upon simply viewing the size of the tome was that Martin is clearly suffering from the same disease that inflicted Stephen King and JK Rowling before him.  It would appear that some time in between <em>A Storm of Swords</em> and <em>A Feast For Crows</em>, Martin came down with a bad case of <em>morbus nemendatorus</em>.  This is the illness which strikes an author after he has become so prodigiously successful that he no longer sees any need to pay heed to an editor.  It can be diagnosed on sight by the simple measuremen<i></i>t of the thickness of the first book in the series and comparing it with that of the last book in the series.  After reading <em>A Dance with Dragons</em>, it is abundantly clear that Mr. Martin has not yet recovered from it.</p><p>Read the rest <a href=\"http://www.blackgate.com/2011/07/24/a-dance-with-dragons-review-no-spoilers/\">at the Black Gate</a>.</p><p>UPDATE – Matthew David Surridge, who is one of the best critics in the SF/F genre, offers <a href=\"http://www.blackgate.com/2011/07/24/ruminations-on-ice-and-fire/\">a substantially different take</a> on the novel.</p></div>",
  "content_text": "It was interesting to read George R.R. Martin’s latest so soon after seeing HBO’s\nA Game of Thrones\nand reading two fantasy series that some have attempted to compare to Martin’s epic,\nThe First Law\nby Joe Abercrombie and\nThe Prince of Nothing\nby R. Scott Bakker.  My first thought upon simply viewing the size of the tome was that Martin is clearly suffering from the same disease that inflicted Stephen King and JK Rowling before him.  It would appear that some time in between\nA Storm of Swords\nand\nA Feast For Crows\n, Martin came down with a bad case of\nmorbus nemendatorus\n.  This is the illness which strikes an author after he has become so prodigiously successful that he no longer sees any need to pay heed to an editor.  It can be diagnosed on sight by the simple measuremen\nt of the thickness of the first book in the series and comparing it with that of the last book in the series.  After reading\nA Dance with Dragons\n, it is abundantly clear that Mr. Martin has not yet recovered from it.\nRead the rest\nat the Black Gate\n.\nUPDATE – Matthew David Surridge, who is one of the best critics in the SF/F genre, offers\na substantially different take\non the novel.",
  "tags": [
    "Black Gate",
    "books"
  ],
  "categories": [],
  "sitemap_lastmod": "2011-07-24T17:20:00+00:00"
}