{
  "url": "https://voxday.net/2011/07/30/eco-on-literal-readers/",
  "scraped_at": "2025-12-13T23:17:30.920784",
  "title": "Umberto Eco on literal readers",
  "date_display": "July 30, 2011",
  "date_iso": "2011-07-30T12:30:00+00:00",
  "date_from_url": "2011-07-30",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><blockquote><p><b><a href=\"http://espresso.repubblica.it/dettaglio/credulita-e-identificazione/2156866/18\">Credulity and identification</a></b></p><p>In the preceding “Bustina di Minerva” I wrote that many readers find it difficult to ascertain, in a novel, the reality of the fiction, and they tend to attribute to the author the passions and the thoughts of his characters.  To confirm this, I found a site on the internet that records the thoughts of various authors, and under “the quotes of Umberto Eco” I discovered this: “The Italian is unfaithful, a liar, vile, treacherous, he is is more comfortable with the dagger than with the sword, better with poison than with medicine, slippery in negotiation, and coherent only in that he changes his flag with every wind.”  It’s not that there isn’t something of the truth in all this, but it appears as if it is written by a foreign author.  In my novel, <i>The Cemetery of Prague</i>, this sentence is written by a gentleman who in the preceding pages has manifested a racist compulsion making use of all the most hoary old cliches.  From now on, I must be sure to never place banal characters in fictional scenes, otherwise one day they will attribute to me philosophies such as “one has but one mother”.</p><p>Now I read the last “Blown Glass” of Eugenio Scalfari, which reprises my previous “Bustina” and raises a new problem.  Scalfari agrees with the fact that there are people who confuse the fictional narrative for reality, but retains, (and rightly retains that I retained), that the fictional narrative can be truer than the truth in order to inspire identifications and perceptions of historical phenomenons, to create new modes of thought, etc.  And we must consider if one cannot be in accord with this opinion.</p><p>It is not only that the fictional narrative also confirms aesthetic conditions: a reader can very well know that Madame Bovary never existed and yet enjoy the style with which Flaubert constructs his character.  But here the aesthetic dimension can be seen to be in opposition to the “aletic” dimension, (that which has to do with the notion of the truth shared with logic, the sciences, or the judges that make courtroom decisions about the veracity of testimony declaring how a certain thing took place.)  They are two diverse dimensions; there are problems if a judge makes his decision based on how aesthetically a defendant lies to him.  I was occupied with the aletic dimension.  It is for the most part true that my reflections were born of an internal discourse on falsehood and the lie.  Is it false to say that a Vanna Marchi lotion will regrow hair?  It is false.  Is it false to say that Don Abbondio met two bravos?(1)  From the aletic point of view, yes, but the narrator does not want to tell us how much of the story is true or false, he pretends it is true and asks us to play along.  He asks us, as Coleridge recommended, “to suspend the disbelief”.</p><p>Scalfari cites <i>Werther</i>(2), and we know how many romantic young men and women identifying with the protagonist committed suicide.  Did they perhaps believe that the story was true?  Not necessarily, just as we know that Emma Bovary never existed and yet we are moved to tears on her behalf.  One recognizes a fiction as fictional, even as we immerse ourselves in the depths of a character.</p><p>It is that we intuit that even if Madame Bovary never existed, there exist many women like her, and it is perhaps as if she is also us to some extent and from her a lesson can be derived of life in general and of our own selves.  The ancient Greeks believed the things that befell Oedipus were true and reflected his fate.  Freud knew very well that Oedipus never existed, but read those events as a profound lesson on how the aspects of the unconscious operated.</p><p>What happens instead to the readers of whom I speak, those who don’t absolutely distinguish between fiction and reality?  Their situation does not have aesthetic validity.  To the extent they are inclined to take the story so seriously that they never ask if it is told well or poorly, they are not looking for instruction and they do not identify with the characters.  They simply manifest that which I will define as a fictional deficit; they are incapable of suspending their disbelief.  Since there are more of these readers than we think, it is worth the trouble to consider them because we know that all the questions of morals and aesthetics will elude them.</p></blockquote><p>(1) <i>The Betrothed</i>, Alessandro Manzoni<br> (2) This must mean <i>The Sorrows of Young Werther</i> by Goethe rather than the opera entitled <i>Werther</i> since the opera premiered 118 years after the book was published and well after the wave of the suicides it inspired.</br></p></div>",
  "content_text": "Credulity and identification\nIn the preceding “Bustina di Minerva” I wrote that many readers find it difficult to ascertain, in a novel, the reality of the fiction, and they tend to attribute to the author the passions and the thoughts of his characters.  To confirm this, I found a site on the internet that records the thoughts of various authors, and under “the quotes of Umberto Eco” I discovered this: “The Italian is unfaithful, a liar, vile, treacherous, he is is more comfortable with the dagger than with the sword, better with poison than with medicine, slippery in negotiation, and coherent only in that he changes his flag with every wind.”  It’s not that there isn’t something of the truth in all this, but it appears as if it is written by a foreign author.  In my novel,\nThe Cemetery of Prague\n, this sentence is written by a gentleman who in the preceding pages has manifested a racist compulsion making use of all the most hoary old cliches.  From now on, I must be sure to never place banal characters in fictional scenes, otherwise one day they will attribute to me philosophies such as “one has but one mother”.\nNow I read the last “Blown Glass” of Eugenio Scalfari, which reprises my previous “Bustina” and raises a new problem.  Scalfari agrees with the fact that there are people who confuse the fictional narrative for reality, but retains, (and rightly retains that I retained), that the fictional narrative can be truer than the truth in order to inspire identifications and perceptions of historical phenomenons, to create new modes of thought, etc.  And we must consider if one cannot be in accord with this opinion.\nIt is not only that the fictional narrative also confirms aesthetic conditions: a reader can very well know that Madame Bovary never existed and yet enjoy the style with which Flaubert constructs his character.  But here the aesthetic dimension can be seen to be in opposition to the “aletic” dimension, (that which has to do with the notion of the truth shared with logic, the sciences, or the judges that make courtroom decisions about the veracity of testimony declaring how a certain thing took place.)  They are two diverse dimensions; there are problems if a judge makes his decision based on how aesthetically a defendant lies to him.  I was occupied with the aletic dimension.  It is for the most part true that my reflections were born of an internal discourse on falsehood and the lie.  Is it false to say that a Vanna Marchi lotion will regrow hair?  It is false.  Is it false to say that Don Abbondio met two bravos?(1)  From the aletic point of view, yes, but the narrator does not want to tell us how much of the story is true or false, he pretends it is true and asks us to play along.  He asks us, as Coleridge recommended, “to suspend the disbelief”.\nScalfari cites\nWerther\n(2), and we know how many romantic young men and women identifying with the protagonist committed suicide.  Did they perhaps believe that the story was true?  Not necessarily, just as we know that Emma Bovary never existed and yet we are moved to tears on her behalf.  One recognizes a fiction as fictional, even as we immerse ourselves in the depths of a character.\nIt is that we intuit that even if Madame Bovary never existed, there exist many women like her, and it is perhaps as if she is also us to some extent and from her a lesson can be derived of life in general and of our own selves.  The ancient Greeks believed the things that befell Oedipus were true and reflected his fate.  Freud knew very well that Oedipus never existed, but read those events as a profound lesson on how the aspects of the unconscious operated.\nWhat happens instead to the readers of whom I speak, those who don’t absolutely distinguish between fiction and reality?  Their situation does not have aesthetic validity.  To the extent they are inclined to take the story so seriously that they never ask if it is told well or poorly, they are not looking for instruction and they do not identify with the characters.  They simply manifest that which I will define as a fictional deficit; they are incapable of suspending their disbelief.  Since there are more of these readers than we think, it is worth the trouble to consider them because we know that all the questions of morals and aesthetics will elude them.\n(1)\nThe Betrothed\n, Alessandro Manzoni\n(2) This must mean\nThe Sorrows of Young Werther\nby Goethe rather than the opera entitled\nWerther\nsince the opera premiered 118 years after the book was published and well after the wave of the suicides it inspired.",
  "tags": [
    "Eco",
    "writing"
  ],
  "categories": [],
  "sitemap_lastmod": "2011-07-30T11:30:00+00:00"
}