{
  "url": "https://voxday.net/2011/07/20/failure-of-atheist-cheerleading/",
  "scraped_at": "2025-12-13T23:16:41.362016",
  "title": "A failure of atheist cheerleading",
  "date_display": "July 20, 2011",
  "date_iso": "2011-07-20T09:37:00+00:00",
  "date_from_url": "2011-07-20",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>Apparently Miss Myers didn’t get the message that all books written by New Atheists are to be blindly defended, tooth and claw, rather than criticized for the flaws that are apparent to any intelligent reader.  I was both impressed and vastly amused <a href=\"http://lacrimae-rerum.org/?p=97\">by her scathingly dismissive review</a> of Sam Harris’s <i>The Moral Landscape</i>, as it was even harsher and more contemptuous than <a href=\"http://www.wnd.com/index.php?fa=PAGE.view&amp;pageId=231089\">my own review of it</a>.</p><blockquote><p>So, to summarise:</p><p>1.  Utilitarianism is right, but not any more justifiable than anything else. But who cares what other people think, anyway?</p><p>2.  Because utilitarianism is right, we don’t have to be loopy post-modernists.</p><p>3.  Science can tell us what makes us happy. Here’s a smattering of scientific studies about the brain.</p><p>Why in the hell do they give out book deals so easily? This book isn’t about convincing others, or providing novel ideas. It’s about pandering to atheists with very little knowledge of philosophy and ethics and an abundance of arrogance, telling them science is with them, and then reiterating how immoral people who like FGM and throwing acid in girls’ faces are and how we don’t have to listen to them because We Are Right. This is nothing but a convoluted rehashing of utilitarianism that still falls to the same old criticisms, and an immense waste of time unless you really like a good ignorant circlejerk.</p></blockquote><p>It would certainly be interesting to see Miss Myers review Sam Harris’s two previous books, to say nothing of the other books I addressed in <i>The Irrational Atheist</i>, with the same skeptical eye.  Regardless, it appears she will make a more challenging champion of atheism than her father ever has because she is willing to pay attention to the words as written and to think for herself rather than to simply parrot centuries-old talking points and froth at the mouth like some sort of performing bearded clown monkey.</p><p>It appears that I wasn’t the only one to notice the similarity in our conclusions concerning Harris’s book. <i>Unbelievable, PZ’s daughter is the female version of Vox Day. What’s next? anti-feminism, repeal of women’s right to vote, border control and Austrian economics?</i></p><p>We can always hope that sweet reason will triumph, even if we harbor few expectations of it.  And certainly, the intrinsic problem of utilitarian consequence pointed out by Miss Myers is not dissimilar to the famous Austrian explication of the impossibility of socialist price calculation.  I must say, however, that she was perhaps a little unfair to Sam Harris in failing to give him credit for at least attempting to make a necessary case that so many other atheists have avoided, and in some cases, even claimed to be irrelevant.  Ironically, given my past suspicions about him, Sam Harris may in some ways have turned out to be the most intellectually honest of the evangelical atheists.  His blithely candid arguments are at least relevant, even if they reliably reveal his carelessness and inability to construct a valid argument on solid foundations.</p></div>",
  "content_text": "Apparently Miss Myers didn’t get the message that all books written by New Atheists are to be blindly defended, tooth and claw, rather than criticized for the flaws that are apparent to any intelligent reader.  I was both impressed and vastly amused\nby her scathingly dismissive review\nof Sam Harris’s\nThe Moral Landscape\n, as it was even harsher and more contemptuous than\nmy own review of it\n.\nSo, to summarise:\n1.  Utilitarianism is right, but not any more justifiable than anything else. But who cares what other people think, anyway?\n2.  Because utilitarianism is right, we don’t have to be loopy post-modernists.\n3.  Science can tell us what makes us happy. Here’s a smattering of scientific studies about the brain.\nWhy in the hell do they give out book deals so easily? This book isn’t about convincing others, or providing novel ideas. It’s about pandering to atheists with very little knowledge of philosophy and ethics and an abundance of arrogance, telling them science is with them, and then reiterating how immoral people who like FGM and throwing acid in girls’ faces are and how we don’t have to listen to them because We Are Right. This is nothing but a convoluted rehashing of utilitarianism that still falls to the same old criticisms, and an immense waste of time unless you really like a good ignorant circlejerk.\nIt would certainly be interesting to see Miss Myers review Sam Harris’s two previous books, to say nothing of the other books I addressed in\nThe Irrational Atheist\n, with the same skeptical eye.  Regardless, it appears she will make a more challenging champion of atheism than her father ever has because she is willing to pay attention to the words as written and to think for herself rather than to simply parrot centuries-old talking points and froth at the mouth like some sort of performing bearded clown monkey.\nIt appears that I wasn’t the only one to notice the similarity in our conclusions concerning Harris’s book.\nUnbelievable, PZ’s daughter is the female version of Vox Day. What’s next? anti-feminism, repeal of women’s right to vote, border control and Austrian economics?\nWe can always hope that sweet reason will triumph, even if we harbor few expectations of it.  And certainly, the intrinsic problem of utilitarian consequence pointed out by Miss Myers is not dissimilar to the famous Austrian explication of the impossibility of socialist price calculation.  I must say, however, that she was perhaps a little unfair to Sam Harris in failing to give him credit for at least attempting to make a necessary case that so many other atheists have avoided, and in some cases, even claimed to be irrelevant.  Ironically, given my past suspicions about him, Sam Harris may in some ways have turned out to be the most intellectually honest of the evangelical atheists.  His blithely candid arguments are at least relevant, even if they reliably reveal his carelessness and inability to construct a valid argument on solid foundations.",
  "tags": [
    "atheism",
    "books"
  ],
  "categories": [],
  "sitemap_lastmod": "2011-07-20T08:37:00+00:00"
}