{
  "url": "https://voxday.net/2011/07/11/its-not-all-nails/",
  "scraped_at": "2025-12-13T23:16:02.782629",
  "title": "It’s not all nails",
  "date_display": "July 11, 2011",
  "date_iso": "2011-07-11T14:00:00+00:00",
  "date_from_url": "2011-07-11",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>I am aware certain Pharyngulans and anklebiters are dubious about the legitimacy of the intellectual contempt in which I hold one PZ Myers.  They appear to genuinely believe that the Fowl Atheist is not only capable of holding his own in debate with me, but that he has only been avoiding any such encounter because his argumentative skills are so much superior to mine that it would somehow pollute them to actually put them to use.*</p><p>The fact is that PZ knows perfectly well that I will destroy every last bit of his credibility if he is ever foolish enough to permit a direct engagement again.  By way of evidence, I offer <a href=\"http://scienceblogs.com/pharyngula/2011/07/theres_something_obvious_missi.php\">his latest bit of philosophical buffoonery</a> as but one of many examples of how PZ can’t argue his way out of a paper bag.</p><blockquote><p>[L]et’s cut straight to the statement Brown finds objectionable: “Science is the only philosophical construct we have to determine TRUTH with any degree of reliability.” And there, I disagree with Brown completely: it is an eminently scientific statement. It may make philosophers gack up their breakfast, but who cares?</p><p>Science is a process of empirical rationalism that produces testable answers about the nature of the universe. We learn new knowledge, knowledge that actually holds up to critical scrutiny and testing against the real world. The pipes don’t leak — not much, anyway, and we have a method that allows us to test and tighten everything up. And yes, we have evidence that it is true: I can show you a cell phone that uses the principles of quantum physics, I can show you statistics on infant mortality that are improved by vaccinations and antibiotics and hygiene. We have progressively deeper understanding of ourselves and our environment that is produced by this powerful tool.</p><p>Science works. That is the criterion for saying it is a way “to determine truth with any degree of reliability.” That is a valid statement, and yes it can be relied on as true, in the scientist’s sense of the word: provisionally and usefully. Both of Brown’s denials were simply wrong.</p><p>But there’s another part of Kroto’s statement that bugs Brown, and that he doesn’t really address. This is the missing part of his argument, and the one he fills in by telling us that we were expected to giggle at the claim… the idea that science is the only useful tool we have.</p><p>“The illogical positivism of Kroto’s talk is symptomatic of a widespread problem. Although Kroto is exceptional in his self-confidence and lack of intellectual self-awareness – few other people would state as baldly as he does that science is the only way to establish the truth – no one in the audience seems to have reacted with a healthy giggle. They may have felt there was something a bit off about the idea, but the full absurdity was veiled by layers of deference and convention. The great attraction of telling everyone else to think, to question, and to take nothing for granted is that it makes a very pleasant substitute for doing these things yourself.”</p><p>You know, if someone tells me there is only one way of doing something, and I want to show that they’re wrong, the very first thing I think of is to demonstrate an alternative. If someone were to say something truly false and giggleworthy, like for instance, “all cats are black,” what I’d do is go out and find a Siamese and a white Persian and wave them in his face. Isn’t that obvious?</p><p>I have often heard apologists wax indignant at statements by scientists that science, that is this kind of objective, constantly tested, empirical rationalism, is the only way to determine the truth of a matter. Usually it’s theologians who want to insist that they have another path. But never do they actually show me something about which we have reliable knowledge that was not determined by observing, measuring, poking, testing, evaluating, verifying…all that stuff that is part of common, mundane science.</p><p>So show me something that we reliably know without testing it against consequences in the real world, and then maybe I’ll see the joke here.</p></blockquote><p>It’s at times like this that one has no choice but to shake one’s head and realize that despite one’s contempt, one has actually somehow managed to overrate the moron.</p><p>First, as Robert Winston, the former Professor of Science and Society at Imperial College London and past Director of NHS Research and Development, Hammersmith Hospitals Trust has said, “dogmatist scientists need to be reminded, now and again, that the discipline of science is not about absolute truth.”  It is not, as my erstwhile biology tutor used to say, “in the truth business”.  To say “science works” is not at all synonymous with saying it has the ability “to determine truth”, much less to claim that it is “the only philosophical construct we have to determine TRUTH with any degree of reliability.”  Engineering works even better than science, logic works quite effectively in most situations, and there is no shortage of empirical evidence indicating that revelation and intuition work as well.</p><p>Like all these alternative paths to knowledge, science sometimes works and sometimes does not work.  There is little point in resorting to a scientific version of the Atheist Dance here, as the oft-chronicled failures and financial corruption of scientists inevitably amounts to the confirmed unreliability of science as it is actually applied in the real world.  One cannot reasonably compare practical logic and practical religion with ideal science, and while one could argue that ideal science would lead to perfect understanding, the same is also true of ideal revelation, ideal logic, ideal intuition, and ideal history.</p><p>But concerning the question posed, there are so many obvious answers that it is almost astonishing to have to wave them in PZ’s bearded face.  Both math and logic permit things to be reliably known without testing them against the consequences, indeed, they are often utilized by scientists in lieu of science when the scientific method cannot be applied.  The same is also true of all the documentary and archeological evidence that makes up recorded human history.  It would be interesting to see what sort of replicable scientific experiment one would propose testing in order to prove the historical existence of Homer, as even DNA testing of current human populations matched to ancient DNA samples would not suffice to prove that one of them once wrote <i>The Iliad</i>.  How would science go about proving or disproving the story that George Washington chopped down the cherry tree?  It might be used to establish that there was no evidence to be found indicating that cherry trees grew in Mount Vernon during the reported lifetime of “George Washington”, but that is the most it could hope to accomplish.</p><p>There are entire fields of human knowledge that have absolutely nothing to do with modern science.  One cannot scientifically demonstrate that Brad loves Angelina or that Marius served as the consul of Rome seven times.  PZ cannot even scientifically prove that he exists, or as Nick Bostrom would have it, that the material world even exists as anything but a sophisticated electronic simulation.</p><p>To reduce TRUTH to nothing more than “that which science can discover” is to eliminate the greater part of the truths that matter.  Love, Life, Consciousness, Meaning, Purpose, and Probability are all well beyond the scope of science.  Even Sam Harris would not go so far as Myers has gone, his most recent book, <i>The Moral Landscape</i> is nothing more than a futile attempt to, (ironically enough), make a philosophical argument for what PZ blithely asserts to be the case.</p><p>This is a deeply stupid statement by a dogmatic, mid-witted scientist who, due to his affection for his hammer, has concluded that all knowledge must necessarily be comprised of nails.</p><p> <i>* It would be very interesting to see a Pharyngulan attempt to prove that conclusion scientifically, for as we are informed, science is the only way we could reliably determine the truth of it.</i></p></div>",
  "content_text": "I am aware certain Pharyngulans and anklebiters are dubious about the legitimacy of the intellectual contempt in which I hold one PZ Myers.  They appear to genuinely believe that the Fowl Atheist is not only capable of holding his own in debate with me, but that he has only been avoiding any such encounter because his argumentative skills are so much superior to mine that it would somehow pollute them to actually put them to use.*\nThe fact is that PZ knows perfectly well that I will destroy every last bit of his credibility if he is ever foolish enough to permit a direct engagement again.  By way of evidence, I offer\nhis latest bit of philosophical buffoonery\nas but one of many examples of how PZ can’t argue his way out of a paper bag.\n[L]et’s cut straight to the statement Brown finds objectionable: “Science is the only philosophical construct we have to determine TRUTH with any degree of reliability.” And there, I disagree with Brown completely: it is an eminently scientific statement. It may make philosophers gack up their breakfast, but who cares?\nScience is a process of empirical rationalism that produces testable answers about the nature of the universe. We learn new knowledge, knowledge that actually holds up to critical scrutiny and testing against the real world. The pipes don’t leak — not much, anyway, and we have a method that allows us to test and tighten everything up. And yes, we have evidence that it is true: I can show you a cell phone that uses the principles of quantum physics, I can show you statistics on infant mortality that are improved by vaccinations and antibiotics and hygiene. We have progressively deeper understanding of ourselves and our environment that is produced by this powerful tool.\nScience works. That is the criterion for saying it is a way “to determine truth with any degree of reliability.” That is a valid statement, and yes it can be relied on as true, in the scientist’s sense of the word: provisionally and usefully. Both of Brown’s denials were simply wrong.\nBut there’s another part of Kroto’s statement that bugs Brown, and that he doesn’t really address. This is the missing part of his argument, and the one he fills in by telling us that we were expected to giggle at the claim… the idea that science is the only useful tool we have.\n“The illogical positivism of Kroto’s talk is symptomatic of a widespread problem. Although Kroto is exceptional in his self-confidence and lack of intellectual self-awareness – few other people would state as baldly as he does that science is the only way to establish the truth – no one in the audience seems to have reacted with a healthy giggle. They may have felt there was something a bit off about the idea, but the full absurdity was veiled by layers of deference and convention. The great attraction of telling everyone else to think, to question, and to take nothing for granted is that it makes a very pleasant substitute for doing these things yourself.”\nYou know, if someone tells me there is only one way of doing something, and I want to show that they’re wrong, the very first thing I think of is to demonstrate an alternative. If someone were to say something truly false and giggleworthy, like for instance, “all cats are black,” what I’d do is go out and find a Siamese and a white Persian and wave them in his face. Isn’t that obvious?\nI have often heard apologists wax indignant at statements by scientists that science, that is this kind of objective, constantly tested, empirical rationalism, is the only way to determine the truth of a matter. Usually it’s theologians who want to insist that they have another path. But never do they actually show me something about which we have reliable knowledge that was not determined by observing, measuring, poking, testing, evaluating, verifying…all that stuff that is part of common, mundane science.\nSo show me something that we reliably know without testing it against consequences in the real world, and then maybe I’ll see the joke here.\nIt’s at times like this that one has no choice but to shake one’s head and realize that despite one’s contempt, one has actually somehow managed to overrate the moron.\nFirst, as Robert Winston, the former Professor of Science and Society at Imperial College London and past Director of NHS Research and Development, Hammersmith Hospitals Trust has said, “dogmatist scientists need to be reminded, now and again, that the discipline of science is not about absolute truth.”  It is not, as my erstwhile biology tutor used to say, “in the truth business”.  To say “science works” is not at all synonymous with saying it has the ability “to determine truth”, much less to claim that it is “the only philosophical construct we have to determine TRUTH with any degree of reliability.”  Engineering works even better than science, logic works quite effectively in most situations, and there is no shortage of empirical evidence indicating that revelation and intuition work as well.\nLike all these alternative paths to knowledge, science sometimes works and sometimes does not work.  There is little point in resorting to a scientific version of the Atheist Dance here, as the oft-chronicled failures and financial corruption of scientists inevitably amounts to the confirmed unreliability of science as it is actually applied in the real world.  One cannot reasonably compare practical logic and practical religion with ideal science, and while one could argue that ideal science would lead to perfect understanding, the same is also true of ideal revelation, ideal logic, ideal intuition, and ideal history.\nBut concerning the question posed, there are so many obvious answers that it is almost astonishing to have to wave them in PZ’s bearded face.  Both math and logic permit things to be reliably known without testing them against the consequences, indeed, they are often utilized by scientists in lieu of science when the scientific method cannot be applied.  The same is also true of all the documentary and archeological evidence that makes up recorded human history.  It would be interesting to see what sort of replicable scientific experiment one would propose testing in order to prove the historical existence of Homer, as even DNA testing of current human populations matched to ancient DNA samples would not suffice to prove that one of them once wrote\nThe Iliad\n.  How would science go about proving or disproving the story that George Washington chopped down the cherry tree?  It might be used to establish that there was no evidence to be found indicating that cherry trees grew in Mount Vernon during the reported lifetime of “George Washington”, but that is the most it could hope to accomplish.\nThere are entire fields of human knowledge that have absolutely nothing to do with modern science.  One cannot scientifically demonstrate that Brad loves Angelina or that Marius served as the consul of Rome seven times.  PZ cannot even scientifically prove that he exists, or as Nick Bostrom would have it, that the material world even exists as anything but a sophisticated electronic simulation.\nTo reduce TRUTH to nothing more than “that which science can discover” is to eliminate the greater part of the truths that matter.  Love, Life, Consciousness, Meaning, Purpose, and Probability are all well beyond the scope of science.  Even Sam Harris would not go so far as Myers has gone, his most recent book,\nThe Moral Landscape\nis nothing more than a futile attempt to, (ironically enough), make a philosophical argument for what PZ blithely asserts to be the case.\nThis is a deeply stupid statement by a dogmatic, mid-witted scientist who, due to his affection for his hammer, has concluded that all knowledge must necessarily be comprised of nails.\n* It would be very interesting to see a Pharyngulan attempt to prove that conclusion scientifically, for as we are informed, science is the only way we could reliably determine the truth of it.",
  "tags": [
    "science"
  ],
  "categories": [],
  "sitemap_lastmod": "2011-07-11T13:00:00+00:00"
}