{
  "url": "https://voxday.net/2011/07/06/keynesian-macroeconomics-do-not-work/",
  "scraped_at": "2025-12-13T23:15:39.074052",
  "title": "Keynesian macroeconomics do not work",
  "date_display": "July 6, 2011",
  "date_iso": "2011-07-06T10:42:00+00:00",
  "date_from_url": "2011-07-06",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>The brilliant economists at Harvard finally <a href=\"http://www.telegraph.co.uk/finance/economics/8618623/Fiscal-stimulus-doesnt-work-claims-Harvard-economics-professor-Robert-Barro.html\">figure out the obvious</a>:</p><blockquote><p>Breaking with current economic orthodoxy, Robert Barro, Paul M Warburg Professor of Economics at Harvard University, said large spending plans should be undertaken only if they can be justified financially on their own merits. Any other spending plans end up costing the country even more than the initial outlay as interest on the debt has to be paid and the deficit cleared.</p><p>“In the long run you have got to pay for it. The medium and long-run effect is definitely negative. You can’t just keep borrowing forever. Eventually taxes are going to be higher, and that has a negative effect,” he said.</p><p>“The lesson is you want government spending only if the programmes are really worth it in terms of the usual rate of return calculations. The usual kind of calculation, not some Keynesian thing. The fact that it really is worth it to have highways and education. Classic public finance, that’s not macroeconomics.”</p><p>Turning to the $600bn (£373bn) to $800bn US package, he added it was “mainly a waste of money”. Stimulus programmes, he said, offer little more than “rearranging the timing” of economic growth. “Possibly you could make an argument that it’s worth it. But it’s going to be a negative-sum thing overall, so you have to think it’s a big benefit for boosting the recovery.”</p></blockquote><p>What a pity the USA and other nations will have to go through not one, but two Great Depressions over 80 years before the empirical evidence is deemed sufficient to support what Austrians like Mises and Hayek were saying in the 1930s.</p><p>The logic supporting Keynes’s General Theory was always wrong.  Its application and subsequent quantification utilizing Samuelsonian metrics was therefore always bound to be wrong as well.  Modern science demonstrated the importance of empirical evidence to <i>confirm</i> that the logic is relevant, but if the logic is demonstrably flawed from the start, there is no need to gather the empirical evidence in order to support that conclusion.</p></div>",
  "content_text": "The brilliant economists at Harvard finally\nfigure out the obvious\n:\nBreaking with current economic orthodoxy, Robert Barro, Paul M Warburg Professor of Economics at Harvard University, said large spending plans should be undertaken only if they can be justified financially on their own merits. Any other spending plans end up costing the country even more than the initial outlay as interest on the debt has to be paid and the deficit cleared.\n“In the long run you have got to pay for it. The medium and long-run effect is definitely negative. You can’t just keep borrowing forever. Eventually taxes are going to be higher, and that has a negative effect,” he said.\n“The lesson is you want government spending only if the programmes are really worth it in terms of the usual rate of return calculations. The usual kind of calculation, not some Keynesian thing. The fact that it really is worth it to have highways and education. Classic public finance, that’s not macroeconomics.”\nTurning to the $600bn (£373bn) to $800bn US package, he added it was “mainly a waste of money”. Stimulus programmes, he said, offer little more than “rearranging the timing” of economic growth. “Possibly you could make an argument that it’s worth it. But it’s going to be a negative-sum thing overall, so you have to think it’s a big benefit for boosting the recovery.”\nWhat a pity the USA and other nations will have to go through not one, but two Great Depressions over 80 years before the empirical evidence is deemed sufficient to support what Austrians like Mises and Hayek were saying in the 1930s.\nThe logic supporting Keynes’s General Theory was always wrong.  Its application and subsequent quantification utilizing Samuelsonian metrics was therefore always bound to be wrong as well.  Modern science demonstrated the importance of empirical evidence to\nconfirm\nthat the logic is relevant, but if the logic is demonstrably flawed from the start, there is no need to gather the empirical evidence in order to support that conclusion.",
  "tags": [
    "economics"
  ],
  "categories": [],
  "sitemap_lastmod": "2011-07-06T09:42:00+00:00"
}