{
  "url": "https://voxday.net/2011/07/27/missing-obvious/",
  "scraped_at": "2025-12-13T23:17:15.605801",
  "title": "Missing the obvious",
  "date_display": "July 27, 2011",
  "date_iso": "2011-07-27T18:40:00+00:00",
  "date_from_url": "2011-07-27",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>Megan McCardle adds 2+2, <a href=\"http://www.theatlantic.com/business/archive/2011/07/what-does-wall-street-want/242628/\">comes up with -4</a>:</p><blockquote><p>I’ve been having some disturbing conversations with both finance people and Washington people over the last few days, that have only confirmed the disconnect I wrote about a few weeks ago. Each side is sending signals that the other side is not reading correctly.  And this is getting more dangerous by the hour.</p><p>The core fact is that markets haven’t sold off nearly as much as you’d expect if Wall Street were really freaking out.  This is not because Washington pols have told their Wall Street paymasters about a secret deal that just hasn’t reached the ears of those of us reporting from down here.  Nor are they calm because they think that a failure to raise the debt ceiling will be no big deal.  They certainly don’t believe that a forced spending cut of 40% will somehow make us extra-super-more-likely to make us pay off our debt.</p><p>No, they’re relatively calm because they simply cannot bring themselves to believe that we’re not, in the end, going to raise the ceiling.  It’s too outlandish that we would, through the collective action of our congressmen, suddenly and for no apparent reason shoot ourselves in the head.</p><p>This is sound reasoning, as far as it goes.  But it doesn’t get you very far.  They’re deriving a theory of the debt ceiling like Aristotle, from first principles rather than data.  In general, my non-representative sample of people working on or near Wall Street is that they are now noticeably more sanguine about the prospects for a deal than people working in the city where the deal is going to get made….</p><p>Meanwhile, just as Wall Street doesn’t have much insight into what’s going to happen in Washington over the next week, I don’t think Washington really understands what will happen in the markets.  I think Stan Collender is right: Washington, particularly the GOP bit of it, is interpreting Wall Street’s lack of a reaction as a sign that it’s maybe not such a big deal to breach the debt ceiling.  But the real message Wall Street is sending is “You can’t be serious!  Not raising the debt ceiling would be a disaster!”</p></blockquote><p>This is an impressive failure to comprehend the obvious.  First, what McCardle doesn’t understand is that it is <i>raising</i> the debt ceiling that would be a disaster.  The ratings agencies are not warning everyone that a failure to make a deal to raise the debt ceiling will lead to a reduction in the quality rating of U.S. debt, but that a failure to provide the $4 trillion in spending cuts that were mentioned as part of a deal will lead to the aforementioned ratings downgrade.</p><p>While a failure to raise the debt ceiling will certainly have negative consequences for stock prices and GDP statistics, this helps the long-term prospects for the ability of the U.S. to raise funds in the future.  And second, the relative lack of panic over the rapidly approaching “deadline” is not due to any false signal readings, but rather the fact that the deadline is an artificial and meaningless one.</p><p>As for what Wall Street wants, the answer is obvious.  More money, more debt, more inflation.  That doesn’t mean that what Wall Street wants is relevant, good for the economy, or good for the American people.  In fact, it’s usually a reliable indicator of what is bad for everyone but Wall Street.  Concerning Washington, they know perfectly well the debt ceiling will be raised.  After all, the only thing that really stands in the way is for Republicans to crumble, <a href=\"http://www.nationalreview.com/corner/272865/boehner-plan-gains-momentum-andrew-stiles\">which they are doing as expected</a>.</p><blockquote><p>House Republicans are rallying behind House Speaker John Boehner’s (R., Ohio) deficit reduction plan, believing that is it their best available option to raise the debt ceiling and cut spending. During a Wednesday morning conference meeting, Boehner told members to “get your ass in line” and support his plan. “This is the bill,” he said. “I can’t do this job unless you’re behind me.” If the bill passes the House, the speaker predicted, Senate Democrats and President Obama would “fold like a cheap suit.”</p><p>Notably, Rep. Jim Jordan (R., Ohio), chairman of the Republican Study Committee, opened the meeting by apologizing for a series of e-mails sent by an RSC staffer urging outside groups like Club for Growth and Heritage Action to pressure undecided members to oppose the plan. Rank-and-file members, many of them members of the RSC, were none too pleased to find themselves on the list of targets. There were several calls for the offending staffer to be fired. Much of the meeting was devoted to the controversy, which merely underscores the intra-party tension that has been simmering over the past several weeks.</p><p>Meanwhile, however, the opposition bloc led by Jordan appears to be crumbling, as leadership’s message seems to be sinking in. Sources tells NRO that a number of members who were confirmed no votes against the Boehner plan announced during the meeting that they would be voting yes.</p></blockquote><p>I know I’m surprised….</p></div>",
  "content_text": "Megan McCardle adds 2+2,\ncomes up with -4\n:\nI’ve been having some disturbing conversations with both finance people and Washington people over the last few days, that have only confirmed the disconnect I wrote about a few weeks ago. Each side is sending signals that the other side is not reading correctly.  And this is getting more dangerous by the hour.\nThe core fact is that markets haven’t sold off nearly as much as you’d expect if Wall Street were really freaking out.  This is not because Washington pols have told their Wall Street paymasters about a secret deal that just hasn’t reached the ears of those of us reporting from down here.  Nor are they calm because they think that a failure to raise the debt ceiling will be no big deal.  They certainly don’t believe that a forced spending cut of 40% will somehow make us extra-super-more-likely to make us pay off our debt.\nNo, they’re relatively calm because they simply cannot bring themselves to believe that we’re not, in the end, going to raise the ceiling.  It’s too outlandish that we would, through the collective action of our congressmen, suddenly and for no apparent reason shoot ourselves in the head.\nThis is sound reasoning, as far as it goes.  But it doesn’t get you very far.  They’re deriving a theory of the debt ceiling like Aristotle, from first principles rather than data.  In general, my non-representative sample of people working on or near Wall Street is that they are now noticeably more sanguine about the prospects for a deal than people working in the city where the deal is going to get made….\nMeanwhile, just as Wall Street doesn’t have much insight into what’s going to happen in Washington over the next week, I don’t think Washington really understands what will happen in the markets.  I think Stan Collender is right: Washington, particularly the GOP bit of it, is interpreting Wall Street’s lack of a reaction as a sign that it’s maybe not such a big deal to breach the debt ceiling.  But the real message Wall Street is sending is “You can’t be serious!  Not raising the debt ceiling would be a disaster!”\nThis is an impressive failure to comprehend the obvious.  First, what McCardle doesn’t understand is that it is\nraising\nthe debt ceiling that would be a disaster.  The ratings agencies are not warning everyone that a failure to make a deal to raise the debt ceiling will lead to a reduction in the quality rating of U.S. debt, but that a failure to provide the $4 trillion in spending cuts that were mentioned as part of a deal will lead to the aforementioned ratings downgrade.\nWhile a failure to raise the debt ceiling will certainly have negative consequences for stock prices and GDP statistics, this helps the long-term prospects for the ability of the U.S. to raise funds in the future.  And second, the relative lack of panic over the rapidly approaching “deadline” is not due to any false signal readings, but rather the fact that the deadline is an artificial and meaningless one.\nAs for what Wall Street wants, the answer is obvious.  More money, more debt, more inflation.  That doesn’t mean that what Wall Street wants is relevant, good for the economy, or good for the American people.  In fact, it’s usually a reliable indicator of what is bad for everyone but Wall Street.  Concerning Washington, they know perfectly well the debt ceiling will be raised.  After all, the only thing that really stands in the way is for Republicans to crumble,\nwhich they are doing as expected\n.\nHouse Republicans are rallying behind House Speaker John Boehner’s (R., Ohio) deficit reduction plan, believing that is it their best available option to raise the debt ceiling and cut spending. During a Wednesday morning conference meeting, Boehner told members to “get your ass in line” and support his plan. “This is the bill,” he said. “I can’t do this job unless you’re behind me.” If the bill passes the House, the speaker predicted, Senate Democrats and President Obama would “fold like a cheap suit.”\nNotably, Rep. Jim Jordan (R., Ohio), chairman of the Republican Study Committee, opened the meeting by apologizing for a series of e-mails sent by an RSC staffer urging outside groups like Club for Growth and Heritage Action to pressure undecided members to oppose the plan. Rank-and-file members, many of them members of the RSC, were none too pleased to find themselves on the list of targets. There were several calls for the offending staffer to be fired. Much of the meeting was devoted to the controversy, which merely underscores the intra-party tension that has been simmering over the past several weeks.\nMeanwhile, however, the opposition bloc led by Jordan appears to be crumbling, as leadership’s message seems to be sinking in. Sources tells NRO that a number of members who were confirmed no votes against the Boehner plan announced during the meeting that they would be voting yes.\nI know I’m surprised….",
  "tags": [
    "economics"
  ],
  "categories": [],
  "sitemap_lastmod": "2011-07-27T17:40:00+00:00"
}