{
  "url": "https://voxday.net/2011/07/25/sam-harris-on-christian-terroris/",
  "scraped_at": "2025-12-13T23:17:05.006617",
  "title": "Sam Harris on “Christian Terrorism”",
  "date_display": "July 25, 2011",
  "date_iso": "2011-07-25T17:15:00+00:00",
  "date_from_url": "2011-07-25",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>Mr. Harris weighs in with what some will likely consider to be a surprising, (and disappointing), conclusion.  But it speaks well for his integrity and actually <a href=\"http://www.samharris.org/blog/item/christian-terrorism-and-islamophobia/\">approaches an intelligent response</a>.  It also explains why the “Christian fundamentalist” theme is rapidly disappearing from the media:</p><blockquote><p>It has been widely reported that Breivik is a “Christian fundamentalist.” Having read parts of his 1500-page manifesto (2083: A European Declaration of Independence), I must say that I have my doubts….  As I have only read parts of this document, I cannot say whether signs of a deeper religious motive appear elsewhere in it. Nevertheless, the above passages would seem to undermine any claim that Breivik is a Christian fundamentalist in the usual sense. What cannot be doubted, however, is that Breivik’s explicit goal was to punish European liberals for their timidity in the face of Islam.</p><p>I have written a fair amount about the threat that Islam poses to open societies, but I am happy to say that Breivik appears never to have heard of me. He has, however, digested the opinions of many writers who share my general concerns—Theodore Dalrymple, Robert D. Kaplan, Lee Harris, Ibn Warraq, Bernard Lewis, Andrew Bostom, Robert Spencer, Walid Shoebat, Daniel Pipes, Bat Ye’or, Mark Steyn, Samuel Huntington, et al. He even singles out my friend and colleague Ayaan Hirsi Ali for special praise, repeatedly quoting a blogger who thinks she deserves a Nobel Peace Prize. With a friend like Breivik, one will never want for enemies.</p><p>One can only hope that the horror and outrage provoked by Breivik’s behavior will temper the growing enthusiasm for right-wing, racist nationalism in Europe. However, one now fears the swing of another pendulum: We are bound to hear a lot of deluded talk about the dangers of “Islamophobia” and about the need to address the threat of “terrorism” in purely generic terms.</p></blockquote><p>First, it’s quite clear that Breivik was a Christian in the sense of Christendom, not Jesus Christ.  As The Perfect Aryan Male, who is a lawyer occasionally required to do work with Saudi visas, explained it, when you go to Saudi Arabia you have to choose between checking “Christian” or “Muslim” on your application.  The Saudis couldn’t care less about personal beliefs, your self-identification, or if you pretend to worship the Flying Spaghetti Monster, they simply want to know if you are a member of the Umma or the Dar al-Harb.</p><p>Second, Harris has recognized what so many people seem to find inexplicable.  Breivik targeted the future politicians of the Labour Youth because the quislings of the Labour Party are responsible for Norway’s open borders and the subsequent Islamic immigration.  While Breivik may or may not have been a bigot, it is clear that his murderous attack was not a bigoted act, but rather, an explicitly political one.  This is something he addresses directly in the manifesto when he writes about how it is not the wild animals who are to blame for entering the zoo, but the zookeepers who hold the gates open and permit them to enter.</p><p>(That being said, given the pictures of the Labour Youth that have been released, it wouldn’t be surprising if a significant percentage of the victims were not, in fact, ethnic Norwegians.)</p><p>Third, I believe Harris is incorrect with regards to his analysis of the probable consequences.  Contra the blithe assumptions of the media, I suspect that Breivik’s mass murder will tend to <i>increase </i>the enthusiasm for nationalism on both the European Right and Left because it has increased and underlined what were already the extraordinarily heavy costs being imposed upon European societies by the multiculturalists and immigration enthusiasts within it.  As Harris notes, many people, of various creeds, already harbor serious concerns about the incompatibility of Islam and secular society.</p><p>There are national elections approaching in Switzerland and France.  We should be able to determine if Breivik will have any discernable effect upon the political situation by seeing if the anti-immigrant, anti-Islam People’s Party (CH) and National Front (FR) perform better or worse than they did in the previous elections.</p><p>Of course, as Kevin Williamson noted, it is self-evident that Breivik is <a href=\"http://www.nationalreview.com/corner/272657/moron-who-doesn-t-know-ropes-kevin-d-williamson\">a lunatic of the sort defined by Umberto Eco</a> in <i>Foucault’s Pendulum</i>.</p><p><i>A lunatic is easily recognized. He is a moron who doesn’t know the ropes. The moron proves his thesis; he has a logic, however twisted it may be. The lunatic, on the other hand, doesn’t concern himself at all with logic; he works by short circuits. For him, everything proves everything else. The lunatic is all idée fixe, and whatever he comes across confirms his lunacy. You can tell him by the liberties he takes with common sense, by his flashes of inspiration, and by the fact that sooner or later he brings up the Templars.</i></p></div>",
  "content_text": "Mr. Harris weighs in with what some will likely consider to be a surprising, (and disappointing), conclusion.  But it speaks well for his integrity and actually\napproaches an intelligent response\n.  It also explains why the “Christian fundamentalist” theme is rapidly disappearing from the media:\nIt has been widely reported that Breivik is a “Christian fundamentalist.” Having read parts of his 1500-page manifesto (2083: A European Declaration of Independence), I must say that I have my doubts….  As I have only read parts of this document, I cannot say whether signs of a deeper religious motive appear elsewhere in it. Nevertheless, the above passages would seem to undermine any claim that Breivik is a Christian fundamentalist in the usual sense. What cannot be doubted, however, is that Breivik’s explicit goal was to punish European liberals for their timidity in the face of Islam.\nI have written a fair amount about the threat that Islam poses to open societies, but I am happy to say that Breivik appears never to have heard of me. He has, however, digested the opinions of many writers who share my general concerns—Theodore Dalrymple, Robert D. Kaplan, Lee Harris, Ibn Warraq, Bernard Lewis, Andrew Bostom, Robert Spencer, Walid Shoebat, Daniel Pipes, Bat Ye’or, Mark Steyn, Samuel Huntington, et al. He even singles out my friend and colleague Ayaan Hirsi Ali for special praise, repeatedly quoting a blogger who thinks she deserves a Nobel Peace Prize. With a friend like Breivik, one will never want for enemies.\nOne can only hope that the horror and outrage provoked by Breivik’s behavior will temper the growing enthusiasm for right-wing, racist nationalism in Europe. However, one now fears the swing of another pendulum: We are bound to hear a lot of deluded talk about the dangers of “Islamophobia” and about the need to address the threat of “terrorism” in purely generic terms.\nFirst, it’s quite clear that Breivik was a Christian in the sense of Christendom, not Jesus Christ.  As The Perfect Aryan Male, who is a lawyer occasionally required to do work with Saudi visas, explained it, when you go to Saudi Arabia you have to choose between checking “Christian” or “Muslim” on your application.  The Saudis couldn’t care less about personal beliefs, your self-identification, or if you pretend to worship the Flying Spaghetti Monster, they simply want to know if you are a member of the Umma or the Dar al-Harb.\nSecond, Harris has recognized what so many people seem to find inexplicable.  Breivik targeted the future politicians of the Labour Youth because the quislings of the Labour Party are responsible for Norway’s open borders and the subsequent Islamic immigration.  While Breivik may or may not have been a bigot, it is clear that his murderous attack was not a bigoted act, but rather, an explicitly political one.  This is something he addresses directly in the manifesto when he writes about how it is not the wild animals who are to blame for entering the zoo, but the zookeepers who hold the gates open and permit them to enter.\n(That being said, given the pictures of the Labour Youth that have been released, it wouldn’t be surprising if a significant percentage of the victims were not, in fact, ethnic Norwegians.)\nThird, I believe Harris is incorrect with regards to his analysis of the probable consequences.  Contra the blithe assumptions of the media, I suspect that Breivik’s mass murder will tend to\nincrease\nthe enthusiasm for nationalism on both the European Right and Left because it has increased and underlined what were already the extraordinarily heavy costs being imposed upon European societies by the multiculturalists and immigration enthusiasts within it.  As Harris notes, many people, of various creeds, already harbor serious concerns about the incompatibility of Islam and secular society.\nThere are national elections approaching in Switzerland and France.  We should be able to determine if Breivik will have any discernable effect upon the political situation by seeing if the anti-immigrant, anti-Islam People’s Party (CH) and National Front (FR) perform better or worse than they did in the previous elections.\nOf course, as Kevin Williamson noted, it is self-evident that Breivik is\na lunatic of the sort defined by Umberto Eco\nin\nFoucault’s Pendulum\n.\nA lunatic is easily recognized. He is a moron who doesn’t know the ropes. The moron proves his thesis; he has a logic, however twisted it may be. The lunatic, on the other hand, doesn’t concern himself at all with logic; he works by short circuits. For him, everything proves everything else. The lunatic is all idée fixe, and whatever he comes across confirms his lunacy. You can tell him by the liberties he takes with common sense, by his flashes of inspiration, and by the fact that sooner or later he brings up the Templars.",
  "tags": [
    "immigration"
  ],
  "categories": [],
  "sitemap_lastmod": "2011-07-25T16:15:00+00:00"
}