{
  "url": "https://voxday.net/2011/07/17/subjective-unicorn/",
  "scraped_at": "2025-12-13T23:16:30.288943",
  "title": "The subjective unicorn",
  "date_display": "July 17, 2011",
  "date_iso": "2011-07-17T15:30:00+00:00",
  "date_from_url": "2011-07-17",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>In which I both praise and criticize the esteemed publisher of Black Gate’s <a href=\"http://www.blackgate.com/2011/07/14/solaris-rising-women-falling/\">recent blog post</a> concerning <em>The Solaris Book of New Science Fiction</em> and the balance of sex with regards to Black Gate contributors.  First, I believe it is entirely admirable to investigate one’s motivations underlying one’s actions.  Second, in a free society, a publisher is, and should be, free to publish whatever and whomever he wants.  I take no exception to all-female anthologies, neither am I troubled by collections of stories that are entirely devoid of female contributors.  Third, I entirely support John in his efforts to strike what he considers to be a reasonable balance between excellence in fiction and equitable sexual contributions primarily because it is clear that his modified approach has not caused the quality of the magazine to suffer.  As an early subscriber, I think the magazine has grown consistently stronger under his direction.</p><p>Read the rest at <a href=\"http://www.blackgate.com/2011/07/17/the-subjective-unicorn/\">the Black Gate</a></p></div>",
  "content_text": "In which I both praise and criticize the esteemed publisher of Black Gate’s\nrecent blog post\nconcerning\nThe Solaris Book of New Science Fiction\nand the balance of sex with regards to Black Gate contributors.  First, I believe it is entirely admirable to investigate one’s motivations underlying one’s actions.  Second, in a free society, a publisher is, and should be, free to publish whatever and whomever he wants.  I take no exception to all-female anthologies, neither am I troubled by collections of stories that are entirely devoid of female contributors.  Third, I entirely support John in his efforts to strike what he considers to be a reasonable balance between excellence in fiction and equitable sexual contributions primarily because it is clear that his modified approach has not caused the quality of the magazine to suffer.  As an early subscriber, I think the magazine has grown consistently stronger under his direction.\nRead the rest at\nthe Black Gate",
  "tags": [
    "Black Gate"
  ],
  "categories": [],
  "sitemap_lastmod": "2011-07-17T14:30:00+00:00"
}