{
  "url": "https://voxday.net/2011/07/29/tea-party-traitors/",
  "scraped_at": "2025-12-13T23:17:29.099148",
  "title": "Tea Party traitors",
  "date_display": "July 29, 2011",
  "date_iso": "2011-07-29T18:30:00+00:00",
  "date_from_url": "2011-07-29",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>It looks like we’re going to have the chance to see how serious the Tea Party is about <a href=\"http://www.nationalreview.com/corner/273111/allen-west-brushes-his-shoulders-robert-costa\">electorally cutting the throats of the politicians that betray it</a> as well as their ability to actually do so:</p><blockquote><p>Freshman Rep. Allen West (R., Fla.), a tea-party star, is under pressure:</p><p><i>“Several Tea Party organizations are working to punish conservative Republicans who plan to vote yes on Speaker John Boehner’s (R-Ohio) debt-ceiling proposal. Tea Party leaders announced Thursday that they are targeting Republican Reps. James Lankford (Okla.), Allen West (Fla.), Mike Kelly (Pa.) and Bill Flores (Texas), all four freshmen and declared yes votes for Boehner. . . . West has been particularly vocal in his support of Boehner’s plan, which many consider a surprise endorsement by the Tea Party firebrand not known for falling into line behind his party’s leadership.”</i></p><p>In an interview with National Review Online this morning, West was defiant. When asked about whether he is worried about the heat, he looked me straight in the eye, stayed silent, lifted his right hand and brushed off both of his shoulders, Jay-Z style.</p><p>“The Taliban targeted me, al-Qaeda targeted me and I’m still alive,” West smiled. He praised Boehner for adjusting the debt-limit bill, calling it a “good move.” The proposal, he said, “does not have tax hikes and is not a clean raise of the debt ceiling. For the first time in the history of the nation, we are having a debt-limit increase with real spending cuts. What more could you want?”</p></blockquote><p>My first thought is that all I wanted was no debt-limit increase period.  Increasing the debt ceiling with fake spending cuts – and as we learned from the last go-round, they are fake – serves no purpose whatsoever.  My second thought is that it is eminently stupid to place any trust in anyone who runs for office.  A politician will <i>always</i> come up with some excuse to rationalize doing what he promised he would not do.</p><p>And my third thought is: what an asshole!  He’s going to strike the tough guy pose contra those who put him in office to stop more government spending?  I know nothing else about the guy, don’t really care who is in Congress, don’t believe the Tea Party will be able to do anything about government spending, and I’d still like to see the Tea Party leave a smoking crater where this guy’s career used to be in 2012.</p><p>It gets even better.  Apparently the real Tea Party hasn’t said boo about being betrayed.</p><p><i>““A press release has been issued claiming Tea Party Nation supports a primary challenge against Allen West. TPN’s name was used without permission. I will be giving a more detailed statement shortly but neither I nor Tea Party Nation supports a primary challenge against Allen West.”</i></p><p>In other words, the Tea Party would appear to be as worthless as the Republican Party.</p><p>UPDATE – Boehner’s White Flag passed 218-210.  It would appear there are only 22 Republicans who aren’t economically illiterate.  I’m sure “it was the best deal we could get” is going to sell every bit as well as George Bush’s “Read My Lips” cave in.  It’s not like the U.S. is going to be less in debt this time next year.</p><p>UPDATE II – Harry Reid and the Senate refused to accept the House Republican surrender:</p><blockquote><p>At the other end of the Capitol, Senate Democrats rejected the measure without so much as a debate. The vote was 59-41, with all Democrats, two independents and six Republicans joining in opposition.  Moments later, Senate Majority Leader Harry Reid, D-Nev., unveiled an alternative that would cut spending by $2.4 trillion and raise the debt limit by the same amount, enough to meet Obama’s terms that it tide the Treasury over until 2013.</p></blockquote><p>It should be interesting to see what the Boehner-led Republicans will try next or if they’re seriously going to go with the “unconditional surrender is the best deal we could get” theme.</p></div>",
  "content_text": "It looks like we’re going to have the chance to see how serious the Tea Party is about\nelectorally cutting the throats of the politicians that betray it\nas well as their ability to actually do so:\nFreshman Rep. Allen West (R., Fla.), a tea-party star, is under pressure:\n“Several Tea Party organizations are working to punish conservative Republicans who plan to vote yes on Speaker John Boehner’s (R-Ohio) debt-ceiling proposal. Tea Party leaders announced Thursday that they are targeting Republican Reps. James Lankford (Okla.), Allen West (Fla.), Mike Kelly (Pa.) and Bill Flores (Texas), all four freshmen and declared yes votes for Boehner. . . . West has been particularly vocal in his support of Boehner’s plan, which many consider a surprise endorsement by the Tea Party firebrand not known for falling into line behind his party’s leadership.”\nIn an interview with National Review Online this morning, West was defiant. When asked about whether he is worried about the heat, he looked me straight in the eye, stayed silent, lifted his right hand and brushed off both of his shoulders, Jay-Z style.\n“The Taliban targeted me, al-Qaeda targeted me and I’m still alive,” West smiled. He praised Boehner for adjusting the debt-limit bill, calling it a “good move.” The proposal, he said, “does not have tax hikes and is not a clean raise of the debt ceiling. For the first time in the history of the nation, we are having a debt-limit increase with real spending cuts. What more could you want?”\nMy first thought is that all I wanted was no debt-limit increase period.  Increasing the debt ceiling with fake spending cuts – and as we learned from the last go-round, they are fake – serves no purpose whatsoever.  My second thought is that it is eminently stupid to place any trust in anyone who runs for office.  A politician will\nalways\ncome up with some excuse to rationalize doing what he promised he would not do.\nAnd my third thought is: what an asshole!  He’s going to strike the tough guy pose contra those who put him in office to stop more government spending?  I know nothing else about the guy, don’t really care who is in Congress, don’t believe the Tea Party will be able to do anything about government spending, and I’d still like to see the Tea Party leave a smoking crater where this guy’s career used to be in 2012.\nIt gets even better.  Apparently the real Tea Party hasn’t said boo about being betrayed.\n““A press release has been issued claiming Tea Party Nation supports a primary challenge against Allen West. TPN’s name was used without permission. I will be giving a more detailed statement shortly but neither I nor Tea Party Nation supports a primary challenge against Allen West.”\nIn other words, the Tea Party would appear to be as worthless as the Republican Party.\nUPDATE – Boehner’s White Flag passed 218-210.  It would appear there are only 22 Republicans who aren’t economically illiterate.  I’m sure “it was the best deal we could get” is going to sell every bit as well as George Bush’s “Read My Lips” cave in.  It’s not like the U.S. is going to be less in debt this time next year.\nUPDATE II – Harry Reid and the Senate refused to accept the House Republican surrender:\nAt the other end of the Capitol, Senate Democrats rejected the measure without so much as a debate. The vote was 59-41, with all Democrats, two independents and six Republicans joining in opposition.  Moments later, Senate Majority Leader Harry Reid, D-Nev., unveiled an alternative that would cut spending by $2.4 trillion and raise the debt limit by the same amount, enough to meet Obama’s terms that it tide the Treasury over until 2013.\nIt should be interesting to see what the Boehner-led Republicans will try next or if they’re seriously going to go with the “unconditional surrender is the best deal we could get” theme.",
  "tags": [
    "politics"
  ],
  "categories": [],
  "sitemap_lastmod": "2011-07-29T17:30:00+00:00"
}