{
  "url": "https://voxday.net/2011/07/22/vibrancy-in-norway/",
  "scraped_at": "2025-12-13T23:16:48.709062",
  "title": "Vibrancy in Norway",
  "date_display": "July 22, 2011",
  "date_iso": "2011-07-22T17:15:00+00:00",
  "date_from_url": "2011-07-22",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>An explosion <a href=\"http://www.guardian.co.uk/world/blog/2011/jul/22/oslo-explosion-live-coverage\">in Oslo</a>:</p><blockquote><p>6.01pm: John Magnus, chief foreign correspondent of Oslo’s VG newspaper, told the Guardian he was sitting at his desk when the massive explosion in central Oslo today blew him off his chair.</p><p><i>It was 3.26 in the afternoon. The whole building was shaking. It was dancing. There was glass flying through the newsroom. I was on the far side of the building from where the prime minister’s office is. The entire glass front of our building has been blown out …</i></p><p>I saw people screaming and covered in blood. There were at least four people I saw who looked lifeless with their faces covered. We’ve had it confirmed that two people are dead but there are other locations that the emergency services have not reached yet.</p></blockquote><p>Naturally, this bombing will no more lead the Norwegian people to reconsider the wisdom of permitting Muslim immigration than the vast increase in the number of rapes committed by Muslim men.  But it should.  The multiculturalists will be quick to point out the mathematically obvious fact that that most Muslims don’t set off bombs.  But this is irrelevant.  Because it is also a fact that if a nation does not permit Muslims to enter its borders, it is far less likely to ever suffer any such incidents.</p><p>Expansionist Islam offers a challenge to the freedom of religion, (a right that does not actually exist in most countries outside the United States), that few secularists or Christians are presently capable of understanding.  It should be eminently clear by now that simply repeating the multicultural mantra that “diversity is our strength” is not going to serve any purpose.  At some point, it is going to become abundantly clear to everyone on all sides that the separatist practices of the past were not “outdated raciss bad-thought”, but the result of observation and experience.</p><p>UPDATE – According to the latest reports, the killer was a native Norwegian opposed to Muslim immigration, the Norwegian Labour Party, and the Worker’s Youth League.  The political camp appears to have been the main target and the bombing merely a diversion.  If this is indeed the case, it will represent the long-simmering immigration invasion moving to the inevitable next stage, as it looks as if the killer’s objective may have been to reduce the size of the next generation of left-wing quislings.  Regardless, the possibility that certain political policies may have provoked such a violent response cannot logically be taken as any sort of rational justification for the continuation of those societally destructive policies.</p><p>From Wikipedia: <i>“The Workers’ Youth League (Bokmål: Arbeidernes Ungdomsfylking, Nynorsk: Arbeidaranes Ungdomsfylking, or AUF) is the youth organization affiliated with the Norwegian Labour Party.  AUF was formed in April 1927, following the merger of Left Communist Youth League and Socialist Youth League of Norway. Its ideology is social democracy and democratic socialism. The current leader is Eskil Pedersen. Many former leading figures in AUF have gone on to serve in significant positions in government, such as the incumbent Prime Minister of Norway, Jens Stoltenberg.”</i></p></div>",
  "content_text": "An explosion\nin Oslo\n:\n6.01pm: John Magnus, chief foreign correspondent of Oslo’s VG newspaper, told the Guardian he was sitting at his desk when the massive explosion in central Oslo today blew him off his chair.\nIt was 3.26 in the afternoon. The whole building was shaking. It was dancing. There was glass flying through the newsroom. I was on the far side of the building from where the prime minister’s office is. The entire glass front of our building has been blown out …\nI saw people screaming and covered in blood. There were at least four people I saw who looked lifeless with their faces covered. We’ve had it confirmed that two people are dead but there are other locations that the emergency services have not reached yet.\nNaturally, this bombing will no more lead the Norwegian people to reconsider the wisdom of permitting Muslim immigration than the vast increase in the number of rapes committed by Muslim men.  But it should.  The multiculturalists will be quick to point out the mathematically obvious fact that that most Muslims don’t set off bombs.  But this is irrelevant.  Because it is also a fact that if a nation does not permit Muslims to enter its borders, it is far less likely to ever suffer any such incidents.\nExpansionist Islam offers a challenge to the freedom of religion, (a right that does not actually exist in most countries outside the United States), that few secularists or Christians are presently capable of understanding.  It should be eminently clear by now that simply repeating the multicultural mantra that “diversity is our strength” is not going to serve any purpose.  At some point, it is going to become abundantly clear to everyone on all sides that the separatist practices of the past were not “outdated raciss bad-thought”, but the result of observation and experience.\nUPDATE – According to the latest reports, the killer was a native Norwegian opposed to Muslim immigration, the Norwegian Labour Party, and the Worker’s Youth League.  The political camp appears to have been the main target and the bombing merely a diversion.  If this is indeed the case, it will represent the long-simmering immigration invasion moving to the inevitable next stage, as it looks as if the killer’s objective may have been to reduce the size of the next generation of left-wing quislings.  Regardless, the possibility that certain political policies may have provoked such a violent response cannot logically be taken as any sort of rational justification for the continuation of those societally destructive policies.\nFrom Wikipedia:\n“The Workers’ Youth League (Bokmål: Arbeidernes Ungdomsfylking, Nynorsk: Arbeidaranes Ungdomsfylking, or AUF) is the youth organization affiliated with the Norwegian Labour Party.  AUF was formed in April 1927, following the merger of Left Communist Youth League and Socialist Youth League of Norway. Its ideology is social democracy and democratic socialism. The current leader is Eskil Pedersen. Many former leading figures in AUF have gone on to serve in significant positions in government, such as the incumbent Prime Minister of Norway, Jens Stoltenberg.”",
  "tags": [
    "immigration"
  ],
  "categories": [],
  "sitemap_lastmod": "2011-07-22T16:15:00+00:00"
}