{
  "url": "https://voxday.net/2011/07/05/what-passes-for-science/",
  "scraped_at": "2025-12-13T23:15:33.581901",
  "title": "The brave struggle of the post-scientist",
  "date_display": "July 5, 2011",
  "date_iso": "2011-07-05T08:53:00+00:00",
  "date_from_url": "2011-07-05",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>Yes, climate “scientists” are certainly <a href=\"http://www.telegraph.co.uk/earth/environment/climatechange/8616213/Man-made-climate-change-evidence-hidden-by-sulphur-emissions.html\">struggling to explain</a> a lot of things.  This reminds me, whatever happened to all those recent claims of “the hottest year ever”?</p><blockquote><p>Exponents of global warming have struggled to explain why temperatures have declined in recent years instead of rising in line with the significant increase in greenhouse gas emissions.  Researchers now claim that sulphur emissions from power plants in China are blocking sunlight and having a cooling effect on the atmosphere, cancelling out the effect of global warming.</p><p>The impact of the sulphur emissions has combined with a cooler stage of the sun’s cycle and a change from the El Nino to the La Nina weather system in the South Atlantic has kept temperatures artificially low, the experts argued.</p><p>If true, this could mean a change in the Sun’s 11-year cycle along with measures to refine Chinese coal boilers will cause temperatures to rise significantly.</p></blockquote><p>First, I think it’s worth pointing out that until rather recently, the global warming scammers were claiming that the temperatures <i>were</i> rising in line with their predictions.  They were cherry-picking the temperature data, but apparently the cooling trend is too large and they can’t “hide the non-incline” any longer.  Second, I note that if not true, this means that these intrepid “scientists” will manufacture with yet another excuse to explain why they are still correct despite the increasing mass of empirical evidence that disproves their predictions.</p><p>Recall what I have said on numerous occasions before.  Once a “science” starts manufacturing epicycles on a regular basis, it’s all over but for the burial of the previous generation (or three) of failed scientists.  If the die-hard Darwinists are any example, it may take another 150 years before they begin to openly admit that their core hypothesis is simply wrong.  But skeptics can be relatively certain that the die is already cast.</p><p>The West hasn’t merely entered a post-Christian phase, it appears to be on the verge of entering a post-scientific one.</p></div>",
  "content_text": "Yes, climate “scientists” are certainly\nstruggling to explain\na lot of things.  This reminds me, whatever happened to all those recent claims of “the hottest year ever”?\nExponents of global warming have struggled to explain why temperatures have declined in recent years instead of rising in line with the significant increase in greenhouse gas emissions.  Researchers now claim that sulphur emissions from power plants in China are blocking sunlight and having a cooling effect on the atmosphere, cancelling out the effect of global warming.\nThe impact of the sulphur emissions has combined with a cooler stage of the sun’s cycle and a change from the El Nino to the La Nina weather system in the South Atlantic has kept temperatures artificially low, the experts argued.\nIf true, this could mean a change in the Sun’s 11-year cycle along with measures to refine Chinese coal boilers will cause temperatures to rise significantly.\nFirst, I think it’s worth pointing out that until rather recently, the global warming scammers were claiming that the temperatures\nwere\nrising in line with their predictions.  They were cherry-picking the temperature data, but apparently the cooling trend is too large and they can’t “hide the non-incline” any longer.  Second, I note that if not true, this means that these intrepid “scientists” will manufacture with yet another excuse to explain why they are still correct despite the increasing mass of empirical evidence that disproves their predictions.\nRecall what I have said on numerous occasions before.  Once a “science” starts manufacturing epicycles on a regular basis, it’s all over but for the burial of the previous generation (or three) of failed scientists.  If the die-hard Darwinists are any example, it may take another 150 years before they begin to openly admit that their core hypothesis is simply wrong.  But skeptics can be relatively certain that the die is already cast.\nThe West hasn’t merely entered a post-Christian phase, it appears to be on the verge of entering a post-scientific one.",
  "tags": [
    "AGW/CC",
    "science"
  ],
  "categories": [],
  "sitemap_lastmod": "2011-07-05T07:53:00+00:00"
}