{
  "url": "https://voxday.net/2012/05/24/anti-abortion-trend/",
  "scraped_at": "2025-12-14T04:55:20.957234",
  "title": "The anti-abortion trend",
  "date_display": "May 24, 2012",
  "date_iso": "2012-05-24T18:27:00+00:00",
  "date_from_url": "2012-05-24",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>One of the informative things about those who draw conclusions from purely linear poll-based trends is that they do so on a very selective basis.  For some inexplicable reason, we’re supposed to believe that legal gay “marriage” is inevitable because more people – though still less than half based on most polls – support it than before, and yet an abortion ban is impossible even though <a href=\"http://thehill.com/blogs/healthwatch/abortion/229075-poll-finds-record-low-numbers-identify-as-pro-choice?set_fb_var=1\">the anti-abortion trend</a> is not only every bit as clear, but is also supported by demographic logic.</p><blockquote><p> About four in 10 Americans said they support abortion rights in a new Gallup poll — the lowest figure recorded by the organization since it began asking the question in 1995.  Fully half of Americans, meanwhile, told Gallup they were against abortion rights.</p></blockquote><p>Of course, the more stories like this one of murdered little girls <a href=\"http://indiatoday.intoday.in/story/doctors-in-beed-feed-aborted-female-foetuses-to-dogs/1/189919.html\">being literally thrown to the dogs</a> leak out into the press, and the more third-worlders enter the country and begin to exercise their feminist “right to choose” by aborting baby girls, the stronger the anti-abortion movement will grow.</p></div>",
  "content_text": "One of the informative things about those who draw conclusions from purely linear poll-based trends is that they do so on a very selective basis.  For some inexplicable reason, we’re supposed to believe that legal gay “marriage” is inevitable because more people – though still less than half based on most polls – support it than before, and yet an abortion ban is impossible even though\nthe anti-abortion trend\nis not only every bit as clear, but is also supported by demographic logic.\nAbout four in 10 Americans said they support abortion rights in a new Gallup poll — the lowest figure recorded by the organization since it began asking the question in 1995.  Fully half of Americans, meanwhile, told Gallup they were against abortion rights.\nOf course, the more stories like this one of murdered little girls\nbeing literally thrown to the dogs\nleak out into the press, and the more third-worlders enter the country and begin to exercise their feminist “right to choose” by aborting baby girls, the stronger the anti-abortion movement will grow.",
  "tags": [
    "politics",
    "society"
  ],
  "categories": [],
  "sitemap_lastmod": "2012-05-24T17:27:00+00:00"
}