{
  "url": "https://voxday.net/2012/05/15/consequence-of-quality/",
  "scraped_at": "2025-12-14T04:54:34.896088",
  "title": "The consequence of quality",
  "date_display": "May 15, 2012",
  "date_iso": "2012-05-15T11:05:00+00:00",
  "date_from_url": "2012-05-15",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>Pat Buchanan notes that immigrants have proven to be <a href=\"http://www.wnd.com/2012/05/the-declaration-of-dependents/\">no adequate substitution</a> for the native stock:</p><blockquote><p> Since Roe v. Wade, abortions have carried off 53 million of the generations that were to replace the boomers. While those 53 million lost have been partially replaced by 40 million immigrants, legal and illegal, our recent immigrants have not exhibited the same income- or tax-producing capacity as boomers.</p></blockquote><p>Perhaps a better name for Generation X would be Generation M, for murdered.  Now, the idea that one group of people can be expected to adequately fill in for another is hardly new.  Military historians trace the evolution of the Roman legions from nearly pure Italian stock to mostly barbarian over the course of the Republic and Empire, and it is hardly surprising that the barbarian generals showed themselves to be much more inclined to march on Rome and declare themselves Emperor than the Romans brought up in the patrician traditions did, Gaius Julius Caesar being the obvious exception.  In his book on Stalingrad, Anthony Beevor notes the way in which the Soviets particularly targeted the Nazi’s Third and Fourth Romanian armies in the massive counteroffensive known as Operation Uranus and were thus able to encircle and destroy the German Sixth Army.  Had the Red Army been facing 600,000 German soldiers rather than 250,000 Germans, 150,000 Romanians, and 220,000 Italians, it is very unlikely that their attack would have succeeded.</p><p>It is impossible to deny that the United States would not merely look very different, it would <i>be</i> very different if, instead of 40 million non-Americans bringing their genetic traits, societal behavioral patterns, and cultural traditions into the country – we can no longer reasonably describe it as a nation – there were 40 million more black and white Americans raised within the American tradition.  It is not necessary to declare if change is for the better or for the worse to note that it has taken place.  And with regards to the question of whether it is for the better or not, it should be readily apparent that the direction of the migrational pattern shows which society is deemed superior by everyone except those charged with protecting the more desirable one.</p><p>But what has happened has happened.  That world is lost.  The 53 million black and white Americans of my generation and the succeeding one are already dead.  While Karl Popper argues against “historicity” and that predictions based on historical patterns are no better than soothsaying, I think he is wrong and the eventual consequences are readily apparent.  We have always known that the USA would eventually fall, since all kingdoms and empires do in time.  But now, we can be reasonably confident that we know why, if not necessary when.</p></div>",
  "content_text": "Pat Buchanan notes that immigrants have proven to be\nno adequate substitution\nfor the native stock:\nSince Roe v. Wade, abortions have carried off 53 million of the generations that were to replace the boomers. While those 53 million lost have been partially replaced by 40 million immigrants, legal and illegal, our recent immigrants have not exhibited the same income- or tax-producing capacity as boomers.\nPerhaps a better name for Generation X would be Generation M, for murdered.  Now, the idea that one group of people can be expected to adequately fill in for another is hardly new.  Military historians trace the evolution of the Roman legions from nearly pure Italian stock to mostly barbarian over the course of the Republic and Empire, and it is hardly surprising that the barbarian generals showed themselves to be much more inclined to march on Rome and declare themselves Emperor than the Romans brought up in the patrician traditions did, Gaius Julius Caesar being the obvious exception.  In his book on Stalingrad, Anthony Beevor notes the way in which the Soviets particularly targeted the Nazi’s Third and Fourth Romanian armies in the massive counteroffensive known as Operation Uranus and were thus able to encircle and destroy the German Sixth Army.  Had the Red Army been facing 600,000 German soldiers rather than 250,000 Germans, 150,000 Romanians, and 220,000 Italians, it is very unlikely that their attack would have succeeded.\nIt is impossible to deny that the United States would not merely look very different, it would\nbe\nvery different if, instead of 40 million non-Americans bringing their genetic traits, societal behavioral patterns, and cultural traditions into the country – we can no longer reasonably describe it as a nation – there were 40 million more black and white Americans raised within the American tradition.  It is not necessary to declare if change is for the better or for the worse to note that it has taken place.  And with regards to the question of whether it is for the better or not, it should be readily apparent that the direction of the migrational pattern shows which society is deemed superior by everyone except those charged with protecting the more desirable one.\nBut what has happened has happened.  That world is lost.  The 53 million black and white Americans of my generation and the succeeding one are already dead.  While Karl Popper argues against “historicity” and that predictions based on historical patterns are no better than soothsaying, I think he is wrong and the eventual consequences are readily apparent.  We have always known that the USA would eventually fall, since all kingdoms and empires do in time.  But now, we can be reasonably confident that we know why, if not necessary when.",
  "tags": [
    "decline and fall",
    "immigration"
  ],
  "categories": [],
  "sitemap_lastmod": "2012-05-15T10:05:00+00:00"
}