{
  "url": "https://voxday.net/2012/05/01/cynics-summary/",
  "scraped_at": "2025-12-14T04:53:24.651008",
  "title": "The cynic’s summary",
  "date_display": "May 1, 2012",
  "date_iso": "2012-05-01T10:47:00+00:00",
  "date_from_url": "2012-05-01",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>A review of A Dance with Dragons <a href=\"http://www.amazon.com/review/R10BNKO7FLCOB/ref=cm_cr_pr_perm?ie=UTF8&amp;ASIN=0553801473&amp;nodeID=&amp;tag=&amp;linkCode=\">posted on Amazon</a>:</p><blockquote><p> Daenerys Targaryen, Jon Snow and Tyrion Lannister sat at the head of the<br> council table in places of high honor. They had been sorely missed in<br> the previous volume and were expected to do great things now that they<br> had returned. Other major characters took up the rest of the seats on<br> either side of them, while hundreds upon hundreds of side characters<br> filled their own tables that crammed the great hall like fruits in a<br> barrel. A cacophony of sounds and colors filled the room, so much that<br> they could not tell one man from another. All the finery of Westeros and<br> the lands beyond were present with all their sigils and banners and<br> native tongues as they awaited the attack of the Others outside their<br> walls. Winter was coming too, though reports differed on exactly when.</br></br></br></br></br></br></br></br></br></br></p><p>Daenerys<br> stood up, her tokar billowing down like a sea of pearls on soft eastern<br> fabric. “Lords, ladies, random no-name filler characters who I would<br> soon forget in a minute or so, you know why we are all gathered here!”</br></br></br></p><p>They all answered in unison. “THE OTHERS! DRAGONS! WINTER! POLITICS! ENTERTAINMENT! WHOOP WHOOP!”</p><p>“Yes,<br> that is indeed what you came here for,” she giggled, as if it were a<br> secret jest. “The Others are outside our door, winter is coming,” she<br> winked at Jon. “I have three dragons, and soon I will retake my father’s<br> throne! But before we get to all that riveting stuff, and since words<br> are wind and hardly filling, we feast!”</br></br></br></br></br></p><p>Thousands of confused<br> whispers greeted her announcement, as if they could not imagine feasting<br> at a time like this. There’s never a bad time to feast! she thought.</br></br></p><p>Tyrion quipped next to her, “I would sooner have a whore feast on my-“</p><p>Servants<br> brought it in the dishes then: bowls of venison swimming in butter and<br> garlic, suckling pigs with apples in their mouths roasted to a light<br> brown crisp, crunchy capons flavored with garlic and cloves stuffed with<br> bits of bacon and vegetables, neeps fresh from the soil dabbed with<br> butter and sweet and sour sauce, cakes and pies and pastries of<br> chocolate and vanilla and fruit with icing molded to various different<br> shapes that pleased the eyes as well as the tongue. They tucked into<br> them, crumbs and sauces coating their beards and doublets. Even the<br> ladies could not seem to get food stains off their dresses.</br></br></br></br></br></br></br></br></br></p><p>A<br> serving man brought her barley stew with chopped carrots and greens on a<br> loaf of hollowed flat bread. He was a short man with even shorter hair,<br> parted in the middle with wisps of grey among the black. He had small,<br> close-set eyes and a wide, flat nose that made him resemble the suckling<br> pig on the table. His doublet was brown roughspun slashed with vair and<br> velvet and bore the sigil of the house he served: a fierce gray troll<br> on a field of green. The man was born Braavosi, but his mother took him<br> and fled to Westeros when his father died from the pox, taking a job as a<br> washerwoman for some minor lord. He did not like spicy foods, his<br> favorite color was yellow, and he liked to walk along the shoreline as<br> the sun descended into the sea.</br></br></br></br></br></br></br></br></br></br></br></p><p>They ate like this for hours,<br> lustily and with abandon, while the Others banged outside. How rude!<br> Perhaps they’re hungry, Dany thought.</br></br></p><p>When they were done Dany<br> wiped the grease from her chin and addressed the table. “That was an<br> incredible feast. Let’s have one again in a couple of pages. Jaime, what<br> is our situation?”</br></br></br></p><p>“The Others have us surrounded, your grace,”<br> he reached for a goblet, which tipped over and spilled when he used his<br> golden hand.</br></br></p><p>“I see. Ser Barristan, what do you suggest we do?” She turned to the knight.</p><p>“If<br> I would be so bold your grace, I would suggest you take your dragons to<br> battle. The Others are cold, fell creatures, and fear dragon fire.”</br></br></p><p>“That sounds like a splendid idea, Ser Barristan! But I seem to have misplaced my dragons.”</p><p>The old knight looked confused. “You…what?”</p><p>“Yes,<br> I don’t really know where they are,” she shrugged. “No matter, I’ll<br> ride my boyfriend to battle. He’s so handsome, with his forked beard and<br> blue hair….on second thought, I think I’ll ride him to bed. I’ll<br> leave the Others and retaking my father’s throne to the rest of you.”<br> She hiked up her skirts and ran up the stairs to her bedchambers,<br> singing DAARIO, OH DAARIO in a high pitched, Disney Channel voice.</br></br></br></br></br></br></p><p>The<br> table was silent and befuddled when Ser Barristan cleared his throat<br> uneasily. “I…suppose my queen and her dragons will not be joining us.<br> Forgive her…she’s still young…Lord Snow,” he turned to Jon for<br> rescue. “Will the Night’s Watch avail us? Battling the Others is your<br> province.”</br></br></br></br></br></p><p>Jon looked up solemnly from his food, flexing his sword hand. “Wildlings.”</p><p>“Excuse me?”</p><p>“Wildlings. I must deal with the wildlings.”</p><p>Ser<br> Barristan spoke slowly. “That sounds most…valiant, but…don’t you<br> think the Others are more important? They’re right outside our-“</br></br></p><p>“YOU<br> KNOW NOTHING, SER BARRISTAN!” Jon stood up suddenly, his face fierce.<br> “None of you do!” He faced each member of the table in turn. “All of you<br> are so concerned with your game of thrones and your dragons and this<br/> one is backstabbing that one while marrying this one, none of you have<br/> any inkling what’s really happening! There are…so…many…WILDLINGS!<br/> So many! I don’t know what to do with them all! Wildlings in my room,<br/> wildlings in my privy, wildlings in my soup, wildlings, wildlings,<br/> WILDLINGS! You don’t think I would rather vanquish Others and wights,<br/> but how can I when I have to wade through WILDLINGS?!” Tears ran down<br/> his bearded face. “But do you care?! NO! It’s because I’m a BASTARD<br/> isn’t it? WAAAAAHHHH!” He ran from the table, sobbing, his path impeded<br/> by a sea of wildlings.</br></br></br></p><p>“Why, isn’t this a lively war council.” The imp laughed.</p><p>Ser<br/> Barristan was at his wits end. Will no one do SOMETHING? “Lannister,<br/> while I am loathe to trust you, we could all use your cunning to<br/> navigate this impending battle.”</p><p>Tyrion grinned, a terrifying<br/> sight without a nose. “I am flattered Ser Barristan, but I don’t give a<br/> mummer’s fart what happens to any of you. Maybe in the next book. But<br/> for now, all I want to do is to find where whores go. Podrick, fetch me<br/> my armor and steed!”</p><p>His squire came out of nowhere, pulling a<br/> pig on a leash. He donned Tyrion in mail made of cardboard painted with<br/> crude, peeling designs, and placed a jester’s cap on his head. The<br/> character assassination was not complete until the imp hopped onto the<br/> sow in a graceful tumble that would not have shamed a mummer, and<br/> galloped away as fast as those piggy legs could take him out of the<br/> castle, and out of the story…while stopping every now and then to ask<br/> passersby “Where do whores go?”.</p><p>Not for the first time Ser<br/> Barristan wondered how he had ended up here. Was he the only one who<br/> remembered what really mattered? Surely he wasn’t that old. “So, what<br/> does that leave us?” he addressed the rather emptier table. “Our most<br/> major characters are off dallying about like headless chickens, doing<br/> things no one cares about, ignoring what made our series so riveting in<br/> the first place…” He stopped, there were people missing. “Where are<br/> Bran and Davos?”</p><p>Cersei answered him. “I see them at the edge of<br/> my vision sometimes. They come and go so quickly that if you blink too<br/> fast you’ll miss them. Its quite unnatural. I’d rather they stayed dea-”<br/> She gasped when Davos appeared beside her, but was gone again just as<br/> quick.</p><p>Barristan placed his head in his hands, never feeling so<br/> old as he did now. “Will NO ONE do something about the Others? Or just<br/> something INTERESTING! ANYTHING that we can do so I won’t go mad?”</p><p>“…Osmund Kettleblack and Moonboy for all I know…,” Jaime murmured.</p><p>“…Ser Meryn, Ser Ilyn, Queen Cersei…”, prattled Arya.</p><p>Stannis gritted his teeth.</p><p>Victarion did something crazy or whatever.</p><p>“Why am I even in these books?” Asha called out, but was ignored.</p><p>Bran popped out from under the table, “I’m almost a man grown!” and was gone again.</p><p>“Seven<br/> save us,” Barristan groaned, as the Others broke down the doors and<br/> swarmed into the castle. Barristan faced the readers. “Please, return to<br/> us in The Winds of Winter, spring 2020, if you still care.” The old<br/> knight plopped his head on the table and went into a much needed<br/> sleep…</p><p>The plot slept with him.</p></blockquote><p>The sad thing is, that was actually more interesting and better-written than the 959-page slog of the book itself.  Let’s face it, in a more honest world, the book would have been entitled “A Literary Death March with The Very Occasional Dragon”.</p></div>",
  "content_text": "A review of A Dance with Dragons\nposted on Amazon\n:\nDaenerys Targaryen, Jon Snow and Tyrion Lannister sat at the head of the\ncouncil table in places of high honor. They had been sorely missed in\nthe previous volume and were expected to do great things now that they\nhad returned. Other major characters took up the rest of the seats on\neither side of them, while hundreds upon hundreds of side characters\nfilled their own tables that crammed the great hall like fruits in a\nbarrel. A cacophony of sounds and colors filled the room, so much that\nthey could not tell one man from another. All the finery of Westeros and\nthe lands beyond were present with all their sigils and banners and\nnative tongues as they awaited the attack of the Others outside their\nwalls. Winter was coming too, though reports differed on exactly when.\nDaenerys\nstood up, her tokar billowing down like a sea of pearls on soft eastern\nfabric. “Lords, ladies, random no-name filler characters who I would\nsoon forget in a minute or so, you know why we are all gathered here!”\nThey all answered in unison. “THE OTHERS! DRAGONS! WINTER! POLITICS! ENTERTAINMENT! WHOOP WHOOP!”\n“Yes,\nthat is indeed what you came here for,” she giggled, as if it were a\nsecret jest. “The Others are outside our door, winter is coming,” she\nwinked at Jon. “I have three dragons, and soon I will retake my father’s\nthrone! But before we get to all that riveting stuff, and since words\nare wind and hardly filling, we feast!”\nThousands of confused\nwhispers greeted her announcement, as if they could not imagine feasting\nat a time like this. There’s never a bad time to feast! she thought.\nTyrion quipped next to her, “I would sooner have a whore feast on my-“\nServants\nbrought it in the dishes then: bowls of venison swimming in butter and\ngarlic, suckling pigs with apples in their mouths roasted to a light\nbrown crisp, crunchy capons flavored with garlic and cloves stuffed with\nbits of bacon and vegetables, neeps fresh from the soil dabbed with\nbutter and sweet and sour sauce, cakes and pies and pastries of\nchocolate and vanilla and fruit with icing molded to various different\nshapes that pleased the eyes as well as the tongue. They tucked into\nthem, crumbs and sauces coating their beards and doublets. Even the\nladies could not seem to get food stains off their dresses.\nA\nserving man brought her barley stew with chopped carrots and greens on a\nloaf of hollowed flat bread. He was a short man with even shorter hair,\nparted in the middle with wisps of grey among the black. He had small,\nclose-set eyes and a wide, flat nose that made him resemble the suckling\npig on the table. His doublet was brown roughspun slashed with vair and\nvelvet and bore the sigil of the house he served: a fierce gray troll\non a field of green. The man was born Braavosi, but his mother took him\nand fled to Westeros when his father died from the pox, taking a job as a\nwasherwoman for some minor lord. He did not like spicy foods, his\nfavorite color was yellow, and he liked to walk along the shoreline as\nthe sun descended into the sea.\nThey ate like this for hours,\nlustily and with abandon, while the Others banged outside. How rude!\nPerhaps they’re hungry, Dany thought.\nWhen they were done Dany\nwiped the grease from her chin and addressed the table. “That was an\nincredible feast. Let’s have one again in a couple of pages. Jaime, what\nis our situation?”\n“The Others have us surrounded, your grace,”\nhe reached for a goblet, which tipped over and spilled when he used his\ngolden hand.\n“I see. Ser Barristan, what do you suggest we do?” She turned to the knight.\n“If\nI would be so bold your grace, I would suggest you take your dragons to\nbattle. The Others are cold, fell creatures, and fear dragon fire.”\n“That sounds like a splendid idea, Ser Barristan! But I seem to have misplaced my dragons.”\nThe old knight looked confused. “You…what?”\n“Yes,\nI don’t really know where they are,” she shrugged. “No matter, I’ll\nride my boyfriend to battle. He’s so handsome, with his forked beard and\nblue hair….on second thought, I think I’ll ride him to bed. I’ll\nleave the Others and retaking my father’s throne to the rest of you.”\nShe hiked up her skirts and ran up the stairs to her bedchambers,\nsinging DAARIO, OH DAARIO in a high pitched, Disney Channel voice.\nThe\ntable was silent and befuddled when Ser Barristan cleared his throat\nuneasily. “I…suppose my queen and her dragons will not be joining us.\nForgive her…she’s still young…Lord Snow,” he turned to Jon for\nrescue. “Will the Night’s Watch avail us? Battling the Others is your\nprovince.”\nJon looked up solemnly from his food, flexing his sword hand. “Wildlings.”\n“Excuse me?”\n“Wildlings. I must deal with the wildlings.”\nSer\nBarristan spoke slowly. “That sounds most…valiant, but…don’t you\nthink the Others are more important? They’re right outside our-“\n“YOU\nKNOW NOTHING, SER BARRISTAN!” Jon stood up suddenly, his face fierce.\n“None of you do!” He faced each member of the table in turn. “All of you\nare so concerned with your game of thrones and your dragons and this\none is backstabbing that one while marrying this one, none of you have\nany inkling what’s really happening! There are…so…many…WILDLINGS!\nSo many! I don’t know what to do with them all! Wildlings in my room,\nwildlings in my privy, wildlings in my soup, wildlings, wildlings,\nWILDLINGS! You don’t think I would rather vanquish Others and wights,\nbut how can I when I have to wade through WILDLINGS?!” Tears ran down\nhis bearded face. “But do you care?! NO! It’s because I’m a BASTARD\nisn’t it? WAAAAAHHHH!” He ran from the table, sobbing, his path impeded\nby a sea of wildlings.\n“Why, isn’t this a lively war council.” The imp laughed.\nSer\nBarristan was at his wits end. Will no one do SOMETHING? “Lannister,\nwhile I am loathe to trust you, we could all use your cunning to\nnavigate this impending battle.”\nTyrion grinned, a terrifying\nsight without a nose. “I am flattered Ser Barristan, but I don’t give a\nmummer’s fart what happens to any of you. Maybe in the next book. But\nfor now, all I want to do is to find where whores go. Podrick, fetch me\nmy armor and steed!”\nHis squire came out of nowhere, pulling a\npig on a leash. He donned Tyrion in mail made of cardboard painted with\ncrude, peeling designs, and placed a jester’s cap on his head. The\ncharacter assassination was not complete until the imp hopped onto the\nsow in a graceful tumble that would not have shamed a mummer, and\ngalloped away as fast as those piggy legs could take him out of the\ncastle, and out of the story…while stopping every now and then to ask\npassersby “Where do whores go?”.\nNot for the first time Ser\nBarristan wondered how he had ended up here. Was he the only one who\nremembered what really mattered? Surely he wasn’t that old. “So, what\ndoes that leave us?” he addressed the rather emptier table. “Our most\nmajor characters are off dallying about like headless chickens, doing\nthings no one cares about, ignoring what made our series so riveting in\nthe first place…” He stopped, there were people missing. “Where are\nBran and Davos?”\nCersei answered him. “I see them at the edge of\nmy vision sometimes. They come and go so quickly that if you blink too\nfast you’ll miss them. Its quite unnatural. I’d rather they stayed dea-”\nShe gasped when Davos appeared beside her, but was gone again just as\nquick.\nBarristan placed his head in his hands, never feeling so\nold as he did now. “Will NO ONE do something about the Others? Or just\nsomething INTERESTING! ANYTHING that we can do so I won’t go mad?”\n“…Osmund Kettleblack and Moonboy for all I know…,” Jaime murmured.\n“…Ser Meryn, Ser Ilyn, Queen Cersei…”, prattled Arya.\nStannis gritted his teeth.\nVictarion did something crazy or whatever.\n“Why am I even in these books?” Asha called out, but was ignored.\nBran popped out from under the table, “I’m almost a man grown!” and was gone again.\n“Seven\nsave us,” Barristan groaned, as the Others broke down the doors and\nswarmed into the castle. Barristan faced the readers. “Please, return to\nus in The Winds of Winter, spring 2020, if you still care.” The old\nknight plopped his head on the table and went into a much needed\nsleep…\nThe plot slept with him.\nThe sad thing is, that was actually more interesting and better-written than the 959-page slog of the book itself.  Let’s face it, in a more honest world, the book would have been entitled “A Literary Death March with The Very Occasional Dragon”.",
  "tags": [
    "books"
  ],
  "categories": [],
  "sitemap_lastmod": "2012-05-01T09:47:00+00:00"
}