{
  "url": "https://voxday.net/2012/05/06/dangers-of-day-care/",
  "scraped_at": "2025-12-14T04:53:54.262176",
  "title": "The dangers of day care",
  "date_display": "May 6, 2012",
  "date_iso": "2012-05-06T08:29:00+00:00",
  "date_from_url": "2012-05-06",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>Is a mother’s career really worth <a href=\"http://www.startribune.com/lifestyle/health/150303605.html\">the loss of a child</a>?  And whatever happened to the liberal’s customary “if it saves just one child’s life” standard?</p><blockquote><p> A Star Tribune examination of hundreds of public records shows that the number of children dying in child care has nearly doubled in the past five years — reaching the rate of one per month. Nearly all the deaths have occurred at in-home providers (also known as family care), and most involved a child sleeping. The newspaper’s investigation also found more unsafe-sleep citations, such as lack of training or children in unsafe sleep positions, at in-home settings than at large child-care centers.</p><p>The Department of Human Services (DHS), the state’s top child-care regulator, is treating the rise in deaths as a public health crisis.  “It’s huge,” said DHS Inspector General Jerry Kerber. “It makes it clear that something has got to be done. What that something is, I think, is going to take the work. … It’s completely unacceptable.”</p><p>Using a state licensing website, the Star Tribune reviewed 217 licensed family homes and 185 child-care centers that have been cited since July 2010 for violations of state regulations. Some 20 percent of these family homes were cited for having children in unsafe sleeping positions — such as sleeping on open beds or in mechanical swings — or sleeping with heavy blankets that present suffocation hazards. About 12 percent of the child-care centers were cited for such violations.</p></blockquote><p>What should be done is that married women with young children should be encouraged and given financial incentives to stay home and raise them.  What will be done, I suspect, is a useless increase in regulation, perhaps combined with a ban on family homes that will no doubt be strongly supported by the corporations that own the large child-care centers.</p><p>What is particularly unfortunate about this incident is that it made almost no financial sense for the baby to be in day care anyhow. <i>“The Fletchers’ tragedy started with a dilemma faced by thousands of working parents across Minnesota. Just weeks after Blake was born, in February of that year, Amanda was making plans to return to her $9-an-hour job as a medical records clerk.  “It’s kind of the American way,” she said. “You have the baby, you stay home with them and then you are back to work to support your family.”  So they began looking for child care. They weighed cost, convenience and availability of providers in Park Rapids.  They found that a local child-care center would charge $120 per month more than in-home providers. That’s not unusual in Minnesota, where the average annual cost of infant care in a center is $12,900, third-highest in the nation.”</i></p><p>In other words, Amanda Fletcher had to work 1,433 hours per year – 35 weeks – simply to pay for average child care.  Factor in the payroll and income taxes at approximately 20 percent of her income, and she’d have to work 1,791 hours, or 45 weeks, simply to break even.  Even with the cheaper and substandard family home day care, at $7,350 per year she had to work 1,020 hours, or half the year, just to pay for it.  If that is the American way, then the American way is as economically illiterate as it is unsustainable.</p></div>",
  "content_text": "Is a mother’s career really worth\nthe loss of a child\n?  And whatever happened to the liberal’s customary “if it saves just one child’s life” standard?\nA Star Tribune examination of hundreds of public records shows that the number of children dying in child care has nearly doubled in the past five years — reaching the rate of one per month. Nearly all the deaths have occurred at in-home providers (also known as family care), and most involved a child sleeping. The newspaper’s investigation also found more unsafe-sleep citations, such as lack of training or children in unsafe sleep positions, at in-home settings than at large child-care centers.\nThe Department of Human Services (DHS), the state’s top child-care regulator, is treating the rise in deaths as a public health crisis.  “It’s huge,” said DHS Inspector General Jerry Kerber. “It makes it clear that something has got to be done. What that something is, I think, is going to take the work. … It’s completely unacceptable.”\nUsing a state licensing website, the Star Tribune reviewed 217 licensed family homes and 185 child-care centers that have been cited since July 2010 for violations of state regulations. Some 20 percent of these family homes were cited for having children in unsafe sleeping positions — such as sleeping on open beds or in mechanical swings — or sleeping with heavy blankets that present suffocation hazards. About 12 percent of the child-care centers were cited for such violations.\nWhat should be done is that married women with young children should be encouraged and given financial incentives to stay home and raise them.  What will be done, I suspect, is a useless increase in regulation, perhaps combined with a ban on family homes that will no doubt be strongly supported by the corporations that own the large child-care centers.\nWhat is particularly unfortunate about this incident is that it made almost no financial sense for the baby to be in day care anyhow.\n“The Fletchers’ tragedy started with a dilemma faced by thousands of working parents across Minnesota. Just weeks after Blake was born, in February of that year, Amanda was making plans to return to her $9-an-hour job as a medical records clerk.  “It’s kind of the American way,” she said. “You have the baby, you stay home with them and then you are back to work to support your family.”  So they began looking for child care. They weighed cost, convenience and availability of providers in Park Rapids.  They found that a local child-care center would charge $120 per month more than in-home providers. That’s not unusual in Minnesota, where the average annual cost of infant care in a center is $12,900, third-highest in the nation.”\nIn other words, Amanda Fletcher had to work 1,433 hours per year – 35 weeks – simply to pay for average child care.  Factor in the payroll and income taxes at approximately 20 percent of her income, and she’d have to work 1,791 hours, or 45 weeks, simply to break even.  Even with the cheaper and substandard family home day care, at $7,350 per year she had to work 1,020 hours, or half the year, just to pay for it.  If that is the American way, then the American way is as economically illiterate as it is unsustainable.",
  "tags": [
    "society"
  ],
  "categories": [],
  "sitemap_lastmod": "2012-05-06T07:29:00+00:00"
}