{
  "url": "https://voxday.net/2012/05/31/deadly-tarpi/",
  "scraped_at": "2025-12-14T04:55:43.210571",
  "title": "The deadly tarpit",
  "date_display": "May 31, 2012",
  "date_iso": "2012-05-31T08:51:00+00:00",
  "date_from_url": "2012-05-31",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>Curt Schilling is only the latest lover of games with money to learn that game development isn’t anywhere nearly <a href=\"http://games.yahoo.com/blogs/plugged-in/curt-schilling-says-38-studios-failure-cost-him-221009197.html\">as easy as it looks</a>:</p><blockquote><p> After remaining silent as his video game company collapsed around him, Curt Schilling is finally speaking out — and he’s not happy.  The former Red Sox pitcher responded to critics, pointing out that he stands to lose as much as $50 million dollars if his troubled 38 Studios can’t be saved…. 38 Studios laid off all 379 of its employees last week. The workers, who received no warning about the cuts, also reportedly have seen their health benefits expire. The tolls of the shutdown have affected Schilling as well, as the former All-Star has lost 33 lbs. in the past 45 days.  The company’s woes stem from a $75 million loan acquired from the state of Rhode Island in 2010, a move by the state to lure the then-promising company away from its home base in Massachusetts. In February of 2012, 38 Studios shipped its first game, Kingdoms of Amalur: Reckoning. While the game was a mid-level hit, selling over 1 million copies, it was unable to help the company stay afloat.</p></blockquote><p>What a nightmare.  I always expected it to end this way, only I had no idea 38 Studios had been conceived on so large a scale.  Being an ASL player, I’m very remotely acquainted with Curt, and I even sent him an email offering to give him some advice on either development or design when I first heard that he’d set it up.  He sent back a friendly email thanking me for my good wishes, but it was clear that he felt he’d put an all-star team together and everything was well under control.  But when I looked at the names involved, I didn’t recognize any of them as producers I would trust to finish a project and it looked very much like a repeat of Ion Storm, with more money and celebrity involved than good sense or productivity.</p><p>I absolutely hate seeing this sort of thing.  I’ve seen it happen too many times now, to too many good and smart people who simply fail to understand how difficult it is to build a successful game, let alone a successful game company.  If you look at the successful ones, even the ones that seem to come from nowhere, they’ve almost always got a long track record of creating and <i>completing</i> a whole host of little games you’ve never heard of.  You simply don’t do a WoW, or even an Angry Birds, the first time out of the gate.  How is it that people are still wasting $25 million, $50 million, even $100 million in developing <i>nothing</i> while a proven developer like Tarn Adams has been releasing brilliant, innovative games on a shoestring for years?</p><p>There are tremendous dangers on every side in the game development process, and worst of all, you’re constantly working against a ticking clock.  Just a few weeks ago, someone sent me a link to this page, with some screen shots of our never-released <a href=\"http://home.comcast.net/~mjonesgraphics/traveler.html\">Traveller RPG game</a> that was cancelled by Sega of Japan when they closed their Sega of America operations and ended all US-based Katana (Dreamcast) development.  I don’t know if we got out at the right time or not; sometimes I wish we’d gone ahead and done what was essentially CoD/MoH – or as we called it, first-person ASL – five years before the first WWII shooters came out.  But we were burned out, we’d already done very well out of the Rebel Moon games, and the industry was becoming more about the business and less about the games.  But when I see one successful guy after another crash and burn while trying to shoot directly for the Moon, it makes me want to set up shop as a consultant, telling these people to spend a lot less money, hire a lot fewer people, and directing their focus on making entertaining games and not failing to even release what is supposed to be the next CoD/WoW/AB.</p></div>",
  "content_text": "Curt Schilling is only the latest lover of games with money to learn that game development isn’t anywhere nearly\nas easy as it looks\n:\nAfter remaining silent as his video game company collapsed around him, Curt Schilling is finally speaking out — and he’s not happy.  The former Red Sox pitcher responded to critics, pointing out that he stands to lose as much as $50 million dollars if his troubled 38 Studios can’t be saved…. 38 Studios laid off all 379 of its employees last week. The workers, who received no warning about the cuts, also reportedly have seen their health benefits expire. The tolls of the shutdown have affected Schilling as well, as the former All-Star has lost 33 lbs. in the past 45 days.  The company’s woes stem from a $75 million loan acquired from the state of Rhode Island in 2010, a move by the state to lure the then-promising company away from its home base in Massachusetts. In February of 2012, 38 Studios shipped its first game, Kingdoms of Amalur: Reckoning. While the game was a mid-level hit, selling over 1 million copies, it was unable to help the company stay afloat.\nWhat a nightmare.  I always expected it to end this way, only I had no idea 38 Studios had been conceived on so large a scale.  Being an ASL player, I’m very remotely acquainted with Curt, and I even sent him an email offering to give him some advice on either development or design when I first heard that he’d set it up.  He sent back a friendly email thanking me for my good wishes, but it was clear that he felt he’d put an all-star team together and everything was well under control.  But when I looked at the names involved, I didn’t recognize any of them as producers I would trust to finish a project and it looked very much like a repeat of Ion Storm, with more money and celebrity involved than good sense or productivity.\nI absolutely hate seeing this sort of thing.  I’ve seen it happen too many times now, to too many good and smart people who simply fail to understand how difficult it is to build a successful game, let alone a successful game company.  If you look at the successful ones, even the ones that seem to come from nowhere, they’ve almost always got a long track record of creating and\ncompleting\na whole host of little games you’ve never heard of.  You simply don’t do a WoW, or even an Angry Birds, the first time out of the gate.  How is it that people are still wasting $25 million, $50 million, even $100 million in developing\nnothing\nwhile a proven developer like Tarn Adams has been releasing brilliant, innovative games on a shoestring for years?\nThere are tremendous dangers on every side in the game development process, and worst of all, you’re constantly working against a ticking clock.  Just a few weeks ago, someone sent me a link to this page, with some screen shots of our never-released\nTraveller RPG game\nthat was cancelled by Sega of Japan when they closed their Sega of America operations and ended all US-based Katana (Dreamcast) development.  I don’t know if we got out at the right time or not; sometimes I wish we’d gone ahead and done what was essentially CoD/MoH – or as we called it, first-person ASL – five years before the first WWII shooters came out.  But we were burned out, we’d already done very well out of the Rebel Moon games, and the industry was becoming more about the business and less about the games.  But when I see one successful guy after another crash and burn while trying to shoot directly for the Moon, it makes me want to set up shop as a consultant, telling these people to spend a lot less money, hire a lot fewer people, and directing their focus on making entertaining games and not failing to even release what is supposed to be the next CoD/WoW/AB.",
  "tags": [
    "games",
    "trainwreck"
  ],
  "categories": [],
  "sitemap_lastmod": "2012-05-31T07:51:00+00:00"
}