{
  "url": "https://voxday.net/2012/05/28/dilemma-of-dynamic-perspective/",
  "scraped_at": "2025-12-14T04:55:33.992877",
  "title": "The dilemma of a dynamic perspective",
  "date_display": "May 28, 2012",
  "date_iso": "2012-05-28T15:00:00+00:00",
  "date_from_url": "2012-05-28",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>It would appear I’m hardly the only one <a href=\"http://www.ynetnews.com/articles/0,7340,L-4234406,00.html\">to see the similarities</a> between the rhetoric of the Israeli government and the behavior of the Jewish mob and the past rhetoric and behavior of other nations:</p><blockquote><p> Last Thursday morning I woke up feeling more embarrassed for the state of Israel than almost ever before. Considering pogroms, racism (known in Israel almost exclusively as Anti-Semitism) and refugees are such central topics in Jewish history, collective memory and the Israeli education system, one would think that we would be the first to recognize such acts happening in our own backyard.</p><p>Apparently not.</p><p>Rather, it seems that the recent influx of migrants from Africa and their “taking over” of “our” cities has created a blind spot in our national conscious.  Sadly, the riots in south Tel Aviv have demonstrated that nearly a century later, some of us are no better than our former European and Russian hosts who wanted nothing more than for us to leave their country.</p></blockquote><p>Is it a blind spot or is it a newly clarified vision?  Ironically, it would appear that I have less problem with Israelis who wish to maintain a Jewish state than some Jews.  I do, however, take exception to those who actively oppose the idea of Israel or any other country being permitted to preserve its primary national identity by closing itself off to migrational waves, and American Jews are only a small, if vocal, percentage of a broad range of globalist multiculturalists who oppose that right.  I have to give some credit to Feldman and others who would have Israel abide by the same principles that they insist other countries should obey, even though I think they are mistaken and that both the current Israelis are, and the historical non-Jewish nations were, operating fully within their rights to refuse to permit foreign nationals to dwell among them.  That doesn’t justify pogroms or violence, of course, merely the peaceful deportation of foreigners to their former country or nation of origin.</p><p>On a related note, Chelm Wiseman has begun to respond to my first point, first with what he terms <a href=\"http://www.wisemanofchelm.com/2012/05/on-immigration-and-jewish-hypocrisy.html\">a primer on Jewish immigration views</a>, followed by a post contemplating the four different types of residents and <a href=\"http://www.wisemanofchelm.com/2012/05/part-2-immigration-and-jewish-hypocrisy.html\">his perspective on a country’s responsibility</a> to them.  I don’t fully agree with his perspective, but it is far closer to mine than one might imagine, as he asserts “I believe that a sovereign state has the right to determine who resides within its borders, although that comes with some limitations.”</p><p>The devil, of course, being in the details of those limitations, which we shall no doubt discuss in future posts.  However, I think the issue of the observed Jewish hypocrisy on the issue of immigration is quite easily explained, and without resorting to any bizarre collectivist theories.  The fact of the matter is that until very recently, the Jewish perspective on immigration was entirely shaped by their 2,000-year experience as migrants, with no sense of ownership in a geographically established location or even a viable, self-sustaining society to call their own.  Now finally they’ve got one again, so naturally, their perspective has begun changing in precisely the same way that a worker promoted into management has no choice but to begin to understand that the past decisions of management are not necessarily based in pure evil, avarice, and hatred for the working class, but are much more often the necessary consequences of events.</p><p>Of course, this process of promotion-based perspective-broadening is often intellectually painful, as it usually involves giving up long cherished myths, some of which have sustained the worker and perhaps even driven him to the success that led to his promotion.  One would hope that the Jews of Israel can learn from the mistakes of those who historically sought to defend their nations from the influence of unwanted foreigners even as they begin to understand the reasoning of those who deported their ancestors long ago.  There will always be some who hate Jews for one reason or another, but I suspect many Israelis, especially those in positions of responsibility for the continued survival of their country, will soon understand, assuming they do not already, that most of the nations that expelled their ancestors harbored no more intrinsic hate for the Jews than modern Israelis harbor intrinsic hate for the Sudanese now in their midst.  A desire to live among one’s own kind and protect one’s own people from dissolution and eventual destruction by foreign influences is not hate, but rather love.  It is love for one’s people, and love for their culture, language, and traditions.  This is a concept that Jews should understand and respect as well as anyone.</p></div>",
  "content_text": "It would appear I’m hardly the only one\nto see the similarities\nbetween the rhetoric of the Israeli government and the behavior of the Jewish mob and the past rhetoric and behavior of other nations:\nLast Thursday morning I woke up feeling more embarrassed for the state of Israel than almost ever before. Considering pogroms, racism (known in Israel almost exclusively as Anti-Semitism) and refugees are such central topics in Jewish history, collective memory and the Israeli education system, one would think that we would be the first to recognize such acts happening in our own backyard.\nApparently not.\nRather, it seems that the recent influx of migrants from Africa and their “taking over” of “our” cities has created a blind spot in our national conscious.  Sadly, the riots in south Tel Aviv have demonstrated that nearly a century later, some of us are no better than our former European and Russian hosts who wanted nothing more than for us to leave their country.\nIs it a blind spot or is it a newly clarified vision?  Ironically, it would appear that I have less problem with Israelis who wish to maintain a Jewish state than some Jews.  I do, however, take exception to those who actively oppose the idea of Israel or any other country being permitted to preserve its primary national identity by closing itself off to migrational waves, and American Jews are only a small, if vocal, percentage of a broad range of globalist multiculturalists who oppose that right.  I have to give some credit to Feldman and others who would have Israel abide by the same principles that they insist other countries should obey, even though I think they are mistaken and that both the current Israelis are, and the historical non-Jewish nations were, operating fully within their rights to refuse to permit foreign nationals to dwell among them.  That doesn’t justify pogroms or violence, of course, merely the peaceful deportation of foreigners to their former country or nation of origin.\nOn a related note, Chelm Wiseman has begun to respond to my first point, first with what he terms\na primer on Jewish immigration views\n, followed by a post contemplating the four different types of residents and\nhis perspective on a country’s responsibility\nto them.  I don’t fully agree with his perspective, but it is far closer to mine than one might imagine, as he asserts “I believe that a sovereign state has the right to determine who resides within its borders, although that comes with some limitations.”\nThe devil, of course, being in the details of those limitations, which we shall no doubt discuss in future posts.  However, I think the issue of the observed Jewish hypocrisy on the issue of immigration is quite easily explained, and without resorting to any bizarre collectivist theories.  The fact of the matter is that until very recently, the Jewish perspective on immigration was entirely shaped by their 2,000-year experience as migrants, with no sense of ownership in a geographically established location or even a viable, self-sustaining society to call their own.  Now finally they’ve got one again, so naturally, their perspective has begun changing in precisely the same way that a worker promoted into management has no choice but to begin to understand that the past decisions of management are not necessarily based in pure evil, avarice, and hatred for the working class, but are much more often the necessary consequences of events.\nOf course, this process of promotion-based perspective-broadening is often intellectually painful, as it usually involves giving up long cherished myths, some of which have sustained the worker and perhaps even driven him to the success that led to his promotion.  One would hope that the Jews of Israel can learn from the mistakes of those who historically sought to defend their nations from the influence of unwanted foreigners even as they begin to understand the reasoning of those who deported their ancestors long ago.  There will always be some who hate Jews for one reason or another, but I suspect many Israelis, especially those in positions of responsibility for the continued survival of their country, will soon understand, assuming they do not already, that most of the nations that expelled their ancestors harbored no more intrinsic hate for the Jews than modern Israelis harbor intrinsic hate for the Sudanese now in their midst.  A desire to live among one’s own kind and protect one’s own people from dissolution and eventual destruction by foreign influences is not hate, but rather love.  It is love for one’s people, and love for their culture, language, and traditions.  This is a concept that Jews should understand and respect as well as anyone.",
  "tags": [
    "society",
    "Vibrancy is our strength"
  ],
  "categories": [],
  "sitemap_lastmod": "2012-05-28T14:00:00+00:00"
}