{
  "url": "https://voxday.net/2012/05/02/dissecting-skeptics-vi/",
  "scraped_at": "2025-12-14T04:53:32.197040",
  "title": "Dissecting the skeptics VI",
  "date_display": "May 2, 2012",
  "date_iso": "2012-05-02T13:00:00+00:00",
  "date_from_url": "2012-05-02",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>Having shown the failure of Delavagus to defend Sextus’s defense against the charge of peritrope, we’ll now turn to his explication of the skeptics’ dialectical strategy, as described in <a href=\"http://rsbakker.wordpress.com/2012/03/16/to-unknow-our-knowing/\">To Unknow Our Knowing</a>:</p><blockquote><p> Classical Pyrrhonians argued ad hominem, not in the sense of the logical fallacy of that name, but in the sense that their dialectical strategy necessitates the exclusive utilization of the beliefs, convictions, and assumptions of their interlocutors.  In other words, they construct their arguments on the basis of what other people hold to be true.  In demonstrating to A the rational groundlessness of his belief x, Pyrrhonians draw exclusively from premises and inferential rules that are themselves accepted by A and that lead to the conclusion that A does not after all know x.  At their most abstract, then, Pyrrhonian arguments depend only on our most abstract rational commitments.  The Five Agrippan Modes (discussed in my previous post) are merely a handy formulation by skeptics of the rational commitments of non-skeptics (‘dogmatists,’ in Sextus’s sense).  For those who accept their constraints, the Five Modes constitute part of the framework of any search for the truth.  This is borne out by the fact that the vast majority of epistemological theorizing operates within the assumptions of the Five Modes, that is, such theorizing attempts to formulate a solution to the Agrippan challenge, rather than rejecting that challenge.</p><p>Thus, the self-refutatory character of skepticism demonstrates the self-refutatory character of all philosophizing done under the aegis of the rational commitments that give rise to the skeptical conclusion.  The proponent of the self-refutation response to skepticism wants to say, in effect, “If the skeptic is right, then the skeptic is wrong.”  But what the skeptical arguments in fact show is that if the skeptical arguments are right, then the dogmatists are wrong, for it is they who hold self-refuting rational commitments.  At their most abstract, these commitments constitute the very framework of philosophico-rational thought itself.</p><p>Seen in this light, skepticism is simply philosophico-rational thought coming to an awareness of its own rational groundlessness.</p></blockquote><p>I have to confess that either I am completely missing something here or Delavagus simply does not know what he is talking about.  He claims that classical Pyrrhonians exclusively utilize the beliefs, convictions, and assumptions of their interlocutors, but his claim not only has absolutely nothing to do with any of nine of the Ten Tropes, it also stands directly in contrast with Sextus’s statements about rival philosophical schools.  It seems to me – and there is an amount of additional evidence to support this – that Delavagus has failed to understand the Tenth Trope and how it is used to set <i>competing</i> dogmas in opposition to each other in order to reach suspension of judgment.  Not only does this strategy not work when dealing with an internally consistent system, but even the examples given by Sextus fall significantly short of his claimed standard of competing dogmas of equal value.  How can the myth of Cronus eating his own children possibly be given equal weight with the observed human custom of parents caring for their children?  Does any skeptic seriously accept the Twilight novels as an equal counterweight to a scientific consensus?  And more pertinently, how can Sextus’s explication of the difference between the Sceptical School and the philosophy of Heraclitus be characterized as making ANY utilization of the Heraclitan beliefs, convictions, and assumptions, let alone EXCLUSIVE utilization?</p><p><i>“For the Sceptic attacks all the dogmas of Heraclitus as having been rashly given, and opposes on the one hand the doctrine of conflagration, and on the other, the doctrine that contradictory predicates in reality apply to the same thing, and in regard to every dogma of Heraclitus he scorns his dogmatic rashness, and then, in the manner that I have before referred to, adduces the formulae “I do not understand” and “I determine nothing,” which conflict with the Heraclitan doctrines. It is absurd to say that this conflicting school is a path to the very sect with which it conflicts. It is then absurd to say that the Sceptical School is a path to the philosophy of Heraclitus.”<br/></i><br> <br> At least we can see that Delavagus is a good Pyrrhonian in this one regard: Sextus does not hesitate to engage in his own handwaving.  Simply scorning various dogmas as “rashly given” is hardly a valid rebuttal, much less one based exclusively on Heraclitan beliefs, convictions, and assumptions, and moreover, demonstrates quite clearly that Delavagus’s description of the Pyrrhonian dialectical strategy is false.  It very much reminds one of the Marxist claims of scientific socialism, which was also portrayed as being beyond criticism or refutation.</br></br></p><p>Furthermore, in his claim that Pyrrhonians “construct their arguments on the basis of what other people hold to be true”, Delavagus underlines the point I made about his previous post with regards to skepticism’s extremely limited scope and its total irrelevance to nearly everyone outside of the professional philosophical community.  Have you ever seen a skeptic attempt to disprove Christianity <i>by accepting the existence of the Creator God and the death and resurrection of Jesus Christ of Nazareth?</i> Of course not.  In fact, what this shows is that Delavagus and the modern skeptics are engaged in one gargantuan bait-and-switch, in which they use a strategy of accepting one particular set of very specific philosophical assumptions by a very small group of people – those accepting both the philosophical definition of knowledge as “justified true belief” and the constraints of the Five Agrippan Modes – and then attempting to apply the conclusions they draw to totally unrelated beliefs held by entirely different people.  This isn’t merely logically invalid, it is shamelessly deceptive and dishonest.</p><p>Delavagus then goes on to assert because the skeptic adopts the rational commitments of the philosophical dogmatist, “the self-refutatory character of skepticism demonstrates the self-refutatory character of all philosophizing done under the aegis of the rational commitments that give rise to the skeptical conclusion.”  First, note that this is an admission that the skeptic <i>has no commitment to rational thought</i>.  Second, there is a logical error here in that Delavagus is assuming that because the rational commitments gave rise to the self-refuting skeptical conclusion, they necessarily poison all other conclusions that are separately reached from the same foundation.  But even if we set aside the eight errors we previously identified in reaching those conclusions, (which are perfectly capable of explaining why skepticism is self-refuting whereas rational thought is not), it should be obvious that the failure of one branch based on the foundation of rational thought doesn’t necessarily mean that all others must fail, especially since Sextus goes to some pains to illustrate the difference between skepticism and the other philosophical schools.  The admission that skepticism is self-refuting doesn’t dictate that stoicism necessarily must be as well.</p><p>Either the skeptical conclusion is correct and thereby refutes itself along with all philosophico-rational thought or it is incorrect and therefore has nothing to say about it.  The proposed defenses of “metaphilosophy” and “a way of life” don’t permit it to escape this dilemma, its only escape is one that Delavagus suggests, but is loathe to state clearly, namely, skepticism is not rational.  And this brings us to the great irony of the modern skeptic, who as a general rule considers himself to be a great devotee of reason.  The reality is that far from being an attack on religious belief or ideological dogma, skepticism is nothing less than a direct attack on reason itself.</p><p> <b>Next section</b><br> <a href=\"http://www.milobookclub.com/2012/05/07/dissecting-skeptics-vii/\">Dissecting the skeptics VII</a></br></p><p><b>Previous sections</b><br> <a href=\"http://www.milobookclub.com/2012/04/26/dissecting-sceptics-i/\">Dissecting the skeptics I</a><br> <a href=\"http://www.milobookclub.com/2012/04/27/dissecting-sceptics-ii/\">Dissecting the skeptics II</a><br> <a href=\"http://www.milobookclub.com/2012/04/28/dissecting-skeptics-iii/\">Dissecting the skeptics III</a><br> <a href=\"http://www.milobookclub.com/2012/04/29/dissecting-skeptics-iv/\">Dissecting the skeptics IV</a><br> <a href=\"http://www.milobookclub.com/2012/04/30/dissecting-skeptics-v/\">Dissecting the skeptics V</a></br></br></br></br></br></p></div>",
  "content_text": "Having shown the failure of Delavagus to defend Sextus’s defense against the charge of peritrope, we’ll now turn to his explication of the skeptics’ dialectical strategy, as described in\nTo Unknow Our Knowing\n:\nClassical Pyrrhonians argued ad hominem, not in the sense of the logical fallacy of that name, but in the sense that their dialectical strategy necessitates the exclusive utilization of the beliefs, convictions, and assumptions of their interlocutors.  In other words, they construct their arguments on the basis of what other people hold to be true.  In demonstrating to A the rational groundlessness of his belief x, Pyrrhonians draw exclusively from premises and inferential rules that are themselves accepted by A and that lead to the conclusion that A does not after all know x.  At their most abstract, then, Pyrrhonian arguments depend only on our most abstract rational commitments.  The Five Agrippan Modes (discussed in my previous post) are merely a handy formulation by skeptics of the rational commitments of non-skeptics (‘dogmatists,’ in Sextus’s sense).  For those who accept their constraints, the Five Modes constitute part of the framework of any search for the truth.  This is borne out by the fact that the vast majority of epistemological theorizing operates within the assumptions of the Five Modes, that is, such theorizing attempts to formulate a solution to the Agrippan challenge, rather than rejecting that challenge.\nThus, the self-refutatory character of skepticism demonstrates the self-refutatory character of all philosophizing done under the aegis of the rational commitments that give rise to the skeptical conclusion.  The proponent of the self-refutation response to skepticism wants to say, in effect, “If the skeptic is right, then the skeptic is wrong.”  But what the skeptical arguments in fact show is that if the skeptical arguments are right, then the dogmatists are wrong, for it is they who hold self-refuting rational commitments.  At their most abstract, these commitments constitute the very framework of philosophico-rational thought itself.\nSeen in this light, skepticism is simply philosophico-rational thought coming to an awareness of its own rational groundlessness.\nI have to confess that either I am completely missing something here or Delavagus simply does not know what he is talking about.  He claims that classical Pyrrhonians exclusively utilize the beliefs, convictions, and assumptions of their interlocutors, but his claim not only has absolutely nothing to do with any of nine of the Ten Tropes, it also stands directly in contrast with Sextus’s statements about rival philosophical schools.  It seems to me – and there is an amount of additional evidence to support this – that Delavagus has failed to understand the Tenth Trope and how it is used to set\ncompeting\ndogmas in opposition to each other in order to reach suspension of judgment.  Not only does this strategy not work when dealing with an internally consistent system, but even the examples given by Sextus fall significantly short of his claimed standard of competing dogmas of equal value.  How can the myth of Cronus eating his own children possibly be given equal weight with the observed human custom of parents caring for their children?  Does any skeptic seriously accept the Twilight novels as an equal counterweight to a scientific consensus?  And more pertinently, how can Sextus’s explication of the difference between the Sceptical School and the philosophy of Heraclitus be characterized as making ANY utilization of the Heraclitan beliefs, convictions, and assumptions, let alone EXCLUSIVE utilization?\n“For the Sceptic attacks all the dogmas of Heraclitus as having been rashly given, and opposes on the one hand the doctrine of conflagration, and on the other, the doctrine that contradictory predicates in reality apply to the same thing, and in regard to every dogma of Heraclitus he scorns his dogmatic rashness, and then, in the manner that I have before referred to, adduces the formulae “I do not understand” and “I determine nothing,” which conflict with the Heraclitan doctrines. It is absurd to say that this conflicting school is a path to the very sect with which it conflicts. It is then absurd to say that the Sceptical School is a path to the philosophy of Heraclitus.”\nAt least we can see that Delavagus is a good Pyrrhonian in this one regard: Sextus does not hesitate to engage in his own handwaving.  Simply scorning various dogmas as “rashly given” is hardly a valid rebuttal, much less one based exclusively on Heraclitan beliefs, convictions, and assumptions, and moreover, demonstrates quite clearly that Delavagus’s description of the Pyrrhonian dialectical strategy is false.  It very much reminds one of the Marxist claims of scientific socialism, which was also portrayed as being beyond criticism or refutation.\nFurthermore, in his claim that Pyrrhonians “construct their arguments on the basis of what other people hold to be true”, Delavagus underlines the point I made about his previous post with regards to skepticism’s extremely limited scope and its total irrelevance to nearly everyone outside of the professional philosophical community.  Have you ever seen a skeptic attempt to disprove Christianity\nby accepting the existence of the Creator God and the death and resurrection of Jesus Christ of Nazareth?\nOf course not.  In fact, what this shows is that Delavagus and the modern skeptics are engaged in one gargantuan bait-and-switch, in which they use a strategy of accepting one particular set of very specific philosophical assumptions by a very small group of people – those accepting both the philosophical definition of knowledge as “justified true belief” and the constraints of the Five Agrippan Modes – and then attempting to apply the conclusions they draw to totally unrelated beliefs held by entirely different people.  This isn’t merely logically invalid, it is shamelessly deceptive and dishonest.\nDelavagus then goes on to assert because the skeptic adopts the rational commitments of the philosophical dogmatist, “the self-refutatory character of skepticism demonstrates the self-refutatory character of all philosophizing done under the aegis of the rational commitments that give rise to the skeptical conclusion.”  First, note that this is an admission that the skeptic\nhas no commitment to rational thought\n.  Second, there is a logical error here in that Delavagus is assuming that because the rational commitments gave rise to the self-refuting skeptical conclusion, they necessarily poison all other conclusions that are separately reached from the same foundation.  But even if we set aside the eight errors we previously identified in reaching those conclusions, (which are perfectly capable of explaining why skepticism is self-refuting whereas rational thought is not), it should be obvious that the failure of one branch based on the foundation of rational thought doesn’t necessarily mean that all others must fail, especially since Sextus goes to some pains to illustrate the difference between skepticism and the other philosophical schools.  The admission that skepticism is self-refuting doesn’t dictate that stoicism necessarily must be as well.\nEither the skeptical conclusion is correct and thereby refutes itself along with all philosophico-rational thought or it is incorrect and therefore has nothing to say about it.  The proposed defenses of “metaphilosophy” and “a way of life” don’t permit it to escape this dilemma, its only escape is one that Delavagus suggests, but is loathe to state clearly, namely, skepticism is not rational.  And this brings us to the great irony of the modern skeptic, who as a general rule considers himself to be a great devotee of reason.  The reality is that far from being an attack on religious belief or ideological dogma, skepticism is nothing less than a direct attack on reason itself.\nNext section\nDissecting the skeptics VII\nPrevious sections\nDissecting the skeptics I\nDissecting the skeptics II\nDissecting the skeptics III\nDissecting the skeptics IV\nDissecting the skeptics V",
  "tags": [
    "philosophy"
  ],
  "categories": [],
  "sitemap_lastmod": "2012-05-02T12:00:00+00:00"
}