{
  "url": "https://voxday.net/2012/05/23/dont-they-know-diversity-is-streng/",
  "scraped_at": "2025-12-14T04:55:13.522089",
  "title": "Don’t they know diversity is strength?",
  "date_display": "May 23, 2012",
  "date_iso": "2012-05-23T13:00:00+00:00",
  "date_from_url": "2012-05-23",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>It should be fascinating to see how the “conservative” Jewish columnists who have long advocated open borders in America react to <a href=\"http://www.jpost.com/NationalNews/Article.aspx?id=270783\">this immigration-related news out of Israel</a>:</p><blockquote><p> Illegal infiltrators threaten Israel’s character as a Jewish and democratic country, Prime Minister Binyamin Netanyahu said at the beginning of the weekly cabinet meeting on Sunday.  Calling the issue “very grave” and a threat to the “social fabric,” Netanyahu said, “If we do not stop the entry, the problem, there are now 60,000 illegal infiltrators; could easily grow to 600,000 illegal infiltrators. This would inundate the state and, to a considerable degree, cancel out its image as a Jewish and democratic state.”</p><p>The prime minister spoke of the importance of finishing construction of the Egyptian border fence and working to send away “those [illegal migrants] who are already inside.”</p><p>Netanyahu said the latter will be done in part by punishing employers who hire illegal migrants….</p><p>Also on Sunday, Interior Minister Eli Yishai (Shas) repeated his call to jail illegal African migrants, most of whom he said were involved in crime.  “I repeat what I said – we must jail all of them or deport them with a stipend. The moment they are put in jail – others won’t want to come here anymore,” Yishai said, in an interview with Army Radio.</p></blockquote><p>Now, I support Netanyahu’s position, and Yishai’s as well.  I support it for Israel, I support it for the USA, and I also support it for the nations of Eastern and Western Europe.  And for every other nation on the planet as well.  Multiculturalism is not merely a failure, but a lie.  So I should be very interested to hear how avid immigration advocates such as Jon Podhoretz, whose advocacy of open immigration is overtly and explicitly based on his Jewishness, explain the dichotomy between Netanyahu’s position and their own.  Podhoretz once said: <i>“[A]s a Jew, I have great difficulty supporting a blanket policy of immigration restriction because of what happened to the Jewish people after 1924 and the unwillingness of the United States to take Jews in.”</i></p><p>But why should the United States not have been any more unwilling to take Jews in than the Jews are to take in Africans?  Given that some Jews are still more than willing to whine about having been deported from Spain <i>more than 500 freaking years ago</i>, it seems more than a little ironic that the current leaders of the Jewish state should now claim the right to deport non-Jews from their own country.  If the Jewish people want to claim some sort of human right to immigrate into every country in the world, then they have absolutely no grounds for deporting 60,000 African immigrants, or 600,000, for that matter.  I already know how at least one of our resident Israelis will answer, since we are of the same opinion on this issue, but I’m interested to hear what Chelm and other Jewish readers have to say about these statements by the Israeli government.  Do they believe Netanyahu and Yishai are wrong, do they believe the historical expellers of the Jews were justified to expel them, or do they believe in one law for themselves and another for non-Jews?</p><p>It seems to me that if Israel is justified in deporting these African immigrants, that action will provide a powerful ex post facto justification for the many non-violent historical deportations of the Jewish people from European countries during the medieval period.  I am, of course, distinguishing these non-violent deportations from the historical massacres that took place from time to time during the same historical epoch, especially in Germany and Russia, which cannot be justified regardless of what the current Israeli government ends up doing.  It will also offer similar ex post facto justification for the more recent expulsion of Jews from the Arab nations.  One also wonders how an excess of Africans can be said to threaten Israel’s existence as a democratic state.</p><p>Now, it seems likely that Chelm will consider this post to be “dangerous”, in the sense that he describes in his post entitled <a href=\"http://www.wisemanofchelm.com/2012/05/dangerous-nature-of-alternative-right.html\">The Dangerous Nature of the Alternative Right</a>.  That’s his call, of course, but I find his assertion that doing nothing more than pointing out incontrovertible facts and asking the questions they obviously raise is tantamount to “attempting to put together an intellectually, socially palatable basis for a more modern brand of anti-semitism” to be more than a little dubious.</p><p>After all, if it’s so easy to put together a sound and popular basis for a new anti-semitism, doesn’t that tend to suggest that any such anti-semitism must be based on grounds much more solid and justifiable than irrational hatred?  What Chelm can’t seem to understand is that if one can “undermine Israel” by simply observing what Israel is undeniably doing, <i>it isn’t the observer who is doing the undermining</i>.  Nor does he appear to grasp that when a person insists genuinely neutral people are not only lying about their lack of interest in him, but are in fact his secret enemy, his paranoid assertion is likely to become a self-fulfilling prophecy over time.  You can only attack people for so long before they get tired of your antics and start to find you irritating.  And this is as true of groups as it is of individuals.</p><p>As I have previously noted, some Jews appear to be determined to create enemies where none previously existed.  And while it’s certainly a profitable strategy for the likes of Abe Foxman and the Southern Poverty Law Center, I would suggest that it is a ludicrously suboptimal survival strategy for a group that currently represents around 0.3 percent of the global population.</p><p>As to Chelm’s defense of referring to various non-Jews as Amalekites, I note the following from Wikipedia: <i>“Of the 613 mitzvot (commandments) followed by Orthodox Jews, three refer to the Amalek: to remember what the Amalekites did to Jews, to not forget what the Amalekites did to Jews, and to destroy the Amalekites utterly. The rabbis derived these from Deuteronomy 25:17-18, Exodus 17:14 and 1 Sam. 15:3.”</i> Now, perhaps he’s not an Orthodox Jew and was simply using the term as colorful rhetoric, but it is simply ridiculous to attempt to somehow turn this around and claim that I am engaging in any sort of psychological projection by noting that the label, at the very least, potentially implies violence.</p></div>",
  "content_text": "It should be fascinating to see how the “conservative” Jewish columnists who have long advocated open borders in America react to\nthis immigration-related news out of Israel\n:\nIllegal infiltrators threaten Israel’s character as a Jewish and democratic country, Prime Minister Binyamin Netanyahu said at the beginning of the weekly cabinet meeting on Sunday.  Calling the issue “very grave” and a threat to the “social fabric,” Netanyahu said, “If we do not stop the entry, the problem, there are now 60,000 illegal infiltrators; could easily grow to 600,000 illegal infiltrators. This would inundate the state and, to a considerable degree, cancel out its image as a Jewish and democratic state.”\nThe prime minister spoke of the importance of finishing construction of the Egyptian border fence and working to send away “those [illegal migrants] who are already inside.”\nNetanyahu said the latter will be done in part by punishing employers who hire illegal migrants….\nAlso on Sunday, Interior Minister Eli Yishai (Shas) repeated his call to jail illegal African migrants, most of whom he said were involved in crime.  “I repeat what I said – we must jail all of them or deport them with a stipend. The moment they are put in jail – others won’t want to come here anymore,” Yishai said, in an interview with Army Radio.\nNow, I support Netanyahu’s position, and Yishai’s as well.  I support it for Israel, I support it for the USA, and I also support it for the nations of Eastern and Western Europe.  And for every other nation on the planet as well.  Multiculturalism is not merely a failure, but a lie.  So I should be very interested to hear how avid immigration advocates such as Jon Podhoretz, whose advocacy of open immigration is overtly and explicitly based on his Jewishness, explain the dichotomy between Netanyahu’s position and their own.  Podhoretz once said:\n“[A]s a Jew, I have great difficulty supporting a blanket policy of immigration restriction because of what happened to the Jewish people after 1924 and the unwillingness of the United States to take Jews in.”\nBut why should the United States not have been any more unwilling to take Jews in than the Jews are to take in Africans?  Given that some Jews are still more than willing to whine about having been deported from Spain\nmore than 500 freaking years ago\n, it seems more than a little ironic that the current leaders of the Jewish state should now claim the right to deport non-Jews from their own country.  If the Jewish people want to claim some sort of human right to immigrate into every country in the world, then they have absolutely no grounds for deporting 60,000 African immigrants, or 600,000, for that matter.  I already know how at least one of our resident Israelis will answer, since we are of the same opinion on this issue, but I’m interested to hear what Chelm and other Jewish readers have to say about these statements by the Israeli government.  Do they believe Netanyahu and Yishai are wrong, do they believe the historical expellers of the Jews were justified to expel them, or do they believe in one law for themselves and another for non-Jews?\nIt seems to me that if Israel is justified in deporting these African immigrants, that action will provide a powerful ex post facto justification for the many non-violent historical deportations of the Jewish people from European countries during the medieval period.  I am, of course, distinguishing these non-violent deportations from the historical massacres that took place from time to time during the same historical epoch, especially in Germany and Russia, which cannot be justified regardless of what the current Israeli government ends up doing.  It will also offer similar ex post facto justification for the more recent expulsion of Jews from the Arab nations.  One also wonders how an excess of Africans can be said to threaten Israel’s existence as a democratic state.\nNow, it seems likely that Chelm will consider this post to be “dangerous”, in the sense that he describes in his post entitled\nThe Dangerous Nature of the Alternative Right\n.  That’s his call, of course, but I find his assertion that doing nothing more than pointing out incontrovertible facts and asking the questions they obviously raise is tantamount to “attempting to put together an intellectually, socially palatable basis for a more modern brand of anti-semitism” to be more than a little dubious.\nAfter all, if it’s so easy to put together a sound and popular basis for a new anti-semitism, doesn’t that tend to suggest that any such anti-semitism must be based on grounds much more solid and justifiable than irrational hatred?  What Chelm can’t seem to understand is that if one can “undermine Israel” by simply observing what Israel is undeniably doing,\nit isn’t the observer who is doing the undermining\n.  Nor does he appear to grasp that when a person insists genuinely neutral people are not only lying about their lack of interest in him, but are in fact his secret enemy, his paranoid assertion is likely to become a self-fulfilling prophecy over time.  You can only attack people for so long before they get tired of your antics and start to find you irritating.  And this is as true of groups as it is of individuals.\nAs I have previously noted, some Jews appear to be determined to create enemies where none previously existed.  And while it’s certainly a profitable strategy for the likes of Abe Foxman and the Southern Poverty Law Center, I would suggest that it is a ludicrously suboptimal survival strategy for a group that currently represents around 0.3 percent of the global population.\nAs to Chelm’s defense of referring to various non-Jews as Amalekites, I note the following from Wikipedia:\n“Of the 613 mitzvot (commandments) followed by Orthodox Jews, three refer to the Amalek: to remember what the Amalekites did to Jews, to not forget what the Amalekites did to Jews, and to destroy the Amalekites utterly. The rabbis derived these from Deuteronomy 25:17-18, Exodus 17:14 and 1 Sam. 15:3.”\nNow, perhaps he’s not an Orthodox Jew and was simply using the term as colorful rhetoric, but it is simply ridiculous to attempt to somehow turn this around and claim that I am engaging in any sort of psychological projection by noting that the label, at the very least, potentially implies violence.",
  "tags": [
    "immigration",
    "Vibrancy is our strength"
  ],
  "categories": [],
  "sitemap_lastmod": "2012-05-23T12:00:00+00:00"
}