{
  "url": "https://voxday.net/2012/05/21/failure-in-condescension/",
  "scraped_at": "2025-12-14T04:55:04.407851",
  "title": "A failure in condescension",
  "date_display": "May 21, 2012",
  "date_iso": "2012-05-21T13:00:00+00:00",
  "date_from_url": "2012-05-21",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>In which SFWA President-for-Life John Scalzi’s <a href=\"http://whatever.scalzi.com/2012/05/15/straight-white-male-the-lowest-difficulty-setting-there-is/\">misguided attempt to curry favor</a> with the non-white, non-male portion of the population is shown to be conclusively wrong by his very own selected metrics:<br/></p><blockquote><p> I’ve been thinking of a way to explain to straight white men how life works for them, without invoking the dreaded word “privilege,” to which they react like vampires being fed a garlic tart at high noon. It’s not that the word “privilege” is incorrect, it’s that it’s not their word. When confronted with “privilege,” they fiddle with the word itself, and haul out the dictionaries and find every possible way to talk about the word but not any of the things the word signifies.</p><p>So, the challenge: how to get across the ideas bound up in the word “privilege,” in a way that your average straight white man will get, without freaking out about it?</p><p>Being a white guy who likes women, here’s how I would do it:</p><p>Dudes. Imagine life here in the US — or indeed, pretty much anywhere in the Western world — is a massive role playing game, like World of Warcraft except appallingly mundane, where most quests involve the acquisition of money, cell phones and donuts, although not always at the same time. Let’s call it The Real World. You have installed The Real World on your computer and are about to start playing, but first you go to the settings tab to bind your keys, fiddle with your defaults, and choose the difficulty setting for the game. Got it?</p><p>Okay: In the role playing game known as The Real World, “Straight White Male” is the lowest difficulty setting there is.</p><p>This means that the default behaviors for almost all the non-player characters in the game are easier on you than they would be otherwise. The default barriers for completions of quests are lower. Your leveling-up thresholds come more quickly. You automatically gain entry to some parts of the map that others have to work for. The game is easier to play, automatically, and when you need help, by default it’s easier to get.</p></blockquote><p>Now, let me first point out that John is not a bad guy.  He’s actually remarkably low on the obnoxious left-liberal scale for a science fiction writer, much less a successful one, and there is no question that he means well.  That being said, he’s about as socio-sexually Gamma as it is possible to be and still be straight, and for someone whose communication skills are quite high, he’s uncharacteristically oblivious to what <i>a condescending little fuck</i> this post makes him appear to be.  But it’s only an illusion, as the reality is that Scalzi is actually engaging in a brilliant subversion.</p><p>This will, of course, escape most readers.  I suspect the average straight white man who actually works for a living rather than sitting around making up stories primarily for the benefit of obese middle-aged women aren’t terribly inclined to be lectured by an overweight, educated, soft-handed little man about how easy they have it.  Let’s look at his metaphor of the difficulty setting, which as a gamer, game producer, and game designer I am rather well suited to examine.</p><p>First, I note that he is clearly referring to a snapshot in time.  Straight white men didn’t have it any easier than, for example, straight brown men back in the age of the Pharoahs, nor will they have it easier should China defeat the USA in 2050.  So, the metrics have to refer to today, now, not what life was like in 500 BC, 1850, or 2050.  Having established that, let’s look at the measures he specifically notes and see how many of them are true:</p><p>1.  The default barriers for completions of quests are lower.<br> 2.  Your leveling-up thresholds come more quickly. <br> 3.  You automatically gain entry to some parts of the map that others have to work for. <br> 4.  The game is easier to play, automatically<br> 5.  When you need help, by default it’s easier to get.</br></br></br></br></p><p>1.  This is clearly false.  There is copious evidence showing that Scalzi has it completely wrong here.  Who is permitted to graduate from high school or college while doing sub-standard work, a black individual or a white one?  Who is permitted to skate in the workplace more often, men or women?  For whom are the standards reduced more often, white men or non-white men?</p><p>2.  This is also <i>generally</i> false; Scalzi’s perspective here is likely skewed from his professional involvement in the literary and Hollywood worlds, where connections matter far more than experience or achievement.  But unless your father owns the cleaning company, the average white male janitor or white male sales guy is not going to level up any more quickly than anyone else, in fact, there is considerable statistical evidence that proves women are promoted much more quickly than men in corporate America.  One need only look at news broadcasts to see an example of this; one never sees a twenty-two year old man reading the news.  Note that the median age of female newscasters is 26, six years younger than male newscasters.</p><p>3.  This is true, but irrelevant and misleading.  Scalzi simply ignores that white men created the desirable parts of the map where everyone wants to go.  There is no straight white male privilege in Zimbabwe because their existence is strongly frowned upon… and what was once the wealthy colony of Rhodesia is now a third-world hellhole.  Scalzi has his causation backwards here, it would be more relevant and historically correct to say that white men create more desirable parts of the map than others.  If he seriously wishes to dispute this, I suggest he move away from his lily-white Midwestern exurbia into a more vibrant community such as South-Central Los Angeles, downtown Detroit, or post-Apartheid Yeoville.  It should come as no surprise that straight white men happen to be better at playing the game of Western Civilization than anyone else.  They’re probably less naturally accomplished at the Grass Hut Game, the Aesthetic Stasis Game, or the Naked Savage Orgy Game.</p><p>4.  Is the game easier to play or are the players intrinsically more skilled?  Scalzi simply makes a naked assertion without offering any support for it.  Since the game is the same and the rules are the same, logic favors the idea that any quantitative advantage to the straight white male in this regard stems from the way in which the characters points are distributed more efficiently rather than the game setting.</p><p>5.  This is obviously untrue.  The research on the male inclination to ask for, and accept, help clearly demonstrates that it is women who find help much easier to get.  The ease with which women and minorities are permitted to exercise free association while white men are not proves that help is much harder for them to get than for others.</p><p>So, ironically enough, <i>subversively enough</i>, Scalzi not only fails to make his case, but by his own chosen metrics, winds up demonstrating that it is women who are playing on the lowest difficulty setting, not men.  One would think that was obvious, given how they live longer, work less, and have far more options open to them.  As for the straight question, that’s not even relevant, since homosexuality is not the equivalent of a difficulty setting, but rather, being left-handed and choosing to play with your left hand on a right-handed controller.  It’s understandable why someone might make that decision, but the controller is what it is and it works a lot better if you simply use your non-dominant hand.</p></div>",
  "content_text": "In which SFWA President-for-Life John Scalzi’s\nmisguided attempt to curry favor\nwith the non-white, non-male portion of the population is shown to be conclusively wrong by his very own selected metrics:\nI’ve been thinking of a way to explain to straight white men how life works for them, without invoking the dreaded word “privilege,” to which they react like vampires being fed a garlic tart at high noon. It’s not that the word “privilege” is incorrect, it’s that it’s not their word. When confronted with “privilege,” they fiddle with the word itself, and haul out the dictionaries and find every possible way to talk about the word but not any of the things the word signifies.\nSo, the challenge: how to get across the ideas bound up in the word “privilege,” in a way that your average straight white man will get, without freaking out about it?\nBeing a white guy who likes women, here’s how I would do it:\nDudes. Imagine life here in the US — or indeed, pretty much anywhere in the Western world — is a massive role playing game, like World of Warcraft except appallingly mundane, where most quests involve the acquisition of money, cell phones and donuts, although not always at the same time. Let’s call it The Real World. You have installed The Real World on your computer and are about to start playing, but first you go to the settings tab to bind your keys, fiddle with your defaults, and choose the difficulty setting for the game. Got it?\nOkay: In the role playing game known as The Real World, “Straight White Male” is the lowest difficulty setting there is.\nThis means that the default behaviors for almost all the non-player characters in the game are easier on you than they would be otherwise. The default barriers for completions of quests are lower. Your leveling-up thresholds come more quickly. You automatically gain entry to some parts of the map that others have to work for. The game is easier to play, automatically, and when you need help, by default it’s easier to get.\nNow, let me first point out that John is not a bad guy.  He’s actually remarkably low on the obnoxious left-liberal scale for a science fiction writer, much less a successful one, and there is no question that he means well.  That being said, he’s about as socio-sexually Gamma as it is possible to be and still be straight, and for someone whose communication skills are quite high, he’s uncharacteristically oblivious to what\na condescending little fuck\nthis post makes him appear to be.  But it’s only an illusion, as the reality is that Scalzi is actually engaging in a brilliant subversion.\nThis will, of course, escape most readers.  I suspect the average straight white man who actually works for a living rather than sitting around making up stories primarily for the benefit of obese middle-aged women aren’t terribly inclined to be lectured by an overweight, educated, soft-handed little man about how easy they have it.  Let’s look at his metaphor of the difficulty setting, which as a gamer, game producer, and game designer I am rather well suited to examine.\nFirst, I note that he is clearly referring to a snapshot in time.  Straight white men didn’t have it any easier than, for example, straight brown men back in the age of the Pharoahs, nor will they have it easier should China defeat the USA in 2050.  So, the metrics have to refer to today, now, not what life was like in 500 BC, 1850, or 2050.  Having established that, let’s look at the measures he specifically notes and see how many of them are true:\n1.  The default barriers for completions of quests are lower.\n2.  Your leveling-up thresholds come more quickly.\n3.  You automatically gain entry to some parts of the map that others have to work for.\n4.  The game is easier to play, automatically\n5.  When you need help, by default it’s easier to get.\n1.  This is clearly false.  There is copious evidence showing that Scalzi has it completely wrong here.  Who is permitted to graduate from high school or college while doing sub-standard work, a black individual or a white one?  Who is permitted to skate in the workplace more often, men or women?  For whom are the standards reduced more often, white men or non-white men?\n2.  This is also\ngenerally\nfalse; Scalzi’s perspective here is likely skewed from his professional involvement in the literary and Hollywood worlds, where connections matter far more than experience or achievement.  But unless your father owns the cleaning company, the average white male janitor or white male sales guy is not going to level up any more quickly than anyone else, in fact, there is considerable statistical evidence that proves women are promoted much more quickly than men in corporate America.  One need only look at news broadcasts to see an example of this; one never sees a twenty-two year old man reading the news.  Note that the median age of female newscasters is 26, six years younger than male newscasters.\n3.  This is true, but irrelevant and misleading.  Scalzi simply ignores that white men created the desirable parts of the map where everyone wants to go.  There is no straight white male privilege in Zimbabwe because their existence is strongly frowned upon… and what was once the wealthy colony of Rhodesia is now a third-world hellhole.  Scalzi has his causation backwards here, it would be more relevant and historically correct to say that white men create more desirable parts of the map than others.  If he seriously wishes to dispute this, I suggest he move away from his lily-white Midwestern exurbia into a more vibrant community such as South-Central Los Angeles, downtown Detroit, or post-Apartheid Yeoville.  It should come as no surprise that straight white men happen to be better at playing the game of Western Civilization than anyone else.  They’re probably less naturally accomplished at the Grass Hut Game, the Aesthetic Stasis Game, or the Naked Savage Orgy Game.\n4.  Is the game easier to play or are the players intrinsically more skilled?  Scalzi simply makes a naked assertion without offering any support for it.  Since the game is the same and the rules are the same, logic favors the idea that any quantitative advantage to the straight white male in this regard stems from the way in which the characters points are distributed more efficiently rather than the game setting.\n5.  This is obviously untrue.  The research on the male inclination to ask for, and accept, help clearly demonstrates that it is women who find help much easier to get.  The ease with which women and minorities are permitted to exercise free association while white men are not proves that help is much harder for them to get than for others.\nSo, ironically enough,\nsubversively enough\n, Scalzi not only fails to make his case, but by his own chosen metrics, winds up demonstrating that it is women who are playing on the lowest difficulty setting, not men.  One would think that was obvious, given how they live longer, work less, and have far more options open to them.  As for the straight question, that’s not even relevant, since homosexuality is not the equivalent of a difficulty setting, but rather, being left-handed and choosing to play with your left hand on a right-handed controller.  It’s understandable why someone might make that decision, but the controller is what it is and it works a lot better if you simply use your non-dominant hand.",
  "tags": [
    "games",
    "McRapey",
    "society"
  ],
  "categories": [],
  "sitemap_lastmod": "2012-05-21T12:00:00+00:00"
}