{
  "url": "https://voxday.net/2012/05/18/fear-of-lack-of-failure/",
  "scraped_at": "2025-12-14T04:54:51.560181",
  "title": "Fear of lack of failure",
  "date_display": "May 18, 2012",
  "date_iso": "2012-05-18T09:24:00+00:00",
  "date_from_url": "2012-05-18",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>Daniel Hannan points out <a href=\"http://www.dailymail.co.uk/debate/article-2145560/Merkels-real-fear-exit-Euro-good-Greece.html\">what the Eurocrats really fear</a>:</p><blockquote><p> Eurocrats are especially concerned that Greece might leave the euro – but not for the reason you might think. Their worry is not that Greece will sink into a state of Levantine poverty: that has already happened. No, their true fear is that, after a few wretched months, Greece would bounce back, using its newly competitive currency to price its way into the markets and export its way to growth.  If that were to happen, other countries  on the periphery of the eurozone, also  struggling with an over-valued exchange rate, might try something similar. The whole euro project would unravel faster than you could say ‘Jacques Delors’.</p><p>Eurocrats often liken the EU to a bicycle that has to keep moving forward or topple over. A ravenous shark that has to keep swimming or die might be a better simile, but never mind: the point holds.  Any rolling back of the single most important integrationist project would call the whole enterprise into question.</p></blockquote><p>This is why it is unlikely that Greece will actually leave the Euro or the ECB and IMF will follow through on their threats to cut off their loans to the Greek banks in the short term.  Tsipras has already <a href=\"http://market-ticker.org/akcs-www?post=206131\">publicly stated</a> that Greece has enough money to keep its workers and retirees afloat if it stops paying its creditors, so if the loans don’t come through, they’ll simply default.  Since the entire purpose of the various bailouts and rescue plans was to save Greece’s European creditors, not Greece, the EU doesn’t actually have any real leverage despite all of its posturing.  While this has been obvious from the start, none of the Greek politicians were willing to say anything about it in public because the two major parties are both bank-owned.  Tsipras and Syriza are not, or at least, not yet, so the game of chicken continues.</p><p>The EU was always an illusion of power and progress, so the fiction will have to be maintained until the very end of the Euro and the EU alike.  The Greeks have seen through it, the question is when the rest of Europe will do so.  So, as Hannan points out, the one thing the EU absolutely cannot afford to happen is for Greece to default on its sovereign debt, leave both the Euro and the EU, and begin an economic recovery.  And that is why Jean-Claude Trichet, the former head of the ECB, is proposing <a href=\"http://www.cnbc.com/id/47471171\">the forcible takeover of the Greek government</a>.  He suggests giving the EU the power to declare a sovereign state bankrupt and take over its fiscal policy, further illustrating how the EU is little more than the Third Reich with banks instead of tanks.</p></div>",
  "content_text": "Daniel Hannan points out\nwhat the Eurocrats really fear\n:\nEurocrats are especially concerned that Greece might leave the euro – but not for the reason you might think. Their worry is not that Greece will sink into a state of Levantine poverty: that has already happened. No, their true fear is that, after a few wretched months, Greece would bounce back, using its newly competitive currency to price its way into the markets and export its way to growth.  If that were to happen, other countries  on the periphery of the eurozone, also  struggling with an over-valued exchange rate, might try something similar. The whole euro project would unravel faster than you could say ‘Jacques Delors’.\nEurocrats often liken the EU to a bicycle that has to keep moving forward or topple over. A ravenous shark that has to keep swimming or die might be a better simile, but never mind: the point holds.  Any rolling back of the single most important integrationist project would call the whole enterprise into question.\nThis is why it is unlikely that Greece will actually leave the Euro or the ECB and IMF will follow through on their threats to cut off their loans to the Greek banks in the short term.  Tsipras has already\npublicly stated\nthat Greece has enough money to keep its workers and retirees afloat if it stops paying its creditors, so if the loans don’t come through, they’ll simply default.  Since the entire purpose of the various bailouts and rescue plans was to save Greece’s European creditors, not Greece, the EU doesn’t actually have any real leverage despite all of its posturing.  While this has been obvious from the start, none of the Greek politicians were willing to say anything about it in public because the two major parties are both bank-owned.  Tsipras and Syriza are not, or at least, not yet, so the game of chicken continues.\nThe EU was always an illusion of power and progress, so the fiction will have to be maintained until the very end of the Euro and the EU alike.  The Greeks have seen through it, the question is when the rest of Europe will do so.  So, as Hannan points out, the one thing the EU absolutely cannot afford to happen is for Greece to default on its sovereign debt, leave both the Euro and the EU, and begin an economic recovery.  And that is why Jean-Claude Trichet, the former head of the ECB, is proposing\nthe forcible takeover of the Greek government\n.  He suggests giving the EU the power to declare a sovereign state bankrupt and take over its fiscal policy, further illustrating how the EU is little more than the Third Reich with banks instead of tanks.",
  "tags": [
    "EU"
  ],
  "categories": [],
  "sitemap_lastmod": "2012-05-18T08:24:00+00:00"
}