{
  "url": "https://voxday.net/2012/05/30/free-will-and-utilitarian-objective/",
  "scraped_at": "2025-12-14T04:55:39.581100",
  "title": "Free will and the utilitarian objective",
  "date_display": "May 30, 2012",
  "date_iso": "2012-05-30T08:26:00+00:00",
  "date_from_url": "2012-05-30",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>Sam Harris disagrees with Daniel Dennett concerning <a href=\"http://www.samharris.org/blog/item/free-will-and-free-will\">the existence of free will</a>:</p><blockquote><p> Dan seems to think that free will is like color: People might have some erroneous beliefs about it, but the experience of freedom and its attendant moral responsibilities can be understood in a similarly straightforward way through science. I think that free will is an illusion and that analogies to phenomena like color do not run through. A better analogy, also taken from the domain of vision, would liken free will to the sense that most of us have of visual continuity.</p><p>Take a moment to survey your immediate surroundings. Your experience of seeing will probably seem unified—a single field in which everything appears all at once and seamlessly. But the act of seeing is not quite what it seems. The first thing to notice is that most of what you see in every instant is a blur, because you have only a narrow region of sharp focus in the center of your visual field. This area of foveal vision is also where you perceive colors most clearly; your ability to distinguish one color from another falls away completely as you reach the periphery in each eye. You continuously compensate for these limitations by allowing your gaze to lurch from point to point (executing what are known as “saccades”), but you tend not to notice these movements. Nor are you aware that your visual perception appears interrupted while your eyes are moving (otherwise you would see a continuous blurring of the scene). It was once believed that saccades caused the active suppression of vision, but recent experiments suggest that the post-saccadic image (i.e. whatever you next focus on) probably just masks the preceding blur.</p><p>There is also a region in each visual field where you receive no input at all, because the optic nerve creates a blind spot where it passes through the retina. Many of us learned to perceive the subjective consequences of this unintelligent design as children, by marking a piece of paper, closing one eye, and then moving the paper into a position where the mark disappeared. Close one eye now and look out at the world: You will probably not notice your blind spot—and yet, if you are in a crowded room, someone could well be missing his head. Most people are surely unaware that the optic blind spot exists, and even those of us who know about it can go for decades without noticing it.</p><p>While color vision survives close inspection, our conventional sense of visual continuity does not. The impression we have of seeing everything all at once, clearly, and without interruption is based on our not paying close attention to what it is like to see. I argue that the illusory nature of free will can also be noticed in this way. As with the illusion of visual continuity, the evidence of our confusion is neither far away nor deep within; rather, it is right on the surface of experience, almost too near to us to be seen.</p><p>Of course, we could take Dan’s approach and adjust the notion of “continuity” so that it better reflected the properties of human vision, giving us a new concept of seamless visual perception that is “worth wanting.” But if erroneous beliefs about visual continuity caused drivers to regularly mow down pedestrians and police sharpshooters to accidentally kill hostages, merely changing the meaning of “continuity” would not do. I believe that this is the situation we are in with the illusion of free will: False beliefs about human freedom skew our moral intuitions and anchor our system of criminal justice to a primitive ethic of retribution. And as we continue to make advances in understanding the human mind through science, our current practices will come to seem even less enlightened.</p><p>Ordinary people want to feel philosophically justified in hating evildoers and viewing them as the ultimate authors of their evil. This moral attitude has always been vulnerable to our learning more about the causes of human behavior—and in situations where the origins of a person’s actions become absolutely clear, our feelings about his responsibility begin to change. What is more, they should change. We should admit that a person is unlucky to inherit the genes and life experience that will doom him to psychopathy. That doesn’t mean we can’t lock him up, or kill him in self-defense, but hating him is not rational, given a complete understanding of how he came to be who he is. Natural, yes; rational, no. Feeling compassion for him would be rational, however—or so I have argued.</p><p>We can acknowledge the difference between voluntary and involuntary action, the responsibilities of an adult and those of a child, sanity and insanity, a troubled conscience and a clear one, without indulging the illusion of free will. We can also admit that in certain contexts, punishment might be the best way to motivate people to behave themselves. The utility of punishment is an empirical question that is well worth answering—and nothing in my account of free will requires that I deny this.</p><p>How can we ask that other people behave themselves (and even punish them for not behaving) when they are not the ultimate cause of their actions? We can (and should) make such demands when doing so has the desired effect—namely, increasing the well-being of all concerned.</p></blockquote><p>Given his intellectual track record, one of the more powerful arguments for the existence of free will is that Sam Harris believes it does not exist.  One could easily go through life with far less effective guides than simply assuming the precise opposite of what Sam Harris asserts to be true.  Harris has always been intellectually careless and lazy, but his latest foray into free will appears to border on barely bothering to show up.  His new “book” is all of 66 pages and apparently those are generously-margined pages filled with large type as it’s only 13,000 words; a trade paperback has 410 words per page, a mass-market paperback 310; <i>Free Will</i> has only 196.  I haven’t read it yet, but I will soon, if the deterministic processes that wholly dictate my actions regardless of my perception of control happen to permit me to do so.  Since we are reliably informed that our notions concerning our future actions are illusory, it is entirely possible that I will instead move to Albania and devote myself to writing homosexual love poetry in their guttural, but hauntingly beautiful language.</p><p>Isn’t it fascinating how what passes for the thinking of the most popular atheists so closely resembles that of the omniderigent Christians?  The sovereign God of the hyper-Calvinist and the nonexistent God of the atheist lead the adherent to the same conclusion: Man is not responsible for his actions.</p><p>Harris’s analogy is a poor one because free will is more analogous to vision than to visual continuity.  We fail to understand our own motivations and even our actions in much the same way that we cannot simultaneously focus on everything in our field of view.  And yet, accurately or inaccurately, we still see something.  Regardless of whether our brains light up before our finger moves or afterwards, our finger moves and something connected to our conscious minds made it move.  Harris completely fails to realize that the Libet experiment is at least as indicative of a trialist Body-Mind-Soul construction consistent with free will as the mechanistic singular one consistent with its absence.</p><p>Harris’s real purpose in attacking free will is no different than his real purpose in attacking both the existence of God as well as Christianity.  He’s a pan-global utilitarian and his books are neither philosophy nor science, they are <i>political</i> polemics intended to provide intellectual cover for the global, macro-societal restructuring he envisions.  This is not readily apparent, but it is the one clearly identifiable theme besides intellectual laziness that is woven into all his works.</p><p> UPDATE: I haven’t finished the book yet, but I got through about three-quarters it in between sets at the gym.  It’s that short and it’s that fluffy; the contrast with the Popper I’ve been reading over the last week or so is rather glaring.  Anyhow, I’ve already identified the core error in his reasoning and will explicate it tomorrow.  The short summary: Harris believes he is his feelings.  This goes a surprisingly long way towards explaining the man’s oft-demonstrated intellectual shortcomings.</p></div>",
  "content_text": "Sam Harris disagrees with Daniel Dennett concerning\nthe existence of free will\n:\nDan seems to think that free will is like color: People might have some erroneous beliefs about it, but the experience of freedom and its attendant moral responsibilities can be understood in a similarly straightforward way through science. I think that free will is an illusion and that analogies to phenomena like color do not run through. A better analogy, also taken from the domain of vision, would liken free will to the sense that most of us have of visual continuity.\nTake a moment to survey your immediate surroundings. Your experience of seeing will probably seem unified—a single field in which everything appears all at once and seamlessly. But the act of seeing is not quite what it seems. The first thing to notice is that most of what you see in every instant is a blur, because you have only a narrow region of sharp focus in the center of your visual field. This area of foveal vision is also where you perceive colors most clearly; your ability to distinguish one color from another falls away completely as you reach the periphery in each eye. You continuously compensate for these limitations by allowing your gaze to lurch from point to point (executing what are known as “saccades”), but you tend not to notice these movements. Nor are you aware that your visual perception appears interrupted while your eyes are moving (otherwise you would see a continuous blurring of the scene). It was once believed that saccades caused the active suppression of vision, but recent experiments suggest that the post-saccadic image (i.e. whatever you next focus on) probably just masks the preceding blur.\nThere is also a region in each visual field where you receive no input at all, because the optic nerve creates a blind spot where it passes through the retina. Many of us learned to perceive the subjective consequences of this unintelligent design as children, by marking a piece of paper, closing one eye, and then moving the paper into a position where the mark disappeared. Close one eye now and look out at the world: You will probably not notice your blind spot—and yet, if you are in a crowded room, someone could well be missing his head. Most people are surely unaware that the optic blind spot exists, and even those of us who know about it can go for decades without noticing it.\nWhile color vision survives close inspection, our conventional sense of visual continuity does not. The impression we have of seeing everything all at once, clearly, and without interruption is based on our not paying close attention to what it is like to see. I argue that the illusory nature of free will can also be noticed in this way. As with the illusion of visual continuity, the evidence of our confusion is neither far away nor deep within; rather, it is right on the surface of experience, almost too near to us to be seen.\nOf course, we could take Dan’s approach and adjust the notion of “continuity” so that it better reflected the properties of human vision, giving us a new concept of seamless visual perception that is “worth wanting.” But if erroneous beliefs about visual continuity caused drivers to regularly mow down pedestrians and police sharpshooters to accidentally kill hostages, merely changing the meaning of “continuity” would not do. I believe that this is the situation we are in with the illusion of free will: False beliefs about human freedom skew our moral intuitions and anchor our system of criminal justice to a primitive ethic of retribution. And as we continue to make advances in understanding the human mind through science, our current practices will come to seem even less enlightened.\nOrdinary people want to feel philosophically justified in hating evildoers and viewing them as the ultimate authors of their evil. This moral attitude has always been vulnerable to our learning more about the causes of human behavior—and in situations where the origins of a person’s actions become absolutely clear, our feelings about his responsibility begin to change. What is more, they should change. We should admit that a person is unlucky to inherit the genes and life experience that will doom him to psychopathy. That doesn’t mean we can’t lock him up, or kill him in self-defense, but hating him is not rational, given a complete understanding of how he came to be who he is. Natural, yes; rational, no. Feeling compassion for him would be rational, however—or so I have argued.\nWe can acknowledge the difference between voluntary and involuntary action, the responsibilities of an adult and those of a child, sanity and insanity, a troubled conscience and a clear one, without indulging the illusion of free will. We can also admit that in certain contexts, punishment might be the best way to motivate people to behave themselves. The utility of punishment is an empirical question that is well worth answering—and nothing in my account of free will requires that I deny this.\nHow can we ask that other people behave themselves (and even punish them for not behaving) when they are not the ultimate cause of their actions? We can (and should) make such demands when doing so has the desired effect—namely, increasing the well-being of all concerned.\nGiven his intellectual track record, one of the more powerful arguments for the existence of free will is that Sam Harris believes it does not exist.  One could easily go through life with far less effective guides than simply assuming the precise opposite of what Sam Harris asserts to be true.  Harris has always been intellectually careless and lazy, but his latest foray into free will appears to border on barely bothering to show up.  His new “book” is all of 66 pages and apparently those are generously-margined pages filled with large type as it’s only 13,000 words; a trade paperback has 410 words per page, a mass-market paperback 310;\nFree Will\nhas only 196.  I haven’t read it yet, but I will soon, if the deterministic processes that wholly dictate my actions regardless of my perception of control happen to permit me to do so.  Since we are reliably informed that our notions concerning our future actions are illusory, it is entirely possible that I will instead move to Albania and devote myself to writing homosexual love poetry in their guttural, but hauntingly beautiful language.\nIsn’t it fascinating how what passes for the thinking of the most popular atheists so closely resembles that of the omniderigent Christians?  The sovereign God of the hyper-Calvinist and the nonexistent God of the atheist lead the adherent to the same conclusion: Man is not responsible for his actions.\nHarris’s analogy is a poor one because free will is more analogous to vision than to visual continuity.  We fail to understand our own motivations and even our actions in much the same way that we cannot simultaneously focus on everything in our field of view.  And yet, accurately or inaccurately, we still see something.  Regardless of whether our brains light up before our finger moves or afterwards, our finger moves and something connected to our conscious minds made it move.  Harris completely fails to realize that the Libet experiment is at least as indicative of a trialist Body-Mind-Soul construction consistent with free will as the mechanistic singular one consistent with its absence.\nHarris’s real purpose in attacking free will is no different than his real purpose in attacking both the existence of God as well as Christianity.  He’s a pan-global utilitarian and his books are neither philosophy nor science, they are\npolitical\npolemics intended to provide intellectual cover for the global, macro-societal restructuring he envisions.  This is not readily apparent, but it is the one clearly identifiable theme besides intellectual laziness that is woven into all his works.\nUPDATE: I haven’t finished the book yet, but I got through about three-quarters it in between sets at the gym.  It’s that short and it’s that fluffy; the contrast with the Popper I’ve been reading over the last week or so is rather glaring.  Anyhow, I’ve already identified the core error in his reasoning and will explicate it tomorrow.  The short summary: Harris believes he is his feelings.  This goes a surprisingly long way towards explaining the man’s oft-demonstrated intellectual shortcomings.",
  "tags": [
    "atheism",
    "philosophy",
    "Sam Harris",
    "science"
  ],
  "categories": [],
  "sitemap_lastmod": "2012-05-30T07:26:00+00:00"
}