{
  "url": "https://voxday.net/2012/05/17/game-over/",
  "scraped_at": "2025-12-14T04:54:45.996353",
  "title": "Game over",
  "date_display": "May 17, 2012",
  "date_iso": "2012-05-17T09:08:00+00:00",
  "date_from_url": "2012-05-17",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>The demographic sun <a href=\"http://www.nytimes.com/2012/05/17/us/whites-account-for-under-half-of-births-in-us.html?hp\">sets on the USA</a>:</p><blockquote><p> After years of speculation, estimates and projections, the Census Bureau has made it official: White births are no longer a majority in the United States.  Non-Hispanic whites accounted for 49.6 percent of all births in the 12-month period that ended last July, according to Census Bureau data made public on Thursday, while minorities — including Hispanics, blacks, Asians and those of mixed race — reached 50.4 percent, representing a majority for the first time in the country’s history.  Such a turn has been long expected, but no one was certain when the moment would arrive — signaling a milestone for a nation whose government was founded by white Europeans and has wrestled mightily with issues of race, from the days of slavery, through a civil war, bitter civil rights battles and, most recently, highly charged debates over efforts to restrict immigration….</p><p>Minorities accounted for 92 percent of the nation’s population growth in the decade that ended in 2010, Mr. Frey calculated, a surge that has created a very different looking America from the one of the 1950s, when the TV characters Ozzie and Harriet were a national archetype.  The change is playing out across states with large differences in ethnic and racial makeup between the elderly and the young. Some of the largest gaps are in Arizona, Nevada, Texas and California, states that have had flare-ups over immigration, school textbooks and priorities in spending. The nonrural county with the largest gap is Yuma County, Ariz., where just 18 percent of people under 20 are white, compared with 73 percent of people over 65, Mr. Frey said.</p></blockquote><p>It is most certainly a milestone, but precisely what does that milestone signify?  At the risk of being accused of historicity by Karl Popper, the answer seems fairly obvious.  Historical multi-ethnic societies have traditionally been empires, more specifically, empires ruled by hereditary monarchs.  And as the ethnic differences grew, those empires, even those sharing the bond of an all-encompassing state religion, tended to break apart on ethnic lines.  So, even if we discount any possibility of qualitative differences between the various ethnicities that have now replaced the relatively homogenous white population, we should expect a) a move towards increasingly authoritarian, winner-takes-all, short term-oriented government, and b) an eventual breakup into two or three political entities.</p><p>The obvious one, of course, is the split between Hispanic America in the southwest and the rest of the country.  However, as we’ve seen with the Euro debacle, once it becomes obvious that one split is on the cards, others will become seen to be increasingly viable.  And once the Hispanic portion of the country exercises its legitimate right to self-determination and goes its own way, presumably before 2033, it seems readily apparent that White America will at long last separate into its “liberal” and “conservative” halves when conservative America finally realizes that the country, to say nothing of the <i>nation</i>, was literally unable to survive the self-destructive tendencies of its liberal population.  These political separations won’t necessarily require civil war or even large-scale violence – Czechoslovakia peacefully divided into Slovakia and the Czech Republic after 74 years of political union – but in this case, it probably will due to the heavily ideological aspects of the divide.</p></div>",
  "content_text": "The demographic sun\nsets on the USA\n:\nAfter years of speculation, estimates and projections, the Census Bureau has made it official: White births are no longer a majority in the United States.  Non-Hispanic whites accounted for 49.6 percent of all births in the 12-month period that ended last July, according to Census Bureau data made public on Thursday, while minorities — including Hispanics, blacks, Asians and those of mixed race — reached 50.4 percent, representing a majority for the first time in the country’s history.  Such a turn has been long expected, but no one was certain when the moment would arrive — signaling a milestone for a nation whose government was founded by white Europeans and has wrestled mightily with issues of race, from the days of slavery, through a civil war, bitter civil rights battles and, most recently, highly charged debates over efforts to restrict immigration….\nMinorities accounted for 92 percent of the nation’s population growth in the decade that ended in 2010, Mr. Frey calculated, a surge that has created a very different looking America from the one of the 1950s, when the TV characters Ozzie and Harriet were a national archetype.  The change is playing out across states with large differences in ethnic and racial makeup between the elderly and the young. Some of the largest gaps are in Arizona, Nevada, Texas and California, states that have had flare-ups over immigration, school textbooks and priorities in spending. The nonrural county with the largest gap is Yuma County, Ariz., where just 18 percent of people under 20 are white, compared with 73 percent of people over 65, Mr. Frey said.\nIt is most certainly a milestone, but precisely what does that milestone signify?  At the risk of being accused of historicity by Karl Popper, the answer seems fairly obvious.  Historical multi-ethnic societies have traditionally been empires, more specifically, empires ruled by hereditary monarchs.  And as the ethnic differences grew, those empires, even those sharing the bond of an all-encompassing state religion, tended to break apart on ethnic lines.  So, even if we discount any possibility of qualitative differences between the various ethnicities that have now replaced the relatively homogenous white population, we should expect a) a move towards increasingly authoritarian, winner-takes-all, short term-oriented government, and b) an eventual breakup into two or three political entities.\nThe obvious one, of course, is the split between Hispanic America in the southwest and the rest of the country.  However, as we’ve seen with the Euro debacle, once it becomes obvious that one split is on the cards, others will become seen to be increasingly viable.  And once the Hispanic portion of the country exercises its legitimate right to self-determination and goes its own way, presumably before 2033, it seems readily apparent that White America will at long last separate into its “liberal” and “conservative” halves when conservative America finally realizes that the country, to say nothing of the\nnation\n, was literally unable to survive the self-destructive tendencies of its liberal population.  These political separations won’t necessarily require civil war or even large-scale violence – Czechoslovakia peacefully divided into Slovakia and the Czech Republic after 74 years of political union – but in this case, it probably will due to the heavily ideological aspects of the divide.",
  "tags": [
    "decline and fall"
  ],
  "categories": [],
  "sitemap_lastmod": "2012-05-17T08:08:00+00:00"
}