{
  "url": "https://voxday.net/2012/05/17/god-is-not-dead/",
  "scraped_at": "2025-12-14T04:54:47.923625",
  "title": "God is not dead",
  "date_display": "May 17, 2012",
  "date_iso": "2012-05-17T14:20:00+00:00",
  "date_from_url": "2012-05-17",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>Jonathan Frost concludes that <a href=\"http://www.jonathan-frost.com/god-is-dead/\">God is dead</a>:</p><blockquote><p> Like many young men in the 21st century, I’ve come to some grim conclusions about the state of the world. I’ve developed a healthy mistrust of conventional wisdom and the institutions responsible for teaching it. I’m hardly the only one. The blogroll to the left is mostly composed of men like myself who have also been raised in the late 20th century American tradition, and found it lacking. In short, we have lost our faith. We are adrift.<br> But wait!<br> Traditional Christians like Dalrock, Ulysses, Elusive Wapiti, Throne and Altar, Koanic, Larry Auster and Patriactionary have a message for young men like myself. The message is: “We have an alternative for you. The Alternative is Christ. Turn to Christ, and the world will make sense to you. Turn to Christ en masse, and the world will become just.”<br> But the message is not landing, and I’ll tell you why:</br></br></br></p></blockquote><p>The message is not new, but at least the reasoning is original.  Let’s consider his explanations for his loss of faith:</p><p><b>1) Christian Theology is implicitly leftist</b></p><p>This is a simple confusion of Christian Theology with the infiltration and perversion of many Christian churches concerning which the Apostle Paul warned.  Not only is there nothing leftist about Christianity, Christianity and left-wing ideology have very few things in common except a belief in the inevitable progress of history towards a fixed end.  Christian theology declares the world will end in fire and blood of the Harvest of Souls, left-wing ideology asserts it will end in the pink and sparkly gay globalist picture presented at the end of Disneyland’s It’s a Small World ride.  What Frost fails to realize is that leftism is the substitution of the State for God, for a static humanity instead of Christianity’s intrinsically dynamic one.  This, of course, is why leftist regimes invariably persecute Christianity, as unlike Frost, they recognize their implacable enemy.</p><p><b>2) Christianity is already responsible most for our problems</b></p><p>Christianity didn’t bring down the Roman empire.  That’s simply the long-outdated view put forth by Edward Gibbon.  And the chief difference between a Leninist and a Christian is that the former believes in the perfectibility of Man whereas the latter rejects it entirely.  This is, to put it mildly, a fundamental and irreconcilable difference.  Nor can Christianity be reasonably blamed for the demographic or debt crises of the West, indeed, it would be closer to the mark, though still incorrect, to blame Judaism.</p><p><b>3) The Church Is Doomed</b></p><p>Nero couldn’t wipe it out.  Diocletian couldn’t slow its growth.  Julian the Apostate couldn’t put a dent in it.  The left-wing butchers of the French Revolution, the October Revolution, the Great Leap Forward, and the Killing Fields all failed in their murderous efforts to eradicate it despite the possession of absolute power.  Christianity persists even in the death camps of the North Korean communists.  Frost is correct in that the atheist hate and the desire to destroy the Church is most definitely there, but he fails to recognize the historical reality that persecution has always purified and refined the faith and made the Church stronger.  The weaker brethren will fall by the wayside, as they always have, while the stronger ones convert their very killers through the powerful witness of their martyrdom.  The Gates of Hell will not prevail.</p><p><b>4) Modern Christianity is a feminist and leftist institution</b></p><p>Correction: modern <i>churchianity</i> is a feminist and mildly leftist institution.  It is true that many of the formal denominations are rapidly dying out as a result of their abandonment of Christian theology.  They may possess the name and the form, but the animating spirit has left the building.  However, the number of the non-denominational “unchurched” continues to grow explosively and at the expense of the dying mainline institutions.</p><p><b>5) Christianity is False </b></p><p>Frost is certainly welcome to his conclusion.  But again, his reasoning that supports it is flawed.  He writes: <i>“But if Christianity is true, there should be some indication of it as such in our observable reality. The texts of Christianity should accord with morals that encourage stable and just societies. Christianity should be associated historically with righteousness. Christianity should not be breathing its last breaths before landing on the ash heap of history.”</i></p><p>I note first Frost’s implied opinion that the West is in decline and his declared opinion that Christianity is in decline.  If he values the traditional West, which was historically known as Christendom, then it would appear to be obvious that its decline is at least in part due to the decline of Christianity within it.  Moreover, he has a fundamental misunderstanding of Christianity, as it explicitly states the complete opposite of his assertion that Christianity should be associated historically with righteousness, because Christianity provides the very metric by which we are able to discern our own <i>unrighteousness</i>.  To his credit, Frost himself admits his general lack of knowledge concerning Christian theology, and I would tend to second the commenter’s recommendation of beginning with <i>The Chronicles of Narnia</i>, continuing with the first two books of Lewis’s <i>Space Trilogy</i>, before then moving on to some of Lewis’s non-fiction as well as Chesterton.</p><p>Only then would it perhaps make sense to consider exploring the Catholic catechism or reading Augustine, Aquinas, and the early Fathers if he is still interested in delving deeper.  It may sound ludicrous to suggest beginning with children’s novels, but then, the sad and observable reality is that most of the opinions expressed by various critics of Christianity reveal that their theological knowledge doesn’t even rise to that remarkably low level.  As for a very good historical overview of the effects of Christianity on Rome, I would recommend the first volume of the Cambridge Medieval History, subtitled <i>The Christian Empire</i>.</p></div>",
  "content_text": "Jonathan Frost concludes that\nGod is dead\n:\nLike many young men in the 21st century, I’ve come to some grim conclusions about the state of the world. I’ve developed a healthy mistrust of conventional wisdom and the institutions responsible for teaching it. I’m hardly the only one. The blogroll to the left is mostly composed of men like myself who have also been raised in the late 20th century American tradition, and found it lacking. In short, we have lost our faith. We are adrift.\nBut wait!\nTraditional Christians like Dalrock, Ulysses, Elusive Wapiti, Throne and Altar, Koanic, Larry Auster and Patriactionary have a message for young men like myself. The message is: “We have an alternative for you. The Alternative is Christ. Turn to Christ, and the world will make sense to you. Turn to Christ en masse, and the world will become just.”\nBut the message is not landing, and I’ll tell you why:\nThe message is not new, but at least the reasoning is original.  Let’s consider his explanations for his loss of faith:\n1) Christian Theology is implicitly leftist\nThis is a simple confusion of Christian Theology with the infiltration and perversion of many Christian churches concerning which the Apostle Paul warned.  Not only is there nothing leftist about Christianity, Christianity and left-wing ideology have very few things in common except a belief in the inevitable progress of history towards a fixed end.  Christian theology declares the world will end in fire and blood of the Harvest of Souls, left-wing ideology asserts it will end in the pink and sparkly gay globalist picture presented at the end of Disneyland’s It’s a Small World ride.  What Frost fails to realize is that leftism is the substitution of the State for God, for a static humanity instead of Christianity’s intrinsically dynamic one.  This, of course, is why leftist regimes invariably persecute Christianity, as unlike Frost, they recognize their implacable enemy.\n2) Christianity is already responsible most for our problems\nChristianity didn’t bring down the Roman empire.  That’s simply the long-outdated view put forth by Edward Gibbon.  And the chief difference between a Leninist and a Christian is that the former believes in the perfectibility of Man whereas the latter rejects it entirely.  This is, to put it mildly, a fundamental and irreconcilable difference.  Nor can Christianity be reasonably blamed for the demographic or debt crises of the West, indeed, it would be closer to the mark, though still incorrect, to blame Judaism.\n3) The Church Is Doomed\nNero couldn’t wipe it out.  Diocletian couldn’t slow its growth.  Julian the Apostate couldn’t put a dent in it.  The left-wing butchers of the French Revolution, the October Revolution, the Great Leap Forward, and the Killing Fields all failed in their murderous efforts to eradicate it despite the possession of absolute power.  Christianity persists even in the death camps of the North Korean communists.  Frost is correct in that the atheist hate and the desire to destroy the Church is most definitely there, but he fails to recognize the historical reality that persecution has always purified and refined the faith and made the Church stronger.  The weaker brethren will fall by the wayside, as they always have, while the stronger ones convert their very killers through the powerful witness of their martyrdom.  The Gates of Hell will not prevail.\n4) Modern Christianity is a feminist and leftist institution\nCorrection: modern\nchurchianity\nis a feminist and mildly leftist institution.  It is true that many of the formal denominations are rapidly dying out as a result of their abandonment of Christian theology.  They may possess the name and the form, but the animating spirit has left the building.  However, the number of the non-denominational “unchurched” continues to grow explosively and at the expense of the dying mainline institutions.\n5) Christianity is False\nFrost is certainly welcome to his conclusion.  But again, his reasoning that supports it is flawed.  He writes:\n“But if Christianity is true, there should be some indication of it as such in our observable reality. The texts of Christianity should accord with morals that encourage stable and just societies. Christianity should be associated historically with righteousness. Christianity should not be breathing its last breaths before landing on the ash heap of history.”\nI note first Frost’s implied opinion that the West is in decline and his declared opinion that Christianity is in decline.  If he values the traditional West, which was historically known as Christendom, then it would appear to be obvious that its decline is at least in part due to the decline of Christianity within it.  Moreover, he has a fundamental misunderstanding of Christianity, as it explicitly states the complete opposite of his assertion that Christianity should be associated historically with righteousness, because Christianity provides the very metric by which we are able to discern our own\nunrighteousness\n.  To his credit, Frost himself admits his general lack of knowledge concerning Christian theology, and I would tend to second the commenter’s recommendation of beginning with\nThe Chronicles of Narnia\n, continuing with the first two books of Lewis’s\nSpace Trilogy\n, before then moving on to some of Lewis’s non-fiction as well as Chesterton.\nOnly then would it perhaps make sense to consider exploring the Catholic catechism or reading Augustine, Aquinas, and the early Fathers if he is still interested in delving deeper.  It may sound ludicrous to suggest beginning with children’s novels, but then, the sad and observable reality is that most of the opinions expressed by various critics of Christianity reveal that their theological knowledge doesn’t even rise to that remarkably low level.  As for a very good historical overview of the effects of Christianity on Rome, I would recommend the first volume of the Cambridge Medieval History, subtitled\nThe Christian Empire\n.",
  "tags": [
    "Christianity"
  ],
  "categories": [],
  "sitemap_lastmod": "2012-05-17T13:20:00+00:00"
}