{
  "url": "https://voxday.net/2012/05/09/hsbcs-grand-scale-id-thef/",
  "scraped_at": "2025-12-14T04:54:10.371367",
  "title": "HSBC’s grand scale ID theft",
  "date_display": "May 9, 2012",
  "date_iso": "2012-05-09T15:12:00+00:00",
  "date_from_url": "2012-05-09",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>It’s hardly news that the big banks are criminal organizations, but this report of <a href=\"http://www.wnd.com/2012/05/banking-giant-hsbc-a-criminal-enterprise/\">grand scale identity theft for money-laundering purposes</a> is really rather remarkable.</p><blockquote><p> The global banking giant HSBC is a “criminal” operation, charges a former officer for the company’s southern New York region in a video interview with WND.  John Cruz, a former vice president and relationship manager, has turned over to WND more than 1,000 pages of documents, including customer account ledgers for dozens of companies through which, he charges, the financial institution was laundering money each month….<br> Cruz charges that the 1,000 pages of customer account records suggest HSBC relied on identity theft to capture legitimate Social Security numbers that were then used to create the bogus retail and commercial bank accounts through which employees systematically deposited and withdrew hundreds of millions of dollars on a daily basis, apparently without the knowledge of the identity theft victims.  “When an individual finds out they got a loan they never knew about, 5 percent of that loan went to the accounting firm that made up the phony tax returns, and the other 95 percent of that loan went to the manager,” he said.  “One manager was involved in the transaction, another manager was involved in notarizing the transaction, and senior management was involved where they signed off permission to give the loans even when the loans get rejected by underwriting.”</br></p></blockquote><p>It is perhaps worth noting that the Obama administration has not arrested a single banking executive despite the regular reports of large scale criminal activity by the organizations they are running.</p></div>",
  "content_text": "It’s hardly news that the big banks are criminal organizations, but this report of\ngrand scale identity theft for money-laundering purposes\nis really rather remarkable.\nThe global banking giant HSBC is a “criminal” operation, charges a former officer for the company’s southern New York region in a video interview with WND.  John Cruz, a former vice president and relationship manager, has turned over to WND more than 1,000 pages of documents, including customer account ledgers for dozens of companies through which, he charges, the financial institution was laundering money each month….\nCruz charges that the 1,000 pages of customer account records suggest HSBC relied on identity theft to capture legitimate Social Security numbers that were then used to create the bogus retail and commercial bank accounts through which employees systematically deposited and withdrew hundreds of millions of dollars on a daily basis, apparently without the knowledge of the identity theft victims.  “When an individual finds out they got a loan they never knew about, 5 percent of that loan went to the accounting firm that made up the phony tax returns, and the other 95 percent of that loan went to the manager,” he said.  “One manager was involved in the transaction, another manager was involved in notarizing the transaction, and senior management was involved where they signed off permission to give the loans even when the loans get rejected by underwriting.”\nIt is perhaps worth noting that the Obama administration has not arrested a single banking executive despite the regular reports of large scale criminal activity by the organizations they are running.",
  "tags": [
    "banks"
  ],
  "categories": [],
  "sitemap_lastmod": "2012-05-09T14:12:00+00:00"
}