{
  "url": "https://voxday.net/2012/05/24/insert-top-gun-quote-here/",
  "scraped_at": "2025-12-14T04:55:19.126110",
  "title": "[Insert Top Gun quote here]",
  "date_display": "May 24, 2012",
  "date_iso": "2012-05-24T12:30:00+00:00",
  "date_from_url": "2012-05-24",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>I have the feeling that even if Chelm hadn’t already accused me of anti-semitism, someone else is bound to by virtue of the extreme ease with which I will show the erroneous aspects of his arguments.  After I disputed what he described as “the danger of the alternative right”, Chelm doubled-down and <a href=\"http://www.wisemanofchelm.com/2012/05/vox-day-takes-exception-with-my.html\">attempted to bolster his position</a> as follows:</p><blockquote><p> The other day I wrote a post about an exchange I had with Vox Day on his website Vox Popoli.  I made a rhetorical mistake by referring to some of his more hotheaded anti-semitic commenters as “Amalekites.”  Vox took this to be a credible and realistic threat of violence against his readers… which I believe reveals more about Vox’s thinking than mine.  You can read his post here and my response here.  If you didn’t read the post, additionally, I had the nerve to described him as dangerous, because his blog is a great example (in terms of quality) of a group of web sites of the “alternative right” (or alt-right) which, among other things, seeks to create an intellectual basis for a more socially acceptable anti-semitism….</p><p>So, this is what Vox did in today’s post.  There are so many errors and accusations in it that to try to refute them all in one shot would require a long rambling… boring… post.   In advance, he is slamming me for doing exactly what he is inviting me to do.  So here is how I will approach this… I will list the accusations below (paraphrased) and over the course of the next few days, I will refute them one by one.</p></blockquote><p>So many errors that he can’t possibly respond to them all right now… that sure sounds familiar, doesn’t it?  But it’s not actually a Fighting Withdrawal, as Chelm proves himself to be more than the usual handwaver in actually troubling to list seven of my purported charges and declaring that he will respond substantively to them.  Unfortunately, he’s already provided some indication that he’s not going to be able to respond <i>effectively</i> to them, given the prelude provided above.</p><p>First, I absolutely <i>did not</i> take his reference to “Amalekites” to be “a credible and realistic threat of violence” against anyone, least of all my readers.  I understood it to be simple rhetorical exaggeration, which Chelm himself subsequently admitted, as he was using the term to refer to what he described as an “irrational Jew hater” in the modern sense.  In fact, my very first response to him was “I think you exaggerate quite a bit. How do you define “Amalekite”?  Most people here neither curse nor care about Jews.”  I subsequently added: “Given the historical metaphor, calling someone an Amalekite strikes me as giving the less metaphorically astute a perfectly understandable justification to not only hate Jews, but commit violence against them. So, you may wish to rethink the use of the slur.”  At no point did I ever take it as any sort of threat, much less a credible and realistic one, nor would any reader of this blog ever believe that I am so intellectually humble as to number myself among “the less metaphorically astute”.  I not only understand, but have frequently pointed out on this very blog, that metaphors are not reality.</p><p>Because Chelm is incorrect about how I interpreted his rhetoric, he is necessarily incorrect about what that interpretation reveals about my thinking as well.  It should be readily apparent that if there is any projection taking place here, it is Chelm projecting his own fearful tendencies upon me, since I don’t believe there is any threat posed by him whereas he has already openly referred to me as “dangerous”.</p><p>Now to the question whether my blog “seeks to create an intellectual basis for a more socially acceptable anti-semitism”.  There are 10,667 posts on this blog, dating back to 2003, precisely 118 of which have any reference to Jews.  And many of those 118 posts aren’t concerned with the Jews as such, but rather, are related to Biblical references as part of discussions of atheism or Christian theology.  So, given that less than one percent of the posts are even <i>potentially</i> related to what Chelm describes as an objective of this blog is an exaggeration so vast that it borders on outright falsehood.  I assert, to the contrary, that it is the actions of Jews such as Alan Greenspan, Ben Bernanke, Chuck Schumer, and Eric Cantor that are actively providing the basis for that socially acceptable anti-semitism in America that he fears.  Perhaps Chelm has forgotten that I live in Europe, where there is simply no need to create a more socially acceptable anti-semitism because far more virulent forms of anti-semitism are already quite socially acceptable here.  For example, I find it hard to imagine that Americans would refer to any political leader as a “sale juif”, as Sarkozy was often called.</p><p>Moreover, being a libertarian, even a nationalist libertarian, (which I would argue is logically one and the same), I simply do not adhere to the concept of collective identity that genuine Judenhassen requires.  I have previously blogged on <a href=\"http://www.milobookclub.com/2009/06/08/mailvox-anti-semitis/\">the topic of anti-semitism</a> here.</p><p>Concerning the seven charges listed, I shall wait for his promised refutations before adding anything further.  I will, however, note that his characterization of numbers 2, 4, 5, and 6 are inaccurate and he should probably look at them more closely or they will be as easily and conclusively dismissed as his “threat of violence” claim was.   And as for 7, he can rest assured there are plenty of non-Jews for whom a mere 60,000 African criminals would also be a bargain.</p><p>And finally, I suspect Chelm will want to comment upon some recent and related events in Israel, in which Sudanese migrant workers were attacked by a large and angry mob which also broke store windows and searched passing vehicles for suspected migrant workers to beat up.  One wonders whether he will be able to draw any obvious historical parallels between <a href=\"http://www.haaretz.com/news/national/demonstrators-attack-african-migrants-in-south-tel-aviv-1.432262\">yesterday’s events</a> and European history.</p><div class=\"separator\" style=\"clear: both; text-align: center;\"> <a href=\"http://www.haaretz.com/polopoly_fs/1.432327.1337839076!/image/1751678174.jpg_gen/derivatives/landscape_474/1751678174.jpg\" imageanchor=\"1\" style=\"margin-left:1em; margin-right:1em\"><img border=\"0\" decoding=\"async\" fetchpriority=\"high\" height=\"274\" src=\"http://www.haaretz.com/polopoly_fs/1.432327.1337839076!/image/1751678174.jpg_gen/derivatives/landscape_474/1751678174.jpg\" width=\"474\"/></a></div></div>",
  "content_text": "I have the feeling that even if Chelm hadn’t already accused me of anti-semitism, someone else is bound to by virtue of the extreme ease with which I will show the erroneous aspects of his arguments.  After I disputed what he described as “the danger of the alternative right”, Chelm doubled-down and\nattempted to bolster his position\nas follows:\nThe other day I wrote a post about an exchange I had with Vox Day on his website Vox Popoli.  I made a rhetorical mistake by referring to some of his more hotheaded anti-semitic commenters as “Amalekites.”  Vox took this to be a credible and realistic threat of violence against his readers… which I believe reveals more about Vox’s thinking than mine.  You can read his post here and my response here.  If you didn’t read the post, additionally, I had the nerve to described him as dangerous, because his blog is a great example (in terms of quality) of a group of web sites of the “alternative right” (or alt-right) which, among other things, seeks to create an intellectual basis for a more socially acceptable anti-semitism….\nSo, this is what Vox did in today’s post.  There are so many errors and accusations in it that to try to refute them all in one shot would require a long rambling… boring… post.   In advance, he is slamming me for doing exactly what he is inviting me to do.  So here is how I will approach this… I will list the accusations below (paraphrased) and over the course of the next few days, I will refute them one by one.\nSo many errors that he can’t possibly respond to them all right now… that sure sounds familiar, doesn’t it?  But it’s not actually a Fighting Withdrawal, as Chelm proves himself to be more than the usual handwaver in actually troubling to list seven of my purported charges and declaring that he will respond substantively to them.  Unfortunately, he’s already provided some indication that he’s not going to be able to respond\neffectively\nto them, given the prelude provided above.\nFirst, I absolutely\ndid not\ntake his reference to “Amalekites” to be “a credible and realistic threat of violence” against anyone, least of all my readers.  I understood it to be simple rhetorical exaggeration, which Chelm himself subsequently admitted, as he was using the term to refer to what he described as an “irrational Jew hater” in the modern sense.  In fact, my very first response to him was “I think you exaggerate quite a bit. How do you define “Amalekite”?  Most people here neither curse nor care about Jews.”  I subsequently added: “Given the historical metaphor, calling someone an Amalekite strikes me as giving the less metaphorically astute a perfectly understandable justification to not only hate Jews, but commit violence against them. So, you may wish to rethink the use of the slur.”  At no point did I ever take it as any sort of threat, much less a credible and realistic one, nor would any reader of this blog ever believe that I am so intellectually humble as to number myself among “the less metaphorically astute”.  I not only understand, but have frequently pointed out on this very blog, that metaphors are not reality.\nBecause Chelm is incorrect about how I interpreted his rhetoric, he is necessarily incorrect about what that interpretation reveals about my thinking as well.  It should be readily apparent that if there is any projection taking place here, it is Chelm projecting his own fearful tendencies upon me, since I don’t believe there is any threat posed by him whereas he has already openly referred to me as “dangerous”.\nNow to the question whether my blog “seeks to create an intellectual basis for a more socially acceptable anti-semitism”.  There are 10,667 posts on this blog, dating back to 2003, precisely 118 of which have any reference to Jews.  And many of those 118 posts aren’t concerned with the Jews as such, but rather, are related to Biblical references as part of discussions of atheism or Christian theology.  So, given that less than one percent of the posts are even\npotentially\nrelated to what Chelm describes as an objective of this blog is an exaggeration so vast that it borders on outright falsehood.  I assert, to the contrary, that it is the actions of Jews such as Alan Greenspan, Ben Bernanke, Chuck Schumer, and Eric Cantor that are actively providing the basis for that socially acceptable anti-semitism in America that he fears.  Perhaps Chelm has forgotten that I live in Europe, where there is simply no need to create a more socially acceptable anti-semitism because far more virulent forms of anti-semitism are already quite socially acceptable here.  For example, I find it hard to imagine that Americans would refer to any political leader as a “sale juif”, as Sarkozy was often called.\nMoreover, being a libertarian, even a nationalist libertarian, (which I would argue is logically one and the same), I simply do not adhere to the concept of collective identity that genuine Judenhassen requires.  I have previously blogged on\nthe topic of anti-semitism\nhere.\nConcerning the seven charges listed, I shall wait for his promised refutations before adding anything further.  I will, however, note that his characterization of numbers 2, 4, 5, and 6 are inaccurate and he should probably look at them more closely or they will be as easily and conclusively dismissed as his “threat of violence” claim was.   And as for 7, he can rest assured there are plenty of non-Jews for whom a mere 60,000 African criminals would also be a bargain.\nAnd finally, I suspect Chelm will want to comment upon some recent and related events in Israel, in which Sudanese migrant workers were attacked by a large and angry mob which also broke store windows and searched passing vehicles for suspected migrant workers to beat up.  One wonders whether he will be able to draw any obvious historical parallels between\nyesterday’s events\nand European history.",
  "tags": [
    "mailvox"
  ],
  "categories": [],
  "sitemap_lastmod": "2012-05-24T11:30:00+00:00"
}