{
  "url": "https://voxday.net/2012/05/20/israeli-occupied-territory/",
  "scraped_at": "2025-12-14T04:54:58.830760",
  "title": "Israeli-occupied territory",
  "date_display": "May 20, 2012",
  "date_iso": "2012-05-20T11:35:00+00:00",
  "date_from_url": "2012-05-20",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>I refer, of course, to the U.S. Congress.  It’s fascinating to see that while ethnic discrimination is banned in the USA, even to the point of openly violating the Constitutional right of free association, and Congress shall make no law respecting an establishment of religion, it apparently passes Constitutional muster <a href=\"http://www.jewishvirtuallibrary.org/jsource/US-Israel/HR4133.html\">to pass a law which enshrines ethnic and religious discrimination</a> in foreign states:</p><blockquote><p> On May 9, 2012, the U.S. House of Representatives overwhelmingly passed House Resolution (H.R.) 4133 reaffirming United States policy commitments to Israel and calling for enhanced security cooperation between the two allies.  Sponsored by House Majority Leader Rep. Eric Cantor (R-VA) and House Minority Whip Rep. Steny Hoyer (D-MD), the “US-Israel Enhanced Security Cooperation Act of 2012” was cosponsored by a bipartisan group of 294 representatives and passed by a vote of 411 to 2.  The only dissenting votes were cast by Rep. Ron Paul (R-TX) and Rep. John Dingell (D-MI) while another nine House members voted “present.”</p></blockquote><p>The law certainly sounds reasonable enough.  Who wants to see Israel conquered by the Arabs and the resultant bloodbath that would likely follow?  I certainly don’t.  Except there is one strange thing about this description… Israel is not actually an ally of the United States.  I am not aware of any treaty between the two countries establishing a military alliance,and in fact, Turkey’s membership in NATO means that any large-scale Jewish-Muslim war would actually require the USA to go to war against Israel.  One can observe, for example, that Israel is not, unlike the USA’s genuine military allies, participating in any of its current military activities.  So, just to be sure I’m reading this correctly, let’s take a look at <a href=\"http://www.gop.gov/bill/112/2/hr4133\">the executive summary</a> of the recenty passed House Resolution 4133, as summarized at GOP.gov.</p><p><i>H.R. 4133 would state that it is U.S. policy to: reaffirm the commitment to Israel’s security as a Jewish state; provide Israel with the military capabilities to defend itself by itself against any threats; veto any one-sided anti-Israel resolutions at the United Nations Security Council; support Israel’s inherent right to self-defense; expand military and civilian cooperation; assist in a negotiated settlement of the Israeli-Palestinian conflict that results in two states living side by side in peace and security and to encourage Israel’s neighbors to recognize Israel’s right to exist as a Jewish state.</i></p><p>Hold on a moment now.  This means that thanks to the passage of HR 4133, the same government that is barred from defending America’s right to exist as a white Christian state is nevertheless committing itself to defending Israel’s right to exist <a href=\"http://hawaiianlibertarian.blogspot.com/2012/05/we-are-all-zionists-now.html\">as a Jewish state</a>?  It’s an interesting juxtaposition, n’est-ce pas?  I shall certainly be fascinated to learn if there are any philo-semites who can manage to articulate a defense of this recent Congressional action beyond the conventional and ever-so-convincing appeals to “anti-semitism”.</p><p>One wonders if the U.S. Congress would be similarly willing to pass a law defending England’s right to exist as an Anglo-Saxon Anglican state or Italy’s right to exist as an Italian Catholic state.</p></div>",
  "content_text": "I refer, of course, to the U.S. Congress.  It’s fascinating to see that while ethnic discrimination is banned in the USA, even to the point of openly violating the Constitutional right of free association, and Congress shall make no law respecting an establishment of religion, it apparently passes Constitutional muster\nto pass a law which enshrines ethnic and religious discrimination\nin foreign states:\nOn May 9, 2012, the U.S. House of Representatives overwhelmingly passed House Resolution (H.R.) 4133 reaffirming United States policy commitments to Israel and calling for enhanced security cooperation between the two allies.  Sponsored by House Majority Leader Rep. Eric Cantor (R-VA) and House Minority Whip Rep. Steny Hoyer (D-MD), the “US-Israel Enhanced Security Cooperation Act of 2012” was cosponsored by a bipartisan group of 294 representatives and passed by a vote of 411 to 2.  The only dissenting votes were cast by Rep. Ron Paul (R-TX) and Rep. John Dingell (D-MI) while another nine House members voted “present.”\nThe law certainly sounds reasonable enough.  Who wants to see Israel conquered by the Arabs and the resultant bloodbath that would likely follow?  I certainly don’t.  Except there is one strange thing about this description… Israel is not actually an ally of the United States.  I am not aware of any treaty between the two countries establishing a military alliance,and in fact, Turkey’s membership in NATO means that any large-scale Jewish-Muslim war would actually require the USA to go to war against Israel.  One can observe, for example, that Israel is not, unlike the USA’s genuine military allies, participating in any of its current military activities.  So, just to be sure I’m reading this correctly, let’s take a look at\nthe executive summary\nof the recenty passed House Resolution 4133, as summarized at GOP.gov.\nH.R. 4133 would state that it is U.S. policy to: reaffirm the commitment to Israel’s security as a Jewish state; provide Israel with the military capabilities to defend itself by itself against any threats; veto any one-sided anti-Israel resolutions at the United Nations Security Council; support Israel’s inherent right to self-defense; expand military and civilian cooperation; assist in a negotiated settlement of the Israeli-Palestinian conflict that results in two states living side by side in peace and security and to encourage Israel’s neighbors to recognize Israel’s right to exist as a Jewish state.\nHold on a moment now.  This means that thanks to the passage of HR 4133, the same government that is barred from defending America’s right to exist as a white Christian state is nevertheless committing itself to defending Israel’s right to exist\nas a Jewish state\n?  It’s an interesting juxtaposition, n’est-ce pas?  I shall certainly be fascinated to learn if there are any philo-semites who can manage to articulate a defense of this recent Congressional action beyond the conventional and ever-so-convincing appeals to “anti-semitism”.\nOne wonders if the U.S. Congress would be similarly willing to pass a law defending England’s right to exist as an Anglo-Saxon Anglican state or Italy’s right to exist as an Italian Catholic state.",
  "tags": [],
  "categories": [],
  "sitemap_lastmod": "2012-05-20T10:35:00+00:00"
}