{
  "url": "https://voxday.net/2012/05/19/mailvox-why-flaunt-iq/",
  "scraped_at": "2025-12-14T04:54:57.016206",
  "title": "Mailvox: why flaunt IQ?",
  "date_display": "May 19, 2012",
  "date_iso": "2012-05-19T15:30:00+00:00",
  "date_from_url": "2012-05-19",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>NorthernHamlet doesn’t understand why I flaunt – not flout – my intelligence:</p><blockquote><p> How would one describe that you trot out “superior IQ” during conversations, even while you acknowledge that neither you nor many of your readers think the criteria for it is legitimate?</p></blockquote><p>First, I wouldn’t say that IQ is totally meaningless or even illegitimate.  It clearly measures something real and objective; you will try in vain to discuss anything even remotely intellectual with an individual possessed of a 50 IQ, and I have yet to see someone with an IQ of 100 that I consider, upon the basis of non-IQ related factors, to be more intelligent than someone with an IQ of 150.  That being said, it is clearly an imperfect measurement, and it can even be misleading as two people with the same IQ, one stronger on the verbal side and one stronger on the mathematical side, can look either much smarter or much more stupid than the other depending upon the subject.</p><p>Ironically enough, I’m a very good example of someone whose measured IQ score tends to significantly <i>underestimate</i> my relevant intelligence in my primary areas of interest because I am so handicapable when it comes to spatial relations.  Anyone who has seen me packing a car or even a suitcase would be justified in thinking that I should qualify for special parking privileges, and probably three spaces at that.  On the other hand, my ability to recognize patterns and generate useful predictive models from them has been considered to be rather remarkable by many.  Am I a retard or a genius?  The IQ score is an ineffective metric because it alternatively answers both and neither, depending upon the perspective.</p><p>(My answer, of course, is neither.  I don’t believe genius is denoted by IQ or any other quantitative measure, but rather unique and significant intellectual accomplishments.)</p><p>Long before I wrote my first WND column 11 years ago, I recognized that the arguments presented by the Left, especially those that were blithely accepted by the Right, seldom amounted to more than crude appeals to intelligence.  We’ve seen it on this blog time and time again, most recently in the recent series that focused on the dissection of the skeptics.  Their main argument, indeed, their only real argument, is “don’t argue with me because I’m smarter than you.”  It’s often couched in terms of academic credentials, but since universities no longer provide educations, but primarily serve as intellectual brand markers, credentialist-based arguments are simply slightly modified version of the same position.  The reason a Harvard PhD trumps one from Auburn University isn’t because there is any legitimate reason to believe the Harvard PhD has received a better education, indeed, in at least some fields it can be easily demonstrated that the reverse is the case, but because Harvard places more stringent IQ requirements on its applicants.  An appeal to academic status is mostly an appeal to intelligence, once-removed.</p><p>This is, of course, why the Left repeatedly cites study after study, many of them fake, showing that Blue state residents possess higher average IQs, why Democratic presidents are smarter than Republican presidents, and so forth.  It’s all they’ve got.  And so, when I flaunt my official, Mensa-approved, readily observable high intelligence in their faces, it removes from them their only rhetorically effective argument by virtue of their own metric.  In other words, I’m simply playing by the rules of their game that they have established.  Notice how few on the Right, even if they are highly intelligent academics with hard science PhDs, take any exception to my assertions of superintelligence, especially compared with the way the Left instinctively reacts to it rather like vampires to holy water.  Of course, since they can’t convincingly claim that I am not every bit as intelligent as they are, they have no choice but to resort to the customary claim of craziness.  The path that Delavagus recently trod was not only predictable, it was inevitable, as we’ve been witnessing exactly the same responses to exactly the same stimuli for more than a decade now.  One could quite credibly write a paper on it with a larger sample set than one often sees in the social sciences.</p><p>Is the appeal to intelligence game nonsense?  Of course it is!  This is where and why I part company with the modern philosophers.  Since true belief is true regardless of whether it is justified or not, whether it is known to be true or not, whether it is even <i>believed</i> or not, it is entirely possible for the 50-IQ retard to be correct and the 175-IQ statistical genius to be completely wrong, regardless of whether the former can even begin to reasonably articulate his beliefs or not, let alone justify them.  Indeed, the history of the 20th century is riddled with example after example of the false beliefs to which the intelligentsia subscribed that were rightly rejected by hoi polloi.  The reason is that tradition is more than the democracy of the dead, it is also the cumulative intelligence of the centuries.  It takes considerable intelligence, intellectual humility, and usually, significant temporal and technological advantages to correctly supersede that cumulative intelligence.  No doubt that is why even the most brilliant of the ancient skeptics demanded that custom and traditions be given their due.</p></div>",
  "content_text": "NorthernHamlet doesn’t understand why I flaunt – not flout – my intelligence:\nHow would one describe that you trot out “superior IQ” during conversations, even while you acknowledge that neither you nor many of your readers think the criteria for it is legitimate?\nFirst, I wouldn’t say that IQ is totally meaningless or even illegitimate.  It clearly measures something real and objective; you will try in vain to discuss anything even remotely intellectual with an individual possessed of a 50 IQ, and I have yet to see someone with an IQ of 100 that I consider, upon the basis of non-IQ related factors, to be more intelligent than someone with an IQ of 150.  That being said, it is clearly an imperfect measurement, and it can even be misleading as two people with the same IQ, one stronger on the verbal side and one stronger on the mathematical side, can look either much smarter or much more stupid than the other depending upon the subject.\nIronically enough, I’m a very good example of someone whose measured IQ score tends to significantly\nunderestimate\nmy relevant intelligence in my primary areas of interest because I am so handicapable when it comes to spatial relations.  Anyone who has seen me packing a car or even a suitcase would be justified in thinking that I should qualify for special parking privileges, and probably three spaces at that.  On the other hand, my ability to recognize patterns and generate useful predictive models from them has been considered to be rather remarkable by many.  Am I a retard or a genius?  The IQ score is an ineffective metric because it alternatively answers both and neither, depending upon the perspective.\n(My answer, of course, is neither.  I don’t believe genius is denoted by IQ or any other quantitative measure, but rather unique and significant intellectual accomplishments.)\nLong before I wrote my first WND column 11 years ago, I recognized that the arguments presented by the Left, especially those that were blithely accepted by the Right, seldom amounted to more than crude appeals to intelligence.  We’ve seen it on this blog time and time again, most recently in the recent series that focused on the dissection of the skeptics.  Their main argument, indeed, their only real argument, is “don’t argue with me because I’m smarter than you.”  It’s often couched in terms of academic credentials, but since universities no longer provide educations, but primarily serve as intellectual brand markers, credentialist-based arguments are simply slightly modified version of the same position.  The reason a Harvard PhD trumps one from Auburn University isn’t because there is any legitimate reason to believe the Harvard PhD has received a better education, indeed, in at least some fields it can be easily demonstrated that the reverse is the case, but because Harvard places more stringent IQ requirements on its applicants.  An appeal to academic status is mostly an appeal to intelligence, once-removed.\nThis is, of course, why the Left repeatedly cites study after study, many of them fake, showing that Blue state residents possess higher average IQs, why Democratic presidents are smarter than Republican presidents, and so forth.  It’s all they’ve got.  And so, when I flaunt my official, Mensa-approved, readily observable high intelligence in their faces, it removes from them their only rhetorically effective argument by virtue of their own metric.  In other words, I’m simply playing by the rules of their game that they have established.  Notice how few on the Right, even if they are highly intelligent academics with hard science PhDs, take any exception to my assertions of superintelligence, especially compared with the way the Left instinctively reacts to it rather like vampires to holy water.  Of course, since they can’t convincingly claim that I am not every bit as intelligent as they are, they have no choice but to resort to the customary claim of craziness.  The path that Delavagus recently trod was not only predictable, it was inevitable, as we’ve been witnessing exactly the same responses to exactly the same stimuli for more than a decade now.  One could quite credibly write a paper on it with a larger sample set than one often sees in the social sciences.\nIs the appeal to intelligence game nonsense?  Of course it is!  This is where and why I part company with the modern philosophers.  Since true belief is true regardless of whether it is justified or not, whether it is known to be true or not, whether it is even\nbelieved\nor not, it is entirely possible for the 50-IQ retard to be correct and the 175-IQ statistical genius to be completely wrong, regardless of whether the former can even begin to reasonably articulate his beliefs or not, let alone justify them.  Indeed, the history of the 20th century is riddled with example after example of the false beliefs to which the intelligentsia subscribed that were rightly rejected by hoi polloi.  The reason is that tradition is more than the democracy of the dead, it is also the cumulative intelligence of the centuries.  It takes considerable intelligence, intellectual humility, and usually, significant temporal and technological advantages to correctly supersede that cumulative intelligence.  No doubt that is why even the most brilliant of the ancient skeptics demanded that custom and traditions be given their due.",
  "tags": [
    "mailvox",
    "philosophy"
  ],
  "categories": [],
  "sitemap_lastmod": "2012-05-19T14:30:00+00:00"
}