{
  "url": "https://voxday.net/2012/05/05/mailvox-evolutionary-ideology/",
  "scraped_at": "2025-12-14T04:53:50.629178",
  "title": "Mailvox: evolutionary ideology",
  "date_display": "May 5, 2012",
  "date_iso": "2012-05-05T13:47:00+00:00",
  "date_from_url": "2012-05-05",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>Anonymous Conservative writes of an amusing spin on the “science says conservatives are crazy” theme:</p><blockquote><p> I’ve done a ton of research into the linkage between r/K Selection Theory in Evolutionary Ecology and political ideology. The short of it is<br> ideology looks like it’s just an intellectual expression of the underlying psychologies motivating r/K behaviors. Obviously, this likely speaks to the mechanism by which our ideologies evolved. That ideology and r/K behaviors are both related to the same DRD4 gene, and that the brain<br> structures which govern these behaviors is also the same also raises interesting questions about their evolutionary linkage.</br></br></p><p>This material is pure gold, if you’ve ever wondered why our species has this psychological divide within it. It even answers where exactly<br> Liberals came from, given their obvious reduced ability to function in what we often call “the state of nature” (ie a K-selected, competitive<br> state of nature – they would thrive in an r-selected stated of nature, where competitiveness is disfavored).</br></br></p><p>I’ve run this work by liberals, and it devastating to them, on a visceral level. They do not want to be the bunny-rabbit people, embodying a prey<br> species psychology within a highly K-selected, competitive  species. I posted for a bit at TED, very benignly on this, just to test my<br> presentation in a hostile, more Liberal environment. I got the feedback and insight I needed (every liberal abandoned any thread this was posted<br> to), and then I left for six months. When I went back every one of my postings referencing this had been quietly deleted, despite the fact I<br> purposely was hyper-civil and cited everything I asserted. I don’t think they’ve ever done that to anyone else. Liberals are horrified by this<br> work, and the implications which naturally arise from it.</br></br></br></br></br></p></blockquote><p>Now, I tend to regard all of this evo-psych as a ludicrous joke, especially since I am a confirmed evolutionary skeptic.  Because there is so little scientific evidence in support of evolution by natural selection, I conclude it is unlikely to be the mechanism distinguishing the liberal Bunny People from the conservative Wolf People.  And, of course, being a libertarian and rejecting both big government ideologies, I have neither a wolf nor a rabbit in that hunt.  That being said, this is certainly a potentially useful rhetorical response to the faux-scientific rhetoric so often presented by liberals in a misguided attempt to somehow shame conservatives out of their psychologically inferior ideological perspective.  (The very attempt betrays both the intrinsic intellectual flexibility of liberals as well as their inability to understand the other side.)  And it certainly explains the way in which liberals are constantly looking to the government as a way to rein in their more successful competitors; because the Bunny People can’t do anything to control the Wolf People themselves, they need to appeal to the Hunter… never stopping to think that the Hunter is just as pleased to shoot bunnies as wolves… and may in fact prefer eating rabbit meat.</p><p>Anyhow, if you happen to find this sort of thing interesting, you can <a href=\"http://www.anonymousconservative.com/modern.pdf\">read a related paper</a> on it.</p></div>",
  "content_text": "Anonymous Conservative writes of an amusing spin on the “science says conservatives are crazy” theme:\nI’ve done a ton of research into the linkage between r/K Selection Theory in Evolutionary Ecology and political ideology. The short of it is\nideology looks like it’s just an intellectual expression of the underlying psychologies motivating r/K behaviors. Obviously, this likely speaks to the mechanism by which our ideologies evolved. That ideology and r/K behaviors are both related to the same DRD4 gene, and that the brain\nstructures which govern these behaviors is also the same also raises interesting questions about their evolutionary linkage.\nThis material is pure gold, if you’ve ever wondered why our species has this psychological divide within it. It even answers where exactly\nLiberals came from, given their obvious reduced ability to function in what we often call “the state of nature” (ie a K-selected, competitive\nstate of nature – they would thrive in an r-selected stated of nature, where competitiveness is disfavored).\nI’ve run this work by liberals, and it devastating to them, on a visceral level. They do not want to be the bunny-rabbit people, embodying a prey\nspecies psychology within a highly K-selected, competitive  species. I posted for a bit at TED, very benignly on this, just to test my\npresentation in a hostile, more Liberal environment. I got the feedback and insight I needed (every liberal abandoned any thread this was posted\nto), and then I left for six months. When I went back every one of my postings referencing this had been quietly deleted, despite the fact I\npurposely was hyper-civil and cited everything I asserted. I don’t think they’ve ever done that to anyone else. Liberals are horrified by this\nwork, and the implications which naturally arise from it.\nNow, I tend to regard all of this evo-psych as a ludicrous joke, especially since I am a confirmed evolutionary skeptic.  Because there is so little scientific evidence in support of evolution by natural selection, I conclude it is unlikely to be the mechanism distinguishing the liberal Bunny People from the conservative Wolf People.  And, of course, being a libertarian and rejecting both big government ideologies, I have neither a wolf nor a rabbit in that hunt.  That being said, this is certainly a potentially useful rhetorical response to the faux-scientific rhetoric so often presented by liberals in a misguided attempt to somehow shame conservatives out of their psychologically inferior ideological perspective.  (The very attempt betrays both the intrinsic intellectual flexibility of liberals as well as their inability to understand the other side.)  And it certainly explains the way in which liberals are constantly looking to the government as a way to rein in their more successful competitors; because the Bunny People can’t do anything to control the Wolf People themselves, they need to appeal to the Hunter… never stopping to think that the Hunter is just as pleased to shoot bunnies as wolves… and may in fact prefer eating rabbit meat.\nAnyhow, if you happen to find this sort of thing interesting, you can\nread a related paper\non it.",
  "tags": [
    "mailvox",
    "politics",
    "science"
  ],
  "categories": [],
  "sitemap_lastmod": "2012-05-05T12:47:00+00:00"
}