{
  "url": "https://voxday.net/2012/05/23/obamas-iq-is-still-116/",
  "scraped_at": "2025-12-14T04:55:11.686861",
  "title": "Obama’s IQ is still ~116",
  "date_display": "May 23, 2012",
  "date_iso": "2012-05-23T07:46:00+00:00",
  "date_from_url": "2012-05-23",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>It will be interesting to see the disbelievers in pattern recognition attempt to explain this one away.  You may recall that back in 2008, I noted that Obama’s IQ had an absolute sub-Mensa ceiling of 129 and that there was good reason to believe <a href=\"http://www.milobookclub.com/2008/09/18/barack-obamas-iq-is-116_18/\">it is around 116</a>.  So, it was interesting to read this article discussing <a href=\"http://www.breitbart.com/Big-Government/2012/05/22/Exclusive-The-Vetting-Obama-Wrong-on-Columbia-Admission-Transfer-Class-Had-Low-SAT-Scores-Grades\">the relatively low quality of the 1981 class </a>of students transferring to Columbia, which included one Barack Obama:<br/></p><blockquote><p> Breitbart News has learned that the transfer class that entered Columbia College in the fall of 1981 with Obama was one of the worst in recent memory, according to Columbia officials at the time.  A Nov. 18, 1981 article in the Columbia Spectator, “Tight Housing Discourages Transfer Applications to CC,” written by student Jeremy Feldman and quoting admissions officials, reported: “On paper at least, the quality of the students accepted [as transfers] has declined along with the number of applicants, the officials say.”</p><p><i>Among accepted transfer students, the average combined math and verbal score on the Scholastic Aptitude Test is a 1,100 and their grade-point average at their former schools is about 3.0, Boatti said.</i></p></blockquote><p>There were 67 transfer students with an average SAT score of 1,100.  Guess what that equals on <a href=\"http://www.iqcomparisonsite.com/oldSATIQ.aspx\">the SAT to IQ conversion chart</a>?  It’s between 115.51 and 116.55, depending upon whether one uses an SD of 15 or 16.  Now, this isn’t absolute and conclusive proof that Obama’s IQ is 116, as it could well be a little bit higher or a little bit lower.  But probably not much higher, because if he scored even 100 points more on the SAT, he wouldn’t have had to go to Occidental in the first place.</p><p>This is because the range from which that average SAT score was calculated was the 67 selected from the 450 who applied.  That average was also 100 SAT points lower than the average Columbia freshman score of 1200.  So, I would assume that the absolute low end SAT that Columbia accepted for transfers was probably half that gap, or 1050, which equates to a 111 IQ.  So, we can reasonably conclude that Obama’s IQ is probably somewhere between 111 and 118, which is not very far from my original estimate of 116.</p><p>Nor am I the only one to have concluded that Obama possesses moderate intelligence rather than the exceptional intelligence in which the more credulous still believe despite the accumulating evidence of his presidential term.  At the end of <a href=\"http://ace.mu.nu/archives/315296.php\">his 2011 post on the subject of Obama’s intelligence</a>, which focuses on the Harvard Law Review and Harvard’s graduating honors, Ace of Spades said this:<br/></p><blockquote><p> Hah! This guy guesstimates that based on tangible proxy evidence, which is right in the middle of where I figured it would be.  Now, this guy is not just completely making things up. He knows, because there are records of it, that Obama was not a National Merit Scholar, or National Merit Finalist, or the lowest subcategory, “Outstanding Participant.” (This seems to be an honor conferred by the College Board (the SAT people) primarily if not exclusively based on SAT scores.)</p><p>Since Obama did not make the list for any of those automatically-conferred SAT-based recognitions, we know his SATs must be below those thresholds, setting a hard upper cap on his possible SAT scores.  We can then figure his highest, likeliest IQ score, because the SAT is just a modified version of the old Army IQ test. Current IQ tests and the SATs are both derived straight from the old Army IQ test, testing pretty much the same things and in pretty much the same ways. Different scoring system, but same ultimate term of comparison — how you rank compared to the general population, expressed as percentile.</p><p>Not dumb, but I never thought he was dumb — just not a genius. 116’s a perfectly respectable score, but no one goes bragging on it and claims to be a genius at 116.  No on ever says, “I’m a mere 30 points away from qualifying for Mensa,” for example.</p><p>Good catch on that National Merit thing.</p></blockquote><p>Well, its absence on Obama’s record appears fairly glaring when you’re a National Merit whatever yourself.  Hilary Clinton, for example, was National Merit.  I don’t remember if I was a finalist or a semi-finalist, though.  I know they gave me some sort of certificate at a school assembly, but I can’t recall which one it was.  I would assume semi-finalist, though, since in addition to having the SAT scores confirm the PSAT, being a finalist requires “having an outstanding academic record, and being endorsed and recommended by a high school official”  My academic record would be better described as “unique” than “outstanding”, since I was the first National Merit student to graduate without honors in the school’s history. Intelligence is a poor substitute for hard work.</p><p>Furthermore, it should be noted that a 116 IQ is a full standard deviation above the norm. It’s not calling someone stupid to estimate that they are smarter than the majority of the American people. In fact, based on the 30-point communication gap, there is reason to believe that a 116-IQ president is more likely to be successful than a Mensa-qualified 132-IQ president. There is far more to success than raw intelligence, particularly in a field such as politics that requires lots of people to like you.</p></div>",
  "content_text": "It will be interesting to see the disbelievers in pattern recognition attempt to explain this one away.  You may recall that back in 2008, I noted that Obama’s IQ had an absolute sub-Mensa ceiling of 129 and that there was good reason to believe\nit is around 116\n.  So, it was interesting to read this article discussing\nthe relatively low quality of the 1981 class\nof students transferring to Columbia, which included one Barack Obama:\nBreitbart News has learned that the transfer class that entered Columbia College in the fall of 1981 with Obama was one of the worst in recent memory, according to Columbia officials at the time.  A Nov. 18, 1981 article in the Columbia Spectator, “Tight Housing Discourages Transfer Applications to CC,” written by student Jeremy Feldman and quoting admissions officials, reported: “On paper at least, the quality of the students accepted [as transfers] has declined along with the number of applicants, the officials say.”\nAmong accepted transfer students, the average combined math and verbal score on the Scholastic Aptitude Test is a 1,100 and their grade-point average at their former schools is about 3.0, Boatti said.\nThere were 67 transfer students with an average SAT score of 1,100.  Guess what that equals on\nthe SAT to IQ conversion chart\n?  It’s between 115.51 and 116.55, depending upon whether one uses an SD of 15 or 16.  Now, this isn’t absolute and conclusive proof that Obama’s IQ is 116, as it could well be a little bit higher or a little bit lower.  But probably not much higher, because if he scored even 100 points more on the SAT, he wouldn’t have had to go to Occidental in the first place.\nThis is because the range from which that average SAT score was calculated was the 67 selected from the 450 who applied.  That average was also 100 SAT points lower than the average Columbia freshman score of 1200.  So, I would assume that the absolute low end SAT that Columbia accepted for transfers was probably half that gap, or 1050, which equates to a 111 IQ.  So, we can reasonably conclude that Obama’s IQ is probably somewhere between 111 and 118, which is not very far from my original estimate of 116.\nNor am I the only one to have concluded that Obama possesses moderate intelligence rather than the exceptional intelligence in which the more credulous still believe despite the accumulating evidence of his presidential term.  At the end of\nhis 2011 post on the subject of Obama’s intelligence\n, which focuses on the Harvard Law Review and Harvard’s graduating honors, Ace of Spades said this:\nHah! This guy guesstimates that based on tangible proxy evidence, which is right in the middle of where I figured it would be.  Now, this guy is not just completely making things up. He knows, because there are records of it, that Obama was not a National Merit Scholar, or National Merit Finalist, or the lowest subcategory, “Outstanding Participant.” (This seems to be an honor conferred by the College Board (the SAT people) primarily if not exclusively based on SAT scores.)\nSince Obama did not make the list for any of those automatically-conferred SAT-based recognitions, we know his SATs must be below those thresholds, setting a hard upper cap on his possible SAT scores.  We can then figure his highest, likeliest IQ score, because the SAT is just a modified version of the old Army IQ test. Current IQ tests and the SATs are both derived straight from the old Army IQ test, testing pretty much the same things and in pretty much the same ways. Different scoring system, but same ultimate term of comparison — how you rank compared to the general population, expressed as percentile.\nNot dumb, but I never thought he was dumb — just not a genius. 116’s a perfectly respectable score, but no one goes bragging on it and claims to be a genius at 116.  No on ever says, “I’m a mere 30 points away from qualifying for Mensa,” for example.\nGood catch on that National Merit thing.\nWell, its absence on Obama’s record appears fairly glaring when you’re a National Merit whatever yourself.  Hilary Clinton, for example, was National Merit.  I don’t remember if I was a finalist or a semi-finalist, though.  I know they gave me some sort of certificate at a school assembly, but I can’t recall which one it was.  I would assume semi-finalist, though, since in addition to having the SAT scores confirm the PSAT, being a finalist requires “having an outstanding academic record, and being endorsed and recommended by a high school official”  My academic record would be better described as “unique” than “outstanding”, since I was the first National Merit student to graduate without honors in the school’s history. Intelligence is a poor substitute for hard work.\nFurthermore, it should be noted that a 116 IQ is a full standard deviation above the norm. It’s not calling someone stupid to estimate that they are smarter than the majority of the American people. In fact, based on the 30-point communication gap, there is reason to believe that a 116-IQ president is more likely to be successful than a Mensa-qualified 132-IQ president. There is far more to success than raw intelligence, particularly in a field such as politics that requires lots of people to like you.",
  "tags": [
    "freakshow",
    "politics"
  ],
  "categories": [],
  "sitemap_lastmod": "2012-05-23T06:46:00+00:00"
}