{
  "url": "https://voxday.net/2012/05/11/outdoor-nfl-in-minnesota/",
  "scraped_at": "2025-12-14T04:54:20.953497",
  "title": "Outdoor NFL in Minnesota",
  "date_display": "May 11, 2012",
  "date_iso": "2012-05-11T13:14:00+00:00",
  "date_from_url": "2012-05-11",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>As far as I’m concerned, this is one of the best aspects of <a href=\"http://profootballtalk.nbcsports.com/2012/05/11/vikings-university-of-minnesota-deal-says-tcf-bank-stadium-could-be-used-for-up-to-four-years/\">the Minnesota – Vikings stadium deal</a>:</p><blockquote><p> On Thursday, the legislative and executive branches of the Minnesota government finalized a deal to build a new stadium for the Vikings.  Also on Thursday, the Vikings and the University of Minnesota finalized a deal to play games at TCF Bank Stadium during a portion of the time that the new venue is being built.</p></blockquote><p>After up to four years of a return to outside football, it’s going to be hard to go back to seeing them play inside another dome.  Hopefully whoever is actually building the stadium will rethink the need to put a roof on it.  And although it is absolutely absurd for the state and city tax dollars to go towards building the stadium, at least they’re only paying half the cost this way.  As I mentioned before, the alternative would have been for them to pay the whole thing and without any guarantee that it would suffice to lure a team to Minnesota.  The fact that it is the city and the state, and not the team, <a href=\"http://www.dailynorseman.com/2012/5/1/2992131/minnesota-vikings-stadium-outdoor-stadium-idea-being-floated\">that wanted the stadium roof</a> tends to indicate that there is value to the stadium beyond its use as an NFL field.  That value may not be equivalent to the $475 million that is their share of the expense, but it clearly isn’t nothing either.</p><p>For the benefit of those of you who still erroneously think I’m being hypocritical on this issue, perhaps I should point out that one of the reasons the St. Paul Pioneer Press rejected me as a replacement for their conservative columnist when he left the op/ed page was that one of my three sample columns I provided them was one demonstrating that there are no significant economic benefits to communities paying for sports stadiums.  It’s important to distinguish between principles and tactics.  For example, I don’t advocate career in prostitution, but if a woman chooses such a career, it’s certainly possible to discuss how she can best maximize her income without maintaining one’s original opinion concerning her job choice.</p></div>",
  "content_text": "As far as I’m concerned, this is one of the best aspects of\nthe Minnesota – Vikings stadium deal\n:\nOn Thursday, the legislative and executive branches of the Minnesota government finalized a deal to build a new stadium for the Vikings.  Also on Thursday, the Vikings and the University of Minnesota finalized a deal to play games at TCF Bank Stadium during a portion of the time that the new venue is being built.\nAfter up to four years of a return to outside football, it’s going to be hard to go back to seeing them play inside another dome.  Hopefully whoever is actually building the stadium will rethink the need to put a roof on it.  And although it is absolutely absurd for the state and city tax dollars to go towards building the stadium, at least they’re only paying half the cost this way.  As I mentioned before, the alternative would have been for them to pay the whole thing and without any guarantee that it would suffice to lure a team to Minnesota.  The fact that it is the city and the state, and not the team,\nthat wanted the stadium roof\ntends to indicate that there is value to the stadium beyond its use as an NFL field.  That value may not be equivalent to the $475 million that is their share of the expense, but it clearly isn’t nothing either.\nFor the benefit of those of you who still erroneously think I’m being hypocritical on this issue, perhaps I should point out that one of the reasons the St. Paul Pioneer Press rejected me as a replacement for their conservative columnist when he left the op/ed page was that one of my three sample columns I provided them was one demonstrating that there are no significant economic benefits to communities paying for sports stadiums.  It’s important to distinguish between principles and tactics.  For example, I don’t advocate career in prostitution, but if a woman chooses such a career, it’s certainly possible to discuss how she can best maximize her income without maintaining one’s original opinion concerning her job choice.",
  "tags": [
    "sports"
  ],
  "categories": [],
  "sitemap_lastmod": "2012-05-11T12:14:00+00:00"
}