{
  "url": "https://voxday.net/2012/05/22/plato-and-fear-of-raciss/",
  "scraped_at": "2025-12-14T04:55:08.055565",
  "title": "Plato and the fear of raciss",
  "date_display": "May 22, 2012",
  "date_iso": "2012-05-22T09:51:00+00:00",
  "date_from_url": "2012-05-22",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>I find the behavior of some white readers here to be tremendously informative with regards to the way in which they react to the occasional “Vibrancy is our strength” posts.  What is quite clear to me is that despite the evidence of some 40+ years of affirmative action and forced integration achieving little more than exchanging segregated neighborhoods for segregated schools and the highest incarceration rate on the planet, many white Americans, even <i>conservative</i> white Americans, are so afraid of being called raciss that they will bury their heads in the sand rather than recognize the readily observable realities of their multi-ethnic society.</p><p>Now, it’s important to first understand that social homogeneity has been considered to be a vital aspect of civilization for more than a thousand years before the Northern Europeans were civilized.  Consider Karl Popper’s summary of Plato:</p><p><i>“Plato’s theory was a form of the organic theory of the state, even if he had not sometimes spoken of the state as an organism. But since he did this, there can be no doubt left that he must be described as an exponent, or rather, as one of the originators, of this theory. His version of this theory may be characterized as a personalist or psychological one, since he describes the state not in a general way as similar to some organism or other, but as analogous to the human individual, and more specifically to the human soul. Especially the disease of the state, the dissolution of its unity, corresponds to the disease of the human soul, of human nature. In fact, the disease of the state is not only correlated with, but is directly produced by, the corruption of human nature, more especially of the members of the ruling class. Every single one of the typical stages in the degeneration of the state is brought about by a corresponding stage in the degeneration of the human soul, of human nature, of the human race. And since this moral degeneration is interpreted as based upon racial degeneration, we might say that the biological element in Plato’s naturalism turns out, in the end, to have the most important part in the foundation of his historicism. For the history of the downfall of the first or perfect state is nothing but the history of the biological degeneration of the race of men.”</i></p><p>Now, I am an anti-Platonist and anti-idealist, so please don’t confuse his arguments with mine.  My object in quoting that passage from <i>The Open Society and Its Enemies</i> is merely to point out that the connection between a heterogeneous population and the degeneration and ultimate downfall of the state has been understood for more than 2,360 years.  I note that it is tremendously ironic that so many of the stated objectives of modern left-liberals have their roots in Plato’s political philosophy even though those objectives are structurally undermined by the left’s simultaneous rejection of Plato’s core postulates as well as the structural basis of his ideal state.  As Popper points out, Plato is the ultimate reactionary; his philosophy is not so much conservative or reactionary as literally <i>prehistoric</i>, and those progressives who look to his utopian ideals as a guide are attempting to progress to an imaginary prehistory.</p><p>But that doesn’t mean all of his social observations are incorrect, to the contrary, we have seen the pattern play out over and over again.  The ongoing breakdown of the European Union can be seen as a straightforward application of the inevitable degeneration of the multi-ethnic state, in that the Germans are unwilling to make the same sacrifices for the Greeks, the Italians, and the Spanish that the West Germans were willing to make on behalf of the East Germans only twenty years ago.</p><p>Now, I think Plato observed the symptoms and correctly diagnosed the disease, but came up with an insane plan of treatment to place the patient in a permanent induced coma.  Multi-ethnicity is, when viewed through the lens of the organic theory of the state, a societal cancer.  Like cancer, it will either be excised or the state will die.  The proponents of universal equalitarianism and diversity have not only rejected this long-recognized principle, but have made a fundamental error in grasping the difficulty of civilizing human populations.  They believe that civilization is a pure accident of geography, that if one takes a highly civilized group of people from an advanced civilization and places them in a barbarian culture, within three generations that group will turn into barbarians behaving in a manner identical to the barbarians around them, and that if one takes a wholly uncivilized group of people from an barbarian culture and places them in a highly civilized culture, within three generations that group will turn into highly civilized people behaving in a manner identical to the highly civilized people around them.  It’s little more than replacing Plato with William Golding, and works about as well as replacing the most influential philosopher in human history with a petty novelist would lead you to expect.</p><p>In light of this juxtaposition of Plato with Golding, consider <a href=\"http://www.dailymail.co.uk/news/article-2147730/Father-56-critical-condition-stabbed-trying-shield-dying-son-frenzied-attack-hoodie-gang-outside-pub.html\">the following news report from the UK</a>:</p><blockquote><p> A gang of 20 hooded youths stormed a pub after the Champions League final before dragging away a 25-year old man and stabbing him to death in scenes ‘like a horror film’, friends said today.  ‘True gent’ Luke Fitzpatrick was killed and his father Bernard, who threw himself on top of his son in a desperate attempt to shield him, remains in a critical condition in hospital after being stabbed four times.  The pair were attacked when a gang armed with bats and knives stormed the north London pub after father and son had watched Chelsea win the cup together at on Saturday…. ‘There were about 20 young black guys all with their hoods up armed with sticks and bats and knives. They just ran in the pub and started trying to attack people.  It was really frightening. But it should not have happened to Luke, it shouldn’t have happened to anyone, but he was a complete innocent.’</p></blockquote><p>Now, had this happened in the USA, it would be blamed on the legacy of American slavery.  Of course, there is no black legacy of slavery in England; the “youfs” are most likely descended from Africans who immigrated to the UK from the Caribbean as the 1948 Windrush generation, or directly from Africa in more recent years.  There are at least 200 years separating the Afro-Caribbeans of the UK from the African American population, possibly as much as 340 years in the Western hemisphere alone.  And yet, the similar behavior of both African populations, particularly in the predilection of young male Africans for committing crude and violent mob attacks on innocent non-Africans minding their own business, is readily observable and gives the lie to the diversity crew’s theory that civilization is vicinity-based and can be successfully installed in a population in a few generations or less.</p><p>This isn’t to say any one race or population group is necessarily any more or less capable of civilization than another; remember that it took more than 1,200 years for the white Northern Europeans to become civilized despite their close contact with Roman civilization.  The challenge is that since it obviously takes more than the 360 years that the African population has been exposed to European civilization for a people to become fully civilized, the societies of the West are not merely betting their civilizations on the correctness of the fictional Golding theory, they are doing so in the face of more than 2,500 years of historical evidence.  Now, if one wishes to dismiss all of philosophy dating back to Plato, all of the criminal statistics compiled by the various national police forces, and the entire written historical record in favor of crying raciss, that’s perfectly fine.  MPAI.  But don’t do so in the belief that your position is a serious one that is intellectually credible in any way, shape, or form.</p><p>History doesn’t care how it makes anyone feel.  The objective truth cannot, by definition, be defined, let alone influenced, by subjective or dynamic elements.  If one wishes to contest facts and observations, that’s intellectually legitimate, but it is the very singular reliance upon the rhetoric of racism that should be one’s first clue that the multiculturalists and diversity advocates know they have nothing.</p></div>",
  "content_text": "I find the behavior of some white readers here to be tremendously informative with regards to the way in which they react to the occasional “Vibrancy is our strength” posts.  What is quite clear to me is that despite the evidence of some 40+ years of affirmative action and forced integration achieving little more than exchanging segregated neighborhoods for segregated schools and the highest incarceration rate on the planet, many white Americans, even\nconservative\nwhite Americans, are so afraid of being called raciss that they will bury their heads in the sand rather than recognize the readily observable realities of their multi-ethnic society.\nNow, it’s important to first understand that social homogeneity has been considered to be a vital aspect of civilization for more than a thousand years before the Northern Europeans were civilized.  Consider Karl Popper’s summary of Plato:\n“Plato’s theory was a form of the organic theory of the state, even if he had not sometimes spoken of the state as an organism. But since he did this, there can be no doubt left that he must be described as an exponent, or rather, as one of the originators, of this theory. His version of this theory may be characterized as a personalist or psychological one, since he describes the state not in a general way as similar to some organism or other, but as analogous to the human individual, and more specifically to the human soul. Especially the disease of the state, the dissolution of its unity, corresponds to the disease of the human soul, of human nature. In fact, the disease of the state is not only correlated with, but is directly produced by, the corruption of human nature, more especially of the members of the ruling class. Every single one of the typical stages in the degeneration of the state is brought about by a corresponding stage in the degeneration of the human soul, of human nature, of the human race. And since this moral degeneration is interpreted as based upon racial degeneration, we might say that the biological element in Plato’s naturalism turns out, in the end, to have the most important part in the foundation of his historicism. For the history of the downfall of the first or perfect state is nothing but the history of the biological degeneration of the race of men.”\nNow, I am an anti-Platonist and anti-idealist, so please don’t confuse his arguments with mine.  My object in quoting that passage from\nThe Open Society and Its Enemies\nis merely to point out that the connection between a heterogeneous population and the degeneration and ultimate downfall of the state has been understood for more than 2,360 years.  I note that it is tremendously ironic that so many of the stated objectives of modern left-liberals have their roots in Plato’s political philosophy even though those objectives are structurally undermined by the left’s simultaneous rejection of Plato’s core postulates as well as the structural basis of his ideal state.  As Popper points out, Plato is the ultimate reactionary; his philosophy is not so much conservative or reactionary as literally\nprehistoric\n, and those progressives who look to his utopian ideals as a guide are attempting to progress to an imaginary prehistory.\nBut that doesn’t mean all of his social observations are incorrect, to the contrary, we have seen the pattern play out over and over again.  The ongoing breakdown of the European Union can be seen as a straightforward application of the inevitable degeneration of the multi-ethnic state, in that the Germans are unwilling to make the same sacrifices for the Greeks, the Italians, and the Spanish that the West Germans were willing to make on behalf of the East Germans only twenty years ago.\nNow, I think Plato observed the symptoms and correctly diagnosed the disease, but came up with an insane plan of treatment to place the patient in a permanent induced coma.  Multi-ethnicity is, when viewed through the lens of the organic theory of the state, a societal cancer.  Like cancer, it will either be excised or the state will die.  The proponents of universal equalitarianism and diversity have not only rejected this long-recognized principle, but have made a fundamental error in grasping the difficulty of civilizing human populations.  They believe that civilization is a pure accident of geography, that if one takes a highly civilized group of people from an advanced civilization and places them in a barbarian culture, within three generations that group will turn into barbarians behaving in a manner identical to the barbarians around them, and that if one takes a wholly uncivilized group of people from an barbarian culture and places them in a highly civilized culture, within three generations that group will turn into highly civilized people behaving in a manner identical to the highly civilized people around them.  It’s little more than replacing Plato with William Golding, and works about as well as replacing the most influential philosopher in human history with a petty novelist would lead you to expect.\nIn light of this juxtaposition of Plato with Golding, consider\nthe following news report from the UK\n:\nA gang of 20 hooded youths stormed a pub after the Champions League final before dragging away a 25-year old man and stabbing him to death in scenes ‘like a horror film’, friends said today.  ‘True gent’ Luke Fitzpatrick was killed and his father Bernard, who threw himself on top of his son in a desperate attempt to shield him, remains in a critical condition in hospital after being stabbed four times.  The pair were attacked when a gang armed with bats and knives stormed the north London pub after father and son had watched Chelsea win the cup together at on Saturday…. ‘There were about 20 young black guys all with their hoods up armed with sticks and bats and knives. They just ran in the pub and started trying to attack people.  It was really frightening. But it should not have happened to Luke, it shouldn’t have happened to anyone, but he was a complete innocent.’\nNow, had this happened in the USA, it would be blamed on the legacy of American slavery.  Of course, there is no black legacy of slavery in England; the “youfs” are most likely descended from Africans who immigrated to the UK from the Caribbean as the 1948 Windrush generation, or directly from Africa in more recent years.  There are at least 200 years separating the Afro-Caribbeans of the UK from the African American population, possibly as much as 340 years in the Western hemisphere alone.  And yet, the similar behavior of both African populations, particularly in the predilection of young male Africans for committing crude and violent mob attacks on innocent non-Africans minding their own business, is readily observable and gives the lie to the diversity crew’s theory that civilization is vicinity-based and can be successfully installed in a population in a few generations or less.\nThis isn’t to say any one race or population group is necessarily any more or less capable of civilization than another; remember that it took more than 1,200 years for the white Northern Europeans to become civilized despite their close contact with Roman civilization.  The challenge is that since it obviously takes more than the 360 years that the African population has been exposed to European civilization for a people to become fully civilized, the societies of the West are not merely betting their civilizations on the correctness of the fictional Golding theory, they are doing so in the face of more than 2,500 years of historical evidence.  Now, if one wishes to dismiss all of philosophy dating back to Plato, all of the criminal statistics compiled by the various national police forces, and the entire written historical record in favor of crying raciss, that’s perfectly fine.  MPAI.  But don’t do so in the belief that your position is a serious one that is intellectually credible in any way, shape, or form.\nHistory doesn’t care how it makes anyone feel.  The objective truth cannot, by definition, be defined, let alone influenced, by subjective or dynamic elements.  If one wishes to contest facts and observations, that’s intellectually legitimate, but it is the very singular reliance upon the rhetoric of racism that should be one’s first clue that the multiculturalists and diversity advocates know they have nothing.",
  "tags": [
    "Vibrancy is our strength"
  ],
  "categories": [],
  "sitemap_lastmod": "2012-05-22T08:51:00+00:00"
}