{
  "url": "https://voxday.net/2012/05/20/progress-repor/",
  "scraped_at": "2025-12-14T04:55:00.656492",
  "title": "Progress report",
  "date_display": "May 20, 2012",
  "date_iso": "2012-05-20T18:03:00+00:00",
  "date_from_url": "2012-05-20",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>It’s too soon to declare it a noble failure yet, but my ambitious goal of starting and finishing the 750-page first volume in <i>The Arts of Dark and Light</i> series within one calendar year is in serious jeopardy.  I had to write 808 more or less keepable words per day, every single day, to hit that target, and as of today I’ve only averaged 625.  Unless I can tack a thousand per day onto that for the two-month home stretch, I’m not going to make it.  That means, of course, that the book is already around 190,000 words now, so it’s safe to say that if you liked <i>Summa Elvetica</i>, well, there is considerably more of that sort of thing in store for you.  The book hasn’t been formally announced yet, but the contract has been signed, so everything is moving forward and it’s possible that my first foray into epic/fat fantasy may even be released before the end of the year.  That’s up to the publisher, of course, but in the meantime, I intend to put the three Eternal Warriors ebooks up on Amazon within the next two weeks.</p><p>One thing that I’ve discussed with him is the possibility of permitting VP readers to preorder the trade paperback in return for a decent discount, so if that’s of interest, let me know.  If you’ve converted wholly over to eReaders, however, that’s fine too as there will be an ebook version from the start.</p></div>",
  "content_text": "It’s too soon to declare it a noble failure yet, but my ambitious goal of starting and finishing the 750-page first volume in\nThe Arts of Dark and Light\nseries within one calendar year is in serious jeopardy.  I had to write 808 more or less keepable words per day, every single day, to hit that target, and as of today I’ve only averaged 625.  Unless I can tack a thousand per day onto that for the two-month home stretch, I’m not going to make it.  That means, of course, that the book is already around 190,000 words now, so it’s safe to say that if you liked\nSumma Elvetica\n, well, there is considerably more of that sort of thing in store for you.  The book hasn’t been formally announced yet, but the contract has been signed, so everything is moving forward and it’s possible that my first foray into epic/fat fantasy may even be released before the end of the year.  That’s up to the publisher, of course, but in the meantime, I intend to put the three Eternal Warriors ebooks up on Amazon within the next two weeks.\nOne thing that I’ve discussed with him is the possibility of permitting VP readers to preorder the trade paperback in return for a decent discount, so if that’s of interest, let me know.  If you’ve converted wholly over to eReaders, however, that’s fine too as there will be an ebook version from the start.",
  "tags": [
    "writing"
  ],
  "categories": [],
  "sitemap_lastmod": "2012-05-20T17:03:00+00:00"
}