{
  "url": "https://voxday.net/2012/05/17/r-stands-for-rape/",
  "scraped_at": "2025-12-14T04:54:49.747350",
  "title": "R stands for Rape",
  "date_display": "May 17, 2012",
  "date_iso": "2012-05-17T17:54:00+00:00",
  "date_from_url": "2012-05-17",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>Does Undead Press <a href=\"http://www.blackgate.com/2012/05/16/continued-fallout-for-undead-press/\">publish Wängsty</a>?</p><blockquote><p> There’s recently been a flurry of posts about Undead Press, a small publishing house that a) doesn’t pay, b) allegedly humiliates its authors by inserting gratuitous rape scenes into their stories, without asking those authors if they want those rape scenes to be there, and c) has apparently published and continues to advertise a sequel to George Romero’s DAWN OF THE DEAD, showing an absolute lack of respect for copyright or concern for the legal consequences.</p></blockquote><p>Trick question.  As anyone who has ever read R. Scott Bakker knows, there is no such thing as a gratuitous rape scene.  Or rather, as anyone who has ever read R. Scott Bakker possesses justified true belief, there is no such thing as a gratuitous rape scene.</p><p>One of these days, I’ll have to go through Bakker’s books in order to create a poll on Black Gate where the legions of Bakker readers can vote on their favorite rape scene written by Rapey McRaperson.  After all, it’s so hard to choose between the one in <i>Neuropath </i>where the woman rapes the man accompanied by <a href=\"https://requireshate.wordpress.com/2012/04/17/r-scott-bakker-neuropath-of-misogyny/\">some of the worst sexual dialogue outside of 1970s era pornography</a> or the one in <i>The Warrior Prophet</i> where the Sranc – a demonic winged creature with an Alien-style double skull – not only rapes a man, his wife, and their child to death, but also manages to make the woman climax while raping her.  (Contra Umberto Eco, I have long regarded the orgasmic rape as the definitive indicator of pornography.)  But make no mistake, these rape scenes are not gratuitous!  They are <i>philosophy</i>.</p><p>I have to admit, however, that Mr. Giangregorio’s publishing style appears to be more than a little awesome.  Some might see it as a strange little man humiliating female authors, but I tend to interpret it as a sardonic commentary on the sex scenes in seventies and eighties science fiction, which always seemed to feature that one completely pointless scene in which the hot primary female character – usually red-headed – seduces the unsuspecting male protagonist without ever having given any signs of being attracted to him.  I always viewed it as the fat, clueless SF author’s perspective on the Stygian mysteries of inter-sexual relations.</p></div>",
  "content_text": "Does Undead Press\npublish Wängsty\n?\nThere’s recently been a flurry of posts about Undead Press, a small publishing house that a) doesn’t pay, b) allegedly humiliates its authors by inserting gratuitous rape scenes into their stories, without asking those authors if they want those rape scenes to be there, and c) has apparently published and continues to advertise a sequel to George Romero’s DAWN OF THE DEAD, showing an absolute lack of respect for copyright or concern for the legal consequences.\nTrick question.  As anyone who has ever read R. Scott Bakker knows, there is no such thing as a gratuitous rape scene.  Or rather, as anyone who has ever read R. Scott Bakker possesses justified true belief, there is no such thing as a gratuitous rape scene.\nOne of these days, I’ll have to go through Bakker’s books in order to create a poll on Black Gate where the legions of Bakker readers can vote on their favorite rape scene written by Rapey McRaperson.  After all, it’s so hard to choose between the one in\nNeuropath\nwhere the woman rapes the man accompanied by\nsome of the worst sexual dialogue outside of 1970s era pornography\nor the one in\nThe Warrior Prophet\nwhere the Sranc – a demonic winged creature with an Alien-style double skull – not only rapes a man, his wife, and their child to death, but also manages to make the woman climax while raping her.  (Contra Umberto Eco, I have long regarded the orgasmic rape as the definitive indicator of pornography.)  But make no mistake, these rape scenes are not gratuitous!  They are\nphilosophy\n.\nI have to admit, however, that Mr. Giangregorio’s publishing style appears to be more than a little awesome.  Some might see it as a strange little man humiliating female authors, but I tend to interpret it as a sardonic commentary on the sex scenes in seventies and eighties science fiction, which always seemed to feature that one completely pointless scene in which the hot primary female character – usually red-headed – seduces the unsuspecting male protagonist without ever having given any signs of being attracted to him.  I always viewed it as the fat, clueless SF author’s perspective on the Stygian mysteries of inter-sexual relations.",
  "tags": [
    "books",
    "freakshow"
  ],
  "categories": [],
  "sitemap_lastmod": "2012-05-17T16:54:00+00:00"
}