{
  "url": "https://voxday.net/2012/05/31/sam-harris-and-epic-self-evisceration/",
  "scraped_at": "2025-12-14T04:55:45.094756",
  "title": "Sam Harris and the epic self-evisceration",
  "date_display": "May 31, 2012",
  "date_iso": "2012-05-31T12:30:00+00:00",
  "date_from_url": "2012-05-31",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>My original intent upon finishing Sam Harris’s latest book was to write a detailed critique of it.  However, in reading it, I realized that it actually contained something much more interesting than the expected collection of conventional Harrisian errors, as it amounted to a rebuttal of the man’s previous work!  So, although I intend to critique <i>Free Will</i> in the near future, I thought it would be more important to look at how Harris’s latest arguments affect his earlier ones.  In <i>The Irrational Atheist</i>, I noted that Christopher Hitchens had committed a marvelous exercise in self-evisceration when he declared that “what can be asserted without evidence can also be dismissed without evidence”, then proceeded to pronounce no fewer than 52 different declarations, each of which was presented completely without evidence.  However, it would appear that Sam Harris is more than worthy of filling the late Mr. Hitchens giant clown shoes, as he has effortlessly surpassed that feat of self-defeating logic with his latest adventure in science-flavored polemic.  However, to fully appreciate the full scope of Harris’s unique achievement, it is necessary to return to his most popular work, <i>The End of Faith</i>, and revisit that book’s central thesis.</p><p>The basic concept at the heart of <i>The End of Faith</i> is that belief is the root of all human action.  From this core postulate, Harris then concludes that because belief causes action – he actually goes so far as to state that “beliefs are action” – that some actions are so potentially dangerous that they justify pre-emptively killing people who possess the beliefs that cause them.  He then attempts to show that those causal beliefs are generally religious in nature; the end of faith to which he refers in the title is the violent elimination of faith by, (or on behalf of), a one-world government justified by the religious faithful’s opposition to global government as well as faith’s potential danger to the human race as per the extinction equation, in which Religious Faith + Science and Technology = Human Extinction.</p><p>This encapsulation of Harris’s argument will likely sound outrageous until one considers the evidence taken directly from <i>The End of Faith</i>:</p><blockquote><p> “A BELIEF is a lever that, once pulled, moves almost everything else in a person’s life. Are you a scientist? A liberal? A racist? These are merely species of belief in action. Your beliefs define your vision of the world; they dictate your behavior; they determine your emotional responses to other human beings.”</p><p>“As a man believes, so he will act.”</p><p>“It is time we recognized that belief is not a private matter; it has never been merely private. In fact, beliefs are scarcely more private than actions are, for every belief is a fount of action <i>in potentia.</i> The belief that it will rain puts an umbrella in the hand of every man or woman who owns one.”</p><p>“Given the link between belief and action, it is clear that we can no more tolerate a diversity of religious beliefs than a diversity of beliefs about epidemiology and basic hygiene…. Even apparently innocuous beliefs, when unjustified, can lead to intolerable consequences.”</p><p>“There seems, however, to be a problem with some of our most cherished beliefs about the world: they are leading us, inexorably, to kill one another. A glance at history, or at the pages of any newspaper, reveals that ideas which divide one group of human beings from another, only to unite them in slaughter, generally have their roots in religion. It seems that if our species ever eradicates itself through war, it will not be because it was written in the stars but because it was written in our books; it is what we do with words like “God” and “paradise” and “sin” in the present that will determine our future.”</p><p>“The link between belief and behavior raises the stakes considerably. Some propositions are so dangerous that it may even be ethical to kill people for believing them. This may seem an extraordinary claim, but it merely enunciates an ordinary fact about the world in which we live. Certain beliefs place their adherents beyond the reach of every peaceful means of persuasion, while inspiring them to commit acts of extraordinary violence against others.”</p><p>“We can say it even more simply: we need a world government…. The diversity of our religious beliefs constitutes a primary obstacle here…. World government does seem a long way off—so long that we may not survive the trip.”</p></blockquote><p>Now, Harris’s argument is as fallacious as it is dangerous, for as I showed in TIA, even if one accepts the logic of the extinction equation, a perusal of history shows that the danger purportedly posed by religion is a second-order one at most, and furthermore, is not supported by the historical evidence, whereas the first-order danger stems directly from science.  In 116 centuries filled with hundreds, if not thousands, of diverse religions, all competing for mind share, resources and dominance, the species has not merely survived, but has thrived, while a mere four centuries of modern science has created multiple clear and present dangers to the continued existence of the human race.  Even if one accepts the general thrust of Harris’s argument in <i>The End of Faith</i> and believes that the danger to the species demands immediate action, it is obvious that Harris’s target is the wrong one and he should have been advocating the end of <i>science</i> rather than faith.</p><p>However, instead of either retracting or revising his argument, Harris has taken the surprising approach of undermining it by destroying its very foundation in his most recent book, <i>Free Will</i>.  I suspect, however, that he has done this unintentionally and in complete ignorance of having done so, as he happens to be one of the laziest and most careless intellectuals to ever be embraced by the public.  For in <i>Free Will</i>, he completely <i>disassociates</i> action from belief, in fact, he disassociates it from conscious thought altogether.  Consider the following quotes from <i>Free Will</i>:</p><blockquote><p> “The popular conception of free will seems to rest on two assumptions: (1) that each of us could have behaved differently than we did in the past, and (2) that we are the conscious source of most of our thoughts and actions in the present. As we are about to see, however, both of these assumptions are false.”</p><p>“The intention to do one thing and not another does not originate in consciousness—rather, it appears in consciousness, as does any thought or impulse that might oppose it.”</p><p>“The intention to do one thing and not another does not originate in consciousness—rather, it appears in consciousness, as does any thought or impulse that might oppose it…. These findings are difficult to reconcile with the sense that we are the conscious authors of our actions.  One fact now seems indisputable: Some moments before you are aware of what you will do next—a time in which you subjectively appear to have complete freedom to behave however you please—your brain has already determined what you will do. You then become conscious of this “decision” and believe that you are in the process of making it.”</p><p>“The brain is a physical system, entirely beholden to the laws of nature—and there is every reason to believe that changes in its functional state and material structure entirely dictate our thoughts and actions.”</p><p>“Our sense of free will results from a failure to appreciate this: We do not know what we intend to do until the intention itself arises. To understand this is to realize that we are not the authors of our thoughts and actions in the way that people generally suppose.”</p><p>“Unconscious neural events determine our thoughts and actions—and are themselves determined by prior causes of which we are subjectively unaware.”</p><p>“People feel (or presume) an authorship of their thoughts and actions that is illusory.”</p></blockquote><p>As he declares that the illusory nature of free will erodes the concepts of moral responsibility, punishment, and the religious concept of sin, Harris appears to be completely unaware of how he has also destroyed his previous case against faith and religion.  Being either the product or the resident of the conscious mind, belief can no longer be equated with action or serve as its causal factor, indeed, we are informed that the very possibility that belief can even be linked with action is nothing more than an illusion.  He not only abandons, but actively attacks the basic concept upon which all the arguments in his previous book rest, the idea that belief is the root of all human action.  Now he insists that a man will not act according to his beliefs for the obvious reason that he cannot; at most, his beliefs can only be seen as consequences that run more or less in parallel with his actions and therefore cannot serve as indicators of his future actions.  This severing of the link between belief and action completely eliminates the viability of Harris’s claim that religious beliefs are intrinsically dangerous as well as any justification for the sort of lethal pre-emptive action he previously declared to be ethical.</p><p>Therefore, in light of the new material, one of his previous declarations quoted above must be rephrased thusly: “Given the absence of the link between belief and action, it is clear that we can tolerate a diversity of religious beliefs as well as diversity of beliefs about epidemiology and basic hygiene…. Even apparently deadly beliefs, whether they are justified or not, cannot lead to harmful consequences.”</p><p>One imagines that one of his more intelligent fans will eventually notice the way in which Mr. Harris’s latest arguments have rendered his older ones incorrect and bring it to Mr. Harris’s attention, so I’m sure we can all anticipate a retraction of the various anti-religious claims presented in <i>The End of Faith</i> in the reasonably near future.</p></div>",
  "content_text": "My original intent upon finishing Sam Harris’s latest book was to write a detailed critique of it.  However, in reading it, I realized that it actually contained something much more interesting than the expected collection of conventional Harrisian errors, as it amounted to a rebuttal of the man’s previous work!  So, although I intend to critique\nFree Will\nin the near future, I thought it would be more important to look at how Harris’s latest arguments affect his earlier ones.  In\nThe Irrational Atheist\n, I noted that Christopher Hitchens had committed a marvelous exercise in self-evisceration when he declared that “what can be asserted without evidence can also be dismissed without evidence”, then proceeded to pronounce no fewer than 52 different declarations, each of which was presented completely without evidence.  However, it would appear that Sam Harris is more than worthy of filling the late Mr. Hitchens giant clown shoes, as he has effortlessly surpassed that feat of self-defeating logic with his latest adventure in science-flavored polemic.  However, to fully appreciate the full scope of Harris’s unique achievement, it is necessary to return to his most popular work,\nThe End of Faith\n, and revisit that book’s central thesis.\nThe basic concept at the heart of\nThe End of Faith\nis that belief is the root of all human action.  From this core postulate, Harris then concludes that because belief causes action – he actually goes so far as to state that “beliefs are action” – that some actions are so potentially dangerous that they justify pre-emptively killing people who possess the beliefs that cause them.  He then attempts to show that those causal beliefs are generally religious in nature; the end of faith to which he refers in the title is the violent elimination of faith by, (or on behalf of), a one-world government justified by the religious faithful’s opposition to global government as well as faith’s potential danger to the human race as per the extinction equation, in which Religious Faith + Science and Technology = Human Extinction.\nThis encapsulation of Harris’s argument will likely sound outrageous until one considers the evidence taken directly from\nThe End of Faith\n:\n“A BELIEF is a lever that, once pulled, moves almost everything else in a person’s life. Are you a scientist? A liberal? A racist? These are merely species of belief in action. Your beliefs define your vision of the world; they dictate your behavior; they determine your emotional responses to other human beings.”\n“As a man believes, so he will act.”\n“It is time we recognized that belief is not a private matter; it has never been merely private. In fact, beliefs are scarcely more private than actions are, for every belief is a fount of action\nin potentia.\nThe belief that it will rain puts an umbrella in the hand of every man or woman who owns one.”\n“Given the link between belief and action, it is clear that we can no more tolerate a diversity of religious beliefs than a diversity of beliefs about epidemiology and basic hygiene…. Even apparently innocuous beliefs, when unjustified, can lead to intolerable consequences.”\n“There seems, however, to be a problem with some of our most cherished beliefs about the world: they are leading us, inexorably, to kill one another. A glance at history, or at the pages of any newspaper, reveals that ideas which divide one group of human beings from another, only to unite them in slaughter, generally have their roots in religion. It seems that if our species ever eradicates itself through war, it will not be because it was written in the stars but because it was written in our books; it is what we do with words like “God” and “paradise” and “sin” in the present that will determine our future.”\n“The link between belief and behavior raises the stakes considerably. Some propositions are so dangerous that it may even be ethical to kill people for believing them. This may seem an extraordinary claim, but it merely enunciates an ordinary fact about the world in which we live. Certain beliefs place their adherents beyond the reach of every peaceful means of persuasion, while inspiring them to commit acts of extraordinary violence against others.”\n“We can say it even more simply: we need a world government…. The diversity of our religious beliefs constitutes a primary obstacle here…. World government does seem a long way off—so long that we may not survive the trip.”\nNow, Harris’s argument is as fallacious as it is dangerous, for as I showed in TIA, even if one accepts the logic of the extinction equation, a perusal of history shows that the danger purportedly posed by religion is a second-order one at most, and furthermore, is not supported by the historical evidence, whereas the first-order danger stems directly from science.  In 116 centuries filled with hundreds, if not thousands, of diverse religions, all competing for mind share, resources and dominance, the species has not merely survived, but has thrived, while a mere four centuries of modern science has created multiple clear and present dangers to the continued existence of the human race.  Even if one accepts the general thrust of Harris’s argument in\nThe End of Faith\nand believes that the danger to the species demands immediate action, it is obvious that Harris’s target is the wrong one and he should have been advocating the end of\nscience\nrather than faith.\nHowever, instead of either retracting or revising his argument, Harris has taken the surprising approach of undermining it by destroying its very foundation in his most recent book,\nFree Will\n.  I suspect, however, that he has done this unintentionally and in complete ignorance of having done so, as he happens to be one of the laziest and most careless intellectuals to ever be embraced by the public.  For in\nFree Will\n, he completely\ndisassociates\naction from belief, in fact, he disassociates it from conscious thought altogether.  Consider the following quotes from\nFree Will\n:\n“The popular conception of free will seems to rest on two assumptions: (1) that each of us could have behaved differently than we did in the past, and (2) that we are the conscious source of most of our thoughts and actions in the present. As we are about to see, however, both of these assumptions are false.”\n“The intention to do one thing and not another does not originate in consciousness—rather, it appears in consciousness, as does any thought or impulse that might oppose it.”\n“The intention to do one thing and not another does not originate in consciousness—rather, it appears in consciousness, as does any thought or impulse that might oppose it…. These findings are difficult to reconcile with the sense that we are the conscious authors of our actions.  One fact now seems indisputable: Some moments before you are aware of what you will do next—a time in which you subjectively appear to have complete freedom to behave however you please—your brain has already determined what you will do. You then become conscious of this “decision” and believe that you are in the process of making it.”\n“The brain is a physical system, entirely beholden to the laws of nature—and there is every reason to believe that changes in its functional state and material structure entirely dictate our thoughts and actions.”\n“Our sense of free will results from a failure to appreciate this: We do not know what we intend to do until the intention itself arises. To understand this is to realize that we are not the authors of our thoughts and actions in the way that people generally suppose.”\n“Unconscious neural events determine our thoughts and actions—and are themselves determined by prior causes of which we are subjectively unaware.”\n“People feel (or presume) an authorship of their thoughts and actions that is illusory.”\nAs he declares that the illusory nature of free will erodes the concepts of moral responsibility, punishment, and the religious concept of sin, Harris appears to be completely unaware of how he has also destroyed his previous case against faith and religion.  Being either the product or the resident of the conscious mind, belief can no longer be equated with action or serve as its causal factor, indeed, we are informed that the very possibility that belief can even be linked with action is nothing more than an illusion.  He not only abandons, but actively attacks the basic concept upon which all the arguments in his previous book rest, the idea that belief is the root of all human action.  Now he insists that a man will not act according to his beliefs for the obvious reason that he cannot; at most, his beliefs can only be seen as consequences that run more or less in parallel with his actions and therefore cannot serve as indicators of his future actions.  This severing of the link between belief and action completely eliminates the viability of Harris’s claim that religious beliefs are intrinsically dangerous as well as any justification for the sort of lethal pre-emptive action he previously declared to be ethical.\nTherefore, in light of the new material, one of his previous declarations quoted above must be rephrased thusly: “Given the absence of the link between belief and action, it is clear that we can tolerate a diversity of religious beliefs as well as diversity of beliefs about epidemiology and basic hygiene…. Even apparently deadly beliefs, whether they are justified or not, cannot lead to harmful consequences.”\nOne imagines that one of his more intelligent fans will eventually notice the way in which Mr. Harris’s latest arguments have rendered his older ones incorrect and bring it to Mr. Harris’s attention, so I’m sure we can all anticipate a retraction of the various anti-religious claims presented in\nThe End of Faith\nin the reasonably near future.",
  "tags": [
    "Sam Harris",
    "science",
    "trainwreck"
  ],
  "categories": [],
  "sitemap_lastmod": "2012-05-31T11:30:00+00:00"
}