{
  "url": "https://voxday.net/2012/05/04/skeptic-confesses/",
  "scraped_at": "2025-12-14T04:53:45.092502",
  "title": "The “skeptic” confesses",
  "date_display": "May 4, 2012",
  "date_iso": "2012-05-04T10:12:00+00:00",
  "date_from_url": "2012-05-04",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>After all of his endless babbling about the necessity of uncertainty and the terrible dangers of certainty, to say nothing of his attempts to criticize others on the basis of their presumed certainty, the Prince of Wängst finally comes clean and admits that <a href=\"http://rsbakker.wordpress.com/2012/05/01/a-dirge-for-the-troubling-and-the-new/#comment-8734\">he is not, in fact, the skeptic he presents himself as being</a>:</p><blockquote><p> I’m a skeptical naturalist. Have been for quite some time now….  The fact is, I am dogmatic. I do have unwavering faith in a set of claims. I may affect suspicion of them, but FAPP, I use them as apodictic truths.  So what are they? Since you can only criticize explicit assumptions, it would probably be a good idea to enumerate them here, if only to make the shape of my bias clear.</p><p> <b>The No-Dogma Dogma</b></p><p> 1) Not all claims are equal.</p><p> 2) The world is ambiguous because it is supercomplex.</p><p> 3) Humans are cognitive egoists. We are hardwired to unconsciously game ambiguities to our own advantage – to make scripture out of habit and self-interest.</p><p> 4) Humans are theoretical morons. We are hardwired for groundless belief in invisible things.</p><p> 5) The feeling of certainty is a bloody pathological liar.</p><p> 6) Science is a social cognitive prosthetic, an institution that, when functioning properly, lets us see past our manifold cognitive shortcomings, and produce theoretical knowledge.</p><p> 7) Contemporary culture, by and large, is bent on concealing the fact of 2, 3, 4, and 5.</p><p>These are the biggies, I think, the one’s that trouble me the most because I seem to repeat them ad nauseum.</p></blockquote><p>It’s not exactly up there with the Golden Rule or the Ten Commandments, but at least it’s something, even if they are no more intrinsically valid postulates than “God created the Heavens and the Earth” or “The world rests upon the shell of a giant turtle”.  What his dogma reveals is that he’s just another incoherent science fetishist wrapped up in philosopher’s clothing, which is pretty much what I’ve been pointing out since last August.  The thing is, even when Bakker is coming clean, he’s <i>still</i> attempting to strike philosophical poses, as there is absolutely no justification for claiming that his dogma is “No-Dogma”.  But let’s look at his seven claims.</p><p>1) Observably and logically true.<br> 2) Begs the question and debatable at best.  Complexity does not necessitate ambiguity.<br> 3) Perhaps, but hardly a certainty.  And is contradicted by four.<br> 4) False.  Most people are idiots whose actions are not in accordance with their objectives, but not all of them.  One wonders what his metric is for supporting the claim of theoretical moronism.  If it’s the philosophical definition of knowledge, then we know his claim is false.<br> 5) Trivially true.  What feeling is reliable?  One seldom sees anyone building bridges using their feelings as a guide.<br> 6) False.  Science doesn’t allow us to see past our “cognitive shortcomings”, but rather, acts as a force multiplier for them.<br> 7) False.  To the extent contemporary culture is bent on concealing anything, which strictly speaking, doesn’t even make sense, it is demonstrably much more focused on 1 and 5 than any of the others.</br></br></br></br></br></br></p><p>It must be admitted that FAPP is an excellent description of Wängsty’s No-Dogma Dogma, especially if one loses the second P.  And those with sufficient recall will no doubt note that none of this serves as any rational basis for claiming that certainty is more dangerous, or less moral, than uncertainty.</p></div>",
  "content_text": "After all of his endless babbling about the necessity of uncertainty and the terrible dangers of certainty, to say nothing of his attempts to criticize others on the basis of their presumed certainty, the Prince of Wängst finally comes clean and admits that\nhe is not, in fact, the skeptic he presents himself as being\n:\nI’m a skeptical naturalist. Have been for quite some time now….  The fact is, I am dogmatic. I do have unwavering faith in a set of claims. I may affect suspicion of them, but FAPP, I use them as apodictic truths.  So what are they? Since you can only criticize explicit assumptions, it would probably be a good idea to enumerate them here, if only to make the shape of my bias clear.\nThe No-Dogma Dogma\n1) Not all claims are equal.\n2) The world is ambiguous because it is supercomplex.\n3) Humans are cognitive egoists. We are hardwired to unconsciously game ambiguities to our own advantage – to make scripture out of habit and self-interest.\n4) Humans are theoretical morons. We are hardwired for groundless belief in invisible things.\n5) The feeling of certainty is a bloody pathological liar.\n6) Science is a social cognitive prosthetic, an institution that, when functioning properly, lets us see past our manifold cognitive shortcomings, and produce theoretical knowledge.\n7) Contemporary culture, by and large, is bent on concealing the fact of 2, 3, 4, and 5.\nThese are the biggies, I think, the one’s that trouble me the most because I seem to repeat them ad nauseum.\nIt’s not exactly up there with the Golden Rule or the Ten Commandments, but at least it’s something, even if they are no more intrinsically valid postulates than “God created the Heavens and the Earth” or “The world rests upon the shell of a giant turtle”.  What his dogma reveals is that he’s just another incoherent science fetishist wrapped up in philosopher’s clothing, which is pretty much what I’ve been pointing out since last August.  The thing is, even when Bakker is coming clean, he’s\nstill\nattempting to strike philosophical poses, as there is absolutely no justification for claiming that his dogma is “No-Dogma”.  But let’s look at his seven claims.\n1) Observably and logically true.\n2) Begs the question and debatable at best.  Complexity does not necessitate ambiguity.\n3) Perhaps, but hardly a certainty.  And is contradicted by four.\n4) False.  Most people are idiots whose actions are not in accordance with their objectives, but not all of them.  One wonders what his metric is for supporting the claim of theoretical moronism.  If it’s the philosophical definition of knowledge, then we know his claim is false.\n5) Trivially true.  What feeling is reliable?  One seldom sees anyone building bridges using their feelings as a guide.\n6) False.  Science doesn’t allow us to see past our “cognitive shortcomings”, but rather, acts as a force multiplier for them.\n7) False.  To the extent contemporary culture is bent on concealing anything, which strictly speaking, doesn’t even make sense, it is demonstrably much more focused on 1 and 5 than any of the others.\nIt must be admitted that FAPP is an excellent description of Wängsty’s No-Dogma Dogma, especially if one loses the second P.  And those with sufficient recall will no doubt note that none of this serves as any rational basis for claiming that certainty is more dangerous, or less moral, than uncertainty.",
  "tags": [
    "philosophy"
  ],
  "categories": [],
  "sitemap_lastmod": "2012-05-04T09:12:00+00:00"
}