{
  "url": "https://voxday.net/2012/05/18/triumph-of-effor/",
  "scraped_at": "2025-12-14T04:54:53.381209",
  "title": "A triumph of effort",
  "date_display": "May 18, 2012",
  "date_iso": "2012-05-18T15:46:00+00:00",
  "date_from_url": "2012-05-18",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>Ender has had a tough couple of weeks.  Missing two weeks due to a poorly timed illness at the beginning of the spring season caused him to lose the starting position he’d worked so hard to merit in the fall.  Even when he came back, he was looking a little lost on the field, and his coach was quite right in deciding to demote him to a second-half substitute.  He was a little frustrated, naturally, but I told him to be patient, keep working, and everything would sort itself out in time.  So, he kept practicing, playing respectably when he went into the game, and generally maintaining his equanimity.</p><p>He finally got his chance four weeks ago when the team was having a very tough time stopping a small, but very fast attacker who was blowing past the starting right defender at will.  The team was only losing 1-0, but the first twenty minutes of the game had been played in their end, the keeper was getting shellacked, and the next goal was clearly only a matter of time.  One of Ender’s friends had come to watch the game, and at one point, I heard him muttering “Mama mia, che disastro” and I couldn’t help but agree.  Finally, the coach, who is really quite good, decided he had to change things up in order to keep the team from collapsing.  He put in Ender at right back, who like the defender for whom he was substituting was badly overmatched in terms of speed, but I’d been watching the attackers closely and pointed out to him how the speedy attacker always wanted to go down the line.  Every time, it was fake inside, go outside.  So, by going aggressively to the ball, utilizing smart offside trapping, anticipating that inside-out move, and committing outright fouls when the attacker was getting around him, Ender managed to shut the kid down and help his team to a 3-2 victory.  (Having once been a speed player myself, I have a pretty good idea how to disrupt them.)  The other team’s second goal initially looked like his fault, as he failed to clear a ball that was coming across the area, but as it turned out, the goalie had called for it and he’d properly let it go.  After the game, his coach was delighted, as the one thing the defense has tended to lack is toughness, and he promptly restored Ender to his position at starting right back.</p><p>This, however, led to another problem.  The boy whose starting position he’d taken has a friend who is a bit of a troublemaker, and after practice, the troublemaker egged the other boy, who is a full head taller, into attacking Ender.  He wasn’t much of a fighter, though, and Ender sent him away crying.  I have to give the kid credit though, as at the next practice, when the coach asked about what had happened and the troublemaker lied, claiming Ender started it, the boy stepped forward of his own volition and set matters striaght.  Things were just a bit uncomfortable before the next game, as there was a miscommunication about the meeting place, and when Ender and I showed up, the troublemaker was the only one there.  But we gave him a ride anyhow, for as I explained to Ender, who was half-inclined to leave the kid there, you don’t have to like your teammates, but you still have to have their back.</p><p>It was a big game for everyone, since it was against their archrivals from the bigger neighboring town and there is a noticeable inferiority complex that affects kids and adults alike.  They got off to a bad start, going down 1-0, but struck back quickly with goals from their two best players.  It was 2-1 when his team won a corner kick; Ender went up in support, as always, but this time the other team failed to send anyone out to guard him in his position just outside the 18-yard box.  He noticed this, called for the ball, and to my surprise, the girl taking the corner kick quickly passed it to him.  He stepped in and hit it on the first touch, and sent the ball in a beautiful rainbow right into the far upper corner.  Goal, 3-1, and the game was essentially over.  It was his first goal at this level and the look on his face was a marvel to see, half exultation, half incredulity, as his teammates all ran over to mob him.  After the game, I was talking with one of the other parents when I noticed that the kid walking along next to Ender and discussing the game with him on the way to the locker room was the troublemaker.</p><p>The team is actually coming together rather nicely.  Two days ago, they played an evening game against an undefeated team from the big city.  I was just hoping they’d lose respectably, as in the warm-ups it was quite clear that the other team was much more skilled.  Before the game, the coach snorted angrily to me that they were acting like stars and looking down at the little peasants from the countryside.  But despite going down 1-0 to an absolutely ridiculous penalty call after, the team stayed calm and struck back with a beautiful goal from one attacker in the first half, then the team’s other attacker scored a second goal to take the lead with about ten minutes left in the game.  Ender was worn out by keeping an even faster attacker under control and had to come out for a while, but the coach switched to a <i>catenaccio</i> strategy at the end and despite his exhaustion put him back in as a fourth defender.  The other team was attacking with all the desperation of big city boys who didn’t want to lose to the little peasant team, especially with the potential winning goal <i>scored by a girl</i>.  But despite a few close calls, the <i>catenaccio</i> held firm, and they very nearly added a third goal on the counterattack.  You would have thought it was the World Cup, as when the final whistle blew, Ender’s team was celebrating wildly while half the players on the big city team were in tears.</p><p>They’re not going to win the league this year, in fact,they’re not even going to win their conference.  They’ve only got one, possibly two, players who could start on either of the two best teams.  But it’s really a lot of fun to watch them play, and I’m very proud of how Ender never gives up, no matter how bleak the prospects appear.</p></div>",
  "content_text": "Ender has had a tough couple of weeks.  Missing two weeks due to a poorly timed illness at the beginning of the spring season caused him to lose the starting position he’d worked so hard to merit in the fall.  Even when he came back, he was looking a little lost on the field, and his coach was quite right in deciding to demote him to a second-half substitute.  He was a little frustrated, naturally, but I told him to be patient, keep working, and everything would sort itself out in time.  So, he kept practicing, playing respectably when he went into the game, and generally maintaining his equanimity.\nHe finally got his chance four weeks ago when the team was having a very tough time stopping a small, but very fast attacker who was blowing past the starting right defender at will.  The team was only losing 1-0, but the first twenty minutes of the game had been played in their end, the keeper was getting shellacked, and the next goal was clearly only a matter of time.  One of Ender’s friends had come to watch the game, and at one point, I heard him muttering “Mama mia, che disastro” and I couldn’t help but agree.  Finally, the coach, who is really quite good, decided he had to change things up in order to keep the team from collapsing.  He put in Ender at right back, who like the defender for whom he was substituting was badly overmatched in terms of speed, but I’d been watching the attackers closely and pointed out to him how the speedy attacker always wanted to go down the line.  Every time, it was fake inside, go outside.  So, by going aggressively to the ball, utilizing smart offside trapping, anticipating that inside-out move, and committing outright fouls when the attacker was getting around him, Ender managed to shut the kid down and help his team to a 3-2 victory.  (Having once been a speed player myself, I have a pretty good idea how to disrupt them.)  The other team’s second goal initially looked like his fault, as he failed to clear a ball that was coming across the area, but as it turned out, the goalie had called for it and he’d properly let it go.  After the game, his coach was delighted, as the one thing the defense has tended to lack is toughness, and he promptly restored Ender to his position at starting right back.\nThis, however, led to another problem.  The boy whose starting position he’d taken has a friend who is a bit of a troublemaker, and after practice, the troublemaker egged the other boy, who is a full head taller, into attacking Ender.  He wasn’t much of a fighter, though, and Ender sent him away crying.  I have to give the kid credit though, as at the next practice, when the coach asked about what had happened and the troublemaker lied, claiming Ender started it, the boy stepped forward of his own volition and set matters striaght.  Things were just a bit uncomfortable before the next game, as there was a miscommunication about the meeting place, and when Ender and I showed up, the troublemaker was the only one there.  But we gave him a ride anyhow, for as I explained to Ender, who was half-inclined to leave the kid there, you don’t have to like your teammates, but you still have to have their back.\nIt was a big game for everyone, since it was against their archrivals from the bigger neighboring town and there is a noticeable inferiority complex that affects kids and adults alike.  They got off to a bad start, going down 1-0, but struck back quickly with goals from their two best players.  It was 2-1 when his team won a corner kick; Ender went up in support, as always, but this time the other team failed to send anyone out to guard him in his position just outside the 18-yard box.  He noticed this, called for the ball, and to my surprise, the girl taking the corner kick quickly passed it to him.  He stepped in and hit it on the first touch, and sent the ball in a beautiful rainbow right into the far upper corner.  Goal, 3-1, and the game was essentially over.  It was his first goal at this level and the look on his face was a marvel to see, half exultation, half incredulity, as his teammates all ran over to mob him.  After the game, I was talking with one of the other parents when I noticed that the kid walking along next to Ender and discussing the game with him on the way to the locker room was the troublemaker.\nThe team is actually coming together rather nicely.  Two days ago, they played an evening game against an undefeated team from the big city.  I was just hoping they’d lose respectably, as in the warm-ups it was quite clear that the other team was much more skilled.  Before the game, the coach snorted angrily to me that they were acting like stars and looking down at the little peasants from the countryside.  But despite going down 1-0 to an absolutely ridiculous penalty call after, the team stayed calm and struck back with a beautiful goal from one attacker in the first half, then the team’s other attacker scored a second goal to take the lead with about ten minutes left in the game.  Ender was worn out by keeping an even faster attacker under control and had to come out for a while, but the coach switched to a\ncatenaccio\nstrategy at the end and despite his exhaustion put him back in as a fourth defender.  The other team was attacking with all the desperation of big city boys who didn’t want to lose to the little peasant team, especially with the potential winning goal\nscored by a girl\n.  But despite a few close calls, the\ncatenaccio\nheld firm, and they very nearly added a third goal on the counterattack.  You would have thought it was the World Cup, as when the final whistle blew, Ender’s team was celebrating wildly while half the players on the big city team were in tears.\nThey’re not going to win the league this year, in fact,they’re not even going to win their conference.  They’ve only got one, possibly two, players who could start on either of the two best teams.  But it’s really a lot of fun to watch them play, and I’m very proud of how Ender never gives up, no matter how bleak the prospects appear.",
  "tags": [
    "sports"
  ],
  "categories": [],
  "sitemap_lastmod": "2012-05-18T14:46:00+00:00"
}