{
  "url": "https://voxday.net/2012/05/13/veterans-of-endless-war/",
  "scraped_at": "2025-12-14T04:54:27.977080",
  "title": "Veterans of an endless war",
  "date_display": "May 13, 2012",
  "date_iso": "2012-05-13T13:38:00+00:00",
  "date_from_url": "2012-05-13",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>First, a Happy Mother’s Day to the many mothers out there.  However, I think it is long past time to change the emphasis of the holiday, from one that is a saccharine and sentimental celebration of biology to one that honors a vital societal contribution.  It is rightly said that the future belongs to those who show up for it.  Mothers are the builders of the future, and civilized mothers are nothing less than the core defenders of civilization.  Without mothers, all the science and technology and art of Man is pointless and without value.</p><p>Mothers risk their lives and sacrifice their petty desires to ensure that Man will survive one more generation.  Their unique and precious gift to the species should never be overlooked, much less belittled, as a woman who marries, bears children, and raises them with her husband is doing the single most important thing she can possibly do as a human being.  Everything else is of lesser import.  So, in addition to the breakfasts in bed, the cards, the flowers, and so forth, don’t forget to remember that she is more than the mother of your children, she is a decorated veteran <a href=\"http://www.wnd.com/2007/05/41576/\">in civilization’s never-ending war</a> against barbarism and the void.</p></div>",
  "content_text": "First, a Happy Mother’s Day to the many mothers out there.  However, I think it is long past time to change the emphasis of the holiday, from one that is a saccharine and sentimental celebration of biology to one that honors a vital societal contribution.  It is rightly said that the future belongs to those who show up for it.  Mothers are the builders of the future, and civilized mothers are nothing less than the core defenders of civilization.  Without mothers, all the science and technology and art of Man is pointless and without value.\nMothers risk their lives and sacrifice their petty desires to ensure that Man will survive one more generation.  Their unique and precious gift to the species should never be overlooked, much less belittled, as a woman who marries, bears children, and raises them with her husband is doing the single most important thing she can possibly do as a human being.  Everything else is of lesser import.  So, in addition to the breakfasts in bed, the cards, the flowers, and so forth, don’t forget to remember that she is more than the mother of your children, she is a decorated veteran\nin civilization’s never-ending war\nagainst barbarism and the void.",
  "tags": [
    "society"
  ],
  "categories": [],
  "sitemap_lastmod": "2012-05-13T12:38:00+00:00"
}