{
  "url": "https://voxday.net/2012/05/10/victimizing-vibran/",
  "scraped_at": "2025-12-14T04:54:13.642028",
  "title": "Victimizing the vibrant",
  "date_display": "May 10, 2012",
  "date_iso": "2012-05-10T12:30:00+00:00",
  "date_from_url": "2012-05-10",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>Jonathan Frost chronicles the tragic tale of <a href=\"http://www.jonathan-frost.com/breaking-news-violence-gunfire-events-make-shoppers-not-be-alive-anymore/\">three vibrant young fun-lovers victimized</a> by an objectively raciss police force:</p><blockquote><p> Events occurred in the neighbourhood of White Oaks, Michigan last week, when a jolly squad of mischief-making troubadours came upon a Whole Foods at 9:18pm on Tuesday of last week and allegedly caused eighteen shoppers to no longer be alive.  According to testimony by the one surviving shopper, who managed to conceal herself behind an upright display of locally-sourced quinoa bread, the trio of mischief-makers brandished firearms as they made their way into the store, secured the exits, and ordered the shoppers to fall to their knees in a line, calling them childish names throughout.</p><p>The silly teens then slowly went from one shopper to the next, demanding apologies for the brutal, unprovoked, cold-blooded murder of Trayvon Martin, pictured below, by George Zimmerman, a privileged white male who is white.  The apologies were apparently not sincere enough for the impish rascals, as they ended the spectacle by executing each of the alleged victims with a double-tap to the base of the skull. The puckish rapscallions then fled the store, but they were apprehended later that night after having immediately uploaded pictures and videos to their Facebook, Twitter, Instagram and WorldStarHipHop accounts.</p></blockquote><p>It is, of course, overtly and exceedingly raciss for the northern chapter of the KKK also known as “the Michigan police” to arrest these three fine and otherwise upstanding young knuckleheads for the mere exuberance of their vibrancy, and it is an outrage that these itty, bitty babies of color, of whom it has been justly said, “ain’t never gwan be hurt nobody nohow” should find themselves facing the dreadful prospect of as much as <i>four years</i> in jail for the incidental and wholly unintentional life-ending of eighteen raciss descendants of slave-owners who were not only privileged and white, but knowingly shopped at Whole Foods, which everyone knows is the very epitome of stuff white people like.</p><p>Free Trayvon, De’Andre, and Sparckle!</p></div>",
  "content_text": "Jonathan Frost chronicles the tragic tale of\nthree vibrant young fun-lovers victimized\nby an objectively raciss police force:\nEvents occurred in the neighbourhood of White Oaks, Michigan last week, when a jolly squad of mischief-making troubadours came upon a Whole Foods at 9:18pm on Tuesday of last week and allegedly caused eighteen shoppers to no longer be alive.  According to testimony by the one surviving shopper, who managed to conceal herself behind an upright display of locally-sourced quinoa bread, the trio of mischief-makers brandished firearms as they made their way into the store, secured the exits, and ordered the shoppers to fall to their knees in a line, calling them childish names throughout.\nThe silly teens then slowly went from one shopper to the next, demanding apologies for the brutal, unprovoked, cold-blooded murder of Trayvon Martin, pictured below, by George Zimmerman, a privileged white male who is white.  The apologies were apparently not sincere enough for the impish rascals, as they ended the spectacle by executing each of the alleged victims with a double-tap to the base of the skull. The puckish rapscallions then fled the store, but they were apprehended later that night after having immediately uploaded pictures and videos to their Facebook, Twitter, Instagram and WorldStarHipHop accounts.\nIt is, of course, overtly and exceedingly raciss for the northern chapter of the KKK also known as “the Michigan police” to arrest these three fine and otherwise upstanding young knuckleheads for the mere exuberance of their vibrancy, and it is an outrage that these itty, bitty babies of color, of whom it has been justly said, “ain’t never gwan be hurt nobody nohow” should find themselves facing the dreadful prospect of as much as\nfour years\nin jail for the incidental and wholly unintentional life-ending of eighteen raciss descendants of slave-owners who were not only privileged and white, but knowingly shopped at Whole Foods, which everyone knows is the very epitome of stuff white people like.\nFree Trayvon, De’Andre, and Sparckle!",
  "tags": [
    "Vibrancy is our strength"
  ],
  "categories": [],
  "sitemap_lastmod": "2012-05-10T11:30:00+00:00"
}