{
  "url": "https://voxday.net/2012/01/14/big-in-japan/",
  "scraped_at": "2025-12-14T04:44:27.700259",
  "title": "Big in Japan",
  "date_display": "January 14, 2012",
  "date_iso": "2012-01-14T10:56:00+00:00",
  "date_from_url": "2012-01-14",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>Or the former Eastern bloc, to put it more precisely.  Much to my surprise, I have recently learned that <i>Rebel Moon</i> and <i>Rebel Moon Rising</i>, two of the games I designed and developed with Big Chilly, have an exceedingly devoted following in Russia and Eastern Europe.  These lunatics have not only produced Russian and Hungarian language versions of the games, but have even gone so far as to port the original <i>Rebel Moon</i>, which was produced for Creative Labs and only ran on the original 3D Blaster, to Windows proper.  They’ve even corrected a few of the crater names, which I apparently managed to get wrong somehow.</p><p>Here are a few screenshots from <a href=\"http://magyaritasok.hu/gallery/rebelmoonrising\">the Hungarian version</a>.   And here is a download link to the English version of <a href=\"http://uploadbox.com/files/4e496e952e/\">Rebel Moon for Windows</a> (30 megs) as well as <a href=\"http://uploadbox.com/files/61a1fcef75/\">a v1.1 patch</a> (568k) that the Russian programmers created to fix a few minor bugs and add post-level briefings based on the novel.  I have to admit, it’s rather pleasant to learn that some parts of the gaming community still recognize how far ahead of the game design curve we were at the time, even though the gaming media completely ignored RMR due to their singular focus on what at the time were still vaporware games built around true 3D engines such as <i>Unreal</i>.</p></div>",
  "content_text": "Or the former Eastern bloc, to put it more precisely.  Much to my surprise, I have recently learned that\nRebel Moon\nand\nRebel Moon Rising\n, two of the games I designed and developed with Big Chilly, have an exceedingly devoted following in Russia and Eastern Europe.  These lunatics have not only produced Russian and Hungarian language versions of the games, but have even gone so far as to port the original\nRebel Moon\n, which was produced for Creative Labs and only ran on the original 3D Blaster, to Windows proper.  They’ve even corrected a few of the crater names, which I apparently managed to get wrong somehow.\nHere are a few screenshots from\nthe Hungarian version\n.   And here is a download link to the English version of\nRebel Moon for Windows\n(30 megs) as well as\na v1.1 patch\n(568k) that the Russian programmers created to fix a few minor bugs and add post-level briefings based on the novel.  I have to admit, it’s rather pleasant to learn that some parts of the gaming community still recognize how far ahead of the game design curve we were at the time, even though the gaming media completely ignored RMR due to their singular focus on what at the time were still vaporware games built around true 3D engines such as\nUnreal\n.",
  "tags": [
    "games"
  ],
  "categories": [],
  "sitemap_lastmod": "2012-01-14T10:56:00+00:00"
}