{
  "url": "https://voxday.net/2012/01/26/dawkins-doubles-down/",
  "scraped_at": "2025-12-14T04:45:38.689324",
  "title": "Dawkins doubles down",
  "date_display": "January 26, 2012",
  "date_iso": "2012-01-26T13:20:00+00:00",
  "date_from_url": "2012-01-26",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>I know a lot of people found it difficult to believe that Richard Dawkins’s arguments are as haplessly bad as they are.  But every time he speaks out, <a href=\"http://richarddawkins.net/audio/1306-interview-with-richard-dawkins/comments?page=1\">he reveals that he is both dishonest and as reliably inept</a> as I described in TIA:</p><blockquote><p>“If children are taught, however moderately, that faith is a virtue, they are taught that they don’t need evidence to believe something; that they can believe something just because it’s their faith, then that paves the way for the minority to become extremists. If children are taught that they don’t need to defend their beliefs with evidence, then that does pave the way for extremism.”</p><p>He believes that atheism will soon become a more popular framework for people. “There seems to be a correlation with education. It’s certainly true within the US — the more educated people are more likely to give up religion. I’m sure that’s true in India as well,” he says, adding that even US presidents may have been atheists but they’re not allowed to say so or they won’t get re-elected. “I think Lincoln, Kennedy, Clinton, Obama may well be an atheist. Obama’s a very intelligent man. He probably is an atheist,” he says. “There are 535 members in the US congress. Presumably some of them are reasonably educated. It’s inconceivable that only one of them is an atheist. There’s got to be at least 50% of them.”</p></blockquote><p>Being a conventionally clueless academic, Dawkins clearly doesn’t realize that the educational systems across the West are barely capable of teaching children how to read or do math.  The idea that it is going to teach them to believe in things only based on evidence is absurd.  And the stupidity of the idea is underliend by the fact that it is readily apparent that <i>Richard Dawkins doesn’t even know what “evidence” is!</i> This is a massive blunder and proves that he genuinely is as stupid as his inept arguments dissected in TIA make him appear!</p><p>One can only wonder about the logic behind Dawkins’s absurd claim that half the U.S. Congress is atheist.  Or what is the evidence upon which he bases this belief, since he presents nothing but a naked assertion.  As for Obama being an atheist, everyone knows that’s not true.  One can quite credibly make the case for him being a Muslim since he is known to have been one as a child; there is no shortage of documentary evidence attesting to his Islamic heritage.   Or one could also make the case that he is a Muslim apostate who converted to Christianity, as he himself <a href=\"http://articles.latimes.com/2010/sep/29/nation/la-na-obama-religion-20100929\">declared last year</a>.  But where is the evidence that Obama is an atheist?  Dawkins offers nothing beyond the fact of Obama’s education.</p><p>In trying to claim that all of these men who openly and publicly confessed their belief, not only in God, but often in specific religious theologies, are actually atheists, Dawkins is being blatantly dishonest.  This is deeply ironic, given his angry response to those historically misinformed Christians who believe that Charles Darwin converted to Christianity on his deathbed.</p></div>",
  "content_text": "I know a lot of people found it difficult to believe that Richard Dawkins’s arguments are as haplessly bad as they are.  But every time he speaks out,\nhe reveals that he is both dishonest and as reliably inept\nas I described in TIA:\n“If children are taught, however moderately, that faith is a virtue, they are taught that they don’t need evidence to believe something; that they can believe something just because it’s their faith, then that paves the way for the minority to become extremists. If children are taught that they don’t need to defend their beliefs with evidence, then that does pave the way for extremism.”\nHe believes that atheism will soon become a more popular framework for people. “There seems to be a correlation with education. It’s certainly true within the US — the more educated people are more likely to give up religion. I’m sure that’s true in India as well,” he says, adding that even US presidents may have been atheists but they’re not allowed to say so or they won’t get re-elected. “I think Lincoln, Kennedy, Clinton, Obama may well be an atheist. Obama’s a very intelligent man. He probably is an atheist,” he says. “There are 535 members in the US congress. Presumably some of them are reasonably educated. It’s inconceivable that only one of them is an atheist. There’s got to be at least 50% of them.”\nBeing a conventionally clueless academic, Dawkins clearly doesn’t realize that the educational systems across the West are barely capable of teaching children how to read or do math.  The idea that it is going to teach them to believe in things only based on evidence is absurd.  And the stupidity of the idea is underliend by the fact that it is readily apparent that\nRichard Dawkins doesn’t even know what “evidence” is!\nThis is a massive blunder and proves that he genuinely is as stupid as his inept arguments dissected in TIA make him appear!\nOne can only wonder about the logic behind Dawkins’s absurd claim that half the U.S. Congress is atheist.  Or what is the evidence upon which he bases this belief, since he presents nothing but a naked assertion.  As for Obama being an atheist, everyone knows that’s not true.  One can quite credibly make the case for him being a Muslim since he is known to have been one as a child; there is no shortage of documentary evidence attesting to his Islamic heritage.   Or one could also make the case that he is a Muslim apostate who converted to Christianity, as he himself\ndeclared last year\n.  But where is the evidence that Obama is an atheist?  Dawkins offers nothing beyond the fact of Obama’s education.\nIn trying to claim that all of these men who openly and publicly confessed their belief, not only in God, but often in specific religious theologies, are actually atheists, Dawkins is being blatantly dishonest.  This is deeply ironic, given his angry response to those historically misinformed Christians who believe that Charles Darwin converted to Christianity on his deathbed.",
  "tags": [
    "atheism",
    "education"
  ],
  "categories": [],
  "sitemap_lastmod": "2012-01-26T13:20:00+00:00"
}