{
  "url": "https://voxday.net/2012/01/18/dealing-with-decline/",
  "scraped_at": "2025-12-14T04:44:51.514708",
  "title": "Dealing with decline",
  "date_display": "January 18, 2012",
  "date_iso": "2012-01-18T10:50:00+00:00",
  "date_from_url": "2012-01-18",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>In which approaching the peak <a href=\"http://www.dailymail.co.uk/news/article-2082923/Mental-decline-Brain-starts-going-downhill-45.html\">is contemplated</a>:</p><blockquote><p>Memory and other brain skills begin to decline at the age of 45 – much earlier than previously thought, say researchers.  A major study shows the brain’s capacity for memory, reasoning and comprehension starts waning in middle age rather than in the 60s.  Experts say the finding is important because younger people should be encouraged to boost their brain power with healthier living, while some may benefit from medicines to stave off further decline.</p></blockquote><p>This report doesn’t surprise me in the slightest.  One of the things I have learned about playing soccer and 3D shooters after the age of 40 is how comprehensive the physical decline is.  Since most people don’t compete directly with younger athletes after the age of 35 or so, it can be difficult to believe how much speed and quickness one loses.  I can’t imagine that there isn’t a similar deterioration taking place elsewhere as well.</p><p>It is not only the top gear that is gone, but there is a also the complete absence of a first step; it’s almost as if the first thing the middle-aged mind does is instead of react is to perform a quick calculation of whether or not it’s likely going to be worth it to go through with the physical exertion required.  One feels as if one is always going at about three-quarters speed, trying to harbor a reserve for when a complete effort will be required in order to make a difference.</p><p>It’s been interesting to see how the athletic decline translates to video game performance.  While my Battlefield 3 performance is generally respectable, as I usually finish around the middle point of points scored, both my kills and deaths usually tend to be low because I simply don’t do well in the sort of run around and spray SMG fire game that the younger guys with their faster reflexes play.  I’ve had to learn to avoid taking quick potshots at enemies running past when I have the drop on them; taking the time to aim a careful headshot that drops them at once is much better than a fast shot that misses and permits them to turn around and fire back in a more accurate and lethal manner.  And while I’ve racked up the occasional 2-1 K/D ratio and even a few top scores, my average is barely above 1/2.  But it’s been steadily improving as my rank and unlocks improve, so I’m optimistic that I’ll be able to get it above 1 by the time I level out.</p><p>I do think that the mental exercise involved in maintaining this blog and playing wargames helps sharpen my mental focus; how much that will stave off the approaching decline will be interesting to see.  Thinking about it also makes me wonder if the abrupt decline in the quality of novels by certain authors later in life might be attributable to degraded mental powers rather than them simply losing interest; I’ve never understood how Colleen McCullough’s Rome series could drop so precipitously off a cliff the way it did after <i>Fortune’s Favorites</i>.</p><p>While I have at least a few more years at the height of my powers, it really makes me wish I had worked more diligently at my books.  Such is the inevitable regret of the dilettante.</p></div>",
  "content_text": "In which approaching the peak\nis contemplated\n:\nMemory and other brain skills begin to decline at the age of 45 – much earlier than previously thought, say researchers.  A major study shows the brain’s capacity for memory, reasoning and comprehension starts waning in middle age rather than in the 60s.  Experts say the finding is important because younger people should be encouraged to boost their brain power with healthier living, while some may benefit from medicines to stave off further decline.\nThis report doesn’t surprise me in the slightest.  One of the things I have learned about playing soccer and 3D shooters after the age of 40 is how comprehensive the physical decline is.  Since most people don’t compete directly with younger athletes after the age of 35 or so, it can be difficult to believe how much speed and quickness one loses.  I can’t imagine that there isn’t a similar deterioration taking place elsewhere as well.\nIt is not only the top gear that is gone, but there is a also the complete absence of a first step; it’s almost as if the first thing the middle-aged mind does is instead of react is to perform a quick calculation of whether or not it’s likely going to be worth it to go through with the physical exertion required.  One feels as if one is always going at about three-quarters speed, trying to harbor a reserve for when a complete effort will be required in order to make a difference.\nIt’s been interesting to see how the athletic decline translates to video game performance.  While my Battlefield 3 performance is generally respectable, as I usually finish around the middle point of points scored, both my kills and deaths usually tend to be low because I simply don’t do well in the sort of run around and spray SMG fire game that the younger guys with their faster reflexes play.  I’ve had to learn to avoid taking quick potshots at enemies running past when I have the drop on them; taking the time to aim a careful headshot that drops them at once is much better than a fast shot that misses and permits them to turn around and fire back in a more accurate and lethal manner.  And while I’ve racked up the occasional 2-1 K/D ratio and even a few top scores, my average is barely above 1/2.  But it’s been steadily improving as my rank and unlocks improve, so I’m optimistic that I’ll be able to get it above 1 by the time I level out.\nI do think that the mental exercise involved in maintaining this blog and playing wargames helps sharpen my mental focus; how much that will stave off the approaching decline will be interesting to see.  Thinking about it also makes me wonder if the abrupt decline in the quality of novels by certain authors later in life might be attributable to degraded mental powers rather than them simply losing interest; I’ve never understood how Colleen McCullough’s Rome series could drop so precipitously off a cliff the way it did after\nFortune’s Favorites\n.\nWhile I have at least a few more years at the height of my powers, it really makes me wish I had worked more diligently at my books.  Such is the inevitable regret of the dilettante.",
  "tags": [
    "games"
  ],
  "categories": [],
  "sitemap_lastmod": "2012-01-18T10:50:00+00:00"
}