{
  "url": "https://voxday.net/2012/01/31/do-they-really-want-to-play-that-game/",
  "scraped_at": "2025-12-14T04:46:07.731937",
  "title": "Do they really want to play that game?",
  "date_display": "January 31, 2012",
  "date_iso": "2012-01-31T14:00:00+00:00",
  "date_from_url": "2012-01-31",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>Gay activists really don’t appear to be all that intelligent.  Simply because they’ve been permitted to prance out of the closet with impunity for a few decades across a decadent and declining West, they suddenly think they can <a href=\"http://thinkprogress.org/lgbt/2012/01/30/414125/tennessee-restaurant-throws-out-anti-gay-lawmaker/?mobile=nc\">start discriminating against the majority of the population</a> who believe, on the basis of considerable material evidence, that homosexuals are an immoral, abnormal, and disease-ridden section of the citizenry:</p><blockquote><p>A restaurant in Knoxville, Tennessee refused to serve state Sen. Stacey Campfield, the man who sponsored the state’s “don’t say gay” bill, compared homosexuality to bestiality, and most recently told Michelangelo Signorile that it’s virtually impossible to spread HIV/AIDS through heterosexual sex. “I hope that Stacy Campfield now knows what if feels like to be unfairly discriminated against,” the Bistro at the Bijou wrote on its Facebook wall on Sunday.</p></blockquote><p>Don’t get me wrong.  As long as they leave the children alone, I have nothing for or against gays, and I completely support the right of the Bistro at the Bijou to not serve anyone it doesn’t want to serve.  I’m a libertarian and I fully support everyone’s right to parachute into Hell, (or for our godless friends, into the Void), in the specific manner of his choosing.  Of course, I also support the right of everyone else to choose not to do business with anyone, for any reason, and I am under the impression that, by definition, the population demographics don’t tend to favor the abnormally oriented.  It strike me as being akin to bringing a toothpick to the battle of Kursk.</p><p>There is some seriously perverse illogic being exhibited here if the gay community thinks it can successfully justify practicing active discrimination against its political opponents while simultaneously decrying everyone else’s ability to exert their Constitutional rights of free association.  And it also demonstrates a stunning lack of foresight – although I suppose that’s not really all that stunning among a community dumb enough to actively fight against quarantining the confirmed carriers of a lethal sexual disease – as one would think they would be far more concerned about importing millions of potential voters who believe homosexuals should have walls dropped on them than they are about the fairly conventional opinions of a state legislator.</p><p>The consequences of a Straight-Queer discrimination war are just too terrible to contemplate.  Think about those poor straight Hollywood actors, choreographers, interior decorators, Broadway playwrights, elementary school teachers, and Republican senators, who would all find themselves shunned by their peers.  I have no doubt it would make life very uncomfortable for Rand Paul and at least five or six other men across the country.</p></div>",
  "content_text": "Gay activists really don’t appear to be all that intelligent.  Simply because they’ve been permitted to prance out of the closet with impunity for a few decades across a decadent and declining West, they suddenly think they can\nstart discriminating against the majority of the population\nwho believe, on the basis of considerable material evidence, that homosexuals are an immoral, abnormal, and disease-ridden section of the citizenry:\nA restaurant in Knoxville, Tennessee refused to serve state Sen. Stacey Campfield, the man who sponsored the state’s “don’t say gay” bill, compared homosexuality to bestiality, and most recently told Michelangelo Signorile that it’s virtually impossible to spread HIV/AIDS through heterosexual sex. “I hope that Stacy Campfield now knows what if feels like to be unfairly discriminated against,” the Bistro at the Bijou wrote on its Facebook wall on Sunday.\nDon’t get me wrong.  As long as they leave the children alone, I have nothing for or against gays, and I completely support the right of the Bistro at the Bijou to not serve anyone it doesn’t want to serve.  I’m a libertarian and I fully support everyone’s right to parachute into Hell, (or for our godless friends, into the Void), in the specific manner of his choosing.  Of course, I also support the right of everyone else to choose not to do business with anyone, for any reason, and I am under the impression that, by definition, the population demographics don’t tend to favor the abnormally oriented.  It strike me as being akin to bringing a toothpick to the battle of Kursk.\nThere is some seriously perverse illogic being exhibited here if the gay community thinks it can successfully justify practicing active discrimination against its political opponents while simultaneously decrying everyone else’s ability to exert their Constitutional rights of free association.  And it also demonstrates a stunning lack of foresight – although I suppose that’s not really all that stunning among a community dumb enough to actively fight against quarantining the confirmed carriers of a lethal sexual disease – as one would think they would be far more concerned about importing millions of potential voters who believe homosexuals should have walls dropped on them than they are about the fairly conventional opinions of a state legislator.\nThe consequences of a Straight-Queer discrimination war are just too terrible to contemplate.  Think about those poor straight Hollywood actors, choreographers, interior decorators, Broadway playwrights, elementary school teachers, and Republican senators, who would all find themselves shunned by their peers.  I have no doubt it would make life very uncomfortable for Rand Paul and at least five or six other men across the country.",
  "tags": [
    "trainwreck"
  ],
  "categories": [],
  "sitemap_lastmod": "2012-01-31T14:00:00+00:00"
}