{
  "url": "https://voxday.net/2012/01/20/evil-of-apple/",
  "scraped_at": "2025-12-14T04:45:08.070292",
  "title": "The evil of Apple",
  "date_display": "January 20, 2012",
  "date_iso": "2012-01-20T17:50:00+00:00",
  "date_from_url": "2012-01-20",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>The technocancer is <a href=\"http://www.zdnet.com/blog/bott/apples-mind-bogglingly-greedy-and-evil-license-agreement/4360?tag=nl.e539\">metastasizing post-Jobs</a>:</p><blockquote><p>I have never seen a EULA as mind-bogglingly greedy and evil as Apple’s EULA for its new ebook authoring program.  Dan Wineman calls it “unprecedented audacity” on Apple’s part. For people like me, who write and sell books, access to multiple markets is essential. But that’s prohibited:</p><p><i>“Apple, in this EULA, is claiming a right not just to its software, but to its software’s output. It’s akin to Microsoft trying to restrict what people can do with Word documents, or Adobe declaring that if you use Photoshop to export a JPEG, you can’t freely sell it to Getty. As far as I know, in the consumer software industry, this practice is unprecedented.”</i></p><p>Exactly: Imagine if Microsoft said you had to pay them 30% of your speaking fees if you used a PowerPoint deck in a speech.</p><p>I’ve downloaded the software and had a chance to skim the EULA. Much of it is boilerplate, but I’ve read and re-read Section 2B, and it does indeed go far beyond any license agreement I’ve ever seen:</p><p> <i>“B. Distribution of your Work. As a condition of this License and provided you are in compliance with its terms, your Work may be distributed as follows:</i></p><p> (i) if your Work is provided for free (at no charge), you may distribute the Work by any available means;<br> (ii) if your Work is provided for a fee (including as part of any subscription-based product or service), you may only distribute the Work through Apple and such distribution is subject to the following limitations and conditions: (a) you will be required to enter into a separate written agreement with Apple (or an Apple affiliate or subsidiary) before any commercial distribution of your Work may take place; and (b) Apple may determine for any reason and in its sole discretion not to select your Work for distribution.”</br></p><p>And then the next paragraph is bold-faced, just so you don’t miss it:</p><p> <i><b>“Apple will not be responsible for any costs, expenses, damages, losses (including without limitation lost business opportunities or lost profits) or other liabilities you may incur as a result of your use of this Apple Software, including without limitation the fact that your Work may not be selected for distribution by Apple.”</b></i></p><p>The nightmare scenario under this agreement? You create a great work of staggering literary genius that you think you can sell for 5 or 10 bucks per copy. You craft it carefully in iBooks Author. You submit it to Apple. They reject it.  Under this license agreement, you are out of luck. They won’t sell it, and you can’t legally sell it elsewhere. You can give it away, but you can’t sell it.</p></blockquote><p>Well, you can’t say I didn’t warn you.  This isn’t so much a walled garden as a concentration camp for the creative.  When your actions are being compared disfavorably with Microsoft’s, then the dot is a line to you.</p></div>",
  "content_text": "The technocancer is\nmetastasizing post-Jobs\n:\nI have never seen a EULA as mind-bogglingly greedy and evil as Apple’s EULA for its new ebook authoring program.  Dan Wineman calls it “unprecedented audacity” on Apple’s part. For people like me, who write and sell books, access to multiple markets is essential. But that’s prohibited:\n“Apple, in this EULA, is claiming a right not just to its software, but to its software’s output. It’s akin to Microsoft trying to restrict what people can do with Word documents, or Adobe declaring that if you use Photoshop to export a JPEG, you can’t freely sell it to Getty. As far as I know, in the consumer software industry, this practice is unprecedented.”\nExactly: Imagine if Microsoft said you had to pay them 30% of your speaking fees if you used a PowerPoint deck in a speech.\nI’ve downloaded the software and had a chance to skim the EULA. Much of it is boilerplate, but I’ve read and re-read Section 2B, and it does indeed go far beyond any license agreement I’ve ever seen:\n“B. Distribution of your Work. As a condition of this License and provided you are in compliance with its terms, your Work may be distributed as follows:\n(i) if your Work is provided for free (at no charge), you may distribute the Work by any available means;\n(ii) if your Work is provided for a fee (including as part of any subscription-based product or service), you may only distribute the Work through Apple and such distribution is subject to the following limitations and conditions: (a) you will be required to enter into a separate written agreement with Apple (or an Apple affiliate or subsidiary) before any commercial distribution of your Work may take place; and (b) Apple may determine for any reason and in its sole discretion not to select your Work for distribution.”\nAnd then the next paragraph is bold-faced, just so you don’t miss it:\n“Apple will not be responsible for any costs, expenses, damages, losses (including without limitation lost business opportunities or lost profits) or other liabilities you may incur as a result of your use of this Apple Software, including without limitation the fact that your Work may not be selected for distribution by Apple.”\nThe nightmare scenario under this agreement? You create a great work of staggering literary genius that you think you can sell for 5 or 10 bucks per copy. You craft it carefully in iBooks Author. You submit it to Apple. They reject it.  Under this license agreement, you are out of luck. They won’t sell it, and you can’t legally sell it elsewhere. You can give it away, but you can’t sell it.\nWell, you can’t say I didn’t warn you.  This isn’t so much a walled garden as a concentration camp for the creative.  When your actions are being compared disfavorably with Microsoft’s, then the dot is a line to you.",
  "tags": [
    "technology"
  ],
  "categories": [],
  "sitemap_lastmod": "2012-01-20T17:50:00+00:00"
}