{
  "url": "https://voxday.net/2012/01/11/evil-of-denominations/",
  "scraped_at": "2025-12-14T04:44:11.258606",
  "title": "The evil of denominations",
  "date_display": "January 11, 2012",
  "date_iso": "2012-01-11T14:30:00+00:00",
  "date_from_url": "2012-01-11",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>The Church is the people, not the buildings and property.  But as these former Episcopalians are learning to their chagrin, and as other churches that made the mistake of joining a denomination have learned, the wolves in sheep’s clothing who presently run the dying denominations <a href=\"http://www.fcnp.com/news/10879-court-rules-for-diocese-of-virginia-vs-breakaway-group-on-church-properties.html\">don’t hesitate to steal anything of value</a> on which they can legally place their rapacious paws:</p><blockquote><p>Tuesday night, the Fairfax Circuit Court issued its ruling in favor of the Diocese of Virginia and the Episcopal Church in litigation seeking to recover Episcopal church property, according to a report from the Diocese of Virginia. “Our goal throughout this litigation has been to return faithful Episcopalians to their church homes and Episcopal properties to the mission of the Church,” said the Rt. Rev. Shannon S. Johnston, bishop of Virginia.</p><p>The court ruled that the Episcopal Church and the Diocese of Virginia have “a contractual and proprietary interest” in each of the properties subject to the litigation. The court ordered that all property subject to its ruling be turned over to the Diocese.</p></blockquote><p>The problem is <a href=\"http://www.christianitytoday.com/ct/2010/january/16.15.html\">the “accession language” in the contracts</a> through which a church joins a denomination, which means that a denomination which hasn’t contributed a single dime towards the acquisition of a property or the building of a church claims complete ownership of both, contra the interests of the church members whose contributions paid for them and who actually attend the church on a regular basis.  This is why no church should ever join a denomination – perhaps demonination would be a more precise term – simply because its theological principles happen to be more or less in line with those presently professed by the denomination.</p><p>This isn’t the reason that I describe myself as a Christian, not as anything else.  Like every other earthly institution, church denominations are susceptible to corruption, infiltration, and the eventual abandonment of the professed mission.  The Episcopal, Lutheran, and Methodist denominations not only don’t appear to be Christian anymore, they can’t even be reasonably described as “churches” in any reasonable manner.</p></div>",
  "content_text": "The Church is the people, not the buildings and property.  But as these former Episcopalians are learning to their chagrin, and as other churches that made the mistake of joining a denomination have learned, the wolves in sheep’s clothing who presently run the dying denominations\ndon’t hesitate to steal anything of value\non which they can legally place their rapacious paws:\nTuesday night, the Fairfax Circuit Court issued its ruling in favor of the Diocese of Virginia and the Episcopal Church in litigation seeking to recover Episcopal church property, according to a report from the Diocese of Virginia. “Our goal throughout this litigation has been to return faithful Episcopalians to their church homes and Episcopal properties to the mission of the Church,” said the Rt. Rev. Shannon S. Johnston, bishop of Virginia.\nThe court ruled that the Episcopal Church and the Diocese of Virginia have “a contractual and proprietary interest” in each of the properties subject to the litigation. The court ordered that all property subject to its ruling be turned over to the Diocese.\nThe problem is\nthe “accession language” in the contracts\nthrough which a church joins a denomination, which means that a denomination which hasn’t contributed a single dime towards the acquisition of a property or the building of a church claims complete ownership of both, contra the interests of the church members whose contributions paid for them and who actually attend the church on a regular basis.  This is why no church should ever join a denomination – perhaps demonination would be a more precise term – simply because its theological principles happen to be more or less in line with those presently professed by the denomination.\nThis isn’t the reason that I describe myself as a Christian, not as anything else.  Like every other earthly institution, church denominations are susceptible to corruption, infiltration, and the eventual abandonment of the professed mission.  The Episcopal, Lutheran, and Methodist denominations not only don’t appear to be Christian anymore, they can’t even be reasonably described as “churches” in any reasonable manner.",
  "tags": [
    "Christianity"
  ],
  "categories": [],
  "sitemap_lastmod": "2012-01-11T14:30:00+00:00"
}