{
  "url": "https://voxday.net/2012/01/25/excursions-in-alpha_25/",
  "scraped_at": "2025-12-14T04:45:31.374295",
  "title": "Excursions in Alpha",
  "date_display": "January 25, 2012",
  "date_iso": "2012-01-25T10:44:00+00:00",
  "date_from_url": "2012-01-25",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>I suppose I am definitionally obliged to assume that you’re all going to be fascinated by the news that I am reportedly <a href=\"http://alphagameplan.blogspot.com/2012/01/dark-biad.html\">a narcissist</a>.</p><p>A more disputable question is whether <a href=\"http://alphagameplan.blogspot.com/2012/01/alpha-mail-collegiate-quantity.html\">the quantity inelasticity of female demand</a> is a better way of explaining the inapplicability of the conventional demand curve to the supply of available men or if ALPHA and BETA men should simply be regarded as two fundamentally different markets.  Color me extremely dubious about the latter; a Ferrari may be vastly more desirable than a Hyundai, but at the end of the day, they’re still both cars being sold in the automotive market.</p><p>And finally, there is a cursory examination of what some have observed to be the phenomenon of divorced mothers with limited custody <a href=\"http://alphagameplan.blogspot.com/2012/01/alpha-mail-why-daddy-ends-up-with-kids.html\">losing interest in their children</a>, and how fathers facing divorce might be able to feed and take advantage of it in order to raise their children.</p></div>",
  "content_text": "I suppose I am definitionally obliged to assume that you’re all going to be fascinated by the news that I am reportedly\na narcissist\n.\nA more disputable question is whether\nthe quantity inelasticity of female demand\nis a better way of explaining the inapplicability of the conventional demand curve to the supply of available men or if ALPHA and BETA men should simply be regarded as two fundamentally different markets.  Color me extremely dubious about the latter; a Ferrari may be vastly more desirable than a Hyundai, but at the end of the day, they’re still both cars being sold in the automotive market.\nAnd finally, there is a cursory examination of what some have observed to be the phenomenon of divorced mothers with limited custody\nlosing interest in their children\n, and how fathers facing divorce might be able to feed and take advantage of it in order to raise their children.",
  "tags": [
    "Alpha Game"
  ],
  "categories": [],
  "sitemap_lastmod": "2012-01-25T10:44:00+00:00"
}