{
  "url": "https://voxday.net/2012/01/06/insidious-aspect-of-immigration/",
  "scraped_at": "2025-12-14T04:43:43.656668",
  "title": "The insidious aspect of immigration",
  "date_display": "January 6, 2012",
  "date_iso": "2012-01-06T14:30:00+00:00",
  "date_from_url": "2012-01-06",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>Now, it is entirely possible that the names of the three contributors advocating the legalization of foreign money in US elections are Yaakov Roth, Viet Dinh, and Toni Massaro.  No doubt there are plenty of short-sighted individuals with Anglo-Saxon names and an English or Scots-Irish heritage who could make the same case.  But the <a href=\"http://www.nytimes.com/roomfordebate/2012/01/05/should-foreign-money-be-allowed-to-finance-us-elections/\">arguments made by these children</a> of the various waves of mass immigration to America underlines the extent to which the Constitutional principles upon which America was founded have been steadily adulterated by the Germans, Scandinavians, and Irish of the nineteenth century, and by the Italians, Jews, Asians, and Hispanics of the twentieth century.</p><p>Even as they cloak their arguments in the language of freedom and the Constitution, they act to destroy it in order to a) maximize the political influence of their immigrant group and b) attempt to make the laws of the state to which they have immigrated more like those of the state they left.  The important fact that the pro-immigration forces fail to recognize is that simply because one sees better economic opportunity elsewhere does not mean that one has any respect for, or desire to live under, the laws and cultural traditions of the place to which one immigrates.</p><p>As an immigrant myself, I have seen this play out time and time again in the expatriate community.  In my experience, most – not many, but most – expatriates have very little respect or regard for the laws and traditions of the land in which they are living.  Many never trouble to even bother learning the language.  I see no evidence that this is any different in the USA than it is in Europe.</p><p>Like most medications, immigration can strengthen a nation if it occurs in small doses, separated by reasonable interludes.  But mass immigration is akin to a drug overdose and will inevitably destroy the laws, traditions, and customs of the invaded country.</p></div>",
  "content_text": "Now, it is entirely possible that the names of the three contributors advocating the legalization of foreign money in US elections are Yaakov Roth, Viet Dinh, and Toni Massaro.  No doubt there are plenty of short-sighted individuals with Anglo-Saxon names and an English or Scots-Irish heritage who could make the same case.  But the\narguments made by these children\nof the various waves of mass immigration to America underlines the extent to which the Constitutional principles upon which America was founded have been steadily adulterated by the Germans, Scandinavians, and Irish of the nineteenth century, and by the Italians, Jews, Asians, and Hispanics of the twentieth century.\nEven as they cloak their arguments in the language of freedom and the Constitution, they act to destroy it in order to a) maximize the political influence of their immigrant group and b) attempt to make the laws of the state to which they have immigrated more like those of the state they left.  The important fact that the pro-immigration forces fail to recognize is that simply because one sees better economic opportunity elsewhere does not mean that one has any respect for, or desire to live under, the laws and cultural traditions of the place to which one immigrates.\nAs an immigrant myself, I have seen this play out time and time again in the expatriate community.  In my experience, most – not many, but most – expatriates have very little respect or regard for the laws and traditions of the land in which they are living.  Many never trouble to even bother learning the language.  I see no evidence that this is any different in the USA than it is in Europe.\nLike most medications, immigration can strengthen a nation if it occurs in small doses, separated by reasonable interludes.  But mass immigration is akin to a drug overdose and will inevitably destroy the laws, traditions, and customs of the invaded country.",
  "tags": [
    "Vibrancy is our strength"
  ],
  "categories": [],
  "sitemap_lastmod": "2012-01-06T14:30:00+00:00"
}