{
  "url": "https://voxday.net/2012/01/19/it-really-doesnt-get-better/",
  "scraped_at": "2025-12-14T04:44:58.814502",
  "title": "It really doesn’t get better",
  "date_display": "January 19, 2012",
  "date_iso": "2012-01-19T14:00:00+00:00",
  "date_from_url": "2012-01-19",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>Another young gay propagandist <a href=\"http://www.autostraddle.com/19-year-old-gay-artist-eric-james-borges-kills-himself-127948/\">kills himself</a>:</p><blockquote><p>After nineteen years on this planet, throughout which he endured shocking levels of ostracism, abuse and rejection, this week gay filmmaker Eric James Borges decided shit actually wasn’t getting better and took his own life.  In the It Gets Better video he shot one month ago, Borges describes his lifelong odyssey through various rings of hell-on-earth: he’d been teased since kindergarten, his parents tried to perform an exorcism on him when they learned he was gay, he was bullied throughout high school.</p></blockquote><p>Borges was the second young gay propagandist to kill himself <a href=\"http://www.autostraddle.com/gay-teen-jamey-rodemeyer-14-kills-himself-111349/\">in recent months</a>.</p><blockquote><p>14-year-old Jamey Rodemeyer didn’t have many male friends. He hung out with girls, and he hung out on the internet, where he proclaimed and celebrated his love for Lady Gaga on his tumblr, wrote a personal blog, used twitter, opened a formspring account (like many people who open a formspring account, Jamey realized quickly that doing so was “a mistake”), and made videos for YouTube. In May 2011, Jamey Rodemeyer even made an “It Gets Better” video, in which he tells us that despite the bullying, his real friends were very supportive of his coming out. He thanked Lady Gaga for helping him learn to love himself….  This past Sunday, Jamey Rodemeyer was found dead outside his home in an apparent suicide.</p></blockquote><p>It is said that the mark of insanity is doing the same thing over and over again while expecting different results.  Given that it is now 43 years since Stonewall and the present generation of children is the second in succession to have been subjected to nonstop, preschool-to-graduation pro-homosexual, anti-bully brainwashing, I think it is safe to conclude that no amount of repeatedly insisting that “gay is okay” and “homophobia is a mortal sin” is going to have even the slightest impact on reducing the amount of gay suicide.</p><p>In fact, it is entirely possible that the endless propaganda is actually more to blame for what Ellen Degeneres has described as a “gay teen suicide epidemic” than the anti-gay bullying itself.  If the propaganda is encouraging more borderline young men to experiment with a deviant lifestyle that has long been known to correspond with various health-related disorders, including mental health, then it is contributing to an increasing suicide rate rather than decreasing it.</p><p>The core problem is that by focusing on the bullying of these gay teenagers, those wishing to reduce the suicide rate may be entirely missing the causal factor.  While it is a <i>reasonable</i> assumption that the bullying is the cause, the failure of the propaganda tends to suggest that it may not be.  There are other groups that are similarly bullied, for example, the small, the unattractive, and the retarded, and yet they do not appear to commit suicide at the same rate.</p><p>If people genuinely wish to discourage gay teen suicide, they very much need to rethink their basic assumptions concerning the subject and look at whether gay suicide has increased or decreased with its increased societal visibility and if there is even any direct relationship between the amount of bullying an individual receives and the likelihood that he will kill himself.  While I’m sure it must feel very satisfying to blame everything on “homophobes” and insufficient societal admiration, the weight of observable evidence doesn’t presently tend to indicate that they have much, if anything, to do with the actual problem.</p><p>In the meantime, whoever is behind the “It Gets Better” program should do a much more careful job vetting its spokesmen, since at the moment, it looks an awful lot like an inadvertant homosexual suicide campaign straight out of the movie <i>Heathers</i>.  All they need is a video featuring a cheesy 80s band singing “Gay teen suicide, don’t do it!”  Recruiting unstable young men to lie to teenage boys simply isn’t a long-term prescription for success.</p></div>",
  "content_text": "Another young gay propagandist\nkills himself\n:\nAfter nineteen years on this planet, throughout which he endured shocking levels of ostracism, abuse and rejection, this week gay filmmaker Eric James Borges decided shit actually wasn’t getting better and took his own life.  In the It Gets Better video he shot one month ago, Borges describes his lifelong odyssey through various rings of hell-on-earth: he’d been teased since kindergarten, his parents tried to perform an exorcism on him when they learned he was gay, he was bullied throughout high school.\nBorges was the second young gay propagandist to kill himself\nin recent months\n.\n14-year-old Jamey Rodemeyer didn’t have many male friends. He hung out with girls, and he hung out on the internet, where he proclaimed and celebrated his love for Lady Gaga on his tumblr, wrote a personal blog, used twitter, opened a formspring account (like many people who open a formspring account, Jamey realized quickly that doing so was “a mistake”), and made videos for YouTube. In May 2011, Jamey Rodemeyer even made an “It Gets Better” video, in which he tells us that despite the bullying, his real friends were very supportive of his coming out. He thanked Lady Gaga for helping him learn to love himself….  This past Sunday, Jamey Rodemeyer was found dead outside his home in an apparent suicide.\nIt is said that the mark of insanity is doing the same thing over and over again while expecting different results.  Given that it is now 43 years since Stonewall and the present generation of children is the second in succession to have been subjected to nonstop, preschool-to-graduation pro-homosexual, anti-bully brainwashing, I think it is safe to conclude that no amount of repeatedly insisting that “gay is okay” and “homophobia is a mortal sin” is going to have even the slightest impact on reducing the amount of gay suicide.\nIn fact, it is entirely possible that the endless propaganda is actually more to blame for what Ellen Degeneres has described as a “gay teen suicide epidemic” than the anti-gay bullying itself.  If the propaganda is encouraging more borderline young men to experiment with a deviant lifestyle that has long been known to correspond with various health-related disorders, including mental health, then it is contributing to an increasing suicide rate rather than decreasing it.\nThe core problem is that by focusing on the bullying of these gay teenagers, those wishing to reduce the suicide rate may be entirely missing the causal factor.  While it is a\nreasonable\nassumption that the bullying is the cause, the failure of the propaganda tends to suggest that it may not be.  There are other groups that are similarly bullied, for example, the small, the unattractive, and the retarded, and yet they do not appear to commit suicide at the same rate.\nIf people genuinely wish to discourage gay teen suicide, they very much need to rethink their basic assumptions concerning the subject and look at whether gay suicide has increased or decreased with its increased societal visibility and if there is even any direct relationship between the amount of bullying an individual receives and the likelihood that he will kill himself.  While I’m sure it must feel very satisfying to blame everything on “homophobes” and insufficient societal admiration, the weight of observable evidence doesn’t presently tend to indicate that they have much, if anything, to do with the actual problem.\nIn the meantime, whoever is behind the “It Gets Better” program should do a much more careful job vetting its spokesmen, since at the moment, it looks an awful lot like an inadvertant homosexual suicide campaign straight out of the movie\nHeathers\n.  All they need is a video featuring a cheesy 80s band singing “Gay teen suicide, don’t do it!”  Recruiting unstable young men to lie to teenage boys simply isn’t a long-term prescription for success.",
  "tags": [
    "trainwreck"
  ],
  "categories": [],
  "sitemap_lastmod": "2012-01-19T14:00:00+00:00"
}