{
  "url": "https://voxday.net/2012/01/18/look-theyre-just-not-funny/",
  "scraped_at": "2025-12-14T04:44:55.153140",
  "title": "Look, they’re just not funny",
  "date_display": "January 18, 2012",
  "date_iso": "2012-01-18T18:00:00+00:00",
  "date_from_url": "2012-01-18",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>When evidence cited <a href=\"http://mirthmag.com/opinion/are-women-funny-yes-now-can-we-please-move-on/\">proves the precise opposite</a> of the claim it purports to support:</p><blockquote><p>Look – in the era of Tina Fey, Amy Poehler, Sarah Silverman, Kristen Schaal, Kristen Wiig, Maya Rudolph, Lisa Lampanelli, Amy Schumer, Samantha Bee, Whitney Cummings, Melissa McCarthy, Anna Faris, Kathy Griffin, Chelsea Handler – are we really still having this stupid discussion? As this list shows – and this is, of course, just a random and minor sampling – not only are there lots of funny women around, but they’re being funny in many different ways.</p></blockquote><p>That’s it.  That’s what is supposed to prove that female comedians are as funny as male ones?</p><p>Tina Fey – not funny<br> Amy Poehler – not funny<br> Sara Silverman – so not funny<br> Kristen Schaal – who?<br> Kristen Wiig – all right, she’s moderately funny<br> Maya Rudolph – not even a little bit funny<br> Lisa Lampenelli – who?<br> Amy Schumer – who?<br> Samantha Bee – who?<br> Whitney Cummings – She’s attractive.  She’s not funny.<br> Melissa McCarthy – She’s fat, which is admittedly funny.  Otherwise, no.<br> Anna Faris – She’s cute and amusing in certain roles.<br> Kathy Griffin – Actually anti-funny.<br> Chelsea Handler – Not funny.</br></br></br></br></br></br></br></br></br></br></br></br></br></p><p>The easily confirmable fact is that all of them in their entire careers combined haven’t produced half the amount of humor as Frankie Boyle does in any given five minutes on <i>Mock The Wee</i>k or in <a href=\"http://www.youtube.com/watch?v=QvOQxeQKrdw\">ten minutes of standup</a>:</p><p>Mock the Week is great and you can always tell the best comedians, because they are the ones who regularly crack up the other comedians.  What I found particularly amusing about the various collections of <a href=\"http://www.youtube.com/watch?v=lZcJwmSSom0&amp;feature=related\">his most offensive jokes</a> is that they don’t even include his ruthlessly offensive explanation for why Katie Price dates cage fighters.  Number eight was edited out at some point, but it was this joke:</p><p><i>“I’ve been studying Israeli Army Martial Arts. I now know 16 ways to kick a Palestinian woman in the back.”</i></p><p>Another thing to like about Boyle is that <a href=\"http://www.youtube.com/watch?v=fPx7CNT2aVs\">he can take it</a> as well as dish it out.</p></div>",
  "content_text": "When evidence cited\nproves the precise opposite\nof the claim it purports to support:\nLook – in the era of Tina Fey, Amy Poehler, Sarah Silverman, Kristen Schaal, Kristen Wiig, Maya Rudolph, Lisa Lampanelli, Amy Schumer, Samantha Bee, Whitney Cummings, Melissa McCarthy, Anna Faris, Kathy Griffin, Chelsea Handler – are we really still having this stupid discussion? As this list shows – and this is, of course, just a random and minor sampling – not only are there lots of funny women around, but they’re being funny in many different ways.\nThat’s it.  That’s what is supposed to prove that female comedians are as funny as male ones?\nTina Fey – not funny\nAmy Poehler – not funny\nSara Silverman – so not funny\nKristen Schaal – who?\nKristen Wiig – all right, she’s moderately funny\nMaya Rudolph – not even a little bit funny\nLisa Lampenelli – who?\nAmy Schumer – who?\nSamantha Bee – who?\nWhitney Cummings – She’s attractive.  She’s not funny.\nMelissa McCarthy – She’s fat, which is admittedly funny.  Otherwise, no.\nAnna Faris – She’s cute and amusing in certain roles.\nKathy Griffin – Actually anti-funny.\nChelsea Handler – Not funny.\nThe easily confirmable fact is that all of them in their entire careers combined haven’t produced half the amount of humor as Frankie Boyle does in any given five minutes on\nMock The Wee\nk or in\nten minutes of standup\n:\nMock the Week is great and you can always tell the best comedians, because they are the ones who regularly crack up the other comedians.  What I found particularly amusing about the various collections of\nhis most offensive jokes\nis that they don’t even include his ruthlessly offensive explanation for why Katie Price dates cage fighters.  Number eight was edited out at some point, but it was this joke:\n“I’ve been studying Israeli Army Martial Arts. I now know 16 ways to kick a Palestinian woman in the back.”\nAnother thing to like about Boyle is that\nhe can take it\nas well as dish it out.",
  "tags": [
    "media"
  ],
  "categories": [],
  "sitemap_lastmod": "2012-01-18T18:00:00+00:00"
}