{
  "url": "https://voxday.net/2012/01/12/mailvox-science-and-free-wi/",
  "scraped_at": "2025-12-14T04:44:16.763186",
  "title": "Mailvox: science and free will",
  "date_display": "January 12, 2012",
  "date_iso": "2012-01-12T17:30:00+00:00",
  "date_from_url": "2012-01-12",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>CG asks about the implications of time delay in decision-making:</p><blockquote><p>I have read a number of scientific papers asserting that free will doesn’t exist. The Libet experiment, where a person pushes a button, but the brain registers the signal 7 seconds before the time the person made the choice, is one of the more well-known studies.  What do you make of these scientific assertions that free will doesn’t exist? You didn’t really address it in The Irrational Atheist or on your own blog.</p></blockquote><p>No, I didn’t bother, because the sort of experiments cited are not evidence that free will doesn’t exist.  In fact, any scientific assertion that free will does not exist on the basis of these experiments does nothing more than demonstrate that scientists receive insufficient training in basic logic.</p><p>To make this argument, they are assuming that free will relies solely upon “the person” and not “the brain”.  Or to put it more precisely, that “the person” is the conscious aspect of the mind and “the brain” is the unconscious.  But the unconscious part of the mind is a part of the same mind as the conscious one!  Relying on this false distinction is akin to insisting that because I reacted reflexively to movement out of the corner of my eye before I realized it, I did not move.</p><p>But clearly I did move.  And I decided to move.  I merely did not <i>consciously </i>decide to move.  The observable fact of the matter is that we make unconscious decisions every single day, and they are an important aspect of our free will.  To demonstrate that free will does not exist, it would be necessary to demonstrate that all humans exhibit the same unconscious reactions to the same stimuli; any variance in the reactions would indicate that humans are agents possessing the ability to make choices even if they are not consciously aware of the choices they are making.</p><p>The core mistake they are making here is to assume that everything unconscious is therefore determinate.  That is an observably false equivalence.</p><p>There is nothing even remotely remarkable about this experiment.  Having been a 100m sprinter, I’ve always been perfectly aware that the body moves before the conscious mind realizes it.  I was usually in the middle of my second stride out of the blocks before I realized I was already running.  In most of my races, I never even consciously heard the gun.</p><p>And every martial artist knows that if you’re <i>thinking</i> about your next strike or block, you will be too slow.  By the time you consciously see the window and decide “it’s open, therefore I should attack it”, it’s already too late.  The fundamental goal of martial arts training is to train your body and free your mind so that you enter a state where you are making the correct decisions without thinking about them.  This is the state that most athletes recognize as being “in the zone”.</p></div>",
  "content_text": "CG asks about the implications of time delay in decision-making:\nI have read a number of scientific papers asserting that free will doesn’t exist. The Libet experiment, where a person pushes a button, but the brain registers the signal 7 seconds before the time the person made the choice, is one of the more well-known studies.  What do you make of these scientific assertions that free will doesn’t exist? You didn’t really address it in The Irrational Atheist or on your own blog.\nNo, I didn’t bother, because the sort of experiments cited are not evidence that free will doesn’t exist.  In fact, any scientific assertion that free will does not exist on the basis of these experiments does nothing more than demonstrate that scientists receive insufficient training in basic logic.\nTo make this argument, they are assuming that free will relies solely upon “the person” and not “the brain”.  Or to put it more precisely, that “the person” is the conscious aspect of the mind and “the brain” is the unconscious.  But the unconscious part of the mind is a part of the same mind as the conscious one!  Relying on this false distinction is akin to insisting that because I reacted reflexively to movement out of the corner of my eye before I realized it, I did not move.\nBut clearly I did move.  And I decided to move.  I merely did not\nconsciously\ndecide to move.  The observable fact of the matter is that we make unconscious decisions every single day, and they are an important aspect of our free will.  To demonstrate that free will does not exist, it would be necessary to demonstrate that all humans exhibit the same unconscious reactions to the same stimuli; any variance in the reactions would indicate that humans are agents possessing the ability to make choices even if they are not consciously aware of the choices they are making.\nThe core mistake they are making here is to assume that everything unconscious is therefore determinate.  That is an observably false equivalence.\nThere is nothing even remotely remarkable about this experiment.  Having been a 100m sprinter, I’ve always been perfectly aware that the body moves before the conscious mind realizes it.  I was usually in the middle of my second stride out of the blocks before I realized I was already running.  In most of my races, I never even consciously heard the gun.\nAnd every martial artist knows that if you’re\nthinking\nabout your next strike or block, you will be too slow.  By the time you consciously see the window and decide “it’s open, therefore I should attack it”, it’s already too late.  The fundamental goal of martial arts training is to train your body and free your mind so that you enter a state where you are making the correct decisions without thinking about them.  This is the state that most athletes recognize as being “in the zone”.",
  "tags": [
    "mailvox",
    "science"
  ],
  "categories": [],
  "sitemap_lastmod": "2012-01-12T17:30:00+00:00"
}