{
  "url": "https://voxday.net/2012/01/23/mailvox-hit-me-with-your-best-sho/",
  "scraped_at": "2025-12-14T04:45:24.405322",
  "title": "Mailvox: hit me with your best shot",
  "date_display": "January 23, 2012",
  "date_iso": "2012-01-23T21:30:00+00:00",
  "date_from_url": "2012-01-23",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>Agnosticon hasn’t delved deeply enough into the archives to understand why things work the way they do:</p><blockquote><p>If a blog is purposed for argument and not just banal discussion, then opposing views are essential for its content.  Of course, this would also depend on quality of opposition, and most regulars here will immediately begin insulting self-proclaimed atheists, so it can be concluded that this blog doesn’t really value argument.  I think many here are here to socialize with like-minded others.  It’s possible that true argument might not be possible due to asymmetry of opinion, although that isn’t necessarily a disqualifier.  Conventionally, a “troll” is not just someone who shows up only for argument, rather a person who shows up to derail argument.  It would <i>appear</i> that Vox means to argue, since his posts are so often provocative, yet when engaged he often seems too ready just to score a couple points, declare victory, and get out.  There are other people here who seem genuinely interested in argument.</p></blockquote><p>Agnosticon first fails to distinguish between legitimate and substantive arguments versus those that are obviously stupid and fallacious in considering whether the Dread Ilk are interested in arguments in general.  He seems to be unaware that I have written a book in which dozens of popular atheist arguments are conclusively demolished and have addressed many more on this blog over the past four years, so when yet another clueless college kid shows up and starts spouting off half-understood atheist pablum that everyone has seen before, it is hardly a mystery that he meets with nothing but ridicule, especially when he presents his outdated arguments in an obnoxious and confrontational manner.  And why would they be ever be interested in taking such interlocutors seriously, especially when over the last eight years, we have seen this sort of individual lie, move the goalposts, refuse to admit when they are conclusively proved wrong, and otherwise behave in an intellectually unserious manner?</p><p>In the very thread in which Agnosticon commented, we have the example of Dan, who cannot understand that utilitarian philosophy is not “a rational basis in fact”.  Does he honestly recommend that such an individual be taken seriously?  And if so, how?</p><p>The second thing that Agnosticon fails to recognize is that there is substantial proof right here on this blog that I am genuinely interested in argument of a sufficiently high quality.  I have zero interest in arguing for the sake of arguing, much less wasting my time on people who are insufficiently intelligent to say anything new or interesting.  It’s not a case of scoring a couple of points, declaring victory, and getting out, it is simply about qualifying potential opponents.  If a person is incapable of avoiding very basic logical and factual errors, or if it is apparent that they rely upon the usual chicanery such as redefining basic terms and so forth, then there is absolutely no chance they are going to present an argument that I can’t shred with ease.  But rather than refusing to give everyone a shot, I prefer to permit anyone one or two opportunities to say something interesting or effective.  If they want to waste that opportunity on a trivial drive-by comment or two, that’s their choice.</p><p>If they can’t deliver a substantive argument, or if I can identify their glaring mistakes – or worse, intellectual dishonesty – at first glance, then they’re done as far as I’m concerned.  I already know how the prosecution will proceed and it’s all over but for the formalities even before it has begun.  And really, considering the number of comments and emails I receive, that’s the only way it is possible to allow pretty much everyone who wants one a shot.</p><p>So don’t waste it on nonsensical blather if you wish me, or anyone else, to take you seriously.  I’m quite willing to give Agnosticon the opportunity to present a case for his Singulatarianism, or what I described in <i>The Irrational Atheist</i> as apocalyptic techno-heresy, even though he has one strike against him for having demonstrated an inability to distinguish between logical and philosophical integrity and logical and philosophical necessity.  But if he can’t present one, that’s hardly reflective of my unwillingness to engage in substantive argument.</p><p>It’s pretty simple.  Right now I owe Dominic my next entry in our ongoing debate on the existence of God.  Once that concludes, whenever that may be, I’m sure I’ll engage someone else in a substantive and detailed debate.  Debt deflation might be a good one.  But I’m simply not going to focus any time or attention on commenters who publicly demonstrate that they have neither the intelligence nor the intellectual integrity to present a challenge that is both substantive and interesting.  Of course, the primary purpose of this blog is for me to amuse myself.  Everything else is secondary; I’m pleased that some of you find it worth reading on a regular basis, but that’s not its <i>raison d’etre</i>.</p></div>",
  "content_text": "Agnosticon hasn’t delved deeply enough into the archives to understand why things work the way they do:\nIf a blog is purposed for argument and not just banal discussion, then opposing views are essential for its content.  Of course, this would also depend on quality of opposition, and most regulars here will immediately begin insulting self-proclaimed atheists, so it can be concluded that this blog doesn’t really value argument.  I think many here are here to socialize with like-minded others.  It’s possible that true argument might not be possible due to asymmetry of opinion, although that isn’t necessarily a disqualifier.  Conventionally, a “troll” is not just someone who shows up only for argument, rather a person who shows up to derail argument.  It would\nappear\nthat Vox means to argue, since his posts are so often provocative, yet when engaged he often seems too ready just to score a couple points, declare victory, and get out.  There are other people here who seem genuinely interested in argument.\nAgnosticon first fails to distinguish between legitimate and substantive arguments versus those that are obviously stupid and fallacious in considering whether the Dread Ilk are interested in arguments in general.  He seems to be unaware that I have written a book in which dozens of popular atheist arguments are conclusively demolished and have addressed many more on this blog over the past four years, so when yet another clueless college kid shows up and starts spouting off half-understood atheist pablum that everyone has seen before, it is hardly a mystery that he meets with nothing but ridicule, especially when he presents his outdated arguments in an obnoxious and confrontational manner.  And why would they be ever be interested in taking such interlocutors seriously, especially when over the last eight years, we have seen this sort of individual lie, move the goalposts, refuse to admit when they are conclusively proved wrong, and otherwise behave in an intellectually unserious manner?\nIn the very thread in which Agnosticon commented, we have the example of Dan, who cannot understand that utilitarian philosophy is not “a rational basis in fact”.  Does he honestly recommend that such an individual be taken seriously?  And if so, how?\nThe second thing that Agnosticon fails to recognize is that there is substantial proof right here on this blog that I am genuinely interested in argument of a sufficiently high quality.  I have zero interest in arguing for the sake of arguing, much less wasting my time on people who are insufficiently intelligent to say anything new or interesting.  It’s not a case of scoring a couple of points, declaring victory, and getting out, it is simply about qualifying potential opponents.  If a person is incapable of avoiding very basic logical and factual errors, or if it is apparent that they rely upon the usual chicanery such as redefining basic terms and so forth, then there is absolutely no chance they are going to present an argument that I can’t shred with ease.  But rather than refusing to give everyone a shot, I prefer to permit anyone one or two opportunities to say something interesting or effective.  If they want to waste that opportunity on a trivial drive-by comment or two, that’s their choice.\nIf they can’t deliver a substantive argument, or if I can identify their glaring mistakes – or worse, intellectual dishonesty – at first glance, then they’re done as far as I’m concerned.  I already know how the prosecution will proceed and it’s all over but for the formalities even before it has begun.  And really, considering the number of comments and emails I receive, that’s the only way it is possible to allow pretty much everyone who wants one a shot.\nSo don’t waste it on nonsensical blather if you wish me, or anyone else, to take you seriously.  I’m quite willing to give Agnosticon the opportunity to present a case for his Singulatarianism, or what I described in\nThe Irrational Atheist\nas apocalyptic techno-heresy, even though he has one strike against him for having demonstrated an inability to distinguish between logical and philosophical integrity and logical and philosophical necessity.  But if he can’t present one, that’s hardly reflective of my unwillingness to engage in substantive argument.\nIt’s pretty simple.  Right now I owe Dominic my next entry in our ongoing debate on the existence of God.  Once that concludes, whenever that may be, I’m sure I’ll engage someone else in a substantive and detailed debate.  Debt deflation might be a good one.  But I’m simply not going to focus any time or attention on commenters who publicly demonstrate that they have neither the intelligence nor the intellectual integrity to present a challenge that is both substantive and interesting.  Of course, the primary purpose of this blog is for me to amuse myself.  Everything else is secondary; I’m pleased that some of you find it worth reading on a regular basis, but that’s not its\nraison d’etre\n.",
  "tags": [
    "mailvox",
    "philosophy"
  ],
  "categories": [],
  "sitemap_lastmod": "2012-01-23T21:30:00+00:00"
}