{
  "url": "https://voxday.net/2012/01/10/new-sec-champions/",
  "scraped_at": "2025-12-14T04:44:07.543047",
  "title": "New SEC champions!",
  "date_display": "January 10, 2012",
  "date_iso": "2012-01-10T21:30:00+00:00",
  "date_from_url": "2012-01-10",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>Apparently Alabama beat LSU last night in the second SEC championship game of the season or something.  I don’t know, because like most of you, I didn’t bother to watch it.  But it is certainly amazing to see a conference hold two championship games in a single year; what a pity there was no national championship game because neither Alabama nor LSU proved they could beat the Big 12 or Big 10 champions.  Alabama has not proved it could beat the Pac 12 champion. LSU beat Oregon, but that was at the beginning of the season, long before LSU beat Alabama.</p><p>Yes, the SEC is the best conference, and yes, both LSU and Alabama are good teams, and perhaps both of them should be able to beat Oklahoma State, Wisconsin, and Oregon.  Of course, Pittsburgh was supposed to be able to beat Denver, and a few years ago, Ohio State was supposed to be able to beat Florida.  But <i>that’s why you play the games!</i> Now all we know that LSU can beat Alabama and Alabama can beat LSU.  In the immortal words of Derrick Coleman, “whoopty damn do”.</p><p>About the only good thing about this BCS debacle is that the college football world is so dissatisfied with it that there is little chance they’ll be able to put off a playoff system much longer.  And in closing, I quote <a href=\"http://www.grantland.com/blog/the-triangle/post/_/id/13677/bcs-national-championship-game-what-the-hell\">this Oklahoma State fan</a>:</p><p><i>“What in the hell, people? I bring you many earnest what in the hells. That was it? That was the immovable wall of Technicolor fearsome that Oklahoma State and Stanford had no chance of competing against? That was your big reveal? We are now in the position of crowning a national champion that couldn’t convert the extra point after its solitary touchdown of the game. You’re seriously telling me that our poor little old Big 12/Pac-12 selves didn’t deserve a glance at this business?”</i></p><p>UPDATE: Just to prove that playing a second conference championship game instead of a national championship game was as stupid as I said it would be, here is the empirical evidence:</p><blockquote><p>The nation largely ignored a rematch of SEC foes, giving the BCS national championship its lowest overnight rating ever.  The overnight ratings for Monday’s BCS Championship Game are in and they are not good. In fact, they are historically bad, as Alabama’s 21-0 win over SEC-rival LSU drew a 13.8 rating on ESPN (via LA Times). That was the lowest rating championship game in the 14-year history of the BCS.</p></blockquote><p>Intra-conference “national championship” games are a horrendous idea and will clearly harm NCAA football.  Historically bad ratings at a time when the NFL is racking up historically high ratings strongly indicates that there is something rotten in the structure of college football.  The BCS absolutely should have banned teams that did not win their conference championship.</p></div>",
  "content_text": "Apparently Alabama beat LSU last night in the second SEC championship game of the season or something.  I don’t know, because like most of you, I didn’t bother to watch it.  But it is certainly amazing to see a conference hold two championship games in a single year; what a pity there was no national championship game because neither Alabama nor LSU proved they could beat the Big 12 or Big 10 champions.  Alabama has not proved it could beat the Pac 12 champion. LSU beat Oregon, but that was at the beginning of the season, long before LSU beat Alabama.\nYes, the SEC is the best conference, and yes, both LSU and Alabama are good teams, and perhaps both of them should be able to beat Oklahoma State, Wisconsin, and Oregon.  Of course, Pittsburgh was supposed to be able to beat Denver, and a few years ago, Ohio State was supposed to be able to beat Florida.  But\nthat’s why you play the games!\nNow all we know that LSU can beat Alabama and Alabama can beat LSU.  In the immortal words of Derrick Coleman, “whoopty damn do”.\nAbout the only good thing about this BCS debacle is that the college football world is so dissatisfied with it that there is little chance they’ll be able to put off a playoff system much longer.  And in closing, I quote\nthis Oklahoma State fan\n:\n“What in the hell, people? I bring you many earnest what in the hells. That was it? That was the immovable wall of Technicolor fearsome that Oklahoma State and Stanford had no chance of competing against? That was your big reveal? We are now in the position of crowning a national champion that couldn’t convert the extra point after its solitary touchdown of the game. You’re seriously telling me that our poor little old Big 12/Pac-12 selves didn’t deserve a glance at this business?”\nUPDATE: Just to prove that playing a second conference championship game instead of a national championship game was as stupid as I said it would be, here is the empirical evidence:\nThe nation largely ignored a rematch of SEC foes, giving the BCS national championship its lowest overnight rating ever.  The overnight ratings for Monday’s BCS Championship Game are in and they are not good. In fact, they are historically bad, as Alabama’s 21-0 win over SEC-rival LSU drew a 13.8 rating on ESPN (via LA Times). That was the lowest rating championship game in the 14-year history of the BCS.\nIntra-conference “national championship” games are a horrendous idea and will clearly harm NCAA football.  Historically bad ratings at a time when the NFL is racking up historically high ratings strongly indicates that there is something rotten in the structure of college football.  The BCS absolutely should have banned teams that did not win their conference championship.",
  "tags": [
    "sports"
  ],
  "categories": [],
  "sitemap_lastmod": "2012-01-10T21:30:00+00:00"
}