{
  "url": "https://voxday.net/2012/01/23/post-christian-nirvana-awaits/",
  "scraped_at": "2025-12-14T04:45:20.721291",
  "title": "Post-Christian nirvana awaits",
  "date_display": "January 23, 2012",
  "date_iso": "2012-01-23T14:00:00+00:00",
  "date_from_url": "2012-01-23",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>You would think that the realization of <a href=\"http://www.telegraph.co.uk/news/worldnews/asia/indonesia/9027145/Atheist-Indonesian-in-protective-custody-after-being-beaten-by-mob.html\">what will fill the post-Christian void</a> is significantly more intrinsically anti-atheistic religion would serve as a check on the atheist hatred for Christianity.  But that would require atheists to be rational, and as I have demonstrated in some detail, that simply isn’t the case:</p><blockquote><p>31-year-old Alexander Aan faces a maximum prison sentence of five years for posting “God does not exist” on Facebook. The civil servant was attacked and beaten by an angry mob of dozens who entered his government office at the Dharmasraya Development Planning Board on Wednesday. The Indonesian man was taken into protective police custody Friday since he was afraid of further physical assault….</p><p>Atheism is a violation of Indonesian law under the founding principles of the country. Indonesia, the world’s most populous Muslim nation, recognises the right to practice six religions in total: Islam, Protestant, Catholic, Hindu, Buddhism and Confucianism. Atheism is, however, illegal. According to Indonesian criminal law, anyone who tries to stop others believing in a faith could face up to five years in jail for blasphemy.</p></blockquote><p>Atheists point to the inevitable triumph of atheism because a few very small European countries with birth rates below the replacement level now have statistically significant atheist minorities.  (None have an atheist majority).  Meanwhile, Islamic nations with populations nearly equal to <i>the entire European Union</i> with birth rates nearly twice those of Sweden, France, and other European countries are, unlike historic Christianity, actively prosecuting atheists.</p><p>And from this evidence, the atheist somehow manages to conclude that he is not only winning, but that the triumph of atheism is inevitable.  It would appear that the godless must subscribe to the Charlie Sheen school of data analysis.  It is little wonder their arguments against the existence of God are so uniformly inept.</p></div>",
  "content_text": "You would think that the realization of\nwhat will fill the post-Christian void\nis significantly more intrinsically anti-atheistic religion would serve as a check on the atheist hatred for Christianity.  But that would require atheists to be rational, and as I have demonstrated in some detail, that simply isn’t the case:\n31-year-old Alexander Aan faces a maximum prison sentence of five years for posting “God does not exist” on Facebook. The civil servant was attacked and beaten by an angry mob of dozens who entered his government office at the Dharmasraya Development Planning Board on Wednesday. The Indonesian man was taken into protective police custody Friday since he was afraid of further physical assault….\nAtheism is a violation of Indonesian law under the founding principles of the country. Indonesia, the world’s most populous Muslim nation, recognises the right to practice six religions in total: Islam, Protestant, Catholic, Hindu, Buddhism and Confucianism. Atheism is, however, illegal. According to Indonesian criminal law, anyone who tries to stop others believing in a faith could face up to five years in jail for blasphemy.\nAtheists point to the inevitable triumph of atheism because a few very small European countries with birth rates below the replacement level now have statistically significant atheist minorities.  (None have an atheist majority).  Meanwhile, Islamic nations with populations nearly equal to\nthe entire European Union\nwith birth rates nearly twice those of Sweden, France, and other European countries are, unlike historic Christianity, actively prosecuting atheists.\nAnd from this evidence, the atheist somehow manages to conclude that he is not only winning, but that the triumph of atheism is inevitable.  It would appear that the godless must subscribe to the Charlie Sheen school of data analysis.  It is little wonder their arguments against the existence of God are so uniformly inept.",
  "tags": [
    "atheism"
  ],
  "categories": [],
  "sitemap_lastmod": "2012-01-23T14:00:00+00:00"
}