{
  "url": "https://voxday.net/2012/01/01/reading-list-2011/",
  "scraped_at": "2025-12-14T04:43:19.830765",
  "title": "Reading List 2011",
  "date_display": "January 1, 2012",
  "date_iso": "2012-01-01T15:30:00+00:00",
  "date_from_url": "2012-01-01",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>The most interesting book of the 69 I read this year was Victor Hugo’s <i>The History of a Crime</i>, with Neal Stephenson’s <i>Reamde </i>a close second.  (His <i>Anathem </i>is more ambitious and in some ways even more interesting, but falls apart so badly towards the end that I can’t give it primacy of position.)  The worst thing I read this year was without question <i>Plato and the Spell of the State</i>, a convoluted quasi-academic paper by Patrick Tinsley, who could probably be committed for life on the sole basis of the evidence of that paper.  I almost gave it five stars because it is so insane that it is almost worth reading just for the sheer lunacy.</p><p><b>FIVE STARS</b><br> The Republic, Cicero<br> A Game of Thrones, George R.R. Martin<br> A Clash of Kings, George R.R. Martin<br> Married Man Sex Life Primer, Athol Kay<br> Anathem, Neal Stephenson<br> Reamde, Neal Stephenson<br> The History of a Crime, Victor Hugo<br> Embassytown, China Mieville<br> On Literature, Umberto Eco</br></br></br></br></br></br></br></br></br></p><p><b>FOUR STARS</b><br> The Book of Basketball, Bill Simmons<br> Tom Brown’s Schooldays, Thomas Hughes<br> The Gold Bat, PG Wodehouse<br> The Head of Kay’s, PG Wodehouse<br> Farmer in the Sky, Robert Heinlein<br> A Man of Means, PG Wodehouse<br> Psmith in the City, PG Wodehouse<br> Psmith, Journalist, PG Wodehouse<br> A Prefect’s Uncle, P.G. Wodehouse<br> Something New, PG Wodehouse<br> Thus Spake Zarathustra, Friedrich Nietzsche<br> The Heroes, Joe Abercrombie<br> A Storm of Swords, George R.R. Martin<br> Stupefying Stories, Nov 2011, Rampant Loon<br> All Hell Let Loose, Max Hastings<br> The Shadow Over Innsmouth, H.P. Lovecraft<br> The Darkness That Comes Before, R. Scott Bakker<br> The Warrior-Prophet, R. Scott Bakker<br> Podkayne of Mars, Robert Heinlein<br> The Desert of Souls, Howard Jones<br> The Mask of Sanity, Hervey Cleckley<br> The Laws, Cicero</br></br></br></br></br></br></br></br></br></br></br></br></br></br></br></br></br></br></br></br></br></br></p><p><b>THREE STARS</b><br> Stupefying Stories, Oct 2011, Rampant Loon<br> The Blade Itself, Joe Abercrombie<br> Before They Are Hanged, Joe Abercrombie<br> The Last Argument of Kings, Joe Abercrombie<br> Secret Adversary, Agatha Christie<br> Small Favor, Jim Butcher<br> Turn Coat, Jim Butcher<br> Changes, Jim Butcher<br> Cursor’s Fury, Jim Butcher<br> Captain’s Fury, Jim Butcher<br> Princep’s Fury, Jim Butcher<br> First Lord’s Fury, Jim Butcher<br> The Influence of Sea Power upon History, A.T. Mahan<br> A Feast for Crows, George R.R. Martin<br> The Face of Battle, John Keegan<br> Emile and the Dutchman, Joel Rosenberg<br> Great Wars and Great Leaders, Ralph Raico<br> A Night in the Lonesome October, Roger Zelazny<br> World Without End, Sean Russell<br> Unicorn Variations, Roger Zelazny<br> Ghost Story, Jim Butcher<br> Best Military Science Fiction of the 20th Century, Harry Turtledove<br> Prince of Thorns, Mark Lawrence<br> The Silver Mage, Katherine Kerr</br></br></br></br></br></br></br></br></br></br></br></br></br></br></br></br></br></br></br></br></br></br></br></br></p><p><b>TWO STARS</b><br> Snuff, Terry Pratchett<br> Moral Minds, Marc Hauser<br> Lessons of the War with Spain, A.T. Mahan<br> The Thousand-Fold Thought, R. Scott Bakker<br> Definitely Dead, Charlaine Harris<br> All Together Dead, Charlaine Harris<br> From Dead to Worse, Charlaine Harris<br> Dead and Gone, Charlaine Harris<br> Dead in the Family, Charlaine Harris<br> Dead Reckoning, Charlaine Harris<br/> Zero History, William Gibson</br></br></br></br></br></br></br></br></br></br></p><p><b>ONE STAR</b><br/> A Dance with Dragons, George R.R. Martin<br/> Outlines of Pyrrhonism, Sextus Empiricus<br/> Plato and the Spell of the State, Patrick Tinsley</p></div>",
  "content_text": "The most interesting book of the 69 I read this year was Victor Hugo’s\nThe History of a Crime\n, with Neal Stephenson’s\nReamde\na close second.  (His\nAnathem\nis more ambitious and in some ways even more interesting, but falls apart so badly towards the end that I can’t give it primacy of position.)  The worst thing I read this year was without question\nPlato and the Spell of the State\n, a convoluted quasi-academic paper by Patrick Tinsley, who could probably be committed for life on the sole basis of the evidence of that paper.  I almost gave it five stars because it is so insane that it is almost worth reading just for the sheer lunacy.\nFIVE STARS\nThe Republic, Cicero\nA Game of Thrones, George R.R. Martin\nA Clash of Kings, George R.R. Martin\nMarried Man Sex Life Primer, Athol Kay\nAnathem, Neal Stephenson\nReamde, Neal Stephenson\nThe History of a Crime, Victor Hugo\nEmbassytown, China Mieville\nOn Literature, Umberto Eco\nFOUR STARS\nThe Book of Basketball, Bill Simmons\nTom Brown’s Schooldays, Thomas Hughes\nThe Gold Bat, PG Wodehouse\nThe Head of Kay’s, PG Wodehouse\nFarmer in the Sky, Robert Heinlein\nA Man of Means, PG Wodehouse\nPsmith in the City, PG Wodehouse\nPsmith, Journalist, PG Wodehouse\nA Prefect’s Uncle, P.G. Wodehouse\nSomething New, PG Wodehouse\nThus Spake Zarathustra, Friedrich Nietzsche\nThe Heroes, Joe Abercrombie\nA Storm of Swords, George R.R. Martin\nStupefying Stories, Nov 2011, Rampant Loon\nAll Hell Let Loose, Max Hastings\nThe Shadow Over Innsmouth, H.P. Lovecraft\nThe Darkness That Comes Before, R. Scott Bakker\nThe Warrior-Prophet, R. Scott Bakker\nPodkayne of Mars, Robert Heinlein\nThe Desert of Souls, Howard Jones\nThe Mask of Sanity, Hervey Cleckley\nThe Laws, Cicero\nTHREE STARS\nStupefying Stories, Oct 2011, Rampant Loon\nThe Blade Itself, Joe Abercrombie\nBefore They Are Hanged, Joe Abercrombie\nThe Last Argument of Kings, Joe Abercrombie\nSecret Adversary, Agatha Christie\nSmall Favor, Jim Butcher\nTurn Coat, Jim Butcher\nChanges, Jim Butcher\nCursor’s Fury, Jim Butcher\nCaptain’s Fury, Jim Butcher\nPrincep’s Fury, Jim Butcher\nFirst Lord’s Fury, Jim Butcher\nThe Influence of Sea Power upon History, A.T. Mahan\nA Feast for Crows, George R.R. Martin\nThe Face of Battle, John Keegan\nEmile and the Dutchman, Joel Rosenberg\nGreat Wars and Great Leaders, Ralph Raico\nA Night in the Lonesome October, Roger Zelazny\nWorld Without End, Sean Russell\nUnicorn Variations, Roger Zelazny\nGhost Story, Jim Butcher\nBest Military Science Fiction of the 20th Century, Harry Turtledove\nPrince of Thorns, Mark Lawrence\nThe Silver Mage, Katherine Kerr\nTWO STARS\nSnuff, Terry Pratchett\nMoral Minds, Marc Hauser\nLessons of the War with Spain, A.T. Mahan\nThe Thousand-Fold Thought, R. Scott Bakker\nDefinitely Dead, Charlaine Harris\nAll Together Dead, Charlaine Harris\nFrom Dead to Worse, Charlaine Harris\nDead and Gone, Charlaine Harris\nDead in the Family, Charlaine Harris\nDead Reckoning, Charlaine Harris\nZero History, William Gibson\nONE STAR\nA Dance with Dragons, George R.R. Martin\nOutlines of Pyrrhonism, Sextus Empiricus\nPlato and the Spell of the State, Patrick Tinsley",
  "tags": [
    "Black Gate",
    "books"
  ],
  "categories": [],
  "sitemap_lastmod": "2012-01-01T15:30:00+00:00"
}