{
  "url": "https://voxday.net/2012/01/06/regulation-doesnt-work/",
  "scraped_at": "2025-12-14T04:43:41.840440",
  "title": "Regulation doesn’t work",
  "date_display": "January 6, 2012",
  "date_iso": "2012-01-06T10:04:00+00:00",
  "date_from_url": "2012-01-06",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>Those who put their faith in government control of society always turn to the same solution when it is pointed out that people simply don’t follow government dictates because their behavior has been dictated.  But <a href=\"http://www.telegraph.co.uk/education/educationnews/8995377/Schools-bribing-pupils-to-cheat-Ofsted-inspections.html\">regulation never creates compliance</a> unless it is backed up by the use of consistent and inordinate force, which is why it consistently fails.  Consider the way in which English school employees are resisting being held accountable for their failing educational products:</p><blockquote><p>A report published in the Times Educational Supplement on Friday outlines a number of tactics used by schools to outwit official inspectors. It was based on a TES internet forum that received 110 submissions from anonymous teachers in a month.</p><p>Cases highlighted included:</p><p>• Certain poor teachers being told to go off sick when Ofsted was due in;</p><p>• Schools sending badly behaved pupils on a trip – or telling them to take the day off – to hide them from inspectors;</p><p>• Pupils being required to learn decent lessons by heart and perform them in front of Ofsted officials;</p><p>• Top teachers from a school being put “on standby” to pose as staff at neighbouring schools “at 45 minutes’ notice”.</p><p>In 2010, a leading supply teacher, Tom Trust, told the Commons education select committee that he had been asked to take the place of teachers who had trouble controlling “terrible classes” during an inspection.</p><p>And in 2004, a secondary school in Hull was criticised after sending nine pupils on a week-long course and drafting in four teachers from another school to coincide with an Ofsted visit.</p></blockquote><p>The lesson is that you can’t take a fundamentally bad concept and fix it by regulations and inspections.  As Charles Murray has pointed out for years, the majority of the population doesn’t benefit from, isn’t interested in, and really isn’t capable of learning for learning’s sake.  Instead of admitting this and allowing parents to have free rein in deciding what, and if, their children learn anything, the government engages in a vast and expensive system that is riddled with fraud and pretense from start to finish.</p><p>The concept of mass schooling is more than 100 years out of date.  The shift from an industrial society to an information society rendered it not only irrelevant, but counterproductive.  There is simply no reason for children to sit in classrooms with thirty other children staring at a teacher and a blackboard for eight hours a day; it’s not even effective propaganda anymore.  They would learn more and get equally indoctrinated by spending an hour each day reading the New York Times and watching CNN.</p></div>",
  "content_text": "Those who put their faith in government control of society always turn to the same solution when it is pointed out that people simply don’t follow government dictates because their behavior has been dictated.  But\nregulation never creates compliance\nunless it is backed up by the use of consistent and inordinate force, which is why it consistently fails.  Consider the way in which English school employees are resisting being held accountable for their failing educational products:\nA report published in the Times Educational Supplement on Friday outlines a number of tactics used by schools to outwit official inspectors. It was based on a TES internet forum that received 110 submissions from anonymous teachers in a month.\nCases highlighted included:\n• Certain poor teachers being told to go off sick when Ofsted was due in;\n• Schools sending badly behaved pupils on a trip – or telling them to take the day off – to hide them from inspectors;\n• Pupils being required to learn decent lessons by heart and perform them in front of Ofsted officials;\n• Top teachers from a school being put “on standby” to pose as staff at neighbouring schools “at 45 minutes’ notice”.\nIn 2010, a leading supply teacher, Tom Trust, told the Commons education select committee that he had been asked to take the place of teachers who had trouble controlling “terrible classes” during an inspection.\nAnd in 2004, a secondary school in Hull was criticised after sending nine pupils on a week-long course and drafting in four teachers from another school to coincide with an Ofsted visit.\nThe lesson is that you can’t take a fundamentally bad concept and fix it by regulations and inspections.  As Charles Murray has pointed out for years, the majority of the population doesn’t benefit from, isn’t interested in, and really isn’t capable of learning for learning’s sake.  Instead of admitting this and allowing parents to have free rein in deciding what, and if, their children learn anything, the government engages in a vast and expensive system that is riddled with fraud and pretense from start to finish.\nThe concept of mass schooling is more than 100 years out of date.  The shift from an industrial society to an information society rendered it not only irrelevant, but counterproductive.  There is simply no reason for children to sit in classrooms with thirty other children staring at a teacher and a blackboard for eight hours a day; it’s not even effective propaganda anymore.  They would learn more and get equally indoctrinated by spending an hour each day reading the New York Times and watching CNN.",
  "tags": [
    "education"
  ],
  "categories": [],
  "sitemap_lastmod": "2012-01-06T10:04:00+00:00"
}