{
  "url": "https://voxday.net/2012/01/03/significance-of-iowa/",
  "scraped_at": "2025-12-14T04:43:29.023296",
  "title": "The significance of Iowa",
  "date_display": "January 3, 2012",
  "date_iso": "2012-01-03T12:29:00+00:00",
  "date_from_url": "2012-01-03",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>As we all know, the result of the Iowa caucuses will either be seen as a conclusive expression of the voice of the people – if Romney wins – or a totally meaningless manipulation of a minor and outdated aspect of the nomination process that really needs to be changed – if Paul wins.  I shall be very surprised if all the belated conservative drum-banging on Santorum’s behalf has any impact, but then, it appears to be his turn at the Romney-alternative-who-is-not-Ron-Paul wheel.</p><p>But it will be illuminating to see how many Iowans understand that their choice is between the Bank Party and the American Party.  The Bank Party, which includes both Democratic and Republican factions, is fundamentally globalist at its core and has no real concern for American interests.  Romney, Gingrich, Obama, Santorum, Perry, Santorum, Cain, and even Bachmann are all representatives of the Bank Party.  As Ron Paul himself <a href=\"http://www.latimes.com/news/politics/la-pn-paul-packed-house-while-supporters-expect-victory-20120102,0,1067598.story\">correctly pointed out</a>: <i>“The others represent the status quo, variation of the status quo.”</i></p><p>Ron Paul is the only Republican candidate who actually represents America in its traditional and Constitutional form, which of course is why he is being attacked from the mainstream “left” and “right” alike.  And if Iowans decide that they are more inclined to support the Bank Party, so be it.  They will receive the government they have chosen, which is to say more war, more government spending, more government expansion, and more rule on behalf of the big banks.  If you want the status quo, then by all means, vote for Romney, or Gingrich, or Santorum, or Obama.</p><p>As Americans, we are fortunate to actually have been presented with this choice, as most people throughout history have not been given one.  Of course, the fact that we have a choice doesn’t meant that we won’t make the correct one.</p><p>If you’re a reader of this blog and you are in Iowa, I would strongly encourage you to show up at your local caucus and cast a vote for Ron Paul’s nomination.  I recommend this because I suspect you may well regret knowing that you did not do so when you had the chance to give the rest of your fellow Americans the same opportunity to make a choice between America and the Bank Party.</p></div>",
  "content_text": "As we all know, the result of the Iowa caucuses will either be seen as a conclusive expression of the voice of the people – if Romney wins – or a totally meaningless manipulation of a minor and outdated aspect of the nomination process that really needs to be changed – if Paul wins.  I shall be very surprised if all the belated conservative drum-banging on Santorum’s behalf has any impact, but then, it appears to be his turn at the Romney-alternative-who-is-not-Ron-Paul wheel.\nBut it will be illuminating to see how many Iowans understand that their choice is between the Bank Party and the American Party.  The Bank Party, which includes both Democratic and Republican factions, is fundamentally globalist at its core and has no real concern for American interests.  Romney, Gingrich, Obama, Santorum, Perry, Santorum, Cain, and even Bachmann are all representatives of the Bank Party.  As Ron Paul himself\ncorrectly pointed out\n:\n“The others represent the status quo, variation of the status quo.”\nRon Paul is the only Republican candidate who actually represents America in its traditional and Constitutional form, which of course is why he is being attacked from the mainstream “left” and “right” alike.  And if Iowans decide that they are more inclined to support the Bank Party, so be it.  They will receive the government they have chosen, which is to say more war, more government spending, more government expansion, and more rule on behalf of the big banks.  If you want the status quo, then by all means, vote for Romney, or Gingrich, or Santorum, or Obama.\nAs Americans, we are fortunate to actually have been presented with this choice, as most people throughout history have not been given one.  Of course, the fact that we have a choice doesn’t meant that we won’t make the correct one.\nIf you’re a reader of this blog and you are in Iowa, I would strongly encourage you to show up at your local caucus and cast a vote for Ron Paul’s nomination.  I recommend this because I suspect you may well regret knowing that you did not do so when you had the chance to give the rest of your fellow Americans the same opportunity to make a choice between America and the Bank Party.",
  "tags": [
    "politics"
  ],
  "categories": [],
  "sitemap_lastmod": "2012-01-03T12:29:00+00:00"
}