{
  "url": "https://voxday.net/2012/01/02/so-much-for-democratic-revolution/",
  "scraped_at": "2025-12-14T04:43:27.171670",
  "title": "So much for the democratic revolution",
  "date_display": "January 2, 2012",
  "date_iso": "2012-01-02T18:30:00+00:00",
  "date_from_url": "2012-01-02",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>I find it amusing that the very democratic revolutionaries who support the open immigration of Muslims and other third-worlders to the USA as well as the forcible imposition of democracy throughout the world expect us to be shocked and horrified <a href=\"http://www.nationalreview.com/corner/286938/muslim-brotherhood-renounce-peace-pact-israel-referendum-andrew-c-mccarthy\">when democracy actually triumphs</a>:</p><blockquote><p>Mindful of its lopsided electoral triumph in Egypt, which has been so enthusiastically welcomed by the Obama administration and top Democratic emissary John Kerry, the Muslim Brotherhood has announced plans to submit the Camp David Accords — the treaty that has kept the peace between Egypt and Israel for over 30 years — to a popular vote.</p></blockquote><p>The amazing thing is that Egypt is objectively more democratic, and its Muslim Brotherhood government is objectively more legitimate, than most of the governments in the European Union.  If the world democratic revolutionaries were genuinely more committed to democracy than to their bizarre <i>Israel Uber Alles</i> policy, they would be celebrating the fact that Egypt’s government is proving itself to be more democratic and more respectful of the will of its people than the former European democracies, or even, in some cases, the United States itself.</p><p>But, of course, they’re not, and we always knew they weren’t from the start.</p></div>",
  "content_text": "I find it amusing that the very democratic revolutionaries who support the open immigration of Muslims and other third-worlders to the USA as well as the forcible imposition of democracy throughout the world expect us to be shocked and horrified\nwhen democracy actually triumphs\n:\nMindful of its lopsided electoral triumph in Egypt, which has been so enthusiastically welcomed by the Obama administration and top Democratic emissary John Kerry, the Muslim Brotherhood has announced plans to submit the Camp David Accords — the treaty that has kept the peace between Egypt and Israel for over 30 years — to a popular vote.\nThe amazing thing is that Egypt is objectively more democratic, and its Muslim Brotherhood government is objectively more legitimate, than most of the governments in the European Union.  If the world democratic revolutionaries were genuinely more committed to democracy than to their bizarre\nIsrael Uber Alles\npolicy, they would be celebrating the fact that Egypt’s government is proving itself to be more democratic and more respectful of the will of its people than the former European democracies, or even, in some cases, the United States itself.\nBut, of course, they’re not, and we always knew they weren’t from the start.",
  "tags": [
    "immigration",
    "war"
  ],
  "categories": [],
  "sitemap_lastmod": "2012-01-02T18:30:00+00:00"
}