{
  "url": "https://voxday.net/2012/01/09/tebow/",
  "scraped_at": "2025-12-14T04:43:54.701904",
  "title": "TEBOW!",
  "date_display": "January 9, 2012",
  "date_iso": "2012-01-09T01:23:00+00:00",
  "date_from_url": "2012-01-09",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>Unbelievable.  Absolutely unbelievable.  I really thought Denver had given a very winnable game away, between McGahee’s fumble as the Broncos were driving into range for a putaway field goal, then Champ Bailey dropped a relatively easy interception to win the game.  When Tebow missed a wide open receiver on third-and-eight after a <i>horrendous</i> no-call on a blatant facemask, it looked as if events and the referees were conspiring to end The Miracle of Tebow.</p><p>But then the Denver defense finally stepped up and made a play, sacking Roethlisberger once, then strip-sacking him to force overtime.  Mike Tomlin showed his yellow belly by not letting Suisham try for the 69-yard FG with three seconds left – I have no doubts that Fox would have given Prater a shot – and accepting overtime instead.  That set the stage for the lightning strike… game over.</p><p>Considering Tebow’s first start against Miami, to say nothing of the disastrous last three weeks, it seems almost impossible for any knowledgeable football fan to not interpret what was not only a Denver victory, but Tim Tebow beating the league’s top-rated defense <i>with his arm</i>, as incontrovertible proof of the existence of God.</p><p>316 yards and two touchdowns in the air, 50 yards and one touchdown on the ground.  I saw it and I still don’t believe it.  As ProFootballTalk concluded: “If someone was writing this stuff into a Tim Tebow movie, they would have been fired by now because it all sounds too unbelievable.”</p></div>",
  "content_text": "Unbelievable.  Absolutely unbelievable.  I really thought Denver had given a very winnable game away, between McGahee’s fumble as the Broncos were driving into range for a putaway field goal, then Champ Bailey dropped a relatively easy interception to win the game.  When Tebow missed a wide open receiver on third-and-eight after a\nhorrendous\nno-call on a blatant facemask, it looked as if events and the referees were conspiring to end The Miracle of Tebow.\nBut then the Denver defense finally stepped up and made a play, sacking Roethlisberger once, then strip-sacking him to force overtime.  Mike Tomlin showed his yellow belly by not letting Suisham try for the 69-yard FG with three seconds left – I have no doubts that Fox would have given Prater a shot – and accepting overtime instead.  That set the stage for the lightning strike… game over.\nConsidering Tebow’s first start against Miami, to say nothing of the disastrous last three weeks, it seems almost impossible for any knowledgeable football fan to not interpret what was not only a Denver victory, but Tim Tebow beating the league’s top-rated defense\nwith his arm\n, as incontrovertible proof of the existence of God.\n316 yards and two touchdowns in the air, 50 yards and one touchdown on the ground.  I saw it and I still don’t believe it.  As ProFootballTalk concluded: “If someone was writing this stuff into a Tim Tebow movie, they would have been fired by now because it all sounds too unbelievable.”",
  "tags": [
    "sports"
  ],
  "categories": [],
  "sitemap_lastmod": "2012-01-09T01:23:00+00:00"
}