{
  "url": "https://voxday.net/2012/01/04/time-capsule/",
  "scraped_at": "2025-12-14T04:43:34.506029",
  "title": "The time capsule",
  "date_display": "January 4, 2012",
  "date_iso": "2012-01-04T14:30:00+00:00",
  "date_from_url": "2012-01-04",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>I was catching up with my old bandmates after writing the first two posts about the band’s history, and I learned, to my delight, that Mike not only saved all the old demos, but had even converted the old cassettes to digital as well.  The quality is pretty low, but you’re interested in unreleased 21-year old music, you can find a download link to <a href=\"http://alphagameplan.blogspot.com/2012/01/primordial-game.html\">an MP3 of Sex Me Up</a>, the song mentioned <a href=\"http://www.milobookclub.com/2011/12/31/true-and-obscure-history-of-psykosonik_31/\">in the second part of the True and Obscure History</a>, at Alpha Game along with a Game-related take on it.  It was on our three-song demo and was very popular with the crowd at The Perimeter, but didn’t end up making the album since we’d moved too far into techno-rave and too far away from rock during the recording process, so it was never released and I hadn’t heard it since 1994.</p><p>I’m particularly excited about Mike’s little trove because there was one song that I didn’t have on tape and thought was lost forever.  Fortunately, Mike saved it too, and it’s even more awesome than I remembered.  But more about that in the next installment.</p></div>",
  "content_text": "I was catching up with my old bandmates after writing the first two posts about the band’s history, and I learned, to my delight, that Mike not only saved all the old demos, but had even converted the old cassettes to digital as well.  The quality is pretty low, but you’re interested in unreleased 21-year old music, you can find a download link to\nan MP3 of Sex Me Up\n, the song mentioned\nin the second part of the True and Obscure History\n, at Alpha Game along with a Game-related take on it.  It was on our three-song demo and was very popular with the crowd at The Perimeter, but didn’t end up making the album since we’d moved too far into techno-rave and too far away from rock during the recording process, so it was never released and I hadn’t heard it since 1994.\nI’m particularly excited about Mike’s little trove because there was one song that I didn’t have on tape and thought was lost forever.  Fortunately, Mike saved it too, and it’s even more awesome than I remembered.  But more about that in the next installment.",
  "tags": [
    "music"
  ],
  "categories": [],
  "sitemap_lastmod": "2012-01-04T14:30:00+00:00"
}