{
  "url": "https://voxday.net/2012/01/30/true-and-obscure-history-of-psykosonik/",
  "scraped_at": "2025-12-14T04:46:02.268277",
  "title": "The True and Obscure History of Psykosonik, part III",
  "date_display": "January 30, 2012",
  "date_iso": "2012-01-30T14:00:00+00:00",
  "date_from_url": "2012-01-30",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>The enthusiastic response to our first collaboration, <i>Sex Me Up</i>, made Paul realize that somehow, we had inadvertently laid what could be the foundation of a pretty good band.  The DJ at <i>The Perimeter </i>played the song every Friday and Saturday night at the height of the evening, and within two weeks, people knew the lyrics and were shouting out the climactic phrases.  Of course, we didn’t have a name for the band, we didn’t have any other songs, and we didn’t have the ability to play anywhere even if we’d been asked given the fact that it was a two-man band, only one of whom had any significant musical talent.  Fortunately, he had enough for the two of us.</p><p>Paul was just getting into reading <i>Mondo 2000</i> at the time and I was a huge fan of William Gibson throughout high school and college, so it was natural that most of our ideas for a band name revolved around the cyberpunk theme, (which, strangely enough, was a neologism coined by the writer with whom I would later collaborate, Bruce Bethke).  Most of our ideas came right out of Gibson; I can remember Burning Chrome and Chrome 23 being two of the potential names discussed and rejected.  I really liked the name Mona Lisa Overdrive, but it was so obvious and recognizable that we never even considered it.  However, I did scan the cover of the paperback version, which later paid some unexpected dividends.</p><p>I think it was Paul who suggested stealing a line from our own song for the band name. In <i>Sex Me Up</i>, just before the guitar solo, by way of introducing it, I said “Go psycho sonic at the count of three.”  Paul liked the idea of using “Psycho Sonic” as a name since it was descriptive of the sound we wanted to create, combining fast dance beats, funky bass lines, rock guitar, and an aggressive attitude.  We also thought it was a pretty good description of our partnership, since he brought the Sonic while I more or less provided the Psycho.  We didn’t really have a musical model, as we both knew that the band we liked best, Duran Duran, was entirely outmoded, but to the very limited extent that we wanted to imitate anything out there, it was the EMF song <i>Unbelievable</i>. That wasn’t what we wanted to do, exactly, but it served as a useful reference point of sorts.</p><p>My one reservation about the name was that I considered Psycho Sonic to be too reminiscent of Sonic Youth, which I always thought was rather a lame name for a band, with shades of “Up With People” or “Hitler Youth”. For some reason, I never thought of Sonic the Hedgehog even though I had a Sega Genesis and the game had recently come out. But I liked the name as well as Paul’s reasoning, so we decided to put the words together and to further distinguish it by spelling it with “k” in the place of the hard “c”.  Thus Psykosonik was formed.</p><p>We knew we needed more members and more songs, so we set about finding the former and writing the latter that winter.  The second song we wrote was a bizarre melange of the cyberpunk motif and my political nihilism; it’s interesting to look back from the distance of 20 years, 10 of them spent writing national political commentary, and see what an unadulterated anarchist I was at the time.  I scribbled down some lyrics, Paul laid down a fast beat and bassline over which we recorded some vocals, and I went off to the Bay Area for two weeks in a futile, but ultimately worthwhile attempt to convince companies like Creative Labs, Diamond, and Hercules to abandon their investment into video acceleration in favor of the radical new idea of 3D hardware acceleration.</p><p>Upon my return, the first thing I did was to drive to Paul’s condo to hear what he was promising was the finished version of <a href=\"http://voxday.net/psyko/Psykosonik-Demo-DownToGround.mp3\"><i>Down to the Ground</i></a>.  The end result was even better than I had imagined, as he had thrown in a Prince-like guitar solo in at the end and the final product was even more energetic than our first song.  I particularly liked the way the sampled crowd noise abruptly cuts off at the end, making it readily apparent that it isn’t real.  We sat and listened to it five or six times in a row, when Paul mused that the two songs were so good, he thought we might be able to get a record deal on the strength of them.</p><p>Although a song named <i>Down to the Ground</i> can be found on <a href=\"http://www.amazon.com/Psykosonik/dp/B000003RFN/ref=sr_1_1?ie=UTF8&amp;qid=1327930634&amp;sr=8-1\">the first Psykosonik album</a>, it is a very, very different version than the one we originally recorded.  The album version is not a bad song, in fact, I still quite like what we usually called “the lush mix”, but in retrospect, I think it really tends to pale in comparison with raw energy of the original.</p><p>And yes, “Feel the blade of ’89” absolutely refers to the French Revolution of 1789.</p><p>The one thing we decided we absolutely needed if we were ever going to play live was a drummer; while neither of us minded electronics in the least, we both always thought it was lame when there was no visible percussion, especially for music that was going to be as percussion-heavy as ours was looking to be.  Although Paul’s younger brother Nick had been his drummer in Smilehouse, Paul said that he was really impressed with how well Nick’s friend, who was barely out of high school, had managed to blend live drums with the programmed ones when we had played at the frat party.  Apparently that is rather difficult to do well.  Since I didn’t know any drummers myself and found Mike to be likeable and extremely easy-going, I had no objections.  We invited him to join the band and he accepted.</p><p>Thanks to his boosting of our two songs at the nightclubs around town, we’d become friends with the aforementioned nightclub DJ, who was a cameraman at the local ABC news affiliate during the day.  That New Year’s Eve, Paul and I ended up going out in a group that included him and his girlfriend Giselle.  Paul noticed that Dan had some pretty serious music equipment at his place, which combined with his finely-tuned dance music sensibilities, sparked a discussion that culminated in an decision to invite him to join the band.  Psykosonik not only had two songs under its belt, it was now complete.</p></div>",
  "content_text": "The enthusiastic response to our first collaboration,\nSex Me Up\n, made Paul realize that somehow, we had inadvertently laid what could be the foundation of a pretty good band.  The DJ at\nThe Perimeter\nplayed the song every Friday and Saturday night at the height of the evening, and within two weeks, people knew the lyrics and were shouting out the climactic phrases.  Of course, we didn’t have a name for the band, we didn’t have any other songs, and we didn’t have the ability to play anywhere even if we’d been asked given the fact that it was a two-man band, only one of whom had any significant musical talent.  Fortunately, he had enough for the two of us.\nPaul was just getting into reading\nMondo 2000\nat the time and I was a huge fan of William Gibson throughout high school and college, so it was natural that most of our ideas for a band name revolved around the cyberpunk theme, (which, strangely enough, was a neologism coined by the writer with whom I would later collaborate, Bruce Bethke).  Most of our ideas came right out of Gibson; I can remember Burning Chrome and Chrome 23 being two of the potential names discussed and rejected.  I really liked the name Mona Lisa Overdrive, but it was so obvious and recognizable that we never even considered it.  However, I did scan the cover of the paperback version, which later paid some unexpected dividends.\nI think it was Paul who suggested stealing a line from our own song for the band name. In\nSex Me Up\n, just before the guitar solo, by way of introducing it, I said “Go psycho sonic at the count of three.”  Paul liked the idea of using “Psycho Sonic” as a name since it was descriptive of the sound we wanted to create, combining fast dance beats, funky bass lines, rock guitar, and an aggressive attitude.  We also thought it was a pretty good description of our partnership, since he brought the Sonic while I more or less provided the Psycho.  We didn’t really have a musical model, as we both knew that the band we liked best, Duran Duran, was entirely outmoded, but to the very limited extent that we wanted to imitate anything out there, it was the EMF song\nUnbelievable\n. That wasn’t what we wanted to do, exactly, but it served as a useful reference point of sorts.\nMy one reservation about the name was that I considered Psycho Sonic to be too reminiscent of Sonic Youth, which I always thought was rather a lame name for a band, with shades of “Up With People” or “Hitler Youth”. For some reason, I never thought of Sonic the Hedgehog even though I had a Sega Genesis and the game had recently come out. But I liked the name as well as Paul’s reasoning, so we decided to put the words together and to further distinguish it by spelling it with “k” in the place of the hard “c”.  Thus Psykosonik was formed.\nWe knew we needed more members and more songs, so we set about finding the former and writing the latter that winter.  The second song we wrote was a bizarre melange of the cyberpunk motif and my political nihilism; it’s interesting to look back from the distance of 20 years, 10 of them spent writing national political commentary, and see what an unadulterated anarchist I was at the time.  I scribbled down some lyrics, Paul laid down a fast beat and bassline over which we recorded some vocals, and I went off to the Bay Area for two weeks in a futile, but ultimately worthwhile attempt to convince companies like Creative Labs, Diamond, and Hercules to abandon their investment into video acceleration in favor of the radical new idea of 3D hardware acceleration.\nUpon my return, the first thing I did was to drive to Paul’s condo to hear what he was promising was the finished version of\nDown to the Ground\n.  The end result was even better than I had imagined, as he had thrown in a Prince-like guitar solo in at the end and the final product was even more energetic than our first song.  I particularly liked the way the sampled crowd noise abruptly cuts off at the end, making it readily apparent that it isn’t real.  We sat and listened to it five or six times in a row, when Paul mused that the two songs were so good, he thought we might be able to get a record deal on the strength of them.\nAlthough a song named\nDown to the Ground\ncan be found on\nthe first Psykosonik album\n, it is a very, very different version than the one we originally recorded.  The album version is not a bad song, in fact, I still quite like what we usually called “the lush mix”, but in retrospect, I think it really tends to pale in comparison with raw energy of the original.\nAnd yes, “Feel the blade of ’89” absolutely refers to the French Revolution of 1789.\nThe one thing we decided we absolutely needed if we were ever going to play live was a drummer; while neither of us minded electronics in the least, we both always thought it was lame when there was no visible percussion, especially for music that was going to be as percussion-heavy as ours was looking to be.  Although Paul’s younger brother Nick had been his drummer in Smilehouse, Paul said that he was really impressed with how well Nick’s friend, who was barely out of high school, had managed to blend live drums with the programmed ones when we had played at the frat party.  Apparently that is rather difficult to do well.  Since I didn’t know any drummers myself and found Mike to be likeable and extremely easy-going, I had no objections.  We invited him to join the band and he accepted.\nThanks to his boosting of our two songs at the nightclubs around town, we’d become friends with the aforementioned nightclub DJ, who was a cameraman at the local ABC news affiliate during the day.  That New Year’s Eve, Paul and I ended up going out in a group that included him and his girlfriend Giselle.  Paul noticed that Dan had some pretty serious music equipment at his place, which combined with his finely-tuned dance music sensibilities, sparked a discussion that culminated in an decision to invite him to join the band.  Psykosonik not only had two songs under its belt, it was now complete.",
  "tags": [
    "music"
  ],
  "categories": [],
  "sitemap_lastmod": "2012-01-30T14:00:00+00:00"
}