{
  "url": "https://voxday.net/2012/01/17/voltaire-had-it-wrong/",
  "scraped_at": "2025-12-14T04:44:47.864728",
  "title": "Voltaire had it wrong",
  "date_display": "January 17, 2012",
  "date_iso": "2012-01-17T18:00:00+00:00",
  "date_from_url": "2012-01-17",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>This is <i>absolutely </i>the best of all possible worlds.  You can’t possibly tell me <a href=\"http://www.ecoenquirer.com/baby-seal-man.htm\">otherwise</a>:</p><blockquote><p>Harp seal activist William Walkman has long been admired for his devotion to the cause of saving baby harp seals from their annual slaughter. For years, Walkman has lived among the seals, befriending them, and caring for the babies while the parents went off in search of food.  Walkman’s story is made even more compelling through the video he has shot of himself interacting with the seals. On one day he is seen beating off a killer whale with a pole as it attempts to catch seals, a staple of the killer whale diet. The next day he is seen trying to feed fish to the baby seals, as adult seals nervously circle him, barking and pounding their tails on the ice in their attempts to protect their babies….</p><p>The recent discovery of Walkman’s body by some fishermen, beaten to death in his sleep, was met with widespread suspicion that seal hunters had taken matters into their own hands. But an investigation by Labrador provincial police has now revealed that blood samples taken from the tails of several adult seals match Walkman’s blood.</p><p>The tragic death of Walkman is now believed to be the result of an attack by the adult seals, probably in the middle of the night while Walkman was trapped in his sleeping bag.</p></blockquote><p>Whether it is true or not, if this heart-warming story of a self-righteous activist being beaten to death in his sleep by seals doesn’t put a little spring in your step this morning, you simply cannot be considered to have evolved sufficiently claim membership in <i>homo sapiens sapiens</i>.  It’s at moments like this that I am certain Dr. Pangloss was right, for on what other worlds are men <i>beaten to death by angry seals?</i></p><p>Now, I’m not particularly a fan of slaughtering baby seals, mostly because I think they are extremely cute, but I have to admit, the fact that all that bloody seal-beating appears to have laid the foundation for the death of William Walkman does prove rather conclusively that it is all for the best.</p></div>",
  "content_text": "This is\nabsolutely\nthe best of all possible worlds.  You can’t possibly tell me\notherwise\n:\nHarp seal activist William Walkman has long been admired for his devotion to the cause of saving baby harp seals from their annual slaughter. For years, Walkman has lived among the seals, befriending them, and caring for the babies while the parents went off in search of food.  Walkman’s story is made even more compelling through the video he has shot of himself interacting with the seals. On one day he is seen beating off a killer whale with a pole as it attempts to catch seals, a staple of the killer whale diet. The next day he is seen trying to feed fish to the baby seals, as adult seals nervously circle him, barking and pounding their tails on the ice in their attempts to protect their babies….\nThe recent discovery of Walkman’s body by some fishermen, beaten to death in his sleep, was met with widespread suspicion that seal hunters had taken matters into their own hands. But an investigation by Labrador provincial police has now revealed that blood samples taken from the tails of several adult seals match Walkman’s blood.\nThe tragic death of Walkman is now believed to be the result of an attack by the adult seals, probably in the middle of the night while Walkman was trapped in his sleeping bag.\nWhether it is true or not, if this heart-warming story of a self-righteous activist being beaten to death in his sleep by seals doesn’t put a little spring in your step this morning, you simply cannot be considered to have evolved sufficiently claim membership in\nhomo sapiens sapiens\n.  It’s at moments like this that I am certain Dr. Pangloss was right, for on what other worlds are men\nbeaten to death by angry seals?\nNow, I’m not particularly a fan of slaughtering baby seals, mostly because I think they are extremely cute, but I have to admit, the fact that all that bloody seal-beating appears to have laid the foundation for the death of William Walkman does prove rather conclusively that it is all for the best.",
  "tags": [
    "freakshow"
  ],
  "categories": [],
  "sitemap_lastmod": "2012-01-17T18:00:00+00:00"
}