{
  "url": "https://voxday.net/2012/01/13/when-default-isnt-defau/",
  "scraped_at": "2025-12-14T04:44:24.070867",
  "title": "When default isn’t default",
  "date_display": "January 13, 2012",
  "date_iso": "2012-01-13T18:27:00+00:00",
  "date_from_url": "2012-01-13",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>The pretense of Greek solvency continues:</p><blockquote><p>Talks between Greece and its creditor banks to slash the country’s towering debt pile broke down on Friday, with the Greeks warning of “catastrophic” results if a deal to swap bonds is not reached soon.  The sides remain divided over the interest rate Greece will end up paying, which determines how much of a hit banks take….</p><p>The stumbling block in the negotiations was the low coupon, or interest payment, offered on the new bonds, one source familiar with the matter and one banking source said.</p><p>“The main problem was the (European Union and International Monetary Fund’s) insistence on a coupon lower than 4 percent on the new bonds,” the banking source said. It could mean an accounting loss of more than 70 percent for banks on their books, far more than the actual 50 percent cut in the original value of the old bonds laid down in the original deal.</p></blockquote><p>The reason for the charade is that the banks are desperately attempting to avoid the Greek default triggering all the credit default swaps they have made with each other.  In order to avoid a complete meltdown, it is necessary to pretend a 50% – or 70% – loss on a failure to repay a loan is somehow not a default.</p><p>To grasp how absurd this is, keep in mind that homeowners are in default when they <s>fail to make a single mortgage payment</s>fall 120 days behind on their mortgage payments, never mind when they openly admit that they can’t make interest payments without taking out a loan to do so or repay more than half the principal of the original loan.</p></div>",
  "content_text": "The pretense of Greek solvency continues:\nTalks between Greece and its creditor banks to slash the country’s towering debt pile broke down on Friday, with the Greeks warning of “catastrophic” results if a deal to swap bonds is not reached soon.  The sides remain divided over the interest rate Greece will end up paying, which determines how much of a hit banks take….\nThe stumbling block in the negotiations was the low coupon, or interest payment, offered on the new bonds, one source familiar with the matter and one banking source said.\n“The main problem was the (European Union and International Monetary Fund’s) insistence on a coupon lower than 4 percent on the new bonds,” the banking source said. It could mean an accounting loss of more than 70 percent for banks on their books, far more than the actual 50 percent cut in the original value of the old bonds laid down in the original deal.\nThe reason for the charade is that the banks are desperately attempting to avoid the Greek default triggering all the credit default swaps they have made with each other.  In order to avoid a complete meltdown, it is necessary to pretend a 50% – or 70% – loss on a failure to repay a loan is somehow not a default.\nTo grasp how absurd this is, keep in mind that homeowners are in default when they\nfail to make a single mortgage payment\nfall 120 days behind on their mortgage payments, never mind when they openly admit that they can’t make interest payments without taking out a loan to do so or repay more than half the principal of the original loan.",
  "tags": [
    "banks"
  ],
  "categories": [],
  "sitemap_lastmod": "2012-01-13T18:27:00+00:00"
}