{
  "url": "https://voxday.net/2012/01/17/when-terrorism-isnt-terroris/",
  "scraped_at": "2025-12-14T04:44:46.047270",
  "title": "When terrorism isn’t terrorism",
  "date_display": "January 17, 2012",
  "date_iso": "2012-01-17T15:56:00+00:00",
  "date_from_url": "2012-01-17",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>Jonathan Tobin tries to claim that <a href=\"http://www.commentarymagazine.com/2012/01/12/terrorism-assassination-iranian-scientists/\">killing scientists isn’t terrorism</a>:</p><blockquote><p>As far as he [Glenn Greenwald] is concerned, if the U.S. or Israel are behind the killings, then both are “terrorist states” and President Obama may be a “a terrorist, a state sponsor of terrorism or, at the very least, a supporter of terrorism.”</p><p>But you need a particular form of moral myopia not to see that heading off a potential second Holocaust in the form of an Iranian nuclear attack on Israel or the nuclear blackmail of the rest of the Middle East is not a form of terrorism. Anyone who believes Iran should be allowed to proceed toward the building of a nuclear bomb has either lost their moral compass or is so steeped in the belief that American and Israeli interests are inherently unjustified they have reversed the moral equation in this case. Rather than the alleged U.S. and Israeli covert operators being called terrorists, it is the Iranian scientists who are the criminals. They must be stopped before they kill.</p></blockquote><p>Given that terrorism is defined as violent acts which are intended to create fear, are perpetrated for a religious, political, or ideological goal, and deliberately target or disregard the safety of civilians, it should be completely obvious that murdering scientists for the purposes of preventing Iran from developing a nuclear weapon is terrorism.  Whatever state is responsible therefore is guilty of committing acts of terrorism, although I would not go so far as to call it a terrorist state because terrorist states typically make a formal policy of terror and direct terror against their own citizens.  The First French Republic was a terrorist state, but I don’t think either Israel or the USA can be categorized that way even if they are responsible.</p><p>But does anyone doubt that if China started murdering scientists at Honeywell, Boeing, or Lockheed Martin who were working on the next generation of U.S. military weapons, it would be regarded as both terrorism and an act of war?</p><p>What Tobin should have done is to try explaining why intentionally targeting civilians for murder is justifiable and why it is a worthwhile risk considering that doing so exposes American and Israeli scientists to reprisals in the future.  Now, I think that one could probably make a reasonable case for Israel to target the civilians of various Arab nations because their own citizens are already being similarly targeted and attacked.  But the same is not true of Americans, so it would be a massive mistake for the USA to do it.</p><p>The problem is that the American media appears to be preparing the citizenry for more military action against civilian targets in friendly nations, such as took place already in Pakistan.  For example, on Hawaii Five-O the other night, the intrepid heroes prevented planned assassinations against a SEAL team, then were permitted to watch the live video stream of a SEAL assault against a drug cartel <i>in Mexico</i>.</p><p>Regardless of how worried you are about Iran possessing nuclear weapons, history very strongly suggests that they will obtain them sooner or later.  It wasn’t all that long ago that doomsday was prophesied if North Korea ever obtained nuclear weapons, and yet they now have them and nothing has happened except for the death of the North Korean leader… which does tend to raise a few more questions about the true extent of these targeted murders.  Anyhow, the point is that the prospective justifiability of an action does not modify the substance of the action, and to insist otherwise is a particularly clumsy and counterproductive form of propaganda.</p></div>",
  "content_text": "Jonathan Tobin tries to claim that\nkilling scientists isn’t terrorism\n:\nAs far as he [Glenn Greenwald] is concerned, if the U.S. or Israel are behind the killings, then both are “terrorist states” and President Obama may be a “a terrorist, a state sponsor of terrorism or, at the very least, a supporter of terrorism.”\nBut you need a particular form of moral myopia not to see that heading off a potential second Holocaust in the form of an Iranian nuclear attack on Israel or the nuclear blackmail of the rest of the Middle East is not a form of terrorism. Anyone who believes Iran should be allowed to proceed toward the building of a nuclear bomb has either lost their moral compass or is so steeped in the belief that American and Israeli interests are inherently unjustified they have reversed the moral equation in this case. Rather than the alleged U.S. and Israeli covert operators being called terrorists, it is the Iranian scientists who are the criminals. They must be stopped before they kill.\nGiven that terrorism is defined as violent acts which are intended to create fear, are perpetrated for a religious, political, or ideological goal, and deliberately target or disregard the safety of civilians, it should be completely obvious that murdering scientists for the purposes of preventing Iran from developing a nuclear weapon is terrorism.  Whatever state is responsible therefore is guilty of committing acts of terrorism, although I would not go so far as to call it a terrorist state because terrorist states typically make a formal policy of terror and direct terror against their own citizens.  The First French Republic was a terrorist state, but I don’t think either Israel or the USA can be categorized that way even if they are responsible.\nBut does anyone doubt that if China started murdering scientists at Honeywell, Boeing, or Lockheed Martin who were working on the next generation of U.S. military weapons, it would be regarded as both terrorism and an act of war?\nWhat Tobin should have done is to try explaining why intentionally targeting civilians for murder is justifiable and why it is a worthwhile risk considering that doing so exposes American and Israeli scientists to reprisals in the future.  Now, I think that one could probably make a reasonable case for Israel to target the civilians of various Arab nations because their own citizens are already being similarly targeted and attacked.  But the same is not true of Americans, so it would be a massive mistake for the USA to do it.\nThe problem is that the American media appears to be preparing the citizenry for more military action against civilian targets in friendly nations, such as took place already in Pakistan.  For example, on Hawaii Five-O the other night, the intrepid heroes prevented planned assassinations against a SEAL team, then were permitted to watch the live video stream of a SEAL assault against a drug cartel\nin Mexico\n.\nRegardless of how worried you are about Iran possessing nuclear weapons, history very strongly suggests that they will obtain them sooner or later.  It wasn’t all that long ago that doomsday was prophesied if North Korea ever obtained nuclear weapons, and yet they now have them and nothing has happened except for the death of the North Korean leader… which does tend to raise a few more questions about the true extent of these targeted murders.  Anyhow, the point is that the prospective justifiability of an action does not modify the substance of the action, and to insist otherwise is a particularly clumsy and counterproductive form of propaganda.",
  "tags": [
    "war"
  ],
  "categories": [],
  "sitemap_lastmod": "2012-01-17T15:56:00+00:00"
}