{
  "url": "https://voxday.net/2010/12/16/america-is-no-more/",
  "scraped_at": "2025-12-13T15:59:42.915247",
  "title": "America A is no more",
  "date_display": "December 16, 2010",
  "date_iso": "2010-12-16T09:24:00+00:00",
  "date_from_url": "2010-12-16",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>Thomas Friedman <a href=\"http://www.nytimes.com/2010/12/15/opinion/15friedman.html?src=me&amp;ref=general\">laments American decline</a>:</p><blockquote><p>Former President José María Figueres of Costa Rica has a saying I like: “There is no Planet B” — so we’d better make Plan A work to preserve a stable environment. I feel the same way about America these days. There is no America B, so we’d better make this one work a lot better than we’ve been doing, and not only for our sake. When Britain went into decline as the globe’s stabilizing power, America was right there, ready to pick up the role. Even with all our imperfections and mistakes, the world has been a better place for it. If America goes weak, though, and cannot project power the way it has, your kids won’t just grow up in a different America. They will grow up in a different world. You will not like who picks up the pieces.</p></blockquote><p>This is extraordinarily ironic, coming as it does from an elite Jewish liberal.  He quite clearly doesn’t recognize that it is the very causes he has championed for decades, from diversity, equality, and secularization to free trade, immigration, and globalization, that have so weakened America in the manner that concerns him now.  While he is correct in saying that a successful and powerful America committed to its core values could again become a world leader, his definition of those core values almost surely includes those values that have proven so pernicious to American success, power, and world leadership.</p><p>The North American landmass isn’t going to disappear.  There will still be Americans proper – descendants of the white Anglo-Saxon Protestants who founded the nation on principles derived from the Bible and the Magna Carta – as well as those who call themselves Americans but have no cultural, ethnic, or religious connection to the historical America that is now essentially gone.  The results of the great experiment are now sufficiently observable that we can pronounce the failure of the Viral America hypothesis.</p><p>It is now clear that one cannot catch Americanism.  Just as the Irish, German, Scandinavian, and Italian immigrants never fully grasped the English concepts of liberty and limited government*, thereby transforming what had been a voluntary union of sovereign states into an involuntary empire ruled by a sovereign central government, the subsequent wave of immigration from Mexico and other third-world nations has transformed what had been a rich and powerful empire into an impoverished and corrupt one.  Read <a href=\"http://www.nationalreview.com/articles/255320/two-californias-victor-davis-hanson?page=1\">Victor Davis Hanson’s haunting article</a> on the devolution of central California into third world poverty; it will give you a more clear perspective on what has already happened and what is eventually in store for many communities across the country.</p><p>This is not to say that it was ever the intention of the various waves of immigrants to destroy the very haven they sought, it was merely the natural consequence of immigrants bringing their cultures with them, as they always do.  And history clearly demonstrates that this is always the consequence when a sufficiently large number of people migrate to new lands.  There is a reason that the northern province of Italy is still named Lombardia after the people who settled there after invading in 568 rather than after those they displaced, after all.  It does not matter what historical example of mass immigration one examines, the result is invariably the same and it does not matter if the immigration is legal or illegal.  The only variable of any significance is the percentage of the population represented by the immigration.  Consider, for example, the original English colonists.  Did they adapt to the ways of the Indian tribes or did they bring their native English way of life with them and transform the area they inhabited?</p><p>This is also not to say that the native population does not undergo its own transformation over time, but the transformations happen much more quickly and to a much greater extent with the arrival of new influences.  The adaptation of black ghetto culture by white suburban teenagers following the end of segregation is one of many cases in point.  But keep in mind that the point here is not whether the transformation is good or bad, it is only to note that the transformation has taken place and, for better or for worse, the new blended culture is never going to be the same as the one that it replaced.</p><p>From the New York Times: <i>“In 1980, the foreign-born population in the United States was about 4.5 million. By 2000, it had reached 11.3 million, bringing the foreign-born population to about 13 percent of the total. In the early 20th century, after the last big wave of immigration to the United States, immigrants had reached 15 percent of the population.”</i></p><p>Therefore, Friedman is wrong as one cannot expect to make America A work when it has been transformed into America A + (M+I2+G+S+J+3).  America A no longer exists.  This is the B-Ark nation.</p><p> <i>*Before anyone gets their panties in a bunch, I invite you to compare the number of Irish, Italian, German, and Scandinavian political philosophers who have written on liberty and limited government with the number of English philosophers who published works on the subject.</i></p></div>",
  "content_text": "Thomas Friedman\nlaments American decline\n:\nFormer President José María Figueres of Costa Rica has a saying I like: “There is no Planet B” — so we’d better make Plan A work to preserve a stable environment. I feel the same way about America these days. There is no America B, so we’d better make this one work a lot better than we’ve been doing, and not only for our sake. When Britain went into decline as the globe’s stabilizing power, America was right there, ready to pick up the role. Even with all our imperfections and mistakes, the world has been a better place for it. If America goes weak, though, and cannot project power the way it has, your kids won’t just grow up in a different America. They will grow up in a different world. You will not like who picks up the pieces.\nThis is extraordinarily ironic, coming as it does from an elite Jewish liberal.  He quite clearly doesn’t recognize that it is the very causes he has championed for decades, from diversity, equality, and secularization to free trade, immigration, and globalization, that have so weakened America in the manner that concerns him now.  While he is correct in saying that a successful and powerful America committed to its core values could again become a world leader, his definition of those core values almost surely includes those values that have proven so pernicious to American success, power, and world leadership.\nThe North American landmass isn’t going to disappear.  There will still be Americans proper – descendants of the white Anglo-Saxon Protestants who founded the nation on principles derived from the Bible and the Magna Carta – as well as those who call themselves Americans but have no cultural, ethnic, or religious connection to the historical America that is now essentially gone.  The results of the great experiment are now sufficiently observable that we can pronounce the failure of the Viral America hypothesis.\nIt is now clear that one cannot catch Americanism.  Just as the Irish, German, Scandinavian, and Italian immigrants never fully grasped the English concepts of liberty and limited government*, thereby transforming what had been a voluntary union of sovereign states into an involuntary empire ruled by a sovereign central government, the subsequent wave of immigration from Mexico and other third-world nations has transformed what had been a rich and powerful empire into an impoverished and corrupt one.  Read\nVictor Davis Hanson’s haunting article\non the devolution of central California into third world poverty; it will give you a more clear perspective on what has already happened and what is eventually in store for many communities across the country.\nThis is not to say that it was ever the intention of the various waves of immigrants to destroy the very haven they sought, it was merely the natural consequence of immigrants bringing their cultures with them, as they always do.  And history clearly demonstrates that this is always the consequence when a sufficiently large number of people migrate to new lands.  There is a reason that the northern province of Italy is still named Lombardia after the people who settled there after invading in 568 rather than after those they displaced, after all.  It does not matter what historical example of mass immigration one examines, the result is invariably the same and it does not matter if the immigration is legal or illegal.  The only variable of any significance is the percentage of the population represented by the immigration.  Consider, for example, the original English colonists.  Did they adapt to the ways of the Indian tribes or did they bring their native English way of life with them and transform the area they inhabited?\nThis is also not to say that the native population does not undergo its own transformation over time, but the transformations happen much more quickly and to a much greater extent with the arrival of new influences.  The adaptation of black ghetto culture by white suburban teenagers following the end of segregation is one of many cases in point.  But keep in mind that the point here is not whether the transformation is good or bad, it is only to note that the transformation has taken place and, for better or for worse, the new blended culture is never going to be the same as the one that it replaced.\nFrom the New York Times:\n“In 1980, the foreign-born population in the United States was about 4.5 million. By 2000, it had reached 11.3 million, bringing the foreign-born population to about 13 percent of the total. In the early 20th century, after the last big wave of immigration to the United States, immigrants had reached 15 percent of the population.”\nTherefore, Friedman is wrong as one cannot expect to make America A work when it has been transformed into America A + (M+I2+G+S+J+3).  America A no longer exists.  This is the B-Ark nation.\n*Before anyone gets their panties in a bunch, I invite you to compare the number of Irish, Italian, German, and Scandinavian political philosophers who have written on liberty and limited government with the number of English philosophers who published works on the subject.",
  "tags": [
    "immigration"
  ],
  "categories": [],
  "sitemap_lastmod": "2010-12-16T09:24:00+00:00"
}