{
  "url": "https://voxday.net/2010/12/21/atheist-self-humiliation/",
  "scraped_at": "2025-12-13T16:00:08.704721",
  "title": "Can you really blame God?",
  "date_display": "December 21, 2010",
  "date_iso": "2010-12-21T09:19:00+00:00",
  "date_from_url": "2010-12-21",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>Ricky Gervais provides a vivid demonstration of the way in which many atheists are prone to <a href=\"http://blogs.wsj.com/speakeasy/2010/12/19/a-holiday-message-from-ricky-gervais-why-im-an-atheist/\">vastly overrate their own intelligence</a> and ability to reason.  Possibly the most amusing thing is the way that a gaggle of less famous atheists fall all over themselves attempting to proclaim the brilliance of Gervais’s ignorant, illogical, and error-ridden article in the subsequent comments:</p><blockquote><p>Why don’t you believe in God? I get that question all the time. I always try to give a sensitive, reasoned answer. This is usually awkward, time consuming and pointless. People who believe in God don’t need proof of his existence, and they certainly don’t want evidence to the contrary. They are happy with their belief. They even say things like “it’s true to me” and “it’s faith.” I still give my logical answer because I feel that not being honest would be patronizing and impolite. It is ironic therefore that “I don’t believe in God because there is absolutely no scientific evidence for his existence and from what I’ve heard the very definition is a logical impossibility in this known universe,” comes across as both patronizing and impolite.</p><p>Arrogance is another accusation. Which seems particularly unfair. Science seeks the truth. And it does not discriminate. For better or worse it finds things out. Science is humble. It knows what it knows and it knows what it doesn’t know. It bases its conclusions and beliefs on hard evidence -­- evidence that is constantly updated and upgraded. It doesn’t get offended when new facts come along. It embraces the body of knowledge. It doesn’t hold on to medieval practices because they are tradition. If it did, you wouldn’t get a shot of penicillin, you’d pop a leach down your trousers and pray. Whatever you “believe,” this is not as effective as medicine. Again you can say, “It works for me,” but so do placebos. My point being, I’m saying God doesn’t exist. I’m not saying faith doesn’t exist. I know faith exists. I see it all the time. But believing in something doesn’t make it true. Hoping that something is true doesn’t make it true. The existence of God is not subjective. He either exists or he doesn’t. It’s not a matter of opinion. You can have your own opinions. But you can’t have your own facts.</p></blockquote><p>No, you can’t have your own facts.  And yet, that is exactly what Gervais attempts to do throughout his “sensitive and reasoned answer”.  First, Gervais is too socially autistic to to understand that the statement “I don’t believe in God because there is absolutely no scientific evidence for his existence and from what I’ve heard the very definition is a logical impossibility in this known universe” is no more patronizing or impolite than science is arrogant.</p><p>It is Gervais himself that <a href=\"http://www.guardian.co.uk/media/organgrinder/2007/jul/11/rickygervaishaslostit\">people find patronizing, impolite, and arrogant</a>, not his illogical statement or anthropomorphized science. He is the walking, talking evidence of the existence of the definitive Dawkinsian atheist, who does not believe in God because he is an asshole.  Despite his attempts to blame people’s natural dislike of him on other things, there is no irony to be found because there is simply nothing there.</p><p>No one accuses science of being arrogant, they accuse <i>scientists</i> of being arrogant, which they often are, sometimes even with reasonable justification.  And they accuse <i>science fetishists</i> like Gervais of being arrogant, which they usually are on behalf of science in a weird, cultish, and totally unjustifiable manner.  Gervais’s elevation of science into an anthropomorphized quasi-deity in which he places inordinate trust is downright hilarious, as science, by which he clearly means “scientody” or “the scientific method”, does not “know” anything, it is not “humble”, and “it doesn’t get offended” for the obvious reason that it cannot.  Atheists like Gervais make a false god of science, place their blind and uncomprehending faith in it, then sputter in outrage when others quite reasonably point to what without question merits being described as religious behavior.</p><p>Gervais is not so much incorrect as completely incoherent when he says that science “bases its conclusions and beliefs on hard evidence”.  First, he reveals the usual atheist’s inability to distinguish between “evidence” and “scientific evidence”.  Second, science does not possess either conclusions or beliefs and it does not base them or anything else upon evidence; Gervais clearly doesn’t understand how the scientific method works because it is used to <i>produce</i> evidence (of the scientific variety), it is not based upon evidence of any kind.  Third, his example is spectacularly ignorant, as science not only did not develop penicillin, but the parochial arrogance of scientists actually retarded the development of the effective medical application of what had been the very sort of traditional medieval practice that Gervais disdains for decades.  His knowledge doesn’t even rise to the level of Wikipedia: see the story of Ernest Duchesne and his 1897 paper that was ignored by the Institut Pasteur.</p><p>Speaking of facts, Gervais blatantly makes up his own when he claims that “75 percent of Americans are God-­‐fearing Christians; 75 percent of prisoners are God-­‐fearing Christians. 10 percent of Americans are atheists; 0.2 percent of prisoners are atheists.”  But he has no basis for this and we KNOW he has no basis for this because no reliable statistical study of American prisoners has ever been done.  And we also know he is not only wrong, but dishonest because he is using a bait-and-switch on his definition of atheist; only 0.7% of Americans actually call themselves atheists versus the 15% who the American Religious Identification Survey describes as Nones/No Religion.</p><p>Moreoever, we actually have comprehensive data regarding Gervais’s own country, the United Kingdom.  (In fact, that’s likely where Gervais got his imaginary number for American atheists in prison, from the <i>UK</i>, which reported 122 atheists being held in English and Welsh jails  That just happens to be 0.2 percent of the 65,256 prison population there.)</p><p>But in addition to those 122 atheists, there also happened to be another 20,639 prisoners, 31.6 percent of the total prison population, who claimed to possess “no religion.” And this was not simply a case of people falling through the cracks or refusing to provide an answer; the Inmate Information System is specific enough to distinguish between Druids, Scientologists, and Zoroastrians as well as between the Celestial Church of God, the Welsh Independent church, and the Non-Conformist church. It also features separate categories for “other Christian religion,” “other non-Christian religion,” and “not known.” At only two-tenths of a percent of the prison population, self-identifying atheists are, as previously suggested, extremely law-abiding. But when one compares the 31.6 percent of imprisoned no-religionists to the 15.1 percent of Britons who checked “none” or wrote in Jedi Knight, agnostic, atheist, or heathen in the 2001 national survey, it becomes clear that their practical atheist brethren are nearly four times more likely to be convicted and jailed for committing a crime than a Christian.</p><p>In other words, No Religion atheists are without question much more criminally inclined than Christians even if self-identified Scarlet-A Atheists are not.  And since Gervais used the much larger 10% figure, he clearly had the No Religion atheists in mind, which shows the disingenuous nature of his original comparison between the ratio of Christians/Christians and Atheists/atheists.  Remember, you can’t have your own facts, Ricky!  There are many more errors of fact and logic that I have not troubled to highlight, but the reader should not find it difficult to identify them.  Gervais goes on to plagiarize Stephen Roberts’s fallacious “One Less God” argument without crediting Roberts, admits his atheism is quite literally a childish belief, follows that admission with an exemplary demonstration of moral parasitism, and finally closes with a baseless and self-deluded declaration of his own good.  This takes us right back to the starting point, which is that it is not science, but Gervais that is an arrogant ass.</p><p>Regardless of whether you believe in God’s existence or not,it is very difficult to read Gervais’s ludicrous attempt to justify his atheism and not reach three conclusions.  First, it takes a truly epic fool to say, not only in his heart but in the Wall Street Journal as well, that there is no God.  Second, this is less a case of atheistic evangelism than the agnostic variety as any intelligent atheist will be tempted to convert immediately to agnosticism out of sheer embarrassment.  And third, if God does exist, it would be impossible to blame Him for deciding to throw such a smug and annoying little bastard into Hell when faced with the alternative of being inflicted with his company for eternity.</p></div>",
  "content_text": "Ricky Gervais provides a vivid demonstration of the way in which many atheists are prone to\nvastly overrate their own intelligence\nand ability to reason.  Possibly the most amusing thing is the way that a gaggle of less famous atheists fall all over themselves attempting to proclaim the brilliance of Gervais’s ignorant, illogical, and error-ridden article in the subsequent comments:\nWhy don’t you believe in God? I get that question all the time. I always try to give a sensitive, reasoned answer. This is usually awkward, time consuming and pointless. People who believe in God don’t need proof of his existence, and they certainly don’t want evidence to the contrary. They are happy with their belief. They even say things like “it’s true to me” and “it’s faith.” I still give my logical answer because I feel that not being honest would be patronizing and impolite. It is ironic therefore that “I don’t believe in God because there is absolutely no scientific evidence for his existence and from what I’ve heard the very definition is a logical impossibility in this known universe,” comes across as both patronizing and impolite.\nArrogance is another accusation. Which seems particularly unfair. Science seeks the truth. And it does not discriminate. For better or worse it finds things out. Science is humble. It knows what it knows and it knows what it doesn’t know. It bases its conclusions and beliefs on hard evidence -­- evidence that is constantly updated and upgraded. It doesn’t get offended when new facts come along. It embraces the body of knowledge. It doesn’t hold on to medieval practices because they are tradition. If it did, you wouldn’t get a shot of penicillin, you’d pop a leach down your trousers and pray. Whatever you “believe,” this is not as effective as medicine. Again you can say, “It works for me,” but so do placebos. My point being, I’m saying God doesn’t exist. I’m not saying faith doesn’t exist. I know faith exists. I see it all the time. But believing in something doesn’t make it true. Hoping that something is true doesn’t make it true. The existence of God is not subjective. He either exists or he doesn’t. It’s not a matter of opinion. You can have your own opinions. But you can’t have your own facts.\nNo, you can’t have your own facts.  And yet, that is exactly what Gervais attempts to do throughout his “sensitive and reasoned answer”.  First, Gervais is too socially autistic to to understand that the statement “I don’t believe in God because there is absolutely no scientific evidence for his existence and from what I’ve heard the very definition is a logical impossibility in this known universe” is no more patronizing or impolite than science is arrogant.\nIt is Gervais himself that\npeople find patronizing, impolite, and arrogant\n, not his illogical statement or anthropomorphized science. He is the walking, talking evidence of the existence of the definitive Dawkinsian atheist, who does not believe in God because he is an asshole.  Despite his attempts to blame people’s natural dislike of him on other things, there is no irony to be found because there is simply nothing there.\nNo one accuses science of being arrogant, they accuse\nscientists\nof being arrogant, which they often are, sometimes even with reasonable justification.  And they accuse\nscience fetishists\nlike Gervais of being arrogant, which they usually are on behalf of science in a weird, cultish, and totally unjustifiable manner.  Gervais’s elevation of science into an anthropomorphized quasi-deity in which he places inordinate trust is downright hilarious, as science, by which he clearly means “scientody” or “the scientific method”, does not “know” anything, it is not “humble”, and “it doesn’t get offended” for the obvious reason that it cannot.  Atheists like Gervais make a false god of science, place their blind and uncomprehending faith in it, then sputter in outrage when others quite reasonably point to what without question merits being described as religious behavior.\nGervais is not so much incorrect as completely incoherent when he says that science “bases its conclusions and beliefs on hard evidence”.  First, he reveals the usual atheist’s inability to distinguish between “evidence” and “scientific evidence”.  Second, science does not possess either conclusions or beliefs and it does not base them or anything else upon evidence; Gervais clearly doesn’t understand how the scientific method works because it is used to\nproduce\nevidence (of the scientific variety), it is not based upon evidence of any kind.  Third, his example is spectacularly ignorant, as science not only did not develop penicillin, but the parochial arrogance of scientists actually retarded the development of the effective medical application of what had been the very sort of traditional medieval practice that Gervais disdains for decades.  His knowledge doesn’t even rise to the level of Wikipedia: see the story of Ernest Duchesne and his 1897 paper that was ignored by the Institut Pasteur.\nSpeaking of facts, Gervais blatantly makes up his own when he claims that “75 percent of Americans are God-­‐fearing Christians; 75 percent of prisoners are God-­‐fearing Christians. 10 percent of Americans are atheists; 0.2 percent of prisoners are atheists.”  But he has no basis for this and we KNOW he has no basis for this because no reliable statistical study of American prisoners has ever been done.  And we also know he is not only wrong, but dishonest because he is using a bait-and-switch on his definition of atheist; only 0.7% of Americans actually call themselves atheists versus the 15% who the American Religious Identification Survey describes as Nones/No Religion.\nMoreoever, we actually have comprehensive data regarding Gervais’s own country, the United Kingdom.  (In fact, that’s likely where Gervais got his imaginary number for American atheists in prison, from the\nUK\n, which reported 122 atheists being held in English and Welsh jails  That just happens to be 0.2 percent of the 65,256 prison population there.)\nBut in addition to those 122 atheists, there also happened to be another 20,639 prisoners, 31.6 percent of the total prison population, who claimed to possess “no religion.” And this was not simply a case of people falling through the cracks or refusing to provide an answer; the Inmate Information System is specific enough to distinguish between Druids, Scientologists, and Zoroastrians as well as between the Celestial Church of God, the Welsh Independent church, and the Non-Conformist church. It also features separate categories for “other Christian religion,” “other non-Christian religion,” and “not known.” At only two-tenths of a percent of the prison population, self-identifying atheists are, as previously suggested, extremely law-abiding. But when one compares the 31.6 percent of imprisoned no-religionists to the 15.1 percent of Britons who checked “none” or wrote in Jedi Knight, agnostic, atheist, or heathen in the 2001 national survey, it becomes clear that their practical atheist brethren are nearly four times more likely to be convicted and jailed for committing a crime than a Christian.\nIn other words, No Religion atheists are without question much more criminally inclined than Christians even if self-identified Scarlet-A Atheists are not.  And since Gervais used the much larger 10% figure, he clearly had the No Religion atheists in mind, which shows the disingenuous nature of his original comparison between the ratio of Christians/Christians and Atheists/atheists.  Remember, you can’t have your own facts, Ricky!  There are many more errors of fact and logic that I have not troubled to highlight, but the reader should not find it difficult to identify them.  Gervais goes on to plagiarize Stephen Roberts’s fallacious “One Less God” argument without crediting Roberts, admits his atheism is quite literally a childish belief, follows that admission with an exemplary demonstration of moral parasitism, and finally closes with a baseless and self-deluded declaration of his own good.  This takes us right back to the starting point, which is that it is not science, but Gervais that is an arrogant ass.\nRegardless of whether you believe in God’s existence or not,it is very difficult to read Gervais’s ludicrous attempt to justify his atheism and not reach three conclusions.  First, it takes a truly epic fool to say, not only in his heart but in the Wall Street Journal as well, that there is no God.  Second, this is less a case of atheistic evangelism than the agnostic variety as any intelligent atheist will be tempted to convert immediately to agnosticism out of sheer embarrassment.  And third, if God does exist, it would be impossible to blame Him for deciding to throw such a smug and annoying little bastard into Hell when faced with the alternative of being inflicted with his company for eternity.",
  "tags": [
    "atheism"
  ],
  "categories": [],
  "sitemap_lastmod": "2010-12-21T09:19:00+00:00"
}