{
  "url": "https://voxday.net/2010/12/27/best-theyve-go/",
  "scraped_at": "2025-12-13T16:00:34.442346",
  "title": "The best they’ve got",
  "date_display": "December 27, 2010",
  "date_iso": "2010-12-27T21:29:00+00:00",
  "date_from_url": "2010-12-27",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>In case you’re still not convinced of the moral and intellectual bankruptcy of atheism, consider this list of <a href=\"http://www.reddit.com/r/atheism/comments/es33y/ok_ratheism_time_to_pull_out_the_big_gunswhat_is/\">what atheists believe to be “the big guns”</a> of the best atheist quotes.</p><p>Needless to say, I was deeply unimpressed.  It was amusing to see that the thread’s creator actually cited the illogical and theologically ignorant “One Less God” quote from Stephen Roberts that Ricky Gervais plagiarized in his recent article: <i>“I contend that we are both atheists. I just believe in one fewer god than you do. When you understand why you dismiss all the other possible gods, you will understand why I dismiss yours.”</i></p><p>Three errors in just three sentences.</p><p>1.  No, we are not both atheists.<br> 2.  No, you are confusing God with gods.  If you simply take the First Commandment into account, you will know that this is incorrect.  Few atheists understand that monotheism concerns the <i>worship</i> of one supreme Creator God, not belief in the existence of only one supernatural being that demands worship.<br> 3.  Unless an atheist dismisses the Christian God because they believe Him to be an evil supernatural being falsely posing as a deity worthy of worship, he is not doing so for the same reason that Christians dismiss the pagan gods.</br></br></p><p>There are the expected appearances of Dawkins and Harris, Galileo’s fictional quote, and the concocted quote that David Hume falsely attributed to Epicurus.  It is so eminently fitting that atheists should rely upon fake quotes to argue in support of their supposed dedication to reality.</p><p>But let us be fair.  Whether you are a believer or an unbeliever, select whichever quote you consider to be either the least nonsensical or most effective in support of the atheist case.  Mine is the following, which is absolutely true:</p><p>“A casual stroll through the lunatic asylum shows that faith does not prove anything.” – Friedrich Nietzsche</p><p>Nietsche is correct in that faith doesn’t prove anything.  The problem, of course, is that it isn’t supposed to, by literal definition.  Paul writes in Hebrews: “Faith is the substance of things hoped for, the evidence of things unseen. The very fact that we have faith, is evidence that what we hope for is real.”</p><p>Of course, the common atheist confusion concerning the matter notwithstanding, “evidence” should not be mistaken for “proof”.  Again, this should be completely obvious, as it is why linguistic concepts such as “competing evidence” and “weighing the evidence” are utilized.</p></div>",
  "content_text": "In case you’re still not convinced of the moral and intellectual bankruptcy of atheism, consider this list of\nwhat atheists believe to be “the big guns”\nof the best atheist quotes.\nNeedless to say, I was deeply unimpressed.  It was amusing to see that the thread’s creator actually cited the illogical and theologically ignorant “One Less God” quote from Stephen Roberts that Ricky Gervais plagiarized in his recent article:\n“I contend that we are both atheists. I just believe in one fewer god than you do. When you understand why you dismiss all the other possible gods, you will understand why I dismiss yours.”\nThree errors in just three sentences.\n1.  No, we are not both atheists.\n2.  No, you are confusing God with gods.  If you simply take the First Commandment into account, you will know that this is incorrect.  Few atheists understand that monotheism concerns the\nworship\nof one supreme Creator God, not belief in the existence of only one supernatural being that demands worship.\n3.  Unless an atheist dismisses the Christian God because they believe Him to be an evil supernatural being falsely posing as a deity worthy of worship, he is not doing so for the same reason that Christians dismiss the pagan gods.\nThere are the expected appearances of Dawkins and Harris, Galileo’s fictional quote, and the concocted quote that David Hume falsely attributed to Epicurus.  It is so eminently fitting that atheists should rely upon fake quotes to argue in support of their supposed dedication to reality.\nBut let us be fair.  Whether you are a believer or an unbeliever, select whichever quote you consider to be either the least nonsensical or most effective in support of the atheist case.  Mine is the following, which is absolutely true:\n“A casual stroll through the lunatic asylum shows that faith does not prove anything.” – Friedrich Nietzsche\nNietsche is correct in that faith doesn’t prove anything.  The problem, of course, is that it isn’t supposed to, by literal definition.  Paul writes in Hebrews: “Faith is the substance of things hoped for, the evidence of things unseen. The very fact that we have faith, is evidence that what we hope for is real.”\nOf course, the common atheist confusion concerning the matter notwithstanding, “evidence” should not be mistaken for “proof”.  Again, this should be completely obvious, as it is why linguistic concepts such as “competing evidence” and “weighing the evidence” are utilized.",
  "tags": [
    "atheism"
  ],
  "categories": [],
  "sitemap_lastmod": "2010-12-27T21:29:00+00:00"
}