{
  "url": "https://voxday.net/2010/12/01/brothel-or-burqa/",
  "scraped_at": "2026-01-08T23:44:12.653716",
  "title": "The brothel or the burqah",
  "date_display": "December 1, 2010",
  "date_iso": "2010-12-01T14:30:00+00:00",
  "date_from_url": "2010-12-01",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>The predicted consequences of post-Christian society <a href=\"http://theothermccain.com/2010/11/30/muslim-columnist-u-k-rape-gang-case-exposes-disgusting-cultural-beliefs/\">are already presenting themselves</a> in Britain:</p><blockquote><p>What Alibhai-Brown exposes here is not merely a sexual double-standard, but also an ethnic or religious double-standard, where Muslim men have one standard for “our girls” and another standard for white girls, who are categorically presumed to be immoral.</p><p>If Alibhai-Brown has been willing to address the vicious attitudes among (some) British Muslim men that helped foster the environment in which the Derbyshire rape-gang flourished, wouldn’t it behoove someone to examine the problems among British whites that contributed to this horror?</p><p>The pimps in Bradford who talked to Alibhai-Brown about “cheap” white girls from “the estates” — British vernacular for government low-income housing, what we Americans would call “the projects” — weren’t just making up a stereotype out of thin air. In 2008, 45% of British births were to unmarried women and, in some low-income areas, the illegitimacy rate was as high as 68%. Such figures certainly indicate that a casual attitude toward pre-marital sex is commonplace in the U.K.</p></blockquote><p>All of the airy secular notions about multicultural societies, sexual equality, universal suffrage, and premarital sex are finally running into the hard brick wall of historical reality.  The various hypothetical coulds and shoulds are rapidly transforming into can’ts and don’ts.  Now that Christian morality has been abandoned in favor of empty moral relevance, there isn’t any means of rationally arguing with the immigrant pimps who are cheefully turning out Albion’s sluttish daughters while guarding their own with all the primitive paternalism of a dragon guarding his treasure.</p><p>Now, set aside your instinctive emotional reactions for a moment and think about which of the two cultures a) truly values its daughters more, and b) is likely to demographically outperform the other.  Is it the one that forcibly protects young women from their own behavior or the one that aborts them, deprives them of fathers, and generally abandons them <a href=\"http://www.dailymail.co.uk/news/article-1333976/Binge-drinking-culture-creating-generation-aggressive-control-women.html\">to their momentary impulses</a>?  And is there any evidence that the positive aspects of the liberation of Western women, to use the rhetorical phrase, outweigh the negative aspects when viewed from a historical perspective?</p><p>As for one common argument to which those who admit the reality of the demographic problem often resort, the idea that the West’s scientific lead will somehow allow it to win any long-term intercultural struggle doesn’t hold water; intelligence agencies wouldn’t be assassinating Iranian scientists if sufficient military science didn’t translate across cultures and the same cultural forces that prevent Western fathers from controlling access to their daughters prevent Western universities from controlling access to their scientific technologies.</p></div>",
  "content_text": "The predicted consequences of post-Christian society\nare already presenting themselves\nin Britain:\nWhat Alibhai-Brown exposes here is not merely a sexual double-standard, but also an ethnic or religious double-standard, where Muslim men have one standard for “our girls” and another standard for white girls, who are categorically presumed to be immoral.\nIf Alibhai-Brown has been willing to address the vicious attitudes among (some) British Muslim men that helped foster the environment in which the Derbyshire rape-gang flourished, wouldn’t it behoove someone to examine the problems among British whites that contributed to this horror?\nThe pimps in Bradford who talked to Alibhai-Brown about “cheap” white girls from “the estates” — British vernacular for government low-income housing, what we Americans would call “the projects” — weren’t just making up a stereotype out of thin air. In 2008, 45% of British births were to unmarried women and, in some low-income areas, the illegitimacy rate was as high as 68%. Such figures certainly indicate that a casual attitude toward pre-marital sex is commonplace in the U.K.\nAll of the airy secular notions about multicultural societies, sexual equality, universal suffrage, and premarital sex are finally running into the hard brick wall of historical reality.  The various hypothetical coulds and shoulds are rapidly transforming into can’ts and don’ts.  Now that Christian morality has been abandoned in favor of empty moral relevance, there isn’t any means of rationally arguing with the immigrant pimps who are cheefully turning out Albion’s sluttish daughters while guarding their own with all the primitive paternalism of a dragon guarding his treasure.\nNow, set aside your instinctive emotional reactions for a moment and think about which of the two cultures a) truly values its daughters more, and b) is likely to demographically outperform the other.  Is it the one that forcibly protects young women from their own behavior or the one that aborts them, deprives them of fathers, and generally abandons them\nto their momentary impulses\n?  And is there any evidence that the positive aspects of the liberation of Western women, to use the rhetorical phrase, outweigh the negative aspects when viewed from a historical perspective?\nAs for one common argument to which those who admit the reality of the demographic problem often resort, the idea that the West’s scientific lead will somehow allow it to win any long-term intercultural struggle doesn’t hold water; intelligence agencies wouldn’t be assassinating Iranian scientists if sufficient military science didn’t translate across cultures and the same cultural forces that prevent Western fathers from controlling access to their daughters prevent Western universities from controlling access to their scientific technologies.",
  "tags": [
    "society"
  ],
  "categories": [],
  "sitemap_lastmod": "2010-12-01T14:30:00+00:00"
}