{
  "url": "https://voxday.net/2010/12/03/climate-scam-is-dead/",
  "scraped_at": "2026-01-08T23:44:22.075816",
  "title": "The climate scam is dead",
  "date_display": "December 3, 2010",
  "date_iso": "2010-12-03T09:10:00+00:00",
  "date_from_url": "2010-12-03",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>Tokyo says <a href=\"http://wattsupwiththat.com/2010/12/02/breaking-japan-refuses-to-extend-kyoto-treaty-at-cancun/#comments\">no to Kyoto</a>:</p><blockquote><p>The brief statement, made by Jun Arima, an official in the government’s economics trade and industry department, in an open session, was the strongest yet made against the protocol by one of the largest emitters of greenhouse gases.</p><p>He said: “Japan will not inscribe its target under the Kyoto protocol on any conditions or under any circumstances.”</p></blockquote><p>The so-called science was always fictional and fraudulent and the economic implications were clearly insane, so it’s about time that the politics began to reflect those realities.  As Europe enters what has started off as <a href=\"http://www.bbc.co.uk/news/world-europe-11895107\">its coldest winter in 100 years</a> and the global economy collapses into depression, it doesn’t matter how much or how frantically the true believers in global warming wave their hands and agree to concoct new scientific consensuses.  The Chicago air exchange has been vaporized and the science-scammers’ gravy train is about to be buried under snow.</p><p>Remember this the next time the science fetishists tell you that a scientific consensus is something upon which you not only can, but must, rely.</p></div>",
  "content_text": "Tokyo says\nno to Kyoto\n:\nThe brief statement, made by Jun Arima, an official in the government’s economics trade and industry department, in an open session, was the strongest yet made against the protocol by one of the largest emitters of greenhouse gases.\nHe said: “Japan will not inscribe its target under the Kyoto protocol on any conditions or under any circumstances.”\nThe so-called science was always fictional and fraudulent and the economic implications were clearly insane, so it’s about time that the politics began to reflect those realities.  As Europe enters what has started off as\nits coldest winter in 100 years\nand the global economy collapses into depression, it doesn’t matter how much or how frantically the true believers in global warming wave their hands and agree to concoct new scientific consensuses.  The Chicago air exchange has been vaporized and the science-scammers’ gravy train is about to be buried under snow.\nRemember this the next time the science fetishists tell you that a scientific consensus is something upon which you not only can, but must, rely.",
  "tags": [
    "AGW/CC"
  ],
  "categories": [],
  "sitemap_lastmod": "2010-12-03T09:10:00+00:00"
}