{
  "url": "https://voxday.net/2010/12/13/cougar-catching/",
  "scraped_at": "2026-01-08T23:45:20.807511",
  "title": "Cougar catching",
  "date_display": "December 13, 2010",
  "date_iso": "2010-12-13T18:12:00+00:00",
  "date_from_url": "2010-12-13",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>I’m not sure which is more amusing, the fact that this dork finds it so easy <a href=\"http://www.thesun.co.uk/sol/homepage/woman/real_life/2920018/I-get-paid-60000-a-year-to-sleep-with-older-women.html\">to catch straying cougars</a> or the way in which the female columnist is so predictably horrified… by the men who wish to verify the fact that their wives are unfaithful:</p><blockquote><p>Ryan has been working as a honey trap for a top surveillance agency for two years and has caught out 145 cheating women – sleeping with 50 of them.  His job is just like the female honey-trapper’s seductive services we reported on two weeks ago.</p><p>Ryan says: “Older ladies seem to find me attractive. My boyish good looks and cheeky sense of humour reel them in. Also, I have been thoroughly trained by the surveillance agency in how to be flirtatious and charming.</p><p>“My success rate is 100 per cent. I feel it’s my job to catch out cheating women for their husbands’ benefit.</p></blockquote><p>In response to which, the female columnist writes: <i>“[W]hat sort of sad, vindictive men set a trap for their wife instead of tackling the problems in the relationship, looking at why they are so bored and lonely, why all a man has to do to get them into bed is listen? These husbands seem more worried about their wallets than their love lives.”</i></p><p>Proving yet again that it doesn’t matter what a woman does to another woman who can imagine herself in the first woman’s shoes, <i>it must be a man’s fault</i>.  Needless to say, the almost identical article about the female honey-trapper was accompanied by no such finger-wagging commentary.  But either way, the fact that there is a honey-trap industry – not unlike the old faux adultery divorce service from days before no-fault divorce – shows how foolish it is to believe you are likely to get away with adulterous behavior now that we’re living in a technological service economy.  Once your husband or wife begins to have enough doubts about you to hire a hacker to go through your hard drive, a private investigator to follow you, or a honey-trapper to tempt you, you will almost certainly be caught.</p></div>",
  "content_text": "I’m not sure which is more amusing, the fact that this dork finds it so easy\nto catch straying cougars\nor the way in which the female columnist is so predictably horrified… by the men who wish to verify the fact that their wives are unfaithful:\nRyan has been working as a honey trap for a top surveillance agency for two years and has caught out 145 cheating women – sleeping with 50 of them.  His job is just like the female honey-trapper’s seductive services we reported on two weeks ago.\nRyan says: “Older ladies seem to find me attractive. My boyish good looks and cheeky sense of humour reel them in. Also, I have been thoroughly trained by the surveillance agency in how to be flirtatious and charming.\n“My success rate is 100 per cent. I feel it’s my job to catch out cheating women for their husbands’ benefit.\nIn response to which, the female columnist writes:\n“[W]hat sort of sad, vindictive men set a trap for their wife instead of tackling the problems in the relationship, looking at why they are so bored and lonely, why all a man has to do to get them into bed is listen? These husbands seem more worried about their wallets than their love lives.”\nProving yet again that it doesn’t matter what a woman does to another woman who can imagine herself in the first woman’s shoes,\nit must be a man’s fault\n.  Needless to say, the almost identical article about the female honey-trapper was accompanied by no such finger-wagging commentary.  But either way, the fact that there is a honey-trap industry – not unlike the old faux adultery divorce service from days before no-fault divorce – shows how foolish it is to believe you are likely to get away with adulterous behavior now that we’re living in a technological service economy.  Once your husband or wife begins to have enough doubts about you to hire a hacker to go through your hard drive, a private investigator to follow you, or a honey-trapper to tempt you, you will almost certainly be caught.",
  "tags": [
    "women"
  ],
  "categories": [],
  "sitemap_lastmod": "2010-12-13T18:12:00+00:00"
}