{
  "url": "https://voxday.net/2010/12/01/dissecting-defense-of-qe2/",
  "scraped_at": "2026-01-08T23:44:14.551457",
  "title": "Dissecting a defense of QE2",
  "date_display": "December 1, 2010",
  "date_iso": "2010-12-01T18:34:00+00:00",
  "date_from_url": "2010-12-01",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p><a href=\"http://www.nationalreview.com/corner/254250/there-nothing-qe2-worth-conserving-mark-calabria\">The Federal Reserve policy</a>, that is, not the boat:</p><blockquote><p>David Beckworth has offered a thoughtful, but I believe ultimately flawed, “conservative case” for the Federal Reserve’s latest round of quantitative easing. While I wholeheartedly share Professor Beckworth’s desire to see the economy improve, and share his concerns that if it does not we may end up with expanded government spending, it is hard to see QE2 as providing the environment of certainty the private sector needs in order to expand.</p><p>Professor Beckworth should be commended for clearly spelling out his assumptions. Public debate would be far more fruitful if others did the same. Let’s start with his core assumption: Because the monetary base has been expanding and there’s been little inflation and little increase in consumption, households must be hoarding money. The logic in this case is sound; I disagree with the facts.</p><p>First, the good professor argues that spending is far below trend. That is true enough as it goes, but this trend includes a massive housing bubble, where imaginary wealth fueled spending, aided by massive borrowing from abroad. The objective of our economic policies should not be to get back to the top of the previous bubble. It was this desire to replace the lost wealth of the dot-com crash that contributed to the Fed’s juicing of the housing market. All that said, consumption today is higher than at any time during the recent bubble. The primary problem facing our economy is not a lack of demand.</p><p>Like Ben Bernanke, Beckworth believes we have had no inflation. Again like the Fed, he arrives at this conclusion by subtracting out of the inflation numbers all the things that real people spend their money on, such as food and energy.</p></blockquote><p>Articles like this and Beckworth’s underline the importance of definitions.  The money supply has been going up considerably.  The CPI has been increasing, but not rapidly.  Therefore, there is no inflation!  (Notice that in practice, they never take production into account for the obvious reason that it is impossible to measure in any way that would be meaningful.)  If we are to believe these expert economists, it doesn’t matter what is happening to actual prices or outstanding debt levels, not so long as we squint very carefully at only those metrics that we believe to define the situation.</p><p>And this is why I pay attention to indicators beyond those that I personally believe to be significant, because unlike the Keynesians, I am more interested in knowing what is actually taking place than I am in <s>manipulating the public</s>bolstering animal spirits.  If I am incorrect and we are headed for hyperinflation rather than debt-deflation, I would certainly like to know as soon as possible.  The speed and complexity of economic events means that every economist is going to be proven wrong on a regular basis.  Therefore, it behooves anyone with an interest in economics to refuse to be unduly wedded to any specific understanding or definition.  This does should not be confused with some sort of conceptual relativism, it is merely a recognition of the inability of even the best economic models to reflect observable reality.</p><p>In any event, Calabria is correct.  There is no rational defense of quantitative easing, regardless of the way in which one chooses to define inflation.  QE2 is not an economic policy, it is the bank rape of the global economy.  And by the way, there is an easier way to blow apart <a href=\"http://www.nationalreview.com/articles/253936/conservative-case-qe2-david-beckworth?page=1\">Beckworth’s case</a> than Calabria does.</p><p><i>“Because the monetary base has been increasing so rapidly and there has been very little inflation, it must be the case that demand for the money must be increasing even more.”</i></p><p>Very well.  Where is that “significant portion of the money supply” upon which the dread hoarders are supposedly sitting?  Have bank deposits increased significantly?  Beckworth also makes a classic Keynesian blunder in saying: “It fails to recognize that for every debtor there must be a creditor.”  (Keynesians absolutely love this macro equivalence nonsense.)  Of course, what happens when the debtor defaults….</p></div>",
  "content_text": "The Federal Reserve policy\n, that is, not the boat:\nDavid Beckworth has offered a thoughtful, but I believe ultimately flawed, “conservative case” for the Federal Reserve’s latest round of quantitative easing. While I wholeheartedly share Professor Beckworth’s desire to see the economy improve, and share his concerns that if it does not we may end up with expanded government spending, it is hard to see QE2 as providing the environment of certainty the private sector needs in order to expand.\nProfessor Beckworth should be commended for clearly spelling out his assumptions. Public debate would be far more fruitful if others did the same. Let’s start with his core assumption: Because the monetary base has been expanding and there’s been little inflation and little increase in consumption, households must be hoarding money. The logic in this case is sound; I disagree with the facts.\nFirst, the good professor argues that spending is far below trend. That is true enough as it goes, but this trend includes a massive housing bubble, where imaginary wealth fueled spending, aided by massive borrowing from abroad. The objective of our economic policies should not be to get back to the top of the previous bubble. It was this desire to replace the lost wealth of the dot-com crash that contributed to the Fed’s juicing of the housing market. All that said, consumption today is higher than at any time during the recent bubble. The primary problem facing our economy is not a lack of demand.\nLike Ben Bernanke, Beckworth believes we have had no inflation. Again like the Fed, he arrives at this conclusion by subtracting out of the inflation numbers all the things that real people spend their money on, such as food and energy.\nArticles like this and Beckworth’s underline the importance of definitions.  The money supply has been going up considerably.  The CPI has been increasing, but not rapidly.  Therefore, there is no inflation!  (Notice that in practice, they never take production into account for the obvious reason that it is impossible to measure in any way that would be meaningful.)  If we are to believe these expert economists, it doesn’t matter what is happening to actual prices or outstanding debt levels, not so long as we squint very carefully at only those metrics that we believe to define the situation.\nAnd this is why I pay attention to indicators beyond those that I personally believe to be significant, because unlike the Keynesians, I am more interested in knowing what is actually taking place than I am in\nmanipulating the public\nbolstering animal spirits.  If I am incorrect and we are headed for hyperinflation rather than debt-deflation, I would certainly like to know as soon as possible.  The speed and complexity of economic events means that every economist is going to be proven wrong on a regular basis.  Therefore, it behooves anyone with an interest in economics to refuse to be unduly wedded to any specific understanding or definition.  This does should not be confused with some sort of conceptual relativism, it is merely a recognition of the inability of even the best economic models to reflect observable reality.\nIn any event, Calabria is correct.  There is no rational defense of quantitative easing, regardless of the way in which one chooses to define inflation.  QE2 is not an economic policy, it is the bank rape of the global economy.  And by the way, there is an easier way to blow apart\nBeckworth’s case\nthan Calabria does.\n“Because the monetary base has been increasing so rapidly and there has been very little inflation, it must be the case that demand for the money must be increasing even more.”\nVery well.  Where is that “significant portion of the money supply” upon which the dread hoarders are supposedly sitting?  Have bank deposits increased significantly?  Beckworth also makes a classic Keynesian blunder in saying: “It fails to recognize that for every debtor there must be a creditor.”  (Keynesians absolutely love this macro equivalence nonsense.)  Of course, what happens when the debtor defaults….",
  "tags": [
    "banks"
  ],
  "categories": [],
  "sitemap_lastmod": "2010-12-01T18:34:00+00:00"
}