{
  "url": "https://voxday.net/2010/12/28/failure-of-empiricis/",
  "scraped_at": "2025-12-13T16:00:37.729317",
  "title": "The failure of empiricism",
  "date_display": "December 28, 2010",
  "date_iso": "2010-12-28T14:15:00+00:00",
  "date_from_url": "2010-12-28",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>Ironically, even as the atheistic cult of science fetishism vehemently insists that only science is capable of determining truth and now even morality, genuine scientists are gradually coming to realize that the scientific method is not only incapable of being the sole arbiter of truth, <a href=\"http://www.newyorker.com/reporting/2010/12/13/101213fa_fact_lehrer?currentPage=1\">it isn’t even capable of dependably producing consistent scientific evidence</a> when it is properly utilized:</p><blockquote><p>The premise of replicability is that the scientific community can correct for these flaws.  But now all sorts of well-established, multiply confirmed findings have started to look increasingly uncertain. It’s as if our facts were losing their truth: claims that have been enshrined in textbooks are suddenly unprovable. This phenomenon doesn’t yet have an official name, but it’s occurring across a wide range of fields, from psychology to ecology. In the field of medicine, the phenomenon seems extremely widespread, affecting not only antipsychotics but also therapies ranging from cardiac stents to Vitamin E and antidepressants: Davis has a forthcoming analysis demonstrating that the efficacy of antidepressants has gone down as much as threefold in recent decades.</p><p>For many scientists, the effect is especially troubling because of what it exposes about the scientific process. If replication is what separates the rigor of science from the squishiness of pseudoscience, where do we put all these rigorously validated findings that can no longer be proved? Which results should we believe? Francis Bacon, the early-modern philosopher and pioneer of the scientific method, once declared that experiments were essential, because they allowed us to “put nature to the question.” But it appears that nature often gives us different answers….</p><p>The disturbing implication of the Crabbe study is that a lot of extraordinary scientific data are nothing but noise.</p></blockquote><p>Murray Rothbard was an agnostic who repeatedly made the conclusive logical case against empiricism.  It applied not only to economics and the Samuelsonian empiricism that presently serves as the basis for modern mainstream economics, but the basic concept of empiricism in general.  Yet despite the decades-old Rothbardian case, the science cult continues to ignorantly insist that the only reason anyone could ever possibly doubt empiricism is religious dogmatism, thereby proving Rothbard’s point.  Between scientific fraud, the decline effect, publication bias, selective reporting, and the long, verifiable history of disproven scientific assertions, it is astonishing that <i>anyone</i> would still attempt to argue that science is a reliable arbiter of anything outside a very narrow range of applied hard disciplines, let alone the only one that merits use.</p><p>And some still doubt that God has a sense of humor.</p></div>",
  "content_text": "Ironically, even as the atheistic cult of science fetishism vehemently insists that only science is capable of determining truth and now even morality, genuine scientists are gradually coming to realize that the scientific method is not only incapable of being the sole arbiter of truth,\nit isn’t even capable of dependably producing consistent scientific evidence\nwhen it is properly utilized:\nThe premise of replicability is that the scientific community can correct for these flaws.  But now all sorts of well-established, multiply confirmed findings have started to look increasingly uncertain. It’s as if our facts were losing their truth: claims that have been enshrined in textbooks are suddenly unprovable. This phenomenon doesn’t yet have an official name, but it’s occurring across a wide range of fields, from psychology to ecology. In the field of medicine, the phenomenon seems extremely widespread, affecting not only antipsychotics but also therapies ranging from cardiac stents to Vitamin E and antidepressants: Davis has a forthcoming analysis demonstrating that the efficacy of antidepressants has gone down as much as threefold in recent decades.\nFor many scientists, the effect is especially troubling because of what it exposes about the scientific process. If replication is what separates the rigor of science from the squishiness of pseudoscience, where do we put all these rigorously validated findings that can no longer be proved? Which results should we believe? Francis Bacon, the early-modern philosopher and pioneer of the scientific method, once declared that experiments were essential, because they allowed us to “put nature to the question.” But it appears that nature often gives us different answers….\nThe disturbing implication of the Crabbe study is that a lot of extraordinary scientific data are nothing but noise.\nMurray Rothbard was an agnostic who repeatedly made the conclusive logical case against empiricism.  It applied not only to economics and the Samuelsonian empiricism that presently serves as the basis for modern mainstream economics, but the basic concept of empiricism in general.  Yet despite the decades-old Rothbardian case, the science cult continues to ignorantly insist that the only reason anyone could ever possibly doubt empiricism is religious dogmatism, thereby proving Rothbard’s point.  Between scientific fraud, the decline effect, publication bias, selective reporting, and the long, verifiable history of disproven scientific assertions, it is astonishing that\nanyone\nwould still attempt to argue that science is a reliable arbiter of anything outside a very narrow range of applied hard disciplines, let alone the only one that merits use.\nAnd some still doubt that God has a sense of humor.",
  "tags": [
    "science"
  ],
  "categories": [],
  "sitemap_lastmod": "2010-12-28T14:15:00+00:00"
}