{
  "url": "https://voxday.net/2010/12/09/faith-in-reason/",
  "scraped_at": "2026-01-08T23:44:59.023535",
  "title": "Misplaced faith in reason",
  "date_display": "December 9, 2010",
  "date_iso": "2010-12-09T20:55:00+00:00",
  "date_from_url": "2010-12-09",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>Scott Atran <a href=\"http://www.literaryreview.co.uk/gray_12_10.html\">scientifically demolishes a cherished atheist belief</a> in his new book <i>Talking to the Enemy: Violent Extremism, Sacred Values, and What It Means to Be Human</i>:</p><blockquote><p>Seeing humans as essentially driven by their passions, Hobbes cherished little hope that they would ever be guided by reason. Still, he never doubted that if people were more rational they would be less prone to violence. How could any sane person not seek peace? After all, everyone wants to go on living – or so Hobbes wanted to believe.</p><p>Something like Hobbes’s analysis (though without his refreshing pessimism or his wonderfully terse prose style) has resurfaced today in regard to suicide bombing. If you read evangelical atheists like Richard Dawkins, you will be told that suicide bombers are driven by their irrational religious beliefs. ‘Suicide bombers do what they do’, writes Dawkins in a passage cited by Scott Atran, ‘because they really believe what they were taught in their religious schools; that duty to God exceeds all other priorities, and that martyrdom in his service will be rewarded in the gardens of Paradise.’ What is striking about claims of this kind is that they are rarely accompanied by evidence. They are asserted as self-evident truths – in other words, articles of faith. In fact, as Atran writes, religion is not particularly prominent in the formation of jihadi groups….</p><p>Unlike Dawkins’s assertions, Atran’s account of violent jihadism is based on extensive empirical research. An anthropologist who has spent many years studying and talking to terrorists in Indonesia, Afghanistan, Gaza and Europe, Atran believes that what motivates them to go willingly to their deaths is not so much the cause they espouse – rationally or otherwise – but the relationships they form with each other. Terrorists kill and die ‘for their group, whose cause makes their imagined family of genetic strangers – their brotherhood, fatherland, motherland, homeland, totem or tribe’. In this terrorists are no different from other human beings. They may justify their actions by reference to religion, but many do not. The techniques of suicide bombing were first developed by the Tamil Tigers, a Marxist-Leninist group hostile to all religions, while suicide bombers in Lebanon in the 1980s included many secular leftists. The Japanese Aum cult, which recruited biologists and geneticists and experimented with anthrax as a weapon of mass destruction, cobbled together its grotesque system of beliefs from many sources, including science fiction. Terrorists have held to many views of the world, including some – like Marxism-Leninism – that claim to be grounded in ‘scientific atheism’. If religion is a factor in terrorism, it is only one among many.</p></blockquote><p>This is precisely what I pointed out in TIA when criticizing Sam Harris’s error-filled <i>The End of Faith</i>, although I didn’t need to perform any extensive empirical research as a basic knowledge of military history was sufficient.  But it is satisfying to see that more and more atheists are beginning to see what I explained two years ago: the New Atheists have not utilized any science in their ideological campaign against religion in general and Christianity in particular, they are nothing more than ideological propagandists attempting to further a specific and virulent form of secularist philosophy.  And while they do utilize a good deal of reason – the cases they present are uniformly <i>philosophical</i> cases rather than scientific ones – the more important point is that they seldom utilize it <i>correctly</i>.</p><p>Anyone conversant with military history knows that suicide bombing is a fairly conventional weapon of the desperate and the weak.  And it’s a remarkably ineffective weapon at that; even if suicide bombing could be reasonably connected to religion, it would make for a strong argument that religion is not only seldom a cause of war, it also happens to be almost completely useless in practicing war.</p></div>",
  "content_text": "Scott Atran\nscientifically demolishes a cherished atheist belief\nin his new book\nTalking to the Enemy: Violent Extremism, Sacred Values, and What It Means to Be Human\n:\nSeeing humans as essentially driven by their passions, Hobbes cherished little hope that they would ever be guided by reason. Still, he never doubted that if people were more rational they would be less prone to violence. How could any sane person not seek peace? After all, everyone wants to go on living – or so Hobbes wanted to believe.\nSomething like Hobbes’s analysis (though without his refreshing pessimism or his wonderfully terse prose style) has resurfaced today in regard to suicide bombing. If you read evangelical atheists like Richard Dawkins, you will be told that suicide bombers are driven by their irrational religious beliefs. ‘Suicide bombers do what they do’, writes Dawkins in a passage cited by Scott Atran, ‘because they really believe what they were taught in their religious schools; that duty to God exceeds all other priorities, and that martyrdom in his service will be rewarded in the gardens of Paradise.’ What is striking about claims of this kind is that they are rarely accompanied by evidence. They are asserted as self-evident truths – in other words, articles of faith. In fact, as Atran writes, religion is not particularly prominent in the formation of jihadi groups….\nUnlike Dawkins’s assertions, Atran’s account of violent jihadism is based on extensive empirical research. An anthropologist who has spent many years studying and talking to terrorists in Indonesia, Afghanistan, Gaza and Europe, Atran believes that what motivates them to go willingly to their deaths is not so much the cause they espouse – rationally or otherwise – but the relationships they form with each other. Terrorists kill and die ‘for their group, whose cause makes their imagined family of genetic strangers – their brotherhood, fatherland, motherland, homeland, totem or tribe’. In this terrorists are no different from other human beings. They may justify their actions by reference to religion, but many do not. The techniques of suicide bombing were first developed by the Tamil Tigers, a Marxist-Leninist group hostile to all religions, while suicide bombers in Lebanon in the 1980s included many secular leftists. The Japanese Aum cult, which recruited biologists and geneticists and experimented with anthrax as a weapon of mass destruction, cobbled together its grotesque system of beliefs from many sources, including science fiction. Terrorists have held to many views of the world, including some – like Marxism-Leninism – that claim to be grounded in ‘scientific atheism’. If religion is a factor in terrorism, it is only one among many.\nThis is precisely what I pointed out in TIA when criticizing Sam Harris’s error-filled\nThe End of Faith\n, although I didn’t need to perform any extensive empirical research as a basic knowledge of military history was sufficient.  But it is satisfying to see that more and more atheists are beginning to see what I explained two years ago: the New Atheists have not utilized any science in their ideological campaign against religion in general and Christianity in particular, they are nothing more than ideological propagandists attempting to further a specific and virulent form of secularist philosophy.  And while they do utilize a good deal of reason – the cases they present are uniformly\nphilosophical\ncases rather than scientific ones – the more important point is that they seldom utilize it\ncorrectly\n.\nAnyone conversant with military history knows that suicide bombing is a fairly conventional weapon of the desperate and the weak.  And it’s a remarkably ineffective weapon at that; even if suicide bombing could be reasonably connected to religion, it would make for a strong argument that religion is not only seldom a cause of war, it also happens to be almost completely useless in practicing war.",
  "tags": [
    "atheism"
  ],
  "categories": [],
  "sitemap_lastmod": "2010-12-09T20:55:00+00:00"
}