{
  "url": "https://voxday.net/2010/12/15/glorious-return-of-uber-dawks/",
  "scraped_at": "2025-12-13T15:59:39.570127",
  "title": "The glorious return of Uber Dawks",
  "date_display": "December 15, 2010",
  "date_iso": "2010-12-15T20:30:00+00:00",
  "date_from_url": "2010-12-15",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>Speaking of social autism, Uber Dawks offers this timely reminder that atheists who believe in reason don’t actually tend to utilize it well:</p><blockquote><p>I see that your and fellow idiot fundies at WND who are somehow trying spin the Florida School Board shooting story into an anti-atheist screed because the shooter listed his religion as “Humanist” and was obviously ultra-liberal. I am now anxiously awaiting the typical Vox Day commentary bereft of logic and reason, much like your belief in Jesus.</p><p>This is typical conservative bait and switch and it disgusts me. You and your WND comrades should be ashamed. The world would be a better place if you idiots would just realize that you are fighting a losing battle against progress, including atheism and social equality. You just don’t understand that the human society is evolving into a better social construct, much like humans themselves have evolved into creatures that transcend racial inequality and sexual biology. We are no longer driven by the need to herd and procreate but have progressed into a society where freethinking is encouraged and sexual preference has transcended basic biology.</p><p>I’ve said it before an I’ll say it again – YOU IDIOT FUNDIES ARE LOSING! Humanism is a philosophy that will take over because it is based on REASON – and no smear campaign against it like linking a crazed Florida shooter to humanism will change that. Learn to give up your myths and this season celebrate reason. You people infuriate me and I anxiously await the day that you have been pushed out by science reason and are gone from our society.</p></blockquote><p>Ah, yet another atheist arguing that the actions of a humanist [and probable atheist] should not be cited as an argument against atheism even though he has cited the actions of religious individuals as an argument against religion in the past.  No doubt he would similarly argue that mass murders committed by atheists cannot possibly be attributed to their atheism even as he “anxiously” awaits the day that “science reason” has pushed theists out of his society.  No doubt that’s just a coincidence and has nothing to do with his own atheism, right?</p><p>And who but an atheist would ever think to take the example of a humanist committing suicide and attempt to spin it into evidence for the ultimate triumph of humanism.  Remember, these people <i>genuinely</i> believe they are more intelligent than you are.</p><p>UPDATE: Uber Dawks adds the following: <i>You are missing the point entirely. The man did not shoot at others and then kill himself BECAUSE he was a humanist or an atheist, which is the same mistake you make when you mention Stalin or Mao or Pol Pot.  The conservative media is already pointing to his atheism/humanism in order to paint the same sort of idiotic argument you make when mentioning the atheism of Joseph Stalin, etc. Epic fail.</i></p><p>Interesting.  And leads to the question, would Uber Dawk hate “IDIOT FUNDIES” and dream about “Science Reason” pushing them from his society if he were not an atheist?  Isn’t it his atheism that is behind his hatred?  Some people really need to stop deifying reason and start using it.</p></div>",
  "content_text": "Speaking of social autism, Uber Dawks offers this timely reminder that atheists who believe in reason don’t actually tend to utilize it well:\nI see that your and fellow idiot fundies at WND who are somehow trying spin the Florida School Board shooting story into an anti-atheist screed because the shooter listed his religion as “Humanist” and was obviously ultra-liberal. I am now anxiously awaiting the typical Vox Day commentary bereft of logic and reason, much like your belief in Jesus.\nThis is typical conservative bait and switch and it disgusts me. You and your WND comrades should be ashamed. The world would be a better place if you idiots would just realize that you are fighting a losing battle against progress, including atheism and social equality. You just don’t understand that the human society is evolving into a better social construct, much like humans themselves have evolved into creatures that transcend racial inequality and sexual biology. We are no longer driven by the need to herd and procreate but have progressed into a society where freethinking is encouraged and sexual preference has transcended basic biology.\nI’ve said it before an I’ll say it again – YOU IDIOT FUNDIES ARE LOSING! Humanism is a philosophy that will take over because it is based on REASON – and no smear campaign against it like linking a crazed Florida shooter to humanism will change that. Learn to give up your myths and this season celebrate reason. You people infuriate me and I anxiously await the day that you have been pushed out by science reason and are gone from our society.\nAh, yet another atheist arguing that the actions of a humanist [and probable atheist] should not be cited as an argument against atheism even though he has cited the actions of religious individuals as an argument against religion in the past.  No doubt he would similarly argue that mass murders committed by atheists cannot possibly be attributed to their atheism even as he “anxiously” awaits the day that “science reason” has pushed theists out of his society.  No doubt that’s just a coincidence and has nothing to do with his own atheism, right?\nAnd who but an atheist would ever think to take the example of a humanist committing suicide and attempt to spin it into evidence for the ultimate triumph of humanism.  Remember, these people\ngenuinely\nbelieve they are more intelligent than you are.\nUPDATE: Uber Dawks adds the following:\nYou are missing the point entirely. The man did not shoot at others and then kill himself BECAUSE he was a humanist or an atheist, which is the same mistake you make when you mention Stalin or Mao or Pol Pot.  The conservative media is already pointing to his atheism/humanism in order to paint the same sort of idiotic argument you make when mentioning the atheism of Joseph Stalin, etc. Epic fail.\nInteresting.  And leads to the question, would Uber Dawk hate “IDIOT FUNDIES” and dream about “Science Reason” pushing them from his society if he were not an atheist?  Isn’t it his atheism that is behind his hatred?  Some people really need to stop deifying reason and start using it.",
  "tags": [
    "atheism",
    "mailvox"
  ],
  "categories": [],
  "sitemap_lastmod": "2010-12-15T20:30:00+00:00"
}