{
  "url": "https://voxday.net/2010/12/22/i-has-pretty-fee/",
  "scraped_at": "2025-12-13T16:00:15.991308",
  "title": "I has pretty feet",
  "date_display": "December 22, 2010",
  "date_iso": "2010-12-22T17:25:00+00:00",
  "date_from_url": "2010-12-22",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>This may be the best NFL scandal yet.  I don’t dare think about <a href=\"http://profootballtalk.nbcsports.com/2010/12/22/the-latest-jets-controversy-is-the-strangest-one-yet/\">this </a>too much or I might hurt myself from laughing… F-E-E-T, Feet, Feet, FEET!:</p><blockquote><p>Just when it appeared that one of the craziest NFL seasons in NFL history could get no crazier, one of the craziest stories we can ever recall has emerged.  On Tuesday, I was rendered speechless (a rare occurrence for me) when I saw <a href=\"http://deadspin.com/5715741/this-may-or-may-not-be-rex-ryans-wife-making-foot+fetish-videos?skyline=true&amp;s=i\">the Deadspin item</a> about the eerie similarities between the wife of Jets coach Rex Ryan and someone who previously posted a series of foot-fetish videos on YouTube.</p></blockquote><p>My only regret is that it was Rex Ryan’s wife and not Deanna Favre.  That would have served as the perfect capstone on #4’s career.  People are so awesome, they really are.  And to think some people still can’t figure out why God created Man and gave him free will.</p></div>",
  "content_text": "This may be the best NFL scandal yet.  I don’t dare think about\nthis\ntoo much or I might hurt myself from laughing… F-E-E-T, Feet, Feet, FEET!:\nJust when it appeared that one of the craziest NFL seasons in NFL history could get no crazier, one of the craziest stories we can ever recall has emerged.  On Tuesday, I was rendered speechless (a rare occurrence for me) when I saw\nthe Deadspin item\nabout the eerie similarities between the wife of Jets coach Rex Ryan and someone who previously posted a series of foot-fetish videos on YouTube.\nMy only regret is that it was Rex Ryan’s wife and not Deanna Favre.  That would have served as the perfect capstone on #4’s career.  People are so awesome, they really are.  And to think some people still can’t figure out why God created Man and gave him free will.",
  "tags": [
    "freakshow"
  ],
  "categories": [],
  "sitemap_lastmod": "2010-12-22T17:25:00+00:00"
}