{
  "url": "https://voxday.net/2010/12/21/ill-effects-of-immigration/",
  "scraped_at": "2025-12-13T16:00:10.527667",
  "title": "Ill-effects of immigration",
  "date_display": "December 21, 2010",
  "date_iso": "2010-12-21T16:15:00+00:00",
  "date_from_url": "2010-12-21",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>Lest you doubt my assertion that sufficient amounts of immigration <a href=\"http://mankatofreepress.com/local/x1531216993/Santa-gets-the-heave-ho-ho-ho\">invariably imposes unwelcome change</a> on the native population:</p><blockquote><p>Dennis Jackson said it was over-reaching cultural sensitivity that led to being told his annual Santa appearances must cease at St. Peter Head Start classes for young children.  Jackson said he was told “it was against some people’s wishes” for him to make the half-hour appearances for two classes catering to about three dozen children.  He said St. Peter Head Start personnel gave him no reason for the action. He’s made Santa appearances there the past four years to dispense candy bought at his own expense….</p><p>Chris Marben, who coordinates regional Head Start programs through Mankato-based Minnesota Valley Action Council, said as much.  “We have Somali families in the program,” she said. “We’re respecting the wishes of families in the program.”</p></blockquote><p>Marben should be fired and those obnoxious Somali families should be sent back to Somalia.  This is why distrust, dislike, and even downright hatred of immigrants is not only quite reasonable on occasion, but can be well-merited.  All the people in Mankato want to do is celebrate Christmas the way they have always done, and thanks to a few obnoxious immigrants acting in combination with a petty autocratic bureaucracy, they are not permitted to do so.  If the Somalis so dislike Santa, then they should stay in Santa-free Somalia.</p><p>Consider the Misean take on the subject, himself an immigrant to the United States: “<i>Immigrants soon find their place in urban life, they soon adopt, externally, town manners and opinions, but for a long time they remain foreign to civic thought. One cannot make a social philosophy one’s own as easily as a new costume.”</i></p></div>",
  "content_text": "Lest you doubt my assertion that sufficient amounts of immigration\ninvariably imposes unwelcome change\non the native population:\nDennis Jackson said it was over-reaching cultural sensitivity that led to being told his annual Santa appearances must cease at St. Peter Head Start classes for young children.  Jackson said he was told “it was against some people’s wishes” for him to make the half-hour appearances for two classes catering to about three dozen children.  He said St. Peter Head Start personnel gave him no reason for the action. He’s made Santa appearances there the past four years to dispense candy bought at his own expense….\nChris Marben, who coordinates regional Head Start programs through Mankato-based Minnesota Valley Action Council, said as much.  “We have Somali families in the program,” she said. “We’re respecting the wishes of families in the program.”\nMarben should be fired and those obnoxious Somali families should be sent back to Somalia.  This is why distrust, dislike, and even downright hatred of immigrants is not only quite reasonable on occasion, but can be well-merited.  All the people in Mankato want to do is celebrate Christmas the way they have always done, and thanks to a few obnoxious immigrants acting in combination with a petty autocratic bureaucracy, they are not permitted to do so.  If the Somalis so dislike Santa, then they should stay in Santa-free Somalia.\nConsider the Misean take on the subject, himself an immigrant to the United States: “\nImmigrants soon find their place in urban life, they soon adopt, externally, town manners and opinions, but for a long time they remain foreign to civic thought. One cannot make a social philosophy one’s own as easily as a new costume.”",
  "tags": [
    "immigration"
  ],
  "categories": [],
  "sitemap_lastmod": "2010-12-21T16:15:00+00:00"
}