{
  "url": "https://voxday.net/2010/12/03/inherit-science/",
  "scraped_at": "2026-01-08T23:44:23.919637",
  "title": "Inherit the Science",
  "date_display": "December 3, 2010",
  "date_iso": "2010-12-03T16:31:00+00:00",
  "date_from_url": "2010-12-03",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>Smarmy evolutionists and socially handicapped atheists almost invariably bring up the Scopes trial when confronting religious individuals or anyone skeptical about the theory of evolution by (probably) natural selection.  Of course, as is reliably the case, they know next to nothing about it, it is merely a social marker upon which they’ve learned to place importance in the course of their cultural indoctrination. <a href=\"http://www.nationalreview.com/corner/254429/inherit-racism-jonah-goldberg\">Jonah Goldberg</a> brings to our attention a few of the more interesting <a href=\"http://www-personal.umd.umich.edu/~ppennock/doc-scopesText.htm\">aspects of the science</a> that the defenders of the secular faith still deem so vital to teach in public schools:</p><blockquote><p>“The Races of Man. – At the present time there exist upon the earth five races or varieties of man, each very different from the other in instincts, social customs, and, to an extent, in structure. These are the Ethiopian or negro type, originating in Africa; the Malay or brown race, from the islands of the Pacific; the American Indian; the Mongolian or yellow race, including the natives of China, Japan, and the Eskimos; and finally, the highest race type of all, the Caucasians, represented by the civilized white inhabitants of Europe and America….</p><p>Improvement of Man. – If the stock of domesticated animals can be improved, it is not unfair to ask if the health and vigor of the future generations of men and women on the earth might be improved by applying to them the laws of selection. This improvement of the future race has a number of factors in which as individuals may play a part. These are personal hygiene, selection of healthy mates, and the betterment of the environment.</p><p>Eugenics. – When people marry there are certain things that the individual as well as the race should demand. The most important of these is freedom from germ diseases which might be handed down to the offspring. Tuberculosis, syphilis, that dread disease which cripples and kills hundreds of thousands of innocent children, epilepsy, and feeble-mindedness are handicaps which it is not only unfair but criminal to hand down to posterity. The science of being well born is called eugenics.”</p><p>The Remedy. – If such people were lower animals, we would probably kill them off to prevent them from spreading. Humanity will not allow this, but we do have the remedy of separating the sexes in asylums or other places and in various ways preventing intermarriage and the possibilities of perpetuating such a low and degenerate race. Remedies of this sort have been tried successfully in Europe and are now meeting with success in this country. <br> – George William Hunter, <i>A Civic Biology: Presented in Problems</i> (New York, 1914): pp. 193-196, 253-254, 261-263.</br></p></blockquote><p>So, the next time someone smirks and brings up Scopes, the monkey trial, or <i>Inherit the Wind</i> in an attempt to assume a posture of scientific superiority, don’t forget to ask them which aspect of elementary biology they deem the most important to teach to American schoolchildren, the mechanism of natural selection, the moral imperative of artificial selection, the criminalization of unfit breeding, the forcible placement of the inferior in asylums, or the supremacy of the white race.</p></div>",
  "content_text": "Smarmy evolutionists and socially handicapped atheists almost invariably bring up the Scopes trial when confronting religious individuals or anyone skeptical about the theory of evolution by (probably) natural selection.  Of course, as is reliably the case, they know next to nothing about it, it is merely a social marker upon which they’ve learned to place importance in the course of their cultural indoctrination.\nJonah Goldberg\nbrings to our attention a few of the more interesting\naspects of the science\nthat the defenders of the secular faith still deem so vital to teach in public schools:\n“The Races of Man. – At the present time there exist upon the earth five races or varieties of man, each very different from the other in instincts, social customs, and, to an extent, in structure. These are the Ethiopian or negro type, originating in Africa; the Malay or brown race, from the islands of the Pacific; the American Indian; the Mongolian or yellow race, including the natives of China, Japan, and the Eskimos; and finally, the highest race type of all, the Caucasians, represented by the civilized white inhabitants of Europe and America….\nImprovement of Man. – If the stock of domesticated animals can be improved, it is not unfair to ask if the health and vigor of the future generations of men and women on the earth might be improved by applying to them the laws of selection. This improvement of the future race has a number of factors in which as individuals may play a part. These are personal hygiene, selection of healthy mates, and the betterment of the environment.\nEugenics. – When people marry there are certain things that the individual as well as the race should demand. The most important of these is freedom from germ diseases which might be handed down to the offspring. Tuberculosis, syphilis, that dread disease which cripples and kills hundreds of thousands of innocent children, epilepsy, and feeble-mindedness are handicaps which it is not only unfair but criminal to hand down to posterity. The science of being well born is called eugenics.”\nThe Remedy. – If such people were lower animals, we would probably kill them off to prevent them from spreading. Humanity will not allow this, but we do have the remedy of separating the sexes in asylums or other places and in various ways preventing intermarriage and the possibilities of perpetuating such a low and degenerate race. Remedies of this sort have been tried successfully in Europe and are now meeting with success in this country.\n– George William Hunter,\nA Civic Biology: Presented in Problems\n(New York, 1914): pp. 193-196, 253-254, 261-263.\nSo, the next time someone smirks and brings up Scopes, the monkey trial, or\nInherit the Wind\nin an attempt to assume a posture of scientific superiority, don’t forget to ask them which aspect of elementary biology they deem the most important to teach to American schoolchildren, the mechanism of natural selection, the moral imperative of artificial selection, the criminalization of unfit breeding, the forcible placement of the inferior in asylums, or the supremacy of the white race.",
  "tags": [
    "history",
    "science"
  ],
  "categories": [],
  "sitemap_lastmod": "2010-12-03T16:31:00+00:00"
}