{
  "url": "https://voxday.net/2010/12/02/irish-hitler/",
  "scraped_at": "2026-01-08T23:44:18.422758",
  "title": "An Irish Hitler?",
  "date_display": "December 2, 2010",
  "date_iso": "2010-12-02T14:30:00+00:00",
  "date_from_url": "2010-12-02",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>Economist Barry Eichengreen <a href=\"http://www.irisheconomy.ie/index.php/2010/12/01/barry-eichengreen-on-the-irish-bailout/#more-8831\">reconsiders the European Union</a>:</p><blockquote><p>It pains me to say this. I’m probably the most pro-euro economist on my side of the Atlantic. Not because I think the euro area is the perfect monetary union, but because I have always thought that a Europe of scores of national currencies would be even less stable. I’m also a believer in the larger European project. But given this abject failure of European and German leadership, I am going to have to rethink my position.</p><p>The Irish “program” solves exactly nothing – it simply kicks the can down the road. A public debt that will now top out at around 130 per cent of GDP has not been reduced by a single cent. The interest payments that the Irish sovereign will have to make have not been reduced by a single cent, given the rate of 5.8% on the international loan. After a couple of years, not just interest but also principal is supposed to begin to be repaid. Ireland will be transferring nearly 10 per cent of its national income as reparations to the bondholders, year after painful year.</p><p>This is not politically sustainable, as anyone who remembers Germany’s own experience with World War I reparations should know.</p></blockquote><p>I like Eichengreen’s work, but he is incorrect.  The failure of the European Union is not a failure of French and German leadership, it is the structural failure of yet another European experiment in authoritarian, anti-democratic, centralized empire.  Now, I tend to doubt that Ireland is going to develop into the 21st century version of National Socialist Germany for numerous reasons, chief among them the fact that it is an island without a navy.  But given the harsh burden being imposed on the Irish people by their European and Irish governments for the foreseeable future, one can see where <i>The Economic Consequences of the Peace</i> might make for a timely read right about now.</p></div>",
  "content_text": "Economist Barry Eichengreen\nreconsiders the European Union\n:\nIt pains me to say this. I’m probably the most pro-euro economist on my side of the Atlantic. Not because I think the euro area is the perfect monetary union, but because I have always thought that a Europe of scores of national currencies would be even less stable. I’m also a believer in the larger European project. But given this abject failure of European and German leadership, I am going to have to rethink my position.\nThe Irish “program” solves exactly nothing – it simply kicks the can down the road. A public debt that will now top out at around 130 per cent of GDP has not been reduced by a single cent. The interest payments that the Irish sovereign will have to make have not been reduced by a single cent, given the rate of 5.8% on the international loan. After a couple of years, not just interest but also principal is supposed to begin to be repaid. Ireland will be transferring nearly 10 per cent of its national income as reparations to the bondholders, year after painful year.\nThis is not politically sustainable, as anyone who remembers Germany’s own experience with World War I reparations should know.\nI like Eichengreen’s work, but he is incorrect.  The failure of the European Union is not a failure of French and German leadership, it is the structural failure of yet another European experiment in authoritarian, anti-democratic, centralized empire.  Now, I tend to doubt that Ireland is going to develop into the 21st century version of National Socialist Germany for numerous reasons, chief among them the fact that it is an island without a navy.  But given the harsh burden being imposed on the Irish people by their European and Irish governments for the foreseeable future, one can see where\nThe Economic Consequences of the Peace\nmight make for a timely read right about now.",
  "tags": [
    "EU",
    "history"
  ],
  "categories": [],
  "sitemap_lastmod": "2010-12-02T14:30:00+00:00"
}