{
  "url": "https://voxday.net/2010/12/12/ivy-league-inbreeding/",
  "scraped_at": "2026-01-08T23:45:13.417499",
  "title": "Ivy League inbreeding",
  "date_display": "December 12, 2010",
  "date_iso": "2010-12-12T11:59:00+00:00",
  "date_from_url": "2010-12-12",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>Needless to say, <a href=\"http://www.reuters.com/article/idUSTRE6B94RN20101210\">this example of Ivy League inbreeding</a> is going to be brought up every time someone from New York City tries to rag on Southerners, rednecks, or hillbillies for their supposed predilection for overly close families:</p><blockquote><p>A Columbia University professor has been arrested on charges of having sexual relations with his daughter, officials said on Friday. David Epstein, 46, a political science professor at the Ivy League school, faces one count of incest in the third degree, according to a complaint filed by the Manhattan District Attorney’s office.  He had relations with his daughter, now 24, from 2006 through 2009, the complaint said. Epstein was released on his own recognizance after appearing before a judge on Thursday.</p></blockquote><p>Given the spurious rationales that various judiciaries have used to legalize homosexuality and homogamy, it’s only a matter of time before relationships like the Epsteins are deemed to be legal as well, assuming that one in fact existed.  Once traditional mores have been thrown out the window, it is very difficult to rationally declare “thus far and no farther” since every single argument made in support of those legal abominations can just as easily be utilized in this case.  If the professor chooses to vigorously defend himself on those terms, he should have a pretty good chance of being exonerated even if he is guilty.  It should be interesting to see what folks like John Scalzi and other outspoken supporters of state-sanctioned homogamy have to say about this case.</p><p>Of course, if he is exonerated and Epstein v. New York becomes the incestuous version of Lawrence v. Texas, one will be forced to conclude that the Other McCain <a href=\"http://theothermccain.com/2010/12/10/palin-hating-columbia-professor-huffington-post-blogger-busted-for-incest/\">has summarized the national prospects</a> well: <i>“Tomorrow’s forecast: Widely scattered fire with a 60% chance of afternoon and evening brimstone.”</i></p></div>",
  "content_text": "Needless to say,\nthis example of Ivy League inbreeding\nis going to be brought up every time someone from New York City tries to rag on Southerners, rednecks, or hillbillies for their supposed predilection for overly close families:\nA Columbia University professor has been arrested on charges of having sexual relations with his daughter, officials said on Friday. David Epstein, 46, a political science professor at the Ivy League school, faces one count of incest in the third degree, according to a complaint filed by the Manhattan District Attorney’s office.  He had relations with his daughter, now 24, from 2006 through 2009, the complaint said. Epstein was released on his own recognizance after appearing before a judge on Thursday.\nGiven the spurious rationales that various judiciaries have used to legalize homosexuality and homogamy, it’s only a matter of time before relationships like the Epsteins are deemed to be legal as well, assuming that one in fact existed.  Once traditional mores have been thrown out the window, it is very difficult to rationally declare “thus far and no farther” since every single argument made in support of those legal abominations can just as easily be utilized in this case.  If the professor chooses to vigorously defend himself on those terms, he should have a pretty good chance of being exonerated even if he is guilty.  It should be interesting to see what folks like John Scalzi and other outspoken supporters of state-sanctioned homogamy have to say about this case.\nOf course, if he is exonerated and Epstein v. New York becomes the incestuous version of Lawrence v. Texas, one will be forced to conclude that the Other McCain\nhas summarized the national prospects\nwell:\n“Tomorrow’s forecast: Widely scattered fire with a 60% chance of afternoon and evening brimstone.”",
  "tags": [
    "decline and fall"
  ],
  "categories": [],
  "sitemap_lastmod": "2010-12-12T11:59:00+00:00"
}