{
  "url": "https://voxday.net/2010/12/21/krugman-asks-question/",
  "scraped_at": "2025-12-13T16:00:12.360546",
  "title": "Krugman asks the question",
  "date_display": "December 21, 2010",
  "date_iso": "2010-12-21T19:30:00+00:00",
  "date_from_url": "2010-12-21",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>Fresh from presenting a FIFTH Neo-Keynesian definition of inflation in the form of “core inflation”, Paul Krugman finally begins to pay attention to <a href=\"http://krugman.blogs.nytimes.com/2010/12/15/what-is-money/\">the actual issue at hand</a>:</p><blockquote><p>I’d like to highlight one aspect of this discussion that has been striking me: the conservative focus on the evils of increasing the money supply.  You hear it all the time: the Fed is printing money! Danger, Will Robinson! In some comments on this blog I see assertions that the true measure of inflation isn’t prices, it’s what happens to the quantity of money.</p><p>Now, one thing you might immediately say is that for those who care about, know, actually buying things — you can’t eat money — it’s prices of goods that matter; and for the past three decades, as shown above, there has been remarkably little relationship between the standard monetary aggregates and the inflation rate.</p><p>But here’s an even more basic question: what is money, anyway?</p></blockquote><p>As I’ve shown in the first two inflation videos <a href=\"http://www.youtube.com/user/Voxiversity\">on Channel Vox</a>, it’s absurd for Krugman to talk about “the inflation rate” when he can’t settle on one single reliable definition of inflation.  However, he would have been correct to say that the relationship between the standard money aggregates and those various definitions is questionable, but he ignores the fact that the monetarists utilize, (or, as it suits them, refuse to utilize) a fudge factor called “velocity” in order to explain the variances in that relationship.</p><p>About which more anon.  I would have already released the third video if I hadn’t lost my voice last week.  I hope to record it soon, but I doubt I’ll be able to get it down before Christmas.  Regardless, I find it ironic that Austrian theory is logically strong enough that even a blind squirrel like Krugman can stumble onto the foundation of some of its definitions despite his willful ignorance of its teachings.</p><p><i>“The truth is that these days — with credit cards, electronic money, repo, and more all serving the purpose of medium of exchange — it’s not clear that any single number deserves to be called “the” money supply.”</i></p><p>Of course, Krugman still manages to miss the obvious conclusion, which is that either the inflation rate depends upon whatever metric most merits being described as the money supply or else there is no such thing as inflation.  As for his statement that one can maintain a reasonable monetary policy without knowing what money actually is, one need only point to the track record of the Federal Reserve in maintaining price stability and full employment to shatter that assertion.</p></div>",
  "content_text": "Fresh from presenting a FIFTH Neo-Keynesian definition of inflation in the form of “core inflation”, Paul Krugman finally begins to pay attention to\nthe actual issue at hand\n:\nI’d like to highlight one aspect of this discussion that has been striking me: the conservative focus on the evils of increasing the money supply.  You hear it all the time: the Fed is printing money! Danger, Will Robinson! In some comments on this blog I see assertions that the true measure of inflation isn’t prices, it’s what happens to the quantity of money.\nNow, one thing you might immediately say is that for those who care about, know, actually buying things — you can’t eat money — it’s prices of goods that matter; and for the past three decades, as shown above, there has been remarkably little relationship between the standard monetary aggregates and the inflation rate.\nBut here’s an even more basic question: what is money, anyway?\nAs I’ve shown in the first two inflation videos\non Channel Vox\n, it’s absurd for Krugman to talk about “the inflation rate” when he can’t settle on one single reliable definition of inflation.  However, he would have been correct to say that the relationship between the standard money aggregates and those various definitions is questionable, but he ignores the fact that the monetarists utilize, (or, as it suits them, refuse to utilize) a fudge factor called “velocity” in order to explain the variances in that relationship.\nAbout which more anon.  I would have already released the third video if I hadn’t lost my voice last week.  I hope to record it soon, but I doubt I’ll be able to get it down before Christmas.  Regardless, I find it ironic that Austrian theory is logically strong enough that even a blind squirrel like Krugman can stumble onto the foundation of some of its definitions despite his willful ignorance of its teachings.\n“The truth is that these days — with credit cards, electronic money, repo, and more all serving the purpose of medium of exchange — it’s not clear that any single number deserves to be called “the” money supply.”\nOf course, Krugman still manages to miss the obvious conclusion, which is that either the inflation rate depends upon whatever metric most merits being described as the money supply or else there is no such thing as inflation.  As for his statement that one can maintain a reasonable monetary policy without knowing what money actually is, one need only point to the track record of the Federal Reserve in maintaining price stability and full employment to shatter that assertion.",
  "tags": [
    "economics"
  ],
  "categories": [],
  "sitemap_lastmod": "2010-12-21T19:30:00+00:00"
}