{
  "url": "https://voxday.net/2010/12/14/league-of-juvenile-godless/",
  "scraped_at": "2026-01-08T23:45:26.337190",
  "title": "League of the juvenile godless",
  "date_display": "December 14, 2010",
  "date_iso": "2010-12-14T14:15:00+00:00",
  "date_from_url": "2010-12-14",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>Despite their best efforts to conceal it under a facade of reason, they always eventually reveal the essential lack of intellectual and emotional development that underlies <a href=\"http://www.nytimes.com/2010/12/14/us/14atheist.html?hp\">their social autism</a>:</p><blockquote><p>But nowhere has the reaction of believers been so forceful as in Fort Worth, to the delight of Fred Edwords, the national director of the United Coalition of Reason. The coalition’s local chapter spent only $2,400 for four bus ads, which will run through the month in a city with about 200 buses.</p><p>“That’s more brouhaha for the buck than we have seen anywhere,” Mr. Edwords said.</p></blockquote><p>And thus are all the claims that their various ad campaigns are about anything but annoying Christians at Christmastime belied.  Can you even imagine how upset Jews would be if Christians began running ads directly attacking Jewish beliefs during the high holidays in a similar manner?  Or how ballistic Muslims would go if similarly attacked during Ramadan?  Atheists constantly attempt to portray the public celebrations and positive assertions of Christian belief as some sort of attack on their non-belief, but that is nothing more than absurd and juvenile drama-queening.  Consider the lack of equivalency here:</p><p>Christian:  “God loves you.”<br> Atheist:  “You know it’s [the Christmas story of the birth of Jesus Christ] a myth.”</br></p><p>The Christian statement doesn’t say anything about the atheist or his atheism.  While one can correctly deduce that if it is true that God loves you, then he must exist and therefore contradict the atheist belief that he does not, it cannot possibly be considered an attack on atheism of any kind.  The atheist statement, on the other hand, is nothing but an attack on a specific belief of a specific religion.  This isn’t to say all of the atheist ads are attacks; millions of people most certainly are good without God.  They’re simply not good enough to enter into His presence come Judgment Day.</p><p>Now, when Christians start running historically correct ads featuring quotes like “There is No God” and “Science is My Religion” along with pictures of notorious atheist murderers such as Lenin, Stalin, Pol Pot, Mao Tse-tung, Jeffrey Dahmer, and Timothy McVeigh standing red-handed over the stacked skulls of their many victims instead of “God loves You”, atheists can legitimately complain that they’re being attacked.  (Not that such attacks are not merited; they would be provably accurate whereas the atheist “myth” ad is not.)  Until then, they’ve got absolutely nothing to complain about except for being alone of their own choice at Christmastime because a statement that contradicts your beliefs without making any reference to them is not only not an attack, <i>it’s not even about them!</i> And while it’s true that atheists happen to be America’s most-disliked minority, perhaps they should consider not behaving in such an annoying and thoroughly dislikable manner.</p></div>",
  "content_text": "Despite their best efforts to conceal it under a facade of reason, they always eventually reveal the essential lack of intellectual and emotional development that underlies\ntheir social autism\n:\nBut nowhere has the reaction of believers been so forceful as in Fort Worth, to the delight of Fred Edwords, the national director of the United Coalition of Reason. The coalition’s local chapter spent only $2,400 for four bus ads, which will run through the month in a city with about 200 buses.\n“That’s more brouhaha for the buck than we have seen anywhere,” Mr. Edwords said.\nAnd thus are all the claims that their various ad campaigns are about anything but annoying Christians at Christmastime belied.  Can you even imagine how upset Jews would be if Christians began running ads directly attacking Jewish beliefs during the high holidays in a similar manner?  Or how ballistic Muslims would go if similarly attacked during Ramadan?  Atheists constantly attempt to portray the public celebrations and positive assertions of Christian belief as some sort of attack on their non-belief, but that is nothing more than absurd and juvenile drama-queening.  Consider the lack of equivalency here:\nChristian:  “God loves you.”\nAtheist:  “You know it’s [the Christmas story of the birth of Jesus Christ] a myth.”\nThe Christian statement doesn’t say anything about the atheist or his atheism.  While one can correctly deduce that if it is true that God loves you, then he must exist and therefore contradict the atheist belief that he does not, it cannot possibly be considered an attack on atheism of any kind.  The atheist statement, on the other hand, is nothing but an attack on a specific belief of a specific religion.  This isn’t to say all of the atheist ads are attacks; millions of people most certainly are good without God.  They’re simply not good enough to enter into His presence come Judgment Day.\nNow, when Christians start running historically correct ads featuring quotes like “There is No God” and “Science is My Religion” along with pictures of notorious atheist murderers such as Lenin, Stalin, Pol Pot, Mao Tse-tung, Jeffrey Dahmer, and Timothy McVeigh standing red-handed over the stacked skulls of their many victims instead of “God loves You”, atheists can legitimately complain that they’re being attacked.  (Not that such attacks are not merited; they would be provably accurate whereas the atheist “myth” ad is not.)  Until then, they’ve got absolutely nothing to complain about except for being alone of their own choice at Christmastime because a statement that contradicts your beliefs without making any reference to them is not only not an attack,\nit’s not even about them!\nAnd while it’s true that atheists happen to be America’s most-disliked minority, perhaps they should consider not behaving in such an annoying and thoroughly dislikable manner.",
  "tags": [
    "atheism"
  ],
  "categories": [],
  "sitemap_lastmod": "2010-12-14T14:15:00+00:00"
}