{
  "url": "https://voxday.net/2010/12/01/lets-try-this-again/",
  "scraped_at": "2026-01-08T23:44:10.829023",
  "title": "Let’s try this again",
  "date_display": "December 1, 2010",
  "date_iso": "2010-12-01T08:26:00+00:00",
  "date_from_url": "2010-12-01",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p> I think it’s better this time.  I’m getting more familiar with Camtasia, which tends to help, and the volume is significantly louder.  I also managed to utilize the full screen this time instead of inadvertantly leaving a black rectangle around the perimeter.  I also introduced minor errors into two of the graphs; the CPI recalculated for the 0.6% annual error only shows a line including a recalculation for the last ten years and the labels for the dollar devaluation chart were cut off, but I’ve decided to leave it as is so that I can move on to the next one.  I found a better font to use for the pop-up notes as well, or “call-outs” as Camtasia calls them.</p><p>As before, suggestions for improvement would be welcome.  The next video will address why inflation has to include outstanding debt; after that I plan to do videos examining the two conventional definitions of inflation.  If you’re interested in being notified when new videos are uploaded, you can subscribe to the <a href=\"http://www.youtube.com/user/Voxiversity?feature=mhum\">Voxiversity Channel</a>.</p></div>",
  "content_text": "I think it’s better this time.  I’m getting more familiar with Camtasia, which tends to help, and the volume is significantly louder.  I also managed to utilize the full screen this time instead of inadvertantly leaving a black rectangle around the perimeter.  I also introduced minor errors into two of the graphs; the CPI recalculated for the 0.6% annual error only shows a line including a recalculation for the last ten years and the labels for the dollar devaluation chart were cut off, but I’ve decided to leave it as is so that I can move on to the next one.  I found a better font to use for the pop-up notes as well, or “call-outs” as Camtasia calls them.\nAs before, suggestions for improvement would be welcome.  The next video will address why inflation has to include outstanding debt; after that I plan to do videos examining the two conventional definitions of inflation.  If you’re interested in being notified when new videos are uploaded, you can subscribe to the\nVoxiversity Channel\n.",
  "tags": [
    "economics",
    "Voxiversity"
  ],
  "categories": [],
  "sitemap_lastmod": "2010-12-01T08:26:00+00:00"
}