{
  "url": "https://voxday.net/2010/12/15/living-on-sufferance/",
  "scraped_at": "2025-12-13T15:59:35.132948",
  "title": "Living on sufferance",
  "date_display": "December 15, 2010",
  "date_iso": "2010-12-15T11:55:00+00:00",
  "date_from_url": "2010-12-15",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>And at the will of your own government.  Nat Hentoff rightly decries the federal government’s assertion of its Constitutional license to freely and legally <a href=\"http://www.wnd.com/index.php?fa=PAGE.view&amp;pageId=239717\">murder American citizens</a>:</p><blockquote><p>On Dec. 7, the case before U.S. District Court Judge John Bates in Washington was described by him as presenting “stark and perplexing questions.” Can the president, the judge continued, “order the assassination of a U.S. citizen without first affording him any form of judicial process whatsoever, based on the mere assertion that he is a dangerous member of a terrorist organization?”</p><p>What did Judge Bates decide? He dismissed the case!</p><p>Thereby he greatly pleased the defendants: “Barack Obama, in his official capacity as President of the United States; Robert Gates, in his official capacity as Secretary of Defense; and Leon Panetta, in his official capacity as Director of the Central Intelligence Agency.”</p></blockquote><p>Now, MPAI is no secret.  But I am increasingly convinced that so long as the mainstream media uniformly pushed the idea that it was necessary for national security or good for the economy, it would be possible to sell the American people on anything from gassing Jews to gang-raping schoolchildren.</p><p>And for a judge to declare that it is a purely political matter – not a Constitutional one – for the Executive branch to unilaterally decide <i>to execute an American citizen</i> without so much as an arrest, let alone a trial, means that the Constitution, especially the Fifth Amendment which declares that no person shall be deprived of life, liberty or property without due process of law, is de facto defunct.  And liberals, how can sodomy, homogamy and abortion possibly be considered Constitutional rights when <i>not being murdered by the federal government without due process of law</i> isn’t?</p><p>I guess they had better hope Americans never elect a president who <i>really</i> dislikes gays or women who murder unborn children.  Or anything else, for that matter.  Do what thou wilt shall be the whole of the law… with due regard for the man giving orders to the guy controlling the Hellfire-armed Predator circling over your house.</p></div>",
  "content_text": "And at the will of your own government.  Nat Hentoff rightly decries the federal government’s assertion of its Constitutional license to freely and legally\nmurder American citizens\n:\nOn Dec. 7, the case before U.S. District Court Judge John Bates in Washington was described by him as presenting “stark and perplexing questions.” Can the president, the judge continued, “order the assassination of a U.S. citizen without first affording him any form of judicial process whatsoever, based on the mere assertion that he is a dangerous member of a terrorist organization?”\nWhat did Judge Bates decide? He dismissed the case!\nThereby he greatly pleased the defendants: “Barack Obama, in his official capacity as President of the United States; Robert Gates, in his official capacity as Secretary of Defense; and Leon Panetta, in his official capacity as Director of the Central Intelligence Agency.”\nNow, MPAI is no secret.  But I am increasingly convinced that so long as the mainstream media uniformly pushed the idea that it was necessary for national security or good for the economy, it would be possible to sell the American people on anything from gassing Jews to gang-raping schoolchildren.\nAnd for a judge to declare that it is a purely political matter – not a Constitutional one – for the Executive branch to unilaterally decide\nto execute an American citizen\nwithout so much as an arrest, let alone a trial, means that the Constitution, especially the Fifth Amendment which declares that no person shall be deprived of life, liberty or property without due process of law, is de facto defunct.  And liberals, how can sodomy, homogamy and abortion possibly be considered Constitutional rights when\nnot being murdered by the federal government without due process of law\nisn’t?\nI guess they had better hope Americans never elect a president who\nreally\ndislikes gays or women who murder unborn children.  Or anything else, for that matter.  Do what thou wilt shall be the whole of the law… with due regard for the man giving orders to the guy controlling the Hellfire-armed Predator circling over your house.",
  "tags": [
    "law"
  ],
  "categories": [],
  "sitemap_lastmod": "2010-12-15T11:55:00+00:00"
}