{
  "url": "https://voxday.net/2010/12/04/low-hurdles/",
  "scraped_at": "2026-01-08T23:44:27.582416",
  "title": "Low hurdles",
  "date_display": "December 4, 2010",
  "date_iso": "2010-12-04T16:39:00+00:00",
  "date_from_url": "2010-12-04",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>I was bemused when I checked <a href=\"http://www.youtube.com/user/Voxiversity\">Channel Vox</a> this morning preparatory to uploading the next video in the inflation series and saw that it had won a YouTube award.  It appears Voxiversity was #3 Most Subscribed Channel in Italia this week.  Of course, I would have needed 360x more to have reached the same ranking in the USA.  Clearly the next video should be entitled <i>Victoria’s Secret Economics: Alessandra Ambrosio Explains Inflation</i>.</p><p>But since I’m on the subject, I should mention there is a slight change of plans with regards to the 5.2 video.  I am extremely loathe to make a case that depends upon anyone accepting my assertions undemonstrated, so the second video will not concern the credit-money definition of inflation as I’d originally planned, but will instead demonstrate the inutility of the four – yes, four – primary Keynesian definitions of inflation.  The third video will examine the Monetarist definition, and only then, once the case against the various mainstream definitions is concluded, will I explain and defend my contention that the correct definition of inflation is an increase in the money supply plus outstanding debt.</p><p>Anyhow, I’m planning to do the recording tonight and upload it sometime this weekend, in case you’re interested.</p></div>",
  "content_text": "I was bemused when I checked\nChannel Vox\nthis morning preparatory to uploading the next video in the inflation series and saw that it had won a YouTube award.  It appears Voxiversity was #3 Most Subscribed Channel in Italia this week.  Of course, I would have needed 360x more to have reached the same ranking in the USA.  Clearly the next video should be entitled\nVictoria’s Secret Economics: Alessandra Ambrosio Explains Inflation\n.\nBut since I’m on the subject, I should mention there is a slight change of plans with regards to the 5.2 video.  I am extremely loathe to make a case that depends upon anyone accepting my assertions undemonstrated, so the second video will not concern the credit-money definition of inflation as I’d originally planned, but will instead demonstrate the inutility of the four – yes, four – primary Keynesian definitions of inflation.  The third video will examine the Monetarist definition, and only then, once the case against the various mainstream definitions is concluded, will I explain and defend my contention that the correct definition of inflation is an increase in the money supply plus outstanding debt.\nAnyhow, I’m planning to do the recording tonight and upload it sometime this weekend, in case you’re interested.",
  "tags": [
    "economics",
    "Voxiversity"
  ],
  "categories": [],
  "sitemap_lastmod": "2010-12-04T16:39:00+00:00"
}