{
  "url": "https://voxday.net/2010/12/30/mailvox-genesis-accoun/",
  "scraped_at": "2025-12-13T16:00:50.615009",
  "title": "Mailvox: the Genesis account",
  "date_display": "December 30, 2010",
  "date_iso": "2010-12-30T14:00:00+00:00",
  "date_from_url": "2010-12-30",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>JC writes from the Philippines to ask about an interesting atheist argument concerning the Fall:</p><blockquote><p>First of all I have to thank you for TIA. In my circle of friends and acquaintances, both online and offline, are a few atheists. I knew something was profoundly wrong with their arguments for the non-existence of God but for the most part I didnt have any data to back up my logical counter-arguments. Until TIA. You may be pleased to note that I now notice a considerable absence of the usual lame arguments for atheism/scienticism such as the ‘science will  save us all’ crap and nobody invokes the ‘Flying Spaghetti Monster’ baloney anymore. The ‘Stalin’s pogrom’s had nothing to do with atheism’ hogwash still shows up every once in a while but that’s no problem. In fact, when I presented evidence, I actually got one atheist to exonerate Roman Catholicism from being a driving force for the Inquisition in his lame attempts to exonerate atheism from Stalin’s pogroms. The latest discussion with a science-fetishist atheist involved my challenge for him to prove the existence of human rights via Science and if he couldnt, renounce the existence of his rights as a silly superstition. He wasnt willing to do that and came back saying that he was willing to postulate their existence without proof. Sort of like “We hold these truths to be self-evident…” but without a Creator. For which I thanked him for being irrational.</p><p>Anyway, he presented me with an argument against the Fall against which I could only argue against by invoking some quantum physics mumbo-jumbo. It goes like this:</p><p>Assuming that the universe and therefore the Earth is billions of years old (both he and I agree that this is so) and that Man showed up only recently, that is, after the dinosaurs, how come the fall of Man affected the Earth even before Man showed up, that is, how come Man’s fall affected the past such that life on Earth underwent cataclysms such that entire species went extinct only to be replaced by more species which also went through a cataclysmic extinction event, etc? In other words, the Earth even before Man showed up showed every sign of being a fallen Creation even before Man had a chance to fall — lions werent sitting with lambs for instance. On the contrary. T. Rexes were eating Parasaurolophuses. I can only counter that by saying Man’s Fall affected the past as well. I may be missing some salient theological point but I dont recall anything in the Bible that addresses how Man’s fall affected the past. It just says Man’s fall caused Creation’s fall as well and Creation is also awaiting its transformation. Any ideas how to respond to his argument?</p></blockquote><p>It’s mostly regulars around today, so why not go ahead and open up a theological can of worms?  Let me begin by saying that I have never agreed with the common Christian assumption that pre-Fall animals were vegetarian and therefore there is no need to resort to logical trans-temporal gymnastics in order to balance observations of a T-Rex-eat-Parasaurolophus world with the Book of Genesis.  The assumption about animal vegetarianism presumably comes from the following verses in the very first chapter:</p><p><i>God blessed them and said to them, “Be fruitful and increase in number; fill the earth and subdue it. Rule over the fish in the sea and the birds in the sky and over every living creature that moves on the ground.”</i></p><p>Then God said, “I give you every seed-bearing plant on the face of the whole earth and every tree that has fruit with seed in it. They will be yours for food.  And to all the beasts of the earth and all the birds in the sky and all the creatures that move along the ground—everything that has the breath of life in it—I give every green plant for food.” And it was so.</p><p>Now, notice something here.  The fish aren’t given anything for food.  Does anyone therefore conclude that fish did not eat prior to the Fall?  Of course not.  Therefore, the giving of the plants to animals and Man does not comprehensively determine the limits of their diets, it’s merely setting up their positions in the hierarchy of Creation.  Next, in both Genesis chapters 2 and 3, a distinction is made between “livestock” and “wild animals”, prior to the Fall in the first case and right at the time of the Fall in the second.  Then, in Genesis 4, it is written that Abel brought the fat portions from the firstborn of his flocks… which suggests that Adam <i>as well as others</i> were eating meat before the Fall.  (Notice that I said “suggests”, not proves, one can seldom justify the use of conclusive terms in discussing past events.)  Since the livestock obviously were not being used for clothing purposes, the reference to the “garments of skin” in Genesis 3:21 also tends to support the idea that livestock were being eaten before the Fall.</p><p>Now here is where it gets more interesting, from my perspective.  After Adam and Eve are driven out of the Garden of Eden, Cain kills Abel, then is marked <i>so that no one will kill him</i> and <i>goes out from the Lord’s presence</i> into the land of Nod to the east.  This indicates that there were human civilizations established well prior to the Fall.  So, because there is reason to believe that both animals and humans ate meat and there was human and animal activity outside of the Lord’s presence in the Garden of Eden, there is no necessary contradiction between the Genesis account and the effects on the earth cited by JC’s atheist friend.</p><p>The key, I think, is to understand that there is at least a possible distinction between “the man he had formed” in 2:8 on the third day and the mankind that God created male and female in 1:26-28 and instructed to “Be fruitful and increase in number; fill the earth and subdue it” on the sixth day.  This is not only indicated by the text, but also by the fact that Adam and Eve lived in the Garden for an indefinite and presumably long period of time until they were evicted.  The instruction to “subdue” the earth also offers some tantalizing hints regarding its lack of pre-Fall tameness outside the Garden of Eden.</p><p>Of course, this raises far more questions than it answers, the primary one being what the potential differences between Adamic man and non-Adamic man might have been, since they were obviously able to interbreed.  Now, one can certainly choose to assume that the entire account is fictional, allegorical, or incestuous, but my point is that even if one takes the Genesis account to the literal extreme, one quickly reaches conclusions that are very, very different than the assumptions that most people, including literalist Christians, make regarding it.  I am most certainly not attempting to argue that this is how it happened; given that people not infrequently cannot correctly understand something I have written even when I subsequently walk them through it slowly, using very small words, I am extremely dubious that anyone is capable of correctly interpreting Genesis to any significant degree of accuracy.</p><p>Prehistoric theology is an interesting subject upon which to speculate, but I stress that it is absolutely not relevant to one’s Christian faith or the lack thereof.  This is why I am so relaxed about the TE(p)NS debate.  Because even the demons believe in God’s existence, it is obvious that mere belief or unbelief in a particular account of His historical actions cannot possibly be considered a more significant issue where salvation is concerned.  Like any good parent, God has always been much more concerned with our obedience than with our belief; He knows He exists and most certainly doesn’t need our faith to sustain <i>Him</i>.  And like all children, we have very little understanding of why and how that obedience matters.</p></div>",
  "content_text": "JC writes from the Philippines to ask about an interesting atheist argument concerning the Fall:\nFirst of all I have to thank you for TIA. In my circle of friends and acquaintances, both online and offline, are a few atheists. I knew something was profoundly wrong with their arguments for the non-existence of God but for the most part I didnt have any data to back up my logical counter-arguments. Until TIA. You may be pleased to note that I now notice a considerable absence of the usual lame arguments for atheism/scienticism such as the ‘science will  save us all’ crap and nobody invokes the ‘Flying Spaghetti Monster’ baloney anymore. The ‘Stalin’s pogrom’s had nothing to do with atheism’ hogwash still shows up every once in a while but that’s no problem. In fact, when I presented evidence, I actually got one atheist to exonerate Roman Catholicism from being a driving force for the Inquisition in his lame attempts to exonerate atheism from Stalin’s pogroms. The latest discussion with a science-fetishist atheist involved my challenge for him to prove the existence of human rights via Science and if he couldnt, renounce the existence of his rights as a silly superstition. He wasnt willing to do that and came back saying that he was willing to postulate their existence without proof. Sort of like “We hold these truths to be self-evident…” but without a Creator. For which I thanked him for being irrational.\nAnyway, he presented me with an argument against the Fall against which I could only argue against by invoking some quantum physics mumbo-jumbo. It goes like this:\nAssuming that the universe and therefore the Earth is billions of years old (both he and I agree that this is so) and that Man showed up only recently, that is, after the dinosaurs, how come the fall of Man affected the Earth even before Man showed up, that is, how come Man’s fall affected the past such that life on Earth underwent cataclysms such that entire species went extinct only to be replaced by more species which also went through a cataclysmic extinction event, etc? In other words, the Earth even before Man showed up showed every sign of being a fallen Creation even before Man had a chance to fall — lions werent sitting with lambs for instance. On the contrary. T. Rexes were eating Parasaurolophuses. I can only counter that by saying Man’s Fall affected the past as well. I may be missing some salient theological point but I dont recall anything in the Bible that addresses how Man’s fall affected the past. It just says Man’s fall caused Creation’s fall as well and Creation is also awaiting its transformation. Any ideas how to respond to his argument?\nIt’s mostly regulars around today, so why not go ahead and open up a theological can of worms?  Let me begin by saying that I have never agreed with the common Christian assumption that pre-Fall animals were vegetarian and therefore there is no need to resort to logical trans-temporal gymnastics in order to balance observations of a T-Rex-eat-Parasaurolophus world with the Book of Genesis.  The assumption about animal vegetarianism presumably comes from the following verses in the very first chapter:\nGod blessed them and said to them, “Be fruitful and increase in number; fill the earth and subdue it. Rule over the fish in the sea and the birds in the sky and over every living creature that moves on the ground.”\nThen God said, “I give you every seed-bearing plant on the face of the whole earth and every tree that has fruit with seed in it. They will be yours for food.  And to all the beasts of the earth and all the birds in the sky and all the creatures that move along the ground—everything that has the breath of life in it—I give every green plant for food.” And it was so.\nNow, notice something here.  The fish aren’t given anything for food.  Does anyone therefore conclude that fish did not eat prior to the Fall?  Of course not.  Therefore, the giving of the plants to animals and Man does not comprehensively determine the limits of their diets, it’s merely setting up their positions in the hierarchy of Creation.  Next, in both Genesis chapters 2 and 3, a distinction is made between “livestock” and “wild animals”, prior to the Fall in the first case and right at the time of the Fall in the second.  Then, in Genesis 4, it is written that Abel brought the fat portions from the firstborn of his flocks… which suggests that Adam\nas well as others\nwere eating meat before the Fall.  (Notice that I said “suggests”, not proves, one can seldom justify the use of conclusive terms in discussing past events.)  Since the livestock obviously were not being used for clothing purposes, the reference to the “garments of skin” in Genesis 3:21 also tends to support the idea that livestock were being eaten before the Fall.\nNow here is where it gets more interesting, from my perspective.  After Adam and Eve are driven out of the Garden of Eden, Cain kills Abel, then is marked\nso that no one will kill him\nand\ngoes out from the Lord’s presence\ninto the land of Nod to the east.  This indicates that there were human civilizations established well prior to the Fall.  So, because there is reason to believe that both animals and humans ate meat and there was human and animal activity outside of the Lord’s presence in the Garden of Eden, there is no necessary contradiction between the Genesis account and the effects on the earth cited by JC’s atheist friend.\nThe key, I think, is to understand that there is at least a possible distinction between “the man he had formed” in 2:8 on the third day and the mankind that God created male and female in 1:26-28 and instructed to “Be fruitful and increase in number; fill the earth and subdue it” on the sixth day.  This is not only indicated by the text, but also by the fact that Adam and Eve lived in the Garden for an indefinite and presumably long period of time until they were evicted.  The instruction to “subdue” the earth also offers some tantalizing hints regarding its lack of pre-Fall tameness outside the Garden of Eden.\nOf course, this raises far more questions than it answers, the primary one being what the potential differences between Adamic man and non-Adamic man might have been, since they were obviously able to interbreed.  Now, one can certainly choose to assume that the entire account is fictional, allegorical, or incestuous, but my point is that even if one takes the Genesis account to the literal extreme, one quickly reaches conclusions that are very, very different than the assumptions that most people, including literalist Christians, make regarding it.  I am most certainly not attempting to argue that this is how it happened; given that people not infrequently cannot correctly understand something I have written even when I subsequently walk them through it slowly, using very small words, I am extremely dubious that anyone is capable of correctly interpreting Genesis to any significant degree of accuracy.\nPrehistoric theology is an interesting subject upon which to speculate, but I stress that it is absolutely not relevant to one’s Christian faith or the lack thereof.  This is why I am so relaxed about the TE(p)NS debate.  Because even the demons believe in God’s existence, it is obvious that mere belief or unbelief in a particular account of His historical actions cannot possibly be considered a more significant issue where salvation is concerned.  Like any good parent, God has always been much more concerned with our obedience than with our belief; He knows He exists and most certainly doesn’t need our faith to sustain\nHim\n.  And like all children, we have very little understanding of why and how that obedience matters.",
  "tags": [
    "Christianity"
  ],
  "categories": [],
  "sitemap_lastmod": "2010-12-30T14:00:00+00:00"
}