{
  "url": "https://voxday.net/2010/12/08/mailvox-state-secrets/",
  "scraped_at": "2026-01-08T23:44:49.892339",
  "title": "Mailvox: On the secrets of the state",
  "date_display": "December 8, 2010",
  "date_iso": "2010-12-08T10:55:00+00:00",
  "date_from_url": "2010-12-08",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>An interested party asks for elucidation on my attitude towards the legitimacy of state secrets:</p><blockquote><p>I have read your column for years, sometimes in agreement, and sometimes not, and am so not surprised at your position on the most recent Wikileaks affair.  Given that position, I am curious as to whether you would agree with the statement that no state may morally conceal any of its actions, intentions, or internal communications.  If not, how would you qualify the statement to render it acceptable to you?  I am also interested in whether you would draw a distinction between the concealment just mentioned and the provision of intentionally false or misleading responses — lies — in answer to requests for information.  Finally, I would ask whether you might see any basis for differentiation between individual or state concealment or lies.</p></blockquote><p>The question requires some clarification before it can be answered.  First, what sort of state is it?  Second, from whom is the state concealing its actions, intentions, and international communications?  In the case of a state that is ruled by a sovereign monarch, in which “l’etat, c’est moi”, then the state can morally conceal its actions, intentions, and communications from anyone it pleases.  In the case of a state in which the people are sovereign, (which is to say that the people are the state), the state cannot morally conceal its actions, intentions, and international communications from the people, which is to say <i>itself</i>.</p><p>It is completely false and historically illiterate to argue, as some would have it, that it would be self-destructive for a state in which the people are sovereign to retain no secrets.  Quite the opposite is true; because most great powers fall to internal corruption prior to their conquest by external parties, it is the ability of powerful elements within the state to conceal information from the rest of the state that leads to the subversion of the state and its eventual transformation and collapse.</p><p>The example of war, so often cited in support of state secrets, actually supports the contrary case even more strongly.  While it might have been more difficult make the D-Day landings, the more significant point is that they never would have needed to be made had the American people not been led blindly into World War I, which allowed the stage to be set for the rise of Hitler, the National Socialists, and the conquest of France.  In the same manner, the informants who are supposedly endangered by the Wikileaks releases would never have faced any danger if the American people had been in full possession of the facts with regards to Afghanistan and Iraq; those invasions would never have taken place.</p><p>Obviously, it is worse for the government to lie in request for information; sins of commission are generally considered worse than sins of omission.  But in a supposedly free and democratic society, there is no place for either.  And finally, the difference between a state lie and an individual lie is that in the case of the former, (assuming a nominally free and democratic state), the state is lying <i>to itself</i> whereas the individual is lying to someone else.  Needless to say, whether one is a state or an individual, one who lies to himself is very unlikely to make optimal decisions.  And that is precisely the practical problem that underlines not only the immorality, but the self-destructive foolishness of state secrets.</p><p>In a state where the people are sovereign, state secrets are maintained for one reason and one reason only: to permit certain elements of the state to operate freely without taking into account the will of the other elements of the state.  This is why state secrets are intrinsically authoritarian and invariably lead to the loss of human liberty over time.  Don’t make the mistake of thinking that mine is a “naive” position, as the self-styled geopolitical realists like to describe it.  It is nothing of the kind, being an extremely cynical one instead.</p></div>",
  "content_text": "An interested party asks for elucidation on my attitude towards the legitimacy of state secrets:\nI have read your column for years, sometimes in agreement, and sometimes not, and am so not surprised at your position on the most recent Wikileaks affair.  Given that position, I am curious as to whether you would agree with the statement that no state may morally conceal any of its actions, intentions, or internal communications.  If not, how would you qualify the statement to render it acceptable to you?  I am also interested in whether you would draw a distinction between the concealment just mentioned and the provision of intentionally false or misleading responses — lies — in answer to requests for information.  Finally, I would ask whether you might see any basis for differentiation between individual or state concealment or lies.\nThe question requires some clarification before it can be answered.  First, what sort of state is it?  Second, from whom is the state concealing its actions, intentions, and international communications?  In the case of a state that is ruled by a sovereign monarch, in which “l’etat, c’est moi”, then the state can morally conceal its actions, intentions, and communications from anyone it pleases.  In the case of a state in which the people are sovereign, (which is to say that the people are the state), the state cannot morally conceal its actions, intentions, and international communications from the people, which is to say\nitself\n.\nIt is completely false and historically illiterate to argue, as some would have it, that it would be self-destructive for a state in which the people are sovereign to retain no secrets.  Quite the opposite is true; because most great powers fall to internal corruption prior to their conquest by external parties, it is the ability of powerful elements within the state to conceal information from the rest of the state that leads to the subversion of the state and its eventual transformation and collapse.\nThe example of war, so often cited in support of state secrets, actually supports the contrary case even more strongly.  While it might have been more difficult make the D-Day landings, the more significant point is that they never would have needed to be made had the American people not been led blindly into World War I, which allowed the stage to be set for the rise of Hitler, the National Socialists, and the conquest of France.  In the same manner, the informants who are supposedly endangered by the Wikileaks releases would never have faced any danger if the American people had been in full possession of the facts with regards to Afghanistan and Iraq; those invasions would never have taken place.\nObviously, it is worse for the government to lie in request for information; sins of commission are generally considered worse than sins of omission.  But in a supposedly free and democratic society, there is no place for either.  And finally, the difference between a state lie and an individual lie is that in the case of the former, (assuming a nominally free and democratic state), the state is lying\nto itself\nwhereas the individual is lying to someone else.  Needless to say, whether one is a state or an individual, one who lies to himself is very unlikely to make optimal decisions.  And that is precisely the practical problem that underlines not only the immorality, but the self-destructive foolishness of state secrets.\nIn a state where the people are sovereign, state secrets are maintained for one reason and one reason only: to permit certain elements of the state to operate freely without taking into account the will of the other elements of the state.  This is why state secrets are intrinsically authoritarian and invariably lead to the loss of human liberty over time.  Don’t make the mistake of thinking that mine is a “naive” position, as the self-styled geopolitical realists like to describe it.  It is nothing of the kind, being an extremely cynical one instead.",
  "tags": [
    "mailvox"
  ],
  "categories": [],
  "sitemap_lastmod": "2010-12-08T10:55:00+00:00"
}