{
  "url": "https://voxday.net/2010/12/07/neuroscience-is-racis/",
  "scraped_at": "2026-01-08T23:44:48.067796",
  "title": "Neuroscience is racist",
  "date_display": "December 7, 2010",
  "date_iso": "2010-12-07T21:30:00+00:00",
  "date_from_url": "2010-12-07",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>It looks like Sam Harris is going to be very, very disappointed where the science of brain imaging experiments <a href=\"http://www.scientificamerican.com/podcast/episode.cfm?id=brain-imaging-studies-show-differen-10-11-27&amp;WT.mc_id=SA_WR_20101201\">looks to be headed</a>:</p><blockquote><p>Following up on the cultural differences between Asians and Americans, one study published in Neuroimage found that when faced with the same image, people’s neural responses are totally different. Scientists found that when American subjects viewed a silhouette in a dominant posture (standing up, arms crossed) their brain’s reward circuitry sparked. Not so for Japanese subjects.  For the Japanese, their reward circuitry fired when they saw a submissive silhouette (head down, arms at sides). This physiological response matches a well-known behavioral difference: Americans favor and encourage dominant behavior. Japanese culture reinforces submissive culture.</p></blockquote><p>So, instead of neuroscience providing a scientific means of defining morality outside of religion, it looks as if it will be providing a scientific means of defining racial and/or cultural superiority outside of morality.  All of Harris’s reasoning in support of scientific morality, which was constructed in support of his hypothesis of differences in religious and non-religious beliefs and put forth in <i>The Moral Landscape</i>, can now quite reasonably be utilized in support of scientific racial and cultural superiority.</p><p>How fortunate for everyone that his reasoning is so completely flawed.</p></div>",
  "content_text": "It looks like Sam Harris is going to be very, very disappointed where the science of brain imaging experiments\nlooks to be headed\n:\nFollowing up on the cultural differences between Asians and Americans, one study published in Neuroimage found that when faced with the same image, people’s neural responses are totally different. Scientists found that when American subjects viewed a silhouette in a dominant posture (standing up, arms crossed) their brain’s reward circuitry sparked. Not so for Japanese subjects.  For the Japanese, their reward circuitry fired when they saw a submissive silhouette (head down, arms at sides). This physiological response matches a well-known behavioral difference: Americans favor and encourage dominant behavior. Japanese culture reinforces submissive culture.\nSo, instead of neuroscience providing a scientific means of defining morality outside of religion, it looks as if it will be providing a scientific means of defining racial and/or cultural superiority outside of morality.  All of Harris’s reasoning in support of scientific morality, which was constructed in support of his hypothesis of differences in religious and non-religious beliefs and put forth in\nThe Moral Landscape\n, can now quite reasonably be utilized in support of scientific racial and cultural superiority.\nHow fortunate for everyone that his reasoning is so completely flawed.",
  "tags": [
    "science"
  ],
  "categories": [],
  "sitemap_lastmod": "2010-12-07T21:30:00+00:00"
}