{
  "url": "https://voxday.net/2010/12/20/no-christians-allowed/",
  "scraped_at": "2025-12-13T16:00:05.079437",
  "title": "No Christians allowed",
  "date_display": "December 20, 2010",
  "date_iso": "2010-12-20T13:45:00+00:00",
  "date_from_url": "2010-12-20",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>It’s time to start cracking down hard on anti-Christian academia, who are not only violating common sense in their attempt to keep Christians out of the ivory towers they fund, but also <a href=\"http://www.nytimes.com/2010/12/19/us/19kentucky.html?_r=2&amp;ref=science\">Federal employment law</a>:</p><blockquote><p>In 2007, C. Martin Gaskell, an astronomer at the University of Nebraska, was a leading candidate for a job running an observatory at the University of Kentucky. But then somebody did what one does nowadays: an Internet search.  That search turned up evidence of Dr. Gaskell’s evangelical Christian faith.</p><p>The University of Kentucky hired someone else. And Dr. Gaskell sued the institution.  Whether his faith cost him the job and whether certain religious beliefs may legally render people unfit for certain jobs are among the questions raised by the case, Gaskell v. University of Kentucky.  In late November, a federal judge in Kentucky ruled that the case could go forward, and a trial is scheduled for February. The case represents a rare example, experts say, of a lawsuit by a scientist who alleges academic persecution for his religious faith….</p></blockquote><p>The UK employment debacle is one of the sillier atheist misconceptions of science put into practice.  You may recall Sam Harris’s absurd polemics in the Wall Street Journal and <i>The Moral Landscape</i>, in which he insisted, contra all the available evidence, that the head of the Human Genome Project, was incapable of performing science due to his Christianity.  (This is yet another example of the reliable New Atheist preference for nonsensical pseudo-logic to confirmable facts and correctly applied reason.)</p><p>The ironic thing about the academic insistence on conformity to cross-disciplinary dogma is that if it were consistently applied, it would render at least 50 percent of the academics in American instantly unemployable.  If one considers all of the left-wing biologists and physicists who reject the most basic tenets of economics, to say nothing of all the female humanities professors who reject the very concept of biological differences and patriarchal male science, adoption of the Kentucky standard would mean a professorial purge of such a scale to make Stalin blush.</p><p>Given how badly they are outnumbered in America, you would think atheists and other statistically insignificant belief-groups would want to think twice before supporting a legal standard that permits barring those possessing specific beliefs from obtaining employment.  But then, as I have often demonstrated, atheists tend to more often honor reason in its breach instead of its application.</p></div>",
  "content_text": "It’s time to start cracking down hard on anti-Christian academia, who are not only violating common sense in their attempt to keep Christians out of the ivory towers they fund, but also\nFederal employment law\n:\nIn 2007, C. Martin Gaskell, an astronomer at the University of Nebraska, was a leading candidate for a job running an observatory at the University of Kentucky. But then somebody did what one does nowadays: an Internet search.  That search turned up evidence of Dr. Gaskell’s evangelical Christian faith.\nThe University of Kentucky hired someone else. And Dr. Gaskell sued the institution.  Whether his faith cost him the job and whether certain religious beliefs may legally render people unfit for certain jobs are among the questions raised by the case, Gaskell v. University of Kentucky.  In late November, a federal judge in Kentucky ruled that the case could go forward, and a trial is scheduled for February. The case represents a rare example, experts say, of a lawsuit by a scientist who alleges academic persecution for his religious faith….\nThe UK employment debacle is one of the sillier atheist misconceptions of science put into practice.  You may recall Sam Harris’s absurd polemics in the Wall Street Journal and\nThe Moral Landscape\n, in which he insisted, contra all the available evidence, that the head of the Human Genome Project, was incapable of performing science due to his Christianity.  (This is yet another example of the reliable New Atheist preference for nonsensical pseudo-logic to confirmable facts and correctly applied reason.)\nThe ironic thing about the academic insistence on conformity to cross-disciplinary dogma is that if it were consistently applied, it would render at least 50 percent of the academics in American instantly unemployable.  If one considers all of the left-wing biologists and physicists who reject the most basic tenets of economics, to say nothing of all the female humanities professors who reject the very concept of biological differences and patriarchal male science, adoption of the Kentucky standard would mean a professorial purge of such a scale to make Stalin blush.\nGiven how badly they are outnumbered in America, you would think atheists and other statistically insignificant belief-groups would want to think twice before supporting a legal standard that permits barring those possessing specific beliefs from obtaining employment.  But then, as I have often demonstrated, atheists tend to more often honor reason in its breach instead of its application.",
  "tags": [
    "education"
  ],
  "categories": [],
  "sitemap_lastmod": "2010-12-20T13:45:00+00:00"
}