{
  "url": "https://voxday.net/2010/12/11/not-so-much-mate/",
  "scraped_at": "2026-01-08T23:45:09.707378",
  "title": "Not so much, mate",
  "date_display": "December 11, 2010",
  "date_iso": "2010-12-11T15:15:00+00:00",
  "date_from_url": "2010-12-11",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>I completely agree <a href=\"http://onestdv.blogspot.com/2010/12/dont-be-fooled-by-liberal-atheist.html\">with OneSTDV’s criticism</a> of Half-Sigma’s support for the ridiculous and would-be offensive Christmas billboard erected by American Atheists this year, but I would be remiss if I failed to take exception to one of his statements:</p><blockquote><p>HS likely doesn’t spend a lot of time on organized atheist websites or he wouldn’t naively presume the actual intention comports with the publicly expressed reasoning. Sure the atheist community has individuals like Richard Dawkins and Sam Harris who can articulate impassioned but logically sound arguments against religious superstition. And surely given the high rate of disbelief amongst scientists, atheism is often a position resulting from reason.</p></blockquote><p>OneSTDV is almost surely right about the probable difference between the stated and actual intentions.  However, in like manner, one can only assume OneSTDV has not read deeply in the New Atheist literature or he would realize that while the arguments presented by Dawkins and Harris are impassioned, they are most certainly not logically sound by any measure.  If, on the other hand, he has read Dawkins or Harris and genuinely believes they both have presented logically sound arguments against religion, I should very much like to know specifically which of those arguments he means since I am familiar with all of them and “logically sound” is among the very last means I would use to describe most of them, along with “factually accurate”.  Is he impressed by Sam Harris’s Extinction Equation or by Sam’s creative resolution of the Is/Ought Problem presented in <i>The Moral Landscape</i>?  Does he buy into Dawkins’s philosophical magnum opus of the Ultimate 747 argument or is was he convinced that sexual abuse is indeed less harmful to a child than a religious upbringing?  I’m not just being sarcastic here, I would definitely like to know!</p><p>As for the scientists, I note that it is incorrect to assume that a preponderance of atheism among scientists should be taken as evidence to indicate that atheism is often a position resulting from reason.  It is a non sequitur; consider the implications in light of similarly strong predilections for sporting beards, wearing glasses, or voting Democrat.</p><p>As for the billboard itself, it is nothing more than the usual atheist obnoxiousness and Half-Sigma is simply <a href=\"http://www.halfsigma.com/2010/12/more-about-the-atheist-billboard.html\">revealing his own inability to reason correctly</a>.  He is too intelligent to not be disingenuous when he states: “I would not characterize the billboard as being anti-Christian. It’s pro-reason.”</p><p>Half-Sigma has it precisely backward.  The billboard is anti-Christian because it is specifically attacking the Christian belief in the historical existence of Jesus Christ by declaring it a myth during the very time that Christians are celebrating the birth of Man’s Lord and Savior.  The billboard is not pro-reason either despite the statement “This season celebrate reason”.  The billboard is actually anti-reason due to the way in which the preceding statement “You know it’s a myth” is intrinsically illogical.  Not only do the passers-by not necessarily know that the Christmas story is a myth, but American Atheists cannot reasonably claim to know it is a myth and unless they are claiming to be mind-readers, they cannot possibly know what the passers-by know or do not know either.</p><p>I don’t mind such billboards in the least.  It’s mere public trollery and accomplishes little more than highlight the deeply unattractive social autism of outspoken atheists.  To the extent they have any effect at all, I suspect they encourage more atheists to identify themselves as agnostics rather than the opposite.  It’s rather like seeing a vegetarian try to argue about the evils of eating meat by farting at the Christmas dinner table; no one is going to be convinced that the baked ham is any less delectable, it’s only going to make them want to send Mr. Stinky outside to eat in the snow.</p></div>",
  "content_text": "I completely agree\nwith OneSTDV’s criticism\nof Half-Sigma’s support for the ridiculous and would-be offensive Christmas billboard erected by American Atheists this year, but I would be remiss if I failed to take exception to one of his statements:\nHS likely doesn’t spend a lot of time on organized atheist websites or he wouldn’t naively presume the actual intention comports with the publicly expressed reasoning. Sure the atheist community has individuals like Richard Dawkins and Sam Harris who can articulate impassioned but logically sound arguments against religious superstition. And surely given the high rate of disbelief amongst scientists, atheism is often a position resulting from reason.\nOneSTDV is almost surely right about the probable difference between the stated and actual intentions.  However, in like manner, one can only assume OneSTDV has not read deeply in the New Atheist literature or he would realize that while the arguments presented by Dawkins and Harris are impassioned, they are most certainly not logically sound by any measure.  If, on the other hand, he has read Dawkins or Harris and genuinely believes they both have presented logically sound arguments against religion, I should very much like to know specifically which of those arguments he means since I am familiar with all of them and “logically sound” is among the very last means I would use to describe most of them, along with “factually accurate”.  Is he impressed by Sam Harris’s Extinction Equation or by Sam’s creative resolution of the Is/Ought Problem presented in\nThe Moral Landscape\n?  Does he buy into Dawkins’s philosophical magnum opus of the Ultimate 747 argument or is was he convinced that sexual abuse is indeed less harmful to a child than a religious upbringing?  I’m not just being sarcastic here, I would definitely like to know!\nAs for the scientists, I note that it is incorrect to assume that a preponderance of atheism among scientists should be taken as evidence to indicate that atheism is often a position resulting from reason.  It is a non sequitur; consider the implications in light of similarly strong predilections for sporting beards, wearing glasses, or voting Democrat.\nAs for the billboard itself, it is nothing more than the usual atheist obnoxiousness and Half-Sigma is simply\nrevealing his own inability to reason correctly\n.  He is too intelligent to not be disingenuous when he states: “I would not characterize the billboard as being anti-Christian. It’s pro-reason.”\nHalf-Sigma has it precisely backward.  The billboard is anti-Christian because it is specifically attacking the Christian belief in the historical existence of Jesus Christ by declaring it a myth during the very time that Christians are celebrating the birth of Man’s Lord and Savior.  The billboard is not pro-reason either despite the statement “This season celebrate reason”.  The billboard is actually anti-reason due to the way in which the preceding statement “You know it’s a myth” is intrinsically illogical.  Not only do the passers-by not necessarily know that the Christmas story is a myth, but American Atheists cannot reasonably claim to know it is a myth and unless they are claiming to be mind-readers, they cannot possibly know what the passers-by know or do not know either.\nI don’t mind such billboards in the least.  It’s mere public trollery and accomplishes little more than highlight the deeply unattractive social autism of outspoken atheists.  To the extent they have any effect at all, I suspect they encourage more atheists to identify themselves as agnostics rather than the opposite.  It’s rather like seeing a vegetarian try to argue about the evils of eating meat by farting at the Christmas dinner table; no one is going to be convinced that the baked ham is any less delectable, it’s only going to make them want to send Mr. Stinky outside to eat in the snow.",
  "tags": [
    "atheism"
  ],
  "categories": [],
  "sitemap_lastmod": "2010-12-11T15:15:00+00:00"
}