{
  "url": "https://voxday.net/2010/12/27/on-modern-ivy-league-education/",
  "scraped_at": "2025-12-13T16:00:31.130976",
  "title": "On the modern Ivy League education",
  "date_display": "December 27, 2010",
  "date_iso": "2010-12-27T11:09:00+00:00",
  "date_from_url": "2010-12-27",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>In which Tom provides an eloquent summary of the present state of the elite American university education:</p><blockquote><p>“Cicero’s The Republic and The Laws”? I admit I’m an Ivy leaguer, but I thought Plato wrote those?</p></blockquote><p>If you, like me, are familiar with a sufficiently large number of Ivy Leaguers, this response no doubt strikes you as a highly unlikely one.  One is forced to conclude that Tom is only pretending to possess a degree from an Ivy League university, not because he doesn’t know the works of Cicero, but because he isn’t anywhere <i>nearly</i> pretentious enough about <i>the chance to correct someone else</i> he assumes is insufficiently familiar with Plato.  Any genuine Ivy Leaguer would surely have phrased his response thusly:</p><p>“<i>The Republic</i> and <i>The Laws</i>?  Um, Plato, anyone?”</p><p>Ivy Leaguers are, almost to a man, moderately intelligent but uneducated individuals who nevertheless believe they are very well-educated and extraordinarily intelligent.  MPAI applies to them with an ironic vengeance.  They tend to be heavily inclined towards intellectual bluffing, presumably based upon the magical properties of their sheepskins, which is why you should always call them on their assertions and ask pointed questions on any occasion when you are not already certain that they are demonstrably incorrect.</p><p>For example, Tom is partly right.  Plato did indeed write both <i>The Republic</i> and <i>The Laws</i>.  The dialogues have been famous for centuries and anyone with a halfway-decent university degree will have heard of them, or at least <i>The Republic</i>.  (On the other hand, very few of the degreed folk who are prone to happily citing the question “Who will watch the watchers?” at the drop of a hat has actually read either dialogue.)  And even fewer happen to know that Cicero, who was a learned admirer of Ancient Greece, (albeit not to the extent of his great friend Atticus), also wrote a number of dialogues, among them <i>De Re Publica</i> and <i>De Legibus</i>.</p><p>While the more proper translation of these two dialogues would be “On the Republic” and “On the Laws”, they are more commonly known as “The Republic” and “The Laws”, which, as it happens, is exactly how the new Oxford translation to which I was referring has them.</p></div>",
  "content_text": "In which Tom provides an eloquent summary of the present state of the elite American university education:\n“Cicero’s The Republic and The Laws”? I admit I’m an Ivy leaguer, but I thought Plato wrote those?\nIf you, like me, are familiar with a sufficiently large number of Ivy Leaguers, this response no doubt strikes you as a highly unlikely one.  One is forced to conclude that Tom is only pretending to possess a degree from an Ivy League university, not because he doesn’t know the works of Cicero, but because he isn’t anywhere\nnearly\npretentious enough about\nthe chance to correct someone else\nhe assumes is insufficiently familiar with Plato.  Any genuine Ivy Leaguer would surely have phrased his response thusly:\n“\nThe Republic\nand\nThe Laws\n?  Um, Plato, anyone?”\nIvy Leaguers are, almost to a man, moderately intelligent but uneducated individuals who nevertheless believe they are very well-educated and extraordinarily intelligent.  MPAI applies to them with an ironic vengeance.  They tend to be heavily inclined towards intellectual bluffing, presumably based upon the magical properties of their sheepskins, which is why you should always call them on their assertions and ask pointed questions on any occasion when you are not already certain that they are demonstrably incorrect.\nFor example, Tom is partly right.  Plato did indeed write both\nThe Republic\nand\nThe Laws\n.  The dialogues have been famous for centuries and anyone with a halfway-decent university degree will have heard of them, or at least\nThe Republic\n.  (On the other hand, very few of the degreed folk who are prone to happily citing the question “Who will watch the watchers?” at the drop of a hat has actually read either dialogue.)  And even fewer happen to know that Cicero, who was a learned admirer of Ancient Greece, (albeit not to the extent of his great friend Atticus), also wrote a number of dialogues, among them\nDe Re Publica\nand\nDe Legibus\n.\nWhile the more proper translation of these two dialogues would be “On the Republic” and “On the Laws”, they are more commonly known as “The Republic” and “The Laws”, which, as it happens, is exactly how the new Oxford translation to which I was referring has them.",
  "tags": [
    "education",
    "mailvox"
  ],
  "categories": [],
  "sitemap_lastmod": "2010-12-27T11:09:00+00:00"
}