{
  "url": "https://voxday.net/2010/12/29/out-of-date-evolutionis/",
  "scraped_at": "2025-12-13T16:00:44.287596",
  "title": "An out-of-date evolutionist",
  "date_display": "December 29, 2010",
  "date_iso": "2010-12-29T15:00:00+00:00",
  "date_from_url": "2010-12-29",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>David Sloan Wilson not only <a href=\"http://scienceblogs.com/evolution/2010/12/whats_fair_in_games_sports_and.php\">presents a fallacious and remarkably self-serving analogy for our edification</a>, he also demonstrates why most scientists should probably stay very far away from logic, rhetoric, and philosophy.  In the process of launching an inept attack on the potential legitimacy of creationism, he shows that he is neither up on the present state of science nor able to reach a correct logical conclusion from the facts on hand:</p><blockquote><p>Imagine playing chess with someone who insists on continuing after his king has been taken. Or imagine a basketball game where the losing team insists on continuing after the final buzzer has sounded. These vignettes are so absurd that if they actually happened we would regard the protesters as insane. Yet something comparable happens all time when creationists protest that it is unfair for them to be ignored–including some recent comments on my blog.</p><p>The idea that it is unfair to be declared a loser and to be made to retire from the field profoundly misunderstands the nature of fairness in all contest situations. Science is a contest situation, no less than chess or basketball. In the ideal scientific contest, alternative hypotheses make different predictions that can be tested with empirical observations. When the predictions of a hypothesis are not confirmed, it is declared a loser and is made to retire from the field. New hypotheses are always welcome to enter the competition, including modified versions of rejected hypotheses, but science without losers would be as pointless as chess without checkmate and basketball without the final buzzer….</p><p>Nevertheless, the scientific contest does result in the accumulation of durable knowledge. The earth is extremely old. Continents do drift. Species are descended from other species. Those who claim otherwise and demand that it is only fair to be heard are either deluded or cynically making a manipulative argument, a point to which I will return below.</p></blockquote><p>Now, Mr. Wilson is certainly free to respond or not respond to whomever he likes on his blog and I have little doubt that he is tired of shooting down the same arguments from fourth-rate, ankle-biting creationists over and over again.  I certainly get bored with hearing the same ignorant and illogical arguments put forth in such a tiresome manner by the fourth-rate evolutionists who infest the Internet.  But  that does not justify Mr. Wilson’s attempt to claim that he is acting fairly when he is not or his pretense that science is something it quite clearly is not.</p><p>If you actually know what you’re doing, it’s no problem shooting down the invalid arguments presented by the clueless and the uninformed.  When they’re presented again, as they surely will be, simply point them to the previous smackdown.  But if you really don’t, well, you’re not fooling anyone by claiming that you’re too busy, important, or credentialed to deny them taking their best shot, hapless as it might be.</p><p>Now, Wilson’s imagined sporting vignettes are indeed absurd, but they are not legitimately comparable.  Let’s first consider the accuracy of his analogy.  Most sports and games have clear-cut rules to which both sides are equally subject, a definite authority, more or less impartial referees, and are based primarily upon ability rather than credentials.  Sporting competitions end when the clock runs out or a specific and predetermined event happens.  Science, on the other hand, has no rules, no definite authority, extremely partial referees to the extent that “peer review” can even be considered refereeing rather than gatekeeping, and operates on a hierarchical, credential-based paradigm that makes no allowances for talent and would exclude most of the great uncredentialed scientists of the past.  Not only do scientific “competitions” never end, logic dictates <i>they cannot possibly</i> end insofar as science is supposedly dedicated to “the accumulation of durable knowledge” and the possibility of new information exists.</p><p>In other words, science is observably so intrinsically unfair to those both inside and outside the profession that it makes the old Jordan Rules look like a paragon of fair competition.  To claim that scientific contests, ideal or sub-optimal, are in any way comparable to a basketball game or a chess match is so demonstrably false that it requires either willful stupidity, careless error, or the cynical manufacture of a manipulative and invalid argument.  Which would it be, Mr. Wilson?</p><p>Wilson somehow manages to not only commit Daniel Dennett’s error in his <a href=\"http://1.bp.blogspot.com/_3UXl0oMYPLs/SXZHIRt_oKI/AAAAAAAAAFw/j6kmhIdEQTI/s1600-h/ATHEIST+LOGIC.jpg\">Doctrine of Transitive Doxasticism</a>, but goes Dennett one better by appealing to scientage (the knowledge base of science) rather than one specific disciplinary application of scientody (quantum electrodynamics).  Following a classic Dawkinsian bait-and-switch in which he brings up “the ideal scientific contest” in which “alternative hypotheses make different predictions that can be tested with empirical observations” in order to defend his quasi-scientific discipline wherein inferences take the place of testable predictions and empirical observations, Wilson then commits a logical blunder of Harrisian proportions when he cites the historical dismissal of group selection without realizing that it makes precisely the opposite case from the one that he is attempting to make.</p><p>Sloan states that the evolutionary revival of the concept of group selection, which was considered to be as much of a scientific loser as the phlogiston and Lamarckism for nearly 50 years, is evidence that the scientific playing field is fair even if it can become, in Wilson’s own words, “highly uneven”.  However, the group selection example completely undercuts the original argument that a scientific contest is comparable to a sporting contest by demonstrating that <i>there is no buzzer in science</i>.  Are we to conclude that there is a 50-year post-buzzer grace period and that Creationism has missed the scientific statute of limitations?  Apparently not, as Wilson goes on to admit that there is no final buzzer.  But since there is not, then what is the logical basis for Wilson’s division between the legitimate revival of group selection and the illegitimate revival of Creationism?</p><p>Wilson confesses that there are perfectly good scientific hypotheses that can be derived from the concept of an intervening creator god.  What he fails to admit is that the concept has provided scientific successes as well as failures; the defeat of the “steady-state universe” by Georges Lemaître’s “Big Bang theory” as the standard cosmological model was a huge victory for the Creationists, whose concept of a universal beginning was once dismissed by Wilson’s predecessors in the way that Wilson now dismisses other, less necessary aspects of the God hypothesis.</p><p>More importantly, Wilson reveals himself to be out-of-date with regards to <a href=\"http://www.newyorker.com/reporting/2010/12/13/101213fa_fact_lehrer?currentPage=1\">the latest scientific evidence on the unreliability of science</a> itself.  His “uneven playing field” does not even begin to take into account scientific fraud, the decline effect, publication bias, selective reporting, and the long, sordid history of scientific facts that have been disproven over time by scientists and non-scientists alike.  In fact, the more that even the hardest sciences are examined with the same skeptical lens that the likes of Dawkins would prefer to keep focused only on religion, the more it becomes obvious that his faith in it is badly misplaced.</p><p>For example, Wilson states that “The earth is extremely old. Continents do drift. Species are descended from other species.”  And yet, the scientific evidence for these statements is much weaker, scientifically speaking, than the evidence for medical science that is not experimentally disadvantaged due to the daunting challenges of replicating historical events.  So, the fact that “80 percent of non-randomized studies <a href=\"http://www.theatlantic.com/magazine/print/2010/11/lies-damned-lies-and-medical-science/8269/\">turn out to be wrong</a>, as do 25 percent of supposedly gold-standard randomized trials” means that it is not only possible, but <i>downright probable</i>, that his statements will eventually turn out to be wrong.</p><p>Wilson’s attitude and his attempt to sound a buzzer that does not exist in order to declare the game over are both profoundly unscientific.  It is not only more unscientific than the behavior of the creationists that he decries, it is actually dogmatic anti-science.  The ironic thing is that Wilson isn’t even doing science when he engages in his customary evolutionary speculation, but rather fiction and philosophy because <a href=\"http://www.milobookclub.com/2009/07/22/simulation-is-not-science/\">there is virtually no scientific evidence for natural selection</a>, as leading researchers in the field such as Masatoshi Nei of Penn State readily admit.</p><p>(The idea that natural selection is the cause of evolution is a perfectly reasonable logical argument, but that’s all it is to date.  Despite the oft-heard explanation that polar bears are white due to natural selection, no scientist has ever gone out there and painted polar bears pink, red, and yellow in order to produce evidence that colored polar bears are any less fit than white ones.  It’s taken evolutionists more than 150 years to realize this, but now even Richard Dawkins is referring to a theory of evolution by (probably) natural selection and evolutionary researchers like Nei are attempting to retroactively find the evidence that they errantly took for granted all along.)</p><p>In fact, the one thing that we can predict with a high degree of certainty about Wilson’s field based upon its past record is that its “durable knowledge” will prove incorrect.  Biology is arguably the only science that is more reliably off-base than economics; just last week the discovery of <i>homo sapiens</i> fossils in Israel appears to have once more upended the state of evolutionary scientage.  And note that simply calling the consistent unreliability of science “self-correcting” does not turn the bug into a feature, especially since a good part of the “self”-correction comes from outside the scientific community.</p><p>A more accurate analogy would have been for Wilson to describe science as a collection of annoying fat kids who declare themselves the world champions of Foosketball, then refuse to define the rules or let anyone else play lest they be exposed, pinned down, and defeated.  Despite their academic credentials, scientists are no more to be permitted special pleading than priests.  Mr. Wilson’s inability to reach correct logical conclusions coupled with his stated refusal to entertain alternative hypotheses does not speak well for his scientific perspective, so it’s probably just as well for everyone that he works in a field where no actual use of the scientific method is required.</p><p>Update: <a href=\"http://www.advicegoddess.com/archives/2010/12/28/why_you_cant_ar.html\">Amy Alkon also posted</a> on Wilson’s post.  I left a comment there which I imagine a few of you will find more amusing than she does as the woman is in well over her head and makes what we have all come to recognize as the expected atheist errors.  Seriously, what is with atheists and their inability to understand or utilize common word definitions?  Not reading the Bible or other religious texts I understand, but what do they have against dictionaries?</p></div>",
  "content_text": "David Sloan Wilson not only\npresents a fallacious and remarkably self-serving analogy for our edification\n, he also demonstrates why most scientists should probably stay very far away from logic, rhetoric, and philosophy.  In the process of launching an inept attack on the potential legitimacy of creationism, he shows that he is neither up on the present state of science nor able to reach a correct logical conclusion from the facts on hand:\nImagine playing chess with someone who insists on continuing after his king has been taken. Or imagine a basketball game where the losing team insists on continuing after the final buzzer has sounded. These vignettes are so absurd that if they actually happened we would regard the protesters as insane. Yet something comparable happens all time when creationists protest that it is unfair for them to be ignored–including some recent comments on my blog.\nThe idea that it is unfair to be declared a loser and to be made to retire from the field profoundly misunderstands the nature of fairness in all contest situations. Science is a contest situation, no less than chess or basketball. In the ideal scientific contest, alternative hypotheses make different predictions that can be tested with empirical observations. When the predictions of a hypothesis are not confirmed, it is declared a loser and is made to retire from the field. New hypotheses are always welcome to enter the competition, including modified versions of rejected hypotheses, but science without losers would be as pointless as chess without checkmate and basketball without the final buzzer….\nNevertheless, the scientific contest does result in the accumulation of durable knowledge. The earth is extremely old. Continents do drift. Species are descended from other species. Those who claim otherwise and demand that it is only fair to be heard are either deluded or cynically making a manipulative argument, a point to which I will return below.\nNow, Mr. Wilson is certainly free to respond or not respond to whomever he likes on his blog and I have little doubt that he is tired of shooting down the same arguments from fourth-rate, ankle-biting creationists over and over again.  I certainly get bored with hearing the same ignorant and illogical arguments put forth in such a tiresome manner by the fourth-rate evolutionists who infest the Internet.  But  that does not justify Mr. Wilson’s attempt to claim that he is acting fairly when he is not or his pretense that science is something it quite clearly is not.\nIf you actually know what you’re doing, it’s no problem shooting down the invalid arguments presented by the clueless and the uninformed.  When they’re presented again, as they surely will be, simply point them to the previous smackdown.  But if you really don’t, well, you’re not fooling anyone by claiming that you’re too busy, important, or credentialed to deny them taking their best shot, hapless as it might be.\nNow, Wilson’s imagined sporting vignettes are indeed absurd, but they are not legitimately comparable.  Let’s first consider the accuracy of his analogy.  Most sports and games have clear-cut rules to which both sides are equally subject, a definite authority, more or less impartial referees, and are based primarily upon ability rather than credentials.  Sporting competitions end when the clock runs out or a specific and predetermined event happens.  Science, on the other hand, has no rules, no definite authority, extremely partial referees to the extent that “peer review” can even be considered refereeing rather than gatekeeping, and operates on a hierarchical, credential-based paradigm that makes no allowances for talent and would exclude most of the great uncredentialed scientists of the past.  Not only do scientific “competitions” never end, logic dictates\nthey cannot possibly\nend insofar as science is supposedly dedicated to “the accumulation of durable knowledge” and the possibility of new information exists.\nIn other words, science is observably so intrinsically unfair to those both inside and outside the profession that it makes the old Jordan Rules look like a paragon of fair competition.  To claim that scientific contests, ideal or sub-optimal, are in any way comparable to a basketball game or a chess match is so demonstrably false that it requires either willful stupidity, careless error, or the cynical manufacture of a manipulative and invalid argument.  Which would it be, Mr. Wilson?\nWilson somehow manages to not only commit Daniel Dennett’s error in his\nDoctrine of Transitive Doxasticism\n, but goes Dennett one better by appealing to scientage (the knowledge base of science) rather than one specific disciplinary application of scientody (quantum electrodynamics).  Following a classic Dawkinsian bait-and-switch in which he brings up “the ideal scientific contest” in which “alternative hypotheses make different predictions that can be tested with empirical observations” in order to defend his quasi-scientific discipline wherein inferences take the place of testable predictions and empirical observations, Wilson then commits a logical blunder of Harrisian proportions when he cites the historical dismissal of group selection without realizing that it makes precisely the opposite case from the one that he is attempting to make.\nSloan states that the evolutionary revival of the concept of group selection, which was considered to be as much of a scientific loser as the phlogiston and Lamarckism for nearly 50 years, is evidence that the scientific playing field is fair even if it can become, in Wilson’s own words, “highly uneven”.  However, the group selection example completely undercuts the original argument that a scientific contest is comparable to a sporting contest by demonstrating that\nthere is no buzzer in science\n.  Are we to conclude that there is a 50-year post-buzzer grace period and that Creationism has missed the scientific statute of limitations?  Apparently not, as Wilson goes on to admit that there is no final buzzer.  But since there is not, then what is the logical basis for Wilson’s division between the legitimate revival of group selection and the illegitimate revival of Creationism?\nWilson confesses that there are perfectly good scientific hypotheses that can be derived from the concept of an intervening creator god.  What he fails to admit is that the concept has provided scientific successes as well as failures; the defeat of the “steady-state universe” by Georges Lemaître’s “Big Bang theory” as the standard cosmological model was a huge victory for the Creationists, whose concept of a universal beginning was once dismissed by Wilson’s predecessors in the way that Wilson now dismisses other, less necessary aspects of the God hypothesis.\nMore importantly, Wilson reveals himself to be out-of-date with regards to\nthe latest scientific evidence on the unreliability of science\nitself.  His “uneven playing field” does not even begin to take into account scientific fraud, the decline effect, publication bias, selective reporting, and the long, sordid history of scientific facts that have been disproven over time by scientists and non-scientists alike.  In fact, the more that even the hardest sciences are examined with the same skeptical lens that the likes of Dawkins would prefer to keep focused only on religion, the more it becomes obvious that his faith in it is badly misplaced.\nFor example, Wilson states that “The earth is extremely old. Continents do drift. Species are descended from other species.”  And yet, the scientific evidence for these statements is much weaker, scientifically speaking, than the evidence for medical science that is not experimentally disadvantaged due to the daunting challenges of replicating historical events.  So, the fact that “80 percent of non-randomized studies\nturn out to be wrong\n, as do 25 percent of supposedly gold-standard randomized trials” means that it is not only possible, but\ndownright probable\n, that his statements will eventually turn out to be wrong.\nWilson’s attitude and his attempt to sound a buzzer that does not exist in order to declare the game over are both profoundly unscientific.  It is not only more unscientific than the behavior of the creationists that he decries, it is actually dogmatic anti-science.  The ironic thing is that Wilson isn’t even doing science when he engages in his customary evolutionary speculation, but rather fiction and philosophy because\nthere is virtually no scientific evidence for natural selection\n, as leading researchers in the field such as Masatoshi Nei of Penn State readily admit.\n(The idea that natural selection is the cause of evolution is a perfectly reasonable logical argument, but that’s all it is to date.  Despite the oft-heard explanation that polar bears are white due to natural selection, no scientist has ever gone out there and painted polar bears pink, red, and yellow in order to produce evidence that colored polar bears are any less fit than white ones.  It’s taken evolutionists more than 150 years to realize this, but now even Richard Dawkins is referring to a theory of evolution by (probably) natural selection and evolutionary researchers like Nei are attempting to retroactively find the evidence that they errantly took for granted all along.)\nIn fact, the one thing that we can predict with a high degree of certainty about Wilson’s field based upon its past record is that its “durable knowledge” will prove incorrect.  Biology is arguably the only science that is more reliably off-base than economics; just last week the discovery of\nhomo sapiens\nfossils in Israel appears to have once more upended the state of evolutionary scientage.  And note that simply calling the consistent unreliability of science “self-correcting” does not turn the bug into a feature, especially since a good part of the “self”-correction comes from outside the scientific community.\nA more accurate analogy would have been for Wilson to describe science as a collection of annoying fat kids who declare themselves the world champions of Foosketball, then refuse to define the rules or let anyone else play lest they be exposed, pinned down, and defeated.  Despite their academic credentials, scientists are no more to be permitted special pleading than priests.  Mr. Wilson’s inability to reach correct logical conclusions coupled with his stated refusal to entertain alternative hypotheses does not speak well for his scientific perspective, so it’s probably just as well for everyone that he works in a field where no actual use of the scientific method is required.\nUpdate:\nAmy Alkon also posted\non Wilson’s post.  I left a comment there which I imagine a few of you will find more amusing than she does as the woman is in well over her head and makes what we have all come to recognize as the expected atheist errors.  Seriously, what is with atheists and their inability to understand or utilize common word definitions?  Not reading the Bible or other religious texts I understand, but what do they have against dictionaries?",
  "tags": [
    "atheism",
    "science"
  ],
  "categories": [],
  "sitemap_lastmod": "2010-12-29T15:00:00+00:00"
}