{
  "url": "https://voxday.net/2010/12/26/post-university-education/",
  "scraped_at": "2025-12-13T16:00:27.836309",
  "title": "Post-university education",
  "date_display": "December 26, 2010",
  "date_iso": "2010-12-26T15:29:00+00:00",
  "date_from_url": "2010-12-26",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>This is <a href=\"http://pajamasmedia.com/instapundit/112054/\">a rather interesting historical insight </a>courtesy of an Instapundit reader:</p><blockquote><p>We are somewhat poorly served by applying the term “education” to what is now much more properly referenced as “schooling.” Those two used to overlap almost completely, and some the the greatest damage wrought by easy funding with other people’s money is that from pre-K to Ph.D. schools these days offer bloody little real education apart from the sciences and engineering. Things are likely to change.</p><p>Eight hundred years ago education was controlled by the church. Groups of independent scholars, using Latin as a common language, began to congregate apart from the church to pursue a true education. By mid-12th century this grew into the university movement — Hic et ubique terrarum (here and anyplace on earth) as they said in Paris in 1163. It took a century or so, but by AD 1400 the church no longer controlled education.</p><p>In our time education is controlled by the universities and their lower level minions. Once again groups of independent scholars, using English as a common language have begun to congregate apart from the universities — internet, home-schoolers, independent researchers, and many others — to pursue a true education. The pattern is repeating, for the very same reasons. Hic et ubique terrarum indeed.</p></blockquote><p>A friend of mine who is a well-regarded university professor took a look at a few of the Voxiversity quizzes not long after we had finished the study of Thucydides.  He remarked that the quiz was harder and more comprehensive than any test that would be given at his university.  I think one can quite reasonably argue that it is now not only possible, but probable, that one can get a better education <i>outside</i> the elite university system in four years than one can inside it.  One can’t obtain marketable credentials, of course, but then, the whole point of the email was to distinguish between schooling credentials and a genuine education.  And, of course, the ironic thing is that the university’s usual defense of the humanities depends upon the importance of education rather than credentials.</p><p>Speaking of my own ongoing education, I was delighted to receive some Christmas gifts that may or may not make an appearance in a future Voxiversity, including the complete <i>Plutarch’s Lives</i>, Cicero’s <i>The Republic</i> and <i>The Laws</i>, and best of all, <i>The Landmark Arrian</i>.  I can also attest that Tim Layden’s book about tactical NFL inventions from Pop Warner’s Single-Wing to Jim Johnson’s Double-A Gap Blitz, <i>Blood, Sweat and Chalk</i> is a light and easy read, but it is as interesting as Peter King claimed it to be.</p></div>",
  "content_text": "This is\na rather interesting historical insight\ncourtesy of an Instapundit reader:\nWe are somewhat poorly served by applying the term “education” to what is now much more properly referenced as “schooling.” Those two used to overlap almost completely, and some the the greatest damage wrought by easy funding with other people’s money is that from pre-K to Ph.D. schools these days offer bloody little real education apart from the sciences and engineering. Things are likely to change.\nEight hundred years ago education was controlled by the church. Groups of independent scholars, using Latin as a common language, began to congregate apart from the church to pursue a true education. By mid-12th century this grew into the university movement — Hic et ubique terrarum (here and anyplace on earth) as they said in Paris in 1163. It took a century or so, but by AD 1400 the church no longer controlled education.\nIn our time education is controlled by the universities and their lower level minions. Once again groups of independent scholars, using English as a common language have begun to congregate apart from the universities — internet, home-schoolers, independent researchers, and many others — to pursue a true education. The pattern is repeating, for the very same reasons. Hic et ubique terrarum indeed.\nA friend of mine who is a well-regarded university professor took a look at a few of the Voxiversity quizzes not long after we had finished the study of Thucydides.  He remarked that the quiz was harder and more comprehensive than any test that would be given at his university.  I think one can quite reasonably argue that it is now not only possible, but probable, that one can get a better education\noutside\nthe elite university system in four years than one can inside it.  One can’t obtain marketable credentials, of course, but then, the whole point of the email was to distinguish between schooling credentials and a genuine education.  And, of course, the ironic thing is that the university’s usual defense of the humanities depends upon the importance of education rather than credentials.\nSpeaking of my own ongoing education, I was delighted to receive some Christmas gifts that may or may not make an appearance in a future Voxiversity, including the complete\nPlutarch’s Lives\n, Cicero’s\nThe Republic\nand\nThe Laws\n, and best of all,\nThe Landmark Arrian\n.  I can also attest that Tim Layden’s book about tactical NFL inventions from Pop Warner’s Single-Wing to Jim Johnson’s Double-A Gap Blitz,\nBlood, Sweat and Chalk\nis a light and easy read, but it is as interesting as Peter King claimed it to be.",
  "tags": [
    "education"
  ],
  "categories": [],
  "sitemap_lastmod": "2010-12-26T15:29:00+00:00"
}