{
  "url": "https://voxday.net/2010/12/14/post-wwii-american-power/",
  "scraped_at": "2026-01-08T23:45:24.514123",
  "title": "Post-WWII American power",
  "date_display": "December 14, 2010",
  "date_iso": "2010-12-14T11:23:00+00:00",
  "date_from_url": "2010-12-14",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>I recently read the 2008 paper that was the foundation of Carmen Reinhart and Kenneth Rogoff’s successful book that has often kept RGD from topping the Kindle charts in the Economic History category, <i>This Time It’s Different</i>.  It’s an interesting paper for a variety of reasons, but one thing that struck me about the following chart is the way it underlines the fact that the post-war US economic dominance was an artifact of the hardships that struck other economies as a result of the wartime devastation and wartime expenditures rather than the implementation of FDR’s New Deal as the common historical myth has it.</p><div class=\"separator\" style=\"clear: both; text-align: center;\"><a href=\"http://3.bp.blogspot.com/_3UXl0oMYPLs/TQdQPe7aotI/AAAAAAAAANg/0vOwU7yCmTc/s1600/sov_defaults.png\" imageanchor=\"1\" style=\"margin-left: 1em; margin-right: 1em;\"><img border=\"0\" decoding=\"async\" fetchpriority=\"high\" height=\"236\" src=\"http://www.milobookclub.com/wp-content/uploads/2010/12/sov_defaults.png\" width=\"400\"/></a></div><p> Notice how many countries were in default – in other words, went bankrupt – during the 1940 to 1945 period: almost 50%.  To the extent that FDR drove up the public debt to previously unseen levels and wasted productive capacity on military expenditures, he actually put the US economy at some risk.  It was a reasonable bet, however, since the Allied nations incurred tremendous debts to the USA during the war, Americans had the benefit of being a creditor nation as well as being in possession of the only industrial infrastructure that had been undamaged by the war.  The postwar economic boom was therefore inevitable, barring any injudiciously stupid actions on the part of the politicians.  </p><p>Of course, this also meant that the relative decline of American wealth was inevitable, especially given the quasi-free trade policies that have permitted other nations, who were always bound to start catching up once they shed their debts and rebuilt their infrastructures, to catch up even more quickly. </p></div>",
  "content_text": "I recently read the 2008 paper that was the foundation of Carmen Reinhart and Kenneth Rogoff’s successful book that has often kept RGD from topping the Kindle charts in the Economic History category,\nThis Time It’s Different\n.  It’s an interesting paper for a variety of reasons, but one thing that struck me about the following chart is the way it underlines the fact that the post-war US economic dominance was an artifact of the hardships that struck other economies as a result of the wartime devastation and wartime expenditures rather than the implementation of FDR’s New Deal as the common historical myth has it.\nNotice how many countries were in default – in other words, went bankrupt – during the 1940 to 1945 period: almost 50%.  To the extent that FDR drove up the public debt to previously unseen levels and wasted productive capacity on military expenditures, he actually put the US economy at some risk.  It was a reasonable bet, however, since the Allied nations incurred tremendous debts to the USA during the war, Americans had the benefit of being a creditor nation as well as being in possession of the only industrial infrastructure that had been undamaged by the war.  The postwar economic boom was therefore inevitable, barring any injudiciously stupid actions on the part of the politicians.\nOf course, this also meant that the relative decline of American wealth was inevitable, especially given the quasi-free trade policies that have permitted other nations, who were always bound to start catching up once they shed their debts and rebuilt their infrastructures, to catch up even more quickly.",
  "tags": [
    "economics"
  ],
  "categories": [],
  "sitemap_lastmod": "2010-12-14T11:23:00+00:00"
}