{
  "url": "https://voxday.net/2010/12/06/voxiversity-52-inflation-and-keynesian/",
  "scraped_at": "2026-01-08T23:44:36.926274",
  "title": "Voxiversity 5.2: Inflation and Keynesian Economics",
  "date_display": "December 6, 2010",
  "date_iso": "2010-12-06T14:45:00+00:00",
  "date_from_url": "2010-12-06",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p> This should be an interesting discussion.  The conclusion will initially strike some as <i>a priori</i> insane, but I encourage everyone to consider the empirical evidence before issuing a diagnosis.  I may need to revisit this one after the critics have shared their presumably constructive input, so I look forward to hearing everyone’s take on it.</p><p>In case you’re wondering why these esoteric and pedantic debates over definitions are of interest to me or why they are important, consider this recent <a href=\"http://www.cbsnews.com/stories/2010/12/03/60minutes/main7114229_page2.shtml\">interview with Ben Bernanke</a>.  The relevant statement is highlighted in bold.</p><p><i>Pelley: Some people think the $600 billion is a terrible idea.</i></p><p>Bernanke: Well, I know some people think that but what they are doing is they’re looking at some of the risks and uncertainties with doing this policy action but what I think they’re not doing is looking at the risk of not acting.</p><p>Pelley: Many people believe that could be highly inflationary. That it’s a dangerous thing to try.</p><p>Bernanke: Well, this fear of inflation, I think is way overstated. We’ve looked at it very, very carefully. We’ve analyzed it every which way. One myth that’s out there is that what we’re doing is printing money. <b>We’re not printing money. The amount of currency in circulation is not changing. The money supply is not changing in any significant way.</b> What we’re doing is lowing interest rates by buying Treasury securities. And by lowering interest rates, we hope to stimulate the economy to grow faster. So, the trick is to find the appropriate moment when to begin to unwind this policy. And that’s what we’re gonna do.”</p><p>It should be clear that the Fed Chairman does not define inflation in any of the Keynesian manners described in this video.  But is his definition correct?  That is the $600 billion question.</p></div>",
  "content_text": "This should be an interesting discussion.  The conclusion will initially strike some as\na priori\ninsane, but I encourage everyone to consider the empirical evidence before issuing a diagnosis.  I may need to revisit this one after the critics have shared their presumably constructive input, so I look forward to hearing everyone’s take on it.\nIn case you’re wondering why these esoteric and pedantic debates over definitions are of interest to me or why they are important, consider this recent\ninterview with Ben Bernanke\n.  The relevant statement is highlighted in bold.\nPelley: Some people think the $600 billion is a terrible idea.\nBernanke: Well, I know some people think that but what they are doing is they’re looking at some of the risks and uncertainties with doing this policy action but what I think they’re not doing is looking at the risk of not acting.\nPelley: Many people believe that could be highly inflationary. That it’s a dangerous thing to try.\nBernanke: Well, this fear of inflation, I think is way overstated. We’ve looked at it very, very carefully. We’ve analyzed it every which way. One myth that’s out there is that what we’re doing is printing money.\nWe’re not printing money. The amount of currency in circulation is not changing. The money supply is not changing in any significant way.\nWhat we’re doing is lowing interest rates by buying Treasury securities. And by lowering interest rates, we hope to stimulate the economy to grow faster. So, the trick is to find the appropriate moment when to begin to unwind this policy. And that’s what we’re gonna do.”\nIt should be clear that the Fed Chairman does not define inflation in any of the Keynesian manners described in this video.  But is his definition correct?  That is the $600 billion question.",
  "tags": [
    "economics",
    "Voxiversity"
  ],
  "categories": [],
  "sitemap_lastmod": "2010-12-06T14:45:00+00:00"
}