{
  "url": "https://voxday.net/2010/12/16/weve-heard-that-one-before/",
  "scraped_at": "2025-12-13T15:59:44.758588",
  "title": "We’ve heard that one before",
  "date_display": "December 16, 2010",
  "date_iso": "2010-12-16T15:15:00+00:00",
  "date_from_url": "2010-12-16",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>About the only idea dumber than not sending Mexican immigrants back to Mexico is the idea of returning the favor and <a href=\"http://www.washingtonpost.com/wp-dyn/content/article/2010/11/25/AR2010112502233.html\">invading Mexico right back</a>:</p><blockquote><p>National pride is a good thing – until the water reaches your chin and your nation is still sinking. Mexico is not in that deep yet, but parts of the country are. Seven criminal cartels effectively control most cities and the drug trafficking lanes near the U.S. border, as well as their bases and production centers in the interior.</p><p>The Mexican government announced on Wednesday that it will send more troops and federal police to its northeastern corner near the U.S. border.</p><p>Yet the Mexican elite class and military remain too proud to do what they immediately should: Call in the Marines.</p><p>I say this a bit tendentiously to get Mexicans out of their nationalistic stupor. They, in fact, should call in the U.S. Army, Navy and Air Force, too. But not in large units. Rather, Mexico is in dire need of American military specialists stationed within its borders to help the country build powerful electronic intelligence systems and train modern military and police forces to replace its suffocatingly hierarchical, outdated ones.</p></blockquote><p>Just a few specialists, right.  And then when a number of specialists are taken out by the armed cartels who presumably are capable of understanding why the American specialists are there, the Obama administration will either a) withdraw the specialists in which case they need not ever bothered sending them in the first place, or b) escalate American forces there.  Regarding which notion Fred Reed, who lives in Mexico, <a href=\"http://www.fredoneverything.net/Lumbo.shtml\">has a few thoughts</a>.</p><p>The ridiculous thing is that the possibility of some kind of violent conflict with Mexico became not only realistic but probable the minute that the immigration spigot was opened.   The dangerous thing is that because of the Mexification of California and portions of the American Southwest, all of the fireworks aren’t going to take place south of the border.</p></div>",
  "content_text": "About the only idea dumber than not sending Mexican immigrants back to Mexico is the idea of returning the favor and\ninvading Mexico right back\n:\nNational pride is a good thing – until the water reaches your chin and your nation is still sinking. Mexico is not in that deep yet, but parts of the country are. Seven criminal cartels effectively control most cities and the drug trafficking lanes near the U.S. border, as well as their bases and production centers in the interior.\nThe Mexican government announced on Wednesday that it will send more troops and federal police to its northeastern corner near the U.S. border.\nYet the Mexican elite class and military remain too proud to do what they immediately should: Call in the Marines.\nI say this a bit tendentiously to get Mexicans out of their nationalistic stupor. They, in fact, should call in the U.S. Army, Navy and Air Force, too. But not in large units. Rather, Mexico is in dire need of American military specialists stationed within its borders to help the country build powerful electronic intelligence systems and train modern military and police forces to replace its suffocatingly hierarchical, outdated ones.\nJust a few specialists, right.  And then when a number of specialists are taken out by the armed cartels who presumably are capable of understanding why the American specialists are there, the Obama administration will either a) withdraw the specialists in which case they need not ever bothered sending them in the first place, or b) escalate American forces there.  Regarding which notion Fred Reed, who lives in Mexico,\nhas a few thoughts\n.\nThe ridiculous thing is that the possibility of some kind of violent conflict with Mexico became not only realistic but probable the minute that the immigration spigot was opened.   The dangerous thing is that because of the Mexification of California and portions of the American Southwest, all of the fireworks aren’t going to take place south of the border.",
  "tags": [
    "immigration",
    "war"
  ],
  "categories": [],
  "sitemap_lastmod": "2010-12-16T15:15:00+00:00"
}