{
  "url": "https://voxday.net/2023/12/16/annual-interview-2023/",
  "scraped_at": "2026-01-08T14:18:25.920105",
  "title": "Annual Interview 2023",
  "date_display": "December 16, 2023",
  "date_iso": "2023-12-16T11:33:50+00:00",
  "date_from_url": "2023-12-16",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>These massive annual interviews with the Russian president are going to be important historical documents one day. While Vladimir Putin may not be either the smartest or the most powerful world leader – that is almost certainly Xi Xinping – he has been astonishingly successful despite arguably facing the greatest degree of difficulty of any nation that was not already under military occupation by a conqueror. Two days ago, <a href=\"http://en.kremlin.ru/events/president/transcripts/72994\">he gave the 2023 edition</a>:</p><blockquote class=\"wp-block-quote is-layout-flow wp-block-quote-is-layout-flow\"><p><strong>Yekaterina Berezovskaya: </strong>Mr President, last week you announced your decision to run for president. In this regard, what goals do you consider the most important, at home and abroad?</p><p><strong>Vladimir Putin:</strong> I have spoken about this many times, but it would not hurt to say it once again. For a country like Russia, existence, mere existence, is impossible without sovereignty. Without sovereignty, Russia would cease to exist, at least in the form it exists today and has existed for a thousand years.</p><p>Therefore, our main objective is to strengthen sovereignty. But it is a broad concept. For example, strengthening sovereignty on the international stage involves enhancing our defence capability and security on the external contour. It also includes strengthening social sovereignty, which means providing safeguards for the rights and freedoms of our citizens, as well as developing our political and parliamentary systems. And lastly, it includes economic security and sovereignty, as well as technological sovereignty.</p><p>I think that right now, to answer your question, there is no need to be specific about all these vectors and avenues, but I am certain that people in this audience and across the country understand perfectly well that Russia would not survive without this. Just like any other country, Russia must assert its financial, economic, and technological sovereignty in order to have a future.</p><p><strong>Pavel Zarubin: </strong>Since we are discussing the economy, the fact that the Russian economy has not crumbled under pressure from its so-called former partners surprised many people around the world. However, these former partners have been openly seeking to finish their job by exerting even more pressure, as we have been hearing in their public statements.</p><p>How strong and resilient is the Russian economy? What is its margin of safety?</p><p><strong>Vladimir Putin: </strong>Big enough so that we not just feel confident but also progress.</p><p>This margin of safety, as we have said on numerous occasions, but let me say it again, rests on several components.</p><p>The first and most important element is the high level of unity in Russian society.</p><p>The second element is the stability of our financial and economic system. As it turned out, and this came as a big surprise to our so-called partners and, frankly, many of us, over the previous decades Russia has accumulated a sufficient margin of safety and stability in finance and the economy.</p><p>And the third element is, of course, the growing capability of our security component, that is, the army and security agencies.</p> <cite>Results of the Year with Vladimir Putin, PRESIDENT OF RUSSIA, 14 December 2023</cite></blockquote><p>Notice that Putin stresses “the high level of unity in Russian society” as the primary element in Russia’s economic power, which underlies both its military power and its national sovereignty. This is in complete and direct contradiction to the Clown World claim that “diversity is our strength” and that free trade and the free movement of people is the source of wealth, economic growth, and economic power.</p><p>It’s not an accident that both China and Russia have rejected Clown World’s economics and are prospering as a result, despite the relentless doomsaying about their economies by Clown World economists. But Clown World economists will still be babbling nonsensically about the way immigration grows the economy in GDP terms as the White House is burned down by rioting Africans and Westminster is converted into a mosque.</p><p>The whole thing is very long, but it is absolutely required reading for anyone who wants to have even a glimmer of understanding about the coming events of 2024.</p><blockquote class=\"wp-block-quote is-layout-flow wp-block-quote-is-layout-flow\"><p><strong>Kommersant newspaper: </strong>Mr President, you said that the world will never be the same again. What would you say to Vladimir Putin from 2000 if you had the chance? What advice would you give? What would you warn him against? Do you have any regrets?</p><p><strong>Vladimir Putin: </strong>What would I say? I would say: you are on the right track, comrades. What would I warn him against? Against naivety and excessive trust in our so-called partners. As for tips and advice, I would say this: We must have faith in the great Russian people and nation. This faith provides a pathway to reviving, shaping and developing Russia.</p></blockquote><p>I will analyze this on a Darkstream before the end of the year.</p><p><em><a href=\"https://social.infogalactic.com/micropost/b79ec9bc-6f4d-492c-a9a1-5d6eaeddf419\">DISCUSS ON SG</a></em></p></div>",
  "content_text": "These massive annual interviews with the Russian president are going to be important historical documents one day. While Vladimir Putin may not be either the smartest or the most powerful world leader – that is almost certainly Xi Xinping – he has been astonishingly successful despite arguably facing the greatest degree of difficulty of any nation that was not already under military occupation by a conqueror. Two days ago,\nhe gave the 2023 edition\n:\nYekaterina Berezovskaya:\nMr President, last week you announced your decision to run for president. In this regard, what goals do you consider the most important, at home and abroad?\nVladimir Putin:\nI have spoken about this many times, but it would not hurt to say it once again. For a country like Russia, existence, mere existence, is impossible without sovereignty. Without sovereignty, Russia would cease to exist, at least in the form it exists today and has existed for a thousand years.\nTherefore, our main objective is to strengthen sovereignty. But it is a broad concept. For example, strengthening sovereignty on the international stage involves enhancing our defence capability and security on the external contour. It also includes strengthening social sovereignty, which means providing safeguards for the rights and freedoms of our citizens, as well as developing our political and parliamentary systems. And lastly, it includes economic security and sovereignty, as well as technological sovereignty.\nI think that right now, to answer your question, there is no need to be specific about all these vectors and avenues, but I am certain that people in this audience and across the country understand perfectly well that Russia would not survive without this. Just like any other country, Russia must assert its financial, economic, and technological sovereignty in order to have a future.\nPavel Zarubin:\nSince we are discussing the economy, the fact that the Russian economy has not crumbled under pressure from its so-called former partners surprised many people around the world. However, these former partners have been openly seeking to finish their job by exerting even more pressure, as we have been hearing in their public statements.\nHow strong and resilient is the Russian economy? What is its margin of safety?\nVladimir Putin:\nBig enough so that we not just feel confident but also progress.\nThis margin of safety, as we have said on numerous occasions, but let me say it again, rests on several components.\nThe first and most important element is the high level of unity in Russian society.\nThe second element is the stability of our financial and economic system. As it turned out, and this came as a big surprise to our so-called partners and, frankly, many of us, over the previous decades Russia has accumulated a sufficient margin of safety and stability in finance and the economy.\nAnd the third element is, of course, the growing capability of our security component, that is, the army and security agencies.\nResults of the Year with Vladimir Putin, PRESIDENT OF RUSSIA, 14 December 2023\nNotice that Putin stresses “the high level of unity in Russian society” as the primary element in Russia’s economic power, which underlies both its military power and its national sovereignty. This is in complete and direct contradiction to the Clown World claim that “diversity is our strength” and that free trade and the free movement of people is the source of wealth, economic growth, and economic power.\nIt’s not an accident that both China and Russia have rejected Clown World’s economics and are prospering as a result, despite the relentless doomsaying about their economies by Clown World economists. But Clown World economists will still be babbling nonsensically about the way immigration grows the economy in GDP terms as the White House is burned down by rioting Africans and Westminster is converted into a mosque.\nThe whole thing is very long, but it is absolutely required reading for anyone who wants to have even a glimmer of understanding about the coming events of 2024.\nKommersant newspaper:\nMr President, you said that the world will never be the same again. What would you say to Vladimir Putin from 2000 if you had the chance? What advice would you give? What would you warn him against? Do you have any regrets?\nVladimir Putin:\nWhat would I say? I would say: you are on the right track, comrades. What would I warn him against? Against naivety and excessive trust in our so-called partners. As for tips and advice, I would say this: We must have faith in the great Russian people and nation. This faith provides a pathway to reviving, shaping and developing Russia.\nI will analyze this on a Darkstream before the end of the year.\nDISCUSS ON SG",
  "tags": [
    "interview",
    "Russia"
  ],
  "categories": [],
  "sitemap_lastmod": "2023-12-16T17:19:56+00:00"
}