{
  "url": "https://voxday.net/2023/12/27/by-any-means/",
  "scraped_at": "2026-01-08T14:19:28.680732",
  "title": "By Any Means",
  "date_display": "December 27, 2023",
  "date_iso": "2023-12-27T10:50:07+00:00",
  "date_from_url": "2023-12-27",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>China has been watching NATO encroach on Russia’s borders over the last two years and <a href=\"https://www.rt.com/news/589729-xi-warning-taiwan-separatism/\">it is clearly not inclined</a> to permit a similar process take place in or anywhere near its own territory:</p><blockquote class=\"wp-block-quote is-layout-flow wp-block-quote-is-layout-flow\"><p>Beijing will use “any means” to prevent the secession of Taiwan, Chinese President Xi Jinping said on Tuesday, adding that the island’s reunification with the mainland is inevitable. Xi’s comments were part of a speech to the Central Committee of the Communist Party of China, at a symposium marking the 130th birthday of Mao Zedong, according to Xinhua news agency.</p><p>“We will resolutely prevent anyone from making Taiwan secede from China by any means,” Xi was quoted as saying.</p><p>Xi also described the “complete reunification” of China as “an inevitable trend”; both in the national interest and the desire of the people. He called for efforts to “promote the peaceful development” of relations with the island and further integrated development “in all fields.”</p> <cite>Xi sends warning over Taiwan, RUSSIA TODAY, 27 December 2023</cite></blockquote><p>China’s state media and diplomats <a href=\"http://belfast.china-consulate.gov.cn/eng/wjbfyrth_3/202312/t20231225_11212449.htm\">have also made it clear</a> that they are paying close attention to Japan’s historical decision to further abandon its post-WWII pacifism under pressure from the USA:</p><blockquote class=\"wp-block-quote is-layout-flow wp-block-quote-is-layout-flow\"><p><strong>Global Times:</strong> <em>It is reported that the Japanese government adopted the updated Three Principles on Transfer of Defense Equipment and Technology and its implementation guidelines (herein referred to as “Three Principles”) on December 22 with a decision to provide its home-made Patriot air defence missiles to the United States. It is the first time that Japan has allowed the export of destruction weapons since its Cabinet’s adoption of the Three Principles in 2014. On the same day, the Cabinet approved the budget for Fiscal Year 2024 with a record defense budget of around JPY 7.9 trillion, up by 16.6 percent year on year. What is your comment?</em></p><p><strong>Mao Ning:</strong> Given Japan’s recent history of militarist aggression, Japan’s military and security moves are closely watched by its Asian neighbors and the international community. In recent years, Japan has been drastically readjusting its security policy, increasing defense spending year after year, easing the restrictions on arms export and seeking military breakthroughs. We urge Japan to earnestly respect the security concerns of neighboring countries, reflect on its history of aggression, commit itself to the path of peaceful development and earn the trust of its Asian neighbors and the wider international community through concrete actions.</p></blockquote><p>There is no amount of deception and narrative massage that is going to fool the Chinese government. Whereas Russia was foolish enough to buy into the global economy narrative and accept the idea that the USA and its European satrapies could be partners, it’s very clear that the Chinese have learned from the Russian example and have no intention of being similarly bamboozled.</p><p>If the USA attempts to reconstruct SEATO, it is certain that China will take steps to prevent it, and it will do so much more quickly and aggressively than Russia did with NATO.</p><p><em><a href=\"https://social.infogalactic.com/micropost/a43c444a-5cdc-4363-9e4c-0885279b5356\">DISCUSS ON SG</a></em></p></div>",
  "content_text": "China has been watching NATO encroach on Russia’s borders over the last two years and\nit is clearly not inclined\nto permit a similar process take place in or anywhere near its own territory:\nBeijing will use “any means” to prevent the secession of Taiwan, Chinese President Xi Jinping said on Tuesday, adding that the island’s reunification with the mainland is inevitable. Xi’s comments were part of a speech to the Central Committee of the Communist Party of China, at a symposium marking the 130th birthday of Mao Zedong, according to Xinhua news agency.\n“We will resolutely prevent anyone from making Taiwan secede from China by any means,” Xi was quoted as saying.\nXi also described the “complete reunification” of China as “an inevitable trend”; both in the national interest and the desire of the people. He called for efforts to “promote the peaceful development” of relations with the island and further integrated development “in all fields.”\nXi sends warning over Taiwan, RUSSIA TODAY, 27 December 2023\nChina’s state media and diplomats\nhave also made it clear\nthat they are paying close attention to Japan’s historical decision to further abandon its post-WWII pacifism under pressure from the USA:\nGlobal Times:\nIt is reported that the Japanese government adopted the updated Three Principles on Transfer of Defense Equipment and Technology and its implementation guidelines (herein referred to as “Three Principles”) on December 22 with a decision to provide its home-made Patriot air defence missiles to the United States. It is the first time that Japan has allowed the export of destruction weapons since its Cabinet’s adoption of the Three Principles in 2014. On the same day, the Cabinet approved the budget for Fiscal Year 2024 with a record defense budget of around JPY 7.9 trillion, up by 16.6 percent year on year. What is your comment?\nMao Ning:\nGiven Japan’s recent history of militarist aggression, Japan’s military and security moves are closely watched by its Asian neighbors and the international community. In recent years, Japan has been drastically readjusting its security policy, increasing defense spending year after year, easing the restrictions on arms export and seeking military breakthroughs. We urge Japan to earnestly respect the security concerns of neighboring countries, reflect on its history of aggression, commit itself to the path of peaceful development and earn the trust of its Asian neighbors and the wider international community through concrete actions.\nThere is no amount of deception and narrative massage that is going to fool the Chinese government. Whereas Russia was foolish enough to buy into the global economy narrative and accept the idea that the USA and its European satrapies could be partners, it’s very clear that the Chinese have learned from the Russian example and have no intention of being similarly bamboozled.\nIf the USA attempts to reconstruct SEATO, it is certain that China will take steps to prevent it, and it will do so much more quickly and aggressively than Russia did with NATO.\nDISCUSS ON SG",
  "tags": [
    "China",
    "war"
  ],
  "categories": [],
  "sitemap_lastmod": "2023-12-27T10:50:09+00:00"
}