{
  "url": "https://voxday.net/2023/12/26/china-connects-the-dots/",
  "scraped_at": "2026-01-08T14:19:24.358832",
  "title": "China Connects the Dots",
  "date_display": "December 26, 2023",
  "date_iso": "2023-12-26T17:37:54+00:00",
  "date_from_url": "2023-12-26",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>It’s fascinating to see the Chinese media is now <a href=\"https://www.globaltimes.cn/page/202312/1304272.shtml\">openly discussing the sort of connections</a> that tend to get one rapidly cancelled as a “conspiracy theorist” and even an “antisemite” in the West:</p><blockquote class=\"wp-block-quote is-layout-flow wp-block-quote-is-layout-flow\"><p>“A just cause enjoys abundant support, while an unjust cause finds little support.” No one feels this snippet of wisdom more deeply than the US now. A spokesman for Spain’s defense ministry told AFP on Sunday that the country will not participate in the so-called Operation Prosperity Guardian, a US-led maritime task force in the Red Sea that aims to protect the passage of Israeli-owned and Israel-bound merchant vessels.</p><p>Obviously, the US’ European allies are no longer willing to foot the bill of the US’ selfishness. Operation Prosperity Guardian organized by the US has a strong political overtone, that is, safeguarding Israel’s national interests. Israel’s actions in Gaza have aroused the anger of the international community. More than 20,000 Palestinians have reportedly been killed, more than 50,000 injured, and much of Gaza has been destroyed. Some European countries have begun to diverge from the US on the Palestinian-Israeli conflict. The objective of the US creating the Red Sea alliance, on the one hand, is testing whether its allies share the same beliefs with it on this issue. On the other hand, Washington is levering multilateral diplomatic actions to cover up its unilateral support of Israel.</p><p>US allies always support the US and share its stance, but that does not mean they will unlimitedly support the frenzied positions taken by the US on all issues, especially when the US position is contrary to their own interests…</p><p>Song Zhongping, a Chinese military expert, believes that no matter it is the Iraq war, the Afghan war, or the current Russia-Ukraine or Palestinian-Israeli conflict, the US’ performance has made it lose its credibility and leadership. US allies see clearly that the US only causes trouble, but it is not willing to bear the consequences. Instead, it lets its allies clean up the mess. The appeal of the US has declined, as the US that is used to being echoed is now being rejected. This is a true manifestation of “A just cause enjoys abundant support, while an unjust cause finds little support.”</p> <cite>Cracks in Red Sea alliance underline US-Europe division, GLOBAL TIMES, 25 December 2023</cite></blockquote><p>The fact that China is openly connecting the dots for the benefit of the global public is highlighted by the way Clown World’s media is actively attempting to hide the nature of the Yemeni-Israeli conflict and the fact that the Yemenis are only attacking Israeli-owned ships attempting to transit the Red Sea.</p><p>This operation is now coming apart in recriminations because commercial vessel owners in France, Spain, and Italy have accepted that if they negotiate Israel-boycott deals directly with the Houthis, they can continue to operate through the Red Sea. They resent the commercial competition from Russia and China which are operating oil tankers and dry-cargo carriers without hindrance or threat.</p><p>The obviousness of the targeting by the Houthis, and of Houthi deal-making by the Russians and Chinese, are being concealed, however, in the US and UK maritime industry media and the mainstream press.</p><p>In the most recent strike, the Israeli oil tanker<em> Chem Pluto</em> was hit on Saturday, December 23, by a drone about 1,600 kilometres east of the Yemen coast; about 200 kilometres west of the Indian coast. Initial media reporting claimed the vessel was “affiliated” to Israel but emphasized that it was owned by a Japanese entity and managed by a Dutch one… The allies knew at once that the<em> Chem Pluto</em> had been targeted because it was Israeli-owned. However, the Pentagon, the Voice of America, and UK propaganda continue to pretend that the Houthi targeting is not tied to the Israel Defence Forces’ operations in Gaza, and carefully restricted to Israeli and allied targets.</p><p>As with the current economic and military situations, the Western media’s attempts to construct and maintain false narratives, and to limit the influence of alternative medias that do not respect the narrative, is being systematically undermined by Clown World’s inability to influence the Chinese and Russian medias.</p><p>It’s very interesting to see how long it will take US politicians, narrative police, and corporate interests to come to term with the fact that the USA is no longer a monopolar power and that the markets of the West are no longer the most sizable, most advanced, or the most profitable.</p><p><em><a href=\"https://social.infogalactic.com/micropost/d343d0ac-e106-43fb-9e13-e0beebf68d8f\">DISCUSS ON SG</a></em></p></div>",
  "content_text": "It’s fascinating to see the Chinese media is now\nopenly discussing the sort of connections\nthat tend to get one rapidly cancelled as a “conspiracy theorist” and even an “antisemite” in the West:\n“A just cause enjoys abundant support, while an unjust cause finds little support.” No one feels this snippet of wisdom more deeply than the US now. A spokesman for Spain’s defense ministry told AFP on Sunday that the country will not participate in the so-called Operation Prosperity Guardian, a US-led maritime task force in the Red Sea that aims to protect the passage of Israeli-owned and Israel-bound merchant vessels.\nObviously, the US’ European allies are no longer willing to foot the bill of the US’ selfishness. Operation Prosperity Guardian organized by the US has a strong political overtone, that is, safeguarding Israel’s national interests. Israel’s actions in Gaza have aroused the anger of the international community. More than 20,000 Palestinians have reportedly been killed, more than 50,000 injured, and much of Gaza has been destroyed. Some European countries have begun to diverge from the US on the Palestinian-Israeli conflict. The objective of the US creating the Red Sea alliance, on the one hand, is testing whether its allies share the same beliefs with it on this issue. On the other hand, Washington is levering multilateral diplomatic actions to cover up its unilateral support of Israel.\nUS allies always support the US and share its stance, but that does not mean they will unlimitedly support the frenzied positions taken by the US on all issues, especially when the US position is contrary to their own interests…\nSong Zhongping, a Chinese military expert, believes that no matter it is the Iraq war, the Afghan war, or the current Russia-Ukraine or Palestinian-Israeli conflict, the US’ performance has made it lose its credibility and leadership. US allies see clearly that the US only causes trouble, but it is not willing to bear the consequences. Instead, it lets its allies clean up the mess. The appeal of the US has declined, as the US that is used to being echoed is now being rejected. This is a true manifestation of “A just cause enjoys abundant support, while an unjust cause finds little support.”\nCracks in Red Sea alliance underline US-Europe division, GLOBAL TIMES, 25 December 2023\nThe fact that China is openly connecting the dots for the benefit of the global public is highlighted by the way Clown World’s media is actively attempting to hide the nature of the Yemeni-Israeli conflict and the fact that the Yemenis are only attacking Israeli-owned ships attempting to transit the Red Sea.\nThis operation is now coming apart in recriminations because commercial vessel owners in France, Spain, and Italy have accepted that if they negotiate Israel-boycott deals directly with the Houthis, they can continue to operate through the Red Sea. They resent the commercial competition from Russia and China which are operating oil tankers and dry-cargo carriers without hindrance or threat.\nThe obviousness of the targeting by the Houthis, and of Houthi deal-making by the Russians and Chinese, are being concealed, however, in the US and UK maritime industry media and the mainstream press.\nIn the most recent strike, the Israeli oil tanker\nChem Pluto\nwas hit on Saturday, December 23, by a drone about 1,600 kilometres east of the Yemen coast; about 200 kilometres west of the Indian coast. Initial media reporting claimed the vessel was “affiliated” to Israel but emphasized that it was owned by a Japanese entity and managed by a Dutch one… The allies knew at once that the\nChem Pluto\nhad been targeted because it was Israeli-owned. However, the Pentagon, the Voice of America, and UK propaganda continue to pretend that the Houthi targeting is not tied to the Israel Defence Forces’ operations in Gaza, and carefully restricted to Israeli and allied targets.\nAs with the current economic and military situations, the Western media’s attempts to construct and maintain false narratives, and to limit the influence of alternative medias that do not respect the narrative, is being systematically undermined by Clown World’s inability to influence the Chinese and Russian medias.\nIt’s very interesting to see how long it will take US politicians, narrative police, and corporate interests to come to term with the fact that the USA is no longer a monopolar power and that the markets of the West are no longer the most sizable, most advanced, or the most profitable.\nDISCUSS ON SG",
  "tags": [
    "China",
    "media",
    "war"
  ],
  "categories": [],
  "sitemap_lastmod": "2023-12-26T17:52:44+00:00"
}