{
  "url": "https://voxday.net/2023/12/09/collecting-the-library/",
  "scraped_at": "2026-01-08T14:17:50.642022",
  "title": "Collecting the Library",
  "date_display": "December 9, 2023",
  "date_iso": "2023-12-09T18:27:56+00:00",
  "date_from_url": "2023-12-09",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>For those who are interested in following along what Castalia is doing with the Library, we’re going to make a concerted effort to keep <a href=\"https://www.librarything.com/ngroups/22493/Castalia-Library-Collectors\">the Castalia Library Collectors group</a> up to date. The group is approved admission only, so feel free to sign up and then request permission to join the group. Among other things, it has official lists of what the past and present subscription books are for Library/Libraria, History, as well as the non-subscription books.</p><p>And while it’s too soon to announce any specifics, I’m very pleased to be able to say we have reached agreements with three major publishers regarding books we plan to offer as separate subscriptions. In a few special cases, one book, or at most two books, in the series will be offered as part of either the Library or the History subscription, but in such cases we will design the book(s) in such a way as to make it clear to which subscription it belongs.</p><p>On the bindery front, we still have one final issue to resolve, and two issues that we believe are resolved, but must be further tested to ensure they are, in fact, resolved, before we declare it fully operational and begin work on Heidi (Deutsch) and the two Homers.</p><p><em><a href=\"https://social.infogalactic.com/micropost/837381b8-ac6d-4787-abf6-daa147cf60a4\">DISCUSS ON SG</a></em></p></div>",
  "content_text": "For those who are interested in following along what Castalia is doing with the Library, we’re going to make a concerted effort to keep\nthe Castalia Library Collectors group\nup to date. The group is approved admission only, so feel free to sign up and then request permission to join the group. Among other things, it has official lists of what the past and present subscription books are for Library/Libraria, History, as well as the non-subscription books.\nAnd while it’s too soon to announce any specifics, I’m very pleased to be able to say we have reached agreements with three major publishers regarding books we plan to offer as separate subscriptions. In a few special cases, one book, or at most two books, in the series will be offered as part of either the Library or the History subscription, but in such cases we will design the book(s) in such a way as to make it clear to which subscription it belongs.\nOn the bindery front, we still have one final issue to resolve, and two issues that we believe are resolved, but must be further tested to ensure they are, in fact, resolved, before we declare it fully operational and begin work on Heidi (Deutsch) and the two Homers.\nDISCUSS ON SG",
  "tags": [
    "books",
    "Castalia House"
  ],
  "categories": [],
  "sitemap_lastmod": "2023-12-09T20:03:39+00:00"
}