{
  "url": "https://voxday.net/2023/12/30/sykes-picot-is-dead/",
  "scraped_at": "2026-01-08T14:19:39.018835",
  "title": "Sykes-Picot is Dead",
  "date_display": "December 30, 2023",
  "date_iso": "2023-12-30T16:30:24+00:00",
  "date_from_url": "2023-12-30",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p><em><a href=\"https://infogalactic.com/info/Sykes%E2%80%93Picot_Agreement\">The Sykes–Picot Agreement</a>, officially known as the Asia Minor Agreement, was a secret agreement between the governments of the United Kingdom and France, with the assent of Russia, defining their proposed spheres of influence and control in the Middle East should the Triple Entente succeed in defeating the Ottoman Empire during World War I. The negotiation of the treaty occurred between November 1915 and March 1916. The agreement was concluded on 16 May 1916. The agreement effectively divided the Arab provinces of the Ottoman Empire outside the Arabian peninsula into areas of future British and French control or influence.</em></p><blockquote class=\"wp-block-quote is-layout-flow wp-block-quote-is-layout-flow\"><p>Pepe Escobar describes <a href=\"https://new.thecradle.co/articles-id/17151\">the geo-strategic significance of the Yemeni-imposed restrictions</a> on Red Sea traffic and how they have proven vastly more effective than the G7 sanctions on Russia:</p><p>In chess, there always comes a time when a simple pawn is able to upset the whole chessboard, usually via a move in the back rank whose effect simply cannot be calculated.</p><p>Yes, a pawn can impose a seismic checkmate. That’s where we are, geopolitically, right now.</p><p>The cascading effects of a single move on the chessboard – Yemen’s Ansarallah stunning and carefully targeted blockade of the Red Sea – reach way beyond global shipping, supply chains, and The War of Economic Corridors. Not to mention the reduction of the much lauded US Navy force projection to irrelevancy.</p><p>Yemen’s resistance movement, Ansarallah, has made it very clear that any Israel-affiliated or Israel-destined vessel will be intercepted. While the west bristles at this, and imagines itself a target, the rest of the world fully understands that all other shipping is free to pass. Russian tankers – as well as Chinese, Iranian, and Global South ships – continue to move undisturbed across the Bab al-Mandeb (narrowest point: 33 km) and the Red Sea.</p><p>Only the Hegemon is disturbed by this challenge to its ‘rules-based order.’ It is outraged that western vessels delivering energy or goods to law-breaking Israel can be impeded, and that the supply chain has been severed and plunged into deep crisis. The pinpointed target is the Israeli economy, which is already bleeding heavily. A single Yemeni move proves to be more efficient than a torrent of imperial sanctions.</p><p>It is the tantalizing possibility of this single move turning into a paradigm shift – with no return – that is adding to the Hegemon’s apoplexy. Especially because imperial humiliation is deeply embedded in the paradigm shift.</p><p>Russian President Vladimir Putin, on the record, is now sending an unmistakeable message: Forget the Suez Canal. The way to go is the Northern Sea Route – which the Chinese, in the framework of the Russia-China strategic partnership, call the Arctic Silk Road.</p><p>For the dumbfounded Europeans, the Russians have detailed three options: First, sail 15,000 miles around the Cap of Good Hope. Second, use Russia’s cheaper and faster Northern Sea Route. Third, send the cargo via Russian Railways.</p><p>Rosatom, which oversees the Northern Sea Route, has emphasized that non-ice-class ships are now able to sail throughout summer and autumn, and year-round navigation will soon be possible with the help of a fleet of nuclear icebreakers.</p><p>All that as direct consequences of the single Yemeni move. What next? Yemen entering BRICS+ at the summit in Kazan in late 2024, under the Russian presidency?</p><p>The US-led Armada put together for Operation Genocide Protection, which collapsed even before birth, may have been set up to “warn Iran,” apart from giving Ansarallah a scare. Just as the Houthis, Tehran is hardly intimidated because, as West Asia analyst ace Alastair Crooke succinctly put it: “Sykes-Picot is dead.”</p><p>This is a quantum shift on the chessboard. It means West Asian powers will frame the new regional architecture from now on, not US Navy “projection.”</p><p>That carries an ineffable corollary: those eleven US aircraft carrier task forces, for all practical purposes, are essentially worthless.</p> <cite>How Yemen changed everything, PEPE ESCOBAR, 28 December 2023</cite></blockquote><p>I find this move by the Yemenis, presumably made in coordination with China, Russia, and several of the Arab nations, to be utterly fascinating, and more importantly, indicative of how far ahead of Clown World the BRICS strategists appear to be thinking. While I was certain that the impotence of the US Navy was a) going to be demonstrated before 2030 and b) that demonstration would have a significant effect on the way in which the nations regarded Clown World going forward, I assumed that it would be necessary for someone to sink a carrier or three in order to demonstrate that impotence.</p><p>But this is a much more elegant approach, as the observable reluctance of the US Navy to risk any direct engagement with what is, on the international scale, a sixth-rate power, demonstrates that impotence even more clearly than the loss of an entire carrier task force in the South China Sea could. After all, only Russia possesses the striking power of the Chinese military, but most of the nations in the world have resources that exceed that of Yemen; even the military capabilities of Croatia and The Democratic Republic of the Congo <a href=\"https://www.globalfirepower.com/countries-listing.php\">are rated ahead of Yemen</a> in the 2023 Global Firepower rankings.</p><p>It’s one thing for Russia to prove that the Empire can’t push it around, it’s another thing for the nation ranked 74th in the world to do so.</p><p>If it is not yet clear to everyone that the US empire is in rapid decline, we can be confident that it is entirely apparent to everyone whose opinion matters.</p><p><strong>UPDATE: </strong>Meanwhile, the US government continues to demonstrate that <a href=\"https://www.rt.com/business/589812-us-eu-g7-russia-frozen-assets/\">it has not yet learned anything</a> from the consequences of its recent attempts to poke the bear.</p><p><em>The United States has called for working groups from the Group of Seven (G7) countries to explore ways to confiscate hundreds of billions of dollars in frozen Russian assets, the Financial Times reported this week. The United States, backed by the UK, Japan and Canada, has proposed setting up preparatory work for expropriating over $300 billion in Russian foreign exchange reserves that were immobilized by Western nations after the start of the Ukraine conflict.</em></p><p><em>The EU, where most of the assets are blocked, is more wary of a direct confiscation, fearing possible retaliation from Moscow if the money is taken. Currently, €210 billion ($230 billion) of Russia’s reserves are held in the bloc’s financial institutions, with €191 billion in Belgium, €19 billion in France, and €7.8 billion in non-member Switzerland.</em></p><p>Stealing Russian assets is not the greatest plan in the world when Russia is going to be in a position to simply march some of its 1.5 million mobilized troops into some of those nations and take whatever it wants from whomever it wants within the next two years. Notice that the G7 countries which are within marching distance don’t appear to be quite as enthusiastic about offering Moscow yet another <em>casus belli</em>.</p><p><em><a href=\"https://social.infogalactic.com/micropost/4a93f4fe-64fe-437a-a0f7-a27d808e57da\">DISCUSS ON SG</a></em></p></div>",
  "content_text": "The Sykes–Picot Agreement\n, officially known as the Asia Minor Agreement, was a secret agreement between the governments of the United Kingdom and France, with the assent of Russia, defining their proposed spheres of influence and control in the Middle East should the Triple Entente succeed in defeating the Ottoman Empire during World War I. The negotiation of the treaty occurred between November 1915 and March 1916. The agreement was concluded on 16 May 1916. The agreement effectively divided the Arab provinces of the Ottoman Empire outside the Arabian peninsula into areas of future British and French control or influence.\nPepe Escobar describes\nthe geo-strategic significance of the Yemeni-imposed restrictions\non Red Sea traffic and how they have proven vastly more effective than the G7 sanctions on Russia:\nIn chess, there always comes a time when a simple pawn is able to upset the whole chessboard, usually via a move in the back rank whose effect simply cannot be calculated.\nYes, a pawn can impose a seismic checkmate. That’s where we are, geopolitically, right now.\nThe cascading effects of a single move on the chessboard – Yemen’s Ansarallah stunning and carefully targeted blockade of the Red Sea – reach way beyond global shipping, supply chains, and The War of Economic Corridors. Not to mention the reduction of the much lauded US Navy force projection to irrelevancy.\nYemen’s resistance movement, Ansarallah, has made it very clear that any Israel-affiliated or Israel-destined vessel will be intercepted. While the west bristles at this, and imagines itself a target, the rest of the world fully understands that all other shipping is free to pass. Russian tankers – as well as Chinese, Iranian, and Global South ships – continue to move undisturbed across the Bab al-Mandeb (narrowest point: 33 km) and the Red Sea.\nOnly the Hegemon is disturbed by this challenge to its ‘rules-based order.’ It is outraged that western vessels delivering energy or goods to law-breaking Israel can be impeded, and that the supply chain has been severed and plunged into deep crisis. The pinpointed target is the Israeli economy, which is already bleeding heavily. A single Yemeni move proves to be more efficient than a torrent of imperial sanctions.\nIt is the tantalizing possibility of this single move turning into a paradigm shift – with no return – that is adding to the Hegemon’s apoplexy. Especially because imperial humiliation is deeply embedded in the paradigm shift.\nRussian President Vladimir Putin, on the record, is now sending an unmistakeable message: Forget the Suez Canal. The way to go is the Northern Sea Route – which the Chinese, in the framework of the Russia-China strategic partnership, call the Arctic Silk Road.\nFor the dumbfounded Europeans, the Russians have detailed three options: First, sail 15,000 miles around the Cap of Good Hope. Second, use Russia’s cheaper and faster Northern Sea Route. Third, send the cargo via Russian Railways.\nRosatom, which oversees the Northern Sea Route, has emphasized that non-ice-class ships are now able to sail throughout summer and autumn, and year-round navigation will soon be possible with the help of a fleet of nuclear icebreakers.\nAll that as direct consequences of the single Yemeni move. What next? Yemen entering BRICS+ at the summit in Kazan in late 2024, under the Russian presidency?\nThe US-led Armada put together for Operation Genocide Protection, which collapsed even before birth, may have been set up to “warn Iran,” apart from giving Ansarallah a scare. Just as the Houthis, Tehran is hardly intimidated because, as West Asia analyst ace Alastair Crooke succinctly put it: “Sykes-Picot is dead.”\nThis is a quantum shift on the chessboard. It means West Asian powers will frame the new regional architecture from now on, not US Navy “projection.”\nThat carries an ineffable corollary: those eleven US aircraft carrier task forces, for all practical purposes, are essentially worthless.\nHow Yemen changed everything, PEPE ESCOBAR, 28 December 2023\nI find this move by the Yemenis, presumably made in coordination with China, Russia, and several of the Arab nations, to be utterly fascinating, and more importantly, indicative of how far ahead of Clown World the BRICS strategists appear to be thinking. While I was certain that the impotence of the US Navy was a) going to be demonstrated before 2030 and b) that demonstration would have a significant effect on the way in which the nations regarded Clown World going forward, I assumed that it would be necessary for someone to sink a carrier or three in order to demonstrate that impotence.\nBut this is a much more elegant approach, as the observable reluctance of the US Navy to risk any direct engagement with what is, on the international scale, a sixth-rate power, demonstrates that impotence even more clearly than the loss of an entire carrier task force in the South China Sea could. After all, only Russia possesses the striking power of the Chinese military, but most of the nations in the world have resources that exceed that of Yemen; even the military capabilities of Croatia and The Democratic Republic of the Congo\nare rated ahead of Yemen\nin the 2023 Global Firepower rankings.\nIt’s one thing for Russia to prove that the Empire can’t push it around, it’s another thing for the nation ranked 74th in the world to do so.\nIf it is not yet clear to everyone that the US empire is in rapid decline, we can be confident that it is entirely apparent to everyone whose opinion matters.\nUPDATE:\nMeanwhile, the US government continues to demonstrate that\nit has not yet learned anything\nfrom the consequences of its recent attempts to poke the bear.\nThe United States has called for working groups from the Group of Seven (G7) countries to explore ways to confiscate hundreds of billions of dollars in frozen Russian assets, the Financial Times reported this week. The United States, backed by the UK, Japan and Canada, has proposed setting up preparatory work for expropriating over $300 billion in Russian foreign exchange reserves that were immobilized by Western nations after the start of the Ukraine conflict.\nThe EU, where most of the assets are blocked, is more wary of a direct confiscation, fearing possible retaliation from Moscow if the money is taken. Currently, €210 billion ($230 billion) of Russia’s reserves are held in the bloc’s financial institutions, with €191 billion in Belgium, €19 billion in France, and €7.8 billion in non-member Switzerland.\nStealing Russian assets is not the greatest plan in the world when Russia is going to be in a position to simply march some of its 1.5 million mobilized troops into some of those nations and take whatever it wants from whomever it wants within the next two years. Notice that the G7 countries which are within marching distance don’t appear to be quite as enthusiastic about offering Moscow yet another\ncasus belli\n.\nDISCUSS ON SG",
  "tags": [
    "decline and fall",
    "economics",
    "history",
    "war"
  ],
  "categories": [],
  "sitemap_lastmod": "2023-12-30T16:57:52+00:00"
}