{
  "url": "https://voxday.net/2023/12/10/the-concepts-of-the-day/",
  "scraped_at": "2026-01-08T14:17:54.304410",
  "title": "The Concepts of the Day",
  "date_display": "December 10, 2023",
  "date_iso": "2023-12-10T13:16:48+00:00",
  "date_from_url": "2023-12-10",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>These two useful concepts, one a neologism, the other an aphorism, stem from <a href=\"https://social.infogalactic.com/micropost/ee9e372d-5580-40cd-b485-db46db735b38\">the same SG thread</a>, which may be of interest to those who have read, at a minimum, both Taleb and Gladwell, but which I will not cite here due to the inevitability of various tangents.</p><p><strong>Syncreto-retardery</strong>: <em>Relative cognitive incapacity. </em>Syncreto-retardery should not be confused with literal retardery of the below-70 IQ variety, although it is worth noting in this quantified context that the midwit stands no closer to the VHIQ and UHIQ than the literal retard does to him. And let’s not even get started on the average…</p><p><strong>VDDQ: </strong><em>“If you admire a man’s books, ignore his Twitter account.”</em></p><p>Very, very few men, myself included, find it easy to ignore the flattering requests for one’s opinion about a wide variety of subjects of which one knows nothing. I do my best to ignore these requests and I’m usually successful in doing so the first two or three times I’m asked. But it can be difficult to resist the temptation to at least say something that sounds more or less reasonable when faced with repeated requests for one’s thoughts on the issue <em>du jour</em>, even when those thoughts are nonexistent.</p><p>We wouldn’t think half so well of Aristotle or other great historical thinkers if a) they had social media accounts and b) we had access to them.</p><p><em><a href=\"https://social.infogalactic.com/micropost/817bfd5c-feed-4c45-bc01-415d6ae96384\">DISCUSS ON SG</a></em></p></div>",
  "content_text": "These two useful concepts, one a neologism, the other an aphorism, stem from\nthe same SG thread\n, which may be of interest to those who have read, at a minimum, both Taleb and Gladwell, but which I will not cite here due to the inevitability of various tangents.\nSyncreto-retardery\n:\nRelative cognitive incapacity.\nSyncreto-retardery should not be confused with literal retardery of the below-70 IQ variety, although it is worth noting in this quantified context that the midwit stands no closer to the VHIQ and UHIQ than the literal retard does to him. And let’s not even get started on the average…\nVDDQ:\n“If you admire a man’s books, ignore his Twitter account.”\nVery, very few men, myself included, find it easy to ignore the flattering requests for one’s opinion about a wide variety of subjects of which one knows nothing. I do my best to ignore these requests and I’m usually successful in doing so the first two or three times I’m asked. But it can be difficult to resist the temptation to at least say something that sounds more or less reasonable when faced with repeated requests for one’s thoughts on the issue\ndu jour\n, even when those thoughts are nonexistent.\nWe wouldn’t think half so well of Aristotle or other great historical thinkers if a) they had social media accounts and b) we had access to them.\nDISCUSS ON SG",
  "tags": [
    "philosophy",
    "Voxiversity"
  ],
  "categories": [],
  "sitemap_lastmod": "2023-12-10T15:14:30+00:00"
}