{
  "url": "https://voxday.net/2023/12/04/the-death-spiral-of-journalism/",
  "scraped_at": "2026-01-08T14:17:18.688192",
  "title": "The Death Spiral of Journalism",
  "date_display": "December 4, 2023",
  "date_iso": "2023-12-04T21:00:56+00:00",
  "date_from_url": "2023-12-04",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>Peter King, an excellent and very liberal sportswriter, <a href=\"https://www.nbcsports.com/nfl/profootballtalk/fmia/news/nfl-san-francisco-49ers-christian-mccaffrey-dak-prescott-fmia-week-13-peter-king\">pointedly refuses an invitation</a> to defend his former publication, <em>Sports Illustrated</em>:</p><blockquote class=\"wp-block-quote is-layout-flow wp-block-quote-is-layout-flow\"><p>On <em>Sports Illustrated</em> and AI. From Nick Colletti, of Grapevine, Texas: <em>“Given your expressed disgust with the recent Charissa Thompson episode, I’d like to get your thoughts on your former employer, Sports Illustrated, being accused of publishing AI-generated stories by non-existent writers. If true, this confirms the death spiral of journalism.”</em></p><p>It’s a sham. It’s a shame. It’s also not surprising that a company that bought a grand brand in the sports media space (but heading downhill fast) would do what so many companies that are money-first, -second and -third would do—try to make money off the great name of <em>Sports Illustrated</em> instead of trying to revive it and make it great again. In the business of journalism, we face a major challenge from companies that cut costs further than down to the bone—but actually into the bone marrow. That resulted in a story by the site <em>Futurism </em>that reported that SI.com posted stories or reviews that were generated by Artificial Intelligence writers, with bylines of invented writers. When <em>Futurism </em>contacted the company for comment on using fake people to write fake stories passed off as content from venerable <em>Sports Illustrated</em>, the stories and the bios of the “writers” disappeared from the site. What the owners of the company are doing now is using the <em>Sports Illustrated</em> name to make money on other things that have nothing to do with journalism.</p></blockquote><p>It’s fascinating to see how even those who are completely blind to the intrinsic degradation of Clown World are capable of seeing the fundamental evil of the corpocracy when it touches their own area of expertise. But there is no reason to mourn the loss of something that was always dyscivilizational, to the contrary, it’s a reminder of how it is wise and proper to focus on building our own platforms and institutions instead of attempting to take the easy path to what supposedly passes for success.</p><p><a href=\"https://slate.com/news-and-politics/2008/05/michael-crichton-s-1993-prediction-of-mass-media-extinction-now-looks-on-target.html\">Michael Crichton was right</a>, he was just three decades too early.</p><blockquote class=\"wp-block-quote is-layout-flow wp-block-quote-is-layout-flow\"><p>In 1993, novelist Michael Crichton riled the news business with a <em>Wired </em>magazine essay titled “Mediasaurus,” in which he prophesied the death of the mass media—specifically the <em>New York Times</em> and the commercial networks. “Vanished, without a trace,” he wrote.</p><p>The mediasaurs had about a decade to live, he wrote, before technological advances—”artificial intelligence agents roaming the databases, downloading stuff I am interested in, and assembling for me a front page”—swept them under. Shedding no tears, Crichton wrote that the shoddy mass media deserved its deadly fate.</p><p>“[T]he American media produce a product of very poor quality,” he lectured. “Its information is not reliable, it has too much chrome and glitz, its doors rattle, it breaks down almost immediately, and it’s sold without warranty. It’s flashy but it’s basically junk.”</p></blockquote><p>It’s pretty obvious that he will have been proven right by 2033… and there’s that number again.</p><p><em><a href=\"https://social.infogalactic.com/micropost/8b578688-d282-4f58-9016-92b9e434f325\">DISCUSS ON SG</a></em></p></div>",
  "content_text": "Peter King, an excellent and very liberal sportswriter,\npointedly refuses an invitation\nto defend his former publication,\nSports Illustrated\n:\nOn\nSports Illustrated\nand AI. From Nick Colletti, of Grapevine, Texas:\n“Given your expressed disgust with the recent Charissa Thompson episode, I’d like to get your thoughts on your former employer, Sports Illustrated, being accused of publishing AI-generated stories by non-existent writers. If true, this confirms the death spiral of journalism.”\nIt’s a sham. It’s a shame. It’s also not surprising that a company that bought a grand brand in the sports media space (but heading downhill fast) would do what so many companies that are money-first, -second and -third would do—try to make money off the great name of\nSports Illustrated\ninstead of trying to revive it and make it great again. In the business of journalism, we face a major challenge from companies that cut costs further than down to the bone—but actually into the bone marrow. That resulted in a story by the site\nFuturism\nthat reported that SI.com posted stories or reviews that were generated by Artificial Intelligence writers, with bylines of invented writers. When\nFuturism\ncontacted the company for comment on using fake people to write fake stories passed off as content from venerable\nSports Illustrated\n, the stories and the bios of the “writers” disappeared from the site. What the owners of the company are doing now is using the\nSports Illustrated\nname to make money on other things that have nothing to do with journalism.\nIt’s fascinating to see how even those who are completely blind to the intrinsic degradation of Clown World are capable of seeing the fundamental evil of the corpocracy when it touches their own area of expertise. But there is no reason to mourn the loss of something that was always dyscivilizational, to the contrary, it’s a reminder of how it is wise and proper to focus on building our own platforms and institutions instead of attempting to take the easy path to what supposedly passes for success.\nMichael Crichton was right\n, he was just three decades too early.\nIn 1993, novelist Michael Crichton riled the news business with a\nWired\nmagazine essay titled “Mediasaurus,” in which he prophesied the death of the mass media—specifically the\nNew York Times\nand the commercial networks. “Vanished, without a trace,” he wrote.\nThe mediasaurs had about a decade to live, he wrote, before technological advances—”artificial intelligence agents roaming the databases, downloading stuff I am interested in, and assembling for me a front page”—swept them under. Shedding no tears, Crichton wrote that the shoddy mass media deserved its deadly fate.\n“[T]he American media produce a product of very poor quality,” he lectured. “Its information is not reliable, it has too much chrome and glitz, its doors rattle, it breaks down almost immediately, and it’s sold without warranty. It’s flashy but it’s basically junk.”\nIt’s pretty obvious that he will have been proven right by 2033… and there’s that number again.\nDISCUSS ON SG",
  "tags": [
    "corpocracy",
    "decline and fall",
    "media"
  ],
  "categories": [],
  "sitemap_lastmod": "2023-12-04T21:08:28+00:00"
}