{
  "url": "https://voxday.net/2023/12/02/the-literary-catastrophe-of-kindle-unlimited/",
  "scraped_at": "2026-01-08T14:17:15.764882",
  "title": "The Literary Catastrophe of Kindle Unlimited",
  "date_display": "December 2, 2023",
  "date_iso": "2023-12-02T17:11:16+00:00",
  "date_from_url": "2023-12-02",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p><strong>TLDR: </strong><em>Since July 2014, Amazon has used Kindle Unlimited to transfer $5 billion to itself that would have otherwise gone to authors and publishers under the traditional ebook sales royalty arrangement.</em></p><p>Our original plan for Castalia House, launched in 2013, was to focus entirely on publishing ebooks. After all, ebooks were the future, the technologies were only going to improve, and the level playing field of Amazon allowed even a solitary self-publisher to compete with the star authors of the Big Five publishers. The industry analysts even projected that total US ebook revenues would rise from $2.34 billion to $8.6 billion by 2018!</p><p>Sure, there were some minor concerns about Amazon’s launch of 47 North and other genre publishing imprints in 2011, especially since its cherry-picked authors seemed to be sitting at the top of the various bestseller lists for inordinately long periods of time, but no one, besides the Big Five, was at all concerned about Amazon, which was making around 35 percent of every ebook sale, turning on the writers who were making the Kindle platform so successful and making bank by doing so. It was a win-win situation, or so everyone thought.</p><p>In retrospect, that unnecessary desire to take advantage of the ability to offer its own products on its own platform was the tell that everyone missed, including us.</p><p>Kindle Unlimited was launched in April 2014. And while many authors were dubious about putting their books into the exclusive Kindle Select program, Castalia House initially regarded it with indifference. It seemed harmless, and a potentially good way to reach new readers, who might become future buyers once they became familiar with new authors through the monthly all-you-can-read buffet. My original response was as follows:</p><ul class=\"wp-block-list\"><li><em>My initial impression is that this is excellent for serious readers.</em></li><li><em>Casual readers, book collectors, and fans of particular authors aren’t likely to be too fussed about it.</em></li><li><em>It is horrific for the Big Five publishers and their writers, as their unwillingness to participate indicates.</em></li><li><em>It’s neutral to modestly positive for independent publishers, their writers, and self-publishers.  </em></li></ul><p>However, <a href=\"https://voxday.net/2014/12/29/mailvox-kindle-unlimited/\">by December 2014</a>, I’d changed my mind on the last point.</p><ul class=\"wp-block-list\"><li><em>It appears I was correct about the first three points and wrong about the last one. I wasn’t aware of the relevant math, but it is entirely clear that $120 &lt; $5,200 and $1.33 &lt; $3.50. The math doesn’t work for the writer.</em></li><li><em>So, my revised conclusion is that Kindle Unlimited is likely to prove massively unpopular among successful self-published writers, of no interest to independent publishers and their writers, and off-limits to mainstream published writers. Barring significant changes, I wouldn’t be surprised if Amazon ended up discontinuing it within two or three years. If they don’t, Kindle Unlimited will likely become a digital books ghetto filled with little more than romance, porn, and conspiracy theory written by unknown authors who can’t draw interest from independent publishers.</em></li></ul><p>Castalia House did end up dabbling a little in the Kindle Select waters for a time, but by 2018, we’d recognized that the situation was an unfolding disaster for every single writer and every single publishing house. That’s why we turned our efforts to direct sales, created Castalia Library, and pulled all of our books from Audible and Kindle Select. We don’t even <em>sell </em>our ebooks on Amazon anymore, much less participate in the Kindle Select program, and November 2023 was the best sales month we’ve ever had. Amazon is now entirely irrelevant to us.</p><div class=\"wp-block-image\"><figure class=\"aligncenter size-full\"><img alt=\"\" class=\"wp-image-60709\" decoding=\"async\" fetchpriority=\"high\" height=\"512\" sizes=\"(max-width: 512px) 100vw, 512px\" src=\"https://voxday.net/wp-content/uploads/2023/12/image-7.png\" srcset=\"https://voxday.net/wp-content/uploads/2023/12/image-7.png 512w, https://voxday.net/wp-content/uploads/2023/12/image-7-300x300.png 300w, https://voxday.net/wp-content/uploads/2023/12/image-7-150x150.png 150w\" width=\"512\"/></figure></div><p>But the overall situation in the publishing industry has turned out to be even worse than we believed it to be, and recall, we believed it was bad enough to entirely jump ship and start building our own distribution network before most people even thought there was a serious problem.</p><p>Considerably more details on the next page. If you’re a writer, you definitely need to continue reading.</p> <span id=\"more-60702\"></span><p><em><strong>eBook revenue has declined every year since 2014</strong></em></p><p>—AAP StatShot Annual Report, 31 May 2023</p><p>What I failed to recognize back in 2014 is that while Kindle Unlimited did rapidly devolve into a digital books ghetto, the contents of that ghetto would prove more than sufficient to content the literary gourmands who subscribe to KU and read all they want for $11.99 per month. The KU subscribers turned out to be perfectly happy with the massive smörgåsbord of algorithm-chasing churned-out ebooks they were provided, a smörgåsbord that grew from 600,000 in 2014 to 4 million in 2022. The number of Kindle pages read by those subscribers rose from its initial 432.6 million in July 2014 to 12.4 billion in July 2023, an increase of 28.7x in less than a decade.</p><p><em>The timeline presents data on e-book sales revenue generated in the United States from 2008 to 2013, as well as a forecast until 2018. The source expects the revenue will grow from 2.31 billion in 2011 to 8.69 billion in 2018.</em></p><p>But while the monthly flow of money devoted to Kindle Select writers grew from $2.5 million to $49.5 million in that same time frame, one important element didn’t keep pace. Namely, the overall amount of money being spent on ebooks. In fact, instead of rising to $8.6 billion and beyond by 2018, as predicted by industry analysts, total ebook revenue actually declined to $2 billion in 2022. So what Kindle Unlimited produced is less money chasing a lot more books, to the point that KU is now erasing nearly one billion in sales revenue from the ebook market every single year. <strong>Since its introduction in 2014, Kindle Unlimited has erased $4.984 billion in ebook sales from Amazon.</strong></p><div class=\"wp-block-image\"><figure class=\"aligncenter size-full\"><noscript><img alt=\"\" class=\"wp-image-60725\" decoding=\"async\" height=\"401\" sizes=\"(max-width: 512px) 100vw, 512px\" src=\"https://voxday.net/wp-content/uploads/2023/12/image-10.png\" srcset=\"https://voxday.net/wp-content/uploads/2023/12/image-10.png 512w, https://voxday.net/wp-content/uploads/2023/12/image-10-300x235.png 300w\" width=\"512\"/></noscript><img alt=\"\" class=\"lazyload wp-image-60725\" data-sizes=\"(max-width: 512px) 100vw, 512px\" data-src=\"https://voxday.net/wp-content/uploads/2023/12/image-10.png\" data-srcset=\"https://voxday.net/wp-content/uploads/2023/12/image-10.png 512w, https://voxday.net/wp-content/uploads/2023/12/image-10-300x235.png 300w\" decoding=\"async\" height=\"401\" src=\"data:image/svg+xml,%3Csvg%20xmlns=%22http://www.w3.org/2000/svg%22%20viewBox=%220%200%20512%20401%22%3E%3C/svg%3E\" width=\"512\"/></figure></div><p>But there is no need to take my word for any of this. If you’re an author who sells his ebooks on Amazon and participates in Kindle Select, you can easily verify this for yourself, and in doing so, see exactly how much Kindle Unlimited has cost you over time. Just download the lifetime report from KDP, average your KENP rate, then calculate your total Kindle Select revenue by multiplying Kindle Edition Normalized Page (KENP) Read x Average KENP rate. For example:</p><p>250,000 KENP x .0045 = $1,125 (Kindle Select Revenue)</p><p>To determine your average KENP royalty, you first need to add up the number of KENP pages in all your books, then divide them by the number of books. If you have a lot of books or just want to keep it simple, you can assume 300 pages per book.</p><p>Kindle Select Revenue / Average KENP Pages/Book (300) = Average KENP Royalty.</p><p>Now add up your total revenues. You don’t need to include all the currencies, as unless you are big in Japan, USD, GBP, EUR, CAD, and AUD should suffice. Don’t forget to correct each currency for the exchange rate! This will give you a total that INCLUDES the KENP payouts. Then subtract the KENP dollar amount you previously calculated from the sum of the currency royalties.</p><p>Total Revenues – Kindle Select Revenue = Ebook Sales Revenue</p><p>Now determine how much you make for each book you sell by dividing that number by the sum of all the books in the Paid Units Sold (eBook) column. If you usually sell your ebooks for $4.99, this number will be somewhere between 3.15 to 3.50. For Castalia over the course of ten years, the average came to $3.28.</p><p>Ebook Sales Revenue / Paid Units Sold = Average Ebook Royalty.</p><p>To see how much KU is costing you on average for each book read by a KU subscriber, subtract the Average KENP Royalty from the Average Ebook Royalty. In Castalia’s case, it worked out to $3.38 – $1.26 = $2.12. So, for each book read by a KU subscriber instead of purchased on Amazon, Castalia was out $2.12 it otherwise would have gained. And while the obvious counterargument is that these KU books would not have been purchased if KU had not been an option, both the micro and the macro data make it perfectly clear that neither overall ebook revenue nor overall ebook sales are growing in line with the KDP Global Fund.</p><p>And speaking of the Global Fund, now it is possible to calculate how much it is costing everyone on a monthly, annual, and lifetime basis by calculating the percentage delta between an average ebook sale and an average KENP royalty. In Castalia’s case, the difference is 2.12 divided by 1.26, which is 1.68. Your mileage may vary, but probably not by much. Now multiply the monthly KDP Global Fund distribution, which in October 2023 was $49.3 million, by your percentage delta. That’s the amount of potential author/publisher revenue that was destroyed in October by Kindle Unlimited.</p><p>49,300,000 x 1.68 = $82,824,000</p><p>Amazon reports these monthly numbers <a href=\"https://www.writtenwordmedia.com/kdp-global-fund-payouts/\">going back to July 2014</a>, so if you like, you can build a spreadsheet to calculate the total amount of author/publisher revenue that has been destroyed and/or devoured by Amazon over the last nine years. We can’t be certain that it all went to Amazon, as that depends upon how many Kindle Unlimited subscribers there were in any given month, but we know that it didn’t go to the authors, as it would have prior to the launch of KU.</p><p>$2,966,750,000 x 1.68 = $4,984,140,000.</p><p>As it turned out, our margin was his opportunity. It’s not as if we weren’t warned.</p><div class=\"wp-block-image\"><figure class=\"aligncenter size-full\"><noscript><img alt=\"\" class=\"wp-image-60718\" decoding=\"async\" height=\"474\" sizes=\"(max-width: 512px) 100vw, 512px\" src=\"https://voxday.net/wp-content/uploads/2023/12/image-9.png\" srcset=\"https://voxday.net/wp-content/uploads/2023/12/image-9.png 512w, https://voxday.net/wp-content/uploads/2023/12/image-9-300x278.png 300w\" width=\"512\"/></noscript><img alt=\"\" class=\"lazyload wp-image-60718\" data-sizes=\"(max-width: 512px) 100vw, 512px\" data-src=\"https://voxday.net/wp-content/uploads/2023/12/image-9.png\" data-srcset=\"https://voxday.net/wp-content/uploads/2023/12/image-9.png 512w, https://voxday.net/wp-content/uploads/2023/12/image-9-300x278.png 300w\" decoding=\"async\" height=\"474\" src=\"data:image/svg+xml,%3Csvg%20xmlns=%22http://www.w3.org/2000/svg%22%20viewBox=%220%200%20512%20474%22%3E%3C/svg%3E\" width=\"512\"/></figure></div><p>There are some other interesting things we can glean from these numbers, but more about them some other time. But it should be mentioned, just to make matters even worse, it is already obvious that Amazon’s next step will be to claim whatever portion of that $50 million is now paid out to low-quality algo-chasing churnhacks with AI-written compositions that will cost it essentially nothing. Complete control, total profit, and the literary gourmands who support the entire edifice may not even notice anything has changed at all!</p><p>Feel free to run your own numbers and send me any corrections or variances that you calculate. But it should be obvious that a new self-publishing platform is absolutely necessary for everyone who a) publishes with a mainstream publisher, b) self-publishes, or c) writes in the hopes of one day publishing a book. Now, Castalia has already solved this problem for our own benefit, but if you want us to solve it for yours as well, we’re going to need your involvement.</p><p>And you may wish to consider this email from a self-described fledgling writer. Because, in the end, it’s really not about you or me, it’s about the fate of the entire literary world.</p><blockquote class=\"wp-block-quote is-layout-flow wp-block-quote-is-layout-flow\"><p>As a fledgling fantasy writer who has finished a couple manuscripts, but hasn’t published yet, I’ve struggled with the decision of where to turn. No matter what route a new author chooses, there’s a large margin of getting lost, and never reaching an audience. </p><p>Every path has its pitfalls: </p><ol class=\"wp-block-list\"><li> Going mainstream and chasing an agent for the Big Five just to risk the SJWs and PC Police bastardizing your work?</li><li> Making contact and submitting to Baen Books, which feels less and less like a viable alternative and more like a chase for a niche crowd of Larry Correia fans?</li><li> Gamble on oneself and self-publish on Amazon?</li></ol><p>That third option, self-publishing on Amazon, appears moot, for the reasons you explained. I absolutely understand that brand new, unknown writers, such as myself, with no internet following or recognition is not what you’re looking for. </p><p>But if you and the community were to create that fourth option, with whatever new infrastructure you are considering, it very well could be an achievement of great importance for the future of publishing and an initiative worth supporting.  Perhaps someday in the future, it might mean the world to others wearing these similar shoes, to be able to look forward and see a brighter publishing landscape on the horizon than what we have now.</p></blockquote><p><em><a href=\"https://social.infogalactic.com/micropost/a9a122c6-2607-45b7-a7bf-5d5f148e1679\">DISCUSS ON SG</a></em></p></div>",
  "content_text": "TLDR:\nSince July 2014, Amazon has used Kindle Unlimited to transfer $5 billion to itself that would have otherwise gone to authors and publishers under the traditional ebook sales royalty arrangement.\nOur original plan for Castalia House, launched in 2013, was to focus entirely on publishing ebooks. After all, ebooks were the future, the technologies were only going to improve, and the level playing field of Amazon allowed even a solitary self-publisher to compete with the star authors of the Big Five publishers. The industry analysts even projected that total US ebook revenues would rise from $2.34 billion to $8.6 billion by 2018!\nSure, there were some minor concerns about Amazon’s launch of 47 North and other genre publishing imprints in 2011, especially since its cherry-picked authors seemed to be sitting at the top of the various bestseller lists for inordinately long periods of time, but no one, besides the Big Five, was at all concerned about Amazon, which was making around 35 percent of every ebook sale, turning on the writers who were making the Kindle platform so successful and making bank by doing so. It was a win-win situation, or so everyone thought.\nIn retrospect, that unnecessary desire to take advantage of the ability to offer its own products on its own platform was the tell that everyone missed, including us.\nKindle Unlimited was launched in April 2014. And while many authors were dubious about putting their books into the exclusive Kindle Select program, Castalia House initially regarded it with indifference. It seemed harmless, and a potentially good way to reach new readers, who might become future buyers once they became familiar with new authors through the monthly all-you-can-read buffet. My original response was as follows:\nMy initial impression is that this is excellent for serious readers.\nCasual readers, book collectors, and fans of particular authors aren’t likely to be too fussed about it.\nIt is horrific for the Big Five publishers and their writers, as their unwillingness to participate indicates.\nIt’s neutral to modestly positive for independent publishers, their writers, and self-publishers.\nHowever,\nby December 2014\n, I’d changed my mind on the last point.\nIt appears I was correct about the first three points and wrong about the last one. I wasn’t aware of the relevant math, but it is entirely clear that $120 < $5,200 and $1.33 < $3.50. The math doesn’t work for the writer.\nSo, my revised conclusion is that Kindle Unlimited is likely to prove massively unpopular among successful self-published writers, of no interest to independent publishers and their writers, and off-limits to mainstream published writers. Barring significant changes, I wouldn’t be surprised if Amazon ended up discontinuing it within two or three years. If they don’t, Kindle Unlimited will likely become a digital books ghetto filled with little more than romance, porn, and conspiracy theory written by unknown authors who can’t draw interest from independent publishers.\nCastalia House did end up dabbling a little in the Kindle Select waters for a time, but by 2018, we’d recognized that the situation was an unfolding disaster for every single writer and every single publishing house. That’s why we turned our efforts to direct sales, created Castalia Library, and pulled all of our books from Audible and Kindle Select. We don’t even\nsell\nour ebooks on Amazon anymore, much less participate in the Kindle Select program, and November 2023 was the best sales month we’ve ever had. Amazon is now entirely irrelevant to us.\nBut the overall situation in the publishing industry has turned out to be even worse than we believed it to be, and recall, we believed it was bad enough to entirely jump ship and start building our own distribution network before most people even thought there was a serious problem.\nConsiderably more details on the next page. If you’re a writer, you definitely need to continue reading.\neBook revenue has declined every year since 2014\n—AAP StatShot Annual Report, 31 May 2023\nWhat I failed to recognize back in 2014 is that while Kindle Unlimited did rapidly devolve into a digital books ghetto, the contents of that ghetto would prove more than sufficient to content the literary gourmands who subscribe to KU and read all they want for $11.99 per month. The KU subscribers turned out to be perfectly happy with the massive smörgåsbord of algorithm-chasing churned-out ebooks they were provided, a smörgåsbord that grew from 600,000 in 2014 to 4 million in 2022. The number of Kindle pages read by those subscribers rose from its initial 432.6 million in July 2014 to 12.4 billion in July 2023, an increase of 28.7x in less than a decade.\nThe timeline presents data on e-book sales revenue generated in the United States from 2008 to 2013, as well as a forecast until 2018. The source expects the revenue will grow from 2.31 billion in 2011 to 8.69 billion in 2018.\nBut while the monthly flow of money devoted to Kindle Select writers grew from $2.5 million to $49.5 million in that same time frame, one important element didn’t keep pace. Namely, the overall amount of money being spent on ebooks. In fact, instead of rising to $8.6 billion and beyond by 2018, as predicted by industry analysts, total ebook revenue actually declined to $2 billion in 2022. So what Kindle Unlimited produced is less money chasing a lot more books, to the point that KU is now erasing nearly one billion in sales revenue from the ebook market every single year.\nSince its introduction in 2014, Kindle Unlimited has erased $4.984 billion in ebook sales from Amazon.\nBut there is no need to take my word for any of this. If you’re an author who sells his ebooks on Amazon and participates in Kindle Select, you can easily verify this for yourself, and in doing so, see exactly how much Kindle Unlimited has cost you over time. Just download the lifetime report from KDP, average your KENP rate, then calculate your total Kindle Select revenue by multiplying Kindle Edition Normalized Page (KENP) Read x Average KENP rate. For example:\n250,000 KENP x .0045 = $1,125 (Kindle Select Revenue)\nTo determine your average KENP royalty, you first need to add up the number of KENP pages in all your books, then divide them by the number of books. If you have a lot of books or just want to keep it simple, you can assume 300 pages per book.\nKindle Select Revenue / Average KENP Pages/Book (300) = Average KENP Royalty.\nNow add up your total revenues. You don’t need to include all the currencies, as unless you are big in Japan, USD, GBP, EUR, CAD, and AUD should suffice. Don’t forget to correct each currency for the exchange rate! This will give you a total that INCLUDES the KENP payouts. Then subtract the KENP dollar amount you previously calculated from the sum of the currency royalties.\nTotal Revenues – Kindle Select Revenue = Ebook Sales Revenue\nNow determine how much you make for each book you sell by dividing that number by the sum of all the books in the Paid Units Sold (eBook) column. If you usually sell your ebooks for $4.99, this number will be somewhere between 3.15 to 3.50. For Castalia over the course of ten years, the average came to $3.28.\nEbook Sales Revenue / Paid Units Sold = Average Ebook Royalty.\nTo see how much KU is costing you on average for each book read by a KU subscriber, subtract the Average KENP Royalty from the Average Ebook Royalty. In Castalia’s case, it worked out to $3.38 – $1.26 = $2.12. So, for each book read by a KU subscriber instead of purchased on Amazon, Castalia was out $2.12 it otherwise would have gained. And while the obvious counterargument is that these KU books would not have been purchased if KU had not been an option, both the micro and the macro data make it perfectly clear that neither overall ebook revenue nor overall ebook sales are growing in line with the KDP Global Fund.\nAnd speaking of the Global Fund, now it is possible to calculate how much it is costing everyone on a monthly, annual, and lifetime basis by calculating the percentage delta between an average ebook sale and an average KENP royalty. In Castalia’s case, the difference is 2.12 divided by 1.26, which is 1.68. Your mileage may vary, but probably not by much. Now multiply the monthly KDP Global Fund distribution, which in October 2023 was $49.3 million, by your percentage delta. That’s the amount of potential author/publisher revenue that was destroyed in October by Kindle Unlimited.\n49,300,000 x 1.68 = $82,824,000\nAmazon reports these monthly numbers\ngoing back to July 2014\n, so if you like, you can build a spreadsheet to calculate the total amount of author/publisher revenue that has been destroyed and/or devoured by Amazon over the last nine years. We can’t be certain that it all went to Amazon, as that depends upon how many Kindle Unlimited subscribers there were in any given month, but we know that it didn’t go to the authors, as it would have prior to the launch of KU.\n$2,966,750,000 x 1.68 = $4,984,140,000.\nAs it turned out, our margin was his opportunity. It’s not as if we weren’t warned.\nThere are some other interesting things we can glean from these numbers, but more about them some other time. But it should be mentioned, just to make matters even worse, it is already obvious that Amazon’s next step will be to claim whatever portion of that $50 million is now paid out to low-quality algo-chasing churnhacks with AI-written compositions that will cost it essentially nothing. Complete control, total profit, and the literary gourmands who support the entire edifice may not even notice anything has changed at all!\nFeel free to run your own numbers and send me any corrections or variances that you calculate. But it should be obvious that a new self-publishing platform is absolutely necessary for everyone who a) publishes with a mainstream publisher, b) self-publishes, or c) writes in the hopes of one day publishing a book. Now, Castalia has already solved this problem for our own benefit, but if you want us to solve it for yours as well, we’re going to need your involvement.\nAnd you may wish to consider this email from a self-described fledgling writer. Because, in the end, it’s really not about you or me, it’s about the fate of the entire literary world.\nAs a fledgling fantasy writer who has finished a couple manuscripts, but hasn’t published yet, I’ve struggled with the decision of where to turn. No matter what route a new author chooses, there’s a large margin of getting lost, and never reaching an audience.\nEvery path has its pitfalls:\nGoing mainstream and chasing an agent for the Big Five just to risk the SJWs and PC Police bastardizing your work?\nMaking contact and submitting to Baen Books, which feels less and less like a viable alternative and more like a chase for a niche crowd of Larry Correia fans?\nGamble on oneself and self-publish on Amazon?\nThat third option, self-publishing on Amazon, appears moot, for the reasons you explained. I absolutely understand that brand new, unknown writers, such as myself, with no internet following or recognition is not what you’re looking for.\nBut if you and the community were to create that fourth option, with whatever new infrastructure you are considering, it very well could be an achievement of great importance for the future of publishing and an initiative worth supporting.  Perhaps someday in the future, it might mean the world to others wearing these similar shoes, to be able to look forward and see a brighter publishing landscape on the horizon than what we have now.\nDISCUSS ON SG",
  "tags": [
    "books",
    "Castalia House",
    "corpocracy"
  ],
  "categories": [],
  "sitemap_lastmod": "2023-12-03T18:13:45+00:00"
}