{
  "url": "https://voxday.net/2023/12/08/the-pulse-of-fandom/",
  "scraped_at": "2026-01-08T14:17:45.126328",
  "title": "The Pulse of Fandom",
  "date_display": "December 8, 2023",
  "date_iso": "2023-12-08T20:11:08+00:00",
  "date_from_url": "2023-12-08",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>Now that Bounding Into Comics has collapsed into convergence, a new champion arises from the ashes: <a href=\"https://fandompulse.com/\">FANDOM PULSE!</a> The editor-in-chief, Jon del Arroz, puts out a call for writers and other volunteers.</p><blockquote class=\"wp-block-quote is-layout-flow wp-block-quote-is-layout-flow\"><p>Fandom Pulse is looking for writers! We’re building a pop culture site that’s explicitly right wing to fight the culture war against the fake news of CBR, Bleeding Cool, IGN, and others. The key is going to be content, and we need writers to help us get to the point where we have enough to compete. If you can write clear, consistent work on pop culture at about 500 words an article, please let me know. We’d love to have you. Send an email to <a href=\"mailto:fandompulse@gmail.com\">fandompulse@gmail.com</a></p></blockquote><p>It’s certainly off to <a href=\"https://fandompulse.com/2023/12/08/zack-snyders-new-netflix-space-opera-rebel-moon-not-as-original-as-claimed/\">an interesting start</a>.</p><blockquote class=\"wp-block-quote is-layout-flow wp-block-quote-is-layout-flow\"><p>Snyder told <em>Entertainment Weekly</em> that he got the idea for <em>Rebel Moon</em> as a student in the late ‘80s. Creating a one-line pitch, he settled on “a ragtag team of warriors from different backgrounds assembled to fight for a common cause — but piloting spaceships and wielding laser guns instead of World War II bombers.”</p><p>His wife Deborah Snyder further reinforces the notion that <em>Rebel Moon</em> is totally original when she told EW that “Mostly everything right now is based on a book or based on a game. It’s a remake, or it’s a sequel,” and added, “There are very few times you get the opportunity to do something that’s wholly original.”</p></blockquote><p>Now, the overall story of Snyder’s film has little to do with the book <em>Rebel Moon</em>, which is essentially a 90’s military SF take on Heinlein’s <em>The Moon is a Harsh Mistress</em>. I haven’t given the movie a moment’s thought; I just assumed Snyder thought, correctly, that it was a cool SF title. However, based on the description, it’s pretty clear that both the title and the core conflict of the movie were, at the very least, somewhat influenced by the novel written by The Original Cyberpunk and me. Which is fine, of course. It would be bizarre and hypocritical to insist it is not fitting that a work so clearly derivative of an earlier work should subsequently serve as the source of another derivative itself.</p><p>The lady would appear to be protesting both unnecessarily and just a little too much. After all, if it’s a farming colony <em>planet </em>that is rebelling, why is the film named <em>Rebel Moon</em>?</p><div class=\"wp-block-image\"><figure class=\"aligncenter size-full\"><a href=\"https://fandompulse.com/\"><img alt=\"\" class=\"wp-image-60792\" decoding=\"async\" fetchpriority=\"high\" height=\"524\" sizes=\"(max-width: 510px) 100vw, 510px\" src=\"https://voxday.net/wp-content/uploads/2023/12/image-19.png\" srcset=\"https://voxday.net/wp-content/uploads/2023/12/image-19.png 510w, https://voxday.net/wp-content/uploads/2023/12/image-19-292x300.png 292w\" width=\"510\"/></a></figure></div><p><em><a href=\"https://social.infogalactic.com/micropost/27700051-3724-4393-83b7-7ee191287e9d\">DISCUSS ON SG</a></em></p></div>",
  "content_text": "Now that Bounding Into Comics has collapsed into convergence, a new champion arises from the ashes:\nFANDOM PULSE!\nThe editor-in-chief, Jon del Arroz, puts out a call for writers and other volunteers.\nFandom Pulse is looking for writers! We’re building a pop culture site that’s explicitly right wing to fight the culture war against the fake news of CBR, Bleeding Cool, IGN, and others. The key is going to be content, and we need writers to help us get to the point where we have enough to compete. If you can write clear, consistent work on pop culture at about 500 words an article, please let me know. We’d love to have you. Send an email to\nfandompulse@gmail.com\nIt’s certainly off to\nan interesting start\n.\nSnyder told\nEntertainment Weekly\nthat he got the idea for\nRebel Moon\nas a student in the late ‘80s. Creating a one-line pitch, he settled on “a ragtag team of warriors from different backgrounds assembled to fight for a common cause — but piloting spaceships and wielding laser guns instead of World War II bombers.”\nHis wife Deborah Snyder further reinforces the notion that\nRebel Moon\nis totally original when she told EW that “Mostly everything right now is based on a book or based on a game. It’s a remake, or it’s a sequel,” and added, “There are very few times you get the opportunity to do something that’s wholly original.”\nNow, the overall story of Snyder’s film has little to do with the book\nRebel Moon\n, which is essentially a 90’s military SF take on Heinlein’s\nThe Moon is a Harsh Mistress\n. I haven’t given the movie a moment’s thought; I just assumed Snyder thought, correctly, that it was a cool SF title. However, based on the description, it’s pretty clear that both the title and the core conflict of the movie were, at the very least, somewhat influenced by the novel written by The Original Cyberpunk and me. Which is fine, of course. It would be bizarre and hypocritical to insist it is not fitting that a work so clearly derivative of an earlier work should subsequently serve as the source of another derivative itself.\nThe lady would appear to be protesting both unnecessarily and just a little too much. After all, if it’s a farming colony\nplanet\nthat is rebelling, why is the film named\nRebel Moon\n?\nDISCUSS ON SG",
  "tags": [
    "books",
    "Fandom Pulse",
    "Hellmouth",
    "media"
  ],
  "categories": [],
  "sitemap_lastmod": "2023-12-08T20:28:11+00:00"
}