{
  "url": "https://voxday.net/2023/12/21/they-know-they-lost-right/",
  "scraped_at": "2026-01-08T14:18:52.400219",
  "title": "They Know They Lost, Right?",
  "date_display": "December 21, 2023",
  "date_iso": "2023-12-21T11:07:02+00:00",
  "date_from_url": "2023-12-21",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>It’s no wonder that NATO has been demolished in Ukraine with military leadership <a href=\"https://smoothiex12.blogspot.com/2023/12/somebody-must-tell-this-guy.html\">of this intellectual calibre and historical knowledge</a>:</p><blockquote class=\"wp-block-quote is-layout-flow wp-block-quote-is-layout-flow\"><p>The Ukrainian government needs to look at what Germany did in WWII to stand a chance against Russia, according to Ben Hodges, former commander of US Army forces stationed in Europe. Hodges, who retired as a lieutenant-general in 2017, has long been an outspoken supporter of Ukraine. In an interview with the Australian YouTuber Perun, published over the weekend, he repeatedly cited examples from the Second World War to argue that Kiev can defeat Moscow on the battlefield. “They are gonna have to increase production of ammunition and weapons in Ukraine,” Hodges said. “Some of these things are already happening, but it is possible when you are at war to increase production, even with Russian missiles raining down on your cities.” “I mean, think about what Germany did in 1944. Aircraft production for the Luftwaffe peaked in 1944. That’s after more than two years of steady bombing by the Royal Air Force and the US Army Air Corps bombing the hell out of German cities. But yet German aircraft production increased. So I think Ukraine can do that with some improving efficiency. Some Western companies are already there helping,” he concluded.</p></blockquote><p>On the one hand, he’s right. Germany did increase its aircraft production in 1944. <a href=\"https://voxday.net/2004/12/30/horse-necromancer/\">And so did Japan</a>, which not only increased its shipping tonnage produced in 1944, but even managed to build more aircraft in 1945 than it did in 1942.</p><ul class=\"wp-block-list\"><li>1942: 8,900</li><li>1943: 16,700</li><li>1944: 28,200</li><li>1945: 11,100</li></ul><p>On the other hand<em>—–</em>and I would argue this is the more salient point—–both Germany and Japan were not only defeated militarily, but were defeated so comprehensively that they were forced to surrender unconditionally and are still under military occupation nearly 80 years after their respective surrenders.</p><p>Forget the Kiev regime. Forget Ukraine. And forget NATO. Anyone who knows anything about military history recognizes that both of them are already finished, they simply haven’t stopped quivering yet. The USA is now facing global military defeat on every single front, even as it is prostrate before the biggest invasion in all of human history.</p><p>At this point there appears to be nothing that can stop the All Nations Alliance from defeating Clown World. And for those who would cite the US and Israeli nuclear arsenals as a possible emergency measure, I repeat: there is <em>nothing</em>. I didn’t understand it when I first read the book as a child, but in retrospect, <a href=\"https://www.arkhaven.com/comics/sci-fi/a-mind-programmed\">Jeff Sutton was telling us</a> what the programming was back in 1968.</p><p><em><a href=\"https://social.infogalactic.com/micropost/9527da71-9a1e-430e-8eff-60d49b5e1261\">DISCUSS ON SG</a></em></p></div>",
  "content_text": "It’s no wonder that NATO has been demolished in Ukraine with military leadership\nof this intellectual calibre and historical knowledge\n:\nThe Ukrainian government needs to look at what Germany did in WWII to stand a chance against Russia, according to Ben Hodges, former commander of US Army forces stationed in Europe. Hodges, who retired as a lieutenant-general in 2017, has long been an outspoken supporter of Ukraine. In an interview with the Australian YouTuber Perun, published over the weekend, he repeatedly cited examples from the Second World War to argue that Kiev can defeat Moscow on the battlefield. “They are gonna have to increase production of ammunition and weapons in Ukraine,” Hodges said. “Some of these things are already happening, but it is possible when you are at war to increase production, even with Russian missiles raining down on your cities.” “I mean, think about what Germany did in 1944. Aircraft production for the Luftwaffe peaked in 1944. That’s after more than two years of steady bombing by the Royal Air Force and the US Army Air Corps bombing the hell out of German cities. But yet German aircraft production increased. So I think Ukraine can do that with some improving efficiency. Some Western companies are already there helping,” he concluded.\nOn the one hand, he’s right. Germany did increase its aircraft production in 1944.\nAnd so did Japan\n, which not only increased its shipping tonnage produced in 1944, but even managed to build more aircraft in 1945 than it did in 1942.\n1942: 8,900\n1943: 16,700\n1944: 28,200\n1945: 11,100\nOn the other hand\n—–\nand I would argue this is the more salient point—–both Germany and Japan were not only defeated militarily, but were defeated so comprehensively that they were forced to surrender unconditionally and are still under military occupation nearly 80 years after their respective surrenders.\nForget the Kiev regime. Forget Ukraine. And forget NATO. Anyone who knows anything about military history recognizes that both of them are already finished, they simply haven’t stopped quivering yet. The USA is now facing global military defeat on every single front, even as it is prostrate before the biggest invasion in all of human history.\nAt this point there appears to be nothing that can stop the All Nations Alliance from defeating Clown World. And for those who would cite the US and Israeli nuclear arsenals as a possible emergency measure, I repeat: there is\nnothing\n. I didn’t understand it when I first read the book as a child, but in retrospect,\nJeff Sutton was telling us\nwhat the programming was back in 1968.\nDISCUSS ON SG",
  "tags": [
    "conspiracy",
    "economics",
    "history",
    "war"
  ],
  "categories": [],
  "sitemap_lastmod": "2023-12-21T11:07:04+00:00"
}