{
  "url": "https://voxday.net/2016/08/07/a-game-to-remember/",
  "scraped_at": "2025-12-18T01:47:48.846590",
  "title": "A game to remember",
  "date_display": "August 7, 2016",
  "date_iso": "2016-08-07T10:00:00+00:00",
  "date_from_url": "2016-08-07",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>I mentioned previously that I was invited to play in a friendly with the first team for the club to which Ender is now on loan. There was just one little detail that escaped me: while the second team plays in the fifth league, the first team plays in the <i>fourth league</i>. Ruh-roh.</p><p>This makes a pretty big difference, you see, as promotion and relegation means that the higher up you go, the better and more athletic the players are. Our first team was third league last year, and despite having some really good players, ended up getting relegated, so the challenge suddenly looked considerably more difficult. Having played against our own first team, then with them, in two scrimmages last fall, I knew exactly how in over our heads we were likely to be in a fourth-league game. While I was a member of a fourth-league team that won promotion to the third league, then spent a year playing in the third league, that was <i>15 years ago</i>.</p><p>Ender and I were both substitutes, of course, but he went in at wing with about 15 minutes left in the first half and the team down 2-1. For the first 5 minutes, he looked like a little kid in the <i>scuola calcio</i> who’d joined three years late and had never played in a real game before; he was so obviously bad that I thought the manager might take him out immediately. He was out of position, reactive, late to the ball, and on the rare occasions he did manage to get to it, he didn’t kick it to anyone, he just blindly kicked it forward.</p><p>But he wasn’t the worst player on the field, as that honor went to the goalie, the young man to whom Ender had lost the starting position for the club’s junior team two years ago. I noticed, while taking warm-up shots with the kid, that he actually appeared to have regressed, and once the game started my suspicions were confirmed. While the first goal might have been saved and the second one was a really nice shot about which nothing could have been done, the third goal, on a free kick, was totally inexcusable. It was a high bouncer, one that could have been easily saved by either stepping forward or stepping back, but the goalie froze, and the ball bounced over his head and into the goal untouched. 3-1, and right before halftime too.</p><p>Needless to say, the halftime talk was not even remotely complimentary. The second-team goalie was substituted in, and, I suspect, has since been promoted to first-team starter.</p><p>In the second half, Ender was able to adjust to the speed of the game and the aggression of the players, got some positional guidance from the assistance coach working the sideline, and his play significantly improved. First the striker scored to make it 3-2 with him effectively serving as a decoy distracting the goalie, then he had a phantom assist on a nice cross that would have leveled the game if the goal hadn’t been called off, rather questionably, for some innocuous shoving in the box. About ten minutes later, he got an assist that counted on a slick 15-meter through ball threaded precisely past three defenders to the striker, who promptly put the ball in the net. 3-3.</p><p>He came off not long after that, thoroughly exhausted, but he’d put in a solid 35 minutes and the team was quite happy with his performance. He got applause from the team when he came off the field, and one defender shouted, in heavily accented English, “I love dees Americain!” while thumping him on the back.  After the other team scored to make it 4-3, the coach put me in at striker for the last 15 minutes, and I would have had the equalizer in an empty net if the right wing had simply crossed the ball square to me, but instead he pulled it back to the midfielder arriving at the top of the box, who hit the crossbar. <i>Sfortunato, ma c’e calcio cosi.</i></p><p>I didn’t have any trouble running with the younger guys, mostly because I was fresh and they’re not in full game shape yet, but I wasn’t in sync with them either and was ineffective for the most part. Our midfield lost its shape as they increasingly pushed forward for the equalizer, leading to an easy goal on the counterattack for the other team to close out the game, 5-3. After the game, I was one of those criticized for not leaving the ball to a teammate in front of me who’d called for it – I didn’t bother pointing out that I heard the guy and ignored him because there was a defender right on my back who would have had the ball if I’d let it go.</p><p>I was actually rather glad to hear the criticism, misplaced or not, because, as I later explained to Ender, no one ever yells at the old guy who is only being humored because he can’t play. We were both invited to come back and practice with the first team next week, but I shook the manager’s hand and politely declined. It was a lot of fun, and it was a game I won’t ever forget, but the veterans’ season starts soon, and apart from a possible friendly or two with the second team, I’ll do better to stick with the guys my own age. More, or as is almost entirely the case, less.</p></div>",
  "content_text": "I mentioned previously that I was invited to play in a friendly with the first team for the club to which Ender is now on loan. There was just one little detail that escaped me: while the second team plays in the fifth league, the first team plays in the\nfourth league\n. Ruh-roh.\nThis makes a pretty big difference, you see, as promotion and relegation means that the higher up you go, the better and more athletic the players are. Our first team was third league last year, and despite having some really good players, ended up getting relegated, so the challenge suddenly looked considerably more difficult. Having played against our own first team, then with them, in two scrimmages last fall, I knew exactly how in over our heads we were likely to be in a fourth-league game. While I was a member of a fourth-league team that won promotion to the third league, then spent a year playing in the third league, that was\n15 years ago\n.\nEnder and I were both substitutes, of course, but he went in at wing with about 15 minutes left in the first half and the team down 2-1. For the first 5 minutes, he looked like a little kid in the\nscuola calcio\nwho’d joined three years late and had never played in a real game before; he was so obviously bad that I thought the manager might take him out immediately. He was out of position, reactive, late to the ball, and on the rare occasions he did manage to get to it, he didn’t kick it to anyone, he just blindly kicked it forward.\nBut he wasn’t the worst player on the field, as that honor went to the goalie, the young man to whom Ender had lost the starting position for the club’s junior team two years ago. I noticed, while taking warm-up shots with the kid, that he actually appeared to have regressed, and once the game started my suspicions were confirmed. While the first goal might have been saved and the second one was a really nice shot about which nothing could have been done, the third goal, on a free kick, was totally inexcusable. It was a high bouncer, one that could have been easily saved by either stepping forward or stepping back, but the goalie froze, and the ball bounced over his head and into the goal untouched. 3-1, and right before halftime too.\nNeedless to say, the halftime talk was not even remotely complimentary. The second-team goalie was substituted in, and, I suspect, has since been promoted to first-team starter.\nIn the second half, Ender was able to adjust to the speed of the game and the aggression of the players, got some positional guidance from the assistance coach working the sideline, and his play significantly improved. First the striker scored to make it 3-2 with him effectively serving as a decoy distracting the goalie, then he had a phantom assist on a nice cross that would have leveled the game if the goal hadn’t been called off, rather questionably, for some innocuous shoving in the box. About ten minutes later, he got an assist that counted on a slick 15-meter through ball threaded precisely past three defenders to the striker, who promptly put the ball in the net. 3-3.\nHe came off not long after that, thoroughly exhausted, but he’d put in a solid 35 minutes and the team was quite happy with his performance. He got applause from the team when he came off the field, and one defender shouted, in heavily accented English, “I love dees Americain!” while thumping him on the back.  After the other team scored to make it 4-3, the coach put me in at striker for the last 15 minutes, and I would have had the equalizer in an empty net if the right wing had simply crossed the ball square to me, but instead he pulled it back to the midfielder arriving at the top of the box, who hit the crossbar.\nSfortunato, ma c’e calcio cosi.\nI didn’t have any trouble running with the younger guys, mostly because I was fresh and they’re not in full game shape yet, but I wasn’t in sync with them either and was ineffective for the most part. Our midfield lost its shape as they increasingly pushed forward for the equalizer, leading to an easy goal on the counterattack for the other team to close out the game, 5-3. After the game, I was one of those criticized for not leaving the ball to a teammate in front of me who’d called for it – I didn’t bother pointing out that I heard the guy and ignored him because there was a defender right on my back who would have had the ball if I’d let it go.\nI was actually rather glad to hear the criticism, misplaced or not, because, as I later explained to Ender, no one ever yells at the old guy who is only being humored because he can’t play. We were both invited to come back and practice with the first team next week, but I shook the manager’s hand and politely declined. It was a lot of fun, and it was a game I won’t ever forget, but the veterans’ season starts soon, and apart from a possible friendly or two with the second team, I’ll do better to stick with the guys my own age. More, or as is almost entirely the case, less.",
  "tags": [
    "sports"
  ],
  "categories": [],
  "sitemap_lastmod": "2016-08-07T09:00:00+00:00"
}