{
  "url": "https://voxday.net/2016/08/01/a-new-milestone-25-million/",
  "scraped_at": "2025-12-18T01:46:56.542917",
  "title": "A new milestone: 2.5 million",
  "date_display": "August 1, 2016",
  "date_iso": "2016-08-01T12:00:00+00:00",
  "date_from_url": "2016-08-01",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>I have a good reason to appreciate the material contribution that McRapey and a few of his more rabid fans have made to this site. For the first nine years of the blog, I didn’t pay much attention to my site traffic. The traffic had grown steadily over time, but it never occurred to me to think much of it because most of my readership was at <i>WorldNetDaily </i>and the blog had initially been little more than a place for me to record my passing thoughts and address many similar emails in one fell swoop. I started VP in 2003, but it wasn’t until 2012, when some of Scalzi’s fans began repeatedly mocking the way in which my site traffic compared unfavorably with that of <i>Whatever</i>, that I began looking into the implied connection between Scalzi’s perceived success in the science fiction community and his reported traffic.</p><p>As Verne, a commenter at AG, put it: <i>“Once upon a time there was a low level geek (gamma) who managed to get himself a wee bit of power and bragging rights by way of the stupid Whatever blog and a position in a Sci/Fi org that no rational man would seemingly want. He used that power to tear into man of greater station and talent. That better man had up to that time not taken his blog and many other forms of networking seriously. A angry bear was awakened and has been steamrolling all in his way ever since.”</i><br> <i><br/></i><br> That’s more or less how it went, although I’m not angry at anyone about any of this. I realize many people won’t believe it, but until 2013, the 10th year of the blog, I didn’t care much about its traffic because I simply didn’t believe it had any particular significance beyond simple vanity. After all, what difference did it make if you had 5,000 pageviews in a month or 250,000 when <i>WorldNetDaily </i>had 5 million, the <i>Atlanta Journal/Constitution</i> had 19 million, and your column appeared weekly in both? I have to conclude that my very modest amount of success in the old media and old publishing worlds misled my perception of the digital media’s importance.</br></br></p><p>That’s why I was late to ebooks, why I was late to Twitter, and why I was very late to the utility of site traffic. It’s also why I rather cluelessly ran for SFWA office.</p><p>But just because I’m late to the party doesn’t mean that I’m stupid, or that I’ve lost my ability to see things that most people can’t. As chronicled in <i>SJWs Always Lie</i>, once I started paying attention, I very quickly recognized that McRapey was significantly exaggerating his traffic. More importantly, I also came to understand <i>why </i>he was lying about it and <i>how </i>he was effectively using public perception of that “extraordinary amount of traffic for a writer’s website”.</p><p>And I was downright astonished to discover that <a href=\"http://www.milobookclub.com/2013/01/02/how-you-like-them-sour-grapes/\">my blogs were already seeing very similar traffic</a>, as I learned after reading McRapey’s 2012 summary that, as  it later turned out, proved to be the high water mark for <i>Whatever</i>.</p><p><i>That looks genuinely impressive at first glance.  8.165 million views!  But the last number made me do a double-take. And then it made me laugh. You see, Google Analytics also tracks Vox Popoli and Alpha Game. Those two blogs happened to combine for 719,700 views in December.  719,700, if I recall correctly, happens to be a little bit more than 718,000.  Nor is it an anomaly, as that was actually down from 745,857 in November.  This inspired me to look further into the matter of comparative blog traffic.</i></p><p>Of course, it’s not much of a comparison anymore, as <i>Whatever </i>now averages less than 500,000 pageviews a month while <i>Alpha Game</i> alone sees more than that. July 2016 saw record traffic for both VP and AG, with 2,078,989 pageviews for the former, 510,093 for the latter, and a total of 2,589,082 for the month. It may not be a competition, but as long as <i>Whatever </i>exists, it will serve a useful purpose for me as both a goad and a scalp.</p><p>So, 2.5 million monthly pageviews, what does that matter? Isn’t that just vanity and ego-stroking? Well, no. That’s the same mistaken perception that I used to harbor. The truth is that <i>engagement </i>is the social media fuel upon which the engine of Internet influence runs, and pageviews are how engagement is measured. That’s why so many people try to fake engagement by click-baiting and buying fake followers and posting pictures of cute girls in bikinis and videos of cute animals doing cute things. If gold can be adulterated and inflated, then it should be no surprise that pageviews can be as well. As we know, they can even be entirely fictitious pageviews that are invented in interviews.</p><p>But as with gold, only pageviews based on genuine engagement matter in the end. And the sort of pageviews one receives on an old-fashioned, text-heavy site are 24-carat quality. I’d much rather have my readers, and their 2.5 million pageviews, than 10 million pageviews of the sort produced by the readers of a Gawker-style clickbait site. I think VP will eventually reach 10 million monthly pageviews, and it will probably do so sooner than any of us reasonably expect. But we’ll do it for real or we won’t do it at all.</p><p>Castalia House and DevGame and Brainstorm and Big Fork and other projects that you haven’t heard about yet all exist because there is a material difference between 5,000 pageviews and 2.5 million pageviews per month. That is why this milestone matters, and that is why I am pleased to be able to celebrate it with you today.</p></div>",
  "content_text": "I have a good reason to appreciate the material contribution that McRapey and a few of his more rabid fans have made to this site. For the first nine years of the blog, I didn’t pay much attention to my site traffic. The traffic had grown steadily over time, but it never occurred to me to think much of it because most of my readership was at\nWorldNetDaily\nand the blog had initially been little more than a place for me to record my passing thoughts and address many similar emails in one fell swoop. I started VP in 2003, but it wasn’t until 2012, when some of Scalzi’s fans began repeatedly mocking the way in which my site traffic compared unfavorably with that of\nWhatever\n, that I began looking into the implied connection between Scalzi’s perceived success in the science fiction community and his reported traffic.\nAs Verne, a commenter at AG, put it:\n“Once upon a time there was a low level geek (gamma) who managed to get himself a wee bit of power and bragging rights by way of the stupid Whatever blog and a position in a Sci/Fi org that no rational man would seemingly want. He used that power to tear into man of greater station and talent. That better man had up to that time not taken his blog and many other forms of networking seriously. A angry bear was awakened and has been steamrolling all in his way ever since.”\nThat’s more or less how it went, although I’m not angry at anyone about any of this. I realize many people won’t believe it, but until 2013, the 10th year of the blog, I didn’t care much about its traffic because I simply didn’t believe it had any particular significance beyond simple vanity. After all, what difference did it make if you had 5,000 pageviews in a month or 250,000 when\nWorldNetDaily\nhad 5 million, the\nAtlanta Journal/Constitution\nhad 19 million, and your column appeared weekly in both? I have to conclude that my very modest amount of success in the old media and old publishing worlds misled my perception of the digital media’s importance.\nThat’s why I was late to ebooks, why I was late to Twitter, and why I was very late to the utility of site traffic. It’s also why I rather cluelessly ran for SFWA office.\nBut just because I’m late to the party doesn’t mean that I’m stupid, or that I’ve lost my ability to see things that most people can’t. As chronicled in\nSJWs Always Lie\n, once I started paying attention, I very quickly recognized that McRapey was significantly exaggerating his traffic. More importantly, I also came to understand\nwhy\nhe was lying about it and\nhow\nhe was effectively using public perception of that “extraordinary amount of traffic for a writer’s website”.\nAnd I was downright astonished to discover that\nmy blogs were already seeing very similar traffic\n, as I learned after reading McRapey’s 2012 summary that, as  it later turned out, proved to be the high water mark for\nWhatever\n.\nThat looks genuinely impressive at first glance.  8.165 million views!  But the last number made me do a double-take. And then it made me laugh. You see, Google Analytics also tracks Vox Popoli and Alpha Game. Those two blogs happened to combine for 719,700 views in December.  719,700, if I recall correctly, happens to be a little bit more than 718,000.  Nor is it an anomaly, as that was actually down from 745,857 in November.  This inspired me to look further into the matter of comparative blog traffic.\nOf course, it’s not much of a comparison anymore, as\nWhatever\nnow averages less than 500,000 pageviews a month while\nAlpha Game\nalone sees more than that. July 2016 saw record traffic for both VP and AG, with 2,078,989 pageviews for the former, 510,093 for the latter, and a total of 2,589,082 for the month. It may not be a competition, but as long as\nWhatever\nexists, it will serve a useful purpose for me as both a goad and a scalp.\nSo, 2.5 million monthly pageviews, what does that matter? Isn’t that just vanity and ego-stroking? Well, no. That’s the same mistaken perception that I used to harbor. The truth is that\nengagement\nis the social media fuel upon which the engine of Internet influence runs, and pageviews are how engagement is measured. That’s why so many people try to fake engagement by click-baiting and buying fake followers and posting pictures of cute girls in bikinis and videos of cute animals doing cute things. If gold can be adulterated and inflated, then it should be no surprise that pageviews can be as well. As we know, they can even be entirely fictitious pageviews that are invented in interviews.\nBut as with gold, only pageviews based on genuine engagement matter in the end. And the sort of pageviews one receives on an old-fashioned, text-heavy site are 24-carat quality. I’d much rather have my readers, and their 2.5 million pageviews, than 10 million pageviews of the sort produced by the readers of a Gawker-style clickbait site. I think VP will eventually reach 10 million monthly pageviews, and it will probably do so sooner than any of us reasonably expect. But we’ll do it for real or we won’t do it at all.\nCastalia House and DevGame and Brainstorm and Big Fork and other projects that you haven’t heard about yet all exist because there is a material difference between 5,000 pageviews and 2.5 million pageviews per month. That is why this milestone matters, and that is why I am pleased to be able to celebrate it with you today.",
  "tags": [
    "anklebiters",
    "McRapey",
    "media"
  ],
  "categories": [],
  "sitemap_lastmod": "2016-08-01T11:00:00+00:00"
}