{
  "url": "https://voxday.net/2016/08/30/assimilationist-liars/",
  "scraped_at": "2025-12-18T01:51:31.330221",
  "title": "Assimilationist liars",
  "date_display": "August 30, 2016",
  "date_iso": "2016-08-30T08:59:00+00:00",
  "date_from_url": "2016-08-30",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>I’ve recently chronicled how various assimilationists, from (((Israel Zangwill))) to (((Ben Shapiro))), (((Ekaterina Jung))), and (((Andrew Klavan))) have either concocted or attempted to pass off self-serving revisionist lies about American history in order to retroactively write their (((tribe))) into it so they can claim to be “every bit as American” as the Posterity whose rights the U.S. Constitution was written to protect.</p><p>Considering that the purpose of the U.S. Constitution was to safeguard the rights of that Posterity, their actions in doing so are not only dishonest, but are literally anti-American. They are more cuckoo than the cuckservatives in this regard, in both senses of the term.</p><p>These lies include the following concepts:</p><ul><li>The melting pot</li><li>A proposition nation</li><li>A nation of immigrants</li><li>Judeo-Christian values</li></ul><p>Like any effective lie, each is constructed  around a fragment of truth, in this case, the section of the Declaration of Independence which declares: “We hold these truths to be self-evident, that all men are created equal, that they are endowed by their Creator with certain unalienable Rights, that among these are Life, Liberty and the pursuit of Happiness.”</p><p>However, it is also self-evident that a secular atheist Jew, such as (((Ekaterina Jung))), who does not believe in a Creator, cannot credibly appeal to the Declaration in order to claim to be an American. And it is documentarily evident that, like the U.S. Constitution, the Naturalization Act of 1790, the writings of John Jay, Ben Franklin, Alexander Hamilton, and other Founding Fathers, and the Alt-Right nationalist position, <i>the Declaration of Independence itself</i> is directly opposed to the revisionist interpretation, as the document also refers to:</p><ul><li>the connection between [the United Colonies] and the State of Great Britain</li><li>the inhabitants of our frontiers, the merciless Indian Savages</li><li>large Armies of foreign Mercenaries</li><li>the present King of Great Britain</li><li>the Laws for Naturalization of Foreigners</li><li>the free System of English Laws</li><li>our Brittish brethren</li></ul><p>To cite one phrase of a document in contradiction to the central theme of the entire document, which is that the People of the United Colonies are an English people, unique and distinct from foreigners, Indians, and the English people loyal to the King of Britain, is an <i>outrageous </i>attempt at deceit that relies entirely on the historical ignorance of the audience. To say that anyone can become an American because “all men are created equal” is a <i>shameless </i>lie. One might as readily cite it as evidence to claim it means anyone can become Chinese.</p><p>Now, I was aware of this deception because I am half-American, born in Boston, descended in my paternal line from an American revolutionary who died at Valley Forge, and steeped in the history of the American revolution. My family even celebrated Independence Day 1976 in Lexington, Massachusetts. But what I did not know, not being Jewish, is that Jews have also been victimized by the same sort of revisionist Talmudry to which Americans have been subjected by their assimilationist co-religionists.</p><p>In <i><b><a href=\"http://amzn.to/1Wnka63\">Cuckservative</a></b></i>, John Red Eagle and I made the connection between Churchianity and the concept of Tikkun Olam, the Jewish mandate to “heal the world”. But, as one of the Jewish readers here helpfully brings to our attention, it turns out that <a href=\"http://www.israelnationalnews.com/Articles/Article.aspx/14275#.VrIXilMrKqA\">“heal the world” is just another assimilationist lie</a>, no more historically legitimate than the anti-American lies already mentioned.<br/></p><blockquote><p> <i>“The central mitzvah or commandment for our era is the mitzvah of Tikkun Olam.   It is the defining mission of Jews to strive for the repair of the world by making society more just, fair, egalitarian, and sensitive. Judaism demands that we repair the world by striving for social justice.  It is the mission of Jews in the Divine Plan for the universe to repair the world by repairing man, by improving and advancing mankind.”</i></p><p>The above paragraph is a fair representation of what has become the defining raison d’etre of Judaism as conveyed by non-Orthodox liberal Jewish organizations and synagogues in America.  It is not a direct citation from any of them, but is an accurate paraphrase of what has become the canon of non-Orthodox Jewish liberalism in our time.</p><p>It is the “modernized” and contemporary “reinterpretation” of “Jewish ethics” as defined and inculcated by much of the Reform and Conservative movements.  It is also the “theology” of Jewish radical leftist groups operating at the fringes of the Jewish community, including the “Renewal/ALEPH” movement, the “Eco-Judaism” groups, the “Tikkun community” of people and groups that are satellites to the magazine by that same name published by tikkun-activist Michael Lerner, and what remains of the “Reconstructionists.”  Lerner, it should be added, discovers “repair of the world” even in LSD consumption.</p><p>What are we to make of “Tikkun Olam” proclamations?</p><p>The most important thing that must be understood about the Tikkun Olam catechism in the United States is that each and every sentence in the above proclamation is false.</p><p>First of all, there is no such thing as a mitzvah or commandment of “Tikkun Olam.”   Jews are nowhere commanded to “repair the world.”  In all the authoritative or traditional compilations of the commandments of Judaism, none list “Tikkun Olam”.  The expression itself does not appear anywhere in the Torah or in the entire Bible.</p><p>Those assimilationist liberals who insist that the entire “ethics of the Prophets” can be reduced to the pursuit of “Tikkun Olam” have to explain why none of the Books of the Prophets use the term.  “Tikkun Olam” is used sporadically in the Talmud, but as a technical term for resolution of certain judicial problems that arise before rabbinic courts.</p><p>The only place the expression appears in Jewish prayer is in the “Aleinu” and there it clearly has nothing at all to do with social justice.  In the “Aleinu,” Tikkun Olam is explicitly explained in the prayer text itself as the quest to eliminate pagan superstition and to see God’s rule of the universe implemented. It is a theological concept, not a social, political or environmental one.</p></blockquote><p>It is in the interest of Americans and Jews alike, and in the interest of anyone who values either history or the truth, to continue to expose these “assimilationist liberals” for the liars that they are, and to reject their self-serving, ahistorical, revisionist falsehoods. This post also demonstrates why a broad-spectrum Alt-Right is more effective, and informed, than a narrow-gauge, white American-only Alt-Right.</p><p>UPDATE: Lies have ALREADY appeared about this post on Twitter. They are truly People of the Lie.</p><p><i>Blue Meanie ‏@BlueMeanie4</i><br> <i>@voxday displays general cluelessness and paranoia re. Jews #Zionism #AltRight</i></br></p></div>",
  "content_text": "I’ve recently chronicled how various assimilationists, from (((Israel Zangwill))) to (((Ben Shapiro))), (((Ekaterina Jung))), and (((Andrew Klavan))) have either concocted or attempted to pass off self-serving revisionist lies about American history in order to retroactively write their (((tribe))) into it so they can claim to be “every bit as American” as the Posterity whose rights the U.S. Constitution was written to protect.\nConsidering that the purpose of the U.S. Constitution was to safeguard the rights of that Posterity, their actions in doing so are not only dishonest, but are literally anti-American. They are more cuckoo than the cuckservatives in this regard, in both senses of the term.\nThese lies include the following concepts:\nThe melting pot\nA proposition nation\nA nation of immigrants\nJudeo-Christian values\nLike any effective lie, each is constructed  around a fragment of truth, in this case, the section of the Declaration of Independence which declares: “We hold these truths to be self-evident, that all men are created equal, that they are endowed by their Creator with certain unalienable Rights, that among these are Life, Liberty and the pursuit of Happiness.”\nHowever, it is also self-evident that a secular atheist Jew, such as (((Ekaterina Jung))), who does not believe in a Creator, cannot credibly appeal to the Declaration in order to claim to be an American. And it is documentarily evident that, like the U.S. Constitution, the Naturalization Act of 1790, the writings of John Jay, Ben Franklin, Alexander Hamilton, and other Founding Fathers, and the Alt-Right nationalist position,\nthe Declaration of Independence itself\nis directly opposed to the revisionist interpretation, as the document also refers to:\nthe connection between [the United Colonies] and the State of Great Britain\nthe inhabitants of our frontiers, the merciless Indian Savages\nlarge Armies of foreign Mercenaries\nthe present King of Great Britain\nthe Laws for Naturalization of Foreigners\nthe free System of English Laws\nour Brittish brethren\nTo cite one phrase of a document in contradiction to the central theme of the entire document, which is that the People of the United Colonies are an English people, unique and distinct from foreigners, Indians, and the English people loyal to the King of Britain, is an\noutrageous\nattempt at deceit that relies entirely on the historical ignorance of the audience. To say that anyone can become an American because “all men are created equal” is a\nshameless\nlie. One might as readily cite it as evidence to claim it means anyone can become Chinese.\nNow, I was aware of this deception because I am half-American, born in Boston, descended in my paternal line from an American revolutionary who died at Valley Forge, and steeped in the history of the American revolution. My family even celebrated Independence Day 1976 in Lexington, Massachusetts. But what I did not know, not being Jewish, is that Jews have also been victimized by the same sort of revisionist Talmudry to which Americans have been subjected by their assimilationist co-religionists.\nIn\nCuckservative\n, John Red Eagle and I made the connection between Churchianity and the concept of Tikkun Olam, the Jewish mandate to “heal the world”. But, as one of the Jewish readers here helpfully brings to our attention, it turns out that\n“heal the world” is just another assimilationist lie\n, no more historically legitimate than the anti-American lies already mentioned.\n“The central mitzvah or commandment for our era is the mitzvah of Tikkun Olam.   It is the defining mission of Jews to strive for the repair of the world by making society more just, fair, egalitarian, and sensitive. Judaism demands that we repair the world by striving for social justice.  It is the mission of Jews in the Divine Plan for the universe to repair the world by repairing man, by improving and advancing mankind.”\nThe above paragraph is a fair representation of what has become the defining raison d’etre of Judaism as conveyed by non-Orthodox liberal Jewish organizations and synagogues in America.  It is not a direct citation from any of them, but is an accurate paraphrase of what has become the canon of non-Orthodox Jewish liberalism in our time.\nIt is the “modernized” and contemporary “reinterpretation” of “Jewish ethics” as defined and inculcated by much of the Reform and Conservative movements.  It is also the “theology” of Jewish radical leftist groups operating at the fringes of the Jewish community, including the “Renewal/ALEPH” movement, the “Eco-Judaism” groups, the “Tikkun community” of people and groups that are satellites to the magazine by that same name published by tikkun-activist Michael Lerner, and what remains of the “Reconstructionists.”  Lerner, it should be added, discovers “repair of the world” even in LSD consumption.\nWhat are we to make of “Tikkun Olam” proclamations?\nThe most important thing that must be understood about the Tikkun Olam catechism in the United States is that each and every sentence in the above proclamation is false.\nFirst of all, there is no such thing as a mitzvah or commandment of “Tikkun Olam.”   Jews are nowhere commanded to “repair the world.”  In all the authoritative or traditional compilations of the commandments of Judaism, none list “Tikkun Olam”.  The expression itself does not appear anywhere in the Torah or in the entire Bible.\nThose assimilationist liberals who insist that the entire “ethics of the Prophets” can be reduced to the pursuit of “Tikkun Olam” have to explain why none of the Books of the Prophets use the term.  “Tikkun Olam” is used sporadically in the Talmud, but as a technical term for resolution of certain judicial problems that arise before rabbinic courts.\nThe only place the expression appears in Jewish prayer is in the “Aleinu” and there it clearly has nothing at all to do with social justice.  In the “Aleinu,” Tikkun Olam is explicitly explained in the prayer text itself as the quest to eliminate pagan superstition and to see God’s rule of the universe implemented. It is a theological concept, not a social, political or environmental one.\nIt is in the interest of Americans and Jews alike, and in the interest of anyone who values either history or the truth, to continue to expose these “assimilationist liberals” for the liars that they are, and to reject their self-serving, ahistorical, revisionist falsehoods. This post also demonstrates why a broad-spectrum Alt-Right is more effective, and informed, than a narrow-gauge, white American-only Alt-Right.\nUPDATE: Lies have ALREADY appeared about this post on Twitter. They are truly People of the Lie.\nBlue Meanie ‏@BlueMeanie4\n@voxday displays general cluelessness and paranoia re. Jews #Zionism #AltRight",
  "tags": [
    "#AltRight",
    "history",
    "Zion"
  ],
  "categories": [],
  "sitemap_lastmod": "2016-08-30T07:59:00+00:00"
}