{
  "url": "https://voxday.net/2016/08/11/ben-shapiro-is-glad-you-hate-hi/",
  "scraped_at": "2025-12-18T01:48:36.687171",
  "title": "Ben Shapiro is glad you hate him",
  "date_display": "August 11, 2016",
  "date_iso": "2016-08-11T22:30:00+00:00",
  "date_from_url": "2016-08-11",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>Or at least he would like you to think so. After all, he must maintain his pose as a brave conservative culture warrior, or people might figure out that he’s a fraud.</p><blockquote><p> Supreme Dark Lord@voxday<br> My readers really hate @benshapiro.</br></p><p><i>“Chickenhawk does not even BEGIN to describe this supercilious neo-con asshole.”</i><br> <i><br/></i><br> Ben Shapiro ‏@benshapiro<br> Good.</br></br></br></p><p>Supreme Dark Lord@voxday<br> You’ve always been a fraud, Ben. I still have your emails to me when you were full of self-doubt about being a little parrot.</br></p><p>Supreme Dark Lord@voxday<br> I told you to strike out and become your own man. Instead, you chickenhawked and went media whore. It was a foolish call.</br></p><p>Supreme Dark Lord@voxday<br> Your problem is that you’re a puppet and you know it. Here’s the thing. So do we.</br></p></blockquote><p>What many of you probably don’t know is that Ben and I used to be colleagues of a sort at WND. My columns were much more popular, as I was reliably the number three most-read, behind Ann Coulter and Pat Buchanan. Ben’s readership was never more than about one-tenth of mine, but he was a smart little kid and did a good job of parroting the usual Republican boilerplate.</p><p>We corresponded a few times and were on friendly, if distant, terms. I mean, what do you talk about with a little kid whose idea of a good time is launching obvious rhetorical attacks at liberals? As he matured, he gradually began to question the ideas he was parroting, and reached the point where he considered quitting the media game.</p><p>I’ll have to dig out the emails to figure out exactly what I told him, but if I recall correctly, I encouraged him to resist the temptation to become a media whore. I understood the allure, as it was a poisoned apple that was also offered to me, but perhaps it was easier for me to turn it down since I was living in Europe and already established in the game development world.</p><p>Ben, unfortunately, couldn’t resist the apple, or the easy way forward, writing whatever his backers told him to write. I haven’t read him much since he wrote those dreadful, chickenshit columns in 2005, so I don’t know how much of what he writes he genuinely believes now and how much he is still parroting. Of course, the human mind being the incredible rationalizing machine that it is, it’s entirely possible that he has come to believe what he’s been told to say.</p><p>What I found most amusing is the way that the Littlest Chickenhawk’s supporters alternate between crowing about what a formidable debater he is, and trying to excuse the way he ran away from a proposed debate on free trade with me.</p><blockquote><p> Gone Fishing<br> LOL! All these Ben haters. You guys wouldn’t stand a chance in hell vs him in a debate on social issues. #CryMeAriver</br></p><p>Gone Fishing ‏@jgfleet661<br> Shapiro kicks the ass of real decision makers in this country in debates. He does with facts not feelings.</br></p><p>Supreme Dark Lord ‏@voxday<br> I will debate Ben on any topic. He’s already run away from me on a proposed free trade debate.</br></p><p>Gone Fishing ‏@jgfleet661<br>  ????! Yeah, he totally ran away from you. I mean, you’re the SUPREME DARK LORD! There’s no way he could beat you, right?</br></p><p> Valerie ‏@vpak77<br> yes, you two are definitely not in the same league. That is true.</br></p><p>ryedog™<br> Totally, it’d be a complete waste of Ben’s time.</br></p><p>Gone Fishing ‏@jgfleet661<br> He has to run. He’s busy debating important people on major news networks all over the country. #PuttingInWork</br></p></blockquote><p>Some things never change.</p></div>",
  "content_text": "Or at least he would like you to think so. After all, he must maintain his pose as a brave conservative culture warrior, or people might figure out that he’s a fraud.\nSupreme Dark Lord@voxday\nMy readers really hate @benshapiro.\n“Chickenhawk does not even BEGIN to describe this supercilious neo-con asshole.”\nBen Shapiro ‏@benshapiro\nGood.\nSupreme Dark Lord@voxday\nYou’ve always been a fraud, Ben. I still have your emails to me when you were full of self-doubt about being a little parrot.\nSupreme Dark Lord@voxday\nI told you to strike out and become your own man. Instead, you chickenhawked and went media whore. It was a foolish call.\nSupreme Dark Lord@voxday\nYour problem is that you’re a puppet and you know it. Here’s the thing. So do we.\nWhat many of you probably don’t know is that Ben and I used to be colleagues of a sort at WND. My columns were much more popular, as I was reliably the number three most-read, behind Ann Coulter and Pat Buchanan. Ben’s readership was never more than about one-tenth of mine, but he was a smart little kid and did a good job of parroting the usual Republican boilerplate.\nWe corresponded a few times and were on friendly, if distant, terms. I mean, what do you talk about with a little kid whose idea of a good time is launching obvious rhetorical attacks at liberals? As he matured, he gradually began to question the ideas he was parroting, and reached the point where he considered quitting the media game.\nI’ll have to dig out the emails to figure out exactly what I told him, but if I recall correctly, I encouraged him to resist the temptation to become a media whore. I understood the allure, as it was a poisoned apple that was also offered to me, but perhaps it was easier for me to turn it down since I was living in Europe and already established in the game development world.\nBen, unfortunately, couldn’t resist the apple, or the easy way forward, writing whatever his backers told him to write. I haven’t read him much since he wrote those dreadful, chickenshit columns in 2005, so I don’t know how much of what he writes he genuinely believes now and how much he is still parroting. Of course, the human mind being the incredible rationalizing machine that it is, it’s entirely possible that he has come to believe what he’s been told to say.\nWhat I found most amusing is the way that the Littlest Chickenhawk’s supporters alternate between crowing about what a formidable debater he is, and trying to excuse the way he ran away from a proposed debate on free trade with me.\nGone Fishing\nLOL! All these Ben haters. You guys wouldn’t stand a chance in hell vs him in a debate on social issues. #CryMeAriver\nGone Fishing ‏@jgfleet661\nShapiro kicks the ass of real decision makers in this country in debates. He does with facts not feelings.\nSupreme Dark Lord ‏@voxday\nI will debate Ben on any topic. He’s already run away from me on a proposed free trade debate.\nGone Fishing ‏@jgfleet661\n????! Yeah, he totally ran away from you. I mean, you’re the SUPREME DARK LORD! There’s no way he could beat you, right?\nValerie ‏@vpak77\nyes, you two are definitely not in the same league. That is true.\nryedog™\nTotally, it’d be a complete waste of Ben’s time.\nGone Fishing ‏@jgfleet661\nHe has to run. He’s busy debating important people on major news networks all over the country. #PuttingInWork\nSome things never change.",
  "tags": [
    "cuckservative",
    "media",
    "trainwreck"
  ],
  "categories": [],
  "sitemap_lastmod": "2016-08-11T21:30:00+00:00"
}