{
  "url": "https://voxday.net/2016/08/27/biology-is-social-construc/",
  "scraped_at": "2025-12-18T01:51:08.999290",
  "title": "Biology is a social construct",
  "date_display": "August 27, 2016",
  "date_iso": "2016-08-27T14:30:00+00:00",
  "date_from_url": "2016-08-27",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>Pity these poor genetic scientists. Someone needs to inform them that race and ethnicity do not exist, and that gender is a social construct. Obviously there is no way that <a href=\"http://www.natureworldnews.com/articles/7330/20140530/new-test-detects-race-gender-single-hair.htm\">this so-called test can possibly work</a>; they might as well claim to test for unicorn and leprechaun hair.</p><blockquote><p> The crime-busting tools of science fiction are becoming a reality. A new forensic test can detect the ethnicity and gender of someone using nothing but a single hair, and in less than two minutes no less, according to a new study.</p><p>The study, published in the <i>Journal of Analytical Atomic Spectrometry</i>, details how a new tool designed by scientists has shown a 100 percent success rate in identifying gender and ethnicity using a strand of hair.</p><p>This test reportedly trumps DNA testing currently used by law enforcement – which traditionally relies on blood to determine factors like gender and ethnicity. According to a Queen’s University press release, the new test and tool also works in a fraction of the time of standard blood testing, getting highly accurate results in about 85 seconds.</p><p>According to the study, the test takes an unusual approach to DNA testing, in which a single hair is ground up and then burnt. The foul smelling vapor consequently produced is then analyzed to produce a DNA analysis that reportedly has had a 100 percent success rate.</p><p>“Our analysis process is very robust and can be used universally,” co-author Lily Huang said in a recent statement. According to Huang, the incredibly fast test can distinguish between East Asians, Caucasians and South Asians, to name a few ethnicities, and is even accurate when analyzing hair that has been dyed.</p></blockquote><p>Advances in genetic science terrifies the Left and the equalitarian “Right” alike. This response was particularly amusing:</p><blockquote class=\"tr_bq\"><p> Jon Matthews ‏@mrmatthewsjbhs<br>it was a graduate student’s experiment that tested 13 hairs.  Groundbreaking! #altreich or #altright? </br></p></blockquote><p>Equalitarians make Flat Earthers and haruspices look scientifically advanced by comparison.</p></div>",
  "content_text": "Pity these poor genetic scientists. Someone needs to inform them that race and ethnicity do not exist, and that gender is a social construct. Obviously there is no way that\nthis so-called test can possibly work\n; they might as well claim to test for unicorn and leprechaun hair.\nThe crime-busting tools of science fiction are becoming a reality. A new forensic test can detect the ethnicity and gender of someone using nothing but a single hair, and in less than two minutes no less, according to a new study.\nThe study, published in the\nJournal of Analytical Atomic Spectrometry\n, details how a new tool designed by scientists has shown a 100 percent success rate in identifying gender and ethnicity using a strand of hair.\nThis test reportedly trumps DNA testing currently used by law enforcement – which traditionally relies on blood to determine factors like gender and ethnicity. According to a Queen’s University press release, the new test and tool also works in a fraction of the time of standard blood testing, getting highly accurate results in about 85 seconds.\nAccording to the study, the test takes an unusual approach to DNA testing, in which a single hair is ground up and then burnt. The foul smelling vapor consequently produced is then analyzed to produce a DNA analysis that reportedly has had a 100 percent success rate.\n“Our analysis process is very robust and can be used universally,” co-author Lily Huang said in a recent statement. According to Huang, the incredibly fast test can distinguish between East Asians, Caucasians and South Asians, to name a few ethnicities, and is even accurate when analyzing hair that has been dyed.\nAdvances in genetic science terrifies the Left and the equalitarian “Right” alike. This response was particularly amusing:\nJon Matthews ‏@mrmatthewsjbhs\nit was a graduate student’s experiment that tested 13 hairs.  Groundbreaking! #altreich or #altright?\nEqualitarians make Flat Earthers and haruspices look scientifically advanced by comparison.",
  "tags": [
    "science"
  ],
  "categories": [],
  "sitemap_lastmod": "2016-08-27T13:30:00+00:00"
}