{
  "url": "https://voxday.net/2016/08/28/cathy-young-critiques-altrig/",
  "scraped_at": "2025-12-18T01:51:12.664811",
  "title": "(((Cathy Young))) critiques the #AltRight",
  "date_display": "August 28, 2016",
  "date_iso": "2016-08-28T09:40:00+00:00",
  "date_from_url": "2016-08-28",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>Or to be more specific, <a href=\"http://www.milobookclub.com/2016/08/24/what-alt-right-is/\">my 16 points</a> about the Alt-Right, in an article called <a href=\"https://archive.is/hMogU\">“The Unbearable Dumbness of Being Alt-Right”</a>.</p><blockquote class=\"tr_bq\"><p> Unlike my friend Louise Mensch, I’m not very keen on the idea of polemics with Vox Day. In my view, it has about as much value as opening a correspondence with that lawyer who emails offering to make you the heir to his recently deceased childless client if you agree to split up the $100 million</p></blockquote><p>A little rhetorical signaling is never a bad idea. She’s too kind, actually, since correspondence with that lawyer is considerably less likely to result in the methodical evisceration of your intellectual pretensions and the exposure of your sophistry and false syllogisms. The important thing here is that she’s attempting to simultaneously disqualify and explain away why she’s doing something she claims to be of no value. This is conventional female rhetoric meant to create feelbad; one often sees gamma males utilizing it as well.</p><blockquote class=\"tr_bq\"><p> But the alt-right is suddenly the hot political topic of the day and is said to be Donald Trump’s hardcore base, and Vox — a.k.a. sci-fi writer, publisher and blogger GIVEN NAME — is apparently one of its ideologues. Now, he has a blogpost discussing “what the alt-right is” with a 16-point outline of a “core alt-right philosophy.” (Disappointingly, there’s nothing in it about marital rape or keeping women out of college because too much schooling keeps them from breeding. But hey, according to GIVEN NAME, it’s an early draft.)</p></blockquote><p>See, she’s just going with the flow, apparently. She, certainly doesn’t think the Alt-Right is important, much less me, but since it’s the hot topic of the day and all, she’ll reluctantly play along. Discredit and disqualify. More rhetorical signaling. Then, interestingly enough, a projected fear of exposure. Did you know that “Cathy Young” is actually <a href=\"https://www.newsday.com/opinion/columnists/cathy-young/greater-secularization-of-u-s-jews-isn-t-devastating-cathy-young-1.6214336\">(((Ekaterina Jung)))</a>? It turns out that of the 16 points, the ones that most bother her are 4, 5, 7, and 10. Especially 10, which states:<br> <i><br/></i><br> <i>10. The Alt Right is opposed to the rule or domination of any native ethnic group by another, particularly in the sovereign homelands of the dominated peoples. The Alt Right is opposed to any non-native ethnic group obtaining excessive influence in any society through nepotism, tribalism, or any other means.</i></br></br></p><blockquote class=\"tr_bq\"><p> Somebody should do an alt-right Jeopardy skit. “I’ll take ‘ethnic identities’ for $500, Vox.” — “Non-native ethnic group obtaining excessive influence in society through nepotism, tribalism, or by other means.” — “What are Jews?” – “DING!”</p></blockquote><p>The Jews are certainly one of many such groups, as they are known to have obtained excessive influence <a href=\"http://www.rense.com/general43/jewishrole.htm\">in the Soviet Union</a> before doing the same in the USA. (((Ekaterina))) herself is an example of that population transfer from the USSR to the USA. But there are also the examples of the British in India, the Chinese in Indonesia and Malaysia, the French in Algeria, the Indians in Fiji, the Lebanese in West Africa, the Tamils in Sri Lanka, the Japanese in Brazil, the Normans in England, and many, many others.</p><p>Point 10 is not a targeted matter of anti-Jewish or anti-Tamil prejudice. Thomas Sowell, who has written about the danger of overly influential minorities himself, cites Amy Chua’s book <i>World on Fire</i>, in pointing out that democracy and free markets “are dangerous in those countries where some ethnic minority is dominant in a free market economy, while the majority population dominates politics through their votes.”</p><p>If (((Ekaterina))) could pull her head out of her ample Jewish ass long enough to look at the rest of the world, she would realize that everything is not, in fact, about her own little ethnic identity. Non-native ethnic minorities that obtain excessive influence in a society reliably tend to trigger violent ethnic conflict, in Asia, in Africa, in Europe, and in the Americas.</p><p>Moreover, one wonders on what grounds she would defend the domination of a native ethnic majority by a foreign ethnic minority. The White Man’s Burden? Money makes right? But she is merely pointing-and-shrieking, she’s not even attempting to provide any rationale for the positions that her critique implies.</p><blockquote class=\"tr_bq\"><p> No. 15 is an amusing attempt to avoid the unpleasant “white supremacist” label (even though Vox assures us that “The Alt Right doesn’t care what you think of it”). But it seems to contradict No. 4 just a tad. If Western culture is the pinnacle of human achievement and culture is inseparable from genetic heritage, then isn’t the superiority of the white race a logical conclusion? (For what it’s worth, I suspect that not only most mainstream conservatives and libertarians but many liberals would agree with Vox’s estimation of Western culture while emphatically rejecting his equation of culture with genetics.)</p></blockquote><p>There is no attempt to avoid the “white supremacist” label that (((Ekaterina))) and other opponents of the Alt-Right are so desperate to pin on it. I am an Anglo-Aztec-American Indian who is genetically superior to 99 percent of all blacks on the track and intellectually superior to 99 percent of all whites and Jews, so I’m not inclined towards white supremacy myself. Most of the Alt Right is pro-white and pro-Western Civilization, but it is not white supremacist for the obvious reason that it does not believe racial supremacy exists any more than equality does.</p><p>(((Ekaterina))) engages in a little Talmudry here by attempting to substitute a general claim of “supremacy” for a specific form of “superiority”. Her syllogism is incorrect. If Western culture is the pinnacle of human achievement and culture is inseparable from genetic heritage, this does not indicate white supremacy, but rather, the necessity of the continued existence of white people if Western culture is to be preserved. 4 does not contradict 15, it explains 14.</p><p>The white race is observably superior at creating and maintaining Western culture, just as the Japanese race is superior at creating and maintaining Japanese culture. I have lived in Japan, I have studied its culture, and I even used to speak pretty good Japanese, but I do not understand it sufficiently well to be better able to maintain it or recreate it than a native Japanese, or even a <i>sansei </i>in Brazil, the Philippines, or the United States.</p><p>But (((Ekaterina))) is merely playing word games, as she undermines her own false logic in the very next sentence.</p><blockquote><p> An even more salient point, however, is that Western culture is essentially a mongrel culture. To sing plaudits to Western culture while singing the virtues of unmolested ethnic homogeneity is a bit like holding a charity dinner for the promotion of vegetarianism at the Ruth Chris Steakhouse. In a macro sense, Western culture as we know it is the product of the cross-breeding of Christianity, a religion imported from a certain Middle Eastern nation — or, as the alt-right would put it, (((Christianity))) — with Graeco-Roman civilization. By the way, Christianity explicitly proclaims the triumph of universalism over ethnic tribalism, or does Vox’s copy of the Bible somehow miss Galatians 3:28? (That would be the “neither Jew nor Greek” part.)</p><p>Of course, Graeco-Roman civilization was itself a rich and varied stew of ethnic and cultural elements. And once we get to European history as such, it’s a history of constant migrations, conquests, shifting borders, and colonialism which meant the import of both people and ideas from outside Europe. Where in Europe was there genetic ethnic purity, long before current migration trends? (Okay, maybe in Finland.) So much for science and history.</p></blockquote><p>(((Ekaterina))) is as ignorant of science and history as she is of Christianity. Western culture is, by no means, “a mongrel culture”. It is the combination of the European nations with Christianity, which is why another, older name for Western Civilization is “Christendom”. The Alt-Right is neither Nietzschean nor historical National Socialism, and we do not equate Christianity with “Jewish Bolshevism or call it (((Christianity))). Christianity is not Judaism and <a href=\"http://www.milobookclub.com/2016/08/26/judeo-christian-is-anti-christian/\">“Judeo-Christianity”</a> is a 20th century anti-Christian invention that was an ecumenical product of post-WWII Holocaustianity.</p><p>She engages in more deceptive Talmudry when she claims that “Christianity explicitly proclaims the triumph of universalism over ethnic tribalism”. That is an outright lie, which is one reason why she does not cite the full context of Galatians 3:28:</p><p><i>So in Christ Jesus you are all children of God through faith, for all of you who were baptized into Christ have clothed yourselves with Christ. There is neither Jew nor Gentile, neither slave nor free, nor is there male and female, for you are all one in Christ Jesus. If you belong to Christ, then you are Abraham’s seed, and heirs according to the promise.</i><br> <i><br/></i><br> It’s a bit ironic that one who glories in her ethnic identity as one of the Chosen People would appeal to the core of replacement theology, but the relevant point here is that this verse represents the triumph of Jesus Christ over sin and salvation through him, not “the triumph of universalism over ethnic tribalism”. In fact, the Bible not only makes it clear that the nations are established by God, but that they have different spirits that rule over them and that those nations will persist to the end.</br></br></p><p>The material “triumph of universalism” is a Satanic concept, it is neo-Babelism, and it is the religion behind the ideological globalism that the Alt Right, both religious and irreligious, opposes.</p><blockquote class=\"tr_bq\"><p> It’s interesting that Vox’s manifesto for the alt-right, an American movement, never mentions America per se. America is, after all, the ultimate mongrel culture, and was one long before the shift toward more Third World immigration in the 1960s that many alt-righters see as a fateful turning point. The alt-right is a movement that purports to champion American nationalism yet rejects the opening proposition of the Declaration of Independence and embraces a fantasy of “unmolested” sovereignty/homogeneity that probably has its closest historical counterpart in medieval China — wall and all.</p></blockquote><p>America is not a mongrel culture. America is the Posterity of the English Founding Fathers, whose rights the U.S. constitution was written to secure. The substitution of state for nation, and United States for America is a 20th century lie, and white Americans are genetically the complete opposite of mongrels, as white Americans are genetically 98.6 percent European. This is more projection, as it is, in fact, (((Ekaterina))) who is the mongrel, being a half-Semite, half-Italian “Russian” immigrant now resident in the United States. She incorrectly claims America to be “the ultimate mongrel culture” in order to bolster her false claim to be “American”, when in reality she is merely a United States citizen with, in her own words, “a special attachment to Israel”.</p><blockquote class=\"tr_bq\"><p> Oh, and because the alt-right is totally not neo-Nazi or anything, Vox’s manifesto includes the “14-word pledge”: “The Alt Right believes we must secure the existence of white people and a future for white children.” And it’s No. 14.</p></blockquote><p>Let it be noted that (((Ekaterina))) opposes the existence of white people and a future for white children. She wishes to portray a monstrous picture of the Alt Right, but all she succeeds in doing is providing everyone with an all-too-revealing self-portrait.</p></div>",
  "content_text": "Or to be more specific,\nmy 16 points\nabout the Alt-Right, in an article called\n“The Unbearable Dumbness of Being Alt-Right”\n.\nUnlike my friend Louise Mensch, I’m not very keen on the idea of polemics with Vox Day. In my view, it has about as much value as opening a correspondence with that lawyer who emails offering to make you the heir to his recently deceased childless client if you agree to split up the $100 million\nA little rhetorical signaling is never a bad idea. She’s too kind, actually, since correspondence with that lawyer is considerably less likely to result in the methodical evisceration of your intellectual pretensions and the exposure of your sophistry and false syllogisms. The important thing here is that she’s attempting to simultaneously disqualify and explain away why she’s doing something she claims to be of no value. This is conventional female rhetoric meant to create feelbad; one often sees gamma males utilizing it as well.\nBut the alt-right is suddenly the hot political topic of the day and is said to be Donald Trump’s hardcore base, and Vox — a.k.a. sci-fi writer, publisher and blogger GIVEN NAME — is apparently one of its ideologues. Now, he has a blogpost discussing “what the alt-right is” with a 16-point outline of a “core alt-right philosophy.” (Disappointingly, there’s nothing in it about marital rape or keeping women out of college because too much schooling keeps them from breeding. But hey, according to GIVEN NAME, it’s an early draft.)\nSee, she’s just going with the flow, apparently. She, certainly doesn’t think the Alt-Right is important, much less me, but since it’s the hot topic of the day and all, she’ll reluctantly play along. Discredit and disqualify. More rhetorical signaling. Then, interestingly enough, a projected fear of exposure. Did you know that “Cathy Young” is actually\n(((Ekaterina Jung)))\n? It turns out that of the 16 points, the ones that most bother her are 4, 5, 7, and 10. Especially 10, which states:\n10. The Alt Right is opposed to the rule or domination of any native ethnic group by another, particularly in the sovereign homelands of the dominated peoples. The Alt Right is opposed to any non-native ethnic group obtaining excessive influence in any society through nepotism, tribalism, or any other means.\nSomebody should do an alt-right Jeopardy skit. “I’ll take ‘ethnic identities’ for $500, Vox.” — “Non-native ethnic group obtaining excessive influence in society through nepotism, tribalism, or by other means.” — “What are Jews?” – “DING!”\nThe Jews are certainly one of many such groups, as they are known to have obtained excessive influence\nin the Soviet Union\nbefore doing the same in the USA. (((Ekaterina))) herself is an example of that population transfer from the USSR to the USA. But there are also the examples of the British in India, the Chinese in Indonesia and Malaysia, the French in Algeria, the Indians in Fiji, the Lebanese in West Africa, the Tamils in Sri Lanka, the Japanese in Brazil, the Normans in England, and many, many others.\nPoint 10 is not a targeted matter of anti-Jewish or anti-Tamil prejudice. Thomas Sowell, who has written about the danger of overly influential minorities himself, cites Amy Chua’s book\nWorld on Fire\n, in pointing out that democracy and free markets “are dangerous in those countries where some ethnic minority is dominant in a free market economy, while the majority population dominates politics through their votes.”\nIf (((Ekaterina))) could pull her head out of her ample Jewish ass long enough to look at the rest of the world, she would realize that everything is not, in fact, about her own little ethnic identity. Non-native ethnic minorities that obtain excessive influence in a society reliably tend to trigger violent ethnic conflict, in Asia, in Africa, in Europe, and in the Americas.\nMoreover, one wonders on what grounds she would defend the domination of a native ethnic majority by a foreign ethnic minority. The White Man’s Burden? Money makes right? But she is merely pointing-and-shrieking, she’s not even attempting to provide any rationale for the positions that her critique implies.\nNo. 15 is an amusing attempt to avoid the unpleasant “white supremacist” label (even though Vox assures us that “The Alt Right doesn’t care what you think of it”). But it seems to contradict No. 4 just a tad. If Western culture is the pinnacle of human achievement and culture is inseparable from genetic heritage, then isn’t the superiority of the white race a logical conclusion? (For what it’s worth, I suspect that not only most mainstream conservatives and libertarians but many liberals would agree with Vox’s estimation of Western culture while emphatically rejecting his equation of culture with genetics.)\nThere is no attempt to avoid the “white supremacist” label that (((Ekaterina))) and other opponents of the Alt-Right are so desperate to pin on it. I am an Anglo-Aztec-American Indian who is genetically superior to 99 percent of all blacks on the track and intellectually superior to 99 percent of all whites and Jews, so I’m not inclined towards white supremacy myself. Most of the Alt Right is pro-white and pro-Western Civilization, but it is not white supremacist for the obvious reason that it does not believe racial supremacy exists any more than equality does.\n(((Ekaterina))) engages in a little Talmudry here by attempting to substitute a general claim of “supremacy” for a specific form of “superiority”. Her syllogism is incorrect. If Western culture is the pinnacle of human achievement and culture is inseparable from genetic heritage, this does not indicate white supremacy, but rather, the necessity of the continued existence of white people if Western culture is to be preserved. 4 does not contradict 15, it explains 14.\nThe white race is observably superior at creating and maintaining Western culture, just as the Japanese race is superior at creating and maintaining Japanese culture. I have lived in Japan, I have studied its culture, and I even used to speak pretty good Japanese, but I do not understand it sufficiently well to be better able to maintain it or recreate it than a native Japanese, or even a\nsansei\nin Brazil, the Philippines, or the United States.\nBut (((Ekaterina))) is merely playing word games, as she undermines her own false logic in the very next sentence.\nAn even more salient point, however, is that Western culture is essentially a mongrel culture. To sing plaudits to Western culture while singing the virtues of unmolested ethnic homogeneity is a bit like holding a charity dinner for the promotion of vegetarianism at the Ruth Chris Steakhouse. In a macro sense, Western culture as we know it is the product of the cross-breeding of Christianity, a religion imported from a certain Middle Eastern nation — or, as the alt-right would put it, (((Christianity))) — with Graeco-Roman civilization. By the way, Christianity explicitly proclaims the triumph of universalism over ethnic tribalism, or does Vox’s copy of the Bible somehow miss Galatians 3:28? (That would be the “neither Jew nor Greek” part.)\nOf course, Graeco-Roman civilization was itself a rich and varied stew of ethnic and cultural elements. And once we get to European history as such, it’s a history of constant migrations, conquests, shifting borders, and colonialism which meant the import of both people and ideas from outside Europe. Where in Europe was there genetic ethnic purity, long before current migration trends? (Okay, maybe in Finland.) So much for science and history.\n(((Ekaterina))) is as ignorant of science and history as she is of Christianity. Western culture is, by no means, “a mongrel culture”. It is the combination of the European nations with Christianity, which is why another, older name for Western Civilization is “Christendom”. The Alt-Right is neither Nietzschean nor historical National Socialism, and we do not equate Christianity with “Jewish Bolshevism or call it (((Christianity))). Christianity is not Judaism and\n“Judeo-Christianity”\nis a 20th century anti-Christian invention that was an ecumenical product of post-WWII Holocaustianity.\nShe engages in more deceptive Talmudry when she claims that “Christianity explicitly proclaims the triumph of universalism over ethnic tribalism”. That is an outright lie, which is one reason why she does not cite the full context of Galatians 3:28:\nSo in Christ Jesus you are all children of God through faith, for all of you who were baptized into Christ have clothed yourselves with Christ. There is neither Jew nor Gentile, neither slave nor free, nor is there male and female, for you are all one in Christ Jesus. If you belong to Christ, then you are Abraham’s seed, and heirs according to the promise.\nIt’s a bit ironic that one who glories in her ethnic identity as one of the Chosen People would appeal to the core of replacement theology, but the relevant point here is that this verse represents the triumph of Jesus Christ over sin and salvation through him, not “the triumph of universalism over ethnic tribalism”. In fact, the Bible not only makes it clear that the nations are established by God, but that they have different spirits that rule over them and that those nations will persist to the end.\nThe material “triumph of universalism” is a Satanic concept, it is neo-Babelism, and it is the religion behind the ideological globalism that the Alt Right, both religious and irreligious, opposes.\nIt’s interesting that Vox’s manifesto for the alt-right, an American movement, never mentions America per se. America is, after all, the ultimate mongrel culture, and was one long before the shift toward more Third World immigration in the 1960s that many alt-righters see as a fateful turning point. The alt-right is a movement that purports to champion American nationalism yet rejects the opening proposition of the Declaration of Independence and embraces a fantasy of “unmolested” sovereignty/homogeneity that probably has its closest historical counterpart in medieval China — wall and all.\nAmerica is not a mongrel culture. America is the Posterity of the English Founding Fathers, whose rights the U.S. constitution was written to secure. The substitution of state for nation, and United States for America is a 20th century lie, and white Americans are genetically the complete opposite of mongrels, as white Americans are genetically 98.6 percent European. This is more projection, as it is, in fact, (((Ekaterina))) who is the mongrel, being a half-Semite, half-Italian “Russian” immigrant now resident in the United States. She incorrectly claims America to be “the ultimate mongrel culture” in order to bolster her false claim to be “American”, when in reality she is merely a United States citizen with, in her own words, “a special attachment to Israel”.\nOh, and because the alt-right is totally not neo-Nazi or anything, Vox’s manifesto includes the “14-word pledge”: “The Alt Right believes we must secure the existence of white people and a future for white children.” And it’s No. 14.\nLet it be noted that (((Ekaterina))) opposes the existence of white people and a future for white children. She wishes to portray a monstrous picture of the Alt Right, but all she succeeds in doing is providing everyone with an all-too-revealing self-portrait.",
  "tags": [
    "#AltRight"
  ],
  "categories": [],
  "sitemap_lastmod": "2016-08-28T08:40:00+00:00"
}