{
  "url": "https://voxday.net/2016/08/18/conservatives-dont-get-i/",
  "scraped_at": "2025-12-18T01:49:34.628857",
  "title": "Conservatives don’t get it",
  "date_display": "August 18, 2016",
  "date_iso": "2016-08-18T12:00:00+00:00",
  "date_from_url": "2016-08-18",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>I genuinely like Ross Douthat. He is generally honest, and he genuinely tries to make sense of what is going on, most of the time, even though <a href=\"https://archive.is/mZf5t#selection-2309.0-2371.29\">he reliably fails to understand</a> what is happening on the right side of the political spectrum or why the Alt-Right exists.</p><blockquote><p> Then finally, among men who were promised pliant centerfolds and ended up single with only high-speed internet to comfort them, the men’s sexual revolution has curdled into a toxic subculture, resentful of female empowerment in all its forms.</p><p>This is where you find Trump’s strongest (and, yes, strangest) fans. He’s become the Daddy Alpha for every alpha-aspiring beta male, whose mix of moral liberation and misogyny keeps the Ring-a-Ding-Ding dream alive.</p><p>There aren’t nearly enough of these fans to win him the election. Steinem’s revolution (Clintonian complications and all) should easily beat Hef’s at the ballot box this year.</p><p>But the cultural conflict between these two post-revolutionary styles — between frat guys and feminist bluestockings, Gamergaters and the diversity police, alt-right provocateurs and “woke” dudebros, the mouthbreathers who poured hate on the all-female “Ghostbusters” and the tastemakers who pretended it was good — is likely here to stay. With time and Christianity’s further decline, it could eclipse older culture war battles; in the pop culture landscape, it already does.</p><p>Ten years ago, liberals pined for a post-religious right, a different culture war.</p><p>Be careful what you wish for.</p></blockquote><p>Douthat simply doesn’t understand that the Alt-Right is not the 60’s counter to feminism, we are the nationalist reaction to conservatism’s failure. The issues that absorb him are sideshows. The Alt-Right is on the rise across the West because Douthat, and the conservatism he represents as the <i>New York Times</i>‘s token conservative, completely failed to conserve the nation.</p><p>They will call us fascists. They will call us racists. They will call us Nazis. They will call us sexists. They will call us anti-semitic. They will call us ultra-nationalists. They will call us white supremacists.</p><p>And whether those charges are true or not, <i>we don’t care</i>. Because we prefer to live in Western civilization, among civilized Western people.</p></div>",
  "content_text": "I genuinely like Ross Douthat. He is generally honest, and he genuinely tries to make sense of what is going on, most of the time, even though\nhe reliably fails to understand\nwhat is happening on the right side of the political spectrum or why the Alt-Right exists.\nThen finally, among men who were promised pliant centerfolds and ended up single with only high-speed internet to comfort them, the men’s sexual revolution has curdled into a toxic subculture, resentful of female empowerment in all its forms.\nThis is where you find Trump’s strongest (and, yes, strangest) fans. He’s become the Daddy Alpha for every alpha-aspiring beta male, whose mix of moral liberation and misogyny keeps the Ring-a-Ding-Ding dream alive.\nThere aren’t nearly enough of these fans to win him the election. Steinem’s revolution (Clintonian complications and all) should easily beat Hef’s at the ballot box this year.\nBut the cultural conflict between these two post-revolutionary styles — between frat guys and feminist bluestockings, Gamergaters and the diversity police, alt-right provocateurs and “woke” dudebros, the mouthbreathers who poured hate on the all-female “Ghostbusters” and the tastemakers who pretended it was good — is likely here to stay. With time and Christianity’s further decline, it could eclipse older culture war battles; in the pop culture landscape, it already does.\nTen years ago, liberals pined for a post-religious right, a different culture war.\nBe careful what you wish for.\nDouthat simply doesn’t understand that the Alt-Right is not the 60’s counter to feminism, we are the nationalist reaction to conservatism’s failure. The issues that absorb him are sideshows. The Alt-Right is on the rise across the West because Douthat, and the conservatism he represents as the\nNew York Times\n‘s token conservative, completely failed to conserve the nation.\nThey will call us fascists. They will call us racists. They will call us Nazis. They will call us sexists. They will call us anti-semitic. They will call us ultra-nationalists. They will call us white supremacists.\nAnd whether those charges are true or not,\nwe don’t care\n. Because we prefer to live in Western civilization, among civilized Western people.",
  "tags": [
    "#GamerGate",
    "cuckservative",
    "politics"
  ],
  "categories": [],
  "sitemap_lastmod": "2016-08-18T11:00:00+00:00"
}