{
  "url": "https://voxday.net/2016/08/10/cucks-gonna-cuck/",
  "scraped_at": "2025-12-18T01:48:23.811763",
  "title": "Cucks gonna cuck",
  "date_display": "August 10, 2016",
  "date_iso": "2016-08-10T17:00:00+00:00",
  "date_from_url": "2016-08-10",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>Remember, these people actually think they are virtue-signaling <a href=\"http://www.dailymail.co.uk/news/article-3732991/Woman-admits-sex-crimes-against-teen-looked-adopt.html\">their superior morality</a>:</p><blockquote><p> A North Carolina woman has admitted to committing sex crimes involving a 14-year-old boy who her family was in the process of adopting from the Philippines.</p><p>Christy Lynn Jaski, 43, of Wilmington, pleaded guilty Tuesday to three counts of misdemeanor sexual battery. She was sentenced to three years of probation, and as part of her punishment she must also register as a sex offender for 30 years.</p><p>Prosecutor Lance Oehrlein says Jaski kissed and groped the Filipino sometime between December 2014 and January 2015. Oehrlein says Jaski also sent messages to a friend in the Philippines admitting she had kissed the child, whom she called ‘her son.’</p></blockquote><p>I suspect the aftermath of the new Churchian enthusiasm for interracial adoption is going to be cataclysmic. One of the key advantages of close family ties, both social and genetic, is that they naturally inhibit incest. You can call an alien your son, your daughter, your brother, or your sister, but that natural inhibition is simply not going to be as strong.</p><p>And yes, they’re Churchian cuckservatives: <i>“Devout: Jaski’s husband works for a non-profit devoted to promoting Christianity on college campuses around the country”</i></p><p>Yes, I’m sure this is <i>just </i>the sort of promotion that Christianity needs. Someone needs to explain to these virtue-signaling cretins that importing foreigners to have sex with your wife is neither evangelizing nor sharing the love of Christ.</p><p>If I was a college student, the only thing Jaski’s efforts would have is to convince me to worship Loki.</p></div>",
  "content_text": "Remember, these people actually think they are virtue-signaling\ntheir superior morality\n:\nA North Carolina woman has admitted to committing sex crimes involving a 14-year-old boy who her family was in the process of adopting from the Philippines.\nChristy Lynn Jaski, 43, of Wilmington, pleaded guilty Tuesday to three counts of misdemeanor sexual battery. She was sentenced to three years of probation, and as part of her punishment she must also register as a sex offender for 30 years.\nProsecutor Lance Oehrlein says Jaski kissed and groped the Filipino sometime between December 2014 and January 2015. Oehrlein says Jaski also sent messages to a friend in the Philippines admitting she had kissed the child, whom she called ‘her son.’\nI suspect the aftermath of the new Churchian enthusiasm for interracial adoption is going to be cataclysmic. One of the key advantages of close family ties, both social and genetic, is that they naturally inhibit incest. You can call an alien your son, your daughter, your brother, or your sister, but that natural inhibition is simply not going to be as strong.\nAnd yes, they’re Churchian cuckservatives:\n“Devout: Jaski’s husband works for a non-profit devoted to promoting Christianity on college campuses around the country”\nYes, I’m sure this is\njust\nthe sort of promotion that Christianity needs. Someone needs to explain to these virtue-signaling cretins that importing foreigners to have sex with your wife is neither evangelizing nor sharing the love of Christ.\nIf I was a college student, the only thing Jaski’s efforts would have is to convince me to worship Loki.",
  "tags": [
    "cuckservative",
    "freakshow",
    "immigration"
  ],
  "categories": [],
  "sitemap_lastmod": "2016-08-10T16:00:00+00:00"
}