{
  "url": "https://voxday.net/2016/08/20/dave-truesdale-culturally-enriches/",
  "scraped_at": "2025-12-18T01:49:52.932271",
  "title": "Dave Truesdale culturally enriches Worldcon",
  "date_display": "August 20, 2016",
  "date_iso": "2016-08-20T10:01:00+00:00",
  "date_from_url": "2016-08-20",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>The SJWs in science fiction <a href=\"http://file770.com/?p=30397&amp;cpage=7#comment-469715\">are upset again</a>, this time because Dave Truesdale, the editor of Tangent Online, pointed out the long term consequences of their actions in a panel at MidAmericaCon II. From File 770:</p><blockquote><p> At 3:00 PM at today’s panel on The State of Short Fiction, Dave Truesdale (of Tangent Online) shocked panelists and crowd alike by abusing his position as moderator to give what sounded like an alt-Right rant against political correctness. He declared that political correctness had destroyed short SFF by making it bland and destroying the careers of people. He waved around a fistful of pearl necklaces and told people to “clutch your pearls” and shut up whenever they felt the urge to point out some injustice.</p><p>He had started reading from a multi-page prepared speech (which he attributed to the late David Hartwell) when Sheila Williams shouted at him to stop. (It helped a lot that he seemed to be clueless as to how to operate a microphone whereas she was clearly a master, so she easily shouted him down.) He seemed very surprised that almost the entire crowd (minus one person who might have been a relative) was angry with him. From his behavior, I think he expected to have at least a large cohort agreeing with him.</p><p>Eric got a photo of Truesdale reading while Neil Clarke turned his back and other panelists grimaced.</p><p>The panelists denied that SFF had declined in quality or that political correctness particularly influenced them as editors. They did note that overt bigotry was no longer acceptable, but Truesdale indicated that he was okay with that change.</p><p>At a subsequent panel, we heard that MidAmeriCon II apologized to the panelists, saying no one had any idea this would happen. According to one source, he’d been about to launch into a section titled “definition of a bigot” before he was derailed. Most people seemed to agree that they’d never seen a panel moderator abuse his position to hijack the panel as a platform for his or her own personal agenda.</p></blockquote><p>Seemed. Exactly. Remember, SJWs always – ALWAYS – lie. Translation: they’d before never seen a moderator fail to support the SJW agenda.</p><p>I very much doubt Truesdale was surprised in the slightest by the crowd’s reaction. These morons have absolutely no idea what to do other than virtue-signal and blindly defend the current Narrative. <a href=\"https://onedrive.live.com/?authkey=%21AHw8WxNAO32JH_M&amp;cid=ECE844D9F57B6A42&amp;id=ECE844D9F57B6A42%2125362&amp;parId=ECE844D9F57B6A42%2125361&amp;o=OneUp\">This picture</a> of Neil Clarke prissily turning his back in order to maximally signal his virtue in order to avoid besoiling himself with badthink association is hilarious.</p><p>Considering that Truesdale was directly addressing the subject matter, the state of short fiction, it’s obvious that the reason they are angry is not that he “hijacked the panel”, but because he told them the unpleasant truth as they know it to be.</p><p>Here is how one SJW subsequently characterized it.</p><p><i>Sunil Patel ‏@ghostwritingcow</i><br> <i>This panel is fucking UNREAL. It’s DT being a whiny pissy manbaby and everyone else yelling at him.</i></br></p><p>Well done, Dave. Mission accomplished.</p><p>And speaking of Worldcon, Tor’s campaign for E Pluribus Hugo continues apace, as the EPH Analysis for the years 2014 and 2015 <a href=\"https://midamericon2.org/wp-content/uploads/2016/05/EPH_Analysis_For-MidAmeriCon.pdf\">has been released</a>(pdf). Of course, they didn’t dare publish their analysis for any other years, for as they have tacitly admitted, doing so would prove that there are whisper slates that have been having an effect on the Hugo Awards for years.</p><p>Here is the first amusing thing about it. In the “slate” year of 2015, 10 long list spots and 14 ballot spots changed under EPH. In the “non-slate” year of 2014 – never mind that Sad Puppies was in action then – 17 long list spots and 5 ballot spots changed. And they wonder why I support EPH!</p><p>The second amusing thing is the fact that the authors got it wrong. Contra their insistence that only the long list would have been affected, had EPH been in effect in 2015, Alyssa Wong would have made been a Campbell finalist in the place of Rolf Nelson.</p></div>",
  "content_text": "The SJWs in science fiction\nare upset again\n, this time because Dave Truesdale, the editor of Tangent Online, pointed out the long term consequences of their actions in a panel at MidAmericaCon II. From File 770:\nAt 3:00 PM at today’s panel on The State of Short Fiction, Dave Truesdale (of Tangent Online) shocked panelists and crowd alike by abusing his position as moderator to give what sounded like an alt-Right rant against political correctness. He declared that political correctness had destroyed short SFF by making it bland and destroying the careers of people. He waved around a fistful of pearl necklaces and told people to “clutch your pearls” and shut up whenever they felt the urge to point out some injustice.\nHe had started reading from a multi-page prepared speech (which he attributed to the late David Hartwell) when Sheila Williams shouted at him to stop. (It helped a lot that he seemed to be clueless as to how to operate a microphone whereas she was clearly a master, so she easily shouted him down.) He seemed very surprised that almost the entire crowd (minus one person who might have been a relative) was angry with him. From his behavior, I think he expected to have at least a large cohort agreeing with him.\nEric got a photo of Truesdale reading while Neil Clarke turned his back and other panelists grimaced.\nThe panelists denied that SFF had declined in quality or that political correctness particularly influenced them as editors. They did note that overt bigotry was no longer acceptable, but Truesdale indicated that he was okay with that change.\nAt a subsequent panel, we heard that MidAmeriCon II apologized to the panelists, saying no one had any idea this would happen. According to one source, he’d been about to launch into a section titled “definition of a bigot” before he was derailed. Most people seemed to agree that they’d never seen a panel moderator abuse his position to hijack the panel as a platform for his or her own personal agenda.\nSeemed. Exactly. Remember, SJWs always – ALWAYS – lie. Translation: they’d before never seen a moderator fail to support the SJW agenda.\nI very much doubt Truesdale was surprised in the slightest by the crowd’s reaction. These morons have absolutely no idea what to do other than virtue-signal and blindly defend the current Narrative.\nThis picture\nof Neil Clarke prissily turning his back in order to maximally signal his virtue in order to avoid besoiling himself with badthink association is hilarious.\nConsidering that Truesdale was directly addressing the subject matter, the state of short fiction, it’s obvious that the reason they are angry is not that he “hijacked the panel”, but because he told them the unpleasant truth as they know it to be.\nHere is how one SJW subsequently characterized it.\nSunil Patel ‏@ghostwritingcow\nThis panel is fucking UNREAL. It’s DT being a whiny pissy manbaby and everyone else yelling at him.\nWell done, Dave. Mission accomplished.\nAnd speaking of Worldcon, Tor’s campaign for E Pluribus Hugo continues apace, as the EPH Analysis for the years 2014 and 2015\nhas been released\n(pdf). Of course, they didn’t dare publish their analysis for any other years, for as they have tacitly admitted, doing so would prove that there are whisper slates that have been having an effect on the Hugo Awards for years.\nHere is the first amusing thing about it. In the “slate” year of 2015, 10 long list spots and 14 ballot spots changed under EPH. In the “non-slate” year of 2014 – never mind that Sad Puppies was in action then – 17 long list spots and 5 ballot spots changed. And they wonder why I support EPH!\nThe second amusing thing is the fact that the authors got it wrong. Contra their insistence that only the long list would have been affected, had EPH been in effect in 2015, Alyssa Wong would have made been a Campbell finalist in the place of Rolf Nelson.",
  "tags": [
    "Pink SF",
    "Puppies",
    "SJW"
  ],
  "categories": [],
  "sitemap_lastmod": "2016-08-20T09:01:00+00:00"
}