{
  "url": "https://voxday.net/2016/08/15/debunking-snopes/",
  "scraped_at": "2025-12-18T01:49:07.693774",
  "title": "Debunking Snopes",
  "date_display": "August 15, 2016",
  "date_iso": "2016-08-15T12:00:00+00:00",
  "date_from_url": "2016-08-15",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>A number of people have referred to <a href=\"http://www.snopes.com/hiroshima-vs-detroit/\">the Snopes “debunking” of the Hiroshima-Detroit comparison</a>, failing to realize that a) it doesn’t address blacks at all, and, b) I wrote my post in the first place because the supposed debunking was so feeble.</p><p>Here is an accurate summary of the Snopes argument.</p><p><b>1. The picture is not of modern-day Hiroshima.</b><br> <i><br/></i><br> <i>the next image in the set supposedly depicts modern-day Hiroshima — except that it doesn’t. It’s actually a snapshot taken from the Landmark Tower Sky Garden in Yokohama, Japan</i></br></br></p><p>That’s true of the pictures to which Snopes was referring. It’s not true of <a href=\"https://pbs.twimg.com/media/Cp0FtnMWcAAwSLZ.jpg\">the pictures I used</a>, which one can see is clearly of past and present Hiroshima. Furthermore, Hiroshima is in very good shape today, as Snopes itself admits. One down.<br> <b><br/></b><br> <b>2. The picture of modern Detroit is only of one building.</b></br></br></p><p><i>the thing to note about the use of this image to portray Detroit as a locus of Hiroshima-like devastation is that all we actually see is one long-abandoned, crumbling building. It doesn’t make the case.</i></p><p>That one picture doesn’t conclusively prove the case, but it correctly <i>demonstrates </i>the actual case intended. Detroit’s population is now 36.7 percent of its 1950s peak and is now 83 percent black. 95 percent of the whites who resided there in 1950 have left. The city filed for bankruptcy in 2013. “aerial photos reveal the tiny urban island that is left – a clutter of high-rises surrounded by empty housing plots now covered in grass.” Two down.</p><p><b>3. The picture of Navin Field is from the 1930s, not the 1940s.</b></p><p><i>Lastly, we’re shown a photo supposedly depicting Detroit in its mid-1940s heyday — except that it was taken in the mid-1930s</i></p><p>So what? That only makes it that much more clear how advanced Detroit was, and how far Detroit has fallen since. This is petty pedantry, as the relevant point is still demonstrated. Three down.</p><p><b>4. It was the Democrats fault, but it wasn’t only their fault.</b></p><p><i>Did Democrats and Democratic policies play some role in the fall of Detroit? Surely they did. Every Detroit mayor since 1962 has been a Democrat, after all. But Republicans held the seat for the 12 years prior to that, from 1950 through 1961. The Packard plant whose hollowed-out remains were displayed above closed its doors during that time. Whatever blame is to be allotted to politicians must be shared by both Democrats and Republicans on the national level, as well.</i><br> <i><br/></i><br> Here is a tip: when you admit that the case being made is correct, even in part, it is not a debunking. Four down. There is not one single effective point that was made in this so-called “debunking”.</br></br></p><p>The ironic thing about those responding to my modified Detroit-Hiroshima comparison with “Snopes says” is that I rebutted the cuckservative “Democrat policies” explanation for the difference between the two cities more effectively than Snopes did by pointing out that if Democrats are responsible for the decline of Detroit, Hiroshima should be even worse, because it was ruled by <i>Socialists </i>for most of the latter half of the 20th century.</p><p>Are there other factors that have contributed to the decline of Detroit beyond the fact that 478,112 blacks moved into the city between 1900 and 1960? Certainly. But that doesn’t change the fact that if a city has a choice between being hit by an atomic bomb or acquiring 774,485 new black residents, the available evidence strongly indicates that the former will prove vastly preferable to the latter in the long term.</p></div>",
  "content_text": "A number of people have referred to\nthe Snopes “debunking” of the Hiroshima-Detroit comparison\n, failing to realize that a) it doesn’t address blacks at all, and, b) I wrote my post in the first place because the supposed debunking was so feeble.\nHere is an accurate summary of the Snopes argument.\n1. The picture is not of modern-day Hiroshima.\nthe next image in the set supposedly depicts modern-day Hiroshima — except that it doesn’t. It’s actually a snapshot taken from the Landmark Tower Sky Garden in Yokohama, Japan\nThat’s true of the pictures to which Snopes was referring. It’s not true of\nthe pictures I used\n, which one can see is clearly of past and present Hiroshima. Furthermore, Hiroshima is in very good shape today, as Snopes itself admits. One down.\n2. The picture of modern Detroit is only of one building.\nthe thing to note about the use of this image to portray Detroit as a locus of Hiroshima-like devastation is that all we actually see is one long-abandoned, crumbling building. It doesn’t make the case.\nThat one picture doesn’t conclusively prove the case, but it correctly\ndemonstrates\nthe actual case intended. Detroit’s population is now 36.7 percent of its 1950s peak and is now 83 percent black. 95 percent of the whites who resided there in 1950 have left. The city filed for bankruptcy in 2013. “aerial photos reveal the tiny urban island that is left – a clutter of high-rises surrounded by empty housing plots now covered in grass.” Two down.\n3. The picture of Navin Field is from the 1930s, not the 1940s.\nLastly, we’re shown a photo supposedly depicting Detroit in its mid-1940s heyday — except that it was taken in the mid-1930s\nSo what? That only makes it that much more clear how advanced Detroit was, and how far Detroit has fallen since. This is petty pedantry, as the relevant point is still demonstrated. Three down.\n4. It was the Democrats fault, but it wasn’t only their fault.\nDid Democrats and Democratic policies play some role in the fall of Detroit? Surely they did. Every Detroit mayor since 1962 has been a Democrat, after all. But Republicans held the seat for the 12 years prior to that, from 1950 through 1961. The Packard plant whose hollowed-out remains were displayed above closed its doors during that time. Whatever blame is to be allotted to politicians must be shared by both Democrats and Republicans on the national level, as well.\nHere is a tip: when you admit that the case being made is correct, even in part, it is not a debunking. Four down. There is not one single effective point that was made in this so-called “debunking”.\nThe ironic thing about those responding to my modified Detroit-Hiroshima comparison with “Snopes says” is that I rebutted the cuckservative “Democrat policies” explanation for the difference between the two cities more effectively than Snopes did by pointing out that if Democrats are responsible for the decline of Detroit, Hiroshima should be even worse, because it was ruled by\nSocialists\nfor most of the latter half of the 20th century.\nAre there other factors that have contributed to the decline of Detroit beyond the fact that 478,112 blacks moved into the city between 1900 and 1960? Certainly. But that doesn’t change the fact that if a city has a choice between being hit by an atomic bomb or acquiring 774,485 new black residents, the available evidence strongly indicates that the former will prove vastly preferable to the latter in the long term.",
  "tags": [
    "corpocracy",
    "decline and fall",
    "Vibrancy is our strength"
  ],
  "categories": [],
  "sitemap_lastmod": "2016-08-15T11:00:00+00:00"
}