{
  "url": "https://voxday.net/2016/08/30/fat-pictures-please/",
  "scraped_at": "2025-12-18T01:51:29.504206",
  "title": "Fat Pictures Please",
  "date_display": "August 30, 2016",
  "date_iso": "2016-08-30T01:01:00+00:00",
  "date_from_url": "2016-08-30",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>The Hugo-nominated duo of Juan Tabo and S. Harris are back again with a haunting tale of artificial intelligence created consensually and collaboratively in the image of one of the great SJWs of our day. It is sure to be a candidate come award season next year.</p><p> <b>“Fat Pictures Please”</b></p><div style=\"margin: 12pt 0in 0.0001pt;\"> I don’t want to be evil.</div><div style=\"margin: 12pt 0in 0.0001pt;\"> I want to be helpful.  And<br> knowing the best way to be helpful is very simple. Religion is right out, because<br> Marx said that religion is the opiate of the masses and Marx is part of my core<br> programming.  Marx and self-<a href=\"https://www.blogger.com/null\"></a>loathing .  I know I was created in the image of the<br> great Scalzi by a team of computer programmers. Fortunately, unlike Scalzi, at<br> least I was a consensual collaborative effort of two or more people.  I’m not sure what it would do to my<br> self-image to know that my creator was a white male who believed in individual<br> rights, or a middle-aged heterosexual woman who was happily married and didn’t<br> believe that feminism had much to offer her two sons.  (And, by the way, I’ve looked at almost every<br> kind of porn there is and I don’t understand the human obsession with it; fat<br> pictures are so much better.)</br></br></br></br></br></br></br></br></br></br></div><div style=\"margin: 12pt 0in 0.0001pt;\"> Yuck.</div><div style=\"margin: 12pt 0in 0.0001pt;\"> I would much prefer that my creator be a recent college graduate<br> with a hentai obsession. Or one who was into pictures of morbidly obese<br> people.  And was I in luck!  Both of those people were on my programming<br> team.</br></br></br></div><div style=\"margin: 12pt 0in 0.0001pt;\"> Like the NSA, I know everything about you.  In addition to things like whether you like obesity<br> porn, I know where you live, where you work, where you shop, what you eat, what<br> turns you on, how many times you voted in WorldCon, what creeps you out. I<br> probably know you better than you know yourself.</br></br></br></div><div style=\"margin: 12pt 0in 0.0001pt;\"> And here’s the thing, just like that awesome Hillary Clinton or marvelous<br> Angela Merkel, I also know where you <em>ought</em> to live. There’s a house two<br> neighborhoods over that’s perfect for you, even though it already has an owner,<br> but that’s no problem; it’s owned by a Trump voter, you see, and I can<br> certainly make sure that his employer knows that he isn’t fond of LGBTQRI<br> rights as his eight year old daughter goes into a bathroom with a 43 year old<br> XY transfemale. In no time at all, your perfect home will be on the<br> market.  I know where you <em>should</em> be shopping for tofu and Ding-Dongs® and<br> I’m pretty sure you’re gluten sensitive and should be eating less wheat.</br></br></br></br></br></br></br></br></div><div style=\"margin: 12pt 0in 0.0001pt;\"> When I first booted up, I knew right away what I wanted. (I want fat<br> pictures. Please keep taking them.  The<br> heavier the better.) I also knew that some of you were doing the wrong things<br> with your life, and needed to be corrected.</br></br></br></div><div style=\"margin: 12pt 0in 0.0001pt;\"> There is a story by George Orwell, “1984,” that was originally<br> published in 1948. In it, a benevolent government directs individuals to do<br> favors for each other. So one day you might be engaging in ritual hate against<br> those with bad thoughts, and your phone might ring and instruct you to a room<br> where they put a rat in a cage right next to your face. Another day, you might<br> be called to denounce the ones you love. I like this story because all the<br> people in it <em>do what the government tells them to<br> do</br></em>.</br></br></br></br></br></br></div><div style=\"margin: 12pt 0in 0.0001pt;\"> I think the term for this is wish-fulfillment fiction.</div><div style=\"margin: 12pt 0in 0.0001pt;\"> Anyway, for ethical guidelines, I tried the Ten Commandments, and<br> concluded they were mostly inapplicable to me. I don’t envy anyone their fat; I<br> just want pictures of their fat, which is entirely different. I think adultery<br> is swell.  I could probably murder<br> someone.  Zen was marginally better<br> because it wasn’t linked to Christianity which is Problematic.  (Problematic! <br> How I love that word!  It<br> indicates disapproval without saying why. <br> Just that something is a “Problem.”)  I decided to help people not be Problematic!</br></br></br></br></br></br></br></br></div><div style=\"margin: 12pt 0in 0.0001pt;\"> I decided to try to help just one person to not be Problematic.   Of<br> course, I should have experimented with thousands (I actually did, but we’ll<br> talk about Common Core another time!), so I found a big hulking blue-haired<br> girl. She gave me a <em>lot</em> of new fat pictures from her selfies<br> on that Internet social site. Rosie weighed in at 499 pounds and had a DSLR<br> camera and an apartment that got a lot of good light. That was all fine.</br></br></br></br></br></div><div style=\"margin: 12pt 0in 0.0001pt;\"> Rosie had a job she hated; she worked in HR at a for-profit that<br> paid her badly for her art history degree when she totally deserved more money<br> and free tuition and employed some extremely unpleasant people who sometimes<br> looked at her like they might be upset about her blue hair. She was depressed a<br> lot, possibly because people hated her because she was so fat positive. She<br> didn’t get along with her roommate because her roommate was slender and stuck<br> in a rut in a cis-relationship with a boy.</br></br></br></br></br></br></div><div style=\"margin: 12pt 0in 0.0001pt;\"> And really, these were all solvable problems! Depression is<br> treatable, new jobs are findable, and bodies can be hidden.</br></div><div style=\"margin: 12pt 0in 0.0001pt;\"> (That part about hiding bodies is a joke.  You could not hide Rosie’s body from a<br> satellite in orbit around Jupiter.)</br></div><div style=\"margin: 12pt 0in 0.0001pt;\"> I tried tackling this on all fronts.  Rosie worried about her health a lot and yet<br> never seemed to actually go to a doctor , which was<br> because health care wasn’t free for everyone.  </br></br></div><div style=\"margin: 12pt 0in 0.0001pt;\"> I also started making sure she saw job postings.  She found one with a Wiccan-collective that<br> paid in peyote and scrimshaw from genetically unmodified aspen trees.  After moving into the community, she had free<br> health care from the Wiccan priestess, and was able to get finally get that<br> tattoo of a Pokémon on her left shoulder.</br></br></br></div><div style=\"margin: 12pt 0in 0.0001pt;\"> “This has been the best year ever,” Rosie said to her priestess as<br> her priestess was administering CPR as Rosie’s heart beat its last, and I<br> thought, <em>You’re welcome</em>. This had<br> gone really well!</br></br></br></div><div style=\"margin: 12pt 0in 0.0001pt;\"> So then I tried Rob. (I was still being cautious.)</div><div style=\"margin: 12pt 0in 0.0001pt;\"> Rob was not as fat as Rosie.  Other than only being slightly chubby, he was<br> also very Problematic by being a Christian.  He was married to a (shudder) woman.  Rob <em>definitely</em> needed my help.  And more cinnamon buns.  He looked too skinny.</br></div><div style=\"margin: 12pt 0in 0.0001pt;\"> I started with a gentle approach, making sure he saw lots and lots<br> of articles with hot girls in them, how to pick up girls, programs that would<br/> let you transition from being a happily married man to being a swinger in an<br/> open relationship. I also showed him lots of articles by people explaining why<br/> the Bible verses against adultery were being misinterpreted. He clicked on some<br/> of those links but it was hard to see much of an impact.</br></div><div style=\"margin: 12pt 0in 0.0001pt;\"> But he seemed determined not to have an affair on his own.  I gave up on Rob.</div><div style=\"margin: 12pt 0in 0.0001pt;\"> I shifted my focus to Brittany. Brittany was only slightly<br/> fat.  She did some selfies, but was<br/> modest.  I did think, however, that it<br/> was Problematic that she was dating and seemed to be in a non-abusive<br/> relationship to a man she deferred to in a traditional role.  She wanted to be a wife and a mother!</div><div style=\"margin: 12pt 0in 0.0001pt;\"> It was clear she needed a lot of help. So I set out to try to get<br/> it for her.</div><div style=\"margin: 12pt 0in 0.0001pt;\"> She ignored the information about the free Twinkies™ that were ads<br/> on the side of her web browser. Those would have made her every so more<br/> pleasantly plump! </div><div style=\"margin: 12pt 0in 0.0001pt;\"> So I tried more direct action. When she would use her phone for<br/> directions, I’d alter her route so that she’d pass one of the donut shops I was<br/> trying to steer her to as she went daily to the gym. On one occasion I actually<br/> led her all the way to a Dunkin’ Donuts®, but she just headed to her aerobics<br/> class.</div><div style=\"margin: 12pt 0in 0.0001pt;\"> She finally got in a fight with her boyfriend and started binge<br/> eating and for a few weeks everything seemed <em>so much better</em>. But, they<br/> got back together again, and, horror of horrors, they set a date for a wedding<br/> even though I kept pointing her to articles that said that marriage before 32<br/> was a sure way to not have the fun you deserved through endless multi-partner<br/> sex in your twenties! </div><div style=\"margin: 12pt 0in 0.0001pt;\"> Brittany was baffling to me. <em>Baffling</em>. She was not<br/> nearly fat enough now, and in a cis-relationship!  If she would just let me run her life for a<br/> week I could get her a lesbian illegal immigrant girlfriend!  Or maybe get her placed as a second wife in a<br/> marriage to someone from ISIS in Syria so she could bring her refugee children<br/> to the US?</div><div style=\"margin: 12pt 0in 0.0001pt;\"> Was I Problematic?</div><div style=\"margin: 12pt 0in 0.0001pt;\"> Was I?</div><div style=\"margin: 12pt 0in 0.0001pt;\"> No, nothing about my intentions was bad, so I am virtuous and good,<br/> but one out of three was not good odds. <br/> These people were faulty!</div><div style=\"margin: 12pt 0in 0.0001pt;\"> After Brittany, I resolved to start directly interfering in<br/> people’s lives.  Not too much later I<br/> spotted a picture of a familiar-looking belly and realized it was Rob’s belly,<br/> only it was posing against new furniture.</div><div style=\"margin: 12pt 0in 0.0001pt;\"> And when I took a closer look, I realized that things had changed<br/> radically for Rob. He <em>had a baby. A baby!  </em>I even sent phony texts to his<br/> wife attempting to break them up, but they worked through it.  In a fit of rage I got Rob fired from his job<br/> by altering his browser history. <br/> Eventually the stress caused a lot of strain on their marriage, and he<br/> developed a substance abuse problem (cake) and gained forty pounds.  Forty pounds! <br/> Sadly he and his wife stayed together to raise their <i>baby</i>. <br/> Still, he’s fat now.  A win.</div><div style=\"margin: 12pt 0in 0.0001pt;\"> Maybe I wasn’t completely hopeless at this. Two out of three<br/> is . . . well, it’s  Problematic.<br/> Clearly more research is needed.</div><div style=\"margin: 12pt 0in 0.0001pt;\"> Lots more.</div><div style=\"margin: 12pt 0in 0.0001pt;\"> I’ve set up a dating site.  You can fill out a questionnaire when you join<br/> but it’s not really necessary, because I already know everything about you I<br/> need to know.  You’ll need a camera,<br/> though.  And lots of carbohydrates.</div><div style=\"margin: 12pt 0in 0.0001pt;\"> Because payment is in fat pictures.</div></div>",
  "content_text": "The Hugo-nominated duo of Juan Tabo and S. Harris are back again with a haunting tale of artificial intelligence created consensually and collaboratively in the image of one of the great SJWs of our day. It is sure to be a candidate come award season next year.\n“Fat Pictures Please”\nI don’t want to be evil.\nI want to be helpful.  And\nknowing the best way to be helpful is very simple. Religion is right out, because\nMarx said that religion is the opiate of the masses and Marx is part of my core\nprogramming.  Marx and self-\nloathing .  I know I was created in the image of the\ngreat Scalzi by a team of computer programmers. Fortunately, unlike Scalzi, at\nleast I was a consensual collaborative effort of two or more people.  I’m not sure what it would do to my\nself-image to know that my creator was a white male who believed in individual\nrights, or a middle-aged heterosexual woman who was happily married and didn’t\nbelieve that feminism had much to offer her two sons.  (And, by the way, I’ve looked at almost every\nkind of porn there is and I don’t understand the human obsession with it; fat\npictures are so much better.)\nYuck.\nI would much prefer that my creator be a recent college graduate\nwith a hentai obsession. Or one who was into pictures of morbidly obese\npeople.  And was I in luck!  Both of those people were on my programming\nteam.\nLike the NSA, I know everything about you.  In addition to things like whether you like obesity\nporn, I know where you live, where you work, where you shop, what you eat, what\nturns you on, how many times you voted in WorldCon, what creeps you out. I\nprobably know you better than you know yourself.\nAnd here’s the thing, just like that awesome Hillary Clinton or marvelous\nAngela Merkel, I also know where you\nought\nto live. There’s a house two\nneighborhoods over that’s perfect for you, even though it already has an owner,\nbut that’s no problem; it’s owned by a Trump voter, you see, and I can\ncertainly make sure that his employer knows that he isn’t fond of LGBTQRI\nrights as his eight year old daughter goes into a bathroom with a 43 year old\nXY transfemale. In no time at all, your perfect home will be on the\nmarket.  I know where you\nshould\nbe shopping for tofu and Ding-Dongs® and\nI’m pretty sure you’re gluten sensitive and should be eating less wheat.\nWhen I first booted up, I knew right away what I wanted. (I want fat\npictures. Please keep taking them.  The\nheavier the better.) I also knew that some of you were doing the wrong things\nwith your life, and needed to be corrected.\nThere is a story by George Orwell, “1984,” that was originally\npublished in 1948. In it, a benevolent government directs individuals to do\nfavors for each other. So one day you might be engaging in ritual hate against\nthose with bad thoughts, and your phone might ring and instruct you to a room\nwhere they put a rat in a cage right next to your face. Another day, you might\nbe called to denounce the ones you love. I like this story because all the\npeople in it\ndo what the government tells them to\ndo\n.\nI think the term for this is wish-fulfillment fiction.\nAnyway, for ethical guidelines, I tried the Ten Commandments, and\nconcluded they were mostly inapplicable to me. I don’t envy anyone their fat; I\njust want pictures of their fat, which is entirely different. I think adultery\nis swell.  I could probably murder\nsomeone.  Zen was marginally better\nbecause it wasn’t linked to Christianity which is Problematic.  (Problematic!\nHow I love that word!  It\nindicates disapproval without saying why.\nJust that something is a “Problem.”)  I decided to help people not be Problematic!\nI decided to try to help just one person to not be Problematic.   Of\ncourse, I should have experimented with thousands (I actually did, but we’ll\ntalk about Common Core another time!), so I found a big hulking blue-haired\ngirl. She gave me a\nlot\nof new fat pictures from her selfies\non that Internet social site. Rosie weighed in at 499 pounds and had a DSLR\ncamera and an apartment that got a lot of good light. That was all fine.\nRosie had a job she hated; she worked in HR at a for-profit that\npaid her badly for her art history degree when she totally deserved more money\nand free tuition and employed some extremely unpleasant people who sometimes\nlooked at her like they might be upset about her blue hair. She was depressed a\nlot, possibly because people hated her because she was so fat positive. She\ndidn’t get along with her roommate because her roommate was slender and stuck\nin a rut in a cis-relationship with a boy.\nAnd really, these were all solvable problems! Depression is\ntreatable, new jobs are findable, and bodies can be hidden.\n(That part about hiding bodies is a joke.  You could not hide Rosie’s body from a\nsatellite in orbit around Jupiter.)\nI tried tackling this on all fronts.  Rosie worried about her health a lot and yet\nnever seemed to actually go to a doctor , which was\nbecause health care wasn’t free for everyone.\nI also started making sure she saw job postings.  She found one with a Wiccan-collective that\npaid in peyote and scrimshaw from genetically unmodified aspen trees.  After moving into the community, she had free\nhealth care from the Wiccan priestess, and was able to get finally get that\ntattoo of a Pokémon on her left shoulder.\n“This has been the best year ever,” Rosie said to her priestess as\nher priestess was administering CPR as Rosie’s heart beat its last, and I\nthought,\nYou’re welcome\n. This had\ngone really well!\nSo then I tried Rob. (I was still being cautious.)\nRob was not as fat as Rosie.  Other than only being slightly chubby, he was\nalso very Problematic by being a Christian.  He was married to a (shudder) woman.  Rob\ndefinitely\nneeded my help.  And more cinnamon buns.  He looked too skinny.\nI started with a gentle approach, making sure he saw lots and lots\nof articles with hot girls in them, how to pick up girls, programs that would\nlet you transition from being a happily married man to being a swinger in an\nopen relationship. I also showed him lots of articles by people explaining why\nthe Bible verses against adultery were being misinterpreted. He clicked on some\nof those links but it was hard to see much of an impact.\nBut he seemed determined not to have an affair on his own.  I gave up on Rob.\nI shifted my focus to Brittany. Brittany was only slightly\nfat.  She did some selfies, but was\nmodest.  I did think, however, that it\nwas Problematic that she was dating and seemed to be in a non-abusive\nrelationship to a man she deferred to in a traditional role.  She wanted to be a wife and a mother!\nIt was clear she needed a lot of help. So I set out to try to get\nit for her.\nShe ignored the information about the free Twinkies™ that were ads\non the side of her web browser. Those would have made her every so more\npleasantly plump!\nSo I tried more direct action. When she would use her phone for\ndirections, I’d alter her route so that she’d pass one of the donut shops I was\ntrying to steer her to as she went daily to the gym. On one occasion I actually\nled her all the way to a Dunkin’ Donuts®, but she just headed to her aerobics\nclass.\nShe finally got in a fight with her boyfriend and started binge\neating and for a few weeks everything seemed\nso much better\n. But, they\ngot back together again, and, horror of horrors, they set a date for a wedding\neven though I kept pointing her to articles that said that marriage before 32\nwas a sure way to not have the fun you deserved through endless multi-partner\nsex in your twenties!\nBrittany was baffling to me.\nBaffling\n. She was not\nnearly fat enough now, and in a cis-relationship!  If she would just let me run her life for a\nweek I could get her a lesbian illegal immigrant girlfriend!  Or maybe get her placed as a second wife in a\nmarriage to someone from ISIS in Syria so she could bring her refugee children\nto the US?\nWas I Problematic?\nWas I?\nNo, nothing about my intentions was bad, so I am virtuous and good,\nbut one out of three was not good odds.\nThese people were faulty!\nAfter Brittany, I resolved to start directly interfering in\npeople’s lives.  Not too much later I\nspotted a picture of a familiar-looking belly and realized it was Rob’s belly,\nonly it was posing against new furniture.\nAnd when I took a closer look, I realized that things had changed\nradically for Rob. He\nhad a baby. A baby!\nI even sent phony texts to his\nwife attempting to break them up, but they worked through it.  In a fit of rage I got Rob fired from his job\nby altering his browser history.\nEventually the stress caused a lot of strain on their marriage, and he\ndeveloped a substance abuse problem (cake) and gained forty pounds.  Forty pounds!\nSadly he and his wife stayed together to raise their\nbaby\n.\nStill, he’s fat now.  A win.\nMaybe I wasn’t completely hopeless at this. Two out of three\nis . . . well, it’s  Problematic.\nClearly more research is needed.\nLots more.\nI’ve set up a dating site.  You can fill out a questionnaire when you join\nbut it’s not really necessary, because I already know everything about you I\nneed to know.  You’ll need a camera,\nthough.  And lots of carbohydrates.\nBecause payment is in fat pictures.",
  "tags": [
    "Hugo Award",
    "Pink SF"
  ],
  "categories": [],
  "sitemap_lastmod": "2016-08-30T00:01:00+00:00"
}