{
  "url": "https://voxday.net/2016/08/14/heat-street-debate-marital-rape/",
  "scraped_at": "2025-12-18T01:48:58.546000",
  "title": "Heat Street debate: marital rape",
  "date_display": "August 14, 2016",
  "date_iso": "2016-08-14T15:13:00+00:00",
  "date_from_url": "2016-08-14",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>My latest debate with Louise Mensch of Heat Street is <a href=\"http://heatst.com/world/feminism-debates-vox-day-vs-louise-mensch-on-marital-rape/?mod=sm_tw_post\">on the subject of marital rape</a>, concerning which my view that it is an oxymoron has been declared controversial in certain circles:</p><blockquote><p> Louise Mensch: Do you agree that there’s no such thing as rape within marriage?</p><p>Vox Day: Yeah, I think it’s quite obvious that it’s not even possible for there to be anything that we describe as rape within marriage. I find it remarkable that someone would try and claim that it is beyond debate when this new concept of marital rape is not only very, very new but is in fact not even applicable to most of the human race. It’s very clear, for example, in India it’s part of the written law that it’s not possible, for even if force is involved, there cannot be rape between a man and a woman. In China the law is the same.</p><p>LM: Mm-hmm (affirmative) but there’s a difference between saying what the law is and saying what is morally right. You would agree that just because somebody says something is a law doesn’t make it so. Let’s just start with that basic principle.</p><p>Vox: There’s huge difference between morality and legality. I’d be the first to agree with that. The fact of the matter is that the concept of marital rape hangs on consent and because marriage is and has always granted consent, the act of marriage is a granting of consent, therefore it’s not possible for the consent to be withdrawn and then for rape to happen. In fact, the concept of marital rape is created by the cultural Marxists in an attempt to destroy the family and to destroy the institution of marriage.</p><p>LM: I’m going to say that that’s patent nonsense. If you consent to something once it doesn’t mean that you’ve given a blanket consent to it forever. We agree on the definition of rape – that rape is when one party forces sex on the other without their consent?</p><p>Vox: Yes.</p><p>LM: Good. We go that far. Your argument then hinges on the statement that to get married is to give an all-time consent forever to sex with your spouse?</p><p>Vox: Exactly. It’s no different than when you join the army. You only have to join the army once. You don’t get the choice to consent to obey orders every single time an order is given. In certain arrangements, and marriage is one of them, the agreement is a lasting one, and that’s why it’s something that should not be entered into lightly.</p></blockquote><p>I find it both amusing and mildly disconcerting that a view which is consistent with the entire legal and philosophical history of the human race is suddenly supposed to be unimaginable. I mean, precisely how <i>ignorant</i>, precisely how <i>brainwashed, </i>does one have to be in order to be completely unable to imagine that which is not only recent history, but <i>is still the law</i> for most of the human race?</p></div>",
  "content_text": "My latest debate with Louise Mensch of Heat Street is\non the subject of marital rape\n, concerning which my view that it is an oxymoron has been declared controversial in certain circles:\nLouise Mensch: Do you agree that there’s no such thing as rape within marriage?\nVox Day: Yeah, I think it’s quite obvious that it’s not even possible for there to be anything that we describe as rape within marriage. I find it remarkable that someone would try and claim that it is beyond debate when this new concept of marital rape is not only very, very new but is in fact not even applicable to most of the human race. It’s very clear, for example, in India it’s part of the written law that it’s not possible, for even if force is involved, there cannot be rape between a man and a woman. In China the law is the same.\nLM: Mm-hmm (affirmative) but there’s a difference between saying what the law is and saying what is morally right. You would agree that just because somebody says something is a law doesn’t make it so. Let’s just start with that basic principle.\nVox: There’s huge difference between morality and legality. I’d be the first to agree with that. The fact of the matter is that the concept of marital rape hangs on consent and because marriage is and has always granted consent, the act of marriage is a granting of consent, therefore it’s not possible for the consent to be withdrawn and then for rape to happen. In fact, the concept of marital rape is created by the cultural Marxists in an attempt to destroy the family and to destroy the institution of marriage.\nLM: I’m going to say that that’s patent nonsense. If you consent to something once it doesn’t mean that you’ve given a blanket consent to it forever. We agree on the definition of rape – that rape is when one party forces sex on the other without their consent?\nVox: Yes.\nLM: Good. We go that far. Your argument then hinges on the statement that to get married is to give an all-time consent forever to sex with your spouse?\nVox: Exactly. It’s no different than when you join the army. You only have to join the army once. You don’t get the choice to consent to obey orders every single time an order is given. In certain arrangements, and marriage is one of them, the agreement is a lasting one, and that’s why it’s something that should not be entered into lightly.\nI find it both amusing and mildly disconcerting that a view which is consistent with the entire legal and philosophical history of the human race is suddenly supposed to be unimaginable. I mean, precisely how\nignorant\n, precisely how\nbrainwashed,\ndoes one have to be in order to be completely unable to imagine that which is not only recent history, but\nis still the law\nfor most of the human race?",
  "tags": [
    "debate",
    "law",
    "philosophy"
  ],
  "categories": [],
  "sitemap_lastmod": "2016-08-14T14:13:00+00:00"
}