{
  "url": "https://voxday.net/2016/08/28/in-defense-of-14-words/",
  "scraped_at": "2025-12-18T01:51:16.296846",
  "title": "In defense of 14 words",
  "date_display": "August 28, 2016",
  "date_iso": "2016-08-28T14:30:00+00:00",
  "date_from_url": "2016-08-28",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>Now, I don’t usually recommend this sort of dialectical response to a rhetorical attack like the one cited here. However, for those who are sufficiently bilingual in the black arts of philosophical persuasion, this may be a useful example of how to turn an attacker’s rhetorical assault against him.</p><p>Notice how he initially attacks Point 14, but when called on his implicit endorsement of their negation, refuses to directly answer what aspect of it he opposes. This is what I mean by dialectic being useful for exposing pseudo-dialectic for rhetorical purposes.</p><p>It’s a little confusing, I know, but don’t be misled. This is, from start to finish, a rhetorical engagement. I am merely using dialectic as a rhetorical device to expose and manipulate him into publicly discrediting himself.</p><p> Supreme Dark Lord @voxday<br> Awful attempt by (((@CathyYoung63))) to critique my #AltRight platform. She calls the West “a mongrel culture”.</br></p><p>Charles Ledley ‏@ialmctt<br> You saw awful, but most would say accurate. @CathyYoung63 has nailed it. The #AltRight are nazis, pure and simple.</br></p><p>Charles Ledley ‏@ialmctt<br> Here, @voxday means the Jews. (screencap of 10)</br></p><p>Charles Ledley ‏@ialmctt<br> Here, @voxday uses that well known scientific term: sub-species. No racism to see here. Move along. (screencap of 15)</br></p><p>Charles Ledley ‏@ialmctt<br> #WhatIsTheAltRight?<br> Well, the #AltRight are white supremacists. Isn’t that right, @voxday?</br></br></p><p>Supreme Dark Lord ‏@voxday<br> Some are, most aren’t. I’m an Indian. What part of this do you oppose? “We must secure the existence of white people and a future for white children”?</br></p><p>Charles Ledley ‏@ialmctt<br> So you are a white supremacist then. Just another reactionary nazi.</br></p><p>Charles Ledley ‏@ialmctt<br> You are, it seems. And no, I don’t oppose the existence of PEOPLE.</br></p><p>Supreme Dark Lord ‏@voxday<br> No, Charlie, I am not. I am an Indian who believes that the continued existence of white people is desirable. Why do you disagree?</br></p><p>Charles Ledley ‏@ialmctt<br> Stop being disingenuous. It’s a well known White Supremacist slogan. You know that.</br></p><p>Supreme Dark Lord ‏@voxday<br> Answer the question. What part of it do you oppose? All of it? None of it?</br></p><p>Charles Ledley‏@ialmctt<br> I’ll answer it if you acknowledge that it’s a well known white supremacist slogan. Do you acknowledge that?</br></p><p>Supreme Dark Lord ‏@voxday<br> Of course. That’s why it is point 14. Now, answer the question. Do you support all of the 14 words, some of them, or none of them?</br></p><p>Charles Ledley ‏@ialmctt<br> I’ve answered this.</br></p><p>Supreme Dark Lord ‏@voxday<br> No, you didn’t. This is going on the blog, so don’t be evasive. Which of the 14 words do you disagree with, if any?</br></p><p>Charles Ledley ‏@ialmctt<br> Put what you like on your blog. I answered your question</br></p><p> He didn’t, of course, and we all know why. If he actually answered it, he would either be liable to his own charge of being a white supremacist for endorsing the continued existence of white people or he would be put on the record for calling openly for the extermination of the white races.</p><p>I believe this should settle the debate about whether Point 14 belongs on the list of core Alt-Right principles or not in favor of the affirmative.</p></div>",
  "content_text": "Now, I don’t usually recommend this sort of dialectical response to a rhetorical attack like the one cited here. However, for those who are sufficiently bilingual in the black arts of philosophical persuasion, this may be a useful example of how to turn an attacker’s rhetorical assault against him.\nNotice how he initially attacks Point 14, but when called on his implicit endorsement of their negation, refuses to directly answer what aspect of it he opposes. This is what I mean by dialectic being useful for exposing pseudo-dialectic for rhetorical purposes.\nIt’s a little confusing, I know, but don’t be misled. This is, from start to finish, a rhetorical engagement. I am merely using dialectic as a rhetorical device to expose and manipulate him into publicly discrediting himself.\nSupreme Dark Lord @voxday\nAwful attempt by (((@CathyYoung63))) to critique my #AltRight platform. She calls the West “a mongrel culture”.\nCharles Ledley ‏@ialmctt\nYou saw awful, but most would say accurate. @CathyYoung63 has nailed it. The #AltRight are nazis, pure and simple.\nCharles Ledley ‏@ialmctt\nHere, @voxday means the Jews. (screencap of 10)\nCharles Ledley ‏@ialmctt\nHere, @voxday uses that well known scientific term: sub-species. No racism to see here. Move along. (screencap of 15)\nCharles Ledley ‏@ialmctt\n#WhatIsTheAltRight?\nWell, the #AltRight are white supremacists. Isn’t that right, @voxday?\nSupreme Dark Lord ‏@voxday\nSome are, most aren’t. I’m an Indian. What part of this do you oppose? “We must secure the existence of white people and a future for white children”?\nCharles Ledley ‏@ialmctt\nSo you are a white supremacist then. Just another reactionary nazi.\nCharles Ledley ‏@ialmctt\nYou are, it seems. And no, I don’t oppose the existence of PEOPLE.\nSupreme Dark Lord ‏@voxday\nNo, Charlie, I am not. I am an Indian who believes that the continued existence of white people is desirable. Why do you disagree?\nCharles Ledley ‏@ialmctt\nStop being disingenuous. It’s a well known White Supremacist slogan. You know that.\nSupreme Dark Lord ‏@voxday\nAnswer the question. What part of it do you oppose? All of it? None of it?\nCharles Ledley‏@ialmctt\nI’ll answer it if you acknowledge that it’s a well known white supremacist slogan. Do you acknowledge that?\nSupreme Dark Lord ‏@voxday\nOf course. That’s why it is point 14. Now, answer the question. Do you support all of the 14 words, some of them, or none of them?\nCharles Ledley ‏@ialmctt\nI’ve answered this.\nSupreme Dark Lord ‏@voxday\nNo, you didn’t. This is going on the blog, so don’t be evasive. Which of the 14 words do you disagree with, if any?\nCharles Ledley ‏@ialmctt\nPut what you like on your blog. I answered your question\nHe didn’t, of course, and we all know why. If he actually answered it, he would either be liable to his own charge of being a white supremacist for endorsing the continued existence of white people or he would be put on the record for calling openly for the extermination of the white races.\nI believe this should settle the debate about whether Point 14 belongs on the list of core Alt-Right principles or not in favor of the affirmative.",
  "tags": [
    "#AltRight",
    "debate"
  ],
  "categories": [],
  "sitemap_lastmod": "2016-08-28T13:30:00+00:00"
}