{
  "url": "https://voxday.net/2016/08/08/its-more-convincing-if-you-dont-lie/",
  "scraped_at": "2025-12-18T01:47:58.051651",
  "title": "It’s more convincing if you don’t lie",
  "date_display": "August 8, 2016",
  "date_iso": "2016-08-08T08:07:00+00:00",
  "date_from_url": "2016-08-08",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>Some of Donald Trump’s critics don’t realize that being “a man of the people” is about supporting those people’s interests, <a href=\"http://www.unz.com/isteve/who-is-more-privileged-trump-stephens-or-zakaria/\">not lying about your background</a> and pretending to have worked your way up from the bottom:</p><blockquote><p> Wall Street Journal deputy editorial page editor Bret Stephens told CNNs’ Fareed Zakaria that Donald Trump’s campaign is “increasingly a vision of the privileges of a white ethnic bloc.” Stephens warned Trump has turned the Republican party into the “white party” and is doubtful the it can reclaim the principle of opportunity and the “right to rise” following a Trump loss.</p><p>“It’s basically increasingly a vision of the privileges of a white ethnic bloc who he is speaking to,” Stephens said of the Trump campaign. “If the Republican party essentially becomes the white party, it is going to be the death of it.”</p><p>Stephens fought back against the argument that anti-Trump Republicans are elitists living in a bubble.</p><p>Stephens said he wished he was born into a rich family entrenched in New York real estate and the privileges that comes along with that. Instead, he said, he “started at the bottom” and any achievements he has made were based on merit.</p><p>“This is the standard line of the Trump side of the party, that us who oppose him are just a bunch of elites who live in the Acela corridor in this bubble of unimaginable wealth,” Stephens said to his co-panelist, Trump surrogate Emily Miller. “I wish I had been born into an extremely wealthy New York real estate family and been given multimillion dollar loans to get my start in life. I started at the bottom like so many of us did and to the extent that I achieved anything I think it’s on merit.”</p><p>Stephens, however, was born in New York to a chemical company executive and attended boarding school at the Middlesex School in Massachusetts. He later attended the London School of Economics.</p></blockquote><p>Stephens is not only lying about himself, he’s wrong. The only hope the Republicans have of survival is to become the white party, shut down immigration, and start deporting the post-1965 wavers. Due to the combination of demographics and white people opposed to white interests, it’s entirely possible that if Donald Trump does not win, no Republican will ever be president again.</p><p>Not all whites favor small government. But look around the world. White Americans are the <i>only </i>people who favor it. That means the Republican Party, with its current ideology, cannot possibly win in any polity that does not consist of predominantly white American voters. It would have to become party more akin to the British Tories or Angela Merkel’s Christian Democrats, or accept permanent opposition status.</p><p>Being a good cuckservative, Stephens probably favors the latter. What could be more satisfying than the certainty of knowing you can remain perfectly principled, secure in the assurance of your noble defeat.</p><p>CORRECTION: I stand corrected. Stephens (((Erlich))) is not a cuckservative, he’s just another media Jew who is opposed to a white Republican party because a white Republican party would reliably prioritize American interests over Jewish interests. As I’ve repeatedly predicted, ideology is dead. It’s all identity politics now.</p><p>On a tangential note, we’ll know America is no longer the premier global power when the Erlich-Stephens of the world start changing their names to Wang, Li, and Zhang.</p></div>",
  "content_text": "Some of Donald Trump’s critics don’t realize that being “a man of the people” is about supporting those people’s interests,\nnot lying about your background\nand pretending to have worked your way up from the bottom:\nWall Street Journal deputy editorial page editor Bret Stephens told CNNs’ Fareed Zakaria that Donald Trump’s campaign is “increasingly a vision of the privileges of a white ethnic bloc.” Stephens warned Trump has turned the Republican party into the “white party” and is doubtful the it can reclaim the principle of opportunity and the “right to rise” following a Trump loss.\n“It’s basically increasingly a vision of the privileges of a white ethnic bloc who he is speaking to,” Stephens said of the Trump campaign. “If the Republican party essentially becomes the white party, it is going to be the death of it.”\nStephens fought back against the argument that anti-Trump Republicans are elitists living in a bubble.\nStephens said he wished he was born into a rich family entrenched in New York real estate and the privileges that comes along with that. Instead, he said, he “started at the bottom” and any achievements he has made were based on merit.\n“This is the standard line of the Trump side of the party, that us who oppose him are just a bunch of elites who live in the Acela corridor in this bubble of unimaginable wealth,” Stephens said to his co-panelist, Trump surrogate Emily Miller. “I wish I had been born into an extremely wealthy New York real estate family and been given multimillion dollar loans to get my start in life. I started at the bottom like so many of us did and to the extent that I achieved anything I think it’s on merit.”\nStephens, however, was born in New York to a chemical company executive and attended boarding school at the Middlesex School in Massachusetts. He later attended the London School of Economics.\nStephens is not only lying about himself, he’s wrong. The only hope the Republicans have of survival is to become the white party, shut down immigration, and start deporting the post-1965 wavers. Due to the combination of demographics and white people opposed to white interests, it’s entirely possible that if Donald Trump does not win, no Republican will ever be president again.\nNot all whites favor small government. But look around the world. White Americans are the\nonly\npeople who favor it. That means the Republican Party, with its current ideology, cannot possibly win in any polity that does not consist of predominantly white American voters. It would have to become party more akin to the British Tories or Angela Merkel’s Christian Democrats, or accept permanent opposition status.\nBeing a good cuckservative, Stephens probably favors the latter. What could be more satisfying than the certainty of knowing you can remain perfectly principled, secure in the assurance of your noble defeat.\nCORRECTION: I stand corrected. Stephens (((Erlich))) is not a cuckservative, he’s just another media Jew who is opposed to a white Republican party because a white Republican party would reliably prioritize American interests over Jewish interests. As I’ve repeatedly predicted, ideology is dead. It’s all identity politics now.\nOn a tangential note, we’ll know America is no longer the premier global power when the Erlich-Stephens of the world start changing their names to Wang, Li, and Zhang.",
  "tags": [
    "immigration",
    "politics"
  ],
  "categories": [],
  "sitemap_lastmod": "2016-08-08T07:07:00+00:00"
}