{
  "url": "https://voxday.net/2016/08/04/its-just-media-narrative/",
  "scraped_at": "2025-12-18T01:47:28.634564",
  "title": "Mailvox: it’s just the media narrative",
  "date_display": "August 4, 2016",
  "date_iso": "2016-08-04T17:00:00+00:00",
  "date_from_url": "2016-08-04",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>MJ is suspicious about the so-called “Trump Implosion” and rightfully so:</p><blockquote><p> With all of the talk I’ve been seeing over the past week in regards to the mainstream news of Trump “imploding”, is it just me, or are the various factions of the diminishing hordes of establishment supporters getting more and more outlandish in their barbs against the campaign? How much longer will these types continue to deny the inevitable truth before they have to pivot to attempt to save their ignorant asses?</p><p>To wit:</p><p>– Yes, Trump has a concern about taking things personally. I see that more as a positive than a negative. The current occupant of the Office has too much of an “I don’t give a damn” attitude, and I think that’s part of the issue we’re running into in terms of leadership.</p><p>– The whole Khan issue. The reason it hasn’t gone away isn’t because Trump is keeping on it, it’s that the establishment handlers keep thrusting Khan back out into the spotlight to force Trump to respond. I heard a piece of an interview between Khan and Anderson Cooper from the other day, and it was clear to me that the man had no clue what he was talking about in terms of his constitutional claims. I literally felt dumber after hearing the man speak, it was that bad. The only reason Khan is even remotely relevant is that his son died in action during OIF, and that was an action supported by the D nominee, not Trump. I personally find it repulsive that they would use that status for such actions (it’s not surprising to me, however).</p><p>– The enthusiasm gap. Last weekend, there was supposedly a big bus trip through Pennsylvania and Ohio for the D ticket. It was so huge that they had to pay people to show up in western PA, and they ended up canceling the appearance in Cleveland, both cases due to lack of interest. Meanwhile, Trump and his campaign were upset that fire marshals were capping entry to venues far below the posted capacity limits. And where he’s not being capped, they’re turning people away. It’s night and day in terms of what is being reported by the establishment versus what the ground truth is.</p><p>I’m registered as unaffiliated where I live. I chose to be unaffiliated because the two-party system here is horribly, irrevocably broken. I understand that a lot of this traffic is meant for me to influence me into supporting the D nominee. I hate to say it, but I’m rather insulted by this attitude and approach. It’s not working. There’s nothing there for the D nominee to offer, and the choice of running mate is also a personal affront to me as an active, practicing Roman Catholic.</p><p>I will be honest, I’m not 100% behind Trump, but it’s not for any reason from the establishment. There is a legitimate unknown with him, and that’s probably due more to my healthy skepticism of someone who is naturally outside the overall process. This is another of those once in a generation occurrences where the truth is so obvious that one would have to be a complete idiot to ignore it.</p><p>The conclusion I’m running into is this: Trump is the catalyst for a completely new paradigm in both American and international politics, something that we sort of started to see with the Brexit vote, even though that was focused on the UK. The opportunity his election presents is huge in terms of how things can at least attempt to rectify themselves, and that’s what gives me hope.</p><p>I agree with the consensus that the Trumpslide is coming, especially since there’s still 95 days of campaigning to go, including 3 debates.</p></blockquote><p>My take: everyone needs to relax about the “Trump implosion” and <a href=\"http://www.foxnews.com/politics/2016/08/04/media-trumpeting-trump-implosion-but-is-it-real.html\">the purported Republican revolt</a>. The media is full of SJWs. And what do SJWs do? Exactly!</p><blockquote><p> This is what a full-fledged feeding frenzy looks like.</p><p>With Donald Trump facing the roughest stretch of his candidacy, the media have moved from questioning his sanity to depicting a campaign in disarray and top Republicans still wondering whether they can dump the nominee.</p><p>That won’t happen, of course, but it’s an indication of the toxic nature of the coverage and the flood of anti-Trump leaks now washing across the media landscape.</p><p>There’s a natural piling-on effect when campaigns go off the rails: The polls dip, the critics step up their rhetoric, staffers start pointing fingers, and the press keeps the vicious cycle going.</p><p>But I’ve never seen anything like this.</p><p>Things reached the point yesterday morning that CNBC’s John Harwood tweeted: “Longtime ally of Paul Manafort, Trump’s campaign manager: ‘Manafort not challenging Trump anymore. Mailing it in. Staff suicidal.'”</p><p>And there was this from CNN: “A source tells @DanaBashCNN that some Trump campaign staff are frustrated w/ candidate lately, ‘feel like they are wasting their time.’”</p><p>I am told by knowledgeable campaign sources that Manafort is not going anywhere and believes that Trump will be getting back on message.</p><p>I am further told that reports of a planned “intervention” with the candidate, led by Newt Gingrich and Rudy Giuliani, are false.</p><p>And the sources also say that, contrary to media reports, party chairman Reince Priebus is not furious with Trump, though he is disappointed with the nominee’s refusal to endorse Paul Ryan.</p></blockquote><p>The Khan/Implosion narrative nothing more than the Democratic <i>hasbara </i>that we’ve been seeing on this blog and others, writ large. As for the polls, I remind you of my previous assessment: they don’t mean ANYTHING until 30 days after the end of the second convention.</p><p>If there is no discernible Trump trend by then, it MIGHT be time to start considering the possibility of a Hillary win. In the meantime, pay no attention to the media’s attempt to establish a false narrative. Remember, they are trying to <i>shape </i>reality, they are not honestly reporting it.</p><p>Let’s look at this rationally. If the media was genuinely convinced that Hillary Clinton was going to win, do you really think they would engage in this sort of mass narrative-shaping instead of triumphantly slinging insults at Republicans while victory-dancing?</p><p>As to how long it will be before they pivot, I would say one week after the polls start showing Trump within striking distance of Hillary again. Which should be in about one month.</p><p>UPDATE: from the comments: <i>“Ricky Vaughn 99 has suggested for months that it all starts with one push from Labor Day. He has said Trump does pushes and retreats in waves.”</i></p><p>I have noticed this too. Remember there were similar lulls around the time Michelle Fields was raped, murdered, and dismembered at a Trump rally and again after the Ohio loss cost Trump the Republican nomination.</p><p>As an experienced developer, Trump understands that you can’t mindlessly push all the time. You need to take the time to reload, gather your strength, and recover before launching another offensive. I assumed that’s what he’s been doing since the end of the Republican nomination.</p></div>",
  "content_text": "MJ is suspicious about the so-called “Trump Implosion” and rightfully so:\nWith all of the talk I’ve been seeing over the past week in regards to the mainstream news of Trump “imploding”, is it just me, or are the various factions of the diminishing hordes of establishment supporters getting more and more outlandish in their barbs against the campaign? How much longer will these types continue to deny the inevitable truth before they have to pivot to attempt to save their ignorant asses?\nTo wit:\n– Yes, Trump has a concern about taking things personally. I see that more as a positive than a negative. The current occupant of the Office has too much of an “I don’t give a damn” attitude, and I think that’s part of the issue we’re running into in terms of leadership.\n– The whole Khan issue. The reason it hasn’t gone away isn’t because Trump is keeping on it, it’s that the establishment handlers keep thrusting Khan back out into the spotlight to force Trump to respond. I heard a piece of an interview between Khan and Anderson Cooper from the other day, and it was clear to me that the man had no clue what he was talking about in terms of his constitutional claims. I literally felt dumber after hearing the man speak, it was that bad. The only reason Khan is even remotely relevant is that his son died in action during OIF, and that was an action supported by the D nominee, not Trump. I personally find it repulsive that they would use that status for such actions (it’s not surprising to me, however).\n– The enthusiasm gap. Last weekend, there was supposedly a big bus trip through Pennsylvania and Ohio for the D ticket. It was so huge that they had to pay people to show up in western PA, and they ended up canceling the appearance in Cleveland, both cases due to lack of interest. Meanwhile, Trump and his campaign were upset that fire marshals were capping entry to venues far below the posted capacity limits. And where he’s not being capped, they’re turning people away. It’s night and day in terms of what is being reported by the establishment versus what the ground truth is.\nI’m registered as unaffiliated where I live. I chose to be unaffiliated because the two-party system here is horribly, irrevocably broken. I understand that a lot of this traffic is meant for me to influence me into supporting the D nominee. I hate to say it, but I’m rather insulted by this attitude and approach. It’s not working. There’s nothing there for the D nominee to offer, and the choice of running mate is also a personal affront to me as an active, practicing Roman Catholic.\nI will be honest, I’m not 100% behind Trump, but it’s not for any reason from the establishment. There is a legitimate unknown with him, and that’s probably due more to my healthy skepticism of someone who is naturally outside the overall process. This is another of those once in a generation occurrences where the truth is so obvious that one would have to be a complete idiot to ignore it.\nThe conclusion I’m running into is this: Trump is the catalyst for a completely new paradigm in both American and international politics, something that we sort of started to see with the Brexit vote, even though that was focused on the UK. The opportunity his election presents is huge in terms of how things can at least attempt to rectify themselves, and that’s what gives me hope.\nI agree with the consensus that the Trumpslide is coming, especially since there’s still 95 days of campaigning to go, including 3 debates.\nMy take: everyone needs to relax about the “Trump implosion” and\nthe purported Republican revolt\n. The media is full of SJWs. And what do SJWs do? Exactly!\nThis is what a full-fledged feeding frenzy looks like.\nWith Donald Trump facing the roughest stretch of his candidacy, the media have moved from questioning his sanity to depicting a campaign in disarray and top Republicans still wondering whether they can dump the nominee.\nThat won’t happen, of course, but it’s an indication of the toxic nature of the coverage and the flood of anti-Trump leaks now washing across the media landscape.\nThere’s a natural piling-on effect when campaigns go off the rails: The polls dip, the critics step up their rhetoric, staffers start pointing fingers, and the press keeps the vicious cycle going.\nBut I’ve never seen anything like this.\nThings reached the point yesterday morning that CNBC’s John Harwood tweeted: “Longtime ally of Paul Manafort, Trump’s campaign manager: ‘Manafort not challenging Trump anymore. Mailing it in. Staff suicidal.'”\nAnd there was this from CNN: “A source tells @DanaBashCNN that some Trump campaign staff are frustrated w/ candidate lately, ‘feel like they are wasting their time.’”\nI am told by knowledgeable campaign sources that Manafort is not going anywhere and believes that Trump will be getting back on message.\nI am further told that reports of a planned “intervention” with the candidate, led by Newt Gingrich and Rudy Giuliani, are false.\nAnd the sources also say that, contrary to media reports, party chairman Reince Priebus is not furious with Trump, though he is disappointed with the nominee’s refusal to endorse Paul Ryan.\nThe Khan/Implosion narrative nothing more than the Democratic\nhasbara\nthat we’ve been seeing on this blog and others, writ large. As for the polls, I remind you of my previous assessment: they don’t mean ANYTHING until 30 days after the end of the second convention.\nIf there is no discernible Trump trend by then, it MIGHT be time to start considering the possibility of a Hillary win. In the meantime, pay no attention to the media’s attempt to establish a false narrative. Remember, they are trying to\nshape\nreality, they are not honestly reporting it.\nLet’s look at this rationally. If the media was genuinely convinced that Hillary Clinton was going to win, do you really think they would engage in this sort of mass narrative-shaping instead of triumphantly slinging insults at Republicans while victory-dancing?\nAs to how long it will be before they pivot, I would say one week after the polls start showing Trump within striking distance of Hillary again. Which should be in about one month.\nUPDATE: from the comments:\n“Ricky Vaughn 99 has suggested for months that it all starts with one push from Labor Day. He has said Trump does pushes and retreats in waves.”\nI have noticed this too. Remember there were similar lulls around the time Michelle Fields was raped, murdered, and dismembered at a Trump rally and again after the Ohio loss cost Trump the Republican nomination.\nAs an experienced developer, Trump understands that you can’t mindlessly push all the time. You need to take the time to reload, gather your strength, and recover before launching another offensive. I assumed that’s what he’s been doing since the end of the Republican nomination.",
  "tags": [
    "media",
    "politics"
  ],
  "categories": [],
  "sitemap_lastmod": "2016-08-04T16:00:00+00:00"
}