{
  "url": "https://voxday.net/2016/08/12/mailvox-sjw-narrative-sale/",
  "scraped_at": "2025-12-18T01:48:38.601213",
  "title": "Mailvox: an SJW Narrative sale",
  "date_display": "August 12, 2016",
  "date_iso": "2016-08-12T08:39:00+00:00",
  "date_from_url": "2016-08-12",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>One of the things I describe in the political philosophy bestseller <b><i><a href=\"http://amzn.to/1sBYA10\">SJWs Always Lie</a></i></b> is the way in which SJWs communicate like advertisers who are trying to sell you something. SJWs don’t talk about the world that is, but rather, the world they are trying to convince you it should be. From Chapter 2:</p><p><i>The reason SJWs are so inclined to make false assertions stems from a motivation that is very similar to that of the professional propagandist, which is the need to disregard existing reality in order to bring about the preferred alternative. In the case of the SJW-preferred reality, this nonexistent alternative is known as the Narrative. The Narrative is the story that the SJWs want to tell. It is the fiction they want you to believe; it is the reality that they want to create through the denial of the problematic reality that happens to exist at the moment.</i><br> <i><br/></i><br> A recent comment from HGL is an almost flawless example of this. Here is his attempt to reshape reality by doing what SJWs always do:</br></br></p><blockquote><p> Meh, Wright had some talent befor castalua. I think what’s telling is that although vox makes himself out to be the next big thing (constantly), his scifi posts get fewer and fewer hits and everyone ignored the hell out of him on Brad’s blog recently. No one who matters is buying it.</p></blockquote><p>Let’s count the false assertions. I get five.</p><ol><li>He implies that John Wright has less talent now than he did 36 months ago. Speaking as an 3x Hugo-nominated editor, who has read and edited the forthcoming <i>Swan Knight’s Son</i>, Mr.Wright clearly has no less talent now than he did when he published the Nebula-nominated <i>Orphans of Chaos,</i> or his excellent debut novel, <i>The Golden Age</i>. In my professional opinion, the first Moth &amp; Cobweb novel is better than the Dragon Award finalist <i>Somewhither</i>, and I expect the reviews will demonstrate that accordingly.</li><li>I do not make myself out to be “the next big thing”, much less “constantly”. I think it is entirely obvious that Mike Cernovich is the next big thing. I am content to simply continue doing what I do.</li><li>My SF-related posts do not get fewer and fewer hits. The site traffic has continued to increase; it hit 2.5 million pageviews in July and is on track to exceed 2.7 million this month. The month-to-month growth alone exceeds the total monthly traffic of most SF-related blogs.</li><li>I’m not sure what the level of interest in a single comment on someone else’s blog is supposed to indicate, but the Dragon Award finalist Dave Freer responded directly to my comment there. </li><li>There are tens of thousands of people who are buying Castalia books. All of them matter. Regardless, the key thing to note here is the appeal to those “who matter”, which is typical SJW-speak, because it permits them to disqualify everyone whose behavior falsifies their false narrative.</li></ol><p>The divergence between HGL’s Narrative and the objective, observable reality demonstrates why SJWs are so desperately unhappy, and explains why so many of them, like HGL, are mentally unstable and on various mood-altering medications. Reality is simply not what they want it to be, and so they insist on constructing their own delusional form of it, then attempt to sell others on their false Narrative.</p><p>After all, if you can convince someone else of it, then it must be true, right? As the Anonymous Conservative puts it, “their whole focus is on establishing a false reality in which everyone else is defective, and they are superior”. Here he uses the same technique of example analysis <a href=\"http://www.anonymousconservative.com/blog/liberals-amygdala-hijacks-and-how-the-amygdala-scans-ideas/\">to demonstrate SJW projection at work</a>:<br/></p><blockquote><p> Now, the analysis:<br> <i><br/></i><br> <i>“Could it be perhaps that you are out of sync with the mainstream?”</i></br></br></p><p>You will see this throughout his writings. This, to him, is exposing an amygdala bombshell. If you exposed him as “outside the mainstream,” it would elicit reflexive waves of angst, terror, and misery. For him, being on the outside is associated with agony. That is why he put this here. Remember “out-grouping,” in Touching the Raw Amygdala? This is it.</p><p>Since deep amygdala pathways are either laid through isolated, but massive and shocking stimuli, or minor, but highly repeated stimuli, and they are best inculcated in childhood instead of maturity, you can usually assume the trigger you see was most likely created repetitively, when the individual was young. Larger stimuli, or stimuli repeated enough in adulthood to burn in these pathways are far more rare, than small stimuli seen often when young.</p><p>So here, Sam was conditioned to feel aversive stimulus whenever he let himself be “outside the group.” It speaks to a childhood spent around bullies, and his coping mechanism was to try and disappear into the crowd, which was controlled by the bully. When he was under the bully, in the bully’s group, he felt safety. When the group was focused on someone else, he felt safety. If he were thrown outside the group he felt horror. The amygdala learns from precisely that type of thing. Now, that simple picture – being outside the group – is a trigger.</p><p>Once you are in that milieu, it is a small jump to realize that if you can cast someone else out of the group, and expose them to that terror, it would feel good to do it to anyone who bothered you. From there, it is a small jump to being conditioned to feel good about doing it, even to people whom you don’t really care about.</p></blockquote><p>Despite their solipsism and penchant for navel-gazing, SJWs are astonishingly unself-aware. That is why they will blithely hand you the keys to carving up their psyche, not only without hesitation, but under the delusion that they are doing devastating damage to your psychology by doing so.</p></div>",
  "content_text": "One of the things I describe in the political philosophy bestseller\nSJWs Always Lie\nis the way in which SJWs communicate like advertisers who are trying to sell you something. SJWs don’t talk about the world that is, but rather, the world they are trying to convince you it should be. From Chapter 2:\nThe reason SJWs are so inclined to make false assertions stems from a motivation that is very similar to that of the professional propagandist, which is the need to disregard existing reality in order to bring about the preferred alternative. In the case of the SJW-preferred reality, this nonexistent alternative is known as the Narrative. The Narrative is the story that the SJWs want to tell. It is the fiction they want you to believe; it is the reality that they want to create through the denial of the problematic reality that happens to exist at the moment.\nA recent comment from HGL is an almost flawless example of this. Here is his attempt to reshape reality by doing what SJWs always do:\nMeh, Wright had some talent befor castalua. I think what’s telling is that although vox makes himself out to be the next big thing (constantly), his scifi posts get fewer and fewer hits and everyone ignored the hell out of him on Brad’s blog recently. No one who matters is buying it.\nLet’s count the false assertions. I get five.\nHe implies that John Wright has less talent now than he did 36 months ago. Speaking as an 3x Hugo-nominated editor, who has read and edited the forthcoming\nSwan Knight’s Son\n, Mr.Wright clearly has no less talent now than he did when he published the Nebula-nominated\nOrphans of Chaos,\nor his excellent debut novel,\nThe Golden Age\n. In my professional opinion, the first Moth & Cobweb novel is better than the Dragon Award finalist\nSomewhither\n, and I expect the reviews will demonstrate that accordingly.\nI do not make myself out to be “the next big thing”, much less “constantly”. I think it is entirely obvious that Mike Cernovich is the next big thing. I am content to simply continue doing what I do.\nMy SF-related posts do not get fewer and fewer hits. The site traffic has continued to increase; it hit 2.5 million pageviews in July and is on track to exceed 2.7 million this month. The month-to-month growth alone exceeds the total monthly traffic of most SF-related blogs.\nI’m not sure what the level of interest in a single comment on someone else’s blog is supposed to indicate, but the Dragon Award finalist Dave Freer responded directly to my comment there.\nThere are tens of thousands of people who are buying Castalia books. All of them matter. Regardless, the key thing to note here is the appeal to those “who matter”, which is typical SJW-speak, because it permits them to disqualify everyone whose behavior falsifies their false narrative.\nThe divergence between HGL’s Narrative and the objective, observable reality demonstrates why SJWs are so desperately unhappy, and explains why so many of them, like HGL, are mentally unstable and on various mood-altering medications. Reality is simply not what they want it to be, and so they insist on constructing their own delusional form of it, then attempt to sell others on their false Narrative.\nAfter all, if you can convince someone else of it, then it must be true, right? As the Anonymous Conservative puts it, “their whole focus is on establishing a false reality in which everyone else is defective, and they are superior”. Here he uses the same technique of example analysis\nto demonstrate SJW projection at work\n:\nNow, the analysis:\n“Could it be perhaps that you are out of sync with the mainstream?”\nYou will see this throughout his writings. This, to him, is exposing an amygdala bombshell. If you exposed him as “outside the mainstream,” it would elicit reflexive waves of angst, terror, and misery. For him, being on the outside is associated with agony. That is why he put this here. Remember “out-grouping,” in Touching the Raw Amygdala? This is it.\nSince deep amygdala pathways are either laid through isolated, but massive and shocking stimuli, or minor, but highly repeated stimuli, and they are best inculcated in childhood instead of maturity, you can usually assume the trigger you see was most likely created repetitively, when the individual was young. Larger stimuli, or stimuli repeated enough in adulthood to burn in these pathways are far more rare, than small stimuli seen often when young.\nSo here, Sam was conditioned to feel aversive stimulus whenever he let himself be “outside the group.” It speaks to a childhood spent around bullies, and his coping mechanism was to try and disappear into the crowd, which was controlled by the bully. When he was under the bully, in the bully’s group, he felt safety. When the group was focused on someone else, he felt safety. If he were thrown outside the group he felt horror. The amygdala learns from precisely that type of thing. Now, that simple picture – being outside the group – is a trigger.\nOnce you are in that milieu, it is a small jump to realize that if you can cast someone else out of the group, and expose them to that terror, it would feel good to do it to anyone who bothered you. From there, it is a small jump to being conditioned to feel good about doing it, even to people whom you don’t really care about.\nDespite their solipsism and penchant for navel-gazing, SJWs are astonishingly unself-aware. That is why they will blithely hand you the keys to carving up their psyche, not only without hesitation, but under the delusion that they are doing devastating damage to your psychology by doing so.",
  "tags": [
    "anklebiters",
    "SJW"
  ],
  "categories": [],
  "sitemap_lastmod": "2016-08-12T07:39:00+00:00"
}