{
  "url": "https://voxday.net/2016/08/04/mailvox-philosophy-of-failure/",
  "scraped_at": "2025-12-18T01:47:25.700588",
  "title": "Mailvox: the philosophy of failure",
  "date_display": "August 4, 2016",
  "date_iso": "2016-08-04T11:00:00+00:00",
  "date_from_url": "2016-08-04",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>HD would like to avoid <a href=\"http://wilwheaton.net/2016/08/here-i-dreamt-i-was-an-architect-2/\">wallowing in disappointment and failure</a>:</p><blockquote><p> Will Wheaton’s latest post at his blog illustrates why I read your blog way more than I read his. It seems that every one of his blog posts is about him and his “woe-is-me” life stories. Whereas, at Vox Populi there is no Vox Day crying about how he can’t do anything, get acting jobs, or anything about his “woe-is-me.” In short, Wheaton’s blog is really just solely about him and your blog is about what’s happening in the United States and the world and not about Vox Day.</p><p>In regards to Wheaton’s latest blog post about not getting acting jobs, I’m fairly confident it is because he is a prima Donna and is probably a very high maintenance person to work with.</p><p>I get the feeling if I hired Will Wheaton for a speaking engagement I would have to hold his hand throughout the entire process, acquiescing to his demands to placate him. Whereas, if I hired you, I wouldn’t have to worry about you much. I suspect it would consist of making the arrangements in a straightforward manner with you and having you show up to do your part with little worry on my part.</p><p>Personally, I’m trying to escape the category that Will Wheaton is in. In my younger days I was that person who was that prima Donna, high a maintenance person to be friends with and be around, and now don’t have too many friends to speak of now. But I’m putting myself on a course to change that.</p><p>I appreciate the blog posts you have done about failure and writing. They’ve helped to put some things in perspective and have gotten me to think more about the course of my life.</p></blockquote><p>I had no idea what he was talking about; I didn’t even know Wil Wheaton had a blog. But I found <a href=\"http://wilwheaton.net/2016/08/here-i-dreamt-i-was-an-architect-2/\">the post to which HD was referring</a> and here is a brief summary of Wheaton’s complaints:</p><ul><li><i>We can’t seem to get our careers back where we want them. We’re both having the same frustrations and hitting the same closed doors </i></li><li><i>I couldn’t even get an audition. It’s really frustrating, and if I’m being honest, it’s depressing as fuck.</i></li><li><i>I go back and forth between giving up entirely on having on-camera work, and focusing on writing and voice acting, and working as hard as I can to get back in front of the camera</i></li><li><i>Everything I’ve been doing the last several years just isn’t working.</i></li></ul><div> It’s rather amusing to read this sort of whining, considering that I saw an episode of one of the most popular television shows in America, <i>The Big Bang Theory</i>, last night, and not only Wheaton, but even his podcast, was heavily featured. He can’t figure out how to take advantage of that?<p>Now, I don’t know if he actually has a podcast or not, but Wheaton gets far more free exposure from his modestly successful acting career than any other blogger, podcaster, or writer on the Internet. Due to that free exposure, his writing and ancillary activities get far more attention than anyone not named “Bill Simmons”. Can you even imagine Stefan Molyneux or Mike Cernovich crying about that sort of thing? I know there are still some people who are dubious about the socio-sexual hierarchy and all, but this sort of thing demonstrates how even very high levels of success and fame are not capable of filling the endless hunger for approval in some men.</p><p>Can you even imagine how Wheaton going to react once he figures out that he’s not being published because he’s got any literary talent, or has anything interesting to say, but because he’s a moderately famous actor? Does he really not realize that many people, like John Scalzi, are only “friends” with him because he happens to be of use to them at the moment?</p><p>He must, on some level, as that partially explains why he’s so desperate for more success and fame. Wheaton is afraid that if he can’t maintain his status, everyone is going to consider him to be a fraud and abandon him. But who cares if fair-weather friends abandon you? They were never worth anything from the start. Only those who stand by you in times of difficulty matter. And once you have accomplished something, no one can take that away from you.</p><p>Life is a challenge. It is a constant <i>series </i>of challenges. But what makes us feel successful is rising to meet those challenges and surmounting them. If life knocks you down and no one deigns to give you a hand up, then push yourself back to your own damn feet. If no one wants to take you by the hand and guide you along the easy path while telling you how wonderful you are, then carve out your own way, even if doing so is laborious and difficult. Trust me, it will be <i>much </i>more rewarding in the end.</p><p>You never know what challenge life will send at you next. Last night, I had the distinct pleasure of practicing with my eldest son’s new team; my veteran’s team doesn’t start until next week, and at this time of year, every team is happy to have an additional practice body. Despite my being twenty years older than everyone, it went pretty well, as I not only scored the first goal in the scrimmage but was even asked to play with them in their first team’s first friendly. Score one for the old guys!</p><p>But that’s not why I was so pleased about the practice. What made me happy, what was genuinely heart-warming, was seeing my son take the field for the first time in 21 months, run at the front of the pack during the warm-up laps, and participate in the drills and the scrimmage like the healthy young man that he is. Brainstormers know what I’m talking about. And here is the thing. During those hellish 21 months, he <i>never once</i> complained about the pain, whined about being unable to play with his team, or cried about how unfair it all was. He just soldiered on, did what he had to do to get better, and now, almost two years later, he’s back on the field again.</p><p>He’s never going to play professionally. Given the disruption in his development at a fairly critical stage, he may not even be able to play for our club’s first team like some of his former teammates are already doing. But he already feels like more of a success than Wil Wheaton ever will, because he has conquered a long and difficult challenge through faith, courage, and willpower. And I would not be more proud of him if he was signed by AC Milan tomorrow.</p><p>Do you want to stop being a prima donna? Do you want to stop being a self-pitying, high-maintenance person that no one likes to listen to or be around? Do you want to stop navel-gazing and start accomplishing something that will let you know what success feels like? Then stop thinking about what others can do for you and start thinking about what you can do for yourself and for others. The world existed before you. It will exist after you. Don’t waste whatever time you have by dwelling on your disappointments and feeling sorry for yourself.</p><p>And don’t ever worry about what other people think about you, because 99 times out of 100, they’re not thinking about you at all.</p><p>Fail faster. Then pick yourself up and move onto the next challenge. As every gamer knows, if no one is shooting at you, you’re not going in the right direction.</p></div></div>",
  "content_text": "HD would like to avoid\nwallowing in disappointment and failure\n:\nWill Wheaton’s latest post at his blog illustrates why I read your blog way more than I read his. It seems that every one of his blog posts is about him and his “woe-is-me” life stories. Whereas, at Vox Populi there is no Vox Day crying about how he can’t do anything, get acting jobs, or anything about his “woe-is-me.” In short, Wheaton’s blog is really just solely about him and your blog is about what’s happening in the United States and the world and not about Vox Day.\nIn regards to Wheaton’s latest blog post about not getting acting jobs, I’m fairly confident it is because he is a prima Donna and is probably a very high maintenance person to work with.\nI get the feeling if I hired Will Wheaton for a speaking engagement I would have to hold his hand throughout the entire process, acquiescing to his demands to placate him. Whereas, if I hired you, I wouldn’t have to worry about you much. I suspect it would consist of making the arrangements in a straightforward manner with you and having you show up to do your part with little worry on my part.\nPersonally, I’m trying to escape the category that Will Wheaton is in. In my younger days I was that person who was that prima Donna, high a maintenance person to be friends with and be around, and now don’t have too many friends to speak of now. But I’m putting myself on a course to change that.\nI appreciate the blog posts you have done about failure and writing. They’ve helped to put some things in perspective and have gotten me to think more about the course of my life.\nI had no idea what he was talking about; I didn’t even know Wil Wheaton had a blog. But I found\nthe post to which HD was referring\nand here is a brief summary of Wheaton’s complaints:\nWe can’t seem to get our careers back where we want them. We’re both having the same frustrations and hitting the same closed doors\nI couldn’t even get an audition. It’s really frustrating, and if I’m being honest, it’s depressing as fuck.\nI go back and forth between giving up entirely on having on-camera work, and focusing on writing and voice acting, and working as hard as I can to get back in front of the camera\nEverything I’ve been doing the last several years just isn’t working.\nIt’s rather amusing to read this sort of whining, considering that I saw an episode of one of the most popular television shows in America,\nThe Big Bang Theory\n, last night, and not only Wheaton, but even his podcast, was heavily featured. He can’t figure out how to take advantage of that?\nNow, I don’t know if he actually has a podcast or not, but Wheaton gets far more free exposure from his modestly successful acting career than any other blogger, podcaster, or writer on the Internet. Due to that free exposure, his writing and ancillary activities get far more attention than anyone not named “Bill Simmons”. Can you even imagine Stefan Molyneux or Mike Cernovich crying about that sort of thing? I know there are still some people who are dubious about the socio-sexual hierarchy and all, but this sort of thing demonstrates how even very high levels of success and fame are not capable of filling the endless hunger for approval in some men.\nCan you even imagine how Wheaton going to react once he figures out that he’s not being published because he’s got any literary talent, or has anything interesting to say, but because he’s a moderately famous actor? Does he really not realize that many people, like John Scalzi, are only “friends” with him because he happens to be of use to them at the moment?\nHe must, on some level, as that partially explains why he’s so desperate for more success and fame. Wheaton is afraid that if he can’t maintain his status, everyone is going to consider him to be a fraud and abandon him. But who cares if fair-weather friends abandon you? They were never worth anything from the start. Only those who stand by you in times of difficulty matter. And once you have accomplished something, no one can take that away from you.\nLife is a challenge. It is a constant\nseries\nof challenges. But what makes us feel successful is rising to meet those challenges and surmounting them. If life knocks you down and no one deigns to give you a hand up, then push yourself back to your own damn feet. If no one wants to take you by the hand and guide you along the easy path while telling you how wonderful you are, then carve out your own way, even if doing so is laborious and difficult. Trust me, it will be\nmuch\nmore rewarding in the end.\nYou never know what challenge life will send at you next. Last night, I had the distinct pleasure of practicing with my eldest son’s new team; my veteran’s team doesn’t start until next week, and at this time of year, every team is happy to have an additional practice body. Despite my being twenty years older than everyone, it went pretty well, as I not only scored the first goal in the scrimmage but was even asked to play with them in their first team’s first friendly. Score one for the old guys!\nBut that’s not why I was so pleased about the practice. What made me happy, what was genuinely heart-warming, was seeing my son take the field for the first time in 21 months, run at the front of the pack during the warm-up laps, and participate in the drills and the scrimmage like the healthy young man that he is. Brainstormers know what I’m talking about. And here is the thing. During those hellish 21 months, he\nnever once\ncomplained about the pain, whined about being unable to play with his team, or cried about how unfair it all was. He just soldiered on, did what he had to do to get better, and now, almost two years later, he’s back on the field again.\nHe’s never going to play professionally. Given the disruption in his development at a fairly critical stage, he may not even be able to play for our club’s first team like some of his former teammates are already doing. But he already feels like more of a success than Wil Wheaton ever will, because he has conquered a long and difficult challenge through faith, courage, and willpower. And I would not be more proud of him if he was signed by AC Milan tomorrow.\nDo you want to stop being a prima donna? Do you want to stop being a self-pitying, high-maintenance person that no one likes to listen to or be around? Do you want to stop navel-gazing and start accomplishing something that will let you know what success feels like? Then stop thinking about what others can do for you and start thinking about what you can do for yourself and for others. The world existed before you. It will exist after you. Don’t waste whatever time you have by dwelling on your disappointments and feeling sorry for yourself.\nAnd don’t ever worry about what other people think about you, because 99 times out of 100, they’re not thinking about you at all.\nFail faster. Then pick yourself up and move onto the next challenge. As every gamer knows, if no one is shooting at you, you’re not going in the right direction.",
  "tags": [
    "Alpha Game",
    "philosophy"
  ],
  "categories": [],
  "sitemap_lastmod": "2016-08-04T10:00:00+00:00"
}