{
  "url": "https://voxday.net/2016/08/12/pity-poor-millennials/",
  "scraped_at": "2025-12-18T01:48:40.418911",
  "title": "Pity the poor Millennials",
  "date_display": "August 12, 2016",
  "date_iso": "2016-08-12T11:00:00+00:00",
  "date_from_url": "2016-08-12",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>Literally. Generation X is often hard on the Millennials, and deservedly so. They’re soft and whiny and stupidly idealistic, and they’re susceptible to buying into the most transparent nonsense. That being said, <a href=\"http://www.thedailybeast.com/articles/2016/08/05/the-unsexy-truth-about-millennials-they-re-poor.html\">they face the most difficult economic circumstances</a> of any American generation since the so-called Greatest Generation was born into the Great Depression.</p><blockquote><p> Baby Boomers and Gen Xers still seem to find it hard to believe that basic economic math can explain much of the younger generation’s behavior.</p><p>After several news outlets, including The Daily Beast, reported that rates of millennial sexual inactivity in early adulthood are surprisingly high, armchair social theorists came out in force to blame it on everything but the fact that nearly one-third of young adults are still living at home.<br> One right-wing college news website found a way to attribute the finding to millennials’ desire for “safe spaces.”</br></p><p>Conservative New York Times columnist Ross Douthat speculated on Twitter that it was an example of the “porn paradox,” whatever that means. Others attributed it, predictably, to the effects of technology or increased anxiety. A Rutgers biological anthropologist even suggested that millennials might be too “motivated” and “ambitious” to even bother with sex.</p><p>The most likely explanation—which was mentioned in the study itself—is that parents’ basements do not make great boom boom rooms. But who needs Occam’s razor when you’re publicly opining about the behavior of an entire generation? Lower wages sending 22-year-olds back home after college isn’t nearly as sexy as complaining about porn or political correctness.</p><p>The truth is that lower wages and poverty can account for so many of the things that older generations find so mystifying about millennials.</p><p>For example, millennials drive less than their parent’s generation—and until recently, at least—were relatively uninterested in buying cars. As The Atlantic reported in 2012, this crisis prompted automakers to appoint “youth emissaries” and come up with new car colors like “techno pink” and “denim.”</p><p>But trying to make cars cooler doesn’t change the fact that, as CityLab found, there’s a significant gap in vehicle miles traveled between millenials who make over $30,000 a year and those who make less. Simply put: Cars cost money and millennials have less of it.</p><p>Millennials have also been shamed for how much they spend eating out instead of say, saving for retirement. “Millennials Are Spending an Embarrassing Amount on Brunch and Takeaway Pizza,” Vice recently declared.</p><p>It’s easy to chalk that generational difference up to some sort of narcissistic short-sightedness but the truth is probably a lot closer to fatalism: When millennials can’t save for retirement anyway, why not spring for some bottomless mimosas instead of enrolling in a 401(k)?</p></blockquote><p>Difficult circumstances don’t excuse behaving with all the foresight of a retarded chimpanzee on crack, or dying your hair blue and calling yourself a lady pony, but they do merit some degree of patience and even forbearance on our part. Since their parents, teachers, and professors all maleducated them, they’re going to need <i>someone </i>to help set them straight.</p></div>",
  "content_text": "Literally. Generation X is often hard on the Millennials, and deservedly so. They’re soft and whiny and stupidly idealistic, and they’re susceptible to buying into the most transparent nonsense. That being said,\nthey face the most difficult economic circumstances\nof any American generation since the so-called Greatest Generation was born into the Great Depression.\nBaby Boomers and Gen Xers still seem to find it hard to believe that basic economic math can explain much of the younger generation’s behavior.\nAfter several news outlets, including The Daily Beast, reported that rates of millennial sexual inactivity in early adulthood are surprisingly high, armchair social theorists came out in force to blame it on everything but the fact that nearly one-third of young adults are still living at home.\nOne right-wing college news website found a way to attribute the finding to millennials’ desire for “safe spaces.”\nConservative New York Times columnist Ross Douthat speculated on Twitter that it was an example of the “porn paradox,” whatever that means. Others attributed it, predictably, to the effects of technology or increased anxiety. A Rutgers biological anthropologist even suggested that millennials might be too “motivated” and “ambitious” to even bother with sex.\nThe most likely explanation—which was mentioned in the study itself—is that parents’ basements do not make great boom boom rooms. But who needs Occam’s razor when you’re publicly opining about the behavior of an entire generation? Lower wages sending 22-year-olds back home after college isn’t nearly as sexy as complaining about porn or political correctness.\nThe truth is that lower wages and poverty can account for so many of the things that older generations find so mystifying about millennials.\nFor example, millennials drive less than their parent’s generation—and until recently, at least—were relatively uninterested in buying cars. As The Atlantic reported in 2012, this crisis prompted automakers to appoint “youth emissaries” and come up with new car colors like “techno pink” and “denim.”\nBut trying to make cars cooler doesn’t change the fact that, as CityLab found, there’s a significant gap in vehicle miles traveled between millenials who make over $30,000 a year and those who make less. Simply put: Cars cost money and millennials have less of it.\nMillennials have also been shamed for how much they spend eating out instead of say, saving for retirement. “Millennials Are Spending an Embarrassing Amount on Brunch and Takeaway Pizza,” Vice recently declared.\nIt’s easy to chalk that generational difference up to some sort of narcissistic short-sightedness but the truth is probably a lot closer to fatalism: When millennials can’t save for retirement anyway, why not spring for some bottomless mimosas instead of enrolling in a 401(k)?\nDifficult circumstances don’t excuse behaving with all the foresight of a retarded chimpanzee on crack, or dying your hair blue and calling yourself a lady pony, but they do merit some degree of patience and even forbearance on our part. Since their parents, teachers, and professors all maleducated them, they’re going to need\nsomeone\nto help set them straight.",
  "tags": [
    "Baby Boomers",
    "economics"
  ],
  "categories": [],
  "sitemap_lastmod": "2016-08-12T10:00:00+00:00"
}