{
  "url": "https://voxday.net/2016/08/26/playing-buckley-card/",
  "scraped_at": "2025-12-18T01:50:54.664715",
  "title": "Playing the Buckley card",
  "date_display": "August 26, 2016",
  "date_iso": "2016-08-26T08:22:00+00:00",
  "date_from_url": "2016-08-26",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>No one who has read Cuckservative, or, for that matter, SJWAL, will be surprised by the reaction of the conservative opinion leaders to the rise of the Alt-Right.<br> <i><br/></i><br> <i>Erick Erickson‏@EWErickson</i><br> <i>Conservatives must again go Buckley against the alt-right.</i></br></br></br></p><p>(smiles grimly)</p><p>That which is dead can never die, though we are well assured that the cucks will try.</p><p>The problem conservatives are facing is that they can’t kick out those who have already left. This reminds me of <a href=\"http://www.milobookclub.com/2015/04/12/george-martin-baits-hook/\">one SF-SJW’s wailing about me</a>, which some of you will probably recall: <i>“How do you bring the weight of community disapproval on someone who isn’t part of the community?”</i></p><p>Answer: you don’t. You can’t. Buckley doomed the Right’s chance to preserve America by reading out the John Birch Society from the conservative movement. He and his successors have purged everyone from Sam Francis to Ann Coulter, all of the most intelligent and foresighted political writers on the Right. Now the most talented and innovative minds on the Right want absolutely nothing to do with conservatives or conservatism; we know perfectly well what they’re going to do to us whenever we choose to believe our observations instead of their dogma.</p><p>Erickson is only one of many conservatives who don’t understand that the Alt-Right doesn’t give a damn about their sacred Constitution, their 10 Kirkean principles, their small government ideology that can’t get rid of a single federal agency, their immigration amnesties, and their conservatism that hasn’t conserved so much as women’s bathrooms. We don’t want positions at their think tanks, two-minute guest slots on Fox News, or book contracts from Thomas Nelson and Regnery for tedious my-eyes-glaze-over tomes with a picture of the author and an American flag on the cover.</p><p>Every member of the Alt-Right understands one thing: none of those efforts and none of that edifice matters one iota if the USA does not remain a heavily white country, because whites, and specifically, white Americans who are the posterity of the Founders, are the only people in the history of the world who have ever supported small government and individual liberty in statistically significant numbers.</p><p>Yes, it is certainly possible for an individual, of any race, culture, or heritage, to admire and accept and adopt the ways of another people. Hollywood loves to make movies about people who do sort of thing. But the observable fact throughout all of recorded human history is that those individuals are very rare. In fact, that’s why they make movies about them. No other people, from the very numerous Chinese to the very smallest American Indian tribe, have shown <i>any </i>interest in adopting and living according to the ideals of 18th century Englishmen, the Common Law, or the Rights of Englishmen, no matter how much they enjoy, appreciate, and attempt to appropriate the fruits of that culture.</p><p>And it is the height of absurdity to believe that they will see fit to permit others to live according to them in any society that is even remotely democratic, as we have already seen from the previous waves of immigration.</p><p>As one guy rightly responded: <i>“Buckley had a nation that was 90% white, you don’t. That’s why you need to listen to us.”</i><br> <i><br/></i><br> More importantly, movement conservatives have proven, beyond any shadow of a doubt, that they will not fight for their so-called principles, not even limited government. So there is no reason to pay any attention to them at all. Whether they join Hillary Clinton and the Left in shooting at us or whether they suddenly begin playing “hello, fellow Alt-Righters”, we’re not going to follow their lead.</br></br></p></div>",
  "content_text": "No one who has read Cuckservative, or, for that matter, SJWAL, will be surprised by the reaction of the conservative opinion leaders to the rise of the Alt-Right.\nErick Erickson‏@EWErickson\nConservatives must again go Buckley against the alt-right.\n(smiles grimly)\nThat which is dead can never die, though we are well assured that the cucks will try.\nThe problem conservatives are facing is that they can’t kick out those who have already left. This reminds me of\none SF-SJW’s wailing about me\n, which some of you will probably recall:\n“How do you bring the weight of community disapproval on someone who isn’t part of the community?”\nAnswer: you don’t. You can’t. Buckley doomed the Right’s chance to preserve America by reading out the John Birch Society from the conservative movement. He and his successors have purged everyone from Sam Francis to Ann Coulter, all of the most intelligent and foresighted political writers on the Right. Now the most talented and innovative minds on the Right want absolutely nothing to do with conservatives or conservatism; we know perfectly well what they’re going to do to us whenever we choose to believe our observations instead of their dogma.\nErickson is only one of many conservatives who don’t understand that the Alt-Right doesn’t give a damn about their sacred Constitution, their 10 Kirkean principles, their small government ideology that can’t get rid of a single federal agency, their immigration amnesties, and their conservatism that hasn’t conserved so much as women’s bathrooms. We don’t want positions at their think tanks, two-minute guest slots on Fox News, or book contracts from Thomas Nelson and Regnery for tedious my-eyes-glaze-over tomes with a picture of the author and an American flag on the cover.\nEvery member of the Alt-Right understands one thing: none of those efforts and none of that edifice matters one iota if the USA does not remain a heavily white country, because whites, and specifically, white Americans who are the posterity of the Founders, are the only people in the history of the world who have ever supported small government and individual liberty in statistically significant numbers.\nYes, it is certainly possible for an individual, of any race, culture, or heritage, to admire and accept and adopt the ways of another people. Hollywood loves to make movies about people who do sort of thing. But the observable fact throughout all of recorded human history is that those individuals are very rare. In fact, that’s why they make movies about them. No other people, from the very numerous Chinese to the very smallest American Indian tribe, have shown\nany\ninterest in adopting and living according to the ideals of 18th century Englishmen, the Common Law, or the Rights of Englishmen, no matter how much they enjoy, appreciate, and attempt to appropriate the fruits of that culture.\nAnd it is the height of absurdity to believe that they will see fit to permit others to live according to them in any society that is even remotely democratic, as we have already seen from the previous waves of immigration.\nAs one guy rightly responded:\n“Buckley had a nation that was 90% white, you don’t. That’s why you need to listen to us.”\nMore importantly, movement conservatives have proven, beyond any shadow of a doubt, that they will not fight for their so-called principles, not even limited government. So there is no reason to pay any attention to them at all. Whether they join Hillary Clinton and the Left in shooting at us or whether they suddenly begin playing “hello, fellow Alt-Righters”, we’re not going to follow their lead.",
  "tags": [
    "#AltRight",
    "cuckservative"
  ],
  "categories": [],
  "sitemap_lastmod": "2016-08-26T07:22:00+00:00"
}