{
  "url": "https://voxday.net/2016/08/21/post-hugo-analysis/",
  "scraped_at": "2025-12-18T01:50:00.270966",
  "title": "Post-Hugo analysis",
  "date_display": "August 21, 2016",
  "date_iso": "2016-08-21T08:56:00+00:00",
  "date_from_url": "2016-08-21",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>First, thanks to all the Rabid Puppies who got involved, at both the nomination and the voting stages. Things went very much according to form, and we have the SF-SJWs exactly where we want them at this point in time. Observe that after only two years, we already have them voting almost entirely in reaction to us, changing and complicating their rules, and awarding SJWs instead of merit in most categories.</p><p>Second, a few observations:</p><ul><li>We were only able to burn two categories this year, but we reduced their choices to X or No Award in 5 other categories.</li><li>We got them to show the public their true colors and demonstrate that what the Hugo Award primarily means is public adherence to the SJW Narrative. Among the finalists no awarded this year: Jerry Pournelle, Larry Elmore, Toni Weisskopf, Moira Greyland, David Vandyke, Pierce Brown, and RazörFist. In most cases, the awards were given to people whose work is of observably lower quality. For example, the bestselling Pierce Brown, whose novel was not even nominated, wrote what was almost certainly, by any reasonable standard, the best science fiction novel published this year. Tough crowd, if even <i>he’s</i> not worthy of mere consideration for Best New Author.</li><li>They did have the sense to avoid no-awarding Jim Butcher for a second straight year, though. Apparently Mr. Butcher’s writing has improved a lot since last year.</li><li>They no-awarded a serious literary work about Gene Wolfe. Remember, these are the same people that have repeatedly claimed<i> a blog post </i>was “the Best Related Work” in science fiction that year. The contrast is informative.</li><li>The four fiction categories are increasingly becoming No White Male territory. The winners were: black woman, black woman, Asian woman, white woman, none of whom are bestselling or even very well-known authors. This is reliably indicative of increasing irrelevance. It won’t be long before simply being a minority won’t be enough and authors will have to be gay, blind, and crippled just to be nominated.</li><li>Contra all their unconvincing pretenses of delight, the nomination of “Space Raptor Butt Invasion” embarrassed them greatly. Chuck Tingle’s masterpiece was no-awarded, exactly as I predicted.</li><li>We played kingmaker in Best Dramatic Presentation, Long Form, where The Martian beat Fury Road, and in the John W. Campbell Award, where Andy Weir beat Alyssa Wong, thanks to our votes. And, of course, in Best Novel, where Jemisin’s win was primarily a vote against us.</li><li>Neil Gaiman’s acceptance was, characteristically, as classy as the man’s himself. <i>“It meant a lot to see Sandman Overture nominated for a Hugo award, and was disappointing to see that it had been dragged into the unfortunate mess that the pitiable people who call themselves Puppy had attempted to inflict on Worldcon and its awards. I would have withdrawn it from consideration, but even that seemed like it would have been giving these sad losers too much acknowledgement. I am proud it won, and prouder by far of the amazing work that JH Williams, Dave Stewart, Todd Klein, Dave McKean and Shelly Bond did. Thank you.”</i></li><li>It’s interesting to note that SJWs aren’t celebrating the fact that more of the awards went to women this year than ever before, including all of the fiction categories.</li></ul><p>All in all, despite the twin disappointments of Jerry Pournelle and Chuck Tingle not winning their categories, 2016 was a very good year; arguably better, from the strategic perspective, than last year’s results. The <i>Guardian</i>‘s <a href=\"https://www.theguardian.com/books/2016/aug/21/hugo-awards-winners-nk-jemisin-sad-rabid-puppies?CMP=twt_gu\">coverage of the awards</a> is a pretty good summary for the SJW perspective. They still have no idea what’s going on:</p><blockquote class=\"tr_bq\"><p> The winners of the 2016 Hugo awards have been announced, with this year’s choices signalling a resounding defeat for the so-called “Puppies” campaigns to derail the venerable annual honouring of science fiction literature and drama. As in previous years, there had been attempts by two separate groups, the Sad Puppies and the Rabid Puppies, to “game” the awards in favour of their preferred slates of works. Both groups claimed that science fiction has become dominated by a liberal, left-wing bias.</p></blockquote><p>It’s complete with a picture of the award-winning half-savage herself. It’s quite clear most of these people cheering her Best Novel award have never read even a little of <i>The Fifth Season</i>, which makes George Martin’s masterpiece of rape, death, and grimdark look cheerful and features a protagonist less likeable than Rand al’Thor and Ramsay Bolton combined.</p><p>As one reviewer of the 2016 Best Novel put it: <i>“the main character became more and more unlikable as the tale goes on. She ends up in a gay/poly triad, has a child with the gay member of the group, and then essentially decides she’s not cut out to be a mother and goes on and on about how she doesn’t really care about the toddler, ditching him. All of this after a main hook where she’s supposed to be frantically searching for yet another child who she seems for forget for years at a time.”</i></p><p>That pretty well sums it up. <i>Redshirts </i>and <i>Among Others</i> were mediocrities, but <i>The Fifth Season</i> is a depth no Best Novel has seen since <i>The Quantum Rose</i> won the Nebula in 2000. The Impossibility of SJW Convergence is increasingly working in our favor. It won’t be long it won’t even need our paws on the scale to help the process along.</p><p>The <i>Guardian </i>claims 2016 was “a resounding defeat” for the Rabid Puppies, but then, they are an SJW institution and we know what SJWs always do. Consider a relatively neutral party’s verdict, <a href=\"https://therev3.blogspot.com/2016/04/reduxing-vox-day-post-nomination.html\">as declared back in April</a>, by the Reverend 3.0.</p><p><i>If any other Castalia House work wins Best Related Work or second places to No Award, then the Rabid Puppies have obtained limited victory over the Hugos</i><br> <u><br/></u><br> <u>Best Related Work</u><br> 1. No Award<br> 2. <i>Between Light and Shadow: An Exploration of the Fiction of Gene Wolfe, 1951 to 1986</i>, Marc Aramini, Castalia House</br></br></br></br></p><p>“A limited victory”. That is a fair description.</p><p>We had over 200 people at the Rabid Puppy Hugo Party last night, which featured Dragon Award finalists John C. Wright, Nick Cole, and Brian Niemeier, as well as Hugo Award finalist Jeffro Johnson, and I think it’s fair to say that a good time was had by most, if not all. One attendee even wrote to express his enjoyment of it.</p><blockquote class=\"tr_bq\"><p> Thank you for hosting The 2016 Hugo Awards this evening, which doubled as a most excellent and informative SFF convention panel. No one signaled virtue, no one posed, all was honest and free. I’ve never had the pleasure of witnessing a panel of guests quite like these before.</p></blockquote></div>",
  "content_text": "First, thanks to all the Rabid Puppies who got involved, at both the nomination and the voting stages. Things went very much according to form, and we have the SF-SJWs exactly where we want them at this point in time. Observe that after only two years, we already have them voting almost entirely in reaction to us, changing and complicating their rules, and awarding SJWs instead of merit in most categories.\nSecond, a few observations:\nWe were only able to burn two categories this year, but we reduced their choices to X or No Award in 5 other categories.\nWe got them to show the public their true colors and demonstrate that what the Hugo Award primarily means is public adherence to the SJW Narrative. Among the finalists no awarded this year: Jerry Pournelle, Larry Elmore, Toni Weisskopf, Moira Greyland, David Vandyke, Pierce Brown, and RazörFist. In most cases, the awards were given to people whose work is of observably lower quality. For example, the bestselling Pierce Brown, whose novel was not even nominated, wrote what was almost certainly, by any reasonable standard, the best science fiction novel published this year. Tough crowd, if even\nhe’s\nnot worthy of mere consideration for Best New Author.\nThey did have the sense to avoid no-awarding Jim Butcher for a second straight year, though. Apparently Mr. Butcher’s writing has improved a lot since last year.\nThey no-awarded a serious literary work about Gene Wolfe. Remember, these are the same people that have repeatedly claimed\na blog post\nwas “the Best Related Work” in science fiction that year. The contrast is informative.\nThe four fiction categories are increasingly becoming No White Male territory. The winners were: black woman, black woman, Asian woman, white woman, none of whom are bestselling or even very well-known authors. This is reliably indicative of increasing irrelevance. It won’t be long before simply being a minority won’t be enough and authors will have to be gay, blind, and crippled just to be nominated.\nContra all their unconvincing pretenses of delight, the nomination of “Space Raptor Butt Invasion” embarrassed them greatly. Chuck Tingle’s masterpiece was no-awarded, exactly as I predicted.\nWe played kingmaker in Best Dramatic Presentation, Long Form, where The Martian beat Fury Road, and in the John W. Campbell Award, where Andy Weir beat Alyssa Wong, thanks to our votes. And, of course, in Best Novel, where Jemisin’s win was primarily a vote against us.\nNeil Gaiman’s acceptance was, characteristically, as classy as the man’s himself.\n“It meant a lot to see Sandman Overture nominated for a Hugo award, and was disappointing to see that it had been dragged into the unfortunate mess that the pitiable people who call themselves Puppy had attempted to inflict on Worldcon and its awards. I would have withdrawn it from consideration, but even that seemed like it would have been giving these sad losers too much acknowledgement. I am proud it won, and prouder by far of the amazing work that JH Williams, Dave Stewart, Todd Klein, Dave McKean and Shelly Bond did. Thank you.”\nIt’s interesting to note that SJWs aren’t celebrating the fact that more of the awards went to women this year than ever before, including all of the fiction categories.\nAll in all, despite the twin disappointments of Jerry Pournelle and Chuck Tingle not winning their categories, 2016 was a very good year; arguably better, from the strategic perspective, than last year’s results. The\nGuardian\n‘s\ncoverage of the awards\nis a pretty good summary for the SJW perspective. They still have no idea what’s going on:\nThe winners of the 2016 Hugo awards have been announced, with this year’s choices signalling a resounding defeat for the so-called “Puppies” campaigns to derail the venerable annual honouring of science fiction literature and drama. As in previous years, there had been attempts by two separate groups, the Sad Puppies and the Rabid Puppies, to “game” the awards in favour of their preferred slates of works. Both groups claimed that science fiction has become dominated by a liberal, left-wing bias.\nIt’s complete with a picture of the award-winning half-savage herself. It’s quite clear most of these people cheering her Best Novel award have never read even a little of\nThe Fifth Season\n, which makes George Martin’s masterpiece of rape, death, and grimdark look cheerful and features a protagonist less likeable than Rand al’Thor and Ramsay Bolton combined.\nAs one reviewer of the 2016 Best Novel put it:\n“the main character became more and more unlikable as the tale goes on. She ends up in a gay/poly triad, has a child with the gay member of the group, and then essentially decides she’s not cut out to be a mother and goes on and on about how she doesn’t really care about the toddler, ditching him. All of this after a main hook where she’s supposed to be frantically searching for yet another child who she seems for forget for years at a time.”\nThat pretty well sums it up.\nRedshirts\nand\nAmong Others\nwere mediocrities, but\nThe Fifth Season\nis a depth no Best Novel has seen since\nThe Quantum Rose\nwon the Nebula in 2000. The Impossibility of SJW Convergence is increasingly working in our favor. It won’t be long it won’t even need our paws on the scale to help the process along.\nThe\nGuardian\nclaims 2016 was “a resounding defeat” for the Rabid Puppies, but then, they are an SJW institution and we know what SJWs always do. Consider a relatively neutral party’s verdict,\nas declared back in April\n, by the Reverend 3.0.\nIf any other Castalia House work wins Best Related Work or second places to No Award, then the Rabid Puppies have obtained limited victory over the Hugos\nBest Related Work\n1. No Award\n2.\nBetween Light and Shadow: An Exploration of the Fiction of Gene Wolfe, 1951 to 1986\n, Marc Aramini, Castalia House\n“A limited victory”. That is a fair description.\nWe had over 200 people at the Rabid Puppy Hugo Party last night, which featured Dragon Award finalists John C. Wright, Nick Cole, and Brian Niemeier, as well as Hugo Award finalist Jeffro Johnson, and I think it’s fair to say that a good time was had by most, if not all. One attendee even wrote to express his enjoyment of it.\nThank you for hosting The 2016 Hugo Awards this evening, which doubled as a most excellent and informative SFF convention panel. No one signaled virtue, no one posed, all was honest and free. I’ve never had the pleasure of witnessing a panel of guests quite like these before.",
  "tags": [
    "Hugo Award",
    "Puppies"
  ],
  "categories": [],
  "sitemap_lastmod": "2016-08-21T07:56:00+00:00"
}