{
  "url": "https://voxday.net/2016/08/18/prescription-for-africa/",
  "scraped_at": "2025-12-18T01:49:32.809910",
  "title": "A prescription for Africa",
  "date_display": "August 18, 2016",
  "date_iso": "2016-08-18T08:29:00+00:00",
  "date_from_url": "2016-08-18",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>Peter Grant provides <a href=\"https://bayourenaissanceman.blogspot.com/2016/08/intelligence-international-aid-workers.html\">his thoughts on aiding Africa</a>:</p><blockquote><p> Based on my extensive experience of Africa, I suggest there are two – and only two – ways in which Western aid should be focused in the short term.  The first is education.  Teach people the basics of how to think, how to use their brains – and do so in a way that is tailored to their current levels of intelligence.  Don’t expect a teenager with an IQ of 70 to function at the same level as someone with an IQ of 100.  He must be taught things he can do – and at which he can succeed – that are commensurate with where he’s at right now.  That way, he won’t get discouraged and abandon his studies.  He can be set tasks that grow progressively more complex and more difficult, but not at a level he can’t master.  His children will go further, and his children’s children further still . . . but he won’t.  He can’t.  That’s the brutal reality of the situation.</p><p>The second way in which aid can be useful is in providing basic infrastructure that is operable, and maintainable, and sustainable, by people in the IQ range we’ve discussed.  Examples:</p><ul><li>It’s pointless giving them a complex engine-powered pump to bring up water from a well if they aren’t capable of maintaining it.  Rather give them a hand-operated pump, one they can understand, and which they can repair themselves if it breaks down.  It’s more and harder work to use it, but it’s also more practicable for them.  When it comes to health care, providing mosquito nets and clean water and hygiene education is far more important than providing anti-AIDS drug cocktails.  Sure, without the latter, people will die;  but without the former, many more people will die. Invest limited resources where they’ll do the most good for the greatest number.  Yes, that means some people will be condemned to die.  That’s economic and cultural reality in Africa.  Live with it.</li><li>I’ve seen several entrepreneurs in Africa take discarded Western high technology, ‘dumb it down’, and use it with great success.  Example:  pedal-powered washing machines (which we’ve discussed here before).  Old, broken-down automatic washing machines are connected to good old-fashioned bicycles mounted on frames, using drive belts made from locally-produced leather or cloth.  Result;  the pedalers earn a living, local women can wash their clothes much faster and more conveniently than taking them down to the local river (where they’re frequently preyed on by crocodiles), and the entrepreneur who put the whole idea together becomes a Big Man in the local economy – and is able to use his profits for other useful economic ideas.  Moral of the story:  find individuals with that sort of entrepreneurial drive, and help them.  That aid will ‘trickle down’ into the local community and benefit everyone.</li><li>The corollary to the above is that aid must not – repeat, must not – be given to government officials and bureaucrats who’ll siphon it off into their own pockets.  Corruption, nepotism and dishonesty are not just rife in Africa – they’re a way of life.  Tragically, too many agencies and large aid organizations (all of which should know better) are willing to let dishonest governments and bureaucrats handle aid money, so as not to offend local sensibilities or be seen as ‘neo-colonial’ in their attitudes.  Worse, some of them openly bribe governments and bureaucrats, figuring that it’s better to do that in order to ensure that at least some of the aid they provide reaches those for whom it’s intended.  Often that proportion is ten per cent or less – the rest lines venal pockets further up the food chain.</li><li>Finally, aid must be distributed in a way that is accountable.  Money and supplies must be accounted for when they arrive, while being sent to their final destination, and upon delivery.  The way they’re used must be monitored, and any discrepancy must result in disciplinary action – i.e. the withholding of further aid from the miscreant(s) involved.  There can be no blind acceptance of someone’s bona fides unless their actions match their words.  There can be no resigned, shoulder-shrugging acceptance of ‘shrinkage’ without a major effort to minimize losses.  If that isn’t done, the venality of Africa will soon ensure that most (if not all) of the aid sent is diverted into fat-cat pockets.  (How do you think Mobutu Sese Seko, President of Zaire, managed to embezzle between $4 billion and $15 billion during his time in power?  It sure wasn’t his salary!)</li></ul><p>There is a third way in which aid might be profitably spent – but it’ll never fly, because it’s 100% politically incorrect.  That way would be to hire mercenaries – probably former servicemen from Western armies and their allies – to pacify an area, ensuring that aid workers can operate safely and without coercion.  They can raise and train a local militia if responsible individuals can be found, but that’s unlikely at first.  It’ll be more important for them to proactively attack local thugs and gangs.  That’ll be an object lesson to everybody – “Get with the program, or get dead!”  In an environment where life is so cheap, and atrocities are everyday occurrences, that’s probably the only way in which this could work.  However, the reaction to that by liberals and progressives would be so outraged that, as I said, this idea will never fly.</p></blockquote><p>While I agree with Peter’s diagnosis, I don’t agree with his prescription. Education will not change one single damn thing in Africa because it cannot. The intelligence gap between Europe and Africa is genetic and only several centuries of <i>ruthless </i>eugenics will raise the average intelligence of the latter continent. In fact, despite more people being more educated than ever before, the dysgenic social structure of both the European nations and the USA has already reduced their average intelligence levels; the gap is being reduced, but by lowering the average intelligence levels in Europe and the USA.</p><p>That is why we are seeing the Western countries gradually start resembling the better third-world countries. Over time, they will start to resemble Africa, and similar behavioral patterns will begin to exert themselves. The only good news, if it can be described as that, is that the Western warlords of the future will likely be considerably smarter than their African counterparts, so perhaps there will be the occasional Singapore that can serve as the core of a new high-IQ civilization.</p><p>And since  the current population explosion in Africa is almost certainly dysgenic, I expect that the average intelligence will actually decline in Africa and the situation will get even worse there, with widespread cannibalism and other practices even more depraved and demonic than <i>mutu </i>beginning to appear.</p><p>The more I look at the global situation, the more I am convinced that those in the 1980s who thought Japan and China would dominate the world were correct, they were simply about 100 years early. The fall of the Soviet Union was not the triumph of Western liberal democracy, it was its last chance, but instead of taking that chance, the liberal democracies slashed their own throats. Yes, Japan and China are both economic disasters, but they are still smart, homogeneous nations and they will bounce right back from the next economic crash. Most of the nations of the West are not, and therefore they will not be able to do so.</p><p>That, I think, is why China is biding its time. It has no need to defeat the USA. It need only wait and let the USA finish destroying itself.</p></div>",
  "content_text": "Peter Grant provides\nhis thoughts on aiding Africa\n:\nBased on my extensive experience of Africa, I suggest there are two – and only two – ways in which Western aid should be focused in the short term.  The first is education.  Teach people the basics of how to think, how to use their brains – and do so in a way that is tailored to their current levels of intelligence.  Don’t expect a teenager with an IQ of 70 to function at the same level as someone with an IQ of 100.  He must be taught things he can do – and at which he can succeed – that are commensurate with where he’s at right now.  That way, he won’t get discouraged and abandon his studies.  He can be set tasks that grow progressively more complex and more difficult, but not at a level he can’t master.  His children will go further, and his children’s children further still . . . but he won’t.  He can’t.  That’s the brutal reality of the situation.\nThe second way in which aid can be useful is in providing basic infrastructure that is operable, and maintainable, and sustainable, by people in the IQ range we’ve discussed.  Examples:\nIt’s pointless giving them a complex engine-powered pump to bring up water from a well if they aren’t capable of maintaining it.  Rather give them a hand-operated pump, one they can understand, and which they can repair themselves if it breaks down.  It’s more and harder work to use it, but it’s also more practicable for them.  When it comes to health care, providing mosquito nets and clean water and hygiene education is far more important than providing anti-AIDS drug cocktails.  Sure, without the latter, people will die;  but without the former, many more people will die. Invest limited resources where they’ll do the most good for the greatest number.  Yes, that means some people will be condemned to die.  That’s economic and cultural reality in Africa.  Live with it.\nI’ve seen several entrepreneurs in Africa take discarded Western high technology, ‘dumb it down’, and use it with great success.  Example:  pedal-powered washing machines (which we’ve discussed here before).  Old, broken-down automatic washing machines are connected to good old-fashioned bicycles mounted on frames, using drive belts made from locally-produced leather or cloth.  Result;  the pedalers earn a living, local women can wash their clothes much faster and more conveniently than taking them down to the local river (where they’re frequently preyed on by crocodiles), and the entrepreneur who put the whole idea together becomes a Big Man in the local economy – and is able to use his profits for other useful economic ideas.  Moral of the story:  find individuals with that sort of entrepreneurial drive, and help them.  That aid will ‘trickle down’ into the local community and benefit everyone.\nThe corollary to the above is that aid must not – repeat, must not – be given to government officials and bureaucrats who’ll siphon it off into their own pockets.  Corruption, nepotism and dishonesty are not just rife in Africa – they’re a way of life.  Tragically, too many agencies and large aid organizations (all of which should know better) are willing to let dishonest governments and bureaucrats handle aid money, so as not to offend local sensibilities or be seen as ‘neo-colonial’ in their attitudes.  Worse, some of them openly bribe governments and bureaucrats, figuring that it’s better to do that in order to ensure that at least some of the aid they provide reaches those for whom it’s intended.  Often that proportion is ten per cent or less – the rest lines venal pockets further up the food chain.\nFinally, aid must be distributed in a way that is accountable.  Money and supplies must be accounted for when they arrive, while being sent to their final destination, and upon delivery.  The way they’re used must be monitored, and any discrepancy must result in disciplinary action – i.e. the withholding of further aid from the miscreant(s) involved.  There can be no blind acceptance of someone’s bona fides unless their actions match their words.  There can be no resigned, shoulder-shrugging acceptance of ‘shrinkage’ without a major effort to minimize losses.  If that isn’t done, the venality of Africa will soon ensure that most (if not all) of the aid sent is diverted into fat-cat pockets.  (How do you think Mobutu Sese Seko, President of Zaire, managed to embezzle between $4 billion and $15 billion during his time in power?  It sure wasn’t his salary!)\nThere is a third way in which aid might be profitably spent – but it’ll never fly, because it’s 100% politically incorrect.  That way would be to hire mercenaries – probably former servicemen from Western armies and their allies – to pacify an area, ensuring that aid workers can operate safely and without coercion.  They can raise and train a local militia if responsible individuals can be found, but that’s unlikely at first.  It’ll be more important for them to proactively attack local thugs and gangs.  That’ll be an object lesson to everybody – “Get with the program, or get dead!”  In an environment where life is so cheap, and atrocities are everyday occurrences, that’s probably the only way in which this could work.  However, the reaction to that by liberals and progressives would be so outraged that, as I said, this idea will never fly.\nWhile I agree with Peter’s diagnosis, I don’t agree with his prescription. Education will not change one single damn thing in Africa because it cannot. The intelligence gap between Europe and Africa is genetic and only several centuries of\nruthless\neugenics will raise the average intelligence of the latter continent. In fact, despite more people being more educated than ever before, the dysgenic social structure of both the European nations and the USA has already reduced their average intelligence levels; the gap is being reduced, but by lowering the average intelligence levels in Europe and the USA.\nThat is why we are seeing the Western countries gradually start resembling the better third-world countries. Over time, they will start to resemble Africa, and similar behavioral patterns will begin to exert themselves. The only good news, if it can be described as that, is that the Western warlords of the future will likely be considerably smarter than their African counterparts, so perhaps there will be the occasional Singapore that can serve as the core of a new high-IQ civilization.\nAnd since  the current population explosion in Africa is almost certainly dysgenic, I expect that the average intelligence will actually decline in Africa and the situation will get even worse there, with widespread cannibalism and other practices even more depraved and demonic than\nmutu\nbeginning to appear.\nThe more I look at the global situation, the more I am convinced that those in the 1980s who thought Japan and China would dominate the world were correct, they were simply about 100 years early. The fall of the Soviet Union was not the triumph of Western liberal democracy, it was its last chance, but instead of taking that chance, the liberal democracies slashed their own throats. Yes, Japan and China are both economic disasters, but they are still smart, homogeneous nations and they will bounce right back from the next economic crash. Most of the nations of the West are not, and therefore they will not be able to do so.\nThat, I think, is why China is biding its time. It has no need to defeat the USA. It need only wait and let the USA finish destroying itself.",
  "tags": [
    "decline and fall",
    "Vibrancy is our strength"
  ],
  "categories": [],
  "sitemap_lastmod": "2016-08-18T07:29:00+00:00"
}