{
  "url": "https://voxday.net/2016/08/15/reality-tv-and-fall-of-civilization/",
  "scraped_at": "2025-12-18T01:49:04.065170",
  "title": "Reality TV and the fall of civilization",
  "date_display": "August 15, 2016",
  "date_iso": "2016-08-15T08:58:00+00:00",
  "date_from_url": "2016-08-15",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>James Delingpole observes that troglodyte culture matters even to the highbrow, because politics is downstream of culture, <a href=\"http://www.spectator.co.uk/2016/08/christopher-biggins-and-the-fall-of-civilisation/\">in <i>The Spectator</i></a>:</p><blockquote><p> ‘But why do you even care about this crap?’ people sometimes ask me. They’re the same sort of people who, were they living in Rome circa 476, would be congratulating themselves on how bloody marvellous aqueducts and hypocausts and testudo formations are. Yes indeed. But that was then and unfortunately we’re living in now. The barbarians are through the gates, imposing their weird, alien values, but the forces of civilisation are holding their noses and looking the other way because they find modern culture so vulgar, ugly and incomprehensible.</p><p>What I think should trouble us most about the Biggins eviction is the perverse moral inversion it represents. Instead of inhabiting a universe where sticks and stones may break our bones but words can never hurt us, we’ve been ushered into one where the language you use carries more weight than the way you behave. As a writer and English literature graduate I ought to be delighted by this — except that the new rule seems to have been invented by incredibly thick people with no sense of tone, nuance or context.</p><p>At the time of the Leveson inquiry, there were lots of wise, nicely turned, historically literate articles in civilised journals about the importance of free speech and how defending it must of necessity include protecting the right to offend. The problem is that the only people who read them were clever, sensible, well-balanced types like us. Unfortunately, we’re not the ones who make the rules.</p><p>Why do you think the Big Brother bosses axed Biggins? They’re rather less concerned about what Mick Hume, Claire Fox, Douglas Murray or Nick Cohen might write in an erudite essay on the significance of <i>Areopagitica </i>and the importance of ‘Wilkes and Liberty’ than they are about what a noisy minority of pigshit-thick but Taleban-zealous social justice warriors might say on social media.</p></blockquote><p>This is why it matters when the Hugo Awards anoint mediocre SJW detritus as the best that the field has to offer. This is why it matters that we tear down the gatekeepers, we tear down the SJW-infested institutions, and we replace them with new ones. This is why it matters when even people we despise are attacked by those who seek to control them and us, and why it is important for us to defend them regardless of how we might feel about them.</p><p>Delingpole understands this, but then, he is demonstrably well-read on the subject.</p><blockquote class=\"tr_bq\"><p> How do we resist this loathsome trend? Well, the first step is to acknowledge that it’s happening; and the second is to create a stink. I’d highly recommend reading Vox Day’s <i><a href=\"http://amzn.to/1sBYA10\">SJWs Always Lie</a></i>, which outlines how these activists operate (‘point and shriek’, ‘isolate and swarm’) and then describes how to defeat them. Absolutely key is refusing to let these malign professional grievance-mongers set the terms of the debate.</p></blockquote><p>And we’re not. Read the whole thing. Have you noticed that the Alt-Right is beginning to drive the public discourse on a few small issues here and there? That’s just the start. The mainstream media is on its heels, forced to respond to the issues that are being raised by a new generation of social media that is filling the role that AM talk radio once did. The difference is that while the talk radio guys were still subject to gatekeepers in the form of station owners and the FCC, we are only limited by the <i>potential </i>biases of Twitter, Facebook, and Google. Also, an AM signal doesn’t carry very far, but the Internet reaches to the ends of the Earth.</p></div>",
  "content_text": "James Delingpole observes that troglodyte culture matters even to the highbrow, because politics is downstream of culture,\nin\nThe Spectator\n:\n‘But why do you even care about this crap?’ people sometimes ask me. They’re the same sort of people who, were they living in Rome circa 476, would be congratulating themselves on how bloody marvellous aqueducts and hypocausts and testudo formations are. Yes indeed. But that was then and unfortunately we’re living in now. The barbarians are through the gates, imposing their weird, alien values, but the forces of civilisation are holding their noses and looking the other way because they find modern culture so vulgar, ugly and incomprehensible.\nWhat I think should trouble us most about the Biggins eviction is the perverse moral inversion it represents. Instead of inhabiting a universe where sticks and stones may break our bones but words can never hurt us, we’ve been ushered into one where the language you use carries more weight than the way you behave. As a writer and English literature graduate I ought to be delighted by this — except that the new rule seems to have been invented by incredibly thick people with no sense of tone, nuance or context.\nAt the time of the Leveson inquiry, there were lots of wise, nicely turned, historically literate articles in civilised journals about the importance of free speech and how defending it must of necessity include protecting the right to offend. The problem is that the only people who read them were clever, sensible, well-balanced types like us. Unfortunately, we’re not the ones who make the rules.\nWhy do you think the Big Brother bosses axed Biggins? They’re rather less concerned about what Mick Hume, Claire Fox, Douglas Murray or Nick Cohen might write in an erudite essay on the significance of\nAreopagitica\nand the importance of ‘Wilkes and Liberty’ than they are about what a noisy minority of pigshit-thick but Taleban-zealous social justice warriors might say on social media.\nThis is why it matters when the Hugo Awards anoint mediocre SJW detritus as the best that the field has to offer. This is why it matters that we tear down the gatekeepers, we tear down the SJW-infested institutions, and we replace them with new ones. This is why it matters when even people we despise are attacked by those who seek to control them and us, and why it is important for us to defend them regardless of how we might feel about them.\nDelingpole understands this, but then, he is demonstrably well-read on the subject.\nHow do we resist this loathsome trend? Well, the first step is to acknowledge that it’s happening; and the second is to create a stink. I’d highly recommend reading Vox Day’s\nSJWs Always Lie\n, which outlines how these activists operate (‘point and shriek’, ‘isolate and swarm’) and then describes how to defeat them. Absolutely key is refusing to let these malign professional grievance-mongers set the terms of the debate.\nAnd we’re not. Read the whole thing. Have you noticed that the Alt-Right is beginning to drive the public discourse on a few small issues here and there? That’s just the start. The mainstream media is on its heels, forced to respond to the issues that are being raised by a new generation of social media that is filling the role that AM talk radio once did. The difference is that while the talk radio guys were still subject to gatekeepers in the form of station owners and the FCC, we are only limited by the\npotential\nbiases of Twitter, Facebook, and Google. Also, an AM signal doesn’t carry very far, but the Internet reaches to the ends of the Earth.",
  "tags": [
    "media",
    "SJW"
  ],
  "categories": [],
  "sitemap_lastmod": "2016-08-15T07:58:00+00:00"
}