{
  "url": "https://voxday.net/2016/08/27/red-hot-babymeta/",
  "scraped_at": "2025-12-18T01:51:07.184287",
  "title": "Red hot Babymetal",
  "date_display": "August 27, 2016",
  "date_iso": "2016-08-27T12:00:00+00:00",
  "date_from_url": "2016-08-27",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p><i>Mighty Japanese metal act BABYMETAL have been tapped as the unlikely — but very cool — special guests for Red Hot Chili Peppers’ upcoming UK tour. The three-piece, who released their Metal Resistance album this past spring, will open a string of dates in early December, including shows in London, Glasgow, and Manchester.</i></p><div style=\"text-align: left;\"> It wouldn’t surprise me if this was a rehash of the Lollapalooza at which Psykosonik was supposed to play on the second stage – we didn’t because Paul got lost on the way to the concert – where Ministry blew the Chili Peppers off the stage. Even in a small venue, Babymetal was one of the more entertaining bands I’ve seen live. And their instrumentalists are no joke.</div><div style=\"text-align: center;\"></div><div style=\"text-align: center;\"> <iframe allowfullscreen=\"\" frameborder=\"0\" height=\"288\" src=\"https://www.youtube.com/embed/TZRvO0S-TLU\" width=\"512\"></iframe></div><p>They certainly also appear to have all their Illuminati-symbolism down, though whether it is knowingly purposeful or merely the usual Japanese imitation of mysterious Western customs, I cannot say, but it is so flawless that I assume the former. And yes, upon further review, this explains it: <i>“The choreographer Mikiko of groups like Babymetal and Perfume is actually involved in the 2016 Olympics. Because Japan has a small part in the closing ceremony.”</i></p></div>",
  "content_text": "Mighty Japanese metal act BABYMETAL have been tapped as the unlikely — but very cool — special guests for Red Hot Chili Peppers’ upcoming UK tour. The three-piece, who released their Metal Resistance album this past spring, will open a string of dates in early December, including shows in London, Glasgow, and Manchester.\nIt wouldn’t surprise me if this was a rehash of the Lollapalooza at which Psykosonik was supposed to play on the second stage – we didn’t because Paul got lost on the way to the concert – where Ministry blew the Chili Peppers off the stage. Even in a small venue, Babymetal was one of the more entertaining bands I’ve seen live. And their instrumentalists are no joke.\nThey certainly also appear to have all their Illuminati-symbolism down, though whether it is knowingly purposeful or merely the usual Japanese imitation of mysterious Western customs, I cannot say, but it is so flawless that I assume the former. And yes, upon further review, this explains it:\n“The choreographer Mikiko of groups like Babymetal and Perfume is actually involved in the 2016 Olympics. Because Japan has a small part in the closing ceremony.”",
  "tags": [],
  "categories": [],
  "sitemap_lastmod": "2016-08-27T11:00:00+00:00"
}