{
  "url": "https://voxday.net/2016/08/06/rod-walker-castalia-author/",
  "scraped_at": "2025-12-18T01:47:43.390622",
  "title": "Rod Walker, Castalia author",
  "date_display": "August 6, 2016",
  "date_iso": "2016-08-06T11:47:00+00:00",
  "date_from_url": "2016-08-06",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>I have been inexcusably remiss in failing to put <a href=\"http://www.rodwalkersf.com/2016/07/02/nontraditional-publisher/\">Rod Walker’s site</a> on the list of Castalia Author’s on the right sidebar. He not only has a blog, but it’s an interesting one, complete with links to reviews of his first book with Castalia as well as his reviews of other books, such as Peter Grant’s Western, <i><b><a href=\"http://amzn.to/28XFZCM\">Brings the Lightning</a></b></i>.</p><blockquote><p> Rod Walker says he enjoyed working with Castalia House to bring out MUTINY IN SPACE, and found it an excellent experience in all respects. In previous careers, RW dealt with several traditional publishers and a few small presses, and never found it an enjoyable experience, a marked contrast to his adventure with Castalia House. For all his low opinion of traditional publishers, RW thinks it is better to classify Castalia House as a “nontraditional” publisher. The Internet has made traditional publishing obsolete as a mode of organization, just as the rise of mass industry made the craft guild system obsolete as a method of economic production….</p><p>So the way forward for publishers, in RW’s opinion, is to abandon the gatekeeper function and instead become “nontraditional” publishers – that is, curators who seek out specific kinds of excellence. RW thinks that John C. Wright’s books SOMEWHITHER and IRON CHAMBER OF MEMORY are superb fantasy novels, and in all probability these books would never have been published without Castalia, just as Jerry Pournelle’s THERE WILL BE WAR series would never have been revived.</p></blockquote><p>I’m delighted to hear that Rod enjoyed working with us, as we’re very pleased to be working with him. He is one of the most professional authors in the industry, delivering what must be some of the cleanest manuscripts delivered anywhere. He’s not only professional, he’s prolific, as we’ll be publishing two more of his novels before the end of the year, <i>Alien Game</i>, which is a second Heinlein-style SF juvenile, and an as-yet-untitled fantasy novel set in Minaria, the world of <i>Divine Right</i>.</p><p>If you haven’t read his first SF juvenile, <i><b><a href=\"http://amzn.to/1PTLarZ\">Mutiny in Space</a></b></i>, you really should do so, as it is a fast-paced, old-school, true-Blue SF novel.</p><p>One of the things Castalia is building is a community of readers and writers, just as DevGame is the foundation for a community of gamers and game developers. As both the first DevGame game, <i>Elveteka</i>, and Rod’s third book with us shows, there is room for a considerable amount of overlap and cross-pollination; a DevGame team is already actively developing <a href=\"http://devgamecourse.blogspot.com/2016/08/counters.html\">the computer wargame version of <i>Divine Right</i></a> and Castalia will be publishing the print edition of a <i>Divine Right</i> RPG book that is in the very early stages of development. This community-building is important, for as Dave Freer notes <a href=\"https://madgeniusclub.com/2016/08/01/changing-spots/\">at the Mad Genius Club</a>, the publishing world is rapidly changing.</p><blockquote><p> The problem is our whole genre, all of publishing (both indy and traditional) and the business of writing are moving targets. Even the audience is moving and changing. And they’re not moving predictably, but like a cheetah full of amphetamine, LSD and blindfolded too.</p><p>Which is all rough on the painstaking ‘stalker’ – the author trying to set themselves up for the ‘kill’. It’s certainly resulted in some very wild shooting – some innocent bystanders hit, lots of prey (AKA sales) disappeared into the scrub never to be seen again. I mean, once upon a time you simply had to kiss up to the right editors, loudly espouse the correct SJW cause de jour and you were in every B&amp;N from here to Timbuktu, and on NYT bestseller list… and life was sweet. Now you can do all that, impeccably, win a Nebula and a Hugo, and be in the surviving book-stores… and still be a sales failure. Readers are being considerably more difficult and relying on Amazon, are more price aware, and more inclined to sample on KU…. I think looking toward writer’s co-ops would be smart.</p></blockquote><p>KU is the real game-changer now, because the traditional publishers can’t play there. But we can, and last month, one of our better-selling books sold more via KU than through all the other means and editions <i>combined</i>. It doesn’t make sense for us to sell all our books that way, as we’ve experimented and some books do great while others don’t, but KU editions are now every bit as important in their own right as paperback, hardcover, or audiobook editions.</p><p>As for coops and communities, we’re not the only ones who have noticed that <a href=\"http://www.huffingtonpost.com/bj-gallagher/book-publishing_b_1394159.html\">building communities is vital for authors</a> these days:</p><blockquote class=\"tr_bq\"><p> Most books today are selling only to the authors’ and publishers’ communities. Everyone in the potential audiences for a book already knows of hundreds of interesting and useful books to read but has little time to read any. Therefore people are reading only books that their communities make important or even mandatory to read. There is no general audience for most nonfiction books, and chasing after such a mirage is usually far less effective than connecting with one’s communities.</p></blockquote><p>This is why it is important for VP and Castalia to continue to grow – blog traffic looks likely to pass 2.6 million this month – and why it is equally important that Castalia does not grow at the price of sacrificing its level of quality. We only got one book out last month, but this month we expect to publish books by THREE new members of our writer’s community – Fenris Wulf, Ivan Throne, and Nick Cole – in addition to a first novel in a new series by one of our leading members, which is to say <i>Mr. John C. Wright</i>. Not all of these books will be for everyone, but all of them will be recognizably Castalia House books in their own way. We’ve also signed three new authors about whom we are very excited, but who shall remain anonymous for the present.</p><p>It is because this community is growing that it is increasingly under assault from trolls, self-seekers, and ideological missionaries. And it is because this community is important, and because you, the reader, are important, that the moderators and I are so ruthless in purging those who are attempting to disrupt and destroy it.</p><p>How important is it? We can quantify that. On an annual basis, the average Castalia book sells <i>more than 10 times</i> the number of copies of the average book. I expect that within five years, that ratio will be 100 to 1.</p><p>UPDATE: I didn’t look at the comments the first time around. Dave also had some nice things to say about Castalia there.</p><blockquote class=\"tr_bq\"><p> I seriously believe Castalia is merely one of the first of the new generation publishers. Say what you like about Vox Day – he pays 50%, does the legwork AND does the marketing. And he really does market. 50% of $20K (and no hassles and costs) is worth a lot more than 70% of $3K and hassles, costs. But at 17.5% of most of the Trad houses (apples to apples comparison) where they do the legwork, but scanty marketing but bump the price right up (so you might get $5K sales) well – it’s a no-brainer, really. Which is why I worry so much that so many people still choose that option.</p></blockquote><p>We admittedly could do a lot better on the marketing. (And yes, marketing volunteers, I’m going to try to contact you this weekend. I’ve genuinely been so busy that I haven’t had time to even respond to the volunteers who are actively trying to help out.) But the quadpartite community of VP, AG, DG, and CH, in combination with our author’s networks, does have a marketing multiplier effect. And once a few of the bigger names start working with us – and they will – that’s when things are going to seriously take off.</p><p>UPDATE: One more note for established writers at other publishers who might be interested in talking to us about working together in the future. We not only pay much higher royalties much earlier than the traditional publishers do, this year, we are already paying all of our authors out for Q1 and Q2 2016, even though <i>we </i>haven’t been paid for June yet. I’m finishing the various reports this weekend. When we say our authors come first, we really mean it.</p></div>",
  "content_text": "I have been inexcusably remiss in failing to put\nRod Walker’s site\non the list of Castalia Author’s on the right sidebar. He not only has a blog, but it’s an interesting one, complete with links to reviews of his first book with Castalia as well as his reviews of other books, such as Peter Grant’s Western,\nBrings the Lightning\n.\nRod Walker says he enjoyed working with Castalia House to bring out MUTINY IN SPACE, and found it an excellent experience in all respects. In previous careers, RW dealt with several traditional publishers and a few small presses, and never found it an enjoyable experience, a marked contrast to his adventure with Castalia House. For all his low opinion of traditional publishers, RW thinks it is better to classify Castalia House as a “nontraditional” publisher. The Internet has made traditional publishing obsolete as a mode of organization, just as the rise of mass industry made the craft guild system obsolete as a method of economic production….\nSo the way forward for publishers, in RW’s opinion, is to abandon the gatekeeper function and instead become “nontraditional” publishers – that is, curators who seek out specific kinds of excellence. RW thinks that John C. Wright’s books SOMEWHITHER and IRON CHAMBER OF MEMORY are superb fantasy novels, and in all probability these books would never have been published without Castalia, just as Jerry Pournelle’s THERE WILL BE WAR series would never have been revived.\nI’m delighted to hear that Rod enjoyed working with us, as we’re very pleased to be working with him. He is one of the most professional authors in the industry, delivering what must be some of the cleanest manuscripts delivered anywhere. He’s not only professional, he’s prolific, as we’ll be publishing two more of his novels before the end of the year,\nAlien Game\n, which is a second Heinlein-style SF juvenile, and an as-yet-untitled fantasy novel set in Minaria, the world of\nDivine Right\n.\nIf you haven’t read his first SF juvenile,\nMutiny in Space\n, you really should do so, as it is a fast-paced, old-school, true-Blue SF novel.\nOne of the things Castalia is building is a community of readers and writers, just as DevGame is the foundation for a community of gamers and game developers. As both the first DevGame game,\nElveteka\n, and Rod’s third book with us shows, there is room for a considerable amount of overlap and cross-pollination; a DevGame team is already actively developing\nthe computer wargame version of\nDivine Right\nand Castalia will be publishing the print edition of a\nDivine Right\nRPG book that is in the very early stages of development. This community-building is important, for as Dave Freer notes\nat the Mad Genius Club\n, the publishing world is rapidly changing.\nThe problem is our whole genre, all of publishing (both indy and traditional) and the business of writing are moving targets. Even the audience is moving and changing. And they’re not moving predictably, but like a cheetah full of amphetamine, LSD and blindfolded too.\nWhich is all rough on the painstaking ‘stalker’ – the author trying to set themselves up for the ‘kill’. It’s certainly resulted in some very wild shooting – some innocent bystanders hit, lots of prey (AKA sales) disappeared into the scrub never to be seen again. I mean, once upon a time you simply had to kiss up to the right editors, loudly espouse the correct SJW cause de jour and you were in every B&N from here to Timbuktu, and on NYT bestseller list… and life was sweet. Now you can do all that, impeccably, win a Nebula and a Hugo, and be in the surviving book-stores… and still be a sales failure. Readers are being considerably more difficult and relying on Amazon, are more price aware, and more inclined to sample on KU…. I think looking toward writer’s co-ops would be smart.\nKU is the real game-changer now, because the traditional publishers can’t play there. But we can, and last month, one of our better-selling books sold more via KU than through all the other means and editions\ncombined\n. It doesn’t make sense for us to sell all our books that way, as we’ve experimented and some books do great while others don’t, but KU editions are now every bit as important in their own right as paperback, hardcover, or audiobook editions.\nAs for coops and communities, we’re not the only ones who have noticed that\nbuilding communities is vital for authors\nthese days:\nMost books today are selling only to the authors’ and publishers’ communities. Everyone in the potential audiences for a book already knows of hundreds of interesting and useful books to read but has little time to read any. Therefore people are reading only books that their communities make important or even mandatory to read. There is no general audience for most nonfiction books, and chasing after such a mirage is usually far less effective than connecting with one’s communities.\nThis is why it is important for VP and Castalia to continue to grow – blog traffic looks likely to pass 2.6 million this month – and why it is equally important that Castalia does not grow at the price of sacrificing its level of quality. We only got one book out last month, but this month we expect to publish books by THREE new members of our writer’s community – Fenris Wulf, Ivan Throne, and Nick Cole – in addition to a first novel in a new series by one of our leading members, which is to say\nMr. John C. Wright\n. Not all of these books will be for everyone, but all of them will be recognizably Castalia House books in their own way. We’ve also signed three new authors about whom we are very excited, but who shall remain anonymous for the present.\nIt is because this community is growing that it is increasingly under assault from trolls, self-seekers, and ideological missionaries. And it is because this community is important, and because you, the reader, are important, that the moderators and I are so ruthless in purging those who are attempting to disrupt and destroy it.\nHow important is it? We can quantify that. On an annual basis, the average Castalia book sells\nmore than 10 times\nthe number of copies of the average book. I expect that within five years, that ratio will be 100 to 1.\nUPDATE: I didn’t look at the comments the first time around. Dave also had some nice things to say about Castalia there.\nI seriously believe Castalia is merely one of the first of the new generation publishers. Say what you like about Vox Day – he pays 50%, does the legwork AND does the marketing. And he really does market. 50% of $20K (and no hassles and costs) is worth a lot more than 70% of $3K and hassles, costs. But at 17.5% of most of the Trad houses (apples to apples comparison) where they do the legwork, but scanty marketing but bump the price right up (so you might get $5K sales) well – it’s a no-brainer, really. Which is why I worry so much that so many people still choose that option.\nWe admittedly could do a lot better on the marketing. (And yes, marketing volunteers, I’m going to try to contact you this weekend. I’ve genuinely been so busy that I haven’t had time to even respond to the volunteers who are actively trying to help out.) But the quadpartite community of VP, AG, DG, and CH, in combination with our author’s networks, does have a marketing multiplier effect. And once a few of the bigger names start working with us – and they will – that’s when things are going to seriously take off.\nUPDATE: One more note for established writers at other publishers who might be interested in talking to us about working together in the future. We not only pay much higher royalties much earlier than the traditional publishers do, this year, we are already paying all of our authors out for Q1 and Q2 2016, even though\nwe\nhaven’t been paid for June yet. I’m finishing the various reports this weekend. When we say our authors come first, we really mean it.",
  "tags": [
    "Castalia House",
    "writing"
  ],
  "categories": [],
  "sitemap_lastmod": "2016-08-06T10:47:00+00:00"
}