{
  "url": "https://voxday.net/2016/08/25/sadistic-bastards/",
  "scraped_at": "2025-12-18T01:50:43.657685",
  "title": "A tutu per tutti",
  "date_display": "August 25, 2016",
  "date_iso": "2016-08-25T13:24:00+00:00",
  "date_from_url": "2016-08-25",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p><i>Seriously, what is wrong with you people? I mean, sure, I’ve got the legs for it, but there is clearly something wrong with anyone who is willing to pay to see me in a tutu.</i><br> <i><br/></i><br> <i>And now <a href=\"https://www.justgiving.com/fundraising/cdcure-MEN9150\">it is going to happen.</a> It’s all your fault!</i><br> <i><br/></i><br> <i>Also, thank you. I wrote this a few days ago, but I suppose this is the right time to post it. Note that it was made possible, in part, by the same research team whose work you are supporting <a href=\"https://www.justgiving.com/fundraising/cdcure-MEN9150\">through the Color Run</a>.</i></br></br></br></br></p><p> So, Ender played his first game with his new team. He had no idea where he would be playing, or even <i>if </i>he would be playing at all, since they have four goalies to divide among the two teams. The situation is in flux, as the presumed first team starter was <i>dreadful </i>in the first friendly, and lost his position to the first team number two. There was even speculation that he’d be sent down to the second team, which might well end up in Ender replacing him as the second team starter.</p><p>But when they suited up, the coach went with only one goalie, the club number three, who is surprisingly mobile despite being huge. I mean, we’re talking 6’2″, 280 at a minimum. Ender was dressed for the field, and assumed that he’d probably go in as either a defender or a wing, as those are the two field positions he’s played before.</p><p>Now, keep in mind that I was his coach for the first four years of his soccer career and I’ve seen nearly every game he’s ever played. He’s a mediocre goalie and a slightly above average defender, which is why his insistence on playing goalie has always been a mystery to me. Decent size, good discipline, good awareness, below-average ball control, average speed, good toughness. Not a star player, not necessarily even a starter, but a solid and reliable player you can trust to come off the bench and hold his own without hurting the team. He’s scored precisely one goal in his entire career, putting a pass from a corner kick into the upper right corner from just outside the left corner of the box.</p><p>He’s also the youngest player on the men’s team by at least a year. I still don’t understand why he’s not eligible for a junior team, but the ways of the national sports bureaucracy are byzantine and impenetrable. He also hasn’t played on the field for more than two years; even in the practices in which he was able to take part for a while, he was playing in the nets.</p><p>The game started off reasonably well, but it soon became clear that the team has a fundamental problem. They have a fair number of skill players, and two with serious cannons attached to their legs, but they have no natural scorers. Despite generally controlling the game and creating multiple scoring chances, they were down 2-0 as their designated striker put the ball over the net, to the right of the net, and to the left of the net on three successive one-on-ones with the goalie. Forget the net, he couldn’t even hit the keeper! He’s a good player with good speed, but he simply cannot handle the pressure that being in scoring position places upon the player.</p><p>It was a friendly, so the substitutions were not limited. Ender was the third man in, and to my surprise, the coach put him in at striker. He didn’t do much at first, and clearly didn’t know what to do or where to go, except when his team was attacking. But when the midfield was in possession and brought the ball over the center line, his positioning was reliably excellent, which paid off after about 10 minutes when the other striker beat the left defender and fired over a knee-high cross that Ender redirected effortlessly into the net. 1-2. The team was totally fired up, redoubled their attack, and about five minutes later, Ender took a pass on the left side and returned the favor, sending a nice low cross to the other striker which he promptly put in the back of the net. 2-2. Fifteen minutes of playing striker and he’d already racked up one goal and one assist… talk about a flying start!</p><p>I was standing next to the coach, who nodded approvingly and mentioned how well Ender was playing. His expression, when I told him that it was the first time Ender had played up front, was downright comical. I’m not entirely sure that he believed me.</p><p>Unfortunately, the other team was very good and had two third-league players who promptly responded by carving up our defense to make it 3-2 at halftime. In the second half, Ender had a good chance that caught him wrong-footed, as well as a perfect cross that the striker somehow managed to whiff on in front of an empty net, after which he moved back to the wing, and then defense when one of the defenders got hurt. He played nearly the second half and was competent in all three positions. They lost 5-3, but everyone felt pretty positive about how the team had hung in there against what was observably a better team.</p><p>And despite the loss, I have to say that it was about as close to a perfect evening as one can hope to see in this world.</p></div>",
  "content_text": "Seriously, what is wrong with you people? I mean, sure, I’ve got the legs for it, but there is clearly something wrong with anyone who is willing to pay to see me in a tutu.\nAnd now\nit is going to happen.\nIt’s all your fault!\nAlso, thank you. I wrote this a few days ago, but I suppose this is the right time to post it. Note that it was made possible, in part, by the same research team whose work you are supporting\nthrough the Color Run\n.\nSo, Ender played his first game with his new team. He had no idea where he would be playing, or even\nif\nhe would be playing at all, since they have four goalies to divide among the two teams. The situation is in flux, as the presumed first team starter was\ndreadful\nin the first friendly, and lost his position to the first team number two. There was even speculation that he’d be sent down to the second team, which might well end up in Ender replacing him as the second team starter.\nBut when they suited up, the coach went with only one goalie, the club number three, who is surprisingly mobile despite being huge. I mean, we’re talking 6’2″, 280 at a minimum. Ender was dressed for the field, and assumed that he’d probably go in as either a defender or a wing, as those are the two field positions he’s played before.\nNow, keep in mind that I was his coach for the first four years of his soccer career and I’ve seen nearly every game he’s ever played. He’s a mediocre goalie and a slightly above average defender, which is why his insistence on playing goalie has always been a mystery to me. Decent size, good discipline, good awareness, below-average ball control, average speed, good toughness. Not a star player, not necessarily even a starter, but a solid and reliable player you can trust to come off the bench and hold his own without hurting the team. He’s scored precisely one goal in his entire career, putting a pass from a corner kick into the upper right corner from just outside the left corner of the box.\nHe’s also the youngest player on the men’s team by at least a year. I still don’t understand why he’s not eligible for a junior team, but the ways of the national sports bureaucracy are byzantine and impenetrable. He also hasn’t played on the field for more than two years; even in the practices in which he was able to take part for a while, he was playing in the nets.\nThe game started off reasonably well, but it soon became clear that the team has a fundamental problem. They have a fair number of skill players, and two with serious cannons attached to their legs, but they have no natural scorers. Despite generally controlling the game and creating multiple scoring chances, they were down 2-0 as their designated striker put the ball over the net, to the right of the net, and to the left of the net on three successive one-on-ones with the goalie. Forget the net, he couldn’t even hit the keeper! He’s a good player with good speed, but he simply cannot handle the pressure that being in scoring position places upon the player.\nIt was a friendly, so the substitutions were not limited. Ender was the third man in, and to my surprise, the coach put him in at striker. He didn’t do much at first, and clearly didn’t know what to do or where to go, except when his team was attacking. But when the midfield was in possession and brought the ball over the center line, his positioning was reliably excellent, which paid off after about 10 minutes when the other striker beat the left defender and fired over a knee-high cross that Ender redirected effortlessly into the net. 1-2. The team was totally fired up, redoubled their attack, and about five minutes later, Ender took a pass on the left side and returned the favor, sending a nice low cross to the other striker which he promptly put in the back of the net. 2-2. Fifteen minutes of playing striker and he’d already racked up one goal and one assist… talk about a flying start!\nI was standing next to the coach, who nodded approvingly and mentioned how well Ender was playing. His expression, when I told him that it was the first time Ender had played up front, was downright comical. I’m not entirely sure that he believed me.\nUnfortunately, the other team was very good and had two third-league players who promptly responded by carving up our defense to make it 3-2 at halftime. In the second half, Ender had a good chance that caught him wrong-footed, as well as a perfect cross that the striker somehow managed to whiff on in front of an empty net, after which he moved back to the wing, and then defense when one of the defenders got hurt. He played nearly the second half and was competent in all three positions. They lost 5-3, but everyone felt pretty positive about how the team had hung in there against what was observably a better team.\nAnd despite the loss, I have to say that it was about as close to a perfect evening as one can hope to see in this world.",
  "tags": [
    "science",
    "sports"
  ],
  "categories": [],
  "sitemap_lastmod": "2016-08-25T12:24:00+00:00"
}