{
  "url": "https://voxday.net/2016/08/20/thats-not-how-it-works/",
  "scraped_at": "2025-12-18T01:49:54.752823",
  "title": "That’s not how it works",
  "date_display": "August 20, 2016",
  "date_iso": "2016-08-20T12:00:00+00:00",
  "date_from_url": "2016-08-20",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>I frequently – by which I mean several times a week – get emails from people who have a great idea how I can do something. Let me put this as politely and patiently as I can.<br> <i><br/></i><br> <i>Don’t talk to me about it. Do it yourself.</i></br></br></p><p>I already have far more ideas at hand than I can possibly address in a full lifetime. Moreover, I am considerably more interested in <i>my </i>ideas than in <i>your </i>ideas. I am extraordinarily busy and I usually work until 4 AM, seven days a week. If I did not exercise regularly and have Spacebunny keeping a careful eye on my diet and my general health, I’d probably be in worse physical condition than the average SJW.</p><p>Contacting people like me and Mike Cernovich about “a great idea” is really nothing more than laziness on your part. <i>Do it yourself.</i> If you don’t have the means, then find some allies and acquire them. I’m always happy to look for ways to help out those who are already doing something, but I have zero interest in wasting a single nanosecond listening to do-nothing, pie-in-the-sky idea-makers.</p><p>If you want to work with us, that’s great! We have a constant and growing need for volunteers, as our volunteers tend to eventually branch out and start doing things on their own, which is something we encourage. We need proofreaders. We need assistant editors. We need people who can layout PDFs and covers. We need someone with a great voice, an English accent, and a masochistic mindset to narrate the Selenoth ebooks. I could use a good co-author or three, as well as lead authors for two or three new Castalia series I have in mind. DevGame is always looking for more good game artists.</p><p>What we don’t need is ideas that serve someone else’s agenda, even if it happens to be in sync with ours. But don’t take this the wrong way. I’m not saying those ideas are bad, I’m saying that if you have the idea, then you have, within yourself, the seed of what is required to make it a reality. So, make it happen, don’t rely upon me or anyone else to make it happen.</p></div>",
  "content_text": "I frequently – by which I mean several times a week – get emails from people who have a great idea how I can do something. Let me put this as politely and patiently as I can.\nDon’t talk to me about it. Do it yourself.\nI already have far more ideas at hand than I can possibly address in a full lifetime. Moreover, I am considerably more interested in\nmy\nideas than in\nyour\nideas. I am extraordinarily busy and I usually work until 4 AM, seven days a week. If I did not exercise regularly and have Spacebunny keeping a careful eye on my diet and my general health, I’d probably be in worse physical condition than the average SJW.\nContacting people like me and Mike Cernovich about “a great idea” is really nothing more than laziness on your part.\nDo it yourself.\nIf you don’t have the means, then find some allies and acquire them. I’m always happy to look for ways to help out those who are already doing something, but I have zero interest in wasting a single nanosecond listening to do-nothing, pie-in-the-sky idea-makers.\nIf you want to work with us, that’s great! We have a constant and growing need for volunteers, as our volunteers tend to eventually branch out and start doing things on their own, which is something we encourage. We need proofreaders. We need assistant editors. We need people who can layout PDFs and covers. We need someone with a great voice, an English accent, and a masochistic mindset to narrate the Selenoth ebooks. I could use a good co-author or three, as well as lead authors for two or three new Castalia series I have in mind. DevGame is always looking for more good game artists.\nWhat we don’t need is ideas that serve someone else’s agenda, even if it happens to be in sync with ours. But don’t take this the wrong way. I’m not saying those ideas are bad, I’m saying that if you have the idea, then you have, within yourself, the seed of what is required to make it a reality. So, make it happen, don’t rely upon me or anyone else to make it happen.",
  "tags": [
    "philosophy"
  ],
  "categories": [],
  "sitemap_lastmod": "2016-08-20T11:00:00+00:00"
}