{
  "url": "https://voxday.net/2016/08/10/the-end-of-jewish-rule/",
  "scraped_at": "2025-12-18T01:48:18.293521",
  "title": "The end of Jewish rule",
  "date_display": "August 10, 2016",
  "date_iso": "2016-08-10T09:02:00+00:00",
  "date_from_url": "2016-08-10",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>Identity politics <a href=\"http://www.kare11.com/news/politics/elections/somali-activist-omar-unseats-long-serving-kahn/292563079\">finally catches up</a> to a 44-year practitioner of it.</p><blockquote><p> A Somali activist has unseated one of the Minnesota Legislature’s longest-serving members in a Democratic primary.</p><p>Ilhan Omar defeated 22-term Rep. Phyllis Kahn in Tuesday’s DFL nominating contest. Omar’s victory in the heavily Democratic Minneapolis district makes it likely she’ll be the first Somali-American lawmaker in the nation after the November election.</p><p>The district spans the University of Minnesota and is home to a large population of immigrants from Somalia and other East African countries. Omar argued the district needs a fresher face that better represents the diversity and needs of the area.</p><p>Omar is a political activist and former aide to the Minneapolis City Council.</p><p>Kahn has spent 44 years in the Legislature.</p></blockquote><p>This is a microcosm of what is gradually taking shape in the United States. It’s also why <a href=\"http://www.milobookclub.com/2014/01/07/protocols-of-learned-elders-of-wye/\">the Learned Elders of Wye</a> have been actively trying to figure out where to jump ship next, as their ability to influence US politics rapidly wanes. Apparently Jewish strategists never thought through the obvious long-term consequences of their 60’s-era “diversity is good for the Jews” strategy in the United States, most likely because it was originally formulated in highly altruistic, highly homogeneous Europe, where it was an effective strategy right up until it <i>really </i>wasn’t.</p><p>However, now that low-altruism minorities are approaching 50 percent of the US electorate, identity politics are permanently replacing ideological politics, and a Jew like Khan is never going to be elected in any district where Somalis, or Arabs, or Indians, or Chinese are the majority. And they’re also increasingly unlikely to be elected in black-, white-, or Hispanic-dominated districts.</p><p>Further complicating matters is the fact that the rise of Donald Trump and American nationalism means the “hello, fellow white people” schtick is not to work much longer, particularly now that the inordinately Jewish “conservative media” has unmasked itself as globalist rather than pro-American, and viciously opposed to any America First nationalist ideology.</p><p>So, setting up Pedro, Peng, Pasha and Prodosh to fight Paul for the benefit of Peter has, over time, put Peter in a no-win situation. If Pedro and company win, Peter is permanently excluded from power and may even be actively persecuted by the rainbow coalition he helped build. And if a newly self-interested Paul wins, he’s no longer likely to listen to Peter or pay any attention to Peter’s interests.</p><p>This leaves Peter with three options. Try to shut down democracy, accept the gradual decline of power, wealth, and influence, or <a href=\"http://www.milobookclub.com/2014/01/14/optimistic/\">leave</a>.</p><p>This isn’t a matter for debate, nor will crying Holocaust or engaging in philo-semitic virtue-signaling make any difference here here. It’s simple demographic math combined with an observation of historical group voting patterns. US whites are willing to vote outside their identity. US non-whites strongly prefer to do as the Jews do and vote their identity.</p><p>It’s interesting, is it not, that the vaunted Askenazi IQ advantage appears to be failing them even as the average US IQ declines significantly. It tends to strongly suggest that whatever the historical basis of Jewish success in the United States was, it was not superior average intelligence.</p><p>To return to the Minnesota district, it would be fascinating if Omar unexpectedly loses the election, as a defeat would indicate that even hard-core liberal whites are starting to prefer identity politics to ideology.</p><p>UPDATE: Further evidence that identity politics are on the rise; the Asians are beginning to flex their political muscle.</p><blockquote class=\"tr_bq\"><p> 24-year-old Fue Lee, who was born in a refugee camp in Thailand and currently works in the office of Secretary of State Steve Simon. He defeated 10-term incumbent Rep. Joe Mullery, DFL-Minneapolis. Both upsets came in heavily DFL districts, which means they are virtually assured of victory in November. Their victories illustrated the ascendance of minority populations in the DFL, as new immigrants and African-Americans demand a higher profile and a seat at the table of the party they call home.</p></blockquote><p>As I’ve said before, Republicans must become the White Party – or if you prefer, the American Party – if they are to survive. White Democrats and Jews are all but finished, outside of the places where they are the majority.</p></div>",
  "content_text": "Identity politics\nfinally catches up\nto a 44-year practitioner of it.\nA Somali activist has unseated one of the Minnesota Legislature’s longest-serving members in a Democratic primary.\nIlhan Omar defeated 22-term Rep. Phyllis Kahn in Tuesday’s DFL nominating contest. Omar’s victory in the heavily Democratic Minneapolis district makes it likely she’ll be the first Somali-American lawmaker in the nation after the November election.\nThe district spans the University of Minnesota and is home to a large population of immigrants from Somalia and other East African countries. Omar argued the district needs a fresher face that better represents the diversity and needs of the area.\nOmar is a political activist and former aide to the Minneapolis City Council.\nKahn has spent 44 years in the Legislature.\nThis is a microcosm of what is gradually taking shape in the United States. It’s also why\nthe Learned Elders of Wye\nhave been actively trying to figure out where to jump ship next, as their ability to influence US politics rapidly wanes. Apparently Jewish strategists never thought through the obvious long-term consequences of their 60’s-era “diversity is good for the Jews” strategy in the United States, most likely because it was originally formulated in highly altruistic, highly homogeneous Europe, where it was an effective strategy right up until it\nreally\nwasn’t.\nHowever, now that low-altruism minorities are approaching 50 percent of the US electorate, identity politics are permanently replacing ideological politics, and a Jew like Khan is never going to be elected in any district where Somalis, or Arabs, or Indians, or Chinese are the majority. And they’re also increasingly unlikely to be elected in black-, white-, or Hispanic-dominated districts.\nFurther complicating matters is the fact that the rise of Donald Trump and American nationalism means the “hello, fellow white people” schtick is not to work much longer, particularly now that the inordinately Jewish “conservative media” has unmasked itself as globalist rather than pro-American, and viciously opposed to any America First nationalist ideology.\nSo, setting up Pedro, Peng, Pasha and Prodosh to fight Paul for the benefit of Peter has, over time, put Peter in a no-win situation. If Pedro and company win, Peter is permanently excluded from power and may even be actively persecuted by the rainbow coalition he helped build. And if a newly self-interested Paul wins, he’s no longer likely to listen to Peter or pay any attention to Peter’s interests.\nThis leaves Peter with three options. Try to shut down democracy, accept the gradual decline of power, wealth, and influence, or\nleave\n.\nThis isn’t a matter for debate, nor will crying Holocaust or engaging in philo-semitic virtue-signaling make any difference here here. It’s simple demographic math combined with an observation of historical group voting patterns. US whites are willing to vote outside their identity. US non-whites strongly prefer to do as the Jews do and vote their identity.\nIt’s interesting, is it not, that the vaunted Askenazi IQ advantage appears to be failing them even as the average US IQ declines significantly. It tends to strongly suggest that whatever the historical basis of Jewish success in the United States was, it was not superior average intelligence.\nTo return to the Minnesota district, it would be fascinating if Omar unexpectedly loses the election, as a defeat would indicate that even hard-core liberal whites are starting to prefer identity politics to ideology.\nUPDATE: Further evidence that identity politics are on the rise; the Asians are beginning to flex their political muscle.\n24-year-old Fue Lee, who was born in a refugee camp in Thailand and currently works in the office of Secretary of State Steve Simon. He defeated 10-term incumbent Rep. Joe Mullery, DFL-Minneapolis. Both upsets came in heavily DFL districts, which means they are virtually assured of victory in November. Their victories illustrated the ascendance of minority populations in the DFL, as new immigrants and African-Americans demand a higher profile and a seat at the table of the party they call home.\nAs I’ve said before, Republicans must become the White Party – or if you prefer, the American Party – if they are to survive. White Democrats and Jews are all but finished, outside of the places where they are the majority.",
  "tags": [
    "decline and fall",
    "immigration",
    "politics"
  ],
  "categories": [],
  "sitemap_lastmod": "2016-08-10T08:02:00+00:00"
}