{
  "url": "https://voxday.net/2016/08/05/the-prophecy-of-hp-lovecraf/",
  "scraped_at": "2025-12-18T01:47:34.099269",
  "title": "The prophecy of HP Lovecraft",
  "date_display": "August 5, 2016",
  "date_iso": "2016-08-05T12:00:00+00:00",
  "date_from_url": "2016-08-05",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>The Chateau offers up <a href=\"https://heartiste.wordpress.com/2016/08/01/the-great-men-on-americanism/\">an insightful and prophetic essay</a> by HP Lovecraft on “Americanism” and how it would be used to justify the immigration that has destroyed the American nation:</p><blockquote><p> It is easy to sentimentalise on the subject of “the American spirit”—what it is, may be, or should be. Exponents of various novel political and social theories are particularly given to this practice, nearly always concluding that “true Americanism” is nothing more or less than a national application of their respective individual doctrines.</p><p>Slightly less superficial observers hit upon the abstract principle of “Liberty” as the keynote of Americanism, interpreting this justly esteemed principle as anything from Bolshevism to the right to drink 2.75 per cent. beer. “Opportunity” is another favourite byword, and one which is certainly not without real significance. The synonymousness of “America” and “opportunity” has been inculcated into many a young head of the present generation by Emerson via Montgomery’s “Leading Facts of American History.” But it is worthy of note that nearly all would-be definers of “Americanism” fail through their prejudiced unwillingness to trace the quality to its European source. They cannot bring themselves to see that abiogenesis is as rare in the realm of ideas as it is in the kingdom of organic life; and consequently waste their efforts in trying to treat America as if it were an isolated phenomenon without ancestry.</p><p>“Americanism” is expanded Anglo-Saxonism. It is the spirit of England, transplanted to a soil of vast extent and diversity, and nourished for a time under pioneer conditions calculated to increase its democratic aspects without impairing its fundamental virtues. It is the spirit of truth, honour, justice, morality, moderation, individualism, conservative liberty, magnanimity, toleration, enterprise, industriousness, and progress—which is England—plus the element of equality and opportunity caused by pioneer settlement. It is the expression of the world’s highest race under the most favourable social, political, and geographical conditions. Those who endeavour to belittle the importance of our British ancestry, are invited to consider the other nations of this continent. All these are equally “American” in every particular, differing only in race-stock and heritage; yet of them all, none save British Canada will even bear comparison with us. We are great because we are a part of the great Anglo-Saxon cultural sphere; a section detached only after a century and a half of heavy colonisation and English rule, which gave to our land the ineradicable stamp of British civilisation.</p><p>Most dangerous and fallacious of the several misconceptions of Americanism is that of the so-called “melting-pot” of races and traditions. It is true that this country has received a vast influx of non-English immigrants who come hither to enjoy without hardship the liberties which our British ancestors carved out in toil and bloodshed. It is also true that such of them as belong to the Teutonic and Celtic races are capable of assimilation to our English type and of becoming valuable acquisitions to the population. But, from this it does not follow that a mixture of really alien blood or ideas has accomplished or can accomplish anything but harm….</p><p>The main struggle which awaits Americanism is not with reaction, but with radicalism. Our age is one of restless and unintelligent iconoclasm, and abounds with shrewd sophists who use the name “Americanism” to cover attacks on that institution itself. Such familiar terms and phrases as “democracy,” “liberty,” or “freedom of speech” are being distorted to cover the wildest forms of anarchy, whilst our old representative institutions are being attacked as “un-American” by foreign immigrants who are incapable both of understanding them or of devising anything better.</p></blockquote><p>One of the ways we can be certain that our perspective is not only historically sound, but more reflective of reality and predictive of the future is to read the voices of the past whose outlook has subsequently proved correct. HP Lovecraft was absolutely right, the foreign immigrants who came to the United States after 1919 were incapable of understanding the Rights of Englishmen and have proven <i>utterly </i>incapable of devising anything better.</p><p>Indeed, through their ahistorical inventions of “the melting pot” and “the proposition nation” and “equality” and “diversity is our strength”, they have completely and utterly destroyed that expanded Anglo-Saxonism that briefly made America the greatest, most powerful, and wealthiest nation on Earth.</p><p>“America” is not only white, it is, as Lovecraft said, an “expanded Anglo-Saxonism”. While other peoples may respect it, admire it, envy it, and seek to emulate it, they have observably been collectively incapable of understanding, adopting, or even preserving it. Through their various redefinitions of “Americanism”, America was destroyed.</p><p>The United States today is entirely post-American, in much the same way that Europe is post-Christian. The forms remain, but the substance is no longer there. America’s hallowed terms and phrases are even emptier than Europe’s abandoned churches.</p></div>",
  "content_text": "The Chateau offers up\nan insightful and prophetic essay\nby HP Lovecraft on “Americanism” and how it would be used to justify the immigration that has destroyed the American nation:\nIt is easy to sentimentalise on the subject of “the American spirit”—what it is, may be, or should be. Exponents of various novel political and social theories are particularly given to this practice, nearly always concluding that “true Americanism” is nothing more or less than a national application of their respective individual doctrines.\nSlightly less superficial observers hit upon the abstract principle of “Liberty” as the keynote of Americanism, interpreting this justly esteemed principle as anything from Bolshevism to the right to drink 2.75 per cent. beer. “Opportunity” is another favourite byword, and one which is certainly not without real significance. The synonymousness of “America” and “opportunity” has been inculcated into many a young head of the present generation by Emerson via Montgomery’s “Leading Facts of American History.” But it is worthy of note that nearly all would-be definers of “Americanism” fail through their prejudiced unwillingness to trace the quality to its European source. They cannot bring themselves to see that abiogenesis is as rare in the realm of ideas as it is in the kingdom of organic life; and consequently waste their efforts in trying to treat America as if it were an isolated phenomenon without ancestry.\n“Americanism” is expanded Anglo-Saxonism. It is the spirit of England, transplanted to a soil of vast extent and diversity, and nourished for a time under pioneer conditions calculated to increase its democratic aspects without impairing its fundamental virtues. It is the spirit of truth, honour, justice, morality, moderation, individualism, conservative liberty, magnanimity, toleration, enterprise, industriousness, and progress—which is England—plus the element of equality and opportunity caused by pioneer settlement. It is the expression of the world’s highest race under the most favourable social, political, and geographical conditions. Those who endeavour to belittle the importance of our British ancestry, are invited to consider the other nations of this continent. All these are equally “American” in every particular, differing only in race-stock and heritage; yet of them all, none save British Canada will even bear comparison with us. We are great because we are a part of the great Anglo-Saxon cultural sphere; a section detached only after a century and a half of heavy colonisation and English rule, which gave to our land the ineradicable stamp of British civilisation.\nMost dangerous and fallacious of the several misconceptions of Americanism is that of the so-called “melting-pot” of races and traditions. It is true that this country has received a vast influx of non-English immigrants who come hither to enjoy without hardship the liberties which our British ancestors carved out in toil and bloodshed. It is also true that such of them as belong to the Teutonic and Celtic races are capable of assimilation to our English type and of becoming valuable acquisitions to the population. But, from this it does not follow that a mixture of really alien blood or ideas has accomplished or can accomplish anything but harm….\nThe main struggle which awaits Americanism is not with reaction, but with radicalism. Our age is one of restless and unintelligent iconoclasm, and abounds with shrewd sophists who use the name “Americanism” to cover attacks on that institution itself. Such familiar terms and phrases as “democracy,” “liberty,” or “freedom of speech” are being distorted to cover the wildest forms of anarchy, whilst our old representative institutions are being attacked as “un-American” by foreign immigrants who are incapable both of understanding them or of devising anything better.\nOne of the ways we can be certain that our perspective is not only historically sound, but more reflective of reality and predictive of the future is to read the voices of the past whose outlook has subsequently proved correct. HP Lovecraft was absolutely right, the foreign immigrants who came to the United States after 1919 were incapable of understanding the Rights of Englishmen and have proven\nutterly\nincapable of devising anything better.\nIndeed, through their ahistorical inventions of “the melting pot” and “the proposition nation” and “equality” and “diversity is our strength”, they have completely and utterly destroyed that expanded Anglo-Saxonism that briefly made America the greatest, most powerful, and wealthiest nation on Earth.\n“America” is not only white, it is, as Lovecraft said, an “expanded Anglo-Saxonism”. While other peoples may respect it, admire it, envy it, and seek to emulate it, they have observably been collectively incapable of understanding, adopting, or even preserving it. Through their various redefinitions of “Americanism”, America was destroyed.\nThe United States today is entirely post-American, in much the same way that Europe is post-Christian. The forms remain, but the substance is no longer there. America’s hallowed terms and phrases are even emptier than Europe’s abandoned churches.",
  "tags": [
    "decline and fall",
    "history",
    "immigration"
  ],
  "categories": [],
  "sitemap_lastmod": "2016-08-05T11:00:00+00:00"
}