{
  "url": "https://voxday.net/2016/08/24/the-tutu-threa/",
  "scraped_at": "2025-12-18T01:50:34.410830",
  "title": "The Tutu Threat",
  "date_display": "August 24, 2016",
  "date_iso": "2016-08-24T16:21:00+00:00",
  "date_from_url": "2016-08-24",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>No, that’s not a forthcoming book from Simon Hawke, it is what Spacebunny has promised she will make me do if we are able to hit her $5k for 5k target for research for the Crohn’s MAP vaccine as part of the Color Run in which we are participating next month.</p><p>Personally, I thought it was bad enough to have to be dragged out of bed at some obscenely early hour and then forced to embark upon some hellish modern Trail of Tears while people yell at you, and apparently, dye you like an Easter Egg somehow; apparently they were inspired by Cersei’s walk of shame from A Game of Thrones or something.</p><p>I tried to point out that running a 5k is something I have done precisely once in my life, and that perhaps a 100-meter sprint for charity might be more in order, but I was outvoted as my treacherous spawn sided with her. Then Spacebunny promised that if the $5k for 5k was raised, both of us would not only run the race, but do so in tutus as well. And that she would post the pictures on Twitter. And that I would post them here.</p><p>So, if you are either a) interested in supporting scientific research that may bring an end to the ongoing torture that is Crohn’s Disease or b) looking to have a pretty good laugh at my expense, you can do so by supporting <a href=\"https://www.justgiving.com/fundraising/cdcure-MEN9150\">Spacebunny’s Color Run Page</a> at Justgiving. I have spoken with several members of the research team, it is a lean and efficient organization, and the funds will not be wasted.</p><blockquote><p> Prof. Hermon-Taylor, together with Dr. Tim Bull and other members of the team at St George’s University of London and scientists at the Jenner Institute University of Oxford, developed a modern DNA vaccine against MAP, which is the bacteria suspected of being the primary catalyst for Crohn’s Disease. Developing this vaccine took 10 years and cost around £850,000, much of it donated by the families of Crohn’s patients, without whom this new vaccine would not exist.</p><p>The Crohn’s MAP Vaccine is a modern, therapeutic vaccine against MAP. Preliminary studies in animals have shown it is safe and effective. Now a trial in humans is needed to take the vaccine from lab to clinic. If effective, the vaccine will not only protect people from developing Crohn’s Disease, but will also serve as an effective cure for those already suffering from it.</p></blockquote><p>The money will go to helping pay for the human trial of the vaccine which has already been developed.</p></div>",
  "content_text": "No, that’s not a forthcoming book from Simon Hawke, it is what Spacebunny has promised she will make me do if we are able to hit her $5k for 5k target for research for the Crohn’s MAP vaccine as part of the Color Run in which we are participating next month.\nPersonally, I thought it was bad enough to have to be dragged out of bed at some obscenely early hour and then forced to embark upon some hellish modern Trail of Tears while people yell at you, and apparently, dye you like an Easter Egg somehow; apparently they were inspired by Cersei’s walk of shame from A Game of Thrones or something.\nI tried to point out that running a 5k is something I have done precisely once in my life, and that perhaps a 100-meter sprint for charity might be more in order, but I was outvoted as my treacherous spawn sided with her. Then Spacebunny promised that if the $5k for 5k was raised, both of us would not only run the race, but do so in tutus as well. And that she would post the pictures on Twitter. And that I would post them here.\nSo, if you are either a) interested in supporting scientific research that may bring an end to the ongoing torture that is Crohn’s Disease or b) looking to have a pretty good laugh at my expense, you can do so by supporting\nSpacebunny’s Color Run Page\nat Justgiving. I have spoken with several members of the research team, it is a lean and efficient organization, and the funds will not be wasted.\nProf. Hermon-Taylor, together with Dr. Tim Bull and other members of the team at St George’s University of London and scientists at the Jenner Institute University of Oxford, developed a modern DNA vaccine against MAP, which is the bacteria suspected of being the primary catalyst for Crohn’s Disease. Developing this vaccine took 10 years and cost around £850,000, much of it donated by the families of Crohn’s patients, without whom this new vaccine would not exist.\nThe Crohn’s MAP Vaccine is a modern, therapeutic vaccine against MAP. Preliminary studies in animals have shown it is safe and effective. Now a trial in humans is needed to take the vaccine from lab to clinic. If effective, the vaccine will not only protect people from developing Crohn’s Disease, but will also serve as an effective cure for those already suffering from it.\nThe money will go to helping pay for the human trial of the vaccine which has already been developed.",
  "tags": [
    "health care",
    "science"
  ],
  "categories": [],
  "sitemap_lastmod": "2016-08-24T15:21:00+00:00"
}