{
  "url": "https://voxday.net/2016/08/07/the-intellectually-fearsome-atheis/",
  "scraped_at": "2025-12-18T01:47:56.228212",
  "title": "The intellectually fearsome atheist",
  "date_display": "August 7, 2016",
  "date_iso": "2016-08-07T21:53:00+00:00",
  "date_from_url": "2016-08-07",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>For some reason, Google occasionally emails me comments that people are making about Stefan Molyneux’s videos <a href=\"http://www.youtube.com/watch?v=z6fDHXoGL_k\">in which I’ve appeared</a>. This one, by ismelljello, was particularly amusing.</p><blockquote class=\"tr_bq\"><p> Read the reviews of his book. It honestly compelled me to make a video series where i debunk his tired old arguments. If you’re going to peddle other peoples ideas, at least make sure they haven’t already been trounced.</p></blockquote><p>He made a video series to debunk the tired old arguments of a book he hasn’t read. That’s… an interesting approach.</p><p>I have the distinct impression that he has absolutely no idea that <i>The Irrational Atheist</i> cannot possibly contain “tired old arguments” because they are new critiques of the arguments put forth by Richard Dawkins, Sam Harris, Christopher Hitchens, Daniel Dennett, and Michel Onfray, among others.</p><p>It should certainly be interesting to discover how he proves that religion causes war and is worse than child molestation.</p><p>This is the danger of intellectual posturing. Sooner or later, you’re going to strike a pose that will catch the attention of those who actually possess the information you’re pretending to have. Never pretend to know what you don’t.</p></div>",
  "content_text": "For some reason, Google occasionally emails me comments that people are making about Stefan Molyneux’s videos\nin which I’ve appeared\n. This one, by ismelljello, was particularly amusing.\nRead the reviews of his book. It honestly compelled me to make a video series where i debunk his tired old arguments. If you’re going to peddle other peoples ideas, at least make sure they haven’t already been trounced.\nHe made a video series to debunk the tired old arguments of a book he hasn’t read. That’s… an interesting approach.\nI have the distinct impression that he has absolutely no idea that\nThe Irrational Atheist\ncannot possibly contain “tired old arguments” because they are new critiques of the arguments put forth by Richard Dawkins, Sam Harris, Christopher Hitchens, Daniel Dennett, and Michel Onfray, among others.\nIt should certainly be interesting to discover how he proves that religion causes war and is worse than child molestation.\nThis is the danger of intellectual posturing. Sooner or later, you’re going to strike a pose that will catch the attention of those who actually possess the information you’re pretending to have. Never pretend to know what you don’t.",
  "tags": [
    "atheism",
    "Christianity",
    "trainwreck"
  ],
  "categories": [],
  "sitemap_lastmod": "2016-08-07T20:53:00+00:00"
}