{
  "url": "https://voxday.net/2016/08/02/the-west-will-die/",
  "scraped_at": "2025-12-18T01:47:05.709309",
  "title": "“The West will die….”",
  "date_display": "August 2, 2016",
  "date_iso": "2016-08-02T12:00:00+00:00",
  "date_from_url": "2016-08-02",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>A Hispanic <a href=\"http://amzn.to/1tkcuFi\">reviews <b style=\"font-style: italic;\">Cuckservative: How “Conservatives” Betrayed America</b></a>:<br/></p><blockquote><p> I read quite a bit but this is the most powerful political book I’ve ever read! Vox Day lays it out plain and simple – Western Civilization is in a VERY DANGEROUS situation right now because of reckless immigration policies created by liberals and politically correct cuckservatives. This book acknowledges that Donald Trump has played a huge role in pushing this very important issue to the forefront of political discussion.</p><p>Cuckservatives are so afraid to oppose uncontrolled mass migration from the Third World that they’re instead willing to let the United States move away from Western Civilization and become less free. I’m Hispanic and I agree with the argument in this book that Hispanics are not natural conservatives/libertarians who favor limited government and a broad range of freedoms. The voting patterns of Hispanic immigrants, their children, and their grandchildren are evidence of these voting patterns but cuckservatives have let their own self-interest and fear of being called racist prevent them from standing up for the survival of the country. As the book points out, we also have seen a similar paralyzing fear in other parts of the West such as Western Europe where Third World immigrants are flooding in and failing to integrate because they don’t embrace Western values, not because of any inherent racism on the part of the host country.</p><p>What I absolutely LOVED about this book the most is the bravery in talking about human biodiversity. The author points out that even the <i>The Economist</i> has written about a plethora of scientific research proving that there are biological differences between the races. And yes, this makes some races better at some things than others. Vox Day, Charles Murray, and Stefan Molyneux of Freedomain Radio are such brave souls to talk about this incredibly important but controversial topic. Ann Coulter briefly mentions this issue of IQ differences between the races in her book, “Adios America” but Vox Day really lays out the evidence without giving a damn about what is politically correct. How refreshing to find an honest, brave, and politically incorrect book like this standing up for Western Civilization!</p></blockquote><p>It’s hard for the older generation to realize things are as bad as they are. Trapped in memories and increasing isolation, they have no idea what the USA has become. It’s all but impossible for the younger generation to realize what they have lost, or more precisely, of what they have been robbed.</p><p>Conservatives have betrayed America. Progressives have destroyed it. What remains is the tattered remnants of a nation that still cannot grasp that not only is it not stronger, healthier, and more powerful than ever before, but it is on the verge of collapsing under the weight of its invaders. The USA is like a cancer-stricken patient whose oncologist keeps assuring him that the cancer cells are white blood cells that are strengthening his immune system.</p><p>The great irony is that immigrationists point to the great waves of past immigration to whom the adulteration and ideological misdirecting of the nation can be directly traced, the Germans, the Irish, the Italians, the Scandinavians, and the Jews, and using them to justify the beneficial nature of the current wave of Central American, Asian, Arab, and African immigration.</p><p>But what we have witnessed is the invasion and destruction of the American nation. You may not understand this yet, you almost certainly will not accept it, but you have nevertheless witnessed it, and soooner or later, you will eventually grasp what you were seeing.</p><p>There is a reason the Founding Fathers wrote the Constitution for their posterity, and for their posterity alone. There is a reason they limited naturalization to whites. There is a reason they enacted the Chinese exclusion act. Americans foolishly abandoned the wisdom of their forefathers for a self-serving myth concocted by immigrants in the name of anti-racism, and they will experience the inevitable consequences of that foolishness.</p><p>Nothing good has come of this. And worse is yet to come. But none of this means that the American nation cannot rise again, if the surviving posterity returns to the principles that made America great in the first place.</p><p>Recant your absurd equalitarianism. Give up those ridiculous myths that enchain your mind. Embrace your American identity and stop thinking that because a member of a competing identity is nice, or polite, or smiled at you, that their interests are not diametrically opposed to you and your people. The survival of America, and possibly Western Civilization, depends upon it.</p><p>The map is not the territory. The state is not the nation. The citizen is not the national. The metaphor is not the material.</p></div>",
  "content_text": "A Hispanic\nreviews\nCuckservative: How “Conservatives” Betrayed America\n:\nI read quite a bit but this is the most powerful political book I’ve ever read! Vox Day lays it out plain and simple – Western Civilization is in a VERY DANGEROUS situation right now because of reckless immigration policies created by liberals and politically correct cuckservatives. This book acknowledges that Donald Trump has played a huge role in pushing this very important issue to the forefront of political discussion.\nCuckservatives are so afraid to oppose uncontrolled mass migration from the Third World that they’re instead willing to let the United States move away from Western Civilization and become less free. I’m Hispanic and I agree with the argument in this book that Hispanics are not natural conservatives/libertarians who favor limited government and a broad range of freedoms. The voting patterns of Hispanic immigrants, their children, and their grandchildren are evidence of these voting patterns but cuckservatives have let their own self-interest and fear of being called racist prevent them from standing up for the survival of the country. As the book points out, we also have seen a similar paralyzing fear in other parts of the West such as Western Europe where Third World immigrants are flooding in and failing to integrate because they don’t embrace Western values, not because of any inherent racism on the part of the host country.\nWhat I absolutely LOVED about this book the most is the bravery in talking about human biodiversity. The author points out that even the\nThe Economist\nhas written about a plethora of scientific research proving that there are biological differences between the races. And yes, this makes some races better at some things than others. Vox Day, Charles Murray, and Stefan Molyneux of Freedomain Radio are such brave souls to talk about this incredibly important but controversial topic. Ann Coulter briefly mentions this issue of IQ differences between the races in her book, “Adios America” but Vox Day really lays out the evidence without giving a damn about what is politically correct. How refreshing to find an honest, brave, and politically incorrect book like this standing up for Western Civilization!\nIt’s hard for the older generation to realize things are as bad as they are. Trapped in memories and increasing isolation, they have no idea what the USA has become. It’s all but impossible for the younger generation to realize what they have lost, or more precisely, of what they have been robbed.\nConservatives have betrayed America. Progressives have destroyed it. What remains is the tattered remnants of a nation that still cannot grasp that not only is it not stronger, healthier, and more powerful than ever before, but it is on the verge of collapsing under the weight of its invaders. The USA is like a cancer-stricken patient whose oncologist keeps assuring him that the cancer cells are white blood cells that are strengthening his immune system.\nThe great irony is that immigrationists point to the great waves of past immigration to whom the adulteration and ideological misdirecting of the nation can be directly traced, the Germans, the Irish, the Italians, the Scandinavians, and the Jews, and using them to justify the beneficial nature of the current wave of Central American, Asian, Arab, and African immigration.\nBut what we have witnessed is the invasion and destruction of the American nation. You may not understand this yet, you almost certainly will not accept it, but you have nevertheless witnessed it, and soooner or later, you will eventually grasp what you were seeing.\nThere is a reason the Founding Fathers wrote the Constitution for their posterity, and for their posterity alone. There is a reason they limited naturalization to whites. There is a reason they enacted the Chinese exclusion act. Americans foolishly abandoned the wisdom of their forefathers for a self-serving myth concocted by immigrants in the name of anti-racism, and they will experience the inevitable consequences of that foolishness.\nNothing good has come of this. And worse is yet to come. But none of this means that the American nation cannot rise again, if the surviving posterity returns to the principles that made America great in the first place.\nRecant your absurd equalitarianism. Give up those ridiculous myths that enchain your mind. Embrace your American identity and stop thinking that because a member of a competing identity is nice, or polite, or smiled at you, that their interests are not diametrically opposed to you and your people. The survival of America, and possibly Western Civilization, depends upon it.\nThe map is not the territory. The state is not the nation. The citizen is not the national. The metaphor is not the material.",
  "tags": [
    "cuckservative",
    "decline and fall",
    "immigration"
  ],
  "categories": [],
  "sitemap_lastmod": "2016-08-02T11:00:00+00:00"
}