{
  "url": "https://voxday.net/2016/08/24/the-tokens-whine/",
  "scraped_at": "2025-12-18T01:50:28.917701",
  "title": "The tokens whine",
  "date_display": "August 24, 2016",
  "date_iso": "2016-08-24T08:00:00+00:00",
  "date_from_url": "2016-08-24",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>Nnedi Okorafor, PhD ‏@Nnedi<br> I wish the media would discuss the stories we wrote more than the grumblings of&amp;responses to a certain group of ppl I won’t name.#HugoAwards</br></p><p>EscapeVelocity ‏@EscapeVelo<br> @voxday getting the last laugh, once again.</br></p><p>Supreme Dark Lord ‏@voxday<br> We do too. Because the stories you wrote are mediocre. An SJW-given affirmative-action award doesn’t make them good. #HugoAwards</br></p><p>This is why Mr. ZFG is willing to spend more time writing more words about how the Rabid Puppies don’t matter than he is on his overdue novels. Because the observable fact is that the only reason the media cares about the Hugos these days is because it is a cultural war battleground. It’s just another futile attempt to spin the narrative.</p><p>Meanwhile, the affirmative-action recipients declare that they <i>did too</i> get there on merit, despite the fact that even their so-called fans have nothing to say about their work beyond expressing wonder that the dog can walk on its hind legs at all. The media doesn’t want to talk about “Binti” because it is both <a href=\"http://www.strangehorizons.com/reviews/2016/03/binti_by_nnedi_.shtml\">a racist African revenge fantasy about white colonialism</a> and a nasty, incoherent piece of work in which <i>African hairstyles</i> serve as a major plot point. They don’t want to make the RP point for us, which talking about the winners is bound to do.</p><p>Remember, according to the SF-SJWs, that is the <i>VERY BEST</i> that science fiction had to offer in 2015. No wonder people have lost so much interest in it.</p><p>And speaking of the narrative, I’m very amused by the various SJWs proclaiming, yet again, how the Rabid Puppies have been defeated. After all, we’re the ones desperately changing our rules as fast as possible at every opportunity, right? Forget not knowing the score, the SF-SJWs don’t even understand the game being played.</p></div>",
  "content_text": "Nnedi Okorafor, PhD ‏@Nnedi\nI wish the media would discuss the stories we wrote more than the grumblings of&responses to a certain group of ppl I won’t name.#HugoAwards\nEscapeVelocity ‏@EscapeVelo\n@voxday getting the last laugh, once again.\nSupreme Dark Lord ‏@voxday\nWe do too. Because the stories you wrote are mediocre. An SJW-given affirmative-action award doesn’t make them good. #HugoAwards\nThis is why Mr. ZFG is willing to spend more time writing more words about how the Rabid Puppies don’t matter than he is on his overdue novels. Because the observable fact is that the only reason the media cares about the Hugos these days is because it is a cultural war battleground. It’s just another futile attempt to spin the narrative.\nMeanwhile, the affirmative-action recipients declare that they\ndid too\nget there on merit, despite the fact that even their so-called fans have nothing to say about their work beyond expressing wonder that the dog can walk on its hind legs at all. The media doesn’t want to talk about “Binti” because it is both\na racist African revenge fantasy about white colonialism\nand a nasty, incoherent piece of work in which\nAfrican hairstyles\nserve as a major plot point. They don’t want to make the RP point for us, which talking about the winners is bound to do.\nRemember, according to the SF-SJWs, that is the\nVERY BEST\nthat science fiction had to offer in 2015. No wonder people have lost so much interest in it.\nAnd speaking of the narrative, I’m very amused by the various SJWs proclaiming, yet again, how the Rabid Puppies have been defeated. After all, we’re the ones desperately changing our rules as fast as possible at every opportunity, right? Forget not knowing the score, the SF-SJWs don’t even understand the game being played.",
  "tags": [
    "Hugo Award",
    "Pink SF"
  ],
  "categories": [],
  "sitemap_lastmod": "2016-08-24T07:00:00+00:00"
}