{
  "url": "https://voxday.net/2016/08/19/the-media-is-not-above-law/",
  "scraped_at": "2025-12-18T01:49:47.447916",
  "title": "The media is not above the law",
  "date_display": "August 19, 2016",
  "date_iso": "2016-08-19T15:30:00+00:00",
  "date_from_url": "2016-08-19",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>I’ve been hard on Jonah Goldberg of late, and correctly so, which is why it is important to give the author of <i>Liberal Fascism</i> his due when he gets it right, <a href=\"http://www.nationalreview.com/article/439157/gawker-hulk-hogan-lawsuit-press-isnt-exempt-privacy-laws?target=author&amp;tid=897\">as he does here</a> with regards to the death of Gawker.</p><blockquote><p> The real issue seems to be that journalistic corporations are just different than every other kind of corporation. No one would bat an eye if, say, George Soros, bankrolled an invasion-of-privacy lawsuit by the ACLU against a “normal” corporation like Microsoft or Bank of America. But when a media outlet is in the dock, the rules are different.</p><p>Gilles Wullus of the group Reporters Without Borders told the BBC that the Gawker case poses a dire threat to press freedom. “Journalism ethics should be taken care of by journalists themselves,” he said. “In case they do not, we think that nobody else can do it in their place, neither states nor governments; especially not wealthy individuals.”</p><p>A free press is an important institution in a democracy, but journalists don’t have any rights the rest of us don’t. What nonsense.</p><p>Yes, a free press is an important institution in a democracy (and even more important in non-democracies), but journalists don’t have any rights the rest of us don’t. A reporter has the right to free speech, and so does a plumber. Indeed, in the era of smartphones, it has never been more true: We all have the right and ability to commit journalism. That right manifests itself in people, not corporations. The New York Times, to the extent that it is a “corporate person,” should have no more (and no fewer) rights than Exxon Mobil.</p><p>Imagine the outrage if I said, “Petroleum-industry ethics should be taken care of by petroleum industry executives themselves.” It’s certainly fair to argue against the merits of the verdict. But no one is above the law. Not even journalists, never mind corporations in the journalism business.</p></blockquote><p>There is no “Fourth Estate”. There is nothing special about the media and they have no rights that anyone else doesn’t have. And when they break the law, be it criminal or civil, they are liable for the consequences.</p><p>On the other hand, Jonah’s NRO colleague, Mario Loyola, fails to understand that the conservative media is, in part, culpable for the declining regard in which America’s institutions are held in <a href=\"http://www.nationalreview.com/article/439125/trump-tea-party-failing-democratic-system?target=author&amp;tid=1863\">a piece that is unmitigated cuckservative blather</a>.</p><blockquote><p> Democracy depends vitally on reverence for “the majesty of the democratic system.” That means reverence for its basic institutions, if not for the men and women who run them as individuals. It’s one thing to criticize politicians as crooked and mendacious, but quite another to say that our democratic institutions are themselves corrupt. If that is true in any major respect, it is vital to solve the problem fast. Democracy begins to die when democratic institutions lose the people’s trust.</p><p>Alas, such talk finds a willing audience today, across the political spectrum. During Obama’s entire presidency, trust in government has bounced along rock bottom at less than 20 percent — unprecedented in the history of polling.</p><p>While in power, Democrats have done enormous damage. During Obama’s first two years, when they controlled Congress, and since then in the form of unilateral executive actions, the Democrats have verbally assailed the legitimacy of vital democratic institutions, including the Constitution, the police, corporations, and, of course, elections….</p><p>President Bush’s last words were “I believe I have upheld the honor of the presidency.” We could do worse than to ask God to bless the next president with a similar sense of humility and dignity, and a similar awe for the majesty of the democratic system, but it will be for naught if the American people aren’t thankful for it.</p></blockquote><p> Supreme Dark Lord @voxday<br> One reason the people don’t trust the institutions anymore is because commentators like you are constantly lying to them.</br></p><p>Mario Loyola @Mario_A_Loyola<br> Tell me Dark Lord, do you sit around at home all day defeating the enemy with these flaccid little one-liners? Wow</br></p><p>Supreme Dark Lord ‏@voxday<br> You can lie to people all you want, but no one is buying it anymore. The nation is dying and you’re still virtue-signaling.</br></p></div>",
  "content_text": "I’ve been hard on Jonah Goldberg of late, and correctly so, which is why it is important to give the author of\nLiberal Fascism\nhis due when he gets it right,\nas he does here\nwith regards to the death of Gawker.\nThe real issue seems to be that journalistic corporations are just different than every other kind of corporation. No one would bat an eye if, say, George Soros, bankrolled an invasion-of-privacy lawsuit by the ACLU against a “normal” corporation like Microsoft or Bank of America. But when a media outlet is in the dock, the rules are different.\nGilles Wullus of the group Reporters Without Borders told the BBC that the Gawker case poses a dire threat to press freedom. “Journalism ethics should be taken care of by journalists themselves,” he said. “In case they do not, we think that nobody else can do it in their place, neither states nor governments; especially not wealthy individuals.”\nA free press is an important institution in a democracy, but journalists don’t have any rights the rest of us don’t. What nonsense.\nYes, a free press is an important institution in a democracy (and even more important in non-democracies), but journalists don’t have any rights the rest of us don’t. A reporter has the right to free speech, and so does a plumber. Indeed, in the era of smartphones, it has never been more true: We all have the right and ability to commit journalism. That right manifests itself in people, not corporations. The New York Times, to the extent that it is a “corporate person,” should have no more (and no fewer) rights than Exxon Mobil.\nImagine the outrage if I said, “Petroleum-industry ethics should be taken care of by petroleum industry executives themselves.” It’s certainly fair to argue against the merits of the verdict. But no one is above the law. Not even journalists, never mind corporations in the journalism business.\nThere is no “Fourth Estate”. There is nothing special about the media and they have no rights that anyone else doesn’t have. And when they break the law, be it criminal or civil, they are liable for the consequences.\nOn the other hand, Jonah’s NRO colleague, Mario Loyola, fails to understand that the conservative media is, in part, culpable for the declining regard in which America’s institutions are held in\na piece that is unmitigated cuckservative blather\n.\nDemocracy depends vitally on reverence for “the majesty of the democratic system.” That means reverence for its basic institutions, if not for the men and women who run them as individuals. It’s one thing to criticize politicians as crooked and mendacious, but quite another to say that our democratic institutions are themselves corrupt. If that is true in any major respect, it is vital to solve the problem fast. Democracy begins to die when democratic institutions lose the people’s trust.\nAlas, such talk finds a willing audience today, across the political spectrum. During Obama’s entire presidency, trust in government has bounced along rock bottom at less than 20 percent — unprecedented in the history of polling.\nWhile in power, Democrats have done enormous damage. During Obama’s first two years, when they controlled Congress, and since then in the form of unilateral executive actions, the Democrats have verbally assailed the legitimacy of vital democratic institutions, including the Constitution, the police, corporations, and, of course, elections….\nPresident Bush’s last words were “I believe I have upheld the honor of the presidency.” We could do worse than to ask God to bless the next president with a similar sense of humility and dignity, and a similar awe for the majesty of the democratic system, but it will be for naught if the American people aren’t thankful for it.\nSupreme Dark Lord @voxday\nOne reason the people don’t trust the institutions anymore is because commentators like you are constantly lying to them.\nMario Loyola @Mario_A_Loyola\nTell me Dark Lord, do you sit around at home all day defeating the enemy with these flaccid little one-liners? Wow\nSupreme Dark Lord ‏@voxday\nYou can lie to people all you want, but no one is buying it anymore. The nation is dying and you’re still virtue-signaling.",
  "tags": [
    "law",
    "media"
  ],
  "categories": [],
  "sitemap_lastmod": "2016-08-19T14:30:00+00:00"
}