{
  "url": "https://voxday.net/2016/08/08/this-would-be-why/",
  "scraped_at": "2025-12-18T01:48:01.838520",
  "title": "This would be why",
  "date_display": "August 8, 2016",
  "date_iso": "2016-08-08T14:35:00+00:00",
  "date_from_url": "2016-08-08",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>From Wikipedia <a href=\"https://en.wikipedia.org/wiki/Talk:Vox_Day\">Talk: Vox Day</a></p><blockquote><p> In what sense is Vox Day a philosopher? The article only lists some half-baked (and eminently controversial) positions on race. It does not appear that he has been published in any academic journals or contributed anything to the philosophical discourse.<br>  — Preceding unsigned comment added by 50.232.78.130 (talk) 21:07, 12 March 2016 (UTC)</br></p><p>Concur; removed. The “philosophical views” section was a political views section, so I’ve also renamed that accordingly<br> – David Gerard (talk) 21:44, 12 March 2016 (UTC)</br></p><p>Meh. I think it could be included due to his publication of The Irrational Atheist, which is a philosophical work. Kelly hi! 11:20, 13 March 2016 (UTC)</p><p>I believe his work on Social Justice Warriors was the #1 seller in political philosophy for quite some time.<br> — Preceding unsigned comment added by 2601:182:C902:479A:ED91:3D5B:56A6:2252 (talk) 02:01, 29 April 2016 (UTC)</br></p><p>Per the section immediately below this one, you can get #1 in an Amazon section with literally three sales. It’s not evidence of any sort of notability<br> – David Gerard (talk) 18:38, 29 April 2016 (UTC)</br></p></blockquote><p> It’s not evidence of notability, unless, of course, the category happens to be the one that contains every philosopher from Aristotle to Machiavelli and Rousseau. It’s been a year since SJWAL first became <a href=\"http://amzn.to/1sBYA10\">the #1 bestseller in Political Philosophy</a>. And do you know what, it still is!</p><div class=\"separator\" style=\"clear: both; text-align: center;\"> <a href=\"https://pbs.twimg.com/media/CpV8d95XgAAvpNy.jpg\" imageanchor=\"1\" style=\"margin-left: 1em; margin-right: 1em;\"><img border=\"0\" decoding=\"async\" fetchpriority=\"high\" height=\"207\" src=\"https://pbs.twimg.com/media/CpV8d95XgAAvpNy.jpg\" width=\"400\"/></a></div><p> This usefully demonstrates, by the way, why you can never take <i>anything </i>an SJW says at face value. Even when he tells the absolute literal truth, he is often doing so in a deceptive manner to cloak an obvious falsehood. For example, it is absolutely true that one “can get #1 in an Amazon section with literally three sales”, at least as long as that category is Books &gt; Medical Books &gt; Psychology &gt; Movements &gt; Transpersonal, where a bestseller only needs to hit #70,000 on Amazon to reach #1.</p><p>On the other hand, to hit #1 in Romance, you need to hit #3 overall. So, Mr. Gerard’s statement is clearly false, as a #1 Amazon category bestseller may, or may not, be evidence of notability. It depends upon the category. So, does the Political Philosophy category suffice to establish notability? One would presume so, particularly if one is attempting to determine <i>whether the author is a philosopher or not</i>.</p><p>The SJW will not hesitate to substitute the general for the particular, or the particular for the general, depending upon what he is trying to prove or disprove. It’s a standard trick upon which they rely heavily. Don’t fall for it.</p></div>",
  "content_text": "From Wikipedia\nTalk: Vox Day\nIn what sense is Vox Day a philosopher? The article only lists some half-baked (and eminently controversial) positions on race. It does not appear that he has been published in any academic journals or contributed anything to the philosophical discourse.\n— Preceding unsigned comment added by 50.232.78.130 (talk) 21:07, 12 March 2016 (UTC)\nConcur; removed. The “philosophical views” section was a political views section, so I’ve also renamed that accordingly\n– David Gerard (talk) 21:44, 12 March 2016 (UTC)\nMeh. I think it could be included due to his publication of The Irrational Atheist, which is a philosophical work. Kelly hi! 11:20, 13 March 2016 (UTC)\nI believe his work on Social Justice Warriors was the #1 seller in political philosophy for quite some time.\n— Preceding unsigned comment added by 2601:182:C902:479A:ED91:3D5B:56A6:2252 (talk) 02:01, 29 April 2016 (UTC)\nPer the section immediately below this one, you can get #1 in an Amazon section with literally three sales. It’s not evidence of any sort of notability\n– David Gerard (talk) 18:38, 29 April 2016 (UTC)\nIt’s not evidence of notability, unless, of course, the category happens to be the one that contains every philosopher from Aristotle to Machiavelli and Rousseau. It’s been a year since SJWAL first became\nthe #1 bestseller in Political Philosophy\n. And do you know what, it still is!\nThis usefully demonstrates, by the way, why you can never take\nanything\nan SJW says at face value. Even when he tells the absolute literal truth, he is often doing so in a deceptive manner to cloak an obvious falsehood. For example, it is absolutely true that one “can get #1 in an Amazon section with literally three sales”, at least as long as that category is Books > Medical Books > Psychology > Movements > Transpersonal, where a bestseller only needs to hit #70,000 on Amazon to reach #1.\nOn the other hand, to hit #1 in Romance, you need to hit #3 overall. So, Mr. Gerard’s statement is clearly false, as a #1 Amazon category bestseller may, or may not, be evidence of notability. It depends upon the category. So, does the Political Philosophy category suffice to establish notability? One would presume so, particularly if one is attempting to determine\nwhether the author is a philosopher or not\n.\nThe SJW will not hesitate to substitute the general for the particular, or the particular for the general, depending upon what he is trying to prove or disprove. It’s a standard trick upon which they rely heavily. Don’t fall for it.",
  "tags": [
    "philosophy",
    "SJW"
  ],
  "categories": [],
  "sitemap_lastmod": "2016-08-08T13:35:00+00:00"
}