{
  "url": "https://voxday.net/2016/08/17/this-is-why-we-de-tro/",
  "scraped_at": "2025-12-18T01:49:30.976820",
  "title": "This is why we de-troll",
  "date_display": "August 17, 2016",
  "date_iso": "2016-08-17T20:30:00+00:00",
  "date_from_url": "2016-08-17",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>There is absolutely no point in tolerating endless repetitions of the same argument over and over again from rhetoric-limited SJWs who cannot learn from information and whose thick skulls remain impenetrable to facts, logic, science, and history. Case in point:</p><blockquote><p> Sorry, but I happen to agree with the sentiment that many of the so-called “anti-amnesty” voices here and elsewhere are in fact, racist. I understand Ace’s use of the word “spics”- I do the same thing, in an ironic sense when I make the point that for many of you, “illegal aliens” is a code word for “dirty fucking Mexicans”.</p><p>I’m not slamming Mexicans, I’m slamming your attitude towards them and translating some weaselwords into their true meaning, without the code.<br> Posted by: docweasel at March 29, 2008 03:05 PM</br></p><p> Ah, the old “some of my best friends are dirty fucking Mexicans” ploy. I don’t know about individuals. Its possible you are not. I’m saying that by and large the “anti-amnesty” Malkinite argument is that Mexicans deserve special attacks and exclusion is that 1. Mexicans commit a lot of crimes (while posting anecdotal news items about illegal immigrant crime 2. Mexicans use a lot of services and cost the community more money than they are worth 3. Mexicans are uneducated and unskilled and unworthy of being Americans 4. go back to Mexico, we don’t want your culture here, we don’t want your language here, assimilate and “act white” or you dont deserve citizenship.</p><p>Maybe not you personally. But taht’s the way the argument has been framed. And I call racism. A lot of you say “I love Mexicans my best friend is Mexican I work with Mexicans I love Mexicans, btw, fuck Mexicans, we don’t need any more in this country, expel as many as possible and lock the rest out.</p><p>The bottom line is, I don’t believe the people who make racist arguments against Mexican immigration, then say they aren’t Mexicans: face it, live with it, if you try to STEREOTYPE an entire ethnicity by thea few criminals you are a fucking racist, period. You don’t like it and you reject it, but you are one anyway, motherfucker.<br> Posted by: docweasel at March 29, 2008 03:32 PM</br></p></blockquote><p>And just 8 years later:</p><blockquote><p> That image posted at the top of post isn’t what I’d call “Christian”- I’m the last one to be over-sensitive or pulling the race card, but that image is flat out racist.</p><p>No one who calls themselves Christian or bemoans the loss of Christian ethics has any business posting something like that, or else they have a thin grasp of exactly what Christianity is in the first place.</p><p>I only started reading this site regularly a few months ago when a link from somewhere else brought me here. If this is the tone I don’t guess this is the place for me.<br> Posted by: docweasel August 16, 2016 4:04 AM</br></p></blockquote><p>Clearly the very last one to pull out the race card. SJWs <i>ALWAYS </i>lie. The appropriately named docweasel is banned for SJW. We neither want nor need SJWs here.</p></div>",
  "content_text": "There is absolutely no point in tolerating endless repetitions of the same argument over and over again from rhetoric-limited SJWs who cannot learn from information and whose thick skulls remain impenetrable to facts, logic, science, and history. Case in point:\nSorry, but I happen to agree with the sentiment that many of the so-called “anti-amnesty” voices here and elsewhere are in fact, racist. I understand Ace’s use of the word “spics”- I do the same thing, in an ironic sense when I make the point that for many of you, “illegal aliens” is a code word for “dirty fucking Mexicans”.\nI’m not slamming Mexicans, I’m slamming your attitude towards them and translating some weaselwords into their true meaning, without the code.\nPosted by: docweasel at March 29, 2008 03:05 PM\nAh, the old “some of my best friends are dirty fucking Mexicans” ploy. I don’t know about individuals. Its possible you are not. I’m saying that by and large the “anti-amnesty” Malkinite argument is that Mexicans deserve special attacks and exclusion is that 1. Mexicans commit a lot of crimes (while posting anecdotal news items about illegal immigrant crime 2. Mexicans use a lot of services and cost the community more money than they are worth 3. Mexicans are uneducated and unskilled and unworthy of being Americans 4. go back to Mexico, we don’t want your culture here, we don’t want your language here, assimilate and “act white” or you dont deserve citizenship.\nMaybe not you personally. But taht’s the way the argument has been framed. And I call racism. A lot of you say “I love Mexicans my best friend is Mexican I work with Mexicans I love Mexicans, btw, fuck Mexicans, we don’t need any more in this country, expel as many as possible and lock the rest out.\nThe bottom line is, I don’t believe the people who make racist arguments against Mexican immigration, then say they aren’t Mexicans: face it, live with it, if you try to STEREOTYPE an entire ethnicity by thea few criminals you are a fucking racist, period. You don’t like it and you reject it, but you are one anyway, motherfucker.\nPosted by: docweasel at March 29, 2008 03:32 PM\nAnd just 8 years later:\nThat image posted at the top of post isn’t what I’d call “Christian”- I’m the last one to be over-sensitive or pulling the race card, but that image is flat out racist.\nNo one who calls themselves Christian or bemoans the loss of Christian ethics has any business posting something like that, or else they have a thin grasp of exactly what Christianity is in the first place.\nI only started reading this site regularly a few months ago when a link from somewhere else brought me here. If this is the tone I don’t guess this is the place for me.\nPosted by: docweasel August 16, 2016 4:04 AM\nClearly the very last one to pull out the race card. SJWs\nALWAYS\nlie. The appropriately named docweasel is banned for SJW. We neither want nor need SJWs here.",
  "tags": [
    "SJW",
    "Troll Ban"
  ],
  "categories": [],
  "sitemap_lastmod": "2016-08-17T19:30:00+00:00"
}