{
  "url": "https://voxday.net/2016/08/20/truesdale-expelled-from-worldcon/",
  "scraped_at": "2025-12-18T01:49:58.415079",
  "title": "Truesdale expelled from Worldcon",
  "date_display": "August 20, 2016",
  "date_iso": "2016-08-20T20:12:00+00:00",
  "date_from_url": "2016-08-20",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><div class=\"tr_bq\"> This is truly incredible. MidAmericaCon II expelled Dave Truesdale, the editor of <i>Tangent Online</i>, because he expressed views concerning the state of science fiction with which the SF-SJWs disagreed:“</div><blockquote class=\"tr_bq\"><p> <b>Dave Truesdale’s membership was revoked because he violated MidAmeriCon II’s Code of Conduct. Specifically, he caused ‘significant interference with event operation and caused excessive discomfort to others.’”</b></p></blockquote><p>Even hardcore SF-SJWs such as Jim Hines and Charles Stross find this difficult to believe. Hines wrote this before the MidAmericaCon II tweet:</p><blockquote><p> I’m not at Worldcon. I didn’t see first-hand what happened on this panel. (I have read multiple reports from folks in the audience and others on the panel.) It does sound like Truesdale acted like an ass, derailed the panel, and pissed off a lot of people who wanted to, you know, talk about the state of short fiction.<br> As you might have guessed, I have thoughts about all this…</br></p><ul><li>Who the hell thought it was a good idea to put Dave Truesdale in charge of this panel? He’s been doing these rants for years, if not decades. How can the convention turn around and pretend to be shocked by his pearl-clutching derail when that’s pretty much who he is and what he’s known for?</li></ul><ul><li>I’ve seen panel derails and blow-ups before. People have gotten into shouting matches, walked off of panels, and so on. I’ve never heard of someone being kicked out of the con for it. (Not invited back as a panelist, sure. Kicked out? Maybe it’s happened, but it’s not a practice I’m aware of.)</li></ul><ul><li>Right now, we have only Truesdale’s post about him being kicked out. It’s possible there’s more to this than just his ridiculous behavior on that panel.</li></ul><ul><li>As Truesdale has gone public with this, I hope Worldcon will issue a statement clarifying why he was expelled from the convention, and whether he violated convention policies either on the panel or elsewhere.</li></ul><ul><li>ETA: From the Worldcon Code of Conduct: “MidAmeriCon II reserves the right to revoke membership from and eject anyone at any time from a MidAmeriCon II event without a refund. Any action or behavior that … adversely affects MidAmeriCon II’s relationship with its guests, its venue, or the public is strictly forbidden and may result in revocation of membership privileges.“</li></ul><ul><li>I think we’ve all seen people derail panels for their own personal agendas. Truesdale’s moderation might have been an epic shitshow, but is it grounds for expulsion?</li></ul><p>Like I said, we don’t have all the facts on this. Just people’s comments on the panel, and Truesdale’s own account of why he was kicked out. But it sounds like a mess. </p></blockquote><p>Charles Stross even points out that “derailing a panel” is hardly unknown:</p><blockquote><p> I suspect there’s more to this than meets there eye.</p><p>Derailing a panel isn’t that unusual; and while I could see Programming quietly telling a disruptive panelist that they’re not required on any subsequent panels, that’s as far as I’d *expect* it to go. (And that would be a real pain in the neck for Programming because then they’d potentially have to find a bunch of substitutes at very short notice.)</p><p>Kicking him out of the convention completely is much more serious and I suspect there must have been some sort of face-to-face harassment incident. But as various folks have noted on twitter, MidAmeriCon say they can’t comment further, so unless the target of such an incident feels like speaking out we’re not going to find out any more.</p><p>(Truesdale has been an “anti-PC” gadfly and general nuisance presence on the net for a long time — I remember crossing swords with him on the Asimov’s reader fora back in the late 90s/early 00s before they turned into an utter cesspit no sane human would go near — and my impression is that he’s been getting more outspoken over the years.)</p></blockquote><p>Except, of course, there wasn’t. This was pure SJW thought-policing. The badthink must be expelled! Racist! Sexist! Homophobic! The Name of the Narrative compels you! This demonstrates why one should never get involved with any organization that has a Code of Conduct. They are nothing but weaponized SJWism.</p><p>We’ll discuss this and more at <a href=\"https://attendee.gotowebinar.com/register/5478904201332065028\">the Rabid Puppies Hugo Party 2016 tonight</a>. Dave, if you’re reading this, please feel free to stop by.</p><p>The SJWs are getting nervous about having their Narrative about Dave Truesdale’s expulsion from Worldcon punctured:</p><blockquote class=\"tr_bq\"><p> We might not get a chance to hear the audio of the panel. Panelist Jonathan Strahan posted this on Facebook to Dave Truesdale: “Dave, while I felt we had cordial communications on the panel yesterday, and while I tried at every point to treat you with respect and civility, I would point out that I was unaware that you were recording the panel, and that I do not consent to it being distributed publicly. I hope you will respect my request and not do so. Best, Jonathan.”</p></blockquote><p>Oh, I rather suspect everyone will. This is why you ALWAYS record SJWs. Because, well, you know what they always do.</p></div>",
  "content_text": "This is truly incredible. MidAmericaCon II expelled Dave Truesdale, the editor of\nTangent Online\n, because he expressed views concerning the state of science fiction with which the SF-SJWs disagreed:“\nDave Truesdale’s membership was revoked because he violated MidAmeriCon II’s Code of Conduct. Specifically, he caused ‘significant interference with event operation and caused excessive discomfort to others.’”\nEven hardcore SF-SJWs such as Jim Hines and Charles Stross find this difficult to believe. Hines wrote this before the MidAmericaCon II tweet:\nI’m not at Worldcon. I didn’t see first-hand what happened on this panel. (I have read multiple reports from folks in the audience and others on the panel.) It does sound like Truesdale acted like an ass, derailed the panel, and pissed off a lot of people who wanted to, you know, talk about the state of short fiction.\nAs you might have guessed, I have thoughts about all this…\nWho the hell thought it was a good idea to put Dave Truesdale in charge of this panel? He’s been doing these rants for years, if not decades. How can the convention turn around and pretend to be shocked by his pearl-clutching derail when that’s pretty much who he is and what he’s known for?\nI’ve seen panel derails and blow-ups before. People have gotten into shouting matches, walked off of panels, and so on. I’ve never heard of someone being kicked out of the con for it. (Not invited back as a panelist, sure. Kicked out? Maybe it’s happened, but it’s not a practice I’m aware of.)\nRight now, we have only Truesdale’s post about him being kicked out. It’s possible there’s more to this than just his ridiculous behavior on that panel.\nAs Truesdale has gone public with this, I hope Worldcon will issue a statement clarifying why he was expelled from the convention, and whether he violated convention policies either on the panel or elsewhere.\nETA: From the Worldcon Code of Conduct: “MidAmeriCon II reserves the right to revoke membership from and eject anyone at any time from a MidAmeriCon II event without a refund. Any action or behavior that … adversely affects MidAmeriCon II’s relationship with its guests, its venue, or the public is strictly forbidden and may result in revocation of membership privileges.“\nI think we’ve all seen people derail panels for their own personal agendas. Truesdale’s moderation might have been an epic shitshow, but is it grounds for expulsion?\nLike I said, we don’t have all the facts on this. Just people’s comments on the panel, and Truesdale’s own account of why he was kicked out. But it sounds like a mess.\nCharles Stross even points out that “derailing a panel” is hardly unknown:\nI suspect there’s more to this than meets there eye.\nDerailing a panel isn’t that unusual; and while I could see Programming quietly telling a disruptive panelist that they’re not required on any subsequent panels, that’s as far as I’d *expect* it to go. (And that would be a real pain in the neck for Programming because then they’d potentially have to find a bunch of substitutes at very short notice.)\nKicking him out of the convention completely is much more serious and I suspect there must have been some sort of face-to-face harassment incident. But as various folks have noted on twitter, MidAmeriCon say they can’t comment further, so unless the target of such an incident feels like speaking out we’re not going to find out any more.\n(Truesdale has been an “anti-PC” gadfly and general nuisance presence on the net for a long time — I remember crossing swords with him on the Asimov’s reader fora back in the late 90s/early 00s before they turned into an utter cesspit no sane human would go near — and my impression is that he’s been getting more outspoken over the years.)\nExcept, of course, there wasn’t. This was pure SJW thought-policing. The badthink must be expelled! Racist! Sexist! Homophobic! The Name of the Narrative compels you! This demonstrates why one should never get involved with any organization that has a Code of Conduct. They are nothing but weaponized SJWism.\nWe’ll discuss this and more at\nthe Rabid Puppies Hugo Party 2016 tonight\n. Dave, if you’re reading this, please feel free to stop by.\nThe SJWs are getting nervous about having their Narrative about Dave Truesdale’s expulsion from Worldcon punctured:\nWe might not get a chance to hear the audio of the panel. Panelist Jonathan Strahan posted this on Facebook to Dave Truesdale: “Dave, while I felt we had cordial communications on the panel yesterday, and while I tried at every point to treat you with respect and civility, I would point out that I was unaware that you were recording the panel, and that I do not consent to it being distributed publicly. I hope you will respect my request and not do so. Best, Jonathan.”\nOh, I rather suspect everyone will. This is why you ALWAYS record SJWs. Because, well, you know what they always do.",
  "tags": [
    "freakshow",
    "Hugo Award",
    "SJW"
  ],
  "categories": [],
  "sitemap_lastmod": "2016-08-20T19:12:00+00:00"
}