{
  "url": "https://voxday.net/2016/08/15/well-who-needs-roads/",
  "scraped_at": "2025-12-18T01:49:09.530191",
  "title": "Well, who needs roads?",
  "date_display": "August 15, 2016",
  "date_iso": "2016-08-15T16:14:00+00:00",
  "date_from_url": "2016-08-15",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>Tell me again how immigration <a href=\"http://www.breitbart.com/london/2016/08/15/calais-locals-warned-to-stay-away-from-main-roads-as-migrants-smash-vehicles/\">is good for the economy</a>:</p><blockquote><p> Migrants wielding bats and knives have been smashing up vehicles on roads near Calais as their owners sit in traffic, reportedly “just for fun”. Local residents are warning others to avoid the area, saying that the migrants are not even checking to see whether children are in the vehicles before they set upon them.<br> One resident has posted pictures to Facebook of her brother-in-law’s car, which sustained more than €500 worth of damage when over a dozen migrants set about it with bats, completely smashing a side mirror and the rear window, and shattering the windscreen.</br></p><p>“You’re leaving work and then you’re attacked by migrant shits just for fun – it disgusts me!” commented Maëva Mayla, in a post which has been shared by more than 6,000 people.</p><p>“Tell your relatives so that they can avoid it happening to them,” she advises, before appealing for others who have experienced similar attacks to come forward so that they could mount a joint compensation claim.</p><p>A number of people have left comments of support, and expressing anger at the situation in Calais. Nathalie Brioit said it is “a shame they have all the rights,” while Marine Gabrielle confessed “I no longer use the highway as I’m so scared.”</p></blockquote><p>Let reason and outdated economic theory be silent when experience contradicts it.</p></div>",
  "content_text": "Tell me again how immigration\nis good for the economy\n:\nMigrants wielding bats and knives have been smashing up vehicles on roads near Calais as their owners sit in traffic, reportedly “just for fun”. Local residents are warning others to avoid the area, saying that the migrants are not even checking to see whether children are in the vehicles before they set upon them.\nOne resident has posted pictures to Facebook of her brother-in-law’s car, which sustained more than €500 worth of damage when over a dozen migrants set about it with bats, completely smashing a side mirror and the rear window, and shattering the windscreen.\n“You’re leaving work and then you’re attacked by migrant shits just for fun – it disgusts me!” commented Maëva Mayla, in a post which has been shared by more than 6,000 people.\n“Tell your relatives so that they can avoid it happening to them,” she advises, before appealing for others who have experienced similar attacks to come forward so that they could mount a joint compensation claim.\nA number of people have left comments of support, and expressing anger at the situation in Calais. Nathalie Brioit said it is “a shame they have all the rights,” while Marine Gabrielle confessed “I no longer use the highway as I’m so scared.”\nLet reason and outdated economic theory be silent when experience contradicts it.",
  "tags": [
    "Clash of Civilizations",
    "economics"
  ],
  "categories": [],
  "sitemap_lastmod": "2016-08-15T15:14:00+00:00"
}