{
  "url": "https://voxday.net/2016/08/23/why-worldcon-changed-rules/",
  "scraped_at": "2025-12-18T01:50:18.575633",
  "title": "Why Worldcon changed the rules",
  "date_display": "August 23, 2016",
  "date_iso": "2016-08-23T09:04:00+00:00",
  "date_from_url": "2016-08-23",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>Year: votes (nominations)<br> 2012: 1922 (1101)<br> 2013: 1848 (1343)<br> 2014: 3587 (1923)<br> 2015: 5950 (2112)<br> 2016: 3130 (4032)</br></br></br></br></br></p><p>The number of nominations rose in 2014 and 2015 due to the appearance of Sad Puppies, then Rabid Puppies. The big influx of Supporting Members began in 2014, when the SJWs, alarmed, gathered the herd to No Award Larry Correia and the rest of the Puppy finalists. They made an even bigger effort in 2015 in response to the Rabid Puppies.</p><p>However, their morale suffered a terrible blow when, despite there being nearly four times as many nominations cast in 2016 than in 2012, the Rabid Puppies selected more finalists than the Sad Puppies ever did. While most RP’s didn’t bother getting MidAmericaCon memberships in order to vote, what’s interesting is that over 2,000 SJWs didn’t either.</p><p>Anyhow, the first stage is now over. The new award has been established and the Hugo rules have been modified and complicated, as anticipated. Now we’re onto the second stage, which will last longer and promises to be more interesting than the first. RPs, be sure to keep your voting/nomination emails from Sasquan and MidAmericaCon, as you may need them next year if you are neither Brainstorm nor VFM.</p><p>We got here one year faster than I thought, as apparently a) we scared them worse than I’d expected and b) it turns out they care a lot more about me than they do about quality science fiction or science fiction history.</p><p>I wasn’t surprised that Toni Weisskopf didn’t win last year, but I was surprised that they voted her below No Award. This year, it doesn’t even surprise me a little bit that they would No Award an objectively high-quality work such as <i>Between Light and Shadow</i> or accomplished, highly respected individuals in the field such as Larry Elmore and Jerry Pournelle, who reportedly had the longest book-signing line at Worldcon.</p><p>I wonder how many SJWs who were begging for Dr. Pournelle’s signature had previously claimed that he did not merit a Best Editor award with their vote? Do tell us more about how the Hugo Awards concern quality and standing in the field, not SJW-driven politics.</p><p>951 No Award<br> 766 Jerry Pournelle</br></p><p>893 No Award<br> 497 Larry Elmore</br></p><p>That says it all about how seriously the awards deserve to be taken by science fiction readers these days. John Scalzi <a href=\"http://whatever.scalzi.com/2016/08/22/gum-on-the-shoe-of-history-or-why-the-hugos-are-still-not-destroyed/\">summed up the SF-SJW position</a> rather well in a long diatribe yesterday. It’s rather remarkable how he devotes <strike>nearly 1,500</strike> 1,887 words to informing the world that absolutely none of it is about me, and somehow manages to do so while giving absolutely zero fucks.</p><ul><li><i>What [the man whose blog traffic is now 6x that of the erstwhile “most popular blog in science fiction”] is really doing at this point is trying to mitigate his own inability to have the status and influence he assumed would be his, by pathetically attempting to shoehorn himself into the history of others who have done more, and better, than he has.</i></li><li><i>An active association with [the man who exposed Scalzi as a fraud] is, bluntly, death for your Hugo award chances. I mean, it takes a lot for someone as esteemed in the field as Jerry Pournelle to finish below “No Award” in Hugo voting, and yet, there he is, sixth in a field of five in the category of Best Editor, Short Form.</i></li></ul><p></p><div> Translation: Vox Day is totally irrelevant and pathetic and doesn’t matter at all, so don’t you dare to associate with him in any way, shape, or form, or it will kill your career, no one will ever give you a Hugo Award, and everyone will hate you. Please, <i>please</i>, don’t do it!<p>What a masterpiece of its kind. As it is written, <b><i><a href=\"http://amzn.to/1sBYA10\">SJWs always lie</a></i></b>. Just wait until Mr. ZFG learns what names are risking SJW disapproval to actively associate with Castalia House in 2017. But if an author doesn’t want to associate with the publishing house that is the fastest-growing in the field and pays such high royalties that the much larger publisher who inquired about acquiring it begged me to consider reducing them, that’s certainly their right. We don’t publish SJWs anyhow.</p><p>I particularly enjoyed McRapey’s attempt to cling to the original Narrative he’d tried to spin about the nomination of “Space Raptor Butt Invasion” being a devastating mistake on my part.</p><p><i>Rather than being appalled that Tingle had been nominated, the Worldcon community largely embraced him (or whoever Tingle is; no one is really sure). Here was someone who was nominated by a bigot to antagonize other people, who instead allied himself with those folks and was appreciated by them in return.</i></p><p>1508 No Award<br> 659 “Space Raptor Butt Invasion”</br></p><p>Apparently those folks appreciate Mr. Tingle just about as much as they appreciate me. Did I not tell you that would happen despite the SJW’s feigned joy over how terribly funny and brilliant they found Mr. Tingle’s work?</p><p>Because, as we know, <b><i><a href=\"http://amzn.to/1sBYA10\">SJW’s always lie</a></i></b>.</p><p> UPDATE: Dr. Pournelle <a href=\"https://www.jerrypournelle.com/chaosmanor/home-from-worldcon/\">is quite clearly crushed</a>, and duly penitent, in consequence of his well-merited rebuke at the hands of Worldcon’s SJWs.</p><p>UPDATE: The Reverend 3.0 <a href=\"https://therev3.blogspot.ch/2016/08/reduxing-vox-day-post-hugos-commentary.html\">considers his failed prediction</a> concerning “Space Raptor Butt Invasion” winning Best Short Story:</p><blockquote><p> I was incorrect. And while I’m ready to tuck in and eat my words, it’s interesting to look at where my logic broke down.</p><p>My logic was the following:<br> -Puppies will vote for it because they think it is hilarious, embarrasses the Hugos, and Chuck is one of them.<br> -Puppy Kickers will vote for it because they think it is hilarious, embarrasses the Puppies, and Chuck is one of them.<br> -If the two largest blocks vote for it, it can’t lose.</br></br></br></p><p>But lo and behold, one of these two voting blocks failed to vote for SRBI and instead propelled Cat Pictures to victory and Noah Ward to second place. One of these two blocks was either lying to itself or lying through its teeth.</p><p>My prediction failed, and it failed because one of these two groups said one thing and then did another. So which group is the group of dirty liars? The Puppies? The Kickers? I’m sure the ballot numbers will tell.</p><p>Either way, learn from my mistake. Take that group’s tendency to lie into account in the future.</p></blockquote><p>Now, I wonder who might have been lying and putting forth a false Narrative? </p></div></div>",
  "content_text": "Year: votes (nominations)\n2012: 1922 (1101)\n2013: 1848 (1343)\n2014: 3587 (1923)\n2015: 5950 (2112)\n2016: 3130 (4032)\nThe number of nominations rose in 2014 and 2015 due to the appearance of Sad Puppies, then Rabid Puppies. The big influx of Supporting Members began in 2014, when the SJWs, alarmed, gathered the herd to No Award Larry Correia and the rest of the Puppy finalists. They made an even bigger effort in 2015 in response to the Rabid Puppies.\nHowever, their morale suffered a terrible blow when, despite there being nearly four times as many nominations cast in 2016 than in 2012, the Rabid Puppies selected more finalists than the Sad Puppies ever did. While most RP’s didn’t bother getting MidAmericaCon memberships in order to vote, what’s interesting is that over 2,000 SJWs didn’t either.\nAnyhow, the first stage is now over. The new award has been established and the Hugo rules have been modified and complicated, as anticipated. Now we’re onto the second stage, which will last longer and promises to be more interesting than the first. RPs, be sure to keep your voting/nomination emails from Sasquan and MidAmericaCon, as you may need them next year if you are neither Brainstorm nor VFM.\nWe got here one year faster than I thought, as apparently a) we scared them worse than I’d expected and b) it turns out they care a lot more about me than they do about quality science fiction or science fiction history.\nI wasn’t surprised that Toni Weisskopf didn’t win last year, but I was surprised that they voted her below No Award. This year, it doesn’t even surprise me a little bit that they would No Award an objectively high-quality work such as\nBetween Light and Shadow\nor accomplished, highly respected individuals in the field such as Larry Elmore and Jerry Pournelle, who reportedly had the longest book-signing line at Worldcon.\nI wonder how many SJWs who were begging for Dr. Pournelle’s signature had previously claimed that he did not merit a Best Editor award with their vote? Do tell us more about how the Hugo Awards concern quality and standing in the field, not SJW-driven politics.\n951 No Award\n766 Jerry Pournelle\n893 No Award\n497 Larry Elmore\nThat says it all about how seriously the awards deserve to be taken by science fiction readers these days. John Scalzi\nsummed up the SF-SJW position\nrather well in a long diatribe yesterday. It’s rather remarkable how he devotes\nnearly 1,500\n1,887 words to informing the world that absolutely none of it is about me, and somehow manages to do so while giving absolutely zero fucks.\nWhat [the man whose blog traffic is now 6x that of the erstwhile “most popular blog in science fiction”] is really doing at this point is trying to mitigate his own inability to have the status and influence he assumed would be his, by pathetically attempting to shoehorn himself into the history of others who have done more, and better, than he has.\nAn active association with [the man who exposed Scalzi as a fraud] is, bluntly, death for your Hugo award chances. I mean, it takes a lot for someone as esteemed in the field as Jerry Pournelle to finish below “No Award” in Hugo voting, and yet, there he is, sixth in a field of five in the category of Best Editor, Short Form.\nTranslation: Vox Day is totally irrelevant and pathetic and doesn’t matter at all, so don’t you dare to associate with him in any way, shape, or form, or it will kill your career, no one will ever give you a Hugo Award, and everyone will hate you. Please,\nplease\n, don’t do it!\nWhat a masterpiece of its kind. As it is written,\nSJWs always lie\n. Just wait until Mr. ZFG learns what names are risking SJW disapproval to actively associate with Castalia House in 2017. But if an author doesn’t want to associate with the publishing house that is the fastest-growing in the field and pays such high royalties that the much larger publisher who inquired about acquiring it begged me to consider reducing them, that’s certainly their right. We don’t publish SJWs anyhow.\nI particularly enjoyed McRapey’s attempt to cling to the original Narrative he’d tried to spin about the nomination of “Space Raptor Butt Invasion” being a devastating mistake on my part.\nRather than being appalled that Tingle had been nominated, the Worldcon community largely embraced him (or whoever Tingle is; no one is really sure). Here was someone who was nominated by a bigot to antagonize other people, who instead allied himself with those folks and was appreciated by them in return.\n1508 No Award\n659 “Space Raptor Butt Invasion”\nApparently those folks appreciate Mr. Tingle just about as much as they appreciate me. Did I not tell you that would happen despite the SJW’s feigned joy over how terribly funny and brilliant they found Mr. Tingle’s work?\nBecause, as we know,\nSJW’s always lie\n.\nUPDATE: Dr. Pournelle\nis quite clearly crushed\n, and duly penitent, in consequence of his well-merited rebuke at the hands of Worldcon’s SJWs.\nUPDATE: The Reverend 3.0\nconsiders his failed prediction\nconcerning “Space Raptor Butt Invasion” winning Best Short Story:\nI was incorrect. And while I’m ready to tuck in and eat my words, it’s interesting to look at where my logic broke down.\nMy logic was the following:\n-Puppies will vote for it because they think it is hilarious, embarrasses the Hugos, and Chuck is one of them.\n-Puppy Kickers will vote for it because they think it is hilarious, embarrasses the Puppies, and Chuck is one of them.\n-If the two largest blocks vote for it, it can’t lose.\nBut lo and behold, one of these two voting blocks failed to vote for SRBI and instead propelled Cat Pictures to victory and Noah Ward to second place. One of these two blocks was either lying to itself or lying through its teeth.\nMy prediction failed, and it failed because one of these two groups said one thing and then did another. So which group is the group of dirty liars? The Puppies? The Kickers? I’m sure the ballot numbers will tell.\nEither way, learn from my mistake. Take that group’s tendency to lie into account in the future.\nNow, I wonder who might have been lying and putting forth a false Narrative?",
  "tags": [
    "Hugo Award",
    "McRapey",
    "SJW"
  ],
  "categories": [],
  "sitemap_lastmod": "2016-08-23T08:04:00+00:00"
}