{
  "url": "https://voxday.net/2006/11/23/captain-ed-steers-awry/",
  "scraped_at": "2026-01-08T21:23:50.165051",
  "title": "Captain Ed steers awry",
  "date_display": "November 23, 2006",
  "date_iso": "2006-11-23T09:21:00+00:00",
  "date_from_url": "2006-11-23",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>The Good Captain makes a mistake in criticizing <a href=\"http://www.captainsquartersblog.com/mt/archives/008559.php\">Tom Tancredo’s exposure of George Bush’s treason</a> in selling out the nation to the North American Union:</p><blockquote><p><em>Tancredo lashed out at the White House’s lack of action in securing U.S. borders, and said efforts to merge the U.S. with both Mexico and Canada is not a fantasy.</em></p><p>“I know this is dramatic – or maybe somebody would say overly dramatic – but I’m telling you, that everything I see leads me to believe that this whole idea of the North American Union, it’s not something that just is written about by right-wing fringe kooks. It is something in the head of the president of the United States, the president of Mexico, I think the prime minister of Canada buys into it. …</p><p>This is absurd. George Bush may not have responded very well to immigration concerns from his base, but he’s done more than his father, Bill Clinton, and even Ronald Reagan in bolstering border security. Tancredo is engaging in mindless demagoguery with these doomsday descriptions, and moving closer to the realms of paranoia.</p></blockquote><p>Unfortunately, on this particular matter, the normally observant Captain Ed is being a blind, parochial and historically ignorant fool.  The direction is obvious to anyone who is even remotely familiar with the way in which the various countries of Europe were led by their political elites from sovereign nations into a single, anti-democratic, autocratic superstate.  It should give the Captain pause to consider that Mr. Regression to the Mean himself, Jon Podhoretz, <a href=\"http://corner.nationalreview.com/post/?q=MTRjN2EwNWJjNDg0NTRlM2VhMTQ2NjVjZjgzMWFlNDM=\">is in full agreement with him here</a>.</p><p>Consider the words of Lady Thatcher from a column I wrote in 2002: <em>“The wisdom of hindsight, so useful to historians and indeed to authors of memoirs, is sadly denied to practicing politicians. Looking back, it is now possible to see the period of my second term as prime minister as that in which the European Community subtly but surely shifted its direction away from being a community of open trade, light regulation and freely co-operating sovereign nation-states towards statism and centralism….</em></p><p>“We had to learn the hard way that by agreement to what were apparently empty generalizations or vague aspirations we were later held to have committed ourselves to political structures which were contrary to our interests.” </p><p>This process is now at work in the United States and has been since 1992, the same year as Maastricht.  Based on the European model, the USA will reach full monetary integration with Mexico and Canada before 2043, most likely in the 2030s.  Given the current pattern and the leading position of the dollar, the open abandonment of national sovereignty will likely follow that monetary integration.</p><p>It is worth noting that the European Union is celebrating its 50th anniversary 14 years after it officially became the European Union and four years after the introduction of the Euro.</p></div>",
  "content_text": "The Good Captain makes a mistake in criticizing\nTom Tancredo’s exposure of George Bush’s treason\nin selling out the nation to the North American Union:\nTancredo lashed out at the White House’s lack of action in securing U.S. borders, and said efforts to merge the U.S. with both Mexico and Canada is not a fantasy.\n“I know this is dramatic – or maybe somebody would say overly dramatic – but I’m telling you, that everything I see leads me to believe that this whole idea of the North American Union, it’s not something that just is written about by right-wing fringe kooks. It is something in the head of the president of the United States, the president of Mexico, I think the prime minister of Canada buys into it. …\nThis is absurd. George Bush may not have responded very well to immigration concerns from his base, but he’s done more than his father, Bill Clinton, and even Ronald Reagan in bolstering border security. Tancredo is engaging in mindless demagoguery with these doomsday descriptions, and moving closer to the realms of paranoia.\nUnfortunately, on this particular matter, the normally observant Captain Ed is being a blind, parochial and historically ignorant fool.  The direction is obvious to anyone who is even remotely familiar with the way in which the various countries of Europe were led by their political elites from sovereign nations into a single, anti-democratic, autocratic superstate.  It should give the Captain pause to consider that Mr. Regression to the Mean himself, Jon Podhoretz,\nis in full agreement with him here\n.\nConsider the words of Lady Thatcher from a column I wrote in 2002:\n“The wisdom of hindsight, so useful to historians and indeed to authors of memoirs, is sadly denied to practicing politicians. Looking back, it is now possible to see the period of my second term as prime minister as that in which the European Community subtly but surely shifted its direction away from being a community of open trade, light regulation and freely co-operating sovereign nation-states towards statism and centralism….\n“We had to learn the hard way that by agreement to what were apparently empty generalizations or vague aspirations we were later held to have committed ourselves to political structures which were contrary to our interests.”\nThis process is now at work in the United States and has been since 1992, the same year as Maastricht.  Based on the European model, the USA will reach full monetary integration with Mexico and Canada before 2043, most likely in the 2030s.  Given the current pattern and the leading position of the dollar, the open abandonment of national sovereignty will likely follow that monetary integration.\nIt is worth noting that the European Union is celebrating its 50th anniversary 14 years after it officially became the European Union and four years after the introduction of the Euro.",
  "tags": [],
  "categories": [],
  "sitemap_lastmod": "2006-11-23T09:21:00+00:00"
}