{
  "url": "https://voxday.net/2006/11/02/cats-mea/",
  "scraped_at": "2026-01-08T21:22:14.191310",
  "title": "Cat’s meat",
  "date_display": "November 2, 2006",
  "date_iso": "2006-11-02T11:04:00+00:00",
  "date_from_url": "2006-11-02",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>And here I thought the whole notion of <a href=\"http://www.timesonline.co.uk/article/0,,1071-2432347,00.html\">uncontrollable sexual urges</a> was the foundational premise of the anti-abstinence, sex ed crew, to say nothing of the homophiliacs:</p><blockquote><p>…coming soon after several particularly nasty cases of gang rape by young Muslim men in Australia, the sheikh’s sermon seemed to be absolving the attackers from responsibility.</p><p>In the Sydney case to which he was referring, the 18-year-old victim was raped 25 times by up to 14 men. She hadn’t been walking, skimpily dressed, down a dark alley at 3am. She had been sitting on a train, wearing her best suit for a job interview and reading The Great Gatsby. Yet the rapists still called her a “slut” and an “Aussie pig”.</p><p>Of course only a minuscule fraction of Muslim men are rapists; the rest are upright, law-abiding citizens. But the premise of the dress code is still that men’s impulses cannot be controlled unless women hide themselves. Why should not Muslim men start to take more responsibility for their sexual desires, rather than expecting women to dress absurdly modestly, lest the sight of a bare arm or even a lock of hair should lead them to uncontrollable sexual urges?</p></blockquote><p>Actually, the Muslim position isn’t indefensible.  The unfortunate young woman’s respectable attire notwithstanding, there’s about a <a href=\"http://www.signonsandiego.com/news/education/20051005-9999-1m5survey.html\">one-in-two chance</a> she was a slut anyhow.  Certainly a significant percentage of 18 year-old women in the United States are promiscuous, a fact for which I was was very grateful as an 18 year-old man.</p><p>Now, I don’t believe that rape is an appropriate response to an attractive slut, especially when buying her a drink or two will usually suffice to convince her to give you what you’d otherwise be taking by force.  But since alchohol is out for Muslims and the victim is losing nothing that she hasn’t presumably lost already, (virginity, dignity, etc), there is a certain alien logic to their perspective.</p><p>Although it’s perhaps not quite as alien as most of us in the West would like it to be.  After all, we are informed that abstinence is not an option for controlling sexually-transmitted diseases or banning homosexuality since no one is capable of controlling their urges to have sex.  But if the sexual urge is irresistable, how could the consent of the other party possibly be a factor that enters into one’s consideration?  If sex is inevitable, then so is rape, unless, of course, you seriously believe that rape is primarily about eating disorders or whatever irrelevant nonsense the feminists are pushing these days.</p><p>In any event, as Spacebunny points out, it’s incredible that this is what is upsetting Westerners most about Muslims these days.  Never mind the teenage beheadings….</p></div>",
  "content_text": "And here I thought the whole notion of\nuncontrollable sexual urges\nwas the foundational premise of the anti-abstinence, sex ed crew, to say nothing of the homophiliacs:\n…coming soon after several particularly nasty cases of gang rape by young Muslim men in Australia, the sheikh’s sermon seemed to be absolving the attackers from responsibility.\nIn the Sydney case to which he was referring, the 18-year-old victim was raped 25 times by up to 14 men. She hadn’t been walking, skimpily dressed, down a dark alley at 3am. She had been sitting on a train, wearing her best suit for a job interview and reading The Great Gatsby. Yet the rapists still called her a “slut” and an “Aussie pig”.\nOf course only a minuscule fraction of Muslim men are rapists; the rest are upright, law-abiding citizens. But the premise of the dress code is still that men’s impulses cannot be controlled unless women hide themselves. Why should not Muslim men start to take more responsibility for their sexual desires, rather than expecting women to dress absurdly modestly, lest the sight of a bare arm or even a lock of hair should lead them to uncontrollable sexual urges?\nActually, the Muslim position isn’t indefensible.  The unfortunate young woman’s respectable attire notwithstanding, there’s about a\none-in-two chance\nshe was a slut anyhow.  Certainly a significant percentage of 18 year-old women in the United States are promiscuous, a fact for which I was was very grateful as an 18 year-old man.\nNow, I don’t believe that rape is an appropriate response to an attractive slut, especially when buying her a drink or two will usually suffice to convince her to give you what you’d otherwise be taking by force.  But since alchohol is out for Muslims and the victim is losing nothing that she hasn’t presumably lost already, (virginity, dignity, etc), there is a certain alien logic to their perspective.\nAlthough it’s perhaps not quite as alien as most of us in the West would like it to be.  After all, we are informed that abstinence is not an option for controlling sexually-transmitted diseases or banning homosexuality since no one is capable of controlling their urges to have sex.  But if the sexual urge is irresistable, how could the consent of the other party possibly be a factor that enters into one’s consideration?  If sex is inevitable, then so is rape, unless, of course, you seriously believe that rape is primarily about eating disorders or whatever irrelevant nonsense the feminists are pushing these days.\nIn any event, as Spacebunny points out, it’s incredible that this is what is upsetting Westerners most about Muslims these days.  Never mind the teenage beheadings….",
  "tags": [],
  "categories": [],
  "sitemap_lastmod": "2006-11-02T11:04:00+00:00"
}