{
  "url": "https://voxday.net/2006/11/03/do-they-not-know-how-this-works/",
  "scraped_at": "2026-01-08T21:22:21.595930",
  "title": "Do they not know how this works?",
  "date_display": "November 3, 2006",
  "date_iso": "2006-11-03T10:04:00+00:00",
  "date_from_url": "2006-11-03",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><blockquote><p><b>13 Mafia family heads arrested</b><br>Italian police arrested at least 45 people in dawn raids aimed at thwarting an all-out Mafia war of succession after the capture in April of Bernardo Provenzano, the “boss of bosses”.</br></p><p>Police said that the suspects, including the heads of 13 Mafia families in Sicily, made up a support network that had allowed Provenzano to stay on the run for 43 years. In all, 52 arrest warrants were issued and some were still being served last night.</p><p>Francesco Caruso, the Palermo police chief, said: “Through wiretaps, we found out that winds of war were blowing in Palermo that could have started a new Mafia war, and so we moved in.” <br>– June 21, 2006</br></p><p><b>Prodi steps in as Mafia war rages out of control</b></p><p>By yesterday, as Romano Prodi, the Italian Prime Minister, met local leaders in Naples to discuss how to tackle the apparently unstoppable wave of mob killings, rain had washed away most of the blood on the steps.</p><p>The violence, which has claimed a life a day over the past week, has led government ministers to talk of bringing in the Army to restore order. Yesterday Signor Prodi said that the deployment of troops was “not excluded”, but for the time being the solution lay in supplying 1,300 extra police and in “relaunching the economy in the South”….</p><p>Police in Naples say that the violence has spiralled out of control, paradoxically, because of their success in putting traditional Camorra bosses behind bars.</p><p>The Mafia power structure that once held communities in sway has disintegrated, with trigger-happy younger mafiosi feuding for control of individual clans and the cocaine and heroin trade. There have been 75 murders this year, 12 in the past ten days. <br>– November 2, 2006</br></p></blockquote><p>There is no paradox, and the Naples dilemma applies to the Middle East as well.  One can take out the evil strong man, but there is never going to be a shortage of ruthless and evil men who are eager to replace him.  But this isn’t necessarily a bad thing in all circumstances, especially if your primary concern happens to be keeping the bad guys occupied somewhere other than in the United States.</p><p>In fact, stability in the Middle East is the very last thing that is needed in a period of resurgent expansionist Islam.  I find it amazing how government authorities will so often dedicate themselves to actions that are bound to cause the very results they are supposed to prevent.  And yet somehow, this never seems to slow down the “we have to do something” crowd.</p></div>",
  "content_text": "13 Mafia family heads arrested\nItalian police arrested at least 45 people in dawn raids aimed at thwarting an all-out Mafia war of succession after the capture in April of Bernardo Provenzano, the “boss of bosses”.\nPolice said that the suspects, including the heads of 13 Mafia families in Sicily, made up a support network that had allowed Provenzano to stay on the run for 43 years. In all, 52 arrest warrants were issued and some were still being served last night.\nFrancesco Caruso, the Palermo police chief, said: “Through wiretaps, we found out that winds of war were blowing in Palermo that could have started a new Mafia war, and so we moved in.”\n– June 21, 2006\nProdi steps in as Mafia war rages out of control\nBy yesterday, as Romano Prodi, the Italian Prime Minister, met local leaders in Naples to discuss how to tackle the apparently unstoppable wave of mob killings, rain had washed away most of the blood on the steps.\nThe violence, which has claimed a life a day over the past week, has led government ministers to talk of bringing in the Army to restore order. Yesterday Signor Prodi said that the deployment of troops was “not excluded”, but for the time being the solution lay in supplying 1,300 extra police and in “relaunching the economy in the South”….\nPolice in Naples say that the violence has spiralled out of control, paradoxically, because of their success in putting traditional Camorra bosses behind bars.\nThe Mafia power structure that once held communities in sway has disintegrated, with trigger-happy younger mafiosi feuding for control of individual clans and the cocaine and heroin trade. There have been 75 murders this year, 12 in the past ten days.\n– November 2, 2006\nThere is no paradox, and the Naples dilemma applies to the Middle East as well.  One can take out the evil strong man, but there is never going to be a shortage of ruthless and evil men who are eager to replace him.  But this isn’t necessarily a bad thing in all circumstances, especially if your primary concern happens to be keeping the bad guys occupied somewhere other than in the United States.\nIn fact, stability in the Middle East is the very last thing that is needed in a period of resurgent expansionist Islam.  I find it amazing how government authorities will so often dedicate themselves to actions that are bound to cause the very results they are supposed to prevent.  And yet somehow, this never seems to slow down the “we have to do something” crowd.",
  "tags": [],
  "categories": [],
  "sitemap_lastmod": "2006-11-03T10:04:00+00:00"
}