{
  "url": "https://voxday.net/2006/11/28/does-richard-dawkins-hate-jews/",
  "scraped_at": "2026-01-08T21:24:08.484234",
  "title": "Does Richard Dawkins hate Jews?",
  "date_display": "November 28, 2006",
  "date_iso": "2006-11-28T13:21:00+00:00",
  "date_from_url": "2006-11-28",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>As is his occasional wont, Orac again shows off his reading disability.  In <a href=\"http://scienceblogs.com/insolence/2006/11/richard_dawkins_a_eugenicist.php\">a response to my post about Dawkins wishing to reopen the eugenics discussion</a>, (please note the link is right here at the top, one wouldn’t wish to wound him to the quick again), he strangely claims the following question is “the old “atheists are inherently immoral and nihilistic” canard taken to a truly idiotic “atheism leads to necrophilia” extreme.”</p><p><em>Seriously, on what basis does the atheist prosecute the individual who digs up a few kilos of rotting flesh in order to have sex with it?</em></p><p>So,Orac not only mischaracterizes my question, he fails to even begin to answer it.  I did not state that the necrophiliac was an atheist, I merely wanted to know what universal claim the atheist makes for his morality that would suffice to at least criticize the amorous shoveler, to say nothing of prosecuting him criminally.  This is ironic, given that Orac’s post claims that I am mischaracterizing Dawkins position on eugenics.</p><p>Since I think this could be reasonably argued, why don’t we consider Dawkins’ position in a slightly different light.  There were other aspects of the Hitler show besides eugenics, after all.  What would a reasonable reader conclude about Richard Dawkins had he written this?</p><p><em>Today, I suspect that anti-semitism is too dangerous for comfortable discussion, and my conjecture is that Adolf Hitler is responsible for the change.  Nobody wants to be caught agreeing with that monster, even in a single particular….  I wonder whether, some 60 years after Hitler’s death, we might at least venture to ask what the moral difference is between executing criminals and killing Jews. Or why it is acceptable for the Israelis to oppress Palestinians, but not for Europeans to oppress Jews. I can think of some answers, and they are good ones, which would probably end up persuading me. But hasn’t the time come when we should stop being frightened even to put the question?</em></p><p>So, Orac, is the above paragraph anti-semitic? (And by anti-semitic, I mean the conventional Judenhassen sense of the term.)  Do let me know.  I’m genuinely curious about what you think here.</p><p>Now, one doesn’t have to already have an answer in mind to ask a question, but given what we know of Dawkins through his books, I don’t think one has to be overly suspicious of the man to not at least suspect that the guy would be delighted to be given the chance to head up a department of evolutionary eugenics at Oxford.</p><p>Orac goes on to discuss a theoretical justification of voluntary eugenics, which is interesting, but unfortunately skates lightly over the coercive element inherent in the term “breeding”.  And given Dawkins’ examples of domesticated animals, it is clear that he isn’t talking about a voluntary program here, but an involuntary one imposed on those being bred.  As such, it is grossly reprehensible from both a moral and an ideological point of view.</p><p>Now, while I do think it would be interesting to cross several generations of Shannon Dohertys with other bizarrly asymetrical individuals and create human flounders or security guards with eyes on either side of their heads.  But barring coercive force, I don’t see how it would be possible.  One doesn’t have to be a monster to ask questions about eugenics, but on the other hand, it is important to keep in mind that not every inquiry by an influential public intellectual is an innocent one.</p></div>",
  "content_text": "As is his occasional wont, Orac again shows off his reading disability.  In\na response to my post about Dawkins wishing to reopen the eugenics discussion\n, (please note the link is right here at the top, one wouldn’t wish to wound him to the quick again), he strangely claims the following question is “the old “atheists are inherently immoral and nihilistic” canard taken to a truly idiotic “atheism leads to necrophilia” extreme.”\nSeriously, on what basis does the atheist prosecute the individual who digs up a few kilos of rotting flesh in order to have sex with it?\nSo,Orac not only mischaracterizes my question, he fails to even begin to answer it.  I did not state that the necrophiliac was an atheist, I merely wanted to know what universal claim the atheist makes for his morality that would suffice to at least criticize the amorous shoveler, to say nothing of prosecuting him criminally.  This is ironic, given that Orac’s post claims that I am mischaracterizing Dawkins position on eugenics.\nSince I think this could be reasonably argued, why don’t we consider Dawkins’ position in a slightly different light.  There were other aspects of the Hitler show besides eugenics, after all.  What would a reasonable reader conclude about Richard Dawkins had he written this?\nToday, I suspect that anti-semitism is too dangerous for comfortable discussion, and my conjecture is that Adolf Hitler is responsible for the change.  Nobody wants to be caught agreeing with that monster, even in a single particular….  I wonder whether, some 60 years after Hitler’s death, we might at least venture to ask what the moral difference is between executing criminals and killing Jews. Or why it is acceptable for the Israelis to oppress Palestinians, but not for Europeans to oppress Jews. I can think of some answers, and they are good ones, which would probably end up persuading me. But hasn’t the time come when we should stop being frightened even to put the question?\nSo, Orac, is the above paragraph anti-semitic? (And by anti-semitic, I mean the conventional Judenhassen sense of the term.)  Do let me know.  I’m genuinely curious about what you think here.\nNow, one doesn’t have to already have an answer in mind to ask a question, but given what we know of Dawkins through his books, I don’t think one has to be overly suspicious of the man to not at least suspect that the guy would be delighted to be given the chance to head up a department of evolutionary eugenics at Oxford.\nOrac goes on to discuss a theoretical justification of voluntary eugenics, which is interesting, but unfortunately skates lightly over the coercive element inherent in the term “breeding”.  And given Dawkins’ examples of domesticated animals, it is clear that he isn’t talking about a voluntary program here, but an involuntary one imposed on those being bred.  As such, it is grossly reprehensible from both a moral and an ideological point of view.\nNow, while I do think it would be interesting to cross several generations of Shannon Dohertys with other bizarrly asymetrical individuals and create human flounders or security guards with eyes on either side of their heads.  But barring coercive force, I don’t see how it would be possible.  One doesn’t have to be a monster to ask questions about eugenics, but on the other hand, it is important to keep in mind that not every inquiry by an influential public intellectual is an innocent one.",
  "tags": [],
  "categories": [],
  "sitemap_lastmod": "2006-11-28T13:21:00+00:00"
}