{
  "url": "https://voxday.net/2006/11/04/embarrassing-atheists/",
  "scraped_at": "2026-01-08T21:22:25.214049",
  "title": "The embarrassing atheists",
  "date_display": "November 4, 2006",
  "date_iso": "2006-11-04T08:06:00+00:00",
  "date_from_url": "2006-11-04",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>One doesn’t expect the average Internet commenter to rise to the level of published and  popular authors such as Sam Harris and Richard Dawkins, however low that might be.  But this should adequately demonstrate how ineptly the average champions of reason wield that in which they believe:</p><p><em>“We atheists simply say, “There is yet no evidence for a god, so I do not believe in one.”</em> – tcw.</p><p>Of course, there is as little evidence for any aspect of morality, so why does tcw believe in them?  Where are the scientific experiments proving that lying to another individual is wrong?  What is the empirical evidence for “right”.</p><p><em>“One idea I have is that causing unecessary suffering to another person is immoral. This is not something I gleened from the bible. So you are correct. This idea does sound good enough to me that I really spend very little time questioning it. What’s your point?”</em> – anonymous</p><p>The point is that a) his notion of causing suffering being immoral has a less rational basis than a belief in God, b) no one whose beliefs are unquestioned and based only on what sounds good can claim to be a rational being.</p><p><em>I’ve yet to see any rational reason to believe there is a god. And tell me, what tools of science would I use to “learn about god”?</em> – anonymous</p><p>If “this idea sounds good” is enough to provide the basis for his moral beliefs, one wonders why he requires science for a belief in God.  And one must ask, what tools of science would anyone use to learn about right and wrong.</p><p>As Equus Pallidus demonstrated rather nicely, the reason the common atheist is always on the attack is that he simply has no defense for his own beliefs.  They run from scientific and reasonable discussions of their own “moralities” even faster than illiterate Bible-thumping Creationists because they know there simply is no there there.  So, instead of answering the simplest questions, they are always forced to point and say “yeah, well, what about dinosaurs?”.</p><p>This wouldn’t be so ridiculous if it weren’t a hypocritical betrayal of everything they claim to value.  These atheists would do well to learn that talking incessantly about science and logic is not the same thing as actually putting them to work on one’s behalf.  And it is foolish to attack the faith of others when one’s own beliefs are supported by a demonstrably shakier foundation.</p><p>One may well be dissatisfied when the question “why” is answered “because God said so in this here book”.  But that is still a much more logically sound and universally applicable reply than “well, it sounds good to me”.</p></div>",
  "content_text": "One doesn’t expect the average Internet commenter to rise to the level of published and  popular authors such as Sam Harris and Richard Dawkins, however low that might be.  But this should adequately demonstrate how ineptly the average champions of reason wield that in which they believe:\n“We atheists simply say, “There is yet no evidence for a god, so I do not believe in one.”\n– tcw.\nOf course, there is as little evidence for any aspect of morality, so why does tcw believe in them?  Where are the scientific experiments proving that lying to another individual is wrong?  What is the empirical evidence for “right”.\n“One idea I have is that causing unecessary suffering to another person is immoral. This is not something I gleened from the bible. So you are correct. This idea does sound good enough to me that I really spend very little time questioning it. What’s your point?”\n– anonymous\nThe point is that a) his notion of causing suffering being immoral has a less rational basis than a belief in God, b) no one whose beliefs are unquestioned and based only on what sounds good can claim to be a rational being.\nI’ve yet to see any rational reason to believe there is a god. And tell me, what tools of science would I use to “learn about god”?\n– anonymous\nIf “this idea sounds good” is enough to provide the basis for his moral beliefs, one wonders why he requires science for a belief in God.  And one must ask, what tools of science would anyone use to learn about right and wrong.\nAs Equus Pallidus demonstrated rather nicely, the reason the common atheist is always on the attack is that he simply has no defense for his own beliefs.  They run from scientific and reasonable discussions of their own “moralities” even faster than illiterate Bible-thumping Creationists because they know there simply is no there there.  So, instead of answering the simplest questions, they are always forced to point and say “yeah, well, what about dinosaurs?”.\nThis wouldn’t be so ridiculous if it weren’t a hypocritical betrayal of everything they claim to value.  These atheists would do well to learn that talking incessantly about science and logic is not the same thing as actually putting them to work on one’s behalf.  And it is foolish to attack the faith of others when one’s own beliefs are supported by a demonstrably shakier foundation.\nOne may well be dissatisfied when the question “why” is answered “because God said so in this here book”.  But that is still a much more logically sound and universally applicable reply than “well, it sounds good to me”.",
  "tags": [],
  "categories": [],
  "sitemap_lastmod": "2006-11-04T08:06:00+00:00"
}