{
  "url": "https://voxday.net/2006/11/10/gay-mustacio-is-beside-himself/",
  "scraped_at": "2026-01-08T21:22:56.600057",
  "title": "The Gay Mustacio is beside himself",
  "date_display": "November 10, 2006",
  "date_iso": "2006-11-10T17:20:00+00:00",
  "date_from_url": "2006-11-10",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p><a href=\"http://www.lp.org/yourturn/archives/000480.shtml\">And Steven Gordon is unimpressed</a>.  Well, perhaps Mr. Medved will be able to find consolation with a nice, tender massage from Mike Jones, as I understand he has a client opening:</p><blockquote><p>Medved was up to his usual name calling as he blamed the Republican loss in the Senate on third party candidates. Here’s a clip:</p><p><em>Montana provides an even more alarming example. Democratic John Tester beat the Republican incumbent Conrad Burns by a margin of less than 3,000 votes. At the same time, Libertarian standard bearer Stan Jones drew 10,324 votes. In general, Libertarians draw more than two-thirds of their votes directly from Republicans. Once again, the Stan Jones juggernaut (which earned an anemic 2.6% of the total vote) drew more than enough support to change the course of history for the worse.</em></p><p>In what must of been some sort of intellectual challenge for him, he didn’t call us “Losertarians” more than once in the Townhall.com article. He made up for it by slinging a few words like sucker, fringe, kook and crazy. For some reason he forgot to call us Nazi-lovers, as he did recently to libertarian Vox Day.</p></blockquote><p>You don’t earn the votes, you don’t get the votes.  So much for that pragmatic Big Tent, Strong Government Republicanism.  Naturally the flaming little film enthusiast believes the correct solution to losing is whine and try to <a href=\"http://michaelmedved.townhall.com/blog/g/49de35f4-5fd1-4127-92e1-bf5176a4fb09\">to change the rules</a>… so who’s the Losertarian now, Mr. Mustache?</p></div>",
  "content_text": "And Steven Gordon is unimpressed\n.  Well, perhaps Mr. Medved will be able to find consolation with a nice, tender massage from Mike Jones, as I understand he has a client opening:\nMedved was up to his usual name calling as he blamed the Republican loss in the Senate on third party candidates. Here’s a clip:\nMontana provides an even more alarming example. Democratic John Tester beat the Republican incumbent Conrad Burns by a margin of less than 3,000 votes. At the same time, Libertarian standard bearer Stan Jones drew 10,324 votes. In general, Libertarians draw more than two-thirds of their votes directly from Republicans. Once again, the Stan Jones juggernaut (which earned an anemic 2.6% of the total vote) drew more than enough support to change the course of history for the worse.\nIn what must of been some sort of intellectual challenge for him, he didn’t call us “Losertarians” more than once in the Townhall.com article. He made up for it by slinging a few words like sucker, fringe, kook and crazy. For some reason he forgot to call us Nazi-lovers, as he did recently to libertarian Vox Day.\nYou don’t earn the votes, you don’t get the votes.  So much for that pragmatic Big Tent, Strong Government Republicanism.  Naturally the flaming little film enthusiast believes the correct solution to losing is whine and try to\nto change the rules\n… so who’s the Losertarian now, Mr. Mustache?",
  "tags": [],
  "categories": [],
  "sitemap_lastmod": "2006-11-10T17:20:00+00:00"
}