{
  "url": "https://voxday.net/2006/11/03/mailvox-in-defense-of-sam-harris/",
  "scraped_at": "2026-01-08T21:22:19.767377",
  "title": "Mailvox: in defense of Sam Harris",
  "date_display": "November 3, 2006",
  "date_iso": "2006-11-03T08:36:00+00:00",
  "date_from_url": "2006-11-03",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>At least, I think that’s what DS is trying to do:</p><blockquote><p>I read your article, and would like to respond. I refuse, however, to address the many ad hominem attacks.</p></blockquote><p>Fair enough.  The correct thing to do is to address the substantive attacks, which determines whether the ad hominum ones are merited.</p><blockquote><p><em>After painting a clichéd portrait of an Islamic bus bomber, he writes: ”Why is it so easy, then, so trivially easy – you-could-almost- bet-your- life-on-it easy – to guess the young man’s religion?”</em> <br>–<br>What’s chliche about an islamic suicide bomber?</br></br></p></blockquote><p>Many, if not most, suicide bombers have not been Islamic.  And yet Harris assumes the basic stereotype as fact, probably due to the mass of recent media coverage of Islamic suicide bombers.  When Islamic suicide bombers are showing up in Halloween costumes and Volkswagen ads, it’s a cliché.</p><blockquote><p>Having already rejected Pascal’s Wager…<br>–<br>Being a logical fallacy, are you saying he should accept it?</br></br></p></blockquote><p>No, merely pointing out that he’s prone to putting himself on the wrong side of costly bets.</p><blockquote><p>…since he has apparently never heard of the Tamil Tigers, ”an adamantly secular group with Hindu roots” that University of Chicago professor Edward Pape, the author of “Dying to Win: The Strategic Logic of Suicide Terrorism,” describes as ”the leading purveyors of suicide attacks over the last two decades.”<br>–<br>You are referring to Robert Pape. Do you have valid statistics on the number of deaths? Are you aware of the reason for their choice of violence? Furthermore, could you explain, by definition, how the TT are “adamantly secular?” And finally, please explain Pape’s claim that “there is little connection between suicide terrorism and islamic fundamentalism, or(sic) any one of the world’s religions?”</br></br></p></blockquote><p>Any claims of inaccuracy in Pape’s book should be taken up with Pape, not me.  If you have evidence to demonstrate his book is incorrect, feel free to publicly demonstrate it as I have with Harris, the onus is on you.  Yes, I am aware of the reason for their choice of violence.  The Tamil Tigers are adamantly secular due to a) their Marxist philosophy and b) their opposition to the caste-system that is intimately linked to the lingering Hindu religious influence in Sri Lanka.  Pape makes the claim because he has had no trouble documenting many irreligious suicide bombers and because he has determined that the primary purpose of suicide bombers is entirely secular; to drive an occupying military power out of the land it occupies.  Without military occupation, there is very little suicide terrorism regardless of how much religious fundamentalism abounds.</p><p>It is interesting to note that in keeping with Pape’s assertion, Islamic bombings in the West have not been suicide attacks, whereas occupied Iraq has seen many.</p><blockquote><p><em>it is the chemical, biological and nuclear products of Reason encapsulated in the methodology of science that pose the actual danger.</em><br>–<br>Of course it is, and it has nothing to do with the insane people that get their hands on them, right? Tell me, the next time you need medication, surgery, antibiotics or perhaps a vaccination, will you deem those as “products of Reason encapsulated in the methodology of science that pose the actual danger?”</br></br></p></blockquote><p>Was Truman insane?  Were the generals of WWI religious fanatics?  Did they use the atomic and chemical products of Reason for religious purposes?  It is as fair to criticize all science for the many evils it produces as it is to blame all religious people for the actions of a few killers.  Furthermore, DS’ implication that there is no danger associated with medication, surgery and so forth is hilarious, as even if one omits abortion, <a href=\"http://www.medicalnewstoday.com/medicalnews.php?newsid=11856\">doctors kill far more people than murderers and terrorists combined</a>.  Medical errors are the sixth leading cause of death in the USA, whereas religious fanaticism would rank somewhere  below drowning in buckets.</p><blockquote><p><em>And when one considers that an estimated 89.2 percent of all the wars in history were fought for reasons unrelated to religion….</em><br>–<br>And you got that statistic from whom? Pat Robertson? So there were no Crusades, Inquisitions, Holocausts, killing tens of millions of human beings – SLOWLY BURNING THEM, so they had a chance to reconsider their disbelief. Shall I continue?</br></br></p></blockquote><p>Here DS reveals his own vast historical ignorance.  I got that statistic by reviewing the 489 wars listed in the Wikipedia.*  53 had religious causes; one obtains that number if each of the 10 Crusades is counted separately.  (489-53)/489 = 89.2 percent.  The inquisitions weren’t wars and only killed some 5,000 people in 300 years.  The Holocaust was not religiously motivated nor was it a war.</p><p>While DS does us the service of demonstrating what sort of ignorant buffoon is impressed by Sam Harris, he should only continue if he wishes to embarrass himself further.</p><p>*<em>I’m not the only one to reach this conclusion.  Another guy <a href=\"http://users.erols.com/mwhite28/warstats.htm\">with a fairly serious interest in the vicissitudes of history</a> writes in his FAQ:</em></p><blockquote><p>“Q: Is religion responsible for more more violent deaths than any other cause?</p><p>A: No, of course not — unless you define religion so broadly as to be meaningless. Just take the four deadliest events of the 20th Century — Two World Wars, Red China and the Soviet Union — no religious motivation there, unless you consider every belief system to be a religion.</p><p>Q: So, what you’re saying is that religion has never killed anyone.</p><p>A: Arrgh… You all-or-nothing people drive me crazy. There are many documented examples where members of one religion try to exterminate the members of another religion. Causation is always complex, but if the only difference between two warring groups is religion, then that certainly sounds like a religious conflict to me. Is it the number one cause of mass homicide in human history? No. Of the 22 worst episodes of mass killing, maybe four were primarily religious. Is that a lot? Well, it’s more than the number of wars fought over soccer, or sex (The Trojan and Sabine Wars don’t even make the list.), but less than the number fought over land, money, glory or prestige.</p><p>In my Index, I list 41 religious conflicts…. Make of that what you will.”</p></blockquote><p>And actually, <a href=\"http://users.erols.com/mwhite28/warstat0.htm#20worst\">if you look at his list of worst episodes</a>, (which isn’t limited to war), only two of them, #17 and #21, appear to have been religious in nature.  Astute readers will note that neither the Crusades nor the Inquisition even make the list.</p></div>",
  "content_text": "At least, I think that’s what DS is trying to do:\nI read your article, and would like to respond. I refuse, however, to address the many ad hominem attacks.\nFair enough.  The correct thing to do is to address the substantive attacks, which determines whether the ad hominum ones are merited.\nAfter painting a clichéd portrait of an Islamic bus bomber, he writes: ”Why is it so easy, then, so trivially easy – you-could-almost- bet-your- life-on-it easy – to guess the young man’s religion?”\n–\nWhat’s chliche about an islamic suicide bomber?\nMany, if not most, suicide bombers have not been Islamic.  And yet Harris assumes the basic stereotype as fact, probably due to the mass of recent media coverage of Islamic suicide bombers.  When Islamic suicide bombers are showing up in Halloween costumes and Volkswagen ads, it’s a cliché.\nHaving already rejected Pascal’s Wager…\n–\nBeing a logical fallacy, are you saying he should accept it?\nNo, merely pointing out that he’s prone to putting himself on the wrong side of costly bets.\n…since he has apparently never heard of the Tamil Tigers, ”an adamantly secular group with Hindu roots” that University of Chicago professor Edward Pape, the author of “Dying to Win: The Strategic Logic of Suicide Terrorism,” describes as ”the leading purveyors of suicide attacks over the last two decades.”\n–\nYou are referring to Robert Pape. Do you have valid statistics on the number of deaths? Are you aware of the reason for their choice of violence? Furthermore, could you explain, by definition, how the TT are “adamantly secular?” And finally, please explain Pape’s claim that “there is little connection between suicide terrorism and islamic fundamentalism, or(sic) any one of the world’s religions?”\nAny claims of inaccuracy in Pape’s book should be taken up with Pape, not me.  If you have evidence to demonstrate his book is incorrect, feel free to publicly demonstrate it as I have with Harris, the onus is on you.  Yes, I am aware of the reason for their choice of violence.  The Tamil Tigers are adamantly secular due to a) their Marxist philosophy and b) their opposition to the caste-system that is intimately linked to the lingering Hindu religious influence in Sri Lanka.  Pape makes the claim because he has had no trouble documenting many irreligious suicide bombers and because he has determined that the primary purpose of suicide bombers is entirely secular; to drive an occupying military power out of the land it occupies.  Without military occupation, there is very little suicide terrorism regardless of how much religious fundamentalism abounds.\nIt is interesting to note that in keeping with Pape’s assertion, Islamic bombings in the West have not been suicide attacks, whereas occupied Iraq has seen many.\nit is the chemical, biological and nuclear products of Reason encapsulated in the methodology of science that pose the actual danger.\n–\nOf course it is, and it has nothing to do with the insane people that get their hands on them, right? Tell me, the next time you need medication, surgery, antibiotics or perhaps a vaccination, will you deem those as “products of Reason encapsulated in the methodology of science that pose the actual danger?”\nWas Truman insane?  Were the generals of WWI religious fanatics?  Did they use the atomic and chemical products of Reason for religious purposes?  It is as fair to criticize all science for the many evils it produces as it is to blame all religious people for the actions of a few killers.  Furthermore, DS’ implication that there is no danger associated with medication, surgery and so forth is hilarious, as even if one omits abortion,\ndoctors kill far more people than murderers and terrorists combined\n.  Medical errors are the sixth leading cause of death in the USA, whereas religious fanaticism would rank somewhere  below drowning in buckets.\nAnd when one considers that an estimated 89.2 percent of all the wars in history were fought for reasons unrelated to religion….\n–\nAnd you got that statistic from whom? Pat Robertson? So there were no Crusades, Inquisitions, Holocausts, killing tens of millions of human beings – SLOWLY BURNING THEM, so they had a chance to reconsider their disbelief. Shall I continue?\nHere DS reveals his own vast historical ignorance.  I got that statistic by reviewing the 489 wars listed in the Wikipedia.*  53 had religious causes; one obtains that number if each of the 10 Crusades is counted separately.  (489-53)/489 = 89.2 percent.  The inquisitions weren’t wars and only killed some 5,000 people in 300 years.  The Holocaust was not religiously motivated nor was it a war.\nWhile DS does us the service of demonstrating what sort of ignorant buffoon is impressed by Sam Harris, he should only continue if he wishes to embarrass himself further.\n*\nI’m not the only one to reach this conclusion.  Another guy\nwith a fairly serious interest in the vicissitudes of history\nwrites in his FAQ:\n“Q: Is religion responsible for more more violent deaths than any other cause?\nA: No, of course not — unless you define religion so broadly as to be meaningless. Just take the four deadliest events of the 20th Century — Two World Wars, Red China and the Soviet Union — no religious motivation there, unless you consider every belief system to be a religion.\nQ: So, what you’re saying is that religion has never killed anyone.\nA: Arrgh… You all-or-nothing people drive me crazy. There are many documented examples where members of one religion try to exterminate the members of another religion. Causation is always complex, but if the only difference between two warring groups is religion, then that certainly sounds like a religious conflict to me. Is it the number one cause of mass homicide in human history? No. Of the 22 worst episodes of mass killing, maybe four were primarily religious. Is that a lot? Well, it’s more than the number of wars fought over soccer, or sex (The Trojan and Sabine Wars don’t even make the list.), but less than the number fought over land, money, glory or prestige.\nIn my Index, I list 41 religious conflicts…. Make of that what you will.”\nAnd actually,\nif you look at his list of worst episodes\n, (which isn’t limited to war), only two of them, #17 and #21, appear to have been religious in nature.  Astute readers will note that neither the Crusades nor the Inquisition even make the list.",
  "tags": [],
  "categories": [],
  "sitemap_lastmod": "2006-11-03T08:36:00+00:00"
}