{
  "url": "https://voxday.net/2006/11/24/of-fruits-and-knowing-thereof/",
  "scraped_at": "2026-01-08T21:23:51.975793",
  "title": "Of fruits and the knowing thereof",
  "date_display": "November 24, 2006",
  "date_iso": "2006-11-24T10:15:00+00:00",
  "date_from_url": "2006-11-24",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>In which a church leader <a href=\"http://www.lifesite.net/ldn/2006/nov/06112106.html\">applies the knife</a> to her denomination’s throat:</p><blockquote><p>Bishop Katharine Jefferts Schori, the first woman to head the US Episcopal Church (ECUSA), has adopted a unique vision for the Episcopal church: a church not “interested in replenishing their ranks by having children.”</p><p>In a<a href=\"http://www.nytimes.com/2006/11/19/magazine/19WWLN_Q4.html?_r=1&amp;oref=slogin\">n interview with New York Times Magazine</a>, Bishop Jefferts Schori conjectured that the Episcopal Church’s now only 2.2 million faithful “used to be larger percentagewise”.  However now, she says,  “Episcopalians tend to be better-educated and tend to reproduce at lower rates than some other denominations. Roman Catholics and Mormons both have theological reasons for producing lots of children.”</p><p>The response provoked this query from NYT reporter Deborah Solomon: “Episcopalians aren’t interested in replenishing their ranks by having children?”</p><p>“No. It’s probably the opposite,” responded Jefferts Schori. “We encourage people to pay attention to the stewardship of the earth and not use more than their portion.”</p></blockquote><p>Although I’m an evolutionary skeptic, I am a genuine fan of observable natural selection.  I have no pity for the dying Episcopalian church, clearly this woman is the sort of leader who suits the individuals who selected her very well indeed.</p></div>",
  "content_text": "In which a church leader\napplies the knife\nto her denomination’s throat:\nBishop Katharine Jefferts Schori, the first woman to head the US Episcopal Church (ECUSA), has adopted a unique vision for the Episcopal church: a church not “interested in replenishing their ranks by having children.”\nIn a\nn interview with New York Times Magazine\n, Bishop Jefferts Schori conjectured that the Episcopal Church’s now only 2.2 million faithful “used to be larger percentagewise”.  However now, she says,  “Episcopalians tend to be better-educated and tend to reproduce at lower rates than some other denominations. Roman Catholics and Mormons both have theological reasons for producing lots of children.”\nThe response provoked this query from NYT reporter Deborah Solomon: “Episcopalians aren’t interested in replenishing their ranks by having children?”\n“No. It’s probably the opposite,” responded Jefferts Schori. “We encourage people to pay attention to the stewardship of the earth and not use more than their portion.”\nAlthough I’m an evolutionary skeptic, I am a genuine fan of observable natural selection.  I have no pity for the dying Episcopalian church, clearly this woman is the sort of leader who suits the individuals who selected her very well indeed.",
  "tags": [],
  "categories": [],
  "sitemap_lastmod": "2006-11-24T10:15:00+00:00"
}