{
  "url": "https://voxday.net/2006/11/30/we-are-chunky/",
  "scraped_at": "2026-01-08T21:24:24.932591",
  "title": "We are the chunky",
  "date_display": "November 30, 2006",
  "date_iso": "2006-11-30T18:36:00+00:00",
  "date_from_url": "2006-11-30",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>There’s a choice we’re making, <a href=\"http://www.breitbart.com/news/2006/11/29/D8LN0P6G1.html\">we’re stuffing our fat faces</a>:</p><blockquote><p>Africa, a continent usually synonymous with hunger, is falling prey to obesity. It’s a trend driven by new lifestyles and old beliefs that big is beautiful. Ask Nodo Njobo, a plump hairdressing assistant. She is coy about her weight, but like many African women, proud of her “big bum.” She says she’d like to be slimmer, but worries how her friends would react….</p><p>More than one-third of African women and a quarter of African men are estimated to be overweight, and the World Health Organization predicts that will rise to 41 percent and 30 percent respectively in the next 10 years.</p></blockquote><p>Some years ago, PJ O’Rourke demonstrated that starvation in Africa was a political matter, not a matter of drought or a lack of agriculture.  I wonder, though, what he would have made of how the fat gene and the overactive thyroid condition that causes obesity in so many Americans – through no fault of their own, of course – managed to migrate to Africa in the previous decade.</p><p><em>The greased pan frying in the night<br>As I grow restless waiting for some stuffed and deep-fried calamari<br>You’d think I had a parasite<br>Sure as Kilimanjaro rises like a flan above the Serengeti<br>I seek to eat what’s in my sight, washed down by a hot and buttered rum.</br></br></br></br></em></p><p>It’s gonna take a lot to drag me away from food<br>There’s nothing that could ever change my attitude<br>I bless the cooks down in Africa<br>Gonna take some time to eat the things we never had</br></br></br></p></div>",
  "content_text": "There’s a choice we’re making,\nwe’re stuffing our fat faces\n:\nAfrica, a continent usually synonymous with hunger, is falling prey to obesity. It’s a trend driven by new lifestyles and old beliefs that big is beautiful. Ask Nodo Njobo, a plump hairdressing assistant. She is coy about her weight, but like many African women, proud of her “big bum.” She says she’d like to be slimmer, but worries how her friends would react….\nMore than one-third of African women and a quarter of African men are estimated to be overweight, and the World Health Organization predicts that will rise to 41 percent and 30 percent respectively in the next 10 years.\nSome years ago, PJ O’Rourke demonstrated that starvation in Africa was a political matter, not a matter of drought or a lack of agriculture.  I wonder, though, what he would have made of how the fat gene and the overactive thyroid condition that causes obesity in so many Americans – through no fault of their own, of course – managed to migrate to Africa in the previous decade.\nThe greased pan frying in the night\nAs I grow restless waiting for some stuffed and deep-fried calamari\nYou’d think I had a parasite\nSure as Kilimanjaro rises like a flan above the Serengeti\nI seek to eat what’s in my sight, washed down by a hot and buttered rum.\nIt’s gonna take a lot to drag me away from food\nThere’s nothing that could ever change my attitude\nI bless the cooks down in Africa\nGonna take some time to eat the things we never had",
  "tags": [],
  "categories": [],
  "sitemap_lastmod": "2006-11-30T18:36:00+00:00"
}