{
  "url": "https://voxday.net/2006/11/09/who-is-kenny/",
  "scraped_at": "2026-01-08T21:22:49.205098",
  "title": "Who is Kenny?",
  "date_display": "November 9, 2006",
  "date_iso": "2006-11-09T16:56:00+00:00",
  "date_from_url": "2006-11-09",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>It seems too few blacks or too few women is bad, but <a href=\"http://www.ynetnews.com/articles/0,7340,L-3326053,00.html\">too many Jews</a> is dandy:</p><blockquote><p>An accurate count shows that the number of Jewish senators has risen from 11 to 13, with the addition of two former representatives Benjamin Cardin (Maryland-D) and Bernard Sanders (Vermont-I) who were successfully elected to the Senate.</p><p>Sander’s and Cardin’s departure from the House didn’t lower the number of Jews there – on the contrary. The number of Jewish representatives elected to the House of Representatives also grew.  They now number 30….</p></blockquote><p>Are they counting Hillary?  Anyhow, it appears that 1.7 percent of the country enjoys 10 percent representation in Congress*, and is thus overrepresented by a factor of six. I don’t care myself, given that white Methodist Republicans and black Baptist Democrats appear to be every bit as committed to national destruction as our newly elected Jewish Socialist, (henceforth known as “Leon”), but I don’t see how this isn’t a legal abomination if the dysproportional incidence of male athletes at a university is a problem demanding legislation and Federal intervention.</p><p>What’s ironic is that most of these Congressmen and Senators are big supporters of affirmative action based on proportionality.  And even more ironic are Israeli concerns that the Democratic takeover of the House and Senate, for which an overwhelming majority of Jews voted, will prove to be dangerous for Israel.</p><p>This is good news, however, for if the newly elected pride of Minnesota, Rep. Keith Ellison, hears the call of jihad, he won’t have far to go.  And of course, those who know their Old Testament would think that Israelis would do better to worry about the implications of the gay pride march taking place in Jerusalem this week.  One would think that the knowledge of an Iranian nuke coming online soon would maybe be an indication that this probably isn’t <a href=\"http://www.ynetnews.com/articles/0,7340,L-3324485,00.html\">the best time to piss off the Almighty</a>.**</p><p>It’s like a cartoon or something.  When did America turn into South Park?  And  more importantly, who is Kenny?</p><p>*<em>13 percent of the Senate and 6.8 percent of the House averages out to 9.9 percent.</em></p><p>**<em>Yes, I know, an atheists can say: “Who cares what a nonexistent ancient sky deity thinks?  The Flying Spaghetti Monster loves gay pride marches!”  To which I reply: “Fair enough, but then, what’s it to you if a few random collections of atoms happen to get rearranged into sheets of glass?”</em></p></div>",
  "content_text": "It seems too few blacks or too few women is bad, but\ntoo many Jews\nis dandy:\nAn accurate count shows that the number of Jewish senators has risen from 11 to 13, with the addition of two former representatives Benjamin Cardin (Maryland-D) and Bernard Sanders (Vermont-I) who were successfully elected to the Senate.\nSander’s and Cardin’s departure from the House didn’t lower the number of Jews there – on the contrary. The number of Jewish representatives elected to the House of Representatives also grew.  They now number 30….\nAre they counting Hillary?  Anyhow, it appears that 1.7 percent of the country enjoys 10 percent representation in Congress*, and is thus overrepresented by a factor of six. I don’t care myself, given that white Methodist Republicans and black Baptist Democrats appear to be every bit as committed to national destruction as our newly elected Jewish Socialist, (henceforth known as “Leon”), but I don’t see how this isn’t a legal abomination if the dysproportional incidence of male athletes at a university is a problem demanding legislation and Federal intervention.\nWhat’s ironic is that most of these Congressmen and Senators are big supporters of affirmative action based on proportionality.  And even more ironic are Israeli concerns that the Democratic takeover of the House and Senate, for which an overwhelming majority of Jews voted, will prove to be dangerous for Israel.\nThis is good news, however, for if the newly elected pride of Minnesota, Rep. Keith Ellison, hears the call of jihad, he won’t have far to go.  And of course, those who know their Old Testament would think that Israelis would do better to worry about the implications of the gay pride march taking place in Jerusalem this week.  One would think that the knowledge of an Iranian nuke coming online soon would maybe be an indication that this probably isn’t\nthe best time to piss off the Almighty\n.**\nIt’s like a cartoon or something.  When did America turn into South Park?  And  more importantly, who is Kenny?\n*\n13 percent of the Senate and 6.8 percent of the House averages out to 9.9 percent.\n**\nYes, I know, an atheists can say: “Who cares what a nonexistent ancient sky deity thinks?  The Flying Spaghetti Monster loves gay pride marches!”  To which I reply: “Fair enough, but then, what’s it to you if a few random collections of atoms happen to get rearranged into sheets of glass?”",
  "tags": [],
  "categories": [],
  "sitemap_lastmod": "2006-11-09T16:56:00+00:00"
}