{
  "url": "https://voxday.net/2024/12/02/a-timely-reminder-on-tariffs/",
  "scraped_at": "2026-01-08T19:31:28.063612",
  "title": "A Timely Reminder on Tariffs",
  "date_display": "December 2, 2024",
  "date_iso": "2024-12-02T20:10:47+00:00",
  "date_from_url": "2024-12-02",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>This is <a href=\"https://voxday.net/2018/03/22/mailvox-stupid-cons-and-smoot-hawley/\">a repeat of a 2018 post</a> that is itself a rehash from a paragraph of my 2009 book entitled The Return of the Great Depression. And contra Martin Armstrong and everyone else who is pontificating about how Trump’s proposed tariffs would “destroy the global economy”, it’s just not true, at least not on the historical comparison to which most of them are appealing.</p><p>Every single talking head who makes any reference whatsoever to Smoot-Hawley is a poser and a fraud who knows nothing about economics or economic history. This is basically a variant of the “Um, Ricardo?” pseudo-rebuttal to an argument for tariffs or other forms of protectionism. It is proof that the speaker has heard about the subject, but doesn’t actually know the subject at all.</p><p>The point is so trivial that I dealt with it in a single paragraph in <em>The Return of the Great Depression</em> <s>ten </s> 16 years ago and haven’t seen the need to mention it again <s>since </s> until now.</p><p><em>For many years, it was supposed that the Smoot-Hawley tariff of 1930 played a major role in the economic contraction of the Great Depression. As more economists are gradually coming to realize, this was unlikely to have been the case for several reasons. First, the 15.5 percent annual decline in exports from 1929 to 1933 was less precipitous than the pre-tariff 18.3 percent decline from 1920 to 1922. Second, because the amount of imports also fell, the net effect of the $328 million reduction in the balance of trade on the economy amounted to only 0.3 percent of 1929 GDP. Third, the balance of trade turned negative and by 1940 had increased to nearly ten times the size of the 1929 positive balance while the economy was growing.</em></p><p>There was nowhere nearly enough international trade taking place at the time to cause or account for the Great Depression. Whoever originally came up with that idea didn’t know what they were talking about and didn’t understand economics. And neither does anyone who still takes the ridiculous idea seriously.</p><p>The reason the Great Depression happened was the same reason that the financial crisis of 2008 happened. Everyone was overleveraged and the total amount of money being borrowed collapsed. That is why an average of 1,287 banks failed every year from 1930 to 1933. The historical credit collapse had vastly more impact on the economy than a smaller annual decline in exports than had been experienced seven years before as a result of the Fordney–McCumber tariff act.</p><p>The only way Trump’s proposed tariffs can “collapse the global economy” is if the resulting shift in purchasing preferences toward domestic producers results in the collapse of overleveraged corporations and banks that will no longer be able to service their debts in countries that have a trade surplus with the USA. But that’s going to happen anyhow. What 100-percent tariffs really mean is that global producers will have a serious incentive to produce goods in the USA instead of manufacturing them elsewhere and shipping them into the USA; it would definitely alter the relevant math on leather book production, just to give one example.</p><p><em><a href=\"https://socialgalactic.com/micropost/55bbe6a5-7d50-46b5-8e14-013f055f8f4a\">DISCUSS ON SG</a></em></p></div>",
  "content_text": "This is\na repeat of a 2018 post\nthat is itself a rehash from a paragraph of my 2009 book entitled The Return of the Great Depression. And contra Martin Armstrong and everyone else who is pontificating about how Trump’s proposed tariffs would “destroy the global economy”, it’s just not true, at least not on the historical comparison to which most of them are appealing.\nEvery single talking head who makes any reference whatsoever to Smoot-Hawley is a poser and a fraud who knows nothing about economics or economic history. This is basically a variant of the “Um, Ricardo?” pseudo-rebuttal to an argument for tariffs or other forms of protectionism. It is proof that the speaker has heard about the subject, but doesn’t actually know the subject at all.\nThe point is so trivial that I dealt with it in a single paragraph in\nThe Return of the Great Depression\nten\n16 years ago and haven’t seen the need to mention it again\nsince\nuntil now.\nFor many years, it was supposed that the Smoot-Hawley tariff of 1930 played a major role in the economic contraction of the Great Depression. As more economists are gradually coming to realize, this was unlikely to have been the case for several reasons. First, the 15.5 percent annual decline in exports from 1929 to 1933 was less precipitous than the pre-tariff 18.3 percent decline from 1920 to 1922. Second, because the amount of imports also fell, the net effect of the $328 million reduction in the balance of trade on the economy amounted to only 0.3 percent of 1929 GDP. Third, the balance of trade turned negative and by 1940 had increased to nearly ten times the size of the 1929 positive balance while the economy was growing.\nThere was nowhere nearly enough international trade taking place at the time to cause or account for the Great Depression. Whoever originally came up with that idea didn’t know what they were talking about and didn’t understand economics. And neither does anyone who still takes the ridiculous idea seriously.\nThe reason the Great Depression happened was the same reason that the financial crisis of 2008 happened. Everyone was overleveraged and the total amount of money being borrowed collapsed. That is why an average of 1,287 banks failed every year from 1930 to 1933. The historical credit collapse had vastly more impact on the economy than a smaller annual decline in exports than had been experienced seven years before as a result of the Fordney–McCumber tariff act.\nThe only way Trump’s proposed tariffs can “collapse the global economy” is if the resulting shift in purchasing preferences toward domestic producers results in the collapse of overleveraged corporations and banks that will no longer be able to service their debts in countries that have a trade surplus with the USA. But that’s going to happen anyhow. What 100-percent tariffs really mean is that global producers will have a serious incentive to produce goods in the USA instead of manufacturing them elsewhere and shipping them into the USA; it would definitely alter the relevant math on leather book production, just to give one example.\nDISCUSS ON SG",
  "tags": [
    "economics"
  ],
  "categories": [],
  "sitemap_lastmod": "2024-12-02T20:10:49+00:00"
}