{
  "url": "https://voxday.net/2024/12/14/regional-power-global-invincibility/",
  "scraped_at": "2026-01-08T19:32:36.536280",
  "title": "Regional Power != Global Invincibility",
  "date_display": "December 14, 2024",
  "date_iso": "2024-12-14T10:47:44+00:00",
  "date_from_url": "2024-12-14",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>A surprising number of would-be war analysts are putting far too much stock in Russia’s inability to prop up the Syrian regime against the combined assault of US, Israeli, Turkish, and jihadist forces. But Russia and China are both REGIONAL powers; their inability to dictate events in the Middle East, or in Africa, is no different than the inability of the USA to dictate events in Eastern Europe or the Red Sea. The further away from their industrial core where force is generated, the harder it is to deliver a sufficient amount.</p><p>But the logistical difficulties in a remote location should never be confused with an inability to generate the force in the first place, <a href=\"https://smoothiex12.blogspot.com/2024/12/in-related-news.html\">as Andrei Martynov illustrates</a>:</p><blockquote class=\"wp-block-quote is-layout-flow wp-block-quote-is-layout-flow\"><p><em>Russia is outpacing the arms production of the entire EU after significantly ramping up its defense industry and despite Western sanctions, the bloc’s commissioner for defense and space, Andrius Kubilius, has said. Kubilius, a noted Russia hawk and two-time prime minister of Lithuania, was approved by the European Parliament last month as the EU’s first ever defense commissioner. In an interview on Friday with the RND media group, he called on the EU to significantly expand the production of conventional weapons such as artillery and infantry vehicles, as well as long-range and precision weapons amid what he called a Russian attack threat. “The Russians have expanded their arms industry to an unimaginable extent despite our sanctions,” Kubilius stated. Russia now produces “more weapons in three months than the entire European arms industry can produce, and in six months more weapons than the entire German army has,” he added. Kubilius also cited experts who, according to him, say that Russia now produces more tanks than it uses on the front lines in the Ukraine conflict.</em></p><p>I want to stress, that in the last few years, a very good man, who I will not name, because I respect him, no, he is not my acquaintance–was repeating ad nauseam that Russia “with the economy the size of Spain”. Sadly, there is no such profession as a “good man”, but for most people in the US “intel” community it is worth learning that Russia’s economy is the 4th economy in the world and, possibly, the third. I want to stress that GDP numbers circulating in the “intel” circles are crap invented in the combined West to hide its deindustrialization and financialization of own economies. US industrial base was in steady decline for decades now and realistically, with the exception of automotive industry (granted with huge pure assembly from import parts sector) and aerospace with naval construction… well, that’s about the most important US machine building sectors.</p></blockquote><p>What changed the equation in Syria was the involvement of the Turks and their willingness to help Clown World depose the Assad regime. The Russians quite rightly assessed the situation as hopeless and extricated their forces as well as the Assad family without taking any losses; contrast that with the expense incurred by the futile Us and European attempts to preserve Ukraine and its Clown World regime. But Erdogan has long been open about his dream of rebuilding the Ottoman empire, <a href=\"https://simplicius76.substack.com/p/pieces-begin-slowly-falling-into\">and Syria is part of that</a> former Ottoman territory.</p><blockquote class=\"wp-block-quote is-layout-flow wp-block-quote-is-layout-flow\"><p>A deluge of new evidence shows Turkey slowly fortifying its position as future hegemon of the region. As soon as Damascus fell, the director of the MIT—Turkey’s CIA equivalent—Ibrahim Kalin was spotted visiting Jolani, touring Damascus, as well as paying homage to the ancient Umayyad mosque. Several videos showed Jolani acting as personal chauffeur to Kalin, driving him around Damascus with an armed escort. Think about that: Jolani as personal driver to the head of Turkey’s top intelligence agency—that’s not to mention that Kalin was senior personal advisor to Erdogan and is member of his AK Party. So, Erdogan’s personal henchman is already shadowing Jolani, whispering in his ear—what can that mean? And what does that say about rumors that HTS had long ago cut ties with Turkey, with the same going for SNA/FSA/TFSA?</p></blockquote><p>This is why Israel has already invaded southern Syria. In my estimation, Turkey poses a much more significant long-term military threat than Iran ever has, although I wouldn’t assume that Turkey won’t eventually ally with Iran against Israel when the Israeli-Turkish war eventually begins.</p><p><em><a href=\"https://socialgalactic.com/micropost/0054c9e6-99e6-441b-a280-c61dee2ced60\">DISCUSS ON SG</a></em></p></div>",
  "content_text": "A surprising number of would-be war analysts are putting far too much stock in Russia’s inability to prop up the Syrian regime against the combined assault of US, Israeli, Turkish, and jihadist forces. But Russia and China are both REGIONAL powers; their inability to dictate events in the Middle East, or in Africa, is no different than the inability of the USA to dictate events in Eastern Europe or the Red Sea. The further away from their industrial core where force is generated, the harder it is to deliver a sufficient amount.\nBut the logistical difficulties in a remote location should never be confused with an inability to generate the force in the first place,\nas Andrei Martynov illustrates\n:\nRussia is outpacing the arms production of the entire EU after significantly ramping up its defense industry and despite Western sanctions, the bloc’s commissioner for defense and space, Andrius Kubilius, has said. Kubilius, a noted Russia hawk and two-time prime minister of Lithuania, was approved by the European Parliament last month as the EU’s first ever defense commissioner. In an interview on Friday with the RND media group, he called on the EU to significantly expand the production of conventional weapons such as artillery and infantry vehicles, as well as long-range and precision weapons amid what he called a Russian attack threat. “The Russians have expanded their arms industry to an unimaginable extent despite our sanctions,” Kubilius stated. Russia now produces “more weapons in three months than the entire European arms industry can produce, and in six months more weapons than the entire German army has,” he added. Kubilius also cited experts who, according to him, say that Russia now produces more tanks than it uses on the front lines in the Ukraine conflict.\nI want to stress, that in the last few years, a very good man, who I will not name, because I respect him, no, he is not my acquaintance–was repeating ad nauseam that Russia “with the economy the size of Spain”. Sadly, there is no such profession as a “good man”, but for most people in the US “intel” community it is worth learning that Russia’s economy is the 4th economy in the world and, possibly, the third. I want to stress that GDP numbers circulating in the “intel” circles are crap invented in the combined West to hide its deindustrialization and financialization of own economies. US industrial base was in steady decline for decades now and realistically, with the exception of automotive industry (granted with huge pure assembly from import parts sector) and aerospace with naval construction… well, that’s about the most important US machine building sectors.\nWhat changed the equation in Syria was the involvement of the Turks and their willingness to help Clown World depose the Assad regime. The Russians quite rightly assessed the situation as hopeless and extricated their forces as well as the Assad family without taking any losses; contrast that with the expense incurred by the futile Us and European attempts to preserve Ukraine and its Clown World regime. But Erdogan has long been open about his dream of rebuilding the Ottoman empire,\nand Syria is part of that\nformer Ottoman territory.\nA deluge of new evidence shows Turkey slowly fortifying its position as future hegemon of the region. As soon as Damascus fell, the director of the MIT—Turkey’s CIA equivalent—Ibrahim Kalin was spotted visiting Jolani, touring Damascus, as well as paying homage to the ancient Umayyad mosque. Several videos showed Jolani acting as personal chauffeur to Kalin, driving him around Damascus with an armed escort. Think about that: Jolani as personal driver to the head of Turkey’s top intelligence agency—that’s not to mention that Kalin was senior personal advisor to Erdogan and is member of his AK Party. So, Erdogan’s personal henchman is already shadowing Jolani, whispering in his ear—what can that mean? And what does that say about rumors that HTS had long ago cut ties with Turkey, with the same going for SNA/FSA/TFSA?\nThis is why Israel has already invaded southern Syria. In my estimation, Turkey poses a much more significant long-term military threat than Iran ever has, although I wouldn’t assume that Turkey won’t eventually ally with Iran against Israel when the Israeli-Turkish war eventually begins.\nDISCUSS ON SG",
  "tags": [
    "Middle East",
    "Russia",
    "war"
  ],
  "categories": [],
  "sitemap_lastmod": "2024-12-14T10:50:23+00:00"
}