{
  "url": "https://voxday.net/2024/12/04/the-inevitable-pardon/",
  "scraped_at": "2026-01-08T19:31:35.521215",
  "title": "The Inevitable Pardon",
  "date_display": "December 4, 2024",
  "date_iso": "2024-12-04T11:44:18+00:00",
  "date_from_url": "2024-12-04",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>It never occurred to me that one of the Joe Bidens wouldn’t pardon Hunter Biden for his many federal crimes. The only thing that surprised me about it was the timing; I expected it to be issued at the last possible moment, as most controversial pardons are. But according to Jack Posobiec and CDAN, Hunter <a href=\"https://www.crazydaysandnights.net/2024/12/todays-blind-items-no-choice.html\">may have driven the time frame</a> as well as its extension back to 2014, years before the crimes for which he was already accused.</p><p><em>The son gave the father no choice in this legal issuance . The son was about to sign a book deal and told the father he was not going to censor himself. It isn’t just what the son was charged with now, the wording of the father’s legal issuance goes back 10 years which covers dirty dealings in another country that involved the father. As far as the gross personal stuff goes, one can feel sorry for the son when you consider what the father did to him and another sibling when they were young.</em></p><p><em><a href=\"https://socialgalactic.com/micropost/36ef9013-8d9c-482c-a361-ebb4720231d9\">DISCUSS ON SG</a></em></p></div>",
  "content_text": "It never occurred to me that one of the Joe Bidens wouldn’t pardon Hunter Biden for his many federal crimes. The only thing that surprised me about it was the timing; I expected it to be issued at the last possible moment, as most controversial pardons are. But according to Jack Posobiec and CDAN, Hunter\nmay have driven the time frame\nas well as its extension back to 2014, years before the crimes for which he was already accused.\nThe son gave the father no choice in this legal issuance . The son was about to sign a book deal and told the father he was not going to censor himself. It isn’t just what the son was charged with now, the wording of the father’s legal issuance goes back 10 years which covers dirty dealings in another country that involved the father. As far as the gross personal stuff goes, one can feel sorry for the son when you consider what the father did to him and another sibling when they were young.\nDISCUSS ON SG",
  "tags": [
    "politics"
  ],
  "categories": [],
  "sitemap_lastmod": "2024-12-04T11:44:39+00:00"
}