{
  "url": "https://voxday.net/2024/12/28/the-devil-champions-foreign-invasion/",
  "scraped_at": "2026-01-08T19:33:50.451483",
  "title": "The Devil Champions Foreign Invasion",
  "date_display": "December 28, 2024",
  "date_iso": "2024-12-28T16:30:32+00:00",
  "date_from_url": "2024-12-28",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>I warned everyone not to go back to Twitter after it was acquired and rebranded by Elon Musk. It was just swapping King Log for King Stork, which is becoming increasingly obvious as <a href=\"https://www.yahoo.com/news/elon-musk-newest-critics-x-142752266.html\">Musk is now seeking to deplatform, demonetize, and suppress the reach</a> of Americans who criticize the federally-approved foreign invasion that has disemployed millions of Americans and lowered their wages.</p><blockquote class=\"wp-block-quote is-layout-flow wp-block-quote-is-layout-flow\"><p>The online beef between Donald Trump’s Silicon Valley backers and the more traditionally conservative MAGA base has culminated in Elon Musk allegedly using X to censor his fellow Trump supporters.</p><p>Laura Loomer, Gavin Mario Wax, ConservativePAC, and Owen Shroyer all had their X verification badges removed Thursday night after criticizing Musk’s stances on labor and immigration earlier in the day.</p><p>“All of our influencers have now lost verification status, as well as our own page,” the Trump-supporting ConservativePAC wrote. “Our brand did nothing. We spoke out against HB1 visas and it appears that @elonmusk intentionally shut us down? Is this the new status quo from America’s ‘most free’ social media platform?”</p></blockquote><p>No, it’s not “the new status quo”. It’s the same as it always was. I have had actual evidence proving that Musk is a liar for two years now. In order to prove my suspicions, in 2022 I asked X tech support to unsuspend my @voxday account which had been suspended since 2017. They promptly informed me that my account would never be reactivated, in direct contradiction to what Musk had been publicly proclaiming at the time.</p><p>The amusing thing is that the Clown World fraud – Elon Musk is most likely a midwit actor, he’s probably not even Mensa material – almost appears to believe that he actually is the character he is playing. His IQ is reportedly five whole points higher than my own, but I have never heard him say or seen him write one single thing that would require an IQ over 120. Does <a href=\"https://x.com/elonmusk/status/1872860577057448306\">this angry and self-defensive tweet</a> sound like anything I, or any other high-IQ individual, has ever written? Or does it sound more like bad 4chan copypasta?</p><p><em>The reason I’m in America along with so many critical people who built SpaceX, Tesla and hundreds of other companies that made America strong is because of H1B. Take a big step back and FUCK YOURSELF in the face. I will go to war on this issue the likes of which you cannot possibly comprehend.</em></p><p>An invader is willing to go to war to import more invaders in order to defend himself from the natives. How very new and different… America would be much better off if he and Ramaswampy would go back to their homelands and take SpaceX, Tesla, and every other fake, propped-up company they’ve financialized with them. What they represent isn’t economic strength, but what is known in the economic literature as “malinvestment”.</p><p><em><a href=\"https://socialgalactic.com/micropost/4efc26ff-a451-4ec4-a5e4-dd406ab15ba2\">DISCUSS ON SG</a></em></p></div>",
  "content_text": "I warned everyone not to go back to Twitter after it was acquired and rebranded by Elon Musk. It was just swapping King Log for King Stork, which is becoming increasingly obvious as\nMusk is now seeking to deplatform, demonetize, and suppress the reach\nof Americans who criticize the federally-approved foreign invasion that has disemployed millions of Americans and lowered their wages.\nThe online beef between Donald Trump’s Silicon Valley backers and the more traditionally conservative MAGA base has culminated in Elon Musk allegedly using X to censor his fellow Trump supporters.\nLaura Loomer, Gavin Mario Wax, ConservativePAC, and Owen Shroyer all had their X verification badges removed Thursday night after criticizing Musk’s stances on labor and immigration earlier in the day.\n“All of our influencers have now lost verification status, as well as our own page,” the Trump-supporting ConservativePAC wrote. “Our brand did nothing. We spoke out against HB1 visas and it appears that @elonmusk intentionally shut us down? Is this the new status quo from America’s ‘most free’ social media platform?”\nNo, it’s not “the new status quo”. It’s the same as it always was. I have had actual evidence proving that Musk is a liar for two years now. In order to prove my suspicions, in 2022 I asked X tech support to unsuspend my @voxday account which had been suspended since 2017. They promptly informed me that my account would never be reactivated, in direct contradiction to what Musk had been publicly proclaiming at the time.\nThe amusing thing is that the Clown World fraud – Elon Musk is most likely a midwit actor, he’s probably not even Mensa material – almost appears to believe that he actually is the character he is playing. His IQ is reportedly five whole points higher than my own, but I have never heard him say or seen him write one single thing that would require an IQ over 120. Does\nthis angry and self-defensive tweet\nsound like anything I, or any other high-IQ individual, has ever written? Or does it sound more like bad 4chan copypasta?\nThe reason I’m in America along with so many critical people who built SpaceX, Tesla and hundreds of other companies that made America strong is because of H1B. Take a big step back and FUCK YOURSELF in the face. I will go to war on this issue the likes of which you cannot possibly comprehend.\nAn invader is willing to go to war to import more invaders in order to defend himself from the natives. How very new and different… America would be much better off if he and Ramaswampy would go back to their homelands and take SpaceX, Tesla, and every other fake, propped-up company they’ve financialized with them. What they represent isn’t economic strength, but what is known in the economic literature as “malinvestment”.\nDISCUSS ON SG",
  "tags": [
    "economics",
    "immigration",
    "media"
  ],
  "categories": [],
  "sitemap_lastmod": "2024-12-28T16:43:35+00:00"
}