{
  "url": "https://voxday.net/2024/12/05/the-media-corporate-censorship-complex/",
  "scraped_at": "2026-01-08T19:31:41.090594",
  "title": "The Media-Corporate Censorship Complex",
  "date_display": "December 5, 2024",
  "date_iso": "2024-12-05T09:08:07+00:00",
  "date_from_url": "2024-12-05",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>Mike Benz explains the development of <a href=\"https://substack.com/app-link/post?publication_id=581739&amp;post_id=152595643&amp;utm_source=post-email-title&amp;utm_campaign=email-post-title&amp;isFreemail=true&amp;r=ch1cg&amp;token=eyJ1c2VyX2lkIjoyMDk1MDI4OCwicG9zdF9pZCI6MTUyNTk1NjQzLCJpYXQiOjE3MzMzNjIyNjMsImV4cCI6MTczNTk1NDI2MywiaXNzIjoicHViLTU4MTczOSIsInN1YiI6InBvc3QtcmVhY3Rpb24ifQ.nfTDoSaNol4X82K6Ybe2kQyUP2ewf87c_PS_E_KlwS8\">the insidious surveillance and censorship regime</a> inside the United States that has resulted from the wicked alliance of federal government, private corporations, and non-profit organizations coming together to exert control over the American people:</p><blockquote class=\"wp-block-quote is-layout-flow wp-block-quote-is-layout-flow\"><p><strong>1. Government and Tech Collaboration</strong>: Benz described how the U.S. government has increasingly leaned on tech companies like Google and Twitter to censor content deemed as misinformation or disinformation. He traced the origins of this collaboration back to when tech companies were part of national security strategies, especially post-2016 election combined with the Russian Collusion hoax. to “combat foreign interference”, which has since morphed into broader domestic censorship efforts.</p><p><strong>2. Military-Industrial Complex Influence</strong>: The military-industrial complex has mechanisms used for foreign influence operations; these have turned inward to control domestic narratives. This has included funding and influence from defense-related entities to shape information environments, both abroad and at home.</p><p><strong>3. NGOs as Government Proxies</strong>: Numerous NGOs act as government proxies in executing censorship policies. These organizations, often funded by the government or large foundations, help shape the narrative by influencing social media platforms to censor content under the guise of combating disinformation. Examples include the Atlantic Council and the Aspen Institute, which have been implicated in influencing digital content moderation.</p><p><strong>4. Universities and Academic Institutions</strong>: Dozens of U.S. universities have established taxpayer-funded centers focused on disinformation studies, which he claims are essentially censorship hubs. These include major universities where departments like sociology, communications, or even applied physics are involved in developing AI and other tools for censorship. This academic involvement is seen as part of a broader civil society effort to legitimize and carry out censorship initiatives.</p><p><strong>5. Media’s Role</strong>: The media plays a significant role in this complex by often promoting narratives that align with government interests or by directly participating in the censorship by flagging content or influencing public opinion against certain discourses. Media outlets work in tandem with government agencies to push for the censorship of certain viewpoints.</p><p><strong>6. The Role of the Intelligence Community</strong>: Benz detailed how intelligence agencies have covertly influenced online narratives. He cited instances where the NSA and other intelligence bodies have allegedly collaborated with media to target political opponents or narratives not favorable to the establishment’s views, using leaks and other clandestine methods.</p><p><strong>7. Election Integrity and Censorship</strong>: He argued that the censorship apparatus was significantly ramped up around elections, with the intention of controlling political discourse. Events like Russiagate were used as justifications to expand these operations, which Benz claims are aimed at suppressing populist movements that threaten the status quo of the foreign policy establishment.</p><p><strong>8. EU’s Influence on Censorship</strong>: Benz also touched on how European Union policies, particularly the Digital Services Act, have implications for global internet freedom. He suggested these laws are designed to curb the rise of populist parties by controlling what can be said online, which indirectly pressures U.S. platforms due to their international operations.</p><p><strong>9. The Whole of Society Approach</strong>: Benz explained the concept of a “whole of society” approach to disinformation, where the government funds and coordinates with various societal sectors to enforce censorship. This includes not just tech companies but also think tanks, university programs, and media outlets, creating a seemingly democratic push for censorship that’s actually orchestrated from the top.</p><p><strong>10. Legal and Policy Frameworks</strong>: He critiqued how laws and policies have been shaped to justify this censorship under the guise of protecting democracy or national security. Benz suggested that this framing inverts democratic principles by allowing government control over speech to preserve the power of certain institutions, like legacy media, which he claims are seen as assets to be protected through censorship.</p></blockquote><p>This complex is an essential tool of what some describe as the Deep State, as well as the neo-satanic construct that, for lack of any better term, we call Clown World. If President Trump is serious about fulfilling his duty to the American people, he will have to begin dismantling it as soon as he takes office rather than trying to work with it.</p><p><em><a href=\"https://socialgalactic.com/micropost/ca051954-c781-4410-8311-30b2edb23d75\">DISCUSS ON SG</a></em></p></div>",
  "content_text": "Mike Benz explains the development of\nthe insidious surveillance and censorship regime\ninside the United States that has resulted from the wicked alliance of federal government, private corporations, and non-profit organizations coming together to exert control over the American people:\n1. Government and Tech Collaboration\n: Benz described how the U.S. government has increasingly leaned on tech companies like Google and Twitter to censor content deemed as misinformation or disinformation. He traced the origins of this collaboration back to when tech companies were part of national security strategies, especially post-2016 election combined with the Russian Collusion hoax. to “combat foreign interference”, which has since morphed into broader domestic censorship efforts.\n2. Military-Industrial Complex Influence\n: The military-industrial complex has mechanisms used for foreign influence operations; these have turned inward to control domestic narratives. This has included funding and influence from defense-related entities to shape information environments, both abroad and at home.\n3. NGOs as Government Proxies\n: Numerous NGOs act as government proxies in executing censorship policies. These organizations, often funded by the government or large foundations, help shape the narrative by influencing social media platforms to censor content under the guise of combating disinformation. Examples include the Atlantic Council and the Aspen Institute, which have been implicated in influencing digital content moderation.\n4. Universities and Academic Institutions\n: Dozens of U.S. universities have established taxpayer-funded centers focused on disinformation studies, which he claims are essentially censorship hubs. These include major universities where departments like sociology, communications, or even applied physics are involved in developing AI and other tools for censorship. This academic involvement is seen as part of a broader civil society effort to legitimize and carry out censorship initiatives.\n5. Media’s Role\n: The media plays a significant role in this complex by often promoting narratives that align with government interests or by directly participating in the censorship by flagging content or influencing public opinion against certain discourses. Media outlets work in tandem with government agencies to push for the censorship of certain viewpoints.\n6. The Role of the Intelligence Community\n: Benz detailed how intelligence agencies have covertly influenced online narratives. He cited instances where the NSA and other intelligence bodies have allegedly collaborated with media to target political opponents or narratives not favorable to the establishment’s views, using leaks and other clandestine methods.\n7. Election Integrity and Censorship\n: He argued that the censorship apparatus was significantly ramped up around elections, with the intention of controlling political discourse. Events like Russiagate were used as justifications to expand these operations, which Benz claims are aimed at suppressing populist movements that threaten the status quo of the foreign policy establishment.\n8. EU’s Influence on Censorship\n: Benz also touched on how European Union policies, particularly the Digital Services Act, have implications for global internet freedom. He suggested these laws are designed to curb the rise of populist parties by controlling what can be said online, which indirectly pressures U.S. platforms due to their international operations.\n9. The Whole of Society Approach\n: Benz explained the concept of a “whole of society” approach to disinformation, where the government funds and coordinates with various societal sectors to enforce censorship. This includes not just tech companies but also think tanks, university programs, and media outlets, creating a seemingly democratic push for censorship that’s actually orchestrated from the top.\n10. Legal and Policy Frameworks\n: He critiqued how laws and policies have been shaped to justify this censorship under the guise of protecting democracy or national security. Benz suggested that this framing inverts democratic principles by allowing government control over speech to preserve the power of certain institutions, like legacy media, which he claims are seen as assets to be protected through censorship.\nThis complex is an essential tool of what some describe as the Deep State, as well as the neo-satanic construct that, for lack of any better term, we call Clown World. If President Trump is serious about fulfilling his duty to the American people, he will have to begin dismantling it as soon as he takes office rather than trying to work with it.\nDISCUSS ON SG",
  "tags": [
    "Clown World",
    "corpocracy",
    "law"
  ],
  "categories": [],
  "sitemap_lastmod": "2024-12-05T09:08:12+00:00"
}