{
  "url": "https://voxday.net/2024/12/05/this-very-night/",
  "scraped_at": "2026-01-08T19:31:42.932210",
  "title": "This Very Night",
  "date_display": "December 5, 2024",
  "date_iso": "2024-12-05T12:00:00+00:00",
  "date_from_url": "2024-12-05",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>About three years ago, Big Bear and I were talking about Christmas carols and lamenting the fact that so many of them, including several that were our favorites, were inspired by a spirit of anti-Christian subversion. Many secular carols, including a number of genuinely great songs such as <em>Winter Wonderland</em> and <em>White Christmas</em>, were written and pushed by Hollywood with the specific intention of replacing the traditional Christmas carols that are focused on the Christian purpose of the holy day, or “holiday” as we know it now.</p><p>I mean, <em>Silver Bells</em> has always been a particular favorite of mine since childhood, and yet, it’s essentially a song about an urban shopping experience. It’s not exactly <em>The Messiah</em> or <em>Adeste Fideles</em>.</p><p>I made a few desultory efforts at penning something, but never really got around to doing anything with it until recently. But now that AI music has added turbo warp speed to one’s compositional capabilities, I was able to finish a Christmas carol entitled <em>This Very Night</em>, and since Vibe Patrol follows the Psykosonik tradition of producing at least five very different mixes of every single, two of them are already up on UATV for subscribers to hear and download. I’ll be making the other mixes and additional new carols available over the next three weeks. The Christmas Bear mix is, of course, for the Bears, toe express my appreciation for Big Bear and his tremendous community, hence the one line that would tend to strike anyone else as a bit, shall we say, <em>prosaic</em>.</p><ul class=\"wp-block-list\"><li><a href=\"https://unauthorized.tv/video/51e205/\">This Very Night (Christmas Bear mix)</a></li><li><a href=\"https://unauthorized.tv/video/c9930e/\">This Very Night (Northern Nights mix)</a></li></ul><div class=\"wp-block-image\"><figure class=\"aligncenter size-full\"><a href=\"https://unauthorized.tv/video/51e205/\"><img alt=\"\" class=\"wp-image-65541\" decoding=\"async\" fetchpriority=\"high\" height=\"512\" sizes=\"(max-width: 512px) 100vw, 512px\" src=\"https://voxday.net/wp-content/uploads/2024/12/image-4.png\" srcset=\"https://voxday.net/wp-content/uploads/2024/12/image-4.png 512w, https://voxday.net/wp-content/uploads/2024/12/image-4-300x300.png 300w, https://voxday.net/wp-content/uploads/2024/12/image-4-150x150.png 150w\" width=\"512\"/></a></figure></div><p><em><a href=\"https://socialgalactic.com/micropost/ac9732e5-7825-41bd-8976-42f5a341df02\">DISCUSS ON SG</a></em></p></div>",
  "content_text": "About three years ago, Big Bear and I were talking about Christmas carols and lamenting the fact that so many of them, including several that were our favorites, were inspired by a spirit of anti-Christian subversion. Many secular carols, including a number of genuinely great songs such as\nWinter Wonderland\nand\nWhite Christmas\n, were written and pushed by Hollywood with the specific intention of replacing the traditional Christmas carols that are focused on the Christian purpose of the holy day, or “holiday” as we know it now.\nI mean,\nSilver Bells\nhas always been a particular favorite of mine since childhood, and yet, it’s essentially a song about an urban shopping experience. It’s not exactly\nThe Messiah\nor\nAdeste Fideles\n.\nI made a few desultory efforts at penning something, but never really got around to doing anything with it until recently. But now that AI music has added turbo warp speed to one’s compositional capabilities, I was able to finish a Christmas carol entitled\nThis Very Night\n, and since Vibe Patrol follows the Psykosonik tradition of producing at least five very different mixes of every single, two of them are already up on UATV for subscribers to hear and download. I’ll be making the other mixes and additional new carols available over the next three weeks. The Christmas Bear mix is, of course, for the Bears, toe express my appreciation for Big Bear and his tremendous community, hence the one line that would tend to strike anyone else as a bit, shall we say,\nprosaic\n.\nThis Very Night (Christmas Bear mix)\nThis Very Night (Northern Nights mix)\nDISCUSS ON SG",
  "tags": [
    "music",
    "UATV"
  ],
  "categories": [],
  "sitemap_lastmod": "2024-12-05T13:50:58+00:00"
}