{
  "url": "https://voxday.net/2024/12/20/yeah-its-going-to-get-worse/",
  "scraped_at": "2026-01-08T19:33:15.477475",
  "title": "Yeah, It’s Going to Get Worse",
  "date_display": "December 20, 2024",
  "date_iso": "2024-12-20T16:55:24+00:00",
  "date_from_url": "2024-12-20",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>And by worse, I mean a LOT worse for Neil Gaiman fans, as in the aftermath of multiple sexual assault accusations being made, non-fans are going back, reading Gaiman’s work, and observing what was always – and I do mean always – <a href=\"https://www.reddit.com/r/neilgaiman/comments/1hgv21h/snow_glass_apples_etc_why_is_no_one_talking_about/\">obvious in his work</a>:</p><blockquote class=\"wp-block-quote is-layout-flow wp-block-quote-is-layout-flow\"><p>Many years ago I bought a huge anthology of Gaiman’s stories. I wasn’t familiar with his work and wanted to give this man a chance. The book collected dust for ages until this week. I had no idea about the allegations when I started reading, but the stories disturbed me enough that I got curious about him and googled. Based on the stories I’m reading so far, I can’t say I’m surprised. I know y’all are huge fans over here, but….has no one noticed how strange his approach to writing women and children is????</p><p>I just finished<em> Snow Glass Apples</em>, about a 13 year old girl prostitute vampire that get’s happily r***d by a necrophiliac… He’s very clearly a master storyteller, he didn’t have to go there. He could have easily disturbed us without having to resort to the pedo overtones. But he made the choice to go there. He wanted to. He likes the story better this way.</p><p>There are traces of this kind of thing in the stories I’ve read so far – the way the troll in Troll Bridge sniffs at the 15 year old girl’s breasts and crotch. Again, the story was good on it’s own. These details add nothing to the story except to be edgy by sexualizing a very young girl.</p></blockquote><p>It’s not simply about what you write, <em>it’s the way you write about it.</em> There are no shortage of people who were severely put off by my approach to the multicultural interactions portrayed in the prologue to <em>A SEAS OF SKULLS</em>. And due to the way I wrote about it, no one is going to conclude that I am pro-beheading, pro-rape, or pro-crucifixion, although they might correctly conclude that I am not enthusiastic about mass migration.</p><p>When, like Neil Gaiman, you’re writing about underage teenage girls and putting them in overtly sexual situations on a regular basis, then drawing a bath for your wife’s young nanny and exposing yourself to her, there is an awful lot of very foul-smelling smoke that lends itself to the conclusion there is a extremely nasty fire burning somewhere in the dark.</p><p>Tanith Lee wrote a fair amount of dark sexual material. She also wrote about children from time to time. But what she did not do was combine the two. While what one writes tells the reader a lot about the writer, how one writes tells the reader even more and may even provide some hints as to why.</p><p>There are rumors that a big story about Gaiman will be published in mid-January. We’ll see, and we probably shouldn’t be surprised by anything that might be alleged. After all, he managed to convince a surprising number of people that he was “a master storyteller” when he has always been more akin to a deejay doing remixes than an original musician.</p><p><em><a href=\"https://socialgalactic.com/micropost/e8427a65-1f72-4cd8-bac3-e2bf6dbb707d\">DISCUSS ON SG</a></em></p></div>",
  "content_text": "And by worse, I mean a LOT worse for Neil Gaiman fans, as in the aftermath of multiple sexual assault accusations being made, non-fans are going back, reading Gaiman’s work, and observing what was always – and I do mean always –\nobvious in his work\n:\nMany years ago I bought a huge anthology of Gaiman’s stories. I wasn’t familiar with his work and wanted to give this man a chance. The book collected dust for ages until this week. I had no idea about the allegations when I started reading, but the stories disturbed me enough that I got curious about him and googled. Based on the stories I’m reading so far, I can’t say I’m surprised. I know y’all are huge fans over here, but….has no one noticed how strange his approach to writing women and children is????\nI just finished\nSnow Glass Apples\n, about a 13 year old girl prostitute vampire that get’s happily r***d by a necrophiliac… He’s very clearly a master storyteller, he didn’t have to go there. He could have easily disturbed us without having to resort to the pedo overtones. But he made the choice to go there. He wanted to. He likes the story better this way.\nThere are traces of this kind of thing in the stories I’ve read so far – the way the troll in Troll Bridge sniffs at the 15 year old girl’s breasts and crotch. Again, the story was good on it’s own. These details add nothing to the story except to be edgy by sexualizing a very young girl.\nIt’s not simply about what you write,\nit’s the way you write about it.\nThere are no shortage of people who were severely put off by my approach to the multicultural interactions portrayed in the prologue to\nA SEAS OF SKULLS\n. And due to the way I wrote about it, no one is going to conclude that I am pro-beheading, pro-rape, or pro-crucifixion, although they might correctly conclude that I am not enthusiastic about mass migration.\nWhen, like Neil Gaiman, you’re writing about underage teenage girls and putting them in overtly sexual situations on a regular basis, then drawing a bath for your wife’s young nanny and exposing yourself to her, there is an awful lot of very foul-smelling smoke that lends itself to the conclusion there is a extremely nasty fire burning somewhere in the dark.\nTanith Lee wrote a fair amount of dark sexual material. She also wrote about children from time to time. But what she did not do was combine the two. While what one writes tells the reader a lot about the writer, how one writes tells the reader even more and may even provide some hints as to why.\nThere are rumors that a big story about Gaiman will be published in mid-January. We’ll see, and we probably shouldn’t be surprised by anything that might be alleged. After all, he managed to convince a surprising number of people that he was “a master storyteller” when he has always been more akin to a deejay doing remixes than an original musician.\nDISCUSS ON SG",
  "tags": [
    "freakshow",
    "SJW",
    "writing"
  ],
  "categories": [],
  "sitemap_lastmod": "2024-12-20T16:55:28+00:00"
}