{
  "url": "https://voxday.net/2021/09/27/%e7%9c%9f%e5%96%84%e7%be%8e/",
  "scraped_at": "2026-01-08T12:53:28.593313",
  "title": "真善美",
  "date_display": "September 27, 2021",
  "date_iso": "2021-09-27T12:00:00+00:00",
  "date_from_url": "2021-09-27",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>Those who are mystified as to why I have a very high opinion of Xi Jinping tend to amuse me, mostly because they are some of the same people who bought into the previous <a href=\"https://www.businessinsider.com.au/people-who-compared-putin-to-hitler-2014-5\" rel=\"noreferrer noopener\" target=\"_blank\">“Putin is Hitler”</a> theme between 2007 and 2014. As for the Boomer-tier “don’t you know they is CHICOMS” nonsense, I would merely point out that the Chinese Communist Party is presently less communist than the Democratic Party is democratic or the Republican Party is republican. Things tend to change over the course of 100 years; the CCP of Xi is not the CCP of Deng, let alone the CCP of Mao.</p><p>Anyhow, Xi and Putin are the two great nationalist leaders who successfully stand against Babel, the failing neoliberal world order also known as globohomo. Xi and Putin had the courage to succeed that Donald Trump lacked; it’s worth noting that none of the three leaders were supposed to succeed their predecessors.</p><p>And just as it’s finally beginning to be known that Putin has been methodically rebuilding the Russian Orthodox churches, Xi’s nine-year campaign to improve Chinese culture through literature and entertainment is gradually starting to bear fruit. The three Chinese ideographs above are <em>zhen shan mei</em>, which means True, Good, and Beautiful, and they are the conceptual centerpiece of Xi’s cultural revolution.</p><blockquote class=\"wp-block-quote is-layout-flow wp-block-quote-is-layout-flow\"><p>Xi Jinping stressed that pursuing the true, the good and the beautiful is the eternal value of literature and art. The highest boundary of literature and art is moving people, letting the spirits of people experience baptisms, letting the people discover the beauty of nature, the beauty of life and the beauty of the spirit. We must, through literature and art works, spread the true, the good and the beautiful, spread upward and charitable value views, guide the people in strengthening their powers of moral judgment and their sense of moral honour, yearn for and pursue a life of stressing morals, respecting morals and abiding morals. As long as the Chinese nation pursues the moral plane of the true, the good and the beautiful generation by generation, our nation will be eternally healthy and upward, and will for always be full of hope.</p><p>Xi Jinping pointed out that China’s excellent traditional culture is the spiritual lifeline of the Chinese nation, is an important source nourishing the Socialist core value system, and is a firm basis for us to get a firm foothold within the global cultural surge. We must integrate the conditions of new times with inheriting and carrying forward China’s excellent traditional culture, and inheriting and carrying forward a Chinese aesthetic spirit. For our Socialist literature and art to flourish and develop, we must earnestly study and learn from the excellent literature and art created by people in all countries worldwide. Only if we persist in using the foreign to serve the Chinese, exploration and innovation, ensuring combinations of the Chinese and the Western, and mastery through comprehensive study, will our country’s literature and art be able to flourish and develop better.</p><cite>Xi Jinping’s Talks at the Beijing Forum on Literature and Art, 16 October 2014</cite></blockquote><p>Compare the Chinese program with the unmitigated filth and appalling celebration of the False, the Wicked, and the Ugly of the last 100 years of Western art and literature. When is the last time any Western leader dared to stand firmly against the degradation of Western culture, or to even lift a finger in an attempt to raise the cultural standards of the West? And Xi’s culture campaign is not a communist program, it is an intrinsically Chinese nationalist one, one that has its roots in the consciousness of the consequences of past decadence and was almost certainly inspired by the cultural campaign instituted by the great Lee Kuan Yew when he first came to power in Singapore in 1959.</p><blockquote class=\"wp-block-quote is-layout-flow wp-block-quote-is-layout-flow\"><p>There were, in addition, several easy, popular points to be scored that required no planning, including a series of “anti-yellow culture” prohibitions imposed by Pang Boon as minister for home affairs. “Yellow culture” was a literal translation of the Mandarin phrase for the decadent and degenerate behaviour that had brought China to its knees in the 19th century: gambling, opium-smoking, pornography, multiple wives and concubines, the selling of daughters into prostitution, corruption and nepotism. This aversion to “yellow culture” had been imported by schoolteachers from China, who infused into our students and their parents the spirit of national revival that was evident in every chapter of the textbooks they brought with them, whether on literature, history or geography.</p><cite><em>The Singapore Story</em>, Lee Kuan Yew, 1998</cite></blockquote><p>We are not the Chinese and they are not us. But the enemy of our mutual enemy is our friend, and there is a long and positive history of Christians showing respect for the noble and virtuous pagans.</p><p><em><a href=\"https://social.infogalactic.com/micropost/dfd43a9c-7bed-498b-be45-5530cd6b18a2\" rel=\"noreferrer noopener\" target=\"_blank\">DISCUSS ON SG</a></em></p></div>",
  "content_text": "Those who are mystified as to why I have a very high opinion of Xi Jinping tend to amuse me, mostly because they are some of the same people who bought into the previous\n“Putin is Hitler”\ntheme between 2007 and 2014. As for the Boomer-tier “don’t you know they is CHICOMS” nonsense, I would merely point out that the Chinese Communist Party is presently less communist than the Democratic Party is democratic or the Republican Party is republican. Things tend to change over the course of 100 years; the CCP of Xi is not the CCP of Deng, let alone the CCP of Mao.\nAnyhow, Xi and Putin are the two great nationalist leaders who successfully stand against Babel, the failing neoliberal world order also known as globohomo. Xi and Putin had the courage to succeed that Donald Trump lacked; it’s worth noting that none of the three leaders were supposed to succeed their predecessors.\nAnd just as it’s finally beginning to be known that Putin has been methodically rebuilding the Russian Orthodox churches, Xi’s nine-year campaign to improve Chinese culture through literature and entertainment is gradually starting to bear fruit. The three Chinese ideographs above are\nzhen shan mei\n, which means True, Good, and Beautiful, and they are the conceptual centerpiece of Xi’s cultural revolution.\nXi Jinping stressed that pursuing the true, the good and the beautiful is the eternal value of literature and art. The highest boundary of literature and art is moving people, letting the spirits of people experience baptisms, letting the people discover the beauty of nature, the beauty of life and the beauty of the spirit. We must, through literature and art works, spread the true, the good and the beautiful, spread upward and charitable value views, guide the people in strengthening their powers of moral judgment and their sense of moral honour, yearn for and pursue a life of stressing morals, respecting morals and abiding morals. As long as the Chinese nation pursues the moral plane of the true, the good and the beautiful generation by generation, our nation will be eternally healthy and upward, and will for always be full of hope.\nXi Jinping pointed out that China’s excellent traditional culture is the spiritual lifeline of the Chinese nation, is an important source nourishing the Socialist core value system, and is a firm basis for us to get a firm foothold within the global cultural surge. We must integrate the conditions of new times with inheriting and carrying forward China’s excellent traditional culture, and inheriting and carrying forward a Chinese aesthetic spirit. For our Socialist literature and art to flourish and develop, we must earnestly study and learn from the excellent literature and art created by people in all countries worldwide. Only if we persist in using the foreign to serve the Chinese, exploration and innovation, ensuring combinations of the Chinese and the Western, and mastery through comprehensive study, will our country’s literature and art be able to flourish and develop better.\nXi Jinping’s Talks at the Beijing Forum on Literature and Art, 16 October 2014\nCompare the Chinese program with the unmitigated filth and appalling celebration of the False, the Wicked, and the Ugly of the last 100 years of Western art and literature. When is the last time any Western leader dared to stand firmly against the degradation of Western culture, or to even lift a finger in an attempt to raise the cultural standards of the West? And Xi’s culture campaign is not a communist program, it is an intrinsically Chinese nationalist one, one that has its roots in the consciousness of the consequences of past decadence and was almost certainly inspired by the cultural campaign instituted by the great Lee Kuan Yew when he first came to power in Singapore in 1959.\nThere were, in addition, several easy, popular points to be scored that required no planning, including a series of “anti-yellow culture” prohibitions imposed by Pang Boon as minister for home affairs. “Yellow culture” was a literal translation of the Mandarin phrase for the decadent and degenerate behaviour that had brought China to its knees in the 19th century: gambling, opium-smoking, pornography, multiple wives and concubines, the selling of daughters into prostitution, corruption and nepotism. This aversion to “yellow culture” had been imported by schoolteachers from China, who infused into our students and their parents the spirit of national revival that was evident in every chapter of the textbooks they brought with them, whether on literature, history or geography.\nThe Singapore Story\n, Lee Kuan Yew, 1998\nWe are not the Chinese and they are not us. But the enemy of our mutual enemy is our friend, and there is a long and positive history of Christians showing respect for the noble and virtuous pagans.\nDISCUSS ON SG",
  "tags": [
    "Art",
    "China"
  ],
  "categories": [],
  "sitemap_lastmod": "2021-09-27T12:03:56+00:00"
}