{
  "url": "https://voxday.net/2021/09/23/angelo-codevilla-r-i-p/",
  "scraped_at": "2026-01-08T12:52:58.722832",
  "title": "Angelo Codevilla R.I.P.",
  "date_display": "September 23, 2021",
  "date_iso": "2021-09-23T13:04:07+00:00",
  "date_from_url": "2021-09-23",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p><em>All of us in the Claremont Institute extended family were gutted this morning by the news of Angelo Codevilla’s death. He was on his way home yesterday to his beloved vineyard in Plymouth, California, when some kind of car accident occurred. The details remain thin, but the loss is deep.</em></p><p><a href=\"https://americanmind.org/salvo/the-great-and-good-angelo-codevilla/\" rel=\"noreferrer noopener\" target=\"_blank\">“Some kind of car accident”</a> sounds a little sketchy, although if he was driving at the age of 78, it’s quite possible that it was simply an accident. That being said, Codevilla was a well-connected and outspoken critic of the CIA and the US Deep State.</p><blockquote class=\"wp-block-quote is-layout-flow wp-block-quote-is-layout-flow\"><p>America’s Intelligence agencies are the deep state’s deepest part, and the most immediate threat to representative government. They are also not very good at what they are supposed to be doing. Protecting the Republic from them requires refocusing them on their proper jobs.</p><p>Intelligence officials abuse their positions to discredit opposition to the Democratic Party, of which they are part. Complicit with the media, they leverage the public’s mistaken faith in their superior knowledge, competence, and patriotism to vilify their domestic enemies from behind secrecy’s shield.</p><p>Pretenses of superior knowledge have always tempted the Administrative State’s officials to manipulate or override voters. Hence, as Justice Robert H. Jackson (who served as chief prosecutor of the Nuremberg trials) warned, they often turn their powers against whomever they dislike politically, socially, or personally and try to minimize the public’s access to the bases upon which they act.</p><p>But only the Intelligence agencies have the power to do that while claiming that scrutiny of their pretenses endangers national security. They have succeeded in restricting information about their misdeeds by “classifying” them under the Espionage Act of 1921. Thus covered, they misrepresent their opinions as knowledge and their preferences as logic. Thus acting as irresponsible arbiters of truth at the highest levels of American public life, they are the foremost jaws of the ruling class vise that is squeezing self-rule out of America.</p><p>As Senator Charles Schumer (D-NY) truly told President Trump, “Let me tell you, you take on the intelligence community, they have six ways from Sunday at getting back at you.” As we shall see, Intelligence officials have proved Schumer correct.</p><p>What follows begins with an overview of the threats today’s intelligence agencies pose to self-government in America.</p><p>Next, it touches on U.S. intelligence’s dismal professional record, and suggests that the measures needed to refocus them on professional performance would also separate them from domestic politics.</p></blockquote><p>His conclusions, which I tend to doubt made him very popular at the agency:</p><ul class=\"wp-block-list\"><li><em><strong>CIA is obsolete.</strong> Cables show agents’ intelligence takes are inferior to diplomats’. Agent networks are unprotected by counterintelligence. FBI success at counterintelligence ended when the Bureau was politicized and bureaucratized in the 1970s. CIA bottlenecks and incompetently controls strategic intelligence, while the Army and Marines show demonstrable tactical superiority.</em></li><li><em><strong>As a result, CIA is ideologically partisan.</strong> Its strength is in leading or joining domestic campaigns to influence public opinion. FBI has followed suit.</em></li><li><em><strong>Senior intelligence officials were the key element in the war on Donald Trump’s candidacy and presidency.</strong> CIA used meetings that it manufactured as factual bases for lies about campaign advisors seeking Russian information to smear Hillary Clinton. Intelligence began formal investigation and surveillance without probable cause. Agents gained authorization to electronically surveil Trump and his campaign and defended their bureaucratic interests, sidelining Lieutenant General Michael Flynn and denying or delaying Trump appointments and security clearances.</em></li><li><em><strong>Partisanship produces failure.</strong> FISA has incentivized political abuse. “Profiling” has failed repeatedly in high-profile cases like the Atlanta Olympics bombing and the anthrax mail attacks. Perjury trapping has become commonplace.</em></li></ul><p></p></div>",
  "content_text": "All of us in the Claremont Institute extended family were gutted this morning by the news of Angelo Codevilla’s death. He was on his way home yesterday to his beloved vineyard in Plymouth, California, when some kind of car accident occurred. The details remain thin, but the loss is deep.\n“Some kind of car accident”\nsounds a little sketchy, although if he was driving at the age of 78, it’s quite possible that it was simply an accident. That being said, Codevilla was a well-connected and outspoken critic of the CIA and the US Deep State.\nAmerica’s Intelligence agencies are the deep state’s deepest part, and the most immediate threat to representative government. They are also not very good at what they are supposed to be doing. Protecting the Republic from them requires refocusing them on their proper jobs.\nIntelligence officials abuse their positions to discredit opposition to the Democratic Party, of which they are part. Complicit with the media, they leverage the public’s mistaken faith in their superior knowledge, competence, and patriotism to vilify their domestic enemies from behind secrecy’s shield.\nPretenses of superior knowledge have always tempted the Administrative State’s officials to manipulate or override voters. Hence, as Justice Robert H. Jackson (who served as chief prosecutor of the Nuremberg trials) warned, they often turn their powers against whomever they dislike politically, socially, or personally and try to minimize the public’s access to the bases upon which they act.\nBut only the Intelligence agencies have the power to do that while claiming that scrutiny of their pretenses endangers national security. They have succeeded in restricting information about their misdeeds by “classifying” them under the Espionage Act of 1921. Thus covered, they misrepresent their opinions as knowledge and their preferences as logic. Thus acting as irresponsible arbiters of truth at the highest levels of American public life, they are the foremost jaws of the ruling class vise that is squeezing self-rule out of America.\nAs Senator Charles Schumer (D-NY) truly told President Trump, “Let me tell you, you take on the intelligence community, they have six ways from Sunday at getting back at you.” As we shall see, Intelligence officials have proved Schumer correct.\nWhat follows begins with an overview of the threats today’s intelligence agencies pose to self-government in America.\nNext, it touches on U.S. intelligence’s dismal professional record, and suggests that the measures needed to refocus them on professional performance would also separate them from domestic politics.\nHis conclusions, which I tend to doubt made him very popular at the agency:\nCIA is obsolete.\nCables show agents’ intelligence takes are inferior to diplomats’. Agent networks are unprotected by counterintelligence. FBI success at counterintelligence ended when the Bureau was politicized and bureaucratized in the 1970s. CIA bottlenecks and incompetently controls strategic intelligence, while the Army and Marines show demonstrable tactical superiority.\nAs a result, CIA is ideologically partisan.\nIts strength is in leading or joining domestic campaigns to influence public opinion. FBI has followed suit.\nSenior intelligence officials were the key element in the war on Donald Trump’s candidacy and presidency.\nCIA used meetings that it manufactured as factual bases for lies about campaign advisors seeking Russian information to smear Hillary Clinton. Intelligence began formal investigation and surveillance without probable cause. Agents gained authorization to electronically surveil Trump and his campaign and defended their bureaucratic interests, sidelining Lieutenant General Michael Flynn and denying or delaying Trump appointments and security clearances.\nPartisanship produces failure.\nFISA has incentivized political abuse. “Profiling” has failed repeatedly in high-profile cases like the Atlanta Olympics bombing and the anthrax mail attacks. Perjury trapping has become commonplace.",
  "tags": [
    "conspiracy",
    "RIP"
  ],
  "categories": [],
  "sitemap_lastmod": "2021-09-23T13:23:21+00:00"
}