{
  "url": "https://voxday.net/2021/09/20/evading-the-obvious/",
  "scraped_at": "2026-01-08T12:52:33.731183",
  "title": "Evading the Obvious",
  "date_display": "September 20, 2021",
  "date_iso": "2021-09-20T12:56:07+00:00",
  "date_from_url": "2021-09-20",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>It’s always amusing to see how SJWs set their projects up for failure, then do their best to hide the obvious reason for the failure from everyone. This year’s Strictly Come Dancing premier, which is one of the most popular British television events, <a href=\"https://www.dailymail.co.uk/tvshowbiz/article-10008715/Strictly-launchs-lowest-viewing-figures-attributed-lacklustre-line-up.html\" rel=\"noreferrer noopener\" target=\"_blank\">mysteriously lost 16 percent of its ratings</a> from last year’s premier, and is down nearly one-quarter from its 2016 peak viewership. A plethora of reasons for this decline have been suggested.</p><blockquote class=\"wp-block-quote is-layout-flow wp-block-quote-is-layout-flow\"><p>Strictly’s launch night scored its lowest ever viewing figures on Saturday – with the low numbers said to be down to good weather, line-up and anti-vaxx controversy.</p><p>The BBC show attracted an audience of 7.2 million viewers for the inaugural show over the weekend, and while those numbers remain broadly impressive, they still represent a significant drop from last year’s 8.6 million.</p><p>While insiders remain positive over a rise when live shows return, prior to the launch airing fans insisted they were less than impressed with the line-up and Covid claims surrounding the show, while sources said the good weather was to blame.</p><p>Other users grumbled over the absence of Janette Manrara and insisted the show peaked with last year’s winner Bill Bailey. The Twitter users in question penned: ‘Why is janette not dancing this year? I love watching her. It’s not the same on ITT… I’m not even watching it this year, Bill was peak Strictly for me, cannot be beaten’.</p><p>Another claim was that the weather was a key factor in explaining the figures.</p><p>The TV source told the Sunday Mirror newspaper: ‘Lots of people had been out and about enjoying the early autumn sunshine and will probably watch on catch-up today.’</p><p>Other concerns surround the news of a ‘no jab, no jive’ row, over the refusal of two of its dancers to be vaccinated.</p></blockquote><p>Of course, while the real reason is mentioned, it is not mentioned in the context of being responsible for the near-textbook ratings loss, which I would anticipate will end up being around the usual 20 percent first-year convergence-related decline described in <em>Corporate Cancer</em>.</p><blockquote class=\"wp-block-quote is-layout-flow wp-block-quote-is-layout-flow\"><p>Craig Revel Horwood has tipped John Waite and Johannes Radebe to win this year’s ‘Strictly’. <strong><em>The duo have formed the first ever all-male pairing on the show</em></strong>, and Craig views them as the frontrunners in this year’s competition.</p></blockquote><p>Yeah, it’s probably the weather. Right. The reality is that the better the offensive all-male pairing does on the show, the more the ratings will decline. It doesn’t matter whether the subject is sports, video games, or female-focused television, convergence always kills. And those pushing and/or defending the convergence never, ever learn from all of the previously documented examples of the phenomenon.</p><p><em><a href=\"https://social.infogalactic.com/micropost/856c4d20-f21e-43f1-83a6-b76ecf0e6046\" rel=\"noreferrer noopener\" target=\"_blank\">DISCUSS ON SG</a></em></p></div>",
  "content_text": "It’s always amusing to see how SJWs set their projects up for failure, then do their best to hide the obvious reason for the failure from everyone. This year’s Strictly Come Dancing premier, which is one of the most popular British television events,\nmysteriously lost 16 percent of its ratings\nfrom last year’s premier, and is down nearly one-quarter from its 2016 peak viewership. A plethora of reasons for this decline have been suggested.\nStrictly’s launch night scored its lowest ever viewing figures on Saturday – with the low numbers said to be down to good weather, line-up and anti-vaxx controversy.\nThe BBC show attracted an audience of 7.2 million viewers for the inaugural show over the weekend, and while those numbers remain broadly impressive, they still represent a significant drop from last year’s 8.6 million.\nWhile insiders remain positive over a rise when live shows return, prior to the launch airing fans insisted they were less than impressed with the line-up and Covid claims surrounding the show, while sources said the good weather was to blame.\nOther users grumbled over the absence of Janette Manrara and insisted the show peaked with last year’s winner Bill Bailey. The Twitter users in question penned: ‘Why is janette not dancing this year? I love watching her. It’s not the same on ITT… I’m not even watching it this year, Bill was peak Strictly for me, cannot be beaten’.\nAnother claim was that the weather was a key factor in explaining the figures.\nThe TV source told the Sunday Mirror newspaper: ‘Lots of people had been out and about enjoying the early autumn sunshine and will probably watch on catch-up today.’\nOther concerns surround the news of a ‘no jab, no jive’ row, over the refusal of two of its dancers to be vaccinated.\nOf course, while the real reason is mentioned, it is not mentioned in the context of being responsible for the near-textbook ratings loss, which I would anticipate will end up being around the usual 20 percent first-year convergence-related decline described in\nCorporate Cancer\n.\nCraig Revel Horwood has tipped John Waite and Johannes Radebe to win this year’s ‘Strictly’.\nThe duo have formed the first ever all-male pairing on the show\n, and Craig views them as the frontrunners in this year’s competition.\nYeah, it’s probably the weather. Right. The reality is that the better the offensive all-male pairing does on the show, the more the ratings will decline. It doesn’t matter whether the subject is sports, video games, or female-focused television, convergence always kills. And those pushing and/or defending the convergence never, ever learn from all of the previously documented examples of the phenomenon.\nDISCUSS ON SG",
  "tags": [
    "corpocracy",
    "SJW"
  ],
  "categories": [],
  "sitemap_lastmod": "2021-09-20T12:57:53+00:00"
}