{
  "url": "https://voxday.net/2021/09/29/kneecapping-the-tech-giants/",
  "scraped_at": "2026-01-08T12:53:44.797740",
  "title": "Kneecapping the Tech Giants",
  "date_display": "September 29, 2021",
  "date_iso": "2021-09-29T22:30:21+00:00",
  "date_from_url": "2021-09-29",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>The Prometheans are furious with Xi and the CCP for <a href=\"https://www.barrons.com/articles/xi-jinping-grasps-for-power-even-if-it-means-hurting-business-51632772200?siteid=yhoof2\" rel=\"noreferrer noopener\" target=\"_blank\">refusing to permit the financialization</a> of the Chinese economy. Because, um, they’re afraid of losing power to Alibaba, Huawei, and TenCent or something:</p><blockquote class=\"wp-block-quote is-layout-flow wp-block-quote-is-layout-flow\"><p>Xi Jinping, general secretary of the Communist Party of China, is currently kneecapping his country’s most successful private companies.</p><p>Until very recently, the CPC permitted the growth of domestic tech giants, including Alibaba , a Chinese analog of Amazon ; Tencent , a massive tech conglomerate; Xiaomi, an artificial intelligence company tied to the military but better known for its smartphones; Huawei, a controversial global leader in 5G networks; and Baidu, one of the world’s largest AI companies. Leaders watched these firms create massive numbers of jobs and improve consumers’ lives, and challenge their American and European competitors.</p><p>But now, the CPC fears them. In late 2020, Beijing’s regulators abruptly scuttled the initial public offering of Ant, an internet payments company that spun out of Alibaba. The stock offering was poised to be the largest IPO in history, giving China the sort of bragging rights you would have expected party bosses to relish.</p><p>This wasn’t a one-off. In spring 2021, Chinese regulators issued a $2.8 billion antitrust fine to Alibaba. And regulators have cracked down on the ability of Chinese firms to list their shares in the United States—once a rite of passage for Chinese companies that signaled international legitimacy.</p><p>That very legitimacy has become a problem for the CPC, which is cracking down on China’s Big Tech precisely because they present an alternative governance structure in Chinese society—one that knows the people of China better than the CCP itself. The Communist Party of China has always insisted on a paramount rule—the party’s own absolute hegemony—and these Big Tech companies threaten that.</p><p>For years, China-watchers in the West clung to the conviction that the CPC needed strong economic growth from the private sector to survive in power. Growth meant increasing prosperity, and prosperity bought domestic peace: It implied proof that the Party provided for the people. Now, the Party fears that that legitimacy will rest with its true source—the technology companies that have become billboards for Chinese pride and the governance structures that made them so.</p></blockquote><p>This is a bizarre and self-serving interpretation of why the CCP is preventing China’s biggest companies from growing in paper terms rather than industrial terms. It’s not the tech companies they fear, but rather, the banks behind them. Michael Hudson, one of the few economists in the world who actually understands the significance of debt, <a href=\"https://www.unz.com/mhudson/chinas-fortune-cookie-crumbles/\" rel=\"noreferrer noopener\" target=\"_blank\">explains the real reason</a> China is preventing its business interests from expanding freely in an interview:</p><blockquote class=\"wp-block-quote is-layout-flow wp-block-quote-is-layout-flow\"><p><strong>Michael Hudson</strong>: Well, George Soros’ dream is that China would do what Yeltsin did to Russia – that it would privatise the economy, really carve it up and let US investors buy control of the most profitable heights. In that way, the foreign investors would be able to sort of get the profits of Chinese industry, Chinese labour, and it would become the darling stock market of the world, just like Russia’s stock market was the leading booming stock market of 1994-96. China would be run to benefit US investment bankers. Soros is furious that China is not following the neoliberal policy that the United States is following. It’s following a socialist policy wanting to keep its economic surplus at home to benefit its own citizens, not American financial investors. For Soros, this is a clash of civilisations. His proposed strategy is to stifle the Chinese economy by putting sanctions against it, to stop investing in it so as to force it to do to itself what Yeltsin did to Russia.</p><p><strong>Ross:</strong> Let’s hear it in his words. He says: ‘The BlackRock initiative imperils the national security interests of the US and other democracies because the money invested in China will help prop up President Xi’s regime, which is repressive at home and aggressive abroad. Congress should pass legislation empowering the Securities and Exchange Commission to limit the flow of funds to China. The effort ought to enjoy bipartisan support’. He’s not mincing his words, is he?</p><p><strong>Michael Hudson:</strong> He thinks that China actually needs American dollars to build its factories and invest. He thinks that somehow China’s balance of payments is going to fall apart without the US market, without US investors telling President Xi what to do. The Chinese government won’t have a clue as to what to invest in and how to let the ‘free market’, meaning George Soros and BlackRock and other companies, operate. So he’s living in a dream world where other people need us. It’s like a guy who doesn’t realise his girlfriend doesn’t need him anymore….</p><p>The United States is driving Europe, Asia and now Africa as well, into a unified, consolidated unit outside of itself. It’s very self-destructive. It thinks like George Soros, that if we stop investing in Asia and other countries, that will force them to knuckle under to the US. But what it’s doing is it’s driving them altogether into the Belt and Road Initiative.</p><p>What China’s doing is creating a precondition for a profitable industrial economy over a large area to benefit from. It’s participants are going to need transportation. You’re going to need ports. You’re going to need roads. You’re going to need pipelines and is focusing on the interconnections, on the infrastructure.</p><p>America doesn’t build infrastructure these days unless it’s monopolised. This is the political fight going on in the United States now. President Biden has a infrastructure plan that he’s scaled down from six and a half trillion to three and a half trillion. And essentially the bulk of the Democratic and Republican Party said if we can’t privatise infrastructure and make it a rent-extracting monopoly, we’re not going to do it, and we’re going to block the government from doing it. So in the United States, they’re going to have high priced infrastructure, high-priced health care and high-priced education while China is going to have low-priced transportation, low-cost infrastructure, free education, public health care. And you’re going to have a very high-cost United States unable to compete with the rest of the world. All it can do is make military threats or financial threats. If it tries to impose sanctions as it’s imposed on Russia, China and other countries, these are going to serve as protective tariffs for foreign countries.</p><p>When President Trump put sanctions on agricultural exports to Russia, it was a windfall for Russia. They developed their own agriculture and Russia is now the largest grain exporter in the world. Senator McCain characterised Russia as a gas station of atom bombs, but it’s a gas station with the largest farm sector in the world, and is developing an industrial integration with China and the rest of Asia. It’s a Eurasian world island as Mackinder called it a century ago, and it is becoming the economic focus of the world, leaving the United States as the high cost economy with no visible means of support, because we’re not doing our own industry anymore. We’re not competing with China. We’re letting China do all of the industry, and all of a sudden we’re dependent on it. This does not bode good for prosperity in the United States or Europe and other areas that are satellites of the US economy.</p></blockquote><p>There isn’t any conflict between the USA, Russia, and China. The real conflict, the real war that is probably the true cause of the Covid plandemic and the vaccine regimes, is a global one between the One World Prometheans and the nationalists. But whereas the nationalists were successfully suppressed in North America and Europe by 70 years of relentless propaganda and immigration, they have the upper hand in China and Russia. And they have learned from what was done to the American people. Taking economic advice from globalists is about as good an idea as taking candy from a creepy middle-aged man driving a van with no windows in the back.</p><p><em><a href=\"https://social.infogalactic.com/micropost/96ce3a2d-52e6-43dc-9081-0a324e32dbaf\" rel=\"noreferrer noopener\" target=\"_blank\">DISCUSS ON SG</a></em></p></div>",
  "content_text": "The Prometheans are furious with Xi and the CCP for\nrefusing to permit the financialization\nof the Chinese economy. Because, um, they’re afraid of losing power to Alibaba, Huawei, and TenCent or something:\nXi Jinping, general secretary of the Communist Party of China, is currently kneecapping his country’s most successful private companies.\nUntil very recently, the CPC permitted the growth of domestic tech giants, including Alibaba , a Chinese analog of Amazon ; Tencent , a massive tech conglomerate; Xiaomi, an artificial intelligence company tied to the military but better known for its smartphones; Huawei, a controversial global leader in 5G networks; and Baidu, one of the world’s largest AI companies. Leaders watched these firms create massive numbers of jobs and improve consumers’ lives, and challenge their American and European competitors.\nBut now, the CPC fears them. In late 2020, Beijing’s regulators abruptly scuttled the initial public offering of Ant, an internet payments company that spun out of Alibaba. The stock offering was poised to be the largest IPO in history, giving China the sort of bragging rights you would have expected party bosses to relish.\nThis wasn’t a one-off. In spring 2021, Chinese regulators issued a $2.8 billion antitrust fine to Alibaba. And regulators have cracked down on the ability of Chinese firms to list their shares in the United States—once a rite of passage for Chinese companies that signaled international legitimacy.\nThat very legitimacy has become a problem for the CPC, which is cracking down on China’s Big Tech precisely because they present an alternative governance structure in Chinese society—one that knows the people of China better than the CCP itself. The Communist Party of China has always insisted on a paramount rule—the party’s own absolute hegemony—and these Big Tech companies threaten that.\nFor years, China-watchers in the West clung to the conviction that the CPC needed strong economic growth from the private sector to survive in power. Growth meant increasing prosperity, and prosperity bought domestic peace: It implied proof that the Party provided for the people. Now, the Party fears that that legitimacy will rest with its true source—the technology companies that have become billboards for Chinese pride and the governance structures that made them so.\nThis is a bizarre and self-serving interpretation of why the CCP is preventing China’s biggest companies from growing in paper terms rather than industrial terms. It’s not the tech companies they fear, but rather, the banks behind them. Michael Hudson, one of the few economists in the world who actually understands the significance of debt,\nexplains the real reason\nChina is preventing its business interests from expanding freely in an interview:\nMichael Hudson\n: Well, George Soros’ dream is that China would do what Yeltsin did to Russia – that it would privatise the economy, really carve it up and let US investors buy control of the most profitable heights. In that way, the foreign investors would be able to sort of get the profits of Chinese industry, Chinese labour, and it would become the darling stock market of the world, just like Russia’s stock market was the leading booming stock market of 1994-96. China would be run to benefit US investment bankers. Soros is furious that China is not following the neoliberal policy that the United States is following. It’s following a socialist policy wanting to keep its economic surplus at home to benefit its own citizens, not American financial investors. For Soros, this is a clash of civilisations. His proposed strategy is to stifle the Chinese economy by putting sanctions against it, to stop investing in it so as to force it to do to itself what Yeltsin did to Russia.\nRoss:\nLet’s hear it in his words. He says: ‘The BlackRock initiative imperils the national security interests of the US and other democracies because the money invested in China will help prop up President Xi’s regime, which is repressive at home and aggressive abroad. Congress should pass legislation empowering the Securities and Exchange Commission to limit the flow of funds to China. The effort ought to enjoy bipartisan support’. He’s not mincing his words, is he?\nMichael Hudson:\nHe thinks that China actually needs American dollars to build its factories and invest. He thinks that somehow China’s balance of payments is going to fall apart without the US market, without US investors telling President Xi what to do. The Chinese government won’t have a clue as to what to invest in and how to let the ‘free market’, meaning George Soros and BlackRock and other companies, operate. So he’s living in a dream world where other people need us. It’s like a guy who doesn’t realise his girlfriend doesn’t need him anymore….\nThe United States is driving Europe, Asia and now Africa as well, into a unified, consolidated unit outside of itself. It’s very self-destructive. It thinks like George Soros, that if we stop investing in Asia and other countries, that will force them to knuckle under to the US. But what it’s doing is it’s driving them altogether into the Belt and Road Initiative.\nWhat China’s doing is creating a precondition for a profitable industrial economy over a large area to benefit from. It’s participants are going to need transportation. You’re going to need ports. You’re going to need roads. You’re going to need pipelines and is focusing on the interconnections, on the infrastructure.\nAmerica doesn’t build infrastructure these days unless it’s monopolised. This is the political fight going on in the United States now. President Biden has a infrastructure plan that he’s scaled down from six and a half trillion to three and a half trillion. And essentially the bulk of the Democratic and Republican Party said if we can’t privatise infrastructure and make it a rent-extracting monopoly, we’re not going to do it, and we’re going to block the government from doing it. So in the United States, they’re going to have high priced infrastructure, high-priced health care and high-priced education while China is going to have low-priced transportation, low-cost infrastructure, free education, public health care. And you’re going to have a very high-cost United States unable to compete with the rest of the world. All it can do is make military threats or financial threats. If it tries to impose sanctions as it’s imposed on Russia, China and other countries, these are going to serve as protective tariffs for foreign countries.\nWhen President Trump put sanctions on agricultural exports to Russia, it was a windfall for Russia. They developed their own agriculture and Russia is now the largest grain exporter in the world. Senator McCain characterised Russia as a gas station of atom bombs, but it’s a gas station with the largest farm sector in the world, and is developing an industrial integration with China and the rest of Asia. It’s a Eurasian world island as Mackinder called it a century ago, and it is becoming the economic focus of the world, leaving the United States as the high cost economy with no visible means of support, because we’re not doing our own industry anymore. We’re not competing with China. We’re letting China do all of the industry, and all of a sudden we’re dependent on it. This does not bode good for prosperity in the United States or Europe and other areas that are satellites of the US economy.\nThere isn’t any conflict between the USA, Russia, and China. The real conflict, the real war that is probably the true cause of the Covid plandemic and the vaccine regimes, is a global one between the One World Prometheans and the nationalists. But whereas the nationalists were successfully suppressed in North America and Europe by 70 years of relentless propaganda and immigration, they have the upper hand in China and Russia. And they have learned from what was done to the American people. Taking economic advice from globalists is about as good an idea as taking candy from a creepy middle-aged man driving a van with no windows in the back.\nDISCUSS ON SG",
  "tags": [
    "China",
    "economics",
    "globalism"
  ],
  "categories": [],
  "sitemap_lastmod": "2021-09-29T22:31:21+00:00"
}