{
  "url": "https://voxday.net/2021/09/24/suvorov-was-right/",
  "scraped_at": "2026-01-08T12:53:05.346423",
  "title": "Suvorov Was Right",
  "date_display": "September 24, 2021",
  "date_iso": "2021-09-24T05:59:39+00:00",
  "date_from_url": "2021-09-24",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>It really isn’t possible to question any more <a href=\"http://www.wearswar.com/2018/03/03/soviet-tanks-were-to-be-the-spearhead-in-stalins-plan-to-attack-conquer-europe-he-built-mass-produced-the-best-tanks-in-the-world/\" rel=\"noreferrer noopener\" target=\"_blank\">that Stalin was going to invade</a> Western Europe in 1941, which is why Hitler struck first in June:</p><blockquote class=\"wp-block-quote is-layout-flow wp-block-quote-is-layout-flow\"><p>The Soviet Union also built an entire family of BT tanks—the BT-2, BT-5, BT-7, BT-7A, and BT-7M. BT stands for <em>bystrokhodnyi </em>(high-speed) tank. At the beginning of World War II, the Red Army had 6,456 BT tanks, as many as all other operational tanks in the rest of the world. The BT tanks were well designed, heavily armed for their times, had standard bullet-proof armor, and used a diesel engine which made the tanks far less vulnerable to fires. The first BTs had a speed of 69 mph; today most tanks would still be envious of such high speeds. Nevertheless, Soviet historians categorized these tanks among the obsolete models, so obsolete that until 1991 they were not even included in statistics.</p><p>The disadvantage of BT tanks is that they could only be used in aggressive warfare on good roads such as the autobahn in Germany. The BT tank’s most important characteristic–its speed–was achieved through the use of its wheels. The wheels of the BT tank made it impossible to use the BT tank successfully off the roads, or on the bad roads of the Soviet Union. In the battles fought on Soviet territory, thousands of BT tanks were abandoned. Historians say that Stalin’s BT tanks were not ready for war. This statement is not true. The BT tank was ready for an offensive war on German territory, but not in a defensive war fought on its own territory.</p><p>The Soviet Union also built an outstanding family of amphibious tanks: the T-37A, T-38, and T-40. By June 22, 1941, the Soviet Union had over 4,000 amphibious tanks in its arsenal. By comparison, to this day Germany has never built any amphibious tanks. Amphibious tanks are useful in offensive operations to cross rivers and seize bridges before the enemy can blow the bridges up when threatened with a takeover. If there are no remaining enemy bridges, amphibious tanks allow an army to cross the river and establish a bridgehead on the other side of the river. Amphibious tanks are useful in offensive operations; they are of little use in a defensive war.</p></blockquote><p>If you simply compare the numbers of offense-only tanks in the Soviet arsenal to the total number of tanks the Germans had on the Eastern Front – 3,350 to be precise – the historical picture is perfectly clear. You simply don’t open a second front with massively inferior numbers unless you are desperate and seeking to avoid the inevitable. By launching an unexpected invasion first, the Germans improved their odds from zero to low.</p><p>The fact that the “obsolete” T-28 tanks were better than anything the Germans had in their arsenal at the time only underlines the weakness of the conventional history.</p></div>",
  "content_text": "It really isn’t possible to question any more\nthat Stalin was going to invade\nWestern Europe in 1941, which is why Hitler struck first in June:\nThe Soviet Union also built an entire family of BT tanks—the BT-2, BT-5, BT-7, BT-7A, and BT-7M. BT stands for\nbystrokhodnyi\n(high-speed) tank. At the beginning of World War II, the Red Army had 6,456 BT tanks, as many as all other operational tanks in the rest of the world. The BT tanks were well designed, heavily armed for their times, had standard bullet-proof armor, and used a diesel engine which made the tanks far less vulnerable to fires. The first BTs had a speed of 69 mph; today most tanks would still be envious of such high speeds. Nevertheless, Soviet historians categorized these tanks among the obsolete models, so obsolete that until 1991 they were not even included in statistics.\nThe disadvantage of BT tanks is that they could only be used in aggressive warfare on good roads such as the autobahn in Germany. The BT tank’s most important characteristic–its speed–was achieved through the use of its wheels. The wheels of the BT tank made it impossible to use the BT tank successfully off the roads, or on the bad roads of the Soviet Union. In the battles fought on Soviet territory, thousands of BT tanks were abandoned. Historians say that Stalin’s BT tanks were not ready for war. This statement is not true. The BT tank was ready for an offensive war on German territory, but not in a defensive war fought on its own territory.\nThe Soviet Union also built an outstanding family of amphibious tanks: the T-37A, T-38, and T-40. By June 22, 1941, the Soviet Union had over 4,000 amphibious tanks in its arsenal. By comparison, to this day Germany has never built any amphibious tanks. Amphibious tanks are useful in offensive operations to cross rivers and seize bridges before the enemy can blow the bridges up when threatened with a takeover. If there are no remaining enemy bridges, amphibious tanks allow an army to cross the river and establish a bridgehead on the other side of the river. Amphibious tanks are useful in offensive operations; they are of little use in a defensive war.\nIf you simply compare the numbers of offense-only tanks in the Soviet arsenal to the total number of tanks the Germans had on the Eastern Front – 3,350 to be precise – the historical picture is perfectly clear. You simply don’t open a second front with massively inferior numbers unless you are desperate and seeking to avoid the inevitable. By launching an unexpected invasion first, the Germans improved their odds from zero to low.\nThe fact that the “obsolete” T-28 tanks were better than anything the Germans had in their arsenal at the time only underlines the weakness of the conventional history.",
  "tags": [
    "history",
    "war"
  ],
  "categories": [],
  "sitemap_lastmod": "2021-09-24T05:59:41+00:00"
}