{
  "url": "https://voxday.net/2021/09/14/the-russian-military-intelligence-perspective/",
  "scraped_at": "2026-01-08T12:51:59.630708",
  "title": "The Russian Military Intelligence Perspective",
  "date_display": "September 14, 2021",
  "date_iso": "2021-09-14T12:05:56+00:00",
  "date_from_url": "2021-09-14",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p><em>This is a translated transcript of a 2020 interview with a Russian military strategist with combat experience dating back to Afghanistan about his interpretation of the coronavirus phenomenon. He was also directly involved in Vladimir Putin’s campaign to free Russia from post-Soviet financial oligarch rule. Needless to say, this interview is considerably more informative, and provides a better predictive model going forward, than anything you’ve see on the subject in the mainstream media for the last 18 months.</em></p><p><strong>Today we have Vladimir Kvachkov as our guest, a Colonel of the GRU, a public figure with a PhdD in Military Science. Vladimir Vasilivievich. I know you served, among other things as the leading researcher for the Centre for Defence and Strategic Studies of the General Staff of the Armed Forces. Considering your expertise, what do you make of the Coronavirus phenomenon?</strong></p><p>It’s exactly this perspective that you need to examine it from. Not from the public-health perspective, nor epidemiology etc. The Coronavirus phenomenon, that they falsely deem a pandemic needs to be examined from the perspective of global powers, religious, political, financial, economic and national. The Coronavirus phenomenon, the so-called pandemic, and let me tell you, there’s no pandemic, it’s all a lie, needs to be considered as a global strategic special operation. This is exactly how you need to think of this thing. These are command and staff exercises of the world’s behind-the-scenes powers on controlling humanity. This is what the goal of this Coronavirus is.</p><p>I’ll repeat it once again, we have little faith in God and even less so in the existence of Satan, the enemy of the human race. So the aim of the behind-the-scenes Zionist and financial powers is reducing the world’s population. It is their <em>idée fixe</em>. They think there are too many of us ordinary people in the world. There should be around 100 million of their own kind and a maximum of 1 billion people on earth to serve them. Because, us the people, the earthlings, there are too many of us for the behind-the-scenes world powers. This is why the Coronavirus and the financial crisis that has emerged almost immediately, they are inextricably tied to one another. The aim is to stop people’s movement around the world, to curtail political freedoms. In political terms, it would be practically impossible to do all that. There are differences in constitutions, whether they’re being implemented or not, that is a different question. However there are some political rights that people are accustomed to and they believe they are theirs to have forever.</p><p>The first attempt to take away those rights from people happened on September 11, 2001. Not many seem to remember that, after the so-called attack on WTC, Pentagon and the White House in the USA the global war on terrorism was declared. Let’s remember, in order to understand what Coronavirus is now, let’s analyse that first attempt, the declaration of war on humanity that was disguised as a war on terrorism. The behind-the-scenes world powers created the events of September 11, 2001. Now they need another excuse for greater control and takeover of humanity. That’s how they came up with the Coronavirus. Basically to put it this way, that’s not a pandemic, not an epidemic. Even now, I literally looked at the data this morning, 300 people in the world die from it daily. You can imagine what kind of scale this is. Of course, I’m sorry about each person who dies, but 300 people across 7,5 billion people, that is basically nothing. These command and staff exercises of the behind-the-scenes world powers have an aim to limit different political rights and make people afraid. The fools are already grabbing food in shops here. Millet, buckwheat, etc.</p><p><strong>Toilet paper!</strong></p><p>Yes.</p><p><strong>Even toilet paper? Good God! Why?</strong></p><p>The goal is to scare people. Once again, these are command and staff exercises of the behind-the-scenes Zionist and financial liberal world powers with the aim of limiting the political rights that people are basically accustomed to having. That is their second goal. The first goal is to reduce the population numbers on Earth. That’s their Satanic goal. The second, political goal of the behind-the-scenes world powers is to seize power, and the third goal is related to finances and power over the economy. Financially we already know, at least those who are interested in this. Now for every product that exists, please, give me your pencil! Okay, let’s say this pencil costs 1 ruble or 1 dollar, let’s say it’s 1 dollar. For this pencil, it was issued 20 times the amount, in money, promissory notes, equities and other financial derivatives. That means if you take the real value of this pencil, 1 dollar, it comes with different papers that carry 20 times the value. Accordingly, all the financial and economic relations have gone from the real economy to this virtual economy. It’s a financial bubble that exists now and which encompasses, I think, 1 quadrillion and 200 trillion dollars. It’s a complete financial bubble, it needs to be deflated.</p><p>The Federal Reserve System, literally some days ago, that was in February I think, they introduced a zero percent interest on deposits. Now in many countries, it’s even a negative interest rate, that is, you deposit 100 dollars and you get 90 or 95 dollars. But at least you’re still going to get it. So, we’re already getting negative rates on deposits. So that wealth has to be deflated. How will it be deflated? Again through this artificial international, we see the economy has crashed, it is clear, accordingly, we can’t meet your domestic demand like we did before, you need to tighten your belts, etc. Now is a very important moment. Note, it allegedly started in China. Even though the Chinese are now adamant and report that the Coronavirus was created artificially. Of course, in every virus, seeing that it’s the simplest kind of microorganism, as far as I remember, mutations can happen, but they are of an accidental nature. And when you take the RNA molecule, not DNA, they have RNA, and there is a part of the genome that is clearly been carved out and another one inserted in its place, and this happens 3 or 4 times, it is perfectly obvious that, the Chinese scientists have figured this out, it was artificially created and purposefully spread, initially in Wuhan. They had two kinds, two viral strains.</p><p>Okay, now. And what about Italy, what happened there? How come a strain that is even more dangerous than the Chinese one suddenly appears in Italy? I think they now have a few thousand infected and around one thousand have already died. But again, a hundred times more people die in Italy from flu, pneumonia, scrofula and hepatitis. But we don’t talk about that.</p><p>Instead, we are being served special political information propaganda, psycho-informativ propaganda. Special psycho-infomative operation of the world globalist mass media that is serving the behind-the-scene Zionist liberal powrs that are creating this terror now. This is why we need to deal with this phenomenon as we would with a special operation that is conducted in the form of command and staff exercises. Now they are looking at who’s obeying and who’s not.<br/>In China, they introduced strict measures. But then Comrade Xi went to Wuhan and put the pro-American party faction who took that road in their place. In China, not everything is smooth there. They have, let’s call them that, a pro-Chinese patriotic faction that’s somewhat close to us, which is associated with Xi Jinping. And there are obviously pro-American ex-Komsomol members that are money-oriented, or simply put, have their focus on the dough.</p><p>And they of course tried to use the Coronavirus in Wuhan to gain certain economic and political benefits. Comrade Xi put them all in their place and, consequently, it was over with the virus in China. And then it started in Europe. Accordingly, we as military intelligence, look at “who?” It is obvious, and “where?” It is also obvious. Europe and China are two geo-economic adversaries of the USA. And this is where they injected the virus. The virus also has a fourth dimension as well, the economic one. The first is the religious one, destruction of the people on Earth, reducing the population numbers. The second one is to establish political control over humanity.</p><p>The third one is the financial deflation of that gigantic financial bubble. And the fourth goal is the elimination of their geo-economic competition. This I’m telling you from the perspective of an officer from the Centre for Defence and Strategic Studies of the General Staff of the Armed Forces. This is my current assessment of the current epidemic.</p><p><strong>Can you give us any predictions for the nearest future?</strong></p><p>In connection to the Coronavirus?</p><p><strong>Yes.</strong></p><p>What do you think, which countries could expect pressure next? Russia of course! It’s going to be Russia surely. Because for America, Russia isn’t an economic competitor. Now the main efforts of the behind-the-scenes world powers are focused on causing disruption in China and Western Europe. And Russia is their target on two accounts: they want to reduce our population numbers and to “cleanse” the territory. That is still to come.</p><p><strong>Of course, we would like to hear your opinion regarding a practical plan of action, how to act, how to protect oneself, some recommendations. Maybe it’s not your field of expertise but maybe you could tell us something.</strong></p><p>I’m of course, no epidemiologist. Although you could say I’m a parasitologist, because you have to be one in order to understand the power structures in Russia. So speaking as a military doctor, epidemiologist and parasitologist, until we’re able to get rid of our internal parasites who rule over us, we won’t be able to tackle other parasites.</p><p><em><a href=\"https://social.infogalactic.com/micropost/4b1eb367-eba3-4838-b1df-268ea967cbe6\" rel=\"noreferrer noopener\" target=\"_blank\">DISCUSS ON SG</a></em></p></div>",
  "content_text": "This is a translated transcript of a 2020 interview with a Russian military strategist with combat experience dating back to Afghanistan about his interpretation of the coronavirus phenomenon. He was also directly involved in Vladimir Putin’s campaign to free Russia from post-Soviet financial oligarch rule. Needless to say, this interview is considerably more informative, and provides a better predictive model going forward, than anything you’ve see on the subject in the mainstream media for the last 18 months.\nToday we have Vladimir Kvachkov as our guest, a Colonel of the GRU, a public figure with a PhdD in Military Science. Vladimir Vasilivievich. I know you served, among other things as the leading researcher for the Centre for Defence and Strategic Studies of the General Staff of the Armed Forces. Considering your expertise, what do you make of the Coronavirus phenomenon?\nIt’s exactly this perspective that you need to examine it from. Not from the public-health perspective, nor epidemiology etc. The Coronavirus phenomenon, that they falsely deem a pandemic needs to be examined from the perspective of global powers, religious, political, financial, economic and national. The Coronavirus phenomenon, the so-called pandemic, and let me tell you, there’s no pandemic, it’s all a lie, needs to be considered as a global strategic special operation. This is exactly how you need to think of this thing. These are command and staff exercises of the world’s behind-the-scenes powers on controlling humanity. This is what the goal of this Coronavirus is.\nI’ll repeat it once again, we have little faith in God and even less so in the existence of Satan, the enemy of the human race. So the aim of the behind-the-scenes Zionist and financial powers is reducing the world’s population. It is their\nidée fixe\n. They think there are too many of us ordinary people in the world. There should be around 100 million of their own kind and a maximum of 1 billion people on earth to serve them. Because, us the people, the earthlings, there are too many of us for the behind-the-scenes world powers. This is why the Coronavirus and the financial crisis that has emerged almost immediately, they are inextricably tied to one another. The aim is to stop people’s movement around the world, to curtail political freedoms. In political terms, it would be practically impossible to do all that. There are differences in constitutions, whether they’re being implemented or not, that is a different question. However there are some political rights that people are accustomed to and they believe they are theirs to have forever.\nThe first attempt to take away those rights from people happened on September 11, 2001. Not many seem to remember that, after the so-called attack on WTC, Pentagon and the White House in the USA the global war on terrorism was declared. Let’s remember, in order to understand what Coronavirus is now, let’s analyse that first attempt, the declaration of war on humanity that was disguised as a war on terrorism. The behind-the-scenes world powers created the events of September 11, 2001. Now they need another excuse for greater control and takeover of humanity. That’s how they came up with the Coronavirus. Basically to put it this way, that’s not a pandemic, not an epidemic. Even now, I literally looked at the data this morning, 300 people in the world die from it daily. You can imagine what kind of scale this is. Of course, I’m sorry about each person who dies, but 300 people across 7,5 billion people, that is basically nothing. These command and staff exercises of the behind-the-scenes world powers have an aim to limit different political rights and make people afraid. The fools are already grabbing food in shops here. Millet, buckwheat, etc.\nToilet paper!\nYes.\nEven toilet paper? Good God! Why?\nThe goal is to scare people. Once again, these are command and staff exercises of the behind-the-scenes Zionist and financial liberal world powers with the aim of limiting the political rights that people are basically accustomed to having. That is their second goal. The first goal is to reduce the population numbers on Earth. That’s their Satanic goal. The second, political goal of the behind-the-scenes world powers is to seize power, and the third goal is related to finances and power over the economy. Financially we already know, at least those who are interested in this. Now for every product that exists, please, give me your pencil! Okay, let’s say this pencil costs 1 ruble or 1 dollar, let’s say it’s 1 dollar. For this pencil, it was issued 20 times the amount, in money, promissory notes, equities and other financial derivatives. That means if you take the real value of this pencil, 1 dollar, it comes with different papers that carry 20 times the value. Accordingly, all the financial and economic relations have gone from the real economy to this virtual economy. It’s a financial bubble that exists now and which encompasses, I think, 1 quadrillion and 200 trillion dollars. It’s a complete financial bubble, it needs to be deflated.\nThe Federal Reserve System, literally some days ago, that was in February I think, they introduced a zero percent interest on deposits. Now in many countries, it’s even a negative interest rate, that is, you deposit 100 dollars and you get 90 or 95 dollars. But at least you’re still going to get it. So, we’re already getting negative rates on deposits. So that wealth has to be deflated. How will it be deflated? Again through this artificial international, we see the economy has crashed, it is clear, accordingly, we can’t meet your domestic demand like we did before, you need to tighten your belts, etc. Now is a very important moment. Note, it allegedly started in China. Even though the Chinese are now adamant and report that the Coronavirus was created artificially. Of course, in every virus, seeing that it’s the simplest kind of microorganism, as far as I remember, mutations can happen, but they are of an accidental nature. And when you take the RNA molecule, not DNA, they have RNA, and there is a part of the genome that is clearly been carved out and another one inserted in its place, and this happens 3 or 4 times, it is perfectly obvious that, the Chinese scientists have figured this out, it was artificially created and purposefully spread, initially in Wuhan. They had two kinds, two viral strains.\nOkay, now. And what about Italy, what happened there? How come a strain that is even more dangerous than the Chinese one suddenly appears in Italy? I think they now have a few thousand infected and around one thousand have already died. But again, a hundred times more people die in Italy from flu, pneumonia, scrofula and hepatitis. But we don’t talk about that.\nInstead, we are being served special political information propaganda, psycho-informativ propaganda. Special psycho-infomative operation of the world globalist mass media that is serving the behind-the-scene Zionist liberal powrs that are creating this terror now. This is why we need to deal with this phenomenon as we would with a special operation that is conducted in the form of command and staff exercises. Now they are looking at who’s obeying and who’s not.\nIn China, they introduced strict measures. But then Comrade Xi went to Wuhan and put the pro-American party faction who took that road in their place. In China, not everything is smooth there. They have, let’s call them that, a pro-Chinese patriotic faction that’s somewhat close to us, which is associated with Xi Jinping. And there are obviously pro-American ex-Komsomol members that are money-oriented, or simply put, have their focus on the dough.\nAnd they of course tried to use the Coronavirus in Wuhan to gain certain economic and political benefits. Comrade Xi put them all in their place and, consequently, it was over with the virus in China. And then it started in Europe. Accordingly, we as military intelligence, look at “who?” It is obvious, and “where?” It is also obvious. Europe and China are two geo-economic adversaries of the USA. And this is where they injected the virus. The virus also has a fourth dimension as well, the economic one. The first is the religious one, destruction of the people on Earth, reducing the population numbers. The second one is to establish political control over humanity.\nThe third one is the financial deflation of that gigantic financial bubble. And the fourth goal is the elimination of their geo-economic competition. This I’m telling you from the perspective of an officer from the Centre for Defence and Strategic Studies of the General Staff of the Armed Forces. This is my current assessment of the current epidemic.\nCan you give us any predictions for the nearest future?\nIn connection to the Coronavirus?\nYes.\nWhat do you think, which countries could expect pressure next? Russia of course! It’s going to be Russia surely. Because for America, Russia isn’t an economic competitor. Now the main efforts of the behind-the-scenes world powers are focused on causing disruption in China and Western Europe. And Russia is their target on two accounts: they want to reduce our population numbers and to “cleanse” the territory. That is still to come.\nOf course, we would like to hear your opinion regarding a practical plan of action, how to act, how to protect oneself, some recommendations. Maybe it’s not your field of expertise but maybe you could tell us something.\nI’m of course, no epidemiologist. Although you could say I’m a parasitologist, because you have to be one in order to understand the power structures in Russia. So speaking as a military doctor, epidemiologist and parasitologist, until we’re able to get rid of our internal parasites who rule over us, we won’t be able to tackle other parasites.\nDISCUSS ON SG",
  "tags": [
    "Judeochristianity",
    "war"
  ],
  "categories": [],
  "sitemap_lastmod": "2021-09-14T12:06:58+00:00"
}