{
  "url": "https://voxday.net/2021/09/08/the-inherent-evil-of-inclusivity/",
  "scraped_at": "2026-01-08T12:51:16.333120",
  "title": "The Inherent Evil of Inclusivity",
  "date_display": "September 8, 2021",
  "date_iso": "2021-09-08T09:34:35+00:00",
  "date_from_url": "2021-09-08",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>I’ve written previously on the evils of tolerance and equality. <a href=\"https://www.theburningplatform.com/2021/09/06/considerations-on-the-great-reset-and-the-new-world-order/\" rel=\"noreferrer noopener\" target=\"_blank\">In his latest article</a>, Archbishop Vignano explains why inclusivity, as defined by the wicked forces of the neo-liberal world order more accurately described as “globohomo”, is also inherently evil.</p><blockquote class=\"wp-block-quote is-layout-flow wp-block-quote-is-layout-flow\"><p>At this point, it is necessary to clarify what is meant by the “New World Order,” or rather what its creators mean, regardless of what they say publicly.</p><p>Because on the one hand, it is true that there is a project, that certain people conceived it and are charged with carrying it out; but on the other hand it is also true that the inspiring principles of the project are not always disclosed, or at least they cannot be openly admitted to be closely related to what is happening today, since such an admission would arouse opposition even from those who are the most peaceful and moderate.</p><p>It is one thing to impose the “Green Pass” with the excuse of the pandemic; but it is quite another to recognize that the purpose of the passport is to accustom us to being tracked; and still another to say that this total control is the “<em>mark of the Beast</em>” of which the Book of the Apocalypse speaks (Rev 13:16-18).</p><p>The reader will forgive me if, in order to demonstrate my argument, I must resort to using quotations of such gravity and wickedness that they arouse bewilderment and horror — but this is necessary if we are to understand what the real intentions of the architects of this plot really are, and the true nature of the epochal battle they are waging against Christ and His Church.</p><p>In order to understand the esoteric roots of the thought that lies at the foundation of the United Nations, once longed for by [19th-century Italian political activist] Giuseppe Mazzini, we cannot fail to consider characters such as Albert Pike, Eliphas Levi, Helena Blavatsky, Alice Ann Bailey, or other disciples of Luciferian sects.</p><p>Their writings, published since the late nineteenth century, are quite revealing.</p><p>Albert Pike, a friend of Mazzini and a fellow Freemason, gave an address in 1889 in France to the highest levels of Freemasonry, which was then reprinted on 19 January 1935 by the English journal <em>The Freemason</em>. Pike declared:</p><p><em>    That which we must say to the crowd is, we worship a god, but it is the god one adores without superstition</em> […]<em>. The Masonic religion ought to be maintained in the purity of Luciferian doctrine by all of us who are initiates of the highest degrees. If Lucifer were not God, would Adonay </em>[sic] <em>[the God of the Christians] whose deeds prove his cruelty, perfidy and hatred of man, barbarism and repulsion of science, would Adonay and his priest calumniate him?</em></p><p><em>    Yes, Lucifer is God, and unfortunately Adonay is also God. For the eternal law is that there is no light without shade, no beauty without ugliness, no white without black, for the absolute can only exist as two gods: darkness being necessary to light to serve as its foil as the pedestal is necessary to the statue, and the brake to the locomotive… the doctrine of Satanism is a heresy; and the true and pure philosophical religion is the belief in Lucifer, the equal of Adonay; but Lucifer, God of Light and God of Good, is struggling for humanity against Adonay, the God of Darkness and Evil.</em></p><p>This profession of faith in the divinity of Satan is not only an admission of who the real Great Architect that Freemasonry adores is, but also a blasphemous political project that passed through the ecumenism of Vatican II, whose first theorist was Freemasonry:</p><p><em>    The Christian, the Jew, the Moslem, the Buddhist, the follower of Confucius and Zoroaster can unite as brothers and join together in prayer to the only god who is above all the other gods</em> (cf. Albert Pike, <em>Morals and Dogma</em>, ed. Bastogi, Foggia 1984, vol. VI, p. 153).</p><p> And the identity of the “<em>only god who is above all the other gods</em>” has been well explained in the preceding quotation.</p><p>In another letter, Pike wrote to Mazzini:</p><p><em>    We will unleash the nihilists and atheists and provoke a formidable social cataclysm that will clearly demonstrate to the nations, in all its horror, the effect of absolute atheism, the origin of barbarism and bloody subversion. Then citizens everywhere, forced to defend themselves against a world minority of revolutionaries, </em>[…] <em>will receive the true light through the universal manifestation of the pure doctrine of Lucifer, finally revealed to the public’s view; a manifestation that will be followed by the destruction of Christianity and also of atheism, which will be conquered and crushed at the same time! </em>(cf. Letter of 15 August 1871 to Giuseppe Mazzini, Library of the British Museum, London).</p><p>It will not escape notice that the “<em>great heresy of separativeness</em>” sounds curiously in agreement with the ecumenism condemned by Pius XI in his Encyclical <em>Mortalium Animos</em>, an ecumenism that was adopted by the Declaration <em>Dignitatis Humanae </em>and recently merged into the doctrine of “<em>inclusivity</em>” formulated by those who allowed idolatrous worship to the <em>pachamama</em> to be offered in Saint Peter’s Basilica.</p><p>It is clear that the term “<em>separativeness</em>” intends to designate in a negative key the necessary separation of good from evil, of true from false, of the right from wrong that constitutes the criterion of moral judgment of human behavior.</p><p>“<em>Inclusivity</em>” opposes this distinction, allowing oneself to be deliberately contaminated by evil to adulterate the good, equating the true and the false in order to corrupt the former and give legitimacy to the latter.</p><cite>Considerations on the Great Reset and the New World Order, 6 September 2021</cite></blockquote><p>And if you’re still tempted, for some inexplicable reason, by the vaccines, do keep this statement in mind.</p><p><em>No one will be part of the New World Order unless he carries out an act of worship to Lucifer. No one will enter the New Age unless he receives Luciferian initiation.</em><br/>—David Spangler, 1978</p><p>Now, I’m not certain that getting vaccinated is regarded as a Luciferian initiation as far as these wicked people are concerned. But the way they are attempting to push it on everyone, by hook, by crook, or by mandate, in an manner that is more evangelistic than both the Mormons and the Jehovah’s Witnesses combined, suggests that they consider it to be something of the sort.</p><p>Don’t accept their attempts to include you. Insist on separativeness and standing apart. Refuse to submit to their Order and to their orders.</p><p><em><a href=\"https://social.infogalactic.com/micropost/492701bc-5c66-49aa-bdd7-b46d29d725ca\" rel=\"noreferrer noopener\" target=\"_blank\">DISCUSS ON SG</a></em></p></div>",
  "content_text": "I’ve written previously on the evils of tolerance and equality.\nIn his latest article\n, Archbishop Vignano explains why inclusivity, as defined by the wicked forces of the neo-liberal world order more accurately described as “globohomo”, is also inherently evil.\nAt this point, it is necessary to clarify what is meant by the “New World Order,” or rather what its creators mean, regardless of what they say publicly.\nBecause on the one hand, it is true that there is a project, that certain people conceived it and are charged with carrying it out; but on the other hand it is also true that the inspiring principles of the project are not always disclosed, or at least they cannot be openly admitted to be closely related to what is happening today, since such an admission would arouse opposition even from those who are the most peaceful and moderate.\nIt is one thing to impose the “Green Pass” with the excuse of the pandemic; but it is quite another to recognize that the purpose of the passport is to accustom us to being tracked; and still another to say that this total control is the “\nmark of the Beast\n” of which the Book of the Apocalypse speaks (Rev 13:16-18).\nThe reader will forgive me if, in order to demonstrate my argument, I must resort to using quotations of such gravity and wickedness that they arouse bewilderment and horror — but this is necessary if we are to understand what the real intentions of the architects of this plot really are, and the true nature of the epochal battle they are waging against Christ and His Church.\nIn order to understand the esoteric roots of the thought that lies at the foundation of the United Nations, once longed for by [19th-century Italian political activist] Giuseppe Mazzini, we cannot fail to consider characters such as Albert Pike, Eliphas Levi, Helena Blavatsky, Alice Ann Bailey, or other disciples of Luciferian sects.\nTheir writings, published since the late nineteenth century, are quite revealing.\nAlbert Pike, a friend of Mazzini and a fellow Freemason, gave an address in 1889 in France to the highest levels of Freemasonry, which was then reprinted on 19 January 1935 by the English journal\nThe Freemason\n. Pike declared:\nThat which we must say to the crowd is, we worship a god, but it is the god one adores without superstition\n[…]\n. The Masonic religion ought to be maintained in the purity of Luciferian doctrine by all of us who are initiates of the highest degrees. If Lucifer were not God, would Adonay\n[sic]\n[the God of the Christians] whose deeds prove his cruelty, perfidy and hatred of man, barbarism and repulsion of science, would Adonay and his priest calumniate him?\nYes, Lucifer is God, and unfortunately Adonay is also God. For the eternal law is that there is no light without shade, no beauty without ugliness, no white without black, for the absolute can only exist as two gods: darkness being necessary to light to serve as its foil as the pedestal is necessary to the statue, and the brake to the locomotive… the doctrine of Satanism is a heresy; and the true and pure philosophical religion is the belief in Lucifer, the equal of Adonay; but Lucifer, God of Light and God of Good, is struggling for humanity against Adonay, the God of Darkness and Evil.\nThis profession of faith in the divinity of Satan is not only an admission of who the real Great Architect that Freemasonry adores is, but also a blasphemous political project that passed through the ecumenism of Vatican II, whose first theorist was Freemasonry:\nThe Christian, the Jew, the Moslem, the Buddhist, the follower of Confucius and Zoroaster can unite as brothers and join together in prayer to the only god who is above all the other gods\n(cf. Albert Pike,\nMorals and Dogma\n, ed. Bastogi, Foggia 1984, vol. VI, p. 153).\nAnd the identity of the “\nonly god who is above all the other gods\n” has been well explained in the preceding quotation.\nIn another letter, Pike wrote to Mazzini:\nWe will unleash the nihilists and atheists and provoke a formidable social cataclysm that will clearly demonstrate to the nations, in all its horror, the effect of absolute atheism, the origin of barbarism and bloody subversion. Then citizens everywhere, forced to defend themselves against a world minority of revolutionaries,\n[…]\nwill receive the true light through the universal manifestation of the pure doctrine of Lucifer, finally revealed to the public’s view; a manifestation that will be followed by the destruction of Christianity and also of atheism, which will be conquered and crushed at the same time!\n(cf. Letter of 15 August 1871 to Giuseppe Mazzini, Library of the British Museum, London).\nIt will not escape notice that the “\ngreat heresy of separativeness\n” sounds curiously in agreement with the ecumenism condemned by Pius XI in his Encyclical\nMortalium Animos\n, an ecumenism that was adopted by the Declaration\nDignitatis Humanae\nand recently merged into the doctrine of “\ninclusivity\n” formulated by those who allowed idolatrous worship to the\npachamama\nto be offered in Saint Peter’s Basilica.\nIt is clear that the term “\nseparativeness\n” intends to designate in a negative key the necessary separation of good from evil, of true from false, of the right from wrong that constitutes the criterion of moral judgment of human behavior.\n“\nInclusivity\n” opposes this distinction, allowing oneself to be deliberately contaminated by evil to adulterate the good, equating the true and the false in order to corrupt the former and give legitimacy to the latter.\nConsiderations on the Great Reset and the New World Order, 6 September 2021\nAnd if you’re still tempted, for some inexplicable reason, by the vaccines, do keep this statement in mind.\nNo one will be part of the New World Order unless he carries out an act of worship to Lucifer. No one will enter the New Age unless he receives Luciferian initiation.\n—David Spangler, 1978\nNow, I’m not certain that getting vaccinated is regarded as a Luciferian initiation as far as these wicked people are concerned. But the way they are attempting to push it on everyone, by hook, by crook, or by mandate, in an manner that is more evangelistic than both the Mormons and the Jehovah’s Witnesses combined, suggests that they consider it to be something of the sort.\nDon’t accept their attempts to include you. Insist on separativeness and standing apart. Refuse to submit to their Order and to their orders.\nDISCUSS ON SG",
  "tags": [
    "Christianity",
    "globalism",
    "religion"
  ],
  "categories": [],
  "sitemap_lastmod": "2021-09-08T09:35:45+00:00"
}