{
  "url": "https://voxday.net/2021/09/15/the-vaccine-is-the-virus/",
  "scraped_at": "2026-01-08T12:52:05.169688",
  "title": "The Vaccine is the Virus",
  "date_display": "September 15, 2021",
  "date_iso": "2021-09-15T09:37:18+00:00",
  "date_from_url": "2021-09-15",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>An in-depth and informative <a href=\"https://www.ukcolumn.org/video/frances-long-time-vaccine-policy-chief-covid-policy-is-completely-stupid-and-unethical\" rel=\"noreferrer noopener\" target=\"_blank\">interview with two French vaccine experts</a>, one of whom, Dr. Christian Perrone, was the Vice-President of the European Advisory Group to the World Health Organisation and was in charge of France’s vaccine program from 1994 to 2020:</p><blockquote class=\"wp-block-quote is-layout-flow wp-block-quote-is-layout-flow\"><p><strong>Mike Robinson:</strong> Professor Perronne, I’d like to delve into hydroxychloroquine and ivermectin in a little more detail in a minute, but before we get there, you said something in your last comment there that just raises a question. Is there currently a pandemic? What you said suggests there isn’t. Was there ever a pandemic?</p><p>But, as well as that, with respect to the “variants”: the mainstream media and the politicians are pushing—on the normal Sunday morning politics programmes—once again very strongly that the “Delta variant” and the “subsequent variants” which are coming along are going to have an extremely negative impact on anyone who’s unvaccinated at the moment. They’re saying that this coming winter, the “vaccinated” are going to be fine generally, but the unvaccinated are going to have a very hard time.</p><p>So is there a pandemic, was there ever a pandemic, but as well as that, should the unvaccinated be afraid of the current “variants” that are out there, and the coming “variants”?</p><p><strong>Christian Perronne:</strong> Exactly the reverse! Vaccinated people are at risk of the new variants. In transmission, it’s been proven now in several countries that vaccinated people should be put in quarantine and isolated from society. Unvaccinated people are not dangerous; vaccinated people are dangerous to others. That’s been proven in Israel now, where I’m in contact with many physicians. They’re having big problems in Israel now: severe cases in hospitals are among vaccinated people. And in the UK also, you had a larger vaccination programme and there are problems [there] also.</p><p>But also, the “variants” are not very dangerous. All the “variants” since last year are less and less virulent. That’s always the story in infectious diseases. In my hospital, in March-April 2020, the whole building was full of people with Covid-19: fifty patients. And the so-called “second”, “third”, “fourth waves” were just very small waves, because the hospitals are not full any more. But in the media, they said that all the hospitals were full of patients. That’s not true. Of course, the epidemic was going on, but the “variants” were less and less virulent.</p><p>You know, in August 2020, they said, “The ‘Spanish variant’ will kill all of Europe!”—but in the end, there was no real problem.</p><p>After that, they said, “The British variant!”, and after that, “The New Zealand variant!”, and “The American variant!”, and “The South African variant!”, and so on. All that is only media stuff. It’s not scientifically-based. The “Delta variant” is of very low virulence. If you look at the official rates of the disease and of death in Brazil and India, which were the two last countries in the world with an active transmission of the disease, all the curves are going down. And now, the epidemic is quite over in many countries worldwide.</p><p>Yet now, you have governments obliging their citizens to be inoculated with these so-called “vaccines”—and in the countries where they did that, once the epidemic was [already] finished, the epidemic came back, and deaths started again.</p><p>In Vietnam, for example, it was an amazing success, they had only a few dozen deaths over more than a year, [the epidemic] was finished, and then one of the ministers said, “We have to vaccinate the whole population!” It’s now nearly mandatory, and after the start of this vaccination campaign, the epidemic came back and fatal cases occurred again. That’s proof that these inoculations are not a vaccine, but may facilitate the reappearance of the disease and also of deaths.</p></blockquote><p>Read the whole thing. It’s increasingly clear that Russian military intelligence was essentially correct in its analysis of the situation. There was never any pandemic, as the “fear the deadly virus” campaign was a massive psychological operation designed to kill as many as five birds at once, but most importantly, freeze the global economy to prevent the financial crash that was imminent at the time.</p><ul class=\"wp-block-list\"><li>Prevent a financial crash and credit evaporation</li><li>Weaken Xi Xinping and punish China for choosing nationalism over globalism</li><li>Prevent the re-election of Donald Trump</li><li>Produce billions in profit for various corporations in the pharmaceutical and medical industries</li><li>Provide a foundation for the human depopulation agenda</li></ul><p>Meanwhile, the servants of Satan at Pfizer have now announced that they will seek vaccination of children <a href=\"https://www.politico.eu/article/pfizer-us-vaccine-approval-children-6-months-5-years-old/\" rel=\"noreferrer noopener\" target=\"_blank\">as young as six months</a>:</p><blockquote class=\"wp-block-quote is-layout-flow wp-block-quote-is-layout-flow\"><p>Pfizer to seek US vaccine approval for children between 6 months and 5 years in November</p></blockquote><p><em><a href=\"https://social.infogalactic.com/micropost/f38bf0b4-abdb-46cf-b5a5-3f482daeb8e5\" rel=\"noreferrer noopener\" target=\"_blank\">DISCUSS ON SG</a></em></p></div>",
  "content_text": "An in-depth and informative\ninterview with two French vaccine experts\n, one of whom, Dr. Christian Perrone, was the Vice-President of the European Advisory Group to the World Health Organisation and was in charge of France’s vaccine program from 1994 to 2020:\nMike Robinson:\nProfessor Perronne, I’d like to delve into hydroxychloroquine and ivermectin in a little more detail in a minute, but before we get there, you said something in your last comment there that just raises a question. Is there currently a pandemic? What you said suggests there isn’t. Was there ever a pandemic?\nBut, as well as that, with respect to the “variants”: the mainstream media and the politicians are pushing—on the normal Sunday morning politics programmes—once again very strongly that the “Delta variant” and the “subsequent variants” which are coming along are going to have an extremely negative impact on anyone who’s unvaccinated at the moment. They’re saying that this coming winter, the “vaccinated” are going to be fine generally, but the unvaccinated are going to have a very hard time.\nSo is there a pandemic, was there ever a pandemic, but as well as that, should the unvaccinated be afraid of the current “variants” that are out there, and the coming “variants”?\nChristian Perronne:\nExactly the reverse! Vaccinated people are at risk of the new variants. In transmission, it’s been proven now in several countries that vaccinated people should be put in quarantine and isolated from society. Unvaccinated people are not dangerous; vaccinated people are dangerous to others. That’s been proven in Israel now, where I’m in contact with many physicians. They’re having big problems in Israel now: severe cases in hospitals are among vaccinated people. And in the UK also, you had a larger vaccination programme and there are problems [there] also.\nBut also, the “variants” are not very dangerous. All the “variants” since last year are less and less virulent. That’s always the story in infectious diseases. In my hospital, in March-April 2020, the whole building was full of people with Covid-19: fifty patients. And the so-called “second”, “third”, “fourth waves” were just very small waves, because the hospitals are not full any more. But in the media, they said that all the hospitals were full of patients. That’s not true. Of course, the epidemic was going on, but the “variants” were less and less virulent.\nYou know, in August 2020, they said, “The ‘Spanish variant’ will kill all of Europe!”—but in the end, there was no real problem.\nAfter that, they said, “The British variant!”, and after that, “The New Zealand variant!”, and “The American variant!”, and “The South African variant!”, and so on. All that is only media stuff. It’s not scientifically-based. The “Delta variant” is of very low virulence. If you look at the official rates of the disease and of death in Brazil and India, which were the two last countries in the world with an active transmission of the disease, all the curves are going down. And now, the epidemic is quite over in many countries worldwide.\nYet now, you have governments obliging their citizens to be inoculated with these so-called “vaccines”—and in the countries where they did that, once the epidemic was [already] finished, the epidemic came back, and deaths started again.\nIn Vietnam, for example, it was an amazing success, they had only a few dozen deaths over more than a year, [the epidemic] was finished, and then one of the ministers said, “We have to vaccinate the whole population!” It’s now nearly mandatory, and after the start of this vaccination campaign, the epidemic came back and fatal cases occurred again. That’s proof that these inoculations are not a vaccine, but may facilitate the reappearance of the disease and also of deaths.\nRead the whole thing. It’s increasingly clear that Russian military intelligence was essentially correct in its analysis of the situation. There was never any pandemic, as the “fear the deadly virus” campaign was a massive psychological operation designed to kill as many as five birds at once, but most importantly, freeze the global economy to prevent the financial crash that was imminent at the time.\nPrevent a financial crash and credit evaporation\nWeaken Xi Xinping and punish China for choosing nationalism over globalism\nPrevent the re-election of Donald Trump\nProduce billions in profit for various corporations in the pharmaceutical and medical industries\nProvide a foundation for the human depopulation agenda\nMeanwhile, the servants of Satan at Pfizer have now announced that they will seek vaccination of children\nas young as six months\n:\nPfizer to seek US vaccine approval for children between 6 months and 5 years in November\nDISCUSS ON SG",
  "tags": [
    "conspiracy",
    "vaccines"
  ],
  "categories": [],
  "sitemap_lastmod": "2021-09-15T10:34:23+00:00"
}