{
  "url": "https://voxday.net/2021/09/22/the-devils-children-fear-xi/",
  "scraped_at": "2026-01-08T12:52:47.659499",
  "title": "The Devil’s Children Fear Xi",
  "date_display": "September 22, 2021",
  "date_iso": "2021-09-22T10:16:56+00:00",
  "date_from_url": "2021-09-22",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>For the benefit of all the Boomers, retards, and civnats who don’t understand that China is not simply RED CHINER full of damn commies who jes’ wanna invade the USA because they hate us for our freedoms, it might be helpful to observe how the wrath of globohomo and its servitors is particularly reserved for the very powerful Xi Jinping, who unexpectedly succeeded Hu Jintao as China’s leader, after which he proceeded to kick Silicon Valley out of his country while jailing over 100,000 party officials, from the highest level to the lowest, in the largest anti-corruption campaign ever waged in the history of Man.</p><p>That is why the global media has waged an unstinting personal campaign against him that is <a href=\"https://www.rt.com/op-ed/535461-xi-jinping-murdoch-coup-support/\" rel=\"noreferrer noopener\" target=\"_blank\">now growing to a fever pitch</a> courtesy of Rupert Murdoch in the aftermath of the recent submarine deal between the USA and Australia.</p><blockquote class=\"wp-block-quote is-layout-flow wp-block-quote-is-layout-flow\"><p>Under the headline ‘China’s the main game. Removing Xi is how to play it’ commentator Paul Monk, writing in <em>The Australian</em>, speculated that the only way to avoid a devastating conflict with China is to facilitate a coup and suggested it should be on the agenda at the upcoming Quad conference between Australia, the US, India and Japan – described as Asia’s NATO.</p><p><em>“Xi needs to be removed from power and a broad path to democratic reform opened up at long last in China,</em>” says Monk. <em>“The Communist Party must make the shift to democratic rule that Taiwan and South Korea made from the late 1980s. The Quad should openly call for such a transition.”</em></p><p>In support of his suggestion, he cites a recent article from former Aussie PM Kevin Rudd in which he suggested the Quad could “provide a rallying point for all those concerned about Xi’s jingoism and arrogance”.</p><p>Warming to his topic, Monk declares, <em>“Xi must go, and with him the reactionary dictatorship and hubris he espouses. This must be our stance. It must be the stance of the Quad. It must be the mantra of all those seeking a peaceful, prosperous future for Asia and the world.”</em></p></blockquote><p>This is total nonsense. There is no way to avoid conflict with China. China’s entire military strategy has been aimed squarely and specifically at undermining US military hegemony, even at the expense of its ability to wage regional war against its neighbors, since 1991, but China’s leaders have considered the USA’s encouragement of “a shift to democratic rule” to be war even before Deng Xioaping officially declared it to have replaced the Soviet Union as China’s primary threat.</p><p></p><blockquote class=\"wp-block-quote is-layout-flow wp-block-quote-is-layout-flow\"><p>Despite the Bush administration’s efforts, Deng’s comments about the United States changed dramatically beginning in 1989. Throughout most of the 1980s, as a review of his Selected Works makes clear, Deng would occasionally chide the United States for democratic arrogance or for interference in Taiwan, yet he did not refer to the United States as a threat. After 1989, he frequently denounced the United States in ideological terms. For example, in a private talk with several members of the CCP Central Committee just two months after his meeting with Scowcroft, Deng said there was now “no doubt that the imperialists want socialist countries to change their nature. The problem now is not whether the banner of the Soviet Union will fall—there is bound to be unrest there—but whether the banner of China will fall.”</p><p>The sentiment became a common feature of Deng’s remarks, even his public ones. “The West really wants unrest in China,” Deng declared later that same month, “it wants turmoil not only in China but also in the Soviet Union and Eastern Europe. The United States and some other Western countries are trying to bring about a peaceful evolution towards capitalism in socialist countries.”</p><p>In Deng’s mind, this threat to China was a form of warfare. “The United States has coined an expression: waging a world war without gunsmoke,” he argued. “We should be on guard against this. Capitalists want to defeat socialists in the long run. In the past they used weapons, atomic bombs and hydrogen bombs, but they were opposed by the peoples of the world. So now they are trying peaceful evolution.” In a meeting with Richard Nixon after Tiananmen, Deng declared that the “United States was deeply involved” in “the recent disturbances and the counter-revolutionary rebellion” of the students and that “some Westerners” were “trying to overthrow the socialist system in China.</p><p> In a November 1989 address, he warned, “Western countries are staging a third world war without gunsmoke.” Then, in a talk with a visiting Japanese delegation, Deng elaborated on Western responsibility for the Tiananmen incident. “Western countries, particularly the United States,” he argued, “set all their propaganda machines in motion to fan the flames, to encourage and support the so-called democrats or opposition in China, who were in fact the scum of the Chinese nation. That is how the turmoil came about.”</p><p>Not only was the United States responsible, in Deng’s view, but its objectives were hostile: “In inciting unrest in many countries, they are actually playing power politics and seeking hegemony. They are trying to bring into their sphere of influence countries that heretofore they have not been able to control. Once this point is made clear, it will help us understand the nature of the problem.”</p><cite><em>THE LONG GAME: China’s Grand Strategy to Displace American Order</em>, Rush Doshi</cite></blockquote><p>The reason globohomo fears Xi, and the reason a petty third-rate power is talking utter nonsense that provides China with a legitimate cause of war against it, is because Xi is, like Putin, a nationalist whose objectives are completely opposed to the satanic globalists who presently rule the United States, Britain, Australia, and Israel. Unlike Putin, Xi may not yet be viewed as a good guy in conventional Western terms, but he is appears to be the most bitter and formidable enemy of Mankind’s true enemy.</p><p><em><a href=\"https://social.infogalactic.com/micropost/c1f74cfe-2081-4eae-a270-8ba7172a0e0b\" rel=\"noreferrer noopener\" target=\"_blank\">DISCUSS ON SG</a></em></p></div>",
  "content_text": "For the benefit of all the Boomers, retards, and civnats who don’t understand that China is not simply RED CHINER full of damn commies who jes’ wanna invade the USA because they hate us for our freedoms, it might be helpful to observe how the wrath of globohomo and its servitors is particularly reserved for the very powerful Xi Jinping, who unexpectedly succeeded Hu Jintao as China’s leader, after which he proceeded to kick Silicon Valley out of his country while jailing over 100,000 party officials, from the highest level to the lowest, in the largest anti-corruption campaign ever waged in the history of Man.\nThat is why the global media has waged an unstinting personal campaign against him that is\nnow growing to a fever pitch\ncourtesy of Rupert Murdoch in the aftermath of the recent submarine deal between the USA and Australia.\nUnder the headline ‘China’s the main game. Removing Xi is how to play it’ commentator Paul Monk, writing in\nThe Australian\n, speculated that the only way to avoid a devastating conflict with China is to facilitate a coup and suggested it should be on the agenda at the upcoming Quad conference between Australia, the US, India and Japan – described as Asia’s NATO.\n“Xi needs to be removed from power and a broad path to democratic reform opened up at long last in China,\n” says Monk.\n“The Communist Party must make the shift to democratic rule that Taiwan and South Korea made from the late 1980s. The Quad should openly call for such a transition.”\nIn support of his suggestion, he cites a recent article from former Aussie PM Kevin Rudd in which he suggested the Quad could “provide a rallying point for all those concerned about Xi’s jingoism and arrogance”.\nWarming to his topic, Monk declares,\n“Xi must go, and with him the reactionary dictatorship and hubris he espouses. This must be our stance. It must be the stance of the Quad. It must be the mantra of all those seeking a peaceful, prosperous future for Asia and the world.”\nThis is total nonsense. There is no way to avoid conflict with China. China’s entire military strategy has been aimed squarely and specifically at undermining US military hegemony, even at the expense of its ability to wage regional war against its neighbors, since 1991, but China’s leaders have considered the USA’s encouragement of “a shift to democratic rule” to be war even before Deng Xioaping officially declared it to have replaced the Soviet Union as China’s primary threat.\nDespite the Bush administration’s efforts, Deng’s comments about the United States changed dramatically beginning in 1989. Throughout most of the 1980s, as a review of his Selected Works makes clear, Deng would occasionally chide the United States for democratic arrogance or for interference in Taiwan, yet he did not refer to the United States as a threat. After 1989, he frequently denounced the United States in ideological terms. For example, in a private talk with several members of the CCP Central Committee just two months after his meeting with Scowcroft, Deng said there was now “no doubt that the imperialists want socialist countries to change their nature. The problem now is not whether the banner of the Soviet Union will fall—there is bound to be unrest there—but whether the banner of China will fall.”\nThe sentiment became a common feature of Deng’s remarks, even his public ones. “The West really wants unrest in China,” Deng declared later that same month, “it wants turmoil not only in China but also in the Soviet Union and Eastern Europe. The United States and some other Western countries are trying to bring about a peaceful evolution towards capitalism in socialist countries.”\nIn Deng’s mind, this threat to China was a form of warfare. “The United States has coined an expression: waging a world war without gunsmoke,” he argued. “We should be on guard against this. Capitalists want to defeat socialists in the long run. In the past they used weapons, atomic bombs and hydrogen bombs, but they were opposed by the peoples of the world. So now they are trying peaceful evolution.” In a meeting with Richard Nixon after Tiananmen, Deng declared that the “United States was deeply involved” in “the recent disturbances and the counter-revolutionary rebellion” of the students and that “some Westerners” were “trying to overthrow the socialist system in China.\nIn a November 1989 address, he warned, “Western countries are staging a third world war without gunsmoke.” Then, in a talk with a visiting Japanese delegation, Deng elaborated on Western responsibility for the Tiananmen incident. “Western countries, particularly the United States,” he argued, “set all their propaganda machines in motion to fan the flames, to encourage and support the so-called democrats or opposition in China, who were in fact the scum of the Chinese nation. That is how the turmoil came about.”\nNot only was the United States responsible, in Deng’s view, but its objectives were hostile: “In inciting unrest in many countries, they are actually playing power politics and seeking hegemony. They are trying to bring into their sphere of influence countries that heretofore they have not been able to control. Once this point is made clear, it will help us understand the nature of the problem.”\nTHE LONG GAME: China’s Grand Strategy to Displace American Order\n, Rush Doshi\nThe reason globohomo fears Xi, and the reason a petty third-rate power is talking utter nonsense that provides China with a legitimate cause of war against it, is because Xi is, like Putin, a nationalist whose objectives are completely opposed to the satanic globalists who presently rule the United States, Britain, Australia, and Israel. Unlike Putin, Xi may not yet be viewed as a good guy in conventional Western terms, but he is appears to be the most bitter and formidable enemy of Mankind’s true enemy.\nDISCUSS ON SG",
  "tags": [
    "China",
    "globalism",
    "nationalism",
    "war"
  ],
  "categories": [],
  "sitemap_lastmod": "2021-09-22T11:12:19+00:00"
}