{
  "url": "https://voxday.net/2021/09/20/the-devils-shot/",
  "scraped_at": "2026-01-08T12:52:35.210914",
  "title": "The Devil’s Shot",
  "date_display": "September 20, 2021",
  "date_iso": "2021-09-20T10:15:19+00:00",
  "date_from_url": "2021-09-20",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>Now, I don’t spend any time thinking about the spiritual aspects of the fake vaccines, mostly because I consider there to be sufficient – or to be more precise, conclusive and incredibly obvious – material reasons to assiduously avoid submitting to the Covid-19 shots at all costs. But at least some of those Christians who do contemplate these matters have come to believe that <a href=\"https://narrowdesert.blogspot.com/2021/09/greek-orthodox-archimandrite-fr-savvas.html\" rel=\"noreferrer noopener\" target=\"_blank\">there is something seriously dark about them</a>.</p><blockquote class=\"wp-block-quote is-layout-flow wp-block-quote-is-layout-flow\"><p>We must also remember that the devil lies, too. However, there are many times when the devil speaks the truth, especially when forced with the prayers that are read during an exorcism. Likewise, we read in the Gospels of the demons speaking the truth to Jesus: “Thou art the son of God!” The demons confessed that Christ is God.</p><p>Let us take these things into account so that we don’t fall into this trap of Satan, which as you can see, Satan is using much force to direct all of humanity into this trap so he can kill as many as possible. This is the murderer that Satan is.</p><p>This is now all coming to fruition with what is happening globally. The devil wants to take as many souls as possible. This is his final goal. If all these things were good, why would they make them mandatory? Something that is good is not forced.</p></blockquote><p>Some of the testimonies provided sound outlandish and melodramatic. I certainly can’t testify to their legitimacy. And yet, it is quite clear to me that there is something deeply evil about this global campaign to enforce the universal acceptance of an ineffective and dangerous experimental medical technology, a substantive evil that is somehow remniscent of modern transhumanism and the weird techno-esotericism of <em>That Hideous Strength</em>.</p><p><strong>UPDATE:</strong> If you’re still not sure we’re dealing with pure satanic evil here, consider <a href=\"https://www.dailymail.co.uk/news/article-10009087/Pfizer-says-Covid-vaccine-safe-children-age-FIVE-pushes-approval.html\" rel=\"noreferrer noopener\" target=\"_blank\">what Pfizer plans next</a>:</p><blockquote class=\"wp-block-quote is-layout-flow wp-block-quote-is-layout-flow\"><p>Pfizer will push for its Covid vaccine to be approved for children as young as five, the company announced today — as Britain began injecting healthy 12 to 15-year-olds with the jab for the first time. American officials are set to review the data in the coming weeks and decide whether to roll out the vaccine to pre-teens in October, with Pfizer also planning to seek authorisation in Europe and the UK. Pfizer is also trialling its vaccines on babies as young as six months and expects the results of that study to be available by winter, in a move likely to cause international controversy.</p></blockquote><p>There is absolutely zero scientific or medical justification for these injections and every single individual responsible knows it.</p><p><em><a href=\"https://social.infogalactic.com/micropost/47039135-819f-4df5-8b0e-33f5dfc8175c\" rel=\"noreferrer noopener\" target=\"_blank\">DISCUSS ON SG</a></em></p></div>",
  "content_text": "Now, I don’t spend any time thinking about the spiritual aspects of the fake vaccines, mostly because I consider there to be sufficient – or to be more precise, conclusive and incredibly obvious – material reasons to assiduously avoid submitting to the Covid-19 shots at all costs. But at least some of those Christians who do contemplate these matters have come to believe that\nthere is something seriously dark about them\n.\nWe must also remember that the devil lies, too. However, there are many times when the devil speaks the truth, especially when forced with the prayers that are read during an exorcism. Likewise, we read in the Gospels of the demons speaking the truth to Jesus: “Thou art the son of God!” The demons confessed that Christ is God.\nLet us take these things into account so that we don’t fall into this trap of Satan, which as you can see, Satan is using much force to direct all of humanity into this trap so he can kill as many as possible. This is the murderer that Satan is.\nThis is now all coming to fruition with what is happening globally. The devil wants to take as many souls as possible. This is his final goal. If all these things were good, why would they make them mandatory? Something that is good is not forced.\nSome of the testimonies provided sound outlandish and melodramatic. I certainly can’t testify to their legitimacy. And yet, it is quite clear to me that there is something deeply evil about this global campaign to enforce the universal acceptance of an ineffective and dangerous experimental medical technology, a substantive evil that is somehow remniscent of modern transhumanism and the weird techno-esotericism of\nThat Hideous Strength\n.\nUPDATE:\nIf you’re still not sure we’re dealing with pure satanic evil here, consider\nwhat Pfizer plans next\n:\nPfizer will push for its Covid vaccine to be approved for children as young as five, the company announced today — as Britain began injecting healthy 12 to 15-year-olds with the jab for the first time. American officials are set to review the data in the coming weeks and decide whether to roll out the vaccine to pre-teens in October, with Pfizer also planning to seek authorisation in Europe and the UK. Pfizer is also trialling its vaccines on babies as young as six months and expects the results of that study to be available by winter, in a move likely to cause international controversy.\nThere is absolutely zero scientific or medical justification for these injections and every single individual responsible knows it.\nDISCUSS ON SG",
  "tags": [
    "Christianity",
    "vaccines"
  ],
  "categories": [],
  "sitemap_lastmod": "2021-09-20T14:12:14+00:00"
}