{
  "url": "https://voxday.net/2021/09/17/why-the-smart-money-is-on-china/",
  "scraped_at": "2026-01-08T12:52:19.408722",
  "title": "Why the Smart Money is on China",
  "date_display": "September 17, 2021",
  "date_iso": "2021-09-17T16:01:11+00:00",
  "date_from_url": "2021-09-17",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>In England, an Appeals Court ruled that <a href=\"https://www.bbc.com/news/uk-58598186\" rel=\"noreferrer noopener\" target=\"_blank\">parental consent is not required</a> by children under 16 who wish to pretend that they are of the opposite sex and interfere with their physical development. In the USA, the Hellmouth is rabidly gnawing away at the foundations of Western civilization. Meanwhile, in China, the state-run media is hailing the state-run entertainment system that is <a href=\"https://www.globaltimes.cn/page/202109/1234542.shtml\" rel=\"noreferrer noopener\" target=\"_blank\">encouraging families to have more children</a>.</p><blockquote class=\"wp-block-quote is-layout-flow wp-block-quote-is-layout-flow\"><p>Two TV series based on families with several children have been launched recently and both of them have had stunning performance in terms of word of mouth and viewing numbers, and this could help Chinese audiences see the happiness of multiple-kid families and give them courage to have more children.</p><p>The TV dramas, Dear Parents and The Bond, were released online almost at the same time. Both focus on family relations in large-size families with at least five children and they have been viewed more than 2 billion times on Tencent Video in total.</p><p>The 43-episode series Dear Parents follows Liu Biyun and Jiang Tianhuai who became husband and wife in their second marriage. Liu had two children with her ex-husband and Jiang had three children with his ex-wife. The seven-member family lives under the same roof and they finally get closer after dealing with many problems.</p><p>The Bond focuses on a family surnamed Qiao that has five children. The mother of the family died when giving birth to the fifth son and the father, who should be the backbone of the family, reveals his true colors.</p><p>Selfish and unfeeling, the man turns all of his focus inward, leaving his children to fend for themselves. Realizing his father would never be the man he ought to be, the eldest son voluntarily steps into the role of caretaker. All Qiao siblings gradually become aware of the fact that they are on their own with their big brother, but are willing to do whatever is necessary to keep their family together.</p></blockquote><p>I give it 18-24 months before Xi is declared the new Hitler by the media. He’s already advocating the <em>Kinder </em>and <em>Kuche</em>, all that is left is for him to embrace the <em>Kirche</em>.</p></div>",
  "content_text": "In England, an Appeals Court ruled that\nparental consent is not required\nby children under 16 who wish to pretend that they are of the opposite sex and interfere with their physical development. In the USA, the Hellmouth is rabidly gnawing away at the foundations of Western civilization. Meanwhile, in China, the state-run media is hailing the state-run entertainment system that is\nencouraging families to have more children\n.\nTwo TV series based on families with several children have been launched recently and both of them have had stunning performance in terms of word of mouth and viewing numbers, and this could help Chinese audiences see the happiness of multiple-kid families and give them courage to have more children.\nThe TV dramas, Dear Parents and The Bond, were released online almost at the same time. Both focus on family relations in large-size families with at least five children and they have been viewed more than 2 billion times on Tencent Video in total.\nThe 43-episode series Dear Parents follows Liu Biyun and Jiang Tianhuai who became husband and wife in their second marriage. Liu had two children with her ex-husband and Jiang had three children with his ex-wife. The seven-member family lives under the same roof and they finally get closer after dealing with many problems.\nThe Bond focuses on a family surnamed Qiao that has five children. The mother of the family died when giving birth to the fifth son and the father, who should be the backbone of the family, reveals his true colors.\nSelfish and unfeeling, the man turns all of his focus inward, leaving his children to fend for themselves. Realizing his father would never be the man he ought to be, the eldest son voluntarily steps into the role of caretaker. All Qiao siblings gradually become aware of the fact that they are on their own with their big brother, but are willing to do whatever is necessary to keep their family together.\nI give it 18-24 months before Xi is declared the new Hitler by the media. He’s already advocating the\nKinder\nand\nKuche\n, all that is left is for him to embrace the\nKirche\n.",
  "tags": [
    "China",
    "media"
  ],
  "categories": [],
  "sitemap_lastmod": "2021-09-17T16:17:55+00:00"
}