{
  "url": "https://voxday.net/2021/09/19/you-shouldnt-hate-us/",
  "scraped_at": "2026-01-08T12:52:28.225987",
  "title": "You Shouldn’t Hate Us",
  "date_display": "September 19, 2021",
  "date_iso": "2021-09-19T10:24:58+00:00",
  "date_from_url": "2021-09-19",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>Of all the Boomers that ever Boomed, this Boomer has written what appears to be <a href=\"https://nypost.com/2019/11/02/millennials-extreme-hatred-for-baby-boomers-is-totally-unjustified/\" rel=\"noreferrer noopener\" target=\"_blank\">the most Boomeriffic editorial</a> to ever appear in print.</p><blockquote class=\"wp-block-quote is-layout-flow wp-block-quote-is-layout-flow\"><p>Baby boomers who cried “Don’t Trust Anyone Over 30” during the Vietnam War should be scared to death of millennials. Because, at least among the Twitterati, they hate us — they really, really hate us.</p><p>Last week I took a beating from younger readers over an essay I wrote lamenting the decline of the “power lunch.” Although it only partly blamed the phenomenon on millennial habits — e.g., preferring avocado and kale to beef and baked potatoes — hundreds of thousands on Twitter either posted or retweeted such insults as “Old man yells at lunch table” (I’m 69), “What’s it like to be an antique?” and “We’re the ones doing the actual lunches while you’re having three-martini lunches.”</p><p>Millennials (and to some extent their Gen-X and Gen-Z brethren) hate their elders with a ferocity never before seen in our culture. Egged on by the media-savvy likes of 16-year-old Greta Thunberg, they blame prolonged heat waves on boomers who supposedly stood by and cheered as the Earth went up in flames. The phrase “OK BOOMER” has now become young people’s “repeated retort to the problem of older people who just don’t get it,” marking “the end of friendly generational relations,” The New York Times declared last week. According to the article, a teen designer has already sold $10,000 worth of sweatshirts with the “OK BOOMER” slogan repeated many times on the front, ending with the line, “Have a terrible day.”</p><p>Generation gaps will always be with us. Historian Marc Wortman found a generational split over sending young men off to war way back in 1941. But unlike those of us who came of age in the 1960s-early 1970s, who merely disapproved of our elders’ “colonialist” wars and shag rugs, millennials (born between 1980-1994) can’t stand the air we boomers breathe.</p><p>Too many millennials whine that their complacent elders bequeathed them a rotten America and a rotten world — economic malaise that will leave them with lousier lives than their parents and a planet on fire from climate change. But if they spent more time studying actual history, which can’t easily be found on iPhones, they’d know that boomers were, and remain, the most socially and environmentally conscious generation America ever has ever known.</p></blockquote><p>It’s hilarious, and ever-so-typical, that the Boomer STILL doesn’t realize that Generation X hates the Boomers far more than the Millennials ever have or than the Zoomers ever will. This Boomer will literally go to his grave completely bewildered by the fact that literally none of the younger generations think he’s cool, look up to him, respect him, or even like him a tiny little bit. If he thinks the Millennial hatred for Boomers is extreme, well, let’s just say he’s going to need a considerably bigger adjective to reasonably describe Generation X’s opinion of them.</p><p>It’s incredible, and yet ever-so-typical, that he actually thinks it is <em>whining </em>for the younger generations to object in any way to having had both their nation and their world destroyed by a wicked generation that aggressively devalued the very faith, traditions, and morals on which both were resting. He doesn’t realize that Boomers being “the most socially and environmentally conscious generation America ever has ever known” isn’t an excuse or a defense, it’s an unwitting confession of guilt.</p><p>I’d give him six of five pillows for this one, just to be sure.</p><p><em><a href=\"https://social.infogalactic.com/micropost/8ce9b6f1-2f67-415d-8178-63b159b56a92\" rel=\"noreferrer noopener\" target=\"_blank\">DISCUSS ON SG</a></em></p></div>",
  "content_text": "Of all the Boomers that ever Boomed, this Boomer has written what appears to be\nthe most Boomeriffic editorial\nto ever appear in print.\nBaby boomers who cried “Don’t Trust Anyone Over 30” during the Vietnam War should be scared to death of millennials. Because, at least among the Twitterati, they hate us — they really, really hate us.\nLast week I took a beating from younger readers over an essay I wrote lamenting the decline of the “power lunch.” Although it only partly blamed the phenomenon on millennial habits — e.g., preferring avocado and kale to beef and baked potatoes — hundreds of thousands on Twitter either posted or retweeted such insults as “Old man yells at lunch table” (I’m 69), “What’s it like to be an antique?” and “We’re the ones doing the actual lunches while you’re having three-martini lunches.”\nMillennials (and to some extent their Gen-X and Gen-Z brethren) hate their elders with a ferocity never before seen in our culture. Egged on by the media-savvy likes of 16-year-old Greta Thunberg, they blame prolonged heat waves on boomers who supposedly stood by and cheered as the Earth went up in flames. The phrase “OK BOOMER” has now become young people’s “repeated retort to the problem of older people who just don’t get it,” marking “the end of friendly generational relations,” The New York Times declared last week. According to the article, a teen designer has already sold $10,000 worth of sweatshirts with the “OK BOOMER” slogan repeated many times on the front, ending with the line, “Have a terrible day.”\nGeneration gaps will always be with us. Historian Marc Wortman found a generational split over sending young men off to war way back in 1941. But unlike those of us who came of age in the 1960s-early 1970s, who merely disapproved of our elders’ “colonialist” wars and shag rugs, millennials (born between 1980-1994) can’t stand the air we boomers breathe.\nToo many millennials whine that their complacent elders bequeathed them a rotten America and a rotten world — economic malaise that will leave them with lousier lives than their parents and a planet on fire from climate change. But if they spent more time studying actual history, which can’t easily be found on iPhones, they’d know that boomers were, and remain, the most socially and environmentally conscious generation America ever has ever known.\nIt’s hilarious, and ever-so-typical, that the Boomer STILL doesn’t realize that Generation X hates the Boomers far more than the Millennials ever have or than the Zoomers ever will. This Boomer will literally go to his grave completely bewildered by the fact that literally none of the younger generations think he’s cool, look up to him, respect him, or even like him a tiny little bit. If he thinks the Millennial hatred for Boomers is extreme, well, let’s just say he’s going to need a considerably bigger adjective to reasonably describe Generation X’s opinion of them.\nIt’s incredible, and yet ever-so-typical, that he actually thinks it is\nwhining\nfor the younger generations to object in any way to having had both their nation and their world destroyed by a wicked generation that aggressively devalued the very faith, traditions, and morals on which both were resting. He doesn’t realize that Boomers being “the most socially and environmentally conscious generation America ever has ever known” isn’t an excuse or a defense, it’s an unwitting confession of guilt.\nI’d give him six of five pillows for this one, just to be sure.\nDISCUSS ON SG",
  "tags": [
    "Baby Boomers"
  ],
  "categories": [],
  "sitemap_lastmod": "2021-09-19T10:25:59+00:00"
}