{
  "url": "https://voxday.net/2025/03/31/a-working-man-review/",
  "scraped_at": "2026-01-08T20:15:09.423313",
  "title": "A WORKING MAN Review",
  "date_display": "March 31, 2025",
  "date_iso": "2025-03-31T12:08:05+00:00",
  "date_from_url": "2025-03-31",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>Fandom Pulse <a href=\"https://fandompulse.substack.com/p/a-working-man-film-review\">reviews the film</a> based on Chuck Dixon’s first Levon Cade novel.</p><blockquote class=\"wp-block-quote is-layout-flow wp-block-quote-is-layout-flow\"><p><em>A Working Man</em> with Jason Statham is out in theatres this week and is beating <em>Snow White</em> for the top of the box office. The movie is a lot of fun with Jason Statham’s action delivering with a great character in Levon Cade and a cool supporting cast. There are some problems with the film, however, which stem from caricature villains as well as a couple of moments where the kidnapped young girl Jenny Garcia gets a little too “Buffy The Vampire Slayer” as a strong female lead in moments. These elements were not in the book Levon’s Trade, which was a much darker, more serious action thriller, and it’s a shame they didn’t follow the tone of that book more closely.</p></blockquote><p>There are always going to be changes and compromises when translating a story from one medium into another. What works in a novel, or in a comic book, simply doesn’t work on film. And, of course, different media have different tropes and cliches toward which those who are operating in that medium tend to gravitate; given that David Ayers directed both <em>THE BEEKEEPER</em> and <em>A WORKING MAN</em>, the chances that the villains weren’t going to be colorful cartoons was zero.</p><p>However, the rising profile of The Legend suggests the possibility that the next movie in the Levon Cade series will be more true to the books, especially considering that nearly all of the criticism of what has thus far been a very successful film has been focused on various elements that were never in the novel. Chuck was not involved in writing the script, but we can hope that he will be in the next one.</p><p>And there will be no Hollywood influence at all in the films on which we are presently working; I’m very pleased to be able to say that not only has The Legend’s <em>BLACK WARRANT</em> already been optioned by a film production company, but there is a significant level of interest in what we’re tentatively calling the Silververse, a century-long shared Arkhaven comics universe that includes traditional heroes created by The Legend, Razorfist, JDA, and myself.</p><div class=\"wp-block-image\"><figure class=\"aligncenter size-full\"><img alt=\"\" class=\"wp-image-67023\" decoding=\"async\" fetchpriority=\"high\" height=\"512\" sizes=\"(max-width: 512px) 100vw, 512px\" src=\"https://voxday.net/wp-content/uploads/2025/03/image-22.png\" srcset=\"https://voxday.net/wp-content/uploads/2025/03/image-22.png 512w, https://voxday.net/wp-content/uploads/2025/03/image-22-300x300.png 300w, https://voxday.net/wp-content/uploads/2025/03/image-22-150x150.png 150w\" width=\"512\"><figcaption class=\"wp-element-caption\"><em>RED HORNET is a 1980s superhero.</em></figcaption></img></figure></div><p>The Diversity, Inclusivity, and Equality initiatives imposed by Marvel and DC Comics has utterly destroyed traditional superheroes such as The Punisher, Spiderman, Batman, and The Phantom, but when the old heroes fall, new heroes rise.</p><p>On a side note, those who have been around for a long time will recall the eerie coincidence when, two days after I published a short story called THE DEPORTED here on this site, the small Italian town in which it was set was completely destroyed by a landslide and had to be evacuated. So, you can probably imagine the thought that crossed my mind when two days after completing a climactic scene set in an abandoned skyscraper in certain city in Asia, I was greeted with headlines that read “Massive Earthquake in Bangkok; Tower Collapses”.</p><p>Fortunately, it turned out to be a different tower. And honestly, I don’t think I can be held responsible for the fates of all the towers in Bangkok. Although if a natural disaster takes place in Stockholm this week, I will have to give serious consideration to laying down my creative pen.</p><p><em><a href=\"https://socialgalactic.com/micropost/86a1acf5-a7ca-497c-95a6-cb7a90714f12\">DISCUSS ON SG</a></em></p></div>",
  "content_text": "Fandom Pulse\nreviews the film\nbased on Chuck Dixon’s first Levon Cade novel.\nA Working Man\nwith Jason Statham is out in theatres this week and is beating\nSnow White\nfor the top of the box office. The movie is a lot of fun with Jason Statham’s action delivering with a great character in Levon Cade and a cool supporting cast. There are some problems with the film, however, which stem from caricature villains as well as a couple of moments where the kidnapped young girl Jenny Garcia gets a little too “Buffy The Vampire Slayer” as a strong female lead in moments. These elements were not in the book Levon’s Trade, which was a much darker, more serious action thriller, and it’s a shame they didn’t follow the tone of that book more closely.\nThere are always going to be changes and compromises when translating a story from one medium into another. What works in a novel, or in a comic book, simply doesn’t work on film. And, of course, different media have different tropes and cliches toward which those who are operating in that medium tend to gravitate; given that David Ayers directed both\nTHE BEEKEEPER\nand\nA WORKING MAN\n, the chances that the villains weren’t going to be colorful cartoons was zero.\nHowever, the rising profile of The Legend suggests the possibility that the next movie in the Levon Cade series will be more true to the books, especially considering that nearly all of the criticism of what has thus far been a very successful film has been focused on various elements that were never in the novel. Chuck was not involved in writing the script, but we can hope that he will be in the next one.\nAnd there will be no Hollywood influence at all in the films on which we are presently working; I’m very pleased to be able to say that not only has The Legend’s\nBLACK WARRANT\nalready been optioned by a film production company, but there is a significant level of interest in what we’re tentatively calling the Silververse, a century-long shared Arkhaven comics universe that includes traditional heroes created by The Legend, Razorfist, JDA, and myself.\nRED HORNET is a 1980s superhero.\nThe Diversity, Inclusivity, and Equality initiatives imposed by Marvel and DC Comics has utterly destroyed traditional superheroes such as The Punisher, Spiderman, Batman, and The Phantom, but when the old heroes fall, new heroes rise.\nOn a side note, those who have been around for a long time will recall the eerie coincidence when, two days after I published a short story called THE DEPORTED here on this site, the small Italian town in which it was set was completely destroyed by a landslide and had to be evacuated. So, you can probably imagine the thought that crossed my mind when two days after completing a climactic scene set in an abandoned skyscraper in certain city in Asia, I was greeted with headlines that read “Massive Earthquake in Bangkok; Tower Collapses”.\nFortunately, it turned out to be a different tower. And honestly, I don’t think I can be held responsible for the fates of all the towers in Bangkok. Although if a natural disaster takes place in Stockholm this week, I will have to give serious consideration to laying down my creative pen.\nDISCUSS ON SG",
  "tags": [
    "Arkhaven",
    "film",
    "Hellmouth",
    "writing"
  ],
  "categories": [],
  "sitemap_lastmod": "2025-03-31T12:08:10+00:00"
}