{
  "url": "https://voxday.net/2025/03/12/an-interview-with-the-legend/",
  "scraped_at": "2026-01-08T19:42:02.277761",
  "title": "An Interview with The Legend",
  "date_display": "March 12, 2025",
  "date_iso": "2025-03-12T23:12:12+00:00",
  "date_from_url": "2025-03-12",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>Fandom Pulse <a href=\"https://fandompulse.substack.com/p/exclusive-an-interview-with-a-working\">interviewed The Legend Chuck Dixon</a> about his forthcoming film, <em>A Working Man</em>, which launches on March 28th. It’s based on the first book in the Levon Cade series, <em>Levon’s Trade</em>.</p><blockquote class=\"wp-block-quote is-layout-flow wp-block-quote-is-layout-flow\"><p>Chuck Dixon is a prolific comic book creator having created the infamous Batman villain Bane and crafting the popular Knightfall storyline for DC Comics. He’s also had lengthy runs on the Punisher, Robin, Batgirl, and helped create the Birds of Prey. He even did a comic book adaptation of J.R.R. Tolkien’s The Hobbit as well as adaptations of Robert Jordan’s The Wheel of Time. But he’s also done yeoman’s work with novels crafting an entire time-traveling science fiction series in Bad Times as well as his vigilante thriller series Levon Cade, which is being adapted into a film starring Jason Statham and titled A Working Man.</p><p>Dixon spoke with Fandom Pulse about the upcoming film, his relationship with Sylvester Stallone’s Balboa Productions, which is producing A Working Man, and his views on wokeness following the second election of President Donald Trump and how he sees it affecting Hollywood.</p><p><strong>Fandom Pulse (FP): </strong>You published Levon’s Trade over a decade ago, was there any particular reason why Balboa Productions wanted to adapt this first novel of your series?</p><p><strong>Chuck Dixon: </strong>I sent both my Levon Cade books and my Bad Times series to Sly and he liked both and discussed with me plans to make either films or a series of both of them. There was, for a moment, a suggestion from him that I recast Bad Time with the Expendables for a feature film. Time traveling Expendables!</p><p>Anyhow, Sly decided Levon was the way to go as it wouldn’t require a large budget. It’s not hard to see why the books appealed to Sly. Levon’s the kind of hero he’s played so many times and the books are pure action with an emphasis on fast pace and rapid character development.</p><p><strong>FP:</strong> Do you know why they decided to retitle it A Working Man instead of Levon’s Trade?</p><p><strong>Dixon: </strong>No idea. The marketing department tested some titles and this one was chosen from the results, I imagine. A shame since the Levon books have the sequel titles built into them.</p></blockquote><p>As Darkstream viewers know, The Legend and I have been signed to write the script for a supernatural action thriller for an Asian film production company. The script is mostly complete, but rest assured that we’ve made sure to retain the rights to do it as a comic or a novel if the movie doesn’t get made in a reasonable time frame.</p><p><em><a href=\"https://socialgalactic.com/micropost/79327d16-3a5d-424b-a869-1dc0f79c090a\">DISCUSS ON SG</a></em></p></div>",
  "content_text": "Fandom Pulse\ninterviewed The Legend Chuck Dixon\nabout his forthcoming film,\nA Working Man\n, which launches on March 28th. It’s based on the first book in the Levon Cade series,\nLevon’s Trade\n.\nChuck Dixon is a prolific comic book creator having created the infamous Batman villain Bane and crafting the popular Knightfall storyline for DC Comics. He’s also had lengthy runs on the Punisher, Robin, Batgirl, and helped create the Birds of Prey. He even did a comic book adaptation of J.R.R. Tolkien’s The Hobbit as well as adaptations of Robert Jordan’s The Wheel of Time. But he’s also done yeoman’s work with novels crafting an entire time-traveling science fiction series in Bad Times as well as his vigilante thriller series Levon Cade, which is being adapted into a film starring Jason Statham and titled A Working Man.\nDixon spoke with Fandom Pulse about the upcoming film, his relationship with Sylvester Stallone’s Balboa Productions, which is producing A Working Man, and his views on wokeness following the second election of President Donald Trump and how he sees it affecting Hollywood.\nFandom Pulse (FP):\nYou published Levon’s Trade over a decade ago, was there any particular reason why Balboa Productions wanted to adapt this first novel of your series?\nChuck Dixon:\nI sent both my Levon Cade books and my Bad Times series to Sly and he liked both and discussed with me plans to make either films or a series of both of them. There was, for a moment, a suggestion from him that I recast Bad Time with the Expendables for a feature film. Time traveling Expendables!\nAnyhow, Sly decided Levon was the way to go as it wouldn’t require a large budget. It’s not hard to see why the books appealed to Sly. Levon’s the kind of hero he’s played so many times and the books are pure action with an emphasis on fast pace and rapid character development.\nFP:\nDo you know why they decided to retitle it A Working Man instead of Levon’s Trade?\nDixon:\nNo idea. The marketing department tested some titles and this one was chosen from the results, I imagine. A shame since the Levon books have the sequel titles built into them.\nAs Darkstream viewers know, The Legend and I have been signed to write the script for a supernatural action thriller for an Asian film production company. The script is mostly complete, but rest assured that we’ve made sure to retain the rights to do it as a comic or a novel if the movie doesn’t get made in a reasonable time frame.\nDISCUSS ON SG",
  "tags": [
    "Arkhaven",
    "movies"
  ],
  "categories": [],
  "sitemap_lastmod": "2025-03-12T23:12:17+00:00"
}