{
  "url": "https://voxday.net/2025/03/08/bond-jane-bond/",
  "scraped_at": "2026-01-08T19:41:34.714059",
  "title": "Bond. Jane Bond.",
  "date_display": "March 8, 2025",
  "date_iso": "2025-03-08T23:10:09+00:00",
  "date_from_url": "2025-03-08",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>It doesn’t bode well that the Amazon producers’ opinions were so vehemently disregarded by the people who preserved the Bond legacy and maintained it as an engine of profitability. It bodes even less well that instead of taking that into consideration, those opinions <a href=\"https://www.rt.com/pop-culture/613902-bezos-ousts-bond-producers-over-remark/\">were the reason for ejecting them</a> from the franchise.</p><blockquote class=\"wp-block-quote is-layout-flow wp-block-quote-is-layout-flow\"><p>Amazon acquired MGM in 2022, gaining distribution rights to the films, but creative control remained with Eon Productions under Broccoli and Michael G. Wilson. The duo resisted Amazon’s proposed spin-offs, including a Moneypenny series and a female-led 007 project, preferring to maintain James Bond’s traditional narrative.</p><p>Tensions between Broccoli, Wilson, and Amazon executives escalated in late 2024. In December, the Wall Street Journal reported that Broccoli privately told friends she did not trust “algorithm-centric Amazon with a character she helped to mythologize through big-screen storytelling and gut instinct.” She also described the status of the next Bond film as dire, with no script, no story, and no actor chosen for the role. In the same conversation, referring to the company while among executives, she said, “These people are f**king idiots.”</p><p>The comment enraged Bezos, prompting him to take drastic action, the Hollywood Reporter stated. “He read her quote in the Journal and got on the phone and said, ‘I don’t care what it costs, get rid of her,’” an insider told the magazine. Soon afterwards, Amazon struck a deal worth nearly $1 billion to remove Broccoli and Wilson from creative control and bring the franchise under Amazon MGM Studios.</p></blockquote><p>Obviously we don’t know, we can’t know, how this will play out yet. But the most dire sign of all is this: Amazon has not fired every single person who had anything to do with <em>Dem Rangz o’ Power</em>.</p><p><em><a href=\"https://socialgalactic.com/micropost/30d819b0-7904-4d2c-938b-eddae1784432\">DISCUSS ON SG</a></em></p></div>",
  "content_text": "It doesn’t bode well that the Amazon producers’ opinions were so vehemently disregarded by the people who preserved the Bond legacy and maintained it as an engine of profitability. It bodes even less well that instead of taking that into consideration, those opinions\nwere the reason for ejecting them\nfrom the franchise.\nAmazon acquired MGM in 2022, gaining distribution rights to the films, but creative control remained with Eon Productions under Broccoli and Michael G. Wilson. The duo resisted Amazon’s proposed spin-offs, including a Moneypenny series and a female-led 007 project, preferring to maintain James Bond’s traditional narrative.\nTensions between Broccoli, Wilson, and Amazon executives escalated in late 2024. In December, the Wall Street Journal reported that Broccoli privately told friends she did not trust “algorithm-centric Amazon with a character she helped to mythologize through big-screen storytelling and gut instinct.” She also described the status of the next Bond film as dire, with no script, no story, and no actor chosen for the role. In the same conversation, referring to the company while among executives, she said, “These people are f**king idiots.”\nThe comment enraged Bezos, prompting him to take drastic action, the Hollywood Reporter stated. “He read her quote in the Journal and got on the phone and said, ‘I don’t care what it costs, get rid of her,’” an insider told the magazine. Soon afterwards, Amazon struck a deal worth nearly $1 billion to remove Broccoli and Wilson from creative control and bring the franchise under Amazon MGM Studios.\nObviously we don’t know, we can’t know, how this will play out yet. But the most dire sign of all is this: Amazon has not fired every single person who had anything to do with\nDem Rangz o’ Power\n.\nDISCUSS ON SG",
  "tags": [
    "movies",
    "SJW"
  ],
  "categories": [],
  "sitemap_lastmod": "2025-03-08T23:10:12+00:00"
}