{
  "url": "https://voxday.net/2025/03/07/diversity-enhances-the-german-experience/",
  "scraped_at": "2026-01-08T19:41:23.811023",
  "title": "Diversity Enhances the German Experience",
  "date_display": "March 7, 2025",
  "date_iso": "2025-03-07T15:46:35+00:00",
  "date_from_url": "2025-03-07",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p><em>A letter posted by a Czech nurse working in a Munich hospital about the ways in which diversity and immigration <a href=\"https://x.com/ActivePatriotUK/status/1897863493258252634\">are enhancing the German hospital experience</a>.</em></p><p>Yesterday, at the hospital, we had a meeting about how the situation here and the other Munich hospitals are unsustainable. Clinics cannot handle the number of migrant medical emergencies, so they are starting to send everything to the main hospitals. Many Muslims are refusing treatment by female staff, and we women are now refusing to go among those migrants. Relations between the staff and migrants are going from bad to worse. Since last weekend, migrants going to the hospitals must be accompanied by police with K-9 units.</p><p>Many migrants have ADS, syphilis, open TB and many exotic diseases that we in Europe do not know how to treat. If they receive a prescription to the pharmacy; they learn they have to pay cash, this leads to unbelievable outbursts, especially when it is about drugs for the children. They abandon the children to the pharmacy staff with the words: So, cure them yourselves. So the police are not only guarding the clinics and hospitals, but also the large pharmacies.</p><p>We ask openly where are all those who welcomed the migrants in front of TV cameras with signs at train stations ? Yes, for now, the border has been closed, but a million of them are already here and we will definitely not be able to get rid of them. Until now, the number of unemployed in Germany was 2.2 million. Now it will be at least 3.5 million. Most of these people are completely unemployable. Only a minimum of them have any education. What is more, their women usually do not work at all. I estimate that one in ten is pregnant. Hundreds of thousands of them have brought along infants and little kids under six, many emaciated and very needy. If this continues and Germany re-opens its borders, I am going home to the Czech republic. Nobody can keep me here in this situation, not even for double the salary back home. I came to Germany to work, not to Africa or the Middle East!</p><p>Even the professor who heads our department told us how sad it makes him to see, but worth the read…especially the cleaning woman, who has cleaned every day for years for 800 euros and then meets crowds of young men in the hallways who just wait with their hands outstretched, waiting for free, and when they don’t get it, they throw a fit. I really don’t need this, but I am afraid that if I return home, at some point it will be the same in the Czech Republic. If the Germans, with their systems, cannot handle this, then guaranteed, back home will be total chaos…</p><p>You – who have not come in contact with these people have absolutely no idea what kind of badly behaved desperadoes these people are, and how Muslims act superior to our staff, regarding their religious accommodation. For now, the local hospital staff have not come down with the diseases these people brought here, but with so many hundreds of patients every day of this is just a question of time. In a hospital near the Rhine, migrants attacked the staff with knives after they had handed over an 8 month old on the brink of death, who they dragged across half of Europe for three months. The child died two days later, despite having received top care at one of the best pediatric clinics in Germany. The pediatric physician had to undergo surgery and the two nurses are recovering in the ICU. Nobody has been punished. The local press is forbidden to write about it, so we can only inform you through e-mail.</p><p>What would have happened to a German if he had stabbed the doctor and nurses with a knife? Or if he had flung his own syphilis infected urine into a nurses face and so threatened her with infection? At a minimum, he would have gone straight to jail and later to court. With these people so far, nothing has happened.</p><p>And so I ask: Where are all those greeters and receivers from the train stations? Sitting pretty at home, enjoying their uncomplicated, safe lives.</p><p><em>The point of no return would appear to have been passed. Immigration was never truly a question of ideology, but simple quantity. History and logic dictate that either the mass repatriations will begin or both Europe and America will see the sort of semi-official death squads that are used to restore order in India, the Asian countries, and Latin America. And, as I have said for decades, the responsibility for the coming bloodshed will not rest upon the nationalist warriors, but upon the heads of those who encouraged the invasions and welcomed the invaders.</em></p><p><em>The nurse is obviously flat-out wrong about it being impossible to get rid of one million migrants. In less than three years, 8 million people left Ukraine, either by expatriation or death. It is only politically impossible to do so under the present German regime</em>, <em>which is unlikely to survive the coming US-Russian rapprochement.</em></p><p><em><a href=\"https://socialgalactic.com/micropost/f22428d1-e0cb-4173-bc25-ae1c89416bd7\">DISCUSS ON SG</a></em></p></div>",
  "content_text": "A letter posted by a Czech nurse working in a Munich hospital about the ways in which diversity and immigration\nare enhancing the German hospital experience\n.\nYesterday, at the hospital, we had a meeting about how the situation here and the other Munich hospitals are unsustainable. Clinics cannot handle the number of migrant medical emergencies, so they are starting to send everything to the main hospitals. Many Muslims are refusing treatment by female staff, and we women are now refusing to go among those migrants. Relations between the staff and migrants are going from bad to worse. Since last weekend, migrants going to the hospitals must be accompanied by police with K-9 units.\nMany migrants have ADS, syphilis, open TB and many exotic diseases that we in Europe do not know how to treat. If they receive a prescription to the pharmacy; they learn they have to pay cash, this leads to unbelievable outbursts, especially when it is about drugs for the children. They abandon the children to the pharmacy staff with the words: So, cure them yourselves. So the police are not only guarding the clinics and hospitals, but also the large pharmacies.\nWe ask openly where are all those who welcomed the migrants in front of TV cameras with signs at train stations ? Yes, for now, the border has been closed, but a million of them are already here and we will definitely not be able to get rid of them. Until now, the number of unemployed in Germany was 2.2 million. Now it will be at least 3.5 million. Most of these people are completely unemployable. Only a minimum of them have any education. What is more, their women usually do not work at all. I estimate that one in ten is pregnant. Hundreds of thousands of them have brought along infants and little kids under six, many emaciated and very needy. If this continues and Germany re-opens its borders, I am going home to the Czech republic. Nobody can keep me here in this situation, not even for double the salary back home. I came to Germany to work, not to Africa or the Middle East!\nEven the professor who heads our department told us how sad it makes him to see, but worth the read…especially the cleaning woman, who has cleaned every day for years for 800 euros and then meets crowds of young men in the hallways who just wait with their hands outstretched, waiting for free, and when they don’t get it, they throw a fit. I really don’t need this, but I am afraid that if I return home, at some point it will be the same in the Czech Republic. If the Germans, with their systems, cannot handle this, then guaranteed, back home will be total chaos…\nYou – who have not come in contact with these people have absolutely no idea what kind of badly behaved desperadoes these people are, and how Muslims act superior to our staff, regarding their religious accommodation. For now, the local hospital staff have not come down with the diseases these people brought here, but with so many hundreds of patients every day of this is just a question of time. In a hospital near the Rhine, migrants attacked the staff with knives after they had handed over an 8 month old on the brink of death, who they dragged across half of Europe for three months. The child died two days later, despite having received top care at one of the best pediatric clinics in Germany. The pediatric physician had to undergo surgery and the two nurses are recovering in the ICU. Nobody has been punished. The local press is forbidden to write about it, so we can only inform you through e-mail.\nWhat would have happened to a German if he had stabbed the doctor and nurses with a knife? Or if he had flung his own syphilis infected urine into a nurses face and so threatened her with infection? At a minimum, he would have gone straight to jail and later to court. With these people so far, nothing has happened.\nAnd so I ask: Where are all those greeters and receivers from the train stations? Sitting pretty at home, enjoying their uncomplicated, safe lives.\nThe point of no return would appear to have been passed. Immigration was never truly a question of ideology, but simple quantity. History and logic dictate that either the mass repatriations will begin or both Europe and America will see the sort of semi-official death squads that are used to restore order in India, the Asian countries, and Latin America. And, as I have said for decades, the responsibility for the coming bloodshed will not rest upon the nationalist warriors, but upon the heads of those who encouraged the invasions and welcomed the invaders.\nThe nurse is obviously flat-out wrong about it being impossible to get rid of one million migrants. In less than three years, 8 million people left Ukraine, either by expatriation or death. It is only politically impossible to do so under the present German regime\n,\nwhich is unlikely to survive the coming US-Russian rapprochement.\nDISCUSS ON SG",
  "tags": [],
  "categories": [],
  "sitemap_lastmod": "2025-03-07T15:46:38+00:00"
}