{
  "url": "https://voxday.net/2025/03/08/odds-and-false-ends/",
  "scraped_at": "2026-01-08T19:41:32.899450",
  "title": "Odds and False Ends",
  "date_display": "March 8, 2025",
  "date_iso": "2025-03-08T17:25:22+00:00",
  "date_from_url": "2025-03-08",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>A few things. First, I’ve got two related posts up at White Bull that may be of interest to those who are either a) trying to break into a new industry or b) interested in the history of the game industry. I used my own experience of going from a complete outsider to an industry oldtimer as a practical example; <a href=\"https://whitebullbusiness.substack.com/p/invading-an-industry-ii\">the first post is here</a> and contains a link to the second one at the end.</p><p>Second, if you’d like to see what <a href=\"https://sigmagame.substack.com/p/who-was-that\">the very large and very pretty <em>Hypergamouse </em>hardcover</a> looks like, there are some pictures up at Sigma Game. The pictures and a video will go up on Arkhaven later. And speaking of Arkhaven, the Dark Herald has <a href=\"https://arkhaven.substack.com/p/book-discussion-delusions-master\">a detailed discussion of one of my favorite books</a> by Tanith Lee, <em>Delusion’s Master</em>, that is well worth reading by anyone who enjoys the dark side of fantasy.</p><p>Third, we’ve opened up the SOULSIGMA campaign again for the nine backers whose backings didn’t go through due to some vagaries of the way the FMC system interacts with the payment processor; apparently I selected a suboptimal setting when setting it up. So if you’re one of those nine backers, or if you weren’t but you’d like to jump in there ex post facto, <a href=\"https://www.fundmycomic.com/campaign/723/soulsigma-the-only-skull\">you can back the album here</a>.</p><p>And finally, a reader had a question about Umberto Eco’s work and how it relates to conspiracy theory:</p><blockquote class=\"wp-block-quote is-layout-flow wp-block-quote-is-layout-flow\"><p>I have reread <em>Foucault’s Pendulum</em> and I have read<em> The Name of the Rose</em> and<em> The Prague Cemetery</em>. You said in your 2013 top ten list of books that “Perhaps my subscription to the conspiracy theory of history is one reason I rate Foucault’s Pendulum so highly, but I stand firmly by my high regard for Eco.” I have tried to get a more subtle read on Eco’s work rereading “FP” but It seems to me he is very much interested on demystifying these tropes, for example by constructing a plot in which the conspiracionist take the mad theories from three leftist editors very seriously and end up killing the main architect of the madness because the only way to salvage his hurt pride (the novel is very funny in the constant humillition of Belbo, specially the scenes in which Lorenza is involved) is to not reveal the secret: that there is no secret, it is all false.</p><p>In the “PC” something similar happens, where all the conspiracies of the late 19 century are pinned under a despicable guy who has no values but the love of money and will invent anything, including a Jewish conspiracy to take over the world. So Eco gives us a fictional account of the birth of a text, “The protocols of the elders of Sion”, that in the official history is considered to be a libel. Now I am sure these things don’t escape you, because you are much more smarter than me, but I still don’t see how his work vindicates your phrase I quoted. Is it just that you enjoy these themes treated in such a beautiful and sophisticated way, even though the author does not believe in them? Or is it the classic the message trascends the writter, and the story is more true than he seems to believe?</p></blockquote><p>The reader seems to have a fundamental problem understanding the concept of a novel and its relation to the writer. Contra his assumptions, he has no idea what Eco actually thought about any of these things, which would be true of most halfway-decent authors, but is particularly true of an author who just happens to be a world expert on semiotics, signs, and symbols.</p><p>The idea that Eco is demystifying anything is absurd on its face. He loved myths, fables, and conspiracies. To look at his various explanations for them as attempts to reduce them to harmlessness in the service of the mainstream Narrative in which nothing happens for a reason and nobody accomplishes anything is to fundamentally miss the point. Eco was more akin to someone who loves puzzles and enjoys putting them together, which is why anyone else who loves puzzles will enjoy reading his book; moreover, let’s not forget the concept of blown cover as cover.</p><p>Being a world-famous public intellectual, Eco would have known better than anyone that there are secrets that cannot be safely revealed to everyone. Ergo, what better way to reveal them than by doing so in an innocuous manner that purports to make it clear that the secrets, such as they are, don’t even exist, especially given the inarguable evidence that they do, in fact exist. And this is precisely the sort of interpretation that one could not possibly rule out, given Eco’s very puckish sense of humor.</p><p><em><a href=\"https://socialgalactic.com/micropost/283db3e9-6031-4b84-bbdf-d735ebe8d823\">DISCUSS ON SG</a></em></p></div>",
  "content_text": "A few things. First, I’ve got two related posts up at White Bull that may be of interest to those who are either a) trying to break into a new industry or b) interested in the history of the game industry. I used my own experience of going from a complete outsider to an industry oldtimer as a practical example;\nthe first post is here\nand contains a link to the second one at the end.\nSecond, if you’d like to see what\nthe very large and very pretty\nHypergamouse\nhardcover\nlooks like, there are some pictures up at Sigma Game. The pictures and a video will go up on Arkhaven later. And speaking of Arkhaven, the Dark Herald has\na detailed discussion of one of my favorite books\nby Tanith Lee,\nDelusion’s Master\n, that is well worth reading by anyone who enjoys the dark side of fantasy.\nThird, we’ve opened up the SOULSIGMA campaign again for the nine backers whose backings didn’t go through due to some vagaries of the way the FMC system interacts with the payment processor; apparently I selected a suboptimal setting when setting it up. So if you’re one of those nine backers, or if you weren’t but you’d like to jump in there ex post facto,\nyou can back the album here\n.\nAnd finally, a reader had a question about Umberto Eco’s work and how it relates to conspiracy theory:\nI have reread\nFoucault’s Pendulum\nand I have read\nThe Name of the Rose\nand\nThe Prague Cemetery\n. You said in your 2013 top ten list of books that “Perhaps my subscription to the conspiracy theory of history is one reason I rate Foucault’s Pendulum so highly, but I stand firmly by my high regard for Eco.” I have tried to get a more subtle read on Eco’s work rereading “FP” but It seems to me he is very much interested on demystifying these tropes, for example by constructing a plot in which the conspiracionist take the mad theories from three leftist editors very seriously and end up killing the main architect of the madness because the only way to salvage his hurt pride (the novel is very funny in the constant humillition of Belbo, specially the scenes in which Lorenza is involved) is to not reveal the secret: that there is no secret, it is all false.\nIn the “PC” something similar happens, where all the conspiracies of the late 19 century are pinned under a despicable guy who has no values but the love of money and will invent anything, including a Jewish conspiracy to take over the world. So Eco gives us a fictional account of the birth of a text, “The protocols of the elders of Sion”, that in the official history is considered to be a libel. Now I am sure these things don’t escape you, because you are much more smarter than me, but I still don’t see how his work vindicates your phrase I quoted. Is it just that you enjoy these themes treated in such a beautiful and sophisticated way, even though the author does not believe in them? Or is it the classic the message trascends the writter, and the story is more true than he seems to believe?\nThe reader seems to have a fundamental problem understanding the concept of a novel and its relation to the writer. Contra his assumptions, he has no idea what Eco actually thought about any of these things, which would be true of most halfway-decent authors, but is particularly true of an author who just happens to be a world expert on semiotics, signs, and symbols.\nThe idea that Eco is demystifying anything is absurd on its face. He loved myths, fables, and conspiracies. To look at his various explanations for them as attempts to reduce them to harmlessness in the service of the mainstream Narrative in which nothing happens for a reason and nobody accomplishes anything is to fundamentally miss the point. Eco was more akin to someone who loves puzzles and enjoys putting them together, which is why anyone else who loves puzzles will enjoy reading his book; moreover, let’s not forget the concept of blown cover as cover.\nBeing a world-famous public intellectual, Eco would have known better than anyone that there are secrets that cannot be safely revealed to everyone. Ergo, what better way to reveal them than by doing so in an innocuous manner that purports to make it clear that the secrets, such as they are, don’t even exist, especially given the inarguable evidence that they do, in fact exist. And this is precisely the sort of interpretation that one could not possibly rule out, given Eco’s very puckish sense of humor.\nDISCUSS ON SG",
  "tags": [
    "Arkhaven",
    "books",
    "Hypergamouse",
    "White Bull"
  ],
  "categories": [],
  "sitemap_lastmod": "2025-03-08T17:25:25+00:00"
}