{
  "url": "https://voxday.net/2025/03/27/protecting-the-automotive-industry/",
  "scraped_at": "2026-01-08T20:14:33.478257",
  "title": "Protecting the Automotive Industry",
  "date_display": "March 27, 2025",
  "date_iso": "2025-03-27T10:28:34+00:00",
  "date_from_url": "2025-03-27",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>The God-Emperor 2.0 is slapping <a href=\"https://www.dailymail.co.uk/news/article-14542101/Trump-warns-EU-Canada-work-economic-harm-USA-hit-far-LARGER-tariffs-currently-planned-slapping-25-foreign-cars.html\">25 percent tariffs on all foreign cars</a>. It’s about two decades too late for this, as GM already went bankrupt back in 2009, but it might start turning things around for the USA’s beleaguered industrial capabilities. Regardless, it’s time to buy domestic if you need a car; hopefully they’ll start making real cars that run on gas and don’t have all that worse-than-useless computer gadgetry in them.</p><blockquote class=\"wp-block-quote is-layout-flow wp-block-quote-is-layout-flow\"><p>Donald Trump has warned the European Union and Canada they can expect to contend with ‘large scale tariffs’ if they seek to do ‘economic harm to the USA’ in an unsettling post early this morning. The US President plans to impose a 25% tariff on imported cars and light trucks starting on April 3, and earlier this month rolled out an increase in tariffs on all steel and aluminium imports from the European bloc.</p><p>This prompted the EU to retaliate with a series of duties on US industrial and agricultural products from April 1, setting the foundation of what could prove to be a damaging trade war.</p><p>Posting on his Truth Social platform this morning, Trump declared: ‘If the European Union works with Canada in order to do economic harm to the USA, large scale Tariffs, far larger than currently planned, will be placed on them both in order to protect the best friend that each of those two countries has ever had!’</p></blockquote><p>The EU retarderati clearly has absolutely no understanding of its lack of power and influence. The EU can no more win a trade war with the USA than it can win a shooting war with Russia, and here its leadership is blithely proceeding to enter into both. This is, of course, because the EU “leadership” is nothing more than Clown World puppets who know nothing about either military history or economics and will simply repeat whatever rhetoric they are instructed to repeat, as many times as they are told to repeat it, no matter how obviously nonsensical it is.</p><p>Kaja Kallas, the Vice-President of the European Commission, is exemplary of the absolute ineptitude of the current EU puppet-leaders. She combines ignorance with vacuity, a complete lack of experience with accountability, and a pretty woman’s unfamiliarity with being told no. She’s the High Representative of the European Union for Foreign Affairs and Security Policy, which is supposed to be the highest <em>diplomatic </em>position, but she’s been acting as if she’s the prime minister of a belligerent party, which isn’t at all the same thing.</p><p>At this point, I won’t even be surprised if both the USA and Russia break ties with Europe in the coming years, just to give the poor European nations a chance to break free of their satanic would-be masters and their fake, unelected “democracy” and their self-destructive economic and immigration policies.</p><p><em><a href=\"https://socialgalactic.com/micropost/82f2b240-0f3f-4526-bd62-e5f88101b0bc\">DISCUSS ON SG</a></em></p></div>",
  "content_text": "The God-Emperor 2.0 is slapping\n25 percent tariffs on all foreign cars\n. It’s about two decades too late for this, as GM already went bankrupt back in 2009, but it might start turning things around for the USA’s beleaguered industrial capabilities. Regardless, it’s time to buy domestic if you need a car; hopefully they’ll start making real cars that run on gas and don’t have all that worse-than-useless computer gadgetry in them.\nDonald Trump has warned the European Union and Canada they can expect to contend with ‘large scale tariffs’ if they seek to do ‘economic harm to the USA’ in an unsettling post early this morning. The US President plans to impose a 25% tariff on imported cars and light trucks starting on April 3, and earlier this month rolled out an increase in tariffs on all steel and aluminium imports from the European bloc.\nThis prompted the EU to retaliate with a series of duties on US industrial and agricultural products from April 1, setting the foundation of what could prove to be a damaging trade war.\nPosting on his Truth Social platform this morning, Trump declared: ‘If the European Union works with Canada in order to do economic harm to the USA, large scale Tariffs, far larger than currently planned, will be placed on them both in order to protect the best friend that each of those two countries has ever had!’\nThe EU retarderati clearly has absolutely no understanding of its lack of power and influence. The EU can no more win a trade war with the USA than it can win a shooting war with Russia, and here its leadership is blithely proceeding to enter into both. This is, of course, because the EU “leadership” is nothing more than Clown World puppets who know nothing about either military history or economics and will simply repeat whatever rhetoric they are instructed to repeat, as many times as they are told to repeat it, no matter how obviously nonsensical it is.\nKaja Kallas, the Vice-President of the European Commission, is exemplary of the absolute ineptitude of the current EU puppet-leaders. She combines ignorance with vacuity, a complete lack of experience with accountability, and a pretty woman’s unfamiliarity with being told no. She’s the High Representative of the European Union for Foreign Affairs and Security Policy, which is supposed to be the highest\ndiplomatic\nposition, but she’s been acting as if she’s the prime minister of a belligerent party, which isn’t at all the same thing.\nAt this point, I won’t even be surprised if both the USA and Russia break ties with Europe in the coming years, just to give the poor European nations a chance to break free of their satanic would-be masters and their fake, unelected “democracy” and their self-destructive economic and immigration policies.\nDISCUSS ON SG",
  "tags": [
    "economics",
    "EU",
    "free trade",
    "trainwreck"
  ],
  "categories": [],
  "sitemap_lastmod": "2025-03-27T10:28:45+00:00"
}