{
  "url": "https://voxday.net/2025/03/05/recap-not-revolution/",
  "scraped_at": "2026-01-08T19:41:10.717574",
  "title": "Recap, Not Revolution",
  "date_display": "March 5, 2025",
  "date_iso": "2025-03-05T08:45:58+00:00",
  "date_from_url": "2025-03-05",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>Reading the reviews of the God-Emperor 2.0’s speech to Congress proved to be a bit deflating. While it was a good summary of what has been accomplished so far, it didn’t really provide us with any new information. Still no arrests. Still members of NATO. There is still a Department of Education, an Internal Revenue Service, and a Federal Reserve.</p><p>No one cares about a mineral deal with Ukraine. Everyone wants the US military out of Ukraine, out of Europe, and out of Japan.</p><p>There’s nothing wrong with a victories lap. There are certainly more victories to celebrate than anyone was expecting so soon. But everyone was expecting something more, something big, last night. And that speech was nothing big. Frankly, <a href=\"https://www.whitehouse.gov/presidential-actions/\">reading his executive orders</a> is more exciting and encouraging.</p><p>On the subject of the Trump administration, those who are following the politics might find an addition to my SSH analysis of Vice-President Vance to be of interest, as the British media already appears to be <a href=\"https://sigmagame.substack.com/p/deltas-dont-ever-learn\">taking advantage of his apparent vulnerability</a> to attack rhetoric.</p><p><strong>UPDATE: </strong>Apparently it was even more disappointing live, as Hal Turner summarizes it.</p><p><em>I am live broadcasting President Trump’s State of the Union Speech to a Joint Session of Congress and, to me, it is the most disappointing speech I’ve ever heard. Whoever wrote it should never write a speech again. President Trump seems to be re-litigating the election, reiterating the election issues that are already decided. I can’t stand it anymore. I’m not even going to listen anymore. The worst speech in history. Worst delivery ever. An absolute total failure. He’s even mentioning Joe Biden. Biden is GONE for Christ’s sake; leave him BE gone. I don’t know who wrote this, but they have done the President a horrifying disservice.</em></p><p><strong>UPDATE:</strong> The God-Emperor 2.0 obviously knows what he’s doing. We were not the audience. This was about winning over the mainstream, not informing anyone about what is coming next.</p><div class=\"wp-block-image\"><figure class=\"aligncenter size-full\"><img alt=\"\" class=\"wp-image-66694\" decoding=\"async\" fetchpriority=\"high\" height=\"317\" sizes=\"(max-width: 512px) 100vw, 512px\" src=\"https://voxday.net/wp-content/uploads/2025/03/image-7.png\" srcset=\"https://voxday.net/wp-content/uploads/2025/03/image-7.png 512w, https://voxday.net/wp-content/uploads/2025/03/image-7-300x186.png 300w\" width=\"512\"/></figure></div><p><em><a href=\"https://socialgalactic.com/micropost/40c2f1e6-3ba4-44ef-8860-e0af195de40a\">DISCUSS ON SG</a></em></p></div>",
  "content_text": "Reading the reviews of the God-Emperor 2.0’s speech to Congress proved to be a bit deflating. While it was a good summary of what has been accomplished so far, it didn’t really provide us with any new information. Still no arrests. Still members of NATO. There is still a Department of Education, an Internal Revenue Service, and a Federal Reserve.\nNo one cares about a mineral deal with Ukraine. Everyone wants the US military out of Ukraine, out of Europe, and out of Japan.\nThere’s nothing wrong with a victories lap. There are certainly more victories to celebrate than anyone was expecting so soon. But everyone was expecting something more, something big, last night. And that speech was nothing big. Frankly,\nreading his executive orders\nis more exciting and encouraging.\nOn the subject of the Trump administration, those who are following the politics might find an addition to my SSH analysis of Vice-President Vance to be of interest, as the British media already appears to be\ntaking advantage of his apparent vulnerability\nto attack rhetoric.\nUPDATE:\nApparently it was even more disappointing live, as Hal Turner summarizes it.\nI am live broadcasting President Trump’s State of the Union Speech to a Joint Session of Congress and, to me, it is the most disappointing speech I’ve ever heard. Whoever wrote it should never write a speech again. President Trump seems to be re-litigating the election, reiterating the election issues that are already decided. I can’t stand it anymore. I’m not even going to listen anymore. The worst speech in history. Worst delivery ever. An absolute total failure. He’s even mentioning Joe Biden. Biden is GONE for Christ’s sake; leave him BE gone. I don’t know who wrote this, but they have done the President a horrifying disservice.\nUPDATE:\nThe God-Emperor 2.0 obviously knows what he’s doing. We were not the audience. This was about winning over the mainstream, not informing anyone about what is coming next.\nDISCUSS ON SG",
  "tags": [
    "Fake News",
    "politics"
  ],
  "categories": [],
  "sitemap_lastmod": "2025-03-05T15:06:24+00:00"
}