{
  "url": "https://voxday.net/2025/03/08/resurrecting-the-iron-curtain/",
  "scraped_at": "2026-01-08T19:41:31.063661",
  "title": "Resurrecting the Iron Curtain",
  "date_display": "March 8, 2025",
  "date_iso": "2025-03-08T12:23:49+00:00",
  "date_from_url": "2025-03-08",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>I am certain that Vladimir Putin has no designs on Eastern Europe. But that doesn’t mean <a href=\"https://www.rt.com/news/613881-eastern-europe-preemptive-strike-russia/\">the Russians can’t be provoked</a> into invading and occupying Eastern Europe in order to pacify it if the Eastern European retarderati are genuinely stupid enough to attack Russia.</p><blockquote class=\"wp-block-quote is-layout-flow wp-block-quote-is-layout-flow\"><p>Several countries in Eastern Europe are considering a pre-emptive strike against Russia, according to <em>Financial Times</em> columnist Simon Kuper. The reported development comes despite the Ukraine peace negotiations launched by Moscow and Washington.</p><p>According to Kuper, the perceived pivot toward Moscow by US President Donald Trump has brought back the geographical distinctions of the Cold War, namely the idea of “Eastern Europe”, and “Western Europe,” where one sees Russia as an existential threat and the other “isn’t that bothered.”</p><p>“We know. That’s why some of our countries are asking, ‘Why don’t we attack Russia now, instead of sitting waiting for it to attack us?’” an unnamed “prominent Eastern European politician” said, without elaborating.</p></blockquote><p>This is the ultimate in foolish “let’s you and him” fight strategies. And it’s based upon the obviously false assumption that if the Eastern European countries start a war with Russia, the USA will be somehow forced into declaring war on Russia in order to defend them.</p><p>I don’t know how the God-Emperor could make it any more verbally clear to all of the European countries that the US military is not going to defend them under any circumstances, so it’s becoming apparent that he’s going to have to actually withdraw all of the US troops from Europe in order to convince the Europeans that they are genuinely and completely on their own, and that Uncle Sam is not going to rush in to rescue them from defeat and occupation by the Russian military.</p><p><em><a href=\"https://socialgalactic.com/micropost/5ee3b1d6-433e-4c5a-bc14-2c732a69635b\">DISCUSS ON SG</a></em></p><p></p></div>",
  "content_text": "I am certain that Vladimir Putin has no designs on Eastern Europe. But that doesn’t mean\nthe Russians can’t be provoked\ninto invading and occupying Eastern Europe in order to pacify it if the Eastern European retarderati are genuinely stupid enough to attack Russia.\nSeveral countries in Eastern Europe are considering a pre-emptive strike against Russia, according to\nFinancial Times\ncolumnist Simon Kuper. The reported development comes despite the Ukraine peace negotiations launched by Moscow and Washington.\nAccording to Kuper, the perceived pivot toward Moscow by US President Donald Trump has brought back the geographical distinctions of the Cold War, namely the idea of “Eastern Europe”, and “Western Europe,” where one sees Russia as an existential threat and the other “isn’t that bothered.”\n“We know. That’s why some of our countries are asking, ‘Why don’t we attack Russia now, instead of sitting waiting for it to attack us?’” an unnamed “prominent Eastern European politician” said, without elaborating.\nThis is the ultimate in foolish “let’s you and him” fight strategies. And it’s based upon the obviously false assumption that if the Eastern European countries start a war with Russia, the USA will be somehow forced into declaring war on Russia in order to defend them.\nI don’t know how the God-Emperor could make it any more verbally clear to all of the European countries that the US military is not going to defend them under any circumstances, so it’s becoming apparent that he’s going to have to actually withdraw all of the US troops from Europe in order to convince the Europeans that they are genuinely and completely on their own, and that Uncle Sam is not going to rush in to rescue them from defeat and occupation by the Russian military.\nDISCUSS ON SG",
  "tags": [
    "Russia",
    "trainwreck",
    "war"
  ],
  "categories": [],
  "sitemap_lastmod": "2025-03-08T15:31:29+00:00"
}