{
  "url": "https://voxday.net/2025/03/20/sgt-boreings-daily-wire-club-band/",
  "scraped_at": "2026-01-08T19:42:48.410572",
  "title": "Sgt. Boreings Daily Wire Club Band",
  "date_display": "March 20, 2025",
  "date_iso": "2025-03-20T12:58:42+00:00",
  "date_from_url": "2025-03-20",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>We discovered where all that USAID money that The Daily Wire spent went. Apparently Jeremy Boreing fancied himself to be not only a film auteur, but also a musical genius. The funniest thing is that <a href=\"https://www.youtube.com/watch?v=wP6wA6GLuNE\">this live video of an original song</a> written by the aptly-named Mr. Boreing was recorded in 2023! But perhaps Ben Shapiro can find some solace in the ongoing collapse of his fake media empire in the choral lyrics of this song by Smokey Mike &amp; the god-king.</p><p><em>There’s no storm we cannot weather, my friends.<br/>If we only come together again.</em></p><p>To be fair, it’s far from the worst song I’ve ever heard. It’s just so Boomer retro that I was astonished to learn that Jeremy Boreing is ten years <em>younger </em>than me. I would have assumed precisely the opposite based on both his appearance and his musical tastes.</p><p>Of course, if you want to hear some original music that is not outdated and is on the absolute cutting edge of technology, <a href=\"https://www.youtube.com/playlist?list=OLAK5uy_mvUM5aZqmVSFpUoawAF-fRMUNuAz11nlw\">you can listen to Soulsigma</a> on YouTube and elsewhere.</p><p><em><a href=\"https://socialgalactic.com/micropost/ac65ce27-3a05-4838-9f6e-282f863dcb8d\">DISCUSS ON SG</a></em></p></div>",
  "content_text": "We discovered where all that USAID money that The Daily Wire spent went. Apparently Jeremy Boreing fancied himself to be not only a film auteur, but also a musical genius. The funniest thing is that\nthis live video of an original song\nwritten by the aptly-named Mr. Boreing was recorded in 2023! But perhaps Ben Shapiro can find some solace in the ongoing collapse of his fake media empire in the choral lyrics of this song by Smokey Mike & the god-king.\nThere’s no storm we cannot weather, my friends.\nIf we only come together again.\nTo be fair, it’s far from the worst song I’ve ever heard. It’s just so Boomer retro that I was astonished to learn that Jeremy Boreing is ten years\nyounger\nthan me. I would have assumed precisely the opposite based on both his appearance and his musical tastes.\nOf course, if you want to hear some original music that is not outdated and is on the absolute cutting edge of technology,\nyou can listen to Soulsigma\non YouTube and elsewhere.\nDISCUSS ON SG",
  "tags": [],
  "categories": [],
  "sitemap_lastmod": "2025-03-20T12:59:06+00:00"
}