{
  "url": "https://voxday.net/2025/03/03/the-mysterious-omission/",
  "scraped_at": "2026-01-08T19:40:56.164581",
  "title": "The Mysterious Omission",
  "date_display": "March 3, 2025",
  "date_iso": "2025-03-03T11:41:21+00:00",
  "date_from_url": "2025-03-03",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>Ron Unz delves into the French Revolution and discovers <a href=\"https://www.unz.com/runz/american-pravda-political-conspiracies-and-the-french-revolution/\">a very interesting omission</a> from Simon Schama’s popular history of that revolution:</p><blockquote class=\"wp-block-quote is-layout-flow wp-block-quote-is-layout-flow\"><p>Given its great length, Schama’s account provided an enormous amount of detail on the French society of that era and the course of the revolution that suddenly upended it. But his narrative very conspicuously lacked any direct explanation of why that colossal upheaval occurred, instead suggesting the French Revolution resulted from a combination of unforeseen, contingent factors and events. Two years of bad harvests had driven up the price of bread and the blunders of the king and some of his ministers provoked the spontaneous political combustion that brought down their thousand-year monarchy, while further mistakes gradually moved the revolution in an increasingly radical and bloody direction.</p><p>This constituted the major contrast with Webster’s account, which instead presented a very different interpretation of roughly the same historical facts. She portrayed the French Revolution in strictly conspiratorial terms as the deliberately planned outcome of particular political plots.</p><p>Some of her theories seemed quite unlikely. Her book was written during the height of the anti-German propaganda of the First World War. Therefore, on the basis of extremely thin evidence, she suggested that prior to his death in 1786, Frederick the Great of Prussia had sought to weaken the French monarchy and its Austrian alliance by promoting Masonic propaganda against Queen Marie Antoinette, the daughter of Austrian Empress Marie Theresa, who for decades had been his foremost geopolitical adversary.</p><p>But the main conspiracy that Webster described was hardly an implausible one, with neither the motive nor the means being outlandish, and she drew heavily upon contemporaneous sources for her analysis. The individual whom she fingered as the primary orchestrator of the French Revolution had also been discussed by Schama but only given glancing coverage.</p><p>As I had mentioned earlier, Philippe, the enormously wealthy Duc d’Orléans, was the king’s cousin and a close heir to the throne, ranked just behind the youngest brother of Louis XVI. Yet rather remarkably, he became one of the major early patrons of the revolutionary movement, even officially renaming himself “Égalité” as a sign of his support.</p><p>Among his large personal holdings was the Palais-Royal estate in Paris. Both Schama and Webster emphasized that he allowed it to be used as a hotbed and staging area for revolutionary activism, its private grounds being off limits to the French police authorities. Schama treated this as merely due to his liberal, open-minded tendencies, but according to Webster it was only one of the many actions he took deliberately aimed at destabilizing the ruling monarchy and then replacing his cousin on its throne. Whether or not her analysis was correct, the important role of the Palais-Royal in the early stages of the revolution appeared on dozens of pages of Schama’s text, and indeed many members of the National Assembly later described it as the “birthplace of the Revolution.”</p><p>One of the earliest cases of mass urban violence in Paris was a major riot at a wallpaper factory, leading to more than two dozen deaths, and this important story was covered at length by both Schama and Webster. Philippe visited the scene during that incident and threw small bags of money to the cheering rioters. Their attack on the factory was initially blocked by government troops, but after the latter were forced to open their lines to allow the carriage of Philippe’s wife to pass, the rioters poured through that gap and destroyed both the factory and the home of its influential owner. Both authors reported all these same facts, but only Webster treated them highly suspicious.</p><p>According to Webster, this was only one of many such examples. She argued that Philippe deployed his vast wealth to recruit thousands of violent brigands, who launched attacks against government facilities and civilian infrastructure, all aimed at fostering the spread of lawlessness, violent unrest, and the resulting wild rumors that would weaken the hold of the king and provoke an uprising. In fact, at one point Schama freely admitted that “later generations of royalist historians” had claimed that many of these incidents were orchestrated by Philippe and his fellow plotters in order to undermine government authority and allow him to seize the throne. But the author then made no effort to either explore or refute those accusations.</p><p>A couple of months after that first large riot, Philippe played a crucial role in leading the political revolt of most of the traditional French parliament against monarchical authority, and these members soon formed the new National Assembly in its place.</p><p>Later that same year, a mob of Parisian protesters led by women marched on Versailles and violently stormed the residence of the king and queen, who narrowly escaped with their lives. Philippe was later accused of having planned their murder by funding those rioters, who allegedly chanted his name as their new king. Once again, Webster heavily emphasized these facts, while Schama minimized them.</p><p>Webster also noted that the colors adopted early on by the revolutionary forces—white, blue, and red—happened to exactly match the colors of Philippe’s Orléans family. Perhaps this was mere coincidence, but perhaps not.</p><p>Given her future areas of historical interest, Webster also naturally emphasized that Philippe served as the Grand Master of French Freemasonry, presumably giving him a great web of hidden influence over the elite elements of his society, something obviously very helpful in overthrowing a regime. Schama entirely omitted that potentially important fact, and instead explicitly dismissed all such conspiratorial notions in just a few sentences:</p><p><em>To counter-revolutionary writers, looking back on the disaster of 1789, the proliferation of seditious and libelous material seemed even more sinister, evidence of a conspiracy hatched between godless followers of Voltaire and Rousseau, Freemasons, and the Duc d’Orléans. Was not the Palais-Royal after all one of the most notorious dens of iniquity, where even the police were forbidden from pouncing on peddlers of literary trash? Understandably, modern historians have steered clear of anything that could be construed as subscribing to the literary conspiracy theory of the French Revolution.</em></p><p>Wikipedia is notorious for representing the establishmentarian perspective on historical events and shying away from any questionable conspiratorial claims. But although the page on Phillipe makes no mention of Webster, the factual account it provided seemed closer to her analysis than that of Schama.</p><p>We should also not entirely ignore an interesting historical echo that came decades later. After the final defeat of Napoleon, the Bourbon monarchy was restored in France, and two of Louis XVI’s younger brothers then successively held the throne. But in the Second French Revolution of 1830, Charles X was overthrown and replaced by his cousin Louis Philippe d’Orléans, Philippe’s surviving son, who thus finally achieved the goal that his late father had allegedly sought.</p><p>Judging Webster’s work and weighing her conclusions against those of Schama is obviously difficult for a non-specialist such as myself, but I can certainly understand why her book was so highly regarded by at least some scholars when it appeared in 1919. Her main historical analysis seemed solidly based upon reliable sources of that era, many of which were only available in French, and she made an effort to weigh these against each other and evaluate their credibility. Her text included well over 1,000 footnotes to such crucial source material, while Schama’s provided none at all, instead merely listing the main works he drew upon for each individual chapter. So to some extent, Webster’s book represented new academic research, while Schama had produced what amounted to a very hefty synthesis and presentation of preexisting material.</p><p>All of this raises the interesting question of why Schama’s massive volume so casually dismissed and ignored the conspiratorial analysis that had been advanced by Webster more than three generations earlier.</p></blockquote><p>The answer, of course, is that in order to get published and become the primary English language reference on the French Revolution, it was vital for Schama to conceal the involvement of The Empire That Never Ended.</p><p>I’ve read Schama’s work twice. I’ve never read anything by Webster. But I have absolutely no doubt that Webster’s work is more historically accurate and reliable, simply because Schama had to omit what has been, over the course of recorded human history, one of the most important actors and drivers of events, which is the intersection of supernatural and material evil that Philip K. Dick identified as The Empire That Never Ended, that AC calls Cabal, that Vladimir Putin calls The Empire of Lies, and which we label Clown World.</p><p>The Romans called it Carthage, demanded its defeat, and sowed its grounds with salt. The Conquistadors called it the Aztec Empire and did their best to eradicate it forever. The Crusaders were corrupted by it. The Inquisitors did their best to root it out of Christendom and have been slandered for their efforts ever since. But regardless of what it is called, it will never die because it is not of human origins and the fallen rulers of this world will always find corrupt human spirits who are willing to serve them in return for the false immortality they are offered.</p><p>It’s not hard to understand why the wicked are so slavishly committed to the will of their evil masters. They fear death, as they well should, and they will do literally anything in their futile attempts to avoid their inevitable Divine judgment.</p><p><em><a href=\"https://socialgalactic.com/micropost/5c7062b7-9e75-4548-b2b3-b5845ad6b17a\">DISCUSS ON SG</a></em></p></div>",
  "content_text": "Ron Unz delves into the French Revolution and discovers\na very interesting omission\nfrom Simon Schama’s popular history of that revolution:\nGiven its great length, Schama’s account provided an enormous amount of detail on the French society of that era and the course of the revolution that suddenly upended it. But his narrative very conspicuously lacked any direct explanation of why that colossal upheaval occurred, instead suggesting the French Revolution resulted from a combination of unforeseen, contingent factors and events. Two years of bad harvests had driven up the price of bread and the blunders of the king and some of his ministers provoked the spontaneous political combustion that brought down their thousand-year monarchy, while further mistakes gradually moved the revolution in an increasingly radical and bloody direction.\nThis constituted the major contrast with Webster’s account, which instead presented a very different interpretation of roughly the same historical facts. She portrayed the French Revolution in strictly conspiratorial terms as the deliberately planned outcome of particular political plots.\nSome of her theories seemed quite unlikely. Her book was written during the height of the anti-German propaganda of the First World War. Therefore, on the basis of extremely thin evidence, she suggested that prior to his death in 1786, Frederick the Great of Prussia had sought to weaken the French monarchy and its Austrian alliance by promoting Masonic propaganda against Queen Marie Antoinette, the daughter of Austrian Empress Marie Theresa, who for decades had been his foremost geopolitical adversary.\nBut the main conspiracy that Webster described was hardly an implausible one, with neither the motive nor the means being outlandish, and she drew heavily upon contemporaneous sources for her analysis. The individual whom she fingered as the primary orchestrator of the French Revolution had also been discussed by Schama but only given glancing coverage.\nAs I had mentioned earlier, Philippe, the enormously wealthy Duc d’Orléans, was the king’s cousin and a close heir to the throne, ranked just behind the youngest brother of Louis XVI. Yet rather remarkably, he became one of the major early patrons of the revolutionary movement, even officially renaming himself “Égalité” as a sign of his support.\nAmong his large personal holdings was the Palais-Royal estate in Paris. Both Schama and Webster emphasized that he allowed it to be used as a hotbed and staging area for revolutionary activism, its private grounds being off limits to the French police authorities. Schama treated this as merely due to his liberal, open-minded tendencies, but according to Webster it was only one of the many actions he took deliberately aimed at destabilizing the ruling monarchy and then replacing his cousin on its throne. Whether or not her analysis was correct, the important role of the Palais-Royal in the early stages of the revolution appeared on dozens of pages of Schama’s text, and indeed many members of the National Assembly later described it as the “birthplace of the Revolution.”\nOne of the earliest cases of mass urban violence in Paris was a major riot at a wallpaper factory, leading to more than two dozen deaths, and this important story was covered at length by both Schama and Webster. Philippe visited the scene during that incident and threw small bags of money to the cheering rioters. Their attack on the factory was initially blocked by government troops, but after the latter were forced to open their lines to allow the carriage of Philippe’s wife to pass, the rioters poured through that gap and destroyed both the factory and the home of its influential owner. Both authors reported all these same facts, but only Webster treated them highly suspicious.\nAccording to Webster, this was only one of many such examples. She argued that Philippe deployed his vast wealth to recruit thousands of violent brigands, who launched attacks against government facilities and civilian infrastructure, all aimed at fostering the spread of lawlessness, violent unrest, and the resulting wild rumors that would weaken the hold of the king and provoke an uprising. In fact, at one point Schama freely admitted that “later generations of royalist historians” had claimed that many of these incidents were orchestrated by Philippe and his fellow plotters in order to undermine government authority and allow him to seize the throne. But the author then made no effort to either explore or refute those accusations.\nA couple of months after that first large riot, Philippe played a crucial role in leading the political revolt of most of the traditional French parliament against monarchical authority, and these members soon formed the new National Assembly in its place.\nLater that same year, a mob of Parisian protesters led by women marched on Versailles and violently stormed the residence of the king and queen, who narrowly escaped with their lives. Philippe was later accused of having planned their murder by funding those rioters, who allegedly chanted his name as their new king. Once again, Webster heavily emphasized these facts, while Schama minimized them.\nWebster also noted that the colors adopted early on by the revolutionary forces—white, blue, and red—happened to exactly match the colors of Philippe’s Orléans family. Perhaps this was mere coincidence, but perhaps not.\nGiven her future areas of historical interest, Webster also naturally emphasized that Philippe served as the Grand Master of French Freemasonry, presumably giving him a great web of hidden influence over the elite elements of his society, something obviously very helpful in overthrowing a regime. Schama entirely omitted that potentially important fact, and instead explicitly dismissed all such conspiratorial notions in just a few sentences:\nTo counter-revolutionary writers, looking back on the disaster of 1789, the proliferation of seditious and libelous material seemed even more sinister, evidence of a conspiracy hatched between godless followers of Voltaire and Rousseau, Freemasons, and the Duc d’Orléans. Was not the Palais-Royal after all one of the most notorious dens of iniquity, where even the police were forbidden from pouncing on peddlers of literary trash? Understandably, modern historians have steered clear of anything that could be construed as subscribing to the literary conspiracy theory of the French Revolution.\nWikipedia is notorious for representing the establishmentarian perspective on historical events and shying away from any questionable conspiratorial claims. But although the page on Phillipe makes no mention of Webster, the factual account it provided seemed closer to her analysis than that of Schama.\nWe should also not entirely ignore an interesting historical echo that came decades later. After the final defeat of Napoleon, the Bourbon monarchy was restored in France, and two of Louis XVI’s younger brothers then successively held the throne. But in the Second French Revolution of 1830, Charles X was overthrown and replaced by his cousin Louis Philippe d’Orléans, Philippe’s surviving son, who thus finally achieved the goal that his late father had allegedly sought.\nJudging Webster’s work and weighing her conclusions against those of Schama is obviously difficult for a non-specialist such as myself, but I can certainly understand why her book was so highly regarded by at least some scholars when it appeared in 1919. Her main historical analysis seemed solidly based upon reliable sources of that era, many of which were only available in French, and she made an effort to weigh these against each other and evaluate their credibility. Her text included well over 1,000 footnotes to such crucial source material, while Schama’s provided none at all, instead merely listing the main works he drew upon for each individual chapter. So to some extent, Webster’s book represented new academic research, while Schama had produced what amounted to a very hefty synthesis and presentation of preexisting material.\nAll of this raises the interesting question of why Schama’s massive volume so casually dismissed and ignored the conspiratorial analysis that had been advanced by Webster more than three generations earlier.\nThe answer, of course, is that in order to get published and become the primary English language reference on the French Revolution, it was vital for Schama to conceal the involvement of The Empire That Never Ended.\nI’ve read Schama’s work twice. I’ve never read anything by Webster. But I have absolutely no doubt that Webster’s work is more historically accurate and reliable, simply because Schama had to omit what has been, over the course of recorded human history, one of the most important actors and drivers of events, which is the intersection of supernatural and material evil that Philip K. Dick identified as The Empire That Never Ended, that AC calls Cabal, that Vladimir Putin calls The Empire of Lies, and which we label Clown World.\nThe Romans called it Carthage, demanded its defeat, and sowed its grounds with salt. The Conquistadors called it the Aztec Empire and did their best to eradicate it forever. The Crusaders were corrupted by it. The Inquisitors did their best to root it out of Christendom and have been slandered for their efforts ever since. But regardless of what it is called, it will never die because it is not of human origins and the fallen rulers of this world will always find corrupt human spirits who are willing to serve them in return for the false immortality they are offered.\nIt’s not hard to understand why the wicked are so slavishly committed to the will of their evil masters. They fear death, as they well should, and they will do literally anything in their futile attempts to avoid their inevitable Divine judgment.\nDISCUSS ON SG",
  "tags": [
    "Christianity",
    "Clown World",
    "history"
  ],
  "categories": [],
  "sitemap_lastmod": "2025-03-03T11:49:50+00:00"
}