{
  "url": "https://voxday.net/2025/03/06/the-end-of-the-department-of-education/",
  "scraped_at": "2026-01-08T19:41:14.518551",
  "title": "The End of the Department of Education",
  "date_display": "March 6, 2025",
  "date_iso": "2025-03-06T12:48:32+00:00",
  "date_from_url": "2025-03-06",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>The latest rumor about the God-Emperor 2.0’s next executive order bodes well. <a href=\"https://www.rt.com/news/613797-trump-dismantle-education-department/\">This bodes very, very well for the state of education</a> in the USA.</p><blockquote class=\"wp-block-quote is-layout-flow wp-block-quote-is-layout-flow\"><p>US President Donald Trump is expected to sign an executive order aimed at dismantling the Department of Education, the Wall Street Journal reported on Wednesday, citing sources familiar with the matter. The move, which is part of the Trump administration’s effort to overhaul US government agencies in a bid to eliminate wasteful state spending, has been expected since early February, when the White House revealed its intentions.</p><p>A draft of the order, reviewed by the outlet, instructs Education Secretary Linda McMahon to “take all necessary steps to facilitate the closure of the Education Department” to the fullest extent allowed by law. The order could reportedly be issued on Thursday.</p><p>“The experiment of controlling American education through Federal programs and dollars – and the unaccountable bureaucrats those programs and dollars support – has failed our children, our teachers, and our families,” the WSJ cited the draft order as reading. The order justifies the department’s closure by stating that <em>“since its founding in 1979, the Department of Education has spent more than $1 trillion without producing virtually any improvement in student reading and mathematics scores.”</em></p></blockquote><p>The Department of Education, established in 1979 under President Carter, has been a complete and abject failure by every single possible metric. We can be optimistic that the elimination of Federal control will be a net positive, particularly if it is followed by Federal support for the elimination of all state and local restrictions on homeschooling.</p><p>Once the states and local schools discover that interference in the way of homeschooling parents will cost them their Federal funding, they’ll rapidly change their tune.</p><p>One proposal for a new law: all government programs with a budget over X must be established on the basis of a solid, <em>unalterable </em>metric which cannot be redefined, and, if it is not met, will trigger the immediate elimination of the program. Yes, of course the relevant bureaucrats and their allies in the media will fight tooth and nail to redefine and otherwise marginalize the metric, but their very efforts to do so will be an obvious signal that the program is unsuccessful and should be shut down.</p><p>Call it the Accountability in Government Act.</p><p><em><a href=\"https://socialgalactic.com/micropost/e39b06b4-44ad-405f-a9d2-9a381411fd85\">DISCUSS ON SG</a></em></p></div>",
  "content_text": "The latest rumor about the God-Emperor 2.0’s next executive order bodes well.\nThis bodes very, very well for the state of education\nin the USA.\nUS President Donald Trump is expected to sign an executive order aimed at dismantling the Department of Education, the Wall Street Journal reported on Wednesday, citing sources familiar with the matter. The move, which is part of the Trump administration’s effort to overhaul US government agencies in a bid to eliminate wasteful state spending, has been expected since early February, when the White House revealed its intentions.\nA draft of the order, reviewed by the outlet, instructs Education Secretary Linda McMahon to “take all necessary steps to facilitate the closure of the Education Department” to the fullest extent allowed by law. The order could reportedly be issued on Thursday.\n“The experiment of controlling American education through Federal programs and dollars – and the unaccountable bureaucrats those programs and dollars support – has failed our children, our teachers, and our families,” the WSJ cited the draft order as reading. The order justifies the department’s closure by stating that\n“since its founding in 1979, the Department of Education has spent more than $1 trillion without producing virtually any improvement in student reading and mathematics scores.”\nThe Department of Education, established in 1979 under President Carter, has been a complete and abject failure by every single possible metric. We can be optimistic that the elimination of Federal control will be a net positive, particularly if it is followed by Federal support for the elimination of all state and local restrictions on homeschooling.\nOnce the states and local schools discover that interference in the way of homeschooling parents will cost them their Federal funding, they’ll rapidly change their tune.\nOne proposal for a new law: all government programs with a budget over X must be established on the basis of a solid,\nunalterable\nmetric which cannot be redefined, and, if it is not met, will trigger the immediate elimination of the program. Yes, of course the relevant bureaucrats and their allies in the media will fight tooth and nail to redefine and otherwise marginalize the metric, but their very efforts to do so will be an obvious signal that the program is unsuccessful and should be shut down.\nCall it the Accountability in Government Act.\nDISCUSS ON SG",
  "tags": [
    "education",
    "politics"
  ],
  "categories": [],
  "sitemap_lastmod": "2025-03-06T13:04:32+00:00"
}