{
  "url": "https://voxday.net/2025/03/05/the-books-must-flow/",
  "scraped_at": "2026-01-08T19:41:08.836836",
  "title": "The Books Must Flow",
  "date_display": "March 5, 2025",
  "date_iso": "2025-03-05T14:26:50+00:00",
  "date_from_url": "2025-03-05",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>First thing: the new Castalia Library book for March-April 2025 <a href=\"https://castalialibrary.substack.com/p/library-33-quo-vadis\">has been announced</a>.</p><p>Second thing: <em>DRACULA </em>is being bound. <em>SWISS FAMILY ROBINSON</em> and <em>ASOS </em>1 and <em>ASOS </em>2 are being printed. We’ll keep you posted on when they’ve a) been approved and b) are ready to ship.</p><p>Third thing: We’ve finally completed the move from the second bindery space to the third one. This was absolutely necessary because the 50-ton foil stamper did not fit in the building. We are now testing our third and fourth glues, and we are optimistic that one of them will be the right one.</p><p>Fourth thing: We know we’ve built up a backlog, but we’re not quite as behind schedule as it seems because most of the interiors and the designs are done. We’ve delayed getting them made because we want to know what the full range of our bindery options are, as there were benefits and problems to each of them, even before the new tariffs became a potential issue. The point is, don’t worry, we will catch up fast once all of the necessary details are nailed down.</p><p>Fifth thing: The fancy-dancy <em>HYPERGAMOUSE </em>cover proof will arrive on Friday. Once it’s approved, the paperback, hardcover, variants, and book blocks will be printed.</p><p>Sixth thing: We’re close enough that we’ve started putting together the interior of <em>THE ILIAD</em>. It’s going to be an original layout with illustrations leading every chapter. It promises to be spectacular. More about it later this week on the Library substack.</p><p><em><a href=\"https://socialgalactic.com/micropost/252bffaa-50a8-465a-8f47-d1ab5e62d0db\">DISCUSS ON SG</a></em></p></div>",
  "content_text": "First thing: the new Castalia Library book for March-April 2025\nhas been announced\n.\nSecond thing:\nDRACULA\nis being bound.\nSWISS FAMILY ROBINSON\nand\nASOS\n1 and\nASOS\n2 are being printed. We’ll keep you posted on when they’ve a) been approved and b) are ready to ship.\nThird thing: We’ve finally completed the move from the second bindery space to the third one. This was absolutely necessary because the 50-ton foil stamper did not fit in the building. We are now testing our third and fourth glues, and we are optimistic that one of them will be the right one.\nFourth thing: We know we’ve built up a backlog, but we’re not quite as behind schedule as it seems because most of the interiors and the designs are done. We’ve delayed getting them made because we want to know what the full range of our bindery options are, as there were benefits and problems to each of them, even before the new tariffs became a potential issue. The point is, don’t worry, we will catch up fast once all of the necessary details are nailed down.\nFifth thing: The fancy-dancy\nHYPERGAMOUSE\ncover proof will arrive on Friday. Once it’s approved, the paperback, hardcover, variants, and book blocks will be printed.\nSixth thing: We’re close enough that we’ve started putting together the interior of\nTHE ILIAD\n. It’s going to be an original layout with illustrations leading every chapter. It promises to be spectacular. More about it later this week on the Library substack.\nDISCUSS ON SG",
  "tags": [
    "Arkhaven",
    "Castalia Library"
  ],
  "categories": [],
  "sitemap_lastmod": "2025-03-05T14:26:54+00:00"
}