{
  "url": "https://voxday.net/2025/03/11/theyre-not-stopping/",
  "scraped_at": "2026-01-08T19:41:54.945229",
  "title": "They’re Not Stopping",
  "date_display": "March 11, 2025",
  "date_iso": "2025-03-11T17:48:45+00:00",
  "date_from_url": "2025-03-11",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p><strong>RUMOR: </strong><em>Russian forces are reportedly attempting to cross the Dnipro river, aiming to establish footholds on the west (right) bank at four locations to allow them a clear run at the strategically important port city of Kherson.</em></p><p><strong>RUMOR: </strong><em>The Russian Army is entering the Dnipro Region of Ukraine, in force, in multiple points of entry. This was unexpected by Ukraine (and its Western Cohorts). This is the first indication that Russia <strong>may</strong> be planning to take all portions of Ukraine that are East of the Dnipier River; basically the entire eastern half of Ukraine; but that is just speculation at this point.</em></p><p>My expectation is that the Russians will simply keep going until a) the Kiev regime surrenders unconditionally or b) they control the entire territory of Ukraine. Once the Dnieper is crossed, I expect the UFA will quickly collapse since there aren’t much in the way of fortifications in the western plains. It’s now evident that there is no one with whom the Russians can reasonably negotiate a surrender given the fact that Zelensky is not a legitimate head of state, the USA refuses to unilaterally end all support prior to any ceasefire, and the European leaders actually prefer the war to continue.</p><p><strong>UPDATE: </strong>This, combined with being driven out of Kursk, may be why the Ukrainians have theoretically agreed to US proposals for a ceasefire. I see no reason why the Russians would accept it, though.</p><p><em>Ukraine has agreed to a U.S. proposal for a 30-day ceasefire with Russia as President Donald Trump lifts a pause on military aid and intelligence sharing to the country. The agreement, under intense pressure from the U.S. side, now puts the ball in Moscow’s court, Secretary of State Marco Rubio said at the conclusion of a day of talks with Ukrainian officials in Saudi Arabia.</em></p><p><strong>UPDATE: </strong>The Russians will not accept the ceasefire.</p><p><em>In a significant setback to peace efforts, Russia has rejected the proposed 30-day ceasefire deal with Ukraine. The ceasefire agreement, which was contingent on Russia’s acceptance, aimed to provide a temporary halt to hostilities and create a foundation for a long-term peace deal. However, Russian officials have deemed the proposal unacceptable, citing concerns that it would allow Ukraine to strengthen its armed forces.</em></p><p><em>Russian Foreign Ministry spokeswoman Maria Zakharova stated that firm agreements on a final settlement are needed, and a temporary ceasefire is unacceptable. She emphasized that Ukraine would use the pause to strengthen its military potential with the help of its allies. Russian officials have also ruled out ceding captured Ukrainian territory and have reiterated their desire to roll back NATO’s presence across Europe.</em></p><p>As others have pointed out, Ukraine has repeatedly offered ceasefires after losing a significant battle, then  going right back on the offensive.</p><p><em><a href=\"https://socialgalactic.com/micropost/c34537f8-6e95-43b1-aa7a-f2be8f397546\">DISCUSS ON SG</a></em></p></div>",
  "content_text": "RUMOR:\nRussian forces are reportedly attempting to cross the Dnipro river, aiming to establish footholds on the west (right) bank at four locations to allow them a clear run at the strategically important port city of Kherson.\nRUMOR:\nThe Russian Army is entering the Dnipro Region of Ukraine, in force, in multiple points of entry. This was unexpected by Ukraine (and its Western Cohorts). This is the first indication that Russia\nmay\nbe planning to take all portions of Ukraine that are East of the Dnipier River; basically the entire eastern half of Ukraine; but that is just speculation at this point.\nMy expectation is that the Russians will simply keep going until a) the Kiev regime surrenders unconditionally or b) they control the entire territory of Ukraine. Once the Dnieper is crossed, I expect the UFA will quickly collapse since there aren’t much in the way of fortifications in the western plains. It’s now evident that there is no one with whom the Russians can reasonably negotiate a surrender given the fact that Zelensky is not a legitimate head of state, the USA refuses to unilaterally end all support prior to any ceasefire, and the European leaders actually prefer the war to continue.\nUPDATE:\nThis, combined with being driven out of Kursk, may be why the Ukrainians have theoretically agreed to US proposals for a ceasefire. I see no reason why the Russians would accept it, though.\nUkraine has agreed to a U.S. proposal for a 30-day ceasefire with Russia as President Donald Trump lifts a pause on military aid and intelligence sharing to the country. The agreement, under intense pressure from the U.S. side, now puts the ball in Moscow’s court, Secretary of State Marco Rubio said at the conclusion of a day of talks with Ukrainian officials in Saudi Arabia.\nUPDATE:\nThe Russians will not accept the ceasefire.\nIn a significant setback to peace efforts, Russia has rejected the proposed 30-day ceasefire deal with Ukraine. The ceasefire agreement, which was contingent on Russia’s acceptance, aimed to provide a temporary halt to hostilities and create a foundation for a long-term peace deal. However, Russian officials have deemed the proposal unacceptable, citing concerns that it would allow Ukraine to strengthen its armed forces.\nRussian Foreign Ministry spokeswoman Maria Zakharova stated that firm agreements on a final settlement are needed, and a temporary ceasefire is unacceptable. She emphasized that Ukraine would use the pause to strengthen its military potential with the help of its allies. Russian officials have also ruled out ceding captured Ukrainian territory and have reiterated their desire to roll back NATO’s presence across Europe.\nAs others have pointed out, Ukraine has repeatedly offered ceasefires after losing a significant battle, then  going right back on the offensive.\nDISCUSS ON SG",
  "tags": [
    "Russia",
    "war"
  ],
  "categories": [],
  "sitemap_lastmod": "2025-03-12T00:09:30+00:00"
}