{
  "url": "https://voxday.net/2025/03/01/what-three-years-hath-wrought/",
  "scraped_at": "2026-01-08T19:40:44.880067",
  "title": "What Three Years Hath Wrought",
  "date_display": "March 1, 2025",
  "date_iso": "2025-03-01T19:09:43+00:00",
  "date_from_url": "2025-03-01",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>Three years ago, three reporters in the Swiss media publicly defamed me and one of their accusations concerned the fact that I pointed out <a href=\"https://voxday.net/2022/06/01/a-portrait-in-criminal-defamation/\">Clown World was the aggressor and the cause of the Ukraine war</a>, that it was absolutely retarded for the European nations to intervene on behalf of a country with a foreign regime put into power by a US neocon coup, and that it was grandiose stupidity for the Swiss government to throw away the centuries of neutrality that protected the Swiss people from the wars that harrowed Europe in order to join the side that was absolutely guaranteed to lose the war.</p><p><em>On the war in Ukraine, his opinion is just as clear-cut: the aggression is the work of “the imperial USA”, which has put Russia in a situation of compulsion. He calls the West “Clown World”, while Russia would represent “Sovereign World”. At the end of February, he titled his blog, “Grandiose stupidity in Switzerland” and criticized the fact that the President of the Confederation Ignazio Cassis has sided with the European Union sanctions.</em></p><p>Three years later, all of my observations been born out in spades. The US and European sanctions have proven worse than useless. The United Nations Security Council has refused to condemn the so-called “Russian aggression” that was the inevitable response to the military expansion of NATO to its borders as well as the brutal assaults on the Russian people of the New Russian republics who had been seeking self-determination. And European leaders, such as former Austrian Foreign Minister Karin Kneissl are already beginning to admit that <a href=\"https://tass.com/world/1920915\">Russia has won the war</a>.</p><p><em>It had been said that Russia could allegedly be smashed on the battlefield, that it would fall to the Middle Ages level, that the Russian society would be ruined. However, that never happened. No mass riots that Europe expected or would like to see, ever happened either. We often heard that the country was going to fall into 40 new states, but it never happened as well. Taking the mentioned factors into consideration, I think that yes, Russia has won.”</em></p><p>And most importantly, the fact that the Ukrainian war was only <a href=\"https://www.rt.com/news/613503-kallas-trump-zelensky-free-world/\">one battle in the ongoing war</a> between Clown World and the Sovereign World represented by Russia, China, and now America, has been underlined by the European Union’s High Representative for Foreign Affairs and Security Policy, Kaja Kallas.</p><p><em>We stand by Ukraine.</em> <em>We will step up our support to Ukraine so that they can continue to fight back the agressor [sic]. Today, it became clear that the free world needs a new leader. It’s up to us, Europeans, to take this challenge.</em></p><p>The irony of the unelected Eurocrats who hate democracy, hate their own people, hate Christianity, criminalize free speech, and rule over their subjected people as the puppets of Clown World calling themselves “the free world” is satanic inversion at its most obvious. And the significant point of her statement is that thanks to President Trump, aka the God-Emperor 2.0 (may he reign 3,500 more years), America has finally, like Russia and China, begun to free itself from the wicked rule of Clown World.</p><p>And the Eurocrats will fail in their quest to raise up a new leader of Clown World because the European peoples are finally beginning to see through all their lies. They promised peace, unity, and wealth, and delivered war, diversity, and economic devastation. It will not be long before their masters throw them from their high horses. But until then, they will continue to invert and subvert the truth, because their retardery knows no limit. Their irrationality is rapidly approaching levels last seen when an Austrian was hiding from Russian tanks in a Berlin bunker.</p><p><em>French President Emmanuel Macron told reporters in Portugal that “I think we were all right to help Ukraine and sanction Russia three years ago, and to continue to do so.”</em></p><p><em><strong>UPDATE:</strong> </em>The people have asked for it, and they shall receive.</p><div class=\"wp-block-image\"><figure class=\"aligncenter size-full\"><img alt=\"\" class=\"wp-image-66644\" decoding=\"async\" fetchpriority=\"high\" height=\"512\" sizes=\"(max-width: 512px) 100vw, 512px\" src=\"https://voxday.net/wp-content/uploads/2025/03/image-2.png\" srcset=\"https://voxday.net/wp-content/uploads/2025/03/image-2.png 512w, https://voxday.net/wp-content/uploads/2025/03/image-2-300x300.png 300w, https://voxday.net/wp-content/uploads/2025/03/image-2-150x150.png 150w\" width=\"512\"/></figure></div><p><em><a href=\"https://socialgalactic.com/micropost/818173f6-c3ec-4d96-92e6-c5ca2381c5ed\">DISCUSS ON SG</a></em></p></div>",
  "content_text": "Three years ago, three reporters in the Swiss media publicly defamed me and one of their accusations concerned the fact that I pointed out\nClown World was the aggressor and the cause of the Ukraine war\n, that it was absolutely retarded for the European nations to intervene on behalf of a country with a foreign regime put into power by a US neocon coup, and that it was grandiose stupidity for the Swiss government to throw away the centuries of neutrality that protected the Swiss people from the wars that harrowed Europe in order to join the side that was absolutely guaranteed to lose the war.\nOn the war in Ukraine, his opinion is just as clear-cut: the aggression is the work of “the imperial USA”, which has put Russia in a situation of compulsion. He calls the West “Clown World”, while Russia would represent “Sovereign World”. At the end of February, he titled his blog, “Grandiose stupidity in Switzerland” and criticized the fact that the President of the Confederation Ignazio Cassis has sided with the European Union sanctions.\nThree years later, all of my observations been born out in spades. The US and European sanctions have proven worse than useless. The United Nations Security Council has refused to condemn the so-called “Russian aggression” that was the inevitable response to the military expansion of NATO to its borders as well as the brutal assaults on the Russian people of the New Russian republics who had been seeking self-determination. And European leaders, such as former Austrian Foreign Minister Karin Kneissl are already beginning to admit that\nRussia has won the war\n.\nIt had been said that Russia could allegedly be smashed on the battlefield, that it would fall to the Middle Ages level, that the Russian society would be ruined. However, that never happened. No mass riots that Europe expected or would like to see, ever happened either. We often heard that the country was going to fall into 40 new states, but it never happened as well. Taking the mentioned factors into consideration, I think that yes, Russia has won.”\nAnd most importantly, the fact that the Ukrainian war was only\none battle in the ongoing war\nbetween Clown World and the Sovereign World represented by Russia, China, and now America, has been underlined by the European Union’s High Representative for Foreign Affairs and Security Policy, Kaja Kallas.\nWe stand by Ukraine.\nWe will step up our support to Ukraine so that they can continue to fight back the agressor [sic]. Today, it became clear that the free world needs a new leader. It’s up to us, Europeans, to take this challenge.\nThe irony of the unelected Eurocrats who hate democracy, hate their own people, hate Christianity, criminalize free speech, and rule over their subjected people as the puppets of Clown World calling themselves “the free world” is satanic inversion at its most obvious. And the significant point of her statement is that thanks to President Trump, aka the God-Emperor 2.0 (may he reign 3,500 more years), America has finally, like Russia and China, begun to free itself from the wicked rule of Clown World.\nAnd the Eurocrats will fail in their quest to raise up a new leader of Clown World because the European peoples are finally beginning to see through all their lies. They promised peace, unity, and wealth, and delivered war, diversity, and economic devastation. It will not be long before their masters throw them from their high horses. But until then, they will continue to invert and subvert the truth, because their retardery knows no limit. Their irrationality is rapidly approaching levels last seen when an Austrian was hiding from Russian tanks in a Berlin bunker.\nFrench President Emmanuel Macron told reporters in Portugal that “I think we were all right to help Ukraine and sanction Russia three years ago, and to continue to do so.”\nUPDATE:\nThe people have asked for it, and they shall receive.\nDISCUSS ON SG",
  "tags": [
    "Clown World",
    "media",
    "Russia",
    "war"
  ],
  "categories": [],
  "sitemap_lastmod": "2025-03-01T22:50:58+00:00"
}