{
  "url": "https://voxday.net/2025/03/02/white-bull-at-mobile-world/",
  "scraped_at": "2026-01-08T19:40:52.306814",
  "title": "White Bull at Mobile World",
  "date_display": "March 2, 2025",
  "date_iso": "2025-03-02T23:30:03+00:00",
  "date_from_url": "2025-03-02",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>If you’re a young entrepreneur, or someone attempting to break out of a career rut, you absolutely must watch the series of videos White Bull is putting up on their substack, <a href=\"https://whitebullbusiness.substack.com/p/a-few-thoughts-beforeduringafter\">beginning with today’s</a>.</p><blockquote class=\"wp-block-quote is-layout-flow wp-block-quote-is-layout-flow\"><p>E: When there’s a networking event, what’s the first thing you need to do?</p><p>F: Survey the landscape, make some determinations (about who is there and who you should try to talk to), but mainly, just go… You’ve just got to execute, make a decision and go.</p><p>E: What’s your advice for young entrepreneurs. They’re just scared!</p><p>F: Yeah, it’s always uncharted territory. Uncharted waters. So you can be afraid of your own shadow, getting up in the morning, all of that. But that doesn’t pay the bills, it doesn’t get customers. So engage, say hello, see what’s going on. Ask people questions. They love to talk about themselves. And then, when it’s appropriate, insert what you’re doing.</p></blockquote><p>The key phrase: <em>when it’s appropriate.</em> You can always tell the newbies and the nobodies, because they’re desperate to talk. They don’t listen. They don’t pay any attention to who is who and what is what. The vets, who are actually there to do business, are always relaxed. They’ve probably already got a lunch meeting or a workout session scheduled with the people they’re there to meet, so they’re networking strategically, making connections that may or may not be important in the future.</p><p>My advice: listen, don’t talk. Sooner or later, someone will ask you. And when you answer, keep it very short and succinct. You’re not there to sell, you’re there to learn, to connect, and to plant seeds.</p><p><em><a href=\"https://socialgalactic.com/micropost/8d1f92a5-7a63-4bb1-b4e4-e219a770dc91\">DISCUSS ON SG</a></em></p></div>",
  "content_text": "If you’re a young entrepreneur, or someone attempting to break out of a career rut, you absolutely must watch the series of videos White Bull is putting up on their substack,\nbeginning with today’s\n.\nE: When there’s a networking event, what’s the first thing you need to do?\nF: Survey the landscape, make some determinations (about who is there and who you should try to talk to), but mainly, just go… You’ve just got to execute, make a decision and go.\nE: What’s your advice for young entrepreneurs. They’re just scared!\nF: Yeah, it’s always uncharted territory. Uncharted waters. So you can be afraid of your own shadow, getting up in the morning, all of that. But that doesn’t pay the bills, it doesn’t get customers. So engage, say hello, see what’s going on. Ask people questions. They love to talk about themselves. And then, when it’s appropriate, insert what you’re doing.\nThe key phrase:\nwhen it’s appropriate.\nYou can always tell the newbies and the nobodies, because they’re desperate to talk. They don’t listen. They don’t pay any attention to who is who and what is what. The vets, who are actually there to do business, are always relaxed. They’ve probably already got a lunch meeting or a workout session scheduled with the people they’re there to meet, so they’re networking strategically, making connections that may or may not be important in the future.\nMy advice: listen, don’t talk. Sooner or later, someone will ask you. And when you answer, keep it very short and succinct. You’re not there to sell, you’re there to learn, to connect, and to plant seeds.\nDISCUSS ON SG",
  "tags": [
    "business",
    "White Bull"
  ],
  "categories": [],
  "sitemap_lastmod": "2025-03-02T23:30:04+00:00"
}