{
  "url": "https://voxday.net/2025/12/17/a-historic-honor/",
  "scraped_at": "2026-01-08T20:39:33.876967",
  "title": "A Historic Honor",
  "date_display": "December 17, 2025",
  "date_iso": "2025-12-17T19:30:43+00:00",
  "date_from_url": "2025-12-17",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>A legendary physicist disagrees with the eminent literary authority Jordan S. Carroll’s conclusions concerning whether I will be remembered, and for what I will be remembered.</p><p><em>Although you will be remembered for your work demonstrating MITTENS, I think you will be remembered even more for your IGM theory, your alternative to Darwin’s theory. I’ve renamed your IGM theory the GRAY DAY THEORY, which emphasizes your contribution, and which I think makes the theory memorable. “Gray” is Asa Gray, the 19<sup>th</sup> century Harvard botanist.</em></p><p>I have to admit, it’s a rather clever name for the theory, which dates back to <a href=\"https://voxday.net/2012/10/14/mailvox-alternative-mechanis/\">a 2012 discussion of evolution</a> in which I answered the Neo-Darwinian advocate’s perfectly reasonable question:</p><blockquote class=\"wp-block-quote is-layout-flow wp-block-quote-is-layout-flow\"><p><em>If it is a fact that new species can come into existence while others go extinct, by what mechanism other than evolution through natural selection are these species proposed to arise, and does that proposed mechanism explain more of the observed evidence than TeNS?</em></p><p>Intelligent Genetic Manipulation is the mechanism that I propose.  And yes, I believe that explains more of the observed evidence than TENS, since IGM is a scientific proposition, a readily observed action, and a successful predictive model, whereas TENS is a philosophical proposition, an unobserved process, and an unsuccessful predictive model.</p><p>Now, this does not provide any basis for assuming the existence of a Creator God, or even declaring that TENS did not actually take place.  The logical fact of the matter is that even if TENS can be conclusively demonstrated to have taken place in various species, which has not happened despite more than 150 years of trying, <em>that doesn’t necessarily mean the process was sufficient to produce Man</em>.  If one contemplates the biological differences between ape and man, the vast leap in cognitive capacity taking place in a relatively small sum of generational cycles from the proposed common ancestor in comparison with the timelines supposedly required for other, less complicated evolutionary changes, the logic suggests – though it does not prove – that some degree of purposeful genetic manipulation has likely taken place at various points in the origin of the species and the development of <em>homo sapiens sapiens</em>.</p><p>I’m not talking about Intelligent Design, but rather intelligent editing.</p></blockquote><p>And yes, IGM, or rather, the Gray Day Theory of Evolution by Intelligent Genetic Manipulation, explains more of the observed evidence than the Neo-Darwinian Theory of Evolution by Natural Selection, considerably more.</p><p>Trust me, there is a lot more where that came from. Considerably more. But for now, that’s all I’m going to share. What a glorious Christmas present, though, as I certainly never dreamed that one day, there would be a theory of evolution named after me. It’s truly an honor that is only underlined by its intrinsic humor.</p><p><em><a href=\"https://socialgalactic.com/micropost/2e78aaa3-bd87-4560-b954-3c9ac499dd81\">DISCUSS ON SG</a></em></p></div>",
  "content_text": "A legendary physicist disagrees with the eminent literary authority Jordan S. Carroll’s conclusions concerning whether I will be remembered, and for what I will be remembered.\nAlthough you will be remembered for your work demonstrating MITTENS, I think you will be remembered even more for your IGM theory, your alternative to Darwin’s theory. I’ve renamed your IGM theory the GRAY DAY THEORY, which emphasizes your contribution, and which I think makes the theory memorable. “Gray” is Asa Gray, the 19\nth\ncentury Harvard botanist.\nI have to admit, it’s a rather clever name for the theory, which dates back to\na 2012 discussion of evolution\nin which I answered the Neo-Darwinian advocate’s perfectly reasonable question:\nIf it is a fact that new species can come into existence while others go extinct, by what mechanism other than evolution through natural selection are these species proposed to arise, and does that proposed mechanism explain more of the observed evidence than TeNS?\nIntelligent Genetic Manipulation is the mechanism that I propose.  And yes, I believe that explains more of the observed evidence than TENS, since IGM is a scientific proposition, a readily observed action, and a successful predictive model, whereas TENS is a philosophical proposition, an unobserved process, and an unsuccessful predictive model.\nNow, this does not provide any basis for assuming the existence of a Creator God, or even declaring that TENS did not actually take place.  The logical fact of the matter is that even if TENS can be conclusively demonstrated to have taken place in various species, which has not happened despite more than 150 years of trying,\nthat doesn’t necessarily mean the process was sufficient to produce Man\n.  If one contemplates the biological differences between ape and man, the vast leap in cognitive capacity taking place in a relatively small sum of generational cycles from the proposed common ancestor in comparison with the timelines supposedly required for other, less complicated evolutionary changes, the logic suggests – though it does not prove – that some degree of purposeful genetic manipulation has likely taken place at various points in the origin of the species and the development of\nhomo sapiens sapiens\n.\nI’m not talking about Intelligent Design, but rather intelligent editing.\nAnd yes, IGM, or rather, the Gray Day Theory of Evolution by Intelligent Genetic Manipulation, explains more of the observed evidence than the Neo-Darwinian Theory of Evolution by Natural Selection, considerably more.\nTrust me, there is a lot more where that came from. Considerably more. But for now, that’s all I’m going to share. What a glorious Christmas present, though, as I certainly never dreamed that one day, there would be a theory of evolution named after me. It’s truly an honor that is only underlined by its intrinsic humor.\nDISCUSS ON SG",
  "tags": [
    "evolution",
    "philosophy",
    "science"
  ],
  "categories": [],
  "sitemap_lastmod": "2025-12-17T19:30:45+00:00"
}