{
  "url": "https://voxday.net/2025/12/05/a-tale-of-5-translations/",
  "scraped_at": "2026-01-08T20:38:23.493615",
  "title": "A Tale of 5 Translations",
  "date_display": "December 5, 2025",
  "date_iso": "2025-12-05T12:22:20+00:00",
  "date_from_url": "2025-12-05",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>As you know if you are a Library or Libraria subscriber, the two volumes of <em>THE TALE OF GENJI</em> by Lady Murasaki Shikibu are the subscription books for October 2025 through March 2026. Written some 1400 years ago, <em>GENJI MONOGATARI</em> is the world’s first true novel, and one of the great classics of Man’s literature. And so, naturally, we want the Castalia Library edition to be something truly special.</p><p>There are seven English translations produced between 1882 and 2015, although only four of them are complete. So, we’re asking Library subscribers, literary readers, and linguistic enthusiasts to help us choose the translation for the two-volume edition on which we’re working now.</p><p>You can read the selections, vote in the poll, and leave any comments or rankings you might have right there <a href=\"https://stack.castalialibrary.com/p/a-tale-of-5-translations\">on the Library stack</a>. If you have any interest in this sort of thing at all, or you want to help Castalia, please take five minutes, read the five translations – which are, on average, only five paragraphs apiece – and share your opinion. This is important data for us, so the more people who can weigh in with their opinions, the better.</p><p><em><a href=\"https://socialgalactic.com/micropost/32bb7a64-303c-486b-8394-21b887b39378\">DISCUSS ON SG</a></em></p></div>",
  "content_text": "As you know if you are a Library or Libraria subscriber, the two volumes of\nTHE TALE OF GENJI\nby Lady Murasaki Shikibu are the subscription books for October 2025 through March 2026. Written some 1400 years ago,\nGENJI MONOGATARI\nis the world’s first true novel, and one of the great classics of Man’s literature. And so, naturally, we want the Castalia Library edition to be something truly special.\nThere are seven English translations produced between 1882 and 2015, although only four of them are complete. So, we’re asking Library subscribers, literary readers, and linguistic enthusiasts to help us choose the translation for the two-volume edition on which we’re working now.\nYou can read the selections, vote in the poll, and leave any comments or rankings you might have right there\non the Library stack\n. If you have any interest in this sort of thing at all, or you want to help Castalia, please take five minutes, read the five translations – which are, on average, only five paragraphs apiece – and share your opinion. This is important data for us, so the more people who can weigh in with their opinions, the better.\nDISCUSS ON SG",
  "tags": [
    "books",
    "Castalia Library"
  ],
  "categories": [],
  "sitemap_lastmod": "2025-12-05T14:03:30+00:00"
}