{
  "url": "https://voxday.net/2025/12/09/against-civilizational-erasure/",
  "scraped_at": "2026-01-08T20:38:45.135250",
  "title": "Against Civilizational Erasure",
  "date_display": "December 9, 2025",
  "date_iso": "2025-12-09T11:17:12+00:00",
  "date_from_url": "2025-12-09",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>Last night, I went over the entire <a href=\"https://www.documentcloud.org/documents/26341769-2025-national-security-strategy/\">National Security Strategy document (PDF)</a> on the Darkstream. It’s much, much better than we had any right to expect, given the incoherent rantings being periodically emitted by the Short Fat Trump, so much so that it tends to raise real questions about who is actually in charge of the things that matter. Both the previously-quoted section on the end of the migration era and the need for military reindustrialization read as if the author is familiar with this site, and the section on Europe is clearly focused on bringing about the end of the globalist elite’s occupation of the European nations and eliminating the EU’s current path toward “civilizational erasure”.</p><blockquote class=\"wp-block-quote is-layout-flow wp-block-quote-is-layout-flow\"><p>Continental Europe has been losing share of global GDP—down from 25 percent in 1990 to 14 percent today—partly owing to national and transnational regulations that undermine creativity and industriousness.</p><p>But this economic decline is eclipsed by the real and more stark prospect of civilizational erasure. The larger issues facing Europe include activities of the European Union and other transnational bodies that undermine political liberty and sovereignty, migration policies that are transforming the continent and creating strife, censorship of free speech and suppression of political opposition, cratering birthrates, and loss of national identities and self-confidence.</p><p>Should present trends continue, the continent will be unrecognizable in 20 years or less. As such, it is far from obvious whether certain European countries will have economies and militaries strong enough to remain reliable allies. Many of these nations are currently doubling down on their present path. We want Europe to remain European, to regain its civilizational self-confidence, and to abandon its failed focus on regulatory suffocation…</p><p>American diplomacy should continue to stand up for genuine democracy, freedom of expression, and unapologetic celebrations of European nations’ individual character and history. America encourages its political allies in Europe to promote this revival of spirit, and the growing influence of patriotic European parties indeed gives cause for great optimism.</p><p>Our goal should be to help Europe correct its current trajectory.</p></blockquote><p>This section has panicked the EU elite, and it absolutely should, because it makes it clear that both of the great nationalist powers, Russia and China, are now actively preferred to the globalist “anti-democratic elite” that is currently pushing for a military war with the former and an economic war with the latter, neither of which the EU could win even with the US assistance that is clearly going to be denied going forward.</p><p><em><a href=\"https://socialgalactic.com/micropost/e984264b-afc7-438e-aef7-cc12aecbd26d\">DISCUSS ON SG</a></em></p></div>",
  "content_text": "Last night, I went over the entire\nNational Security Strategy document (PDF)\non the Darkstream. It’s much, much better than we had any right to expect, given the incoherent rantings being periodically emitted by the Short Fat Trump, so much so that it tends to raise real questions about who is actually in charge of the things that matter. Both the previously-quoted section on the end of the migration era and the need for military reindustrialization read as if the author is familiar with this site, and the section on Europe is clearly focused on bringing about the end of the globalist elite’s occupation of the European nations and eliminating the EU’s current path toward “civilizational erasure”.\nContinental Europe has been losing share of global GDP—down from 25 percent in 1990 to 14 percent today—partly owing to national and transnational regulations that undermine creativity and industriousness.\nBut this economic decline is eclipsed by the real and more stark prospect of civilizational erasure. The larger issues facing Europe include activities of the European Union and other transnational bodies that undermine political liberty and sovereignty, migration policies that are transforming the continent and creating strife, censorship of free speech and suppression of political opposition, cratering birthrates, and loss of national identities and self-confidence.\nShould present trends continue, the continent will be unrecognizable in 20 years or less. As such, it is far from obvious whether certain European countries will have economies and militaries strong enough to remain reliable allies. Many of these nations are currently doubling down on their present path. We want Europe to remain European, to regain its civilizational self-confidence, and to abandon its failed focus on regulatory suffocation…\nAmerican diplomacy should continue to stand up for genuine democracy, freedom of expression, and unapologetic celebrations of European nations’ individual character and history. America encourages its political allies in Europe to promote this revival of spirit, and the growing influence of patriotic European parties indeed gives cause for great optimism.\nOur goal should be to help Europe correct its current trajectory.\nThis section has panicked the EU elite, and it absolutely should, because it makes it clear that both of the great nationalist powers, Russia and China, are now actively preferred to the globalist “anti-democratic elite” that is currently pushing for a military war with the former and an economic war with the latter, neither of which the EU could win even with the US assistance that is clearly going to be denied going forward.\nDISCUSS ON SG",
  "tags": [
    "Clown World",
    "EU"
  ],
  "categories": [],
  "sitemap_lastmod": "2025-12-09T11:17:14+00:00"
}