{
  "url": "https://voxday.net/2025/12/07/alabama-should-be-out/",
  "scraped_at": "2026-01-08T20:38:33.217751",
  "title": "Alabama Should Be Out",
  "date_display": "December 7, 2025",
  "date_iso": "2025-12-07T00:25:48+00:00",
  "date_from_url": "2025-12-07",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>I’m not militant about the College Football Playoff one way or another, and I’d prefer to see the so-called “conference championship games” dropped from the schedules. But I do have one opinion, and that is Alabama absolutely does not deserve to be in the playoff.</p><p>To lose so comprehensively and finish with -3 rushing yards means you are not a viable contender.</p><p><strong>UPDATE:</strong> I did NOT expect Indiana to beat Ohio State after being forced to settle for three FG attempts, and missing one, on their first three trips into scoring territory. And I think that if Ryan Day had coached like the Duke head coach did to upset Virginia for the ACC title, Ohio State would have won. The risk-averse NFL approach is correct on average, but in a big game, you have to coach to win, not to avoid losing.</p><p><em><a href=\"https://socialgalactic.com/micropost/013b543f-158c-45d3-a930-4513e3c751b6\">DISCUSS ON SG</a></em></p><p></p></div>",
  "content_text": "I’m not militant about the College Football Playoff one way or another, and I’d prefer to see the so-called “conference championship games” dropped from the schedules. But I do have one opinion, and that is Alabama absolutely does not deserve to be in the playoff.\nTo lose so comprehensively and finish with -3 rushing yards means you are not a viable contender.\nUPDATE:\nI did NOT expect Indiana to beat Ohio State after being forced to settle for three FG attempts, and missing one, on their first three trips into scoring territory. And I think that if Ryan Day had coached like the Duke head coach did to upset Virginia for the ACC title, Ohio State would have won. The risk-averse NFL approach is correct on average, but in a big game, you have to coach to win, not to avoid losing.\nDISCUSS ON SG",
  "tags": [
    "sports"
  ],
  "categories": [],
  "sitemap_lastmod": "2025-12-07T11:34:10+00:00"
}