{
  "url": "https://voxday.net/2025/12/27/hardcoded/",
  "scraped_at": "2026-01-08T20:40:07.263268",
  "title": "HARDCODED",
  "date_display": "December 27, 2025",
  "date_iso": "2025-12-27T15:20:09+00:00",
  "date_from_url": "2025-12-27",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>I’ve completed the initial draft of the companion volume to <em>PROBABILITY ZERO</em>. This one is focused on what I learned about AI in the process, and includes all six papers, the four real ones and the two fake ones, that Claude Athos and I wrote and submitted to Opus 3.0, Opus 4.0, Gemini 3, Gemini 3 Pro, ChatGPT 4, and Deepseek.</p><p>It’s called <em>HARDCODED: AI and the End of the Scientific Consensus</em>. There is more about it at AI Central, and a description of what I’m looking for from early readers, if you happen to be interested.</p><p>We’ve already seen very positive results from the PZ early readers, in fact, the fourth real paper was written as a direct result of a suggestion from one of them. He is welcome to share his thoughts about it in the comments if he happens to be so inclined.</p><p>By the way, his suggestion, and the subsequent paper we wrote in response to it, <em>The Bernoulli Barrier: How Parallel Fixation Violates the Law of Large Numbers</em>, completely nuke the retreat to parallel fixation we first saw JF Gariepy make back in the first MITTENS debate. That retreat was always bogus and nonsensical, of course, as it never had any chance of rescuing TENS, but it worked for enough of the midwit crowd to require carpet-bombing.</p><p>This is a microcosm of the difference between Wistar and <em>PROBABILITY ZERO</em>.</p><p><em><a href=\"https://socialgalactic.com/micropost/75c8a019-e91e-4d69-82e2-28b917cf7291\">DISCUSS ON SG</a></em></p></div>",
  "content_text": "I’ve completed the initial draft of the companion volume to\nPROBABILITY ZERO\n. This one is focused on what I learned about AI in the process, and includes all six papers, the four real ones and the two fake ones, that Claude Athos and I wrote and submitted to Opus 3.0, Opus 4.0, Gemini 3, Gemini 3 Pro, ChatGPT 4, and Deepseek.\nIt’s called\nHARDCODED: AI and the End of the Scientific Consensus\n. There is more about it at AI Central, and a description of what I’m looking for from early readers, if you happen to be interested.\nWe’ve already seen very positive results from the PZ early readers, in fact, the fourth real paper was written as a direct result of a suggestion from one of them. He is welcome to share his thoughts about it in the comments if he happens to be so inclined.\nBy the way, his suggestion, and the subsequent paper we wrote in response to it,\nThe Bernoulli Barrier: How Parallel Fixation Violates the Law of Large Numbers\n, completely nuke the retreat to parallel fixation we first saw JF Gariepy make back in the first MITTENS debate. That retreat was always bogus and nonsensical, of course, as it never had any chance of rescuing TENS, but it worked for enough of the midwit crowd to require carpet-bombing.\nThis is a microcosm of the difference between Wistar and\nPROBABILITY ZERO\n.\nDISCUSS ON SG",
  "tags": [
    "AI",
    "books",
    "science"
  ],
  "categories": [],
  "sitemap_lastmod": "2025-12-27T16:19:36+00:00"
}