{
  "url": "https://voxday.net/2025/12/09/hit-piece-or-pr/",
  "scraped_at": "2026-01-08T20:38:48.960641",
  "title": "Hit Piece or PR?",
  "date_display": "December 9, 2025",
  "date_iso": "2025-12-09T13:04:29+00:00",
  "date_from_url": "2025-12-09",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p><a href=\"https://www.swissinfo.ch/eng/information-wars/swiss-based-us-extremist-reaches-hundreds-of-thousands-with-his-far-right-views/90600466\">The latest Swiss media hit piece</a> on me is out, and while it’s definitely slanted in exactly the way you’d expect, it’s considerably more balanced than the previous one. Which is nice, for a change.</p><blockquote class=\"wp-block-quote is-layout-flow wp-block-quote-is-layout-flow\"><p>The Wall Street Journal once called Vox Day “the most despised man in science fiction”. Academics describe him as a “white supremacist”. He rejects this label and sees himself as a Christian nationalist.</p><p>“If you want to criticise me on something, then what you should criticise me on is I reject the Enlightenment,” Day says. Two hundred years ago, the Enlightenment sounded good, he says. “We didn’t know where free trade, democracy and so on would get us.” Today, the “collective West” is on the brink of the abyss, he says, adding that this is why the rest of the world rejects the values of the Enlightenment: because they want to “survive” and “thrive”.</p><p>We meet Day in an unfinished residential building in an industrial park in the village of Cressier, canton Fribourg. In the half-empty flat, Day has set up a gym and machinery for his leather-binding business. The reason Swissinfo is interested in Day is the reach of his influence. According to Similarweb, his blog gets over half a million hits per month – mainly in the US, the UK, Australia and Hong Kong.</p><p>Day uses harsh, discriminatory language. He recently titled an article “Ben Shapiro Is Cancer” about the right-wing Jewish US publicist – because of his pro-Israel stance…</p><p>A recurring theme on his blog is resistance to “clown world” – a conspiracy theory about satanic forces that Russia and China are fighting against.</p><p>Day has most of his followers on Gab.com. Some 35,000 people follow him on this platform, where only registered users can read his posts. Here he expresses himself even more bluntly. When a user accused him in spring 2024 of avoiding certain words in a post about “clown world”, Day replied: “I’m not avoiding any words, you retard. The Jews with whom you’re obsessed are the tools of the global satanists of Clown World, who themselves are just wicked servants of the true inhuman evils.”</p><p>Here he is giving voice to anti-Semitic conspiracy theories. Day sits back quietly while this comment is read to him. Then he says: “If you’re a Christian, you believe in the supernatural.” People like “George Soros or Hillary Clinton” are themselves just tools, he says.</p><p>Day denies that the description of “clown world” draws on the anti-Semitic “Protocols of the Elders of Zion”. “It has nothing to do with the protocols. It has to do with the bit in the Bible where Satan offers Jesus all the kingdoms of the world.” Since Jesus did not deny Satan this power, Satan rules the world, he says.</p></blockquote><p>It’s always interesting to see how the various journalists slant their pieces. For example, I don’t <a href=\"https://voxday.net/2025/11/09/ben-shapiro-is-cancer/\">call Ben Shapiro cancer</a> because he is pro-Israel, but because he openly calls for the US military invasion of Iran, Iraq, Saudi Arabia, Syria, Palestine, Egypt, and Pakistan in order to establish an empire in the Middle East, a policy which is obviously not in the American national interest or the interests of the people of those nations. And, of course, no link is provided because doing so would reveal that the journalist has misrepresented an explicit observation with his own implicit assumption. But it is fantastic that he describes Shapiro as a “publicist”; he certainly got that one right even if I prefer the term “manufactured shill”.</p><p>He also left out the reason that I’m much more comfortable with black culture than most people in Switzerland: I’m a former NCAA D1 sprinter and may well be the only individual in the entire country who has ever been to a black fraternity party. I didn’t learn the Electric Slide at Delta Upsilon…</p><p>And speaking of implicit assumptions, it is downright damning that the journalist would assume openly opposing <em>the literal rule of Satan</em> is reasonably characterized as “anti-semitism”. He actually describes the idea that there are “wicked servants of the true inhuman evils” as “anti-semitic”. That’s a real “wait, did he really just write that” moment that says even more about his beliefs than it does about mine. Now, my position is obviously nonsensical from the atheist perspective, but the particular way he attempted to make sense of it is extremely telling.</p><p>It’s also telling that my position on the war in Ukraine is entirely absent in this piece despite our discussion of it. Suddenly the Swiss media doesn’t want to talk about that, of course. I can only assume that in the next one, they won’t want to talk about how I was opposing the rule of satanic globalists before it was considered the right and proper thing to do.</p><p>The use of SimilarWeb to estimate the traffic was also interesting, since I gave him the actual numbers for the various sites. The SimilarWeb estimate isn’t even close to accurate; Sigma Game alone gets nearly that many views.</p><p>But whatever. I think it’s fascinating to read this little hit piece in the light of the recently published National Security Strategy, because it’s a confirmation of the way in which the globalists are reeling in disarray and struggling to accept the undeniable reality that the pendulum is no longer swinging in their favor and that the world has collectively rejected their vision for the future.</p><p>I did take the trouble to email the journalist one correction. It’s simply not true that the Puppies only “attempted to hijack the Hugo Award”. We absolutely nuked that thing, so much so that <em>11 votes is now enough to garner a Hugo nomination</em>. That’s not merely a crater, that’s a deep and massive one.</p><p>The one thing that was a little odd is that for all the talk about writing and publishing and science fiction, the article doesn’t mention <em>a single one of my 17 books</em>. This is especially strange in light of the fact that I had just published a new literary anthology prior to the interview that has been <a href=\"https://www.amazon.com/Death-Devil-Vox-Day-ebook/dp/B0FYTB9XNC\">very well received</a>.</p><div class=\"wp-block-image\"><figure class=\"aligncenter size-full\"><a href=\"https://www.amazon.com/Death-Devil-Vox-Day-ebook/dp/B0FYTB9XNC\"><img alt=\"\" class=\"wp-image-69512\" decoding=\"async\" fetchpriority=\"high\" height=\"362\" sizes=\"(max-width: 512px) 100vw, 512px\" src=\"https://voxday.net/wp-content/uploads/2025/12/image-6.png\" srcset=\"https://voxday.net/wp-content/uploads/2025/12/image-6.png 512w, https://voxday.net/wp-content/uploads/2025/12/image-6-300x212.png 300w\" width=\"512\"/></a></figure></div><p>Anyhow, I tend to doubt the idea that my most lasting and memorable contribution to the knowledge of Man will be the construction of the socio-sexual hierarchy. I tend to think these three demolitions of centuries-old Enlightenment “truths” will take precedence in the long run:</p><ul class=\"wp-block-list\"><li>The labor mobility criticism of free trade</li><li>The mathematical impossibility of the theory of evolution by natural selection</li><li>The proof that religion is not the cause of war</li></ul><p>Of course, in the event I happen to have correctly identified the precise year of the dissolution of the USA nearly 30 years prior, or even to have nailed it to within three years on either side, that will almost certainly prove to be the primary item of historical interest, no matter what else I manage to accomplish in the 40 or so years that remain to me.</p><p><em><a href=\"https://socialgalactic.com/micropost/ca58cb0f-0f2d-429f-a295-d9a59f8888c6\">DISCUSS ON SG</a></em></p></div>",
  "content_text": "The latest Swiss media hit piece\non me is out, and while it’s definitely slanted in exactly the way you’d expect, it’s considerably more balanced than the previous one. Which is nice, for a change.\nThe Wall Street Journal once called Vox Day “the most despised man in science fiction”. Academics describe him as a “white supremacist”. He rejects this label and sees himself as a Christian nationalist.\n“If you want to criticise me on something, then what you should criticise me on is I reject the Enlightenment,” Day says. Two hundred years ago, the Enlightenment sounded good, he says. “We didn’t know where free trade, democracy and so on would get us.” Today, the “collective West” is on the brink of the abyss, he says, adding that this is why the rest of the world rejects the values of the Enlightenment: because they want to “survive” and “thrive”.\nWe meet Day in an unfinished residential building in an industrial park in the village of Cressier, canton Fribourg. In the half-empty flat, Day has set up a gym and machinery for his leather-binding business. The reason Swissinfo is interested in Day is the reach of his influence. According to Similarweb, his blog gets over half a million hits per month – mainly in the US, the UK, Australia and Hong Kong.\nDay uses harsh, discriminatory language. He recently titled an article “Ben Shapiro Is Cancer” about the right-wing Jewish US publicist – because of his pro-Israel stance…\nA recurring theme on his blog is resistance to “clown world” – a conspiracy theory about satanic forces that Russia and China are fighting against.\nDay has most of his followers on Gab.com. Some 35,000 people follow him on this platform, where only registered users can read his posts. Here he expresses himself even more bluntly. When a user accused him in spring 2024 of avoiding certain words in a post about “clown world”, Day replied: “I’m not avoiding any words, you retard. The Jews with whom you’re obsessed are the tools of the global satanists of Clown World, who themselves are just wicked servants of the true inhuman evils.”\nHere he is giving voice to anti-Semitic conspiracy theories. Day sits back quietly while this comment is read to him. Then he says: “If you’re a Christian, you believe in the supernatural.” People like “George Soros or Hillary Clinton” are themselves just tools, he says.\nDay denies that the description of “clown world” draws on the anti-Semitic “Protocols of the Elders of Zion”. “It has nothing to do with the protocols. It has to do with the bit in the Bible where Satan offers Jesus all the kingdoms of the world.” Since Jesus did not deny Satan this power, Satan rules the world, he says.\nIt’s always interesting to see how the various journalists slant their pieces. For example, I don’t\ncall Ben Shapiro cancer\nbecause he is pro-Israel, but because he openly calls for the US military invasion of Iran, Iraq, Saudi Arabia, Syria, Palestine, Egypt, and Pakistan in order to establish an empire in the Middle East, a policy which is obviously not in the American national interest or the interests of the people of those nations. And, of course, no link is provided because doing so would reveal that the journalist has misrepresented an explicit observation with his own implicit assumption. But it is fantastic that he describes Shapiro as a “publicist”; he certainly got that one right even if I prefer the term “manufactured shill”.\nHe also left out the reason that I’m much more comfortable with black culture than most people in Switzerland: I’m a former NCAA D1 sprinter and may well be the only individual in the entire country who has ever been to a black fraternity party. I didn’t learn the Electric Slide at Delta Upsilon…\nAnd speaking of implicit assumptions, it is downright damning that the journalist would assume openly opposing\nthe literal rule of Satan\nis reasonably characterized as “anti-semitism”. He actually describes the idea that there are “wicked servants of the true inhuman evils” as “anti-semitic”. That’s a real “wait, did he really just write that” moment that says even more about his beliefs than it does about mine. Now, my position is obviously nonsensical from the atheist perspective, but the particular way he attempted to make sense of it is extremely telling.\nIt’s also telling that my position on the war in Ukraine is entirely absent in this piece despite our discussion of it. Suddenly the Swiss media doesn’t want to talk about that, of course. I can only assume that in the next one, they won’t want to talk about how I was opposing the rule of satanic globalists before it was considered the right and proper thing to do.\nThe use of SimilarWeb to estimate the traffic was also interesting, since I gave him the actual numbers for the various sites. The SimilarWeb estimate isn’t even close to accurate; Sigma Game alone gets nearly that many views.\nBut whatever. I think it’s fascinating to read this little hit piece in the light of the recently published National Security Strategy, because it’s a confirmation of the way in which the globalists are reeling in disarray and struggling to accept the undeniable reality that the pendulum is no longer swinging in their favor and that the world has collectively rejected their vision for the future.\nI did take the trouble to email the journalist one correction. It’s simply not true that the Puppies only “attempted to hijack the Hugo Award”. We absolutely nuked that thing, so much so that\n11 votes is now enough to garner a Hugo nomination\n. That’s not merely a crater, that’s a deep and massive one.\nThe one thing that was a little odd is that for all the talk about writing and publishing and science fiction, the article doesn’t mention\na single one of my 17 books\n. This is especially strange in light of the fact that I had just published a new literary anthology prior to the interview that has been\nvery well received\n.\nAnyhow, I tend to doubt the idea that my most lasting and memorable contribution to the knowledge of Man will be the construction of the socio-sexual hierarchy. I tend to think these three demolitions of centuries-old Enlightenment “truths” will take precedence in the long run:\nThe labor mobility criticism of free trade\nThe mathematical impossibility of the theory of evolution by natural selection\nThe proof that religion is not the cause of war\nOf course, in the event I happen to have correctly identified the precise year of the dissolution of the USA nearly 30 years prior, or even to have nailed it to within three years on either side, that will almost certainly prove to be the primary item of historical interest, no matter what else I manage to accomplish in the 40 or so years that remain to me.\nDISCUSS ON SG",
  "tags": [
    "media"
  ],
  "categories": [],
  "sitemap_lastmod": "2025-12-09T19:15:05+00:00"
}