{
  "url": "https://voxday.net/2025/12/23/immigrants-and-their-idea-nation-lie/",
  "scraped_at": "2026-01-08T20:39:53.209872",
  "title": "Immigrants and Their Idea Nation Lie",
  "date_display": "December 23, 2025",
  "date_iso": "2025-12-23T10:24:34+00:00",
  "date_from_url": "2025-12-23",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>Vivek Ramaswamy is not, <a href=\"https://news.gab.com/2025/12/vivek-ramaswamy-is-wrong-about-everything/\">and will never be</a>, an American:</p><blockquote class=\"wp-block-quote is-layout-flow wp-block-quote-is-layout-flow\"><p>Vivek Ramaswamy has taken to the pages of the New York Times to lecture heritage Americans about what their country really means. According to this son of Indian immigrants—born in 1985 to parents who arrived after the 1965 Immigration Act abolished the national origins system—America is not a nation in any traditional sense. It is an idea. A creed. A set of propositions to which anyone on earth can subscribe and thereby become “every bit as American as a Mayflower descendant.”</p><p>This is not history. This is mythology. And it is mythology that serves the interests of those who benefit from the displacement of the historic American nation while providing ideological cover for that displacement.</p><p>The idea that America was always a “proposition nation” open to the world is a post-World War II invention. It was manufactured by Jewish intellectuals hostile to the historic American nation and popularized by politicians eager to justify the 1965 Immigration Act that opened the floodgates to the third world. Reagan was not articulating timeless American principles. He was repeating propaganda that had been crafted within living memory.</p><p>Vivek’s vision is not merely historically illiterate. It is also incompatible with the Biblical understanding of nationhood.</p></blockquote><p>The only people who believe that America is an idea, and that it can belong to everyone, are the enemies of America. Long before Vivek Ramaswamy was even born, Moammar Qaddafi was saying the same thing: <em>America belongs to everyone, America belongs to the world.</em> More recently the Iranian president, or former Iranian president, Mahmoud Ahmadinejad, said much the same thing. He said America is a concept that belongs to the world and no government has the right to tell people that they can’t go and live in the United States.</p><p>You’re just an idea and neither your land nor your government belongs to you is not the statement of a friend or ally, much less someone who is actually one of you.</p><p>If America is an idea, then how is it that people who observably don’t share or agree with whatever that idea is supposed to be are given passports? And what is that idea, precisely?</p><p><em><a href=\"https://socialgalactic.com/micropost/3b5413aa-8073-4ef1-8356-f29b96429778\">DISCUSS ON SG</a></em></p></div>",
  "content_text": "Vivek Ramaswamy is not,\nand will never be\n, an American:\nVivek Ramaswamy has taken to the pages of the New York Times to lecture heritage Americans about what their country really means. According to this son of Indian immigrants—born in 1985 to parents who arrived after the 1965 Immigration Act abolished the national origins system—America is not a nation in any traditional sense. It is an idea. A creed. A set of propositions to which anyone on earth can subscribe and thereby become “every bit as American as a Mayflower descendant.”\nThis is not history. This is mythology. And it is mythology that serves the interests of those who benefit from the displacement of the historic American nation while providing ideological cover for that displacement.\nThe idea that America was always a “proposition nation” open to the world is a post-World War II invention. It was manufactured by Jewish intellectuals hostile to the historic American nation and popularized by politicians eager to justify the 1965 Immigration Act that opened the floodgates to the third world. Reagan was not articulating timeless American principles. He was repeating propaganda that had been crafted within living memory.\nVivek’s vision is not merely historically illiterate. It is also incompatible with the Biblical understanding of nationhood.\nThe only people who believe that America is an idea, and that it can belong to everyone, are the enemies of America. Long before Vivek Ramaswamy was even born, Moammar Qaddafi was saying the same thing:\nAmerica belongs to everyone, America belongs to the world.\nMore recently the Iranian president, or former Iranian president, Mahmoud Ahmadinejad, said much the same thing. He said America is a concept that belongs to the world and no government has the right to tell people that they can’t go and live in the United States.\nYou’re just an idea and neither your land nor your government belongs to you is not the statement of a friend or ally, much less someone who is actually one of you.\nIf America is an idea, then how is it that people who observably don’t share or agree with whatever that idea is supposed to be are given passports? And what is that idea, precisely?\nDISCUSS ON SG",
  "tags": [
    "immigration",
    "nationalism"
  ],
  "categories": [],
  "sitemap_lastmod": "2025-12-23T10:24:37+00:00"
}