{
  "url": "https://voxday.net/2025/12/06/its-the-because-that-gets-you/",
  "scraped_at": "2026-01-08T20:38:31.403538",
  "title": "It’s the BECAUSE That Gets You",
  "date_display": "December 6, 2025",
  "date_iso": "2025-12-06T16:15:56+00:00",
  "date_from_url": "2025-12-06",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>Stop explaining yourself.</p><p><em>I can’t stress this enough.</em> If you don’t want to look like a moron on a regular basis, if you don’t want to force others to have to conclude you are stupid, for the love of all that is Good and Beautiful and True, stop explaining yourself, your reasons, your decisions, and your actions.</p><p><em>Seriously, just stop.</em> Consider the word “because” a period. Stop right there. When you hear yourself saying it, let it be your signal to end the sentence right there.</p><p>First, nobody cares. If they want to know your reasons, they will ask you for them. And be aware that if they are asking for them, there is a very good chance they are looking to argue with you, dispute your position, or at least convince you to change your mind.</p><p>Second, you’re probably wrong, either in your logic or in your assumptions. Perhaps in a small way, perhaps in a big way, or perhaps you’re not even wrong but there is enough ambiguous room for a pedantic person to intentionally object.</p><p>Third, you have a right to your opinion, whatever it might be. You don’t have the right to tell people to accept incorrect facts, incorrect logic, or general incoherency.</p><p>Fourth, when you offer an explanation, you are essentially inviting an argument whether you realize it or not.</p><p>So just speak your mind. Don’t justify your opinion, because if you’re like most people, you can’t do so in a competent manner capable of surviving an intelligent critique. You have your right to your opinion, however insane or stupid or justified it might be, so simply rest content with that.</p><p>Here’s how people know that you’re part of the greater retardery in which we are engulfed. When you explain yourself, and then your explanation is conclusively demonstrated to be substantively false in some way, <em>you do not change your position</em>. This informs your interlocutor that there is nothing inside and there is no point in attempting to engage with you on the dialectical level.</p><p><em><a href=\"https://socialgalactic.com/micropost/7b91cdbf-4e5e-4278-be21-a0061f52bc57\">DISCUSS ON SG</a></em></p></div>",
  "content_text": "Stop explaining yourself.\nI can’t stress this enough.\nIf you don’t want to look like a moron on a regular basis, if you don’t want to force others to have to conclude you are stupid, for the love of all that is Good and Beautiful and True, stop explaining yourself, your reasons, your decisions, and your actions.\nSeriously, just stop.\nConsider the word “because” a period. Stop right there. When you hear yourself saying it, let it be your signal to end the sentence right there.\nFirst, nobody cares. If they want to know your reasons, they will ask you for them. And be aware that if they are asking for them, there is a very good chance they are looking to argue with you, dispute your position, or at least convince you to change your mind.\nSecond, you’re probably wrong, either in your logic or in your assumptions. Perhaps in a small way, perhaps in a big way, or perhaps you’re not even wrong but there is enough ambiguous room for a pedantic person to intentionally object.\nThird, you have a right to your opinion, whatever it might be. You don’t have the right to tell people to accept incorrect facts, incorrect logic, or general incoherency.\nFourth, when you offer an explanation, you are essentially inviting an argument whether you realize it or not.\nSo just speak your mind. Don’t justify your opinion, because if you’re like most people, you can’t do so in a competent manner capable of surviving an intelligent critique. You have your right to your opinion, however insane or stupid or justified it might be, so simply rest content with that.\nHere’s how people know that you’re part of the greater retardery in which we are engulfed. When you explain yourself, and then your explanation is conclusively demonstrated to be substantively false in some way,\nyou do not change your position\n. This informs your interlocutor that there is nothing inside and there is no point in attempting to engage with you on the dialectical level.\nDISCUSS ON SG",
  "tags": [
    "philosophy",
    "rhetoric"
  ],
  "categories": [],
  "sitemap_lastmod": "2025-12-06T16:15:58+00:00"
}