{
  "url": "https://voxday.net/2025/12/02/last-day-for-based-books/",
  "scraped_at": "2026-01-08T20:38:04.028336",
  "title": "Last Day for Based Books",
  "date_display": "December 2, 2025",
  "date_iso": "2025-12-02T15:31:45+00:00",
  "date_from_url": "2025-12-02",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p><em>Last day to get some of the two hundred fifty books in the 2025 Summer Based Book Sale for $0.99 or free!</em></p><p>I think <em>Midnight’s War</em> fans will be very pleased to know that the sequel to <em><a href=\"https://www.amazon.com/dp/B0DR3J9MLN\">OUT OF THE SHADOWS</a></em> is already underway and <em>A MERCILESS NIGHT</em> will be published a) after <em>SIGMA GAME</em> is published and b) much sooner than you would ever expect from the author who took seven years to write the sequel to <em>A THRONE OF BONES</em>.</p><p>In fact, I’ve already got the covers for book 2 and book 3 done, and it is only with an iron will that might be envied by Lorenzo di Piero de’ Medici himself that I refrain from sharing them with you. But I can assure, they are, in a word, <em>magnificent</em>.</p><p>Also, if anyone has typos or errata for <em>OUT OF THE SHADOWS</em>, please send me a text file with them ASAP. We’d like to start getting the print editions together. We’ll also be sure to get the ebook out to the remaining Signed First Edition backers this week.</p><p>From <em><a href=\"https://www.amazon.com/dp/B0DR3J9MLN\">OUT OF THE SHADOWS</a></em>:</p><h3 class=\"wp-block-heading\"><em>October 31st, 3:45 PM PST</em></h3><p>Elliott stood before the wall of monitors in HemaTech’s windowless executive conference room, watching the final confirmations stream in from distribution centers around the globe…</p><p>“Mr. Grahame?” Natalie’s voice pulled him from his calculations. “David Porter is here.”</p><p>Elliott turned to see <em>The Wall Street Journal</em> reporter standing in the doorway, looking considerably sharper than he had three months ago. The success of his HemaTech exposé had elevated him to journalism’s highest tier—a Pulitzer nomination, a book deal, and frequent television appearances on multiple cable networks. The man who’d uncovered the life-extension breakthrough of the century now wore an expensive suit and carried himself with a new degree of confidence.</p><p>“David,” Elliott said, gesturing to a chair facing the largest monitor. “Thank you for coming.”</p><p>“After what the first story on HemaTech did for me? I’d have flown to Antarctica if you’d asked.” Porter sat, pulling out his phone with practiced ease. “Lorenzo told me there would be another story, something even bigger. I have to admit, I can’t imagine what could possibly be bigger than the life extension you’ve already announced.”</p><p>“You’re about to find out,” Elliott said, glancing at his watch again. “In approximately thirteen minutes.”</p><p>Porter leaned forward, intrigued. “That sounds unusually specific.”</p><p>“Very specific indeed.” Elliott moved to the monitor controls, bringing up a feed from the BBC. The regular programming continued, oblivious to what was coming. “You’ll recall that three months ago, I gave you the initial story about HemaTech’s breakthrough. Tonight, you’re going to learn exactly why we turned down Blackrock and the IPO.”</p><p>“I thought it was about profit and control of the technology,” Porter said. “What we turned up—”</p><p>“Your investigation was entirely accurate, insofar as it went,” Elliott interrupted. “But it was rather like describing an iceberg based on what can be seen above the water. The real story, the larger purpose that HemaTech now serves, is about to come to light.”</p><p>Natalie moved silently around the room, dimming lights and activating additional monitors. Each screen showed a different news channel from around the world—CNN, <em>Al Jazeera</em>, NHK, <em>Deutsche Welle</em>. All continuing their regular programming, their anchors unaware that their teleprompters would soon display words that would shatter human civilization’s most fundamental assumptions.</p><p>“You’re making me downright nervous, Elliott,” Porter said, though his tone carried more excitement than anxiety. “The last time someone promised me the story of the century, it turned out to be exactly that.”</p><p>“You should be. This isn’t the story of the century,” Elliott said quietly. “It’s the story of the last several millennia. And of the centuries to come.”</p><p>The clock on the wall read 11:52 PM Greenwich Mean Time. Eight minutes.</p><p><em><a href=\"https://socialgalactic.com/micropost/c553e0ce-0664-443f-9b42-4d88d6dca1e4\">DISCUSS ON SG</a></em></p></div>",
  "content_text": "Last day to get some of the two hundred fifty books in the 2025 Summer Based Book Sale for $0.99 or free!\nI think\nMidnight’s War\nfans will be very pleased to know that the sequel to\nOUT OF THE SHADOWS\nis already underway and\nA MERCILESS NIGHT\nwill be published a) after\nSIGMA GAME\nis published and b) much sooner than you would ever expect from the author who took seven years to write the sequel to\nA THRONE OF BONES\n.\nIn fact, I’ve already got the covers for book 2 and book 3 done, and it is only with an iron will that might be envied by Lorenzo di Piero de’ Medici himself that I refrain from sharing them with you. But I can assure, they are, in a word,\nmagnificent\n.\nAlso, if anyone has typos or errata for\nOUT OF THE SHADOWS\n, please send me a text file with them ASAP. We’d like to start getting the print editions together. We’ll also be sure to get the ebook out to the remaining Signed First Edition backers this week.\nFrom\nOUT OF THE SHADOWS\n:\nOctober 31st, 3:45 PM PST\nElliott stood before the wall of monitors in HemaTech’s windowless executive conference room, watching the final confirmations stream in from distribution centers around the globe…\n“Mr. Grahame?” Natalie’s voice pulled him from his calculations. “David Porter is here.”\nElliott turned to see\nThe Wall Street Journal\nreporter standing in the doorway, looking considerably sharper than he had three months ago. The success of his HemaTech exposé had elevated him to journalism’s highest tier—a Pulitzer nomination, a book deal, and frequent television appearances on multiple cable networks. The man who’d uncovered the life-extension breakthrough of the century now wore an expensive suit and carried himself with a new degree of confidence.\n“David,” Elliott said, gesturing to a chair facing the largest monitor. “Thank you for coming.”\n“After what the first story on HemaTech did for me? I’d have flown to Antarctica if you’d asked.” Porter sat, pulling out his phone with practiced ease. “Lorenzo told me there would be another story, something even bigger. I have to admit, I can’t imagine what could possibly be bigger than the life extension you’ve already announced.”\n“You’re about to find out,” Elliott said, glancing at his watch again. “In approximately thirteen minutes.”\nPorter leaned forward, intrigued. “That sounds unusually specific.”\n“Very specific indeed.” Elliott moved to the monitor controls, bringing up a feed from the BBC. The regular programming continued, oblivious to what was coming. “You’ll recall that three months ago, I gave you the initial story about HemaTech’s breakthrough. Tonight, you’re going to learn exactly why we turned down Blackrock and the IPO.”\n“I thought it was about profit and control of the technology,” Porter said. “What we turned up—”\n“Your investigation was entirely accurate, insofar as it went,” Elliott interrupted. “But it was rather like describing an iceberg based on what can be seen above the water. The real story, the larger purpose that HemaTech now serves, is about to come to light.”\nNatalie moved silently around the room, dimming lights and activating additional monitors. Each screen showed a different news channel from around the world—CNN,\nAl Jazeera\n, NHK,\nDeutsche Welle\n. All continuing their regular programming, their anchors unaware that their teleprompters would soon display words that would shatter human civilization’s most fundamental assumptions.\n“You’re making me downright nervous, Elliott,” Porter said, though his tone carried more excitement than anxiety. “The last time someone promised me the story of the century, it turned out to be exactly that.”\n“You should be. This isn’t the story of the century,” Elliott said quietly. “It’s the story of the last several millennia. And of the centuries to come.”\nThe clock on the wall read 11:52 PM Greenwich Mean Time. Eight minutes.\nDISCUSS ON SG",
  "tags": [
    "Arkhaven",
    "books",
    "Castalia House"
  ],
  "categories": [],
  "sitemap_lastmod": "2025-12-02T15:32:26+00:00"
}