{
  "url": "https://voxday.net/2025/12/16/the-eu-in-the-bunker/",
  "scraped_at": "2026-01-08T20:39:25.044025",
  "title": "The EU in the Bunker",
  "date_display": "December 16, 2025",
  "date_iso": "2025-12-16T11:26:53+00:00",
  "date_from_url": "2025-12-16",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>The European Union <a href=\"https://www.moonofalabama.org/2025/12/eu-sanctions-swiss-intelligence-expert-jacques-baud.html\">is going seriously off the rails</a> as it heads towards its inevitable collapse.</p><p><em>The European Union is trying to eliminate sources of information that do not confirm with its official interpretation of real world events. One of the latest persons hit with official EU restrictions is the former Swiss intelligence official and author Jacques Baud.</em></p><p>I, too, found this hard to believe, but it’s real. Also being sanctioned by the EU is a retired Florida deputy sheriff.</p><blockquote class=\"wp-block-quote is-layout-flow wp-block-quote-is-layout-flow\"><p>Jacques BAUD<br/>Function: former colonel in the Swiss army; former strategic analyst, intelligence and terrorism specialist<br/>DOB: 1.4.1955<br/>Nationality: Swiss<br/>Gender: male<br/>Jacques Baud, a former Swiss army colonel and strategic analyst, is a regular guest on pro-Russian television and radio programmes. He acts as a mouthpiece for pro-Russian propaganda and makes conspiracy theories, for example accusing Ukraine of orchestrating its own invasion in order to join NATO.</p><p>John Mark DOUGAN<br/>Function: former Florida deputy sheriff<br/>DOB: 15.12.1976<br/>POB: Wilmington, Delaware, United States of America<br/>Nationality: American, Russian<br/>Gender: male</p><p>Reports from Western authorities and independent investigative sources link Dougan’s activities to Russia’s military intelligence agency (GRU) and the Moscow-based think tank the Center for Geopolitical Expertise, suggesting he receives Russian support and direction to influence elections, discredit political figures and manipulate public discourse in Western countries.</p></blockquote><p>Everything about the EU is false marketing. There isn’t a single professed principle that the fake state actually stands by.</p><p><em><a href=\"https://socialgalactic.com/micropost/95b26194-f2c2-421a-b539-ce34a368f5dd\">DISCUSS ON SG</a></em></p></div>",
  "content_text": "The European Union\nis going seriously off the rails\nas it heads towards its inevitable collapse.\nThe European Union is trying to eliminate sources of information that do not confirm with its official interpretation of real world events. One of the latest persons hit with official EU restrictions is the former Swiss intelligence official and author Jacques Baud.\nI, too, found this hard to believe, but it’s real. Also being sanctioned by the EU is a retired Florida deputy sheriff.\nJacques BAUD\nFunction: former colonel in the Swiss army; former strategic analyst, intelligence and terrorism specialist\nDOB: 1.4.1955\nNationality: Swiss\nGender: male\nJacques Baud, a former Swiss army colonel and strategic analyst, is a regular guest on pro-Russian television and radio programmes. He acts as a mouthpiece for pro-Russian propaganda and makes conspiracy theories, for example accusing Ukraine of orchestrating its own invasion in order to join NATO.\nJohn Mark DOUGAN\nFunction: former Florida deputy sheriff\nDOB: 15.12.1976\nPOB: Wilmington, Delaware, United States of America\nNationality: American, Russian\nGender: male\nReports from Western authorities and independent investigative sources link Dougan’s activities to Russia’s military intelligence agency (GRU) and the Moscow-based think tank the Center for Geopolitical Expertise, suggesting he receives Russian support and direction to influence elections, discredit political figures and manipulate public discourse in Western countries.\nEverything about the EU is false marketing. There isn’t a single professed principle that the fake state actually stands by.\nDISCUSS ON SG",
  "tags": [
    "EU",
    "law"
  ],
  "categories": [],
  "sitemap_lastmod": "2025-12-16T11:26:56+00:00"
}