{
  "url": "https://voxday.net/2013/11/20/a-remarkably-short-sighted-verdic/",
  "scraped_at": "2025-12-15T16:37:26.975178",
  "title": "A remarkably short-sighted verdict",
  "date_display": "November 20, 2013",
  "date_iso": "2013-11-20T14:00:00+00:00",
  "date_from_url": "2013-11-20",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>It would appear that the jury-packing was more successful on the second go-round, as <a href=\"http://www.kxxv.com/story/24015509/jury-finds-cj-grisham-guilty-of-interfering-with-police-duties\">CJ Grisham was found guilty</a> after only a single juror voted guilty the previous time:</p><blockquote class=\"tr_bq\"><p> The jury in the gun rights trial of Fort Hood Msg. Christopher Grisham has found him guilty of his misdemeanor charge. After just two hours of deliberating, the jury ultimately found Grisham guilty of interfering with police duties when he refused to turn over his AR-15 rifle to Temple police officer Steve Ermis this past March.</p><p>In the hours leading up to the verdict, dozens of Grisham’s supporters and pro gun rights activists stood vigilent outside the courtroom awaiting a verdict in the case, and shortly after the decision was announced, Grisham spoke out giving his reaction to the jury’s ruling and where he goes from here.</p><p>“What this jury just told the people of Bell County is that the police officers around here can walk up to you and take your personal property,” Grisham said.  “They can take your firearms, and they don’t have to have a reason for it.  They don’t have to tell you the reason for it.”</p><p>Throughout the trial, supporters of the Temple Police Department and the officers involved in the incident were also present in the courthouse, and many have taken to officer Steve Ermis’ Facebook page to post their supportive messages backing the Temple Police Department and its officer.</p></blockquote><p>If the police in Bell County think this inexcusably stupid verdict is going to give them carte blanche to seize weapons at will, well, expect a lot of dead police officers. And their moronic supporters will be surprised at how fast the cowardly bullies with badges are going to be fleeing in a panic the first time someone stands up for his rights the way the Americans at Lexington and Concord did.</p><p>Never forget that the police are total pussies. They strut around and talk a brave game, but the moment they realize that the other side views them as fair game and that they neither outnumber nor outgun the opposition, they often show less courage than the average unarmed citizen.  I don’t say this on the basis of my imagination or even the poor performance of police units in military history, but based on the recent observation <a href=\"http://losangeles.cbslocal.com/2013/11/15/ap-tsa-officer-bled-for-33-minutes-in-lax-shooting/\">of their behavior</a> under fire. Or not actually under fire, as the case may be.</p><blockquote class=\"tr_bq\"><p> An Associated Press report published Friday says help was delayed for<br> more than 30 minutes for the Transportation Security Administration<br> agent who was fatally shot at Los Angeles International Airport earlier<br> this month. Gerardo Hernandez, 39, was working at a lower-level passenger<br> check-in station on the morning of Nov. 1 when a gunman pulled a<br> semi-automatic weapon out of a duffel bag and opened fire.</br></br></br></br></br></p><p>Two law enforcement officials cited in the AP reports said paramedics<br> waited 150 yards away because police had not declared the terminal safe<br> to enter. It would be 33 minutes before airport police would put Hernandez, who<br> was about 20 feet from an exit, in a wheelchair and take  him to an<br> ambulance, said the officials, who were briefed on the investigation and<br> spoke on condition of anonymity because the probe was still ongoing.</br></br></br></br></br></p><p>For all but five of those minutes, there was no threat from the suspected gunman, 23-year-old <a href=\"http://losangeles.cbslocal.com/2013/11/01/the-question-of-why-remains-after-alleged-deadly-lax-shooter-is-identified/\" rel=\"noopener\" target=\"_blank\">Paul Anthony Ciancia</a>; he had been shot and was in custody, officials said.</p></blockquote><p>Molon labe, motherfuckers. As Tom Kratman wrote: <i>come and take them</i>.</p></div>",
  "content_text": "It would appear that the jury-packing was more successful on the second go-round, as\nCJ Grisham was found guilty\nafter only a single juror voted guilty the previous time:\nThe jury in the gun rights trial of Fort Hood Msg. Christopher Grisham has found him guilty of his misdemeanor charge. After just two hours of deliberating, the jury ultimately found Grisham guilty of interfering with police duties when he refused to turn over his AR-15 rifle to Temple police officer Steve Ermis this past March.\nIn the hours leading up to the verdict, dozens of Grisham’s supporters and pro gun rights activists stood vigilent outside the courtroom awaiting a verdict in the case, and shortly after the decision was announced, Grisham spoke out giving his reaction to the jury’s ruling and where he goes from here.\n“What this jury just told the people of Bell County is that the police officers around here can walk up to you and take your personal property,” Grisham said.  “They can take your firearms, and they don’t have to have a reason for it.  They don’t have to tell you the reason for it.”\nThroughout the trial, supporters of the Temple Police Department and the officers involved in the incident were also present in the courthouse, and many have taken to officer Steve Ermis’ Facebook page to post their supportive messages backing the Temple Police Department and its officer.\nIf the police in Bell County think this inexcusably stupid verdict is going to give them carte blanche to seize weapons at will, well, expect a lot of dead police officers. And their moronic supporters will be surprised at how fast the cowardly bullies with badges are going to be fleeing in a panic the first time someone stands up for his rights the way the Americans at Lexington and Concord did.\nNever forget that the police are total pussies. They strut around and talk a brave game, but the moment they realize that the other side views them as fair game and that they neither outnumber nor outgun the opposition, they often show less courage than the average unarmed citizen.  I don’t say this on the basis of my imagination or even the poor performance of police units in military history, but based on the recent observation\nof their behavior\nunder fire. Or not actually under fire, as the case may be.\nAn Associated Press report published Friday says help was delayed for\nmore than 30 minutes for the Transportation Security Administration\nagent who was fatally shot at Los Angeles International Airport earlier\nthis month. Gerardo Hernandez, 39, was working at a lower-level passenger\ncheck-in station on the morning of Nov. 1 when a gunman pulled a\nsemi-automatic weapon out of a duffel bag and opened fire.\nTwo law enforcement officials cited in the AP reports said paramedics\nwaited 150 yards away because police had not declared the terminal safe\nto enter. It would be 33 minutes before airport police would put Hernandez, who\nwas about 20 feet from an exit, in a wheelchair and take  him to an\nambulance, said the officials, who were briefed on the investigation and\nspoke on condition of anonymity because the probe was still ongoing.\nFor all but five of those minutes, there was no threat from the suspected gunman, 23-year-old\nPaul Anthony Ciancia\n; he had been shot and was in custody, officials said.\nMolon labe, motherfuckers. As Tom Kratman wrote:\ncome and take them\n.",
  "tags": [
    "NWA was right"
  ],
  "categories": [],
  "sitemap_lastmod": "2013-11-20T14:00:00+00:00"
}