{
  "url": "https://voxday.net/2013/11/20/accounting-for-unaccountable/",
  "scraped_at": "2025-12-15T16:37:25.046505",
  "title": "Accounting for the Unaccountable",
  "date_display": "November 20, 2013",
  "date_iso": "2013-11-20T09:46:00+00:00",
  "date_from_url": "2013-11-20",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>Does the Rule of Law survive in America circa 2013? What happens when no one is watching the watchers? We’re about to find out, as House Republicans are reportedly getting serious about trying to hold Obama administration Attorney General Eric Holder accountable for some of his many alleged crimes.</p><p>From Reuters:<i> “Republicans in the House of Representatives plan to introduce articles of impeachment against Attorney General Eric Holder on Thursday, in the hopes of removing a cabinet member they say has lied to Congress as well as failed to uphold federal law…. According to an outline, the first article is based on “Operation Fast and Furious” a bungled attempt to build cases against major gun traffickers who supplied firearms to Mexican drug cartels, while electing not to immediately prosecute low-level traffickers even as they bought 2,000 potentially illegal guns.”</i></p><p>Read the rest <a href=\"http://www.absoluterights.com/accounting-for-the-unaccountable-holder/\">at Absolute Rights</a>. Also on the topic of the Obama administration, you may be interested in a previous post there concerning <a href=\"http://www.absoluterights.com/obamas-strategic-retreat-on-obamacare/\">Obama’s Strategic Retreat from Obamacare</a>, in which I conclude:</p><p>Obama is not backing down. In fact, Republicans would have been much<br> wiser to force Americans to live with the law imposed upon them by the<br> incompetent Obama administration; a year of complete chaos in the health<br> care system, complete with millions of policy cancellations, would have<br> likely led to a Republican takeover of the Senate and a powerful<br> majority in the House.</br></br></br></br></br></p><p>Instead, they have bought Obama another year to work the media and<br> sell its lies to the American people. By staving off the collapse of<br> Obamacare, Republicans are helping ensure that they will have to refight<br> the battle in a year’s time against an enemy who will presumably have<br> learned a few lessons from the initial failure.</br></br></br></br></p></div>",
  "content_text": "Does the Rule of Law survive in America circa 2013? What happens when no one is watching the watchers? We’re about to find out, as House Republicans are reportedly getting serious about trying to hold Obama administration Attorney General Eric Holder accountable for some of his many alleged crimes.\nFrom Reuters:\n“Republicans in the House of Representatives plan to introduce articles of impeachment against Attorney General Eric Holder on Thursday, in the hopes of removing a cabinet member they say has lied to Congress as well as failed to uphold federal law…. According to an outline, the first article is based on “Operation Fast and Furious” a bungled attempt to build cases against major gun traffickers who supplied firearms to Mexican drug cartels, while electing not to immediately prosecute low-level traffickers even as they bought 2,000 potentially illegal guns.”\nRead the rest\nat Absolute Rights\n. Also on the topic of the Obama administration, you may be interested in a previous post there concerning\nObama’s Strategic Retreat from Obamacare\n, in which I conclude:\nObama is not backing down. In fact, Republicans would have been much\nwiser to force Americans to live with the law imposed upon them by the\nincompetent Obama administration; a year of complete chaos in the health\ncare system, complete with millions of policy cancellations, would have\nlikely led to a Republican takeover of the Senate and a powerful\nmajority in the House.\nInstead, they have bought Obama another year to work the media and\nsell its lies to the American people. By staving off the collapse of\nObamacare, Republicans are helping ensure that they will have to refight\nthe battle in a year’s time against an enemy who will presumably have\nlearned a few lessons from the initial failure.",
  "tags": [
    "Absolute Rights",
    "politics"
  ],
  "categories": [],
  "sitemap_lastmod": "2013-11-20T09:46:00+00:00"
}