{
  "url": "https://voxday.net/2013/11/08/an-honest-secularis/",
  "scraped_at": "2025-12-15T16:36:11.605040",
  "title": "An honest secularist",
  "date_display": "November 8, 2013",
  "date_iso": "2013-11-08T18:00:00+00:00",
  "date_from_url": "2013-11-08",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>It’s always interesting to read <a href=\"http://tofspot.blogspot.com/2013/10/found-upon-web-and-reprinted-here.html\">David Berlinski’s acerbic comments</a>, since his secularist criticism of scientists and professional atheists not only parallels my own, but tends to confound those who believe all secularists should shut up, stop thinking, and obediently follow the instructions of their self-appointed superiors. This interview is amusingly unprofessional, as the interviewer seems to think that he is debating Berlinski rather than interviewing him, but as you can see, the more fool he:</p><blockquote class=\"tr_bq\"><p> <i>Why do you think the debate about Darwin’s theory of evolution has taken on such a nasty turn?</i><b> </b></p><p>Nasty, eh? If so, the nastiness is not entirely<br> ecumenical. As far as I can tell, only one side is now occupying the<br> gutter, even though the gutter is, as gutters generally are, more than<br> spacious enough for two. But you raise a good question. Why are<br> Darwinian biologists so outraged? Like the San Andreas fault, the<br> indignation conspicuous at blogs such as <i>The Panda’s Thumb</i> or <i>Talk Reason</i> is now visible from outer space.</br></br></br></br></br></p><p>There is a lot at stake, obviously. Money, prestige, power, influence –<br> they all play a role. Darwinism is an ideological system and when such<br> systems come under threat, their supporters react in predictable ways.<br> Freedom of thought very often appears as an inconvenience to those with a<br> position to protect. Look at the attempts made to humiliate Rick<br> Sternberg at the Smithsonian Institute, or the campaign now underway to<br> do the same thing to Guillermo Gonzalez at Iowa State. There is nothing<br> surprising in all this. I myself believe that the world would be<br> suitably improved if those with whom I disagreed were simply to shut up.<br> What is curious is how quickly the Darwinian establishment has begun to<br> appear vulnerable …. <br> <i> </i></br></br></br></br></br></br></br></br></br></br></br></p><p><i>Not to scientists …</i></p><p>No, perhaps not. But to everyone else. Consider the latest Pew poll. “Two-thirds of Americans,” the <i>New York Times</i><br> reported, “say that creationism should be taught alongside evolution in<br> public schools.” But even among those quite persuaded of Darwin’s<br> theory, “18 percent said that evolution was ‘guided by a supreme<br> being.’” Now these are astonishing figures. They represent an authentic<br> popular revolt against elite thought. I cannot remember anything like<br> it. The fact that so many Darwinian biologists are utterly tone-deaf<br> when it comes to debate has hardly helped their case. It is no small<br> thing to have appeared before the American public in a way that suggests<br> both illimitable arrogance and scientific insecurity.</br></br></br></br></br></br></br></br></br></p><p><i>How would you react to the argument that Dawkins has made that any form of religion that goes beyond the scientific facts about the universe really represents a form of brainwashing …</i></p><p>He’s probably right. Most education is a form of brainwashing – so much better in French, by the way, <i>lavage de cerveau</i>. Give a child to the Jesuits, they say, and ten years later the man will cringe when he spots the Cross. But look, ten years or so spent studying physics is a pretty effective form of brainwashing as well. You emerge into the daylight blinking weakly and talking about an endless number of universes stacked on top of one another like an old-fashioned Maine pancake breakfast. Or you start babbling inanely about how meaningless the universe is. But if you ask me just who is the more credulous, the more suggestible, the dopier, the more perfectly prepared to convey absurdity to an almost inconceivable pitch of personal enthusiasm – a well-trained Jesuit or a Ph.D. in quantum physics, I’ll go with the physicist every time. There is nothing these people won’t believe. No wonder used-car salesmen love them. Biologists are, of course, worse. Tell them that in the future Richard Dawkins is going to conduct a personal invasion of Hell in order to roust the creationists, and The Panda’s Thumb will at once start vibrating with ticket sales.</p><p><i>Perhaps this isn’t the most productive of topics to pursue … </i></p></blockquote><p>Well, no, it’s not productive if you’re trying to convince everyone that biologists can be relied upon because physicists have very accurate models, anyhow. This post brought to you on the basis of <a href=\"http://www.scifiwright.com/2013/11/what-other-terms-are-there/\">John C. Wright’s recommendation</a>.</p></div>",
  "content_text": "It’s always interesting to read\nDavid Berlinski’s acerbic comments\n, since his secularist criticism of scientists and professional atheists not only parallels my own, but tends to confound those who believe all secularists should shut up, stop thinking, and obediently follow the instructions of their self-appointed superiors. This interview is amusingly unprofessional, as the interviewer seems to think that he is debating Berlinski rather than interviewing him, but as you can see, the more fool he:\nWhy do you think the debate about Darwin’s theory of evolution has taken on such a nasty turn?\nNasty, eh? If so, the nastiness is not entirely\necumenical. As far as I can tell, only one side is now occupying the\ngutter, even though the gutter is, as gutters generally are, more than\nspacious enough for two. But you raise a good question. Why are\nDarwinian biologists so outraged? Like the San Andreas fault, the\nindignation conspicuous at blogs such as\nThe Panda’s Thumb\nor\nTalk Reason\nis now visible from outer space.\nThere is a lot at stake, obviously. Money, prestige, power, influence –\nthey all play a role. Darwinism is an ideological system and when such\nsystems come under threat, their supporters react in predictable ways.\nFreedom of thought very often appears as an inconvenience to those with a\nposition to protect. Look at the attempts made to humiliate Rick\nSternberg at the Smithsonian Institute, or the campaign now underway to\ndo the same thing to Guillermo Gonzalez at Iowa State. There is nothing\nsurprising in all this. I myself believe that the world would be\nsuitably improved if those with whom I disagreed were simply to shut up.\nWhat is curious is how quickly the Darwinian establishment has begun to\nappear vulnerable ….\nNot to scientists …\nNo, perhaps not. But to everyone else. Consider the latest Pew poll. “Two-thirds of Americans,” the\nNew York Times\nreported, “say that creationism should be taught alongside evolution in\npublic schools.” But even among those quite persuaded of Darwin’s\ntheory, “18 percent said that evolution was ‘guided by a supreme\nbeing.’” Now these are astonishing figures. They represent an authentic\npopular revolt against elite thought. I cannot remember anything like\nit. The fact that so many Darwinian biologists are utterly tone-deaf\nwhen it comes to debate has hardly helped their case. It is no small\nthing to have appeared before the American public in a way that suggests\nboth illimitable arrogance and scientific insecurity.\nHow would you react to the argument that Dawkins has made that any form of religion that goes beyond the scientific facts about the universe really represents a form of brainwashing …\nHe’s probably right. Most education is a form of brainwashing – so much better in French, by the way,\nlavage de cerveau\n. Give a child to the Jesuits, they say, and ten years later the man will cringe when he spots the Cross. But look, ten years or so spent studying physics is a pretty effective form of brainwashing as well. You emerge into the daylight blinking weakly and talking about an endless number of universes stacked on top of one another like an old-fashioned Maine pancake breakfast. Or you start babbling inanely about how meaningless the universe is. But if you ask me just who is the more credulous, the more suggestible, the dopier, the more perfectly prepared to convey absurdity to an almost inconceivable pitch of personal enthusiasm – a well-trained Jesuit or a Ph.D. in quantum physics, I’ll go with the physicist every time. There is nothing these people won’t believe. No wonder used-car salesmen love them. Biologists are, of course, worse. Tell them that in the future Richard Dawkins is going to conduct a personal invasion of Hell in order to roust the creationists, and The Panda’s Thumb will at once start vibrating with ticket sales.\nPerhaps this isn’t the most productive of topics to pursue …\nWell, no, it’s not productive if you’re trying to convince everyone that biologists can be relied upon because physicists have very accurate models, anyhow. This post brought to you on the basis of\nJohn C. Wright’s recommendation\n.",
  "tags": [
    "science"
  ],
  "categories": [],
  "sitemap_lastmod": "2013-11-08T18:00:00+00:00"
}