{
  "url": "https://voxday.net/2013/11/04/annotating-bacon/",
  "scraped_at": "2025-12-15T16:35:45.535211",
  "title": "Annotating Bacon",
  "date_display": "November 4, 2013",
  "date_iso": "2013-11-04T14:00:00+00:00",
  "date_from_url": "2013-11-04",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>In which an essay by Francis Bacon is contemplated.</p><p>OF ATHEISM</p><p>I had rather believe all the fables in the Legend, and the Talmud, and the Alcoran, than that this universal frame is without a mind. And therefore, God never wrought miracle, to convince atheism, because his ordinary works convince it. It is true, that a little philosophy inclineth man’s mind to atheism; but depth in philosophy bringeth men’s minds about to religion.</p><p>For while the mind of man looketh upon second causes scattered, it may sometimes rest in them, and go no further; but when it beholdeth the chain of them, confederate and linked together, it must needs fly to Providence and Deity. Nay, even that school which is most accused of atheism doth most demonstrate religion; that is, the school of Leucippus and Democritus and Epicurus. For it is a thousand times more credible, that four mutable elements, and one immutable fifth essence, duly and eternally placed, need no God, than that an army of infinite small portions, or seeds unplaced, should have produced this order and beauty, without a divine marshal.</p><p>The Scripture saith, The fool hath said in his heart, there is no God; it is not said, The fool hath thought in his heart; so as he rather saith it, by rote to himself, as that he would have, than that he can thoroughly believe it, or be persuaded of it. For none deny, there is a God, but those, for whom it maketh that there were no God. It appeareth in nothing more, that atheism is rather in the lip, than in the heart of man, than by this; that atheists will ever be talking of that their opinion, as if they fainted in it, within themselves, and would be glad to be strengthened, by the consent of others.</p><p>Nay more, you shall have atheists strive to get disciples,(1) as it fareth with other sects. And, which is most of all, you shall have of them, that will suffer for atheism, and not recant; whereas if they did truly think, that there were no such thing as God, why should they trouble themselves?</p><p>Epicurus is charged, that he did but dissemble for his credit’s sake, when he affirmed there were blessed natures, but such as enjoyed themselves, without having respect to the government of the world. Wherein they say he did temporize; though in secret, he thought there was no God. But certainly he is traduced; for his words are noble and divine:<i> Non deos vulgi negare profanum; sed vulgi opiniones diis applicare profanum.</i>(2) Plato could have said no more.</p><p>And although he had the confidence, to deny the administration, he had not the power, to deny the nature. The Indians of the West, have names for their particular gods, though they have no name for God: as if the heathens should have had the names Jupiter, Apollo, Mars, etc., but not the word Deus; which shows that even those barbarous people have the notion, though they have not the latitude and extent of it. So that against atheists, the very savages take part, with the very subtlest philosophers.</p><p>The contemplative atheist is rare: a Diagoras, a Bion, a Lucian perhaps, and some others; and yet they seem to be more than they are; for that all that impugn a received religion, or superstition, are by the adverse part branded with the name of atheists. But the great atheists, indeed are hypocrites; which are ever handling holy things, but without feeling; so as they must needs be cauterized in the end.</p><p>The causes of atheism are: divisions in religion, if they be many; for any one main division, addeth zeal to both sides; but many divisions introduce atheism. Another is, scandal of priests; when it is come to that which St. Bernard saith, non est jam dicere, ut populus sic sacerdos; quia nec sic populus ut sacerdos. A third is, custom of profane scoffing in holy matters; which doth, by little and little, deface the reverence of religion. And lastly, learned times, specially with peace and prosperity; for troubles and adversities do more bow men’s minds to religion.(3)</p><p>They that deny a God, destroy man’s nobility; for certainly man is of kin to the beasts, by his body; and, if he be not of kin to God, by his spirit, he is a base and ignoble creature. It destroys likewise magnanimity, and the raising of human nature; for take an example of a dog, and mark what a generosity and courage he will put on, when he finds himself maintained by a man; who to him is instead of a God, or melior natura; which courage is manifestly such, as that creature, without that confidence of a better nature than his own, could never attain.</p><p>So man, when he resteth and assureth himself, upon divine protection and favor, gathered a force and faith, which human nature in itself could not obtain. Therefore, as atheism is in all respects hateful, so in this, that it depriveth human nature of the means to exalt itself, above human frailty.(4)</p><p>As it is in particular persons, so it is in nations. Never was there such a state for magnanimity as Rome. Of this state hear what Cicero saith: <i>Quam volumus licet, patres conscripti, nos amemus, tamen nec numero Hispanos, nec robore Gallos, nec calliditate Poenos, nec artibus Graecos, nec denique hoc ipso hujus gentis et terrae domestico nativoque sensu Italos ipsos et Latinos; sed pietate, ac religione, atque hac una sapientia, quod deorum immortalium numine omnia regi gubernarique perspeximus, omnes gentes nationesque superavimus.</i><u>(5)</u></p><p>(1) <i>Plus ça change, plus c’est la même chose.</i> There was nothing new about “the New Atheists”.</p><p>(2) “Not the man who denies the gods worshipped by the multitude, but he who<br> affirms of the gods what the multitude believes about them is truly<br> impious.”<br> – Epicurus, <a href=\"http://www.epicurus.net/en/menoeceus.html\">Letter to Menoeceus </a></br></br></br></p><p>Epicurus has a legitimate point, but I suspect this is usually read in the crude and superficial sense, which, contra Bacon, is neither noble nor divine.</p><p>(3) The fourth cause is the big one. It should be no surprise that atheism came into vogue at the end of the biggest economic bubble and longest period of international peace in history. But the pendulum is already swinging back.</p><p>(4) This is what renders atheism, rather than atheists per se, hateful. It intrinsically degrades Man. It is a literally soul-killing philosophy.</p><p>(5) “Let us, O conscript fathers, think as highly of ourselves as we<br> please; and yet it is not in numbers that we are superior to the Spaniards,<br> nor in personal strength to the Gauls, nor in cunning to the Carthaginians,<br> nor in arts to the Greeks, nor in the natural acuteness which seems to be<br> implanted in the people of this land and country, to the Italian and Latin<br> tribes; but it is in and by means of piety and religion, and this especial<br> wisdom of perceiving that all things are governed and managed by the divine<br> power of the immortal gods, that we have been and are superior to all other<br> countries and nations.”<br> – Cicero, <a href=\"http://www.perseus.tufts.edu/hopper/text?doc=Perseus%3Atext%3A1999.02.0020%3Atext%3DHar.%3Asection%3D19\">On the Responses to the Haruspices </a></br></br></br></br></br></br></br></br></br></p></div>",
  "content_text": "In which an essay by Francis Bacon is contemplated.\nOF ATHEISM\nI had rather believe all the fables in the Legend, and the Talmud, and the Alcoran, than that this universal frame is without a mind. And therefore, God never wrought miracle, to convince atheism, because his ordinary works convince it. It is true, that a little philosophy inclineth man’s mind to atheism; but depth in philosophy bringeth men’s minds about to religion.\nFor while the mind of man looketh upon second causes scattered, it may sometimes rest in them, and go no further; but when it beholdeth the chain of them, confederate and linked together, it must needs fly to Providence and Deity. Nay, even that school which is most accused of atheism doth most demonstrate religion; that is, the school of Leucippus and Democritus and Epicurus. For it is a thousand times more credible, that four mutable elements, and one immutable fifth essence, duly and eternally placed, need no God, than that an army of infinite small portions, or seeds unplaced, should have produced this order and beauty, without a divine marshal.\nThe Scripture saith, The fool hath said in his heart, there is no God; it is not said, The fool hath thought in his heart; so as he rather saith it, by rote to himself, as that he would have, than that he can thoroughly believe it, or be persuaded of it. For none deny, there is a God, but those, for whom it maketh that there were no God. It appeareth in nothing more, that atheism is rather in the lip, than in the heart of man, than by this; that atheists will ever be talking of that their opinion, as if they fainted in it, within themselves, and would be glad to be strengthened, by the consent of others.\nNay more, you shall have atheists strive to get disciples,(1) as it fareth with other sects. And, which is most of all, you shall have of them, that will suffer for atheism, and not recant; whereas if they did truly think, that there were no such thing as God, why should they trouble themselves?\nEpicurus is charged, that he did but dissemble for his credit’s sake, when he affirmed there were blessed natures, but such as enjoyed themselves, without having respect to the government of the world. Wherein they say he did temporize; though in secret, he thought there was no God. But certainly he is traduced; for his words are noble and divine:\nNon deos vulgi negare profanum; sed vulgi opiniones diis applicare profanum.\n(2) Plato could have said no more.\nAnd although he had the confidence, to deny the administration, he had not the power, to deny the nature. The Indians of the West, have names for their particular gods, though they have no name for God: as if the heathens should have had the names Jupiter, Apollo, Mars, etc., but not the word Deus; which shows that even those barbarous people have the notion, though they have not the latitude and extent of it. So that against atheists, the very savages take part, with the very subtlest philosophers.\nThe contemplative atheist is rare: a Diagoras, a Bion, a Lucian perhaps, and some others; and yet they seem to be more than they are; for that all that impugn a received religion, or superstition, are by the adverse part branded with the name of atheists. But the great atheists, indeed are hypocrites; which are ever handling holy things, but without feeling; so as they must needs be cauterized in the end.\nThe causes of atheism are: divisions in religion, if they be many; for any one main division, addeth zeal to both sides; but many divisions introduce atheism. Another is, scandal of priests; when it is come to that which St. Bernard saith, non est jam dicere, ut populus sic sacerdos; quia nec sic populus ut sacerdos. A third is, custom of profane scoffing in holy matters; which doth, by little and little, deface the reverence of religion. And lastly, learned times, specially with peace and prosperity; for troubles and adversities do more bow men’s minds to religion.(3)\nThey that deny a God, destroy man’s nobility; for certainly man is of kin to the beasts, by his body; and, if he be not of kin to God, by his spirit, he is a base and ignoble creature. It destroys likewise magnanimity, and the raising of human nature; for take an example of a dog, and mark what a generosity and courage he will put on, when he finds himself maintained by a man; who to him is instead of a God, or melior natura; which courage is manifestly such, as that creature, without that confidence of a better nature than his own, could never attain.\nSo man, when he resteth and assureth himself, upon divine protection and favor, gathered a force and faith, which human nature in itself could not obtain. Therefore, as atheism is in all respects hateful, so in this, that it depriveth human nature of the means to exalt itself, above human frailty.(4)\nAs it is in particular persons, so it is in nations. Never was there such a state for magnanimity as Rome. Of this state hear what Cicero saith:\nQuam volumus licet, patres conscripti, nos amemus, tamen nec numero Hispanos, nec robore Gallos, nec calliditate Poenos, nec artibus Graecos, nec denique hoc ipso hujus gentis et terrae domestico nativoque sensu Italos ipsos et Latinos; sed pietate, ac religione, atque hac una sapientia, quod deorum immortalium numine omnia regi gubernarique perspeximus, omnes gentes nationesque superavimus.\n(5)\n(1)\nPlus ça change, plus c’est la même chose.\nThere was nothing new about “the New Atheists”.\n(2) “Not the man who denies the gods worshipped by the multitude, but he who\naffirms of the gods what the multitude believes about them is truly\nimpious.”\n– Epicurus,\nLetter to Menoeceus\nEpicurus has a legitimate point, but I suspect this is usually read in the crude and superficial sense, which, contra Bacon, is neither noble nor divine.\n(3) The fourth cause is the big one. It should be no surprise that atheism came into vogue at the end of the biggest economic bubble and longest period of international peace in history. But the pendulum is already swinging back.\n(4) This is what renders atheism, rather than atheists per se, hateful. It intrinsically degrades Man. It is a literally soul-killing philosophy.\n(5) “Let us, O conscript fathers, think as highly of ourselves as we\nplease; and yet it is not in numbers that we are superior to the Spaniards,\nnor in personal strength to the Gauls, nor in cunning to the Carthaginians,\nnor in arts to the Greeks, nor in the natural acuteness which seems to be\nimplanted in the people of this land and country, to the Italian and Latin\ntribes; but it is in and by means of piety and religion, and this especial\nwisdom of perceiving that all things are governed and managed by the divine\npower of the immortal gods, that we have been and are superior to all other\ncountries and nations.”\n– Cicero,\nOn the Responses to the Haruspices",
  "tags": [
    "atheism",
    "religion"
  ],
  "categories": [],
  "sitemap_lastmod": "2013-11-04T14:00:00+00:00"
}