{
  "url": "https://voxday.net/2013/11/18/announcing-quantum-mortis/",
  "scraped_at": "2025-12-15T16:37:10.697005",
  "title": "Announcing QUANTUM MORTIS",
  "date_display": "November 18, 2013",
  "date_iso": "2013-11-18T08:00:00+00:00",
  "date_from_url": "2013-11-18",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>About twelve years ago, not long after writing the short story “Medal for a Marine”, I started writing another short story. This one concerned the murder of a man in exile from his home planet. I didn’t get very far on it before setting it aside, in fact, I didn’t even make it to the actual murder. Nevertheless, I had a very clear picture of the murder, the SF setting, and the detective. Heavily influenced by <i>Fifth Frontier War</i>, the story was set in a futuristic world that was a combination of the Traveller universe and the Space Lords universe. I should probably explain that Space Lords was a 1997 attempt to design a science fiction MMO that was a thousand-year extrapolation from the worlds of <i>Rebel Moon Rising</i>. We never really did much more than discuss it with Microsoft in a desultory manner, but for the next 16 years, the design document sat untouched on a hard drive.</p><p>In early 2013, I happened to run across the fragment of the short story. Having almost completely forgotten about it, it read as if someone else had written it. I thought it compared rather well to most of the SF I’d read since then, (China Mieville and Neal Stephenson aside), but realized that with four more 850-page TAODAL novels to write, there was absolutely no way I was going to be able to get around to that SF world for at least another six years. So, I contacted one of the guys who had expressed interest in publishing a Selenoth-related story through First Sword and suggested that we collaborate on turning that story fragment into a SF mystery series.  Steve agreed, we wrote the novel together, and we are very pleased make the following announcement:</p><p><i><b>QUANTUM MORTIS A Man Disrupted</b></i> will be published by Marcher Lord Hinterlands on December 2, 2013. It is 326 pages and will retail for $4.99 ebook and $22.99 hardcover. Those who <a href=\"http://www.marcherlordpress.com/bookstore/hinterlands-imprint/a-man-disrupted-by-steve-rzasa-and-vox-day/\">preorder the hardcover</a> by December 1st can do so for a discounted price of $14.99 and in addition to the hardcover will also receive a copy of <i><b>QUANTUM MORTIS A Man Disrupted</b></i> in either epub or mobi format (please specify) via email the day before release.</p><p><a href=\"http://2.bp.blogspot.com/-_c8YPrj8m98/UolBYSWwpdI/AAAAAAAAAlc/qvDkwOfPnAw/s1600/QM_AMD_900.jpg\" imageanchor=\"1\" style=\"clear: left; float: left; margin-bottom: 1em; margin-right: 1em;\"><img border=\"0\" decoding=\"async\" fetchpriority=\"high\" height=\"320\" src=\"http://www.milobookclub.com/wp-content/uploads/2013/11/QM_AMD_900-1.jpg\" width=\"213\"/></a><i>The independent planet of Rhysalan<br> provides contractual Sanctuary to 1,462 governments-in-exile. It is the<br> responsibility of the Military Crimes Investigation Division,<br> specifically, the Xenocriminology and Alien Relations department, to<br> keep a firm leash on the hundreds of thousands of xenos residing<br> on-planet. Assassinations, revolutions, civil wars, and attempted<br> planetary genocides are all in a day’s work for Chief Warrant Officer<br> Graven Tower, MCID-XAR.</br></br></br></br></br></br></br></i></p><div style=\"margin-bottom: 0in;\"> <br> <i>In addition to a missile-armed aerovar,<br> his trusty Sphinx CPB-18, and MCID’s extremely liberal policies concerning<br> collateral damage and civilian casualties, Chief Tower is assisted by<br> his extreme xenophobia as well as a military-grade augmented machine<br> intelligence that believes it has found God. So when the<br> disintegrated remnants of the heir apparent of an alien royal house<br> are discovered on the streets of Trans Paradis, the question is not<br> so much whether the killers will eventually be found, but if<br> it is the criminals or the crime investigators who will contribute<br> more to the final body count.</br></br></br></br></br></br></br></br></br></i><b><i> </i></b><p><b><i>QUANTUM MORTIS</i> </b>is the new<br> action-packed Mil-SF mystery series from Vox Day, author of the epic<br> fantasy series <i>The Arts of Dark and Light</i>.  Written with Steve<br> Rzasa, author of <i>The Word Reclaimed</i>, <b><i>QUANTUM MORTIS A Man<br> Disrupted</br></i></b> is the first novel in the series featuring Graven<br> Tower, MCID.</br></br></br></br></p></br></div><p> <a href=\"http://4.bp.blogspot.com/-Dos7CbwiSq4/UolCCt6rGAI/AAAAAAAAAlk/r8Rmd0duryU/s1600/QMGK_900b.jpg\" imageanchor=\"1\" style=\"clear: right; float: right; margin-bottom: 1em; margin-left: 1em;\"><noscript><img border=\"0\" decoding=\"async\" height=\"320\" src=\"http://www.milobookclub.com/wp-content/uploads/2013/11/QMGK_900b-1.jpg\" width=\"213\"/></noscript><img border=\"0\" class=\"lazyload\" data-src=\"http://www.milobookclub.com/wp-content/uploads/2013/11/QMGK_900b-1.jpg\" decoding=\"async\" height=\"320\" src=\"data:image/svg+xml,%3Csvg%20xmlns=%22http://www.w3.org/2000/svg%22%20viewBox=%220%200%20213%20320%22%3E%3C/svg%3E\" width=\"213\"/></a>However, as it happens, there is more. Steve is an unusually fast writer, especially in comparison with me. So, while he was waiting for me to turn the first draft into a final draft, he decided to make use of the time to write a short story concerning another of Graven Tower’s murder investigations. One thing led to another and by the time we were done with QM:AMD, we had also completed a novella that stood up rather nicely on its own. Since releasing <i>A Magic Broken</i> in company with <i>A Throne of Bones</i> worked rather well, Marcher Lord didn’t see any reason to not adopt a similar approach in the science fiction arena.</p><div style=\"margin-bottom: 0in;\"></div><div style=\"margin-bottom: 0in;\"> So, we are pleased to announce that <i><b>QUANTUM MORTIS Gravity Kills</b></i> will also be published on December 2, 2013. It is the equivalent of about 50 pages and will retail for $2.99 in ebook-only. As those familiar with Selenoth probably suspect, <i>Gravity Kills</i> will be enrolled in the Kindle Select program and will be periodically available for free download in 2014 as an introduction to the many worlds of Quantum Mortis.<p>Speaking of Amazon, I am looking for one more volunteer to read and review QM:GK. If you are interested doing so and expect to be able to read one of the ebooks by December 2nd and post a review on Amazon, please send me an email with QM:GK in the subject and specify if you prefer epub or mobi.</p><p> UPDATE: Steve has also announced the book <a href=\"http://steverzasa.wordpress.com/2013/11/06/quantum-mortis-a-man-disrupted/\">on his blog</a>. If you would like to ask him anything about it, I would encourage you to do so there.</p></div></div>",
  "content_text": "About twelve years ago, not long after writing the short story “Medal for a Marine”, I started writing another short story. This one concerned the murder of a man in exile from his home planet. I didn’t get very far on it before setting it aside, in fact, I didn’t even make it to the actual murder. Nevertheless, I had a very clear picture of the murder, the SF setting, and the detective. Heavily influenced by\nFifth Frontier War\n, the story was set in a futuristic world that was a combination of the Traveller universe and the Space Lords universe. I should probably explain that Space Lords was a 1997 attempt to design a science fiction MMO that was a thousand-year extrapolation from the worlds of\nRebel Moon Rising\n. We never really did much more than discuss it with Microsoft in a desultory manner, but for the next 16 years, the design document sat untouched on a hard drive.\nIn early 2013, I happened to run across the fragment of the short story. Having almost completely forgotten about it, it read as if someone else had written it. I thought it compared rather well to most of the SF I’d read since then, (China Mieville and Neal Stephenson aside), but realized that with four more 850-page TAODAL novels to write, there was absolutely no way I was going to be able to get around to that SF world for at least another six years. So, I contacted one of the guys who had expressed interest in publishing a Selenoth-related story through First Sword and suggested that we collaborate on turning that story fragment into a SF mystery series.  Steve agreed, we wrote the novel together, and we are very pleased make the following announcement:\nQUANTUM MORTIS A Man Disrupted\nwill be published by Marcher Lord Hinterlands on December 2, 2013. It is 326 pages and will retail for $4.99 ebook and $22.99 hardcover. Those who\npreorder the hardcover\nby December 1st can do so for a discounted price of $14.99 and in addition to the hardcover will also receive a copy of\nQUANTUM MORTIS A Man Disrupted\nin either epub or mobi format (please specify) via email the day before release.\nThe independent planet of Rhysalan\nprovides contractual Sanctuary to 1,462 governments-in-exile. It is the\nresponsibility of the Military Crimes Investigation Division,\nspecifically, the Xenocriminology and Alien Relations department, to\nkeep a firm leash on the hundreds of thousands of xenos residing\non-planet. Assassinations, revolutions, civil wars, and attempted\nplanetary genocides are all in a day’s work for Chief Warrant Officer\nGraven Tower, MCID-XAR.\nIn addition to a missile-armed aerovar,\nhis trusty Sphinx CPB-18, and MCID’s extremely liberal policies concerning\ncollateral damage and civilian casualties, Chief Tower is assisted by\nhis extreme xenophobia as well as a military-grade augmented machine\nintelligence that believes it has found God. So when the\ndisintegrated remnants of the heir apparent of an alien royal house\nare discovered on the streets of Trans Paradis, the question is not\nso much whether the killers will eventually be found, but if\nit is the criminals or the crime investigators who will contribute\nmore to the final body count.\nQUANTUM MORTIS\nis the new\naction-packed Mil-SF mystery series from Vox Day, author of the epic\nfantasy series\nThe Arts of Dark and Light\n.  Written with Steve\nRzasa, author of\nThe Word Reclaimed\n,\nQUANTUM MORTIS A Man\nDisrupted\nis the first novel in the series featuring Graven\nTower, MCID.\nHowever, as it happens, there is more. Steve is an unusually fast writer, especially in comparison with me. So, while he was waiting for me to turn the first draft into a final draft, he decided to make use of the time to write a short story concerning another of Graven Tower’s murder investigations. One thing led to another and by the time we were done with QM:AMD, we had also completed a novella that stood up rather nicely on its own. Since releasing\nA Magic Broken\nin company with\nA Throne of Bones\nworked rather well, Marcher Lord didn’t see any reason to not adopt a similar approach in the science fiction arena.\nSo, we are pleased to announce that\nQUANTUM MORTIS Gravity Kills\nwill also be published on December 2, 2013. It is the equivalent of about 50 pages and will retail for $2.99 in ebook-only. As those familiar with Selenoth probably suspect,\nGravity Kills\nwill be enrolled in the Kindle Select program and will be periodically available for free download in 2014 as an introduction to the many worlds of Quantum Mortis.\nSpeaking of Amazon, I am looking for one more volunteer to read and review QM:GK. If you are interested doing so and expect to be able to read one of the ebooks by December 2nd and post a review on Amazon, please send me an email with QM:GK in the subject and specify if you prefer epub or mobi.\nUPDATE: Steve has also announced the book\non his blog\n. If you would like to ask him anything about it, I would encourage you to do so there.",
  "tags": [
    "books",
    "Quantum Mortis"
  ],
  "categories": [],
  "sitemap_lastmod": "2013-11-18T08:00:00+00:00"
}