{
  "url": "https://voxday.net/2013/11/14/book-review-come-and-take-them-i/",
  "scraped_at": "2025-12-15T16:36:47.477927",
  "title": "Book Review: Come and Take Them I",
  "date_display": "November 14, 2013",
  "date_iso": "2013-11-14T09:34:00+00:00",
  "date_from_url": "2013-11-14",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p><i>FP is the first to review <a href=\"http://www.amazon.com/Come-Take-Them-Carrera-Kratman-ebook/dp/B00FY443IW\">Come and Take Them</a>, by Tom Kratman. </i></p><p>Tom Kratman is one of<br> today’s premier practitioners of military-oriented fiction. His<br> “CarreraVerse” SF series and his “Countdown”<br> just-barely-future series both display his talents in that genre.<br> <i>Come And Take Them </i>is the latest entry in the “CarreraVerse”<br> line, wherein retired soldier Patrick Hennesey di Carrera returns to<br> the colors in service to his adopted home of Balboa on Terra Nova,<br> against all enemies foreign and domestic, and in so doing reshapes<br> the politics of his world.<br/></br></br></br></br></br></br></br></br></p><div class=\"western\" style=\"margin-bottom: 0in;\"></div><div class=\"separator\" style=\"clear: both; text-align: center;\"> <a href=\"http://www.amazon.com/Come-Take-Them-Carrera-Kratman-ebook/dp/B00FY443IW\" imageanchor=\"1\" style=\"clear: left; float: left; margin-bottom: 1em; margin-right: 1em;\"><noscript><img border=\"0\" decoding=\"async\" src=\"http://www.milobookclub.com/wp-content/uploads/2013/11/kratman05-2.jpg\"/></noscript><img border=\"0\" class=\"lazyload\" data-src=\"http://www.milobookclub.com/wp-content/uploads/2013/11/kratman05-2.jpg\" decoding=\"async\" src=\"data:image/svg+xml,%3Csvg%20xmlns=%22http://www.w3.org/2000/svg%22%20viewBox=%220%200%20210%20140%22%3E%3C/svg%3E\"/></a></div><div class=\"western\" style=\"margin-bottom: 0in;\"> Terra Nova is a<br> designed world. The hypothesized race that designed it,<br> conventionally called the Noahs, appear to have intended it for<br> eventual human occupancy. Whether they knew that Man would bring his<br> legacy of strife along with him, no one can say. In any case, the<br> inter-religious and international animosities that gave rise to so<br> much warfare on Old Earth have found their way to the new world, and<br> Carrera has been in the thick of them for five volumes with more to<br> come.</br></br></br></br></br></br></br></br></div><div class=\"western\" style=\"margin-bottom: 0in;\"></div><div class=\"western\" style=\"margin-bottom: 0in;\"> The Timocratic Republic<br> of Balboa owes its current political structure and much else to<br> Carrera and President Raul Parilla. That structure depends heavily on<br> the <i>Legion del Cid,</i> created by Carrera and Parilla to provide<br> Balboa with a military of high quality. It has also been an<br> instrument for the transformation of their nation, as readers of the<br> first three books — <i>A Desert Called Peace, Carnifex, </i>and <i>The<br> Lotus Eaters </br></i>— will already be aware.</br></br></br></br></br></br></div><div class=\"western\" style=\"margin-bottom: 0in;\"></div><div class=\"western\" style=\"margin-bottom: 0in;\"> The other nations of<br> Terra Nova are not happy about Balboa’s acquisition of such a<br> powerful, politically dominant fighting force. To Balboa’s west, the<br> Tauran Union, a multinational alliance in the style of today’s<br> European Union but with <i>many </i>more soldiers and guns, seeks to<br> impose its will on the small republic. It’s an effort in which the<br> Taurans have the support of the orbiting “Peace Fleet” from<br> Old Earth. Nominally there only to suppress warfare below, the Peace<br> Fleet has the additional mission of preventing Terra Nova or any of<br> its nations from becoming capable of threatening the corrupt<br> hereditary oligarchy that bestrides the mother world. To that end,<br> its masters would dearly love to see the threat of Balboa put down<br> for good.</br></br></br></br></br></br></br></br></br></br></br></br></div><div class=\"western\" style=\"margin-bottom: 0in;\"></div><div class=\"western\" style=\"margin-bottom: 0in;\"> <i>Come And Take Them<br> </br></i>concerns itself with events before and during the Tauran Union’s<br> attempt to evict the Carrera-designed government of Balboa, and to<br> install a puppet regime biddable by the TU’s masters. Its timespan is<br> roughly coextensive with that from the end of <i>The Lotus Eaters<br> </br></i>through the events of <i>The Amazon Legion.</i> As one might<br> expect of a novel from a specialist in military fiction, much of the<br> book is concerned with war and the preparations for it. However,<br> Kratman has another mission alongside that one: to depict the<br> swelling of regret within Carrera himself over having militarized his<br> nation, thus exposing it to the enmity of the Taurans and others.</br></br></br></br></br></br></br></br></div><div class=\"western\" style=\"margin-bottom: 0in;\"></div><div class=\"western\" style=\"margin-bottom: 0in;\"> Carrera has sickened of<br> bloodshed, and is particularly contrite about the all but certain<br> high price his nation will pay when it faces off against the Taurans,<br> as he believes, correctly, it must. However, he’s a soldier, bound to<br> his profession as much by its ethic as by his aptitudes and<br> experience. Despite the certainty of mass death, he contrives a plan<br> by which his tiny republic can defeat the far larger Tauran Union,<br> and in so doing create a continent-sized political upheaval that<br> might result in a new birth of freedom for millions beyond Balboa’s<br> borders.</br></br></br></br></br></br></br></br></br></div><div class=\"western\" style=\"margin-bottom: 0in;\"></div><div class=\"western\" style=\"margin-bottom: 0in;\"> <i>Come And Take Them</i><br> is a big book, replete with plot subthreads and secondary adventures<br> in which Supporting Cast characters rise to local prominence, whether<br> they live and triumph or fail and die. There are splashes of highly<br> colored drama throughout the action. The reader is advised to give it<br> his full attention, perhaps with the aid of a large map of Balboa and<br> a lot of little counters to represent the units fighting over it. A<br> <i>dramatis personae</i> annotated with character sketches and<br> timelines might also be advisable. Though it must be read slowly and<br> with concentration to get the maximum enjoyment from its richness,<br> the effort is amply repaid.</br></br></br></br></br></br></br></br></br></br></div><div class=\"western\" style=\"margin-bottom: 0in;\"></div><div class=\"western\" style=\"margin-bottom: 0in;\"> There will be more<br/> segments in the “CarreraVerse” series. The best way to<br/> prepare for them is to absorb this one in all its bright and gory<br/> spectacle, and to reflect on the questions that forever hang over all<br/> tests of arms: How high a price ought one to be willing to pay for<br/> one’s objectives? At what point must a man, a commander, or a nation<br/> say, “Enough,” and act accordingly?</div><div class=\"western\" style=\"margin-bottom: 0in;\"></div><div class=\"western\" style=\"margin-bottom: 0in;\"> The thrust of the<br/> question may change according to whether the lead is or is not<br/> already flying, but its urgency does not.  From the vengeance and bloodshed of <i>A Desert Called Peace</i> and the steady army and nation-building of <i>Carnifex </i>and <i>The Lotus Eaters</i>, <i>Come And Take Them</i> continues the completion of a portrait of patriotism, heroism, and the ultimate price that must be paid in their service. Highly recommended.</div></div>",
  "content_text": "FP is the first to review\nCome and Take Them\n, by Tom Kratman.\nTom Kratman is one of\ntoday’s premier practitioners of military-oriented fiction. His\n“CarreraVerse” SF series and his “Countdown”\njust-barely-future series both display his talents in that genre.\nCome And Take Them\nis the latest entry in the “CarreraVerse”\nline, wherein retired soldier Patrick Hennesey di Carrera returns to\nthe colors in service to his adopted home of Balboa on Terra Nova,\nagainst all enemies foreign and domestic, and in so doing reshapes\nthe politics of his world.\nTerra Nova is a\ndesigned world. The hypothesized race that designed it,\nconventionally called the Noahs, appear to have intended it for\neventual human occupancy. Whether they knew that Man would bring his\nlegacy of strife along with him, no one can say. In any case, the\ninter-religious and international animosities that gave rise to so\nmuch warfare on Old Earth have found their way to the new world, and\nCarrera has been in the thick of them for five volumes with more to\ncome.\nThe Timocratic Republic\nof Balboa owes its current political structure and much else to\nCarrera and President Raul Parilla. That structure depends heavily on\nthe\nLegion del Cid,\ncreated by Carrera and Parilla to provide\nBalboa with a military of high quality. It has also been an\ninstrument for the transformation of their nation, as readers of the\nfirst three books —\nA Desert Called Peace, Carnifex,\nand\nThe\nLotus Eaters\n— will already be aware.\nThe other nations of\nTerra Nova are not happy about Balboa’s acquisition of such a\npowerful, politically dominant fighting force. To Balboa’s west, the\nTauran Union, a multinational alliance in the style of today’s\nEuropean Union but with\nmany\nmore soldiers and guns, seeks to\nimpose its will on the small republic. It’s an effort in which the\nTaurans have the support of the orbiting “Peace Fleet” from\nOld Earth. Nominally there only to suppress warfare below, the Peace\nFleet has the additional mission of preventing Terra Nova or any of\nits nations from becoming capable of threatening the corrupt\nhereditary oligarchy that bestrides the mother world. To that end,\nits masters would dearly love to see the threat of Balboa put down\nfor good.\nCome And Take Them\nconcerns itself with events before and during the Tauran Union’s\nattempt to evict the Carrera-designed government of Balboa, and to\ninstall a puppet regime biddable by the TU’s masters. Its timespan is\nroughly coextensive with that from the end of\nThe Lotus Eaters\nthrough the events of\nThe Amazon Legion.\nAs one might\nexpect of a novel from a specialist in military fiction, much of the\nbook is concerned with war and the preparations for it. However,\nKratman has another mission alongside that one: to depict the\nswelling of regret within Carrera himself over having militarized his\nnation, thus exposing it to the enmity of the Taurans and others.\nCarrera has sickened of\nbloodshed, and is particularly contrite about the all but certain\nhigh price his nation will pay when it faces off against the Taurans,\nas he believes, correctly, it must. However, he’s a soldier, bound to\nhis profession as much by its ethic as by his aptitudes and\nexperience. Despite the certainty of mass death, he contrives a plan\nby which his tiny republic can defeat the far larger Tauran Union,\nand in so doing create a continent-sized political upheaval that\nmight result in a new birth of freedom for millions beyond Balboa’s\nborders.\nCome And Take Them\nis a big book, replete with plot subthreads and secondary adventures\nin which Supporting Cast characters rise to local prominence, whether\nthey live and triumph or fail and die. There are splashes of highly\ncolored drama throughout the action. The reader is advised to give it\nhis full attention, perhaps with the aid of a large map of Balboa and\na lot of little counters to represent the units fighting over it. A\ndramatis personae\nannotated with character sketches and\ntimelines might also be advisable. Though it must be read slowly and\nwith concentration to get the maximum enjoyment from its richness,\nthe effort is amply repaid.\nThere will be more\nsegments in the “CarreraVerse” series. The best way to\nprepare for them is to absorb this one in all its bright and gory\nspectacle, and to reflect on the questions that forever hang over all\ntests of arms: How high a price ought one to be willing to pay for\none’s objectives? At what point must a man, a commander, or a nation\nsay, “Enough,” and act accordingly?\nThe thrust of the\nquestion may change according to whether the lead is or is not\nalready flying, but its urgency does not.  From the vengeance and bloodshed of\nA Desert Called Peace\nand the steady army and nation-building of\nCarnifex\nand\nThe Lotus Eaters\n,\nCome And Take Them\ncontinues the completion of a portrait of patriotism, heroism, and the ultimate price that must be paid in their service. Highly recommended.",
  "tags": [
    "Book Review",
    "Lions Den"
  ],
  "categories": [],
  "sitemap_lastmod": "2013-11-14T09:34:00+00:00"
}