{
  "url": "https://voxday.net/2013/11/18/book-review-come-and-take-them-ii/",
  "scraped_at": "2025-12-15T16:37:16.260616",
  "title": "Book Review: Come and Take Them II",
  "date_display": "November 18, 2013",
  "date_iso": "2013-11-18T21:00:00+00:00",
  "date_from_url": "2013-11-18",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p><i>CK is the second to review <a href=\"http://www.amazon.com/Come-Take-Them-Carrera-Kratman-ebook/dp/B00FY443IW\">Come and Take Them</a>, by Tom Kratman.</i></p><p>Tom Kratman’s Come and Take Them is an exciting continuation of his<br> Carreraverse series, and lays some interesting foundations for future<br> series developments. While it is possible to enjoy CATT on it’s own<br> merits, I recommend that readers read the rest of the series first, as I<br> will explain further into the review.</br></br></br></br></p><div></div><div class=\"separator\" style=\"clear: both; text-align: center;\"> <a href=\"http://www.amazon.com/Come-Take-Them-Carrera-Kratman-ebook/dp/B00FY443IW\" imageanchor=\"1\" style=\"clear: left; float: left; margin-bottom: 1em; margin-right: 1em;\"><noscript><img border=\"0\" decoding=\"async\" src=\"http://www.milobookclub.com/wp-content/uploads/2013/11/kratman05-1.jpg\"/></noscript><img border=\"0\" class=\"lazyload\" data-src=\"http://www.milobookclub.com/wp-content/uploads/2013/11/kratman05-1.jpg\" decoding=\"async\" src=\"data:image/svg+xml,%3Csvg%20xmlns=%22http://www.w3.org/2000/svg%22%20viewBox=%220%200%20210%20140%22%3E%3C/svg%3E\"/></a></div><div> <b>Prose: 7/10</b>  Competently done,<br> describes the action clearly concisely and with verisimilitude. There are<br> no particular passages that stand out as literary masterpieces. I<br> believe that this is a deliberate stylistic choice as the main concern<br> of the novel is to tell the story, and especially with this series,<br> convey the ideas therein. Since this novel is as much a polemic as a<br> story, and the author personally hates too clever by half literary<br> pretension, the prose is deliberately stripped down. Of particular value<br> is the description of combat, and it’s vagaries. Our society has fewer<br> and fewer people familiar with just how dangerous modern combat can be,<br> and far too many x box warriors who think a SEAL team can kill anything.<br> In it’s own way, the stripped down, economical use of language portrays<br> the difficulties combat more effectively by focusing on the<br> essentials. </br></br></br></br></br></br></br></br></br></br></br></br></br></div><div> <b>Plot: 6/10</b>  Above average, especially for<br> military technothriller/ military scifi. Things go wrong, the Good Guys<br> are not infallible, and the Bad Guys aren’t totally incompetent.<br> Mistakes are made on both sides, for understandable reasons. The<br> Balboans fail to anticipate an obvious antagonists’ attempt to seize<br> power, starting the war they wished to avoid. While things go generally<br> the way they want, serious errors are made that could have disastrous<br> repercussions. The Taurans, despite being arrogant, vain, and encumbered<br> by a sclerotic bureaucracy, are brave, tough and competent. and are<br> able to inflict serious damage on their adversaries. The twists and<br> somewhat telegraphed, and there are no major surprises, but it doesn’t<br> bog down anywhere, and enjoyable throughout.</br></br></br></br></br></br></br></br></br></br></br></div><div></div><div> <b>Characters 8/10</b>  Perhaps the author’s<br> strongest suit as a writer is the ability to create believable,<br> fallible characters. Every major character is complex, with<br> understandable motivations, emotions, and actions that flow logically<br> from those motivations. Each character also has strengths as well as<br> flaws. For instance, Raul Parilla the President of Balboa, is personally<br> brave, honest, and loyal, yet can be indecisive and overly cautious.<br> Admiral Wallenstein is sexually perverse, vain, and yet determined,<br> capable and politically savvy. No one side has a lock on virtue, or on<br> vice, and the conflict is heightened by the wholly believable goals and<br> motivations of the characters.</br></br></br></br></br></br></br></br></br></br></div><div></div><div> <b>Ideas 7/10</b>  Perhaps the least ideological<br> book the author has published, the Ideas developed earlier in the series<br> are worked out here in a more straight forward action oriented manner.<br> For instance the heavily ideological <i>Amazon Legion </i>was nearly all<br> polemic, and the action covered there in brief is treated with more<br> detail in this book. This however is still a Kratman book, and ideas are<br> always behind the scenes somewhere. Readers of VP do not need to be<br> told that our elites are perverse, vain, totalitarian, and humorless,<br> but others might yet have faith in them. Come and Take Them demolishes<br> that Faith rather effectively. The individual soldiers of Taurus are<br> portrayed in an almost wholly favorable light, brave, resourceful, and<br> tough. The leadership of Taurus, The Federated States, the Old Earth<br> Peace Fleet, and Balboas neighbors have none of the virtues associated<br> with maintaining civilization. This I think is the key to understanding<br> the whole series, and why I believe that this book and the associated<br> series are must reads for anyone interested in preserving civilization.</br></br></br></br></br></br></br></br></br></br></br></br></br></br></br></div><div></div><div> I rated the novel as 28/40, very good, but not a<br> Great Book. Why do I believe this series is a must read for all<br> civilized people? Simple, Tom Kratman is not primarily a novelist, he is<br> a pro civilizational polemicist whose chosen medium is novels. After<br> all Heinlein and Rand did more for libertarianism than any economics<br> text by Rothbard, despite Rothbard’s superior intellectual rigor.<br> Stories are the best way to reach the average person, and are far more<br> enjoyable than political tracts to read, so Tom tells stories.</br></br></br></br></br></br></br></div><div></div><div> Tom predicted US losses in the Middle East years ago, because we<br> refused to recognize the nature of our enemy and act accordingly. In <i>A<br> Desert Called Peace </br></i>and <i>Carnifex</i>, Tom show what an actual winning<br> strategy would look like, and shows further why our present elite are<br> unable to execute such a strategy for purely ideological reasons. In<br> addition, the decadence, sexual perversion, disloyalty, and arrogance of<br/> our bankster-political elite are on display throughout the series. Tom<br/> shows some familiarity with taboo topics such as HBD and the SMP which<br/> is refreshing.  </br></br></br></br></div><div></div><div> I don’t know if Tom is familiar with the Anon Conservative, but<br/> these books are a textbook of how to perform an amygdala hijack of<br/> leftist rabbits. Read negative Amazon reviews of <i>Amazon Legion </i>or<i> Watch on the Rhine. </i>Leftists<br/> literally can’t comprehend the book, engage with the ideas, or even<br/> begin to refute them. For instance through the whole series, some<br/> opposition soldiers are portrayed as brave, loyal and deserving of<br/> respect, even if their leaders aren’t. The Iraqi and Jihadis analogues<br/> are treated with more respect than the liberal progressive in the<br/> analogous US and EU, and they deserve it. </div><div></div><div> This of course terrifies rabbits because they themselves are<br/> neither brave or loyal, and if the wolves they depend upon to protect<br/> them, feed them, keep them warm and make thier stuff ever have enough,<br/> they are going to die, and they know it. Note that competence while<br/> desired, is not necessarily required to be worthy of in group loyalty.<br/> For instance, the legion takes care of the totally disabled and their<br/> families, at considerable expense, because they are members of the<br/> legion. The purely transactional relationships of the elite are shown to<br/> be ultimately hollow and worthless, as are our current rabbits promises<br/> and relationships. If you value civilization and want to preserve it,<br/> you can do yourself a favor and read the Carrera Series, or anything<br/> else by Tom Kratman.</div></div>",
  "content_text": "CK is the second to review\nCome and Take Them\n, by Tom Kratman.\nTom Kratman’s Come and Take Them is an exciting continuation of his\nCarreraverse series, and lays some interesting foundations for future\nseries developments. While it is possible to enjoy CATT on it’s own\nmerits, I recommend that readers read the rest of the series first, as I\nwill explain further into the review.\nProse: 7/10\nCompetently done,\ndescribes the action clearly concisely and with verisimilitude. There are\nno particular passages that stand out as literary masterpieces. I\nbelieve that this is a deliberate stylistic choice as the main concern\nof the novel is to tell the story, and especially with this series,\nconvey the ideas therein. Since this novel is as much a polemic as a\nstory, and the author personally hates too clever by half literary\npretension, the prose is deliberately stripped down. Of particular value\nis the description of combat, and it’s vagaries. Our society has fewer\nand fewer people familiar with just how dangerous modern combat can be,\nand far too many x box warriors who think a SEAL team can kill anything.\nIn it’s own way, the stripped down, economical use of language portrays\nthe difficulties combat more effectively by focusing on the\nessentials.\nPlot: 6/10\nAbove average, especially for\nmilitary technothriller/ military scifi. Things go wrong, the Good Guys\nare not infallible, and the Bad Guys aren’t totally incompetent.\nMistakes are made on both sides, for understandable reasons. The\nBalboans fail to anticipate an obvious antagonists’ attempt to seize\npower, starting the war they wished to avoid. While things go generally\nthe way they want, serious errors are made that could have disastrous\nrepercussions. The Taurans, despite being arrogant, vain, and encumbered\nby a sclerotic bureaucracy, are brave, tough and competent. and are\nable to inflict serious damage on their adversaries. The twists and\nsomewhat telegraphed, and there are no major surprises, but it doesn’t\nbog down anywhere, and enjoyable throughout.\nCharacters 8/10\nPerhaps the author’s\nstrongest suit as a writer is the ability to create believable,\nfallible characters. Every major character is complex, with\nunderstandable motivations, emotions, and actions that flow logically\nfrom those motivations. Each character also has strengths as well as\nflaws. For instance, Raul Parilla the President of Balboa, is personally\nbrave, honest, and loyal, yet can be indecisive and overly cautious.\nAdmiral Wallenstein is sexually perverse, vain, and yet determined,\ncapable and politically savvy. No one side has a lock on virtue, or on\nvice, and the conflict is heightened by the wholly believable goals and\nmotivations of the characters.\nIdeas 7/10\nPerhaps the least ideological\nbook the author has published, the Ideas developed earlier in the series\nare worked out here in a more straight forward action oriented manner.\nFor instance the heavily ideological\nAmazon Legion\nwas nearly all\npolemic, and the action covered there in brief is treated with more\ndetail in this book. This however is still a Kratman book, and ideas are\nalways behind the scenes somewhere. Readers of VP do not need to be\ntold that our elites are perverse, vain, totalitarian, and humorless,\nbut others might yet have faith in them. Come and Take Them demolishes\nthat Faith rather effectively. The individual soldiers of Taurus are\nportrayed in an almost wholly favorable light, brave, resourceful, and\ntough. The leadership of Taurus, The Federated States, the Old Earth\nPeace Fleet, and Balboas neighbors have none of the virtues associated\nwith maintaining civilization. This I think is the key to understanding\nthe whole series, and why I believe that this book and the associated\nseries are must reads for anyone interested in preserving civilization.\nI rated the novel as 28/40, very good, but not a\nGreat Book. Why do I believe this series is a must read for all\ncivilized people? Simple, Tom Kratman is not primarily a novelist, he is\na pro civilizational polemicist whose chosen medium is novels. After\nall Heinlein and Rand did more for libertarianism than any economics\ntext by Rothbard, despite Rothbard’s superior intellectual rigor.\nStories are the best way to reach the average person, and are far more\nenjoyable than political tracts to read, so Tom tells stories.\nTom predicted US losses in the Middle East years ago, because we\nrefused to recognize the nature of our enemy and act accordingly. In\nA\nDesert Called Peace\nand\nCarnifex\n, Tom show what an actual winning\nstrategy would look like, and shows further why our present elite are\nunable to execute such a strategy for purely ideological reasons. In\naddition, the decadence, sexual perversion, disloyalty, and arrogance of\nour bankster-political elite are on display throughout the series. Tom\nshows some familiarity with taboo topics such as HBD and the SMP which\nis refreshing.\nI don’t know if Tom is familiar with the Anon Conservative, but\nthese books are a textbook of how to perform an amygdala hijack of\nleftist rabbits. Read negative Amazon reviews of\nAmazon Legion\nor\nWatch on the Rhine.\nLeftists\nliterally can’t comprehend the book, engage with the ideas, or even\nbegin to refute them. For instance through the whole series, some\nopposition soldiers are portrayed as brave, loyal and deserving of\nrespect, even if their leaders aren’t. The Iraqi and Jihadis analogues\nare treated with more respect than the liberal progressive in the\nanalogous US and EU, and they deserve it.\nThis of course terrifies rabbits because they themselves are\nneither brave or loyal, and if the wolves they depend upon to protect\nthem, feed them, keep them warm and make thier stuff ever have enough,\nthey are going to die, and they know it. Note that competence while\ndesired, is not necessarily required to be worthy of in group loyalty.\nFor instance, the legion takes care of the totally disabled and their\nfamilies, at considerable expense, because they are members of the\nlegion. The purely transactional relationships of the elite are shown to\nbe ultimately hollow and worthless, as are our current rabbits promises\nand relationships. If you value civilization and want to preserve it,\nyou can do yourself a favor and read the Carrera Series, or anything\nelse by Tom Kratman.",
  "tags": [
    "Book Review",
    "Lions Den"
  ],
  "categories": [],
  "sitemap_lastmod": "2013-11-18T21:00:00+00:00"
}