{
  "url": "https://voxday.net/2013/11/04/hitting-gir/",
  "scraped_at": "2025-12-15T16:35:43.670892",
  "title": "Why do you make me hit you?",
  "date_display": "November 4, 2013",
  "date_iso": "2013-11-04T09:46:00+00:00",
  "date_from_url": "2013-11-04",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p><iframe allowfullscreen=\"\" frameborder=\"0\" height=\"360\" src=\"//www.youtube.com/embed/rRfCpQx_FDE?feature=player_detailpage\" width=\"640\"></iframe></p><p>A couple of observations. First, neither the woman nor the man knew how to box. Second, the woman was considerably tougher than I expected; she didn’t fold or go down after taking the first, second, or third shot. Third, this underlines what I’ve said about women being slow as molasses; not only can’t she touch an inexperienced guy, she can’t even block or evade his initial jabs! Fourth, people tend to forget that F=MA. Her punches don’t make contact because she is so slow, but even if they did, they wouldn’t do any damage.</p><p>Fifth and most importantly, notice the female mindset in action and how bizarre it looks from the male perspective. She knows nothing and learns nothing. She wildly overrates her own ability; an even moderately trained fighter would likely have knocked her out in the first exchange. She stubbornly continues after it is abundantly clear that she is in well over her head and the referee is manufacturing excuses for her to stop. Then, after being utterly humiliated, she doesn’t have the good grace to acknowledge the victor her superior.</p><p>This is exactly the mindset one sees from the Left in intellectual discourse here and elsewhere. They know nothing and learn nothing. They wildly overrate their own ability, don’t understand they are losing while in the very process of doing so, and then refuse to acknowledge they have been beaten despite thousands of people witnessing their defeat.</p><p>I have little doubt that tomorrow, the woman will be right back to bragging again about how she can beat any Marine on the base. That’s why you shouldn’t bother to reason with these people or attempt to convince them of anything. Just wait until the bell rings, then hit them in the face until you knock them out. Repeat as needed.</p><p>So let this be a warning to the usual suspects. No one has any interest in your performance art or whatever it is you think you are doing. If you are a troll or an anklebiter, any assertion you make will either be accompanied by your evidence supporting that assertion or it will be spammed. It doesn’t matter how many names you attempt to hide under, because if you do not present an actual argument in your comment every single time you attempt to criticize any post or anyone’s comment, your comments will end up in the spam filter.</p><p>No one has to agree with me. I welcome substantive criticism. I appreciate rational dissent. I enjoy genuine debate. Everyone is entirely free to have their own opinion, to express it, and to defend it. But there will be no more empty posturing, no more meaningless affectations of superiority, and no more insubstantial critiques that stand on nothing but hot air.</p><p>The constant <i>ad hominem</i> attempts to ritually cast me out are redundant. I am not part of your group, I never was, and I have nothing but pure contempt for your pathetic warrens. If you are working out the fear and rejection issues that stem from your shrunken amygdala, that’s understandable, but you’ll have to do it someplace else. This is not your in-group. You do not belong here, and you are not welcome here, because you have repeatedly demonstrated that you bring nothing of substance to the discourse.</p><p>This isn’t an echo chamber, but it also isn’t group therapy for leftists unsettled by reality.</p></div>",
  "content_text": "A couple of observations. First, neither the woman nor the man knew how to box. Second, the woman was considerably tougher than I expected; she didn’t fold or go down after taking the first, second, or third shot. Third, this underlines what I’ve said about women being slow as molasses; not only can’t she touch an inexperienced guy, she can’t even block or evade his initial jabs! Fourth, people tend to forget that F=MA. Her punches don’t make contact because she is so slow, but even if they did, they wouldn’t do any damage.\nFifth and most importantly, notice the female mindset in action and how bizarre it looks from the male perspective. She knows nothing and learns nothing. She wildly overrates her own ability; an even moderately trained fighter would likely have knocked her out in the first exchange. She stubbornly continues after it is abundantly clear that she is in well over her head and the referee is manufacturing excuses for her to stop. Then, after being utterly humiliated, she doesn’t have the good grace to acknowledge the victor her superior.\nThis is exactly the mindset one sees from the Left in intellectual discourse here and elsewhere. They know nothing and learn nothing. They wildly overrate their own ability, don’t understand they are losing while in the very process of doing so, and then refuse to acknowledge they have been beaten despite thousands of people witnessing their defeat.\nI have little doubt that tomorrow, the woman will be right back to bragging again about how she can beat any Marine on the base. That’s why you shouldn’t bother to reason with these people or attempt to convince them of anything. Just wait until the bell rings, then hit them in the face until you knock them out. Repeat as needed.\nSo let this be a warning to the usual suspects. No one has any interest in your performance art or whatever it is you think you are doing. If you are a troll or an anklebiter, any assertion you make will either be accompanied by your evidence supporting that assertion or it will be spammed. It doesn’t matter how many names you attempt to hide under, because if you do not present an actual argument in your comment every single time you attempt to criticize any post or anyone’s comment, your comments will end up in the spam filter.\nNo one has to agree with me. I welcome substantive criticism. I appreciate rational dissent. I enjoy genuine debate. Everyone is entirely free to have their own opinion, to express it, and to defend it. But there will be no more empty posturing, no more meaningless affectations of superiority, and no more insubstantial critiques that stand on nothing but hot air.\nThe constant\nad hominem\nattempts to ritually cast me out are redundant. I am not part of your group, I never was, and I have nothing but pure contempt for your pathetic warrens. If you are working out the fear and rejection issues that stem from your shrunken amygdala, that’s understandable, but you’ll have to do it someplace else. This is not your in-group. You do not belong here, and you are not welcome here, because you have repeatedly demonstrated that you bring nothing of substance to the discourse.\nThis isn’t an echo chamber, but it also isn’t group therapy for leftists unsettled by reality.",
  "tags": [
    "anklebiters"
  ],
  "categories": [],
  "sitemap_lastmod": "2013-11-04T09:46:00+00:00"
}