{
  "url": "https://voxday.net/2013/11/24/lions-den-vii-kiti-lappi/",
  "scraped_at": "2025-12-15T16:37:50.255657",
  "title": "Lions Den VII: Kiti Lappi",
  "date_display": "November 24, 2013",
  "date_iso": "2013-11-24T14:00:00+00:00",
  "date_from_url": "2013-11-24",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p><i></i><i>In addition to providing attention to standout authors who are already established writers, it has always been my objective for Lions Den to give a modicum of exposure to independent authors, particularly those who read this blog and are willing to avail themselves of the chance to have their books criticized by impartial reviewers.  So, I’d encourage you to get involved in reviewing the new authors as well, and to be very blunt and forthright with your criticism so they can learn how to improve their writing. Don’t be cruel or seek to provide amusement at their expense, nor handle them with kid gloves to spare their feelings. And whether you are praising them or slamming them, also show them an amount of respect for being willing to take the heat in a public manner.</i></p><p><i>Thanks, we now have the requisite three reviewers for <b><a href=\"http://www.amazon.com/Escape-Tekmar-Kiti-Lappi-ebook/dp/B00GV4YO2O/ref=sr_1_3?s=books&amp;ie=UTF8&amp;qid=1385214150&amp;sr=1-3&amp;keywords=kiti+lappi\">Escape From Tekmar</a></b></i>.</p><p>First, I want to thank Vox for giving me this opportunity. Maybe it’s an<br> opportunity to hang myself, who knows, but I’m grateful anyway.</br></p><div class=\"separator\" style=\"clear: both; text-align: center;\"> <a href=\"http://ecx.images-amazon.com/images/I/512kr0s5EUL._BO2,204,203,200_PIsitb-sticker-arrow-click,TopRight,35,-76_AA278_PIkin4,BottomRight,-56,22_AA300_SH20_OU01_.jpg\" imageanchor=\"1\" style=\"clear: left; float: left; margin-bottom: 1em; margin-right: 1em;\"><noscript><img border=\"0\" decoding=\"async\" src=\"http://ecx.images-amazon.com/images/I/512kr0s5EUL._BO2,204,203,200_PIsitb-sticker-arrow-click,TopRight,35,-76_AA278_PIkin4,BottomRight,-56,22_AA300_SH20_OU01_.jpg\"/></noscript><img border=\"0\" class=\"lazyload\" data-src=\"http://ecx.images-amazon.com/images/I/512kr0s5EUL._BO2,204,203,200_PIsitb-sticker-arrow-click,TopRight,35,-76_AA278_PIkin4,BottomRight,-56,22_AA300_SH20_OU01_.jpg\" decoding=\"async\" src=\"data:image/svg+xml,%3Csvg%20xmlns=%22http://www.w3.org/2000/svg%22%20viewBox=%220%200%20210%20140%22%3E%3C/svg%3E\"/></a></div><p>Maybe<br> I ought to tell a bit about myself first. I’m, in some ways, pretty<br> much like one of the caricatures for a liberal woman – fat middle aged<br> nerdy spinster who keeps cats and never found a man to have children<br> with, and people usually seem to automatically put me in that box,<br> somebody who donates to Greenpeace and marches for gay rights (okay,<br> that I might do if it was in support of, say, Iranian gays). But I’d<br> prefer being free even if I’m not quite sure whether I would be able to<br> handle it, I haven’t done exactly well with my life as things are (I<br> have lived my whole life in Finland. This country tilts pretty far left,<br> and I have to admit I don’t know what actual freedom might be like. We<br> are either somewhat coddled or somewhat smothered here, take your pick.<br> Or maybe take both.).</br></br></br></br></br></br></br></br></br></br></br></br></p><p>I enjoy creating stories, it’s something I<br> have been doing my whole life, so whether I can turn writing into a<br> source of income or not doesn’t really matter that much<br> on one level, I will keep on writing anyway. But when I finally caught<br> on about the ebook revolution it made sense to see if they might even<br> sell. On the other hand, if I am good enough that I might get where I<br> could live on it, especially if it might turn into something I could<br> make a good enough a living with that I’d be able to move somewhere with<br> more sun, well, time (seasonal affective disorder, I belong to the<br> small percentage who does get it bad so I could definitely use more sun,<br> problem with moving: SAD also derailed all my attempts to study when I<br> was younger, and while young manual laborers can get work aging ones are<br> not in great demand anywhere).</br></br></br></br></br></br></br></br></br></br></br></br></p><p>I am somewhat past 50 already,<br> and it would really suck if I actually happened to be good enough to<br> become popular only for that to happen around the time when I need a<br> wheelchair to go around. So in spite of being a coward I figured it<br> might be time to start taking some chances in hopes I<br> might speed things up a bit. Including this one.</br></br></br></br></br></p><p>I know this<br> may have been an idiotic thing to do since I don’t know, not really, how<br> well I write, and the end result could be getting this novel<br> eviscerated. The eviscerations I have read on Vox’s blog have been<br> enjoyable but I guess I would not like having one of my stories being<br> the subject of one. But the one thing I’m sure of is that I will not<br> have any success with anything which would require a sustained effort<br> throughout the year. Not this far north. Believe me, I have tried. And I<br> hate the idea of spending my entire life as a total loser. So what the<br> hell, might as well try. I don’t have that much to lose. Some pride,<br> maybe, but not much else.</br></br></br></br></br></br></br></br></br></br></p><p>The novel is a pretty simple story, an<br> adventure in which a young man finds himself solely responsible for<br> something important for the first time in his life. There is a girl who<br> is perhaps not telling him everything, and a world which is not<br> very nice.</br></br></br></br></p><p>I have had these characters for a long time, and<br> have some half planned stories of when the main character in this is a<br> full adult, but I felt I wanted to start with a few of how he became<br> that man. As said, no real idea of the quality, during the last weeks I<br> have gone from ‘ohmygod it’s awful’ to ‘hey, it’s pretty good’ and back<br> already. Can be damn hard to judge your own work.</br></br></br></br></br></p><p>It’s science<br> fiction, but more of the space opera kind, meaning what ‘science’ there<br> may be is at best rather fluffy. But we do have starships, colony worlds<br> which have been created by terraforming, and genetically engineered<br> humans, so I guess the genre is science fiction.</br></br></br></br></p><p>This is the<br> first time I have dared to try a male main protagonist. I have written<br> two novels with female main characters before (they can be found on<br> Amazon if you look for Kiti Lappi in Kindle books, along with a few<br> short stories). Frankly, I’m not sure how well I get<br> men, while I have worked in a mostly male work environments and have<br> had a couple of friends I have never had any really close ones in my<br> life.</br></br></br></br></br></br></br></p><p>Breaking expectations is one thing I like as a reader, so I<br> have attempted to do that a bit with the universe of this story, if not<br> so much with the plot or the characters. No idea if I have succeeded,<br> especially since this is just a first small slice of something bigger. I<br> have every intention of exploring this universe more.</br></br></br></br></p><p>Well, if<br> you read the story and think I’m the next coming of Bulwer-Lytton just<br/> go ahead and say so, if I am I need to know (should perhaps adjust my<br/> strategy of how to try selling my stories). But if so I would of course<br/> appreciate if you say it politely, after all I’m not claiming to be<br/> anything I’m not. But it won’t make me stop writing, telling stories is a<br/> compulsion I have never been able to get rid of (I have tried). And<br/> besides, you’ll never know. After all, good old<br/> Bulwer-Lytton was a bestseller once. </br></p></div>",
  "content_text": "In addition to providing attention to standout authors who are already established writers, it has always been my objective for Lions Den to give a modicum of exposure to independent authors, particularly those who read this blog and are willing to avail themselves of the chance to have their books criticized by impartial reviewers.  So, I’d encourage you to get involved in reviewing the new authors as well, and to be very blunt and forthright with your criticism so they can learn how to improve their writing. Don’t be cruel or seek to provide amusement at their expense, nor handle them with kid gloves to spare their feelings. And whether you are praising them or slamming them, also show them an amount of respect for being willing to take the heat in a public manner.\nThanks, we now have the requisite three reviewers for\nEscape From Tekmar\n.\nFirst, I want to thank Vox for giving me this opportunity. Maybe it’s an\nopportunity to hang myself, who knows, but I’m grateful anyway.\nMaybe\nI ought to tell a bit about myself first. I’m, in some ways, pretty\nmuch like one of the caricatures for a liberal woman – fat middle aged\nnerdy spinster who keeps cats and never found a man to have children\nwith, and people usually seem to automatically put me in that box,\nsomebody who donates to Greenpeace and marches for gay rights (okay,\nthat I might do if it was in support of, say, Iranian gays). But I’d\nprefer being free even if I’m not quite sure whether I would be able to\nhandle it, I haven’t done exactly well with my life as things are (I\nhave lived my whole life in Finland. This country tilts pretty far left,\nand I have to admit I don’t know what actual freedom might be like. We\nare either somewhat coddled or somewhat smothered here, take your pick.\nOr maybe take both.).\nI enjoy creating stories, it’s something I\nhave been doing my whole life, so whether I can turn writing into a\nsource of income or not doesn’t really matter that much\non one level, I will keep on writing anyway. But when I finally caught\non about the ebook revolution it made sense to see if they might even\nsell. On the other hand, if I am good enough that I might get where I\ncould live on it, especially if it might turn into something I could\nmake a good enough a living with that I’d be able to move somewhere with\nmore sun, well, time (seasonal affective disorder, I belong to the\nsmall percentage who does get it bad so I could definitely use more sun,\nproblem with moving: SAD also derailed all my attempts to study when I\nwas younger, and while young manual laborers can get work aging ones are\nnot in great demand anywhere).\nI am somewhat past 50 already,\nand it would really suck if I actually happened to be good enough to\nbecome popular only for that to happen around the time when I need a\nwheelchair to go around. So in spite of being a coward I figured it\nmight be time to start taking some chances in hopes I\nmight speed things up a bit. Including this one.\nI know this\nmay have been an idiotic thing to do since I don’t know, not really, how\nwell I write, and the end result could be getting this novel\neviscerated. The eviscerations I have read on Vox’s blog have been\nenjoyable but I guess I would not like having one of my stories being\nthe subject of one. But the one thing I’m sure of is that I will not\nhave any success with anything which would require a sustained effort\nthroughout the year. Not this far north. Believe me, I have tried. And I\nhate the idea of spending my entire life as a total loser. So what the\nhell, might as well try. I don’t have that much to lose. Some pride,\nmaybe, but not much else.\nThe novel is a pretty simple story, an\nadventure in which a young man finds himself solely responsible for\nsomething important for the first time in his life. There is a girl who\nis perhaps not telling him everything, and a world which is not\nvery nice.\nI have had these characters for a long time, and\nhave some half planned stories of when the main character in this is a\nfull adult, but I felt I wanted to start with a few of how he became\nthat man. As said, no real idea of the quality, during the last weeks I\nhave gone from ‘ohmygod it’s awful’ to ‘hey, it’s pretty good’ and back\nalready. Can be damn hard to judge your own work.\nIt’s science\nfiction, but more of the space opera kind, meaning what ‘science’ there\nmay be is at best rather fluffy. But we do have starships, colony worlds\nwhich have been created by terraforming, and genetically engineered\nhumans, so I guess the genre is science fiction.\nThis is the\nfirst time I have dared to try a male main protagonist. I have written\ntwo novels with female main characters before (they can be found on\nAmazon if you look for Kiti Lappi in Kindle books, along with a few\nshort stories). Frankly, I’m not sure how well I get\nmen, while I have worked in a mostly male work environments and have\nhad a couple of friends I have never had any really close ones in my\nlife.\nBreaking expectations is one thing I like as a reader, so I\nhave attempted to do that a bit with the universe of this story, if not\nso much with the plot or the characters. No idea if I have succeeded,\nespecially since this is just a first small slice of something bigger. I\nhave every intention of exploring this universe more.\nWell, if\nyou read the story and think I’m the next coming of Bulwer-Lytton just\ngo ahead and say so, if I am I need to know (should perhaps adjust my\nstrategy of how to try selling my stories). But if so I would of course\nappreciate if you say it politely, after all I’m not claiming to be\nanything I’m not. But it won’t make me stop writing, telling stories is a\ncompulsion I have never been able to get rid of (I have tried). And\nbesides, you’ll never know. After all, good old\nBulwer-Lytton was a bestseller once.",
  "tags": [
    "Lions Den"
  ],
  "categories": [],
  "sitemap_lastmod": "2013-11-24T14:00:00+00:00"
}