{
  "url": "https://voxday.net/2013/11/12/live-by-sword-die-by-sword/",
  "scraped_at": "2025-12-15T16:36:37.196362",
  "title": "Live by the sword, die by the sword",
  "date_display": "November 12, 2013",
  "date_iso": "2013-11-12T21:30:00+00:00",
  "date_from_url": "2013-11-12",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p><a href=\"http://www.myfoxdc.com/story/23942190/air-force-sexual-harassment-enforcement-head-faces-sexual-assault-charges\">A fitting end</a> to an inglorious military career:</p><blockquote class=\"tr_bq\"><p> The man in charge of the Air Force’s sexual-harassment enforcement<br> was himself indicted on a sexual assault charge in an Arlington court<br> Monday. Lieutenant-Colonel Jeffrey Krusinki was arrested back in May for allegedly groping a woman in Arlington. She claims he grabbed her breasts and buttocks in a parking lot in Crystal City.</br></br></p></blockquote><p>It will be amusing when McRapey and McCreepy find themselves similarly hoist on their own petards, will it not? Even if they don’t do anything to deserve it, it’s just a matter of time before someone finds it in her interest to launch an accusation or two.</p><p>It’s inevitable. Why? Voltaire’s Prayer. Consider the following evidence:</p><p>Wil Wheaton ‏@wilw <br> Cat: I love you so much!. Me: Aww. I love you, too. Cat: Feed me. Me: I already fed you. Cat: Feed me again. Me: Um, no. Cat: I hate you.</br></p><p>UPDATE: Well, that was quicker than expected. Remember when I said that Alpha Game would eventually pass up Whatever too?</p><p><b>scalzi.com</b><br> 47,446 USA Rank</br></p><p><b>alphagameplan.blogspot.com</b><br> 46,497 USA Rank</br></p><p>In truth, this is more an indictment of the Alexa ranking system than anything else; the biggest and most importantest science fiction site ever still gets more monthly pageviews than Alpha Game’s 349,623 monthly average. But I find the comparative rankings to be more than a little amusing in light of the rabbits who appealed to these sorts of estimated traffic rankings less than a year ago.</p></div>",
  "content_text": "A fitting end\nto an inglorious military career:\nThe man in charge of the Air Force’s sexual-harassment enforcement\nwas himself indicted on a sexual assault charge in an Arlington court\nMonday. Lieutenant-Colonel Jeffrey Krusinki was arrested back in May for allegedly groping a woman in Arlington. She claims he grabbed her breasts and buttocks in a parking lot in Crystal City.\nIt will be amusing when McRapey and McCreepy find themselves similarly hoist on their own petards, will it not? Even if they don’t do anything to deserve it, it’s just a matter of time before someone finds it in her interest to launch an accusation or two.\nIt’s inevitable. Why? Voltaire’s Prayer. Consider the following evidence:\nWil Wheaton ‏@wilw\nCat: I love you so much!. Me: Aww. I love you, too. Cat: Feed me. Me: I already fed you. Cat: Feed me again. Me: Um, no. Cat: I hate you.\nUPDATE: Well, that was quicker than expected. Remember when I said that Alpha Game would eventually pass up Whatever too?\nscalzi.com\n47,446 USA Rank\nalphagameplan.blogspot.com\n46,497 USA Rank\nIn truth, this is more an indictment of the Alexa ranking system than anything else; the biggest and most importantest science fiction site ever still gets more monthly pageviews than Alpha Game’s 349,623 monthly average. But I find the comparative rankings to be more than a little amusing in light of the rabbits who appealed to these sorts of estimated traffic rankings less than a year ago.",
  "tags": [
    "freakshow",
    "McRapey"
  ],
  "categories": [],
  "sitemap_lastmod": "2013-11-12T21:30:00+00:00"
}