{
  "url": "https://voxday.net/2013/11/20/mailvox-studying-christianity/",
  "scraped_at": "2025-12-15T16:37:28.458816",
  "title": "Mailvox: studying Christianity",
  "date_display": "November 20, 2013",
  "date_iso": "2013-11-20T18:00:00+00:00",
  "date_from_url": "2013-11-20",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><div> LC asks for reading recommendations to learn more about Christianity:</div><blockquote class=\"tr_bq\"><div> I read your book, <i>The Irrational Atheist</i>, and I have been reading<br> your blog for a few months now because I find most of what you say<br> interesting and some of it comforting. I was raised by Christian<br> parents. I am young, 21, and have recently gone through a questioning of<br> my faith.  I have re-committed myself to my beliefs and living in a way<br> that has resulted in a good life. I have realized that I still have the<br> faith of my childhood and my understanding of Christianity and the<br> world in general is very limited. I always have respect for your<br> arguments because you know what you’re talking about and back up your<br> assertions. Can you please give me some direction on texts to study<br> other than the Bible to increase my understanding of Christianity and<br> religion in general? </br></br></br></br></br></br></br></br></br></br></br></div></blockquote><div> First of all, remember not to get too caught up in the theological extrapolations. No matter what you end up reading, it is always worthwhile to periodically circle back to the original source. Don’t neglect reading the Bible in favor of various men’s interpretations of what the Bible says. In the end, theology is nothing more than philosophy derived from the Bible and it is no more intrinsically reliable than any other logical derivation.<p>I would start at the beginning. If your understanding is limited, begin with <i>The Chronicles of Narnia</i>. As we saw in the debate with Luke of Common Sense Atheism, the average grasp of Christian concepts don’t even rise to the level of Narnia. Then read <i>The Tower of Geburah</i> by John White. Once you’ve read the children’s fiction, move onto simple theology like <i>Mere Christianity</i> by CS Lewis and <i>Orthodoxy</i> by GK Chesterton. As a general rule, it’s hard to go too far afield on a foundation of Lewis and Chesterton. I would also recommend the very short, very simple, but intriguing <i>A Defense of the Revelation</i> by Leonhard Euler, who happens to be one of the most legendary mathematicians in history. And my friend Greg Boyd’s <i>Letters to a Skeptic</i> is also recommended.</p></div><div></div><div> Once you have a grasp of the theological basics, you may be ready to read up on the actual history of Christianity and some of its leading thinkers. The first volume of the Cambridge Medieval History series, <i>The Christian Empire</i>, is tremendously informative and the epub is freely available for download online. St. Augustine’s <i>Confessions </i>are worth reading for their influence on Western thinking and a good summary of Thomas Aquinas is a necessity as well. I haven’t read it yet, but I have heard very good things about Edward Feser’s <i>Aquinas: A Beginner’s Guide</i> and I intend to review it as soon as I finish the Cantillon.<p>Any other reasonable recommendations would be welcome. Please note that this is not the right sort of post to either indulge your particular theological peculiarities or exhibit how esoteric your reading happens to have been. We’re talking Christianity 101, not 503.</p></div></div>",
  "content_text": "LC asks for reading recommendations to learn more about Christianity:\nI read your book,\nThe Irrational Atheist\n, and I have been reading\nyour blog for a few months now because I find most of what you say\ninteresting and some of it comforting. I was raised by Christian\nparents. I am young, 21, and have recently gone through a questioning of\nmy faith.  I have re-committed myself to my beliefs and living in a way\nthat has resulted in a good life. I have realized that I still have the\nfaith of my childhood and my understanding of Christianity and the\nworld in general is very limited. I always have respect for your\narguments because you know what you’re talking about and back up your\nassertions. Can you please give me some direction on texts to study\nother than the Bible to increase my understanding of Christianity and\nreligion in general?\nFirst of all, remember not to get too caught up in the theological extrapolations. No matter what you end up reading, it is always worthwhile to periodically circle back to the original source. Don’t neglect reading the Bible in favor of various men’s interpretations of what the Bible says. In the end, theology is nothing more than philosophy derived from the Bible and it is no more intrinsically reliable than any other logical derivation.\nI would start at the beginning. If your understanding is limited, begin with\nThe Chronicles of Narnia\n. As we saw in the debate with Luke of Common Sense Atheism, the average grasp of Christian concepts don’t even rise to the level of Narnia. Then read\nThe Tower of Geburah\nby John White. Once you’ve read the children’s fiction, move onto simple theology like\nMere Christianity\nby CS Lewis and\nOrthodoxy\nby GK Chesterton. As a general rule, it’s hard to go too far afield on a foundation of Lewis and Chesterton. I would also recommend the very short, very simple, but intriguing\nA Defense of the Revelation\nby Leonhard Euler, who happens to be one of the most legendary mathematicians in history. And my friend Greg Boyd’s\nLetters to a Skeptic\nis also recommended.\nOnce you have a grasp of the theological basics, you may be ready to read up on the actual history of Christianity and some of its leading thinkers. The first volume of the Cambridge Medieval History series,\nThe Christian Empire\n, is tremendously informative and the epub is freely available for download online. St. Augustine’s\nConfessions\nare worth reading for their influence on Western thinking and a good summary of Thomas Aquinas is a necessity as well. I haven’t read it yet, but I have heard very good things about Edward Feser’s\nAquinas: A Beginner’s Guide\nand I intend to review it as soon as I finish the Cantillon.\nAny other reasonable recommendations would be welcome. Please note that this is not the right sort of post to either indulge your particular theological peculiarities or exhibit how esoteric your reading happens to have been. We’re talking Christianity 101, not 503.",
  "tags": [
    "Christianity",
    "mailvox"
  ],
  "categories": [],
  "sitemap_lastmod": "2013-11-20T18:00:00+00:00"
}