{
  "url": "https://voxday.net/2013/11/16/mailvox-sffs-transideological-malaise/",
  "scraped_at": "2025-12-15T16:37:03.666284",
  "title": "Mailvox: SF/F’s transideological malaise",
  "date_display": "November 16, 2013",
  "date_iso": "2013-11-16T18:00:00+00:00",
  "date_from_url": "2013-11-16",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>It appears it is not only right-wing conservatives, libertarian extremists and Bible-thumping god-botherers who are thoroughly sick of the meatless, mindless, scalzified SF/F that is being pushed on them by the genre publishers:</p><blockquote class=\"tr_bq\"><p> I am on the opposite end of the political spectrum from you. I am a Marxist and an atheist, but I didn’t come here to debate politics or religion. Anyway, last year I started writing seriously and I thought I should get out there on the web and see what the “scene” is about right now, sci/fi and fantasy writers and markets and new fiction, especially short fiction. I constantly read sci/fi and fanstasy, but mostly from my collection of old paperbacks, Vance, Herbert, Howard, etc… I read just as much non-fiction from my local library. So I put my finger on the pulse. The experience was disheartening. New short fiction seems to place innovation over all other qualities possible in a particular piece, which means my desire to read a good story is likely to go unsatisfied. Also, the “scene” is completely preoccupied with identity.</p><p>And of course, I happened upon the Scalzi/Vox feud. I checked out both blogs. The verdict: Scalzi – rather dull and typical upper middle class views, Vox – incendiary but rigorous, consistent, and most importantly, often funny. As a Marxist I can’t resist good polemic, even from the other side.  I lurk about once a month.</p><p>Let me backtrack with a little explanation. Some people out there, perhaps not you, may confuse my radical leftism with the stuff going on out there. They would be wrong. As a Marxist, for me it is class, class, class. Class trumps race, gender, everything. Its all about wealth. The fact that “old white men” are holding alot of it is due to historical forces, not from their “whiteness”. In the 60’s and 70’s, the leftist preoccupation with class was replaced with race and gender issues, to the detriment of all concerned.  Old news, just spelling it out here for clarity’s sake.</p><p>So we get to now, and race and gender obsessed “liberal progressives” are such a harmful force in society that I, an actual socialist revolutionary, can enjoy you tormenting them on your blog, even though your political perspective is rooted in basic assumptions that are opposite my own. Strange days indeed. For liberal progressives, this would indicate I am a sexist racist, but as a white male I am already on their shitlist so whatever. I am a Marxist. I believe I am fighting the good fight. I am not going to get on my knees and lick boot, hoping for “ally” status. Eff that. The whole thing is a bizarre repackaging of original sin.</p><p>So when you put The Last Witchking out there for free, I thought why not and downloaded it. When it came up in the queue I dived in and I was floored. The stories were excellent. They entertained me. What else can I say? Opera Vita was incredible. There was a poignancy there I was not expecting. Suffused throughout is a certain ephemeral beauty, stately and linked with mortality. The subtlety belies tropes about limitations of the “male perspective” that are bandied about when the writing community weighs in on gender.  I haven’t seen religion done so convincingly and movingly in the genre since Herbert. I went ahead and read Magic Broken and enjoyed it thoroughly and then pulled the trigger on Throne for five bucks and now I am enjoying that.</p><p>It is really remarkable that your apparent congenital disorder, the inability to shut up or even tone it down, has disbarred you from the typical path to success as a writer.  I guess there is hope. I found your work via your soapbox. Despite my predilections toward the radical, I never let politics get in the way of personal relationships and now I have to add that it can’t dissuade me from enjoying fiction I like. Thanks for the books. I am hooked on Selenoth now, the antidote for my genre malaise. Please make it your goal to churn out volumes of the stuff for readers like me trying to survive this long winter.</p></blockquote><p>That an avowed Marxist would enjoy my fiction is less surprising than it might sound. I am, after all, a radical, merely one with very different assumptions and objectives. And I’ve always gotten along much better with the hard left than with the soft, squishy, bourgeois progressive left; one of my independent studies was done under a hardcore Canadian socialist who regarded McDonalds as the capitalist devil incarnate.</p><p>Of course, this may be because the hard left is about the only group that hates the progressive left more than I do. One of the great satisfactions about being on the right-wing is the knowledge that even if we lose and the revolution finally arrives in its fullness, the useful idiots are going to be the first ones lined up against the wall and shot. And who can look at the way Wall Street has been raping the country and not feel <a href=\"http://www.youtube.com/watch?v=yge311sFhC8\">the urge to raise a revolutionary flag</a>; if that is capitalism, then I don’t want any part of it and I’m a libertarian!</p><p>But besides our obvious ideological and religious differences, I have to take some issue with the writer’s idea that it is my unwillingness to cower before the PC gods of publishing that have prevented me from following the conventional path. While my notoriety would presumably have made it easier for them to decline to publish me – which is theoretical anyhow because I do not have an agent and I have never submitted my work for publication to any of the various genre publishing houses – this actually has the situation backwards.</p><p>One reason that I have been so uncompromising and so unwilling to play along with the progressives is because I have known from the start that the substance of my fiction would prevent the mainstream publishers from publishing it. And I also knew I had no interest in writing the sort of tedious political crap they wanted to publish. So, there was no reason to muzzle myself because I knew there was no chance that they would publish books like <i>The Chronicles of King David </i>or <i>Summa Elvetica</i> no matter what I did or did not say. I can’t pose as either a hero or a victim because I never had anything to lose in that regard.</p><p>In fact, I consider myself incredibly lucky to not only have such strong support from intelligent readers across religious and ideological lines, but to be writing at a time when the gatekeepers are so impotent. All of us who write should be deeply grateful, whether it is to God or to History and the class struggle, to be alive at such a fascinating time! To be able to write exactly what one wants and be able to make it readily available to those who are potentially interested in it is all that any writer can really ask for. Anything beyond that is icing on the cake.</p></div>",
  "content_text": "It appears it is not only right-wing conservatives, libertarian extremists and Bible-thumping god-botherers who are thoroughly sick of the meatless, mindless, scalzified SF/F that is being pushed on them by the genre publishers:\nI am on the opposite end of the political spectrum from you. I am a Marxist and an atheist, but I didn’t come here to debate politics or religion. Anyway, last year I started writing seriously and I thought I should get out there on the web and see what the “scene” is about right now, sci/fi and fantasy writers and markets and new fiction, especially short fiction. I constantly read sci/fi and fanstasy, but mostly from my collection of old paperbacks, Vance, Herbert, Howard, etc… I read just as much non-fiction from my local library. So I put my finger on the pulse. The experience was disheartening. New short fiction seems to place innovation over all other qualities possible in a particular piece, which means my desire to read a good story is likely to go unsatisfied. Also, the “scene” is completely preoccupied with identity.\nAnd of course, I happened upon the Scalzi/Vox feud. I checked out both blogs. The verdict: Scalzi – rather dull and typical upper middle class views, Vox – incendiary but rigorous, consistent, and most importantly, often funny. As a Marxist I can’t resist good polemic, even from the other side.  I lurk about once a month.\nLet me backtrack with a little explanation. Some people out there, perhaps not you, may confuse my radical leftism with the stuff going on out there. They would be wrong. As a Marxist, for me it is class, class, class. Class trumps race, gender, everything. Its all about wealth. The fact that “old white men” are holding alot of it is due to historical forces, not from their “whiteness”. In the 60’s and 70’s, the leftist preoccupation with class was replaced with race and gender issues, to the detriment of all concerned.  Old news, just spelling it out here for clarity’s sake.\nSo we get to now, and race and gender obsessed “liberal progressives” are such a harmful force in society that I, an actual socialist revolutionary, can enjoy you tormenting them on your blog, even though your political perspective is rooted in basic assumptions that are opposite my own. Strange days indeed. For liberal progressives, this would indicate I am a sexist racist, but as a white male I am already on their shitlist so whatever. I am a Marxist. I believe I am fighting the good fight. I am not going to get on my knees and lick boot, hoping for “ally” status. Eff that. The whole thing is a bizarre repackaging of original sin.\nSo when you put The Last Witchking out there for free, I thought why not and downloaded it. When it came up in the queue I dived in and I was floored. The stories were excellent. They entertained me. What else can I say? Opera Vita was incredible. There was a poignancy there I was not expecting. Suffused throughout is a certain ephemeral beauty, stately and linked with mortality. The subtlety belies tropes about limitations of the “male perspective” that are bandied about when the writing community weighs in on gender.  I haven’t seen religion done so convincingly and movingly in the genre since Herbert. I went ahead and read Magic Broken and enjoyed it thoroughly and then pulled the trigger on Throne for five bucks and now I am enjoying that.\nIt is really remarkable that your apparent congenital disorder, the inability to shut up or even tone it down, has disbarred you from the typical path to success as a writer.  I guess there is hope. I found your work via your soapbox. Despite my predilections toward the radical, I never let politics get in the way of personal relationships and now I have to add that it can’t dissuade me from enjoying fiction I like. Thanks for the books. I am hooked on Selenoth now, the antidote for my genre malaise. Please make it your goal to churn out volumes of the stuff for readers like me trying to survive this long winter.\nThat an avowed Marxist would enjoy my fiction is less surprising than it might sound. I am, after all, a radical, merely one with very different assumptions and objectives. And I’ve always gotten along much better with the hard left than with the soft, squishy, bourgeois progressive left; one of my independent studies was done under a hardcore Canadian socialist who regarded McDonalds as the capitalist devil incarnate.\nOf course, this may be because the hard left is about the only group that hates the progressive left more than I do. One of the great satisfactions about being on the right-wing is the knowledge that even if we lose and the revolution finally arrives in its fullness, the useful idiots are going to be the first ones lined up against the wall and shot. And who can look at the way Wall Street has been raping the country and not feel\nthe urge to raise a revolutionary flag\n; if that is capitalism, then I don’t want any part of it and I’m a libertarian!\nBut besides our obvious ideological and religious differences, I have to take some issue with the writer’s idea that it is my unwillingness to cower before the PC gods of publishing that have prevented me from following the conventional path. While my notoriety would presumably have made it easier for them to decline to publish me – which is theoretical anyhow because I do not have an agent and I have never submitted my work for publication to any of the various genre publishing houses – this actually has the situation backwards.\nOne reason that I have been so uncompromising and so unwilling to play along with the progressives is because I have known from the start that the substance of my fiction would prevent the mainstream publishers from publishing it. And I also knew I had no interest in writing the sort of tedious political crap they wanted to publish. So, there was no reason to muzzle myself because I knew there was no chance that they would publish books like\nThe Chronicles of King David\nor\nSumma Elvetica\nno matter what I did or did not say. I can’t pose as either a hero or a victim because I never had anything to lose in that regard.\nIn fact, I consider myself incredibly lucky to not only have such strong support from intelligent readers across religious and ideological lines, but to be writing at a time when the gatekeepers are so impotent. All of us who write should be deeply grateful, whether it is to God or to History and the class struggle, to be alive at such a fascinating time! To be able to write exactly what one wants and be able to make it readily available to those who are potentially interested in it is all that any writer can really ask for. Anything beyond that is icing on the cake.",
  "tags": [
    "mailvox",
    "Selenoth",
    "writing"
  ],
  "categories": [],
  "sitemap_lastmod": "2013-11-16T18:00:00+00:00"
}