{
  "url": "https://voxday.net/2013/11/26/mailvox-you-talking-to-me/",
  "scraped_at": "2025-12-15T16:38:01.215522",
  "title": "Mailvox: you talking to ME?",
  "date_display": "November 26, 2013",
  "date_iso": "2013-11-26T09:32:00+00:00",
  "date_from_url": "2013-11-26",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>Serge Tomiko is a rather strange anklebiter who enjoys informing me that I know absolutely nothing about economics, which statement is inevitably followed by an economics-related assertion that indicates he has read the appropriate material, but he hasn’t understood it. He’s very much like Kevin Cline in <i>A Fish Called Wanda</i>; the last time he showed up, he failed to understand that the graph he was citing to dispute my contention was charting the data from the very same Federal Reserve report I had cited in the first place.</p><p>This time he felt the need to “correct” my factual statement that deposits are unsecured loans from the depositor to the bank:</p><blockquote class=\"tr_bq\"><p> Once again, Vox shows he is absolutely clueless about how banking functions. Deposits are NOT loans to the bank. Banks do not in any way require deposits. It is a service they provide.</p><p>Banks create money by the authority of the government, which is given to entities in exchange for interest payments. They do not lend money. In this case, the banks are being perfectly honest. It doesn’t matter in the slightest whether or not they have deposits. In fact, this kind of policy is intended to discourage deposits. </p></blockquote><p>Because beating up on Serge feels rather like kicking a toddler in the head, I thought I should give him the opportunity to retract his foolish “correction”.  I wrote: “Serge_Tomiko, I humiliated you the last time you tried to correct me.<br> Fair warning: I’m going to prison-rape you on this one, brutally, if you<br> don’t retract this. You have until tomorrow to think this over.”</br></br></p><p>Not being the brightest bulb on the planet, Serge proceeded to double-down.</p><blockquote class=\"tr_bq\"><p> What more can one say? It should be blatantly obvious. How could banks charge negative interest rates if their lending was at all dependent upon deposits?</p><p>This is a complicated issue, but Vox has it completely wrong.</p><p>This would <a href=\"http://www.opendemocracy.net/ourkingdom/keith-fisher/frankensteins-bankers-tale-every-taxpayer-should-know\">a good, recent work</a> that not only demolishes Vox’s common, yet ill informed idea of banking, it explains the origin of his error. Will he read it? I doubt it. </p></blockquote><p>As it happens, I did read it. I could have written it. And not only do I completely agree with it, but I note that it has precisely NOTHING to do with my original contention. The article deals with what bankers do with the money they are loaned by their depositors and says absolutely nothing about the nature of that money or the nature of the legal relationship between the depositor and the bank. Regardless of what Serge thinks, the central message of Buddhism is not every man for himself.</p><p>On the other hand, the 1848 Foley-Hill case in the English House of Lords said everything that one needs to know about both.</p><blockquote class=\"tr_bq\"><p> Edward Thomas Foley,–Appellant; Thomas Hill and Others,-Respondents</p><p>(1848) 2 HLC 28<br> English Reports Citation: 9 E.R. 1002<br> July 31, August 1, 1848.</br></br></p><p>Mews’ Dig. i. 42, 1007; ix. 76; xi. 988. S.C. In 8 Jur., 347; 1 Ph. 399; 13 L.J. Ch. 182. On point as to relation between banker and customer, considered in St. Aubyn v. Smart, 1867, L.R. 5 Eq. 189; A.-G. v. Edmunds, 1868, L.R. 6 Eq. 390; Moxon v. Bright, 1869, L.R. 4 Ch. 294; Summers v. City Bank, 1874, L.R. 9 C.P. 587; Marten v. Rocke, 1885, 53 L.T., 1948. Distinguished on point as to limitation (1 Ph. 399; cf. 2 H.L.C. pp. 41, 42) in In re Tidd (1893), 3 Ch. 156, and in Atkinson v. Bradford Third Equitable, etc., Society, 1890, 25 Q.B.D. 381.</p><p>EDWARD THOMAS &amp; FOLEY, – Appellant; THOMAS HILL and Others,–, Respondents [July 31, August 1, 1848].</p><p>Banker and Customer–Accounts not complicated, subject for action, and not for bill.</p><p>The relation between a Banker and Customer, who pays money into the Bank, is the ordinary relation of debtor and creditor, with a superadded obligation arising out of the custom of bankers to honour the customer’s drafts; and that relation is not altered by an agreement by the banker to allow the interest on the balances in the Bank.</p><p>The relation of Banker and Customer does not partake of a fiduciary character, nor bear analogy to the relation between Principal and Factor or Agent, who is quasi trustee for the principal in respect of the particular matter for which. he is appointed factor or agent.</p></blockquote><p>Is that sufficiently clear? The relationship between the depositor and the bank is the normal one between a creditor and a debtor. Because it is a loan from the former to the latter. In case the Old English legalese is too complicated for you, we can go from 1848 to 2013 and make it even simpler. Last week, the investor Jim Sinclair <a href=\"http://marketsanity.com/bank-deposit-unsecured-loans/\">explained the same thing on Market Sanity</a>:</p><blockquote class=\"tr_bq\"><p> I think that our listeners need to understand that when they make a deposit in a bank, they don’t have an asset. They become an unsecured lender to the banking institution, that goes back to British law in the 1850s and present law in North America and elsewhere. In fact, it’s universally accepted that once you make a deposit in a bank you’re lending the money to the bank. When you hear that the bondholders and lenders will have to undertake the rescue of any banking institution that faces difficulty to the listener, you are the lender. You are a lender without collateral. You are in a very junior financial position.</p></blockquote><p>And if you’re still in doubt, it is right there in US law, specifically 12 USC § 1813 – Definitions</p><blockquote class=\"tr_bq\"><p> The term “deposit” means—<br> (1) the unpaid balance of money or its equivalent received or held by a bank or savings association in the usual course of business and for which it has given or is obligated to give credit, either conditionally or unconditionally, to a commercial, checking, savings, time, or thrift account, or which is evidenced by its certificate of deposit, thrift certificate, investment certificate, certificate of indebtedness, or other similar name, or a check or draft drawn against a deposit account and certified by the bank or savings association, or a letter of credit or a traveler’s check on which the bank or savings association is primarily liable:</br></p></blockquote><p>What is an “unpaid balance of money received?” It is a loan. As it happens, it is an unsecured loan, albeit one that is nominally guaranteed by the FDIC, at the FDIC’s sole discretion. Which is exactly what I stated in the first place. Banks are nothing but middlemen, which is why they require loans from their “depositors” in order to make new loans and profit from the difference between the interest they pay and the interest paid to them. The real service they provide is collecting all of the many smaller deposit-loans into a single large credit pool that can then be borrowed from more efficiently in larger loan packages. This is a legitimate function, perhaps even a necessary one, but hardly one that rationally justifies nearly 30 percent of all the operating profit in the country being devoted to it.</p><p>As it happens, the ability of the banks to create money is not completely dependent upon receiving loans from the general public. They can also receive loans directly from the Federal Reserve. And, as per the previous post, that $2.5 trillion injection of credit from the Fed is what has produced the $2.1 trillion nominal increase in bank assets since 2008.</p><p>The amusing thing about this particular failure to grasp the obvious is that <a href=\"http://www.voxday.blogspot.com/2012/11/end-this-depression-now.html#c1966292073200822629\">Serge is a self-avowed fascist </a>who flatters himself with the idea that he understands the English Common Law. It appears he is still stuck on the Magna Carta and hasn’t reached the 19th century yet.</p></div>",
  "content_text": "Serge Tomiko is a rather strange anklebiter who enjoys informing me that I know absolutely nothing about economics, which statement is inevitably followed by an economics-related assertion that indicates he has read the appropriate material, but he hasn’t understood it. He’s very much like Kevin Cline in\nA Fish Called Wanda\n; the last time he showed up, he failed to understand that the graph he was citing to dispute my contention was charting the data from the very same Federal Reserve report I had cited in the first place.\nThis time he felt the need to “correct” my factual statement that deposits are unsecured loans from the depositor to the bank:\nOnce again, Vox shows he is absolutely clueless about how banking functions. Deposits are NOT loans to the bank. Banks do not in any way require deposits. It is a service they provide.\nBanks create money by the authority of the government, which is given to entities in exchange for interest payments. They do not lend money. In this case, the banks are being perfectly honest. It doesn’t matter in the slightest whether or not they have deposits. In fact, this kind of policy is intended to discourage deposits.\nBecause beating up on Serge feels rather like kicking a toddler in the head, I thought I should give him the opportunity to retract his foolish “correction”.  I wrote: “Serge_Tomiko, I humiliated you the last time you tried to correct me.\nFair warning: I’m going to prison-rape you on this one, brutally, if you\ndon’t retract this. You have until tomorrow to think this over.”\nNot being the brightest bulb on the planet, Serge proceeded to double-down.\nWhat more can one say? It should be blatantly obvious. How could banks charge negative interest rates if their lending was at all dependent upon deposits?\nThis is a complicated issue, but Vox has it completely wrong.\nThis would\na good, recent work\nthat not only demolishes Vox’s common, yet ill informed idea of banking, it explains the origin of his error. Will he read it? I doubt it.\nAs it happens, I did read it. I could have written it. And not only do I completely agree with it, but I note that it has precisely NOTHING to do with my original contention. The article deals with what bankers do with the money they are loaned by their depositors and says absolutely nothing about the nature of that money or the nature of the legal relationship between the depositor and the bank. Regardless of what Serge thinks, the central message of Buddhism is not every man for himself.\nOn the other hand, the 1848 Foley-Hill case in the English House of Lords said everything that one needs to know about both.\nEdward Thomas Foley,–Appellant; Thomas Hill and Others,-Respondents\n(1848) 2 HLC 28\nEnglish Reports Citation: 9 E.R. 1002\nJuly 31, August 1, 1848.\nMews’ Dig. i. 42, 1007; ix. 76; xi. 988. S.C. In 8 Jur., 347; 1 Ph. 399; 13 L.J. Ch. 182. On point as to relation between banker and customer, considered in St. Aubyn v. Smart, 1867, L.R. 5 Eq. 189; A.-G. v. Edmunds, 1868, L.R. 6 Eq. 390; Moxon v. Bright, 1869, L.R. 4 Ch. 294; Summers v. City Bank, 1874, L.R. 9 C.P. 587; Marten v. Rocke, 1885, 53 L.T., 1948. Distinguished on point as to limitation (1 Ph. 399; cf. 2 H.L.C. pp. 41, 42) in In re Tidd (1893), 3 Ch. 156, and in Atkinson v. Bradford Third Equitable, etc., Society, 1890, 25 Q.B.D. 381.\nEDWARD THOMAS & FOLEY, – Appellant; THOMAS HILL and Others,–, Respondents [July 31, August 1, 1848].\nBanker and Customer–Accounts not complicated, subject for action, and not for bill.\nThe relation between a Banker and Customer, who pays money into the Bank, is the ordinary relation of debtor and creditor, with a superadded obligation arising out of the custom of bankers to honour the customer’s drafts; and that relation is not altered by an agreement by the banker to allow the interest on the balances in the Bank.\nThe relation of Banker and Customer does not partake of a fiduciary character, nor bear analogy to the relation between Principal and Factor or Agent, who is quasi trustee for the principal in respect of the particular matter for which. he is appointed factor or agent.\nIs that sufficiently clear? The relationship between the depositor and the bank is the normal one between a creditor and a debtor. Because it is a loan from the former to the latter. In case the Old English legalese is too complicated for you, we can go from 1848 to 2013 and make it even simpler. Last week, the investor Jim Sinclair\nexplained the same thing on Market Sanity\n:\nI think that our listeners need to understand that when they make a deposit in a bank, they don’t have an asset. They become an unsecured lender to the banking institution, that goes back to British law in the 1850s and present law in North America and elsewhere. In fact, it’s universally accepted that once you make a deposit in a bank you’re lending the money to the bank. When you hear that the bondholders and lenders will have to undertake the rescue of any banking institution that faces difficulty to the listener, you are the lender. You are a lender without collateral. You are in a very junior financial position.\nAnd if you’re still in doubt, it is right there in US law, specifically 12 USC § 1813 – Definitions\nThe term “deposit” means—\n(1) the unpaid balance of money or its equivalent received or held by a bank or savings association in the usual course of business and for which it has given or is obligated to give credit, either conditionally or unconditionally, to a commercial, checking, savings, time, or thrift account, or which is evidenced by its certificate of deposit, thrift certificate, investment certificate, certificate of indebtedness, or other similar name, or a check or draft drawn against a deposit account and certified by the bank or savings association, or a letter of credit or a traveler’s check on which the bank or savings association is primarily liable:\nWhat is an “unpaid balance of money received?” It is a loan. As it happens, it is an unsecured loan, albeit one that is nominally guaranteed by the FDIC, at the FDIC’s sole discretion. Which is exactly what I stated in the first place. Banks are nothing but middlemen, which is why they require loans from their “depositors” in order to make new loans and profit from the difference between the interest they pay and the interest paid to them. The real service they provide is collecting all of the many smaller deposit-loans into a single large credit pool that can then be borrowed from more efficiently in larger loan packages. This is a legitimate function, perhaps even a necessary one, but hardly one that rationally justifies nearly 30 percent of all the operating profit in the country being devoted to it.\nAs it happens, the ability of the banks to create money is not completely dependent upon receiving loans from the general public. They can also receive loans directly from the Federal Reserve. And, as per the previous post, that $2.5 trillion injection of credit from the Fed is what has produced the $2.1 trillion nominal increase in bank assets since 2008.\nThe amusing thing about this particular failure to grasp the obvious is that\nSerge is a self-avowed fascist\nwho flatters himself with the idea that he understands the English Common Law. It appears he is still stuck on the Magna Carta and hasn’t reached the 19th century yet.",
  "tags": [
    "anklebiters",
    "banks",
    "mailvox"
  ],
  "categories": [],
  "sitemap_lastmod": "2013-11-26T09:32:00+00:00"
}