{
  "url": "https://voxday.net/2013/11/15/mailvox-dont-struggle/",
  "scraped_at": "2025-12-15T16:36:54.515640",
  "title": "Mailvox: don’t struggle",
  "date_display": "November 15, 2013",
  "date_iso": "2013-11-15T10:41:00+00:00",
  "date_from_url": "2013-11-15",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>TS writes of his difficulties in attempting to find belief in the existence of God:</p><blockquote class=\"tr_bq\"><p> Vox, I’ve read your blog for quite some time now and have enjoyed it immensely. Right now I am a struggling theist. More and more I am doubting the existence of God and it’s plaguing my thoughts and causing some serious depression.</p><p>My biggest hurdle in my mind right now is the fact that you can’t see God. You come across as very intelligent so I ask you personally: what helped you get past the fact that you can’t see God or hear from him. My mind continues to tell me I am being irrational for believing in a life form I can’t see. Am I missing something?  Is this truly a matter of “blind faith” as an atheist would mockingly say? Your thoughts are much appreciated. I genuinely want rational reasons that can help me get past this mental hurdle</p></blockquote><p>It has become apparent to me that there are three primary causes for atheism. One is a simple neural anomaly where the atheist lacks something in the brain that is necessary for some forms of belief. This doesn’t merely relate to belief in God, but also in the ability to connect with other beings, hence the strong correlation between atheism and higher levels on the autism spectrum.</p><p>The second cause produces the most common and irritating variety, the intellectual perma-adolescent. This is the Religion Minus variety, which is nothing more than a parasitic Do What Thou Wilt Society. Combine it with the first cause and one has the typical New Atheist: smug, juvenile, and socially autistic.</p><p>The third cause is what I would describe as a failure of understanding. It is, I submit, a category error at its core. To me, it seems quite literally crazy to refuse to believe in ANYTHING simply because one has not seen it or heard it. We live in an age of virtual reality, where what we see and hear are entirely false. We live in an age of quantum physics, where what happens on one side of a galaxy has chaotic and unknown, but theoretically observable effects on the other side of it.</p><p>So, to think that because one has never personally seen nor heard something is any sort of indication that it doesn’t exist strikes me as solipsism of the first order. As for me, I have absolutely no problem whatsoever in believing in God’s existence. There is nothing to get past. Perhaps this paragraph explaining why I am a Christian, taken from <a href=\"http://www.milobookclub.com/2009/09/22/letter-to-common-sense-atheism-i/\">my exchange of letters</a> with Luke of Common Sense Atheism, will help you understand my perspective on the readily observable fact of God’s existence.</p><p><i>Why am I a Christian?  Because I believe in evil.  I believe in<br> objective, material, tangible evil that insensibly envelops every single<br> one of us sooner or later.  I believe in the fallen nature of Man, and I<br> am aware that there is no shortage of evidence, scientific,<br> testimonial, documentary, and archeological, to demonstrate that no<br> individual is perfect or even perfectible by the moral standards<br> described in the Bible.  I am a Christian because I believe that Jesus<br> Christ is the only means of freeing Man from the grip of that evil.  God<br> may not be falsifiable, but Christianity definitely is, and it has<br> never been falsified.  The only philosophical problem of evil that could<br> ever trouble the rational Christian is its absence; to the extent that<br> evil can be said to exist, it proves not only the validity of<br> Christianity but its necessity as well.   The fact that we live<br> in a world of pain, suffering, injustice, and cruelty is not evidence of<br> God’s nonexistence or maleficence, it is exactly the worldview that is<br> described in the Bible.  In my own experience and observations, I find<br> that worldview to be far more accurate than any other, including the<br> shiny science fiction utopianism of the secular humanists.</br></br></br></br></br></br></br></br></br></br></br></br></br></br></br></br></br></i></p><p>My advice to TS is to stop struggling to understand how God functions or why God hasn’t submitted to a personal belief audit and start simply experiencing the effects of God in this fallen world.</p><p>Stand outside in the cold autum breeze, close your eyes, spread your arms, and feel the unseen wind on your face. Read the Book of Proverbs, read the latest professional manual on child-rearing, written with the benefit of more than two thousand years of collective human experience, then go to a park and observe the children interacting with their parents. Go drop one rock on top of another 500 times and do your best to convince yourself that all the life you see around you began as a result of a singular accidental collision. Go to a funeral of a stranger, observe the grief of the friends and family, and tell yourself that the rearrangement of atoms involved in the transition of the deceased from life to death was of no more material import or significance than the shattering of a rock into dust.</p><p>Speak to a murderer and ask him to tell you why he committed his horrific crimes. Look at the pictures of the aftermath. Then look deep into his eyes and try to tell yourself that neither good nor evil exist.</p><p>Immerse yourself in the atheist arguments with your eyes and your mind open. Not until you fully understand them, not until you reconstruct them from their foundational assumptions, can you grasp how superficial and foolish they are from a purely rational perspective.</p><p>Empirical mysticism isn’t a path I would recommend for everyone, but the excessively logical often struggle with the reality of the mystery. They simply cannot accept that Man is not capable of formulating the questions, let alone finding the answers. That is why allowing themselves to experience and accept the manifold mysteries of life, the universe, and everything can be necessary for them to permit themselves to be convicted of things not seen.</p><p>In the end, one is advised to make The Castrate’s Choice: It is so or it is not so. Because the life lived seated on a fence makes for a poorly lived one. Choose, and then live accordingly.</p></div>",
  "content_text": "TS writes of his difficulties in attempting to find belief in the existence of God:\nVox, I’ve read your blog for quite some time now and have enjoyed it immensely. Right now I am a struggling theist. More and more I am doubting the existence of God and it’s plaguing my thoughts and causing some serious depression.\nMy biggest hurdle in my mind right now is the fact that you can’t see God. You come across as very intelligent so I ask you personally: what helped you get past the fact that you can’t see God or hear from him. My mind continues to tell me I am being irrational for believing in a life form I can’t see. Am I missing something?  Is this truly a matter of “blind faith” as an atheist would mockingly say? Your thoughts are much appreciated. I genuinely want rational reasons that can help me get past this mental hurdle\nIt has become apparent to me that there are three primary causes for atheism. One is a simple neural anomaly where the atheist lacks something in the brain that is necessary for some forms of belief. This doesn’t merely relate to belief in God, but also in the ability to connect with other beings, hence the strong correlation between atheism and higher levels on the autism spectrum.\nThe second cause produces the most common and irritating variety, the intellectual perma-adolescent. This is the Religion Minus variety, which is nothing more than a parasitic Do What Thou Wilt Society. Combine it with the first cause and one has the typical New Atheist: smug, juvenile, and socially autistic.\nThe third cause is what I would describe as a failure of understanding. It is, I submit, a category error at its core. To me, it seems quite literally crazy to refuse to believe in ANYTHING simply because one has not seen it or heard it. We live in an age of virtual reality, where what we see and hear are entirely false. We live in an age of quantum physics, where what happens on one side of a galaxy has chaotic and unknown, but theoretically observable effects on the other side of it.\nSo, to think that because one has never personally seen nor heard something is any sort of indication that it doesn’t exist strikes me as solipsism of the first order. As for me, I have absolutely no problem whatsoever in believing in God’s existence. There is nothing to get past. Perhaps this paragraph explaining why I am a Christian, taken from\nmy exchange of letters\nwith Luke of Common Sense Atheism, will help you understand my perspective on the readily observable fact of God’s existence.\nWhy am I a Christian?  Because I believe in evil.  I believe in\nobjective, material, tangible evil that insensibly envelops every single\none of us sooner or later.  I believe in the fallen nature of Man, and I\nam aware that there is no shortage of evidence, scientific,\ntestimonial, documentary, and archeological, to demonstrate that no\nindividual is perfect or even perfectible by the moral standards\ndescribed in the Bible.  I am a Christian because I believe that Jesus\nChrist is the only means of freeing Man from the grip of that evil.  God\nmay not be falsifiable, but Christianity definitely is, and it has\nnever been falsified.  The only philosophical problem of evil that could\never trouble the rational Christian is its absence; to the extent that\nevil can be said to exist, it proves not only the validity of\nChristianity but its necessity as well.   The fact that we live\nin a world of pain, suffering, injustice, and cruelty is not evidence of\nGod’s nonexistence or maleficence, it is exactly the worldview that is\ndescribed in the Bible.  In my own experience and observations, I find\nthat worldview to be far more accurate than any other, including the\nshiny science fiction utopianism of the secular humanists.\nMy advice to TS is to stop struggling to understand how God functions or why God hasn’t submitted to a personal belief audit and start simply experiencing the effects of God in this fallen world.\nStand outside in the cold autum breeze, close your eyes, spread your arms, and feel the unseen wind on your face. Read the Book of Proverbs, read the latest professional manual on child-rearing, written with the benefit of more than two thousand years of collective human experience, then go to a park and observe the children interacting with their parents. Go drop one rock on top of another 500 times and do your best to convince yourself that all the life you see around you began as a result of a singular accidental collision. Go to a funeral of a stranger, observe the grief of the friends and family, and tell yourself that the rearrangement of atoms involved in the transition of the deceased from life to death was of no more material import or significance than the shattering of a rock into dust.\nSpeak to a murderer and ask him to tell you why he committed his horrific crimes. Look at the pictures of the aftermath. Then look deep into his eyes and try to tell yourself that neither good nor evil exist.\nImmerse yourself in the atheist arguments with your eyes and your mind open. Not until you fully understand them, not until you reconstruct them from their foundational assumptions, can you grasp how superficial and foolish they are from a purely rational perspective.\nEmpirical mysticism isn’t a path I would recommend for everyone, but the excessively logical often struggle with the reality of the mystery. They simply cannot accept that Man is not capable of formulating the questions, let alone finding the answers. That is why allowing themselves to experience and accept the manifold mysteries of life, the universe, and everything can be necessary for them to permit themselves to be convicted of things not seen.\nIn the end, one is advised to make The Castrate’s Choice: It is so or it is not so. Because the life lived seated on a fence makes for a poorly lived one. Choose, and then live accordingly.",
  "tags": [
    "atheism",
    "mailvox"
  ],
  "categories": [],
  "sitemap_lastmod": "2013-11-15T10:41:00+00:00"
}