{
  "url": "https://voxday.net/2013/11/25/mcrapey-is-bourgeois-pudding/",
  "scraped_at": "2025-12-15T16:37:55.739055",
  "title": "John Scalzi is a “bourgeois pudding”",
  "date_display": "November 25, 2013",
  "date_iso": "2013-11-25T14:00:00+00:00",
  "date_from_url": "2013-11-25",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>Inverarity considers <a href=\"http://bookish.livejournal.com/3511918.html?nojs=1\">the wisdom of boycotting authors</a> of whom one disapproves:</p><blockquote class=\"tr_bq\"><p> Case in point: many of you are probably aware of the infamous “feud” that’s been going for a couple of years now between John Scalzi and Theodore Beale, aka “Vox Day.” John Scalzi is the bourgeois pudding of SF – nice, inoffensive, always triangulating for the “rational middle” of a political argument, writes decent if unexciting sci-fi.</p><p>Vox Day is… well, indescribable. Though there is a gulf between what he’s been accused of saying and what he has actually said, he’s way, way out there, and if he doesn’t make your head explode, his commenters will. Orson Scott Card and John C. Wright are mild gentlemen of moderate views compared to VD.</p><p>VD has written several novels<strike>, largely self-published</strike>. I am sure the thought of contributing money to him, or even adding to his download count, fills many with reflexive horror. But I am filled with a certain perverse curiosity (and a bit of defiance after the ridiculous spectacle of the SFWA booting him from the organization), and I downloaded a few of his novellas when they were available for free on Amazon. (Reviews forthcoming. If I ever get around to them.)</p><p>Would I pay money for one of his books? Probably not. Do I think I have an obligation to not support him in any way, shape or form by reading, downloading, reviewing, or giving him publicity? That is where I get off the Right-Thinking People Train.</p></blockquote><p>This is a reasonable perspective and it is unfortunate that it is no longer the norm in the professional writing community. It’s also hard to disagree with the gentleman’s characterization of Mr. Scalzi’s fiction, although he omitted the phrase “derivative”, which is absolutely necessary to describe the genre’s great rip-off artist. In fact, I am given to understand that the award-winning McRapey is very nearly done with a new novel, which makes one wonder what the subject matter will be:</p><p><a class=\"OPP-powered-by\" href=\"http://www.objectplanet.com/opinio/\" style=\"text-decoration: none;\"></a></p><p>While I can’t disagree with Inverarity’s assertion of my immoderate views, <strike>I do have to correct the erroneous characterization of my novels as “largely self-published”.</strike>  [This has now been corrected – VD] While I do intend to “self-publish” through <i>First Sword</i>, precisely none of my books to date are self-published. It would certainly surprise Simon &amp; Schuster to learn that they belong to me and I have no interest in Marcher Lord Press beyond the fact that I am one of their authors. The fact that I have been permitted a considerable amount of leeway by publishers from Pocket Books to Marcher Lord is of no more significance than the fact that Stephen King is similarly afforded a great deal of independence by his publishers.</p><p>I’m not one of the leading authors of SF/F… but my publishers, past and present, aren’t the only ones in the industry who harbor the suspicions I have the potential to become one. That probably wouldn’t have been possible under the old system, but now the gatekeepers are crumbling….</p><p>I tend to agree with Inverarity concerning the foolishness of limiting your reading to those with whom you agree, or at least do not disagree too greatly. Among other things, a refusal to familiarize myself with Marxism and the correct terminology utilized in two of its forms would have simplified the plot of QUANTUM MORTIS and severely crippled one character who is portrayed as neither a villain nor a cardboard cutout. That being said, I do think it is important to recognize that there is a cultural war being waged, that the Left is the only one actually fighting it, and the people of the Right will not see its views respected, much less held up in an exemplary manner, if it continues to support the artists seeking to destroy it at the expense of the artists seeking to uphold them.</p><p><a href=\"http://www.milobookclub.com/wp-content/uploads/2013/11/QMGK_900b.jpg\" imageanchor=\"1\" style=\"clear: left; float: left; margin-bottom: 1em; margin-right: 1em;\"><noscript><img border=\"0\" decoding=\"async\" src=\"http://www.milobookclub.com/wp-content/uploads/2013/11/QMGK_900b.jpg\"/></noscript><img border=\"0\" class=\"lazyload\" data-src=\"http://www.milobookclub.com/wp-content/uploads/2013/11/QMGK_900b.jpg\" decoding=\"async\" src=\"data:image/svg+xml,%3Csvg%20xmlns=%22http://www.w3.org/2000/svg%22%20viewBox=%220%200%20210%20140%22%3E%3C/svg%3E\"/></a>I neither expect nor require support from the other side. I expect to be attacked, belittled, ignored, and lied about. I have been reliably informed by a recent SF convention-goer that I am the most-hated author in science fiction today. Good! Whether I am wrong or whether I am right, I am simply exercising my right to speak what I perceive to be the undeniable and demonstrable truth. If those who are openly attempting to spread lies and left-wing propaganda disapprove of me, I suggest that merely shows there is some substance, or at the very least, some rhetorical plausibility to what I am saying.  For years, they said I was irrelevant. Then they said I was ridiculous. Now they say I am too extreme and dangerous… and I’m sure every reader here is well-aware of Gandhi’s Progression.</p><p>I hope those of you on the Right who are interested in the genre will continue to support the efforts of me and other writers of the Right. Try Kratman. Try Correia. Try Wright. Try Walker and Williamson. If you haven’t yet, try Card. <a href=\"http://www.marcherlordpress.com/bookstore/hinterlands-imprint/a-man-disrupted-by-steve-rzasa-and-vox-day/\">Preorder QUANTUM MORTIS</a> as a Christmas gift and get the ebook free for yourself. I am confident most of you will not be disappointed, particularly if John Scalzi is your idea of “decent if unexciting sci-fi”. And I also hope those of you on the Left will consider extending the same courtesy to us that we have extended to you for decades, and judge our work on the basis of its merits and its demerits rather than the ideological views of the writer.</p><p>After all, do you really think your support for abortion, feminism, multiculturalism, and global dictatorship by a technocratic UN is any less offensive to me than my views are to you? In summary, I don’t avoid reading any author due to his views; I would quite happily read McRapey’s novels if they weren’t tedious works of derivative mediocrity. <i>The Android’s Dream</i> and <i>Ghost Brigades</i> were enough to cause me to lose interest in them years before the so-called feud began.</p><p>In any event, I am happy to offer Inverarity copies of<i> QUANTUM MORTIS A Man Disrupted</i> and <i>QUANTUM MORTIS Gravity Kills. </i>If he is interested, I would be happy to send him the pair of ebooks so as to save his conscience the burden of inadvertently supporting me financially. And who knows, perhaps he might even find it to be indecent, but exciting SF.</p><p>As a bonus, the link features our favorite literary troll, Andrew Marston of the New England Wildlife Center, attacking Larry Correia, Tom Kratman, and Dan Simmons in the comments.</p></div>",
  "content_text": "Inverarity considers\nthe wisdom of boycotting authors\nof whom one disapproves:\nCase in point: many of you are probably aware of the infamous “feud” that’s been going for a couple of years now between John Scalzi and Theodore Beale, aka “Vox Day.” John Scalzi is the bourgeois pudding of SF – nice, inoffensive, always triangulating for the “rational middle” of a political argument, writes decent if unexciting sci-fi.\nVox Day is… well, indescribable. Though there is a gulf between what he’s been accused of saying and what he has actually said, he’s way, way out there, and if he doesn’t make your head explode, his commenters will. Orson Scott Card and John C. Wright are mild gentlemen of moderate views compared to VD.\nVD has written several novels\n, largely self-published\n. I am sure the thought of contributing money to him, or even adding to his download count, fills many with reflexive horror. But I am filled with a certain perverse curiosity (and a bit of defiance after the ridiculous spectacle of the SFWA booting him from the organization), and I downloaded a few of his novellas when they were available for free on Amazon. (Reviews forthcoming. If I ever get around to them.)\nWould I pay money for one of his books? Probably not. Do I think I have an obligation to not support him in any way, shape or form by reading, downloading, reviewing, or giving him publicity? That is where I get off the Right-Thinking People Train.\nThis is a reasonable perspective and it is unfortunate that it is no longer the norm in the professional writing community. It’s also hard to disagree with the gentleman’s characterization of Mr. Scalzi’s fiction, although he omitted the phrase “derivative”, which is absolutely necessary to describe the genre’s great rip-off artist. In fact, I am given to understand that the award-winning McRapey is very nearly done with a new novel, which makes one wonder what the subject matter will be:\nWhile I can’t disagree with Inverarity’s assertion of my immoderate views,\nI do have to correct the erroneous characterization of my novels as “largely self-published”.\n[This has now been corrected – VD] While I do intend to “self-publish” through\nFirst Sword\n, precisely none of my books to date are self-published. It would certainly surprise Simon & Schuster to learn that they belong to me and I have no interest in Marcher Lord Press beyond the fact that I am one of their authors. The fact that I have been permitted a considerable amount of leeway by publishers from Pocket Books to Marcher Lord is of no more significance than the fact that Stephen King is similarly afforded a great deal of independence by his publishers.\nI’m not one of the leading authors of SF/F… but my publishers, past and present, aren’t the only ones in the industry who harbor the suspicions I have the potential to become one. That probably wouldn’t have been possible under the old system, but now the gatekeepers are crumbling….\nI tend to agree with Inverarity concerning the foolishness of limiting your reading to those with whom you agree, or at least do not disagree too greatly. Among other things, a refusal to familiarize myself with Marxism and the correct terminology utilized in two of its forms would have simplified the plot of QUANTUM MORTIS and severely crippled one character who is portrayed as neither a villain nor a cardboard cutout. That being said, I do think it is important to recognize that there is a cultural war being waged, that the Left is the only one actually fighting it, and the people of the Right will not see its views respected, much less held up in an exemplary manner, if it continues to support the artists seeking to destroy it at the expense of the artists seeking to uphold them.\nI neither expect nor require support from the other side. I expect to be attacked, belittled, ignored, and lied about. I have been reliably informed by a recent SF convention-goer that I am the most-hated author in science fiction today. Good! Whether I am wrong or whether I am right, I am simply exercising my right to speak what I perceive to be the undeniable and demonstrable truth. If those who are openly attempting to spread lies and left-wing propaganda disapprove of me, I suggest that merely shows there is some substance, or at the very least, some rhetorical plausibility to what I am saying.  For years, they said I was irrelevant. Then they said I was ridiculous. Now they say I am too extreme and dangerous… and I’m sure every reader here is well-aware of Gandhi’s Progression.\nI hope those of you on the Right who are interested in the genre will continue to support the efforts of me and other writers of the Right. Try Kratman. Try Correia. Try Wright. Try Walker and Williamson. If you haven’t yet, try Card.\nPreorder QUANTUM MORTIS\nas a Christmas gift and get the ebook free for yourself. I am confident most of you will not be disappointed, particularly if John Scalzi is your idea of “decent if unexciting sci-fi”. And I also hope those of you on the Left will consider extending the same courtesy to us that we have extended to you for decades, and judge our work on the basis of its merits and its demerits rather than the ideological views of the writer.\nAfter all, do you really think your support for abortion, feminism, multiculturalism, and global dictatorship by a technocratic UN is any less offensive to me than my views are to you? In summary, I don’t avoid reading any author due to his views; I would quite happily read McRapey’s novels if they weren’t tedious works of derivative mediocrity.\nThe Android’s Dream\nand\nGhost Brigades\nwere enough to cause me to lose interest in them years before the so-called feud began.\nIn any event, I am happy to offer Inverarity copies of\nQUANTUM MORTIS A Man Disrupted\nand\nQUANTUM MORTIS Gravity Kills.\nIf he is interested, I would be happy to send him the pair of ebooks so as to save his conscience the burden of inadvertently supporting me financially. And who knows, perhaps he might even find it to be indecent, but exciting SF.\nAs a bonus, the link features our favorite literary troll, Andrew Marston of the New England Wildlife Center, attacking Larry Correia, Tom Kratman, and Dan Simmons in the comments.",
  "tags": [
    "McRapey",
    "writing"
  ],
  "categories": [],
  "sitemap_lastmod": "2013-11-25T14:00:00+00:00"
}