{
  "url": "https://voxday.net/2013/11/01/orson-scott-card-on-sfwa/",
  "scraped_at": "2025-12-15T16:35:30.856039",
  "title": "Orson Scott Card on SFWA",
  "date_display": "November 1, 2013",
  "date_iso": "2013-11-01T17:00:00+00:00",
  "date_from_url": "2013-11-01",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>The author of Ender’s Game <a href=\"http://www.deseretnews.com/article/865589522/Critics-community-and-Enders-Game-An-interview-with-Orson-Scott-Card.html?pg=all\">expresses the reasons he disdains the SFWA</a>, but perhaps more importantly, he echoes my previous point about why the post-80s SF authors repeatedly show themselves to be unable to produce fiction that is as compelling or as relevant as their predecessors even when they are expressly trying to mimic it:</p><blockquote class=\"tr_bq\"><p> What I find interesting is the people who commit and keep their commitment at great personal cost, the grown-up story, the story of parents, the story of people who sacrifice for community but stay in it and have to live in the mess they made. … They don’t take off their mask and go back into society under another name. They have to be who they are, wear their own face in their community.</p><p>This has made some critics very uncomfortable right from the start. And as my politics diverged from the political correctness that has captured the left — I mean, (in) 1976 I was a Daniel Patrick Moynihan liberal Democrat — and without changing any of my principles, I’ve now become quite a right-winger in the eyes of the left. And I’m a little baffled by it because I’m a liberal and they’re not. They’re repressive, punishing, intolerant of the slightest variation, absolutely the opposite of what it means to be a liberal. But that’s the way it goes. They still get the label. I am the fact of what it meant to be a liberal. I find the most liberals who feel like I do among people who are labeled as conservatives. It’s a very odd thing.</p><p>But that political thing has affected the criticism of my work. And it would just make me crazy to read asinine, irrelevant comments by critics who think they’re saying something intelligent.</p><p>You see, what happens is, if you respect a writer, then you talk about the work. If you disdain the writer, then you try to psychoanalyze the writer and figure out why would he write this. And that’s all I get from science fiction literary elite. If they mention my work at all, which they rarely do, it’s to dismiss it and to psychoanalyze me, which they are incapable of doing since they’ve never actually formed the kind of community bonds that my fiction always depends on. They have no idea what I’m talking about. They couldn’t produce that fiction if they tried because they don’t share those values.</p></blockquote><p>This is absolutely true. “They have no idea what I’m talking about.” That’s precisely what one sees wherever the SFWA fascists are discussing something written by Card, me, or some other outlaw of SF. They literally don’t understand it. Look at how many people threw a hissy fit about my comments concerning NK Jemisin and thought that I was saying I was more <i>homo sapiens sapiens</i> than she was. It’s not worth bothering to explain it to them, because the whole point is to take offense in order to justify taking action.</p><p>As he observes: “Just writing honestly makes them attack me because they can’t bear a<br> favorable depiction of someone they disagree with. It’s intolerable to<br> them. They are arch-fanatical puritans. They can’t bear the thought that<br> someone somewhere who is intelligent might not hold the same idea as<br> them. It’s the essence of intolerance, and that’s the way they are.”</br></br></br></br></p><p>It is the way they are. And it drives them absolutely insane that more successful, more intelligent people not only don’t hold the same ideas as them, but hold them in complete contempt. The fact is that they are nothing but parasites. Consider: after openly ripping off Heinlein, John Scalzi has openly declared his hopes that Old Man’s War can catch a ride on the coattails of the Ender’s Game movie… and Scalzi’s mediocre derivatives are literally the award-winning best that the current SFWA community presently has to offer.</p></div>",
  "content_text": "The author of Ender’s Game\nexpresses the reasons he disdains the SFWA\n, but perhaps more importantly, he echoes my previous point about why the post-80s SF authors repeatedly show themselves to be unable to produce fiction that is as compelling or as relevant as their predecessors even when they are expressly trying to mimic it:\nWhat I find interesting is the people who commit and keep their commitment at great personal cost, the grown-up story, the story of parents, the story of people who sacrifice for community but stay in it and have to live in the mess they made. … They don’t take off their mask and go back into society under another name. They have to be who they are, wear their own face in their community.\nThis has made some critics very uncomfortable right from the start. And as my politics diverged from the political correctness that has captured the left — I mean, (in) 1976 I was a Daniel Patrick Moynihan liberal Democrat — and without changing any of my principles, I’ve now become quite a right-winger in the eyes of the left. And I’m a little baffled by it because I’m a liberal and they’re not. They’re repressive, punishing, intolerant of the slightest variation, absolutely the opposite of what it means to be a liberal. But that’s the way it goes. They still get the label. I am the fact of what it meant to be a liberal. I find the most liberals who feel like I do among people who are labeled as conservatives. It’s a very odd thing.\nBut that political thing has affected the criticism of my work. And it would just make me crazy to read asinine, irrelevant comments by critics who think they’re saying something intelligent.\nYou see, what happens is, if you respect a writer, then you talk about the work. If you disdain the writer, then you try to psychoanalyze the writer and figure out why would he write this. And that’s all I get from science fiction literary elite. If they mention my work at all, which they rarely do, it’s to dismiss it and to psychoanalyze me, which they are incapable of doing since they’ve never actually formed the kind of community bonds that my fiction always depends on. They have no idea what I’m talking about. They couldn’t produce that fiction if they tried because they don’t share those values.\nThis is absolutely true. “They have no idea what I’m talking about.” That’s precisely what one sees wherever the SFWA fascists are discussing something written by Card, me, or some other outlaw of SF. They literally don’t understand it. Look at how many people threw a hissy fit about my comments concerning NK Jemisin and thought that I was saying I was more\nhomo sapiens sapiens\nthan she was. It’s not worth bothering to explain it to them, because the whole point is to take offense in order to justify taking action.\nAs he observes: “Just writing honestly makes them attack me because they can’t bear a\nfavorable depiction of someone they disagree with. It’s intolerable to\nthem. They are arch-fanatical puritans. They can’t bear the thought that\nsomeone somewhere who is intelligent might not hold the same idea as\nthem. It’s the essence of intolerance, and that’s the way they are.”\nIt is the way they are. And it drives them absolutely insane that more successful, more intelligent people not only don’t hold the same ideas as them, but hold them in complete contempt. The fact is that they are nothing but parasites. Consider: after openly ripping off Heinlein, John Scalzi has openly declared his hopes that Old Man’s War can catch a ride on the coattails of the Ender’s Game movie… and Scalzi’s mediocre derivatives are literally the award-winning best that the current SFWA community presently has to offer.",
  "tags": [
    "SFWA"
  ],
  "categories": [],
  "sitemap_lastmod": "2013-11-01T17:00:00+00:00"
}