{
  "url": "https://voxday.net/2013/11/27/pop-culture-is-utter-fi/",
  "scraped_at": "2025-12-15T16:38:08.488206",
  "title": "Pop culture is utter filth",
  "date_display": "November 27, 2013",
  "date_iso": "2013-11-27T14:00:00+00:00",
  "date_from_url": "2013-11-27",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>Vile, abusive, and occasionally lethal filth, especially <a href=\"http://www.hollywoodreporter.com/feature/\">where animals and children are concerned</a>:</p><blockquote class=\"tr_bq\"><p> American Humane Association monitor Gina Johnson confided in an email to a colleague on April 7, 2011, about the star tiger in Ang Lee’s Life of Pi. While many scenes featuring “Richard Parker,” the Bengal tiger who shares a lifeboat with a boy lost at sea, were created using CGI technology, King, very much a real animal, was employed when the digital version wouldn’t suffice. “This one take with him just went really bad and he got lost trying to swim to the side,” Johnson wrote. “Damn near drowned.”</p><p>King’s trainer eventually snagged him with a catch rope and dragged him to one side of the tank, where he scrambled out to safety.</p><p>“I think this goes without saying but DON’T MENTION IT TO ANYONE, ESPECIALLY THE OFFICE!” Johnson continued in the email, obtained by The Hollywood Reporter. “I have downplayed the f— out of it.”</p><p>The full scope of animal injuries and deaths in entertainment productions cannot be known. But in multiple cases examined by <i>THR</i>,<br> the AHA has not lived up to its professed role as stalwart defenders of<br> animals — who, unlike their human counterparts, didn’t themselves sign<br> up for such work.</br></br></br></p></blockquote><p>Corey Feldman and others have spokenly openly about the homosexual pedophiles who infest Hollywood. But they’re also active in the music industry, as <a href=\"http://www.dailymail.co.uk/news/article-2513820/Ian-Watkins-Lostprophets-singer-pleads-GUILTY-attempted-rape-baby.html\">the guilty plea of Ian Watkins</a>, the former lead singer of Lostprophets, demonstrates:</p><blockquote class=\"tr_bq\"><p> The police faced serious questions last night over why they failed to act sooner to stop Lostprophets singer Ian Watkins after it emerged fans had warned for nearly four years that he was obsessed with child porn.</p><p>From early 2010 horrified fans who had become friends with Watkins went online to beg for help after discovering vile images on his computer. Friends claim they called police to tell them the 36-year-old was a paedophile but officers did nothing, allowing him to go on to subject babies to the most horrific abuse.</p><p>A disturbing child porn profile created in that time by Watkins was viewed by more than 40,000 people on the internet and yet appears never to have been monitored by authorities.</p><p>In one post, written before his arrest, a fan wrote: ‘His on-off girlfriend reported him to police twice for being a paedophile.</p><p>‘He sent pornographic pictures of a little girl to a few girls telling them it was a five-year-old girl he’d raped. He also watches child porn constantly. Sick sick man.’</p><p>Watkins allegedly boasted to obsessed female fans that he had HIV and was on a mission to pass it on to children.</p></blockquote><p>Child abuse and animal abuse are two of the inevitable consequences of secular culture. It’s not an accident that these predilections are beginning to come out of their closets at this time. It is both logically and empirically obvious that the tolerant, non-judgmental moral parasitism of secularism cannot survive the absence of its host. This is not to say that all men and women will inevitably descend into total depravity, only that their inability to prevent those who are more susceptible to such sins becomes complete in a moral vacuum.</p><p>You who pride yourselves on your tolerance, know that you are tolerating the rape and slaughter of the innocent. If you cannot say: “these things are wrong and they are evil because they are against the Law of God and Nature”, you are part of the problem. You’re not responsible, but you have rendered yourself useless with regards to assisting in the solution.</p><p>I liked Lostprophets. But, not unlike the band members themselves, I really don’t care to have anything to do with it anymore. Ian Watkins did, indeed, turn out to be a Prophet of the Lost.</p></div>",
  "content_text": "Vile, abusive, and occasionally lethal filth, especially\nwhere animals and children are concerned\n:\nAmerican Humane Association monitor Gina Johnson confided in an email to a colleague on April 7, 2011, about the star tiger in Ang Lee’s Life of Pi. While many scenes featuring “Richard Parker,” the Bengal tiger who shares a lifeboat with a boy lost at sea, were created using CGI technology, King, very much a real animal, was employed when the digital version wouldn’t suffice. “This one take with him just went really bad and he got lost trying to swim to the side,” Johnson wrote. “Damn near drowned.”\nKing’s trainer eventually snagged him with a catch rope and dragged him to one side of the tank, where he scrambled out to safety.\n“I think this goes without saying but DON’T MENTION IT TO ANYONE, ESPECIALLY THE OFFICE!” Johnson continued in the email, obtained by The Hollywood Reporter. “I have downplayed the f— out of it.”\nThe full scope of animal injuries and deaths in entertainment productions cannot be known. But in multiple cases examined by\nTHR\n,\nthe AHA has not lived up to its professed role as stalwart defenders of\nanimals — who, unlike their human counterparts, didn’t themselves sign\nup for such work.\nCorey Feldman and others have spokenly openly about the homosexual pedophiles who infest Hollywood. But they’re also active in the music industry, as\nthe guilty plea of Ian Watkins\n, the former lead singer of Lostprophets, demonstrates:\nThe police faced serious questions last night over why they failed to act sooner to stop Lostprophets singer Ian Watkins after it emerged fans had warned for nearly four years that he was obsessed with child porn.\nFrom early 2010 horrified fans who had become friends with Watkins went online to beg for help after discovering vile images on his computer. Friends claim they called police to tell them the 36-year-old was a paedophile but officers did nothing, allowing him to go on to subject babies to the most horrific abuse.\nA disturbing child porn profile created in that time by Watkins was viewed by more than 40,000 people on the internet and yet appears never to have been monitored by authorities.\nIn one post, written before his arrest, a fan wrote: ‘His on-off girlfriend reported him to police twice for being a paedophile.\n‘He sent pornographic pictures of a little girl to a few girls telling them it was a five-year-old girl he’d raped. He also watches child porn constantly. Sick sick man.’\nWatkins allegedly boasted to obsessed female fans that he had HIV and was on a mission to pass it on to children.\nChild abuse and animal abuse are two of the inevitable consequences of secular culture. It’s not an accident that these predilections are beginning to come out of their closets at this time. It is both logically and empirically obvious that the tolerant, non-judgmental moral parasitism of secularism cannot survive the absence of its host. This is not to say that all men and women will inevitably descend into total depravity, only that their inability to prevent those who are more susceptible to such sins becomes complete in a moral vacuum.\nYou who pride yourselves on your tolerance, know that you are tolerating the rape and slaughter of the innocent. If you cannot say: “these things are wrong and they are evil because they are against the Law of God and Nature”, you are part of the problem. You’re not responsible, but you have rendered yourself useless with regards to assisting in the solution.\nI liked Lostprophets. But, not unlike the band members themselves, I really don’t care to have anything to do with it anymore. Ian Watkins did, indeed, turn out to be a Prophet of the Lost.",
  "tags": [
    "philosophy"
  ],
  "categories": [],
  "sitemap_lastmod": "2013-11-27T14:00:00+00:00"
}