{
  "url": "https://voxday.net/2013/11/27/rights-roundup-3/",
  "scraped_at": "2025-12-15T16:38:06.664579",
  "title": "Rights roundup",
  "date_display": "November 27, 2013",
  "date_iso": "2013-11-27T09:21:00+00:00",
  "date_from_url": "2013-11-27",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>In case you’ve missed my recent posts at Absolute Rights, here is a summary of them. And you won’t want to miss my next one there, which reveals how totally I am in touch with the young people of America today and even features an up-to-date pop cultural reference to the rock star Kate Perry.</p><p> <a href=\"http://www.absoluterights.com/kill-immigration-reform-or-kill-america/\">Kill Immigration Reform or Kill America</a></p><p>The problem is that immigrants and Americans alike want to live in<br> the America that was the result of 1950s America, but most immigrants<br> and many Americans have proven themselves completely incapable of doing<br> so without destroying it. If passed, Obama’s immigration reform will<br> transform the entire nation in much the same way that his health care<br> reform has transformed the health care industry. In other words, it will<br> prove to be an expensive and poorly-managed blunder that will destroy<br> what it purports to be saving without benefitting the very people it was<br> supposed to help.</br></br></br></br></br></br></br></br></p><p>It is long past time for Americans to grow up and realize that there<br> is nothing magical about American geography. It will not transform<br> peasants into productive middle-class businessmen and it will not<br> convert barbarians into civilized men and women.</br></br></br></p><p> <a href=\"http://www.absoluterights.com/the-game-of-race-hate/\">The Game of Race Hate</a></p><p>The Civil Rights Movement has failed. Forced integration has failed.<br> Martin Luther King’s dream has become a nightmare, in which men are<br> neither judged by the content of their character or the color of their<br> skin. And where there is no judgment, no civilization is possible.</br></br></br></p><p><a href=\"http://www.absoluterights.com/its-still-the-economy-stupid/\"><br/></a><br> <a href=\"http://www.absoluterights.com/its-still-the-economy-stupid/\">It’s Still the Economy, Stupid</a></br></p><p>It might seem strange to the non-economist that it never occurs to the professional economists that household debt, relative to income, might be a root cause of the problem rather than a symptom. After all, it’s hard to buy more consumer goods when most of your income is already going to paying off your mortage, your credit card, your student loan, and your manufacturer-financed car.</p><p>But the obvious is the impossible to the mainstream economists, because their Neo-Keynesian economic models consider debt exogenous to the system and therefore ruled out as a potential cause by definition.</p><p>The stagflation of the 1970s blew up conventional Keynesian economy theory. It is now looking increasingly likely that the debt disinflation of the 2010s will destroy the Neo-Keynesian theory that resulted from that previous failure.</p><p>Economics needs new and better models.</p></div>",
  "content_text": "In case you’ve missed my recent posts at Absolute Rights, here is a summary of them. And you won’t want to miss my next one there, which reveals how totally I am in touch with the young people of America today and even features an up-to-date pop cultural reference to the rock star Kate Perry.\nKill Immigration Reform or Kill America\nThe problem is that immigrants and Americans alike want to live in\nthe America that was the result of 1950s America, but most immigrants\nand many Americans have proven themselves completely incapable of doing\nso without destroying it. If passed, Obama’s immigration reform will\ntransform the entire nation in much the same way that his health care\nreform has transformed the health care industry. In other words, it will\nprove to be an expensive and poorly-managed blunder that will destroy\nwhat it purports to be saving without benefitting the very people it was\nsupposed to help.\nIt is long past time for Americans to grow up and realize that there\nis nothing magical about American geography. It will not transform\npeasants into productive middle-class businessmen and it will not\nconvert barbarians into civilized men and women.\nThe Game of Race Hate\nThe Civil Rights Movement has failed. Forced integration has failed.\nMartin Luther King’s dream has become a nightmare, in which men are\nneither judged by the content of their character or the color of their\nskin. And where there is no judgment, no civilization is possible.\nIt’s Still the Economy, Stupid\nIt might seem strange to the non-economist that it never occurs to the professional economists that household debt, relative to income, might be a root cause of the problem rather than a symptom. After all, it’s hard to buy more consumer goods when most of your income is already going to paying off your mortage, your credit card, your student loan, and your manufacturer-financed car.\nBut the obvious is the impossible to the mainstream economists, because their Neo-Keynesian economic models consider debt exogenous to the system and therefore ruled out as a potential cause by definition.\nThe stagflation of the 1970s blew up conventional Keynesian economy theory. It is now looking increasingly likely that the debt disinflation of the 2010s will destroy the Neo-Keynesian theory that resulted from that previous failure.\nEconomics needs new and better models.",
  "tags": [
    "Absolute Rights"
  ],
  "categories": [],
  "sitemap_lastmod": "2013-11-27T09:21:00+00:00"
}