{
  "url": "https://voxday.net/2013/11/01/rules-of-writing-v/",
  "scraped_at": "2025-12-15T16:35:27.173794",
  "title": "Rules of Writing V",
  "date_display": "November 1, 2013",
  "date_iso": "2013-11-01T10:18:00+00:00",
  "date_from_url": "2013-11-01",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p><b>5. Thou shalt remember that there are four primary elements of a novel</b></p><p>Of the elements of a novel there are four, and four shall be the number of the elements. To two elements thou shalt not limit thyself, neither shalt thou write three, excepting in that thou proceedeth to four.</p><p>What are the four elements? They are the four foundations upon which I base my book reviews. Prose, Plot, Characters, and Ideas.</p><p>This identification of the four elements relates to the problem we discussed yesterday with a considerable amount of what is best described as women’s fiction, or if one prefers, fiction that merely happens to be predominantly written by women, published by women, and read by women. Which is to say most fiction today. For example, yesterday there were two very different takes on the writer Alice Munro, whose anthology of short stories presently heads the New York Times bestseller’s list.</p><p>Cretin wrote: <i>“Alice Munro’s short stories are gifts to any reader with a discerning<br> eye and who is attracted to beautiful and insightful prose.” </br></i></p><p>Holmwood agreed, but added: <i>“I’m willing to stipulate that she deserved the Nobel. She is a much more<br> talented prose artist than Vox Day or Larry Correia or Tom Clancy. But so what? The prose was indeed<br> fantastic. The content was hideously dull, pedestrian and outright<br> annoying.”</br></br></br></i></p><p>In other words, Ms Munro’s work is exceptionally strong in the first element, but apparently much weaker in the other three. That is enough to appeal to a certain type of reader, of whom there are clearly enough to land an author on the bestseller lists, but leaves a statistically significant group of readers totally uninterested in her books.  Clancy was notoriously tight with his Plot. Correia is strong on both Plot and Characters. I suspect most readers would say that I fare best in the Ideas compartment, with Prose being my area of weakness.</p><p>The point is that it’s not enough to write well, not even exceptionally well. One still has to write ABOUT SOMETHING. One could theoretically write a stylistically beautiful grocery list, or compose a litany of personal grievances that is full of literary pyrotechnics, but at the end of the day, what one has is a lovely wrapped box with nothing in it. If the end result of all the gorgeous prose is a finger-wagging lecture to Be Nice or Be Yourself or Sexiss is Bad, it’s worse than a box of nothing, it’s as if the author has condemned the reader to open a gift-wrapped fart.</p><p>What distinguishes a great novel from lesser novels is that all four elements are strong and in balance with each other. Let’s consider two very well-known novels, one that is considered great and one that is considered well-loved, but not great, and see how they fall into the four categories.</p><p><i>War and Peace</i> by Leo Tolstoy</p><p>Prose: “Tolstoy was instrumental in bringing a new kind of consciousness to the<br> novel. His narrative structure is noted for its “god-like” ability to<br> hover over and within events, but also in the way it swiftly and<br> seamlessly portrayed a particular character’s point of view. His use of<br> visual detail is often cinematic in its scope, using the literary<br> equivalents of panning, wide shots and close-ups, to give dramatic<br> interest to battles and ballrooms alike. These devices, while not<br> exclusive to Tolstoy, are part of the new style of the novel that arose<br> in the mid-19th century and of which Tolstoy proved himself a master.” 10/10</br></br></br></br></br></br></br></br></p><p>Plot: Let’s just say “check” and leave it at that. It’s freaking <i>WAR AND PEACE</i>. 10/10</p><p>Characters: Powerful portraits of everyone from real historical characters to the fictional aristocrats of the five families. While perhaps not as unforgettable as the characters from <i>Anna Karenina</i>, the fact that the author wrote <i>Anna Karenina</i> should suffice to prove that he was more than competent when it came to characterizations. 9/10</p><p>Ideas: Brilliant. Mind-blowingly brilliant and may have inspired Kondratiev, Schumpeter, and Prechter.  “The 19th century Great Man Theory claims that historical events are the result of the actions of “heroes” and other great individuals, Tolstoy argues that this is impossible because of how rarely these actions result in great historical events. Rather, he argues, great historical events are the result of many smaller events driven by the thousands of individuals involved, (he compares this to Calculus, and the sum of infinitesimals). He then goes on to argue that these smaller events are the result of an inverse relationship between necessity and free-will, necessity being based on reason and therefore explainable by historical analysis, and free-will being based on “consciousness” and therefore inherently unpredictable.” 10/10</p><p>Total: 39/40. Verdict: Great Novel.</p><p><i>The Lion, the Witch, and the Wardrobe</i> by CS Lewis</p><p>Prose: Effective, evocative, but aimed at children. 7/10</p><p>Plot: Fast-paced, efficient, and entertaining from start to finish. Too short to harbor any twists and turns beyond the resurrection. 8/10</p><p>Characters: Flawless and unforgettable. Even the secondary characters, like Trumpkin and the captain of the White Witch’s secret police, Maugrim, are powerfully portrayed. 10/10</p><p>Ideas: Clever, but derivative. From the concept of the closet to another world borrowed from George MacDonald’s <i>The Princess and the Goblin</i> to the entire world being a parable for the Christian religion, Lewis is putting a fresh and shiny polish on existing ideas. 6/10.</p><p>Total: 31/40. Verdict: Good book, but without such exceptional characters and the power of the Christian narrative, would probably have been forgotten by now.</p><p>So, the reason we see the Tolstoy book as being a Great Novel while the best-known, most successful Lewis book is merely a well-loved novel is because the Prose and the Idea elements are stronger in Tolstoy.</p><p>Most fiction is lacking in two elements. Historically, the so-called male genres tended to be lacking in Prose and Characters. The female genres tended to be lacking in Prose, Plot, and Ideas since most woman-written fiction utilizes a single plot: will the reader’s representative choose Male A or Male B?(1)  I suspect this is why female writers historically tended to be more successful in the mystery genre; the structural limits imposed upon the genre by its nature tended to reduce ability to rely upon The One Plot.</p><p>What changed over the last forty years in SF/F is that more writers of both sexes with stronger, better-trained Prose skills and a greater interest in Characters entered the field, but what they didn’t realize is that they had little in the way of Ideas and their substitution of conventional and feminist left-wing ideology for original Ideas tended to cripple their Characters despite their greater interest in it.</p><p>So, whether you make use of an outline or you are disposed towards simply making up your story as you go along, you should be cognizant of what you, as a writer, have to offer the reader in terms of the four primary elements. No writer has it all; we all have strengths in some areas and weaknesses in the other. And whether one decides to try to shore up a weakness or compensate for it by providing excellence in one particular area, understanding where one’s strengths and weaknesses are should help one write better fiction.</p><p> <i>(1) There is also the thinly disguised alternative to The One Plot, in which Male B is actually herself, her freedom, her education, her career, etc. It would be interesting to research what percentage of female fiction boils down to dithering between two options for several hundred pages. It’s basically shopping by proxy.</i><br> <a href=\"http://en.wikipedia.org/wiki/War_and_Peace#cite_note-j1-10\"></a></br></p></div>",
  "content_text": "5. Thou shalt remember that there are four primary elements of a novel\nOf the elements of a novel there are four, and four shall be the number of the elements. To two elements thou shalt not limit thyself, neither shalt thou write three, excepting in that thou proceedeth to four.\nWhat are the four elements? They are the four foundations upon which I base my book reviews. Prose, Plot, Characters, and Ideas.\nThis identification of the four elements relates to the problem we discussed yesterday with a considerable amount of what is best described as women’s fiction, or if one prefers, fiction that merely happens to be predominantly written by women, published by women, and read by women. Which is to say most fiction today. For example, yesterday there were two very different takes on the writer Alice Munro, whose anthology of short stories presently heads the New York Times bestseller’s list.\nCretin wrote:\n“Alice Munro’s short stories are gifts to any reader with a discerning\neye and who is attracted to beautiful and insightful prose.”\nHolmwood agreed, but added:\n“I’m willing to stipulate that she deserved the Nobel. She is a much more\ntalented prose artist than Vox Day or Larry Correia or Tom Clancy. But so what? The prose was indeed\nfantastic. The content was hideously dull, pedestrian and outright\nannoying.”\nIn other words, Ms Munro’s work is exceptionally strong in the first element, but apparently much weaker in the other three. That is enough to appeal to a certain type of reader, of whom there are clearly enough to land an author on the bestseller lists, but leaves a statistically significant group of readers totally uninterested in her books.  Clancy was notoriously tight with his Plot. Correia is strong on both Plot and Characters. I suspect most readers would say that I fare best in the Ideas compartment, with Prose being my area of weakness.\nThe point is that it’s not enough to write well, not even exceptionally well. One still has to write ABOUT SOMETHING. One could theoretically write a stylistically beautiful grocery list, or compose a litany of personal grievances that is full of literary pyrotechnics, but at the end of the day, what one has is a lovely wrapped box with nothing in it. If the end result of all the gorgeous prose is a finger-wagging lecture to Be Nice or Be Yourself or Sexiss is Bad, it’s worse than a box of nothing, it’s as if the author has condemned the reader to open a gift-wrapped fart.\nWhat distinguishes a great novel from lesser novels is that all four elements are strong and in balance with each other. Let’s consider two very well-known novels, one that is considered great and one that is considered well-loved, but not great, and see how they fall into the four categories.\nWar and Peace\nby Leo Tolstoy\nProse: “Tolstoy was instrumental in bringing a new kind of consciousness to the\nnovel. His narrative structure is noted for its “god-like” ability to\nhover over and within events, but also in the way it swiftly and\nseamlessly portrayed a particular character’s point of view. His use of\nvisual detail is often cinematic in its scope, using the literary\nequivalents of panning, wide shots and close-ups, to give dramatic\ninterest to battles and ballrooms alike. These devices, while not\nexclusive to Tolstoy, are part of the new style of the novel that arose\nin the mid-19th century and of which Tolstoy proved himself a master.” 10/10\nPlot: Let’s just say “check” and leave it at that. It’s freaking\nWAR AND PEACE\n. 10/10\nCharacters: Powerful portraits of everyone from real historical characters to the fictional aristocrats of the five families. While perhaps not as unforgettable as the characters from\nAnna Karenina\n, the fact that the author wrote\nAnna Karenina\nshould suffice to prove that he was more than competent when it came to characterizations. 9/10\nIdeas: Brilliant. Mind-blowingly brilliant and may have inspired Kondratiev, Schumpeter, and Prechter.  “The 19th century Great Man Theory claims that historical events are the result of the actions of “heroes” and other great individuals, Tolstoy argues that this is impossible because of how rarely these actions result in great historical events. Rather, he argues, great historical events are the result of many smaller events driven by the thousands of individuals involved, (he compares this to Calculus, and the sum of infinitesimals). He then goes on to argue that these smaller events are the result of an inverse relationship between necessity and free-will, necessity being based on reason and therefore explainable by historical analysis, and free-will being based on “consciousness” and therefore inherently unpredictable.” 10/10\nTotal: 39/40. Verdict: Great Novel.\nThe Lion, the Witch, and the Wardrobe\nby CS Lewis\nProse: Effective, evocative, but aimed at children. 7/10\nPlot: Fast-paced, efficient, and entertaining from start to finish. Too short to harbor any twists and turns beyond the resurrection. 8/10\nCharacters: Flawless and unforgettable. Even the secondary characters, like Trumpkin and the captain of the White Witch’s secret police, Maugrim, are powerfully portrayed. 10/10\nIdeas: Clever, but derivative. From the concept of the closet to another world borrowed from George MacDonald’s\nThe Princess and the Goblin\nto the entire world being a parable for the Christian religion, Lewis is putting a fresh and shiny polish on existing ideas. 6/10.\nTotal: 31/40. Verdict: Good book, but without such exceptional characters and the power of the Christian narrative, would probably have been forgotten by now.\nSo, the reason we see the Tolstoy book as being a Great Novel while the best-known, most successful Lewis book is merely a well-loved novel is because the Prose and the Idea elements are stronger in Tolstoy.\nMost fiction is lacking in two elements. Historically, the so-called male genres tended to be lacking in Prose and Characters. The female genres tended to be lacking in Prose, Plot, and Ideas since most woman-written fiction utilizes a single plot: will the reader’s representative choose Male A or Male B?(1)  I suspect this is why female writers historically tended to be more successful in the mystery genre; the structural limits imposed upon the genre by its nature tended to reduce ability to rely upon The One Plot.\nWhat changed over the last forty years in SF/F is that more writers of both sexes with stronger, better-trained Prose skills and a greater interest in Characters entered the field, but what they didn’t realize is that they had little in the way of Ideas and their substitution of conventional and feminist left-wing ideology for original Ideas tended to cripple their Characters despite their greater interest in it.\nSo, whether you make use of an outline or you are disposed towards simply making up your story as you go along, you should be cognizant of what you, as a writer, have to offer the reader in terms of the four primary elements. No writer has it all; we all have strengths in some areas and weaknesses in the other. And whether one decides to try to shore up a weakness or compensate for it by providing excellence in one particular area, understanding where one’s strengths and weaknesses are should help one write better fiction.\n(1) There is also the thinly disguised alternative to The One Plot, in which Male B is actually herself, her freedom, her education, her career, etc. It would be interesting to research what percentage of female fiction boils down to dithering between two options for several hundred pages. It’s basically shopping by proxy.",
  "tags": [
    "Rules of Writing"
  ],
  "categories": [],
  "sitemap_lastmod": "2013-11-01T10:18:00+00:00"
}