{
  "url": "https://voxday.net/2013/11/07/running-down-scalzi-ii/",
  "scraped_at": "2025-12-15T16:36:02.821334",
  "title": "Running down John Scalzi II",
  "date_display": "November 7, 2013",
  "date_iso": "2013-11-07T09:54:00+00:00",
  "date_from_url": "2013-11-07",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>Nearly a year ago, I observed that this blog <a href=\"http://www.milobookclub.com/2012/12/26/running-down-john-scalzi/\">appeared to be the verge of catching up</a> to McRapey’s Magnum Opus, The Most Popular Blog in Science Fiction with 50,000 DAILY READERS, in terms of its pageview traffic. This was very surprising to me, as for some time before then, various trolls and rabbits had been insistent that my views were irrelevant because no one was interested in them. They were forthright in declaring that only a few thousand extremist right-wing outliers read VP, which couldn’t possibly bear comparison with a massively popular blog like Whatever.</p><p>As recently as 26 December, 2012, I still believed the hype. I honestly thought McRapey must have meant “visits” rather than “views” when he reported 8 million views for Whatever in 2012. After all, I knew my own blogs had nearly 7.8 million views.</p><p><i>“Is it credible that the readership for VP+AG is actually that close to<br> the Whatever readership?  No, I don’t think so.  I think Scalzi is using<br> the term “view” improperly and should be using “visit”.”  </br></br></i></p><p>Ah, how innocent we were! Despite being John Scalzi’s <i>bête noire</i>, I didn’t have a proper grasp of what a lying, self-promoting little snake he is. These days, thanks to <a href=\"http://www.anonymousconservative.com/\">Anonymous Conservative</a>, we now understand exactly what McRapey and the other rabbits were doing. They’re like demons constantly whispering “you don’t matter, nobody loves you, why don’t you just give up” into the ears of bullied teenagers.</p><p>There were some readers who were skeptical of my observations concerning traffic, pointing, not unreasonably, to Alexa. I readily admitted that VP was still considerably behind Whatever in the Alexa rankings, although I was starting to understand that this was merely an artifact of the ranking system being less reliable than Google Analytics: <i>“For what it’s worth, Alexa has scalzi.com, which hosts Whatever, at 12,996 in the USA.  Vox Popoli is 29,426.  Alpha Game is 73,183.”</i></p><p>So, in light of that, perhaps you can understand that I was a little amused when, after having <a href=\"http://www.milobookclub.com/2013/08/27/gotcha/\">exposed McRapey’s false claims of popularity</a> earlier this fall, I observed this in the Alexa rankings today.</p><p><b>scalzi.com</b><br> 109,589 Global rank<br>44,648 USA rank<br> 4,857 sites linking in<br> <b><br> </br></b><b>voxday.blogspot.com</b><br>108,511 Global rank<br>22,967 USA rank<br> 920 sites linking in</br></br></br></br></br></br></br></p><p><b>alphagameplan.blogspot.com</b><br> 179,597 Global rank<br>53,907 USA rank<br> 311 sites linking in</br></br></br></p><p>There are one or two interesting details one can observe there beyond the fact that Vox Popoli has now passed up a declining Whatever in Alexa terms, both globally and in the USA. McRapey’s self-promotion appears to be considerable, but inefficient, as he requires thousands more site links, and tens of thousands more Twitter followers to produce fewer, less-engaged blog readers. Despite the Chief Gamma Rabbit’s occasional attempts to denigrate Game, one can’t help but notice that Alpha Game is also rapidly catching up to the warren.</p><p>John Scalzi is a big fat fraud. He’s the Bernie Madoff of science fiction, having built his Hubbardesque SF career with smoke, mirrors, and sleight of hand. The fact is that leftists are seldom as popular, as influential, or as inevitable as they claim themselves to be. They readily resort to The Big Lie whenever it serves their interests, and their interest is usually focused on exaggerating their importance and their numbers. What I have learned from this is to never, EVER take a Leftist’s claims on faith. Always verify them, and quite often you will be surprised to discover in the process how brazenly they tried to slip one past you.</p><p>Now, I have no doubt that Scalzi’s remaining rabbits will hasten to move the goalposts yet again and point out that he sells more books than I do. And that, at least, is true. For now. Of course, in light of how the other metrics to which they previously appealed have tumbled one by one, how long can they be certain the final one will last? Winter is coming… and so is <i>Quantum Mortis</i>.</p><p><a href=\"https://s3.amazonaws.com/com.alexa.toolbar/atbp/mG_VLJ/download/index.htm\" style=\"clear: left; float: left; margin-bottom: 1em; margin-right: 1em;\"><noscript><img alt=\"Download the VP toolbar\" decoding=\"async\" src=\"http://www.alexa.com/tbplatform/images/promotebuttons/blue/TB-banner1-1.jpg\"/></noscript><img alt=\"Download the VP toolbar\" class=\"lazyload\" data-src=\"http://www.alexa.com/tbplatform/images/promotebuttons/blue/TB-banner1-1.jpg\" decoding=\"async\" src=\"data:image/svg+xml,%3Csvg%20xmlns=%22http://www.w3.org/2000/svg%22%20viewBox=%220%200%20210%20140%22%3E%3C/svg%3E\"/></a>On a tangential note, I also discovered Alexa has a custom toolbar that is in beta, played around with it, and was a little shocked to find out that it is rather useful. In addition to giving an easy way to search this blog from anywhere and providing access to my updated game links and book recommendations, one can navigate more rapidly between the various comment threads by using the RSS feed pull-down menu. Anyhow, if you want to check it out and help me promote VP, click on the graphic to the left. </p><p>And if you have any ideas for improving the toolbar within the framework of what Alexa permits, please let me know. I have no idea why the text doesn’t always display the most recent post instead of a randomly selected one, but it is in beta and I suspect it might be a Feedburner thing anyway since Feedburner doesn’t always pick up the new posts right away.</p></div>",
  "content_text": "Nearly a year ago, I observed that this blog\nappeared to be the verge of catching up\nto McRapey’s Magnum Opus, The Most Popular Blog in Science Fiction with 50,000 DAILY READERS, in terms of its pageview traffic. This was very surprising to me, as for some time before then, various trolls and rabbits had been insistent that my views were irrelevant because no one was interested in them. They were forthright in declaring that only a few thousand extremist right-wing outliers read VP, which couldn’t possibly bear comparison with a massively popular blog like Whatever.\nAs recently as 26 December, 2012, I still believed the hype. I honestly thought McRapey must have meant “visits” rather than “views” when he reported 8 million views for Whatever in 2012. After all, I knew my own blogs had nearly 7.8 million views.\n“Is it credible that the readership for VP+AG is actually that close to\nthe Whatever readership?  No, I don’t think so.  I think Scalzi is using\nthe term “view” improperly and should be using “visit”.”\nAh, how innocent we were! Despite being John Scalzi’s\nbête noire\n, I didn’t have a proper grasp of what a lying, self-promoting little snake he is. These days, thanks to\nAnonymous Conservative\n, we now understand exactly what McRapey and the other rabbits were doing. They’re like demons constantly whispering “you don’t matter, nobody loves you, why don’t you just give up” into the ears of bullied teenagers.\nThere were some readers who were skeptical of my observations concerning traffic, pointing, not unreasonably, to Alexa. I readily admitted that VP was still considerably behind Whatever in the Alexa rankings, although I was starting to understand that this was merely an artifact of the ranking system being less reliable than Google Analytics:\n“For what it’s worth, Alexa has scalzi.com, which hosts Whatever, at 12,996 in the USA.  Vox Popoli is 29,426.  Alpha Game is 73,183.”\nSo, in light of that, perhaps you can understand that I was a little amused when, after having\nexposed McRapey’s false claims of popularity\nearlier this fall, I observed this in the Alexa rankings today.\nscalzi.com\n109,589 Global rank\n44,648 USA rank\n4,857 sites linking in\nvoxday.blogspot.com\n108,511 Global rank\n22,967 USA rank\n920 sites linking in\nalphagameplan.blogspot.com\n179,597 Global rank\n53,907 USA rank\n311 sites linking in\nThere are one or two interesting details one can observe there beyond the fact that Vox Popoli has now passed up a declining Whatever in Alexa terms, both globally and in the USA. McRapey’s self-promotion appears to be considerable, but inefficient, as he requires thousands more site links, and tens of thousands more Twitter followers to produce fewer, less-engaged blog readers. Despite the Chief Gamma Rabbit’s occasional attempts to denigrate Game, one can’t help but notice that Alpha Game is also rapidly catching up to the warren.\nJohn Scalzi is a big fat fraud. He’s the Bernie Madoff of science fiction, having built his Hubbardesque SF career with smoke, mirrors, and sleight of hand. The fact is that leftists are seldom as popular, as influential, or as inevitable as they claim themselves to be. They readily resort to The Big Lie whenever it serves their interests, and their interest is usually focused on exaggerating their importance and their numbers. What I have learned from this is to never, EVER take a Leftist’s claims on faith. Always verify them, and quite often you will be surprised to discover in the process how brazenly they tried to slip one past you.\nNow, I have no doubt that Scalzi’s remaining rabbits will hasten to move the goalposts yet again and point out that he sells more books than I do. And that, at least, is true. For now. Of course, in light of how the other metrics to which they previously appealed have tumbled one by one, how long can they be certain the final one will last? Winter is coming… and so is\nQuantum Mortis\n.\nOn a tangential note, I also discovered Alexa has a custom toolbar that is in beta, played around with it, and was a little shocked to find out that it is rather useful. In addition to giving an easy way to search this blog from anywhere and providing access to my updated game links and book recommendations, one can navigate more rapidly between the various comment threads by using the RSS feed pull-down menu. Anyhow, if you want to check it out and help me promote VP, click on the graphic to the left.\nAnd if you have any ideas for improving the toolbar within the framework of what Alexa permits, please let me know. I have no idea why the text doesn’t always display the most recent post instead of a randomly selected one, but it is in beta and I suspect it might be a Feedburner thing anyway since Feedburner doesn’t always pick up the new posts right away.",
  "tags": [
    "McRapey",
    "technology"
  ],
  "categories": [],
  "sitemap_lastmod": "2013-11-07T09:54:00+00:00"
}