{
  "url": "https://voxday.net/2013/11/28/saving-sf-from-strong-female-characters/",
  "scraped_at": "2025-12-15T16:38:15.436562",
  "title": "Saving SF from Strong Female Characters IV",
  "date_display": "November 28, 2013",
  "date_iso": "2013-11-28T14:00:00+00:00",
  "date_from_url": "2013-11-28",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>The fourth installment in <a href=\"http://www.scifiwright.com/2013/11/saving-science-fiction-from-strong-female-characters-part-4/\">John C. Wright’s detailed explication</a> of one of Pink SF’s barbaric ills and the various ideological and religious reasons that underlie it:</p><blockquote class=\"tr_bq\"><p> My objection is to falseness, insincerity, propaganda, bad drama, bad art, and treason against the muses.  My objection is to using art for propaganda purposes. My objection is to Politically Correct piety. My objection is to the Thought Police.</p><p>My objection is to the spirit of totalitarianism.</p><p>For about ten years now, I have been writing and posting essays and articles on my electronic journal, and in all that time, I have been subjected to the Leftist mob tactics of mass hatred once and once only. It was the time I mocked the Sci-Fi Channel for kowtowing to Political Correctness. My motive for objecting was perfectly clear to everyone: I would like to write without censorship, formal or informal, based on political considerations. Formal censorship is state enforced; informal is enforced by organized mob-tactics, minority pressure groups, yelling, screaming, boycotts, hysteria mob-tactics and general bullying.</p><p>Because I would like to write without informal censorship interfering with my livelihood, I objected to Sci-Fi channel, or anyone in my field, surrendering to the minority pressure groups screaming and yelling and mob-tactics and bullying. So I mocked the Sci-Fi channel for encouraging the bullies by bowing in the knee to them.</p><p>And in return the mob tried to bully me, of all people. As if I give a tinker’s damn for the opinions of these yowling halfwits. (There was exactly one person of the seven hundred or so who wrote in to me who seemed sincerely offended, and to him I apologized. To remaining six hundred and ninety-nine or so, I offered defiance in public, and in private prayed for their fool souls, hoping despite all appearances they were not damned fools.)</p><p>This taught me a lesson, but not the one the mob organizers wanted to teach. It taught me what they were afraid of. Not of me: no one can be afraid of a fat and balding nearsighted science fiction writer with a dull swordcane.</p><p>Nor were they offended by calling sodomites sexual perverts, which I have done frequently before and since, never eliciting a single angry comment in reply, or attracting the slightest notice.</p><p>Since my legions of drug-maddened terror troops are all stranded on Salusa Secondus, the third planet of Gamma Piscium, 138 lightyears away, surely they are not afraid of any physical force I can bring to bear. Neither am I in a position to deny any man any economic opportunities, nor am I influential enough to provoke public opinion or create any controversy. I doubt I could even do as much myself against them as they have done to me, such as hack a Wikipedia page or send around an open letter and expect it to be published and reprinted.</p><p>To explain what they are afraid of, I am afraid I have to explain something of the pathology of Leftism.</p><p>They actually think they are fooling us.</p></blockquote><p>Pink SF/F is a crystal-clear picture of Dunning-Kruger effect in action. Which is ironic, considering that the pinkshirts love to cite that effect, almost always inappropriately.  As Wright wryly notes:</p><p><i>“They think they are smarter than us. These undereducated boobs who cannot follow a syllogism of three<br> steps, who do not speak a word of Greek or Latin, who do not know the<br> difference between Arianism and Aryanism, who have never read ORIGIN OF<br> SPECIES or DAS KAPITAL or THE REPUBLIC and who do not even know the<br> intellectual parentage of all their ideas, these vaunting cretins whose<br> arguments consist of nothing but tiresome talking points recited by rote<br> and flaccid ad hominem, whose opinions are based on fashion, they, of<br> all people, think they are smarter than the rest of the world.”</br></br></br></br></br></br></br></i></p><p>Because degrees. Never mind that these magic credentials primarily consist of being willing to go into debt in order to obediently listen to serial monologues by poorly-read academics with no experience of the real world. <br> <i><br/></i><br> I don’t think I’ll ever forget being called “parochial” by a fan of a monolingual Canadian who grew up in the sticks of Western Ontario, graduated with an MA from the University of Western Ontario, and now lives in Canada’s <i>15th largest municipality</i>, which happens to be located in southwestern Ontario. That, more than anything, made it obvious that Pink SF not only has no interest in reality, but can’t recognize it even when it is standing right in front of them, poking them in the nose.</br></br></p></div>",
  "content_text": "The fourth installment in\nJohn C. Wright’s detailed explication\nof one of Pink SF’s barbaric ills and the various ideological and religious reasons that underlie it:\nMy objection is to falseness, insincerity, propaganda, bad drama, bad art, and treason against the muses.  My objection is to using art for propaganda purposes. My objection is to Politically Correct piety. My objection is to the Thought Police.\nMy objection is to the spirit of totalitarianism.\nFor about ten years now, I have been writing and posting essays and articles on my electronic journal, and in all that time, I have been subjected to the Leftist mob tactics of mass hatred once and once only. It was the time I mocked the Sci-Fi Channel for kowtowing to Political Correctness. My motive for objecting was perfectly clear to everyone: I would like to write without censorship, formal or informal, based on political considerations. Formal censorship is state enforced; informal is enforced by organized mob-tactics, minority pressure groups, yelling, screaming, boycotts, hysteria mob-tactics and general bullying.\nBecause I would like to write without informal censorship interfering with my livelihood, I objected to Sci-Fi channel, or anyone in my field, surrendering to the minority pressure groups screaming and yelling and mob-tactics and bullying. So I mocked the Sci-Fi channel for encouraging the bullies by bowing in the knee to them.\nAnd in return the mob tried to bully me, of all people. As if I give a tinker’s damn for the opinions of these yowling halfwits. (There was exactly one person of the seven hundred or so who wrote in to me who seemed sincerely offended, and to him I apologized. To remaining six hundred and ninety-nine or so, I offered defiance in public, and in private prayed for their fool souls, hoping despite all appearances they were not damned fools.)\nThis taught me a lesson, but not the one the mob organizers wanted to teach. It taught me what they were afraid of. Not of me: no one can be afraid of a fat and balding nearsighted science fiction writer with a dull swordcane.\nNor were they offended by calling sodomites sexual perverts, which I have done frequently before and since, never eliciting a single angry comment in reply, or attracting the slightest notice.\nSince my legions of drug-maddened terror troops are all stranded on Salusa Secondus, the third planet of Gamma Piscium, 138 lightyears away, surely they are not afraid of any physical force I can bring to bear. Neither am I in a position to deny any man any economic opportunities, nor am I influential enough to provoke public opinion or create any controversy. I doubt I could even do as much myself against them as they have done to me, such as hack a Wikipedia page or send around an open letter and expect it to be published and reprinted.\nTo explain what they are afraid of, I am afraid I have to explain something of the pathology of Leftism.\nThey actually think they are fooling us.\nPink SF/F is a crystal-clear picture of Dunning-Kruger effect in action. Which is ironic, considering that the pinkshirts love to cite that effect, almost always inappropriately.  As Wright wryly notes:\n“They think they are smarter than us. These undereducated boobs who cannot follow a syllogism of three\nsteps, who do not speak a word of Greek or Latin, who do not know the\ndifference between Arianism and Aryanism, who have never read ORIGIN OF\nSPECIES or DAS KAPITAL or THE REPUBLIC and who do not even know the\nintellectual parentage of all their ideas, these vaunting cretins whose\narguments consist of nothing but tiresome talking points recited by rote\nand flaccid ad hominem, whose opinions are based on fashion, they, of\nall people, think they are smarter than the rest of the world.”\nBecause degrees. Never mind that these magic credentials primarily consist of being willing to go into debt in order to obediently listen to serial monologues by poorly-read academics with no experience of the real world.\nI don’t think I’ll ever forget being called “parochial” by a fan of a monolingual Canadian who grew up in the sticks of Western Ontario, graduated with an MA from the University of Western Ontario, and now lives in Canada’s\n15th largest municipality\n, which happens to be located in southwestern Ontario. That, more than anything, made it obvious that Pink SF not only has no interest in reality, but can’t recognize it even when it is standing right in front of them, poking them in the nose.",
  "tags": [
    "SFWA",
    "writing"
  ],
  "categories": [],
  "sitemap_lastmod": "2013-11-28T14:00:00+00:00"
}