{
  "url": "https://voxday.net/2013/11/22/the-real-story-of-jfks-assassination_22/",
  "scraped_at": "2025-12-15T16:37:36.545956",
  "title": "The real story of JFK’s assassination",
  "date_display": "November 22, 2013",
  "date_iso": "2013-11-22T09:00:00+00:00",
  "date_from_url": "2013-11-22",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>And in retrospect, <i><a href=\"http://stupefyingstoriesshowcase.com/0131108/0131108-10.html\">it is so obvious</a></i>:</p><blockquote class=\"tr_bq\"><p>  Jackie<br> oughtn’t watch. Yet she waited, heart in wild rhythm, for The Kennedy<br> Conspiracy Theories to begin. Anniversaries of the incident were hard,<br> the ten years intervening barely helped. She would finally watch. Jackie<br> set aside the stack of papers from her latest volunteer committee. She<br> made her way across the plush aquamarine carpet and pushed the intercom<br> button.</br></br></br></br></br></br></p><p>“I’ll have lunch now. In my sitting room…The<br> usual Thursday diet plate will be fine. What’s on Ari’s calender?… In<br> Paris until Monday. Okay, then. Consuela? Bring a pitcher of dacquiris,<br> too.”</br></br></br></p><p>Jackie opened the drapes. The cold steel and<br> concrete of Fifth Avenue below looked nothing like Dallas in March. That<br> unpleasantness belongs to a different time and place. It doesn’t matter<br> anymore. She lit a cigarette with the big ceramic table lighter,<br> inhaling deeply.</br></br></br></br></p><p>When the maid left, Jackie turned the<br> television’s volume knob up. Words and images veered in and out of her<br> focus. The Warren Commission. Lee Harvey Oswald. The KGB. Castro… Did<br> someone else show up as well, with an agenda of his own? Everything<br> afterwards was a blur. She only remembered her silly hat.</br></br></br></br></p></blockquote></div>",
  "content_text": "And in retrospect,\nit is so obvious\n:\nJackie\noughtn’t watch. Yet she waited, heart in wild rhythm, for The Kennedy\nConspiracy Theories to begin. Anniversaries of the incident were hard,\nthe ten years intervening barely helped. She would finally watch. Jackie\nset aside the stack of papers from her latest volunteer committee. She\nmade her way across the plush aquamarine carpet and pushed the intercom\nbutton.\n“I’ll have lunch now. In my sitting room…The\nusual Thursday diet plate will be fine. What’s on Ari’s calender?… In\nParis until Monday. Okay, then. Consuela? Bring a pitcher of dacquiris,\ntoo.”\nJackie opened the drapes. The cold steel and\nconcrete of Fifth Avenue below looked nothing like Dallas in March. That\nunpleasantness belongs to a different time and place. It doesn’t matter\nanymore. She lit a cigarette with the big ceramic table lighter,\ninhaling deeply.\nWhen the maid left, Jackie turned the\ntelevision’s volume knob up. Words and images veered in and out of her\nfocus. The Warren Commission. Lee Harvey Oswald. The KGB. Castro… Did\nsomeone else show up as well, with an agenda of his own? Everything\nafterwards was a blur. She only remembered her silly hat.",
  "tags": [
    "conspiracy"
  ],
  "categories": [],
  "sitemap_lastmod": "2013-11-22T09:00:00+00:00"
}