{
  "url": "https://voxday.net/2013/11/14/the-rule-of-law/",
  "scraped_at": "2025-12-15T16:36:51.209846",
  "title": "The rule of law",
  "date_display": "November 14, 2013",
  "date_iso": "2013-11-14T17:38:00+00:00",
  "date_from_url": "2013-11-14",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>It’s fascinating to see how the sacred and inviolate law proves to be <a href=\"http://www.breitbart.com/Big-Government/2013/11/14/obama-sell-canceled-policies\">so mutable in practice</a>:</p><blockquote class=\"tr_bq\"><p> Bowing to pressure, President Barack Obama intends to permit continued<br> sale of individual insurance plans that have been canceled because they<br> failed to meet coverage standards under the health care law, officials<br> said Thursday.<br> <br style=\"background-color: white; color: #111111; font-family: georgia, serif; font-size: 16px; line-height: 22px;\"><br> The decision was designed to ease the impact on millions of consumers<br> who have received cancellation notices in recent weeks, and also to try<br> to redeem a presidential promise that anyone who wanted to keep his<br> coverage under the law would be allowed to do so.<br> <br style=\"background-color: white; color: #111111; font-family: georgia, serif; font-size: 16px; line-height: 22px;\"><br> An announcement was expected in late morning.<br> <br style=\"background-color: white; color: #111111; font-family: georgia, serif; font-size: 16px; line-height: 22px;\"><br> Officials said the president would announce that insurers could continue<br> to sell existing individual policies to current customers for 2014,<br> even in cases of plans that had been ruled inadequate.</br></br></br></br></br></br></br></br></br></br></br></br></br></br></br></br></br></p></blockquote><p>In other words, he’s buying the techs a year to fix the system. Then everyone will lose their coverage again. Truly, this is conclusive evidence of Obama’s political mastery. No one, NO ONE, saw this fiendishly clever move coming.</p></div>",
  "content_text": "It’s fascinating to see how the sacred and inviolate law proves to be\nso mutable in practice\n:\nBowing to pressure, President Barack Obama intends to permit continued\nsale of individual insurance plans that have been canceled because they\nfailed to meet coverage standards under the health care law, officials\nsaid Thursday.\nThe decision was designed to ease the impact on millions of consumers\nwho have received cancellation notices in recent weeks, and also to try\nto redeem a presidential promise that anyone who wanted to keep his\ncoverage under the law would be allowed to do so.\nAn announcement was expected in late morning.\nOfficials said the president would announce that insurers could continue\nto sell existing individual policies to current customers for 2014,\neven in cases of plans that had been ruled inadequate.\nIn other words, he’s buying the techs a year to fix the system. Then everyone will lose their coverage again. Truly, this is conclusive evidence of Obama’s political mastery. No one, NO ONE, saw this fiendishly clever move coming.",
  "tags": [
    "politics"
  ],
  "categories": [],
  "sitemap_lastmod": "2013-11-14T17:38:00+00:00"
}