{
  "url": "https://voxday.net/2013/11/12/the-one-benefit-of-obamacare/",
  "scraped_at": "2025-12-15T16:36:31.717965",
  "title": "The one benefit of Obamacare",
  "date_display": "November 12, 2013",
  "date_iso": "2013-11-12T12:15:00+00:00",
  "date_from_url": "2013-11-12",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>Lost in all the reports of web site problems, presidential lies, and<br> millions of Americans losing their insurance have been the two real<br> crimes of Obamacare. The first crime is the way in which Obamacare does<br> not reform health insurance, but rather, eliminates it altogether.</br></br></br></p><p>Health insurance is a form of gambling. It is betting on one’s<br> ability to take care of one’s health except for the rare possibility of<br> unexpected and ruinously expensive catastrophes. It has very little to<br> do with going to the doctor, with birth control, or with the vast<br> majority of things that fall more properly under the heading of health<br> care services.</br></br></br></br></br></p><p>Read the rest <a href=\"http://www.absoluterights.com/the-one-benefit-of-obamacare/\">at Absolute Rights</a>. <br> <i><br/></i><br> <i>NB: I was recently offered a regular spot as a contributor at Absolute Rights, and since I’m no longer blogging at Black Gate, I figured I have the time to do so without having a negative effect on my posts here. I’ll be posting political items there a couple of times per week, so you may wish to consider adding it to your regular rotation.</i></br></br></p></div>",
  "content_text": "Lost in all the reports of web site problems, presidential lies, and\nmillions of Americans losing their insurance have been the two real\ncrimes of Obamacare. The first crime is the way in which Obamacare does\nnot reform health insurance, but rather, eliminates it altogether.\nHealth insurance is a form of gambling. It is betting on one’s\nability to take care of one’s health except for the rare possibility of\nunexpected and ruinously expensive catastrophes. It has very little to\ndo with going to the doctor, with birth control, or with the vast\nmajority of things that fall more properly under the heading of health\ncare services.\nRead the rest\nat Absolute Rights\n.\nNB: I was recently offered a regular spot as a contributor at Absolute Rights, and since I’m no longer blogging at Black Gate, I figured I have the time to do so without having a negative effect on my posts here. I’ll be posting political items there a couple of times per week, so you may wish to consider adding it to your regular rotation.",
  "tags": [
    "Absolute Rights",
    "politics"
  ],
  "categories": [],
  "sitemap_lastmod": "2013-11-12T12:15:00+00:00"
}