{
  "url": "https://voxday.net/2013/11/18/the-real-death-of-erwin-romme/",
  "scraped_at": "2025-12-15T16:37:12.574253",
  "title": "The real death of Erwin Rommel",
  "date_display": "November 18, 2013",
  "date_iso": "2013-11-18T14:00:00+00:00",
  "date_from_url": "2013-11-18",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p><a href=\"http://www.dailymail.co.uk/news/article-2509000/Doctors-notes-tell-SS-Rommel-plot-Report-reveals-physician-forced-heart-attack-death-certificate-cover-force-suicide.html\">This first-person account</a><br> of the death of the brilliant German general illustrates why one should<br> never believe the Official Government-Approved Histories:</br></br></p><blockquote class=\"tr_bq\"><p> A<br> seven-page report [Dr Friedrich Breiderhoff] made to Cologne police on<br> July 22 1960 has now been found in the city’s archive in which he<br> details how he was threatened with pain of death by an S.S. man to lie<br> on Rommel’s death certificate.</br></br></br></br></p><p>Dr Breiderhoff was<br> brought from his post at the reserve military hospital at Ulm where he<br> was the chief physician. He was told to inspect a person in a car<br> outside by two senior army officers. He told police: ‘It was Herr<br> Rommel.  His hat and his marshall’s baton were lying to the right of his<br> upper body on the floor.</br></br></br></br></br></p><p>“Then a man in civilian dress<br> appeared and ordered me to begin resuscitation attempts and told me<br> that I must not tell the staff that he was dead. I made a direct cardiac<br> injection and then attempts at resuscitation with heart massage and<br> breathing exercises, as if the Field Marshall had drowned.  I felt<br> completely that Rommel was a dead man already. Then an S.S. man ordered<br> me to remove the vomit from his mouth and I found an empty cyanide<br> capsule in his throat covered with brown and yellow mucus. I was then<br> ordered that I had to put ‘heart attack’ on the death certificate on the<br> express orders of the High Command of the Armed Forces.”</br></br></br></br></br></br></br></br></br></p></blockquote><p>Now,<br> I very much doubt that anyone still believes that Rommel died of<br> natural causes, but the point is that even when the factual information<br> is documented and in the possession of the government authorities, it<br> often fails to make its way out to the public.</br></br></br></br></p></div>",
  "content_text": "This first-person account\nof the death of the brilliant German general illustrates why one should\nnever believe the Official Government-Approved Histories:\nA\nseven-page report [Dr Friedrich Breiderhoff] made to Cologne police on\nJuly 22 1960 has now been found in the city’s archive in which he\ndetails how he was threatened with pain of death by an S.S. man to lie\non Rommel’s death certificate.\nDr Breiderhoff was\nbrought from his post at the reserve military hospital at Ulm where he\nwas the chief physician. He was told to inspect a person in a car\noutside by two senior army officers. He told police: ‘It was Herr\nRommel.  His hat and his marshall’s baton were lying to the right of his\nupper body on the floor.\n“Then a man in civilian dress\nappeared and ordered me to begin resuscitation attempts and told me\nthat I must not tell the staff that he was dead. I made a direct cardiac\ninjection and then attempts at resuscitation with heart massage and\nbreathing exercises, as if the Field Marshall had drowned.  I felt\ncompletely that Rommel was a dead man already. Then an S.S. man ordered\nme to remove the vomit from his mouth and I found an empty cyanide\ncapsule in his throat covered with brown and yellow mucus. I was then\nordered that I had to put ‘heart attack’ on the death certificate on the\nexpress orders of the High Command of the Armed Forces.”\nNow,\nI very much doubt that anyone still believes that Rommel died of\nnatural causes, but the point is that even when the factual information\nis documented and in the possession of the government authorities, it\noften fails to make its way out to the public.",
  "tags": [
    "conspiracy",
    "history"
  ],
  "categories": [],
  "sitemap_lastmod": "2013-11-18T14:00:00+00:00"
}