{
  "url": "https://voxday.net/2013/11/29/the-ahistorical-atheis/",
  "scraped_at": "2025-12-15T16:38:19.059073",
  "title": "The ahistorical atheist",
  "date_display": "November 29, 2013",
  "date_iso": "2013-11-29T09:06:00+00:00",
  "date_from_url": "2013-11-29",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>Armarium Magnum explains why so many atheists <a href=\"http://armariummagnus.blogspot.com/2013/11/why-history-isnt-scientific-and-why-it.html?m=1\">are historically illiterate</a>:</p><blockquote class=\"tr_bq\"><p> After 30+ years of observing and taking part in debates about history with many of my fellow atheists I can safely claim that most atheists are historically illiterate.  This is not particular to atheists:  they tend to be about as historically illiterate as most people, since historical illiteracy is pretty much the norm.   But it does mean that when most (not all) atheists comment about history or, worse, try to use history in debates about religion, they are usually doing so with a grasp of the subject that is stunted at about high school level.</p><p>This is hardly surprising, given that most people don’t study history past high school.  But it means their understanding of any given historical person, subject or event is (like that of most people), based on half-remembered school lessons, perhaps a TV documentary or two and popular culture: mainly novels and movies.  Which is why most atheists (like most people) have a grasp of history which is, to be brutally frank, largely crap.</p><p>Worse, this also means that most atheists (again, like most people) have a grasp of how history is studied and the techniques of historical analysis and synthesis which is also stunted at high school level – i.e. virtually non-existent.  With a few laudable exceptions, high school history teachers still tend to reduce history to facts and dates organised into themes or broad topics.  How we can know what happened in the past, with what degree of certitude we can know it and the techniques used to arrive at these conclusions are rarely more than touched on at this level.  This means that when the average atheist (yet again, like the average person generally) grasps that our knowledge of the past is not as cut and dried and clear as Mr Wilkins the history teacher gave us to understand, they tend to reject the whole thing as highly uncertain at best or subjective waffle at worst.  Or, as Grundy put it, as “crap”.</p><p>All this leads some atheists, who have fallen in to the fallacy of scientism and reject anything that can’t be definitively “proven”, to reject the idea of any degree of certainty about the past.  This is an extreme position and it’s rarely a consistent one.  As I’ve noted to some who have claimed this level of historical scepticism, I find it hard to believe they maintain this position when they read the newspaper, even though they should be just as sceptical about being able to know about a car accident yesterday as they are about knowing about a revolution 400 years ago.</p></blockquote><p>This is something I, too, have noticed with regards to many atheists, beginning with Bertrand Russell and Richard Dawkins. It is obvious they don’t know any more about history than they do about theology; no one who knows anything about history believes religion causes war, thinks that the Spanish Inquisition was one of the most lethal institutions in human history, or finds the assumption that Jesus was not a legitimate historical figure to be a reasonable one.</p><p>However, I do have to take exception to this statement: <i>“This rejection can be more pronounced in atheists, because<br> many (not all) come to their atheism via a study of science.</br></i><i>“</i> This observably isn’t true. Armarium Magnum has the order reversed. The vast majority of atheists become atheists as teenagers, before they have embarked upon any course of study, and they become atheists for reasons that are entirely emotional <i>by their own account</i>. They then turn to science for the explanations that they can no longer seek in religion, and are understandably disappointed and embittered when they cannot find them there either.</p><p>The reason the rejection is often more pronounced in atheists is because they are observably less rational than most people who are interested in history. No one who does not believe in the existence of gods through a rational process can legitimately call himself an atheist, for the obvious reason that it is impossible to rationally prove the non-existence of gods. An agnostic’s lack of god belief may have a rational basis, an atheist’s non-belief never can. Their irrationality not only makes them unusually susceptible to swallowing falsehoods that thirty seconds on Wikipedia would render obvious, but makes it hard for them to give up their ahistorical dogma.</p><blockquote class=\"tr_bq\"><p> What’s worse is that I’ve also experienced<br> atheists who have been shown extensive, clear evidence that the medieval Church<br> taught the earth was round and that the myth of medieval Flat Earth belief was<br> invented by the novelist Washington Irving in 1828, and they have simply<br> refused to believe that the myth could be wrong.<br/></br></br></br></br></p><div class=\"MsoNormal\"></div><div class=\"MsoNormal\"> Neat historical fables such as the ones about Christians<br> burning down the Great Library of Alexandria (they didn’t) or murdering Hypatia<br> because of their hatred of her learning and science (ditto) are appealing<br> parables.  Which means some atheists fight<br> tooth and nail to preserve them even when confronted with clear evidence that<br> they are pseudo historical fairy tales.  </br></br></br></br></br></div></blockquote><p>And before anyone angrily denounces Armarium Magnum as another theistic polemicist cut out of the same godbothering cloth as me, perhaps it should be noted that the gentleman is himself an atheist. It’s a good piece and I even learned something. It’s more than a little amusing to be informed that belief in the medieval belief in a flat earth is intellectually akin to belief in the Headless Horseman. And that will certainly make for a useful rhetorical device.</p></div>",
  "content_text": "Armarium Magnum explains why so many atheists\nare historically illiterate\n:\nAfter 30+ years of observing and taking part in debates about history with many of my fellow atheists I can safely claim that most atheists are historically illiterate.  This is not particular to atheists:  they tend to be about as historically illiterate as most people, since historical illiteracy is pretty much the norm.   But it does mean that when most (not all) atheists comment about history or, worse, try to use history in debates about religion, they are usually doing so with a grasp of the subject that is stunted at about high school level.\nThis is hardly surprising, given that most people don’t study history past high school.  But it means their understanding of any given historical person, subject or event is (like that of most people), based on half-remembered school lessons, perhaps a TV documentary or two and popular culture: mainly novels and movies.  Which is why most atheists (like most people) have a grasp of history which is, to be brutally frank, largely crap.\nWorse, this also means that most atheists (again, like most people) have a grasp of how history is studied and the techniques of historical analysis and synthesis which is also stunted at high school level – i.e. virtually non-existent.  With a few laudable exceptions, high school history teachers still tend to reduce history to facts and dates organised into themes or broad topics.  How we can know what happened in the past, with what degree of certitude we can know it and the techniques used to arrive at these conclusions are rarely more than touched on at this level.  This means that when the average atheist (yet again, like the average person generally) grasps that our knowledge of the past is not as cut and dried and clear as Mr Wilkins the history teacher gave us to understand, they tend to reject the whole thing as highly uncertain at best or subjective waffle at worst.  Or, as Grundy put it, as “crap”.\nAll this leads some atheists, who have fallen in to the fallacy of scientism and reject anything that can’t be definitively “proven”, to reject the idea of any degree of certainty about the past.  This is an extreme position and it’s rarely a consistent one.  As I’ve noted to some who have claimed this level of historical scepticism, I find it hard to believe they maintain this position when they read the newspaper, even though they should be just as sceptical about being able to know about a car accident yesterday as they are about knowing about a revolution 400 years ago.\nThis is something I, too, have noticed with regards to many atheists, beginning with Bertrand Russell and Richard Dawkins. It is obvious they don’t know any more about history than they do about theology; no one who knows anything about history believes religion causes war, thinks that the Spanish Inquisition was one of the most lethal institutions in human history, or finds the assumption that Jesus was not a legitimate historical figure to be a reasonable one.\nHowever, I do have to take exception to this statement:\n“This rejection can be more pronounced in atheists, because\nmany (not all) come to their atheism via a study of science.\n“\nThis observably isn’t true. Armarium Magnum has the order reversed. The vast majority of atheists become atheists as teenagers, before they have embarked upon any course of study, and they become atheists for reasons that are entirely emotional\nby their own account\n. They then turn to science for the explanations that they can no longer seek in religion, and are understandably disappointed and embittered when they cannot find them there either.\nThe reason the rejection is often more pronounced in atheists is because they are observably less rational than most people who are interested in history. No one who does not believe in the existence of gods through a rational process can legitimately call himself an atheist, for the obvious reason that it is impossible to rationally prove the non-existence of gods. An agnostic’s lack of god belief may have a rational basis, an atheist’s non-belief never can. Their irrationality not only makes them unusually susceptible to swallowing falsehoods that thirty seconds on Wikipedia would render obvious, but makes it hard for them to give up their ahistorical dogma.\nWhat’s worse is that I’ve also experienced\natheists who have been shown extensive, clear evidence that the medieval Church\ntaught the earth was round and that the myth of medieval Flat Earth belief was\ninvented by the novelist Washington Irving in 1828, and they have simply\nrefused to believe that the myth could be wrong.\nNeat historical fables such as the ones about Christians\nburning down the Great Library of Alexandria (they didn’t) or murdering Hypatia\nbecause of their hatred of her learning and science (ditto) are appealing\nparables.  Which means some atheists fight\ntooth and nail to preserve them even when confronted with clear evidence that\nthey are pseudo historical fairy tales.\nAnd before anyone angrily denounces Armarium Magnum as another theistic polemicist cut out of the same godbothering cloth as me, perhaps it should be noted that the gentleman is himself an atheist. It’s a good piece and I even learned something. It’s more than a little amusing to be informed that belief in the medieval belief in a flat earth is intellectually akin to belief in the Headless Horseman. And that will certainly make for a useful rhetorical device.",
  "tags": [
    "atheism",
    "history"
  ],
  "categories": [],
  "sitemap_lastmod": "2013-11-29T09:06:00+00:00"
}