{
  "url": "https://voxday.net/2013/11/06/the-new-rules-of-engagement_6/",
  "scraped_at": "2025-12-15T16:35:57.353824",
  "title": "The new rules of engagement",
  "date_display": "November 6, 2013",
  "date_iso": "2013-11-06T14:00:00+00:00",
  "date_from_url": "2013-11-06",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>This is why it is necessary to punch back twice as hard. This is why<br> you cannot let the poisonous ones into your social circle. This is why<br> you cannot employ them. This is why you cannot indulge in conspicuous<br> tolerance. As Athol Kay has learned, those to whom the personal is the<br> political and the political is the personal <a href=\"http://marriedmansexlife.com/2013/11/the-real-reason-the-blog-has-sucked-recently/?utm_source=feedburner&amp;utm_medium=feed&amp;utm_campaign=Feed%3A+MarriedManSexLife+%28Married+Man+Sex+Life%29\">have no decency and know no limits</a>:</br></br></br></br></p><blockquote class=\"tr_bq\"><p> Back<br> in May 2011 Jennifer and I were taken to Human Resources and had a<br> rather odd conversation in the aftermath of being on Inside Edition.<br> Apparently we’re dangerously monogamous and offensively heterosexual<br> enough to have resulted in no less than six calls of complaint to our<br> employer. Like I said, I always figured I’d be taken to HR, but I really<br> didn’t expect Jennifer to be dragged into it too. Jennifer does have a<br> minor PR role for her company, so we do see their point, but even then,<br> it’s no one’s business but ours.</br></br></br></br></br></br></br></br></p><p>Thus at the time: Yes sir, no sir, three bags full sir.</p><p>There’s<br> really not too much they can do to us directly, it’s not like you can<br> be fired for kissing your spouse on TV. But after that point, I start<br> feeling like the cross-hairs are firmly drawn on my back and I start<br> getting disciplined at work for things that frankly I don’t think I<br> would have been spanked for before that point. I.e. I see which way the<br> wind is blowing, work my ass off and in June 2012 I jump to MMSL<br> full-time.</br></br></br></br></br></br></br></p><p>Which brings us to now, or more correctly a couple months back.</p><p>Jennifer<br> gets a message on a Friday, she’s summoned to HR on Monday. Not told<br> what about. I’m unsure if the intent was to ruin our weekend, but it<br> seemed to achieve that goal. Considering Jennifer is the quintessential<br> good employee, it can only be MMSL related and I feel both shitty and<br> angry. We’re just on the very fine edge of me being able to carry the<br> two of us on MMSL income alone, so I Captain up and green light her<br> quitting her job at any point during that meeting.</br></br></br></br></br></br></br></p><p>It<br> turns out someone from a state agency funding Jennifer’s employer, has<br> been printing off a collection of blog posts and anonymously mailing<br> them to the CEO of her company. So anonymous letter, coming inside a<br> state agency envelope. HR really has nothing to say to her but, “Ahhh…<br> this is awkward, but you need to know what’s happening.” It’s also kinda<br> silly being outed to your employer 2.5 years after you were on national<br> television. The surprise factor lacks a little.</br></br></br></br></br></br></br></p><p>Anyway…<br> what it boils down to, is that someone reads this blog, actively<br> hunting for ways to fuck my wife over… and they are willing to play<br> dirty.</br></br></br></p></blockquote><p>Notice that this was directed at the wife of a man who is an atheist from New Zealand and is not exactly a paragon of religious conservative middle America.</p><p>It is what the activist Left now does and it is one reason why I will not tolerate their trolls any longer. So let this be a<br> warning to every troll who comments here: do not say <i><br> anything </br></i>here you do not wish to become public knowledge with your<br> personal information attached to it here for everyone to see. For the last two years, even the comments that were spammed and deleted have been saved; there are presently 181,807 comments in the database. I’ve tracked down two trolls in the past, and as it happens, both elected to stop<br> trolling here after discovering that I knew their real identities.</br></br></br></p><p>I didn’t publish their personal information here or send the long<br> compendium of insults, vulgarities, and obscenities they had spewed to<br> their friends, families, publishers, and employers. But I could have<br> easily done so. And now that it is clear that <a href=\"http://www.buzzfeed.com/rachelzarrell/what-happens-when-you-dress-as-a-boston-marathon-victim\">this is how the game is being played</a>, well, those of us who are already accustomed to the public view can certainly ensure that everyone else’s actions are too.</br></br></br></p></div>",
  "content_text": "This is why it is necessary to punch back twice as hard. This is why\nyou cannot let the poisonous ones into your social circle. This is why\nyou cannot employ them. This is why you cannot indulge in conspicuous\ntolerance. As Athol Kay has learned, those to whom the personal is the\npolitical and the political is the personal\nhave no decency and know no limits\n:\nBack\nin May 2011 Jennifer and I were taken to Human Resources and had a\nrather odd conversation in the aftermath of being on Inside Edition.\nApparently we’re dangerously monogamous and offensively heterosexual\nenough to have resulted in no less than six calls of complaint to our\nemployer. Like I said, I always figured I’d be taken to HR, but I really\ndidn’t expect Jennifer to be dragged into it too. Jennifer does have a\nminor PR role for her company, so we do see their point, but even then,\nit’s no one’s business but ours.\nThus at the time: Yes sir, no sir, three bags full sir.\nThere’s\nreally not too much they can do to us directly, it’s not like you can\nbe fired for kissing your spouse on TV. But after that point, I start\nfeeling like the cross-hairs are firmly drawn on my back and I start\ngetting disciplined at work for things that frankly I don’t think I\nwould have been spanked for before that point. I.e. I see which way the\nwind is blowing, work my ass off and in June 2012 I jump to MMSL\nfull-time.\nWhich brings us to now, or more correctly a couple months back.\nJennifer\ngets a message on a Friday, she’s summoned to HR on Monday. Not told\nwhat about. I’m unsure if the intent was to ruin our weekend, but it\nseemed to achieve that goal. Considering Jennifer is the quintessential\ngood employee, it can only be MMSL related and I feel both shitty and\nangry. We’re just on the very fine edge of me being able to carry the\ntwo of us on MMSL income alone, so I Captain up and green light her\nquitting her job at any point during that meeting.\nIt\nturns out someone from a state agency funding Jennifer’s employer, has\nbeen printing off a collection of blog posts and anonymously mailing\nthem to the CEO of her company. So anonymous letter, coming inside a\nstate agency envelope. HR really has nothing to say to her but, “Ahhh…\nthis is awkward, but you need to know what’s happening.” It’s also kinda\nsilly being outed to your employer 2.5 years after you were on national\ntelevision. The surprise factor lacks a little.\nAnyway…\nwhat it boils down to, is that someone reads this blog, actively\nhunting for ways to fuck my wife over… and they are willing to play\ndirty.\nNotice that this was directed at the wife of a man who is an atheist from New Zealand and is not exactly a paragon of religious conservative middle America.\nIt is what the activist Left now does and it is one reason why I will not tolerate their trolls any longer. So let this be a\nwarning to every troll who comments here: do not say\nanything\nhere you do not wish to become public knowledge with your\npersonal information attached to it here for everyone to see. For the last two years, even the comments that were spammed and deleted have been saved; there are presently 181,807 comments in the database. I’ve tracked down two trolls in the past, and as it happens, both elected to stop\ntrolling here after discovering that I knew their real identities.\nI didn’t publish their personal information here or send the long\ncompendium of insults, vulgarities, and obscenities they had spewed to\ntheir friends, families, publishers, and employers. But I could have\neasily done so. And now that it is clear that\nthis is how the game is being played\n, well, those of us who are already accustomed to the public view can certainly ensure that everyone else’s actions are too.",
  "tags": [
    "freakshow",
    "politics",
    "Troll Ban"
  ],
  "categories": [],
  "sitemap_lastmod": "2013-11-06T14:00:00+00:00"
}