{
  "url": "https://voxday.net/2013/11/15/troll-ban-ann-morgan/",
  "scraped_at": "2025-12-15T16:36:58.193962",
  "title": "Troll Ban: Ann Morgan",
  "date_display": "November 15, 2013",
  "date_iso": "2013-11-15T20:56:00+00:00",
  "date_from_url": "2013-11-15",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p><b>Tex wrote: **Notice how he dodges and spins and spews venom like a snake?**</b></p><p><i>Which is rather much like Vox, spewing obscenity regarding my body parts and making death threats.</i><br> <i><br/></i><br> <i>As for you, TS, I don’t think that Vox is a very good example of a Christian, neither is Roger a very good example of an atheist. There is no evidence of God, but there are very good reasons to think there is a God (possibly more than one). Among which are that if you believe in evolution, it is absurd, arrogant, and anthropomorphic to think that human beings are the smartest and most powerful things in existence. The existence of something with abilities and intelligence so powerful that it might rightly be called ‘God’ is a very distinct possibility. I find it a bit silly that those who believe in evolution think it somehow stops with our species, planet, or universe. Limited thinking, lol.</i><br> <i><br/></i><br> <i>However, by the same token, it is also arrogant and anthropomorphic to think that ‘God’ somehow hates exactly the same sorts of behavior that people do. Which would be rather like you hating the same sorts of things a brine shrimp does. If someone’s proposed “God” hates the same people they do, they don’t have a religion, they have a justification. They get to hate people and feel proud of it, rather than ashamed.</i><br> <i><br/></i><br> <i>Religion, ultimately, is a magnifier. Possibly because of something in human psychology, possibly because a person will attract the sort of spirits that are in accordance with their real nature, regardless of what name they call them by. If a person is good, religion will make them better. If a person is evil and unrepentent, religion will make them worse.</i></br></br></br></br></br></br></p><p><b><br>Josh wrote: **You’re a freaking drama queen**</br></b><br> <i><br/></i><br> <i>That might very well be, but my being a ‘drama queen’ does not alter the fact that Vox has used obscenity and death threats against me, without my previously using them against him. Nor does it explain why his version of venom spewing is qualitatively any different than Roger’s. Other than your wanting it to be.</i></br></br></p><p> <b>Ann Morgan: I don’t think that Vox is a very good example of a Christian …</b></p><p>Stickwick: By what measure do you judge this?</p><p><i>Well, that’s an interesting question. I suppose your standard of measure does make a difference. If a Christian is supposed to try to act like Christ, then Vox is not a very good example of one. On the other hand, if a Christian is supposed to be full of hate, use obscenity, make death threats, and think it perfectly fine to kill 2 year olds if what they call ‘God’ commands it, then Vox would be a very good Christian.</i></p><p> <b>Sigyn wrote: ** Ann demands that Christians behave according the parts<br> of the Bible she likes, and ignore the parts she doesn’t. She can’t make<br> up her mind.**</br></br></b></p><p><i>Yet Christians themselves behave according to the<br> parts of the bible that they like, and ignore the parts they don’t. And<br> can’t give any good reason why the parts they like and the parts they<br> ignore are more valid than the different parts that other people like or<br> ignore.</br></br></br></br></i><br> <i><br/></i><br> <i>And, btw, your insult against me does not change the<br> validity of my statement that if being a ‘Christian’ means behaving like<br> Christ, then Vox is not a very good Christian, but if being a Christian<br> means being full of hate, using obscenity, make death threats, and<br> think it perfectly fine to kill 2 year olds if what they call ‘God’<br> commands it, then Vox would be a very good Christian.</br></br></br></br></br></i><br> <i><br/></i><br> <i>I’ve also<br> noticed that when I say something that people here don’t like, but can’t<br> disprove, they generally resort to obscenity and various insults<br> regarding me. </br></br></br></i></br></br></br></br></p><p> <b>George wrote: **What, if anything, would you accept as proof?**</b></p><p><i>Something<br> which, at the least, precludes the possibility of having been created<br> by present or past human beings, or by nature (however great the odds).<br> Or simply being written accounts by those who could have been lying or<br> deluded. As I’ve mentioned before a 3000 year old tablet engraved with<br> the 10 commandments and made entirely of a pure, stable, transuranic<br> element would definitely get my attention, as it would eliminate the<br> possibility of liars, delusion, and present or past human beings.<br> Although it would include the possibility of time travellers or aliens,<br> as well as God. Though admittedly, sufficiently powerful time<br> travellers, aliens, spirits, and other things that can demonstrate that<br> they can accomplish certain tasks, whatever the means they might use to<br> do it, would probably be deserving of the name ‘God’, at least in the<br> terms of the power they wield.</br></br></br></br></br></br></br></br></br></br></br></br></br></i><br> <i><br/></i><br> <i>It would also be more impressive<br> if it were not the case that those who talk loudest about being<br> ‘Christians’ are also those who most often advocate killing, rape,<br> infanticide, genocide, and spew out obscenities about my speaking out my<br> vagina. If that is the end result that the practice of their religion<br> has on them, it doesn’t seem to be very worthwhile.</br></br></br></br></br></i></br></br></p><p> <b>Beau wrote: **You’re wrong. You can’t differentiate a quote of another<br> party from an original authored thought. You need to get a refund on<br> your education. You completely missed I was leveling criticism at that<br> crass remark. So you morphed it into yet another LOOK At ME…” blah,<br> blah, blah. No, Ann, you shouldn’t.**</br></br></br></br></b></p><p><i>Beau, I’m well aware of<br> what you wrote and what Pox wrote. And your attempt to evade having to<br> deal with why VD’s ‘crass retorts’ are any better than Pox’s ‘crass<br> retorts’ by instead criticizing my grammar has been noted. </br></br></br></i></p><p> <b>MPC wrote: **Ann, I’ve set foot in a church twice in my entire life, and not by<br> choice, so I’m not what you’d call pious.  However, I can say from a<br> perfectly secular perspective you are observably a stupid, insufferable,<br> and above all, DULL, annoying cunt.**</br></br></br></b></p><p><i><b> </b>That’s probably preferable to what a lot of people are.</i></p><p> <b>So why did the twat think Vox threatened her life? I must admit I never read her twattle too closely either.</b></p><p>“Me neither, but I always read Vox’s comments and had to follow the dialogue, in which the following transpired:</p><p>“Concerning<br> an apocalyptic scenario, Morgan stated she’d find the smartest gang,<br/> and of course, they’d all be super honored to have her join them because<br/> of her special survival skills (as if nobody else in this world knows)<br/> in finding edible things, to which Vox promptly responded that his gang<br/> would shoot her upon uttering her first sentence.</br></p><p>“His reply was<br/> short, brutal and hilarious, but the threat, like everything in her<br/> reality, was a figment of her delusional, twisted imagination.<br/> Regardless, that didn’t stop her from repeatedly referring to this<br/> imaginary death threat.”</p></div>",
  "content_text": "Tex wrote: **Notice how he dodges and spins and spews venom like a snake?**\nWhich is rather much like Vox, spewing obscenity regarding my body parts and making death threats.\nAs for you, TS, I don’t think that Vox is a very good example of a Christian, neither is Roger a very good example of an atheist. There is no evidence of God, but there are very good reasons to think there is a God (possibly more than one). Among which are that if you believe in evolution, it is absurd, arrogant, and anthropomorphic to think that human beings are the smartest and most powerful things in existence. The existence of something with abilities and intelligence so powerful that it might rightly be called ‘God’ is a very distinct possibility. I find it a bit silly that those who believe in evolution think it somehow stops with our species, planet, or universe. Limited thinking, lol.\nHowever, by the same token, it is also arrogant and anthropomorphic to think that ‘God’ somehow hates exactly the same sorts of behavior that people do. Which would be rather like you hating the same sorts of things a brine shrimp does. If someone’s proposed “God” hates the same people they do, they don’t have a religion, they have a justification. They get to hate people and feel proud of it, rather than ashamed.\nReligion, ultimately, is a magnifier. Possibly because of something in human psychology, possibly because a person will attract the sort of spirits that are in accordance with their real nature, regardless of what name they call them by. If a person is good, religion will make them better. If a person is evil and unrepentent, religion will make them worse.\nJosh wrote: **You’re a freaking drama queen**\nThat might very well be, but my being a ‘drama queen’ does not alter the fact that Vox has used obscenity and death threats against me, without my previously using them against him. Nor does it explain why his version of venom spewing is qualitatively any different than Roger’s. Other than your wanting it to be.\nAnn Morgan: I don’t think that Vox is a very good example of a Christian …\nStickwick: By what measure do you judge this?\nWell, that’s an interesting question. I suppose your standard of measure does make a difference. If a Christian is supposed to try to act like Christ, then Vox is not a very good example of one. On the other hand, if a Christian is supposed to be full of hate, use obscenity, make death threats, and think it perfectly fine to kill 2 year olds if what they call ‘God’ commands it, then Vox would be a very good Christian.\nSigyn wrote: ** Ann demands that Christians behave according the parts\nof the Bible she likes, and ignore the parts she doesn’t. She can’t make\nup her mind.**\nYet Christians themselves behave according to the\nparts of the bible that they like, and ignore the parts they don’t. And\ncan’t give any good reason why the parts they like and the parts they\nignore are more valid than the different parts that other people like or\nignore.\nAnd, btw, your insult against me does not change the\nvalidity of my statement that if being a ‘Christian’ means behaving like\nChrist, then Vox is not a very good Christian, but if being a Christian\nmeans being full of hate, using obscenity, make death threats, and\nthink it perfectly fine to kill 2 year olds if what they call ‘God’\ncommands it, then Vox would be a very good Christian.\nI’ve also\nnoticed that when I say something that people here don’t like, but can’t\ndisprove, they generally resort to obscenity and various insults\nregarding me.\nGeorge wrote: **What, if anything, would you accept as proof?**\nSomething\nwhich, at the least, precludes the possibility of having been created\nby present or past human beings, or by nature (however great the odds).\nOr simply being written accounts by those who could have been lying or\ndeluded. As I’ve mentioned before a 3000 year old tablet engraved with\nthe 10 commandments and made entirely of a pure, stable, transuranic\nelement would definitely get my attention, as it would eliminate the\npossibility of liars, delusion, and present or past human beings.\nAlthough it would include the possibility of time travellers or aliens,\nas well as God. Though admittedly, sufficiently powerful time\ntravellers, aliens, spirits, and other things that can demonstrate that\nthey can accomplish certain tasks, whatever the means they might use to\ndo it, would probably be deserving of the name ‘God’, at least in the\nterms of the power they wield.\nIt would also be more impressive\nif it were not the case that those who talk loudest about being\n‘Christians’ are also those who most often advocate killing, rape,\ninfanticide, genocide, and spew out obscenities about my speaking out my\nvagina. If that is the end result that the practice of their religion\nhas on them, it doesn’t seem to be very worthwhile.\nBeau wrote: **You’re wrong. You can’t differentiate a quote of another\nparty from an original authored thought. You need to get a refund on\nyour education. You completely missed I was leveling criticism at that\ncrass remark. So you morphed it into yet another LOOK At ME…” blah,\nblah, blah. No, Ann, you shouldn’t.**\nBeau, I’m well aware of\nwhat you wrote and what Pox wrote. And your attempt to evade having to\ndeal with why VD’s ‘crass retorts’ are any better than Pox’s ‘crass\nretorts’ by instead criticizing my grammar has been noted.\nMPC wrote: **Ann, I’ve set foot in a church twice in my entire life, and not by\nchoice, so I’m not what you’d call pious.  However, I can say from a\nperfectly secular perspective you are observably a stupid, insufferable,\nand above all, DULL, annoying cunt.**\nThat’s probably preferable to what a lot of people are.\nSo why did the twat think Vox threatened her life? I must admit I never read her twattle too closely either.\n“Me neither, but I always read Vox’s comments and had to follow the dialogue, in which the following transpired:\n“Concerning\nan apocalyptic scenario, Morgan stated she’d find the smartest gang,\nand of course, they’d all be super honored to have her join them because\nof her special survival skills (as if nobody else in this world knows)\nin finding edible things, to which Vox promptly responded that his gang\nwould shoot her upon uttering her first sentence.\n“His reply was\nshort, brutal and hilarious, but the threat, like everything in her\nreality, was a figment of her delusional, twisted imagination.\nRegardless, that didn’t stop her from repeatedly referring to this\nimaginary death threat.”",
  "tags": [
    "Troll Ban"
  ],
  "categories": [],
  "sitemap_lastmod": "2013-11-15T20:56:00+00:00"
}