{
  "url": "https://voxday.net/2013/11/17/troll-ban-anonagain/",
  "scraped_at": "2025-12-15T16:37:07.371355",
  "title": "Troll Ban: Anonagain",
  "date_display": "November 17, 2013",
  "date_iso": "2013-11-17T14:50:00+00:00",
  "date_from_url": "2013-11-17",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>Apparently excess exposure to the Left has caused <a href=\"http://mindoverblather.blogspot.com/2013/11/vox-sucks-marxist-cock.html\">Anonagain</a> another allergic reaction or something.</p><blockquote class=\"tr_bq\"><p> <i>Vox has decided he’s going to be a complete asshole and delete my responses to the yappy little anklebiters on <a href=\"http://http//voxday.blogspot.com/\">his blog</a>,<br> and even those comments that are on topic but don’t express the correct<br> attitude, so I’ve decided to simply respond to the frothing little<br> yappers from my own blog.</br></br></br></i><br> <i><br/></i><br> <i>Hey Vox, you really can go fuck yourself. I don’t mind getting deleted,<br> and I don’t give a flying fuck what your personal opinion is of me, but I<br> am not going to hang around your blog to be treated unfairly and<br> disrespected by you or anyone else. When you leave their BS OT comments<br> up and delete only mine, you’re being an asshole. But I am going to<br> respond – no balding little Napoleon is going to prevent me from<br> finishing what those fuckers started. It’s not the first time you’ve<br> done this. The fact that you can’t keep your bitter betas from going<br> into a feeding frenzy is not my problem, it’s yours – you attract<br> pathetic losers looking for their testosterone fix from you….</br></br></br></br></br></br></br></br></br></i></br></br></p></blockquote><p>I had to mass-delete her comments a year or two ago when she descended into a shrewish slough of vulgarity, but let it go when she came back and behaved herself. Unfortunately, the emotionally incontinent usually end up losing control sooner or later.  Perhaps she and Real American can one day find happiness together on another blog, cursing virulently at each other 24-7.</p><p>She can write whatever she wants on her own blog. She simply won’t be participating in the discussions here. The thing is, I don’t care what side of the political spectrum you happen to be on: if you insist on attacking people in a vulgar manner then you’re not going to be doing it here for long. The chief hallmark of the troll is his insistence on going where he is neither invited nor wanted. But secondary characteristics are vulgarity, a predilection for attacking others, and an extreme sensitivity to being disrespected, which usually concerns the comment-deletion.</p><p>I’m not the only one who has noticed that the civility of the discourse has improved considerably with just six troll bans: Andrew Marston, Kilo Papa, Phoenician, Golf Pro, Ann Morgan, and Real American. I very much hope five more won’t be necessary, but to be honest, I’m too busy with various projects to waste any time policing the comments of those who can’t control themselves. So, understand that by the time I am deleting your comments, my finger is already on the trigger and I am the world’s most perfect equalitarian when it comes to pulling it.</p><p>It’s nothing personal. It doesn’t really matter to me or the thousands of other people who pass by here from time to time if there are seven trolls who happen to be banned or eight. But it is perhaps worth noting that at least two of those trolls have been repeatedly banned from a number of other sites.</p><p>But this conclusion really says it all about the troll’s narcissistic mindset:</p><blockquote class=\"tr_bq\"><p> I’ve had enough of the backbiting little fuckers and being deleted by Vox whenever I try to defend myself against detractors, or being scolded like a child. He can run his blog however he likes, that’s his business – and he can also delete all my comments and shove them up his ass for all I care. If nobody in the universe reads any of these posts here, that’s fine by me. Comments are not welcome, except by invitation. I don’t give a fuck what most people think.<br>– Posted by Taylor at 12:54 AM</br></p><p>No comments:</p><p>New comments are not allowed. </p></blockquote><p>The troll doesn’t care, and in fact doesn’t even want to hear what anyone else thinks… but is obsessed with everyone else hearing what it has to say.</p></div>",
  "content_text": "Apparently excess exposure to the Left has caused\nAnonagain\nanother allergic reaction or something.\nVox has decided he’s going to be a complete asshole and delete my responses to the yappy little anklebiters on\nhis blog\n,\nand even those comments that are on topic but don’t express the correct\nattitude, so I’ve decided to simply respond to the frothing little\nyappers from my own blog.\nHey Vox, you really can go fuck yourself. I don’t mind getting deleted,\nand I don’t give a flying fuck what your personal opinion is of me, but I\nam not going to hang around your blog to be treated unfairly and\ndisrespected by you or anyone else. When you leave their BS OT comments\nup and delete only mine, you’re being an asshole. But I am going to\nrespond – no balding little Napoleon is going to prevent me from\nfinishing what those fuckers started. It’s not the first time you’ve\ndone this. The fact that you can’t keep your bitter betas from going\ninto a feeding frenzy is not my problem, it’s yours – you attract\npathetic losers looking for their testosterone fix from you….\nI had to mass-delete her comments a year or two ago when she descended into a shrewish slough of vulgarity, but let it go when she came back and behaved herself. Unfortunately, the emotionally incontinent usually end up losing control sooner or later.  Perhaps she and Real American can one day find happiness together on another blog, cursing virulently at each other 24-7.\nShe can write whatever she wants on her own blog. She simply won’t be participating in the discussions here. The thing is, I don’t care what side of the political spectrum you happen to be on: if you insist on attacking people in a vulgar manner then you’re not going to be doing it here for long. The chief hallmark of the troll is his insistence on going where he is neither invited nor wanted. But secondary characteristics are vulgarity, a predilection for attacking others, and an extreme sensitivity to being disrespected, which usually concerns the comment-deletion.\nI’m not the only one who has noticed that the civility of the discourse has improved considerably with just six troll bans: Andrew Marston, Kilo Papa, Phoenician, Golf Pro, Ann Morgan, and Real American. I very much hope five more won’t be necessary, but to be honest, I’m too busy with various projects to waste any time policing the comments of those who can’t control themselves. So, understand that by the time I am deleting your comments, my finger is already on the trigger and I am the world’s most perfect equalitarian when it comes to pulling it.\nIt’s nothing personal. It doesn’t really matter to me or the thousands of other people who pass by here from time to time if there are seven trolls who happen to be banned or eight. But it is perhaps worth noting that at least two of those trolls have been repeatedly banned from a number of other sites.\nBut this conclusion really says it all about the troll’s narcissistic mindset:\nI’ve had enough of the backbiting little fuckers and being deleted by Vox whenever I try to defend myself against detractors, or being scolded like a child. He can run his blog however he likes, that’s his business – and he can also delete all my comments and shove them up his ass for all I care. If nobody in the universe reads any of these posts here, that’s fine by me. Comments are not welcome, except by invitation. I don’t give a fuck what most people think.\n– Posted by Taylor at 12:54 AM\nNo comments:\nNew comments are not allowed.\nThe troll doesn’t care, and in fact doesn’t even want to hear what anyone else thinks… but is obsessed with everyone else hearing what it has to say.",
  "tags": [
    "Troll Ban"
  ],
  "categories": [],
  "sitemap_lastmod": "2013-11-17T14:50:00+00:00"
}