{
  "url": "https://voxday.net/2013/11/05/troll-sighting_5/",
  "scraped_at": "2025-12-15T16:35:53.666096",
  "title": "Troll sighting",
  "date_display": "November 5, 2013",
  "date_iso": "2013-11-05T18:00:00+00:00",
  "date_from_url": "2013-11-05",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p><i>And here we have the Spotted Blog Troll, a rare and unusually persistent subspecies in comparison with the common troll. </i>(In a low, David Attenborough-style voice) <i>Here we see how the stealthy troll, forced to operate out of its natural habitat, finds it hard to keep its camoflage consistent once it has been spotted by the pack it has been trailing.</i></p><blockquote class=\"tr_bq\"><p> <b> Carita November 05, 2013 9:47 AM  </b></p><p>   <br> “Or perhaps having the entire mainstream news industry running<br> interference makes one look smarter and more successful. Who can say?”</br></br></p><p>   <br> One thing is for sure, the President doesn’t need anyone to help him<br> look successful. The American people took care of that by electing him<br> twice.</br></br></br></p><p>    The question is whether some members of the<br> news media can help get the ACA up and running in a timely fashion. I<br> hope so. My experience with it worked perfectly and it’s a great step in<br> the right direction.</br></br></br></p><p></p></blockquote><blockquote><p> <b>Cretin November 05, 2013 10:03 AM  </b></p><p>   <br> “Or perhaps having the entire mainstream news industry running<br> interference makes one look smarter and more successful. Who can say?”</br></br></p><p>   <br> The President doesn’t need the media to make him seem more successful.<br> The American people took care of that with two elections.</br></br></p><p>   <br> However, if the media can help get the ACA off the ground and running<br> well, then that would be a great contribution to an important program<br> and to making it both successful and worthwhile. I hope they succeed.</br></br></br></p></blockquote><p>I guess dealing with those spam traps can be a bitch once you’ve been identified and spammed. The worst thing is that it follows you to every Google-related site on which you attempt to post.  And, by the way, Carita/Cretin is Tad/Golf Pro.</p></div>",
  "content_text": "And here we have the Spotted Blog Troll, a rare and unusually persistent subspecies in comparison with the common troll.\n(In a low, David Attenborough-style voice)\nHere we see how the stealthy troll, forced to operate out of its natural habitat, finds it hard to keep its camoflage consistent once it has been spotted by the pack it has been trailing.\nCarita November 05, 2013 9:47 AM\n“Or perhaps having the entire mainstream news industry running\ninterference makes one look smarter and more successful. Who can say?”\nOne thing is for sure, the President doesn’t need anyone to help him\nlook successful. The American people took care of that by electing him\ntwice.\nThe question is whether some members of the\nnews media can help get the ACA up and running in a timely fashion. I\nhope so. My experience with it worked perfectly and it’s a great step in\nthe right direction.\nCretin November 05, 2013 10:03 AM\n“Or perhaps having the entire mainstream news industry running\ninterference makes one look smarter and more successful. Who can say?”\nThe President doesn’t need the media to make him seem more successful.\nThe American people took care of that with two elections.\nHowever, if the media can help get the ACA off the ground and running\nwell, then that would be a great contribution to an important program\nand to making it both successful and worthwhile. I hope they succeed.\nI guess dealing with those spam traps can be a bitch once you’ve been identified and spammed. The worst thing is that it follows you to every Google-related site on which you attempt to post.  And, by the way, Carita/Cretin is Tad/Golf Pro.",
  "tags": [
    "Troll Ban"
  ],
  "categories": [],
  "sitemap_lastmod": "2013-11-05T18:00:00+00:00"
}