{
  "url": "https://voxday.net/2013/11/16/women-destroying-sf/",
  "scraped_at": "2025-12-15T16:37:00.017752",
  "title": "Women Destroy SF",
  "date_display": "November 16, 2013",
  "date_iso": "2013-11-16T10:40:00+00:00",
  "date_from_url": "2013-11-16",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>I must confess that I am rather enjoying the way in which <a href=\"http://www.wnd.com/2005/02/29022/\">my original assertion from 2005</a> has now become <a href=\"http://www.lightspeedmagazine.com/special-issues/women-destroy-sf/\">an established meme</a> in the science fiction community.  Sure, they <i>intend </i>it in an ironic way, but the publication will almost certainly provide additional supporting evidence for my hypothesis that women have destroyed the SF/F literary subgenre by feminizing it.</p><blockquote class=\"tr_bq\"><p> <a href=\"http://www.lightspeedmagazine.com/special-issues/women-destroy-sf/\">Women Destroy SF — Special Issue</a></p><p>September 5, 2013 — It could be said that women invented science fiction; after all, Mary Shelley wrote what is considered by many to be the first science fiction novel (Frankenstein). Yet some readers seem to have this funny idea that women don’t–or can’t–write science fiction. Some have even gone so far as to accuse women of destroying science fiction with their girl cooties.</p><p>So to help prove how silly that notion is, Lightspeed is proud to announce that in 2014 we’ll be publishing a “Women Destroy SF” special issue, with a guest editor at the helm. More details to come soon, so watch this space!</p></blockquote><p>I tend to suspect it is going to confirm the notion rather than prove how silly it is, but we shall await the evidence before judging it. I would also point out that the problem isn’t the girl cooties per se, but rather, the strong female preference for writing thinly disguised romance that is then sold as science fiction to men who are perfectly aware of the bait-and-switch. It’s not that women can’t write excellent fiction. They can, they have, and they do. But most women who are sufficiently solitary-minded to write are too didactic, too self-obsessed, too bitter about their low SMV value, and too little interested in science or any other intellectual concepts to successfully write in a literary format that is first and foremost driven by ideas.</p><p>As it happens, the publishing situation is actually much more dire and the destruction caused by women is considerably more widespread than many people imagine.</p><p>Consider this: as of 10 November, I have sold or given away 26,092 Selenoth books on<br> Amazon alone in the last 11 months. Those are books that women at not<br> one, but two, mainstream publishers were instrumental in declining to<br> publish, and as a result, those books have not appeared in a single<br> bookstore anywhere in the world.</br></br></br></br></p><p>Now, think about the<br> multiplier effect of a major publisher’s distribution channel compared<br> to that of a small independent, electronic-only publisher?  Even if it<br> is only 5x, that likely would have been enough to put <i>A Throne of Bones</i> in the top 5 percent of best-selling fantasy.  (This may be why <a href=\"http://www.milobookclub.com/2013/10/25/mailvox-unexpected-review/\">the bestselling author who wrote to me said</a>:<br> “I very much found myself wondering what would have happened had it<br> been<br> published by a large house with a marketing campaign behind it.”) And<br> all the time spent reading those 26 thousand books, which was not<br> inconsiderable, is time that was obviously not spent reading the various offerings of the mainstream publishers.</br></br></br></br></br></br></br></br></p><p>More<br> importantly, the money that would have been spent on the nonexistent<br> “multiplier books” was mostly not spent on other science fiction and<br> fantasy novels, but was instead spent on the wide variety of other<br> non-literary options available to the sort of men who make up the books’<br> primary market. And I am far from the only male-oriented writer who was shut out by the SF/F gatekeepers in favor of the scalzified material. This means that there a very good case to be made that<br> women have not only destroyed science fiction, but have also contributed significantly to the lower profits of the publishing industry as well as the ongoing collapse of the chain and local bookstores.</br></br></br></br></br></br></p></div>",
  "content_text": "I must confess that I am rather enjoying the way in which\nmy original assertion from 2005\nhas now become\nan established meme\nin the science fiction community.  Sure, they\nintend\nit in an ironic way, but the publication will almost certainly provide additional supporting evidence for my hypothesis that women have destroyed the SF/F literary subgenre by feminizing it.\nWomen Destroy SF — Special Issue\nSeptember 5, 2013 — It could be said that women invented science fiction; after all, Mary Shelley wrote what is considered by many to be the first science fiction novel (Frankenstein). Yet some readers seem to have this funny idea that women don’t–or can’t–write science fiction. Some have even gone so far as to accuse women of destroying science fiction with their girl cooties.\nSo to help prove how silly that notion is, Lightspeed is proud to announce that in 2014 we’ll be publishing a “Women Destroy SF” special issue, with a guest editor at the helm. More details to come soon, so watch this space!\nI tend to suspect it is going to confirm the notion rather than prove how silly it is, but we shall await the evidence before judging it. I would also point out that the problem isn’t the girl cooties per se, but rather, the strong female preference for writing thinly disguised romance that is then sold as science fiction to men who are perfectly aware of the bait-and-switch. It’s not that women can’t write excellent fiction. They can, they have, and they do. But most women who are sufficiently solitary-minded to write are too didactic, too self-obsessed, too bitter about their low SMV value, and too little interested in science or any other intellectual concepts to successfully write in a literary format that is first and foremost driven by ideas.\nAs it happens, the publishing situation is actually much more dire and the destruction caused by women is considerably more widespread than many people imagine.\nConsider this: as of 10 November, I have sold or given away 26,092 Selenoth books on\nAmazon alone in the last 11 months. Those are books that women at not\none, but two, mainstream publishers were instrumental in declining to\npublish, and as a result, those books have not appeared in a single\nbookstore anywhere in the world.\nNow, think about the\nmultiplier effect of a major publisher’s distribution channel compared\nto that of a small independent, electronic-only publisher?  Even if it\nis only 5x, that likely would have been enough to put\nA Throne of Bones\nin the top 5 percent of best-selling fantasy.  (This may be why\nthe bestselling author who wrote to me said\n:\n“I very much found myself wondering what would have happened had it\nbeen\npublished by a large house with a marketing campaign behind it.”) And\nall the time spent reading those 26 thousand books, which was not\ninconsiderable, is time that was obviously not spent reading the various offerings of the mainstream publishers.\nMore\nimportantly, the money that would have been spent on the nonexistent\n“multiplier books” was mostly not spent on other science fiction and\nfantasy novels, but was instead spent on the wide variety of other\nnon-literary options available to the sort of men who make up the books’\nprimary market. And I am far from the only male-oriented writer who was shut out by the SF/F gatekeepers in favor of the scalzified material. This means that there a very good case to be made that\nwomen have not only destroyed science fiction, but have also contributed significantly to the lower profits of the publishing industry as well as the ongoing collapse of the chain and local bookstores.",
  "tags": [
    "writing"
  ],
  "categories": [],
  "sitemap_lastmod": "2013-11-16T10:40:00+00:00"
}