{
  "url": "https://voxday.net/2021/05/10/a-different-kind-of-war/",
  "scraped_at": "2025-12-21T22:48:12.654742",
  "title": "A Different Kind of War",
  "date_display": "May 10, 2021",
  "date_iso": "2021-05-10T09:18:08+00:00",
  "date_from_url": "2021-05-10",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>Fred Rogers’s children’s ministry wasn’t exactly what one would call conventional, and he certainly didn’t win his war against the wicked medium of television. But he fought a much better fight, and fought it for far longer, than most Christians in these latter days of the latest iteration of The Empire That Never Ended. <a href=\"https://www.esquire.com/entertainment/tv/a27134/can-you-say-hero-esq1198/\" rel=\"noopener\" target=\"_blank\">This is the 1998 article</a> upon which the movie I mentioned on a recent Darkstream was based; it’s intriguing to see both how much the movie relied upon it and where the movie departed from it in the interests of drama:</p><blockquote><p>Once upon a time, a long time ago, a man took off his jacket and put on a sweater. Then he took off his shoes and put on a pair of sneakers. His name was Fred Rogers. He was starting a television program, aimed at children, called Mister Rogers’ Neighborhood. He had been on television before, but only as the voices and movements of puppets, on a program called The Children’s Corner. Now he was stepping in front of the camera as Mister Rogers, and he wanted to do things right, and whatever he did right, he wanted to repeat. And so, once upon a time, Fred Rogers took off his jacket and put on a sweater his mother had made him, a cardigan with a zipper. Then he took off his shoes and put on a pair of navy-blue canvas boating sneakers. He did the same thing the next day, and then the next…until he had done the same things, those things, 865 times, at the beginning of 865 television programs, over a span of thirty-one years. The first time I met Mister Rogers, he told me a story of how deeply his simple gestures had been felt, and received. He had just come back from visiting Koko, the gorilla who has learned—or who has been taught—American Sign Language. Koko watches television. Koko watches Mister Rogers’ Neighborhood, and when Mister Rogers, in his sweater and sneakers, entered the place where she lives, Koko immediately folded him in her long, black arms, as though he were a child, and then … “She took my shoes off, Tom,” Mister Rogers said….</p><p>The first time I called Mister Rogers on the telephone, I woke him up from his nap. He takes a nap every day in the late afternoon—just as he wakes up every morning at five-thirty to read and study and write and pray for the legions who have requested his prayers; just as he goes to bed at nine-thirty at night and sleeps eight hours without interruption. On this afternoon, the end of a hot, yellow day in New York City, he was very tired, and when I asked if I could go to his apartment and see him, he paused for a moment and said shyly, “Well, Tom, I’m in my bathrobe, if you don’t mind.” I told him I didn’t mind, and when, five minutes later, I took the elevator to his floor, well, sure enough, there was Mister Rogers, silver-haired, standing in the golden door at the end of the hallway and wearing eyeglasses and suede moccasins with rawhide laces and a flimsy old blue-and-yellow bathrobe that revealed whatever part of his skinny white calves his dark-blue dress socks didn’t hide. “Welcome, Tom,” he said with a slight bow, and bade me follow him inside, where he lay down—no, stretched out, as though he had known me all his life—on a couch upholstered with gold velveteen. He rested his head on a small pillow and kept his eyes closed while he explained that he had bought the apartment thirty years before for $11,000 and kept it for whenever he came to New York on business for the Neighborhood. </p><p>I sat in an old armchair and looked around. The place was drab and dim, with the smell of stalled air and a stain of daguerreotype sunlight on its closed, slatted blinds, and Mister Rogers looked so at home in its gloomy familiarity that I thought he was going to fall back asleep when suddenly the phone rang, startling him. “Oh, hello, my dear,” he said when he picked it up, and then he said that he had a visitor, someone who wanted to learn more about the Neighborhood. “Would you like to speak to him?” he asked, and then handed me the phone. “It’s Joanne,” he said. I took the phone and spoke to a woman—his wife, the mother of his two sons—whose voice was hearty and almost whooping in its forthrightness and who spoke to me as though she had known me for a long time and was making the effort to keep up the acquaintance. When I handed him back the phone, he said, “Bye, my dear,” and hung up and curled on the couch like a cat, with his bare calves swirled underneath him and one of his hands gripping his ankle, so that he looked as languorous as an odalisque. There was an energy to him, however, a fearlessness, an unashamed insistence on intimacy, and though I tried to ask him questions about himself, he always turned the questions back on me, and when I finally got him to talk about the puppets that were the comfort of his lonely boyhood, he looked at me, his gray-blue eyes at once mild and steady, and asked,</p><p>“What about you, Tom? Did you have any special friends growing up?”</p><p>“Special friends?”</p><p>“Yes,” he said. “Maybe a puppet, or a special toy, or maybe just a stuffed animal you loved very much. Did you have a special friend like that, Tom?”</p><p>“Yes, Mister Rogers.”</p><p>“Did your special friend have a name, Tom?”</p><p>“Yes, Mister Rogers. His name was Old Rabbit.”</p><p>“Old Rabbit. Oh, and I’ll bet the two of you were together since he was a very young rabbit. Would you like to tell me about Old Rabbit, Tom?”</p></blockquote><p>It’s not unusual that a child with a difficult experience growing up will transform that experience into strength, or even into something resembling a psychological superpower. But it’s very rare to see that sort of strength utilized in such a kind, positive, and focused manner. </p></div>",
  "content_text": "Fred Rogers’s children’s ministry wasn’t exactly what one would call conventional, and he certainly didn’t win his war against the wicked medium of television. But he fought a much better fight, and fought it for far longer, than most Christians in these latter days of the latest iteration of The Empire That Never Ended.\nThis is the 1998 article\nupon which the movie I mentioned on a recent Darkstream was based; it’s intriguing to see both how much the movie relied upon it and where the movie departed from it in the interests of drama:\nOnce upon a time, a long time ago, a man took off his jacket and put on a sweater. Then he took off his shoes and put on a pair of sneakers. His name was Fred Rogers. He was starting a television program, aimed at children, called Mister Rogers’ Neighborhood. He had been on television before, but only as the voices and movements of puppets, on a program called The Children’s Corner. Now he was stepping in front of the camera as Mister Rogers, and he wanted to do things right, and whatever he did right, he wanted to repeat. And so, once upon a time, Fred Rogers took off his jacket and put on a sweater his mother had made him, a cardigan with a zipper. Then he took off his shoes and put on a pair of navy-blue canvas boating sneakers. He did the same thing the next day, and then the next…until he had done the same things, those things, 865 times, at the beginning of 865 television programs, over a span of thirty-one years. The first time I met Mister Rogers, he told me a story of how deeply his simple gestures had been felt, and received. He had just come back from visiting Koko, the gorilla who has learned—or who has been taught—American Sign Language. Koko watches television. Koko watches Mister Rogers’ Neighborhood, and when Mister Rogers, in his sweater and sneakers, entered the place where she lives, Koko immediately folded him in her long, black arms, as though he were a child, and then … “She took my shoes off, Tom,” Mister Rogers said….\nThe first time I called Mister Rogers on the telephone, I woke him up from his nap. He takes a nap every day in the late afternoon—just as he wakes up every morning at five-thirty to read and study and write and pray for the legions who have requested his prayers; just as he goes to bed at nine-thirty at night and sleeps eight hours without interruption. On this afternoon, the end of a hot, yellow day in New York City, he was very tired, and when I asked if I could go to his apartment and see him, he paused for a moment and said shyly, “Well, Tom, I’m in my bathrobe, if you don’t mind.” I told him I didn’t mind, and when, five minutes later, I took the elevator to his floor, well, sure enough, there was Mister Rogers, silver-haired, standing in the golden door at the end of the hallway and wearing eyeglasses and suede moccasins with rawhide laces and a flimsy old blue-and-yellow bathrobe that revealed whatever part of his skinny white calves his dark-blue dress socks didn’t hide. “Welcome, Tom,” he said with a slight bow, and bade me follow him inside, where he lay down—no, stretched out, as though he had known me all his life—on a couch upholstered with gold velveteen. He rested his head on a small pillow and kept his eyes closed while he explained that he had bought the apartment thirty years before for $11,000 and kept it for whenever he came to New York on business for the Neighborhood.\nI sat in an old armchair and looked around. The place was drab and dim, with the smell of stalled air and a stain of daguerreotype sunlight on its closed, slatted blinds, and Mister Rogers looked so at home in its gloomy familiarity that I thought he was going to fall back asleep when suddenly the phone rang, startling him. “Oh, hello, my dear,” he said when he picked it up, and then he said that he had a visitor, someone who wanted to learn more about the Neighborhood. “Would you like to speak to him?” he asked, and then handed me the phone. “It’s Joanne,” he said. I took the phone and spoke to a woman—his wife, the mother of his two sons—whose voice was hearty and almost whooping in its forthrightness and who spoke to me as though she had known me for a long time and was making the effort to keep up the acquaintance. When I handed him back the phone, he said, “Bye, my dear,” and hung up and curled on the couch like a cat, with his bare calves swirled underneath him and one of his hands gripping his ankle, so that he looked as languorous as an odalisque. There was an energy to him, however, a fearlessness, an unashamed insistence on intimacy, and though I tried to ask him questions about himself, he always turned the questions back on me, and when I finally got him to talk about the puppets that were the comfort of his lonely boyhood, he looked at me, his gray-blue eyes at once mild and steady, and asked,\n“What about you, Tom? Did you have any special friends growing up?”\n“Special friends?”\n“Yes,” he said. “Maybe a puppet, or a special toy, or maybe just a stuffed animal you loved very much. Did you have a special friend like that, Tom?”\n“Yes, Mister Rogers.”\n“Did your special friend have a name, Tom?”\n“Yes, Mister Rogers. His name was Old Rabbit.”\n“Old Rabbit. Oh, and I’ll bet the two of you were together since he was a very young rabbit. Would you like to tell me about Old Rabbit, Tom?”\nIt’s not unusual that a child with a difficult experience growing up will transform that experience into strength, or even into something resembling a psychological superpower. But it’s very rare to see that sort of strength utilized in such a kind, positive, and focused manner.",
  "tags": [
    "media"
  ],
  "categories": [],
  "sitemap_lastmod": "2021-05-10T08:18:08+00:00"
}