{
  "url": "https://voxday.net/2021/05/07/bill-gates-didnt-kill-himself/",
  "scraped_at": "2025-12-21T22:47:41.261245",
  "title": "Bill Gates didn’t kill himself",
  "date_display": "May 7, 2021",
  "date_iso": "2021-05-07T09:03:06+00:00",
  "date_from_url": "2021-05-07",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>One of the things that becomes clear about the success of Bill Gates with Microsoft is that it was by no means assured at many steps along the way. This is well-chronicled in <i>In Search of Stupidity</i>. The number of sheer coincidences and terrible decisions by competitors that were required for Bill Gates to become so massively successful with someone else’s software on someone else’s hardware platform were astonishing.</p><p>And remember, this is the guy who didn’t even mention the Internet in his book <i>The Road Ahead</i>. So we’re not talking about a supergenius with great foresight here. Now there are <a href=\"https://www.dailymail.co.uk/news/article-9552613/Melinda-Gates-warned-Bill-association-Jeffrey-Epstein.html\" rel=\"noopener\" target=\"_blank\">a growing number of signs</a> that his success, like that of so many other ticket-takers, was entirely manufactured for him.</p><blockquote><p>Melinda Gates warned her husband Bill against any further contact with Jeffrey Epstein after the couple had an uncomfortable meeting with the convicted sex offender, according to a new report.</p><p>Melinda was ‘furious’ at Bill’s relationship with Epstein after the couple visited the predator’s Upper East Side townhouse in September 2013, people familiar with the matter told the Daily Beast.  </p><p>The meeting proved a turning point in Bill’s relationship with Epstein, after Melinda expressed how uncomfortable she was with the sex offender and said she wanted nothing to do with him, the sources said….</p><p>In March 2013, Gates flew on Epstein’s private plane – the aircraft that has been dubbed the ‘Lolita Express’ because it was allegedly used to traffic young girls. Bridgitt Arnold, a spokesperson for Gates, told the Times that Gates was not aware that the plane belonged to Epstein.</p><p>In September of that year, Gates and Epstein met for dinner in New York to discuss philanthropy, according to Arnold — possibly the same meeting attended by Melinda, triggering her fury. </p></blockquote><p>Just a few more of those inexplicable coincidences, right? It was just two fake billionaires who happened to be billionairing together. But if there is one thing we learned from <i>The X-Files</i>, it’s that there are no coincidences.</p></div>",
  "content_text": "One of the things that becomes clear about the success of Bill Gates with Microsoft is that it was by no means assured at many steps along the way. This is well-chronicled in\nIn Search of Stupidity\n. The number of sheer coincidences and terrible decisions by competitors that were required for Bill Gates to become so massively successful with someone else’s software on someone else’s hardware platform were astonishing.\nAnd remember, this is the guy who didn’t even mention the Internet in his book\nThe Road Ahead\n. So we’re not talking about a supergenius with great foresight here. Now there are\na growing number of signs\nthat his success, like that of so many other ticket-takers, was entirely manufactured for him.\nMelinda Gates warned her husband Bill against any further contact with Jeffrey Epstein after the couple had an uncomfortable meeting with the convicted sex offender, according to a new report.\nMelinda was ‘furious’ at Bill’s relationship with Epstein after the couple visited the predator’s Upper East Side townhouse in September 2013, people familiar with the matter told the Daily Beast.\nThe meeting proved a turning point in Bill’s relationship with Epstein, after Melinda expressed how uncomfortable she was with the sex offender and said she wanted nothing to do with him, the sources said….\nIn March 2013, Gates flew on Epstein’s private plane – the aircraft that has been dubbed the ‘Lolita Express’ because it was allegedly used to traffic young girls. Bridgitt Arnold, a spokesperson for Gates, told the Times that Gates was not aware that the plane belonged to Epstein.\nIn September of that year, Gates and Epstein met for dinner in New York to discuss philanthropy, according to Arnold — possibly the same meeting attended by Melinda, triggering her fury.\nJust a few more of those inexplicable coincidences, right? It was just two fake billionaires who happened to be billionairing together. But if there is one thing we learned from\nThe X-Files\n, it’s that there are no coincidences.",
  "tags": [
    "technology"
  ],
  "categories": [],
  "sitemap_lastmod": "2021-05-07T08:03:06+00:00"
}