{
  "url": "https://voxday.net/2021/05/02/black-privilege-2/",
  "scraped_at": "2025-12-21T22:46:59.040557",
  "title": "Black privilege",
  "date_display": "May 2, 2021",
  "date_iso": "2021-05-02T14:07:44+00:00",
  "date_from_url": "2021-05-02",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>Now that black men such as Deshaun Watson and Noel Clarke have been credibly accused of being sexual predators by literally dozens of women, <a href=\"https://www.dailymail.co.uk/news/article-9533857/Noel-Clarke-faces-police-probe-seven-women-come-forward.html\" rel=\"noopener\" target=\"_blank\">suddenly SJWs are worried about due process</a>, innocence until proven guilty, and the unfairness of trial by media:</p><blockquote><p>Noel Clarke is facing the prospect of a police investigation after seven more women came forward to accuse the Bafta star of a campaign of sexual harassment and bullying.</p><p>With 27 women now saying they were sexually harassed or groped by the celebrated actor and director, Scotland Yard has said it is ‘assessing’ a specific allegation. The Met Police confirmed that a ‘third-party report’ was made on April 21 ‘relating to allegations of sexual offences committed by a male over a period of time’….</p><p>Meanwhile, it was reported that Bafta spent two weeks deciding how best to respond to allegations against Clarke prior to presenting him with one of its highest honours, the Outstanding British Contribution to Cinema Award.</p><p>In a statement, Bafta claimed it had acted ‘as quickly and supportively as we could, even though we had only received the most generic of claims and no actual first-hand information to investigate allegations which were potentially of a criminal nature’. </p><p>The Guardian said senior figures within the film academy were worried about the potential reputational damage to the organisation over its handling of the claims against Clarke. </p><p>Bafta chair Krishnendu Majumdar was reportedly aware there could be as many as 12 women making allegations against Clarke on the eve of the awards ceremony.</p><p>He sought to speak to anyone with first-hand experience of Clarke’s alleged misconduct and told an industry figure he was ‘trying to do something about’ the situation as it could ‘destroy’ Bafta ‘in the court of public opinion’, the newspaper said.</p><p>Majumdar is said to have described the allegations as a ‘desperately difficult situation for us’ as Bafta ‘cannot act as judge and jury’.</p></blockquote><p>Let’s face it, a white quarterback might survive a single accusation, but the media storm would be relentless, as evidenced by the coverage of the Peyton Manning and Ben Rothlisberger situations. He’d be suspended proactively by the NFL by the time the third accusation was made. And can anyone imagine a white actor who was accused of sexual harassment by twelve women being presented a major cinematic award?</p><p>For all their incessant crying about racism, the simple fact is that blacks simply aren’t held to the same behavioral standards as others.</p><p>I have no doubt the film academy was worried about reputational damage if they didn’t give <a href=\"https://www.theguardian.com/culture/2021/apr/29/actor-noel-clarke-accused-of-groping-harassment-and-bullying-by-20-women\" rel=\"noopener\" target=\"_blank\">the 12x-accused (now 27x) sexual predator</a> the award. The only thing they fear more than being called “racist” is being called “anti-semitic”. But it’s hard to see what the problem is. After all, if the Hellmouth didn’t give awards to sexual predators, they couldn’t give out awards.</p><p><b>UPDATE: </b>This bit is classic. Notice how Clarke’s lawyers don’t even hesitate to completely lie about an easily-confirmed fact, then just keep producing excuses when they are caught red-handed.</p><blockquote><p>Clarke’s lawyers said they did not dispute that such a scene had been shot, but said it was in the script and agreed in advance. Informed by the Guardian that there was no reference to a female performer straddling a male performer, or anything that could be interpreted as requiring that, Clarke’s lawyers queried which version of the script was being referred to and said there was “a degree of improvisation” that performers and crew were all comfortable with.</p></blockquote></div>",
  "content_text": "Now that black men such as Deshaun Watson and Noel Clarke have been credibly accused of being sexual predators by literally dozens of women,\nsuddenly SJWs are worried about due process\n, innocence until proven guilty, and the unfairness of trial by media:\nNoel Clarke is facing the prospect of a police investigation after seven more women came forward to accuse the Bafta star of a campaign of sexual harassment and bullying.\nWith 27 women now saying they were sexually harassed or groped by the celebrated actor and director, Scotland Yard has said it is ‘assessing’ a specific allegation. The Met Police confirmed that a ‘third-party report’ was made on April 21 ‘relating to allegations of sexual offences committed by a male over a period of time’….\nMeanwhile, it was reported that Bafta spent two weeks deciding how best to respond to allegations against Clarke prior to presenting him with one of its highest honours, the Outstanding British Contribution to Cinema Award.\nIn a statement, Bafta claimed it had acted ‘as quickly and supportively as we could, even though we had only received the most generic of claims and no actual first-hand information to investigate allegations which were potentially of a criminal nature’.\nThe Guardian said senior figures within the film academy were worried about the potential reputational damage to the organisation over its handling of the claims against Clarke.\nBafta chair Krishnendu Majumdar was reportedly aware there could be as many as 12 women making allegations against Clarke on the eve of the awards ceremony.\nHe sought to speak to anyone with first-hand experience of Clarke’s alleged misconduct and told an industry figure he was ‘trying to do something about’ the situation as it could ‘destroy’ Bafta ‘in the court of public opinion’, the newspaper said.\nMajumdar is said to have described the allegations as a ‘desperately difficult situation for us’ as Bafta ‘cannot act as judge and jury’.\nLet’s face it, a white quarterback might survive a single accusation, but the media storm would be relentless, as evidenced by the coverage of the Peyton Manning and Ben Rothlisberger situations. He’d be suspended proactively by the NFL by the time the third accusation was made. And can anyone imagine a white actor who was accused of sexual harassment by twelve women being presented a major cinematic award?\nFor all their incessant crying about racism, the simple fact is that blacks simply aren’t held to the same behavioral standards as others.\nI have no doubt the film academy was worried about reputational damage if they didn’t give\nthe 12x-accused (now 27x) sexual predator\nthe award. The only thing they fear more than being called “racist” is being called “anti-semitic”. But it’s hard to see what the problem is. After all, if the Hellmouth didn’t give awards to sexual predators, they couldn’t give out awards.\nUPDATE:\nThis bit is classic. Notice how Clarke’s lawyers don’t even hesitate to completely lie about an easily-confirmed fact, then just keep producing excuses when they are caught red-handed.\nClarke’s lawyers said they did not dispute that such a scene had been shot, but said it was in the script and agreed in advance. Informed by the Guardian that there was no reference to a female performer straddling a male performer, or anything that could be interpreted as requiring that, Clarke’s lawyers queried which version of the script was being referred to and said there was “a degree of improvisation” that performers and crew were all comfortable with.",
  "tags": [
    "Vibrancyisourstrength"
  ],
  "categories": [],
  "sitemap_lastmod": "2021-05-02T13:07:44+00:00"
}