{
  "url": "https://voxday.net/2021/05/20/by-their-fruits-ye-shall-know-them/",
  "scraped_at": "2025-12-21T22:49:38.219633",
  "title": "By their fruits ye shall know them",
  "date_display": "May 20, 2021",
  "date_iso": "2021-05-20T12:48:48+00:00",
  "date_from_url": "2021-05-20",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>I’m entirely confident that the “Andrew Anglin” who wrote <a href=\"https://www.unz.com/article/my-nation-blessed-israel-and-all-i-got-was-a-mulatto-tranny-grandchild/\" rel=\"noopener\" target=\"_blank\">this column at Unz</a> is not the “Andrew Anglin” I debated a few years ago. Regardless, the column is a sobering reminder that “Judeo-Christianity” is not Christianity, the god worshipped by the Jews is not the Heavenly Father of Jesus Christ, and providing post-WWII safe harbor to the Jewish diaspora appears to have served Americans about as well as doing so previously served the Egyptians, the Babylonians, the Russians, and the British.</p><blockquote><p><i>My Nation Blessed Israel and All I Got Was a Mulatto Tranny Grandchild</i></p><p>When I was a child in the 1990s, evangelical preachers and televangelists were claiming that God would “bless” a nation that “blesses” the genocidal Jew state of Israel.</p><p>Yet, here were are, 30 years later, and America has consistently “blessed” Israel. We have given them hundreds of billions of dollars over the last decades, and we have spent trillions fighting wars for them. Our boys have been sent to be maimed and to die in the name of Israel. Our government’s entire foreign policy is built around promoting the interests of Israel. We have also allowed Jews who live in America to operate unhindered, and to take over all of our institutions.</p><p>Once a religion that condemned the Jews as the murderers and rejecters of Christ, American Christianity has continued a process of being restructured to set Israel and the Jews at the center of it. Any given evangelical pastor is more likely to discuss Israel, and the importance of helping the Jews, than he is to discuss real world problems America faces. American Christians accepted the reclassification of Christianity as “Judeo-Christianity.”</p><p>America has engaged in an Israel-blessing orgy for decades, when traditional Christians were cleansed from the Republican Party and the conservative movement as a whole….</p><p>The implication of the massive dip in the quality of American life and the American experience is that God doesn’t actually bless nations that bless Israel. In fact, the assumption would have to be that God dooms nations that bless Israel.</p></blockquote><p>This raises the obvious question, of course: <i>which god is that?</i></p><p>Unless and until you understand that the religious Jews worship the god of this world, not God the Father of Jesus Christ, and that their current objective is to destroy a) Christianity, b) Western Civilization, and c) Russia, you will never understand how and why the United States doomed itself by failing to sink the ships before WWI and after WWII. You will also not understand why the USA is almost certainly going to find itself fighting wars with both Russia and China in the next decade, and why it will lose those wars, unless it collapses of its own internal contradictions first.</p><p>If you don’t believe me, force yourself to read Ben Shapiro’s most recent book. You will be unable to avoid noticing how the entire purpose of the book is to subvert and redefine, not only America, but Western Civilization itself. If Americans wish to survive as a nation, they must turn back to Jesus Christ. And that is the one thing that “those who bless Israel” are absolutely determined to prevent, regardless of what they profess themselves to be.</p><p>A refusal to take a strong stand against those who reject God and serve the devil is not a virtue for anyone, least of all the Christian. As for “judeochristianity”, it would be more honestly labeled as “pharisatanry”.</p><p><i>Jesus said to them, “If God were your Father, you would love me, for I have come here from God. I have not come on my own; God sent me. Why is my language not clear to you? Because you are unable to hear what I say. You belong to your father, the devil, and you want to carry out your father’s desires. He was a murderer from the beginning, not holding to the truth, for there is no truth in him. When he lies, he speaks his native language, for he is a liar and the father of lies. Yet because I tell the truth, you do not believe me! Can any of you prove me guilty of sin? If I am telling the truth, why don’t you believe me? Whoever belongs to God hears what God says. The reason you do not hear is that you do not belong to God.”</i></p><p>– John 8: 42-47</p><p>Don’t even bother playing the usual semantic games with irrelevant Scofield citations. The Sermon on the Mount, to which the linked article implicitly appeals, is conclusive on the subject. Any argument you might have is not with me, but with Jesus Christ of Nazareth himself.</p><p><i>By their fruit you will recognize them. Do people pick grapes from thornbushes, or figs from thistles? Likewise, every good tree bears good fruit, but a bad tree bears bad fruit. A good tree cannot bear bad fruit, and a bad tree cannot bear good fruit. Every tree that does not bear good fruit is cut down and thrown into the fire. Thus, by their fruit you will recognize them.</i></p><p>Matthew 7: 16-19</p><p>Ask yourself these questions and answer them honestly to the best of your ability: has the Jewish diaspora borne good fruit or bad fruit for the United States of America? Specifically what divine blessings do Americans appear to have enjoyed since 1946 and 1965? And why does the USA in 2021 appear to look increasingly like the USSR in 1921?</p></div>",
  "content_text": "I’m entirely confident that the “Andrew Anglin” who wrote\nthis column at Unz\nis not the “Andrew Anglin” I debated a few years ago. Regardless, the column is a sobering reminder that “Judeo-Christianity” is not Christianity, the god worshipped by the Jews is not the Heavenly Father of Jesus Christ, and providing post-WWII safe harbor to the Jewish diaspora appears to have served Americans about as well as doing so previously served the Egyptians, the Babylonians, the Russians, and the British.\nMy Nation Blessed Israel and All I Got Was a Mulatto Tranny Grandchild\nWhen I was a child in the 1990s, evangelical preachers and televangelists were claiming that God would “bless” a nation that “blesses” the genocidal Jew state of Israel.\nYet, here were are, 30 years later, and America has consistently “blessed” Israel. We have given them hundreds of billions of dollars over the last decades, and we have spent trillions fighting wars for them. Our boys have been sent to be maimed and to die in the name of Israel. Our government’s entire foreign policy is built around promoting the interests of Israel. We have also allowed Jews who live in America to operate unhindered, and to take over all of our institutions.\nOnce a religion that condemned the Jews as the murderers and rejecters of Christ, American Christianity has continued a process of being restructured to set Israel and the Jews at the center of it. Any given evangelical pastor is more likely to discuss Israel, and the importance of helping the Jews, than he is to discuss real world problems America faces. American Christians accepted the reclassification of Christianity as “Judeo-Christianity.”\nAmerica has engaged in an Israel-blessing orgy for decades, when traditional Christians were cleansed from the Republican Party and the conservative movement as a whole….\nThe implication of the massive dip in the quality of American life and the American experience is that God doesn’t actually bless nations that bless Israel. In fact, the assumption would have to be that God dooms nations that bless Israel.\nThis raises the obvious question, of course:\nwhich god is that?\nUnless and until you understand that the religious Jews worship the god of this world, not God the Father of Jesus Christ, and that their current objective is to destroy a) Christianity, b) Western Civilization, and c) Russia, you will never understand how and why the United States doomed itself by failing to sink the ships before WWI and after WWII. You will also not understand why the USA is almost certainly going to find itself fighting wars with both Russia and China in the next decade, and why it will lose those wars, unless it collapses of its own internal contradictions first.\nIf you don’t believe me, force yourself to read Ben Shapiro’s most recent book. You will be unable to avoid noticing how the entire purpose of the book is to subvert and redefine, not only America, but Western Civilization itself. If Americans wish to survive as a nation, they must turn back to Jesus Christ. And that is the one thing that “those who bless Israel” are absolutely determined to prevent, regardless of what they profess themselves to be.\nA refusal to take a strong stand against those who reject God and serve the devil is not a virtue for anyone, least of all the Christian. As for “judeochristianity”, it would be more honestly labeled as “pharisatanry”.\nJesus said to them, “If God were your Father, you would love me, for I have come here from God. I have not come on my own; God sent me. Why is my language not clear to you? Because you are unable to hear what I say. You belong to your father, the devil, and you want to carry out your father’s desires. He was a murderer from the beginning, not holding to the truth, for there is no truth in him. When he lies, he speaks his native language, for he is a liar and the father of lies. Yet because I tell the truth, you do not believe me! Can any of you prove me guilty of sin? If I am telling the truth, why don’t you believe me? Whoever belongs to God hears what God says. The reason you do not hear is that you do not belong to God.”\n– John 8: 42-47\nDon’t even bother playing the usual semantic games with irrelevant Scofield citations. The Sermon on the Mount, to which the linked article implicitly appeals, is conclusive on the subject. Any argument you might have is not with me, but with Jesus Christ of Nazareth himself.\nBy their fruit you will recognize them. Do people pick grapes from thornbushes, or figs from thistles? Likewise, every good tree bears good fruit, but a bad tree bears bad fruit. A good tree cannot bear bad fruit, and a bad tree cannot bear good fruit. Every tree that does not bear good fruit is cut down and thrown into the fire. Thus, by their fruit you will recognize them.\nMatthew 7: 16-19\nAsk yourself these questions and answer them honestly to the best of your ability: has the Jewish diaspora borne good fruit or bad fruit for the United States of America? Specifically what divine blessings do Americans appear to have enjoyed since 1946 and 1965? And why does the USA in 2021 appear to look increasingly like the USSR in 1921?",
  "tags": [
    "immigration"
  ],
  "categories": [],
  "sitemap_lastmod": "2021-05-20T11:48:48+00:00"
}