{
  "url": "https://voxday.net/2021/05/24/china-warns-australia/",
  "scraped_at": "2025-12-21T22:50:17.716636",
  "title": "China warns Australia",
  "date_display": "May 24, 2021",
  "date_iso": "2021-05-24T12:00:03+00:00",
  "date_from_url": "2021-05-24",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p> It appears China is beginning <a href=\"https://www.dailymail.co.uk/news/article-9609539/China-warns-Australia-hit-keeps-meddling-military-exercises.html\" rel=\"noopener\" target=\"_blank\">to warn off the second-tier players</a> in what looks rather like preparation for a move on Taiwan:</p><blockquote><p>Australia’s military is ‘weak,’ ‘insignificant’ and will be the ‘first hit’ in any potential conflict over Taiwan, Chinese propagandists have warned.</p><p>The chilling message in the Communist Party mouthpiece, the Global Times, comes as Australian naval forces completed war game exercises with the US, France and Japan held between May 11 and 17 in the East China Sea.</p><p>The first ever training drill between the four nations called Exercise Jeanne d’Arc 21 – or ARC21 – practiced amphibious assaults, urban warfare and anti-aircraft defence – and was met with fury by Beijing.</p><p>‘The People’s Liberation Army doesn’t even need to make pointed responses to the joint drill since it’s insignificant militarily,’ the article said. ‘Australia’s military is too weak to be a worthy opponent of China, and if it dares to interfere in a military conflict for example in the Taiwan Straits, its forces will be among the first to be hit. Australia must not think it can hide from China if it provokes. Australia is within range of China’s conventional warhead-equipped DF-26 intermediate-range ballistic missile.’</p><p>Over the past year China has slapped more than $20billion worth of arbitrary trade bans and tariffs on Australian exports as an apparent punishment for calling for an independent inquiry into the origins of the Covid-19 pandemic – which first appeared in Wuhan in 2019.</p><p>Tensions were further strained last month when various figures including the likes of Defence Minister Peter Dutton, Former Defence Minister Christopher Pyne and Home Affairs secretary Michael Pezzullo, all suggested the ‘drums of war’ in the region are getting louder.</p></blockquote><p>Just in case the warning hasn’t been received, <i>The Global Times</i> has underlined the point <a href=\"https://www.globaltimes.cn/page/202105/1223991.shtml\" rel=\"noopener\" target=\"_blank\">in an interview</a> with an Australian academic who is an expert on Sino-Australian relations:</p><blockquote><p>Recently, the Morrison government has been constantly commenting on the possibility of Australian military engagement in a future US-China war over Taiwan. However, this was met with harsh criticism from former prime minister Kevin Rudd and numerous scholars. Is the Morrison government clear about the consequences of war? Why is Canberra standing close by Washington to confront China instead of striking a balance between the two like most other countries do? Global Times (GT) reporter Wang Wenwen talked to James Laurenceson (Laurenceson), director of the Australia-China Relations Institute, University of Technology Sydney, over these issues.</p><p><b>GT:</b> How is the Morrison government’s hype of war dangerous and damaging? Do you think the hawkish officials from the Morrison government are clearly aware of the consequences of a military clash with China to Australia? Or is talking about war just an easy gesture to make for political expediency?</p><p><b>Laurenceson:</b> Former prime minister Rudd’s criticism of war talk was mostly because he regarded it as being deployed by members of the current Morrison government for domestic political gain. But in the process, the chest-thumping rhetoric further damages Australia’s already dysfunctional relationship with China, nor did it inform the Australian public just how catastrophic the costs of such a war would be. </p><p>This political tactic of hyping an external “threat” to induce a “rallying around the flag” effect occurs in other countries too, including China and the US. That said, the risk of a kinetic conflict over Taiwan has increased compared with, say, five years ago. This means it is appropriate for sober-minded analysis and planning within the Australian government’s Department of Defence, and in communicating to the public just what is at stake in terms of Australia’s national interests and values. But the priority must be avoiding a military conflict, not hyping the risk for domestic political gain, or regarding it as inevitable and now starting to treat China as a de-facto enemy. China is far more a friend to Australia than an enemy.   </p><p>GT: Most analysts would not deny that Washington can no longer expect a quick and easy victory in a war with China in the Western Pacific. Why has Australia under Morrison been boasting following the US and taking the risk?</p><p>Laurenceson: Within the Australian government, there is a significant gap between the key decision-makers and those more on the fringe. The reported hawkish comments by Minister for Defence, Peter Dutton, for example, were more qualified when you read the full transcript of what he said rather than just the version presented in the headlines…</p><p>GT: Although Australia and the US are allies, how much confidence do Australia’s political and strategic circles have toward the actual support and protection Washington will (or can) offer to Australia?</p><p>Laurenceson: I think there is a high degree of confidence within political and strategic circles that the US would support Australia in a military conflict. Of course, there are a lot of scenarios between where things are now and one where Australia is being attacked in a military conflict. And along that spectrum, my view is that Australia should be realistic and not be “doe-eyed” about what it can expect from America.</p></blockquote><p>Australia would be insane to place any trust whatsoever in the increasingly incomptent US military, which at this point would be more likely to send them a transgender dance troupe to twerk defiance at the Chinese than risk the chance that an aircraft carrier group would end up on the bottom of the Western Pacific. South Korea appears to understand this, as it <a href=\"https://www.globaltimes.cn/page/202105/1224126.shtml\" rel=\"noopener\" target=\"_blank\">certainly doesn’t want</a> any part of the Taiwan question.</p></div>",
  "content_text": "It appears China is beginning\nto warn off the second-tier players\nin what looks rather like preparation for a move on Taiwan:\nAustralia’s military is ‘weak,’ ‘insignificant’ and will be the ‘first hit’ in any potential conflict over Taiwan, Chinese propagandists have warned.\nThe chilling message in the Communist Party mouthpiece, the Global Times, comes as Australian naval forces completed war game exercises with the US, France and Japan held between May 11 and 17 in the East China Sea.\nThe first ever training drill between the four nations called Exercise Jeanne d’Arc 21 – or ARC21 – practiced amphibious assaults, urban warfare and anti-aircraft defence – and was met with fury by Beijing.\n‘The People’s Liberation Army doesn’t even need to make pointed responses to the joint drill since it’s insignificant militarily,’ the article said. ‘Australia’s military is too weak to be a worthy opponent of China, and if it dares to interfere in a military conflict for example in the Taiwan Straits, its forces will be among the first to be hit. Australia must not think it can hide from China if it provokes. Australia is within range of China’s conventional warhead-equipped DF-26 intermediate-range ballistic missile.’\nOver the past year China has slapped more than $20billion worth of arbitrary trade bans and tariffs on Australian exports as an apparent punishment for calling for an independent inquiry into the origins of the Covid-19 pandemic – which first appeared in Wuhan in 2019.\nTensions were further strained last month when various figures including the likes of Defence Minister Peter Dutton, Former Defence Minister Christopher Pyne and Home Affairs secretary Michael Pezzullo, all suggested the ‘drums of war’ in the region are getting louder.\nJust in case the warning hasn’t been received,\nThe Global Times\nhas underlined the point\nin an interview\nwith an Australian academic who is an expert on Sino-Australian relations:\nRecently, the Morrison government has been constantly commenting on the possibility of Australian military engagement in a future US-China war over Taiwan. However, this was met with harsh criticism from former prime minister Kevin Rudd and numerous scholars. Is the Morrison government clear about the consequences of war? Why is Canberra standing close by Washington to confront China instead of striking a balance between the two like most other countries do? Global Times (GT) reporter Wang Wenwen talked to James Laurenceson (Laurenceson), director of the Australia-China Relations Institute, University of Technology Sydney, over these issues.\nGT:\nHow is the Morrison government’s hype of war dangerous and damaging? Do you think the hawkish officials from the Morrison government are clearly aware of the consequences of a military clash with China to Australia? Or is talking about war just an easy gesture to make for political expediency?\nLaurenceson:\nFormer prime minister Rudd’s criticism of war talk was mostly because he regarded it as being deployed by members of the current Morrison government for domestic political gain. But in the process, the chest-thumping rhetoric further damages Australia’s already dysfunctional relationship with China, nor did it inform the Australian public just how catastrophic the costs of such a war would be.\nThis political tactic of hyping an external “threat” to induce a “rallying around the flag” effect occurs in other countries too, including China and the US. That said, the risk of a kinetic conflict over Taiwan has increased compared with, say, five years ago. This means it is appropriate for sober-minded analysis and planning within the Australian government’s Department of Defence, and in communicating to the public just what is at stake in terms of Australia’s national interests and values. But the priority must be avoiding a military conflict, not hyping the risk for domestic political gain, or regarding it as inevitable and now starting to treat China as a de-facto enemy. China is far more a friend to Australia than an enemy.\nGT: Most analysts would not deny that Washington can no longer expect a quick and easy victory in a war with China in the Western Pacific. Why has Australia under Morrison been boasting following the US and taking the risk?\nLaurenceson: Within the Australian government, there is a significant gap between the key decision-makers and those more on the fringe. The reported hawkish comments by Minister for Defence, Peter Dutton, for example, were more qualified when you read the full transcript of what he said rather than just the version presented in the headlines…\nGT: Although Australia and the US are allies, how much confidence do Australia’s political and strategic circles have toward the actual support and protection Washington will (or can) offer to Australia?\nLaurenceson: I think there is a high degree of confidence within political and strategic circles that the US would support Australia in a military conflict. Of course, there are a lot of scenarios between where things are now and one where Australia is being attacked in a military conflict. And along that spectrum, my view is that Australia should be realistic and not be “doe-eyed” about what it can expect from America.\nAustralia would be insane to place any trust whatsoever in the increasingly incomptent US military, which at this point would be more likely to send them a transgender dance troupe to twerk defiance at the Chinese than risk the chance that an aircraft carrier group would end up on the bottom of the Western Pacific. South Korea appears to understand this, as it\ncertainly doesn’t want\nany part of the Taiwan question.",
  "tags": [
    "war"
  ],
  "categories": [],
  "sitemap_lastmod": "2021-05-24T11:00:03+00:00"
}