{
  "url": "https://voxday.net/2021/05/15/dont-believe-jerusalem-joe/",
  "scraped_at": "2025-12-21T22:48:57.935888",
  "title": "Don’t believe Jerusalem Joe",
  "date_display": "May 15, 2021",
  "date_iso": "2021-05-15T23:07:35+00:00",
  "date_from_url": "2021-05-15",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>If you weren’t inclined to believe everything that Baghdad Bob said about the great victories of the Iraqi military, you shouldn’t be stupid enough to take Jerusalem Joe at his word either. While more than a few philo-IDFites <a href=\"https://legalinsurrection.com/2021/05/reports-israel-lured-hamas-fighters-into-tunnels-with-rumor-of-ground-invasion-then-bombed-tunnels-in-massive-airstrike/\" rel=\"noopener\" target=\"_blank\">have swallowed the “we totally meant to do that” line</a> of the announced ground invasion that wasn’t, and exulted in the “brilliance” of total destruction of Hamas’s elite forces though a press release, I was more than a little skeptical of US media Jews reporting on the astonishing cleverness of Israeli military Jews in outwitting a group of unsuspecting gentiles, who were totally defeated by little more than deceitful words.</p><p>Let’s just say the narrative struck me as a little bit… familiar. Also, the idea that enemy troops on the ground – indeed, underground – were completely destroyed by artillery and air strikes tends to be one that lasts right up until the moment that the ground troops actually go in. Let’s just say “no one could have survived that” is a concept that has been repeatedly disproven everywhere from Normandy to the South Pacific.</p><blockquote><p>The Israeli military apparently used a brilliant deceptive maneuver to take out Hamas’s terrorist fighting force and underground tunnels — in a single blow.</p><p>In what could only be described as killing two birds with one stone, the Israel Defense Forces on Thursday night told news reporters that the Israeli ground forces were on their way to Hamas-held Gaza.</p><p>The news spread quickly through the mainstream media and affiliated social media accounts. Believing an Israeli ground invasion to be imminent, Hamas ordered its terrorist fighters to seek shelter in the tunnel network dug up under the Gaza city.</p><p>What followed the Hamas mobilization was a massive wave of Israeli airstrikes — comprising of 160 aircraft — on the Gaza tunnel network with the jihadi group’s top terror brass sitting underground, right where the IDF wanted them.</p></blockquote><p>The fact that the failure of this “brilliant deceptive maneuver” was going to be apparent as soon as the next round of rockets were launched doesn’t seem to have occurred to any of the idiots who didn’t hesitate to celebrate Israel’s total victory through extreme cleverness by applied average 115 IQ. And indeed, while more sober and experienced Israeli sources dutifully stuck by the official “ruse” report, <a href=\"https://www.debka.com/half-of-hamas-manpower-is-non-operational-idf-hit-and-run-strikes-will-target-its-remaining-rocket-stocks/\" rel=\"noopener\" target=\"_blank\">they were considerably less convinced</a> about its results.</p><blockquote><p>An IDF ruse was behind the “embarrassing leak” to world media on Thursday night, May 13, reporting the start of an IDF ground invasion of the Gaza Strip, It was denied early Friday morning and explained by an “internal communication problem.” DEBKAfile’s military sources reveal that this false story was in fact planted deliberately to bring Hamas elite forces out of their bunkers to confront the “invaders” – whereupon they were to be clobbered by Israeli warplanes. How far this trick worked has not been disclosed. A similar subterfuge was tried 13 years ago – in reverse. On Dec. 27, 2008, IDF sources leaked to world media that the military had been ordered to refrain from responding with ground action to a past Hamas rocket barrage, Its commanders were taken in and staged a police school graduation parade in Gaza in the open. They were bombed by Israeli jets.</p><p>For now, the IDF has not given up on a ground operation inside Gaza. Whenever it goes forward, it is planned to be a fast in-and-out raid for well-defined targets before pulling back. Up until Friday, May 14, Hamas and Islamic Jihad had exhausted no more than a quarter of their rocket stocks, dozens dropping short inside the enclave. The bulk, however, remained out of reach of Israeli air strikes, tucked away deep inside underground stores. Destroying this stockpile would be the main target of any Israeli ground operation.</p><p>Hamas has also kept its elite Izz e-din Al Qassam battalion safe and whole by dispersing its members among well-fortified bunkers, designed to withstand both aerial and ground assaults. In contrast, around half of the 15 ordinary units, split into four regional brigades, have been knocked out of action.</p></blockquote><p>So, neither the leadership nor the elite were knocked out by the stunning ruse after all? What’s the real story? We don’t know yet, but we do know that the pace of the rocket launches by Hamas <a href=\"https://www.debka.com/mivzak/hamas-rockets-aimed-overnight-at-airport-ramleh-ashdod-inland-shefela/\" rel=\"noopener\" target=\"_blank\">doesn’t appear to have slowed</a> considerably, which tends to indicate that the Jerusalem Joe narrative was a false one.</p><p><i>For the fifth night running, Hamas and Islamic Jihad spread a barrage of some 190 rockets over large parts of Israel. </i></p><p>Personally, I think it’s much more likely that someone in the IDF media department screwed up in the erroneous belief that the planned ground invasion had begun, but rather than simply admit the embarrassing mistake to the world press, they decided to sell it as intentional in order to support the increasingly creaky narrative of the invincible IDF, which took a serious hit in the Second Lebanon War of 2006.</p><p>In any event, remember that the only thing we can be absolutely sure did NOT happen is whatever the mainstream media is reporting.</p><p><b>UPDATE: </b><a href=\"https://www.rt.com/news/523942-israel-defense-forces-gaza-invasion/\">Ahem….</a></p><p><i>Israel Defense Forces say false Gaza invasion report to foreign media was ‘mistake’ and not manipulation to lure Hamas into trap.</i></p></div>",
  "content_text": "If you weren’t inclined to believe everything that Baghdad Bob said about the great victories of the Iraqi military, you shouldn’t be stupid enough to take Jerusalem Joe at his word either. While more than a few philo-IDFites\nhave swallowed the “we totally meant to do that” line\nof the announced ground invasion that wasn’t, and exulted in the “brilliance” of total destruction of Hamas’s elite forces though a press release, I was more than a little skeptical of US media Jews reporting on the astonishing cleverness of Israeli military Jews in outwitting a group of unsuspecting gentiles, who were totally defeated by little more than deceitful words.\nLet’s just say the narrative struck me as a little bit… familiar. Also, the idea that enemy troops on the ground – indeed, underground – were completely destroyed by artillery and air strikes tends to be one that lasts right up until the moment that the ground troops actually go in. Let’s just say “no one could have survived that” is a concept that has been repeatedly disproven everywhere from Normandy to the South Pacific.\nThe Israeli military apparently used a brilliant deceptive maneuver to take out Hamas’s terrorist fighting force and underground tunnels — in a single blow.\nIn what could only be described as killing two birds with one stone, the Israel Defense Forces on Thursday night told news reporters that the Israeli ground forces were on their way to Hamas-held Gaza.\nThe news spread quickly through the mainstream media and affiliated social media accounts. Believing an Israeli ground invasion to be imminent, Hamas ordered its terrorist fighters to seek shelter in the tunnel network dug up under the Gaza city.\nWhat followed the Hamas mobilization was a massive wave of Israeli airstrikes — comprising of 160 aircraft — on the Gaza tunnel network with the jihadi group’s top terror brass sitting underground, right where the IDF wanted them.\nThe fact that the failure of this “brilliant deceptive maneuver” was going to be apparent as soon as the next round of rockets were launched doesn’t seem to have occurred to any of the idiots who didn’t hesitate to celebrate Israel’s total victory through extreme cleverness by applied average 115 IQ. And indeed, while more sober and experienced Israeli sources dutifully stuck by the official “ruse” report,\nthey were considerably less convinced\nabout its results.\nAn IDF ruse was behind the “embarrassing leak” to world media on Thursday night, May 13, reporting the start of an IDF ground invasion of the Gaza Strip, It was denied early Friday morning and explained by an “internal communication problem.” DEBKAfile’s military sources reveal that this false story was in fact planted deliberately to bring Hamas elite forces out of their bunkers to confront the “invaders” – whereupon they were to be clobbered by Israeli warplanes. How far this trick worked has not been disclosed. A similar subterfuge was tried 13 years ago – in reverse. On Dec. 27, 2008, IDF sources leaked to world media that the military had been ordered to refrain from responding with ground action to a past Hamas rocket barrage, Its commanders were taken in and staged a police school graduation parade in Gaza in the open. They were bombed by Israeli jets.\nFor now, the IDF has not given up on a ground operation inside Gaza. Whenever it goes forward, it is planned to be a fast in-and-out raid for well-defined targets before pulling back. Up until Friday, May 14, Hamas and Islamic Jihad had exhausted no more than a quarter of their rocket stocks, dozens dropping short inside the enclave. The bulk, however, remained out of reach of Israeli air strikes, tucked away deep inside underground stores. Destroying this stockpile would be the main target of any Israeli ground operation.\nHamas has also kept its elite Izz e-din Al Qassam battalion safe and whole by dispersing its members among well-fortified bunkers, designed to withstand both aerial and ground assaults. In contrast, around half of the 15 ordinary units, split into four regional brigades, have been knocked out of action.\nSo, neither the leadership nor the elite were knocked out by the stunning ruse after all? What’s the real story? We don’t know yet, but we do know that the pace of the rocket launches by Hamas\ndoesn’t appear to have slowed\nconsiderably, which tends to indicate that the Jerusalem Joe narrative was a false one.\nFor the fifth night running, Hamas and Islamic Jihad spread a barrage of some 190 rockets over large parts of Israel.\nPersonally, I think it’s much more likely that someone in the IDF media department screwed up in the erroneous belief that the planned ground invasion had begun, but rather than simply admit the embarrassing mistake to the world press, they decided to sell it as intentional in order to support the increasingly creaky narrative of the invincible IDF, which took a serious hit in the Second Lebanon War of 2006.\nIn any event, remember that the only thing we can be absolutely sure did NOT happen is whatever the mainstream media is reporting.\nUPDATE:\nAhem….\nIsrael Defense Forces say false Gaza invasion report to foreign media was ‘mistake’ and not manipulation to lure Hamas into trap.",
  "tags": [
    "war"
  ],
  "categories": [],
  "sitemap_lastmod": "2021-05-15T22:07:35+00:00"
}