{
  "url": "https://voxday.net/2021/05/26/implied-consent-for-vaccination/",
  "scraped_at": "2025-12-21T22:50:41.263477",
  "title": "Implied consent for vaccination",
  "date_display": "May 26, 2021",
  "date_iso": "2021-05-26T11:35:44+00:00",
  "date_from_url": "2021-05-26",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>I’m as virulently opposed to the not-vaccines as anyone, and frankly believe those responsible for creating them, advocating for them, and mandating them should be found guilty of crimes against humanity, but it is wise to avoid mischaracterizing the actions of the other side if one’s criticisms are to remain credible. For example, I’ve read <a href=\"https://www.who.int/immunization/programmes_systems/policies_strategies/consent_note_en.pdf\" rel=\"noopener\" target=\"_blank\">the WHO report</a> entitled <i>Considerations regarding consent in vaccinating children and adolescents between 6 and 17 years old</i>, and it simply does not indicate that the WHO “now considers your child’s presence in school informed consent to vaccinate that child”.</p><p>This is what the report actually says:</p><blockquote><p>1. A formal, written consent process is used, particularly in middle- and high-income countries that have a higher percentage of literate populations and a longer history of providing vaccination to older age groups. Vaccination of this target group may be delivered through school health services. Health authorities inform the parents about the vaccination and written consent from the parent is required to opt-in, i.e. give permission for the older child/adolescent to be vaccinated. Alternatively, a written form is used to allow parents to express non-consent (or refusal) to vaccination of their child. This is known as an opt-out procedure.</p><p>2. A verbal consent process, whereby consent is given verbally by the parent after being duly informed about the vaccination. However, this approach can only be used when parents accompany the child to the vaccination.</p><p>3. An implied consent  process by which parents are informed of imminent vaccination through social mobilization and communication, sometimes including letters directly addressed to the parents. Subsequently, the physical presence of the child or adolescent, with or without an accompanying parent at the vaccination session, is considered to imply consent. This practice is based on the opt-out principle and parents who do not consent to vaccination are expected implicitly to take steps to ensure that their child or adolescent does not participate in the vaccination session. This may include not letting the child or adolescent attend school on a vaccination day, if vaccine delivery occurs through schools…. </p><p>A common concern is that consent procedures aﬀect vaccine acceptance and coverage. When comparing data from countries using written consent and those using informal, verbal or implied consent processes, comparable levels for vaccination can be seen in both settings.This suggests that the association between the informed consent procedure that a country uses, and actual levels of immunization coverage, is not strong.</p></blockquote><p>While every parent should be wary of the “implied consent” standard and be certain that it does not apply to one’s children’s schools, the key is the distinction between the opt-in and the opt-out standards. But in both cases, for the time being, parental authority is still being respected.</p><p>That being said, you had better <a href=\"https://twitter.com/CanAditude/status/1395113595957125121\" rel=\"noopener\" target=\"_blank\">learn your local laws</a> and take action accordingly. It might already be time <a href=\"https://twitter.com/mikhail86439176/status/1397070280225402891\" rel=\"noopener\" target=\"_blank\">to leave Canada</a> to the Chinese.</p><blockquote><p>Dozens of children flocked to the playground of Gordon A. Brown Middle School on Wednesday afternoon, to eagerly await their first dose of the Pfizer vaccine. Most were accompanied by parents, or older siblings, as the East York school announced Wednesday morning it would launch a pop-up clinic that afternoon.</p><p>Many parents had already been vaccinated — they were there to provide support. What they weren’t there for was to give permission. In Toronto, those 12-15 don’t need a parent or guardian to allow them to take the vaccine. Health Canada approved the Pfizer COVID-19 vaccine for those aged 12 to 15 on May 5, making Canada the first country to do so, with the hopes that school restrictions could be eased in the fall.</p></blockquote></div>",
  "content_text": "I’m as virulently opposed to the not-vaccines as anyone, and frankly believe those responsible for creating them, advocating for them, and mandating them should be found guilty of crimes against humanity, but it is wise to avoid mischaracterizing the actions of the other side if one’s criticisms are to remain credible. For example, I’ve read\nthe WHO report\nentitled\nConsiderations regarding consent in vaccinating children and adolescents between 6 and 17 years old\n, and it simply does not indicate that the WHO “now considers your child’s presence in school informed consent to vaccinate that child”.\nThis is what the report actually says:\n1. A formal, written consent process is used, particularly in middle- and high-income countries that have a higher percentage of literate populations and a longer history of providing vaccination to older age groups. Vaccination of this target group may be delivered through school health services. Health authorities inform the parents about the vaccination and written consent from the parent is required to opt-in, i.e. give permission for the older child/adolescent to be vaccinated. Alternatively, a written form is used to allow parents to express non-consent (or refusal) to vaccination of their child. This is known as an opt-out procedure.\n2. A verbal consent process, whereby consent is given verbally by the parent after being duly informed about the vaccination. However, this approach can only be used when parents accompany the child to the vaccination.\n3. An implied consent  process by which parents are informed of imminent vaccination through social mobilization and communication, sometimes including letters directly addressed to the parents. Subsequently, the physical presence of the child or adolescent, with or without an accompanying parent at the vaccination session, is considered to imply consent. This practice is based on the opt-out principle and parents who do not consent to vaccination are expected implicitly to take steps to ensure that their child or adolescent does not participate in the vaccination session. This may include not letting the child or adolescent attend school on a vaccination day, if vaccine delivery occurs through schools….\nA common concern is that consent procedures aﬀect vaccine acceptance and coverage. When comparing data from countries using written consent and those using informal, verbal or implied consent processes, comparable levels for vaccination can be seen in both settings.This suggests that the association between the informed consent procedure that a country uses, and actual levels of immunization coverage, is not strong.\nWhile every parent should be wary of the “implied consent” standard and be certain that it does not apply to one’s children’s schools, the key is the distinction between the opt-in and the opt-out standards. But in both cases, for the time being, parental authority is still being respected.\nThat being said, you had better\nlearn your local laws\nand take action accordingly. It might already be time\nto leave Canada\nto the Chinese.\nDozens of children flocked to the playground of Gordon A. Brown Middle School on Wednesday afternoon, to eagerly await their first dose of the Pfizer vaccine. Most were accompanied by parents, or older siblings, as the East York school announced Wednesday morning it would launch a pop-up clinic that afternoon.\nMany parents had already been vaccinated — they were there to provide support. What they weren’t there for was to give permission. In Toronto, those 12-15 don’t need a parent or guardian to allow them to take the vaccine. Health Canada approved the Pfizer COVID-19 vaccine for those aged 12 to 15 on May 5, making Canada the first country to do so, with the hopes that school restrictions could be eased in the fall.",
  "tags": [
    "education"
  ],
  "categories": [],
  "sitemap_lastmod": "2021-05-26T10:35:44+00:00"
}