{
  "url": "https://voxday.net/2021/05/21/junior-classics-vols-i-iii/",
  "scraped_at": "2025-12-21T22:49:52.001074",
  "title": "Junior Classics vols. I-III",
  "date_display": "May 21, 2021",
  "date_iso": "2021-05-21T14:53:29+00:00",
  "date_from_url": "2021-05-21",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>The first three volumes of the JUNIOR CLASSICS 2020 Edition <a href=\"https://4noh3.r.bh.d.sendibt3.com/mk/cl/f/eg3LTD0CT2zIwaYxo-b8C8iY-tk78vw8kNVHIXebLELzDyMGzfhv3rA0YFSJLlr13nNDRXfBkPvJR_KkkRcQcvHdCgDHYvVx9cj9F35SxuxekYFcAVq2SuXTgeIGcISZ07I3R8YZE1t-1bdxyADR16fyE62rH2Yv4yDCK4hFRcihOLuqXEBr8jw2fnqHwgm2YJwn8JopfKb-Bao6YNmbRyHnZsu8\" rel=\"noopener\" target=\"_blank\">are now available in epub format</a>. They can be purchased at the Arkhaven store, and emails with discount codes have been sent to all the backers to permit them to download the ebooks from the store for free. These are larger files than normal, as the ebook editions contain all of the illustrations featured in the print editions.</p><p>Volumes IV, V, and VI are currently nearing completion for both print and ebook editions. </p><p><b>UPDATE: </b>For the Nth time, this blog is neither tech nor sales support and your inability to manage your email filters is not my concern. All comments concerning “I didn’t get the email” will be spammed on sight. FFS, check your damned Spam and Social folders, and as usual, next week we’ll post instructions for those who still haven’t received the email. I understand that it’s frustrating when you are waiting for something, but one thing that we have regularly observed over the years is that when the process works just fine for 1,000 people and it doesn’t work for a small number, a) the problem is rarely on our side, and b) the solution isn’t. Furthermore, if the problem is that you aren’t receiving emails, how is sending you another email that you probably won’t receive going to resolve anything?</p><div class=\"separator\" style=\"clear: both; text-align: center;\"><a href=\"https://social.infogalactic.com/images/posts/43ba1317-e9e6-4d75-ac95-41de23518956/original-2319a05ef685a2ee9add1ec21087cfdc.jpg?v=63788820978\" style=\"margin-left: 1em; margin-right: 1em;\"><noscript><img border=\"0\" data-original-height=\"420\" data-original-width=\"263\" decoding=\"async\" src=\"https://social.infogalactic.com/images/posts/43ba1317-e9e6-4d75-ac95-41de23518956/original-2319a05ef685a2ee9add1ec21087cfdc.jpg?v=63788820978\"/></noscript><img border=\"0\" class=\"lazyload\" data-original-height=\"420\" data-original-width=\"263\" data-src=\"https://social.infogalactic.com/images/posts/43ba1317-e9e6-4d75-ac95-41de23518956/original-2319a05ef685a2ee9add1ec21087cfdc.jpg?v=63788820978\" decoding=\"async\" src=\"data:image/svg+xml,%3Csvg%20xmlns=%22http://www.w3.org/2000/svg%22%20viewBox=%220%200%20263%20420%22%3E%3C/svg%3E\"/></a></div></div>",
  "content_text": "The first three volumes of the JUNIOR CLASSICS 2020 Edition\nare now available in epub format\n. They can be purchased at the Arkhaven store, and emails with discount codes have been sent to all the backers to permit them to download the ebooks from the store for free. These are larger files than normal, as the ebook editions contain all of the illustrations featured in the print editions.\nVolumes IV, V, and VI are currently nearing completion for both print and ebook editions.\nUPDATE:\nFor the Nth time, this blog is neither tech nor sales support and your inability to manage your email filters is not my concern. All comments concerning “I didn’t get the email” will be spammed on sight. FFS, check your damned Spam and Social folders, and as usual, next week we’ll post instructions for those who still haven’t received the email. I understand that it’s frustrating when you are waiting for something, but one thing that we have regularly observed over the years is that when the process works just fine for 1,000 people and it doesn’t work for a small number, a) the problem is rarely on our side, and b) the solution isn’t. Furthermore, if the problem is that you aren’t receiving emails, how is sending you another email that you probably won’t receive going to resolve anything?",
  "tags": [
    "books"
  ],
  "categories": [],
  "sitemap_lastmod": "2021-05-21T13:53:29+00:00"
}