{
  "url": "https://voxday.net/2021/05/31/memorializing-a-massive-mistake/",
  "scraped_at": "2025-12-21T22:51:27.395381",
  "title": "Memorializing a massive mistake",
  "date_display": "May 31, 2021",
  "date_iso": "2021-05-31T12:39:37+00:00",
  "date_from_url": "2021-05-31",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>Already, nearly one-third of Americans either aren’t sure or believe that <a href=\"https://www.dailymail.co.uk/news/article-9635983/A-Americans-unconvinced-sending-troops-fight-World-War-II-right-decision.html\" rel=\"noopener\" target=\"_blank\">US involvement in WWII was a mistake</a>. They’re absolutely right to doubt the wisdom or the justice of US military involvement, particularly on Memorial Day. WWII was a massive mistake for Americans, a far more catastrophic and costly mistake than Korea, Vietnam and Afghanistan combined, with serious consequences that led directly to the decline of the American nation and the expected collapse of the USA as a political entity. </p><p>I can assure you that if every U.S. citizen were to read <i>Stalin’s War</i>, which is an excellent and well-sourced revisionist history by Sean McMeekin that relies heavily upon Soviet records that were not available before 1989, that 32 percent figure would rise to at least 98 percent.</p><blockquote><p>More than 75 years after the conclusion of World War Two, one third of Americans are questioning the country’s decision to send troops into battle. A new Economist/YouGov poll suggests that doubters believe it to be a mistake or are unsure if it was the right decision. </p><p>The poll, which was timed to coincide with Memorial Day, asked people for their opinions were on the decision to send American troops to fight in particular wars.</p><p>The question was asked: ‘Do you think the United States made a mistake sending troops to fight in the following wars?’ </p><p>The poll considered conflicts spread over more than 100 years including both World Wars, the Vietnam War and the more recent conflicts in Iraq and Afghanistan. </p><p>Some 14 percent of Americans said they believed sending troops to fight the Nazi-led Axis powers during World War II was a mistake and an additional 18 percent weren’t sure, although the support for the decision to send troops to fight the Nazis received more support than any other war at 68 percent.</p><p>However, one third of Americans were still unsure if President Roosevelt made the right decision.</p></blockquote><p>President Roosevelt didn’t make the right decision. In fact, it is now obvious and well-documented that both President Roosevelt and Winston Churchill were very clearly taking orders from someone, presumably someone connected to the small group of Jews <a href=\"https://archive.org/stream/JewsDeclareWarOnGermany1933/JewsDeclareWarOnGermany1933_djvu.txt\" rel=\"noopener\" target=\"_blank\">who declared war on Germany in 1933</a>, and that both elected leaders were instructed to back Stalin without question, even to the direct and material detriment of their own soldiers, countries, and national interests. The treasonous subservience of Roosevelt, in particular, eventually resulted in <a href=\"https://en.wikipedia.org/wiki/Morgenthau_Plan\" rel=\"noopener\" target=\"_blank\">the attempted mass murder</a> of 28 million Germans by US Secretary of State Henry Morgenthau, and also created the industrial Soviet Union by propping up the Soviet economy for 40 years despite the intrinsic economic dysfunctionality of communism.</p><ul style=\"text-align: left;\"><li><i>Stalin’s looting battalions were able to cart off from Germany alone, by the end of 1946, 4.15 million tons of industrial, commercial, artistic, and intellectual property in 519,000 railway wagons-an operation that would ultimately net Stalin 9.991 million tons of industrial goods.</i></li><li><i>If we include non-German countries, the Soviet intake of war booty totaled, by the end of 1947, the equipment, inventory, intellectual property, and records of 1.2 million separate factories or enterprises, including Siemens, BMW, and Allianz Insurance.</i></li><li><i>So voluminous were American lend-lease shipments across the Pacific to the Far East in this period-during the climactic phase of the war against Japan-that they equaled the volume shipped across the North Atlantic during the entire war to support the Red Army against the Wehrmacht, rounding out a total shipped across the Pacific of 8.244 million tons, which did not even include the warplanes flown into Siberia via ASLIB along with the sensitive and often strategic cargo they contained.</i></li></ul><p>The mass pillaging of Germany, Romany, Poland, Hungary, and Yugoslavia actually cost the Soviets more than the so-called “Lend-Lease” material did, because the Soviets didn’t get free shipping for their war booty. The Roosevelt administration not only gave the Soviet Union an unthinkable amount of industrial material, food, factories, and military supplies, it didn’t even charge the Soviets anything for the costs of transporting everything from Iowa and Ohio to Vladivostok.</p><p>However, Stalin not only double-crossed Roosevelt and Churchill, he also eventually betrayed their masters, which is one reason today’s neoclowns now reside in the United States and are still banging the drum for a revenge war with Russia as they try to redefine the concept of “the West” in the same self-serving way they redefined “America” as an idea instead of an actual people.</p><p>And, just to make matters worse, Roosevelt summarily rejected Germany’s attempt to surrender to the Western Allies in April 1943, despite the fact that Stalin was not only willing to accept an end to the war, but offered Germany a separate peace in two rounds of negotiations held in Stockholm through the spring of 1943 if Hitler would agree to the 1939 frontiers that had been originally agreed in the Molotov-Ribbentrop pact. Of course Hitler, being an idiot, didn’t accept the Soviet offer.</p><p>The undeniable historical fact is that D-Day was totally unnecessary, as Germany attempted to surrender more than TWO YEARS before its surrender was finally accepted in May 1945. In other words, <i>every single American life</i> lost in the campaign on the Western Front was a needless sacrifice and a tragic waste.</p><p>Happy Memorial Day.</p></div>",
  "content_text": "Already, nearly one-third of Americans either aren’t sure or believe that\nUS involvement in WWII was a mistake\n. They’re absolutely right to doubt the wisdom or the justice of US military involvement, particularly on Memorial Day. WWII was a massive mistake for Americans, a far more catastrophic and costly mistake than Korea, Vietnam and Afghanistan combined, with serious consequences that led directly to the decline of the American nation and the expected collapse of the USA as a political entity.\nI can assure you that if every U.S. citizen were to read\nStalin’s War\n, which is an excellent and well-sourced revisionist history by Sean McMeekin that relies heavily upon Soviet records that were not available before 1989, that 32 percent figure would rise to at least 98 percent.\nMore than 75 years after the conclusion of World War Two, one third of Americans are questioning the country’s decision to send troops into battle. A new Economist/YouGov poll suggests that doubters believe it to be a mistake or are unsure if it was the right decision.\nThe poll, which was timed to coincide with Memorial Day, asked people for their opinions were on the decision to send American troops to fight in particular wars.\nThe question was asked: ‘Do you think the United States made a mistake sending troops to fight in the following wars?’\nThe poll considered conflicts spread over more than 100 years including both World Wars, the Vietnam War and the more recent conflicts in Iraq and Afghanistan.\nSome 14 percent of Americans said they believed sending troops to fight the Nazi-led Axis powers during World War II was a mistake and an additional 18 percent weren’t sure, although the support for the decision to send troops to fight the Nazis received more support than any other war at 68 percent.\nHowever, one third of Americans were still unsure if President Roosevelt made the right decision.\nPresident Roosevelt didn’t make the right decision. In fact, it is now obvious and well-documented that both President Roosevelt and Winston Churchill were very clearly taking orders from someone, presumably someone connected to the small group of Jews\nwho declared war on Germany in 1933\n, and that both elected leaders were instructed to back Stalin without question, even to the direct and material detriment of their own soldiers, countries, and national interests. The treasonous subservience of Roosevelt, in particular, eventually resulted in\nthe attempted mass murder\nof 28 million Germans by US Secretary of State Henry Morgenthau, and also created the industrial Soviet Union by propping up the Soviet economy for 40 years despite the intrinsic economic dysfunctionality of communism.\nStalin’s looting battalions were able to cart off from Germany alone, by the end of 1946, 4.15 million tons of industrial, commercial, artistic, and intellectual property in 519,000 railway wagons-an operation that would ultimately net Stalin 9.991 million tons of industrial goods.\nIf we include non-German countries, the Soviet intake of war booty totaled, by the end of 1947, the equipment, inventory, intellectual property, and records of 1.2 million separate factories or enterprises, including Siemens, BMW, and Allianz Insurance.\nSo voluminous were American lend-lease shipments across the Pacific to the Far East in this period-during the climactic phase of the war against Japan-that they equaled the volume shipped across the North Atlantic during the entire war to support the Red Army against the Wehrmacht, rounding out a total shipped across the Pacific of 8.244 million tons, which did not even include the warplanes flown into Siberia via ASLIB along with the sensitive and often strategic cargo they contained.\nThe mass pillaging of Germany, Romany, Poland, Hungary, and Yugoslavia actually cost the Soviets more than the so-called “Lend-Lease” material did, because the Soviets didn’t get free shipping for their war booty. The Roosevelt administration not only gave the Soviet Union an unthinkable amount of industrial material, food, factories, and military supplies, it didn’t even charge the Soviets anything for the costs of transporting everything from Iowa and Ohio to Vladivostok.\nHowever, Stalin not only double-crossed Roosevelt and Churchill, he also eventually betrayed their masters, which is one reason today’s neoclowns now reside in the United States and are still banging the drum for a revenge war with Russia as they try to redefine the concept of “the West” in the same self-serving way they redefined “America” as an idea instead of an actual people.\nAnd, just to make matters worse, Roosevelt summarily rejected Germany’s attempt to surrender to the Western Allies in April 1943, despite the fact that Stalin was not only willing to accept an end to the war, but offered Germany a separate peace in two rounds of negotiations held in Stockholm through the spring of 1943 if Hitler would agree to the 1939 frontiers that had been originally agreed in the Molotov-Ribbentrop pact. Of course Hitler, being an idiot, didn’t accept the Soviet offer.\nThe undeniable historical fact is that D-Day was totally unnecessary, as Germany attempted to surrender more than TWO YEARS before its surrender was finally accepted in May 1945. In other words,\nevery single American life\nlost in the campaign on the Western Front was a needless sacrifice and a tragic waste.\nHappy Memorial Day.",
  "tags": [
    "war"
  ],
  "categories": [],
  "sitemap_lastmod": "2021-05-31T11:39:37+00:00"
}