{
  "url": "https://voxday.net/2021/05/16/must-haz-moar-negroze/",
  "scraped_at": "2025-12-21T22:49:05.246533",
  "title": "MUST HAZ MOAR NEGROZE!",
  "date_display": "May 16, 2021",
  "date_iso": "2021-05-16T17:14:13+00:00",
  "date_from_url": "2021-05-16",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>It doesn’t matter if it’s the Oscars, television advertising, NFL head coaching positions, or books about historians. The social justice prescription is always the same: <a href=\"https://www.dailymail.co.uk/news/article-9583887/Acclaimed-British-author-Richard-Cohens-new-book-historians-cancelled-US.html\" rel=\"noopener\" target=\"_blank\">MUST HAZ MOAR NEGROZE!</a></p><blockquote><p>It has taken nearly a decade to research and write, and runs to more than 750 pages. But The History Makers, described as “an epic exploration of those who write about the past”, has itself been rewritten after its author failed to take into account enough black historians, academics and writers.</p><p>Richard Cohen was told by his publisher to produce new chapters and expand others after failing to sufficiently acknowledge the roles of black people and African Americans.</p><p>“It was to do with the publisher’s sensitivities,” says Cohen, who previously wrote the highly praised <i>Chasing The Sun</i> and <i>How to Write Like Tolstoy</i>. “I was then asked to write more, and have done about another 18,000 words.”</p><p>Now, despite the rewrite, publication of the book in the US has been cancelled, according to sources in New York. Cohen’s contract with Random House in America was signed some years ago and was said by sources to be for about $350,000. Yet, after seeking the changes on black history and historians, the publisher dramatically pulled out of the deal last Wednesday.</p></blockquote><p>The crazy thing is that neither Booker T. Washington nor Frederick Douglass, for all their virtues, were historians! Why not throw in George Washington Carver, Michael Jordan, and Doctor Dre, while you’re at it? If this historians of the future learn anything, <i>anything at all</i>, from the decline and fall of the United States of America, it is this: 1) sink the ships, and, 2) always pick your own damn cotton.</p><p>It’s strange, but in all my days, I have never, ever, heard anyone ever say that what is required is more American Indians. It’s also strange how the one-drop rule is sufficient to make a man black, but not even a substantial amount of American Indian blood will prevent people from aggressively denying that a man is red.</p><p><b>UPDATE: </b>NOT ENOUGH NEGROZE! <a href=\"https://www.dailymail.co.uk/tvshowbiz/article-9583045/Friends-TV-producers-centre-race-row.html\" rel=\"noopener\" target=\"_blank\">MUST HAZ MOAR!</a></p><blockquote><p>Producers of the much anticipated Friends comeback show are at the centre of a race row after failing to cast any black actors. While the one-off return of the much loved US sitcom will feature all six members of the original line-up, the list of celebrity guests stars announced by broadcaster HBO has been criticised for a lack of diversity. </p></blockquote><p>I think they have no choice but to go their critics one better and replace Ross and Monica with Rakeem and Monique. Diversity demands it!</p></div>",
  "content_text": "It doesn’t matter if it’s the Oscars, television advertising, NFL head coaching positions, or books about historians. The social justice prescription is always the same:\nMUST HAZ MOAR NEGROZE!\nIt has taken nearly a decade to research and write, and runs to more than 750 pages. But The History Makers, described as “an epic exploration of those who write about the past”, has itself been rewritten after its author failed to take into account enough black historians, academics and writers.\nRichard Cohen was told by his publisher to produce new chapters and expand others after failing to sufficiently acknowledge the roles of black people and African Americans.\n“It was to do with the publisher’s sensitivities,” says Cohen, who previously wrote the highly praised\nChasing The Sun\nand\nHow to Write Like Tolstoy\n. “I was then asked to write more, and have done about another 18,000 words.”\nNow, despite the rewrite, publication of the book in the US has been cancelled, according to sources in New York. Cohen’s contract with Random House in America was signed some years ago and was said by sources to be for about $350,000. Yet, after seeking the changes on black history and historians, the publisher dramatically pulled out of the deal last Wednesday.\nThe crazy thing is that neither Booker T. Washington nor Frederick Douglass, for all their virtues, were historians! Why not throw in George Washington Carver, Michael Jordan, and Doctor Dre, while you’re at it? If this historians of the future learn anything,\nanything at all\n, from the decline and fall of the United States of America, it is this: 1) sink the ships, and, 2) always pick your own damn cotton.\nIt’s strange, but in all my days, I have never, ever, heard anyone ever say that what is required is more American Indians. It’s also strange how the one-drop rule is sufficient to make a man black, but not even a substantial amount of American Indian blood will prevent people from aggressively denying that a man is red.\nUPDATE:\nNOT ENOUGH NEGROZE!\nMUST HAZ MOAR!\nProducers of the much anticipated Friends comeback show are at the centre of a race row after failing to cast any black actors. While the one-off return of the much loved US sitcom will feature all six members of the original line-up, the list of celebrity guests stars announced by broadcaster HBO has been criticised for a lack of diversity.\nI think they have no choice but to go their critics one better and replace Ross and Monica with Rakeem and Monique. Diversity demands it!",
  "tags": [
    "Vibrancyisourstrength"
  ],
  "categories": [],
  "sitemap_lastmod": "2021-05-16T16:14:13+00:00"
}