{
  "url": "https://voxday.net/2021/05/04/patreon-tries-to-clean-itself-up/",
  "scraped_at": "2025-12-21T22:47:21.308268",
  "title": "Patreon tries to clean itself up",
  "date_display": "May 4, 2021",
  "date_iso": "2021-05-04T22:40:53+00:00",
  "date_from_url": "2021-05-04",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>Patreon is <a href=\"https://boundingintocomics.com/2021/05/04/patreon-reportedly-requests-monster-girl-island-developer-make-changes-to-the-game-in-order-to-remain-on-platform/\" rel=\"noopener\" target=\"_blank\">suddenly, and belatedly, attempting to clean up its Factory of Filth</a>, which would require Hercules to muck out the massive quantities of bestiality, rape, incest, and other perversions that are widely available on the platform:</p><blockquote><p>Indie game creator Redamz, best known as the creator and sole developer of the upcoming adult-oriented adventure game Monster Girl Island, has announced that he will be leaving Patreon after the platform requested that he “make changes to the game” in order to continuing using their services.</p><p>In development since roughly 2015, Monster Girl Island finds players washing ashore on the sands of a mysterious island filled with monsters such as “dragons, slimes, giant bugs, centaurs and more,” who “are all… Oddly attractive!?”</p><p>Unsurprisingly, given the game’s subject matter and “oddly attractive” cast, Monster Girl Island has been marked as “Adult Only”, as a Mature Content Description on the aforementioned Steam page notes that the title features “full body nudity and detailed depictions of various sexual acts, ranging from vanilla to light sadomasochism, including watersports.”</p><p>Though the game has been featured on Patreon since it began development, with Redamz all the while openly and proudly wearing the game’s Adult label, it now appears that a recent attempt by the platform to elicit changes within Monster Girl Island has led the indie game developer to end this nearly six-year business relationship.</p><p>On April 28th, Redamz took to the game’s Patreon to post one final update, simply titled “Leaving Patreon”, to his supporters, notifying them of his decision and explaining that he had chosen to leave the platform.</p><p>He stated, “While I had avoided all of their previous witch hunts, it seems they finally don’t like MGI anymore. They’ve requested me to make changes to the game (stupid things like making ara and faranne not adoptive sisters if they are to share a scene), which if you all know me, you will know I’ll never do,” wrote Redamz.</p></blockquote><p>About one-quarter of Patreon’s creators have been openly and egregiously violating the fake “zero tolerance” policy that Patreon has been falsely advertising since 2017, when VISA and Mastercard threatened to shut them down. Patreon played the payment processors by making a big deal of deplatforming the porn stars and cam girls, but didn’t touch <a href=\"https://graphtreon.com/patreon-stats/adult-games\" rel=\"noopener\" target=\"_blank\">the much more lucrative porn-game developers</a>, some of whom are pulling in <a href=\"https://graphtreon.com/monthly-ranking/adult-games\" rel=\"noopener\" target=\"_blank\">nearly $100k/month</a>.</p><p>Anyhow, this belated attempt to get the porn devs to remove the incest and other “zero tolerance” elements that have been tolerated for years – that’s what Redamz is referring to – isn’t going to do Patreon any good once the facts are put on the public record. Because while Patreon may define pornography as only applying to real humans, that’s not how the Federal government or the payment processors define it anymore.</p></div>",
  "content_text": "Patreon is\nsuddenly, and belatedly, attempting to clean up its Factory of Filth\n, which would require Hercules to muck out the massive quantities of bestiality, rape, incest, and other perversions that are widely available on the platform:\nIndie game creator Redamz, best known as the creator and sole developer of the upcoming adult-oriented adventure game Monster Girl Island, has announced that he will be leaving Patreon after the platform requested that he “make changes to the game” in order to continuing using their services.\nIn development since roughly 2015, Monster Girl Island finds players washing ashore on the sands of a mysterious island filled with monsters such as “dragons, slimes, giant bugs, centaurs and more,” who “are all… Oddly attractive!?”\nUnsurprisingly, given the game’s subject matter and “oddly attractive” cast, Monster Girl Island has been marked as “Adult Only”, as a Mature Content Description on the aforementioned Steam page notes that the title features “full body nudity and detailed depictions of various sexual acts, ranging from vanilla to light sadomasochism, including watersports.”\nThough the game has been featured on Patreon since it began development, with Redamz all the while openly and proudly wearing the game’s Adult label, it now appears that a recent attempt by the platform to elicit changes within Monster Girl Island has led the indie game developer to end this nearly six-year business relationship.\nOn April 28th, Redamz took to the game’s Patreon to post one final update, simply titled “Leaving Patreon”, to his supporters, notifying them of his decision and explaining that he had chosen to leave the platform.\nHe stated, “While I had avoided all of their previous witch hunts, it seems they finally don’t like MGI anymore. They’ve requested me to make changes to the game (stupid things like making ara and faranne not adoptive sisters if they are to share a scene), which if you all know me, you will know I’ll never do,” wrote Redamz.\nAbout one-quarter of Patreon’s creators have been openly and egregiously violating the fake “zero tolerance” policy that Patreon has been falsely advertising since 2017, when VISA and Mastercard threatened to shut them down. Patreon played the payment processors by making a big deal of deplatforming the porn stars and cam girls, but didn’t touch\nthe much more lucrative porn-game developers\n, some of whom are pulling in\nnearly $100k/month\n.\nAnyhow, this belated attempt to get the porn devs to remove the incest and other “zero tolerance” elements that have been tolerated for years – that’s what Redamz is referring to – isn’t going to do Patreon any good once the facts are put on the public record. Because while Patreon may define pornography as only applying to real humans, that’s not how the Federal government or the payment processors define it anymore.",
  "tags": [
    "law"
  ],
  "categories": [],
  "sitemap_lastmod": "2021-05-04T21:40:53+00:00"
}