{
  "url": "https://voxday.net/2021/05/27/techno-babylon-or-the-religion-of-science/",
  "scraped_at": "2025-12-21T22:50:50.447943",
  "title": "TECHNO-BABYLON or the religion of science",
  "date_display": "May 27, 2021",
  "date_iso": "2021-05-27T10:23:06+00:00",
  "date_from_url": "2021-05-27",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>The Promethean capture of science, and the transformation of scientistry into a propaganda machine for a very old religion, may not have begun with <a href=\"http://bactra.org/Daedalus.html\" rel=\"noopener\" target=\"_blank\">this 1923 essay</a> by the revered J.B.S. Haldane, entitled, <i>DAEDELUS or Science and the Future</i>, but it is clearly detectable in hindsight.</p><blockquote><p>Ever since the time of Berkeley it has been customary for the majority of metaphysicians to proclaim the ideality of Time, of Space, or of both. But they soon made it clear that in spite of this, time would continue to wait for no man, and space to separate lovers. The only practical consequences that they generally drew was that their own ethical and political views were somehow inherent in the structure of the universe. The experimental proof or disproof of such deductions is difficult, and — if the late war may be regarded as an experimental disproof of certain of Hegel’s political tenets — costly and unsatisfactory.</p><p>Einstein, so far from deducing an new decalogue, has contented himself with deducing the consequences to space and time themselves of their ideality. These are mostly too small to be measurable, but some, such as the deflection of light but the sun’s gravitational field, are susceptible of verification, and have been verified. The majority of scientific men are now being constrained by the evidence of these experiments to adopt a very extreme form of Kantian idealism. The Kantian <i>Ding-an-sich</i> is an eternal four-dimensional manifold, which we perceive as space and time, but what we regard as space and what as time is more or less fortuitous.</p><p>It is perhaps interesting to speculate on the practical consequences of Einstein’s discovery. I do not doubt that he will be believed. A prophet who can give signs in the heavens is always believed. No one ever seriously questioned Newton’s theory after the return of Halley’s comet. Einstein has told us that space, time and matter are shadows of the fifth dimension, and the heavens have declared his glory. In consequence Kantian idealism will become the basal working hypothesis of the physicist and finally of all educated men, just as materialism did after Newton’s day. We may not call ourselves materialists, but we do interpret the activities of the moon, the Thames, influenza, and aeroplanes in terms of matter. Our ancestors did not, nor, in all probability, will our descendants. The materialism (whether conscious or sub-conscious does not matter very much) of the last few generations has led to various results of practical importance, such as sanitation, Marxian socialism, and the right of an accused person to give evidence on his or her own behalf. The reign of Kantian idealism as the basal working hypothesis, first of physics, and then of every-day life, will in all probability last for some centuries. At the end of that time a similar step in advance will be taken. Einstein showed that experience cannot be interpreted in terms of space and time. This was a well-known fact, but so long as space and time down not break down in their own special sphere, that of explaining the facts of motion, physicists continued to believe in them, or at any rate, what was much more important, to think in terms of them for practical purposes.</p><p>A time will however come (as I believe) when physiology will invade and destroy mathematical physics, as the latter have destroyed geometry. The basic metaphysical working hypothesis of science and practical life will then, I think, be something like Bergsonian activism. I do not for one moment suggest that this or any other metaphysical system has any claims whatever to finality.</p><p>Meanwhile we are in for a few centuries during which many practical activities will probably be conducted on a basis, not of materialism, but of Kantian idealism. How will this affect our manners, morals and politics? Frankly I do not know, though I think the effect will be as great as that of Newton’s work, which created most of the intellectual forces of the 18th century. The Condorcets, Benthams, and Marxs of the future will I think be as ruthlessly critical of the metaphysics and ethics of their times as were their predecessors, but not quite so sure of their own; they will lack a certain heaviness of touch which we may note in Utilitarianism and Socialism. They will recognise that perhaps in ethics as in physics, there are so to speak fourth and fifth dimensions that show themselves by effects which, like the perturbations of the planet Mercury, are hard to detect even in one generation, but yet perhaps in the course of ages are quite as important as the three- dimensional phenomena.</p><p>If the quantum hypothesis is generally adopted even more radical alterations in our thinking will be necessary. But I feel it premature even to suggest their direction in the present unsatisfactory state of quantum mechanics. It may be that as Poincare (the other Poincare) suggested we shall be forced to conceive of all changes as occurring in a series of clicks, and all space as consisting of discrete points. However this may be it is safe to say that a better knowledge of radiation will permit us to produce it in a more satisfactory manner than is at present possible. Almost all our present sources of light are hot bodies, 95{cc08d85cfa54367952ab9c6bd910a003a6c2c0c101231e44cdffb103f39b73a6} of whose radiation is invisible. To light a lamp as a source of light is about as wasteful of energy as to burn down one’s house to roast one’s pork. It is a fairly safe prophecy that in 50 years light will cost about a fiftieth of its present price, and there will be no more night in our cities. The alternation of day and night is a check on the freedom of human activity which must go the way of other spatial and temporal checks. In the long run I think that all that applied physics can do for us is abolish these checks. It enables us to possess more, travel more, and communicate more. I shall not attempt to predict in detail the future developments of transport and communication. They are only limited by the velocity of light. We are working towards a condition when any two persons on earth will be able to be completely present to one another in not more than 1/24 of a second. We shall never reach it, but that is the limit which we shall approach indefinitely.</p><p>Developments in this direction are tending to bring mankind more and more together, to render life more and more complex, artificial, and rich in possibilities — to increase indefinitely man’s powers for good and evil.</p></blockquote><p>Haldan’s speech is now considered a foundation of transhumanist philosophy. </p><p><i>Fundamental ideas of transhumanism were first advanced in 1923 by the British geneticist J. B. S. Haldane in his essay Daedalus: Science and the Future, which predicted that great benefits would come from the application of advanced sciences to human biology—and that every such advance would first appear to someone as blasphemy or perversion, “indecent and unnatural”. In particular, he was interested in the development of the science of eugenics, ectogenesis (creating and sustaining life in an artificial environment), and the application of genetics to improve human characteristics, such as health and intelligence. </i></p><p>Science should not be confused with the religion itself, as all three aspects of science are merely the tool and the fetish of the Promethean transhumanism it serves. Needless to say, the Vaxx is the mass practical application, possibly though not necessarily the first, of transhumanist religion to humanity. Whether it will prove to be an advance for the species, an evolutionary dead end, an extinction event, or a spiritual blasphemy has yet to be determined.</p><p>But regardless, I tend to doubt that those whose evaluation of the present crisis are limited to the material, the scientodific, and the political are going to be able to comprehend much of what is happening, or what it is genuinely at stake here.</p><p>Julian Huxley wrote: <i>Many people assert that this abandonment of the god hypothesis means the abandonment of all religion and all moral sanctions. This is simply not true. But it does mean, once our relief at jettisoning an outdated piece of ideological furniture is over, that we must construct something to take its place.</i></p><p>And now we are beginning to see that which has been constructed to take the place of God: Techno-Babylon. But instead of building a temple to the race of Man, they are building a temple <i>of </i>the race of Man. Note, in particular, the gleefully demonic way in which Haldane ends his essay with a mocking parody of G.K. Chesterton’s <i>The Ballad of the White Horse</i>.</p><blockquote><p>The scientific worker of the future will more and more resemble the lonely figure of Daedalus as he becomes conscious of his ghastly mission, and proud of it.</p><p><i>Black is his robe from top to toe,</i></p><p><i>His flesh is white and warm below,</i></p><p><i>All through his silent veins flow free</i></p><p><i>Hunger and thirst and venery,</i></p><p><i>But in his eyes a still small flame</i></p><p><i>Like the first cell from which he came</i></p><p><i>Burns round and luminous, as he rides</i></p><p><i>Singing my song of deicides.</i></p></blockquote></div>",
  "content_text": "The Promethean capture of science, and the transformation of scientistry into a propaganda machine for a very old religion, may not have begun with\nthis 1923 essay\nby the revered J.B.S. Haldane, entitled,\nDAEDELUS or Science and the Future\n, but it is clearly detectable in hindsight.\nEver since the time of Berkeley it has been customary for the majority of metaphysicians to proclaim the ideality of Time, of Space, or of both. But they soon made it clear that in spite of this, time would continue to wait for no man, and space to separate lovers. The only practical consequences that they generally drew was that their own ethical and political views were somehow inherent in the structure of the universe. The experimental proof or disproof of such deductions is difficult, and — if the late war may be regarded as an experimental disproof of certain of Hegel’s political tenets — costly and unsatisfactory.\nEinstein, so far from deducing an new decalogue, has contented himself with deducing the consequences to space and time themselves of their ideality. These are mostly too small to be measurable, but some, such as the deflection of light but the sun’s gravitational field, are susceptible of verification, and have been verified. The majority of scientific men are now being constrained by the evidence of these experiments to adopt a very extreme form of Kantian idealism. The Kantian\nDing-an-sich\nis an eternal four-dimensional manifold, which we perceive as space and time, but what we regard as space and what as time is more or less fortuitous.\nIt is perhaps interesting to speculate on the practical consequences of Einstein’s discovery. I do not doubt that he will be believed. A prophet who can give signs in the heavens is always believed. No one ever seriously questioned Newton’s theory after the return of Halley’s comet. Einstein has told us that space, time and matter are shadows of the fifth dimension, and the heavens have declared his glory. In consequence Kantian idealism will become the basal working hypothesis of the physicist and finally of all educated men, just as materialism did after Newton’s day. We may not call ourselves materialists, but we do interpret the activities of the moon, the Thames, influenza, and aeroplanes in terms of matter. Our ancestors did not, nor, in all probability, will our descendants. The materialism (whether conscious or sub-conscious does not matter very much) of the last few generations has led to various results of practical importance, such as sanitation, Marxian socialism, and the right of an accused person to give evidence on his or her own behalf. The reign of Kantian idealism as the basal working hypothesis, first of physics, and then of every-day life, will in all probability last for some centuries. At the end of that time a similar step in advance will be taken. Einstein showed that experience cannot be interpreted in terms of space and time. This was a well-known fact, but so long as space and time down not break down in their own special sphere, that of explaining the facts of motion, physicists continued to believe in them, or at any rate, what was much more important, to think in terms of them for practical purposes.\nA time will however come (as I believe) when physiology will invade and destroy mathematical physics, as the latter have destroyed geometry. The basic metaphysical working hypothesis of science and practical life will then, I think, be something like Bergsonian activism. I do not for one moment suggest that this or any other metaphysical system has any claims whatever to finality.\nMeanwhile we are in for a few centuries during which many practical activities will probably be conducted on a basis, not of materialism, but of Kantian idealism. How will this affect our manners, morals and politics? Frankly I do not know, though I think the effect will be as great as that of Newton’s work, which created most of the intellectual forces of the 18th century. The Condorcets, Benthams, and Marxs of the future will I think be as ruthlessly critical of the metaphysics and ethics of their times as were their predecessors, but not quite so sure of their own; they will lack a certain heaviness of touch which we may note in Utilitarianism and Socialism. They will recognise that perhaps in ethics as in physics, there are so to speak fourth and fifth dimensions that show themselves by effects which, like the perturbations of the planet Mercury, are hard to detect even in one generation, but yet perhaps in the course of ages are quite as important as the three- dimensional phenomena.\nIf the quantum hypothesis is generally adopted even more radical alterations in our thinking will be necessary. But I feel it premature even to suggest their direction in the present unsatisfactory state of quantum mechanics. It may be that as Poincare (the other Poincare) suggested we shall be forced to conceive of all changes as occurring in a series of clicks, and all space as consisting of discrete points. However this may be it is safe to say that a better knowledge of radiation will permit us to produce it in a more satisfactory manner than is at present possible. Almost all our present sources of light are hot bodies, 95{cc08d85cfa54367952ab9c6bd910a003a6c2c0c101231e44cdffb103f39b73a6} of whose radiation is invisible. To light a lamp as a source of light is about as wasteful of energy as to burn down one’s house to roast one’s pork. It is a fairly safe prophecy that in 50 years light will cost about a fiftieth of its present price, and there will be no more night in our cities. The alternation of day and night is a check on the freedom of human activity which must go the way of other spatial and temporal checks. In the long run I think that all that applied physics can do for us is abolish these checks. It enables us to possess more, travel more, and communicate more. I shall not attempt to predict in detail the future developments of transport and communication. They are only limited by the velocity of light. We are working towards a condition when any two persons on earth will be able to be completely present to one another in not more than 1/24 of a second. We shall never reach it, but that is the limit which we shall approach indefinitely.\nDevelopments in this direction are tending to bring mankind more and more together, to render life more and more complex, artificial, and rich in possibilities — to increase indefinitely man’s powers for good and evil.\nHaldan’s speech is now considered a foundation of transhumanist philosophy.\nFundamental ideas of transhumanism were first advanced in 1923 by the British geneticist J. B. S. Haldane in his essay Daedalus: Science and the Future, which predicted that great benefits would come from the application of advanced sciences to human biology—and that every such advance would first appear to someone as blasphemy or perversion, “indecent and unnatural”. In particular, he was interested in the development of the science of eugenics, ectogenesis (creating and sustaining life in an artificial environment), and the application of genetics to improve human characteristics, such as health and intelligence.\nScience should not be confused with the religion itself, as all three aspects of science are merely the tool and the fetish of the Promethean transhumanism it serves. Needless to say, the Vaxx is the mass practical application, possibly though not necessarily the first, of transhumanist religion to humanity. Whether it will prove to be an advance for the species, an evolutionary dead end, an extinction event, or a spiritual blasphemy has yet to be determined.\nBut regardless, I tend to doubt that those whose evaluation of the present crisis are limited to the material, the scientodific, and the political are going to be able to comprehend much of what is happening, or what it is genuinely at stake here.\nJulian Huxley wrote:\nMany people assert that this abandonment of the god hypothesis means the abandonment of all religion and all moral sanctions. This is simply not true. But it does mean, once our relief at jettisoning an outdated piece of ideological furniture is over, that we must construct something to take its place.\nAnd now we are beginning to see that which has been constructed to take the place of God: Techno-Babylon. But instead of building a temple to the race of Man, they are building a temple\nof\nthe race of Man. Note, in particular, the gleefully demonic way in which Haldane ends his essay with a mocking parody of G.K. Chesterton’s\nThe Ballad of the White Horse\n.\nThe scientific worker of the future will more and more resemble the lonely figure of Daedalus as he becomes conscious of his ghastly mission, and proud of it.\nBlack is his robe from top to toe,\nHis flesh is white and warm below,\nAll through his silent veins flow free\nHunger and thirst and venery,\nBut in his eyes a still small flame\nLike the first cell from which he came\nBurns round and luminous, as he rides\nSinging my song of deicides.",
  "tags": [
    "history"
  ],
  "categories": [],
  "sitemap_lastmod": "2021-05-27T09:23:06+00:00"
}