{
  "url": "https://voxday.net/2021/05/30/the-mark-of-the-sports-beast/",
  "scraped_at": "2025-12-21T22:51:25.560351",
  "title": "The mark of the sports beast",
  "date_display": "May 30, 2021",
  "date_iso": "2021-05-30T18:21:22+00:00",
  "date_from_url": "2021-05-30",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p><i>And the Knickerbockers of New Amsterdam caused all, the small and the great, and the rich and the poor, and the season ticket holder and the out-of-town tourist whose team is in town, to be given a mark on their right arm, and they provided that no man would be able to attend or to spectate, <a href=\"https://www.outkick.com/knicks-announce-round-2-playoff-tickets-are-vaccinated-only/\" rel=\"noopener\" target=\"_blank\">except the one who has the mark</a>.</i></p><blockquote><p>Just when we thought OutKick couldn’t be more on the money: vaccinations are now required to purchase second round Knicks tickets. The team just announced that tickets will be sold exclusively to vaccinated fans rather than sold to anyone who wants them. Ya know, how it’s been done for decades.</p></blockquote><p>I here I always thought the rule was first tragedy, <i>then </i>farce. </p><p>They must be pretty desperate if they think not permitting attendance by people who have already turned their backs on the NBA, and turned off their televisions as well, is going to make any difference to anyone at all.</p></div>",
  "content_text": "And the Knickerbockers of New Amsterdam caused all, the small and the great, and the rich and the poor, and the season ticket holder and the out-of-town tourist whose team is in town, to be given a mark on their right arm, and they provided that no man would be able to attend or to spectate,\nexcept the one who has the mark\n.\nJust when we thought OutKick couldn’t be more on the money: vaccinations are now required to purchase second round Knicks tickets. The team just announced that tickets will be sold exclusively to vaccinated fans rather than sold to anyone who wants them. Ya know, how it’s been done for decades.\nI here I always thought the rule was first tragedy,\nthen\nfarce.\nThey must be pretty desperate if they think not permitting attendance by people who have already turned their backs on the NBA, and turned off their televisions as well, is going to make any difference to anyone at all.",
  "tags": [
    "sports"
  ],
  "categories": [],
  "sitemap_lastmod": "2021-05-30T17:21:22+00:00"
}