{
  "url": "https://voxday.net/2021/05/13/the-media-corrects-the-model/",
  "scraped_at": "2025-12-21T22:48:34.132520",
  "title": "The media “corrects” the model",
  "date_display": "May 13, 2021",
  "date_iso": "2021-05-13T18:41:18+00:00",
  "date_from_url": "2021-05-13",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>Don’t read too much into my posting this. I’m just a little surprised by <a href=\"https://www.dailymail.co.uk/news/article-9573061/Bella-Hadid-opens-allegations-anti-Semitism-claiming-Israel-not-country.html\" rel=\"noopener\" target=\"_blank\">the current spin on the latest phase of the Israeli-Palestinian conflict</a> being pushed by the mainstream media. I mean, it has literally never occurred to me to pay any attention to anything that Bella Hadid, or any other fashion, swimsuit, or glamour model, happens to say.</p><blockquote><p>Large numbers of Jews began moving to Ottoman Palestine – a predominately Arab region – following the 1896 publication of Theodor Herzl’s <i>The Jewish State</i>, which promoted the idea of a haven for Jews in their ancient homeland to escape anti-Semitism in Europe. There has been a community of Jews in the region for millennia.</p><p>The exact population balance is hard to tell, because at the time people frequently avoided the census. According to the Ottoman census of 1878, the Jerusalem, Nablus, and Acre districts were home to 403,795 Muslims, representing 85.5 per cent of the population.</p><p>Christians made up 9.2 per cent (43,659); Jewish people 5.3 per cent (25,000).</p><p>So Bella is wrong to describe Israel as a colony, because Jewish people had already been in the region for centuries. </p><p>The Holocaust increased the pace of arrivals with Jews fleeing Nazi Germany, and many emigrated from Eastern Europe and Russia.</p><p>In 1947, after years of Arab-Jewish violence, the UN General Assembly voted for the establishment of two states in Palestine – one Jewish and the other Arab. </p><p>Bella is incorrect in describing ethnic cleansing and a military occupation, because the redrawing of boundaries was done under UN auspices.</p><p>Shortly after the UN ruling, the Jewish community in Palestine declared Israel an independent state, prompting hundreds of thousands more Jews to emigrate, and precipitating a war launched by neighboring Arab states.</p><p>She is also incorrect in describing the region as being under apartheid, because Israelis and Palestinians are free to choose their own leaders and live under their own rules. </p><p>For their part, Palestinian Arabs say Jews have usurped their ancestral homeland with help from Western powers, including the United States and the United Kingdom. </p><p>The current conflict is notable for pitting Israelis against Israelis, in addition to the depressingly familiar exchange of rocket fire.</p><p>Israel’s 21 per cent Arab minority – Palestinian by heritage, Israeli by citizenship – is mostly descended from the Palestinians who lived under Ottoman and then British colonial rule before staying in Israel after the country’s 1948 creation.</p></blockquote><p>First, it’s strange that the British media felt it necessary to cover and “correct” Bella Hadid’s statements. This wouldn’t have happened in years past, and tends to indicate a public shift toward the Palestinian perspective and rather less of the Boomer sympathy for “plucky little Israel, our greatest ally.”</p><p>Second, whoever is handling the “corrections” is almost ludicrously incompetent. If the mere idea of troubling to correct a model’s opinion wasn’t bad enough, doing so in an obviously inept manner just makes it that much worse. A “colony” is defined as “a group of people who leave their native country to form in a new land a settlement subject to, or connected with, the parent nation.” This means the fact that there were already a few thousand Jews in the region doesn’t change the fact that groups of people left Poland, Russia, and other places where their ancestors had resided for generations in order to settle in British Palestine.</p><p>Nor is it incorrect to describe the ethnic cleansing and military occupation taking place there as ethnic cleansing and military occupation simply because the UN drew some boundaries. The UN also recognized the India-Pakistan boundary after the 1947 partition, and the post-partition movement of peoples that took place there was arguably the largest in human history. And no one hesitates to describe that movement as religious cleansing.</p><p>While it is incorrect to refer to any political system as “Apartheid” other than the historical South African policy, it is also indisputable that the laws of Israel are specifically designed to ensure that the nation of Israel is dominated politically, socially, and economically by the nation’s Jewish population, as per the Basic Law’s assertion that the Jewish people have the unique claim to national self-determination in the State of Israel. While technically incorrect, apartheid is a perfectly reasonable way to describe these policies at a rhetorical level.</p><p>My personal opinion is that all of the historical posturings on both sides are pointless. The original Jewish claim is based on the right of conquest of the Land of Canaan, so they cannot reasonably complain if any other group of people decides to lay claim on the same basis. The situation is difficult, but it is hardly insoluble; a positive resolution will simply require a lot more carrot and a lot less stick.</p><p>Of considerably more concern to me is the fact that those who claim that Palestine is not a country and the Palestinians are not a people are the exact same individuals who claim that America is just an idea, Americans are not a people, and Western Civilization is nothing more than combination of Judaism and Greek philosophy.</p></div>",
  "content_text": "Don’t read too much into my posting this. I’m just a little surprised by\nthe current spin on the latest phase of the Israeli-Palestinian conflict\nbeing pushed by the mainstream media. I mean, it has literally never occurred to me to pay any attention to anything that Bella Hadid, or any other fashion, swimsuit, or glamour model, happens to say.\nLarge numbers of Jews began moving to Ottoman Palestine – a predominately Arab region – following the 1896 publication of Theodor Herzl’s\nThe Jewish State\n, which promoted the idea of a haven for Jews in their ancient homeland to escape anti-Semitism in Europe. There has been a community of Jews in the region for millennia.\nThe exact population balance is hard to tell, because at the time people frequently avoided the census. According to the Ottoman census of 1878, the Jerusalem, Nablus, and Acre districts were home to 403,795 Muslims, representing 85.5 per cent of the population.\nChristians made up 9.2 per cent (43,659); Jewish people 5.3 per cent (25,000).\nSo Bella is wrong to describe Israel as a colony, because Jewish people had already been in the region for centuries.\nThe Holocaust increased the pace of arrivals with Jews fleeing Nazi Germany, and many emigrated from Eastern Europe and Russia.\nIn 1947, after years of Arab-Jewish violence, the UN General Assembly voted for the establishment of two states in Palestine – one Jewish and the other Arab.\nBella is incorrect in describing ethnic cleansing and a military occupation, because the redrawing of boundaries was done under UN auspices.\nShortly after the UN ruling, the Jewish community in Palestine declared Israel an independent state, prompting hundreds of thousands more Jews to emigrate, and precipitating a war launched by neighboring Arab states.\nShe is also incorrect in describing the region as being under apartheid, because Israelis and Palestinians are free to choose their own leaders and live under their own rules.\nFor their part, Palestinian Arabs say Jews have usurped their ancestral homeland with help from Western powers, including the United States and the United Kingdom.\nThe current conflict is notable for pitting Israelis against Israelis, in addition to the depressingly familiar exchange of rocket fire.\nIsrael’s 21 per cent Arab minority – Palestinian by heritage, Israeli by citizenship – is mostly descended from the Palestinians who lived under Ottoman and then British colonial rule before staying in Israel after the country’s 1948 creation.\nFirst, it’s strange that the British media felt it necessary to cover and “correct” Bella Hadid’s statements. This wouldn’t have happened in years past, and tends to indicate a public shift toward the Palestinian perspective and rather less of the Boomer sympathy for “plucky little Israel, our greatest ally.”\nSecond, whoever is handling the “corrections” is almost ludicrously incompetent. If the mere idea of troubling to correct a model’s opinion wasn’t bad enough, doing so in an obviously inept manner just makes it that much worse. A “colony” is defined as “a group of people who leave their native country to form in a new land a settlement subject to, or connected with, the parent nation.” This means the fact that there were already a few thousand Jews in the region doesn’t change the fact that groups of people left Poland, Russia, and other places where their ancestors had resided for generations in order to settle in British Palestine.\nNor is it incorrect to describe the ethnic cleansing and military occupation taking place there as ethnic cleansing and military occupation simply because the UN drew some boundaries. The UN also recognized the India-Pakistan boundary after the 1947 partition, and the post-partition movement of peoples that took place there was arguably the largest in human history. And no one hesitates to describe that movement as religious cleansing.\nWhile it is incorrect to refer to any political system as “Apartheid” other than the historical South African policy, it is also indisputable that the laws of Israel are specifically designed to ensure that the nation of Israel is dominated politically, socially, and economically by the nation’s Jewish population, as per the Basic Law’s assertion that the Jewish people have the unique claim to national self-determination in the State of Israel. While technically incorrect, apartheid is a perfectly reasonable way to describe these policies at a rhetorical level.\nMy personal opinion is that all of the historical posturings on both sides are pointless. The original Jewish claim is based on the right of conquest of the Land of Canaan, so they cannot reasonably complain if any other group of people decides to lay claim on the same basis. The situation is difficult, but it is hardly insoluble; a positive resolution will simply require a lot more carrot and a lot less stick.\nOf considerably more concern to me is the fact that those who claim that Palestine is not a country and the Palestinians are not a people are the exact same individuals who claim that America is just an idea, Americans are not a people, and Western Civilization is nothing more than combination of Judaism and Greek philosophy.",
  "tags": [
    "war"
  ],
  "categories": [],
  "sitemap_lastmod": "2021-05-13T17:41:18+00:00"
}