{
  "url": "https://voxday.net/2021/05/11/the-free-speech-fraud/",
  "scraped_at": "2025-12-21T22:48:21.752990",
  "title": "The Free Speech fraud",
  "date_display": "May 11, 2021",
  "date_iso": "2021-05-11T13:38:19+00:00",
  "date_from_url": "2021-05-11",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p> A former believer in free speech <a href=\"https://younggospelminister.blogspot.com/2021/05/mea-culpa-on-free-speech.html\" rel=\"noopener\" target=\"_blank\">belatedly comes to realize</a> that it was never anything more than an intellectual weapon designed to destabilize the Christian West by the Promethean intellectuals operating under the perverse banner of the Enlightenment.</p><blockquote><p>The question is not, “Should we be absolutely free to speak?” The question is really, “Who should be the censors, and what should be censored?” We understand this intuitively, but the mantra of free speech propaganda often causes us to miss this.  </p><p>There are always blasphemy laws in any culture, even a libertine culture, where it is blasphemy to say, “That is immoral”, or “Maybe you should have self-control,” or, “Do you really need another cookie?”. We Christians and conservatives in the West fell into the trap of believing that neutrality could exist in a nation. That is, we thought a society based on a secular public sphere, allowing a freely expressed marketplace of ideas was possible. But this was always a lie, and this is why such a society didn’t last very long.</p><p>Really, those who sought to break the boundaries of what could and could not be said, were just using that as a means of usurping the Christian nature of the West, and taking power for themselves, so they could then enforce their version of blasphemy laws. Have you noticed how todays almost exclusively leftist cultural elite are not even slightly interested in encouraging the free market of ideas any more? They want no part of free speech. Why is this? Their goal of taking power has been achieved. There is no desire for the anti-establishment to let people freely continue to criticize the establishment, once they become the establishment. No, it actually becomes a threat to their systemic control.</p><p>This is not my opinion of what has happened, either, elements of society have been agitating for the disestablishment of the church for some time, and they have been utterly successful. Here in Australia, it is not uncommon to see the media go after politicians who are open in their Christian faith, even if their advocated policies are not all that Christian. The eminent historian and Medievalist, J B Bury, told us that progressives viewed free speech as a means of achieving this goal of destabilizing the Christian West.</p><p>First tradition had to be undermined, <i>“It is only recently that men have been abandoning the belief that the welfare of a state depends on rigid stability and on the preservation of its traditions and institutions unchanged.”</i> The process of dismantling tradition was encouraged by the effective and continued challenging of Western heritage, by the very elites who were supposed to preserve it. <i>“DURING the last three hundred years reason has been slowly but steadily destroying Christian mythology and exposing the pretensions of supernatural revelation.”</i></p><p>This was not the dispassionate scientific process that it is often presented as being in the movies. Humanity did not just wake up one day in a state of “enlightenment” and determine based on scientific reason that all tradition must be rejected. It was guided in that direction, by ideologues and freedom of expression was the tool used to achieve this end. As Bury says, <i>“…nothing should be left undone to impress upon the young that freedom of thought is an axiom of human progress.”</i> By “human progress” Bury, and many other enlightenment thinkers really mean less Christian. Indeed, this is explicit in Bury’s <i>A History of the Freedom of Thought</i>, for example: <i>“In this sense it might be said that ‘distrust thy father and mother’ is the first commandment with promise.”</i> This is an explicitly anti-biblical command. This brings to mind Richard Dawkins misguided attempt to create a new 10 Commandments in his book <i>The God Delusion</i>, to replace the real ones.</p><p>These attempts to create new commandments are always foolish, because if mankind sees very little reason to follow God’s commands, why would he care about some enlightenment professors list?   </p><p>It is important to understand that freedom of expression was only ever a tool for the enlightenment anti-Church thought leaders, to replace the authority of the Church, with their own values and Dogma, and authority. Previous generations of enlightenment thinkers argued for, and even genuinely defended the principles of free speech. But once they had completely replaced the authority of scripture and the Church in guiding society, the doors began to close on anti-establishment sentiment, which Bury conceived as possible,</p><p><i>“It is by no means inconceivable that in lands where opinion is now free coercion might be introduced. If a revolutionary social movement prevailed, led by men inspired by faith in formulas (like the men of the French Revolution) and resolved to impose their creed, experience shows that coercion would almost inevitably be resorted to.”</i></p></blockquote><p>Those who still champion free speech today are well-intentioned, but they are still well behind the curve, because they don’t understand how it is incompatible with Western civilization, or that it was only a phase in the decline to which Western societies can never be reasonably expected to return. Now that the intellectual infection has metastasized into full-blown convergence, either it will be cured or it will kill the infected victim.</p><p>When one considers that the primary goals of the Enlightenment were to a) legalize usury and b) legalize blasphemy, it should be readily apparent that there was something deeply evil behind it. This really shouldn’t have been that hard. When someone is offering you the promise of knowledge, you must always look for the snake.</p><div class=\"separator\" style=\"clear: both; text-align: center;\"><a href=\"https://i1.wp.com/stonetoss.com/wp-content/uploads/2019/06/flag-burning-comic.png?fit=1000{3549d4179a0cbfd35266a886b325f66920645bb4445f165578a9e086cbc22d08}2C500\" imageanchor=\"1\" style=\"margin-left: 1em; margin-right: 1em;\"><noscript><img border=\"0\" data-original-height=\"400\" data-original-width=\"800\" decoding=\"async\" height=\"200\" loading=\"lazy\" src=\"https://i1.wp.com/stonetoss.com/wp-content/uploads/2019/06/flag-burning-comic.png?fit=1000{3549d4179a0cbfd35266a886b325f66920645bb4445f165578a9e086cbc22d08}2C500\" width=\"400\"/></noscript><img border=\"0\" class=\"lazyload\" data-original-height=\"400\" data-original-width=\"800\" data-src=\"https://i1.wp.com/stonetoss.com/wp-content/uploads/2019/06/flag-burning-comic.png?fit=1000{3549d4179a0cbfd35266a886b325f66920645bb4445f165578a9e086cbc22d08}2C500\" decoding=\"async\" height=\"200\" loading=\"lazy\" src=\"data:image/svg+xml,%3Csvg%20xmlns=%22http://www.w3.org/2000/svg%22%20viewBox=%220%200%20800%20400%22%3E%3C/svg%3E\" width=\"400\"/></a></div><p><i></i></p></div>",
  "content_text": "A former believer in free speech\nbelatedly comes to realize\nthat it was never anything more than an intellectual weapon designed to destabilize the Christian West by the Promethean intellectuals operating under the perverse banner of the Enlightenment.\nThe question is not, “Should we be absolutely free to speak?” The question is really, “Who should be the censors, and what should be censored?” We understand this intuitively, but the mantra of free speech propaganda often causes us to miss this.\nThere are always blasphemy laws in any culture, even a libertine culture, where it is blasphemy to say, “That is immoral”, or “Maybe you should have self-control,” or, “Do you really need another cookie?”. We Christians and conservatives in the West fell into the trap of believing that neutrality could exist in a nation. That is, we thought a society based on a secular public sphere, allowing a freely expressed marketplace of ideas was possible. But this was always a lie, and this is why such a society didn’t last very long.\nReally, those who sought to break the boundaries of what could and could not be said, were just using that as a means of usurping the Christian nature of the West, and taking power for themselves, so they could then enforce their version of blasphemy laws. Have you noticed how todays almost exclusively leftist cultural elite are not even slightly interested in encouraging the free market of ideas any more? They want no part of free speech. Why is this? Their goal of taking power has been achieved. There is no desire for the anti-establishment to let people freely continue to criticize the establishment, once they become the establishment. No, it actually becomes a threat to their systemic control.\nThis is not my opinion of what has happened, either, elements of society have been agitating for the disestablishment of the church for some time, and they have been utterly successful. Here in Australia, it is not uncommon to see the media go after politicians who are open in their Christian faith, even if their advocated policies are not all that Christian. The eminent historian and Medievalist, J B Bury, told us that progressives viewed free speech as a means of achieving this goal of destabilizing the Christian West.\nFirst tradition had to be undermined,\n“It is only recently that men have been abandoning the belief that the welfare of a state depends on rigid stability and on the preservation of its traditions and institutions unchanged.”\nThe process of dismantling tradition was encouraged by the effective and continued challenging of Western heritage, by the very elites who were supposed to preserve it.\n“DURING the last three hundred years reason has been slowly but steadily destroying Christian mythology and exposing the pretensions of supernatural revelation.”\nThis was not the dispassionate scientific process that it is often presented as being in the movies. Humanity did not just wake up one day in a state of “enlightenment” and determine based on scientific reason that all tradition must be rejected. It was guided in that direction, by ideologues and freedom of expression was the tool used to achieve this end. As Bury says,\n“…nothing should be left undone to impress upon the young that freedom of thought is an axiom of human progress.”\nBy “human progress” Bury, and many other enlightenment thinkers really mean less Christian. Indeed, this is explicit in Bury’s\nA History of the Freedom of Thought\n, for example:\n“In this sense it might be said that ‘distrust thy father and mother’ is the first commandment with promise.”\nThis is an explicitly anti-biblical command. This brings to mind Richard Dawkins misguided attempt to create a new 10 Commandments in his book\nThe God Delusion\n, to replace the real ones.\nThese attempts to create new commandments are always foolish, because if mankind sees very little reason to follow God’s commands, why would he care about some enlightenment professors list?\nIt is important to understand that freedom of expression was only ever a tool for the enlightenment anti-Church thought leaders, to replace the authority of the Church, with their own values and Dogma, and authority. Previous generations of enlightenment thinkers argued for, and even genuinely defended the principles of free speech. But once they had completely replaced the authority of scripture and the Church in guiding society, the doors began to close on anti-establishment sentiment, which Bury conceived as possible,\n“It is by no means inconceivable that in lands where opinion is now free coercion might be introduced. If a revolutionary social movement prevailed, led by men inspired by faith in formulas (like the men of the French Revolution) and resolved to impose their creed, experience shows that coercion would almost inevitably be resorted to.”\nThose who still champion free speech today are well-intentioned, but they are still well behind the curve, because they don’t understand how it is incompatible with Western civilization, or that it was only a phase in the decline to which Western societies can never be reasonably expected to return. Now that the intellectual infection has metastasized into full-blown convergence, either it will be cured or it will kill the infected victim.\nWhen one considers that the primary goals of the Enlightenment were to a) legalize usury and b) legalize blasphemy, it should be readily apparent that there was something deeply evil behind it. This really shouldn’t have been that hard. When someone is offering you the promise of knowledge, you must always look for the snake.",
  "tags": [
    "declineandfall"
  ],
  "categories": [],
  "sitemap_lastmod": "2021-05-11T12:38:19+00:00"
}