{
  "url": "https://voxday.net/2021/05/16/the-canceling-of-literature/",
  "scraped_at": "2025-12-21T22:49:01.618484",
  "title": "The canceling of literature",
  "date_display": "May 16, 2021",
  "date_iso": "2021-05-16T11:28:02+00:00",
  "date_from_url": "2021-05-16",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p><i>Huckleberry Finn</i> has long been the first book that Easton Press sells at a heavy discount to its Book-of-the-Month buyers. But given how Easton is mostly run by young women who have recently graduated from Ivy League universities, I expect it won’t be long before they stop publishing it at all in light of the bad odor in which Mark Twain<a href=\"https://www.outkick.com/st-johns-university-professor-fired-for-using-racial-term-from-mark-twain-reading/\" rel=\"noopener\" target=\"_blank\"> is now held by the universities</a>:</p><blockquote><p>St. John’s University joins a list of woke universities, schools, and programs willing to reshape its curriculum to coddle students who feel challenged on a mental or emotional level.</p><p>During a reading of Mark Twain’s Pudd’nhead Wilson, Professor Hannah Berliner Fischthal became another casualty in the way of a race-based movement that cost her a profession and livelihood – one built on years of garnering her students’ trust through thoughtful and open conversation.</p><p>During a read-through that prompted Berliner Fischthal to use the N-word directly from the text, one student exited the online session and sent an email detailing the emotional distress this cause.</p><p>The student’s email stated that the professor’s use of the term was “unnecessary and very painful to hear.” The message became a public ordeal and prompted the university to investigate the action, leading to the professor’s dismissal from St. John’s University.</p></blockquote><p>This is just another reason why it’s not only desirable, but vital, to subscribe to Castalia Library. Regarding which, I have a few things to mention.</p><p>First, the first three leatherbound Junior Classics have been sent to the printer. We’ll order the leather this week, so the production is in process. We don’t know how long it will take, as that depends upon the bindery’s schedule. Below is the front endpapers, which will feature the appropriate names and sections of the specific volume. We’re also close to getting the regular volumes 4, 5, and 6 out the door.</p><div class=\"separator\" style=\"clear: both; text-align: center;\"><a href=\"https://social.infogalactic.com/images/posts/d3eee4d0-3ba2-4bd9-9b2e-c0da783a3fa8/original-85ee5b50cfe848d68c597934bd28f1e4.png?v=63788375935\" style=\"margin-left: 1em; margin-right: 1em;\"><noscript><img border=\"0\" data-original-height=\"594\" data-original-width=\"787\" decoding=\"async\" height=\"302\" loading=\"lazy\" src=\"https://social.infogalactic.com/images/posts/d3eee4d0-3ba2-4bd9-9b2e-c0da783a3fa8/original-85ee5b50cfe848d68c597934bd28f1e4.png?v=63788375935\" width=\"400\"/></noscript><img border=\"0\" class=\"lazyload\" data-original-height=\"594\" data-original-width=\"787\" data-src=\"https://social.infogalactic.com/images/posts/d3eee4d0-3ba2-4bd9-9b2e-c0da783a3fa8/original-85ee5b50cfe848d68c597934bd28f1e4.png?v=63788375935\" decoding=\"async\" height=\"302\" loading=\"lazy\" src=\"data:image/svg+xml,%3Csvg%20xmlns=%22http://www.w3.org/2000/svg%22%20viewBox=%220%200%20787%20594%22%3E%3C/svg%3E\" width=\"400\"/></a></div><p>Second, we’ll stop taking orders for <a href=\"https://arkhavencomics.com/product/junior-classics-leather/\" rel=\"noopener\" target=\"_blank\">the leatherbound Junior Classics</a> on Monday at noon, since we have to finalize the number. We’re going to print a few extra interiors since it’s economical for us to do so, so there will probably be an opportunity to acquire a leather set at some point in the future, but this will be your last opportunity for some time.</p><p>Third, as I’ve already announced, the Castalia Library and Libraria Castalia editions of <i>Summa Elvetica</i> will NOT be signed. There have already been sufficient delays that <i>Heidi </i>will be shipped first, and it’s just going to take too long to print the special pages, ship them to Europe, ship them back, and have them tipped-in. It was a stupid notion and I’m sorry we won’t be able to deliver on the signed editions. Obviously, if anyone who bought the one-off on that notion wants a refund, we will certainly provide it. And for those who don’t care about the signature, the book is nearly sold out already so you might want to consider grabbing one while you can.</p><p>Speaking of sell-outs, beginning with <i>Rhetoric</i>, we’re increasing the number of Library editions to 850. This is because the books are nearly sold out on the basis of the subscriptions alone now. Libraria editions will remain at 100. The current subscription book is<i> Discourses on Livy</i> by Machiavelli.</p><p>We are aware that some people received doubles of Plutarch, and others still haven’t received their <i>Divine Comedy</i> – me included. Let us know at library -at- castaliahouse -dot- com in either case; the bindery is actively resolving each case one at a time. They have a new system in place which should prevent these problems in the future and we’ve reserved enough books to make certain that everyone who paid for one will receive one. In the meantime, don’t bother letting me know, as I can’t do anything about it and don’t even have my copy of Dante or Plutarch. </p><p>And finally, the rear endpapers for the leather editions, which will be the same for every volume.</p><div class=\"separator\" style=\"clear: both; text-align: center;\"><a href=\"https://social.infogalactic.com/images/posts/a093d475-1619-4771-939d-21709c816317/original-f53d2e0cb2b194da1e61bf94c3cf7e55.png?v=63788377263\" style=\"margin-left: 1em; margin-right: 1em;\"><noscript><img border=\"0\" data-original-height=\"579\" data-original-width=\"771\" decoding=\"async\" height=\"300\" loading=\"lazy\" src=\"https://social.infogalactic.com/images/posts/a093d475-1619-4771-939d-21709c816317/original-f53d2e0cb2b194da1e61bf94c3cf7e55.png?v=63788377263\" width=\"400\"/></noscript><img border=\"0\" class=\"lazyload\" data-original-height=\"579\" data-original-width=\"771\" data-src=\"https://social.infogalactic.com/images/posts/a093d475-1619-4771-939d-21709c816317/original-f53d2e0cb2b194da1e61bf94c3cf7e55.png?v=63788377263\" decoding=\"async\" height=\"300\" loading=\"lazy\" src=\"data:image/svg+xml,%3Csvg%20xmlns=%22http://www.w3.org/2000/svg%22%20viewBox=%220%200%20771%20579%22%3E%3C/svg%3E\" width=\"400\"/></a></div><div class=\"separator\" style=\"clear: both; text-align: left;\"></div><div class=\"separator\" style=\"clear: both; text-align: left;\"><b>UPDATE: </b> If you have an issue, send it to the email address above and it will be directed to the responsible party, who will address it. Scores of issues have been successfully resolved this way. If you post it here in the comments, it will be deleted. If you email it to me, it will be deleted. If people want me to write anything at all in the future, then they will have to stop treating me like a call center based in India simply because I am accessible. And to think some people wonder why I absolutely refuse to do book tours, speeches, or any other public appearances….</div></div>",
  "content_text": "Huckleberry Finn\nhas long been the first book that Easton Press sells at a heavy discount to its Book-of-the-Month buyers. But given how Easton is mostly run by young women who have recently graduated from Ivy League universities, I expect it won’t be long before they stop publishing it at all in light of the bad odor in which Mark Twain\nis now held by the universities\n:\nSt. John’s University joins a list of woke universities, schools, and programs willing to reshape its curriculum to coddle students who feel challenged on a mental or emotional level.\nDuring a reading of Mark Twain’s Pudd’nhead Wilson, Professor Hannah Berliner Fischthal became another casualty in the way of a race-based movement that cost her a profession and livelihood – one built on years of garnering her students’ trust through thoughtful and open conversation.\nDuring a read-through that prompted Berliner Fischthal to use the N-word directly from the text, one student exited the online session and sent an email detailing the emotional distress this cause.\nThe student’s email stated that the professor’s use of the term was “unnecessary and very painful to hear.” The message became a public ordeal and prompted the university to investigate the action, leading to the professor’s dismissal from St. John’s University.\nThis is just another reason why it’s not only desirable, but vital, to subscribe to Castalia Library. Regarding which, I have a few things to mention.\nFirst, the first three leatherbound Junior Classics have been sent to the printer. We’ll order the leather this week, so the production is in process. We don’t know how long it will take, as that depends upon the bindery’s schedule. Below is the front endpapers, which will feature the appropriate names and sections of the specific volume. We’re also close to getting the regular volumes 4, 5, and 6 out the door.\nSecond, we’ll stop taking orders for\nthe leatherbound Junior Classics\non Monday at noon, since we have to finalize the number. We’re going to print a few extra interiors since it’s economical for us to do so, so there will probably be an opportunity to acquire a leather set at some point in the future, but this will be your last opportunity for some time.\nThird, as I’ve already announced, the Castalia Library and Libraria Castalia editions of\nSumma Elvetica\nwill NOT be signed. There have already been sufficient delays that\nHeidi\nwill be shipped first, and it’s just going to take too long to print the special pages, ship them to Europe, ship them back, and have them tipped-in. It was a stupid notion and I’m sorry we won’t be able to deliver on the signed editions. Obviously, if anyone who bought the one-off on that notion wants a refund, we will certainly provide it. And for those who don’t care about the signature, the book is nearly sold out already so you might want to consider grabbing one while you can.\nSpeaking of sell-outs, beginning with\nRhetoric\n, we’re increasing the number of Library editions to 850. This is because the books are nearly sold out on the basis of the subscriptions alone now. Libraria editions will remain at 100. The current subscription book is\nDiscourses on Livy\nby Machiavelli.\nWe are aware that some people received doubles of Plutarch, and others still haven’t received their\nDivine Comedy\n– me included. Let us know at library -at- castaliahouse -dot- com in either case; the bindery is actively resolving each case one at a time. They have a new system in place which should prevent these problems in the future and we’ve reserved enough books to make certain that everyone who paid for one will receive one. In the meantime, don’t bother letting me know, as I can’t do anything about it and don’t even have my copy of Dante or Plutarch.\nAnd finally, the rear endpapers for the leather editions, which will be the same for every volume.\nUPDATE:\nIf you have an issue, send it to the email address above and it will be directed to the responsible party, who will address it. Scores of issues have been successfully resolved this way. If you post it here in the comments, it will be deleted. If you email it to me, it will be deleted. If people want me to write anything at all in the future, then they will have to stop treating me like a call center based in India simply because I am accessible. And to think some people wonder why I absolutely refuse to do book tours, speeches, or any other public appearances….",
  "tags": [
    "books"
  ],
  "categories": [],
  "sitemap_lastmod": "2021-05-16T10:28:02+00:00"
}