{
  "url": "https://voxday.net/2021/05/26/wednesday-am-arktoons-11/",
  "scraped_at": "2025-12-21T22:50:39.761024",
  "title": "Wednesday AM Arktoons",
  "date_display": "May 26, 2021",
  "date_iso": "2021-05-26T10:53:45+00:00",
  "date_from_url": "2021-05-26",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p><b>ALT★HERO</b> Episode 5: <a href=\"https://www.arkhaven.com/comics/superhero/alt-hero\" rel=\"noopener\" target=\"_blank\">I Will Break You, Scabby Donkey!</a></p><p><b>DEUS VULT</b> Episode 5: <a href=\"https://www.arkhaven.com/comics/fantasy/deus-vult\" rel=\"noopener\" target=\"_blank\">Gorok Strikes</a></p><p>After consulting Arktoons subscribers on SocialGalactic and looking at the current level of subscription resources combined with crowdfunded content, here is the current plan:</p><ul style=\"text-align: left;\"><li>Most of the most popular comics will stay the same, with long weekly episodes between 20 and 40 panels. This includes <i>A Throne of Bones</i>, <i>Midnight’s War</i>, <i>Alt★Hero</i>, <i>Chuck Dixon’s Avalon</i>, <i>Quantum Mortis</i>, <i>Swan Knight’s Saga</i>, and <i>Ember War</i>, among others.</li><li><i>Shade </i>and <i>AH:Q</i> will drop to 8 panels for production reasons. In the case of the latter, we’re going to have to wait several months for Helix Haze to finish some work for one of the dinosaurs before he can illustrate Issues 5 and 6. We looked into replacing him with a different illustrator, but ultimately decided against doing so because we really like his work. <i>The Awakener</i> and <i>Hammer of Freedom</i> will be reduced to 8 panels as well.</li><li>The new series of <i>Silenziosa </i>will launch with 12 panels, as will one of the two new Brazilian series. The other will launch with 8 panels. The new independent series of <i>Dead Bang</i> will be presented as the publisher sees fit, but we’ll recommend 8-12 panels to them.</li><li>Six new series, including <i>Something Big </i>will launch with 4-6 panels that will vary from week to week. Subscribers will be given the opportunity to vote on at least two of the series, including who the next AH spinoff character should be. New short episodes of <i>Chicago Typewriter</i> will also be created.</li><li>As the subscriptions grow over time, we’ll intend to give subscribers the choice between a) making certain series longer and b) more new series. We are still planning the crowdfunding campaign for <i>Midnight’s War</i>, but not until we introduce at least one episode with the new approach to coloring it.</li><li>1,000-word text episodes when the feature is ready. The first text series will be the unreleased two chapters of <i>A Sea of Skulls</i> that I promised a few weeks ago.</li></ul><div>I understand that the vote for long episodes was unanimous. However, I also recognize that it is probably not an accident that a majority of the most-viewed and most-liked series on Webtoons and Tapas are of the “bite-sized” variety. So, we’re going to try providing excellent examples of both and see what happens; if I have learned one thing over the years, it is to let the market speak for itself and to abandon any plans that are contradicted by it no matter how flawlessly logical they are.</div><div>Also, the Arkhaven blog has been crushing it of late, with some very good analysis of the various developments on the cultural war front that is the film and comics industry. The Dark Herald’s article on <a href=\"https://arkhavencomics.com/2021/05/24/the-gamma-boss-director-josh-trank/\" rel=\"noopener\" target=\"_blank\">the inevitable failure of <i>The Fantastic Four</i></a> is educational on multiple levels.</div></div>",
  "content_text": "ALT★HERO\nEpisode 5:\nI Will Break You, Scabby Donkey!\nDEUS VULT\nEpisode 5:\nGorok Strikes\nAfter consulting Arktoons subscribers on SocialGalactic and looking at the current level of subscription resources combined with crowdfunded content, here is the current plan:\nMost of the most popular comics will stay the same, with long weekly episodes between 20 and 40 panels. This includes\nA Throne of Bones\n,\nMidnight’s War\n,\nAlt★Hero\n,\nChuck Dixon’s Avalon\n,\nQuantum Mortis\n,\nSwan Knight’s Saga\n, and\nEmber War\n, among others.\nShade\nand\nAH:Q\nwill drop to 8 panels for production reasons. In the case of the latter, we’re going to have to wait several months for Helix Haze to finish some work for one of the dinosaurs before he can illustrate Issues 5 and 6. We looked into replacing him with a different illustrator, but ultimately decided against doing so because we really like his work.\nThe Awakener\nand\nHammer of Freedom\nwill be reduced to 8 panels as well.\nThe new series of\nSilenziosa\nwill launch with 12 panels, as will one of the two new Brazilian series. The other will launch with 8 panels. The new independent series of\nDead Bang\nwill be presented as the publisher sees fit, but we’ll recommend 8-12 panels to them.\nSix new series, including\nSomething Big\nwill launch with 4-6 panels that will vary from week to week. Subscribers will be given the opportunity to vote on at least two of the series, including who the next AH spinoff character should be. New short episodes of\nChicago Typewriter\nwill also be created.\nAs the subscriptions grow over time, we’ll intend to give subscribers the choice between a) making certain series longer and b) more new series. We are still planning the crowdfunding campaign for\nMidnight’s War\n, but not until we introduce at least one episode with the new approach to coloring it.\n1,000-word text episodes when the feature is ready. The first text series will be the unreleased two chapters of\nA Sea of Skulls\nthat I promised a few weeks ago.\nI understand that the vote for long episodes was unanimous. However, I also recognize that it is probably not an accident that a majority of the most-viewed and most-liked series on Webtoons and Tapas are of the “bite-sized” variety. So, we’re going to try providing excellent examples of both and see what happens; if I have learned one thing over the years, it is to let the market speak for itself and to abandon any plans that are contradicted by it no matter how flawlessly logical they are.\nAlso, the Arkhaven blog has been crushing it of late, with some very good analysis of the various developments on the cultural war front that is the film and comics industry. The Dark Herald’s article on\nthe inevitable failure of\nThe Fantastic Four\nis educational on multiple levels.",
  "tags": [
    "comics"
  ],
  "categories": [],
  "sitemap_lastmod": "2021-05-26T09:53:45+00:00"
}