{
  "url": "https://voxday.net/2023/07/14/everything-is-fake/",
  "scraped_at": "2026-01-08T14:02:48.267729",
  "title": "Everything is Fake",
  "date_display": "July 14, 2023",
  "date_iso": "2023-07-14T11:03:51+00:00",
  "date_from_url": "2023-07-14",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>And it has been for a long time. Miles Mathis explains why he’s pretty sure that Wimbledon and other tennis championships <a href=\"http://mileswmathis.com/feder.pdf\">have been scripted</a> from time to time over the last 50 years, including Arthur Ashe’s 1973 title and Andy Murray’s 2013 defeat of Djokovic at the All England Lawn Tennis and Croquet Club.</p><blockquote class=\"wp-block-quote is-layout-flow wp-block-quote-is-layout-flow\"><p>I believe Connors was paid to throw Wimbledon to Arthur Ashe. See here for how staged it all was. Or you can watch highlights here, where I think it is blindingly obvious. Remember, Ashe was nine years older and had only been playing 3-set matches since 1973. So it is convenient he beat Connors 6-1, 6-1 in the first two sets at Wimbledon, in ludicrously short points. Watching that film will show you Connors didn’t disguise it very well. He is grinning like a naughty child the whole time. At several points, you can see that Connors is throwing it so clumsily, Ashe gets mad and hits the ball out on purpose himself. It is the sloppiest professional match of all time, and Connors has an ugly unforced error on almost every point. Looking back, it is difficult to believe the crowd didn’t riot or boo them off the court. Even the announcers are stunned into silence. How do you comment on someone throwing a Wimbledon final in such outlandish fashion? I have to believe someone pulled Connors to the side after the first two sets and ordered him to quit hitting every ball out.</p><p>They said, “C’mon, man, we are paying you to make this look real. This is just pathetic!” The misdirection on this match is awful to this day, with many people hired to misdirect, saying Connors choked, Ashe played him for a fool, etc. Some criminally miscount unforced errors. One guy claims Connors had 13 unforced errors in the match. You have to laugh. He had more unforced errors than that in the first three games. You can see more unforced errors than that in the brief highlights reel I linked to above at Youtube. As you study that highlights reel, I encourage you to also study the crowd. It just proves once again that people are zombies. They sit there quietly clapping on cue as this transparent crime against reality unfolds in front of them.</p></blockquote><p>It’s not hard to imagine Jimmy Connors deciding to make it obvious for everyone, given his puckish personality. And I don’t think it’s an accident that these “stunning historic upsets” so often feature something like “the first Black champion” or “the first British champion in a billion years”. Remember, sports are first and foremost <em>an</em> <em>entertainment business</em>, so making money and producing memorable storylines are their priorities, not “providing all competitors with a level playing field”.</p><p>The fact that the International Olympic Committee is not inviting Russia and Belarus to participate in the Paris Olympics only underlines the fact that sports are subservient to the Narrative.</p><p><em><a href=\"https://social.infogalactic.com/micropost/02a3d872-2846-4a7d-a4eb-f0cdcb8d4540\">DISCUSS ON SG</a></em></p></div>",
  "content_text": "And it has been for a long time. Miles Mathis explains why he’s pretty sure that Wimbledon and other tennis championships\nhave been scripted\nfrom time to time over the last 50 years, including Arthur Ashe’s 1973 title and Andy Murray’s 2013 defeat of Djokovic at the All England Lawn Tennis and Croquet Club.\nI believe Connors was paid to throw Wimbledon to Arthur Ashe. See here for how staged it all was. Or you can watch highlights here, where I think it is blindingly obvious. Remember, Ashe was nine years older and had only been playing 3-set matches since 1973. So it is convenient he beat Connors 6-1, 6-1 in the first two sets at Wimbledon, in ludicrously short points. Watching that film will show you Connors didn’t disguise it very well. He is grinning like a naughty child the whole time. At several points, you can see that Connors is throwing it so clumsily, Ashe gets mad and hits the ball out on purpose himself. It is the sloppiest professional match of all time, and Connors has an ugly unforced error on almost every point. Looking back, it is difficult to believe the crowd didn’t riot or boo them off the court. Even the announcers are stunned into silence. How do you comment on someone throwing a Wimbledon final in such outlandish fashion? I have to believe someone pulled Connors to the side after the first two sets and ordered him to quit hitting every ball out.\nThey said, “C’mon, man, we are paying you to make this look real. This is just pathetic!” The misdirection on this match is awful to this day, with many people hired to misdirect, saying Connors choked, Ashe played him for a fool, etc. Some criminally miscount unforced errors. One guy claims Connors had 13 unforced errors in the match. You have to laugh. He had more unforced errors than that in the first three games. You can see more unforced errors than that in the brief highlights reel I linked to above at Youtube. As you study that highlights reel, I encourage you to also study the crowd. It just proves once again that people are zombies. They sit there quietly clapping on cue as this transparent crime against reality unfolds in front of them.\nIt’s not hard to imagine Jimmy Connors deciding to make it obvious for everyone, given his puckish personality. And I don’t think it’s an accident that these “stunning historic upsets” so often feature something like “the first Black champion” or “the first British champion in a billion years”. Remember, sports are first and foremost\nan\nentertainment business\n, so making money and producing memorable storylines are their priorities, not “providing all competitors with a level playing field”.\nThe fact that the International Olympic Committee is not inviting Russia and Belarus to participate in the Paris Olympics only underlines the fact that sports are subservient to the Narrative.\nDISCUSS ON SG",
  "tags": [
    "Clown World",
    "sports"
  ],
  "categories": [],
  "sitemap_lastmod": "2023-07-14T11:03:54+00:00"
}