{
  "url": "https://voxday.net/2023/07/09/further-evidence-against-arthur-c-clarke/",
  "scraped_at": "2026-01-08T14:02:16.699718",
  "title": "Further Evidence Against Arthur C. Clarke",
  "date_display": "July 9, 2023",
  "date_iso": "2023-07-09T23:32:17+00:00",
  "date_from_url": "2023-07-09",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>Arthur C. Clarke was science fiction’s most famous pedo. He’s far from the only one, but he’s certainly the most famous. While it is massively embarrassing that one of the genre’s greatest writers – one whose short stories are published by Castalia House in two volumes of <em>THERE WILL BE WAR</em>, namely, “Superiority” in Vol. II and “Hide and Seek” in Vol. III – was a sex predator, and while the man cannot be said to have committed any sex crimes in Sri Lanka due to the fact that even the most heinous abuse of children is apparently still legal there, no individual who considers the known facts can reasonably deny that the evidence against the man is both comprehensive and conclusive.</p><p>While I <a href=\"https://voxday.net/2015/12/28/mailvox-where-are-connections/\">was familiar</a> with most of the information in <a href=\"https://tinyurl.com/5t2e242u\">The Dark Side of Arthur C. Clarke</a>, the 2017 article from <em>Vice </em>that contained <a href=\"https://archive.is/YUU8t\">an eyewitness account</a> of a personal encounter with Clarke was new to me, and further clinches the case against the SF great and his wicked predilections.</p><blockquote class=\"wp-block-quote is-layout-flow wp-block-quote-is-layout-flow\"><p>I grew up in Sri Lanka. My dad was doing some work for the Canadian government. There were a lot of expat kids in my area and we had free reign of the neighbourhood. Our parents mostly let us do what we wanted, but we were told to stay away—never go near—a large property that bordered my house. When we asked why the reasons were always vague.</p><p>There were some rumors (sic) that someone very famous or maybe powerful lived there. We all got the sense that he was …a danger in some way. One day I was home sick from school. My grandfather was visiting from Canada and he was assigned to watch me. I remember that I was in pajamas (sic). We were in the backyard and my grandfather was painting peacocks. Out of our hedges this man appeared and approached us. I instantly knew it was the man from the property. The man from the property wanted something from my dad, who of course wasn’t home. My grandfather was star struck by the man.</p><p>Grandpa could barely speak. The two began chatting. The man flattered my grandfather’s painting. He said he also liked to paint but only people. The man looked towards me and said let’s paint the boy. I was placed on a stool in front of the two men. I was eleven years old. Very quickly the neighbour said the clothes were spoiling the beauty of me. He asked me to remove my clothes. I looked at my grandpa and did as I was told. Soon after I was on the stool, naked, and crying. I don’t know how long this went on but at some point my father arrived home.</p><p>He quickly reviewed the scene, saw the man from the property, and…went ..nuts. He just lost it on them: raising his voice. Getting in people’s faces. I honestly thought he might kill them both. Within a couple of hours my grandfather was gone and they never – ever – spoke again.</p><p>Although in some circles it was common knowledge, the man from the property was a famous British science fiction novelist. Apparently he had been banished to (then) Ceylon from postwar Britain rather than face prison for being a pederast. I think about that day sometimes. My father didn’t have a temper and rarely ever even raised his voice but the man he became in that moment while essentially unrecognizable. While we’ve had our ups and downs from that moment forward I never questioned his love for me again.</p> <cite>The stories people told their therapists about, VICE, July 17, 2017</cite></blockquote><p>In retrospect, two of the surprisingly more damning elements are a) Clarke’s personal relationship with King Charles and b) the BBC’s lack of interest in the story. What might have seemed incredible even in 2012 appears obvious now in light of what we now know about Jimmy Savile and <a href=\"https://www.theguardian.com/media/2012/dec/19/jimmy-savile-crisis-bbc-timeline\">the BBC’s now-confirmed preference</a> for ignoring major stories about sex predators.</p><p><em><a href=\"https://social.infogalactic.com/micropost/ebb38b21-96e9-4fef-b830-39623f096305/comment/514e1b9f-3169-43c8-9727-e7e883bdde23\">DISCUSS ON SG</a></em></p></div>",
  "content_text": "Arthur C. Clarke was science fiction’s most famous pedo. He’s far from the only one, but he’s certainly the most famous. While it is massively embarrassing that one of the genre’s greatest writers – one whose short stories are published by Castalia House in two volumes of\nTHERE WILL BE WAR\n, namely, “Superiority” in Vol. II and “Hide and Seek” in Vol. III – was a sex predator, and while the man cannot be said to have committed any sex crimes in Sri Lanka due to the fact that even the most heinous abuse of children is apparently still legal there, no individual who considers the known facts can reasonably deny that the evidence against the man is both comprehensive and conclusive.\nWhile I\nwas familiar\nwith most of the information in\nThe Dark Side of Arthur C. Clarke\n, the 2017 article from\nVice\nthat contained\nan eyewitness account\nof a personal encounter with Clarke was new to me, and further clinches the case against the SF great and his wicked predilections.\nI grew up in Sri Lanka. My dad was doing some work for the Canadian government. There were a lot of expat kids in my area and we had free reign of the neighbourhood. Our parents mostly let us do what we wanted, but we were told to stay away—never go near—a large property that bordered my house. When we asked why the reasons were always vague.\nThere were some rumors (sic) that someone very famous or maybe powerful lived there. We all got the sense that he was …a danger in some way. One day I was home sick from school. My grandfather was visiting from Canada and he was assigned to watch me. I remember that I was in pajamas (sic). We were in the backyard and my grandfather was painting peacocks. Out of our hedges this man appeared and approached us. I instantly knew it was the man from the property. The man from the property wanted something from my dad, who of course wasn’t home. My grandfather was star struck by the man.\nGrandpa could barely speak. The two began chatting. The man flattered my grandfather’s painting. He said he also liked to paint but only people. The man looked towards me and said let’s paint the boy. I was placed on a stool in front of the two men. I was eleven years old. Very quickly the neighbour said the clothes were spoiling the beauty of me. He asked me to remove my clothes. I looked at my grandpa and did as I was told. Soon after I was on the stool, naked, and crying. I don’t know how long this went on but at some point my father arrived home.\nHe quickly reviewed the scene, saw the man from the property, and…went ..nuts. He just lost it on them: raising his voice. Getting in people’s faces. I honestly thought he might kill them both. Within a couple of hours my grandfather was gone and they never – ever – spoke again.\nAlthough in some circles it was common knowledge, the man from the property was a famous British science fiction novelist. Apparently he had been banished to (then) Ceylon from postwar Britain rather than face prison for being a pederast. I think about that day sometimes. My father didn’t have a temper and rarely ever even raised his voice but the man he became in that moment while essentially unrecognizable. While we’ve had our ups and downs from that moment forward I never questioned his love for me again.\nThe stories people told their therapists about, VICE, July 17, 2017\nIn retrospect, two of the surprisingly more damning elements are a) Clarke’s personal relationship with King Charles and b) the BBC’s lack of interest in the story. What might have seemed incredible even in 2012 appears obvious now in light of what we now know about Jimmy Savile and\nthe BBC’s now-confirmed preference\nfor ignoring major stories about sex predators.\nDISCUSS ON SG",
  "tags": [
    "history",
    "Pink SF",
    "SFWA"
  ],
  "categories": [],
  "sitemap_lastmod": "2023-07-09T23:50:45+00:00"
}