{
  "url": "https://voxday.net/2023/07/15/material-greed-vs-spiritual-wickedness/",
  "scraped_at": "2026-01-08T14:02:56.773101",
  "title": "Material Greed vs Spiritual Wickedness",
  "date_display": "July 15, 2023",
  "date_iso": "2023-07-15T21:54:34+00:00",
  "date_from_url": "2023-07-15",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>From the comments at AC’s place, a discussion of why supposedly profit-seeking corporations like Disney and Anheiser Busch <a href=\"https://www.anonymousconservative.com/blog/news-briefs-07-14-2023/\">are actively destroying their IP</a>, their profits, and their market caps with their relentless campaigns against the European nations and Christian values.</p><p><strong>Anonymous: </strong>Of course it’s deliberate sabotage. Cabal has always hated Disney. They need his legacy completely removed from the minds of Americans.</p><p>Vox Day believes that this somehow renders materialism and money motivation is irrelevant. And pulls “spiritual wickedness” out of his butt as a reason to understand all of this. Yep, money doesn’t motivate cabal at all. Just “spiritual wickedness”, which he can neither define nor explain.</p><p>An astounding expert at missing the obvious and fabricating ghost stories to explain the motion of the world, he doesn’t seem to understand the value of cultural legacies and values. And can’t in any way conceive that greed is driving all of this. It is the greed of control. Cabal isn’t after a few cheap ticket or lunchbox sales. They want everything we have. And that begins with completely lobotomizing us and removing us from our cultural legacy so that we can become compliant little podlings who own nothing and are happy.</p><p>VD can’t see the obvious greed, the greed to control the entire world and wipe out any potential opposition. He can’t see that cabal is interested in taking EVERYTHING you have and making sure that no remaining humans are able to resist or even survive on their own. Wiping out the legacy of people like Walt Disney is a part of our ongoing cultural lobotomization, a move of harsh implications. And yet conservatives gleefully cheer on the destruction of our legacy, and guys like VD do their best to obscure the reality of what is going on by insisting that it’s not unimaginably ferocious greed but instead best explained by old ghost stories.</p><p><strong>Reply to Anonymous: </strong>tell me u r atheist without saying u r atheist</p><p><strong>Reply to Anonymous</strong>: You don’t understand Vox.</p><p><strong>VD:</strong> First, it’s the “old ghost stories” that define greed as evil, and the love of money being the root of evil. So you’re trying to set up a false dichotomy here. Without those “old ghost stories”, you have no rational basis for condemning either greed or control.</p><p>Second, it is no problem to define and explain “spiritual wickedness”. It is the causal driving force behind the material wickedness, which is conscious opposition to God, Jesus Christ, and Nature. What you call cabal is merely the material opposition that serves the interests and command of its supramaterial masters.</p><p>Third, the legacy was destroyed when the infiltration was completed. Nothing can save Disney now. There is no point to supporting Disney’s assaults on Christian European culture. Fourth, money motivation is nonexistent to those who can create it ex nihilo. “Money” doesn’t really exist today, as it’s nothing more than promises made by faithless individuals and institutions.</p><p><strong>Farcesensitive: </strong>They don’t need money, they print money and they steal more money than you could imagine. It’s about power, evil, and destruction.</p><p><strong>Reply to Anonymous:</strong> Get out of here with your shallow atheism. Greed is the base motivator for humans. As also is lust, ambition, power, revenge. But the supernatural world influences humans &amp; plays the long game.</p><p>Throughout time mankind has pursued its short term carnal desires. But there are evil spiritual forces guiding and shaping these behaviors and energies so as to set in play events that will cause the greatest amount of destruction to mankind, physically and spiritually. Destroy beauty, destroy hope, destroy how people connect to God. Increase alienation, increase isolation, break bonds of family, community, even the sense of self &amp; a greater harvest of those who will be damned &amp; have their potential denied is possible.</p><p>It’s much bigger than what you think it is &amp; it’s been going on for millennia. They know they will lose &amp; they want to take as many of us out as they can.</p><p><strong>Macaque Mentality:</strong> If you’re a shill: LOL, nice try. If you’re not a shill: You need to engage in deeper thinking. Greed is only a miniscule variable in what’s actually happening in the world right now. Jesus Christ is Lord. Start with the Bible.</p><p><em><a href=\"https://social.infogalactic.com/micropost/7a73109b-ed6c-4a15-a0f8-45cb3099ec6d\">DISCUSS ON SG</a></em></p></div>",
  "content_text": "From the comments at AC’s place, a discussion of why supposedly profit-seeking corporations like Disney and Anheiser Busch\nare actively destroying their IP\n, their profits, and their market caps with their relentless campaigns against the European nations and Christian values.\nAnonymous:\nOf course it’s deliberate sabotage. Cabal has always hated Disney. They need his legacy completely removed from the minds of Americans.\nVox Day believes that this somehow renders materialism and money motivation is irrelevant. And pulls “spiritual wickedness” out of his butt as a reason to understand all of this. Yep, money doesn’t motivate cabal at all. Just “spiritual wickedness”, which he can neither define nor explain.\nAn astounding expert at missing the obvious and fabricating ghost stories to explain the motion of the world, he doesn’t seem to understand the value of cultural legacies and values. And can’t in any way conceive that greed is driving all of this. It is the greed of control. Cabal isn’t after a few cheap ticket or lunchbox sales. They want everything we have. And that begins with completely lobotomizing us and removing us from our cultural legacy so that we can become compliant little podlings who own nothing and are happy.\nVD can’t see the obvious greed, the greed to control the entire world and wipe out any potential opposition. He can’t see that cabal is interested in taking EVERYTHING you have and making sure that no remaining humans are able to resist or even survive on their own. Wiping out the legacy of people like Walt Disney is a part of our ongoing cultural lobotomization, a move of harsh implications. And yet conservatives gleefully cheer on the destruction of our legacy, and guys like VD do their best to obscure the reality of what is going on by insisting that it’s not unimaginably ferocious greed but instead best explained by old ghost stories.\nReply to Anonymous:\ntell me u r atheist without saying u r atheist\nReply to Anonymous\n: You don’t understand Vox.\nVD:\nFirst, it’s the “old ghost stories” that define greed as evil, and the love of money being the root of evil. So you’re trying to set up a false dichotomy here. Without those “old ghost stories”, you have no rational basis for condemning either greed or control.\nSecond, it is no problem to define and explain “spiritual wickedness”. It is the causal driving force behind the material wickedness, which is conscious opposition to God, Jesus Christ, and Nature. What you call cabal is merely the material opposition that serves the interests and command of its supramaterial masters.\nThird, the legacy was destroyed when the infiltration was completed. Nothing can save Disney now. There is no point to supporting Disney’s assaults on Christian European culture. Fourth, money motivation is nonexistent to those who can create it ex nihilo. “Money” doesn’t really exist today, as it’s nothing more than promises made by faithless individuals and institutions.\nFarcesensitive:\nThey don’t need money, they print money and they steal more money than you could imagine. It’s about power, evil, and destruction.\nReply to Anonymous:\nGet out of here with your shallow atheism. Greed is the base motivator for humans. As also is lust, ambition, power, revenge. But the supernatural world influences humans & plays the long game.\nThroughout time mankind has pursued its short term carnal desires. But there are evil spiritual forces guiding and shaping these behaviors and energies so as to set in play events that will cause the greatest amount of destruction to mankind, physically and spiritually. Destroy beauty, destroy hope, destroy how people connect to God. Increase alienation, increase isolation, break bonds of family, community, even the sense of self & a greater harvest of those who will be damned & have their potential denied is possible.\nIt’s much bigger than what you think it is & it’s been going on for millennia. They know they will lose & they want to take as many of us out as they can.\nMacaque Mentality:\nIf you’re a shill: LOL, nice try. If you’re not a shill: You need to engage in deeper thinking. Greed is only a miniscule variable in what’s actually happening in the world right now. Jesus Christ is Lord. Start with the Bible.\nDISCUSS ON SG",
  "tags": [
    "Christianity",
    "corpocracy",
    "Judeochristianity"
  ],
  "categories": [],
  "sitemap_lastmod": "2023-07-15T21:54:36+00:00"
}