{
  "url": "https://voxday.net/2023/07/10/never-trust-the-cloud/",
  "scraped_at": "2026-01-08T14:02:23.698515",
  "title": "Never Trust the Cloud",
  "date_display": "July 10, 2023",
  "date_iso": "2023-07-10T19:16:27+00:00",
  "date_from_url": "2023-07-10",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>As Microsoft contemplates trying to talk future Windows 12 users into using a Cloud-based operating system, <a href=\"https://archive.is/30ME1#selection-1121.0-1147.167\">Apple aggressively undermines</a> the case for the cloud:</p><blockquote class=\"wp-block-quote is-layout-flow wp-block-quote-is-layout-flow\"><p>Apple will permanently delete a photo album from iPhones in about two weeks and has stopped uploading pictures to it, the company confirmed.</p><p>My Photo Stream is an iCloud service that originally launched in 2011. What the service does is temporarily uploads photos taken on a device so they can be seen on another device with My Photo Stream enabled. It also allows users to import the pictures to that device. Up to around 1,000 photos can be stored in My Photo Stream for about 30 days. They are then automatically deleted from Apple’s iCloud.</p><p>But it will no longer be available in just a few days, and users are advised to save any photos they may have in that soon-to-be-deleted photo album. Apple confirmed in a recent bulletin that My Photo Stream will be “shutting down” on July 26. It did not provide a reason for the shuttering of the service that was launched in 2011.</p></blockquote><p>If you don’t own, control, and possess your data, you will lose your data. Even if you’re not deplatformed, there is no guarantee that the platform on which you are depending will continue to exist, as these Apple users are discovering. And the wisdom in building UATV – to which <a href=\"https://unauthorized.tv/account/new/\">you should definitely subscribe</a> if you have not already – is further demonstrated by the shuttering of GabTV.</p><p>Remember “the cloud” is short for “someone else’s computer”.</p><p><em><a href=\"https://social.infogalactic.com/micropost/2c3d5206-ba65-4e6a-9c7b-380670524275\">DISCUSS ON SG</a></em></p></div>",
  "content_text": "As Microsoft contemplates trying to talk future Windows 12 users into using a Cloud-based operating system,\nApple aggressively undermines\nthe case for the cloud:\nApple will permanently delete a photo album from iPhones in about two weeks and has stopped uploading pictures to it, the company confirmed.\nMy Photo Stream is an iCloud service that originally launched in 2011. What the service does is temporarily uploads photos taken on a device so they can be seen on another device with My Photo Stream enabled. It also allows users to import the pictures to that device. Up to around 1,000 photos can be stored in My Photo Stream for about 30 days. They are then automatically deleted from Apple’s iCloud.\nBut it will no longer be available in just a few days, and users are advised to save any photos they may have in that soon-to-be-deleted photo album. Apple confirmed in a recent bulletin that My Photo Stream will be “shutting down” on July 26. It did not provide a reason for the shuttering of the service that was launched in 2011.\nIf you don’t own, control, and possess your data, you will lose your data. Even if you’re not deplatformed, there is no guarantee that the platform on which you are depending will continue to exist, as these Apple users are discovering. And the wisdom in building UATV – to which\nyou should definitely subscribe\nif you have not already – is further demonstrated by the shuttering of GabTV.\nRemember “the cloud” is short for “someone else’s computer”.\nDISCUSS ON SG",
  "tags": [
    "technology",
    "UATV"
  ],
  "categories": [],
  "sitemap_lastmod": "2023-07-10T19:16:29+00:00"
}