{
  "url": "https://voxday.net/2023/07/25/obvious-manufacture-is-obvious/",
  "scraped_at": "2026-01-08T14:03:50.629407",
  "title": "Obvious Manufacture is Obvious",
  "date_display": "July 25, 2023",
  "date_iso": "2023-07-25T09:49:36+00:00",
  "date_from_url": "2023-07-25",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>You may recall <a href=\"https://voxday.net/2023/07/21/7-signs-of-controlled-opposition/\">the list of signs</a> that an individual is controlled opposition and his “popularity” is being manufactured for him by the mainstream media, as in the cases of Ben Shapiro, Jordan Peterson, Nick Fuentes, and Andrew Tate, just to name a few. The next one <a href=\"https://archive.md/HhSuS#selection-2705.0-2705.81\">absolutely pings on all of them</a>.</p><blockquote class=\"wp-block-quote is-layout-flow wp-block-quote-is-layout-flow\"><p>What do you get if you throw Alex Jones, Andrew Tate, Jordan Peterson, a Baptist preacher and seventeen cans of Red Bull in a blender?</p><p>Jon Zherka.</p><p>You mightn’t have heard of him before, but believe me, it’s only a matter of time before his name pops up on your social media feed. That’s because the “6’5 king of alpha male energy” is taking the internet by storm. On TikTok, his videos have been viewed tens of millions of times.</p><p>According to his YouTube channel, which boasts 93,000-plus subscribers, Jon Zherka is a comedian who excels at pushing boundaries. His “humour” – controversial to say the least – explores “topics such as race, religion, gender dynamics and orientation”.</p><p>Zherka’s comedy, we’re told, involves “challenging perceptions and sparking dialogue, all while making sure the laughs keep coming”. He’s not your average comedian, he’s Jon Zherka, a human wrecking ball who is liable to say what he wants, when he wants.</p> <cite>‘Alpha male energy’: Why Jon Zherka is the most controversial man on social media, 23 July 2023</cite></blockquote><p>Now, how can he be ‘the most controversial man on social media” when he hasn’t been deplatformed from any of the SJW platforms? Note that he has less than one-third the number of YouTube subscribers that Big Bear did before he was ejected from the platform <em>four years ago</em>. And note that while you haven’t heard of him – I certainly hadn’t – he’s “taking the Internet by storm” thanks to some suspiciously familiar themes.</p><p><em>When he’s not busy trying to convert the masses to Christianity, Zherka enjoys pushing flat earth conspiracies. Not surprisingly, Zherka also believes that the moon landing of 1969, when two American astronauts became the first humans to walk on the lunar surface, was faked. His close friend, Sneako, also a wildly popular influencer, also subscribes to the fake moon landing narrative.</em></p><p><strong>Translation: </strong>this is the media’s feeble attempt to provide an alternative to Owen Benjamin. Notice in particular how the article compares him to their previous fakes instead of to the individual whom he is obviously imitating; they do this because the whole point is to avoid mentioning the genuine celebrity they are attempting to depopularize.</p><p>Be particularly suspicious when these manufactured creatures always refer to “Christ” and never “Jesus Christ of Nazareth”.</p><p><em><a href=\"https://social.infogalactic.com/micropost/68d23b50-04ce-443f-b4a4-f740db0b2fcb\">DISCUSS ON SG</a></em></p></div>",
  "content_text": "You may recall\nthe list of signs\nthat an individual is controlled opposition and his “popularity” is being manufactured for him by the mainstream media, as in the cases of Ben Shapiro, Jordan Peterson, Nick Fuentes, and Andrew Tate, just to name a few. The next one\nabsolutely pings on all of them\n.\nWhat do you get if you throw Alex Jones, Andrew Tate, Jordan Peterson, a Baptist preacher and seventeen cans of Red Bull in a blender?\nJon Zherka.\nYou mightn’t have heard of him before, but believe me, it’s only a matter of time before his name pops up on your social media feed. That’s because the “6’5 king of alpha male energy” is taking the internet by storm. On TikTok, his videos have been viewed tens of millions of times.\nAccording to his YouTube channel, which boasts 93,000-plus subscribers, Jon Zherka is a comedian who excels at pushing boundaries. His “humour” – controversial to say the least – explores “topics such as race, religion, gender dynamics and orientation”.\nZherka’s comedy, we’re told, involves “challenging perceptions and sparking dialogue, all while making sure the laughs keep coming”. He’s not your average comedian, he’s Jon Zherka, a human wrecking ball who is liable to say what he wants, when he wants.\n‘Alpha male energy’: Why Jon Zherka is the most controversial man on social media, 23 July 2023\nNow, how can he be ‘the most controversial man on social media” when he hasn’t been deplatformed from any of the SJW platforms? Note that he has less than one-third the number of YouTube subscribers that Big Bear did before he was ejected from the platform\nfour years ago\n. And note that while you haven’t heard of him – I certainly hadn’t – he’s “taking the Internet by storm” thanks to some suspiciously familiar themes.\nWhen he’s not busy trying to convert the masses to Christianity, Zherka enjoys pushing flat earth conspiracies. Not surprisingly, Zherka also believes that the moon landing of 1969, when two American astronauts became the first humans to walk on the lunar surface, was faked. His close friend, Sneako, also a wildly popular influencer, also subscribes to the fake moon landing narrative.\nTranslation:\nthis is the media’s feeble attempt to provide an alternative to Owen Benjamin. Notice in particular how the article compares him to their previous fakes instead of to the individual whom he is obviously imitating; they do this because the whole point is to avoid mentioning the genuine celebrity they are attempting to depopularize.\nBe particularly suspicious when these manufactured creatures always refer to “Christ” and never “Jesus Christ of Nazareth”.\nDISCUSS ON SG",
  "tags": [
    "cuckservative",
    "media",
    "SJW"
  ],
  "categories": [],
  "sitemap_lastmod": "2023-07-25T10:09:51+00:00"
}