{
  "url": "https://voxday.net/2023/07/17/pharasaism-is-not-pre-christianity/",
  "scraped_at": "2026-01-08T14:03:14.405957",
  "title": "Pharasaism is not Pre-Christianity",
  "date_display": "July 17, 2023",
  "date_iso": "2023-07-17T11:39:11+00:00",
  "date_from_url": "2023-07-17",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>The Pharasaic religion is a <em>post-Christian</em> faith, not a <em>pre-Christian</em> one, and its practices have a great deal more to do with the Carthaginian and Aztec religions than with any form of Christianity. Which is why <a href=\"https://phys.org/news/2023-07-placement-ancient-hidden-lamps-skulls.amp\">the archeological evidence</a> of black magic practiced by the Jewish rebels against Roman rule should not be terribly surprising:</p><blockquote class=\"wp-block-quote is-layout-flow wp-block-quote-is-layout-flow\"><p>A pair of archaeologists, one with the Israel Antiquities Authority, the other from Bar-Ilan University, has found evidence of Roman-era necromancy practices in a cave in Israel. In their study, reported in the journal <em>Harvard Theological Review</em>, Eitan Klein and Boaz Zissu analyzed artifacts excavated from the Te’omim Cave over the past 14 years.</p><p>The Te’omim Cave has played a role in the history of what is now the Jerusalem hills region west of the famous city. During the Bar-Kokhba Revolt, for example, it served as a hideout for Jewish rebels. In this new effort, the researchers studied artifacts that multiple groups have removed from the <a href=\"https://phys.org/tags/cave/\">cave</a> since 2009 as part of a collaboration between several entities in Israel. Such artifacts have been dated to approximately 2,000 years ago, during the Roman era.</p><p>Researchers have found more than 120 oil lamps, various weapons, vessels, coins and even three <a href=\"https://phys.org/tags/human+skulls/\">human skulls</a>. Many of the artifacts were found wedged into tight spaces. In this new effort, the researchers analyzed the <a href=\"https://phys.org/tags/artifacts/\">artifacts</a> and the places where they were found and hypothesize that at least some of them were used in attempts to speak with dead people, a practice called necromancy.</p><p>Necromancy is the practice of enchanted conjuring, involving attempts to communicate with the dead by calling forth their spirits or visualizations of them for the purpose of divination or revealing future events, or to discover secrets. It is also generally associated with black magic or witchcraft. Klein and Zissu suggest that the placement of many of the lamps, for example, is indicative of behavior associated with necromancy—mostly because of the presence of the skulls.</p> <cite>Skulls in cave in Israel suggests Roman-era practice of necromancy, July 14, 2023</cite></blockquote><p>The transformation of the “Synagogue of Satan” to “our elder brothers in the faith” is one of the darkest and most successful psychological operations in history. Even as we’re witnessing grotesque evils that were unthinkable to our grandfathers being forced upon formerly Christian societies, far too many Christians still find themselves totally unable to distinguish between black magic and miracles, between necromancy and prayer, between wickedness and righteousness, and between war against God and the worship of Him.</p><p>More and more Christians are finally seeing through the psyop and coming to understand that “Judaism” is not at all the Hebrew religion of the Old Testament and is literally antithetical to Christianity. <a href=\"https://twitter.com/BasedTorba/status/1680679614568443904\">Consider this exchange</a> between Jonathan Greenblatt of the ADL and Andrew Torba of Gab:</p><p><strong>GREENBLATT: </strong><em>The idea that Judaism is treacherous toward Christianity – including Catholicism – is antisemitic and false. Conspiracy theories like the ones E. Michael Jones spreads put Jews in danger and we must fight these hateful messages.</em></p><p><strong>TORBA: </strong><em>Talmudic Judaism of today is nothing at all like the Judaism of the OT—which ceased being a religion in 70 AD when the temple was annihilated as Christ said it would be. No temple= no OT Judaism. Something new took its place and was formed by the Jews who rejected—and continue to reject—Jesus Christ. All you have to do is read the book of Acts to see how the Jews who rejected Christ persecuted first century Christians—including ethnically Jewish believers. You can also read the Talmud to see all of the treacherous things it has to say about Goyim (non-Jews.). Or simply look how Jews like you treat Christians like myself and @EMichaelJones1 today. Nothing has changed in 2,000 years. Same song and dance.</em></p><p>When they call you “antisemitic” for being antisatanic, and when they accuse you of white supremacy because you oppose abortion, sexual mutilation, theft, child molesting, and human sacrifice, that tells you absolutely everything you ever need to know about the self-appointed thought police who call themselves “Jews”.</p><p><strong>UPDATE:</strong> From Wikipedia: <em>“The Bar Kokhba revolt greatly influenced the course of Jewish history and the philosophy of the Jewish religion. It was also among the key events to differentiate Christianity as a religion distinct from Judaism.”</em></p><p><em><a href=\"https://social.infogalactic.com/micropost/b72cab9b-34b8-4d28-ae29-f61f04c82a96\">DISCUSS ON SG</a></em></p></div>",
  "content_text": "The Pharasaic religion is a\npost-Christian\nfaith, not a\npre-Christian\none, and its practices have a great deal more to do with the Carthaginian and Aztec religions than with any form of Christianity. Which is why\nthe archeological evidence\nof black magic practiced by the Jewish rebels against Roman rule should not be terribly surprising:\nA pair of archaeologists, one with the Israel Antiquities Authority, the other from Bar-Ilan University, has found evidence of Roman-era necromancy practices in a cave in Israel. In their study, reported in the journal\nHarvard Theological Review\n, Eitan Klein and Boaz Zissu analyzed artifacts excavated from the Te’omim Cave over the past 14 years.\nThe Te’omim Cave has played a role in the history of what is now the Jerusalem hills region west of the famous city. During the Bar-Kokhba Revolt, for example, it served as a hideout for Jewish rebels. In this new effort, the researchers studied artifacts that multiple groups have removed from the\ncave\nsince 2009 as part of a collaboration between several entities in Israel. Such artifacts have been dated to approximately 2,000 years ago, during the Roman era.\nResearchers have found more than 120 oil lamps, various weapons, vessels, coins and even three\nhuman skulls\n. Many of the artifacts were found wedged into tight spaces. In this new effort, the researchers analyzed the\nartifacts\nand the places where they were found and hypothesize that at least some of them were used in attempts to speak with dead people, a practice called necromancy.\nNecromancy is the practice of enchanted conjuring, involving attempts to communicate with the dead by calling forth their spirits or visualizations of them for the purpose of divination or revealing future events, or to discover secrets. It is also generally associated with black magic or witchcraft. Klein and Zissu suggest that the placement of many of the lamps, for example, is indicative of behavior associated with necromancy—mostly because of the presence of the skulls.\nSkulls in cave in Israel suggests Roman-era practice of necromancy, July 14, 2023\nThe transformation of the “Synagogue of Satan” to “our elder brothers in the faith” is one of the darkest and most successful psychological operations in history. Even as we’re witnessing grotesque evils that were unthinkable to our grandfathers being forced upon formerly Christian societies, far too many Christians still find themselves totally unable to distinguish between black magic and miracles, between necromancy and prayer, between wickedness and righteousness, and between war against God and the worship of Him.\nMore and more Christians are finally seeing through the psyop and coming to understand that “Judaism” is not at all the Hebrew religion of the Old Testament and is literally antithetical to Christianity.\nConsider this exchange\nbetween Jonathan Greenblatt of the ADL and Andrew Torba of Gab:\nGREENBLATT:\nThe idea that Judaism is treacherous toward Christianity – including Catholicism – is antisemitic and false. Conspiracy theories like the ones E. Michael Jones spreads put Jews in danger and we must fight these hateful messages.\nTORBA:\nTalmudic Judaism of today is nothing at all like the Judaism of the OT—which ceased being a religion in 70 AD when the temple was annihilated as Christ said it would be. No temple= no OT Judaism. Something new took its place and was formed by the Jews who rejected—and continue to reject—Jesus Christ. All you have to do is read the book of Acts to see how the Jews who rejected Christ persecuted first century Christians—including ethnically Jewish believers. You can also read the Talmud to see all of the treacherous things it has to say about Goyim (non-Jews.). Or simply look how Jews like you treat Christians like myself and @EMichaelJones1 today. Nothing has changed in 2,000 years. Same song and dance.\nWhen they call you “antisemitic” for being antisatanic, and when they accuse you of white supremacy because you oppose abortion, sexual mutilation, theft, child molesting, and human sacrifice, that tells you absolutely everything you ever need to know about the self-appointed thought police who call themselves “Jews”.\nUPDATE:\nFrom Wikipedia:\n“The Bar Kokhba revolt greatly influenced the course of Jewish history and the philosophy of the Jewish religion. It was also among the key events to differentiate Christianity as a religion distinct from Judaism.”\nDISCUSS ON SG",
  "tags": [
    "history",
    "Judeochristianity"
  ],
  "categories": [],
  "sitemap_lastmod": "2023-07-18T15:13:11+00:00"
}