{
  "url": "https://voxday.net/2023/07/31/racial-destruction-goes-awry/",
  "scraped_at": "2026-01-08T14:04:28.437964",
  "title": "Racial Destruction Goes Awry",
  "date_display": "July 31, 2023",
  "date_iso": "2023-07-31T09:41:59+00:00",
  "date_from_url": "2023-07-31",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>At first glance, <a href=\"https://en.wikipedia.org/wiki/Richard_von_Coudenhove-Kalergi#Views_on_race_and_religion\">the Kalergi plan</a> from the early 20th century to politically unify Europe and destroy the European race through admixture with “the lesser races” might appear to be working as designed, as one Hapa’s lament for the product of White Male Asian Female couplings tends to indicate:</p><blockquote class=\"wp-block-quote is-layout-flow wp-block-quote-is-layout-flow\"><p>One passage that really stuck out for me in Amy Chua’s book, was her digression on yellow fever. She acknowledges there are a lot of skeevy WMAF couples out there, and makes a point to say that her white husband has never dated an Asian woman before. It was revealing for me to see a supposedly academic intellectual professor from Yale, writing like some Asian teen girl blogger. With the old <em>my white guy doesn’t have yellow fever</em> line. WMAF has become self-aware about just how low status their coupling is, and so they often make the point of saying “my asian girl has dated Asian guys before”, “my white guy has dated white girls before”. Asian women don’t want to be part of any white country club that would let Asians in. Just by dating an Asian girl, white guys make themselves less attractive to future Asian girls. Asian girls are social poison.</p><p>They recognize that WMAF is overflowing with bad apples. Amy Chua would not have wanted to date a white man who dates Asian women. And yet she still wants to date a white man. To this extent she has “ruined” her future husband for future Amy Chuas. Now he wont be able to say, he has never dated an Asian woman before. WMAF is based on the opposite of the categorical imperative. Every WMAF wants to be the one exception. Yes, all other WMAFs are scum, but our WMAF is barely a WMAF. John Derbyshire is a white nationalist with a Chinese wife. And he says he would hate to live in a multicult society, in which many white men married Asians. But since he is part of a small minority, it is ok for him. WMAF is quite loudly and proudly based on hypocrisy.</p><p>Asian women are low status. The same Columbia speed dating study that rated Asian men the least attractive, also rated Asian women the least attractive by all races of men. What? I thought Asian women were exotic and desirable, how can they also be sexual failures? If you believe EvoPsych, men and women have different sexual goals, and thus different ways to fail. A female sexual failure will not be a virgin, but she will only attract low status males. And Asian women have become legendary as the woman of choice for loser white males. This is the ultimate definition of female sexual failure, becoming the easy partner of choice for the males of lowest value. Scandinavian women are the highest status women in the world, and so they can price themselves high with radical feminism. East Asian women are the lowest status women in the world, and so to market themselves to loser white men, they have to advertise themselves as the least feminist. Sexual Coolies serving as strikebreakers against White Feminism. By being so openly desperate for the lowest white men, Asian women have destroyed their own bargaining position in the sexual market. It is impossible to drive a hard bargain when you are so obviously desperate for whiteness. Athletes are the Alpha Males of American society. And it is impossible to name a single athlete married to an Asian women. They have become the Geisha goddesses of white male losers.</p> <cite>Asian women have crashed their own sexual market value, 6 March 2015</cite></blockquote><p>It’s true, there is a saying among Hapas that if you want to know if a hapa boy’s father is Asian or White, all you have to do is throw a football at him. Loser white fathers don’t tend to produce boys who can catch. A suboptimal result of the sort the author is describing is not a surprise when low-quality WMAF pairs get together. But what about when WMAF pairs of high-quality <a href=\"https://firstsportz.com/8-olympic-couples-competing-at-the-tokyo-olympics/#8_Gerek_Meinhardt_and_Lee_Kiefer\">get together</a>?</p><p>Remember, Kalergi concocted his long-term plan of genetic undermining at a time when it was assumed that Asians were weak, and the Chinese were an old and degenerate nation. Now that the Chinese have shown themselves to be both a) more strategic-minded than the Jews, and, b) martially competitive with the most powerful European militaries, what is the likely result when the most common interracial mixes are White male with Asian female instead of the intended Black male with White female?</p><p>Meanwhile, continuously siphoning off the low-quality Europeans by encouraging them to trade in their children’s genetic heritage for additional sexual market value is only going to increase the average quality of the pure Europeans who remain. I also think that the author has forgotten that one reason Scandinavian women are valued so high is that there are very few of them. There are orders of magnitude more Asian women; just as there are 10x more 150+ IQs among Christians than atheists, there are almost certainly more Asian 10s than Scandinavian 10s, even though the average Scandinavian woman is more attractive than the average Asian woman.</p><p>So, we can reasonably anticipate that one of the inevitable results of the Kalergi Plan, mass immigration, and the endless marketing of mudsharking provided by the media will be the production of two new genetic elites, one of higher-quality Europeans, and a second that is a super-subset of very high quality Eurasians that could turn out to have some of the highest-performance genetics ever produced by Man.</p><p>Which would be fittingly ironic, as Richard von Coudenhove-Kalergi was himself a high-quality Hapa.</p><p>Oft evil intent will evil mar.</p><p><em><a href=\"https://social.infogalactic.com/micropost/494a69cf-a20a-444b-88d4-6496e4c8596c\">DISCUSS ON SG</a></em></p></div>",
  "content_text": "At first glance,\nthe Kalergi plan\nfrom the early 20th century to politically unify Europe and destroy the European race through admixture with “the lesser races” might appear to be working as designed, as one Hapa’s lament for the product of White Male Asian Female couplings tends to indicate:\nOne passage that really stuck out for me in Amy Chua’s book, was her digression on yellow fever. She acknowledges there are a lot of skeevy WMAF couples out there, and makes a point to say that her white husband has never dated an Asian woman before. It was revealing for me to see a supposedly academic intellectual professor from Yale, writing like some Asian teen girl blogger. With the old\nmy white guy doesn’t have yellow fever\nline. WMAF has become self-aware about just how low status their coupling is, and so they often make the point of saying “my asian girl has dated Asian guys before”, “my white guy has dated white girls before”. Asian women don’t want to be part of any white country club that would let Asians in. Just by dating an Asian girl, white guys make themselves less attractive to future Asian girls. Asian girls are social poison.\nThey recognize that WMAF is overflowing with bad apples. Amy Chua would not have wanted to date a white man who dates Asian women. And yet she still wants to date a white man. To this extent she has “ruined” her future husband for future Amy Chuas. Now he wont be able to say, he has never dated an Asian woman before. WMAF is based on the opposite of the categorical imperative. Every WMAF wants to be the one exception. Yes, all other WMAFs are scum, but our WMAF is barely a WMAF. John Derbyshire is a white nationalist with a Chinese wife. And he says he would hate to live in a multicult society, in which many white men married Asians. But since he is part of a small minority, it is ok for him. WMAF is quite loudly and proudly based on hypocrisy.\nAsian women are low status. The same Columbia speed dating study that rated Asian men the least attractive, also rated Asian women the least attractive by all races of men. What? I thought Asian women were exotic and desirable, how can they also be sexual failures? If you believe EvoPsych, men and women have different sexual goals, and thus different ways to fail. A female sexual failure will not be a virgin, but she will only attract low status males. And Asian women have become legendary as the woman of choice for loser white males. This is the ultimate definition of female sexual failure, becoming the easy partner of choice for the males of lowest value. Scandinavian women are the highest status women in the world, and so they can price themselves high with radical feminism. East Asian women are the lowest status women in the world, and so to market themselves to loser white men, they have to advertise themselves as the least feminist. Sexual Coolies serving as strikebreakers against White Feminism. By being so openly desperate for the lowest white men, Asian women have destroyed their own bargaining position in the sexual market. It is impossible to drive a hard bargain when you are so obviously desperate for whiteness. Athletes are the Alpha Males of American society. And it is impossible to name a single athlete married to an Asian women. They have become the Geisha goddesses of white male losers.\nAsian women have crashed their own sexual market value, 6 March 2015\nIt’s true, there is a saying among Hapas that if you want to know if a hapa boy’s father is Asian or White, all you have to do is throw a football at him. Loser white fathers don’t tend to produce boys who can catch. A suboptimal result of the sort the author is describing is not a surprise when low-quality WMAF pairs get together. But what about when WMAF pairs of high-quality\nget together\n?\nRemember, Kalergi concocted his long-term plan of genetic undermining at a time when it was assumed that Asians were weak, and the Chinese were an old and degenerate nation. Now that the Chinese have shown themselves to be both a) more strategic-minded than the Jews, and, b) martially competitive with the most powerful European militaries, what is the likely result when the most common interracial mixes are White male with Asian female instead of the intended Black male with White female?\nMeanwhile, continuously siphoning off the low-quality Europeans by encouraging them to trade in their children’s genetic heritage for additional sexual market value is only going to increase the average quality of the pure Europeans who remain. I also think that the author has forgotten that one reason Scandinavian women are valued so high is that there are very few of them. There are orders of magnitude more Asian women; just as there are 10x more 150+ IQs among Christians than atheists, there are almost certainly more Asian 10s than Scandinavian 10s, even though the average Scandinavian woman is more attractive than the average Asian woman.\nSo, we can reasonably anticipate that one of the inevitable results of the Kalergi Plan, mass immigration, and the endless marketing of mudsharking provided by the media will be the production of two new genetic elites, one of higher-quality Europeans, and a second that is a super-subset of very high quality Eurasians that could turn out to have some of the highest-performance genetics ever produced by Man.\nWhich would be fittingly ironic, as Richard von Coudenhove-Kalergi was himself a high-quality Hapa.\nOft evil intent will evil mar.\nDISCUSS ON SG",
  "tags": [
    "history",
    "immigration",
    "science"
  ],
  "categories": [],
  "sitemap_lastmod": "2023-07-31T09:53:34+00:00"
}