{
  "url": "https://voxday.net/2023/07/27/the-capital-that-was-lost/",
  "scraped_at": "2026-01-08T14:04:04.279945",
  "title": "The Capital That Was Lost",
  "date_display": "July 27, 2023",
  "date_iso": "2023-07-27T12:53:25+00:00",
  "date_from_url": "2023-07-27",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>A commenter on Gab observes how the societal changes throughout the United States have <a href=\"https://gab.com/systemicface/posts/110785305937896208\">significantly reduced its human capital</a>:</p><blockquote class=\"wp-block-quote is-layout-flow wp-block-quote-is-layout-flow\"><p>I like to relate to my experience growing up in a small town, once a modest but prosperous mining community. By the 80s and through the 90s, the mine was long closed and economic opportunities were scant. By the 2000s, generational welfare recipients were common, except now the last vestiges of culture disappear as crime and drugs increase.</p><p>The town now serves mostly as a retirement/ bedroom community with a base of unfortunates.</p><p>I always thought that if a big employer showed up nearby, there would be a huge line for the much needed jobs. What I didn’t understand until recent years is what had really been lost: Human capital.</p><p>Now employers are hungry for people and you can’t get anyone to show up. New generations seem incapable of managing getting to work on time or at all. That’s what was lost, the culture that reinforced family, work ethic, social values. That’s human capital. Once it’s gone, it’s very hard to get back.</p></blockquote><p>This is where Generation X can, despite its tendency toward nihilism and apathy, make a real difference and give its successors an advantage. Because we don’t care about the mainstream narrative, we can reinforce the traditional family, work ethic, and social values that enhance human capital. We have the ability to teach them how to be in the society, but not of it.</p><p>Just yesterday, I explained the way business communications hierarchy worked to several members of the younger generation, and assigned them <a href=\"https://youtu.be/R4DZuE1IdkI?t=129\">to watch this scene</a> from <em>The Godfather </em>in order to help them understand how it works. Notice in particular the way the two senior subordinates, the hit man and the lawyer, as well as the rival family capo, understand immediately the major faux pas that has been committed by the undisciplined son.</p><p><em>“I have a sentimental weakness for my children, and I spoil them, as you can see. They talk when they should listen.”</em> This is the key phrase from this scene, and not the more famous <em>“Never tell anybody outside the Family what you’re thinking again.”</em> But they are both significant concepts that are part of what was the human capital of the time.</p><p>Our children and grandchildren will not pick up these things via osmosis from the mainstream culture the way we did, which is why it falls for us to preserve it by teaching them wisely and well.</p><p><em><a href=\"https://social.infogalactic.com/micropost/34fa9418-e15a-4012-a227-5222e93a5e83\">DISCUSS ON SG</a></em></p></div>",
  "content_text": "A commenter on Gab observes how the societal changes throughout the United States have\nsignificantly reduced its human capital\n:\nI like to relate to my experience growing up in a small town, once a modest but prosperous mining community. By the 80s and through the 90s, the mine was long closed and economic opportunities were scant. By the 2000s, generational welfare recipients were common, except now the last vestiges of culture disappear as crime and drugs increase.\nThe town now serves mostly as a retirement/ bedroom community with a base of unfortunates.\nI always thought that if a big employer showed up nearby, there would be a huge line for the much needed jobs. What I didn’t understand until recent years is what had really been lost: Human capital.\nNow employers are hungry for people and you can’t get anyone to show up. New generations seem incapable of managing getting to work on time or at all. That’s what was lost, the culture that reinforced family, work ethic, social values. That’s human capital. Once it’s gone, it’s very hard to get back.\nThis is where Generation X can, despite its tendency toward nihilism and apathy, make a real difference and give its successors an advantage. Because we don’t care about the mainstream narrative, we can reinforce the traditional family, work ethic, and social values that enhance human capital. We have the ability to teach them how to be in the society, but not of it.\nJust yesterday, I explained the way business communications hierarchy worked to several members of the younger generation, and assigned them\nto watch this scene\nfrom\nThe Godfather\nin order to help them understand how it works. Notice in particular the way the two senior subordinates, the hit man and the lawyer, as well as the rival family capo, understand immediately the major faux pas that has been committed by the undisciplined son.\n“I have a sentimental weakness for my children, and I spoil them, as you can see. They talk when they should listen.”\nThis is the key phrase from this scene, and not the more famous\n“Never tell anybody outside the Family what you’re thinking again.”\nBut they are both significant concepts that are part of what was the human capital of the time.\nOur children and grandchildren will not pick up these things via osmosis from the mainstream culture the way we did, which is why it falls for us to preserve it by teaching them wisely and well.\nDISCUSS ON SG",
  "tags": [
    "Baby Boomers",
    "decline and fall",
    "economics"
  ],
  "categories": [],
  "sitemap_lastmod": "2023-07-27T12:53:26+00:00"
}