{
  "url": "https://voxday.net/2023/07/22/the-appetizer-ate-them/",
  "scraped_at": "2026-01-08T14:03:39.854985",
  "title": "The Appetizer Ate Them",
  "date_display": "July 22, 2023",
  "date_iso": "2023-07-22T21:54:52+00:00",
  "date_from_url": "2023-07-22",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>I’ve been reading the memoirs of Giorgy Zhukov, the Soviet general who was part of the Supreme Command Staff of the Soviet Union during WWII. I’ll put up more posts in the future about some of the notes and observations I’ve made while reading them, but <a href=\"https://bigserge.substack.com/p/death-trap-on-the-volga-stalingrad\">this article by Big Serge</a> points to something I keep noticing again and again, which is the similarity between the false assumptions of the Nazi command staff and the false assumptions of the NATO command staff.</p><blockquote class=\"wp-block-quote is-layout-flow wp-block-quote-is-layout-flow\"><p>We must strongly note (for this is of great importance) that in early 1942, much of Wehrmacht leadership still believed that the war with the Soviet Union was a sort of appetizer, which would be won as a preliminary condition for waging a global war with the Anglo-Americans. The land war in the east, in other words, was something that needed to be resolved so that Germany could be freed to wage a full strategic defense of Europe by land, sea, and air – using the resources of the defeated Soviet Union to power this long war effort.</p><p>This, of course, demonstrates that Germany was asking the wrong questions and thinking about the wrong problems. They were concerned with bringing a resolution in the east so they could move on to the (as they saw it) bigger problem of contesting Anglo-American global hegemony. They did not yet seem to realize that they were being defeated outright in the east. So eager were they to move on to the main course, they did not see that the appetizer was eating them.</p></blockquote><p>As I have repeatedly stated, WWIII appears to be a remake of WWII, only with the USA playing the part of Germany, Europe playing the part of Italy, the UK and the Commonwealth playing the part of Japan. Russia is the Soviet Union, while China is the USA.</p><p>And like the Nazis before them, NATO is asking the wrong questions and thinking about the wrong problems. They’re already trying to pivot to war with China while they are losing the war with Russia.</p><p><em><a href=\"https://social.infogalactic.com/micropost/532dc86f-78a2-4dc6-8eed-526b01272d37\">DISCUSS ON SG</a></em></p></div>",
  "content_text": "I’ve been reading the memoirs of Giorgy Zhukov, the Soviet general who was part of the Supreme Command Staff of the Soviet Union during WWII. I’ll put up more posts in the future about some of the notes and observations I’ve made while reading them, but\nthis article by Big Serge\npoints to something I keep noticing again and again, which is the similarity between the false assumptions of the Nazi command staff and the false assumptions of the NATO command staff.\nWe must strongly note (for this is of great importance) that in early 1942, much of Wehrmacht leadership still believed that the war with the Soviet Union was a sort of appetizer, which would be won as a preliminary condition for waging a global war with the Anglo-Americans. The land war in the east, in other words, was something that needed to be resolved so that Germany could be freed to wage a full strategic defense of Europe by land, sea, and air – using the resources of the defeated Soviet Union to power this long war effort.\nThis, of course, demonstrates that Germany was asking the wrong questions and thinking about the wrong problems. They were concerned with bringing a resolution in the east so they could move on to the (as they saw it) bigger problem of contesting Anglo-American global hegemony. They did not yet seem to realize that they were being defeated outright in the east. So eager were they to move on to the main course, they did not see that the appetizer was eating them.\nAs I have repeatedly stated, WWIII appears to be a remake of WWII, only with the USA playing the part of Germany, Europe playing the part of Italy, the UK and the Commonwealth playing the part of Japan. Russia is the Soviet Union, while China is the USA.\nAnd like the Nazis before them, NATO is asking the wrong questions and thinking about the wrong problems. They’re already trying to pivot to war with China while they are losing the war with Russia.\nDISCUSS ON SG",
  "tags": [
    "history",
    "Russia",
    "war"
  ],
  "categories": [],
  "sitemap_lastmod": "2023-07-22T21:54:54+00:00"
}