{
  "url": "https://voxday.net/2023/07/24/the-etymology-of-yahweh/",
  "scraped_at": "2026-01-08T14:03:48.241682",
  "title": "The Etymology of “Yahweh”",
  "date_display": "July 24, 2023",
  "date_iso": "2023-07-24T13:14:53+00:00",
  "date_from_url": "2023-07-24",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>This is <a href=\"https://threadreaderapp.com/thread/1681719103071846400\">an educational dive</a> into the way modern Christianity has been infiltrated and influenced by non-Christian parties, in this particular case, by a pair of Enlightenment-era etymologists.</p><blockquote class=\"wp-block-quote is-layout-flow wp-block-quote-is-layout-flow\"><p>Have you ever heard someone refer to God as “Yahweh”? That’s just the English for His revealed name in the OT, right? That must mean it’s the ancient Christian practice!</p><p>Let’s look at the genealogy of this one, because it is wild. N.b. this thread is <em>not</em> about “the secret name of God,” or YHWH, or Jehovah, or vowel pointing, or any other such debate. It is solely focused how &amp; when the six letters “Yahweh” came into common use in English.</p><p>A friend asked this week whether a CPH commentary that insists on translating Lord as “Yahweh” is subversive. My first instinct was “yes, absolutely.” But what do I know? So I turned next to Google Ngrams, which searches over 8M books going back centuries. Ngrams shows just what I imagined: the term was invented in the last two centuries, and took off in popularity very recently. Neither of these are what you want to see when you’re considering sound doctrine. An unchanging God does not engender fickle beliefs.</p><p>Ngrams also lets you drill down to any date range to see precisely which hits are represented on the graph. After some spelunking, metadata errors, lots more googling, and hours of reading original source material, here is how we were tricked into saying “Yahweh”.</p><p>For thousands of years, there has been debate over the pronunciation of “YHWH”–the name “I am” which God gave Himself from the burning bush in Exodus 3. Written Hebrew of course has no vowels, so with only the text, there are numerous possibilities for any consonant set. “Jehovah” itself is one such made-up word, which deliberately transposes the vowel sounds from “Adonai” onto the consonants in “YHWH”. While the intention at the time was pious, it is highly relevant that no such thing was done in Jesus’ day.</p><p>The Greek Septuagint (LXX) is the Old Testament that was commonly used in Jesus’ day. Hebrew was already a dead language in the 1st century, meaning it was no longer spoken conversationally and most couldn’t read it. Jesus quotes the LXX, as does the NT hundreds of times.</p><p>So it is relevant how the LXX treats the YHWH “I am”. What we find is that the word is simply and naturally translated “ego eimi”–”I am”. The 4th century Latin Vulgate also faithfully translates it simply as “ego sum”. Zero interest in it as a proper name, vs. a declaration.</p><p>This fact is crucial to the question because it ties directly to Christ’s Divinity. When Jesus said, “Before Abraham was I am” He said <em>ego eimi</em>, and the jews tried to murder Him on the spot for blasphemy. He didn’t use some special Hebrew utterance, but “I am”–God’s Name.</p><p>For over 14 centuries, every Christian believed that God’s revealed name to Moses was “I am”.</p></blockquote><p>I’m neither a theologian nor an etymologist. But I am an <em>exemplaragnitorian </em>with a respectable track record for correctly sniffing out both bullshit and sulfur. And all the fake Hebrewisms that some Christians like to sling around with pious abandon have always struck me as redolent of both, so it doesn’t surprise me in the slightest to learn that “Yahweh” is an Enlightenment-era construction.</p><p><strong>UPDATE: </strong>a thematically-related article that takes the position that <a href=\"https://butler-harris.org/archives/1815\">the use of “Yahweh” is dishonest</a>.</p><p><em>Over the last generation, most American clerics have switched to pronouncing the divine name as Yahweh. I want to make the case that this is dishonest at several levels. First, few can even give a cogent summary of the reasons why Yahweh is to be preferred to Jehovah even though willing to disrupt the tradition over it. I am confident of this because even at the august Westminster Seminary, I caught three professors in the Hebrew OT department out of class and asked why we should say Yahweh. Two of them waved me off to “look it up.” The third, the only one to have an earned PhD from Harvard, said that Jehovah was an entirely possible way the tetragrammaton was pronounced; he used Yahweh as a disruptive mechanism, to shake people out of their comfort zone</em>.</p><p><em><a href=\"https://social.infogalactic.com/micropost/2744670a-b7a6-4093-8666-db75aa0125c7\">DISCUSS ON SG</a></em></p></div>",
  "content_text": "This is\nan educational dive\ninto the way modern Christianity has been infiltrated and influenced by non-Christian parties, in this particular case, by a pair of Enlightenment-era etymologists.\nHave you ever heard someone refer to God as “Yahweh”? That’s just the English for His revealed name in the OT, right? That must mean it’s the ancient Christian practice!\nLet’s look at the genealogy of this one, because it is wild. N.b. this thread is\nnot\nabout “the secret name of God,” or YHWH, or Jehovah, or vowel pointing, or any other such debate. It is solely focused how & when the six letters “Yahweh” came into common use in English.\nA friend asked this week whether a CPH commentary that insists on translating Lord as “Yahweh” is subversive. My first instinct was “yes, absolutely.” But what do I know? So I turned next to Google Ngrams, which searches over 8M books going back centuries. Ngrams shows just what I imagined: the term was invented in the last two centuries, and took off in popularity very recently. Neither of these are what you want to see when you’re considering sound doctrine. An unchanging God does not engender fickle beliefs.\nNgrams also lets you drill down to any date range to see precisely which hits are represented on the graph. After some spelunking, metadata errors, lots more googling, and hours of reading original source material, here is how we were tricked into saying “Yahweh”.\nFor thousands of years, there has been debate over the pronunciation of “YHWH”–the name “I am” which God gave Himself from the burning bush in Exodus 3. Written Hebrew of course has no vowels, so with only the text, there are numerous possibilities for any consonant set. “Jehovah” itself is one such made-up word, which deliberately transposes the vowel sounds from “Adonai” onto the consonants in “YHWH”. While the intention at the time was pious, it is highly relevant that no such thing was done in Jesus’ day.\nThe Greek Septuagint (LXX) is the Old Testament that was commonly used in Jesus’ day. Hebrew was already a dead language in the 1st century, meaning it was no longer spoken conversationally and most couldn’t read it. Jesus quotes the LXX, as does the NT hundreds of times.\nSo it is relevant how the LXX treats the YHWH “I am”. What we find is that the word is simply and naturally translated “ego eimi”–”I am”. The 4th century Latin Vulgate also faithfully translates it simply as “ego sum”. Zero interest in it as a proper name, vs. a declaration.\nThis fact is crucial to the question because it ties directly to Christ’s Divinity. When Jesus said, “Before Abraham was I am” He said\nego eimi\n, and the jews tried to murder Him on the spot for blasphemy. He didn’t use some special Hebrew utterance, but “I am”–God’s Name.\nFor over 14 centuries, every Christian believed that God’s revealed name to Moses was “I am”.\nI’m neither a theologian nor an etymologist. But I am an\nexemplaragnitorian\nwith a respectable track record for correctly sniffing out both bullshit and sulfur. And all the fake Hebrewisms that some Christians like to sling around with pious abandon have always struck me as redolent of both, so it doesn’t surprise me in the slightest to learn that “Yahweh” is an Enlightenment-era construction.\nUPDATE:\na thematically-related article that takes the position that\nthe use of “Yahweh” is dishonest\n.\nOver the last generation, most American clerics have switched to pronouncing the divine name as Yahweh. I want to make the case that this is dishonest at several levels. First, few can even give a cogent summary of the reasons why Yahweh is to be preferred to Jehovah even though willing to disrupt the tradition over it. I am confident of this because even at the august Westminster Seminary, I caught three professors in the Hebrew OT department out of class and asked why we should say Yahweh. Two of them waved me off to “look it up.” The third, the only one to have an earned PhD from Harvard, said that Jehovah was an entirely possible way the tetragrammaton was pronounced; he used Yahweh as a disruptive mechanism, to shake people out of their comfort zone\n.\nDISCUSS ON SG",
  "tags": [
    "Christianity",
    "history"
  ],
  "categories": [],
  "sitemap_lastmod": "2023-07-24T14:01:50+00:00"
}