{
  "url": "https://voxday.net/2023/07/30/the-final-phase/",
  "scraped_at": "2026-01-08T14:04:25.996662",
  "title": "The Final Phase",
  "date_display": "July 30, 2023",
  "date_iso": "2023-07-30T23:14:49+00:00",
  "date_from_url": "2023-07-30",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>Col Douglas Macgregor believes the Ukrainian Army is breaking down and that the war, at least in its current form, <a href=\"https://www.youtube.com/watch?v=eH9pusOf9Kg&amp;t=6s\">is in its final phase</a>.</p><blockquote class=\"wp-block-quote is-layout-flow wp-block-quote-is-layout-flow\"><p>I think the Ukrainians have lost probably somewhere between 300,000 and 350,000 dead on the battlefield. How many wounded is anybody’s guess, at this stage all we know is that the hospitals are full, there’s no room left. The Ukrainian Army is having great difficulty evacuating wounded in many cases.</p><p>I think the Ukrainian Army itself is breaking down. Many units have simply melted away. Some have gone over to the Russians, not because they wanted to join the Russians, but they said, look, you know, we’ve got very little ammunition left, we’ve got lots of wounded. We’ve contacted our superiors, they say<br/>they can’t evacuate us so we’re going to surrender. Yeah, I think we’ve almost reached the end game,<br/>we’re certainly in the final phase of this war.</p></blockquote><p>Assuming that Macgregor is reasonably correct, the question is whether the neoclowns double down and send in the Polish Army as well as whatever US forces it can muster, or whether they’ll take the best deal they can get from Putin before pivoting to take on China. The latter is looking more and more likely; <a href=\"https://spectator.org/edward-luttwak-the-u-s-must-end-the-russia-ukraine-war/\">the bat signal has observably gone out</a> and the media has already begun the unwieldy process of making a 180-degree narrative shift:</p><blockquote class=\"wp-block-quote is-layout-flow wp-block-quote-is-layout-flow\"><blockquote class=\"wp-block-quote is-layout-flow wp-block-quote-is-layout-flow\"><p>When Edward Luttwak speaks, world leaders listen — and now they must consider heeding his advice on Ukraine. Luttwak has been advising world leaders, including U.S. presidents, since the 1980s…</p><p>Luttwak believes that despite all the talk in Washington and in other Western capitals about “unwavering support” for Ukraine, Western leaders, including President Joe Biden, seek a negotiated settlement with Russia. The much-anticipated Ukrainian offensive has stalled. Russia’s government survived a scare by the Wagner Group, and its troops are fighting better now than in the first year of the war. Historically, “when Russia goes to war they always mess up” at first, Luttwak says, but “as the war goes on Russians fight better,” and that is what is happening now. Top U.S. officials, like CIA Director William J. Burns, recognize this fact and have advised Biden accordingly, which is why Biden poured cold water on the Ukraine-in-NATO suggestion. Putin, Luttwak noted, has also publicly pulled back from the “nuclear threat” in a signal to Ukraine and the U.S. that a negotiated solution is possible.</p><p>Luttwak also contends that Ukraine’s leaders also know that a negotiated peace is the most realistic scenario for ending the war. U.S. leaders, according to Luttwak, want a Russia–Ukraine settlement precisely because of the more significant geopolitical threat of China in the western Pacific. This is in line with what former Pentagon official Elbridge Colby has suggested.</p> <cite>Edward Luttwak: The U.S. Must End the Russia–Ukraine War, THE AMERICAN SPECTATOR, 28 July 2023</cite></blockquote></blockquote><p>More about this anon. I’ve been reading a collection of pre-2001 essays edited by Robert Kagan, and ironically enough, it appears that thanks in large part to his wife, the neoclowns have inadvertently managed to bring about the very thing they most feared, a strong geostrategic alliance between Russia and China.</p><p><em><a href=\"https://social.infogalactic.com/micropost/09f21b59-9820-4df2-9cf1-a63559b3c414\">DISCUSS ON SG</a></em></p></div>",
  "content_text": "Col Douglas Macgregor believes the Ukrainian Army is breaking down and that the war, at least in its current form,\nis in its final phase\n.\nI think the Ukrainians have lost probably somewhere between 300,000 and 350,000 dead on the battlefield. How many wounded is anybody’s guess, at this stage all we know is that the hospitals are full, there’s no room left. The Ukrainian Army is having great difficulty evacuating wounded in many cases.\nI think the Ukrainian Army itself is breaking down. Many units have simply melted away. Some have gone over to the Russians, not because they wanted to join the Russians, but they said, look, you know, we’ve got very little ammunition left, we’ve got lots of wounded. We’ve contacted our superiors, they say\nthey can’t evacuate us so we’re going to surrender. Yeah, I think we’ve almost reached the end game,\nwe’re certainly in the final phase of this war.\nAssuming that Macgregor is reasonably correct, the question is whether the neoclowns double down and send in the Polish Army as well as whatever US forces it can muster, or whether they’ll take the best deal they can get from Putin before pivoting to take on China. The latter is looking more and more likely;\nthe bat signal has observably gone out\nand the media has already begun the unwieldy process of making a 180-degree narrative shift:\nWhen Edward Luttwak speaks, world leaders listen — and now they must consider heeding his advice on Ukraine. Luttwak has been advising world leaders, including U.S. presidents, since the 1980s…\nLuttwak believes that despite all the talk in Washington and in other Western capitals about “unwavering support” for Ukraine, Western leaders, including President Joe Biden, seek a negotiated settlement with Russia. The much-anticipated Ukrainian offensive has stalled. Russia’s government survived a scare by the Wagner Group, and its troops are fighting better now than in the first year of the war. Historically, “when Russia goes to war they always mess up” at first, Luttwak says, but “as the war goes on Russians fight better,” and that is what is happening now. Top U.S. officials, like CIA Director William J. Burns, recognize this fact and have advised Biden accordingly, which is why Biden poured cold water on the Ukraine-in-NATO suggestion. Putin, Luttwak noted, has also publicly pulled back from the “nuclear threat” in a signal to Ukraine and the U.S. that a negotiated solution is possible.\nLuttwak also contends that Ukraine’s leaders also know that a negotiated peace is the most realistic scenario for ending the war. U.S. leaders, according to Luttwak, want a Russia–Ukraine settlement precisely because of the more significant geopolitical threat of China in the western Pacific. This is in line with what former Pentagon official Elbridge Colby has suggested.\nEdward Luttwak: The U.S. Must End the Russia–Ukraine War, THE AMERICAN SPECTATOR, 28 July 2023\nMore about this anon. I’ve been reading a collection of pre-2001 essays edited by Robert Kagan, and ironically enough, it appears that thanks in large part to his wife, the neoclowns have inadvertently managed to bring about the very thing they most feared, a strong geostrategic alliance between Russia and China.\nDISCUSS ON SG",
  "tags": [
    "neoclowns",
    "Russia",
    "war"
  ],
  "categories": [],
  "sitemap_lastmod": "2023-07-30T23:14:52+00:00"
}