{
  "url": "https://voxday.net/2005/08/25/amanda-buries-herself-too/",
  "scraped_at": "2026-01-08T20:13:15.830555",
  "title": "Amanda buries herself too",
  "date_display": "August 25, 2005",
  "date_iso": "2005-08-25T07:36:00+00:00",
  "date_from_url": "2005-08-25",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><blockquote><p>This is the most pathetic bit of rationalizing I’ve seen in a long time. For fuck’s sake, first we pretend Nazis were left-wingers and what next? Holocaust denial?</p></blockquote><p>The Left has a tendency to twist its tiny little maleducated minds around vicious circles.  If the Marxian Communists represent the left wing and the National Socialists the right, that political spectrum cannot explain anything from Burkean conservatism to Misean libertarianism.</p><p>What they are describing is, in fact, the political spectrum of the leftmost half of the Left wing.  Where do the Fascists fit, for example, in between National Socialists and Communists?  They don’t.  Amanda’s mention of the Holocaust reflects the typical left-liberal’s belief that being racist is an inherently right-wing phenomenon.  It would be interesting to know how she would explain these quotes from an anti-semitist and an anti-bourgeois:</p><p><em>“Let us consider the actual, worldly Jew — not the Sabbath Jew, as Bauer does, but the everyday Jew. Let us not look for the secret of the Jew in his religion, but let us look for the secret of his religion in the real Jew. What is the secular basis of Judaism? Practical need, self-interest. What is the worldly religion of the Jew? Huckstering. What is his worldly God? Money. Very well then! Emancipation from huckstering and money, consequently from practical, real Jewry, would be the self-emancipation of our time…. We recognize in Jewry, therefore, a general present-time-oriented anti-social element, an element which through historical development — to which in this harmful respect the Jews have zealously contributed — has been brought to its present high level, at which it must necessarily dissolve itself. In the final analysis, the emancipation of the Jews is the emancipation of mankind from Jewry”.</em> – Karl Marx</p><p><em>The bourgeois is about to leave the historical stage. In its place will come the class of productive workers, the working class, that has been up until today oppressed. It is beginning to fulfill its political mission. It is involved in a hard and bitter struggle for political power as it seeks to become part of the national organism. The battle began in the economic realm; it will finish in the political. It is not merely a matter of pay, not only a matter of the number of hours worked in a day-though we may never forget that these are an essential, perhaps even the most significant part of the socialist platform-but it is much more a matter of incorporating a powerful and responsible class in the state, perhaps even to make it the dominant force in the future politics of the Fatherland.</em> – Joseph Goebbels</p><p>It’s worth noting that the concept on the historical inevitability of bourgeois decline is an overtly Marxist one.</p></div>",
  "content_text": "This is the most pathetic bit of rationalizing I’ve seen in a long time. For fuck’s sake, first we pretend Nazis were left-wingers and what next? Holocaust denial?\nThe Left has a tendency to twist its tiny little maleducated minds around vicious circles.  If the Marxian Communists represent the left wing and the National Socialists the right, that political spectrum cannot explain anything from Burkean conservatism to Misean libertarianism.\nWhat they are describing is, in fact, the political spectrum of the leftmost half of the Left wing.  Where do the Fascists fit, for example, in between National Socialists and Communists?  They don’t.  Amanda’s mention of the Holocaust reflects the typical left-liberal’s belief that being racist is an inherently right-wing phenomenon.  It would be interesting to know how she would explain these quotes from an anti-semitist and an anti-bourgeois:\n“Let us consider the actual, worldly Jew — not the Sabbath Jew, as Bauer does, but the everyday Jew. Let us not look for the secret of the Jew in his religion, but let us look for the secret of his religion in the real Jew. What is the secular basis of Judaism? Practical need, self-interest. What is the worldly religion of the Jew? Huckstering. What is his worldly God? Money. Very well then! Emancipation from huckstering and money, consequently from practical, real Jewry, would be the self-emancipation of our time…. We recognize in Jewry, therefore, a general present-time-oriented anti-social element, an element which through historical development — to which in this harmful respect the Jews have zealously contributed — has been brought to its present high level, at which it must necessarily dissolve itself. In the final analysis, the emancipation of the Jews is the emancipation of mankind from Jewry”.\n– Karl Marx\nThe bourgeois is about to leave the historical stage. In its place will come the class of productive workers, the working class, that has been up until today oppressed. It is beginning to fulfill its political mission. It is involved in a hard and bitter struggle for political power as it seeks to become part of the national organism. The battle began in the economic realm; it will finish in the political. It is not merely a matter of pay, not only a matter of the number of hours worked in a day-though we may never forget that these are an essential, perhaps even the most significant part of the socialist platform-but it is much more a matter of incorporating a powerful and responsible class in the state, perhaps even to make it the dominant force in the future politics of the Fatherland.\n– Joseph Goebbels\nIt’s worth noting that the concept on the historical inevitability of bourgeois decline is an overtly Marxist one.",
  "tags": [],
  "categories": [],
  "sitemap_lastmod": "2005-08-25T06:36:00+00:00"
}