{
  "url": "https://voxday.net/2005/08/24/anytime-baby/",
  "scraped_at": "2026-01-08T20:13:10.275966",
  "title": "Anytime, baby",
  "date_display": "August 24, 2005",
  "date_iso": "2005-08-24T17:32:00+00:00",
  "date_from_url": "2005-08-24",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>Jesse <a href=\"http://www.pandagon.net/archives/2005/08/fascism_is_soci.html\">wants to go</a>:</p><blockquote><p>Fascism is an offshoot of Marxian socialism like pro-lifers are an offshoot of the pro-choice movement. Fascism and Nazism were explicitly anti-socialist, anti-Communist doctrines that promoted doctrines of unified nations across class strata to compete with the class-struggle propoganda of socialist theory. The nascent fascist movement was, in fact, filled with former socialists who turned their back on socialism. (Think David Horowitz, but capable of writing more than one book.) It was, at best, a repudiation and address of socialism’s flaws, but it was expressly an anti-socialist movement.</p><p>As I can see Vox’s blog is filled with continual whining that nobody provides facts to combat his halfassed thoughts, I simply leave him with these quotes of Mussolini’s, and ask him to rectify it without making a total idiot of himself:</p><p><em>“Socialism is a fraud, a comedy, a phantom, a blackmail.  The Liberal State is a mask behind which there is no face; it is a scaffolding behind which there is no building.</em></p><p>Let’s go, son. I ain’t got all day.</p></blockquote><p>I assume Jesse is referring to Benito Mussolini, member of the National Executive Committee of the Italian Socialist Party and editor of the socialist party’s newspaper, from 1912 to 1914.  David Ramsay Steele notes: <em>Mussolini’s election to the Executive was part of the capture of control of the Socialist Party by the hard-line Marxist left, with the expulsion from the Party of those deputies  considered too conciliatory to the bourgeoisie. The shift in Socialist Party control was greeted with delight by Lenin and other revolutionaries throughout the world.</em></p><p>From 1912 to 1914, Mussolini was the Che Guevara of his day, a living saint of leftism. Handsome, courageous, charismatic, an erudite Marxist, a riveting speaker and writer, a dedicated class warrior to the core, he was the peerless duce of the Italian Left.  In 1913, while still editor of Avanti!, he began to publish and edit his own journal, Utopia, a forum for controversial discussion among leftwing socialists. Like many such socialist journals founded in hope, it aimed to create a highly-educated cadre of revolutionaries, purged of dogmatic illusions, ready to seize the moment. Two of those who collaborated with Mussolini on Utopia would go on to help found the Italian Communist Party and one to help found the German Communist Party. Others, with Mussolini, would found the Fascist movement.</p><p>Like Hitler, Mussolini was a much more intelligent man than Marx, and both men recognized some of the more fundamental flaws in Marx’s approach to socialism.  Contrary to what individuals like Jesse appear to believe, Marxism is not socialism, it is merely the most famous subset of it.  Marx himself bitterly attacked the Fabians, and Mussolini’s numerous attacks on socialism and socialists were primarily rooted in his political opposition to the Italian party from whence he sprang, not from complete ideological opposition.</p><p>In the same way, his attack on the Liberal state is an attack on the concept of the classical liberal, which in modern terms is known as a conservative.  In support of this point, I note that the Partito Liberale Italiano was the right-wing conservative party banned by Mussolini in 1926.</p><p>Mussolini’s split with the Socialist Party was not a major ideological one, but a political one based solely on the question of Italian participation in WWI.  And as long as Jesse likes quotes, consider Mussolini’s signature slogan: <em>Tutto nello Stato, niente al di fuori dello Stato, nulla contro lo Stato</em>. “Everything in the State, nothing outside the State, nothing against the State.”</p><p>Does that sound more like Kirk, Burke, von Hayek, and Mises, or more like Marx, Lenin, Stalin and Mao?  Perhaps more definitive is to examine the hallmark of Mussolini’s program, the <a href=\"http://www.voxday.net/archive/2004/062804.html\">Manifesto of the Fascist Struggle</a>, wherein Mussolini lays out a program of:</p><p>1. Universal suffrage<br>2. Progressive taxation and wealth expropriation<br>3. Government seizure of all church property<br>4. Government seizure of the transportation and arms factories<br>5. A Soviet-style industrial council with members elected by unions<br>6. A minimum wage and an 8-hour workday<br>7. Social security (at 55)<br>8. Union representation on corporate boards.</br></br></br></br></br></br></br></p><p>Fascism truly was, as the original fascists billed it, a Third Way, an attempt to create a workable compromise between dysfunctional communism and functioning capitalism that would allow an elite to maintain a stable one-party rule.  Its heirs in Europe even use the same term to describe their policies now, although it is the Chinese Communists who most closely approximate historical fascism today; perhaps fifty years from now, Jesse’s intellectual kindred will be denying that whatever the corporatist Chinese system comes to be known as is an offshoot of Maoist communism.  But it is undeniable that Fascism’s roots lay entirely in the Left and it is properly described as an offshoot of Marxian socialism, not Fabianism or any other socialism, much less conservatism, capitalism or classical liberalism.</p><p>In <a href=\"http://www.la-articles.org.uk/fascism.htm\">his exhaustive summary</a>, Ramsay finally concludes: <em>Fascism began as a revision of Marxism by Marxists, a revision which developed in successive stages, so that these Marxists gradually stopped thinking of themselves as Marxists, and eventually stopped thinking of themselves as socialists. They never stopped thinking of themselves as anti-liberal revolutionaries.</em></p></div>",
  "content_text": "Jesse\nwants to go\n:\nFascism is an offshoot of Marxian socialism like pro-lifers are an offshoot of the pro-choice movement. Fascism and Nazism were explicitly anti-socialist, anti-Communist doctrines that promoted doctrines of unified nations across class strata to compete with the class-struggle propoganda of socialist theory. The nascent fascist movement was, in fact, filled with former socialists who turned their back on socialism. (Think David Horowitz, but capable of writing more than one book.) It was, at best, a repudiation and address of socialism’s flaws, but it was expressly an anti-socialist movement.\nAs I can see Vox’s blog is filled with continual whining that nobody provides facts to combat his halfassed thoughts, I simply leave him with these quotes of Mussolini’s, and ask him to rectify it without making a total idiot of himself:\n“Socialism is a fraud, a comedy, a phantom, a blackmail.  The Liberal State is a mask behind which there is no face; it is a scaffolding behind which there is no building.\nLet’s go, son. I ain’t got all day.\nI assume Jesse is referring to Benito Mussolini, member of the National Executive Committee of the Italian Socialist Party and editor of the socialist party’s newspaper, from 1912 to 1914.  David Ramsay Steele notes:\nMussolini’s election to the Executive was part of the capture of control of the Socialist Party by the hard-line Marxist left, with the expulsion from the Party of those deputies  considered too conciliatory to the bourgeoisie. The shift in Socialist Party control was greeted with delight by Lenin and other revolutionaries throughout the world.\nFrom 1912 to 1914, Mussolini was the Che Guevara of his day, a living saint of leftism. Handsome, courageous, charismatic, an erudite Marxist, a riveting speaker and writer, a dedicated class warrior to the core, he was the peerless duce of the Italian Left.  In 1913, while still editor of Avanti!, he began to publish and edit his own journal, Utopia, a forum for controversial discussion among leftwing socialists. Like many such socialist journals founded in hope, it aimed to create a highly-educated cadre of revolutionaries, purged of dogmatic illusions, ready to seize the moment. Two of those who collaborated with Mussolini on Utopia would go on to help found the Italian Communist Party and one to help found the German Communist Party. Others, with Mussolini, would found the Fascist movement.\nLike Hitler, Mussolini was a much more intelligent man than Marx, and both men recognized some of the more fundamental flaws in Marx’s approach to socialism.  Contrary to what individuals like Jesse appear to believe, Marxism is not socialism, it is merely the most famous subset of it.  Marx himself bitterly attacked the Fabians, and Mussolini’s numerous attacks on socialism and socialists were primarily rooted in his political opposition to the Italian party from whence he sprang, not from complete ideological opposition.\nIn the same way, his attack on the Liberal state is an attack on the concept of the classical liberal, which in modern terms is known as a conservative.  In support of this point, I note that the Partito Liberale Italiano was the right-wing conservative party banned by Mussolini in 1926.\nMussolini’s split with the Socialist Party was not a major ideological one, but a political one based solely on the question of Italian participation in WWI.  And as long as Jesse likes quotes, consider Mussolini’s signature slogan:\nTutto nello Stato, niente al di fuori dello Stato, nulla contro lo Stato\n. “Everything in the State, nothing outside the State, nothing against the State.”\nDoes that sound more like Kirk, Burke, von Hayek, and Mises, or more like Marx, Lenin, Stalin and Mao?  Perhaps more definitive is to examine the hallmark of Mussolini’s program, the\nManifesto of the Fascist Struggle\n, wherein Mussolini lays out a program of:\n1. Universal suffrage\n2. Progressive taxation and wealth expropriation\n3. Government seizure of all church property\n4. Government seizure of the transportation and arms factories\n5. A Soviet-style industrial council with members elected by unions\n6. A minimum wage and an 8-hour workday\n7. Social security (at 55)\n8. Union representation on corporate boards.\nFascism truly was, as the original fascists billed it, a Third Way, an attempt to create a workable compromise between dysfunctional communism and functioning capitalism that would allow an elite to maintain a stable one-party rule.  Its heirs in Europe even use the same term to describe their policies now, although it is the Chinese Communists who most closely approximate historical fascism today; perhaps fifty years from now, Jesse’s intellectual kindred will be denying that whatever the corporatist Chinese system comes to be known as is an offshoot of Maoist communism.  But it is undeniable that Fascism’s roots lay entirely in the Left and it is properly described as an offshoot of Marxian socialism, not Fabianism or any other socialism, much less conservatism, capitalism or classical liberalism.\nIn\nhis exhaustive summary\n, Ramsay finally concludes:\nFascism began as a revision of Marxism by Marxists, a revision which developed in successive stages, so that these Marxists gradually stopped thinking of themselves as Marxists, and eventually stopped thinking of themselves as socialists. They never stopped thinking of themselves as anti-liberal revolutionaries.",
  "tags": [],
  "categories": [],
  "sitemap_lastmod": "2005-08-24T16:32:00+00:00"
}