{
  "url": "https://voxday.net/2005/08/09/batting-practice/",
  "scraped_at": "2026-01-08T20:11:11.079336",
  "title": "Batting practice",
  "date_display": "August 9, 2005",
  "date_iso": "2005-08-09T17:22:00+00:00",
  "date_from_url": "2005-08-09",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>Lisa Lisa tickles her tonsils with her toes:</p><blockquote><p>Yes. It’s defintely the influx of WOMEN into the workforce that casued this low ‘real wage’. It’s not:</p><p>a) the exponential increase in child births<br>b ) the exponential influx of immigrants (both legal and illegal)<br>c) the increase in the retirement age, thus putting exponential increases of people working later in life in the work force<br>d) the exponential growth of corporations in this country<br>e) drops in economy because of exponential offshoring of jobs</br></br></br></br></p><p>Jesus….for a woman….I just made this guy look like an idiot. I better get back in the kitchen. What are these shoes doing on my feet?</p></blockquote><p>Let’s deal with this intelligent, liberated woman’s points one at a time, shall we?</p><p>a)  US <a href=\"http://www.infoplease.com/ipa/A0005067.html\">birth rate 1970: 18.4</a>.  US birth rate 2004: 14.1.  It would appear that Lisa Lisa is making use of a hitherto unknown usage of the term “exponential increase”.</p><p>b)  Immigrants increase consumption demand as well as labor supply.  This mitigates their impact on labor pricing.  Domestic women, already being consumers, can only drive the price of labor down by increasing its supply.</p><p>c)  “Census and Social Security data show that between 1975 and 1990, the labor force participation rate among 55- to 64-year-olds changed differently by gender. Men’s labor force participation rate fell to 68 percent from 76 percent, while that of women rose to 45 percent from 41 percent. For women older than 65 years, the labor force participation rate rose slightly to 8.7 percent from 8.2 percent, although among men older than 65 years, it fell to 16 percent from 22 percent.”  Again, <a href=\"http://www.findarticles.com/p/articles/mi_m1153/is_9_125/ai_96306450\">Lisa Lisa has it backwards</a>.  The net effect of changes in the retirement age was beneficial to the price of labor.</p><p>d)  More corporations = less labor?  (shakes head in disbelief)</p><p>I have to go mow the lawn, so I’ll address e) in a bit, as well as provide some BLS statistics I’ve got somewhere for c) that cover the full range of years from 1972 to 2003 and make the picture more clear.</p><p>But she sure made me look stupid, didn’t she!  I don’t think it would be wise to leave this woman alone in the kitchen with sharp objects, let alone a voting booth.</p><p>UPDATE: Where were we?  Ah, yes, BLS statistics… let me see….</p><p>c)  In 1970, 83 percent of men 55-64 and 26.8 percent of 65+ men worked.  In 2000, those numbers had dropped to 67.3 percent and 17.5 percent.  Women went from 43 percent (55-64) and 9.7 percent (65+) to 51.8 percent and 9.4 percent.  As I already stated, the net effect on the price of labor was positive.</p><p>e) Globalization is a mixed bag.  Jobs go elsewhere, reducing demand for labor, but the opening of foreign markets to US products also creates demand for it.  This is Lisa Lisa’s one potentially salient point, but its net effect cannot quantified or even characterized with any degree of certainty, whereas supply/demand effects are pretty obvious.  The labor force grew from 60 percent of the population in 1970 to 67 percent in 2000, a 11.7 percent increase.  Only those completely ignorant of basic economic theory could believe that the simultaneous 16.3 percent decline in real wages is purely coincidental.</p></div>",
  "content_text": "Lisa Lisa tickles her tonsils with her toes:\nYes. It’s defintely the influx of WOMEN into the workforce that casued this low ‘real wage’. It’s not:\na) the exponential increase in child births\nb ) the exponential influx of immigrants (both legal and illegal)\nc) the increase in the retirement age, thus putting exponential increases of people working later in life in the work force\nd) the exponential growth of corporations in this country\ne) drops in economy because of exponential offshoring of jobs\nJesus….for a woman….I just made this guy look like an idiot. I better get back in the kitchen. What are these shoes doing on my feet?\nLet’s deal with this intelligent, liberated woman’s points one at a time, shall we?\na)  US\nbirth rate 1970: 18.4\n.  US birth rate 2004: 14.1.  It would appear that Lisa Lisa is making use of a hitherto unknown usage of the term “exponential increase”.\nb)  Immigrants increase consumption demand as well as labor supply.  This mitigates their impact on labor pricing.  Domestic women, already being consumers, can only drive the price of labor down by increasing its supply.\nc)  “Census and Social Security data show that between 1975 and 1990, the labor force participation rate among 55- to 64-year-olds changed differently by gender. Men’s labor force participation rate fell to 68 percent from 76 percent, while that of women rose to 45 percent from 41 percent. For women older than 65 years, the labor force participation rate rose slightly to 8.7 percent from 8.2 percent, although among men older than 65 years, it fell to 16 percent from 22 percent.”  Again,\nLisa Lisa has it backwards\n.  The net effect of changes in the retirement age was beneficial to the price of labor.\nd)  More corporations = less labor?  (shakes head in disbelief)\nI have to go mow the lawn, so I’ll address e) in a bit, as well as provide some BLS statistics I’ve got somewhere for c) that cover the full range of years from 1972 to 2003 and make the picture more clear.\nBut she sure made me look stupid, didn’t she!  I don’t think it would be wise to leave this woman alone in the kitchen with sharp objects, let alone a voting booth.\nUPDATE: Where were we?  Ah, yes, BLS statistics… let me see….\nc)  In 1970, 83 percent of men 55-64 and 26.8 percent of 65+ men worked.  In 2000, those numbers had dropped to 67.3 percent and 17.5 percent.  Women went from 43 percent (55-64) and 9.7 percent (65+) to 51.8 percent and 9.4 percent.  As I already stated, the net effect on the price of labor was positive.\ne) Globalization is a mixed bag.  Jobs go elsewhere, reducing demand for labor, but the opening of foreign markets to US products also creates demand for it.  This is Lisa Lisa’s one potentially salient point, but its net effect cannot quantified or even characterized with any degree of certainty, whereas supply/demand effects are pretty obvious.  The labor force grew from 60 percent of the population in 1970 to 67 percent in 2000, a 11.7 percent increase.  Only those completely ignorant of basic economic theory could believe that the simultaneous 16.3 percent decline in real wages is purely coincidental.",
  "tags": [],
  "categories": [],
  "sitemap_lastmod": "2005-08-09T16:22:00+00:00"
}