{
  "url": "https://voxday.net/2005/08/22/borak-sings/",
  "scraped_at": "2026-01-08T20:12:50.249257",
  "title": "Borak sings",
  "date_display": "August 22, 2005",
  "date_iso": "2005-08-22T12:07:00+00:00",
  "date_from_url": "2005-08-22",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>In my country there is problem,<br>And that problem is transport.<br>It take very very long,<br>Because Kazakhstan is big.</br></br></br></p><p>There’s <a href=\"http://www.campchaos.com/show.php?iID=866\">a video of the whole song</a>.  Borak is hilarious, as usual – so when do we make the sex? – although I think the reaction of the crowd to the cameras makes it apparent that they understand what’s going on from the start.  Contrary to the common urbanite belief that their disdain for all things country goes undetected, rural people are perfectly aware of what their big city counterparts think of them and they often play up their hickitude as a passive-agressive means of mocking their mockers.</p><p>I don’t particularly enjoy being around country folk, for the most part.  But divergent interests and grammar aside, I’ve never found them to be any less intelligent than city and suburban people, and they are often a good deal less asinine.  I may not be inclined to listen to a farmer pontificate on the merits of crop rotation, but at least he serves a honest purpose in life, which is more than I can say for the average stockbroker or real estate agent.</p><p>Attempting to derive an idea of massive anti-semitism lurking beneath the surface of the heartland from this is, I think, a significant reach on par with those alarmist predictions of Kristalnacht II being brought about by the release of The Passion.  The East Coast media that constantly wrings its hands about this sort of thing always forgets that most people in the Midwest and Southwest have not only never met a Jew, but they think no more about Jews than they do about Eskimos or Vanuatuans.</p><p>It is particularly bizarre that American Jewish leaders will get upset about movies and Merry Christmas greetings and then publicly cheer a mass Jewish expulsion and the destruction of Jewish-owned property.  As I mentioned in my column today, I rather doubt a similar action in New York City would meet with similar approbation.</p></div>",
  "content_text": "In my country there is problem,\nAnd that problem is transport.\nIt take very very long,\nBecause Kazakhstan is big.\nThere’s\na video of the whole song\n.  Borak is hilarious, as usual – so when do we make the sex? – although I think the reaction of the crowd to the cameras makes it apparent that they understand what’s going on from the start.  Contrary to the common urbanite belief that their disdain for all things country goes undetected, rural people are perfectly aware of what their big city counterparts think of them and they often play up their hickitude as a passive-agressive means of mocking their mockers.\nI don’t particularly enjoy being around country folk, for the most part.  But divergent interests and grammar aside, I’ve never found them to be any less intelligent than city and suburban people, and they are often a good deal less asinine.  I may not be inclined to listen to a farmer pontificate on the merits of crop rotation, but at least he serves a honest purpose in life, which is more than I can say for the average stockbroker or real estate agent.\nAttempting to derive an idea of massive anti-semitism lurking beneath the surface of the heartland from this is, I think, a significant reach on par with those alarmist predictions of Kristalnacht II being brought about by the release of The Passion.  The East Coast media that constantly wrings its hands about this sort of thing always forgets that most people in the Midwest and Southwest have not only never met a Jew, but they think no more about Jews than they do about Eskimos or Vanuatuans.\nIt is particularly bizarre that American Jewish leaders will get upset about movies and Merry Christmas greetings and then publicly cheer a mass Jewish expulsion and the destruction of Jewish-owned property.  As I mentioned in my column today, I rather doubt a similar action in New York City would meet with similar approbation.",
  "tags": [],
  "categories": [],
  "sitemap_lastmod": "2005-08-22T11:07:00+00:00"
}