{
  "url": "https://voxday.net/2005/08/23/doomed-to-repeat-i/",
  "scraped_at": "2026-01-08T20:12:55.745184",
  "title": "Doomed to repeat it",
  "date_display": "August 23, 2005",
  "date_iso": "2005-08-23T07:32:00+00:00",
  "date_from_url": "2005-08-23",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p><a href=\"http://www.amnation.com/vfr/archives/003960.html\">View From the Right</a> unearths an interesting article:</p><blockquote><p>Iraq is moving steadily forward towards the modern conception of the State, with a single judicial and administrative system, unaffected by considerations of religion or nationality….  The Government is endeavoring to carry out faithfully the undertakings it has given, even when these run directly counter to the long-cherished provisions of the Sharia Law. But it is not easy; it cannot be easy in the very nature of the case, for the common people quickly to adjust their minds to the new legal situation, and to eradicate from their outlook the results covering many centuries of a system which implies the superiority of Islam over the non-Moslem minority groups. The legal guarantees of liberty and equality represent the goal towards which the country is moving, rather than the expression of the present thoughts and wishes of the population. The movement, however, is in the right direction, and it may yet prove possible for Islam to disentangle religious faith from political status and privilege.<br> – S.A. Morrison, <em>Religious Liberty in Iraq</em>, Moslem World, 1935</br></p></blockquote><p>Yeah, this new constitution is going to solve everything, isn’t it.  And, as VFTR points out, this previous liberal, secular Iraqi constitution was established after a 14-year Western occupation.</p><p>I can’t imagine that the Iraqis are going to give in on either sharia or women’s rights.  Our argument about the necessity for women’s rights might have been persuasive before the West’s demographics collapsed, no doubt they are considerably less appealing to even the most Westernized Iraqi leader now that every Western country is importing massive quantities of laborers from less feminized cultures in order to keep their societies from collapsing.</p><p>If Iraq is capable of learning from American mistakes, you’d think America would be capable of learning from Britain’s.</p></div>",
  "content_text": "View From the Right\nunearths an interesting article:\nIraq is moving steadily forward towards the modern conception of the State, with a single judicial and administrative system, unaffected by considerations of religion or nationality….  The Government is endeavoring to carry out faithfully the undertakings it has given, even when these run directly counter to the long-cherished provisions of the Sharia Law. But it is not easy; it cannot be easy in the very nature of the case, for the common people quickly to adjust their minds to the new legal situation, and to eradicate from their outlook the results covering many centuries of a system which implies the superiority of Islam over the non-Moslem minority groups. The legal guarantees of liberty and equality represent the goal towards which the country is moving, rather than the expression of the present thoughts and wishes of the population. The movement, however, is in the right direction, and it may yet prove possible for Islam to disentangle religious faith from political status and privilege.\n– S.A. Morrison,\nReligious Liberty in Iraq\n, Moslem World, 1935\nYeah, this new constitution is going to solve everything, isn’t it.  And, as VFTR points out, this previous liberal, secular Iraqi constitution was established after a 14-year Western occupation.\nI can’t imagine that the Iraqis are going to give in on either sharia or women’s rights.  Our argument about the necessity for women’s rights might have been persuasive before the West’s demographics collapsed, no doubt they are considerably less appealing to even the most Westernized Iraqi leader now that every Western country is importing massive quantities of laborers from less feminized cultures in order to keep their societies from collapsing.\nIf Iraq is capable of learning from American mistakes, you’d think America would be capable of learning from Britain’s.",
  "tags": [],
  "categories": [],
  "sitemap_lastmod": "2005-08-23T06:32:00+00:00"
}