{
  "url": "https://voxday.net/2005/08/20/end-of-news/",
  "scraped_at": "2026-01-08T20:12:34.924972",
  "title": "The end of news",
  "date_display": "August 20, 2005",
  "date_iso": "2005-08-20T08:19:00+00:00",
  "date_from_url": "2005-08-20",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>Bob Costas isn’t interested in dead girls:</p><blockquote><p>While some cable TV hosts are making their living off the Natalee Holloway case this summer, Bob Costas is having none of it.  Costas, hired by CNN as an occasional fill-in on “Larry King Live,” refused to anchor Thursday’s show because it was primarily about the Alabama teenager who went missing in Aruba. Chris Pixley filled in at the last minute.</p><p>“I didn’t think the subject matter of Thursday’s show was the kind of broadcast I should be doing,” Costas said in a statement. “I suggested some alternatives but the producers preferred the topics they had chosen. I was fine with that, and respectfully declined to participate.”</p><p>Costas’ manager declined to elaborate on what Costas didn’t like about the topic.</p></blockquote><p>Bravo for Costas.  It’s interesting to see how the sports guys have better instincts for what is and is not news than the news people.  I have no sympathy for the newspapers and the cable news networks as they continue to decline.  Their business model was predicated on being the only game in town, they badly abused their position of privilege and one now derives a true sense of <em>schadenfreude</em> in watching them devolve into shallow emotional porn for barely educated women.</p><p>Missing girls and Michael Jackson.  What a fitting epitaph!</p><p>Tangentially speaking, it may surprise some of you, but I probably don’t watch more than 10 minutes worth of Fox per week, and that only because Space Bunny occasionally watches a bit of Neal Cavuto while channel-flipping.  I don’t watch O’Reilly, Hannity &amp; Colmes, I’ve never seen the shows hosted by Tucker Carlson, John Stewart or Greta van Susteren and although I’ve read his name once or twice, I have no idea what Aaron Brown looks like.  I never, ever watch CNN, MSNBC CNBC or anything else, and yet I would appear to be reasonably well-informed nevertheless.</p><p>And yet some are still wondering why I’m not desperate to appear on TV.   This is amusing, because I recently decided to stop doing radio as well – barring Malkin ever accepting my challenge to a debate on the military necessity for the WWII-era internments.  My reasoning is that while it’s possible for people to learn and modify their thinking through the two-way interaction possible on the Internet, radio is primarily a combination of preaching to the choir and dancing monkey performances, neither of which appeal to me.</p><p>I guess what it boils down to is that I refuse to waste any time on mediums that allow individuals to use the momentum inherent in the medium to skate unchallenged past their logical and factual errors.  I’d much rather spend my time doing my job, writing books and interacting with people here.  It’s so much more rewarding to receive emails telling me how someone picked up Susan Cooper’s books for the first time or has begun to delve into Austrian economics or Elliott Wave theory than it is to correct a clueless radio host on comparative coastlines or basic econ 101.</p></div>",
  "content_text": "Bob Costas isn’t interested in dead girls:\nWhile some cable TV hosts are making their living off the Natalee Holloway case this summer, Bob Costas is having none of it.  Costas, hired by CNN as an occasional fill-in on “Larry King Live,” refused to anchor Thursday’s show because it was primarily about the Alabama teenager who went missing in Aruba. Chris Pixley filled in at the last minute.\n“I didn’t think the subject matter of Thursday’s show was the kind of broadcast I should be doing,” Costas said in a statement. “I suggested some alternatives but the producers preferred the topics they had chosen. I was fine with that, and respectfully declined to participate.”\nCostas’ manager declined to elaborate on what Costas didn’t like about the topic.\nBravo for Costas.  It’s interesting to see how the sports guys have better instincts for what is and is not news than the news people.  I have no sympathy for the newspapers and the cable news networks as they continue to decline.  Their business model was predicated on being the only game in town, they badly abused their position of privilege and one now derives a true sense of\nschadenfreude\nin watching them devolve into shallow emotional porn for barely educated women.\nMissing girls and Michael Jackson.  What a fitting epitaph!\nTangentially speaking, it may surprise some of you, but I probably don’t watch more than 10 minutes worth of Fox per week, and that only because Space Bunny occasionally watches a bit of Neal Cavuto while channel-flipping.  I don’t watch O’Reilly, Hannity & Colmes, I’ve never seen the shows hosted by Tucker Carlson, John Stewart or Greta van Susteren and although I’ve read his name once or twice, I have no idea what Aaron Brown looks like.  I never, ever watch CNN, MSNBC CNBC or anything else, and yet I would appear to be reasonably well-informed nevertheless.\nAnd yet some are still wondering why I’m not desperate to appear on TV.   This is amusing, because I recently decided to stop doing radio as well – barring Malkin ever accepting my challenge to a debate on the military necessity for the WWII-era internments.  My reasoning is that while it’s possible for people to learn and modify their thinking through the two-way interaction possible on the Internet, radio is primarily a combination of preaching to the choir and dancing monkey performances, neither of which appeal to me.\nI guess what it boils down to is that I refuse to waste any time on mediums that allow individuals to use the momentum inherent in the medium to skate unchallenged past their logical and factual errors.  I’d much rather spend my time doing my job, writing books and interacting with people here.  It’s so much more rewarding to receive emails telling me how someone picked up Susan Cooper’s books for the first time or has begun to delve into Austrian economics or Elliott Wave theory than it is to correct a clueless radio host on comparative coastlines or basic econ 101.",
  "tags": [],
  "categories": [],
  "sitemap_lastmod": "2005-08-20T07:19:00+00:00"
}