{
  "url": "https://voxday.net/2005/08/25/free-week-and-deflation/",
  "scraped_at": "2026-01-08T20:13:23.395152",
  "title": "Free Week and deflation",
  "date_display": "August 25, 2005",
  "date_iso": "2005-08-25T17:12:00+00:00",
  "date_from_url": "2005-08-25",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>I’d recommend having a look at this week’s Free Week at Elliott Wave International, as Prechter’s Elliott Wave Theorist of 8/24 is especially interesting.  He lays out his theory of how asset managers, especially hedge fund managers, have prolonged this remarkably long top due to their willingness to take greater risks with other people’s money.</p><p>Click on the EWI ad on the right side if you want to check it out.  There is a registration, but I don’t think they hound you continually.  Perhaps someone who’s registered for a free week in the past could shed some light on that.</p><p>I’ve never been particularly impressed with their ability to predict the stock markets in the near term, but I’ve found them quite good in some of the commodity markets.  Commodities and currencies are better for wave investors anyhow, since there’s no inherent upward bias as there is with stocks.</p><p>Full disclosure: I don’t get paid anything for this, but I do get comped on some of their services.</p><p>UPDATE:  Jeanne notes: <em>Prechter wrote a book a few years back called “Conquer the Crash” in which he predicts a upcoming super grandcycle that will result in a hugh deflationary depression. He predicts the DOW will go as low as something like 700. Of course, I have heard other experts claim that a depression cannot happen again and that the Fed has the ability to prevent one.</em></p><p>The monster question is inflation vs deflation.  The vast majority of people think that the Fed will simply print money and inflate their way out of trouble.  I have to admit that I always assumed this would be the case until I did some research on it.</p><p>The problem with the hyperinflation theory is that the Fed tried this in 1930-1934 and it didn’t work.  Contrary to popular opinion, the Fed was not tightening the money supply during that time, but aggressively loosening it.  Increasing the money supply is not a matter of simply printing money, it’s a matter of finding buyers for government debt.  The Fed can’t create money without debt, hence the theoretical problem they call pushing on a string.  The Law of Supply and Demand being what it is, interest rates will continue to rise in an attempt to interest creditors.</p><p>Since there is already something like a 37 trillion dollar debt hanging over the US economy, Prechter believes that it is not possible for the Fed to inflate its way out since there won’t be anyone interested in buying debt or taking on more debt.  The fact that the Fed has now raised interest rates 10 straight times – even though they are still negative when compared with the CPI – tends to support his position.</p><p>If the Dow goes below 8000 and interest rates continue to climb while prices are falling, we’ll know that the odds favor Prechter (finally) being right.  If prices continue to climb and we’re paying $8 per gallon at the pump, we’ll know that he’s probably wrong.</p><p>In light of contrarian theory, I found <a href=\"http://news.yahoo.com/s/latimests/20050825/ts_latimes/gopfearsgaspriceangermayspillover\">this article</a> to be interesting.  Since government is usually the last to respond, serious federal concern over rising prices would tend to be a signal that falling prices are just around the corner.</p></div>",
  "content_text": "I’d recommend having a look at this week’s Free Week at Elliott Wave International, as Prechter’s Elliott Wave Theorist of 8/24 is especially interesting.  He lays out his theory of how asset managers, especially hedge fund managers, have prolonged this remarkably long top due to their willingness to take greater risks with other people’s money.\nClick on the EWI ad on the right side if you want to check it out.  There is a registration, but I don’t think they hound you continually.  Perhaps someone who’s registered for a free week in the past could shed some light on that.\nI’ve never been particularly impressed with their ability to predict the stock markets in the near term, but I’ve found them quite good in some of the commodity markets.  Commodities and currencies are better for wave investors anyhow, since there’s no inherent upward bias as there is with stocks.\nFull disclosure: I don’t get paid anything for this, but I do get comped on some of their services.\nUPDATE:  Jeanne notes:\nPrechter wrote a book a few years back called “Conquer the Crash” in which he predicts a upcoming super grandcycle that will result in a hugh deflationary depression. He predicts the DOW will go as low as something like 700. Of course, I have heard other experts claim that a depression cannot happen again and that the Fed has the ability to prevent one.\nThe monster question is inflation vs deflation.  The vast majority of people think that the Fed will simply print money and inflate their way out of trouble.  I have to admit that I always assumed this would be the case until I did some research on it.\nThe problem with the hyperinflation theory is that the Fed tried this in 1930-1934 and it didn’t work.  Contrary to popular opinion, the Fed was not tightening the money supply during that time, but aggressively loosening it.  Increasing the money supply is not a matter of simply printing money, it’s a matter of finding buyers for government debt.  The Fed can’t create money without debt, hence the theoretical problem they call pushing on a string.  The Law of Supply and Demand being what it is, interest rates will continue to rise in an attempt to interest creditors.\nSince there is already something like a 37 trillion dollar debt hanging over the US economy, Prechter believes that it is not possible for the Fed to inflate its way out since there won’t be anyone interested in buying debt or taking on more debt.  The fact that the Fed has now raised interest rates 10 straight times – even though they are still negative when compared with the CPI – tends to support his position.\nIf the Dow goes below 8000 and interest rates continue to climb while prices are falling, we’ll know that the odds favor Prechter (finally) being right.  If prices continue to climb and we’re paying $8 per gallon at the pump, we’ll know that he’s probably wrong.\nIn light of contrarian theory, I found\nthis article\nto be interesting.  Since government is usually the last to respond, serious federal concern over rising prices would tend to be a signal that falling prices are just around the corner.",
  "tags": [],
  "categories": [],
  "sitemap_lastmod": "2005-08-25T16:12:00+00:00"
}