{
  "url": "https://voxday.net/2005/08/08/in-unlikely-event-that-anyone-wants/",
  "scraped_at": "2026-01-08T20:11:00.021897",
  "title": "In the unlikely event that anyone wants facts",
  "date_display": "August 8, 2005",
  "date_iso": "2005-08-08T16:03:00+00:00",
  "date_from_url": "2005-08-08",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>It turns out my column today was slightly inaccurate. <a href=\"http://www.laborresearch.org/charts.php?id=8\">Weekly real wages</a> peaked in 1972, not 1973 as I wrote, at $331.59 (in 1982 dollars), which equals an annual salary of $34,979.36 in 2005.  In the last 32 years, wages have declined 16.3 percent to an annual salary level of 29,280.68.  This long-term decline resumed again in 2004, as the Congressional Joint Economic Committee reported that real wages declined another .4 percent last year despite the economic recovery.*</p><p>Meanwhile, the average married women’s <a href=\"http://www.bls.gov/cps/wlf-table24-2005.pdf\">contribution to family income</a> has increased from 26.7 percent to 35.2 percent in the same time frame, a 31.8 percent increase.  In other words, fully half of a wife’s contribution to household income is eaten up by the decline in wages, which stems from the increase in the labor supply.</p><p>From 1973 to 2004, the percentage of women working rose from 44.7 percent to 59.2 percent.  The effects of this increase were obviated somewhat by the declining percentage of men who worked, from 78.8 percent to 73.3 percent.  The reason that this effect is a generally negative one is that unlike in the case of immigration, these new workers were already consumers, so they did not bring the concomitant increase in consumption (and demand for labor) that immigrants do.  Considering that this had a definite effect on the number of children being raised, it should probably be characterized as a net demand-reducing development.</p><p>*<em>The situation is actually worse than it looks here because the Federal Reserve’s CPI manipulations seriously underestimate inflation and therefore the true decline in real wages and purchasing power is greater than these statistics would indicate.  But we have to work with the tools available to us.</em></p></div>",
  "content_text": "It turns out my column today was slightly inaccurate.\nWeekly real wages\npeaked in 1972, not 1973 as I wrote, at $331.59 (in 1982 dollars), which equals an annual salary of $34,979.36 in 2005.  In the last 32 years, wages have declined 16.3 percent to an annual salary level of 29,280.68.  This long-term decline resumed again in 2004, as the Congressional Joint Economic Committee reported that real wages declined another .4 percent last year despite the economic recovery.*\nMeanwhile, the average married women’s\ncontribution to family income\nhas increased from 26.7 percent to 35.2 percent in the same time frame, a 31.8 percent increase.  In other words, fully half of a wife’s contribution to household income is eaten up by the decline in wages, which stems from the increase in the labor supply.\nFrom 1973 to 2004, the percentage of women working rose from 44.7 percent to 59.2 percent.  The effects of this increase were obviated somewhat by the declining percentage of men who worked, from 78.8 percent to 73.3 percent.  The reason that this effect is a generally negative one is that unlike in the case of immigration, these new workers were already consumers, so they did not bring the concomitant increase in consumption (and demand for labor) that immigrants do.  Considering that this had a definite effect on the number of children being raised, it should probably be characterized as a net demand-reducing development.\n*\nThe situation is actually worse than it looks here because the Federal Reserve’s CPI manipulations seriously underestimate inflation and therefore the true decline in real wages and purchasing power is greater than these statistics would indicate.  But we have to work with the tools available to us.",
  "tags": [],
  "categories": [],
  "sitemap_lastmod": "2005-08-08T15:03:00+00:00"
}