{
  "url": "https://voxday.net/2005/08/30/mailvox-lieutenant-sounds-off/",
  "scraped_at": "2026-01-08T20:41:13.008435",
  "title": "Mailvox: a lieutenant sounds off",
  "date_display": "August 30, 2005",
  "date_iso": "2005-08-30T09:32:00+00:00",
  "date_from_url": "2005-08-30",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>LT sends a similar response to Ben Shapiro’s recent columns from an Air Force intelligence officer on active duty:</p><blockquote><p>Kind of like un-Patriotic conservatives, Benjy Boy? I’m referring to David Frum’s screed in the National Review attacking Paul Craig Roberts, Robert Novak, Joseph Sobran, Pat Buchanan and other members of the Old Right. The NeoConservatives have proclaimed them un-American as well.</p><p>Of course Benjy Boy has to simplistically reduce what a “chickenhawk” is. Chickenhawks have been around a long time. Thomas Paine called them “sunshine patriots”. Henry Clay and John C. Calhoun were actually called “Chicken Hawks” and pressured Madsion into asking Congress to declare war on Great Britain. And then there were the men in favor of fighting the Confederacy who paid $500 to other men to fight for them. Later you had the draft-deferring Newt Gingrichs, Trent Lotts and Dick Cheney who had “more important priorties”. I’m sure Benjy Boy has more important priorties now also than joining the Marines. What Benjy Boy fails to distinguish is support and advocation. If you are going to advocate pre-emptive war and empire then you need to put your money where mouth is….  This is what is bothering Max Boot, Jonah Goldberg, Benjy Boy and the other Chickenhawks. What is laughable is that they can’t ignore it and make pathetic attempts to defend their position.</p><p>I loathe Michael Moore but even a broken clock is right twice a day. Following Lt. Col. Geoff Metcalf’s motto of “It is not a question of WHO is right or wrong but WHAT is right or wrong that COUNTS” it does not matter that Michael Moore is the one who wrote the definition. The definition is correct regardless. Benjy Boy accuses others of ad hominum yet he happily uses the ‘Guilt By Association’ argument. If the Kerry campaign said members of the Bush Administration – Dick Cheney in particular – were chickenhawks, then the term has no credibility. Why? Because it was used by the Kerry campaign!</p><p>So it is American to argue in favor of imperialism, and that Empire is a right and a duty of all Americans yet it is dishonest and limits free speech when you label someone a “Chickenhawk”? Calling someone un-American advocates Republicanism, freedom of choice and freedom of speech. Calling someone a Chickenhawk violates freedom of choice and freedom of speech. And it is dishonest. “Paging George Orwell!”</p><p>The “chickenhawk” argument states that you can have an opinion and vote BUT if you advocate and cheerlead empire without ever having put yourself in harm’s way then you are screeching like a hawk while EVERYONE knows you have the backbone of a chicken. Who is saying that if you behave like a chickenhawk you may not write, speak or vote? Who? Benjy Boy simply does not like being called on who he is!  It is not about rights Benjy Boy. It is about credibility. You also have a right to say that there are flying saucers from Mars being hidden in the Nevada desert. But will you be credible? Why do neoconservatives have such a hard time grasping the concept of credibility?</p><p><em>“Implicitly, then, the “chickenhawk” argument rejects all options aside from civilian pacifist control of American foreign policy.”</em> Implicitly, explicitly or any other “plicitly” it does no such thing. Perhaps, perhaps, from the LEFT it may. But from the right the argument is simply, “Quit barking like a poodle from the sanctity of your ivy-league towers and come down and fight like a man if you want any respect. Otherwise keep barking, because you have the right to bark, but don’t expect anyone to respect you or your opinions, Chickenhawk!”</p></blockquote><p>The whole thing was much longer, believe it or not.  The lieutenant also highlighted an interesting quote that demonstrates the high regard shown by the military for the chickenhawks:  “I have to deal with the fucking stupidest guy on the face of the earth almost every day.” – General Tommy Franks on neoconservative cabalist Douglas Feith.</p><p>I further note that readers of this blog, some of the least left-wing individuals on the planet, agree with the lieutenant’s position regarding the chickenhawkery of the specific neocon in question,  303-57.  Also, my email ran 2-1 in support of yesterday’s column, much of it very enthusiastic.  This is further indication that the popular contention of Shapiro, Lowry, Goldberg and others that the term is nothing but a left-wing pacifistic attempt to stifle debate is itself a red herring thrown out in a futile attempt to avoid debate on their own lack of credibility.</p><p>What I find most interesting is the way that the defenders of neocon chickenhawkery so readily resort to the tactics of bait-and-switch, of pointless accusations and the refusal to respond directly to relevant points that have been made against their position.</p><p>The tide of public opinion has turned against the global struggle and the Bush administration.  This minor chickenhawk irruption is only one indication that a majority of the American people have lost faith in the president, his advisors and their cheerleaders in the media.  That is why the chickenhawks are so desperate to shut it down before it cripples their ability to reframe the public discourse in a manner that will allow them to argue for expanding and widening the struggle.</p></div>",
  "content_text": "LT sends a similar response to Ben Shapiro’s recent columns from an Air Force intelligence officer on active duty:\nKind of like un-Patriotic conservatives, Benjy Boy? I’m referring to David Frum’s screed in the National Review attacking Paul Craig Roberts, Robert Novak, Joseph Sobran, Pat Buchanan and other members of the Old Right. The NeoConservatives have proclaimed them un-American as well.\nOf course Benjy Boy has to simplistically reduce what a “chickenhawk” is. Chickenhawks have been around a long time. Thomas Paine called them “sunshine patriots”. Henry Clay and John C. Calhoun were actually called “Chicken Hawks” and pressured Madsion into asking Congress to declare war on Great Britain. And then there were the men in favor of fighting the Confederacy who paid $500 to other men to fight for them. Later you had the draft-deferring Newt Gingrichs, Trent Lotts and Dick Cheney who had “more important priorties”. I’m sure Benjy Boy has more important priorties now also than joining the Marines. What Benjy Boy fails to distinguish is support and advocation. If you are going to advocate pre-emptive war and empire then you need to put your money where mouth is….  This is what is bothering Max Boot, Jonah Goldberg, Benjy Boy and the other Chickenhawks. What is laughable is that they can’t ignore it and make pathetic attempts to defend their position.\nI loathe Michael Moore but even a broken clock is right twice a day. Following Lt. Col. Geoff Metcalf’s motto of “It is not a question of WHO is right or wrong but WHAT is right or wrong that COUNTS” it does not matter that Michael Moore is the one who wrote the definition. The definition is correct regardless. Benjy Boy accuses others of ad hominum yet he happily uses the ‘Guilt By Association’ argument. If the Kerry campaign said members of the Bush Administration – Dick Cheney in particular – were chickenhawks, then the term has no credibility. Why? Because it was used by the Kerry campaign!\nSo it is American to argue in favor of imperialism, and that Empire is a right and a duty of all Americans yet it is dishonest and limits free speech when you label someone a “Chickenhawk”? Calling someone un-American advocates Republicanism, freedom of choice and freedom of speech. Calling someone a Chickenhawk violates freedom of choice and freedom of speech. And it is dishonest. “Paging George Orwell!”\nThe “chickenhawk” argument states that you can have an opinion and vote BUT if you advocate and cheerlead empire without ever having put yourself in harm’s way then you are screeching like a hawk while EVERYONE knows you have the backbone of a chicken. Who is saying that if you behave like a chickenhawk you may not write, speak or vote? Who? Benjy Boy simply does not like being called on who he is!  It is not about rights Benjy Boy. It is about credibility. You also have a right to say that there are flying saucers from Mars being hidden in the Nevada desert. But will you be credible? Why do neoconservatives have such a hard time grasping the concept of credibility?\n“Implicitly, then, the “chickenhawk” argument rejects all options aside from civilian pacifist control of American foreign policy.”\nImplicitly, explicitly or any other “plicitly” it does no such thing. Perhaps, perhaps, from the LEFT it may. But from the right the argument is simply, “Quit barking like a poodle from the sanctity of your ivy-league towers and come down and fight like a man if you want any respect. Otherwise keep barking, because you have the right to bark, but don’t expect anyone to respect you or your opinions, Chickenhawk!”\nThe whole thing was much longer, believe it or not.  The lieutenant also highlighted an interesting quote that demonstrates the high regard shown by the military for the chickenhawks:  “I have to deal with the fucking stupidest guy on the face of the earth almost every day.” – General Tommy Franks on neoconservative cabalist Douglas Feith.\nI further note that readers of this blog, some of the least left-wing individuals on the planet, agree with the lieutenant’s position regarding the chickenhawkery of the specific neocon in question,  303-57.  Also, my email ran 2-1 in support of yesterday’s column, much of it very enthusiastic.  This is further indication that the popular contention of Shapiro, Lowry, Goldberg and others that the term is nothing but a left-wing pacifistic attempt to stifle debate is itself a red herring thrown out in a futile attempt to avoid debate on their own lack of credibility.\nWhat I find most interesting is the way that the defenders of neocon chickenhawkery so readily resort to the tactics of bait-and-switch, of pointless accusations and the refusal to respond directly to relevant points that have been made against their position.\nThe tide of public opinion has turned against the global struggle and the Bush administration.  This minor chickenhawk irruption is only one indication that a majority of the American people have lost faith in the president, his advisors and their cheerleaders in the media.  That is why the chickenhawks are so desperate to shut it down before it cripples their ability to reframe the public discourse in a manner that will allow them to argue for expanding and widening the struggle.",
  "tags": [],
  "categories": [],
  "sitemap_lastmod": "2005-08-30T08:32:00+00:00"
}