{
  "url": "https://voxday.net/2005/08/27/mailvox-outside-asylu/",
  "scraped_at": "2026-01-08T20:13:36.200905",
  "title": "Mailvox: outside the Asylum",
  "date_display": "August 27, 2005",
  "date_iso": "2005-08-27T13:06:00+00:00",
  "date_from_url": "2005-08-27",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>Scintan queries my consistency:</p><blockquote><p>Vox told me that I was over the line when I wrote that Cedarford was a known racist and anti-semite. This was in the same thread where Nate had wondered how Cedarford would find a way to prove both sides wrong since they were jews and where Vox had said that’s why he liked reading Cedarford. So, after them typing that, I’m somehow over the line to note that Cedarford is known to be an anti-semite.  Vox, on the other hand, is not over the line to call Shapiro a chickenhawk based upon nothing but a call for empire?</p></blockquote><p>The difference, Scintan, is that I have repeatedly asked people commenting here not to launch personal attacks on others who are also commenting here.  Regardless of whether Cedarford is “a known racist and anti-semite” or not, you were stepping over one of the boundaries I’ve laid down here.  Had you written that Frank Rich was a racist and anti-semite, I might have disagreed with you but I would not have said that you crossed any lines.  Had you quoted Cedarford and asked him to explain how a particular comment was not racist or anti-semitic, that too would have been perfectly acceptable.</p><p>It is not as if I accused Ben Shapiro of anything out of the blue, I was directly addressing the topic of his recent columns.  Had he not written a second column on the subject for the second straight week, I doubt I would have paid it any attention.  I did not, after all, comment on the first one.  Dennis Prager and the Bush-bashers at the NYT aside, it is very unusual for a columnist to devote two weeks running to the same topic unless it is of great importance to them.  And it would have been impossible to write about those columns without reaching a conclusion about the appropriateness of the contemptuous appellation as applied to him.</p><blockquote><p>I read all 3 Shapiro articles, and I can’t stand his writing. But, in all 3 articles, the word duty came up only once. It wasn’t about military service. It said that we have a duty to be an empire. That was it. I know that Vox doesn’t like Malkin and He doesn’t like Shapiro, but he’s completely wrong on this….  As I said over there, Every military person I spoke to said he was wrong, and the former Colonel in special forces that I asked about it looked at me in disbelief when I told him the story. He couldn’t believe that Vox had even thought about using the term in this instance.</p></blockquote><p>That may be, but it has been established that the majority of the past and present military personnel here and at Blackfive don’t agree with you, the special forces colonel or all the military people with whom you spoke.  The chickenhawk concept is an old one, perhaps you missed when Dread quoted General Sherman’s famous words from 1879.</p><p>Shapiro does not come out and explicitly demand a draft or argue that duty demands every able-bodied male enlist immediately.  To understand the depth of his hypocrisy, it necessary to follow his logic as he argues for the establishment of global empire as well as the invasion of at least five additional countries, one of which already possesses nuclear weapons.  Now, it is remotely possible that he is contemplating the mass employment of Chinese mercenaries to this end, but it is rather more likely that he expects the American military to perform what he describes as a right and good national duty, specifically, other young American men between the ages of 18 and 30.  How many would be required to occupy Iran, Saudi Arabia, Syria, Egypt, Pakistan <em>and others</em>?</p><p>I further note that the young imperialist has openly and explicitly cheered the sacrifice of American civil liberties, leading to the inescapable conclusion that in his opinion, the war is not important enough to require his personal services but nevertheless requires the sacrifice of your and my liberties.</p><p>Shapiro has a perfect right to express his opinion, just as I and everyone else who considers him a contemptible hypocrite have the right to tell him to shut up and put his money where his mouth is instead of towards tuition.  The fact that one can so easily use his own words against him to that end just adds a delightful <em>frisson</em> of irony to the situation.</p><p>And chickenhawk or not, I will state that what Shapiro advocates is not conservativism.  It is not furthering freedom or human liberty.  It is the madness of incipient decline.</p></div>",
  "content_text": "Scintan queries my consistency:\nVox told me that I was over the line when I wrote that Cedarford was a known racist and anti-semite. This was in the same thread where Nate had wondered how Cedarford would find a way to prove both sides wrong since they were jews and where Vox had said that’s why he liked reading Cedarford. So, after them typing that, I’m somehow over the line to note that Cedarford is known to be an anti-semite.  Vox, on the other hand, is not over the line to call Shapiro a chickenhawk based upon nothing but a call for empire?\nThe difference, Scintan, is that I have repeatedly asked people commenting here not to launch personal attacks on others who are also commenting here.  Regardless of whether Cedarford is “a known racist and anti-semite” or not, you were stepping over one of the boundaries I’ve laid down here.  Had you written that Frank Rich was a racist and anti-semite, I might have disagreed with you but I would not have said that you crossed any lines.  Had you quoted Cedarford and asked him to explain how a particular comment was not racist or anti-semitic, that too would have been perfectly acceptable.\nIt is not as if I accused Ben Shapiro of anything out of the blue, I was directly addressing the topic of his recent columns.  Had he not written a second column on the subject for the second straight week, I doubt I would have paid it any attention.  I did not, after all, comment on the first one.  Dennis Prager and the Bush-bashers at the NYT aside, it is very unusual for a columnist to devote two weeks running to the same topic unless it is of great importance to them.  And it would have been impossible to write about those columns without reaching a conclusion about the appropriateness of the contemptuous appellation as applied to him.\nI read all 3 Shapiro articles, and I can’t stand his writing. But, in all 3 articles, the word duty came up only once. It wasn’t about military service. It said that we have a duty to be an empire. That was it. I know that Vox doesn’t like Malkin and He doesn’t like Shapiro, but he’s completely wrong on this….  As I said over there, Every military person I spoke to said he was wrong, and the former Colonel in special forces that I asked about it looked at me in disbelief when I told him the story. He couldn’t believe that Vox had even thought about using the term in this instance.\nThat may be, but it has been established that the majority of the past and present military personnel here and at Blackfive don’t agree with you, the special forces colonel or all the military people with whom you spoke.  The chickenhawk concept is an old one, perhaps you missed when Dread quoted General Sherman’s famous words from 1879.\nShapiro does not come out and explicitly demand a draft or argue that duty demands every able-bodied male enlist immediately.  To understand the depth of his hypocrisy, it necessary to follow his logic as he argues for the establishment of global empire as well as the invasion of at least five additional countries, one of which already possesses nuclear weapons.  Now, it is remotely possible that he is contemplating the mass employment of Chinese mercenaries to this end, but it is rather more likely that he expects the American military to perform what he describes as a right and good national duty, specifically, other young American men between the ages of 18 and 30.  How many would be required to occupy Iran, Saudi Arabia, Syria, Egypt, Pakistan\nand others\n?\nI further note that the young imperialist has openly and explicitly cheered the sacrifice of American civil liberties, leading to the inescapable conclusion that in his opinion, the war is not important enough to require his personal services but nevertheless requires the sacrifice of your and my liberties.\nShapiro has a perfect right to express his opinion, just as I and everyone else who considers him a contemptible hypocrite have the right to tell him to shut up and put his money where his mouth is instead of towards tuition.  The fact that one can so easily use his own words against him to that end just adds a delightful\nfrisson\nof irony to the situation.\nAnd chickenhawk or not, I will state that what Shapiro advocates is not conservativism.  It is not furthering freedom or human liberty.  It is the madness of incipient decline.",
  "tags": [],
  "categories": [],
  "sitemap_lastmod": "2005-08-27T12:06:00+00:00"
}