{
  "url": "https://voxday.net/2005/08/24/mailvox-music-etc/",
  "scraped_at": "2026-01-08T20:13:08.464301",
  "title": "Mailvox: music etc",
  "date_display": "August 24, 2005",
  "date_iso": "2005-08-24T13:27:00+00:00",
  "date_from_url": "2005-08-24",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>In answer to a question today from a left-wing female columnist, yes, I was referring to myself a few weeks ago.  As I posted a while back, one of the last songs I wrote with my friend Paul was released as BPM’s first single last year and now you can download <a href=\"http://www.amazon.com/exec/obidos/clipserve/B00029D22C001001/1/104-1341234-1068710\">an MP3 of the radio version</a> for free.</p><p>I wish they’d kept the cool African horn sample in the chorus, but I’m not involved with BPM except as a cheerleader.  Regardless, Paul is a truly gifted musician and I have always liked his work.  As for the review stating that BPM is nowhere nearly as dark as <a href=\"http://www.amazon.com/exec/obidos/tg/detail/-/B000003RFN/qid=1124890525/sr=2-2/ref=pd_bbs_b_2_2/104-1341234-1068710?v=glance&amp;s=music\">Psykosonik</a> was, well, one guess as to why.</p><p>And yes, the line from the chorus of “Alone” does come straight out of Susan Cooper.  Here’s another piece of trivia for you.  Hednoize’s Dan took the title for “Loaded Gun”, their song on the La Femme Nikita soundtrack, from the lyrics of “Teknojihad”, an old Psykosonik song for which he wrote the music.</p></div>",
  "content_text": "In answer to a question today from a left-wing female columnist, yes, I was referring to myself a few weeks ago.  As I posted a while back, one of the last songs I wrote with my friend Paul was released as BPM’s first single last year and now you can download\nan MP3 of the radio version\nfor free.\nI wish they’d kept the cool African horn sample in the chorus, but I’m not involved with BPM except as a cheerleader.  Regardless, Paul is a truly gifted musician and I have always liked his work.  As for the review stating that BPM is nowhere nearly as dark as\nPsykosonik\nwas, well, one guess as to why.\nAnd yes, the line from the chorus of “Alone” does come straight out of Susan Cooper.  Here’s another piece of trivia for you.  Hednoize’s Dan took the title for “Loaded Gun”, their song on the La Femme Nikita soundtrack, from the lyrics of “Teknojihad”, an old Psykosonik song for which he wrote the music.",
  "tags": [],
  "categories": [],
  "sitemap_lastmod": "2005-08-24T12:27:00+00:00"
}