{
  "url": "https://voxday.net/2005/08/26/mailvox-weak-and-lame/",
  "scraped_at": "2026-01-08T20:13:28.856926",
  "title": "Mailvox: the weak and the lame",
  "date_display": "August 26, 2005",
  "date_iso": "2005-08-26T18:04:00+00:00",
  "date_from_url": "2005-08-26",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>CR wonders if it might be cowardice, or perhaps mere predation:</p><blockquote><p>Why do you feel the need to pick on the Shapiros and Malkins of the Right.  Kind of reminds me of a hyena attaching the weakest one in the herd. Are you afraid to go up against someone with a little more expreience.</p></blockquote><p>You said it, not me.  But in answer to your question, I have schooled both Dr. Thomas Sowell and John Leo on their wildly inaccurate summations of Pearl Harbor’s effect on the US Navy.  And have you so soon forgotten <a href=\"http://www.voxday.net/archive/2004/072604.html\">The Ballad of Brave Sir William</a>?  The reason I generally don’t pursue more eminent members of the nominally right-wing commentariat is that I agree with them far more often than I do with, say, Maureen Dowd.</p><p>I think it is very ominous sign for the Right when ignorant and shoddy thinkers such as Malkin and Shapiro are being groomed as the next generation of voices in the conservative media.  I have already been deemed inadequate/inappropriate/undesirable by those who decide such things, so you can almost surely look forward to years of thoughtless repetition of Republican party talking points from them and a few others of the anointed in numerous papers around the country, culminating eventually in one of them claiming the coveted token nominally conservative Republican slot in the New York Times.  My money is on Shapiro.</p><p>Remember, this is the young man who wants to “temporarily” restrict civil liberties during wartime in a war that is expected to continue for decades while America builds a global empire.  Malkin, meanwhile, lionizes FDR.  If this is conservativism, then I want no part of it and will oppose it with the same enthusiasm that I oppose their socialist and neosocialist cousins.  It’s nothing of the sort, of course, it’s merely a new breed of neofascists mouthing platitudes of liberty as they work towards its elimination.</p><p>That being said, who do you consider to be the lions of the Right?  If you can give me an example where one of these intellectual strongmen advocates something to which I am opposed, I’ll be happy to compose a critique for you.</p><p>UPDATE: Jealous much?  With regards to the popularity postulate suggested by Craig, here’s the hard numbers from WND.  The weekly average readership for my column is 1.2 times that of Mrs. Malkin’s and 4.1 times that of Mr. Shapiro’s.  Miss Coulter is still handing me my proverbial head, however, exceeding my readership by a factor of 1.5.</p></div>",
  "content_text": "CR wonders if it might be cowardice, or perhaps mere predation:\nWhy do you feel the need to pick on the Shapiros and Malkins of the Right.  Kind of reminds me of a hyena attaching the weakest one in the herd. Are you afraid to go up against someone with a little more expreience.\nYou said it, not me.  But in answer to your question, I have schooled both Dr. Thomas Sowell and John Leo on their wildly inaccurate summations of Pearl Harbor’s effect on the US Navy.  And have you so soon forgotten\nThe Ballad of Brave Sir William\n?  The reason I generally don’t pursue more eminent members of the nominally right-wing commentariat is that I agree with them far more often than I do with, say, Maureen Dowd.\nI think it is very ominous sign for the Right when ignorant and shoddy thinkers such as Malkin and Shapiro are being groomed as the next generation of voices in the conservative media.  I have already been deemed inadequate/inappropriate/undesirable by those who decide such things, so you can almost surely look forward to years of thoughtless repetition of Republican party talking points from them and a few others of the anointed in numerous papers around the country, culminating eventually in one of them claiming the coveted token nominally conservative Republican slot in the New York Times.  My money is on Shapiro.\nRemember, this is the young man who wants to “temporarily” restrict civil liberties during wartime in a war that is expected to continue for decades while America builds a global empire.  Malkin, meanwhile, lionizes FDR.  If this is conservativism, then I want no part of it and will oppose it with the same enthusiasm that I oppose their socialist and neosocialist cousins.  It’s nothing of the sort, of course, it’s merely a new breed of neofascists mouthing platitudes of liberty as they work towards its elimination.\nThat being said, who do you consider to be the lions of the Right?  If you can give me an example where one of these intellectual strongmen advocates something to which I am opposed, I’ll be happy to compose a critique for you.\nUPDATE: Jealous much?  With regards to the popularity postulate suggested by Craig, here’s the hard numbers from WND.  The weekly average readership for my column is 1.2 times that of Mrs. Malkin’s and 4.1 times that of Mr. Shapiro’s.  Miss Coulter is still handing me my proverbial head, however, exceeding my readership by a factor of 1.5.",
  "tags": [],
  "categories": [],
  "sitemap_lastmod": "2005-08-26T17:04:00+00:00"
}