{
  "url": "https://voxday.net/2005/08/01/mailvox-shades-of-16th-amendmen/",
  "scraped_at": "2026-01-08T20:10:06.734567",
  "title": "Mailvox: shades of the 16th Amendment",
  "date_display": "August 1, 2005",
  "date_iso": "2005-08-01T16:41:00+00:00",
  "date_from_url": "2005-08-01",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>This showed up in the inbox.  I can’t vouch for it.</p><blockquote><p>Two hours of debate on CAFTA ended in the U.S. House at 10:59 p.m. Wednesday night.  Representative Ray LaHood (R-Illinois), speaker pro tempore, then ordered a 15-minute vote — at the end of which CAFTA had been defeated! But with the vote kept open for more than one hour after it began, the “final” vote tally was 217 in favor to 215 against, with two not voting.  Or was it?  We were led to believe that the two members who didn’t vote, Jo Ann Davis (R-Virginia) and Charles Taylor (R-North Carolina) who were already on record as going to vote “no” and would have defeated CAFTA, had been persuaded to remain silent.  Mr. Taylor’s was a key vote from a textile state that everyone was watching.</p><p>Republican leaders “spent much of [the] time wrestling with about 10 rebellious but ‘undecided’ Republicans, pleading and pressuring one after another to vote for the agreement.”</p><p>But on Thursday, the day after the vote, I received a telephone call from a talk radio host in Congressman Taylor’s district.  He told me he had asked Mr. Taylor that morning why he didn’t vote against CAFTA as he had pledged. The talk radio host told me “Taylor said he had voted ‘no’…but somebody changed it and Mr. Taylor was furious.”  “‘I voted NO,’ Mr. Taylor announced in a terse statement on Thursday, saying the House clerk’s written log showed his vote….”</p></blockquote><p>If they’re going to this sort of trouble and playing games with the voting record to make sure something is rammed through the House and Senate, you know it’s heap bad news.</p><p>UPDATE – <a href=\"http://www.house.gov/charlestaylor/\">Congressman Taylor’s statement</a>: “I voted NO on the Dominican Republic-Central America Free Trade Agreement (DR-CAFTA) in the vote last night. I informed the Majority Leader and the Appropriations Chairman I was voting no, as I had informed my constituents I was voting no. Rep. Howard Coble and I voted “no” together. Due to an error, my “no” vote did not record on the voting machine. The Clerk’s computer logs verified that I had attempted to vote, but it did not show my “nay” vote. I am re-inserting my “No” vote in the record. But even with my NO vote re-inserted, the bill still passed.”</p><p>Of course it did, Chuckie.  Of course it did….</p></div>",
  "content_text": "This showed up in the inbox.  I can’t vouch for it.\nTwo hours of debate on CAFTA ended in the U.S. House at 10:59 p.m. Wednesday night.  Representative Ray LaHood (R-Illinois), speaker pro tempore, then ordered a 15-minute vote — at the end of which CAFTA had been defeated! But with the vote kept open for more than one hour after it began, the “final” vote tally was 217 in favor to 215 against, with two not voting.  Or was it?  We were led to believe that the two members who didn’t vote, Jo Ann Davis (R-Virginia) and Charles Taylor (R-North Carolina) who were already on record as going to vote “no” and would have defeated CAFTA, had been persuaded to remain silent.  Mr. Taylor’s was a key vote from a textile state that everyone was watching.\nRepublican leaders “spent much of [the] time wrestling with about 10 rebellious but ‘undecided’ Republicans, pleading and pressuring one after another to vote for the agreement.”\nBut on Thursday, the day after the vote, I received a telephone call from a talk radio host in Congressman Taylor’s district.  He told me he had asked Mr. Taylor that morning why he didn’t vote against CAFTA as he had pledged. The talk radio host told me “Taylor said he had voted ‘no’…but somebody changed it and Mr. Taylor was furious.”  “‘I voted NO,’ Mr. Taylor announced in a terse statement on Thursday, saying the House clerk’s written log showed his vote….”\nIf they’re going to this sort of trouble and playing games with the voting record to make sure something is rammed through the House and Senate, you know it’s heap bad news.\nUPDATE –\nCongressman Taylor’s statement\n: “I voted NO on the Dominican Republic-Central America Free Trade Agreement (DR-CAFTA) in the vote last night. I informed the Majority Leader and the Appropriations Chairman I was voting no, as I had informed my constituents I was voting no. Rep. Howard Coble and I voted “no” together. Due to an error, my “no” vote did not record on the voting machine. The Clerk’s computer logs verified that I had attempted to vote, but it did not show my “nay” vote. I am re-inserting my “No” vote in the record. But even with my NO vote re-inserted, the bill still passed.”\nOf course it did, Chuckie.  Of course it did….",
  "tags": [],
  "categories": [],
  "sitemap_lastmod": "2005-08-01T15:41:00+00:00"
}