{
  "url": "https://voxday.net/2005/08/15/mailvox-pretty-heads-in-sand/",
  "scraped_at": "2026-01-08T20:12:01.683994",
  "title": "Mailvox: Pretty heads in the sand",
  "date_display": "August 15, 2005",
  "date_iso": "2005-08-15T11:06:00+00:00",
  "date_from_url": "2005-08-15",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>DC asks for clarification:</p><blockquote><p>Although I somehow missed reading your article that described “women’s rights as a disease that society would do well to eradicate,” I do hope you were not including the right to vote that women were able to gain during the past century.</p></blockquote><p>I replied in an email: <em>I’m generally against any universal “right to vote”, but I consider that of little importance either way.  Voting is not a significant right, as one can see in Cuba, the former Soviet Union, the former Iraq and many other nations.  Voting has proven to be ineffective in protecting the rights of life, liberty and property and is largely irrelevant, especially in a modern two-party system.  It’s designed to be valve to blow off popular pressure, nothing more.</em></p><p>Still, I’d include the right to vote among that list of women’s rights that have served society poorly.  Even if voting is not terribly important, I don’t see that one can point to anything positive that has come of the women’s vote and the West would not be so far along the long march towards socialism and social decay if women were not permitted to vote.  Unfortunately, female voters’ susceptibility to demagogues has turned out to exceed that of their male counterparts.  You may wish to look into the results of the two 1933 German elections for details.</p><p>To which she responded:</p><blockquote><p>What fun this girl will have deleting your email and having “the right” to refuse even glancing at any of your future work.</p></blockquote><p>And here I was planning on sending her scads of email in the future.  Now I suppose I’ll have to find some other way to fill my long and empty days.  DC does us a service in demonstrating that the best way to handle facts and ideas which make us uncomfortable is to ignore them and pretend they don’t exist.  I find it tremendously ironic that a lot of people seem to think that I’m inventing a problem out of malice or sexual inadequacy when all I’m doing is pointing out the easily verifiable obvious.</p><p>I didn’t make women vote Hitler into office.  I didn’t invent or even discover the law of supply and demand nor am I the one responsible for the notion of a gender gap in voting behavior.  I am guilty, however, of employing several women and approving a split-time system designed to allow working mothers to spend more time at home with their children during the week.</p><p>Anyhow, if DC cannot bear the thoughts of one who is willing to consider the history and probable future of women’s rights, then she should by all means give up reading my columns.  She can always make do with Ann Coulter discovering that Democrats are still stupid, Michelle Malkin inserting herself into the latest debate du jour – I’m wondering how she’ll manage to get herself deported from Gaza – or Katherine Lopez defending the latest Republican crime against the republic instead.</p></div>",
  "content_text": "DC asks for clarification:\nAlthough I somehow missed reading your article that described “women’s rights as a disease that society would do well to eradicate,” I do hope you were not including the right to vote that women were able to gain during the past century.\nI replied in an email:\nI’m generally against any universal “right to vote”, but I consider that of little importance either way.  Voting is not a significant right, as one can see in Cuba, the former Soviet Union, the former Iraq and many other nations.  Voting has proven to be ineffective in protecting the rights of life, liberty and property and is largely irrelevant, especially in a modern two-party system.  It’s designed to be valve to blow off popular pressure, nothing more.\nStill, I’d include the right to vote among that list of women’s rights that have served society poorly.  Even if voting is not terribly important, I don’t see that one can point to anything positive that has come of the women’s vote and the West would not be so far along the long march towards socialism and social decay if women were not permitted to vote.  Unfortunately, female voters’ susceptibility to demagogues has turned out to exceed that of their male counterparts.  You may wish to look into the results of the two 1933 German elections for details.\nTo which she responded:\nWhat fun this girl will have deleting your email and having “the right” to refuse even glancing at any of your future work.\nAnd here I was planning on sending her scads of email in the future.  Now I suppose I’ll have to find some other way to fill my long and empty days.  DC does us a service in demonstrating that the best way to handle facts and ideas which make us uncomfortable is to ignore them and pretend they don’t exist.  I find it tremendously ironic that a lot of people seem to think that I’m inventing a problem out of malice or sexual inadequacy when all I’m doing is pointing out the easily verifiable obvious.\nI didn’t make women vote Hitler into office.  I didn’t invent or even discover the law of supply and demand nor am I the one responsible for the notion of a gender gap in voting behavior.  I am guilty, however, of employing several women and approving a split-time system designed to allow working mothers to spend more time at home with their children during the week.\nAnyhow, if DC cannot bear the thoughts of one who is willing to consider the history and probable future of women’s rights, then she should by all means give up reading my columns.  She can always make do with Ann Coulter discovering that Democrats are still stupid, Michelle Malkin inserting herself into the latest debate du jour – I’m wondering how she’ll manage to get herself deported from Gaza – or Katherine Lopez defending the latest Republican crime against the republic instead.",
  "tags": [],
  "categories": [],
  "sitemap_lastmod": "2005-08-15T10:06:00+00:00"
}