{
  "url": "https://voxday.net/2005/08/18/more-lisa-lisa/",
  "scraped_at": "2026-01-08T20:12:18.290053",
  "title": "More Lisa Lisa",
  "date_display": "August 18, 2005",
  "date_iso": "2005-08-18T16:34:00+00:00",
  "date_from_url": "2005-08-18",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>DH was kind enough to email me: “She fights back….  Apparently she has her own blog – <a href=\"http://lisalisamomeesa.blogspot.com/2005/08/careful-what-you-say-in-message-board.html\">boy did she give you the business!</a>“</p><p>This is “the business”?  I get far worse in my fantasy football league and we haven’t even DRAFTED yet.  Anyhow, here’s her explanation for her inanities of last week’s response:</p><blockquote><p>My original post will be in <em>blue</em> and my futher thoughts will be in regular print.</p><p>First: the point where I was going, and where I arrived at the end of this random, small, newsgroup post were two different places. As I said before, halfway through my thoughts I decided it was a waste of time…. I should have just deleted the whole thing….</p><p>But my base thinking was that one couldn’t pinpoint it as the influx of WOMEN in the work force, more just the influx of PEOPLE in the workforce.</p><p>“Yes. It’s defintely the influx of WOMEN into the workforce that caused this low ‘real wage.’ It’s not:<br><em>a) the exponential increase in child births.</em> I meant the baby boom of the 40’s &amp; 50’s that put alot of peole into the workforce in the 70’s and 80’s.<br><em>b) the exponential influx of immigrants (both legal and illegal)</em> After WWII, there has been a huge influx in immigration. I’m not just talking about lettuce pickers in the San Juaquin valley. I’m talking about the influx of hi tech workers from Asia and then later, India . <br><em>c) the increase in the retirement age, thus putting exponential increases of people working later in life in the work force</em> It is a known fact that people are, infact, working later in their lives, with many returning to the work force after retirement.<br><em>d) the exponential growth of corporations in this country</em> I’m not entirely sure where I was going with this point (remember, I was workign against the clock, I knew the moderators would close this obvious flame bate thread). But I think I was thinking of the dot com bubble. That there were in the late 90’s an INCREASE in companies…. dot coms popping up everywhere, and then when that bubble burst, that would cause a decraese in real wages –i.e people being laid off.<br><em>e) drops in economy because of exponential offshoring of jobs</em> This one was rather obvious. If you’re laid off, I’d say that’s a big drop in your real wages.</br></br></br></br></br></p></blockquote><p>a) It still doesn’t compute.  The US birth rates in the 1950s, while higher than the 1930s and 1940s, was still much lower than the rates from 1910 through 1925.  The increase was not only not “exponential”, but in percentage terms it was still a decrease, for this time frame as well as the 1970-2000 period I cited.</p><p>b) The amount of immigration did increase, but the total, let alone this increase, was far smaller than the increase in additional women working.  Furthermore, as I already explained, immigrants offer more consumption in addition to more production.  Domestic women only offer more production.</p><p>c)  This is simply wrong.  Lisa Lisa might wish to try researching the requisite labor statistics instead of relying on what someone’s mother’s friend read in the New York Times’ Style section about how hip and cool older people are working at Starbucks these days.</p><p>d)  I’m also at a complete loss.  I have no idea where she was going either.</p><p>e)  Again, the economy did not drop, it more than doubled.  Jobs going offshore are lost, but jobs are not a zero-sum game since new jobs are created all the time.  Since most new jobs are created by small companies and most offshoring is done by large companies, the correct question is to ask if one trend outweighs the other.  Lisa Lisa hasn’t even begun a reasonable analysis.</p><p>Think before you spout off.  Think before you write.  For the love of sweet Cthulhu, most people writing on the Internet would do well simply to try thinking at all!</p></div>",
  "content_text": "DH was kind enough to email me: “She fights back….  Apparently she has her own blog –\nboy did she give you the business!\n“\nThis is “the business”?  I get far worse in my fantasy football league and we haven’t even DRAFTED yet.  Anyhow, here’s her explanation for her inanities of last week’s response:\nMy original post will be in\nblue\nand my futher thoughts will be in regular print.\nFirst: the point where I was going, and where I arrived at the end of this random, small, newsgroup post were two different places. As I said before, halfway through my thoughts I decided it was a waste of time…. I should have just deleted the whole thing….\nBut my base thinking was that one couldn’t pinpoint it as the influx of WOMEN in the work force, more just the influx of PEOPLE in the workforce.\n“Yes. It’s defintely the influx of WOMEN into the workforce that caused this low ‘real wage.’ It’s not:\na) the exponential increase in child births.\nI meant the baby boom of the 40’s & 50’s that put alot of peole into the workforce in the 70’s and 80’s.\nb) the exponential influx of immigrants (both legal and illegal)\nAfter WWII, there has been a huge influx in immigration. I’m not just talking about lettuce pickers in the San Juaquin valley. I’m talking about the influx of hi tech workers from Asia and then later, India .\nc) the increase in the retirement age, thus putting exponential increases of people working later in life in the work force\nIt is a known fact that people are, infact, working later in their lives, with many returning to the work force after retirement.\nd) the exponential growth of corporations in this country\nI’m not entirely sure where I was going with this point (remember, I was workign against the clock, I knew the moderators would close this obvious flame bate thread). But I think I was thinking of the dot com bubble. That there were in the late 90’s an INCREASE in companies…. dot coms popping up everywhere, and then when that bubble burst, that would cause a decraese in real wages –i.e people being laid off.\ne) drops in economy because of exponential offshoring of jobs\nThis one was rather obvious. If you’re laid off, I’d say that’s a big drop in your real wages.\na) It still doesn’t compute.  The US birth rates in the 1950s, while higher than the 1930s and 1940s, was still much lower than the rates from 1910 through 1925.  The increase was not only not “exponential”, but in percentage terms it was still a decrease, for this time frame as well as the 1970-2000 period I cited.\nb) The amount of immigration did increase, but the total, let alone this increase, was far smaller than the increase in additional women working.  Furthermore, as I already explained, immigrants offer more consumption in addition to more production.  Domestic women only offer more production.\nc)  This is simply wrong.  Lisa Lisa might wish to try researching the requisite labor statistics instead of relying on what someone’s mother’s friend read in the New York Times’ Style section about how hip and cool older people are working at Starbucks these days.\nd)  I’m also at a complete loss.  I have no idea where she was going either.\ne)  Again, the economy did not drop, it more than doubled.  Jobs going offshore are lost, but jobs are not a zero-sum game since new jobs are created all the time.  Since most new jobs are created by small companies and most offshoring is done by large companies, the correct question is to ask if one trend outweighs the other.  Lisa Lisa hasn’t even begun a reasonable analysis.\nThink before you spout off.  Think before you write.  For the love of sweet Cthulhu, most people writing on the Internet would do well simply to try thinking at all!",
  "tags": [],
  "categories": [],
  "sitemap_lastmod": "2005-08-18T15:34:00+00:00"
}