{
  "url": "https://voxday.net/2005/08/28/on-effectiveness-of-labels/",
  "scraped_at": "2026-01-08T20:13:41.758987",
  "title": "On the effectiveness of labels",
  "date_display": "August 28, 2005",
  "date_iso": "2005-08-28T10:02:00+00:00",
  "date_from_url": "2005-08-28",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>While it’s certainly true that the use of the word “chickenhawk” is intended to influence the war debate, it’s untrue that it is meant to stifle it altogether.  And it is manifestly untrue that its mere use is unfair, unjust, unconstitutional or un-American.  This is because the word serves precisely the same purpose as every other derogatory label used in the grand sweep of the ongoing political discussion, from “liberal” to “hard right”, from “fundamentalist” to “neocon”.</p><p>Any debate stifling caused by the usage of such terms is inadvertant, as they are primarily intended to present a concise summary that is damaging to the target in a manner capable of influencing casual observers, who outnumber more serious observers but are totally uninterested in the deeper levels of debate.  The effectiveness of a label and the accuracy with which it has hit its target can usually be ascertained by the amount of effort expended by those targets in subsequent attempts to escape it.</p><p>For example, neoconservative is an accurate political label proudly sported by men such as Irving Kristol, who, unlike many of his less honest intellectual compatriots such as David Frum<a href=\"http://www.weeklystandard.com/Utilities/printer_preview.asp?idArticle=3000&amp;R=785F27881\">nobly defends it still</a>.  But because so many conservatives are turned off by its embrace of the state, its foreign adventurism and its underlying utopianism, many notable neocons and their defenders have attempted to inoculate themselves from the charge by claiming that neocon is nothing more than a reprehensible anti-semitic attack made by Jew haters.</p><p>In fact, I even wrote a column once mocking Joel Mowbray’s feeble attempt to protect his neocon compatriots and the Bush administration from General Anthony Zinni’s harsh criticism by falsely smearing him as a Jew hater <a href=\"http://www.voxday.net/archive/2004/010504.html\">back in a January 2004</a>.</p><p>One may recall that American liberals, too, run from being labled accurately* as if the hounds of Hell were on their heels.  But those who are confident in their position do no such thing.  It no more bothers me when Chuck calls me a chickenhawk than when gay activists call me a secret homosexual, when left-wing Jews call me an anti-semite or when feminists call me a woman-hater, not so much because the accusations are absurd, but because they don’t harm my arguments or my ability to make them in the slightest.  After all, the notion that a hawk of any kind would favor an end to the twin occupations actually makes the argument more powerful, in the same way the arguments of an anti-semite supporting Israel or a woman-hater calling for zero taxation on women would be empowered.</p><p>On the other hand, it is much more effective to dismiss me as a “Bible-thumper” or “pro-druggie libertine” or “straight white male” because anyone who reacts negatively to those labels is likely to be inherently opposed to my genuine positions.</p><p>The reason that “chickenhawk”, “neocon” and “liberal” are so upsetting to some people is because they are such effective and generally accurate descriptions which contain the ability to sway the casual observer.  Thus we have seen a serious reduction in the neocons’ ability to influence conservatives and the ability of the chickenhawks to call for expanded war is now being destroyed in the same manner.  Hillary Clinton is even now positioning herself to avoid the latter label; the success of her presidential campaign largely depends upon her ability to do so.</p><p>Inaccurate and unfair name-calling achieves little, whereas accurate labling is demonstrably effective.  As I noted in my initial post, the ladies are indeed protesting way too much.</p><p>*<em>Liberal is a complete misnomer, of course, but an enduring one that has existed long enough in American politics that it can be appropriately used in its contradictory sense as long as it is being used within an American context.  I prefer the term “left-liberal”.</em></p></div>",
  "content_text": "While it’s certainly true that the use of the word “chickenhawk” is intended to influence the war debate, it’s untrue that it is meant to stifle it altogether.  And it is manifestly untrue that its mere use is unfair, unjust, unconstitutional or un-American.  This is because the word serves precisely the same purpose as every other derogatory label used in the grand sweep of the ongoing political discussion, from “liberal” to “hard right”, from “fundamentalist” to “neocon”.\nAny debate stifling caused by the usage of such terms is inadvertant, as they are primarily intended to present a concise summary that is damaging to the target in a manner capable of influencing casual observers, who outnumber more serious observers but are totally uninterested in the deeper levels of debate.  The effectiveness of a label and the accuracy with which it has hit its target can usually be ascertained by the amount of effort expended by those targets in subsequent attempts to escape it.\nFor example, neoconservative is an accurate political label proudly sported by men such as Irving Kristol, who, unlike many of his less honest intellectual compatriots such as David Frum\nnobly defends it still\n.  But because so many conservatives are turned off by its embrace of the state, its foreign adventurism and its underlying utopianism, many notable neocons and their defenders have attempted to inoculate themselves from the charge by claiming that neocon is nothing more than a reprehensible anti-semitic attack made by Jew haters.\nIn fact, I even wrote a column once mocking Joel Mowbray’s feeble attempt to protect his neocon compatriots and the Bush administration from General Anthony Zinni’s harsh criticism by falsely smearing him as a Jew hater\nback in a January 2004\n.\nOne may recall that American liberals, too, run from being labled accurately* as if the hounds of Hell were on their heels.  But those who are confident in their position do no such thing.  It no more bothers me when Chuck calls me a chickenhawk than when gay activists call me a secret homosexual, when left-wing Jews call me an anti-semite or when feminists call me a woman-hater, not so much because the accusations are absurd, but because they don’t harm my arguments or my ability to make them in the slightest.  After all, the notion that a hawk of any kind would favor an end to the twin occupations actually makes the argument more powerful, in the same way the arguments of an anti-semite supporting Israel or a woman-hater calling for zero taxation on women would be empowered.\nOn the other hand, it is much more effective to dismiss me as a “Bible-thumper” or “pro-druggie libertine” or “straight white male” because anyone who reacts negatively to those labels is likely to be inherently opposed to my genuine positions.\nThe reason that “chickenhawk”, “neocon” and “liberal” are so upsetting to some people is because they are such effective and generally accurate descriptions which contain the ability to sway the casual observer.  Thus we have seen a serious reduction in the neocons’ ability to influence conservatives and the ability of the chickenhawks to call for expanded war is now being destroyed in the same manner.  Hillary Clinton is even now positioning herself to avoid the latter label; the success of her presidential campaign largely depends upon her ability to do so.\nInaccurate and unfair name-calling achieves little, whereas accurate labling is demonstrably effective.  As I noted in my initial post, the ladies are indeed protesting way too much.\n*\nLiberal is a complete misnomer, of course, but an enduring one that has existed long enough in American politics that it can be appropriately used in its contradictory sense as long as it is being used within an American context.  I prefer the term “left-liberal”.",
  "tags": [],
  "categories": [],
  "sitemap_lastmod": "2005-08-28T09:02:00+00:00"
}