{
  "url": "https://voxday.net/2005/08/31/protecting-no-one-serving-themselves/",
  "scraped_at": "2026-01-08T20:41:18.598078",
  "title": "Protecting no one, serving themselves",
  "date_display": "August 31, 2005",
  "date_iso": "2005-08-31T07:37:00+00:00",
  "date_from_url": "2005-08-31",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>Rod Dreher on NRO’s Corner:</p><blockquote><p>Times-Picayune reporters witnessed police and firefighters in New Orleans joining in the looting. Excerpt: <em>One man said police directed him to Wal-Mart from Robert’s Grocery, where a similar scene was taking place. A crowd in the electronics section said one officer broke the glass DVD case so people wouldn’t cut themselves.  “The police got all the best stuff. They’re crookeder than us,” one man said.</em></p><p>Thank God Orleans Parish is now under martial law.  The good people need to be protected not only from thugs, but from their own public servants.</p></blockquote><p>You may note that I was one of the few columnists writing after 9/11 who did not buy into the public employee deification of that era.  This sort of thing is only one of the many reasons I am a police skeptic.  I am not asserting that all cops are bad or that all firefighters are thieves of opportunity, but it is a legitimate question to ask whether the good apples outweigh the bad ones these days.</p><p>And there’s even old school cops who agree with me.  For you can’t have a police state without police, and little doubt remains among serious observers as to which direction this administration, its predecessor and its probable successor hope to take the nation.  A free nation has no need for militarized police.</p></div>",
  "content_text": "Rod Dreher on NRO’s Corner:\nTimes-Picayune reporters witnessed police and firefighters in New Orleans joining in the looting. Excerpt:\nOne man said police directed him to Wal-Mart from Robert’s Grocery, where a similar scene was taking place. A crowd in the electronics section said one officer broke the glass DVD case so people wouldn’t cut themselves.  “The police got all the best stuff. They’re crookeder than us,” one man said.\nThank God Orleans Parish is now under martial law.  The good people need to be protected not only from thugs, but from their own public servants.\nYou may note that I was one of the few columnists writing after 9/11 who did not buy into the public employee deification of that era.  This sort of thing is only one of the many reasons I am a police skeptic.  I am not asserting that all cops are bad or that all firefighters are thieves of opportunity, but it is a legitimate question to ask whether the good apples outweigh the bad ones these days.\nAnd there’s even old school cops who agree with me.  For you can’t have a police state without police, and little doubt remains among serious observers as to which direction this administration, its predecessor and its probable successor hope to take the nation.  A free nation has no need for militarized police.",
  "tags": [],
  "categories": [],
  "sitemap_lastmod": "2005-08-31T06:37:00+00:00"
}