{
  "url": "https://voxday.net/2005/08/08/pucker-pucker-powerline/",
  "scraped_at": "2026-01-08T20:10:54.481699",
  "title": "Pucker pucker powerline",
  "date_display": "August 8, 2005",
  "date_iso": "2005-08-08T12:20:00+00:00",
  "date_from_url": "2005-08-08",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>Powerline <a href=\"http://powerlineblog.com/archives/011278.php\">defends the Republican Party’s favorite affirmative action doll</a>:</p><blockquote><p>Michelle comes in for more than her fair share of abuse because of her gender and ethnicity–you could pursue this line of thought further, but I don’t recommend it–but she stands so far above her mostly-anonymous left-wing critics that their slanders reflect only on them.</p></blockquote><p>I’m not anonymous.  I’m not left-wing.  And yet I, too, think Malkin is a media whore as full of <em>merde</em> as most of her left-wing critics.  Sure, she comes in for some unfair criticism as do we all, but she is nevertheless an incompetent and intellectually dishonest armchair historian who is willing to lie rather than run the risk of being exposed for an ignorant sham.</p><p>As for her gender, not even those who like her columns take her very seriously.  Ann Coulter is respected in part because she isn’t afraid to take on anyone, while Malkin not only ran from me but couldn’t handle that rapier wit Chris Matthews when he hadn’t even read the book under discussion.</p><p>Anyhow, I don’t know if this is a case of pimping a bigger media ho or what, but considering how the Powerline guys couldn’t be bothered to show up to defend their little friend on their own show last summer, this ringing defense tends to ring a bit hollow in my ears.</p><p>Hey, do what you do.  Win awards.  Whatever.</p></div>",
  "content_text": "Powerline\ndefends the Republican Party’s favorite affirmative action doll\n:\nMichelle comes in for more than her fair share of abuse because of her gender and ethnicity–you could pursue this line of thought further, but I don’t recommend it–but she stands so far above her mostly-anonymous left-wing critics that their slanders reflect only on them.\nI’m not anonymous.  I’m not left-wing.  And yet I, too, think Malkin is a media whore as full of\nmerde\nas most of her left-wing critics.  Sure, she comes in for some unfair criticism as do we all, but she is nevertheless an incompetent and intellectually dishonest armchair historian who is willing to lie rather than run the risk of being exposed for an ignorant sham.\nAs for her gender, not even those who like her columns take her very seriously.  Ann Coulter is respected in part because she isn’t afraid to take on anyone, while Malkin not only ran from me but couldn’t handle that rapier wit Chris Matthews when he hadn’t even read the book under discussion.\nAnyhow, I don’t know if this is a case of pimping a bigger media ho or what, but considering how the Powerline guys couldn’t be bothered to show up to defend their little friend on their own show last summer, this ringing defense tends to ring a bit hollow in my ears.\nHey, do what you do.  Win awards.  Whatever.",
  "tags": [],
  "categories": [],
  "sitemap_lastmod": "2005-08-08T11:20:00+00:00"
}