{
  "url": "https://voxday.net/2005/08/11/red-herring-man/",
  "scraped_at": "2026-01-08T20:11:25.909471",
  "title": "Red Herring Man",
  "date_display": "August 11, 2005",
  "date_iso": "2005-08-11T11:14:00+00:00",
  "date_from_url": "2005-08-11",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>Dispatches from the Culture Wars <a href=\"http://www.stcynic.com/blog/archives/2005/08/vox_day_follow.php\">is still hung up on cars and hot babes</a>:</p><blockquote><p>Okay, this is quite amusing. Someone posted a link over on [Vox Popoli] to my previous little dig at him and his crying need to bring up his Porsche (turbo, even) as proof that he isn’t bitter toward women. And this was his response:</p><p><em>Do better than what? The guy didn’t say anything. He clearly missed the point of the Porsche comment, which was to skip the usual red herring whenever a topic critical of feminism is broached.  Perhaps I should have just explained that I have Real Ultimate Power and I pork hot babes without even thinking twice about it. Perhaps then Mr. Braydon (sic) would been able to follow the logical sequence.</em></p><p>I nearly spit my iced tea all over my monitor laughing at this. Let me assure you, <em>[Dispatches, apparently having little Greek or Latin, seems to think he’s outing me or something]</em>, I got the “logical sequence”. The problem is that it just isn’t terribly logical. It was obvious that the point you were trying to make is that you “pork hot babes” a lot and therefore could not hate women or have a bitter attitude toward them. But that is, of course, a non sequitur. Most of the really promiscuous guys I know hate women, even if they won’t admit it. So since your mention of the fact that you drove a Porsche serves no logical purpose, it can only function as your means of striking the stud pose. And that’s pretty damn pathetic. Which was my whole point. I’m sure this will bring even more of them over here to make juvenile comments about horse manure, but hey, it’s kinda fun watching them make asses of themselves. It’s even more amusing to watch them gather around him and assure him that despite what that mean man said, he really is cool (and also “hot”, according to one commenter).</p></blockquote><p>Now I’m beginning to suspect that Dispatches not only has issues with Porsches, but women as well.  I’ll try typing even slower, as this poor guy hasn’t even made it past the first two paragraphs of Monday’s column yet.  Even Lisa Lisa, despite her proclivity for ankle-swallowing, managed to do better than that.</p><p>1.  When a male columnist writes a column critical of women, women’s rights or feminism, he inevitably receives many responses asserting that he has only done so because he is bitter, not in a general sense as Dispatches has interpreted, but specifically because he has had insufficient sex with women over the course of his life.  This has happened every single time I have written a column on any such subject, dating back to the notorious <a href=\"http://www.voxday.net/cgi-bin/perlfect/search/search.pl?q=spiting&amp;showurl=%2Farchive%2F2003%2F020303.html\">Spiting Their Pretty Faces</a> column in February 2003.  One woman even made the accusation when I was on a Toronto radio show following that column.</p><p>2.  Young men with expensive sports cars and recording contracts with record companies attract a lot of attention from young women.  When they play on stage, women bare their breasts, attempt to sneak backstage before and after the show to give them their phone numbers and home addresses and so forth.  These women also tend to be far more attractive than the run-of-the-mill mall shopper.  Many men wish this was not the case, but everyone from Mick Jagger down to the guy who sings Van Halen covers on Tuesday nights at the local dive can testify to the truth of this.</p><p>3.  I was fortunate enough to have possessed both an expensive sports car and record contracts with Wax Trax! Records and TVT Records soon after graduating from university.  I have written several songs that appeared on various Billboard charts (although not the one that really matters, unfortunately), my band’s music was featured in several movies and video games and we even won a Minnesota Music Award for which Prince and other notable musicians were also nominated.  My experience in the music world was a typical one.</p><p>4.  Despite my morally objectionable past, I was fortunate enough to subsequently encounter a beautiful blonde girl who was willing to sign on as my permanent partner-in-crime.</p><p>5.  As I wrote in the article, I brought this up only to avoid the red herring on which Dispatches From the Bunker is presently choking.  Interestingly enough, this is the first column on the subject wherein my many female critics did not make a single insinuation about my romantic life or lack thereof.</p><p>5.  Ergo, it defies logic to conclude that one can dismiss the contents of the column because the author has been granted insufficient access to slake his male lust on willing women’s bodies, even if it made any sense to do so in the first place.</p><p>If we can assume that Dispatches is capable of working his way through that tortuous forest of logic laid out above, perhaps he will deign to actually try addressing the substance of the column.  As it stands, he now even admits to having made no attempt to do so: <em>“I didn’t really attempt to make a factual argument in response to his position on women’s rights….  I didn’t address his position at all, nor did I intend to.”</em> We shall follow his future progress with interest.</p><p>This strange reaction to a single mention of automotive excellence rather reminds me of the Mensa issue, which still surfaces from time to time.  In this case, one reference to past Porsche ownership in four years of columns and 18 months of blogging is somehow magically transformed into a deep psychological issue.   This is especially strange considering that I got rid of that particular car years ago.</p><p>I suppose it would be a mistake to tell him about the Ferrari….</p></div>",
  "content_text": "Dispatches from the Culture Wars\nis still hung up on cars and hot babes\n:\nOkay, this is quite amusing. Someone posted a link over on [Vox Popoli] to my previous little dig at him and his crying need to bring up his Porsche (turbo, even) as proof that he isn’t bitter toward women. And this was his response:\nDo better than what? The guy didn’t say anything. He clearly missed the point of the Porsche comment, which was to skip the usual red herring whenever a topic critical of feminism is broached.  Perhaps I should have just explained that I have Real Ultimate Power and I pork hot babes without even thinking twice about it. Perhaps then Mr. Braydon (sic) would been able to follow the logical sequence.\nI nearly spit my iced tea all over my monitor laughing at this. Let me assure you,\n[Dispatches, apparently having little Greek or Latin, seems to think he’s outing me or something]\n, I got the “logical sequence”. The problem is that it just isn’t terribly logical. It was obvious that the point you were trying to make is that you “pork hot babes” a lot and therefore could not hate women or have a bitter attitude toward them. But that is, of course, a non sequitur. Most of the really promiscuous guys I know hate women, even if they won’t admit it. So since your mention of the fact that you drove a Porsche serves no logical purpose, it can only function as your means of striking the stud pose. And that’s pretty damn pathetic. Which was my whole point. I’m sure this will bring even more of them over here to make juvenile comments about horse manure, but hey, it’s kinda fun watching them make asses of themselves. It’s even more amusing to watch them gather around him and assure him that despite what that mean man said, he really is cool (and also “hot”, according to one commenter).\nNow I’m beginning to suspect that Dispatches not only has issues with Porsches, but women as well.  I’ll try typing even slower, as this poor guy hasn’t even made it past the first two paragraphs of Monday’s column yet.  Even Lisa Lisa, despite her proclivity for ankle-swallowing, managed to do better than that.\n1.  When a male columnist writes a column critical of women, women’s rights or feminism, he inevitably receives many responses asserting that he has only done so because he is bitter, not in a general sense as Dispatches has interpreted, but specifically because he has had insufficient sex with women over the course of his life.  This has happened every single time I have written a column on any such subject, dating back to the notorious\nSpiting Their Pretty Faces\ncolumn in February 2003.  One woman even made the accusation when I was on a Toronto radio show following that column.\n2.  Young men with expensive sports cars and recording contracts with record companies attract a lot of attention from young women.  When they play on stage, women bare their breasts, attempt to sneak backstage before and after the show to give them their phone numbers and home addresses and so forth.  These women also tend to be far more attractive than the run-of-the-mill mall shopper.  Many men wish this was not the case, but everyone from Mick Jagger down to the guy who sings Van Halen covers on Tuesday nights at the local dive can testify to the truth of this.\n3.  I was fortunate enough to have possessed both an expensive sports car and record contracts with Wax Trax! Records and TVT Records soon after graduating from university.  I have written several songs that appeared on various Billboard charts (although not the one that really matters, unfortunately), my band’s music was featured in several movies and video games and we even won a Minnesota Music Award for which Prince and other notable musicians were also nominated.  My experience in the music world was a typical one.\n4.  Despite my morally objectionable past, I was fortunate enough to subsequently encounter a beautiful blonde girl who was willing to sign on as my permanent partner-in-crime.\n5.  As I wrote in the article, I brought this up only to avoid the red herring on which Dispatches From the Bunker is presently choking.  Interestingly enough, this is the first column on the subject wherein my many female critics did not make a single insinuation about my romantic life or lack thereof.\n5.  Ergo, it defies logic to conclude that one can dismiss the contents of the column because the author has been granted insufficient access to slake his male lust on willing women’s bodies, even if it made any sense to do so in the first place.\nIf we can assume that Dispatches is capable of working his way through that tortuous forest of logic laid out above, perhaps he will deign to actually try addressing the substance of the column.  As it stands, he now even admits to having made no attempt to do so:\n“I didn’t really attempt to make a factual argument in response to his position on women’s rights….  I didn’t address his position at all, nor did I intend to.”\nWe shall follow his future progress with interest.\nThis strange reaction to a single mention of automotive excellence rather reminds me of the Mensa issue, which still surfaces from time to time.  In this case, one reference to past Porsche ownership in four years of columns and 18 months of blogging is somehow magically transformed into a deep psychological issue.   This is especially strange considering that I got rid of that particular car years ago.\nI suppose it would be a mistake to tell him about the Ferrari….",
  "tags": [],
  "categories": [],
  "sitemap_lastmod": "2005-08-11T10:14:00+00:00"
}