{
  "url": "https://voxday.net/2005/08/24/some-moles-need-second-whack/",
  "scraped_at": "2026-01-08T20:13:04.833179",
  "title": "Some moles need a second whack",
  "date_display": "August 24, 2005",
  "date_iso": "2005-08-24T10:07:00+00:00",
  "date_from_url": "2005-08-24",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>Orac <a href=\"http://oracknows.blogspot.com/2005/08/dont-say-i-didnt-warn-you.html\">demonstrates that he doesn’t know much</a> about fascism or socialism:</p><blockquote><p>Not that Vox’s arguments are usually all that difficult to refute, given his love of confusing correlation with causation an dubious historical analogies, but Vox seems to have attracted a posse of sycophants, toadies, and lackies (apologies to Curtis Sliwa) who descend upon other blogs that criticize Vox whenever he mentions articles critical of him. To that end, in the comments of Ed’s post, I pointed out my encounter with Vox a few months ago, when I lambasted him for a post he made in which he said that “too many women are fascists at heart,” using this as a justification for arguing that they should not have the right to vote. He then went on to blame the women’s franchise for the “West’s continental drift towards socialism.” (But how can that be, Vox? I thought you said women were “fascists at heart.”)</p></blockquote><p>Fascism, is, <a href=\"http://www.voxday.net/cave/planks.html\">like national socialism</a>, an offshoot of Marxian socialism.  They were attempts to correct for Marx’s obvious errors, as were Lenism (agrarian pre-industrial communism), Stalism (national communism) and Maoism (agrarian anti-industrial communism).  And while correlation is not necessarily causation, when the correlation a powerful and reliable one across a variety of samples, then one needs to at least consider the possibility that the relationship is causal.  As to the historical analogies, I find it interesting that no one ever seems to be able to refute them or explain why they are dubious.</p><p>And again, the obsession with Mensa.  I like to “point it out”?  Really?  I’d like to see if anyone can cite a single example of when I’ve brought it up aside from the single line in my bio.  I wouldn’t consider removing it, in light of how much it obviously bothers these comparatively low-wattage individuals.</p><p>With regards to the supposed ease with which my arguments can be refuted, it seems rather strange that it is nevertheless so infrequently done.  Why people <a href=\"http://3bulls.blogspot.com/2005/08/i-will-forever-hate-sadly-no-for-not.html\">are even complaining</a> that other bloggers do not deign to bother with this remarkably easy task.  Perhaps Orac does not understand that merely asserting an argument has been refuted is not tantamount to actually doing so.</p></div>",
  "content_text": "Orac\ndemonstrates that he doesn’t know much\nabout fascism or socialism:\nNot that Vox’s arguments are usually all that difficult to refute, given his love of confusing correlation with causation an dubious historical analogies, but Vox seems to have attracted a posse of sycophants, toadies, and lackies (apologies to Curtis Sliwa) who descend upon other blogs that criticize Vox whenever he mentions articles critical of him. To that end, in the comments of Ed’s post, I pointed out my encounter with Vox a few months ago, when I lambasted him for a post he made in which he said that “too many women are fascists at heart,” using this as a justification for arguing that they should not have the right to vote. He then went on to blame the women’s franchise for the “West’s continental drift towards socialism.” (But how can that be, Vox? I thought you said women were “fascists at heart.”)\nFascism, is,\nlike national socialism\n, an offshoot of Marxian socialism.  They were attempts to correct for Marx’s obvious errors, as were Lenism (agrarian pre-industrial communism), Stalism (national communism) and Maoism (agrarian anti-industrial communism).  And while correlation is not necessarily causation, when the correlation a powerful and reliable one across a variety of samples, then one needs to at least consider the possibility that the relationship is causal.  As to the historical analogies, I find it interesting that no one ever seems to be able to refute them or explain why they are dubious.\nAnd again, the obsession with Mensa.  I like to “point it out”?  Really?  I’d like to see if anyone can cite a single example of when I’ve brought it up aside from the single line in my bio.  I wouldn’t consider removing it, in light of how much it obviously bothers these comparatively low-wattage individuals.\nWith regards to the supposed ease with which my arguments can be refuted, it seems rather strange that it is nevertheless so infrequently done.  Why people\nare even complaining\nthat other bloggers do not deign to bother with this remarkably easy task.  Perhaps Orac does not understand that merely asserting an argument has been refuted is not tantamount to actually doing so.",
  "tags": [],
  "categories": [],
  "sitemap_lastmod": "2005-08-24T09:07:00+00:00"
}