{
  "url": "https://voxday.net/2005/08/12/struggling-with-concepts/",
  "scraped_at": "2026-01-08T20:11:35.097626",
  "title": "Struggling with the concepts",
  "date_display": "August 12, 2005",
  "date_iso": "2005-08-12T11:03:00+00:00",
  "date_from_url": "2005-08-12",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>A historian and eminent supporter of the struggle against violent extremism writes of the struggle in Iraq:</p><blockquote><p><a href=\"http://www.nationalreview.com/hanson/hanson200508080827.asp\">My own view remains absolutely unchanged</a> — that we were right, in both a practical and a moral sense, in removing Saddam, that despite depressing lows and giddy highs, the democratic reconstruction of Iraq will work out, that an emerging constitutional government will make both Americans safer and the Middle East in general more stable, that preexisting jihadists are flocking to Iraq and being defeated rather than being created ex nihilo, that anti-Americanism will gradually subside in the Muslim world as millions see that we are consistent in our support of democratic reform, that the United States military has proved itself the preeminent fighting force in the world today and is on the offensive in Iraq and winning a difficult asymmetrical campaign, and that old allies in Europe and Japan and new ones from India to Russia will slowly come to appreciate American constancy and leadership as never before.</p><p>But I am not naïve enough to think that most Americans at this moment would agree with all — or any — of that.</p></blockquote><p>VDH’s analysis presupposes so many things.  One is that consistent American support for democratic reform will reduce Muslim ant-Americanism.  This statement alone has two major flaws, the first being that American support for democratic reform is anything but consistent, even today.  Americans may not realize it, but the Muslim world is perfectly aware that the administration stand firmly against free democratic elections and self-determination in Turkey, Algeria, Afghanistan and, yes, Iraq.</p><p>Second, the reason we do is that free elections are considered likely to bring jihadist political parties like Hamas to power, so that even if we were consistently supporting democratic reform, anti-Americanism would likely increase, not decrease.  Hence George Delano’s support for his good friend and noted democrat, King Abdullah of Saudi Arabia.</p><p>Now, I am not aware of any statistical measure that tracks the creation of jihadists, but it is clear that they are striking where they were not striking before, and the number of American casualties in Iraq continues to remain at levels from which they were long ago expected to subside.  I have yet to see the administration produce any evidence that the killer tar-baby strategy is working.</p><p>If, as has been estimated by pro-struggle experts such as Daniel Pipes, ten percent of the Muslim world consists of extremists, and if killing 50 jihadists in a day is considered a newsworthy accomplishment by our armed forces, then it will take at least 3,852 years to eliminate all of those extremists even if a) only male extremists count, and b) not a single new jihadist is created in the process.  No wonder the president doesn’t see an end to this struggle.</p><p>Let’s not even get started with the likelihood that France, Germany and Russia will come to appreciate American leadership, no matter what happens.</p><p>Nevertheless, I still have to respect VDH.  At least he is intellectually honest enough to admit that most Americans are no longer buying this increasingly transparent business.</p></div>",
  "content_text": "A historian and eminent supporter of the struggle against violent extremism writes of the struggle in Iraq:\nMy own view remains absolutely unchanged\n— that we were right, in both a practical and a moral sense, in removing Saddam, that despite depressing lows and giddy highs, the democratic reconstruction of Iraq will work out, that an emerging constitutional government will make both Americans safer and the Middle East in general more stable, that preexisting jihadists are flocking to Iraq and being defeated rather than being created ex nihilo, that anti-Americanism will gradually subside in the Muslim world as millions see that we are consistent in our support of democratic reform, that the United States military has proved itself the preeminent fighting force in the world today and is on the offensive in Iraq and winning a difficult asymmetrical campaign, and that old allies in Europe and Japan and new ones from India to Russia will slowly come to appreciate American constancy and leadership as never before.\nBut I am not naïve enough to think that most Americans at this moment would agree with all — or any — of that.\nVDH’s analysis presupposes so many things.  One is that consistent American support for democratic reform will reduce Muslim ant-Americanism.  This statement alone has two major flaws, the first being that American support for democratic reform is anything but consistent, even today.  Americans may not realize it, but the Muslim world is perfectly aware that the administration stand firmly against free democratic elections and self-determination in Turkey, Algeria, Afghanistan and, yes, Iraq.\nSecond, the reason we do is that free elections are considered likely to bring jihadist political parties like Hamas to power, so that even if we were consistently supporting democratic reform, anti-Americanism would likely increase, not decrease.  Hence George Delano’s support for his good friend and noted democrat, King Abdullah of Saudi Arabia.\nNow, I am not aware of any statistical measure that tracks the creation of jihadists, but it is clear that they are striking where they were not striking before, and the number of American casualties in Iraq continues to remain at levels from which they were long ago expected to subside.  I have yet to see the administration produce any evidence that the killer tar-baby strategy is working.\nIf, as has been estimated by pro-struggle experts such as Daniel Pipes, ten percent of the Muslim world consists of extremists, and if killing 50 jihadists in a day is considered a newsworthy accomplishment by our armed forces, then it will take at least 3,852 years to eliminate all of those extremists even if a) only male extremists count, and b) not a single new jihadist is created in the process.  No wonder the president doesn’t see an end to this struggle.\nLet’s not even get started with the likelihood that France, Germany and Russia will come to appreciate American leadership, no matter what happens.\nNevertheless, I still have to respect VDH.  At least he is intellectually honest enough to admit that most Americans are no longer buying this increasingly transparent business.",
  "tags": [],
  "categories": [],
  "sitemap_lastmod": "2005-08-12T10:03:00+00:00"
}