{
  "url": "https://voxday.net/2005/08/04/what-i-learned-in-san-francisco/",
  "scraped_at": "2026-01-08T20:10:28.808839",
  "title": "What I learned in San Francisco",
  "date_display": "August 4, 2005",
  "date_iso": "2005-08-04T11:03:00+00:00",
  "date_from_url": "2005-08-04",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p><em>This is not <a href=\"http://www.worldnetdaily.com/news/article.asp?ARTICLE_ID=45599\">a Ben Shapiro column</a>, this is just a tribute.</em></p><p>I’m a Midwestern boy, born and bred. I’ve lived in host of very small cities of which you’ve probably never heard, sometimes near live animals.  Even though my parents are from the East Coast, the closest I’ve ever come to big city living is watching Friends.  The friends often visit a coffee shop called Central Perk, which is a very clever play on words because it is located next to <em>Central Park</em> in New York City. So when I was invited by my uncle’s cousin’s friend’s family to visit San Francisco, I was very excited.</p><p>Many people in flyover country like to look down on people in blue state country, because they are all going to Hell. It’s no surprise that our preacher paints inhabitants of the East Coast and the West Coast as pagan, often evil, straight out of Sodom and Gomorrah.   Anyone who says “cah” instead of car or has a name ending in a vowel is labeled unamerican by those in the Midwest. Looking down on coastal dwellers gives lots of Midwesterners a sense of superiority, secure in their knowledge that they are more righteous, less likely to impregnate a 14 year-old Vietnamese immigrant and more decent than the disease-ridden people in the urban hellholes. After all, out in Rochester and Fargo there are boys who don’t call each other “dog”, milk delivery services and churches where the pastor still believes in God. What could be nicer?</p><p>Well, after spending a few days in the city by the Bay, it’s even clearer to me that the Midwestern elitists have everything upside down.  Here are just a few of the lessons I learned from folks who live on the coasts:</p><p><b>Looking people in the eye isn’t a crime.</b> Just the other day, a very muscular man with a mustache wearing a police hat and a sleeveless leather vest was staring at me.  When he saw me notice him, he gave me a big smile and invited me to a dance party.  Wasn’t that nice!</p><p><b>You don’t have to keep your distance, friend!</b> In the Midwest, people don’t like to touch each other, especially men.  Here in the friendly big city, people will greet each other with hugs, even kisses sometimes.  Those mustaches sure tickle!  But I think one very ugly woman who was wearing fishnet stockings might have overdone it a little when she grabbed my behind and asked if I’d ever played Wheelbarrow before.</p><p><b>There’s plenty of time.</b> There’s always a pot of coffee on at my parent’s house, and that Norwegian black tar sure can keep you up at night.  But my new friends at Aunt Charlie’s Lounge have turned me on to something that works even better.  Two hits of their homemade crystal meth and suddenly you feel like there’s 48 hours in the day!</p><p><em>Tune in next week, when young Mr. Shapiro reports his exciting new discovery that south of the border, a strange and incomprehensible language called “Espanol” is being spoken by the short, brown-skinned natives.</em></p></div>",
  "content_text": "This is not\na Ben Shapiro column\n, this is just a tribute.\nI’m a Midwestern boy, born and bred. I’ve lived in host of very small cities of which you’ve probably never heard, sometimes near live animals.  Even though my parents are from the East Coast, the closest I’ve ever come to big city living is watching Friends.  The friends often visit a coffee shop called Central Perk, which is a very clever play on words because it is located next to\nCentral Park\nin New York City. So when I was invited by my uncle’s cousin’s friend’s family to visit San Francisco, I was very excited.\nMany people in flyover country like to look down on people in blue state country, because they are all going to Hell. It’s no surprise that our preacher paints inhabitants of the East Coast and the West Coast as pagan, often evil, straight out of Sodom and Gomorrah.   Anyone who says “cah” instead of car or has a name ending in a vowel is labeled unamerican by those in the Midwest. Looking down on coastal dwellers gives lots of Midwesterners a sense of superiority, secure in their knowledge that they are more righteous, less likely to impregnate a 14 year-old Vietnamese immigrant and more decent than the disease-ridden people in the urban hellholes. After all, out in Rochester and Fargo there are boys who don’t call each other “dog”, milk delivery services and churches where the pastor still believes in God. What could be nicer?\nWell, after spending a few days in the city by the Bay, it’s even clearer to me that the Midwestern elitists have everything upside down.  Here are just a few of the lessons I learned from folks who live on the coasts:\nLooking people in the eye isn’t a crime.\nJust the other day, a very muscular man with a mustache wearing a police hat and a sleeveless leather vest was staring at me.  When he saw me notice him, he gave me a big smile and invited me to a dance party.  Wasn’t that nice!\nYou don’t have to keep your distance, friend!\nIn the Midwest, people don’t like to touch each other, especially men.  Here in the friendly big city, people will greet each other with hugs, even kisses sometimes.  Those mustaches sure tickle!  But I think one very ugly woman who was wearing fishnet stockings might have overdone it a little when she grabbed my behind and asked if I’d ever played Wheelbarrow before.\nThere’s plenty of time.\nThere’s always a pot of coffee on at my parent’s house, and that Norwegian black tar sure can keep you up at night.  But my new friends at Aunt Charlie’s Lounge have turned me on to something that works even better.  Two hits of their homemade crystal meth and suddenly you feel like there’s 48 hours in the day!\nTune in next week, when young Mr. Shapiro reports his exciting new discovery that south of the border, a strange and incomprehensible language called “Espanol” is being spoken by the short, brown-skinned natives.",
  "tags": [],
  "categories": [],
  "sitemap_lastmod": "2005-08-04T10:03:00+00:00"
}