{
  "url": "https://voxday.net/2005/08/24/why-women-shoudnt-vote-prime-example/",
  "scraped_at": "2026-01-08T20:13:06.657807",
  "title": "Why women shoudn’t vote: a prime example",
  "date_display": "August 24, 2005",
  "date_iso": "2005-08-24T11:08:00+00:00",
  "date_from_url": "2005-08-24",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>Amanda embarasses herself by <a href=\"http://www.pandagon.net/archives/2005/08/voting_is_cutti.html\">defending women’s suffrage</a>:</p><blockquote><p>I considered mocking the onslaught of conservative bloggers who’ve picked up the baton that Drudge threw and are dogpiling the grieving mother of a fallen solider, each more sure than the other that they know that this man would hate his own mother for not wanting him to be dead. But it’s too depressing. Instead, a reader sent me another article by Vox Day at WorldNetDaily calling for women to give up the right to vote because voting means they have to get out of bed, shut their legs so they can walk and get thee to the voting booth, losing valuable baby-making hours. Civilization is in great danger….</p><p>Why of course women are supposedly clamoring for the opportunity to get into an unequal relationship they are legally prevented from escaping is beyond me.  Then he makes up a bunch of shit about the economy that he doesn’t understand, but to summarize–incomes went down and women were forced to work because women were already working. Those who didn’t sprout penises, that is. All this means that men shouldn’t be able to retire. No, I’m serious. That’s what he concludes.</p></blockquote><p>That’s quite the rebuttal… apparently citing easily verifiable BLS statistics and comparing them to government-supplied wage and GDP data is equivalent to making up “a bunch of shit”.  And she wonders why I don’t think women voting is a good thing.</p><p>As you’d expect, her commenters are even more hopeless.  I’m still curious to know how these poor cretins believe 21 million immigrants are a serious threat to American jobs and wages, but expect 34 million women to be able to enter the labor force with no effect on anything whatsoever.  And, like a good left-liberal, she believes that ending sex-selected gendercide is a simple matter of re-educating 6,000 years of cultural tradition out of 1.3 billion people.  If Mao couldn’t do it by killing 50 million people, a little finger-wagging is hardly going to do the trick.  Isn’t it remarkable how feminist solutions inevitably involve someone else’s re-education?</p><p>Insular and maleducated Americans of Amanda’s ilk don’t understand that Western civilization is imperiled because they live in the only Western country with birth rates that are even close to the replacement rate.  Spend an afternoon in one of Italy’s ghost towns or walk through one of the Islamic ghettos of France and you’ll soon begin to realize that this is not an abstract issue, but a serious and problematic challenge.</p><p>UPDATE: here’s <a href=\"http://www.livejournal.com/users/easilyirritable/329925.html\">another nice example</a>.  The amazing thing is how they found the Electrolyte people to be convincing.  My favorite was the one guy’s attempt to cite the woman professor with the astrophysics BA as proof of women’s interest in hard sciences when she was employed by the women’s studies department and teaching classes on homosexuality in Indian film.</p></div>",
  "content_text": "Amanda embarasses herself by\ndefending women’s suffrage\n:\nI considered mocking the onslaught of conservative bloggers who’ve picked up the baton that Drudge threw and are dogpiling the grieving mother of a fallen solider, each more sure than the other that they know that this man would hate his own mother for not wanting him to be dead. But it’s too depressing. Instead, a reader sent me another article by Vox Day at WorldNetDaily calling for women to give up the right to vote because voting means they have to get out of bed, shut their legs so they can walk and get thee to the voting booth, losing valuable baby-making hours. Civilization is in great danger….\nWhy of course women are supposedly clamoring for the opportunity to get into an unequal relationship they are legally prevented from escaping is beyond me.  Then he makes up a bunch of shit about the economy that he doesn’t understand, but to summarize–incomes went down and women were forced to work because women were already working. Those who didn’t sprout penises, that is. All this means that men shouldn’t be able to retire. No, I’m serious. That’s what he concludes.\nThat’s quite the rebuttal… apparently citing easily verifiable BLS statistics and comparing them to government-supplied wage and GDP data is equivalent to making up “a bunch of shit”.  And she wonders why I don’t think women voting is a good thing.\nAs you’d expect, her commenters are even more hopeless.  I’m still curious to know how these poor cretins believe 21 million immigrants are a serious threat to American jobs and wages, but expect 34 million women to be able to enter the labor force with no effect on anything whatsoever.  And, like a good left-liberal, she believes that ending sex-selected gendercide is a simple matter of re-educating 6,000 years of cultural tradition out of 1.3 billion people.  If Mao couldn’t do it by killing 50 million people, a little finger-wagging is hardly going to do the trick.  Isn’t it remarkable how feminist solutions inevitably involve someone else’s re-education?\nInsular and maleducated Americans of Amanda’s ilk don’t understand that Western civilization is imperiled because they live in the only Western country with birth rates that are even close to the replacement rate.  Spend an afternoon in one of Italy’s ghost towns or walk through one of the Islamic ghettos of France and you’ll soon begin to realize that this is not an abstract issue, but a serious and problematic challenge.\nUPDATE: here’s\nanother nice example\n.  The amazing thing is how they found the Electrolyte people to be convincing.  My favorite was the one guy’s attempt to cite the woman professor with the astrophysics BA as proof of women’s interest in hard sciences when she was employed by the women’s studies department and teaching classes on homosexuality in Indian film.",
  "tags": [],
  "categories": [],
  "sitemap_lastmod": "2005-08-24T10:08:00+00:00"
}