{
  "url": "https://voxday.net/2005/08/24/why-dont-women-have-to-vote/",
  "scraped_at": "2026-01-08T20:13:03.022964",
  "title": "Why don’t women have to vote?",
  "date_display": "August 24, 2005",
  "date_iso": "2005-08-24T09:03:00+00:00",
  "date_from_url": "2005-08-24",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>Thoughts From Kansas <a href=\"http://jgrr.blogspot.com/2005/08/womens-vote.html\">considers the matter beyond debate</a>:</p><blockquote><p>Reuel Marc Gerecht, Administration flunky On Meet the Press via Atrios: In 1900, women did not have the right to vote. “If Iraqis could develop a democracy that resembled America in the 1900s, I think we’d all be thrilled. I mean, women’s social rights are not critical to the evolution of democracy.”</p><p>Conservative jackass Vox Day has a habit of attacking women’s suffrage as the root of all evil, claiming that: “Far too many women are fascists at heart” (Infinite thanks to Orac for linking to that execrable piece so that I don’t have to.)</p><p>…Why don’t Republicans all agree that women have to be allowed to vote?</p></blockquote><p>1.  There is no evidence that women voting has been a positive development in any nation in the world.  Should someone like to submit some for once, I’d be happy to examine it.  I find it telling that no supporter of women’s suffrage has yet been able to respond with anything but naked and unsupportable assertions.</p><p>2.  There is no correlation between voting and the defense of life, liberty and property rights.  The two countries which top the Heritage Foundation’s <a href=\"http://www.heritage.org/research/features/index/countries.cfm\">Index of Economic Freedom</a>, Hong Kong and Singapore, have severe restrictions on voting and political representation.  In Hong Kong, only one-third of the legislative council is elected.  In Singapore, voting is considered a privilege, not a right.  Meanwhile, voting is permitted and even required in most of the countries that make up the bottom ten, including Cuba and Zimbabwe.</p><p>3.  History shows that the women’s vote is inextricably tied to a substantive loss of individual freedom.  Only 22 years after women received the right to vote in Switzerland, that country passed an amendment to its constitution giving the federal government the right to pass legislation relating to firearms.  Within four years, legislation had passed requiring permits for weapons purchases, permits for bearing arms in public and banning handguns, in direct contradiction of its centuries-old militia tradition, and now the militia system itself is under attack by the SDP, the Swiss Socialist Party.</p><p>4.  The opponents of women’s suffrage have been proven correct with regards to their predictions of a) increased divorce, b) increased abortion, c) sexual promiscuity, d) increased paganism.</p><p>5.  John Lott has <a href=\"http://www.patriotist.com/files/lottwmn.zip\">demonstrated a strong correlative link</a> between women’s suffrage and increased per capita state expenditures.  The average increase in voter turnouts of 26 and 33 percent that occurred 25 and 45 years after the enactment of women’s suffrage in a US state mirror the 24 and 31 percent increases in state spending over the same periods of time.  He also concluded: “The two consistent results were: allowing female suffrage resulted in a more liberal tilt in congressional voting for both houses, and the extent of that shift was mirrored by the increase in turnout due to female suffrage.  The effects are quite large.”</p><p>So, perhaps Thoughts From Kansas would do well to consider a more salient question, namely, why would any Republican, or any non-Republican like myself, who opposes more government spending, higher taxation, more divorce, more single-parent households, more social pathologies and more government control over individual behavior, agree that women have to be allowed to vote?</p><p>Perhaps not all women are fascists at heart, but without their votes, few fascists would ever be elected.</p></div>",
  "content_text": "Thoughts From Kansas\nconsiders the matter beyond debate\n:\nReuel Marc Gerecht, Administration flunky On Meet the Press via Atrios: In 1900, women did not have the right to vote. “If Iraqis could develop a democracy that resembled America in the 1900s, I think we’d all be thrilled. I mean, women’s social rights are not critical to the evolution of democracy.”\nConservative jackass Vox Day has a habit of attacking women’s suffrage as the root of all evil, claiming that: “Far too many women are fascists at heart” (Infinite thanks to Orac for linking to that execrable piece so that I don’t have to.)\n…Why don’t Republicans all agree that women have to be allowed to vote?\n1.  There is no evidence that women voting has been a positive development in any nation in the world.  Should someone like to submit some for once, I’d be happy to examine it.  I find it telling that no supporter of women’s suffrage has yet been able to respond with anything but naked and unsupportable assertions.\n2.  There is no correlation between voting and the defense of life, liberty and property rights.  The two countries which top the Heritage Foundation’s\nIndex of Economic Freedom\n, Hong Kong and Singapore, have severe restrictions on voting and political representation.  In Hong Kong, only one-third of the legislative council is elected.  In Singapore, voting is considered a privilege, not a right.  Meanwhile, voting is permitted and even required in most of the countries that make up the bottom ten, including Cuba and Zimbabwe.\n3.  History shows that the women’s vote is inextricably tied to a substantive loss of individual freedom.  Only 22 years after women received the right to vote in Switzerland, that country passed an amendment to its constitution giving the federal government the right to pass legislation relating to firearms.  Within four years, legislation had passed requiring permits for weapons purchases, permits for bearing arms in public and banning handguns, in direct contradiction of its centuries-old militia tradition, and now the militia system itself is under attack by the SDP, the Swiss Socialist Party.\n4.  The opponents of women’s suffrage have been proven correct with regards to their predictions of a) increased divorce, b) increased abortion, c) sexual promiscuity, d) increased paganism.\n5.  John Lott has\ndemonstrated a strong correlative link\nbetween women’s suffrage and increased per capita state expenditures.  The average increase in voter turnouts of 26 and 33 percent that occurred 25 and 45 years after the enactment of women’s suffrage in a US state mirror the 24 and 31 percent increases in state spending over the same periods of time.  He also concluded: “The two consistent results were: allowing female suffrage resulted in a more liberal tilt in congressional voting for both houses, and the extent of that shift was mirrored by the increase in turnout due to female suffrage.  The effects are quite large.”\nSo, perhaps Thoughts From Kansas would do well to consider a more salient question, namely, why would any Republican, or any non-Republican like myself, who opposes more government spending, higher taxation, more divorce, more single-parent households, more social pathologies and more government control over individual behavior, agree that women have to be allowed to vote?\nPerhaps not all women are fascists at heart, but without their votes, few fascists would ever be elected.",
  "tags": [],
  "categories": [],
  "sitemap_lastmod": "2005-08-24T08:03:00+00:00"
}