{
  "url": "https://voxday.net/2005/08/31/you-have-to-love-those-strong-women/",
  "scraped_at": "2026-01-08T20:41:22.235623",
  "title": "You have to love those Strong Women Leaders",
  "date_display": "August 31, 2005",
  "date_iso": "2005-08-31T16:01:00+00:00",
  "date_from_url": "2005-08-31",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>From NRO’s Corner:</p><blockquote><p>L-LO quotes a reader: “This woman [Louisiana Governor Kathleen Babineaux Blanco] is lost and looks lost. She may have won the election but she has no business being in charge of anything. Watching her on TV the last two days has made this pretty clear. Now is not the time to be sobbing. She sure as hell should not be doing it on the tube in front of her fellow citizens – the ones looking to her for leadership.”</p><p>JPOD:  the governor of LA is emotionally broken. She keeps speaking of “trying to figure out” how to evacuate people; “trying to figure out” how to put refugees somewhere else, etc. As you noted, she can’t even say that looting is wrong; the most outrage she can muster is “where are they taking the loot to, anyway?” She can’t even see that her brokenness demonstrates that no one is in charge, and the more that people see that, the more utter chaos and lawlessness are spread.</p></blockquote><p>I’m just kind of curious, what else was everyone expecting?  Most women crack under even minor pressure and having thousands of lives at stake in the wake of a natural disaster and knowing that your decisions will likely condemn people to death is a tremendous responsibility.</p><p>If I were a politician running against a woman, I’d be playing this tape followed by Patricia Schroeder’s similar – albeit even less justified – tears.  Sure, the media would completely flip out and the women’s groups would go nuts, but so what?  The point is to win the election, after all, not make your opponent feel swell about herself.</p><p>That being said, it’s no surprise that the neoconservative Podhoretz wants to hand over control to the Feds.  Look, the people of Louisiana elected the woman, and while they don’t deserve the hurricane, they certainly deserve to suffer her leadership, or lack thereof, now.</p><p>UPDATE: A New Orleans resident adds his two cents: <em>“I don’t know how much coverage the mayor of New Orleans is getting but the guy is awesome. Cool, realistic and reassuring. So too are Bob Riley and Haley Barbour. But Governor Blanco… words fail me. It strikes me that if you are governor of a state that has just been hit by disaster you should not burst into tears during a press conference and have a little Princess Di moment.”</em></p></div>",
  "content_text": "From NRO’s Corner:\nL-LO quotes a reader: “This woman [Louisiana Governor Kathleen Babineaux Blanco] is lost and looks lost. She may have won the election but she has no business being in charge of anything. Watching her on TV the last two days has made this pretty clear. Now is not the time to be sobbing. She sure as hell should not be doing it on the tube in front of her fellow citizens – the ones looking to her for leadership.”\nJPOD:  the governor of LA is emotionally broken. She keeps speaking of “trying to figure out” how to evacuate people; “trying to figure out” how to put refugees somewhere else, etc. As you noted, she can’t even say that looting is wrong; the most outrage she can muster is “where are they taking the loot to, anyway?” She can’t even see that her brokenness demonstrates that no one is in charge, and the more that people see that, the more utter chaos and lawlessness are spread.\nI’m just kind of curious, what else was everyone expecting?  Most women crack under even minor pressure and having thousands of lives at stake in the wake of a natural disaster and knowing that your decisions will likely condemn people to death is a tremendous responsibility.\nIf I were a politician running against a woman, I’d be playing this tape followed by Patricia Schroeder’s similar – albeit even less justified – tears.  Sure, the media would completely flip out and the women’s groups would go nuts, but so what?  The point is to win the election, after all, not make your opponent feel swell about herself.\nThat being said, it’s no surprise that the neoconservative Podhoretz wants to hand over control to the Feds.  Look, the people of Louisiana elected the woman, and while they don’t deserve the hurricane, they certainly deserve to suffer her leadership, or lack thereof, now.\nUPDATE: A New Orleans resident adds his two cents:\n“I don’t know how much coverage the mayor of New Orleans is getting but the guy is awesome. Cool, realistic and reassuring. So too are Bob Riley and Haley Barbour. But Governor Blanco… words fail me. It strikes me that if you are governor of a state that has just been hit by disaster you should not burst into tears during a press conference and have a little Princess Di moment.”",
  "tags": [],
  "categories": [],
  "sitemap_lastmod": "2005-08-31T15:01:00+00:00"
}