{
  "url": "https://voxday.net/2025/05/20/he-never-got-his-war/",
  "scraped_at": "2026-01-08T20:19:51.717133",
  "title": "He Never Got His War",
  "date_display": "May 20, 2025",
  "date_iso": "2025-05-20T10:41:26+00:00",
  "date_from_url": "2025-05-20",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>One of the more intellectually respectable neocons, <a href=\"https://www.foxnews.com/world/reagan-admin-official-who-helped-america-defeat-communism-dead-age-83\">Michael Ledeen, has died</a> without ever seeing the US invasion of Iran for which he advocated for decades:</p><blockquote class=\"wp-block-quote is-layout-flow wp-block-quote-is-layout-flow\"><p>Michael A. Ledeen, a major American historian and intellectual, died after suffering a series of small strokes on Sunday at his daughter’s house in Texas. He was 83 years old. Ledeen was a vigorous participant in contributing to the demise of the communist Soviet Union and its Iron Curtain allies in Eastern Europe.</p><p>Ledeen served as a special advisor on terrorism to President Ronald Reagan’s secretary of state, Alexander Haig, and later worked as a consultant for the National Security Council. Writing for the Asia Times, author and journalist David P. Goldman argued that Ledeen’s “personal contribution to America’s victory in the Cold War is far greater than the public record shows.”</p><p>Leeden did not advocate military intervention in Iran. He was in the business of replicating Reagan’s anti-Soviet playbook for Iran’s clerical regime. </p></blockquote><p>Clown World just never stops lying. Ledeen had about as much to do with America’s victory in the Cold War as the average Zoomer born after the fall of the Soviet Union. And he was a rabid advocate of a US military empire in the Middle East; for all his subsequent denials, he stands condemned by his own words.</p><p><em>Scowcroft has managed to get one thing half right, even though he misdescribes it. He fears that if we attack Iraq “I think we could have an explosion in the Middle East. It could turn the whole region into a caldron and destroy the War on Terror.” One can only hope that we turn the region into a cauldron, and faster, please. If ever there were a region that richly deserved being cauldronized, it is the Middle East today. If we wage the war effectively, we will bring down the terror regimes in Iraq, Iran, and Syria, and either bring down the Saudi monarchy or force it to abandon its global assembly line to indoctrinate young terrorists. That’s our mission in the war against terror.</em> – Michael Ledeen, August 6, 2002, <em>National Review</em></p><p>He also took credit <a href=\"https://www.hnn.us/blog/9268\">for the color revolution in Ukraine</a> that resulted in Russia’s Special Military Operation that has led to the loss of 66,000 square kilometers of territory and over one million Ukrainian lives.</p><blockquote class=\"wp-block-quote is-layout-flow wp-block-quote-is-layout-flow\"><p>Michael Ledeen offers his own praise for the Orange Revolution by, um…taking credit for it:</p><p><em>The mild support we gave to the democratic forces in the Ukraine proved far more powerful than most of the experts expected. The revolutionaries required a bit of guidance in the methods of non-violent resistance, a bit of communications gear, and many words of encouragement. They did the rest. The same can and should be done elsewhere in the world (Iran, Syria, Saudi Arabia, China, North Korea…)</em></p></blockquote><p>Not to mention EUR 130 billion in military aid…</p><p>Ledeen ended every column with “Faster, Please” in imitation of Cato’s demand for war with Carthage, so the subsequent attempts to retroactively whitewash his warmongering are obviously false. While it is best to avoid unnecessarily speaking ill of the dead, we cannot allow his fellow neoclowns to establish the false narrative that Ledeen was anything but an Israel First warmonger who sought to make use of US military power in defense of a foreign nation.</p><p><em>DISCUSS ON SG</em></p></div>",
  "content_text": "One of the more intellectually respectable neocons,\nMichael Ledeen, has died\nwithout ever seeing the US invasion of Iran for which he advocated for decades:\nMichael A. Ledeen, a major American historian and intellectual, died after suffering a series of small strokes on Sunday at his daughter’s house in Texas. He was 83 years old. Ledeen was a vigorous participant in contributing to the demise of the communist Soviet Union and its Iron Curtain allies in Eastern Europe.\nLedeen served as a special advisor on terrorism to President Ronald Reagan’s secretary of state, Alexander Haig, and later worked as a consultant for the National Security Council. Writing for the Asia Times, author and journalist David P. Goldman argued that Ledeen’s “personal contribution to America’s victory in the Cold War is far greater than the public record shows.”\nLeeden did not advocate military intervention in Iran. He was in the business of replicating Reagan’s anti-Soviet playbook for Iran’s clerical regime.\nClown World just never stops lying. Ledeen had about as much to do with America’s victory in the Cold War as the average Zoomer born after the fall of the Soviet Union. And he was a rabid advocate of a US military empire in the Middle East; for all his subsequent denials, he stands condemned by his own words.\nScowcroft has managed to get one thing half right, even though he misdescribes it. He fears that if we attack Iraq “I think we could have an explosion in the Middle East. It could turn the whole region into a caldron and destroy the War on Terror.” One can only hope that we turn the region into a cauldron, and faster, please. If ever there were a region that richly deserved being cauldronized, it is the Middle East today. If we wage the war effectively, we will bring down the terror regimes in Iraq, Iran, and Syria, and either bring down the Saudi monarchy or force it to abandon its global assembly line to indoctrinate young terrorists. That’s our mission in the war against terror.\n– Michael Ledeen, August 6, 2002,\nNational Review\nHe also took credit\nfor the color revolution in Ukraine\nthat resulted in Russia’s Special Military Operation that has led to the loss of 66,000 square kilometers of territory and over one million Ukrainian lives.\nMichael Ledeen offers his own praise for the Orange Revolution by, um…taking credit for it:\nThe mild support we gave to the democratic forces in the Ukraine proved far more powerful than most of the experts expected. The revolutionaries required a bit of guidance in the methods of non-violent resistance, a bit of communications gear, and many words of encouragement. They did the rest. The same can and should be done elsewhere in the world (Iran, Syria, Saudi Arabia, China, North Korea…)\nNot to mention EUR 130 billion in military aid…\nLedeen ended every column with “Faster, Please” in imitation of Cato’s demand for war with Carthage, so the subsequent attempts to retroactively whitewash his warmongering are obviously false. While it is best to avoid unnecessarily speaking ill of the dead, we cannot allow his fellow neoclowns to establish the false narrative that Ledeen was anything but an Israel First warmonger who sought to make use of US military power in defense of a foreign nation.\nDISCUSS ON SG",
  "tags": [
    "neoclowns",
    "RIP"
  ],
  "categories": [],
  "sitemap_lastmod": "2025-05-20T10:41:31+00:00"
}