{
  "url": "https://voxday.net/2025/05/19/mailvox-advice-from-the-terminated/",
  "scraped_at": "2026-01-08T20:19:47.995104",
  "title": "MAILVOX: Advice From the Terminated",
  "date_display": "May 19, 2025",
  "date_iso": "2025-05-19T15:53:08+00:00",
  "date_from_url": "2025-05-19",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p><em>In which a whistleblower discovers that no one cares about would-be heroes.</em></p><p><strong>Advice from the Terminated</strong></p><p>I once was terminated from a long-term white-collar job and refused to take the generous severance package they offered. Here’s some advice based on what I learned.</p><p><strong>Only Do Real Whistleblowing</strong></p><p>If your company is doing something unethical or even illegal and you feel you must inform others, never do so internally, trusting your managers to be appreciative or even just reasonable. Sadly, sometimes no good deed goes unpunished. <em>Go external</em> to have proper protection, especially if you have a reputation for being difficult (where your “not listening” means not always being compliant enough!).</p><p><strong>“Help”, “Guidance” and “Protection” = Corrective Action</strong></p><p>If you are being given “guidance” or “help” or even “protection” by your managers or HR person or Dean of Diversity – even if this is framed as “friendly concern” – consider that such actions can easily be characterized as discipline or corrective action <em>later on</em>. Especially if you are told you need to sign what you think is just something like an “incident report”, even when you think that your supervisor is <em>supporting</em> <em>your</em> <em>actions</em> – or even just acknowledge the reception of an email seemingly containing both praise and what could possibly be perceived as a subtle warning. I’d immediately start looking for a new job if you get one of these.</p><p><strong>Your Excellent Reputation is Only as Good as Today</strong></p><p>Years of past successes, impressive references, compliments about communication and social skills, professional accomplishments, glowing talent management evaluations, etc. <em>can become irrelevant in a minute</em>. If you are perceived by higher-ups as being insufficiently supportive of your organization’s direction or “problematic” in any way, watch out! And do not think for a minute that one manager will ever overturn the termination decision of another.</p><p><strong>Just Shut the Hell Up</strong></p><p>If you are involved in a meeting with higher-ups and you suspect that they are not open to concerns about how you are being treated unfairly <em>do not try to persuade them at all. </em>Just listen very carefully during the meeting, taking notes if that seems acceptable, and saying “Thank you”, and “I understand” a lot (maybe ask if you can record the meeting, as you truly don’t want to miss anything important – this, of course, will also serve to protect you). Later on, you can do more reflection and try to figure out what to do next. <em>All of this is especially important if you are feeling frustrated or caught off guard by what happens</em>. Unlike me, try not to show any lack of prudence or a dearth of absolutely impeccable manners and poise. Any weakness you show here might enable groups to create accounts about how they felt victimized <em>by you.</em></p><p><strong>You Can’t Afford to Think You are Smarter and More Clever Than Them</strong></p><p>If it comes to legal manners, do not represent yourself, ever. Even if you are highly ethical, that won’t help and could even hurt: they know the legal game better than you ever could. And take heed: If the state is involved in the case, be aware of what ultimately will be made public and what won’t be made public. Also note that there is nothing Illegal about a company selectively choosing to enforce their own internal policies. Combine this with at-will employment, and this combination also will make getting any unemployment benefits that much more difficult.</p><p><em><a href=\"https://socialgalactic.com/micropost/5365ffde-02ca-4f42-9fa8-601f4cf724d1\">DISCUSS ON SG</a></em></p></div>",
  "content_text": "In which a whistleblower discovers that no one cares about would-be heroes.\nAdvice from the Terminated\nI once was terminated from a long-term white-collar job and refused to take the generous severance package they offered. Here’s some advice based on what I learned.\nOnly Do Real Whistleblowing\nIf your company is doing something unethical or even illegal and you feel you must inform others, never do so internally, trusting your managers to be appreciative or even just reasonable. Sadly, sometimes no good deed goes unpunished.\nGo external\nto have proper protection, especially if you have a reputation for being difficult (where your “not listening” means not always being compliant enough!).\n“Help”, “Guidance” and “Protection” = Corrective Action\nIf you are being given “guidance” or “help” or even “protection” by your managers or HR person or Dean of Diversity – even if this is framed as “friendly concern” – consider that such actions can easily be characterized as discipline or corrective action\nlater on\n. Especially if you are told you need to sign what you think is just something like an “incident report”, even when you think that your supervisor is\nsupporting\nyour\nactions\n– or even just acknowledge the reception of an email seemingly containing both praise and what could possibly be perceived as a subtle warning. I’d immediately start looking for a new job if you get one of these.\nYour Excellent Reputation is Only as Good as Today\nYears of past successes, impressive references, compliments about communication and social skills, professional accomplishments, glowing talent management evaluations, etc.\ncan become irrelevant in a minute\n. If you are perceived by higher-ups as being insufficiently supportive of your organization’s direction or “problematic” in any way, watch out! And do not think for a minute that one manager will ever overturn the termination decision of another.\nJust Shut the Hell Up\nIf you are involved in a meeting with higher-ups and you suspect that they are not open to concerns about how you are being treated unfairly\ndo not try to persuade them at all.\nJust listen very carefully during the meeting, taking notes if that seems acceptable, and saying “Thank you”, and “I understand” a lot (maybe ask if you can record the meeting, as you truly don’t want to miss anything important – this, of course, will also serve to protect you). Later on, you can do more reflection and try to figure out what to do next.\nAll of this is especially important if you are feeling frustrated or caught off guard by what happens\n. Unlike me, try not to show any lack of prudence or a dearth of absolutely impeccable manners and poise. Any weakness you show here might enable groups to create accounts about how they felt victimized\nby you.\nYou Can’t Afford to Think You are Smarter and More Clever Than Them\nIf it comes to legal manners, do not represent yourself, ever. Even if you are highly ethical, that won’t help and could even hurt: they know the legal game better than you ever could. And take heed: If the state is involved in the case, be aware of what ultimately will be made public and what won’t be made public. Also note that there is nothing Illegal about a company selectively choosing to enforce their own internal policies. Combine this with at-will employment, and this combination also will make getting any unemployment benefits that much more difficult.\nDISCUSS ON SG",
  "tags": [
    "corpocracy",
    "law"
  ],
  "categories": [],
  "sitemap_lastmod": "2025-05-19T15:53:11+00:00"
}