{
  "url": "https://voxday.net/2025/05/05/ten-must-read-books/",
  "scraped_at": "2026-01-08T20:18:27.600118",
  "title": "Ten Must-Read Books",
  "date_display": "May 5, 2025",
  "date_iso": "2025-05-05T11:03:41+00:00",
  "date_from_url": "2025-05-05",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>Fandom Pulse lists ten books it considers integral to <a href=\"https://fandompulse.substack.com/p/10-must-read-books-for-anyone-fighting\">understanding the cultural war</a>:</p><blockquote class=\"wp-block-quote is-layout-flow wp-block-quote-is-layout-flow\"><p>Our culture is becoming increasingly illiterate, with most attempts at any discourse becoming shouting fruitless insults rather than attempting to build a philosophical or moral goal. A lot of this is the impact of social media and video entertainment, boiling down everything into gotcha rhetoric for dopamine hits one receives from likes on the internet.</p><p>The Christian conservative needs to arm himself with understanding and knowledge to transcend the infantility and ignoramity of the culture, and so we at Fandom Pulse have curated a list of ten books for anyone who truly wishes to fight against the social justice agenda in the current culture must read if he wants to work to make positive change in the culture.</p><p>Our list begins here:</p><p><em>SJWs Always Lie</em> by Vox Day</p><p>Vox Day’s 2015 manifesto serves as a tactical handbook for those facing social justice attacks in professional and personal settings. Day, a figure who has experienced cancel culture firsthand, outlines what he calls the “SJW attack sequence” and provides specific defensive strategies for those targeted by online mobs. The book’s value lies in its practical approach to understanding how modern callout campaigns operate, the psychology behind them, and concrete steps for defending oneself against reputation destruction. His breakdown of how institutional capture occurs and his “Three Laws of SJWs” provide a framework for recognizing patterns in cultural conflicts that continue to play out across institutions.</p></blockquote><p>For the purposes of better understanding the enemy and its aims, I would have included <em>Utilitarianism </em>by John Stuart Mill as well as <em>Tragedy and Hope</em> by Carroll Quigley. It’s also worth noting the way in which social justice has been transformed into “woke” and then promptly misapplied as “woke right” to attempt to discredit the most effective opponents of social justice is a rather remarkable demonstration of how Clown World utilizes the Narrative to conceals its precepts and direct its controlled opposition against its genuine opponents.</p><p>I was always suspicious of those who leaped to endorse the term “woke” to replace “SJW” and those suspicions were confirmed as soon as Clown World’s pet “conservatives” began to make use of it to attack the same nationalists and Christians that they’ve been attacking since the closeted clown and conservative gatekeeper William F. Buckley drew a hard line between conservatism and nationalism in the early 1960s.</p><p>I have never been a conservative because conservatives are unprincipled frauds whose primary purpose is to control the opposition and throw the game.</p><p>Anyhow, there has been some demand for a leatherbound edition of SJWAL, and while we won’t make it part of the Library subscription, we may make it available as a one-off if there is sufficient demand, most likely including SJWADD as well.</p><p><em><a href=\"https://socialgalactic.com/micropost/6c13a5a4-f62b-44e4-87d3-236134320d68\">DISCUSS ON SG</a></em></p></div>",
  "content_text": "Fandom Pulse lists ten books it considers integral to\nunderstanding the cultural war\n:\nOur culture is becoming increasingly illiterate, with most attempts at any discourse becoming shouting fruitless insults rather than attempting to build a philosophical or moral goal. A lot of this is the impact of social media and video entertainment, boiling down everything into gotcha rhetoric for dopamine hits one receives from likes on the internet.\nThe Christian conservative needs to arm himself with understanding and knowledge to transcend the infantility and ignoramity of the culture, and so we at Fandom Pulse have curated a list of ten books for anyone who truly wishes to fight against the social justice agenda in the current culture must read if he wants to work to make positive change in the culture.\nOur list begins here:\nSJWs Always Lie\nby Vox Day\nVox Day’s 2015 manifesto serves as a tactical handbook for those facing social justice attacks in professional and personal settings. Day, a figure who has experienced cancel culture firsthand, outlines what he calls the “SJW attack sequence” and provides specific defensive strategies for those targeted by online mobs. The book’s value lies in its practical approach to understanding how modern callout campaigns operate, the psychology behind them, and concrete steps for defending oneself against reputation destruction. His breakdown of how institutional capture occurs and his “Three Laws of SJWs” provide a framework for recognizing patterns in cultural conflicts that continue to play out across institutions.\nFor the purposes of better understanding the enemy and its aims, I would have included\nUtilitarianism\nby John Stuart Mill as well as\nTragedy and Hope\nby Carroll Quigley. It’s also worth noting the way in which social justice has been transformed into “woke” and then promptly misapplied as “woke right” to attempt to discredit the most effective opponents of social justice is a rather remarkable demonstration of how Clown World utilizes the Narrative to conceals its precepts and direct its controlled opposition against its genuine opponents.\nI was always suspicious of those who leaped to endorse the term “woke” to replace “SJW” and those suspicions were confirmed as soon as Clown World’s pet “conservatives” began to make use of it to attack the same nationalists and Christians that they’ve been attacking since the closeted clown and conservative gatekeeper William F. Buckley drew a hard line between conservatism and nationalism in the early 1960s.\nI have never been a conservative because conservatives are unprincipled frauds whose primary purpose is to control the opposition and throw the game.\nAnyhow, there has been some demand for a leatherbound edition of SJWAL, and while we won’t make it part of the Library subscription, we may make it available as a one-off if there is sufficient demand, most likely including SJWADD as well.\nDISCUSS ON SG",
  "tags": [
    "books",
    "Clown World",
    "politics",
    "SJW"
  ],
  "categories": [],
  "sitemap_lastmod": "2025-05-05T11:03:47+00:00"
}