{
  "url": "https://voxday.net/2025/05/30/the-stalwarts-of-library/",
  "scraped_at": "2026-01-08T20:20:39.380683",
  "title": "The Stalwarts of Library",
  "date_display": "May 30, 2025",
  "date_iso": "2025-05-30T12:42:11+00:00",
  "date_from_url": "2025-05-30",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>Congratulations to the intrepid subscribers to the Castalia Library substack, as today marks <a href=\"https://castalialibrary.substack.com/p/the-cambridge-medieval-history-i-b7d\">the end of our second serialization</a>. After 315 daily installments and 614 pages covering everything from the Niceno-Constantinopolitan Creed to the Teutonic migrations, we have finally managed to accomplish together something I never quite managed to do on my own despite it being one of my prize possessions, which is read every single page of <em>The Cambridge Medieval History Volume I: The Christian Empire</em>.</p><p>So, well done, everyone.</p><p>To be honest, I’ve been a little shocked at seeing how many people have been reading along; there are usually 1,000 post-reads recorded, so even if three-quarters of those readers are only glancing at each post, that’s a lot more people reading through one of the more advanced historical summaries ever published.</p><p>Tomorrow I’ll put up a poll for what the next daily serialization should be. One option is to simply continue with <em>Volume II: Foundation of the Western Empire</em>, but perhaps we might do with a break from the Cambridge historians for a while. Feel free to make any suggestions on SocialGalactic, but recall that any work we serialize there must be in the public domain.</p><p><em><a href=\"https://socialgalactic.com/micropost/d0888824-4f5d-4989-9202-1a267e29c96e\">DISCUSS ON SG</a></em></p></div>",
  "content_text": "Congratulations to the intrepid subscribers to the Castalia Library substack, as today marks\nthe end of our second serialization\n. After 315 daily installments and 614 pages covering everything from the Niceno-Constantinopolitan Creed to the Teutonic migrations, we have finally managed to accomplish together something I never quite managed to do on my own despite it being one of my prize possessions, which is read every single page of\nThe Cambridge Medieval History Volume I: The Christian Empire\n.\nSo, well done, everyone.\nTo be honest, I’ve been a little shocked at seeing how many people have been reading along; there are usually 1,000 post-reads recorded, so even if three-quarters of those readers are only glancing at each post, that’s a lot more people reading through one of the more advanced historical summaries ever published.\nTomorrow I’ll put up a poll for what the next daily serialization should be. One option is to simply continue with\nVolume II: Foundation of the Western Empire\n, but perhaps we might do with a break from the Cambridge historians for a while. Feel free to make any suggestions on SocialGalactic, but recall that any work we serialize there must be in the public domain.\nDISCUSS ON SG",
  "tags": [
    "books",
    "Castalia Library",
    "history"
  ],
  "categories": [],
  "sitemap_lastmod": "2025-05-30T12:42:14+00:00"
}