{
  "url": "https://voxday.net/2025/05/30/the-winds-of-winter-is-complete/",
  "scraped_at": "2026-01-08T20:20:44.910517",
  "title": "The Winds of Winter is Complete",
  "date_display": "May 30, 2025",
  "date_iso": "2025-05-30T17:04:40+00:00",
  "date_from_url": "2025-05-30",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>And has been, apparently, <a href=\"https://fandompulse.substack.com/p/rumor-the-winds-of-winter-was-finished\">for nine years already</a>.</p><blockquote class=\"wp-block-quote is-layout-flow wp-block-quote-is-layout-flow\"><p>A publishing industry insider has told Fandom Pulse <em>The Winds Of Winter </em>was finished and turned in back in 2016. Epic fantasy fans have all but given up on getting the end of A Song Of Ice And Fire, George R.R. Martin’s epic which sprawled out of control with too many perspective characters where the author wrote himself into a corner. On top of it, Martin himself seems to have completely given up on it and published a very angry rant at fan reaction on his blog this week.</p><p>However, an insider told Fandom Pulse the thirteen-years-late book actually was finished in 2016 during the filming of season 6 of <em>A Game Of Thrones</em>. The insider, who we confirmed worked in the publishing industry at big companies, said that they have spoken with editors at both Spectra and Voyager, who are Martin’s publishers in the United Kingdom and the United States, to confirm this, with both having a similar story.</p></blockquote><p>That’s another big scoop for Fandom Pulse, following on the heels of the confirmation of its original reporting about Ark Press being part of Peter Thiel’s new publishing empire. . Apparently the reason <em>The Winds of Winter </em>wasn’t published despite being completed is because Martin withdrew the book after the producers of the TV show criticized the ending, which reportedly is much the same ending that was filmed. It’s also interesting that the first mention of an additional book to follow appears to be around the same time that Martin withdrew the book from his publishers.</p><p>If these reports are true, it might explain why the two producers abandoned the production so hastily, and why they pretty much just phoned in that final season. They would have known it was going to be a trainwreck long before they started filming it. It would also explain why Martin apparently has no intention of releasing the book, at least, not while he’s still alive to listen to his former fans castigating his swan song. Of course, if you watched Arkhaven Nights last night, you already know all of this…</p><p>So, it would appear that Martin lost his writing fastball even sooner than we thought. As Murakami says, once a writer gets fat, it’s over. I’ll be discussing this on the Darkstream tonight, so if you’re interested, tune in.</p><p><strong>UPDATE:</strong> Ruh-roh…</p><p><em>“The Starks and Lannisters and Targaryens, Tyrion and Asha, Dany and Daenerys, the dragons and the direwolves, I care about them all,” Martin wrote. “More than you can ever imagine.”</em></p><p>Dany is Daenerys. But apparently George doesn’t realize that now.</p><p><em><a href=\"https://socialgalactic.com/micropost/9a7d6696-87c9-46ab-8f1c-b61cd8d9d1e2\">DISCUSS ON SG</a></em></p></div>",
  "content_text": "And has been, apparently,\nfor nine years already\n.\nA publishing industry insider has told Fandom Pulse\nThe Winds Of Winter\nwas finished and turned in back in 2016. Epic fantasy fans have all but given up on getting the end of A Song Of Ice And Fire, George R.R. Martin’s epic which sprawled out of control with too many perspective characters where the author wrote himself into a corner. On top of it, Martin himself seems to have completely given up on it and published a very angry rant at fan reaction on his blog this week.\nHowever, an insider told Fandom Pulse the thirteen-years-late book actually was finished in 2016 during the filming of season 6 of\nA Game Of Thrones\n. The insider, who we confirmed worked in the publishing industry at big companies, said that they have spoken with editors at both Spectra and Voyager, who are Martin’s publishers in the United Kingdom and the United States, to confirm this, with both having a similar story.\nThat’s another big scoop for Fandom Pulse, following on the heels of the confirmation of its original reporting about Ark Press being part of Peter Thiel’s new publishing empire. . Apparently the reason\nThe Winds of Winter\nwasn’t published despite being completed is because Martin withdrew the book after the producers of the TV show criticized the ending, which reportedly is much the same ending that was filmed. It’s also interesting that the first mention of an additional book to follow appears to be around the same time that Martin withdrew the book from his publishers.\nIf these reports are true, it might explain why the two producers abandoned the production so hastily, and why they pretty much just phoned in that final season. They would have known it was going to be a trainwreck long before they started filming it. It would also explain why Martin apparently has no intention of releasing the book, at least, not while he’s still alive to listen to his former fans castigating his swan song. Of course, if you watched Arkhaven Nights last night, you already know all of this…\nSo, it would appear that Martin lost his writing fastball even sooner than we thought. As Murakami says, once a writer gets fat, it’s over. I’ll be discussing this on the Darkstream tonight, so if you’re interested, tune in.\nUPDATE:\nRuh-roh…\n“The Starks and Lannisters and Targaryens, Tyrion and Asha, Dany and Daenerys, the dragons and the direwolves, I care about them all,” Martin wrote. “More than you can ever imagine.”\nDany is Daenerys. But apparently George doesn’t realize that now.\nDISCUSS ON SG",
  "tags": [
    "books",
    "Pink SF",
    "writing"
  ],
  "categories": [],
  "sitemap_lastmod": "2025-05-31T01:30:52+00:00"
}