{
  "url": "https://voxday.net/2025/05/27/there-will-be-no-peace/",
  "scraped_at": "2026-01-08T20:20:26.906947",
  "title": "There Will Be No Peace",
  "date_display": "May 27, 2025",
  "date_iso": "2025-05-27T08:59:37+00:00",
  "date_from_url": "2025-05-27",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><h4 class=\"wp-block-heading\"><em>In which Piero San Giorgio and Andrei Martyanov discuss the prospects for peace in Europe and NATO’s total lack of preparation for an escalated conflict with Russia:</em></h4><p><strong>Piero:</strong> So it was a few days ago that it was Victory Parade, and as you know, for me it is an event that is very dear because it is on May 9th, 1945 that my grandfather was liberated from a prisoner camp in Germany by the Red Army. So we always had this 9th of May as a family important day. And in fact, I will drink to it. I brought this from Moscow – I think it’s a 20mm shell anyway. And I wanted to start asking you the question: what does it mean for you and what does it mean for Russians in general, and what should it mean for everyone else, especially on this 80th anniversary of May 9th Victory Day?</p><p><strong>Andrei:</strong> Well, it’s part of the family. Every family – literally every – there’s not a single family in Russia which hasn’t been touched by those events. And I understand, especially for you being a European, essentially it wasn’t the fight of Soviet Union, which was historic Russia, Russian Empire, new edition of Russian Empire. It was the fight against the combined forces of… It wasn’t just Germans. People who say that it’s “oh Germany” – yes Germany, but what about Romanian, Italian, Hungarian armies? Finnish half a million force of SS who participated in blockade of Leningrad, the siege of Leningrad. And you look at the SS divisions from France – Charlemagne – you know, Blue Division from Spain.</p><p>So when you go and look at this, yes, this was a unified European front against the Soviet Union. And as the result, we had a cataclysmic event of the kind which humanity never experienced. In four years, up to 70 million people on different fronts have been killed. Some of them have been killed in the most brutal way which haven’t been experienced before – be that concentration camps, let alone death camps, the industrial scale annihilation of the civilians like it was in Russia. And 27 million Soviet people died – actually majority of them civilians.</p><p>So whenever the so-called revisionists in the West begin… So-called revisionists – they don’t revise things, they just rewrite history. Most of them are not professional historians and they don’t know the first thing about warfare. But when they begin to rewrite history, they forget to say that majority of those were civilians. And the atrocities which have been committed against Soviet Union, and especially the utter destruction of European part of Soviet Union – primarily Russia and Belarus and Ukraine what is today – is unprecedented. And only Poles suffered equally, and obviously Chinese, but they had a much larger population already then.</p><p>So that’s the result. Scott Ritter stated a very interesting thing and I liked it very much, and I quote him: he said Russians cannot do anything about it because they have those people looking down at them. This is like… it was such a profundity. One of very few Americans who really grasped what it was.</p><p>So my family – no granddads, all killed at the front. My maternal grandfather was killed in 1941 around Donetsk. Then of course when my grandma remarried in 1945 – four years after, you know – she married again a veteran and he fought starting from the Soviet-Finnish War. So it’s in every family. My wife – she doesn’t have grandfathers. Pretty much 80-85% of the 23-year-olds generation in Soviet Union have been killed on the front. Yeah, disaster.</p><p><strong>Piero:</strong> And it’s even more pitiful to consider the situation of today, that first of all it wasn’t the first time that Europeans tried to invade Russia – the Swedes, the Poles of course, but also Napoleon’s international armies. It was not just French. Crimean War, World War I was also… okay, we can argue on who really started it, but certainly there was a major front on the east in Russia. And all of this for me is very sad because you mentioned Europeans in World War II, the Charlemagne division and all that, and these young men were idealistic for the wrong reasons. And it’s always sad when you see young men dying for stupid reasons against other young men which could have had a bright future on all sides. And it’s such a disaster for me, for Europe and European civilization.</p><p>And so Victory Parade, the 80th anniversary last week – what do you… I obviously watched it, of course you watched it as well. What do you feel when you watch it?</p><p><strong>Andrei:</strong> Well, it’s a sacred event really, and for any Russian. And especially most important thing actually is not even the parade – it’s the tradition, it’s a relatively new tradition of the Immortal Regiment. In St. Petersburg alone, which became Leningrad for a day sort of, 1.1 million people went out with their portraits of their grandfathers and grandmothers who fought and worked in rear to supply the front and all that. So it’s… I don’t even know how to explain it. I mean, many people they do not comprehend what is happening in terms of spiritual importance of all that. And it’s extremely important, extremely important. This is the part of you – you cannot change it, you just cannot change it. It’s there, you know.</p><p>So it’s… how can I forget my grandfathers? How? I mean, you know, they defended their motherland. Yes, they didn’t invade somebody, you know. Like people want to say, “Oh yeah, you split Poland between Germany.” Well, you wanted it, you refused to… So people don’t know the history, most people don’t. And in the West it is completely rewritten by the falsifiers and lowlifes, especially British succeeded, and Germans by the way. So when you look at that, what can I say? I mean Europe made up its mind. It’s Europe’s choice and nothing could be done about it. It cannot be changed.</p><p><em><a href=\"https://socialgalactic.com/micropost/432e2028-8bb7-4d72-9e85-73e36d9228d1\">DISCUSS ON SG</a></em></p> <span id=\"more-67512\"></span><p><strong>Piero:</strong> On a more than symbolic level, there were troops marching and parading from China, from a lot of the former Soviet republics which were at the time of the Soviet Union of course participating in the Great Patriotic War. Is that a strong symbol today?</p><p><strong>Andrei:</strong> Oh, it is still a very strong symbol, absolutely. But for those republics, it will fade away eventually because we have to be very realistic about the fact that these remnants of this internationalist Soviet culture – they are evaporating, let’s put it this way. The new generation, and especially when you look at those ‘stans – you know, Uzbekistan, Tajikistan, whatever they do – I mean you cannot change their basically religious and cultural trends there.</p><p>So just to give you example: Uzbekistan – they had some obviously veterans who participated heroically in fighting in the Red Army and all that, but it was primarily the place where you would evacuate very many civilians in Soviet time during the Great Patriotic War 1941, 1942, 1943. But their memorial, for example, to their Soviet soldiers doesn’t have even Russian inscribed anymore – it’s in English. And when they ask them why did you do this, “Oh, we have many tourists who speak English.” Okay, sure, you know.</p><p>But yeah, and again, those… while nobody tries to diminish the sacrifice and participation of those people, I have to tell you that these were Slavs primarily who died. Again, however, if you take a look for example at Azerbaijan compared to its percentage of population, they contributed tremendously. There were number of divisions, and they fought violently. They had a truckload of Heroes of the Soviet Union and so… yeah, it’s… but Caucasus was always a little bit different thing altogether, and there’s been… they’ve been on both sides there, yeah. So but that’s what it is, and yeah, inevitably for them it will fade away, but for Russians it will always remain. Simple as that.</p><p><strong>Piero:</strong> So eight years after 1945, we had the bizarre event of a lot of Western so-called leaders, or so-called elected leaders, celebrating with Ukraine of all places in Berlin. And for a lot of people my generation, we understand history still – we’re not like the young who are not educated unfortunately, or not like our fathers who didn’t really care. But it’s a paradox to see the people representing the ideology who lost in 1945 not parading – because I don’t think there’s anything to parade – but certainly commemorating it in a weird way in the capital of the defeated power.</p><p><strong>Andrei:</strong> Yeah, it’s… when you look at that… And I’m on record, I have facts to back me up on that, I wrote four books on that. I mean, again, they are not the victors, they are losers. France is a loser. France was a Nazi power, okay? Just let’s drop any kind of pretense. If not for the Free French and especially Normandie-Niémen, which performed absolutely heroically and this is the only thing De Gaulle could spare, and he knew that he had to put somebody in the Red Army to fight, and they covered themselves in glory and absolutely deserved number of the Heroes of the Soviet Union, no less, from French pilots.</p><p>But primarily, the number of the French servicemen in SS divisions and actually in Wehrmacht first line and punitive formations was several times larger than they had in the resistance, which primarily was run anyway by British and Russian white immigration – those ones who… very few minority of them who didn’t have this rabid anti-Soviet sentiment which most of the white immigration had.</p><p>So and there you go, and suddenly you say, “Hey, how about Spain?” You know, “How about Vichy? Hey guys, you supported it.” You know, like, “Oh, Czechs.” Oh yeah, we had… Well yeah, you had one guy who actually in 1938 offered resistance – the Czech officer. The rest of it is just… you did well. Germans used a third of the Germany… Wehrmacht actually hardware was built in Czech Republic, in Czechoslovakia. So best tanks ever in Czech Republic, yeah.</p><p>So it’s like, yeah sure, yeah, it’s just Germany. But yeah, and obviously everybody forgets about Poland grabbing Teschen region, you know, just basically tearing apart together with Germans the Czechoslovakia. So yeah, it’s like… let them… it’s hyenas. They are hyenas. Although it’s incorrect phrase about Poland by Churchill. Churchill actually stated that Poland had the appetite of a hyena – it’s not quite calling them hyenas. But yeah, they all are hyenas of Europe. They hate Russian guts, always did and always will continue to hate Russian guts.</p><p>Their presence of the minority of normal, decent people with the normal morality, normal knowledge of the history – they are still minority. Majority of them, you cannot change it. In France in 2017, when Sputnik Globe was conducting their poll about “do you consider Russians Europeans?” actually three-quarters of them said no – French, you know, no less. And that was ’17. Today they probably three-quarters of those French don’t consider Russians even humans, you know.</p><p>So there is a minority – it’s significant, but it’s all minorities. Most of those people, they don’t care about Russians, and if Russians will die out tomorrow in tens of millions, it will be good because their Russophobia is entrenched in Europe and nothing could be done about it. You cannot change it.</p><p>It comes when people say, “Oh, I didn’t want for that.” I always say… well, not that Marine Le Pen is not globalist – she’s professional oppositionist, she never meant to run anything. But the point is that Macron was reelected with the overwhelming margin. He literally stomped on Marine Le Pen and National Front. Even if you consider the fact that they falsified something, you cannot falsify 20-plus percent lead which he had. It was absolutely landslide, you know. The French wanted it.</p><p>So I mean, there you go. It’s just French. But there are of course Germans, and Germans are a whole other story. Anybody who tells me that some German, average German, is fond of Russia… no, they want Russian energy and continue to hate Russians as the nation which never recovered from the trauma of being utterly defeated by the Red Army. They never did, they never recovered. The Nazi core was imported by the United States, Vatican and British, resettled in the United States, Britain, South America. Wehrmacht wrote Wehrmacht operational concepts for NATO and US Army.</p><p>And it’s like, how far can you go with that? I mean, and then suddenly we have, especially starting for the last 20 years, all those… being all those documents and archives being opened, and you’re saying like, “Oh yeah, sure, how British ended up being on the right side is obviously they have to thank Churchill.” But there was no moral choice there – he was merely calculating, that’s pretty much it.</p><p><strong>Piero:</strong> Now of course, as someone who absolutely loves European culture, European people – and even, you know, Poland is a country I really like – I must say that I want to say that no, you’re wrong, Europeans actually would like to like Russia, European people are not like the leaders they have elected more or less. However, the facts don’t show me to be right, it shows you to be right.</p><p>I’m a Western person. I actually… this is what I will be repeating in the video which comes – my video today. Again I reiterate this point: I am a Western man by culture. As, you know, what for me… Pink Floyd, Beethoven, Tchaikovsky – they are all the same, you know. I read… I grew up with the Western literature. Russian literature is a part of the Western cultural vault. Great Russian literature, you know. We grew up with the good Hollywood, you know, good European cinematography. Culturally we are Western people. We appreciate what was embedded, at least on the surface, in the understanding of the democracy, freedom of the individual and things of this nature. I am absolutely a Western man in this, and most Russians are.</p><p>But you cannot change what you cannot change. And the fact is, culturally mainly today in Europe… as again, listen, Nazism never was defeated by the Western part. They preserved it, they preserved it. Again, as I said, Wehrmacht was writing operational concepts for NATO and for the US Army. And it’s like, yeah, you look at this and you spit on somebody: “Oh yeah, the guy from SS. Oh, the guy… oh my God, Werner von Braun.” No, no. “SS Gruppenführer and SS…” I’m sorry guys, I mean, how else can you… “Oh no, he was a scientist.” Sure man, was a scientist. He was a medical doctor. “My God, his science…” He tortured people to death, considering, you know, committing atrocities which are incomprehensible. Well, only Islamic State now kind of tries to compete for, you know, the bestiality of this whole thing, with much less science, much less science, yeah.</p><p>So what do you expect? This is all in the open now, you know. And as the result, well, West made sure that it will be defeated yet again, which is happening today, because they created this absolute alternative universe perception of the outside world.</p><p><strong>Andrei:</strong> And you’re correct. I mean, you look at Macron, Starmer, or Merz – these are not normal people. They are imbeciles, probably. No, I mean literally imbeciles. And the fact is that French voted for this thing, you know, Macron and whatever the hell… whatever the creature he is married to, you know. I don’t… not going to go into all kinds of speculation of this matter. Hey, that explains everything about them. This is who they are, this is who they are.</p><p>The only thing they can do… I mean, these creeps from the radical left, you know, the European culture… Germans are absolutely… They turned the nation into the… you know, and so they emasculated them completely. But they hate everybody because of that. They hate themselves, but they hate Russians – perfect object and subject to be hating upon, you know.</p><p>So as the result, you look at what is happening to European economy, culture, and things of this nature – it’s a catastrophe. I don’t think France will survive as a unified nation and as a nation per se beyond 2050, period. They are taking it, and they are actually loving it – many of them do. So they are…</p><p>And I will give you the example – it’s going to be in my video today. My good friend – he is Colonel Vladimir Trukhan, and the Russian first deputy of the representative diplomat of the OSCE – Organization for Security and Cooperation in Europe. They had the wonderful discussion yesterday about Europe and how they want to fight Russians. And of course everybody laughs at that when you count actual military things and industries. He absolutely correctly stated that when in OSCE he talks to people – you know, those bunch of clowns from Western Europe – they say, “Oh, we have enough dogs and police to suppress any kind of…” That’s what they think for them… people.</p><p>But then again, as I already stated, France 2050… maybe after that they will be… south of France will be turned into their caliphate, some kind, something like that. And the rest of it… I mean, yeah, there you go.</p><p><strong>Piero:</strong> North as well, the North as well, don’t worry.</p><p><strong>Andrei:</strong> Yeah, so yeah, that’s where they go. They wanted it, they voted for it. I’m sorry, can we stop this? Can we drop this BS like “Oh, I didn’t vote?” Maybe you didn’t vote for that, but majority did, you know. Majority did. We have to live with the reality of the fact. You know what? Russians, for example, in 1990s – that’s why actually I left Russia – I mean, they voted for… granted, you know, for Yeltsin second time. Boy, did they have been, you know, taken through some… well, basically genocide essentially. They learned their lesson, didn’t they? Sure, sure did.</p><p>But Europeans, they don’t learn anything because they really think that they are so irresistible, so amazing. French or, you know, Germans still think that they have industry. Russians laugh at it. That’s why I always say… I’m sick and tired of this cliché like, “If we put together German technology and Russian resources…” What German technology? I mean, overpriced junky cars which you cannot fix properly, you know? Now you have to… or what else? Siemens? I mean, if Germany wants to put up 32 satellites in the space of GLONASS global positioning system or have the space program, its economy… the border will fall off. Many people still do not understand even though the Special Military Operation proved it beyond any doubt.</p><p><strong>Piero:</strong> Speaking of which, again, if we move slightly east and in even less democratic area than of Europe, Special Operation Ukraine now is on the third year. It seems pretty obvious that everything you’ve been saying and others have been saying about the way it’s going has been validated – the clear advance or more rather attrition of… and I’m very sad about it because again one million more Ukrainian young men dead. They’re Europeans, they’re my brothers, they’re my cousins, so I’m very sad. And also the hundred or I don’t know how many, but certainly probably around 100,000 Russians as well.</p><p><strong>Andrei:</strong> Yeah, some… yeah, between 98 and 105, the estimates.</p><p><strong>Piero:</strong> And despite the ratio which is of course hugely favorable to Russia, it’s still… I’m still very sad because then there are broken families, broken people, and I’d rather have peace than war. But what can you do when people are not reasonable? And when I say people, I mean the American Department of State and the British oligarchs who push for war against Russia for the last two centuries. But if we move to Ukraine, what is the path to peace or and maybe even long-standing peace? What’s your opinion? How is it going to play out?</p><p><strong>Andrei:</strong> Well, I looked up today the numbers by Russian Defense Ministry, and it’s frontline numbers only – they do not count the even tactical rear or operational rear. And the attrition day is as large as that on the front line. So it’s kicking up back to where it was, you know, before the ceasefire – volunteer, you know, the self-imposed ceasefire for the celebration of the 80th by Russia, 72 hours. It’s over now, and slaughter continues, and it will continue.</p><p>Even The Economist – this bunch of the imbeciles from London – admitted today that yeah, the end is much nearer than you think it is, which it is. I mean, Russia… Russian objectives, objective here, which many people still don’t get, and I repeat it ad nauseam: Russia is demilitarizing, demilitarizing NATO, pure Ukraine. I’m sorry to say this, and I know that sounds horrible – Russian objective is to kill the remnants of the sperm bank of Ukrainian men so for Ukrainian nation and what it was for the several centuries towards Russia not to recover ever again. Simple as that.</p><p>And I understand it sounds horrible, but this is what you do. You know, you exchange about 2-3 million people for the lives and well-being of the 160-plus million people in Russian Federation and Belarus, which is the part of the union state. So what are you going to do? You physically annihilate enemy, and this is what is happening now.</p><p>The attrition rates today went from what it used to be – 1 to 10 – it now up to 1 to 20. This is a slaughter, and this is exposition of the military incompetence and stupidity of NATO, from Pentagon to Brussels to what have you. We can absolutely confidently state that Western militaries are incompetent. Their military education is a joke, their officer corps is a joke, and so… and let alone the whatever they…</p><p>And again, listen, these guys, they lived in this bubble alternative universe written for them by Wehrmacht, and what Wehrmacht wrote to them and explained to them, and it found its basically development and reflection in such things as the field manuals, operational manuals of the US Army, or obviously Bundeswehr and all that, is that “Oh, look at us, we were lions, brilliant, you know, and we just suddenly lost the war because Russians took their 500 million people and corpses and threw at us, and we cannot resist that.”</p><p>This is documented – this is not urban legend. It was documented by several information agencies around the world. It is actually described in Alexander Werth’s famous “Russia at War” masterpiece, which came out in the 1960s. So De Gaul, and Alexander Werth being the correspondent of Associated Press at that time, or Reuters, whatever – so De Gaul was taken to Stalingrad in February 1943 after the whole thing was done. And he went out on the bank of Volga looking at the east bank, and he was saying things like “What a great people, what a great people.” And the correspondents who followed him, because he was promoted as he himself complained, saying “Oh, you mean Russians?” He said, “No, Germans to get that far.”</p><p>So yeah, and the point is when you have those people who create alternative history, they create alternative operational art, alternative theory of operations, alternative tactics – everything alternative, alternative technological issues. What do you expect? You get a sand castle. Get any Pentagon officer from basically lieutenant rank up to their four-star general – most of them will not even pass the entrance exam to any Russian military academy. They will fail, let alone if you get them into the specific what is called the services – not services but specific troops such as air defense or naval academies. Good Lord, they just will not pass it.</p><p><strong>Piero:</strong> Yeah, they seem to be very much unqualified to manage anything that is linked to statistics, which is… you know, I used to develop war games simulations, so I’m not a soldier. I have no idea how you would actually run a battle in reality, but I know how to create simulation. And for simulation you need statistics, you need of course extremely detailed ratios, and sometimes you don’t know so you have to figure out as much as guesstimate as you can. But certainly a regimental commander of the 18th century when they had to have pikes and muskets, or even before, had a better grasping of what it actually means – volley fire in terms of statistics and in terms of casualties, in terms of how you win based on the numbers and ability of your soldiers and so on – probably better than the people who are running NATO now, who are at best able to run some tactical schemes and using some weapons.</p><p><strong>Andrei:</strong> Yeah, it’s a tactical level – it’s a tactical level maximum. And even this tactical level is based primarily on memorizing and training. Nothing wrong with training, make no mistake – you have to train, you have to constantly practice, and this is absolutely normal. But when you have a tactical manual written from the position that “Oh yeah, I’ll call in the close air support” and that’s the only thing they know actually how to do properly – what if that close air support is not coming because it will be shut down or destroyed on the tactical rear runways? They never fought anything like this. They never… they don’t understand it. They don’t understand that what happens if you are outranged by everything? No, your Stinger doesn’t work at 7 kilometers because Mi-28 or Ka-52 has this Hermes, what is called the production item 305, and it flies and it’s shoot and forget at the range of 18 kilometers. What are you going to do? Yep, and you will be detected, you will be seen, you will be tracked there.</p><p>And then suddenly, as Jacques Baud – I don’t know if you invited Jacques Baud before, so yes, he’s welcome if he’s listening, yeah, you should – yeah, he brilliantly developed it in a wonderful book and he basically says here’s reconnaissance-strike, reconnaissance-fire complexes. This is how they work, this is how they are evolved. Look at this, and you begin to compare things. The United States Army, which is supposed to be the best army in the world, right? They defeated everybody. They defeated… you know what? They destroyed Carthage, didn’t you know that was… yeah, that Carthage US Army. So and yeah, Borodino and Stalingrad, US Army won it. General Patton won Kursk battle.</p><p>So and you look at that, and you take a look not only at the table of organization and equipment – it is outranged, and not sometimes by several things, several units. Sometimes it’s outranged sometimes by the order of magnitude. And they have literally nothing which they can bring to bear without being detected and annihilated, and as have been demonstrated, you know.</p><p>So when you look at this, I mean guys, you are stuck in 1990.</p><p><strong>Piero:</strong> Yeah, and you’re rightfully… it’s an interesting date because I remember I was young, but I remember in the 80s when we… you know, I was studying of course a lot of the NATO structure and NATO – not just the doctrine, but the doctrine is very important, but the table of organization and why it was in such and such a way. At least at the time you had colonels or generals who within NATO, including the US, who had a grasp of managing a corps, managing an army, yeah, army group perhaps not, but because that’s… Europe is tiny in terms of the battlefield. But certainly what made sense was the strategy of holding Germany and this fighting retreat to the Rhine was actually well thought, and with equipment that was adapted to it. With the even the tanks that we see today, they were adapted to Central Europe, not to Ukraine. In fact, they are not adapted at all to the plains of Ukraine. The T-72s and the Soviet system is more adapted, which we saw on both Ukrainian and Russian side of course. But but of course none of these people are around or not, and even perhaps not even alive. And it was never battle tested – of course Vietnam, Saddam Hussein, this was not relevant. And one could argue that in the long run they lost even in Iraq because… yeah, they did. Yeah, they had billions of dollars lost, wasted – well, not wasted for everyone, but wasted for the taxpayer.</p><p>So it’s very difficult to recover this lost expertise. And I must say frankly, even when I look at the Russian operations, there’s been a lot of learning, the steep learning curve.</p><p><strong>Andrei:</strong> Oh yeah, the steep learning, absolutely. Russians entered Ukraine in 2022 with a peacetime army. Yeah, exactly, and it never works perfectly. It’s… we should do a show just on criticism of that, just on the side, but not to go… because if we go into this kind of thing, we’re here for three hours, which would be fun. But let’s let me focus on how do we get to peace.</p><p><strong>Piero: </strong>So do we get peace through total collapse of Ukraine forces? Do we get peace by some penetration at some point, operational maneuver at some point? Do we get… and where do… what do we get? Do we get east of the Dnieper? Odessa? It seems to me that the more the months advance, the more we go to a total unconditional surrender.</p><p><strong>Andrei:</strong> Yeah, there it’s… you’re absolutely correct. It is Putin’s way, so to speak. Obviously it’s not just Putin – don’t forget Putin also have to fight among his circle people who would love to go to Rhine again, you know. So yeah, and not that Russia, if it puts its mind to it, she can’t do it. Why? Nobody needs European freezers. Yeah, so but the point… I would advise Russia not to. Yeah, so no, Russians do not want to have any… although I would love to be liberated, I would love to be liberated. No, Russians… I won’t advise it. Overwhelming majority of Russians do not even identify themselves as Europeans anymore.</p><p>So and so the point is that Russia can do this what she’s doing now as long as it takes. And as I already stated, collapse of the front… even The Economist today – not today, I mean last week – came out with this “the end is much nearer than you think it is,” because yeah, you have now the whole formations of the 18-year-old kids, women fighting there. They literally grab everybody on the street. And that’s it – that means they are at the bottom of the barrel. And Russians will continue to do this until they have nothing left in terms of personnel, in terms of technology. Russians don’t care – they have full dominance, preponderance in fact, on the battlefield.</p><p>So if they want to send, let’s say, another 30 Abrams… and why don’t they send the Leclercs? Hey France, come on, they have the guys who are fighting there who have the mortgages to pay, you know. So and when you hit something, you know… F-16 or Mirage, yeah, it’s 15 million rubles. If you hit Abrams, it’s what, 10 million? And so yeah, it’s a good chunk of cash which gets you really far in Russia. So yeah, Russians don’t care, and that’s the whole point there.</p><p>As we already spoke about it, it doesn’t matter what they throw, you know, at Ukraine. It wouldn’t make any difference whatsoever. So the grind continues. And some people evidently who are not completely lost in Pentagon, they understand the reality that it will be collapse of the front. There is no necessity to give… make those or do those large red arrow offensives. Why? To increase your casualties? Because it is inevitable, you know. You need to bypass many things, you need to then continue to commit forces to do things, including the internal rings of the containment of the bypassed strong points and towns and cities, you know. No, you just… cities are traps, towns are traps. So what you do? You slow grind, you get them out, because this is what NATO is good at, you know – hiding behind the backs of civilians. And this is exactly the modus operandi of practically throughout three years of the Ukrainian Armed Forces. Albeit people already suggest me, and we might as well go and call it as it is – NATO forces. Ukraine was the best army NATO ever had. That’s… many people do not understand. Possibly true.</p><p>So and as a result, Russians wait, they kill as many as necessary, they move, mop up, storm groups, you know. Obviously these are the best troops today in the world by far. What they do? You can take a look at like two Russians against 14 – two Russian Slavyansk against 14 Ukrainian soldiers. Guess what? Guess who wins? Two Russians, you know. So that explains to the level of the competence on the tactical level. And of course we look at the higher tactical level, level of the brigades, let alone operational level. I mean, there’s nothing there which can compare to it now.</p><p>And especially when you look at… I just to give you number – my video will come out earlier than yours probably because I’m finishing editing after we’re… just throughout 2023, well, it’s my connection, people really who in the know, okay, they are my friends. Just throughout 2023, Russia produced – are you ready? – 23 million units of shells, missiles. Those people, they have no clue. 23… in the UK, yeah, they do not even understand what they are dealing with.</p><p>I mean, you get any NATO general from PEPO… you know, I’m not talking about clowns like Kellogg or Keene – those are incompetent morons basically – and explain to him: “Dude, just in a year,” and since then Russia actually… 23, which is probably much lower than 2024, because… oh, absolutely, yeah… million units, yeah, it’s shells and missiles. They do not understand that… no, Russia doesn’t produce more missiles in one month than NATO altogether produces in a year. No, no, no – Russia produces in one month more smart munitions and high precision weapons than probably NATO produces in five to seven years combined, including United States.</p><p>So those people, they have no grasp of this. The same as you cannot explain to any from Pentagon what it means… so does it mean that there’s no more washing machines around?</p><p><strong>Piero:</strong> Yeah, Russians are really good at importing washing machines. Do you still have washing machines in Moscow?</p><p><strong>Andrei:</strong> Of course, yeah, that’s what it is. Yeah, refrigerators, refrigerators, even importing their, you know, those toilet seats from Japan, you know, all works, you know. So it’s all goes into Russian military-industrial complex.</p><p>So and when you explain for the morons what you’re observing, they have no clue. And this is like… they figured out that “Oh gosh, yeah, Russia is like fourth economy in the world.” Well, I would dare to say that’s actually by the sheer size of it, and especially some things which are not reported, it’s about third economy in the world, right behind the United States. Despite being more than two times smaller in terms of population, it’s larger than India’s economy. And you look at the… well, simple data – Russia produces more steel and iron than the United States.</p><p><strong>Piero:</strong> Yeah, of course, of course. So that’s… so I remind people who are listening or watching us that I’m with Andrei Martyanov, and that all… by the way, his book and his website and his link will be in the description of the video. And let me just say as a personal note that it’s good to laugh a bit about all these topics because unfortunately they are tragic, and we have to laugh. And I appreciate your… you have a YouTube channel which I will link as well here, where you give your analysis, and it’s good to take a bit of steam off. Certainly in Europe and I presume in the US, the media are way very serious about this. And as you said, the propaganda post-World War II has dehumanized a lot of Russians in general. And it’s obviously insane because it’s not working, and the result is massive defeat as you described.</p><p>Could there be a chance so that if whatever the situation, whatever actually the diplomacy achieves… there can always be disappointments in diplomacy compared to the battlefield, but certainly isn’t there a chance that, you know, the Russian Liberation Army in 1945 kept guerrilla war for 10 years? Isn’t there a chance that this non-conventional war, let’s put it, or even if there is a peace agreement or an armistice that both all sides agree… isn’t there a chance that there would be continuation of sabotage, commando actions, even drones, from…</p><p><strong>Andrei:</strong> Oh, absolutely, absolutely. That goes without saying until the generation changes. And don’t forget, whatever will be left of Ukraine, it is already the case – we are looking at the nation which is mentally destroyed. I mean, they are… I wouldn’t go, you know, on the tangent here and describing the level of the idiocy which they live in. But yes, absolutely – terrorism, sabotage, it goes without saying. But then it stops being military operation, it becomes primarily special services operation, primarily FSB and so not only FSB – their internal affairs and things of this nature. So and even SVR and GU, which is former GRU, all will be involved. And so yes, absolutely, this will continue.</p><p>Let me tell you, almost 11 years after the de facto joining of the Donbas republics and 3 years since they became officially, you know, the part of Russia, I can tell you one thing – corruption there is still… I mean, it’s just absolutely ridiculous. You have to, so to speak, sort out or weed out Ukraine-ship, Ukraine-ship, you know, in terms of the psychology, in terms of their behavioral matrices, modus operandi of people. It takes generation. And even today you have all those people who, you know, what are easily recruited by the HUR, which is of course the main military directorate of Ukraine. So and whenever you go there, you just see what is going to happen pretty soon in terms of the sabotage, terrorism, and…</p><p><strong>Piero:</strong> Yeah, yeah, it’s sad because there is so much to be building together between all these countries. And unfortunately, unfortunately it’s… well, it is what it is. It’s Europe made up its mind, you know. Europe made up its mind. The West, combined West, decided – it didn’t decide it yesterday or even three years ago. It has been in gestation for generations, yes, since the end of the World War II. And it was actually due to primarily Soviet propaganda, which was in many respects pro-Western while it was screaming about, you know, what all those, you know, negotiations about arms control and aggressive policies, which was true. Those morons still operated on the basis of the, you know, proletarian internationalism. Yeah, even after that. “Oh yeah, but we have progressive society,” you know, “progressive public.” Well, progressive public… I mean, world’s LGBTQ, whatever the hell it is, and they hate Russians for that. So but they’re not saying that “Oh yeah, because they have some kind of leftish views.” Well, we know what kind of views they had, you know, and we now know. So and they hated us absolutely.</p><p>So whenever they come and now say, “Oh, some European artistic people, who cares?” And that’s what it is. Russians want Iron Curtain, and this time that’s what’s going to happen.</p><p><strong>Piero:</strong> Which is a problem for me because I need to travel to Russia once in a while.</p><p><strong>Andrei:</strong> Well, you have… we find a way, we find a way. Yeah, Turkey is… yeah, is making money out of it, a lot. Oh yeah, sure. Now, in fact, on this topic, it was interesting. You probably know the story, but… Oh, by the way, before I forgot, before I forgot – Serbia. Go to Belgrade, fly there. 3 hours, you’re in Moscow.</p><p><strong>Piero:</strong> Oh, and where they fly above? Belarus, above Poland?</p><p><strong>Andrei:</strong> Yeah, of course, you’re not flying around. Yeah, Serbs are competent people.</p><p><strong>Piero:</strong> Well, that’s one way to do it. But yeah, you probably know the story. During the 80s, the idea of NATO was to say, “Okay, if there is an…” because obviously they were never thinking that they would attack. Even if when you look at the plans from the 50s and 60s, the Americans had plans to attack first.</p><p><strong>Andrei:</strong> Yeah, well, continuously, yeah, yeah.</p><p><strong>Piero:</strong> And of course, the idea was “We have to hold for eight weeks, and then by magic the Soviet Union collapses.” And what was… which may or may not have been a good plan – I think not – but what was striking was that the same idea came out in 2022: “Oh, we have to help Ukraine to hold, and then Russia will collapse and they will topple the Putin regime.”</p><p><strong>Andrei:</strong> Yeah, oh, absolutely. With what you describe, which I think it’s accurate, that there would be this kind of terrorism and very low-intensity war over many, many years, this is actually reinforcing whoever is in power in Russia, for sure, as it does everywhere when you have this attack from the outside. So it’s extra double-plus cause for failure as a strategy.</p><p>I mean, they don’t do strategy. Europe, West don’t do strategy. They don’t know how to do strategy. I’m sorry, what they pass for strategy is a… as one of my good acquaintances Alexander Rogers says, that’s a business plan. They do not understand… get me any NATO strategic planner, and I would love to talk to him about strategy. They do not understand what strategy is. They know definitions – they never internalized what is required for strategy, which, by the way, you already mentioned this, you know – statistics, real statistics. It’s not GIGO – garbage in, garbage out. This is how they operate. Their inputs are inputs by the madman for curators, you know, who do not understand basic mathematics or arithmetic, let alone, you know, military, and let alone political strategy. There is no strategic intelligence as a craft in the West left. None, doesn’t exist.</p><p><strong>Piero:</strong> When I saw NATO countries in the military, people my age starting to use PowerPoint to plan whatever they were planning, I knew they were screwed.</p><p><strong>Andrei:</strong> Yeah, it’s a bad start. The genius move, the genius move on part of Putin and his government was to open this program for normal Westerners who share normal human, primarily Christian values, to go to Russia. Get three months automatically, and then for 3 years, no visa required. You just stay there, learn language, culture, and you become Russian citizen. My God, you have streams of Germans, even French, you know, all kinds of people going to Russia to get this. Because as Germans, especially there are many people from former GDR and even Germans from West Germany who cannot take this anymore. If you’re normal people, you just cannot take this anymore. You live in the completely… you know, if you follow this and you live it through your everyday life, you live under constant stress. It’s… I know it could be depressing, it could be absolutely depressing when your rights are limited every time, you are brainwashed constantly. And even those people who do not have background, inevitably their models of… revenge, so to speak, the way they live is going to be disrupted, which is being disrupted by all this. And they see themselves… I mean, come on, there is a Paris shock, they call it Paris shock or Paris syndrome, especially Asians. They imagine Paris to be like something grandeur, you know. They come in – it’s narrow streets, it stinks with urine, it’s dirty like hell, and they’re like, “What?” You know.</p><p>And then you go… did you see this videos of Amsterdam? They urinate on the streets, and you know, those tourists going under the bridge, urine dropping on their tables with their drinks and everything. That’s Europe, I’m sorry, and I know it’s bad, but this is what it is. And it will become worse than that. You look at… you look at London. Take out people out of the touristic places – it is a dump. It is a dump, crime-ridden dump, and it stinks. And then people go to Moscow, St. Petersburg, Yekaterinburg, and they have the cognitive dissonance of their life. And it’s safe, you know.</p><p>So there you go.</p><p><em><a href=\"https://socialgalactic.com/micropost/432e2028-8bb7-4d72-9e85-73e36d9228d1\">DISCUSS ON SG</a></em></p></div>",
  "content_text": "In which Piero San Giorgio and Andrei Martyanov discuss the prospects for peace in Europe and NATO’s total lack of preparation for an escalated conflict with Russia:\nPiero:\nSo it was a few days ago that it was Victory Parade, and as you know, for me it is an event that is very dear because it is on May 9th, 1945 that my grandfather was liberated from a prisoner camp in Germany by the Red Army. So we always had this 9th of May as a family important day. And in fact, I will drink to it. I brought this from Moscow – I think it’s a 20mm shell anyway. And I wanted to start asking you the question: what does it mean for you and what does it mean for Russians in general, and what should it mean for everyone else, especially on this 80th anniversary of May 9th Victory Day?\nAndrei:\nWell, it’s part of the family. Every family – literally every – there’s not a single family in Russia which hasn’t been touched by those events. And I understand, especially for you being a European, essentially it wasn’t the fight of Soviet Union, which was historic Russia, Russian Empire, new edition of Russian Empire. It was the fight against the combined forces of… It wasn’t just Germans. People who say that it’s “oh Germany” – yes Germany, but what about Romanian, Italian, Hungarian armies? Finnish half a million force of SS who participated in blockade of Leningrad, the siege of Leningrad. And you look at the SS divisions from France – Charlemagne – you know, Blue Division from Spain.\nSo when you go and look at this, yes, this was a unified European front against the Soviet Union. And as the result, we had a cataclysmic event of the kind which humanity never experienced. In four years, up to 70 million people on different fronts have been killed. Some of them have been killed in the most brutal way which haven’t been experienced before – be that concentration camps, let alone death camps, the industrial scale annihilation of the civilians like it was in Russia. And 27 million Soviet people died – actually majority of them civilians.\nSo whenever the so-called revisionists in the West begin… So-called revisionists – they don’t revise things, they just rewrite history. Most of them are not professional historians and they don’t know the first thing about warfare. But when they begin to rewrite history, they forget to say that majority of those were civilians. And the atrocities which have been committed against Soviet Union, and especially the utter destruction of European part of Soviet Union – primarily Russia and Belarus and Ukraine what is today – is unprecedented. And only Poles suffered equally, and obviously Chinese, but they had a much larger population already then.\nSo that’s the result. Scott Ritter stated a very interesting thing and I liked it very much, and I quote him: he said Russians cannot do anything about it because they have those people looking down at them. This is like… it was such a profundity. One of very few Americans who really grasped what it was.\nSo my family – no granddads, all killed at the front. My maternal grandfather was killed in 1941 around Donetsk. Then of course when my grandma remarried in 1945 – four years after, you know – she married again a veteran and he fought starting from the Soviet-Finnish War. So it’s in every family. My wife – she doesn’t have grandfathers. Pretty much 80-85% of the 23-year-olds generation in Soviet Union have been killed on the front. Yeah, disaster.\nPiero:\nAnd it’s even more pitiful to consider the situation of today, that first of all it wasn’t the first time that Europeans tried to invade Russia – the Swedes, the Poles of course, but also Napoleon’s international armies. It was not just French. Crimean War, World War I was also… okay, we can argue on who really started it, but certainly there was a major front on the east in Russia. And all of this for me is very sad because you mentioned Europeans in World War II, the Charlemagne division and all that, and these young men were idealistic for the wrong reasons. And it’s always sad when you see young men dying for stupid reasons against other young men which could have had a bright future on all sides. And it’s such a disaster for me, for Europe and European civilization.\nAnd so Victory Parade, the 80th anniversary last week – what do you… I obviously watched it, of course you watched it as well. What do you feel when you watch it?\nAndrei:\nWell, it’s a sacred event really, and for any Russian. And especially most important thing actually is not even the parade – it’s the tradition, it’s a relatively new tradition of the Immortal Regiment. In St. Petersburg alone, which became Leningrad for a day sort of, 1.1 million people went out with their portraits of their grandfathers and grandmothers who fought and worked in rear to supply the front and all that. So it’s… I don’t even know how to explain it. I mean, many people they do not comprehend what is happening in terms of spiritual importance of all that. And it’s extremely important, extremely important. This is the part of you – you cannot change it, you just cannot change it. It’s there, you know.\nSo it’s… how can I forget my grandfathers? How? I mean, you know, they defended their motherland. Yes, they didn’t invade somebody, you know. Like people want to say, “Oh yeah, you split Poland between Germany.” Well, you wanted it, you refused to… So people don’t know the history, most people don’t. And in the West it is completely rewritten by the falsifiers and lowlifes, especially British succeeded, and Germans by the way. So when you look at that, what can I say? I mean Europe made up its mind. It’s Europe’s choice and nothing could be done about it. It cannot be changed.\nDISCUSS ON SG\nPiero:\nOn a more than symbolic level, there were troops marching and parading from China, from a lot of the former Soviet republics which were at the time of the Soviet Union of course participating in the Great Patriotic War. Is that a strong symbol today?\nAndrei:\nOh, it is still a very strong symbol, absolutely. But for those republics, it will fade away eventually because we have to be very realistic about the fact that these remnants of this internationalist Soviet culture – they are evaporating, let’s put it this way. The new generation, and especially when you look at those ‘stans – you know, Uzbekistan, Tajikistan, whatever they do – I mean you cannot change their basically religious and cultural trends there.\nSo just to give you example: Uzbekistan – they had some obviously veterans who participated heroically in fighting in the Red Army and all that, but it was primarily the place where you would evacuate very many civilians in Soviet time during the Great Patriotic War 1941, 1942, 1943. But their memorial, for example, to their Soviet soldiers doesn’t have even Russian inscribed anymore – it’s in English. And when they ask them why did you do this, “Oh, we have many tourists who speak English.” Okay, sure, you know.\nBut yeah, and again, those… while nobody tries to diminish the sacrifice and participation of those people, I have to tell you that these were Slavs primarily who died. Again, however, if you take a look for example at Azerbaijan compared to its percentage of population, they contributed tremendously. There were number of divisions, and they fought violently. They had a truckload of Heroes of the Soviet Union and so… yeah, it’s… but Caucasus was always a little bit different thing altogether, and there’s been… they’ve been on both sides there, yeah. So but that’s what it is, and yeah, inevitably for them it will fade away, but for Russians it will always remain. Simple as that.\nPiero:\nSo eight years after 1945, we had the bizarre event of a lot of Western so-called leaders, or so-called elected leaders, celebrating with Ukraine of all places in Berlin. And for a lot of people my generation, we understand history still – we’re not like the young who are not educated unfortunately, or not like our fathers who didn’t really care. But it’s a paradox to see the people representing the ideology who lost in 1945 not parading – because I don’t think there’s anything to parade – but certainly commemorating it in a weird way in the capital of the defeated power.\nAndrei:\nYeah, it’s… when you look at that… And I’m on record, I have facts to back me up on that, I wrote four books on that. I mean, again, they are not the victors, they are losers. France is a loser. France was a Nazi power, okay? Just let’s drop any kind of pretense. If not for the Free French and especially Normandie-Niémen, which performed absolutely heroically and this is the only thing De Gaulle could spare, and he knew that he had to put somebody in the Red Army to fight, and they covered themselves in glory and absolutely deserved number of the Heroes of the Soviet Union, no less, from French pilots.\nBut primarily, the number of the French servicemen in SS divisions and actually in Wehrmacht first line and punitive formations was several times larger than they had in the resistance, which primarily was run anyway by British and Russian white immigration – those ones who… very few minority of them who didn’t have this rabid anti-Soviet sentiment which most of the white immigration had.\nSo and there you go, and suddenly you say, “Hey, how about Spain?” You know, “How about Vichy? Hey guys, you supported it.” You know, like, “Oh, Czechs.” Oh yeah, we had… Well yeah, you had one guy who actually in 1938 offered resistance – the Czech officer. The rest of it is just… you did well. Germans used a third of the Germany… Wehrmacht actually hardware was built in Czech Republic, in Czechoslovakia. So best tanks ever in Czech Republic, yeah.\nSo it’s like, yeah sure, yeah, it’s just Germany. But yeah, and obviously everybody forgets about Poland grabbing Teschen region, you know, just basically tearing apart together with Germans the Czechoslovakia. So yeah, it’s like… let them… it’s hyenas. They are hyenas. Although it’s incorrect phrase about Poland by Churchill. Churchill actually stated that Poland had the appetite of a hyena – it’s not quite calling them hyenas. But yeah, they all are hyenas of Europe. They hate Russian guts, always did and always will continue to hate Russian guts.\nTheir presence of the minority of normal, decent people with the normal morality, normal knowledge of the history – they are still minority. Majority of them, you cannot change it. In France in 2017, when Sputnik Globe was conducting their poll about “do you consider Russians Europeans?” actually three-quarters of them said no – French, you know, no less. And that was ’17. Today they probably three-quarters of those French don’t consider Russians even humans, you know.\nSo there is a minority – it’s significant, but it’s all minorities. Most of those people, they don’t care about Russians, and if Russians will die out tomorrow in tens of millions, it will be good because their Russophobia is entrenched in Europe and nothing could be done about it. You cannot change it.\nIt comes when people say, “Oh, I didn’t want for that.” I always say… well, not that Marine Le Pen is not globalist – she’s professional oppositionist, she never meant to run anything. But the point is that Macron was reelected with the overwhelming margin. He literally stomped on Marine Le Pen and National Front. Even if you consider the fact that they falsified something, you cannot falsify 20-plus percent lead which he had. It was absolutely landslide, you know. The French wanted it.\nSo I mean, there you go. It’s just French. But there are of course Germans, and Germans are a whole other story. Anybody who tells me that some German, average German, is fond of Russia… no, they want Russian energy and continue to hate Russians as the nation which never recovered from the trauma of being utterly defeated by the Red Army. They never did, they never recovered. The Nazi core was imported by the United States, Vatican and British, resettled in the United States, Britain, South America. Wehrmacht wrote Wehrmacht operational concepts for NATO and US Army.\nAnd it’s like, how far can you go with that? I mean, and then suddenly we have, especially starting for the last 20 years, all those… being all those documents and archives being opened, and you’re saying like, “Oh yeah, sure, how British ended up being on the right side is obviously they have to thank Churchill.” But there was no moral choice there – he was merely calculating, that’s pretty much it.\nPiero:\nNow of course, as someone who absolutely loves European culture, European people – and even, you know, Poland is a country I really like – I must say that I want to say that no, you’re wrong, Europeans actually would like to like Russia, European people are not like the leaders they have elected more or less. However, the facts don’t show me to be right, it shows you to be right.\nI’m a Western person. I actually… this is what I will be repeating in the video which comes – my video today. Again I reiterate this point: I am a Western man by culture. As, you know, what for me… Pink Floyd, Beethoven, Tchaikovsky – they are all the same, you know. I read… I grew up with the Western literature. Russian literature is a part of the Western cultural vault. Great Russian literature, you know. We grew up with the good Hollywood, you know, good European cinematography. Culturally we are Western people. We appreciate what was embedded, at least on the surface, in the understanding of the democracy, freedom of the individual and things of this nature. I am absolutely a Western man in this, and most Russians are.\nBut you cannot change what you cannot change. And the fact is, culturally mainly today in Europe… as again, listen, Nazism never was defeated by the Western part. They preserved it, they preserved it. Again, as I said, Wehrmacht was writing operational concepts for NATO and for the US Army. And it’s like, yeah, you look at this and you spit on somebody: “Oh yeah, the guy from SS. Oh, the guy… oh my God, Werner von Braun.” No, no. “SS Gruppenführer and SS…” I’m sorry guys, I mean, how else can you… “Oh no, he was a scientist.” Sure man, was a scientist. He was a medical doctor. “My God, his science…” He tortured people to death, considering, you know, committing atrocities which are incomprehensible. Well, only Islamic State now kind of tries to compete for, you know, the bestiality of this whole thing, with much less science, much less science, yeah.\nSo what do you expect? This is all in the open now, you know. And as the result, well, West made sure that it will be defeated yet again, which is happening today, because they created this absolute alternative universe perception of the outside world.\nAndrei:\nAnd you’re correct. I mean, you look at Macron, Starmer, or Merz – these are not normal people. They are imbeciles, probably. No, I mean literally imbeciles. And the fact is that French voted for this thing, you know, Macron and whatever the hell… whatever the creature he is married to, you know. I don’t… not going to go into all kinds of speculation of this matter. Hey, that explains everything about them. This is who they are, this is who they are.\nThe only thing they can do… I mean, these creeps from the radical left, you know, the European culture… Germans are absolutely… They turned the nation into the… you know, and so they emasculated them completely. But they hate everybody because of that. They hate themselves, but they hate Russians – perfect object and subject to be hating upon, you know.\nSo as the result, you look at what is happening to European economy, culture, and things of this nature – it’s a catastrophe. I don’t think France will survive as a unified nation and as a nation per se beyond 2050, period. They are taking it, and they are actually loving it – many of them do. So they are…\nAnd I will give you the example – it’s going to be in my video today. My good friend – he is Colonel Vladimir Trukhan, and the Russian first deputy of the representative diplomat of the OSCE – Organization for Security and Cooperation in Europe. They had the wonderful discussion yesterday about Europe and how they want to fight Russians. And of course everybody laughs at that when you count actual military things and industries. He absolutely correctly stated that when in OSCE he talks to people – you know, those bunch of clowns from Western Europe – they say, “Oh, we have enough dogs and police to suppress any kind of…” That’s what they think for them… people.\nBut then again, as I already stated, France 2050… maybe after that they will be… south of France will be turned into their caliphate, some kind, something like that. And the rest of it… I mean, yeah, there you go.\nPiero:\nNorth as well, the North as well, don’t worry.\nAndrei:\nYeah, so yeah, that’s where they go. They wanted it, they voted for it. I’m sorry, can we stop this? Can we drop this BS like “Oh, I didn’t vote?” Maybe you didn’t vote for that, but majority did, you know. Majority did. We have to live with the reality of the fact. You know what? Russians, for example, in 1990s – that’s why actually I left Russia – I mean, they voted for… granted, you know, for Yeltsin second time. Boy, did they have been, you know, taken through some… well, basically genocide essentially. They learned their lesson, didn’t they? Sure, sure did.\nBut Europeans, they don’t learn anything because they really think that they are so irresistible, so amazing. French or, you know, Germans still think that they have industry. Russians laugh at it. That’s why I always say… I’m sick and tired of this cliché like, “If we put together German technology and Russian resources…” What German technology? I mean, overpriced junky cars which you cannot fix properly, you know? Now you have to… or what else? Siemens? I mean, if Germany wants to put up 32 satellites in the space of GLONASS global positioning system or have the space program, its economy… the border will fall off. Many people still do not understand even though the Special Military Operation proved it beyond any doubt.\nPiero:\nSpeaking of which, again, if we move slightly east and in even less democratic area than of Europe, Special Operation Ukraine now is on the third year. It seems pretty obvious that everything you’ve been saying and others have been saying about the way it’s going has been validated – the clear advance or more rather attrition of… and I’m very sad about it because again one million more Ukrainian young men dead. They’re Europeans, they’re my brothers, they’re my cousins, so I’m very sad. And also the hundred or I don’t know how many, but certainly probably around 100,000 Russians as well.\nAndrei:\nYeah, some… yeah, between 98 and 105, the estimates.\nPiero:\nAnd despite the ratio which is of course hugely favorable to Russia, it’s still… I’m still very sad because then there are broken families, broken people, and I’d rather have peace than war. But what can you do when people are not reasonable? And when I say people, I mean the American Department of State and the British oligarchs who push for war against Russia for the last two centuries. But if we move to Ukraine, what is the path to peace or and maybe even long-standing peace? What’s your opinion? How is it going to play out?\nAndrei:\nWell, I looked up today the numbers by Russian Defense Ministry, and it’s frontline numbers only – they do not count the even tactical rear or operational rear. And the attrition day is as large as that on the front line. So it’s kicking up back to where it was, you know, before the ceasefire – volunteer, you know, the self-imposed ceasefire for the celebration of the 80th by Russia, 72 hours. It’s over now, and slaughter continues, and it will continue.\nEven The Economist – this bunch of the imbeciles from London – admitted today that yeah, the end is much nearer than you think it is, which it is. I mean, Russia… Russian objectives, objective here, which many people still don’t get, and I repeat it ad nauseam: Russia is demilitarizing, demilitarizing NATO, pure Ukraine. I’m sorry to say this, and I know that sounds horrible – Russian objective is to kill the remnants of the sperm bank of Ukrainian men so for Ukrainian nation and what it was for the several centuries towards Russia not to recover ever again. Simple as that.\nAnd I understand it sounds horrible, but this is what you do. You know, you exchange about 2-3 million people for the lives and well-being of the 160-plus million people in Russian Federation and Belarus, which is the part of the union state. So what are you going to do? You physically annihilate enemy, and this is what is happening now.\nThe attrition rates today went from what it used to be – 1 to 10 – it now up to 1 to 20. This is a slaughter, and this is exposition of the military incompetence and stupidity of NATO, from Pentagon to Brussels to what have you. We can absolutely confidently state that Western militaries are incompetent. Their military education is a joke, their officer corps is a joke, and so… and let alone the whatever they…\nAnd again, listen, these guys, they lived in this bubble alternative universe written for them by Wehrmacht, and what Wehrmacht wrote to them and explained to them, and it found its basically development and reflection in such things as the field manuals, operational manuals of the US Army, or obviously Bundeswehr and all that, is that “Oh, look at us, we were lions, brilliant, you know, and we just suddenly lost the war because Russians took their 500 million people and corpses and threw at us, and we cannot resist that.”\nThis is documented – this is not urban legend. It was documented by several information agencies around the world. It is actually described in Alexander Werth’s famous “Russia at War” masterpiece, which came out in the 1960s. So De Gaul, and Alexander Werth being the correspondent of Associated Press at that time, or Reuters, whatever – so De Gaul was taken to Stalingrad in February 1943 after the whole thing was done. And he went out on the bank of Volga looking at the east bank, and he was saying things like “What a great people, what a great people.” And the correspondents who followed him, because he was promoted as he himself complained, saying “Oh, you mean Russians?” He said, “No, Germans to get that far.”\nSo yeah, and the point is when you have those people who create alternative history, they create alternative operational art, alternative theory of operations, alternative tactics – everything alternative, alternative technological issues. What do you expect? You get a sand castle. Get any Pentagon officer from basically lieutenant rank up to their four-star general – most of them will not even pass the entrance exam to any Russian military academy. They will fail, let alone if you get them into the specific what is called the services – not services but specific troops such as air defense or naval academies. Good Lord, they just will not pass it.\nPiero:\nYeah, they seem to be very much unqualified to manage anything that is linked to statistics, which is… you know, I used to develop war games simulations, so I’m not a soldier. I have no idea how you would actually run a battle in reality, but I know how to create simulation. And for simulation you need statistics, you need of course extremely detailed ratios, and sometimes you don’t know so you have to figure out as much as guesstimate as you can. But certainly a regimental commander of the 18th century when they had to have pikes and muskets, or even before, had a better grasping of what it actually means – volley fire in terms of statistics and in terms of casualties, in terms of how you win based on the numbers and ability of your soldiers and so on – probably better than the people who are running NATO now, who are at best able to run some tactical schemes and using some weapons.\nAndrei:\nYeah, it’s a tactical level – it’s a tactical level maximum. And even this tactical level is based primarily on memorizing and training. Nothing wrong with training, make no mistake – you have to train, you have to constantly practice, and this is absolutely normal. But when you have a tactical manual written from the position that “Oh yeah, I’ll call in the close air support” and that’s the only thing they know actually how to do properly – what if that close air support is not coming because it will be shut down or destroyed on the tactical rear runways? They never fought anything like this. They never… they don’t understand it. They don’t understand that what happens if you are outranged by everything? No, your Stinger doesn’t work at 7 kilometers because Mi-28 or Ka-52 has this Hermes, what is called the production item 305, and it flies and it’s shoot and forget at the range of 18 kilometers. What are you going to do? Yep, and you will be detected, you will be seen, you will be tracked there.\nAnd then suddenly, as Jacques Baud – I don’t know if you invited Jacques Baud before, so yes, he’s welcome if he’s listening, yeah, you should – yeah, he brilliantly developed it in a wonderful book and he basically says here’s reconnaissance-strike, reconnaissance-fire complexes. This is how they work, this is how they are evolved. Look at this, and you begin to compare things. The United States Army, which is supposed to be the best army in the world, right? They defeated everybody. They defeated… you know what? They destroyed Carthage, didn’t you know that was… yeah, that Carthage US Army. So and yeah, Borodino and Stalingrad, US Army won it. General Patton won Kursk battle.\nSo and you look at that, and you take a look not only at the table of organization and equipment – it is outranged, and not sometimes by several things, several units. Sometimes it’s outranged sometimes by the order of magnitude. And they have literally nothing which they can bring to bear without being detected and annihilated, and as have been demonstrated, you know.\nSo when you look at this, I mean guys, you are stuck in 1990.\nPiero:\nYeah, and you’re rightfully… it’s an interesting date because I remember I was young, but I remember in the 80s when we… you know, I was studying of course a lot of the NATO structure and NATO – not just the doctrine, but the doctrine is very important, but the table of organization and why it was in such and such a way. At least at the time you had colonels or generals who within NATO, including the US, who had a grasp of managing a corps, managing an army, yeah, army group perhaps not, but because that’s… Europe is tiny in terms of the battlefield. But certainly what made sense was the strategy of holding Germany and this fighting retreat to the Rhine was actually well thought, and with equipment that was adapted to it. With the even the tanks that we see today, they were adapted to Central Europe, not to Ukraine. In fact, they are not adapted at all to the plains of Ukraine. The T-72s and the Soviet system is more adapted, which we saw on both Ukrainian and Russian side of course. But but of course none of these people are around or not, and even perhaps not even alive. And it was never battle tested – of course Vietnam, Saddam Hussein, this was not relevant. And one could argue that in the long run they lost even in Iraq because… yeah, they did. Yeah, they had billions of dollars lost, wasted – well, not wasted for everyone, but wasted for the taxpayer.\nSo it’s very difficult to recover this lost expertise. And I must say frankly, even when I look at the Russian operations, there’s been a lot of learning, the steep learning curve.\nAndrei:\nOh yeah, the steep learning, absolutely. Russians entered Ukraine in 2022 with a peacetime army. Yeah, exactly, and it never works perfectly. It’s… we should do a show just on criticism of that, just on the side, but not to go… because if we go into this kind of thing, we’re here for three hours, which would be fun. But let’s let me focus on how do we get to peace.\nPiero:\nSo do we get peace through total collapse of Ukraine forces? Do we get peace by some penetration at some point, operational maneuver at some point? Do we get… and where do… what do we get? Do we get east of the Dnieper? Odessa? It seems to me that the more the months advance, the more we go to a total unconditional surrender.\nAndrei:\nYeah, there it’s… you’re absolutely correct. It is Putin’s way, so to speak. Obviously it’s not just Putin – don’t forget Putin also have to fight among his circle people who would love to go to Rhine again, you know. So yeah, and not that Russia, if it puts its mind to it, she can’t do it. Why? Nobody needs European freezers. Yeah, so but the point… I would advise Russia not to. Yeah, so no, Russians do not want to have any… although I would love to be liberated, I would love to be liberated. No, Russians… I won’t advise it. Overwhelming majority of Russians do not even identify themselves as Europeans anymore.\nSo and so the point is that Russia can do this what she’s doing now as long as it takes. And as I already stated, collapse of the front… even The Economist today – not today, I mean last week – came out with this “the end is much nearer than you think it is,” because yeah, you have now the whole formations of the 18-year-old kids, women fighting there. They literally grab everybody on the street. And that’s it – that means they are at the bottom of the barrel. And Russians will continue to do this until they have nothing left in terms of personnel, in terms of technology. Russians don’t care – they have full dominance, preponderance in fact, on the battlefield.\nSo if they want to send, let’s say, another 30 Abrams… and why don’t they send the Leclercs? Hey France, come on, they have the guys who are fighting there who have the mortgages to pay, you know. So and when you hit something, you know… F-16 or Mirage, yeah, it’s 15 million rubles. If you hit Abrams, it’s what, 10 million? And so yeah, it’s a good chunk of cash which gets you really far in Russia. So yeah, Russians don’t care, and that’s the whole point there.\nAs we already spoke about it, it doesn’t matter what they throw, you know, at Ukraine. It wouldn’t make any difference whatsoever. So the grind continues. And some people evidently who are not completely lost in Pentagon, they understand the reality that it will be collapse of the front. There is no necessity to give… make those or do those large red arrow offensives. Why? To increase your casualties? Because it is inevitable, you know. You need to bypass many things, you need to then continue to commit forces to do things, including the internal rings of the containment of the bypassed strong points and towns and cities, you know. No, you just… cities are traps, towns are traps. So what you do? You slow grind, you get them out, because this is what NATO is good at, you know – hiding behind the backs of civilians. And this is exactly the modus operandi of practically throughout three years of the Ukrainian Armed Forces. Albeit people already suggest me, and we might as well go and call it as it is – NATO forces. Ukraine was the best army NATO ever had. That’s… many people do not understand. Possibly true.\nSo and as a result, Russians wait, they kill as many as necessary, they move, mop up, storm groups, you know. Obviously these are the best troops today in the world by far. What they do? You can take a look at like two Russians against 14 – two Russian Slavyansk against 14 Ukrainian soldiers. Guess what? Guess who wins? Two Russians, you know. So that explains to the level of the competence on the tactical level. And of course we look at the higher tactical level, level of the brigades, let alone operational level. I mean, there’s nothing there which can compare to it now.\nAnd especially when you look at… I just to give you number – my video will come out earlier than yours probably because I’m finishing editing after we’re… just throughout 2023, well, it’s my connection, people really who in the know, okay, they are my friends. Just throughout 2023, Russia produced – are you ready? – 23 million units of shells, missiles. Those people, they have no clue. 23… in the UK, yeah, they do not even understand what they are dealing with.\nI mean, you get any NATO general from PEPO… you know, I’m not talking about clowns like Kellogg or Keene – those are incompetent morons basically – and explain to him: “Dude, just in a year,” and since then Russia actually… 23, which is probably much lower than 2024, because… oh, absolutely, yeah… million units, yeah, it’s shells and missiles. They do not understand that… no, Russia doesn’t produce more missiles in one month than NATO altogether produces in a year. No, no, no – Russia produces in one month more smart munitions and high precision weapons than probably NATO produces in five to seven years combined, including United States.\nSo those people, they have no grasp of this. The same as you cannot explain to any from Pentagon what it means… so does it mean that there’s no more washing machines around?\nPiero:\nYeah, Russians are really good at importing washing machines. Do you still have washing machines in Moscow?\nAndrei:\nOf course, yeah, that’s what it is. Yeah, refrigerators, refrigerators, even importing their, you know, those toilet seats from Japan, you know, all works, you know. So it’s all goes into Russian military-industrial complex.\nSo and when you explain for the morons what you’re observing, they have no clue. And this is like… they figured out that “Oh gosh, yeah, Russia is like fourth economy in the world.” Well, I would dare to say that’s actually by the sheer size of it, and especially some things which are not reported, it’s about third economy in the world, right behind the United States. Despite being more than two times smaller in terms of population, it’s larger than India’s economy. And you look at the… well, simple data – Russia produces more steel and iron than the United States.\nPiero:\nYeah, of course, of course. So that’s… so I remind people who are listening or watching us that I’m with Andrei Martyanov, and that all… by the way, his book and his website and his link will be in the description of the video. And let me just say as a personal note that it’s good to laugh a bit about all these topics because unfortunately they are tragic, and we have to laugh. And I appreciate your… you have a YouTube channel which I will link as well here, where you give your analysis, and it’s good to take a bit of steam off. Certainly in Europe and I presume in the US, the media are way very serious about this. And as you said, the propaganda post-World War II has dehumanized a lot of Russians in general. And it’s obviously insane because it’s not working, and the result is massive defeat as you described.\nCould there be a chance so that if whatever the situation, whatever actually the diplomacy achieves… there can always be disappointments in diplomacy compared to the battlefield, but certainly isn’t there a chance that, you know, the Russian Liberation Army in 1945 kept guerrilla war for 10 years? Isn’t there a chance that this non-conventional war, let’s put it, or even if there is a peace agreement or an armistice that both all sides agree… isn’t there a chance that there would be continuation of sabotage, commando actions, even drones, from…\nAndrei:\nOh, absolutely, absolutely. That goes without saying until the generation changes. And don’t forget, whatever will be left of Ukraine, it is already the case – we are looking at the nation which is mentally destroyed. I mean, they are… I wouldn’t go, you know, on the tangent here and describing the level of the idiocy which they live in. But yes, absolutely – terrorism, sabotage, it goes without saying. But then it stops being military operation, it becomes primarily special services operation, primarily FSB and so not only FSB – their internal affairs and things of this nature. So and even SVR and GU, which is former GRU, all will be involved. And so yes, absolutely, this will continue.\nLet me tell you, almost 11 years after the de facto joining of the Donbas republics and 3 years since they became officially, you know, the part of Russia, I can tell you one thing – corruption there is still… I mean, it’s just absolutely ridiculous. You have to, so to speak, sort out or weed out Ukraine-ship, Ukraine-ship, you know, in terms of the psychology, in terms of their behavioral matrices, modus operandi of people. It takes generation. And even today you have all those people who, you know, what are easily recruited by the HUR, which is of course the main military directorate of Ukraine. So and whenever you go there, you just see what is going to happen pretty soon in terms of the sabotage, terrorism, and…\nPiero:\nYeah, yeah, it’s sad because there is so much to be building together between all these countries. And unfortunately, unfortunately it’s… well, it is what it is. It’s Europe made up its mind, you know. Europe made up its mind. The West, combined West, decided – it didn’t decide it yesterday or even three years ago. It has been in gestation for generations, yes, since the end of the World War II. And it was actually due to primarily Soviet propaganda, which was in many respects pro-Western while it was screaming about, you know, what all those, you know, negotiations about arms control and aggressive policies, which was true. Those morons still operated on the basis of the, you know, proletarian internationalism. Yeah, even after that. “Oh yeah, but we have progressive society,” you know, “progressive public.” Well, progressive public… I mean, world’s LGBTQ, whatever the hell it is, and they hate Russians for that. So but they’re not saying that “Oh yeah, because they have some kind of leftish views.” Well, we know what kind of views they had, you know, and we now know. So and they hated us absolutely.\nSo whenever they come and now say, “Oh, some European artistic people, who cares?” And that’s what it is. Russians want Iron Curtain, and this time that’s what’s going to happen.\nPiero:\nWhich is a problem for me because I need to travel to Russia once in a while.\nAndrei:\nWell, you have… we find a way, we find a way. Yeah, Turkey is… yeah, is making money out of it, a lot. Oh yeah, sure. Now, in fact, on this topic, it was interesting. You probably know the story, but… Oh, by the way, before I forgot, before I forgot – Serbia. Go to Belgrade, fly there. 3 hours, you’re in Moscow.\nPiero:\nOh, and where they fly above? Belarus, above Poland?\nAndrei:\nYeah, of course, you’re not flying around. Yeah, Serbs are competent people.\nPiero:\nWell, that’s one way to do it. But yeah, you probably know the story. During the 80s, the idea of NATO was to say, “Okay, if there is an…” because obviously they were never thinking that they would attack. Even if when you look at the plans from the 50s and 60s, the Americans had plans to attack first.\nAndrei:\nYeah, well, continuously, yeah, yeah.\nPiero:\nAnd of course, the idea was “We have to hold for eight weeks, and then by magic the Soviet Union collapses.” And what was… which may or may not have been a good plan – I think not – but what was striking was that the same idea came out in 2022: “Oh, we have to help Ukraine to hold, and then Russia will collapse and they will topple the Putin regime.”\nAndrei:\nYeah, oh, absolutely. With what you describe, which I think it’s accurate, that there would be this kind of terrorism and very low-intensity war over many, many years, this is actually reinforcing whoever is in power in Russia, for sure, as it does everywhere when you have this attack from the outside. So it’s extra double-plus cause for failure as a strategy.\nI mean, they don’t do strategy. Europe, West don’t do strategy. They don’t know how to do strategy. I’m sorry, what they pass for strategy is a… as one of my good acquaintances Alexander Rogers says, that’s a business plan. They do not understand… get me any NATO strategic planner, and I would love to talk to him about strategy. They do not understand what strategy is. They know definitions – they never internalized what is required for strategy, which, by the way, you already mentioned this, you know – statistics, real statistics. It’s not GIGO – garbage in, garbage out. This is how they operate. Their inputs are inputs by the madman for curators, you know, who do not understand basic mathematics or arithmetic, let alone, you know, military, and let alone political strategy. There is no strategic intelligence as a craft in the West left. None, doesn’t exist.\nPiero:\nWhen I saw NATO countries in the military, people my age starting to use PowerPoint to plan whatever they were planning, I knew they were screwed.\nAndrei:\nYeah, it’s a bad start. The genius move, the genius move on part of Putin and his government was to open this program for normal Westerners who share normal human, primarily Christian values, to go to Russia. Get three months automatically, and then for 3 years, no visa required. You just stay there, learn language, culture, and you become Russian citizen. My God, you have streams of Germans, even French, you know, all kinds of people going to Russia to get this. Because as Germans, especially there are many people from former GDR and even Germans from West Germany who cannot take this anymore. If you’re normal people, you just cannot take this anymore. You live in the completely… you know, if you follow this and you live it through your everyday life, you live under constant stress. It’s… I know it could be depressing, it could be absolutely depressing when your rights are limited every time, you are brainwashed constantly. And even those people who do not have background, inevitably their models of… revenge, so to speak, the way they live is going to be disrupted, which is being disrupted by all this. And they see themselves… I mean, come on, there is a Paris shock, they call it Paris shock or Paris syndrome, especially Asians. They imagine Paris to be like something grandeur, you know. They come in – it’s narrow streets, it stinks with urine, it’s dirty like hell, and they’re like, “What?” You know.\nAnd then you go… did you see this videos of Amsterdam? They urinate on the streets, and you know, those tourists going under the bridge, urine dropping on their tables with their drinks and everything. That’s Europe, I’m sorry, and I know it’s bad, but this is what it is. And it will become worse than that. You look at… you look at London. Take out people out of the touristic places – it is a dump. It is a dump, crime-ridden dump, and it stinks. And then people go to Moscow, St. Petersburg, Yekaterinburg, and they have the cognitive dissonance of their life. And it’s safe, you know.\nSo there you go.\nDISCUSS ON SG",
  "tags": [
    "EU",
    "Russia",
    "war"
  ],
  "categories": [],
  "sitemap_lastmod": "2025-05-27T08:59:44+00:00"
}