{
  "url": "https://voxday.net/2012/06/22/apple-cartoon-villain/",
  "scraped_at": "2025-12-14T04:57:14.763405",
  "title": "Apple: the cartoon villain",
  "date_display": "June 22, 2012",
  "date_iso": "2012-06-22T06:25:00+00:00",
  "date_from_url": "2012-06-22",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>It’s almost as if Apple is determined <a href=\"http://www.dailymail.co.uk/news/article-2162867/Smartphone-users-hit-Apples-rip-plan-make-ALL-iPhone-accessories-obsolete-changing-design-device.html\">to rub their evil</a> in the face of their fanboys:</p><blockquote><p> Apple was accused of ripping off consumers today as it emerged the next version of the iPhone could render all current accessories obsolete.</p><p>Outraged iPhone owners flocked online to complain about the reports that Apple has decided to radically alter the size of the connector in the next iPhone, which is expected to be launched in October.</p><p>Speakers, docks and other expensive accessories costing hundreds of dollars would be rendered useless by the move, along with cheaper add-ons such as chargers. Even cars with the current connector built in would need to be upgraded.</p></blockquote><p>Why yes, as it happens, I do tend to be rather more amused than outraged.  It’s not like any of Apple’s <s>victims</s>customers can actually be surprised or complain about this.  It’s hardly a secret that the entire point of Apple’s “walled garden” strategy is to get you dependent on their technology and locked in so they can take you for as much as possible.</p><p>I’m only surprised they haven’t figured out a way to force you to store your information on their servers rather than locally, then pay to get access to it.</p></div>",
  "content_text": "It’s almost as if Apple is determined\nto rub their evil\nin the face of their fanboys:\nApple was accused of ripping off consumers today as it emerged the next version of the iPhone could render all current accessories obsolete.\nOutraged iPhone owners flocked online to complain about the reports that Apple has decided to radically alter the size of the connector in the next iPhone, which is expected to be launched in October.\nSpeakers, docks and other expensive accessories costing hundreds of dollars would be rendered useless by the move, along with cheaper add-ons such as chargers. Even cars with the current connector built in would need to be upgraded.\nWhy yes, as it happens, I do tend to be rather more amused than outraged.  It’s not like any of Apple’s\nvictims\ncustomers can actually be surprised or complain about this.  It’s hardly a secret that the entire point of Apple’s “walled garden” strategy is to get you dependent on their technology and locked in so they can take you for as much as possible.\nI’m only surprised they haven’t figured out a way to force you to store your information on their servers rather than locally, then pay to get access to it.",
  "tags": [
    "technology"
  ],
  "categories": [],
  "sitemap_lastmod": "2012-06-22T05:25:00+00:00"
}