{
  "url": "https://voxday.net/2012/06/07/at-least-it-gets-kids-outside/",
  "scraped_at": "2025-12-14T04:56:11.870563",
  "title": "At least it gets the kids outside",
  "date_display": "June 7, 2012",
  "date_iso": "2012-06-07T17:00:00+00:00",
  "date_from_url": "2012-06-07",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>I would have thought it would be difficult to come up with a less intelligent, more oblivious response to my explication of why David Sloan Wilson was correct to declare that PZ Myers does not think or act like a scientist when it comes to religion.  But somehow, someone named David Futrelle actually <a href=\"http://manboobz.com/2012/06/06/does-manosphere-blogger-vox-day-really-support-the-murder-and-mutilation-of-women/\">managed to surpasss the Fowl Atheist</a> when he asked “Does Manosphere Blogger Vox Day Really Support the Murder and Mutilation of Women?”</p><p>I suppose it depends.  Does a hobby counts as “support”?  Anyhow, Mr. Futrelle managed to rise from his fainting couch long enough to demonstrate that he has all the reading comprehension of an illiterate, brain-damaged chimpanzee raised in poverty by a single mother:</p><blockquote><p> In one of the most repellant manosphere rants I’ve run across yet, Vox attempts to rebut PZ Myers’ critiques of evolutionary psychology with a series of bizarre and hateful assertions about women, offering his own “scientific” rationales for keeping women down. Is this all somehow satire on his part? He certainly seems sincere.</p><p>TRIGGER WARNING for all that follows; Vox explicitly defends the maiming and murder of women….</p><p>Despite Vox Day’s repellent ideas about women – and his proud racism – he’s an influential figure in the manosphere, mentioned approvingly and regularly cited by others who present themselves as more moderate voices. It may not be a shock that the reactionary antifeminist blogger Dalrock includes Vox in his blogroll, and cites his work with approval (see here and here for examples). But, astoundingly, he’s also regularly cited approvingly by antifeminist “relationship expert” Susan Walsh of Hooking Up Smart (see here, here, and here). And she has even written at least one guest post on Vox’s “game blog” Alpha Game.  At this point I suppose I shouldn’t be shocked by any of this.  But I still am.</p></blockquote><p>Based on the level of intellectual sophistication shown here, I would expect Mr. Futrelle to be surprised every time he hears voices come out of the magic box with the moving lights.  I wasn’t attempting to “rebut PZ Myers’ critiques of evolutionary psychology with a series of bizarre and hateful assertions about women”, I wasn’t attempting to rebut anything.  I was simply demonstrating that Wilson was correct and Myers’s arguments, if they can even be described as such, were intrinsically unscientific.  Which I subsequently proved, <i>utilizing PZ Myers’s own words</i>, to show that scientific answers to his questions could be provided and that his own arguments were based on his biological predisposition, his culture, and his personal values rather than science, thus supporting Wilson’s claim.   The fact that I can make an intellectual case does not mean that I subscribe to it any more than every defense attorney who argues a case on behalf of a client believes in his client’s innocence.  Pointing out that the maiming and murder of women can be defended on various grounds is not tantamount to defending it on any of them.</p><p>Note that Myers himself <a href=\"http://scienceblogs.com/pharyngula/2010/05/04/sam-harris-v-sean-carroll/\">wrote the following</a> about the Taliban’s oppression of women. <i>“We cannot, though, say a priori that it is wrong because abusing and denigrating half the population is unconscionable and vile, because that is not a scientific foundation for the conclusion.</i>”  I am sure we can all eagerly anticipate Mr. Futrelle’s next histrionic post: Does Godless Blogger PZ Myers Really Support Sharia and Stoning Women?</p><p>And one more thing.  Yes, Mr. Futrelle, in my mind <i>“female fetuses are “unborn women.””</i> At least, those female fetuses carried by members of the species known as <i>homo sapiens sapiens</i>.  What on Earth do you think they are?  Chimpanzees?  Caterpillars?  Prospective unicorns?</p></div>",
  "content_text": "I would have thought it would be difficult to come up with a less intelligent, more oblivious response to my explication of why David Sloan Wilson was correct to declare that PZ Myers does not think or act like a scientist when it comes to religion.  But somehow, someone named David Futrelle actually\nmanaged to surpasss the Fowl Atheist\nwhen he asked “Does Manosphere Blogger Vox Day Really Support the Murder and Mutilation of Women?”\nI suppose it depends.  Does a hobby counts as “support”?  Anyhow, Mr. Futrelle managed to rise from his fainting couch long enough to demonstrate that he has all the reading comprehension of an illiterate, brain-damaged chimpanzee raised in poverty by a single mother:\nIn one of the most repellant manosphere rants I’ve run across yet, Vox attempts to rebut PZ Myers’ critiques of evolutionary psychology with a series of bizarre and hateful assertions about women, offering his own “scientific” rationales for keeping women down. Is this all somehow satire on his part? He certainly seems sincere.\nTRIGGER WARNING for all that follows; Vox explicitly defends the maiming and murder of women….\nDespite Vox Day’s repellent ideas about women – and his proud racism – he’s an influential figure in the manosphere, mentioned approvingly and regularly cited by others who present themselves as more moderate voices. It may not be a shock that the reactionary antifeminist blogger Dalrock includes Vox in his blogroll, and cites his work with approval (see here and here for examples). But, astoundingly, he’s also regularly cited approvingly by antifeminist “relationship expert” Susan Walsh of Hooking Up Smart (see here, here, and here). And she has even written at least one guest post on Vox’s “game blog” Alpha Game.  At this point I suppose I shouldn’t be shocked by any of this.  But I still am.\nBased on the level of intellectual sophistication shown here, I would expect Mr. Futrelle to be surprised every time he hears voices come out of the magic box with the moving lights.  I wasn’t attempting to “rebut PZ Myers’ critiques of evolutionary psychology with a series of bizarre and hateful assertions about women”, I wasn’t attempting to rebut anything.  I was simply demonstrating that Wilson was correct and Myers’s arguments, if they can even be described as such, were intrinsically unscientific.  Which I subsequently proved,\nutilizing PZ Myers’s own words\n, to show that scientific answers to his questions could be provided and that his own arguments were based on his biological predisposition, his culture, and his personal values rather than science, thus supporting Wilson’s claim.   The fact that I can make an intellectual case does not mean that I subscribe to it any more than every defense attorney who argues a case on behalf of a client believes in his client’s innocence.  Pointing out that the maiming and murder of women can be defended on various grounds is not tantamount to defending it on any of them.\nNote that Myers himself\nwrote the following\nabout the Taliban’s oppression of women.\n“We cannot, though, say a priori that it is wrong because abusing and denigrating half the population is unconscionable and vile, because that is not a scientific foundation for the conclusion.\n”  I am sure we can all eagerly anticipate Mr. Futrelle’s next histrionic post: Does Godless Blogger PZ Myers Really Support Sharia and Stoning Women?\nAnd one more thing.  Yes, Mr. Futrelle, in my mind\n“female fetuses are “unborn women.””\nAt least, those female fetuses carried by members of the species known as\nhomo sapiens sapiens\n.  What on Earth do you think they are?  Chimpanzees?  Caterpillars?  Prospective unicorns?",
  "tags": [
    "trainwreck"
  ],
  "categories": [],
  "sitemap_lastmod": "2012-06-07T16:00:00+00:00"
}