{
  "url": "https://voxday.net/2012/06/26/austrian-critique-of-force/",
  "scraped_at": "2025-12-14T04:57:33.315766",
  "title": "The Austrian critique of force",
  "date_display": "June 26, 2012",
  "date_iso": "2012-06-26T11:43:00+00:00",
  "date_from_url": "2012-06-26",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>Since so many free traders keep appealing to the supposed reliance of tariffs on force, or the “badges and guns” argument, as if it actually bolstered their case, I thought it would be a good idea to go to the source and examine in detail precisely what their case against force was.  I was motivated to do so by Unger’s citation of George Washington’s famous analogy in which he warned about the dangers of government by comparing it to fire.</p><p>I believe the free traders, in their religious hysteria, are failing to grasp the obvious, which is that nations and governments exist, have always existed, and always will exist regardless of what utopian fantasies are concocted in order to imagine a world without them.  Fire is dangerous, to be sure, but fire is also a very material element of the world and is necessary for a wide range of human activities.  Washington did not make his point in order to encourage Americans to rid themselves of government entirely, but rather to remind them to be cautious in how they utilized it.  Washington’s speech is not intrinsically anti-government, but rather speaks to the necessity and the utility of properly controlled government in the service of the nation.</p><p>So, let’s turn to Mises and see what he has to say about the matter in his <a href=\"http://mises.org/liberal/ch1sec9.asp\">Critique of the Doctrine of Force</a>:</p><blockquote><p>The champions of democracy in the eighteenth century argued that only monarchs and their ministers are morally depraved, injudicious, and evil. The people, however, are altogether good, pure, and noble, and have, besides, the intellectual gifts needed in order always to know and to do what is right. This is, of course, all nonsense, no less so than the flattery of the courtiers who ascribed all good and noble qualities to their princes. The people are the sum of all individual citizens; and if some individuals are not intelligent and noble, then neither are all together.</p><p>Since mankind entered the age of democracy with such high-flown expectations, it is not surprising that disillusionment should soon have set in. It was quickly discovered that the democracies committed at least as many errors as the monarchies and aristocracies had. The comparison that people drew between the men whom the democracies placed at the head of the government and those whom the emperors and kings, in the exercise of their absolute power, had elevated to that position, proved by no means favorable to the new wielders of power. The French are wont to speak of “killing with ridicule.” And indeed, the statesmen representative of democracy soon rendered it everywhere ridiculous. Those of the old regime had displayed a certain aristocratic dignity, at least in their outward demeanor. The new ones, who replaced them, made themselves contemptible by their behavior. Nothing has done more harm to democracy in Germany and Austria than the hollow arrogance and impudent vanity with which the Social-Democratic leaders who rose to power after the collapse of the empire conducted themselves.</p><p>Thus, wherever democracy triumphed, an antidemocratic doctrine soon arose in fundamental opposition to it. There is no sense, it was said, in allowing the majority to rule. The best ought to govern, even if they are in the minority. This seems so obvious that the supporters of antidemocratic movements of all kinds have steadily increased in number. The more contemptible the men whom democracy has placed at the top have proved themselves to be, the greater has grown the number of the enemies of democracy.</p></blockquote><p>First, I think it is important to note that Mises is not talking about actual democracy, but rather the perverted form of it known as representative democracy.  But regardless, he is entirely correct, as there are few better arguments against representative democracy than to point to the deficient character and ludicrous behavior of the current representatives of the American people.  In this regard, little has changed since the days of the Weimar Republic, as the democracies of the West are still almost uniformly led by buffoons, charlatans, and the corrupt.</p><blockquote><p>There are, however, serious fallacies in the antidemocratic doctrine. What, after all, does it mean to speak of “the best man” or “the best men”? The Republic of Poland placed a piano virtuoso at its head because it considered him the best Pole of the age. But the qualities that the leader of a state must have are very different from those of a musician. The opponents of democracy, when they use the expression “the best,” can mean nothing else than the man or the men best fitted to conduct the affairs of the government, even if they understand little or nothing of music. But this leads to the same political question: Who is the best fitted? Was it Disraeli or Gladstone? The Tory saw the best man in the former; the Whig, in the latter. Who should decide this if not the majority?</p><p>And so we reach the decisive point of all antidemocratic doctrines, whether advanced by the descendants of the old aristocracy and the supporters of hereditary monarchy, or by the syndicalists, Bolsheviks, and socialists, viz., the doctrine of force. The opponents of democracy champion the right of a minority to seize control of the state by force and to rule over the majority. The moral justification of this procedure consists, it is thought, precisely in the power actually to seize the reins of government. One recognizes the best, those who alone are competent to govern and command, by virtue of their demonstrated ability to impose their rule on the majority against its will. Here the teaching of l’Action Fran?aise coincides with that of the syndicalists, and the doctrine of Ludendorff and Hitler, with that of Lenin and Trotzky.</p></blockquote><p>Here is where Mises begins to go astray.  Who should decide “the best” except the majority?  Based on the observable results of the last 100 years of representative democracy, almost any method would work better.  Politicians have not improved any since the days of Weimar, indeed, on a number of measures they have declined dramatically.  In a time when politicians hire others to write the speeches they then read awkwardly from teleprompters, it is clear that we are much closer to the days of President Dwayne Elizondo Mountain Dew Herbert Camacho than Cicero, or even Paul von Hindenburg.  And furthermore, what is the moral basis for majority rule in the first place?  Is it not simply the weight of numbers?  Is it not simply the majority’s “demonstrated ability to impose their rule” on the outnumbered remainder of the population?  What Mises fails to realize is that the doctrine of force he decries on the part of the minority relies upon precisely the same basis as his preferred doctrine of the majority, especially since we are not actually discussing the rule of the actual majority, merely the rule of a different minority which purports to claim the approval of “the majority”, whether that is actually the case or not.</p><p>I further note that the majority upon which the right of the representative minority to rule is claimed is in reality almost never an actual majority, but usually amounts to a mere plurality.  So, Mises is actually doing nothing more than attempting to justify the rule by force of one small minority supported by a larger minority versus the rule by force of a different small minority.</p><blockquote><p>Many arguments can be urged for and against these doctrines, depending on one’s religious and philosophical convictions, about which any agreement is scarcely to be expected. This is not the place to present and discuss the arguments pro and con, for they are not conclusive. The only consideration that can be decisive is one that bases itself on the fundamental argument in favor of democracy.</p></blockquote><p>This is a naked assertion with absolutely no support in fact or logic.  Mises doesn’t even attempt to show that it is conclusive, he simply pronounces that it is so, and the inaccurate way in which he is using the terms “democracy” and “majority” should suffice to give us cause, at the very least, to reject his assertion that the only decisive consideration is the “democratic” argument.</p><blockquote><p>If every group that believes itself capable of imposing its rule on the rest is to be entitled to undertake the attempt, we must be prepared for an uninterrupted series of civil wars, But such a state of affairs is incompatible with the state of the division of labor that we have reached today. Modern society, based as it is on the division of labor, can be preserved only under conditions of lasting peace. It we had to prepare for the possibility of continual civil wars and internal struggles, we should have to retrogress to such a primitive stage of the division of labor that each province at least, if not each village, would become virtually autarkic, i.e., capable of feeding and maintaining itself for a time as a self-sufficient economic entity without importing anything from the outside. This would mean such an enormous decline in the productivity of labor that the earth could feed only a fraction of the population that it supports today. The antidemocratic ideal leads to the kind of economic order known to the Middle Ages and antiquity. Every city, every village, indeed, every individual dwelling was fortified and equipped for defense, and every province was as independent of the rest of the world as possible in its provision of commodities.</p></blockquote><p>This is a red herring.  The constant struggle for power is as easily settled by hereditary monarchy or aristocracy as representative democracy.  Furthermore, Mises here points the way to the foundation of an argument against free trade and open borders, as nothing throughout history has ever created more war than the movement of peoples.  If Mises genuinely considers peace and the division of labor to be paramount, then a heterogeneous population must be avoided at all costs, as such a population will be inherently divided and prone to the very civil wars that Mises wishes to avoid.</p><blockquote><p>The democrat too is of the opinion that the best man ought to rule. But he believes that the fitness of a man or of a group of men to govern is better demonstrated if they succeed in convincing their fellow citizens of their qualifications for that position, so that they are voluntarily entrusted with the conduct of public affairs, than if they resort to force to compel others to acknowledge their claims. Whoever does not succeed in attaining to a position of leadership by virtue of the power of his arguments and the confidence that his person inspires has no reason to complain about the fact that his fellow citizens prefer others to him.</p></blockquote><p>Translation: representative democracy is a supremely efficient way to ensure that society is always led by liars, con men, and sociopaths.  The representative democrat is of the opinion that the best salesman ought to rule.  Does anyone seriously doubt we’d be better off sticking with pianists?</p><blockquote><p>To be sure, it should not and need not be denied that there is one situation in which the temptation to deviate from the democratic principles of liberalism becomes very great indeed. If judicious men see their nation, or all the nations of the world, on the road to destruction, and if they find it impossible to induce their fellow citizens to heed their counsel, they may be inclined to think it only fair and just to resort to any means whatever, in so far as it is feasible and will lead to the desired goal, in order to save everyone from disaster. Then the idea of a dictatorship of the elite, of a government by the minority maintained in power by force and ruling in the interests of all, may arise and find supporters. But force is, never a means of overcoming these difficulties. The tyranny of a minority can never endure unless it succeeds in convincing the majority of the necessity or, at any rate, of the utility, of its rule. But then the minority no longer needs force to maintain itself in power.</p><p>History provides an abundance of striking examples to show that, in the long run, even the most ruthless policy of repression does not suffice to maintain a government in power. To cite but one, the most recent and the best known: when the Bolsheviks seized control in Russia, they were a small minority, and their program found scant support among the great masses of their countrymen. For the peasantry, who constitute the bulk of the Russian people, would have nothing to do with the Bolshevik policy of farm collectivization. What they wanted was the division of the land among the “landed poverty,” as the Bolsheviks call this part of the population. And it was this program of the peasantry, not that of the Marxist leaders, which was actually put into effect. In order to remain in power, Lenin and Trotzky not only accepted this agrarian reform, but even made it a part of their own program, which they undertook to defend against all attacks, domestic and foreign. Only thus were the Bolsheviks able to win the confidence of the great mass of the Russian people. Since they adopted this policy of land distribution, the Bolsheviks rule no longer against the will of the great mass of the people, but with their consent and support. There were only two possible alternatives open to them: either their program or their control of the government had to be sacrificed. They chose the first and remained in power. The third possibility, to carry out their program by force against the will of the great mass of the people, did not exist at all. Like every determined and well-led minority, the Bolsheviks were able to seize control by force and retain it for a short time. In the long run, however, they would have been no better able to keep it than any other minority. The various attempts of the Whites to dislodge the Bolsheviks all failed because the mass of the Russian people were against them. But even if they had succeeded, the victors too would have had to respect the desires of the overwhelming majority of the population. It would have been impossible for them to alter in any way after the event the already accomplished fact of the land distribution and to restore to the landowners what had been stolen from them.</p></blockquote><p>Mises makes another mistake when he attempts to convince the reader that force is “never a means” of overcoming temporary difficulties due to its asserted inability to prevail in the long run.  This is obviously false, both logically and historically, as the Roman office of <i>dictatura</i> was limited to a period of six months, thus allowing extralegal force to be utilized to deal with short-term situations without creating the long-term problem that Mises cites.  More importantly, Mises fails to notice that he disembowels his own argument intended in favor of representative democracy by noting that the Bolsheviks were able to stay in power, despite their initial reliance upon the use of force, due to the imputed consent and support of the Russian people <i>despite the complete absence of any form of democracy</i>, representative or otherwise.  In doing so, he inadvertently justifies the very use of force that he intended to criticize, as by his metric, the right of a small minority to rule over the people is justified by its continued rule regardless of how it happened to take power.</p><blockquote><p>Only a group that can count on the consent of the governed can establish a lasting regime. Whoever wants to see the world governed according to his own ideas must strive for dominion over men’s minds. It is impossible, in the long run, to subject men against their will to a regime that they reject. Whoever tries to do so by force will ultimately come to grief, and the struggles provoked by his attempt will do more harm than the worst government based on the consent of the governed could ever do. Men cannot be made happy against their will.</p></blockquote><p>Given that representative democracies collapse on a regular basis, and in fact tend to have shorter lifespans than many hereditary monarchies, it should be clear from this failed critique that not only is the use of force justified so long as the force-reliant minority can maintain its rule, but that despite its pretensions, representative democracy is actually a very poor means of respecting the consent of the governed.</p><p>Now, I hope readers will not conclude that simply because I have shown von Mises’s critique of force is both inept and self-defeating, I am necessarily attempting to declare that the use of force is always justified.  I am not.  I am not even declaring that there is no valid Austrian critique of force.  Nor should anyone conclude that I do not respect and admire one of the great thinkers of mankind simply because I am willing to point out the errors in his arguments.  But this critique of a critique should suffice to show that this Austrian critique of force is invalid and that appealing to Mises with “badges and guns” rhetoric is indicative of a failure to seriously think through the topic in an intelligent manner.</p></div>",
  "content_text": "Since so many free traders keep appealing to the supposed reliance of tariffs on force, or the “badges and guns” argument, as if it actually bolstered their case, I thought it would be a good idea to go to the source and examine in detail precisely what their case against force was.  I was motivated to do so by Unger’s citation of George Washington’s famous analogy in which he warned about the dangers of government by comparing it to fire.\nI believe the free traders, in their religious hysteria, are failing to grasp the obvious, which is that nations and governments exist, have always existed, and always will exist regardless of what utopian fantasies are concocted in order to imagine a world without them.  Fire is dangerous, to be sure, but fire is also a very material element of the world and is necessary for a wide range of human activities.  Washington did not make his point in order to encourage Americans to rid themselves of government entirely, but rather to remind them to be cautious in how they utilized it.  Washington’s speech is not intrinsically anti-government, but rather speaks to the necessity and the utility of properly controlled government in the service of the nation.\nSo, let’s turn to Mises and see what he has to say about the matter in his\nCritique of the Doctrine of Force\n:\nThe champions of democracy in the eighteenth century argued that only monarchs and their ministers are morally depraved, injudicious, and evil. The people, however, are altogether good, pure, and noble, and have, besides, the intellectual gifts needed in order always to know and to do what is right. This is, of course, all nonsense, no less so than the flattery of the courtiers who ascribed all good and noble qualities to their princes. The people are the sum of all individual citizens; and if some individuals are not intelligent and noble, then neither are all together.\nSince mankind entered the age of democracy with such high-flown expectations, it is not surprising that disillusionment should soon have set in. It was quickly discovered that the democracies committed at least as many errors as the monarchies and aristocracies had. The comparison that people drew between the men whom the democracies placed at the head of the government and those whom the emperors and kings, in the exercise of their absolute power, had elevated to that position, proved by no means favorable to the new wielders of power. The French are wont to speak of “killing with ridicule.” And indeed, the statesmen representative of democracy soon rendered it everywhere ridiculous. Those of the old regime had displayed a certain aristocratic dignity, at least in their outward demeanor. The new ones, who replaced them, made themselves contemptible by their behavior. Nothing has done more harm to democracy in Germany and Austria than the hollow arrogance and impudent vanity with which the Social-Democratic leaders who rose to power after the collapse of the empire conducted themselves.\nThus, wherever democracy triumphed, an antidemocratic doctrine soon arose in fundamental opposition to it. There is no sense, it was said, in allowing the majority to rule. The best ought to govern, even if they are in the minority. This seems so obvious that the supporters of antidemocratic movements of all kinds have steadily increased in number. The more contemptible the men whom democracy has placed at the top have proved themselves to be, the greater has grown the number of the enemies of democracy.\nFirst, I think it is important to note that Mises is not talking about actual democracy, but rather the perverted form of it known as representative democracy.  But regardless, he is entirely correct, as there are few better arguments against representative democracy than to point to the deficient character and ludicrous behavior of the current representatives of the American people.  In this regard, little has changed since the days of the Weimar Republic, as the democracies of the West are still almost uniformly led by buffoons, charlatans, and the corrupt.\nThere are, however, serious fallacies in the antidemocratic doctrine. What, after all, does it mean to speak of “the best man” or “the best men”? The Republic of Poland placed a piano virtuoso at its head because it considered him the best Pole of the age. But the qualities that the leader of a state must have are very different from those of a musician. The opponents of democracy, when they use the expression “the best,” can mean nothing else than the man or the men best fitted to conduct the affairs of the government, even if they understand little or nothing of music. But this leads to the same political question: Who is the best fitted? Was it Disraeli or Gladstone? The Tory saw the best man in the former; the Whig, in the latter. Who should decide this if not the majority?\nAnd so we reach the decisive point of all antidemocratic doctrines, whether advanced by the descendants of the old aristocracy and the supporters of hereditary monarchy, or by the syndicalists, Bolsheviks, and socialists, viz., the doctrine of force. The opponents of democracy champion the right of a minority to seize control of the state by force and to rule over the majority. The moral justification of this procedure consists, it is thought, precisely in the power actually to seize the reins of government. One recognizes the best, those who alone are competent to govern and command, by virtue of their demonstrated ability to impose their rule on the majority against its will. Here the teaching of l’Action Fran?aise coincides with that of the syndicalists, and the doctrine of Ludendorff and Hitler, with that of Lenin and Trotzky.\nHere is where Mises begins to go astray.  Who should decide “the best” except the majority?  Based on the observable results of the last 100 years of representative democracy, almost any method would work better.  Politicians have not improved any since the days of Weimar, indeed, on a number of measures they have declined dramatically.  In a time when politicians hire others to write the speeches they then read awkwardly from teleprompters, it is clear that we are much closer to the days of President Dwayne Elizondo Mountain Dew Herbert Camacho than Cicero, or even Paul von Hindenburg.  And furthermore, what is the moral basis for majority rule in the first place?  Is it not simply the weight of numbers?  Is it not simply the majority’s “demonstrated ability to impose their rule” on the outnumbered remainder of the population?  What Mises fails to realize is that the doctrine of force he decries on the part of the minority relies upon precisely the same basis as his preferred doctrine of the majority, especially since we are not actually discussing the rule of the actual majority, merely the rule of a different minority which purports to claim the approval of “the majority”, whether that is actually the case or not.\nI further note that the majority upon which the right of the representative minority to rule is claimed is in reality almost never an actual majority, but usually amounts to a mere plurality.  So, Mises is actually doing nothing more than attempting to justify the rule by force of one small minority supported by a larger minority versus the rule by force of a different small minority.\nMany arguments can be urged for and against these doctrines, depending on one’s religious and philosophical convictions, about which any agreement is scarcely to be expected. This is not the place to present and discuss the arguments pro and con, for they are not conclusive. The only consideration that can be decisive is one that bases itself on the fundamental argument in favor of democracy.\nThis is a naked assertion with absolutely no support in fact or logic.  Mises doesn’t even attempt to show that it is conclusive, he simply pronounces that it is so, and the inaccurate way in which he is using the terms “democracy” and “majority” should suffice to give us cause, at the very least, to reject his assertion that the only decisive consideration is the “democratic” argument.\nIf every group that believes itself capable of imposing its rule on the rest is to be entitled to undertake the attempt, we must be prepared for an uninterrupted series of civil wars, But such a state of affairs is incompatible with the state of the division of labor that we have reached today. Modern society, based as it is on the division of labor, can be preserved only under conditions of lasting peace. It we had to prepare for the possibility of continual civil wars and internal struggles, we should have to retrogress to such a primitive stage of the division of labor that each province at least, if not each village, would become virtually autarkic, i.e., capable of feeding and maintaining itself for a time as a self-sufficient economic entity without importing anything from the outside. This would mean such an enormous decline in the productivity of labor that the earth could feed only a fraction of the population that it supports today. The antidemocratic ideal leads to the kind of economic order known to the Middle Ages and antiquity. Every city, every village, indeed, every individual dwelling was fortified and equipped for defense, and every province was as independent of the rest of the world as possible in its provision of commodities.\nThis is a red herring.  The constant struggle for power is as easily settled by hereditary monarchy or aristocracy as representative democracy.  Furthermore, Mises here points the way to the foundation of an argument against free trade and open borders, as nothing throughout history has ever created more war than the movement of peoples.  If Mises genuinely considers peace and the division of labor to be paramount, then a heterogeneous population must be avoided at all costs, as such a population will be inherently divided and prone to the very civil wars that Mises wishes to avoid.\nThe democrat too is of the opinion that the best man ought to rule. But he believes that the fitness of a man or of a group of men to govern is better demonstrated if they succeed in convincing their fellow citizens of their qualifications for that position, so that they are voluntarily entrusted with the conduct of public affairs, than if they resort to force to compel others to acknowledge their claims. Whoever does not succeed in attaining to a position of leadership by virtue of the power of his arguments and the confidence that his person inspires has no reason to complain about the fact that his fellow citizens prefer others to him.\nTranslation: representative democracy is a supremely efficient way to ensure that society is always led by liars, con men, and sociopaths.  The representative democrat is of the opinion that the best salesman ought to rule.  Does anyone seriously doubt we’d be better off sticking with pianists?\nTo be sure, it should not and need not be denied that there is one situation in which the temptation to deviate from the democratic principles of liberalism becomes very great indeed. If judicious men see their nation, or all the nations of the world, on the road to destruction, and if they find it impossible to induce their fellow citizens to heed their counsel, they may be inclined to think it only fair and just to resort to any means whatever, in so far as it is feasible and will lead to the desired goal, in order to save everyone from disaster. Then the idea of a dictatorship of the elite, of a government by the minority maintained in power by force and ruling in the interests of all, may arise and find supporters. But force is, never a means of overcoming these difficulties. The tyranny of a minority can never endure unless it succeeds in convincing the majority of the necessity or, at any rate, of the utility, of its rule. But then the minority no longer needs force to maintain itself in power.\nHistory provides an abundance of striking examples to show that, in the long run, even the most ruthless policy of repression does not suffice to maintain a government in power. To cite but one, the most recent and the best known: when the Bolsheviks seized control in Russia, they were a small minority, and their program found scant support among the great masses of their countrymen. For the peasantry, who constitute the bulk of the Russian people, would have nothing to do with the Bolshevik policy of farm collectivization. What they wanted was the division of the land among the “landed poverty,” as the Bolsheviks call this part of the population. And it was this program of the peasantry, not that of the Marxist leaders, which was actually put into effect. In order to remain in power, Lenin and Trotzky not only accepted this agrarian reform, but even made it a part of their own program, which they undertook to defend against all attacks, domestic and foreign. Only thus were the Bolsheviks able to win the confidence of the great mass of the Russian people. Since they adopted this policy of land distribution, the Bolsheviks rule no longer against the will of the great mass of the people, but with their consent and support. There were only two possible alternatives open to them: either their program or their control of the government had to be sacrificed. They chose the first and remained in power. The third possibility, to carry out their program by force against the will of the great mass of the people, did not exist at all. Like every determined and well-led minority, the Bolsheviks were able to seize control by force and retain it for a short time. In the long run, however, they would have been no better able to keep it than any other minority. The various attempts of the Whites to dislodge the Bolsheviks all failed because the mass of the Russian people were against them. But even if they had succeeded, the victors too would have had to respect the desires of the overwhelming majority of the population. It would have been impossible for them to alter in any way after the event the already accomplished fact of the land distribution and to restore to the landowners what had been stolen from them.\nMises makes another mistake when he attempts to convince the reader that force is “never a means” of overcoming temporary difficulties due to its asserted inability to prevail in the long run.  This is obviously false, both logically and historically, as the Roman office of\ndictatura\nwas limited to a period of six months, thus allowing extralegal force to be utilized to deal with short-term situations without creating the long-term problem that Mises cites.  More importantly, Mises fails to notice that he disembowels his own argument intended in favor of representative democracy by noting that the Bolsheviks were able to stay in power, despite their initial reliance upon the use of force, due to the imputed consent and support of the Russian people\ndespite the complete absence of any form of democracy\n, representative or otherwise.  In doing so, he inadvertently justifies the very use of force that he intended to criticize, as by his metric, the right of a small minority to rule over the people is justified by its continued rule regardless of how it happened to take power.\nOnly a group that can count on the consent of the governed can establish a lasting regime. Whoever wants to see the world governed according to his own ideas must strive for dominion over men’s minds. It is impossible, in the long run, to subject men against their will to a regime that they reject. Whoever tries to do so by force will ultimately come to grief, and the struggles provoked by his attempt will do more harm than the worst government based on the consent of the governed could ever do. Men cannot be made happy against their will.\nGiven that representative democracies collapse on a regular basis, and in fact tend to have shorter lifespans than many hereditary monarchies, it should be clear from this failed critique that not only is the use of force justified so long as the force-reliant minority can maintain its rule, but that despite its pretensions, representative democracy is actually a very poor means of respecting the consent of the governed.\nNow, I hope readers will not conclude that simply because I have shown von Mises’s critique of force is both inept and self-defeating, I am necessarily attempting to declare that the use of force is always justified.  I am not.  I am not even declaring that there is no valid Austrian critique of force.  Nor should anyone conclude that I do not respect and admire one of the great thinkers of mankind simply because I am willing to point out the errors in his arguments.  But this critique of a critique should suffice to show that this Austrian critique of force is invalid and that appealing to Mises with “badges and guns” rhetoric is indicative of a failure to seriously think through the topic in an intelligent manner.",
  "tags": [
    "philosophy",
    "politics"
  ],
  "categories": [],
  "sitemap_lastmod": "2012-06-26T10:43:00+00:00"
}