{
  "url": "https://voxday.net/2012/06/09/blog-of-very-particular-interes/",
  "scraped_at": "2025-12-14T04:56:21.011215",
  "title": "A blog of very particular interest",
  "date_display": "June 9, 2012",
  "date_iso": "2012-06-09T13:00:00+00:00",
  "date_from_url": "2012-06-09",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>Being reliably informed that I may happen to possess a few idiosyncracies of my own, I’m always pleased to see when others unabashedly let their freak flag fly.  Jamsco has launched a new blog that will no doubt be of massive interest to the State Park-visiting community as he is providing what he describes as <a href=\"http://rmnsp.wordpress.com/\">A Guided Tour Of The Best State Parks In The World</a>.  And he’s not afraid to court a little controversy either, as exhibited by this daring call-out of the Minneapolis Star Tribune.</p><blockquote><p> Last week the Star Tribune published its “Best Of Minnesota” magazine and in it they claim that the best state park in Minnesota is Whitewater State Park. They cite “miles of cool rivers, steep bluffs and deep valleys, drumming grouse and gobbling turkeys”</p><p>Now I will say that (A) Whitewater is a very pleasant place to visit, as I said in my review, and (B) it would be very difficult to choose the best state park, but no – Whitewater is not the best one.  I will go on record and say that any one choosing a best state park that is not on the “East Coast” (i.e. Lake Superior or the Mississippi or St. Croix Rivers) will be wrong. Okay, probably wrong.</p></blockquote><p>That’s right, <i>it’s on record</i>, bitch!  While I am not among what I can only imagine to be the vast State Park-visiting demographic, I am very excited about the Guided Tour, as I cannot wait for the first serious East Coast-West Coast State Park blog war to kick off.  Best of luck to Jamsco aka Biggie. (flashes sign) East Coast!</p></div>",
  "content_text": "Being reliably informed that I may happen to possess a few idiosyncracies of my own, I’m always pleased to see when others unabashedly let their freak flag fly.  Jamsco has launched a new blog that will no doubt be of massive interest to the State Park-visiting community as he is providing what he describes as\nA Guided Tour Of The Best State Parks In The World\n.  And he’s not afraid to court a little controversy either, as exhibited by this daring call-out of the Minneapolis Star Tribune.\nLast week the Star Tribune published its “Best Of Minnesota” magazine and in it they claim that the best state park in Minnesota is Whitewater State Park. They cite “miles of cool rivers, steep bluffs and deep valleys, drumming grouse and gobbling turkeys”\nNow I will say that (A) Whitewater is a very pleasant place to visit, as I said in my review, and (B) it would be very difficult to choose the best state park, but no – Whitewater is not the best one.  I will go on record and say that any one choosing a best state park that is not on the “East Coast” (i.e. Lake Superior or the Mississippi or St. Croix Rivers) will be wrong. Okay, probably wrong.\nThat’s right,\nit’s on record\n, bitch!  While I am not among what I can only imagine to be the vast State Park-visiting demographic, I am very excited about the Guided Tour, as I cannot wait for the first serious East Coast-West Coast State Park blog war to kick off.  Best of luck to Jamsco aka Biggie. (flashes sign) East Coast!",
  "tags": [
    "freakshow"
  ],
  "categories": [],
  "sitemap_lastmod": "2012-06-09T12:00:00+00:00"
}