{
  "url": "https://voxday.net/2012/06/08/demolition-proceeds/",
  "scraped_at": "2025-12-14T04:56:13.720113",
  "title": "The demolition proceeds",
  "date_display": "June 8, 2012",
  "date_iso": "2012-06-08T09:05:00+00:00",
  "date_from_url": "2012-06-08",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>Homogamy has never been about the imitation of marriage.  The vast majority of gays don’t even want the public pretense of monogamy that “gay marriage” typically entails.  The entire political effort has never been much more than an attempt to force the organized Church to sacrifice Christian values and submit to the mores of the secular state.  While the American aspect of the movement is vowing up and down that no church will be forced to perform such “marriages”, the spearhead Danish aspect has already made it clear that <a href=\"http://www.telegraph.co.uk/news/worldnews/europe/denmark/9317447/Gay-Danish-couples-win-right-to-marry-in-church.html\">no resistance of the state-imposed morality will be permitted</a>.</p><blockquote><p> The country’s parliament voted through the new law on same-sex marriage by a large majority, making it mandatory for all churches to conduct gay marriages.  Denmark’s church minister, Manu Sareen, called the vote “historic”.  “I think it’s very important to give all members of the church the possibility to get married. Today, it’s only heterosexual couples.”</p><p>Denmark has been a pioneer in gay rights since 1989, when it became the first country in the world to offer civil unions for gay couples.</p></blockquote><p>This sort of thing is why I am completely relaxed about the coming decline and devastation of the secular West.  Seldom has a civilization more fully merited its fate.  The secular hypothesis is that a society built upon a foundation of Christian morality can not only survive, but thrive, after systematically demolishing its foundation.  Seculars believe they have already proved the validity of the hypothesis by the fact that the societies of the West have not completely crumbled yet, but they forget that they have only removed a portion of the foundation to date and the demolition process continues.  The empirical test is not over, indeed, it is barely underway.</p></div>",
  "content_text": "Homogamy has never been about the imitation of marriage.  The vast majority of gays don’t even want the public pretense of monogamy that “gay marriage” typically entails.  The entire political effort has never been much more than an attempt to force the organized Church to sacrifice Christian values and submit to the mores of the secular state.  While the American aspect of the movement is vowing up and down that no church will be forced to perform such “marriages”, the spearhead Danish aspect has already made it clear that\nno resistance of the state-imposed morality will be permitted\n.\nThe country’s parliament voted through the new law on same-sex marriage by a large majority, making it mandatory for all churches to conduct gay marriages.  Denmark’s church minister, Manu Sareen, called the vote “historic”.  “I think it’s very important to give all members of the church the possibility to get married. Today, it’s only heterosexual couples.”\nDenmark has been a pioneer in gay rights since 1989, when it became the first country in the world to offer civil unions for gay couples.\nThis sort of thing is why I am completely relaxed about the coming decline and devastation of the secular West.  Seldom has a civilization more fully merited its fate.  The secular hypothesis is that a society built upon a foundation of Christian morality can not only survive, but thrive, after systematically demolishing its foundation.  Seculars believe they have already proved the validity of the hypothesis by the fact that the societies of the West have not completely crumbled yet, but they forget that they have only removed a portion of the foundation to date and the demolition process continues.  The empirical test is not over, indeed, it is barely underway.",
  "tags": [
    "decline and fall",
    "society"
  ],
  "categories": [],
  "sitemap_lastmod": "2012-06-08T08:05:00+00:00"
}