{
  "url": "https://voxday.net/2012/06/11/euro-2012-day-3/",
  "scraped_at": "2025-12-14T04:56:28.413501",
  "title": "Euro 2012 Day 3",
  "date_display": "June 11, 2012",
  "date_iso": "2012-06-11T13:59:00+00:00",
  "date_from_url": "2012-06-11",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p><b>Italy 1 Spain 1</b></p><p>Not a bad result for the Azzurri.  They didn’t show the same midfield quality as Spain, and their attack was somewhat anemic, but their defense was solid and rendered the pass-heavy ground assault of the Spaniards mostly ineffectual.  Balotelli was a complete disaster and I do not understand what he is even doing on the team, let alone starting.  His failure to either pass to a wide-open Cassano or shoot the ball when through to goal may have cost the Italians two points; his substitute, di Natale, not only looked much more dangerous but scored within three minutes of getting in the game.  The Spanish goal was nice teamwork, but was the near-inevitable result of the Italian left back failing to mark Fabregas in the box.  Torres came on late, only to provide copious evidence for an argument concerning who was worse, him or Balotelli.  He actually managed to have the ball stolen by Buffon, the Italian keeper, on one of his three fruitless breakaways.  The draw was well-merited, as both teams looked considerably better than any of eight teams that played before them, including the Germans, and it was easily the most entertaining match of the tournament to date.</p><p><b>Croatia 3 Ireland 1</b></p><p>Ireland simply doesn’t belong here.  Seriously, they were so uniformly bad, both tactically and technically, that I was seriously left with the impression that the first team on my old club could have beaten them.  Given wasn’t merely inept in goal, but embarrassingly so, as he failed to save a fairly easy, long-distance header on the first Croatian goal, and later knocked in a ball bouncing off the post with his own head.  He looked slow and clumsy even when he was making saves.  The Irish further embarrassed themselves with their crying about a nonexistent offsides on the second Croatian goal, ignoring the obvious fact that <i>it isn’t offsides if the pass is from the other team</i>.  The Irish defender made what looked like a child’s attempt to clear the ball after a deflected shot, which sent the ball directly to the Croatian who was several yards behind the defense.  The Irish were trying to claim that the Croatian had been involved in the previous play, a shot deflected from the other side of the box, which simply wasn’t true.   The Irish attack was nearly nonexistent and consisted of nothing more than kicking the ball long, mostly to Doyle, who then collapsed like a hypersensitive Pippo Inzaghi as soon as a Croatian defender breathed on him.  Doyle won three or four free kicks this way, one of which accounted for the sole Irish goal, before the referee wised up and forced him to actually try to do something with the ball, which promptly shut down the Irish.  The Irish did run hard, but one felt that either the Spanish or the Germans could have beaten them by double digits if they wanted.</p></div>",
  "content_text": "Italy 1 Spain 1\nNot a bad result for the Azzurri.  They didn’t show the same midfield quality as Spain, and their attack was somewhat anemic, but their defense was solid and rendered the pass-heavy ground assault of the Spaniards mostly ineffectual.  Balotelli was a complete disaster and I do not understand what he is even doing on the team, let alone starting.  His failure to either pass to a wide-open Cassano or shoot the ball when through to goal may have cost the Italians two points; his substitute, di Natale, not only looked much more dangerous but scored within three minutes of getting in the game.  The Spanish goal was nice teamwork, but was the near-inevitable result of the Italian left back failing to mark Fabregas in the box.  Torres came on late, only to provide copious evidence for an argument concerning who was worse, him or Balotelli.  He actually managed to have the ball stolen by Buffon, the Italian keeper, on one of his three fruitless breakaways.  The draw was well-merited, as both teams looked considerably better than any of eight teams that played before them, including the Germans, and it was easily the most entertaining match of the tournament to date.\nCroatia 3 Ireland 1\nIreland simply doesn’t belong here.  Seriously, they were so uniformly bad, both tactically and technically, that I was seriously left with the impression that the first team on my old club could have beaten them.  Given wasn’t merely inept in goal, but embarrassingly so, as he failed to save a fairly easy, long-distance header on the first Croatian goal, and later knocked in a ball bouncing off the post with his own head.  He looked slow and clumsy even when he was making saves.  The Irish further embarrassed themselves with their crying about a nonexistent offsides on the second Croatian goal, ignoring the obvious fact that\nit isn’t offsides if the pass is from the other team\n.  The Irish defender made what looked like a child’s attempt to clear the ball after a deflected shot, which sent the ball directly to the Croatian who was several yards behind the defense.  The Irish were trying to claim that the Croatian had been involved in the previous play, a shot deflected from the other side of the box, which simply wasn’t true.   The Irish attack was nearly nonexistent and consisted of nothing more than kicking the ball long, mostly to Doyle, who then collapsed like a hypersensitive Pippo Inzaghi as soon as a Croatian defender breathed on him.  Doyle won three or four free kicks this way, one of which accounted for the sole Irish goal, before the referee wised up and forced him to actually try to do something with the ball, which promptly shut down the Irish.  The Irish did run hard, but one felt that either the Spanish or the Germans could have beaten them by double digits if they wanted.",
  "tags": [
    "sports"
  ],
  "categories": [],
  "sitemap_lastmod": "2012-06-11T12:59:00+00:00"
}