{
  "url": "https://voxday.net/2012/06/29/euro-2012-avanti-azzurri/",
  "scraped_at": "2025-12-14T04:57:51.360722",
  "title": "Euro 2012: avanti Azzurri",
  "date_display": "June 29, 2012",
  "date_iso": "2012-06-29T13:30:00+00:00",
  "date_from_url": "2012-06-29",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>I’m not sure which I enjoy more about the Euros and World Cup.  The irrational English pre-tournament optimism, followed inevitably by equally ludicrous despair, or the <a href=\"http://www.repubblica.it/rubriche/visti-dallala/2012/06/28/news/capolavoro_prandelli_balotelli-38177054/\">overexuberance </a>with which the Italians always greet success in international calcio.  Keep in mind that despite their great joy over the nominal upset, the Italians have NEVER lost to the Germans in a major tournament.</p><p><i>“It was a masterpiece of a game.  One perfect first half, which even everyone who claimed that Balotelli could not be a center forward or that Prandelli had some problems could see.  And instead, the manager got nothing wrong: for example, the move of Balzaretti to the right was inspired.  The thing that left everyone amazed was in what little time Prandelli succeeded to make a team out of a group of excellent players with four stars, Balotelli, Pirlo, De Rossi and Buffon.  In this brief period, he put Italy on display with an aggressive and intelligent soccer that has produced great games.  The difference with Spain-Portugal was before the eyes of everyone: Italy-Germany was enthusiastic and beautiful, played by the Azzurri against a mighty squad that was nevertheless annihilated by the play of Italy.  The work of the manager, the intelligence of the players, and the brilliance of Pirlo and Balotelli created an extraordinary miracle.  Only Italy has displayed the true soccer to the Europeans: the victory against Ireland was mitigated by the modest skills of the adversary, but the test of the Germans has silenced everyone.  The final with Spain will obviously be a very difficult game, but one can say that Prandelli and the players have already won Euro 2012.  An even more enthusiastic success cannot be anticipated by anyone: no one thought the manager had the capability to make the national team play this way.</i></p><p>A discourse on the obvious merits of the absolute protagonist of the semifinal with Germany: what can one say about Balotelli?  One way is to think about his problematic attitude, another puts him in discussion as a player.  Ballotelli is a player can do anything and play in any role, from the midfield to striker: aside from his goals, he plays well, he is unpredictable and concrete, he has everything to be a man of grand destiny.  And also – I repeat – Pirlo, De Rossi, and Buffon always merit mention, even though it is necessary to name everyone.  However, I mention these names in particular to repeat that Italy is a grand team with four players that have made the difference.</p><p>One note in this game against the Germans that merits mention is also Cassano, for his play, for the extraordinary assist on the occasion of the first goal: Antonio held onto the ball beautifully and Prandelli did well to put him on the point.  The real surprise is truly the manager, who did not put a foot wrong, and above all, showed us the human rapport he installed in the players while succeeding by making all the right player selections and winning moves.”</p><p>His story is a touching tribute to humanity regardless of how one looks at it, but Mario Balotelli also illustrates that true integration into a foreign culture is at least partially possible in some circumstances, as the first thing that “the Italian boy with the dark skin”, as La Repubblica calls him, did after his match of a lifetime was to run into the stands to the mother who adopted him at the age of two.</p><p><i>“The most beautiful joy was to embrace Mamma Silvia.  I scored the two goals for her,” said Mario after the game.  “Those goals were for her.  In the final, Papa Franco will come too.  And then for goals, I will score four.”</i></p></div>",
  "content_text": "I’m not sure which I enjoy more about the Euros and World Cup.  The irrational English pre-tournament optimism, followed inevitably by equally ludicrous despair, or the\noverexuberance\nwith which the Italians always greet success in international calcio.  Keep in mind that despite their great joy over the nominal upset, the Italians have NEVER lost to the Germans in a major tournament.\n“It was a masterpiece of a game.  One perfect first half, which even everyone who claimed that Balotelli could not be a center forward or that Prandelli had some problems could see.  And instead, the manager got nothing wrong: for example, the move of Balzaretti to the right was inspired.  The thing that left everyone amazed was in what little time Prandelli succeeded to make a team out of a group of excellent players with four stars, Balotelli, Pirlo, De Rossi and Buffon.  In this brief period, he put Italy on display with an aggressive and intelligent soccer that has produced great games.  The difference with Spain-Portugal was before the eyes of everyone: Italy-Germany was enthusiastic and beautiful, played by the Azzurri against a mighty squad that was nevertheless annihilated by the play of Italy.  The work of the manager, the intelligence of the players, and the brilliance of Pirlo and Balotelli created an extraordinary miracle.  Only Italy has displayed the true soccer to the Europeans: the victory against Ireland was mitigated by the modest skills of the adversary, but the test of the Germans has silenced everyone.  The final with Spain will obviously be a very difficult game, but one can say that Prandelli and the players have already won Euro 2012.  An even more enthusiastic success cannot be anticipated by anyone: no one thought the manager had the capability to make the national team play this way.\nA discourse on the obvious merits of the absolute protagonist of the semifinal with Germany: what can one say about Balotelli?  One way is to think about his problematic attitude, another puts him in discussion as a player.  Ballotelli is a player can do anything and play in any role, from the midfield to striker: aside from his goals, he plays well, he is unpredictable and concrete, he has everything to be a man of grand destiny.  And also – I repeat – Pirlo, De Rossi, and Buffon always merit mention, even though it is necessary to name everyone.  However, I mention these names in particular to repeat that Italy is a grand team with four players that have made the difference.\nOne note in this game against the Germans that merits mention is also Cassano, for his play, for the extraordinary assist on the occasion of the first goal: Antonio held onto the ball beautifully and Prandelli did well to put him on the point.  The real surprise is truly the manager, who did not put a foot wrong, and above all, showed us the human rapport he installed in the players while succeeding by making all the right player selections and winning moves.”\nHis story is a touching tribute to humanity regardless of how one looks at it, but Mario Balotelli also illustrates that true integration into a foreign culture is at least partially possible in some circumstances, as the first thing that “the Italian boy with the dark skin”, as La Repubblica calls him, did after his match of a lifetime was to run into the stands to the mother who adopted him at the age of two.\n“The most beautiful joy was to embrace Mamma Silvia.  I scored the two goals for her,” said Mario after the game.  “Those goals were for her.  In the final, Papa Franco will come too.  And then for goals, I will score four.”",
  "tags": [
    "sports"
  ],
  "categories": [],
  "sitemap_lastmod": "2012-06-29T12:30:00+00:00"
}