{
  "url": "https://voxday.net/2012/06/18/euro-2012-days-8-9-and-10/",
  "scraped_at": "2025-12-14T04:56:59.135654",
  "title": "Euro 2012 Days 8, 9, and 10",
  "date_display": "June 18, 2012",
  "date_iso": "2012-06-18T17:33:00+00:00",
  "date_from_url": "2012-06-18",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>Now that they’re doubling up on the group stage games, I can’t watch them all.  So, in group A I opted for England-Sweden and in group B, for Holland-Portugal.</p><p><b>England 3 Sweden 2</b></p><p>England got off to a great start with a header by Andy Carroll, but two mistakes in the back allowed the Swedish right defender to score twice, once on a completely unmarked header, the other time when he was played on by an English player failing to stay with the offsides trap.  However, Theo Walcott made all the difference when he came on, as his runs immediately turned the momentum of the game.  First he scored on a shot from just outside the center of the 18-yard box; it would have been an easy save except the Swedish goalie’s view was obscured by about ten players.  It wasn’t his fault, and even Walcott had an expression on his face as if to say “how did that go in?”  Then he made a great break down the right side, blew past two defenders, and sent a hard, fast pass across the face of the goal that Welbeck somehow managed to flick backwards into the net with the bottom of his foot.  A lovely pure instinct play; no one can think that fast.  It was an entertaining and hard-fought game between two flawed teams, but England clearly merited the victory and should go through with 4 points going into the game against Ukraine, especially since Rooney is off his suspension and will be available.  France beat Ukraine 2-0 in the other game in a monsoon.</p><p><b>Greece 1 Russian 0</b></p><p>Already wrote about this one.  Great game, huge upset.  The Russian attack simply fell apart after scoring 4 goals in the first game against the eventual group winners.  Strange, and I didn’t like the way Kerzhakov was given so much playing time in the second and third games after looking worse than I’ve ever seen a striker at this level in the Czech victory.  The Czech’s beat Poland 1-0 in the other game to win the group, Greece goes through in second.</p><p><b>Portugal 2 Holland 1</b></p><p>The Dutch got off to a great start and dominated possession for the first 15 minutes.  Much to my astonishment, I saw Robben actually <i>pass the ball</i> three times, which was about two more times than he had in the previous two games.  The Dutch even appeared to be bordering on optimistic about their chances of progressing when Van der Waart scored on a beautiful curling shot from the left corner of the box and the Germans went up 1-0 on Denmark.  However, Denmark soon scored to go level and Cristiano Ronaldo simply took over the game.  He and Fábio Coentrão were simply indefatigable; Coentrão went from defending the ball on the Portugal line to making a long run that took him the very opposite end of the field immediately after.  Portugal just appeared to want it more, and when Ronaldo scored his first goal on an exceptional through ball given past three Dutch defenders, it seemed to break the Dutch backs.  Portugal dominated after that point and subsequently put together one of the longest, most beautiful fast breaks I’ve ever seen, connecting on two long passes that were punctuated by Ronaldo patiently pulling the ball back to let a sprinting Dutch defender go past him, then coolly firing it home past the overmatched keeper.  Germany finally put Denmark away to win 2-1, but the Dutch failed to do their part and they’re done.</p></div>",
  "content_text": "Now that they’re doubling up on the group stage games, I can’t watch them all.  So, in group A I opted for England-Sweden and in group B, for Holland-Portugal.\nEngland 3 Sweden 2\nEngland got off to a great start with a header by Andy Carroll, but two mistakes in the back allowed the Swedish right defender to score twice, once on a completely unmarked header, the other time when he was played on by an English player failing to stay with the offsides trap.  However, Theo Walcott made all the difference when he came on, as his runs immediately turned the momentum of the game.  First he scored on a shot from just outside the center of the 18-yard box; it would have been an easy save except the Swedish goalie’s view was obscured by about ten players.  It wasn’t his fault, and even Walcott had an expression on his face as if to say “how did that go in?”  Then he made a great break down the right side, blew past two defenders, and sent a hard, fast pass across the face of the goal that Welbeck somehow managed to flick backwards into the net with the bottom of his foot.  A lovely pure instinct play; no one can think that fast.  It was an entertaining and hard-fought game between two flawed teams, but England clearly merited the victory and should go through with 4 points going into the game against Ukraine, especially since Rooney is off his suspension and will be available.  France beat Ukraine 2-0 in the other game in a monsoon.\nGreece 1 Russian 0\nAlready wrote about this one.  Great game, huge upset.  The Russian attack simply fell apart after scoring 4 goals in the first game against the eventual group winners.  Strange, and I didn’t like the way Kerzhakov was given so much playing time in the second and third games after looking worse than I’ve ever seen a striker at this level in the Czech victory.  The Czech’s beat Poland 1-0 in the other game to win the group, Greece goes through in second.\nPortugal 2 Holland 1\nThe Dutch got off to a great start and dominated possession for the first 15 minutes.  Much to my astonishment, I saw Robben actually\npass the ball\nthree times, which was about two more times than he had in the previous two games.  The Dutch even appeared to be bordering on optimistic about their chances of progressing when Van der Waart scored on a beautiful curling shot from the left corner of the box and the Germans went up 1-0 on Denmark.  However, Denmark soon scored to go level and Cristiano Ronaldo simply took over the game.  He and Fábio Coentrão were simply indefatigable; Coentrão went from defending the ball on the Portugal line to making a long run that took him the very opposite end of the field immediately after.  Portugal just appeared to want it more, and when Ronaldo scored his first goal on an exceptional through ball given past three Dutch defenders, it seemed to break the Dutch backs.  Portugal dominated after that point and subsequently put together one of the longest, most beautiful fast breaks I’ve ever seen, connecting on two long passes that were punctuated by Ronaldo patiently pulling the ball back to let a sprinting Dutch defender go past him, then coolly firing it home past the overmatched keeper.  Germany finally put Denmark away to win 2-1, but the Dutch failed to do their part and they’re done.",
  "tags": [
    "sports"
  ],
  "categories": [],
  "sitemap_lastmod": "2012-06-18T16:33:00+00:00"
}