{
  "url": "https://voxday.net/2012/06/21/gary-north-in-detai/",
  "scraped_at": "2025-12-14T04:57:11.030666",
  "title": "Free Trade and Gary North",
  "date_display": "June 21, 2012",
  "date_iso": "2012-06-21T09:28:00+00:00",
  "date_from_url": "2012-06-21",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>In which Gary North takes on “A Tax-Loving ‘Austrian Economist'” <a href=\"http://lewrockwell.com/north/north1157.html\">at Lew Rockwell</a>:</p><blockquote><p> I had never heard of the individual who runs it. I looked him up. He has written a book on the coming depression. He has written another book on an unrelated topic. He has not written anything in book form on economic theory. He does not have an academic position anywhere. His academic background is limited to a bachelor’s degree in economics. College courses in economics are Keynesian. A person needs follow-up work in economics to equip himself in the field.</p><p>There is an old rule: “You cannot change just one thing.” There is a rule of economics: “If you claim to make a breakthrough in a narrow area of economics, this is going to force you to re-think almost everything else in economics.” It is not good enough to tell everybody that you have refuted the fundamental doctrine of modern free-market economics: the doctrine of free trade. You also must show that you have restructured all of economic theory in terms of your revolutionary breakthrough: discovering why sales taxes on imported goods make society richer. The site’s editor has not done this. I will go further than this: he has his work cut out for him.</p></blockquote><p>It’s apparent that Mr. North has decided to labor under the decided disadvantage of arguing from ignorance. <a href=\"https://www.youtube.com/watch?v=4Ru8DMW-grY\">That’s a bold strategy</a>, let’s see if it pays off for him.  I’ll begin by pointing out that it is not entirely true to say I have not “not written anything in book form on economic theory” since <i>The Return of the Great Depression</i> not only contains a considerable amount of economic theory in it, but even suggests an minor improvement for the core mechanism of the Austrian Business Cycle to explain its greater versatility than its current mechanism would suggest.  I certainly don’t have an academic position anywhere, of course, neither does Mr. North.  I do have a BS in economics, which may actually be more formal economic training than Mr. North has since his PhD is in history, not economics.  But does it really befit someone who appeals to the authority of Ludwig von Mises to play the academic credential game in lieu of genuine critical discourse?</p><p>Furthermore, Mr. North is blatantly wrong.  While it is true that it is not enough to simply assert that one has refuted something, is absolutely unnecessary to “show that you have restructured all of economic theory in terms of your revolutionary breakthrough” in order to demonstrate that one has, in fact, successfully refuted it.  Identifying the flaws in the logic that supports the doctrine or demonstrating how the logic does not, in fact, correspond to observable reality are two of the ways a doctrine can be conclusively refuted, and in fact, both of those things have been done with regards to international free trade by me and others.</p><blockquote><p> In his Wiki biography, we learn that he writes science fiction novels and designs video games. I would have hoped that he had expressed greater interest in Austrian economic theory than in science fiction and video games.  He claims to be an Austrian school economist. He also is in favor of tariffs. He actually admits that by promoting tariffs (sales taxes on imported goods) in the name of Austrian economic theory, his position is “apparently oxymoronic.” I recommend that he drop the adjective “apparently.”</p></blockquote><p>Yeah, not so much.  You don’t max level in CoD:MW2, WoW, and BF3 by reading Mises.  And 750-page epic fantasies don’t write themselves while you’re mooning over your posters of Böhm-Bawerk and Rothbard.  But skill as an elite sniper or battleground commander doesn’t say anything about the correctness or incorrectness of one’s economic analysis; after all, my predictive track record appears to be rather better than Mr. North’s.  I find Mr. North’s lack of curiosity to be lamentable here.  Since I clearly recognize the way in which it appears to be oxymoronic to suggest an Austrian defense of tariffs can be made, one would think that anyone who understands Austrian economic theory would wonder what could be the basis for such a seemingly outlandish claim.  But Mr. North clearly doesn’t want to look beyond the superficial and obvious, which may explain why he is still clinging to outdated and refuted classical doctrines despite there being numerous serious critiques and literally hundreds of years of evidence to the contrary.</p><blockquote><p> He began his refutation of my defense of free trade by saying that I had invoked the names of Adam Smith and David Hume. He then went on to say that he has refuted both of them – he, plus a another guy, a man who says that Ron Paul is disingenuous on free trade, a man who is on the payroll of a industry trade association that promotes protective tariffs.</p><p>Sadly, I missed these refutations. If true, a lot of fat volumes on the history of economic thought will have to be revised. Poor old Hume. Poor old Smith. Refuted at last!</p><p>Needless to say, I remain skeptical.</p><p>He then went on to say that free traders do not pay any attention to economic history. We do not understand how economic theory applies to the real world.</p><p>Here is a man who claims to be an Austrian school economist. Yet he begins by saying that economic theory does not stand alone; economic history refutes it. He is clearly arguing that economic theory is refuted, not by better economic theory, but by economic history. This is a rejection of the first hundred pages of Ludwig von Mises’ magnum opus, Human Action.</p><p>I think it is generally a good idea that when you announce your position as an Austrian school economist, you do not abandon the epistemology of Ludwig von Mises without at least explaining on what basis you have abandoned it.</p><p>The point that Mises made was simple enough: without economic theory to guide you in your selection of facts, and also in your explanation of the relevance of these facts, you cannot say anything relevant about economic history. You will be using some unstated economic theory to select and interpret the facts, except that you will be doing this either unconsciously or surreptitiously. There is no such thing as uninterpreted facts of economic history, according to Mises, and therefore the relevance of economic history must be assessed in terms of the accuracy of the theory. This is why Mises was a deductive theorist. He made this the foundational principle of his economic system.</p></blockquote><p>It is true that I and others have refuted various things written by David Hume and Adam Smith.  I should have mentioned David Ricardo too.  Mr. North gets off to a bad start by first engaging in the genetic fallacy in order to illegitimately attempt to discredit Ian Fletcher and follows it up by admitting that he has not read any of our refutations.  He then appeals to authority by pointing out that if we’re right, a good deal of revision is in order.  So, right from the gate we have an argument from ignorance involving one logical fallacy followed by two appeals to authority.  While Mr. North has the right to be skeptical, he does not have the right to commit three logical fallacies in a misguided attempt to justify his ignorant skepticism.</p><p>Since he is unfamiliar with my argument, Mr. North fails to grasp that I am not merely saying economic history refutes the economic theory of free trade, I am saying that the theory of free trade is theoretically flawed and economic history helps illustrate those flaws.  I am suggesting various corrections to the theory, which should then bring it in line with economic history as well as permitting it to serve as a functional predictive model as it has not in the past.  Furthermore, I note that there are legitimate non-economic reasons to reject free trade as public policy, although these reasons cannot properly be considered flaws in the economic doctrine itself.</p><p>Because he is arguing from ignorance, Mr. North fails to understand that I am not abandoning Misean epistemology, but rather, asserting that it has been applied improperly in the past by Mises and others.  In fact, I have been intending to go through one of Mises’s pieces on free trade in much the same manner that I critically analyzed Henry Hazlitt’s chapter on the subject; clearly I should try to get around to it sooner rather than later.</p><blockquote><p> My critic then said that free traders adopt arguments that are 200 years old. He is correct.</p><p>One of the important aspects of truth is this: it survives for over 200 years. Amazing as it sounds, it survives for over 2000 years. One of the characteristics of truth is that it survives through time.</p><p>Then he went into a diatribe against the European Union as fascist, something that I certainly would not argue against. The fact that the European Union is fascistic has nothing to do with the truth or falsity of the logic of voluntary exchange.</p><p>We must also consider the effects of a government agent with a gun and a badge who threatens someone who wants to work out an exchange with somebody else. The logic of badges and guns extends even earlier than Adam Smith and David Hume, and it will extend a good deal longer than my life expectancy.</p><p>He never did reply to my presentation of badges and guns. There is a reason for this. He can’t – not and still maintain the illusion that he is an Austrian school economist. There is nothing remotely Austrian about his analysis.</p></blockquote><p>The problem isn’t that the arguments are 200 years old, the problem is that they haven’t been improved any in 200 years despite the growing number of theoretical criticisms and increasing amount of evidence of their failure as predictive models.  The point, that Mr. North appears to have missed, is that <i>the arguments have not survived through time</i>.  The continued belief of people who cling to those arguments and believe them to be true, while refusing to familiarize themselves with any of the counter-arguments, is not a characteristic of truth or intellectual credibility.</p><p>While the fascism of the European Union doesn’t discredit the economic doctrine of free trade itself, it does discredit it as guiding principle of public policy.  The European Union was founded and justified on the doctrine of free trade and it has delivered on many of the principles of that doctrine, including the free movement of labor, the free movement of capital, and the elimination of many tariffs.  And yet, the prosperity it purported to deliver has revealed itself to be a mirage and the benefits it has delivered have come at a truly hideous cost.</p><p>I paid no attention to his “presentation of badges and guns” because it is wholly irrelevant to either the theoretical flaws in the economic doctrine or the observable failure of the doctrine as a predictive model.  North is using them as some sort of negative magic talisman that he can wave to automatically refute anything he dislikes, but he cannot legitimately bring “badges and guns” into the equation without also bringing in every other non-economic aspect of public policy as well, such as immigration, crime, cultural heterodoxy, religion, and moral philosophy.</p><p>As for the idea that there is nothing remotely Austrian about my analysis, I find it remarkable that North can’t see the link to Austrian theory in a criticism that is based, in part, upon the connection between trade deficits and the debt they necessarily incur.</p><blockquote><p> Then he offered a paragraph on trade with South Korea. It turns out that, because of a new trade agreement that lowers tariffs from South Korea, Americans bought more goods from South Korea. Let’s see if I understand this. When you lower the price of goods, more of them are sold. Yes, yes, I think this is correct. Americans bought more goods from South Korea than we sold to them. So – I think this is right – they lent dollars to America. Does this mean “you don’t get something for nothing”? I suppose it does.</p><p>He expects hos readers to conclude:. “We must have more badges and guns and sales taxes! Nothing else will save us from poverty! Free trade, meaning free markets, meaning individual liberty of choice will destroy America otherwise! Tax us! Please tax us! We just can’t stop ourselves!”</p><p>My conceptual problem here is in understanding how a man with a badge and a gun and a sales tax would have made Americans better off. Or South Koreans.</p><p>Then he said that NAFTA is bad. Since I have never written anything in favor of NAFTA, I certainly do not want to refute him on this point. My argument related to people making an exchange, and also to a third person with a badge and a gun who sticks the gun in the belly of one of the people who wants to make an exchange, and demands payment of a sales tax. As far as I can see, this has nothing to do with NAFTA, which is a bureaucratic system for enforcing managed trade.</p></blockquote><p>Mr. North first managed to be unclear about the paragraph I “offered”, which was not something I wrote but a quote from Pat Buchanan’s recent column on free trade and South Korea.  Second, he failed to note that despite the price of <i>American</i> goods being lowered, <i>fewer were sold</i> to South Korea.  Third, he did not address the failure of the free trade-based predictions of the Office of the U.S. Trade Representative, as the statistical evidence by which those predictions must be judged showed U.S. exporters sold fewer made-in-America goods, services and agricultural products to Korean customers and therefore did the precise opposite of supporting “more good jobs here at home”.  Does this mean “you don’t get something for nothing”?  No, the failure of the trade office predictions means that either the predictive model based on the free trade doctrine was applied improperly or that the model itself is incorrect.</p><p>North repeatedly fails to understand that if one makes predictions utilizing certain assumptions and those predictions are incorrect, that is an indication that the assumptions are probably incorrect and need to be revisited.  And the sounder the logic involved in the argument, the more likely it is that the foundational postulates themselves are false.</p><p>To address North’s conceptual problem, a man with a badge and a gun and a sales tax would not have made South Koreans better off.  They have done very handsomely out of the new free trade deal.  But he could have prevented Americans from finding themselves worse off, as the US is now selling $444 million less to South Korea while adding another $825 billion in new debt.  Would Mr. North would consider himself to be similarly better off if his salary were to be cut by 12 percent while he tacked on another 15% to the amount already owed on his credit card?  Taking Mr. North’s logic to the extreme, we would have to conclude that being unemployed with a maxed-out credit card is the ideal economic state.</p><p>Mr. North engages in another logical fallacy, this time the No True Scotsman, when he claims that NAFTA is nothing but a a bureaucratic system for enforcing managed trade.  That is partially true, but North evades the undeniable fact that NAFTA is also a partial application of free trade doctrine, as it certainly freed up the international movement of capital and labor, and reduced many tariffs as well, and failed as a predictive model in very much the same way that the South Korean trade agreement failed.</p><p>If the free trade doctrine is correct, even partial applications should partially deliver upon its promises.  But the economic history that Mr. North so strangely disdains repeatedly shows that they do nothing of the sort, but rather, usually play out precisely as predicted by the policy opponents who are critics of free trade doctrine.</p><blockquote><p> Then he invoked Pat Buchanan. He said that Pat had – how can I put this euphemistically? – booted my donkey. Brutally. On a website which claims to be Austrian in perspective, invoking Pat Buchanan’s authority on this issue seems to be an inappropriate source of refutation. I do not recall that Mr. Buchanan has ever identified himself as an Austrian school economist.</p><p>He also referred to the fact that I had cited Henry Hazlitt. He went on to say that Henry Hazlitt offered a remarkably incompetent argument for free trade. He insisted that he personally discovered 13 specific errors in Hazlitt’s chapter on free trade.</p><p>Let me say at this point that I find all this delightfully amusing. Anybody who says in public that he has refuted any of Henry Hazlitt’s positions with 13 different arguments is not someone I would regard as an unimpeachable source on his own powers of reasoning. Call me narrow-minded. Call me prejudiced. But that is the way I assess it.</p><p>If you read the sections which he cited from Economics in One Lesson, you may sense that you have encountered this line of reasoning before. If you have read Mises’ Human Action, Chaptrer XXIX, Section 3, then you have indeed encountered this line of reasoning before. Hazlitt merely extended Mises’ arguments, although he wrote his book several years before Human Action was published. It would be legitimate to argue that Mises extended Hazlitt’s arguments. Of course, they were both extending arguments advanced by Hume and Smith, as well as subsequent free traders. So, what our would-be Austrian economist had argued is this: to be a well-informed Austrian economist on the issue of tariffs, you should begin with a rejection of Human Action.</p></blockquote><p>Once again, Mr. North resorts to the genetic fallacy.  And since, unlike Mr. North, I do not engage in the logical fallacy of appeals to authority, I will point out that at no point was I appealing to Mr. Buchanan’s authority as an Austrian school economist or anything else.  I was simply quoting Mr. Buchanan’s very effective point that the trade office predictions concerning South Korea based on free trade doctrine had clearly failed, as America not only increased its trade deficit, but was actually exporting less to South Korea than before.</p><p>I wouldn’t call Mr. North narrow-minded or prejudiced, simply ignorant for failing to examine the 13 Hazlittian errors I identified and foolish for thinking he could get away with such intellectually lazy behavior without getting nailed for it.  Anyone who doubts my claim is certainly welcome to examine the two posts identifying <a href=\"http://www.milobookclub.com/2011/06/14/mailvox-hazlitt-international-trade-2/\">the first seven errors</a> and <a href=\"http://www.milobookclub.com/2011/06/18/mailvox-hazlitt-international-trade_18/\">the second six</a> committed by Henry Hazlitt in Chapter 11 of his useful, but outdated <i>Economics in One Lesson</i>.  They can even read one free trader’s <a href=\"http://www.milobookclub.com/2011/06/19/mailvox-free-trader-defends-hazli/\">attempt to defend Hazlitt</a> from some of my criticisms.  Mr. North didn’t see fit to do any of that, he simply goes on to commit another logical fallacy by appealing to Hazlitt’s authority.</p><p>As for Mises, I certainly intend to critically analyze his case for free trade as well.  Rather than leap right to the source, I’m methodically working backwards and identifying each new error as it was added to the doctrine.  Perhaps this will lead to an eventual rejection of <i>Human Action</i>, but I tend to doubt it.  Mises’s masterpiece is not a Marxian monolith, every last piece of which must be blindly accepted on faith lest it all collapse in complete disarray.</p><blockquote><p> He then went on to say that the classical economic defense of free trade, the conventional defense of free trade, and the neo-Keynesian case for government intervention all have failed to take debt into account.</p><p>Then he presented statistics regarding America’s debts to foreigners. It seems that owing fiat money issued by the Federal Reserve System at 0.09% per annum (T-bills) is a disaster for Americans, and getting the use of goods produced abroad is an even bigger disaster. “Heads, they win; tails, we lose.” It’s a lose-lose transaction. Sadly, Americans do not understand this. For those of us who think the U.S. government will default on this debt, we look at a Hyundai and think, “This is a good deal. They get T-bills. I get the car.”</p><p>Here is reality, according to economics. Every exchange that is not completed involves debt. That is to say, it involves the use of credit. It involves the exchange of a promise to supply future goods in exchange for present goods.</p><p>Let’s consider a common transaction. I buy a house. I borrow the money to buy the house. I am now in debt inside my house. This does not mean that I am less wealthy. In fact, from my point of view, I am more wealthy. That is why I bought the house. I regard the house as more valuable to me than the present value (discounted by the mortgage rate) of the future stream of income that I will use to pay off the house.</p><p>He said that prosperity which is generated by free trade is a mirage. He did not bother to prove this. It really does need proof. Why is the subjective value that someone gets from owning something a mirage? Why are the benefits of trade with someone across the street or across town a mirage? How about across state lines? What’s that? It’s not a mirage? But it is when I buy something across a national line, unless I get to pay a sales tax.</p><p>The logic of his position is not intuitive. It needs an explanation. But my critic did not provide one.</p><p>I buy things online. I do not pay a local sales tax. Is this increase of my subjective wealth a mirage? Would I be better off economically if I had bought it locally and paid a state and county sales tax? Are all of us who buy online victims of a mirage? This is the logic of his position. But his argument is not supported by logic. It is supported by lots of numbers issued by government statistical agencies. The numbers show that we online shoppers are suffering from the mirage of wealth. He understands this. I do not. Do you?</p></blockquote><p>By attempting to justify free trade by appealing to the possibility of paying for a car with defaulted T-bills, Mr. North is advocating outright theft.  This is monstrous, particularly for one who keeps making to the non-economic “badges and guns” argument.  And note that North goes so far to claim that being in mortgage debt makes one intrinsically more wealthy, which is a spectacularly bizarre argument for someone questioning my Austrian allegiances to make.  Furthermore, I did prove that the prosperity supposedly produced by free trade, which is customarily measured in GDP growth, is a mirage, because I showed that the debt/GDP per capita ratio has increased dramatically from 1960 to the present.  While one can shift the argument from GDP to household assets, that doesn’t change the fact that the debt figures demonstrate that the GDP-based argument for free trade is an illusory one.</p><p>His online consumer analogy fails by Austrian standards because he is confusing internal free trade with trans-national free trade.  The two are not synonymous due to the relative immobility of capital and labor across international borders, as Mises himself noted.</p><p><i>“The sole justification for distinguishing in economic theory between domestic and foreign trade is to be found in the fact that in the case of the former there is free mobility of capital and labor, whereas this is not true in regard to the commerce between nations.”</i></p><p>This does bring us to one of the non-economic aspects of the matter, but suffice it to say that unless Mr. North is as to pursue his occupation in Bangladesh or Mongolia as he is to move it to Florida or Arizona, he cannot reasonably make use of domestic analogies in order to defend international free trade.  Indeed, this goes to the very heart of the matter, and the fact that many free trade advocates have gone so far as to dishonestly attempt to claim that the free movement of labor is not an intrinsic aspect of free trade is evidence that even some of free trade’s more vehement supporters are beginning to realize some of the fundamental flaws of the doctrine.</p><blockquote><p> To overcome this mirage, we need tariffs, he implied. In other words, when two people get together to make an exchange, and somebody with a badge and a gun does not stick his gun into the belly of one of the individuals to demand payment of the sales tax, this absence of guns and badges and the threat of violence decreases their prosperity. So, there is nothing like a badge and a gun in your belly, coupled with the demand that you pay a sales tax, to make you richer.</p><p>Think of the possibilities here. If there were another guy with a badge who sticks a gun in your back, and he demands that you pay an additional sales tax, you could get rich really fast.</p><p>This is the logic of every defense of tariffs that is not made exclusively in terms of financing the government. Any argument for tariffs that says that there is a benefit to society in general from sending out people with badges and guns to collect sales taxes, is a defense of badges and guns and sales taxes as crucial tools of production.</p><p>Historically and theoretically, Austrian school economists have not been prominent in promoting the idea that badges, guns, and higher sales taxes promote greater social welfare.</p><p>He said that the logic of free trade was always erroneous, because any consideration of debt which is put into the equation – he never did provide an equation – reveals from historical statistics the intrinsic falsity of the free-trade argument.</p></blockquote><p>Mr. North is simply engaging in silly rhetoric here, meant to appeal to those Aristotle described as being incapable of education through dialectic.  His appeal to badges and guns has nothing whatsoever to do with economic theory, and more to the point, is a terrible analogy since it leaves out the way each exchange reduces one party’s ability to engage in future exchanges.  And it is amusing that he tries to assert I am claiming badges and guns and sales taxes are crucial tools of production when if we follow his free trade logic to its extreme, it should be obvious that there will be no production taking place except where the capital and labor all flows to their ideal location for maximum efficiency.</p><p>He also mischaracterizes what I wrote, as he invents a link between the erroneous logic of free trade and the way in which the debt statistics disprove the <i>empirical</i> case for free trade.  Not the logical one; the logic fails on its own terms.  Mr. North clearly doesn’t understand the differences between the theoretical case, the empirical case, and the moral case as he keeps mixing them up.</p><blockquote><p> He specifically said that buying giant houses with no money down did not make people richer. Well, how about buying smaller houses with no money down? Did that make people poorer? A lot of people over the last 75 years have bought homes for 20% down, which certainly involved debt. Did that make them less rich? Did that impoverish them?</p><p>I realize that people can make bad decisions. That possibility is basic to all economic thought, but especially Austrian economic thought. People make bad decisions based on faulty information. Fractional reserve banking and central banking are sources of widespread false information. This perspective is basic to Austrian school economics. But the fact that people were misled by fractional reserve banking and central banking does not prove that they would have been better off if somebody with a badge and a gun had charged them an extra 5% or 10% sales tax.</p><p>This supposed Austrian school economist, who has never written anything on Austrian economic international trade theory in book form, and who claims that he has refuted 13 of Henry Hazlitt’s arguments, and who has refuted David Hume and Adam Smith, is persuaded that people who pursue their individual self-interest according to the best information they have are really fools. They do not have good information. But he thinks he does. And so, this Austrian school economist wants the federal government to send out people with badges and guns to demand sales taxes from buyers, so that Americans who want to make exchanges will be less likely to do so. This will reduce their victimization by the mirage of wealth.</p><p>Taxation produces liberty. Taxation produces wealth. Taxation reduces mirages. Taxation clears the mind.  Ingsoc was right, it seems.</p></blockquote><p>More rhetoric and posturing.  It is little wonder that he didn’t understand the link between the housing boom and the financial crisis.  But it is no harder to understand that taxation can, in some circumstances, produce liberty and wealth than to grasp the equally difficult notion that raising tax rates does not always increase tax revenue.  Mr. North appears to have a very simplistic mind that does not understand complex relationships that are more than simple ratios.</p><blockquote><p> Let me push this logic. If all this is true of trade between people across the invisible borders separating nations, then it must be logically true regarding the invisible borders separating states inside the United States. It must also be true with respect to invisible borders separating counties.</p><p>Therefore, in order to make everybody richer, each of these government jurisdictions should send out men with badges and guns to interdict the shipment of goods across those invisible lines. They must all impose sales taxes. Why? Because, if this is not done, society will become poorer. It will succumb to the mirage of wealth.</p><p>CONCLUSION</p><p>All this comes from a guy who says he is a member of Mensa, an organization of geniuses. This reminds me, once again, that if a buzz saw is set at the wrong angle, you can sharpen it for hours, but it will not cut straight.</p></blockquote><p>Mr. North here reveals both his logical incompetence as well as demonstrating his insufficient knowledge of Mises.  As I already pointed out, the free mobility of capital and labor inside the United States fundamentally distinguishes internal trade from international trade.</p></div>",
  "content_text": "In which Gary North takes on “A Tax-Loving ‘Austrian Economist'”\nat Lew Rockwell\n:\nI had never heard of the individual who runs it. I looked him up. He has written a book on the coming depression. He has written another book on an unrelated topic. He has not written anything in book form on economic theory. He does not have an academic position anywhere. His academic background is limited to a bachelor’s degree in economics. College courses in economics are Keynesian. A person needs follow-up work in economics to equip himself in the field.\nThere is an old rule: “You cannot change just one thing.” There is a rule of economics: “If you claim to make a breakthrough in a narrow area of economics, this is going to force you to re-think almost everything else in economics.” It is not good enough to tell everybody that you have refuted the fundamental doctrine of modern free-market economics: the doctrine of free trade. You also must show that you have restructured all of economic theory in terms of your revolutionary breakthrough: discovering why sales taxes on imported goods make society richer. The site’s editor has not done this. I will go further than this: he has his work cut out for him.\nIt’s apparent that Mr. North has decided to labor under the decided disadvantage of arguing from ignorance.\nThat’s a bold strategy\n, let’s see if it pays off for him.  I’ll begin by pointing out that it is not entirely true to say I have not “not written anything in book form on economic theory” since\nThe Return of the Great Depression\nnot only contains a considerable amount of economic theory in it, but even suggests an minor improvement for the core mechanism of the Austrian Business Cycle to explain its greater versatility than its current mechanism would suggest.  I certainly don’t have an academic position anywhere, of course, neither does Mr. North.  I do have a BS in economics, which may actually be more formal economic training than Mr. North has since his PhD is in history, not economics.  But does it really befit someone who appeals to the authority of Ludwig von Mises to play the academic credential game in lieu of genuine critical discourse?\nFurthermore, Mr. North is blatantly wrong.  While it is true that it is not enough to simply assert that one has refuted something, is absolutely unnecessary to “show that you have restructured all of economic theory in terms of your revolutionary breakthrough” in order to demonstrate that one has, in fact, successfully refuted it.  Identifying the flaws in the logic that supports the doctrine or demonstrating how the logic does not, in fact, correspond to observable reality are two of the ways a doctrine can be conclusively refuted, and in fact, both of those things have been done with regards to international free trade by me and others.\nIn his Wiki biography, we learn that he writes science fiction novels and designs video games. I would have hoped that he had expressed greater interest in Austrian economic theory than in science fiction and video games.  He claims to be an Austrian school economist. He also is in favor of tariffs. He actually admits that by promoting tariffs (sales taxes on imported goods) in the name of Austrian economic theory, his position is “apparently oxymoronic.” I recommend that he drop the adjective “apparently.”\nYeah, not so much.  You don’t max level in CoD:MW2, WoW, and BF3 by reading Mises.  And 750-page epic fantasies don’t write themselves while you’re mooning over your posters of Böhm-Bawerk and Rothbard.  But skill as an elite sniper or battleground commander doesn’t say anything about the correctness or incorrectness of one’s economic analysis; after all, my predictive track record appears to be rather better than Mr. North’s.  I find Mr. North’s lack of curiosity to be lamentable here.  Since I clearly recognize the way in which it appears to be oxymoronic to suggest an Austrian defense of tariffs can be made, one would think that anyone who understands Austrian economic theory would wonder what could be the basis for such a seemingly outlandish claim.  But Mr. North clearly doesn’t want to look beyond the superficial and obvious, which may explain why he is still clinging to outdated and refuted classical doctrines despite there being numerous serious critiques and literally hundreds of years of evidence to the contrary.\nHe began his refutation of my defense of free trade by saying that I had invoked the names of Adam Smith and David Hume. He then went on to say that he has refuted both of them – he, plus a another guy, a man who says that Ron Paul is disingenuous on free trade, a man who is on the payroll of a industry trade association that promotes protective tariffs.\nSadly, I missed these refutations. If true, a lot of fat volumes on the history of economic thought will have to be revised. Poor old Hume. Poor old Smith. Refuted at last!\nNeedless to say, I remain skeptical.\nHe then went on to say that free traders do not pay any attention to economic history. We do not understand how economic theory applies to the real world.\nHere is a man who claims to be an Austrian school economist. Yet he begins by saying that economic theory does not stand alone; economic history refutes it. He is clearly arguing that economic theory is refuted, not by better economic theory, but by economic history. This is a rejection of the first hundred pages of Ludwig von Mises’ magnum opus, Human Action.\nI think it is generally a good idea that when you announce your position as an Austrian school economist, you do not abandon the epistemology of Ludwig von Mises without at least explaining on what basis you have abandoned it.\nThe point that Mises made was simple enough: without economic theory to guide you in your selection of facts, and also in your explanation of the relevance of these facts, you cannot say anything relevant about economic history. You will be using some unstated economic theory to select and interpret the facts, except that you will be doing this either unconsciously or surreptitiously. There is no such thing as uninterpreted facts of economic history, according to Mises, and therefore the relevance of economic history must be assessed in terms of the accuracy of the theory. This is why Mises was a deductive theorist. He made this the foundational principle of his economic system.\nIt is true that I and others have refuted various things written by David Hume and Adam Smith.  I should have mentioned David Ricardo too.  Mr. North gets off to a bad start by first engaging in the genetic fallacy in order to illegitimately attempt to discredit Ian Fletcher and follows it up by admitting that he has not read any of our refutations.  He then appeals to authority by pointing out that if we’re right, a good deal of revision is in order.  So, right from the gate we have an argument from ignorance involving one logical fallacy followed by two appeals to authority.  While Mr. North has the right to be skeptical, he does not have the right to commit three logical fallacies in a misguided attempt to justify his ignorant skepticism.\nSince he is unfamiliar with my argument, Mr. North fails to grasp that I am not merely saying economic history refutes the economic theory of free trade, I am saying that the theory of free trade is theoretically flawed and economic history helps illustrate those flaws.  I am suggesting various corrections to the theory, which should then bring it in line with economic history as well as permitting it to serve as a functional predictive model as it has not in the past.  Furthermore, I note that there are legitimate non-economic reasons to reject free trade as public policy, although these reasons cannot properly be considered flaws in the economic doctrine itself.\nBecause he is arguing from ignorance, Mr. North fails to understand that I am not abandoning Misean epistemology, but rather, asserting that it has been applied improperly in the past by Mises and others.  In fact, I have been intending to go through one of Mises’s pieces on free trade in much the same manner that I critically analyzed Henry Hazlitt’s chapter on the subject; clearly I should try to get around to it sooner rather than later.\nMy critic then said that free traders adopt arguments that are 200 years old. He is correct.\nOne of the important aspects of truth is this: it survives for over 200 years. Amazing as it sounds, it survives for over 2000 years. One of the characteristics of truth is that it survives through time.\nThen he went into a diatribe against the European Union as fascist, something that I certainly would not argue against. The fact that the European Union is fascistic has nothing to do with the truth or falsity of the logic of voluntary exchange.\nWe must also consider the effects of a government agent with a gun and a badge who threatens someone who wants to work out an exchange with somebody else. The logic of badges and guns extends even earlier than Adam Smith and David Hume, and it will extend a good deal longer than my life expectancy.\nHe never did reply to my presentation of badges and guns. There is a reason for this. He can’t – not and still maintain the illusion that he is an Austrian school economist. There is nothing remotely Austrian about his analysis.\nThe problem isn’t that the arguments are 200 years old, the problem is that they haven’t been improved any in 200 years despite the growing number of theoretical criticisms and increasing amount of evidence of their failure as predictive models.  The point, that Mr. North appears to have missed, is that\nthe arguments have not survived through time\n.  The continued belief of people who cling to those arguments and believe them to be true, while refusing to familiarize themselves with any of the counter-arguments, is not a characteristic of truth or intellectual credibility.\nWhile the fascism of the European Union doesn’t discredit the economic doctrine of free trade itself, it does discredit it as guiding principle of public policy.  The European Union was founded and justified on the doctrine of free trade and it has delivered on many of the principles of that doctrine, including the free movement of labor, the free movement of capital, and the elimination of many tariffs.  And yet, the prosperity it purported to deliver has revealed itself to be a mirage and the benefits it has delivered have come at a truly hideous cost.\nI paid no attention to his “presentation of badges and guns” because it is wholly irrelevant to either the theoretical flaws in the economic doctrine or the observable failure of the doctrine as a predictive model.  North is using them as some sort of negative magic talisman that he can wave to automatically refute anything he dislikes, but he cannot legitimately bring “badges and guns” into the equation without also bringing in every other non-economic aspect of public policy as well, such as immigration, crime, cultural heterodoxy, religion, and moral philosophy.\nAs for the idea that there is nothing remotely Austrian about my analysis, I find it remarkable that North can’t see the link to Austrian theory in a criticism that is based, in part, upon the connection between trade deficits and the debt they necessarily incur.\nThen he offered a paragraph on trade with South Korea. It turns out that, because of a new trade agreement that lowers tariffs from South Korea, Americans bought more goods from South Korea. Let’s see if I understand this. When you lower the price of goods, more of them are sold. Yes, yes, I think this is correct. Americans bought more goods from South Korea than we sold to them. So – I think this is right – they lent dollars to America. Does this mean “you don’t get something for nothing”? I suppose it does.\nHe expects hos readers to conclude:. “We must have more badges and guns and sales taxes! Nothing else will save us from poverty! Free trade, meaning free markets, meaning individual liberty of choice will destroy America otherwise! Tax us! Please tax us! We just can’t stop ourselves!”\nMy conceptual problem here is in understanding how a man with a badge and a gun and a sales tax would have made Americans better off. Or South Koreans.\nThen he said that NAFTA is bad. Since I have never written anything in favor of NAFTA, I certainly do not want to refute him on this point. My argument related to people making an exchange, and also to a third person with a badge and a gun who sticks the gun in the belly of one of the people who wants to make an exchange, and demands payment of a sales tax. As far as I can see, this has nothing to do with NAFTA, which is a bureaucratic system for enforcing managed trade.\nMr. North first managed to be unclear about the paragraph I “offered”, which was not something I wrote but a quote from Pat Buchanan’s recent column on free trade and South Korea.  Second, he failed to note that despite the price of\nAmerican\ngoods being lowered,\nfewer were sold\nto South Korea.  Third, he did not address the failure of the free trade-based predictions of the Office of the U.S. Trade Representative, as the statistical evidence by which those predictions must be judged showed U.S. exporters sold fewer made-in-America goods, services and agricultural products to Korean customers and therefore did the precise opposite of supporting “more good jobs here at home”.  Does this mean “you don’t get something for nothing”?  No, the failure of the trade office predictions means that either the predictive model based on the free trade doctrine was applied improperly or that the model itself is incorrect.\nNorth repeatedly fails to understand that if one makes predictions utilizing certain assumptions and those predictions are incorrect, that is an indication that the assumptions are probably incorrect and need to be revisited.  And the sounder the logic involved in the argument, the more likely it is that the foundational postulates themselves are false.\nTo address North’s conceptual problem, a man with a badge and a gun and a sales tax would not have made South Koreans better off.  They have done very handsomely out of the new free trade deal.  But he could have prevented Americans from finding themselves worse off, as the US is now selling $444 million less to South Korea while adding another $825 billion in new debt.  Would Mr. North would consider himself to be similarly better off if his salary were to be cut by 12 percent while he tacked on another 15% to the amount already owed on his credit card?  Taking Mr. North’s logic to the extreme, we would have to conclude that being unemployed with a maxed-out credit card is the ideal economic state.\nMr. North engages in another logical fallacy, this time the No True Scotsman, when he claims that NAFTA is nothing but a a bureaucratic system for enforcing managed trade.  That is partially true, but North evades the undeniable fact that NAFTA is also a partial application of free trade doctrine, as it certainly freed up the international movement of capital and labor, and reduced many tariffs as well, and failed as a predictive model in very much the same way that the South Korean trade agreement failed.\nIf the free trade doctrine is correct, even partial applications should partially deliver upon its promises.  But the economic history that Mr. North so strangely disdains repeatedly shows that they do nothing of the sort, but rather, usually play out precisely as predicted by the policy opponents who are critics of free trade doctrine.\nThen he invoked Pat Buchanan. He said that Pat had – how can I put this euphemistically? – booted my donkey. Brutally. On a website which claims to be Austrian in perspective, invoking Pat Buchanan’s authority on this issue seems to be an inappropriate source of refutation. I do not recall that Mr. Buchanan has ever identified himself as an Austrian school economist.\nHe also referred to the fact that I had cited Henry Hazlitt. He went on to say that Henry Hazlitt offered a remarkably incompetent argument for free trade. He insisted that he personally discovered 13 specific errors in Hazlitt’s chapter on free trade.\nLet me say at this point that I find all this delightfully amusing. Anybody who says in public that he has refuted any of Henry Hazlitt’s positions with 13 different arguments is not someone I would regard as an unimpeachable source on his own powers of reasoning. Call me narrow-minded. Call me prejudiced. But that is the way I assess it.\nIf you read the sections which he cited from Economics in One Lesson, you may sense that you have encountered this line of reasoning before. If you have read Mises’ Human Action, Chaptrer XXIX, Section 3, then you have indeed encountered this line of reasoning before. Hazlitt merely extended Mises’ arguments, although he wrote his book several years before Human Action was published. It would be legitimate to argue that Mises extended Hazlitt’s arguments. Of course, they were both extending arguments advanced by Hume and Smith, as well as subsequent free traders. So, what our would-be Austrian economist had argued is this: to be a well-informed Austrian economist on the issue of tariffs, you should begin with a rejection of Human Action.\nOnce again, Mr. North resorts to the genetic fallacy.  And since, unlike Mr. North, I do not engage in the logical fallacy of appeals to authority, I will point out that at no point was I appealing to Mr. Buchanan’s authority as an Austrian school economist or anything else.  I was simply quoting Mr. Buchanan’s very effective point that the trade office predictions concerning South Korea based on free trade doctrine had clearly failed, as America not only increased its trade deficit, but was actually exporting less to South Korea than before.\nI wouldn’t call Mr. North narrow-minded or prejudiced, simply ignorant for failing to examine the 13 Hazlittian errors I identified and foolish for thinking he could get away with such intellectually lazy behavior without getting nailed for it.  Anyone who doubts my claim is certainly welcome to examine the two posts identifying\nthe first seven errors\nand\nthe second six\ncommitted by Henry Hazlitt in Chapter 11 of his useful, but outdated\nEconomics in One Lesson\n.  They can even read one free trader’s\nattempt to defend Hazlitt\nfrom some of my criticisms.  Mr. North didn’t see fit to do any of that, he simply goes on to commit another logical fallacy by appealing to Hazlitt’s authority.\nAs for Mises, I certainly intend to critically analyze his case for free trade as well.  Rather than leap right to the source, I’m methodically working backwards and identifying each new error as it was added to the doctrine.  Perhaps this will lead to an eventual rejection of\nHuman Action\n, but I tend to doubt it.  Mises’s masterpiece is not a Marxian monolith, every last piece of which must be blindly accepted on faith lest it all collapse in complete disarray.\nHe then went on to say that the classical economic defense of free trade, the conventional defense of free trade, and the neo-Keynesian case for government intervention all have failed to take debt into account.\nThen he presented statistics regarding America’s debts to foreigners. It seems that owing fiat money issued by the Federal Reserve System at 0.09% per annum (T-bills) is a disaster for Americans, and getting the use of goods produced abroad is an even bigger disaster. “Heads, they win; tails, we lose.” It’s a lose-lose transaction. Sadly, Americans do not understand this. For those of us who think the U.S. government will default on this debt, we look at a Hyundai and think, “This is a good deal. They get T-bills. I get the car.”\nHere is reality, according to economics. Every exchange that is not completed involves debt. That is to say, it involves the use of credit. It involves the exchange of a promise to supply future goods in exchange for present goods.\nLet’s consider a common transaction. I buy a house. I borrow the money to buy the house. I am now in debt inside my house. This does not mean that I am less wealthy. In fact, from my point of view, I am more wealthy. That is why I bought the house. I regard the house as more valuable to me than the present value (discounted by the mortgage rate) of the future stream of income that I will use to pay off the house.\nHe said that prosperity which is generated by free trade is a mirage. He did not bother to prove this. It really does need proof. Why is the subjective value that someone gets from owning something a mirage? Why are the benefits of trade with someone across the street or across town a mirage? How about across state lines? What’s that? It’s not a mirage? But it is when I buy something across a national line, unless I get to pay a sales tax.\nThe logic of his position is not intuitive. It needs an explanation. But my critic did not provide one.\nI buy things online. I do not pay a local sales tax. Is this increase of my subjective wealth a mirage? Would I be better off economically if I had bought it locally and paid a state and county sales tax? Are all of us who buy online victims of a mirage? This is the logic of his position. But his argument is not supported by logic. It is supported by lots of numbers issued by government statistical agencies. The numbers show that we online shoppers are suffering from the mirage of wealth. He understands this. I do not. Do you?\nBy attempting to justify free trade by appealing to the possibility of paying for a car with defaulted T-bills, Mr. North is advocating outright theft.  This is monstrous, particularly for one who keeps making to the non-economic “badges and guns” argument.  And note that North goes so far to claim that being in mortgage debt makes one intrinsically more wealthy, which is a spectacularly bizarre argument for someone questioning my Austrian allegiances to make.  Furthermore, I did prove that the prosperity supposedly produced by free trade, which is customarily measured in GDP growth, is a mirage, because I showed that the debt/GDP per capita ratio has increased dramatically from 1960 to the present.  While one can shift the argument from GDP to household assets, that doesn’t change the fact that the debt figures demonstrate that the GDP-based argument for free trade is an illusory one.\nHis online consumer analogy fails by Austrian standards because he is confusing internal free trade with trans-national free trade.  The two are not synonymous due to the relative immobility of capital and labor across international borders, as Mises himself noted.\n“The sole justification for distinguishing in economic theory between domestic and foreign trade is to be found in the fact that in the case of the former there is free mobility of capital and labor, whereas this is not true in regard to the commerce between nations.”\nThis does bring us to one of the non-economic aspects of the matter, but suffice it to say that unless Mr. North is as to pursue his occupation in Bangladesh or Mongolia as he is to move it to Florida or Arizona, he cannot reasonably make use of domestic analogies in order to defend international free trade.  Indeed, this goes to the very heart of the matter, and the fact that many free trade advocates have gone so far as to dishonestly attempt to claim that the free movement of labor is not an intrinsic aspect of free trade is evidence that even some of free trade’s more vehement supporters are beginning to realize some of the fundamental flaws of the doctrine.\nTo overcome this mirage, we need tariffs, he implied. In other words, when two people get together to make an exchange, and somebody with a badge and a gun does not stick his gun into the belly of one of the individuals to demand payment of the sales tax, this absence of guns and badges and the threat of violence decreases their prosperity. So, there is nothing like a badge and a gun in your belly, coupled with the demand that you pay a sales tax, to make you richer.\nThink of the possibilities here. If there were another guy with a badge who sticks a gun in your back, and he demands that you pay an additional sales tax, you could get rich really fast.\nThis is the logic of every defense of tariffs that is not made exclusively in terms of financing the government. Any argument for tariffs that says that there is a benefit to society in general from sending out people with badges and guns to collect sales taxes, is a defense of badges and guns and sales taxes as crucial tools of production.\nHistorically and theoretically, Austrian school economists have not been prominent in promoting the idea that badges, guns, and higher sales taxes promote greater social welfare.\nHe said that the logic of free trade was always erroneous, because any consideration of debt which is put into the equation – he never did provide an equation – reveals from historical statistics the intrinsic falsity of the free-trade argument.\nMr. North is simply engaging in silly rhetoric here, meant to appeal to those Aristotle described as being incapable of education through dialectic.  His appeal to badges and guns has nothing whatsoever to do with economic theory, and more to the point, is a terrible analogy since it leaves out the way each exchange reduces one party’s ability to engage in future exchanges.  And it is amusing that he tries to assert I am claiming badges and guns and sales taxes are crucial tools of production when if we follow his free trade logic to its extreme, it should be obvious that there will be no production taking place except where the capital and labor all flows to their ideal location for maximum efficiency.\nHe also mischaracterizes what I wrote, as he invents a link between the erroneous logic of free trade and the way in which the debt statistics disprove the\nempirical\ncase for free trade.  Not the logical one; the logic fails on its own terms.  Mr. North clearly doesn’t understand the differences between the theoretical case, the empirical case, and the moral case as he keeps mixing them up.\nHe specifically said that buying giant houses with no money down did not make people richer. Well, how about buying smaller houses with no money down? Did that make people poorer? A lot of people over the last 75 years have bought homes for 20% down, which certainly involved debt. Did that make them less rich? Did that impoverish them?\nI realize that people can make bad decisions. That possibility is basic to all economic thought, but especially Austrian economic thought. People make bad decisions based on faulty information. Fractional reserve banking and central banking are sources of widespread false information. This perspective is basic to Austrian school economics. But the fact that people were misled by fractional reserve banking and central banking does not prove that they would have been better off if somebody with a badge and a gun had charged them an extra 5% or 10% sales tax.\nThis supposed Austrian school economist, who has never written anything on Austrian economic international trade theory in book form, and who claims that he has refuted 13 of Henry Hazlitt’s arguments, and who has refuted David Hume and Adam Smith, is persuaded that people who pursue their individual self-interest according to the best information they have are really fools. They do not have good information. But he thinks he does. And so, this Austrian school economist wants the federal government to send out people with badges and guns to demand sales taxes from buyers, so that Americans who want to make exchanges will be less likely to do so. This will reduce their victimization by the mirage of wealth.\nTaxation produces liberty. Taxation produces wealth. Taxation reduces mirages. Taxation clears the mind.  Ingsoc was right, it seems.\nMore rhetoric and posturing.  It is little wonder that he didn’t understand the link between the housing boom and the financial crisis.  But it is no harder to understand that taxation can, in some circumstances, produce liberty and wealth than to grasp the equally difficult notion that raising tax rates does not always increase tax revenue.  Mr. North appears to have a very simplistic mind that does not understand complex relationships that are more than simple ratios.\nLet me push this logic. If all this is true of trade between people across the invisible borders separating nations, then it must be logically true regarding the invisible borders separating states inside the United States. It must also be true with respect to invisible borders separating counties.\nTherefore, in order to make everybody richer, each of these government jurisdictions should send out men with badges and guns to interdict the shipment of goods across those invisible lines. They must all impose sales taxes. Why? Because, if this is not done, society will become poorer. It will succumb to the mirage of wealth.\nCONCLUSION\nAll this comes from a guy who says he is a member of Mensa, an organization of geniuses. This reminds me, once again, that if a buzz saw is set at the wrong angle, you can sharpen it for hours, but it will not cut straight.\nMr. North here reveals both his logical incompetence as well as demonstrating his insufficient knowledge of Mises.  As I already pointed out, the free mobility of capital and labor inside the United States fundamentally distinguishes internal trade from international trade.",
  "tags": [
    "economics",
    "free trade"
  ],
  "categories": [],
  "sitemap_lastmod": "2012-06-21T08:28:00+00:00"
}