{
  "url": "https://voxday.net/2012/06/27/german-court-finds-muslim-guilty-jews/",
  "scraped_at": "2025-12-14T04:57:40.749090",
  "title": "German court finds Muslim guilty; Jews suffer most",
  "date_display": "June 27, 2012",
  "date_iso": "2012-06-27T14:53:00+00:00",
  "date_from_url": "2012-06-27",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>I was pretty sure when I read this that we could count on some <a href=\"http://blogs.the-american-interest.com/wrm/2012/06/26/german-court-declares-judaism-a-crime/\">hysterical reactions</a> from those who can detect anti-semitism in cloud formations:</p><blockquote><p>German Court Declares Judaism A Crime</p><p>Hard to believe, but that’s what the decision handed down by the regional court in Cologne, Germany means: circumcising a child under the age of consent is a crime, notwithstanding the religious beliefs of the parents…. Jews believe that the circumcision of infants is a necessary act; the command to circumcise male children at the age of eight days is the first command that God gives Abraham to mark their covenant; for thousands of years this has been a foundation of Jewish life. To ban infant circumcision is essentially to make the practice of Judaism illegal in Germany; it is now once again a crime to be a Jew in the Reich.</p></blockquote><p>First of all, no one seems to have any problem with ignoring the religious beliefs of the parents when it comes to circumcising girls, so it seems more than a little bit hypocritical for anyone to simultaneously claim that there is a religious right to chop off part of a boy’s body off, but not any part of a girl’s body.  Does Mr. Mead support the right of female circumcision for those Muslims who practice that?</p><p>Second, there are severe restrictions on religious freedom in Germany.  One cannot homeschool there, wear a headscarf, or be excused from classes on evolution for religious purposes, so it seems a bit much to expect to be able to cut pieces off other people’s bodies there on that basis.  If you want to practice your religion in freedom, Germany is simply not the place for you.  This is neither news nor rocket science.</p><p>Third, circumcision is not Judaism, as should be obvious given the fact that many Christians and Muslims are circumcised and are not Jews.  So, it is simply false to claim that Germany has declared Judaism to be a crime.  And fourth, why do Jews still want to live in Germany anyway?  One finds it hard to imagine that the Germans have not made it sufficiently clear that they do not cherish living with Jews among them any more than Israelis enjoy living with Sudanese in their midst.</p><p>UPDATE: I have zero sympathy for Jews whining about this court decision.  They have no grounds for complaining about finding themselves on the short end of the freedom of religion law this time given this previous German court case: “<i>In 1973, a Jew complained successfully that his freedom of religion was violated by the obligation to speak in a German courtroom decorated by a cross.</i>“</p><p>Do you want your traditions to be respected?  Then keep your nose out of everyone else’s.</p></div>",
  "content_text": "I was pretty sure when I read this that we could count on some\nhysterical reactions\nfrom those who can detect anti-semitism in cloud formations:\nGerman Court Declares Judaism A Crime\nHard to believe, but that’s what the decision handed down by the regional court in Cologne, Germany means: circumcising a child under the age of consent is a crime, notwithstanding the religious beliefs of the parents…. Jews believe that the circumcision of infants is a necessary act; the command to circumcise male children at the age of eight days is the first command that God gives Abraham to mark their covenant; for thousands of years this has been a foundation of Jewish life. To ban infant circumcision is essentially to make the practice of Judaism illegal in Germany; it is now once again a crime to be a Jew in the Reich.\nFirst of all, no one seems to have any problem with ignoring the religious beliefs of the parents when it comes to circumcising girls, so it seems more than a little bit hypocritical for anyone to simultaneously claim that there is a religious right to chop off part of a boy’s body off, but not any part of a girl’s body.  Does Mr. Mead support the right of female circumcision for those Muslims who practice that?\nSecond, there are severe restrictions on religious freedom in Germany.  One cannot homeschool there, wear a headscarf, or be excused from classes on evolution for religious purposes, so it seems a bit much to expect to be able to cut pieces off other people’s bodies there on that basis.  If you want to practice your religion in freedom, Germany is simply not the place for you.  This is neither news nor rocket science.\nThird, circumcision is not Judaism, as should be obvious given the fact that many Christians and Muslims are circumcised and are not Jews.  So, it is simply false to claim that Germany has declared Judaism to be a crime.  And fourth, why do Jews still want to live in Germany anyway?  One finds it hard to imagine that the Germans have not made it sufficiently clear that they do not cherish living with Jews among them any more than Israelis enjoy living with Sudanese in their midst.\nUPDATE: I have zero sympathy for Jews whining about this court decision.  They have no grounds for complaining about finding themselves on the short end of the freedom of religion law this time given this previous German court case: “\nIn 1973, a Jew complained successfully that his freedom of religion was violated by the obligation to speak in a German courtroom decorated by a cross.\n“\nDo you want your traditions to be respected?  Then keep your nose out of everyone else’s.",
  "tags": [
    "trainwreck"
  ],
  "categories": [],
  "sitemap_lastmod": "2012-06-27T13:53:00+00:00"
}