{
  "url": "https://voxday.net/2012/06/27/globalist-propositions-of-free-trade/",
  "scraped_at": "2025-12-14T04:57:38.895168",
  "title": "The Globalist Propositions of Free Trade",
  "date_display": "June 27, 2012",
  "date_iso": "2012-06-27T12:05:00+00:00",
  "date_from_url": "2012-06-27",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p><i>If the free-traders cannot understand how one nation can grow rich at the expense of another, we need not wonder, since these same gentlemen also refuse to understand how within one country one class can enrich itself at the expense of another….  But, in general, the protective system of our day is conservative, while the free trade system is destructive. It breaks up old nationalities and pushes the antagonism of the proletariat and the bourgeoisie to the extreme point. In a word, the free trade system hastens the social revolution. It is in this revolutionary sense alone, gentlemen, that I vote in favor of free trade. </i><br> – <a href=\"http://www.marxists.org/archive/marx/works/1848/01/09ft.htm\">On the Question of Free Trade</a>, Karl Marx, 1848</br></p><p>Mises may have never wavered from the view that free trade is a crucial economic policy in the program to restrict the growth of socialism.  This does not alter the easily demonstrated fact that Mises was completely wrong on this particular issue, as can be seen by taking the position of Karl Marx into account, or examining the following chart, which shows the very strong statistical correlation, 0.95, between the increasing volume of international trade and the increase in the debt owed by the U.S. federal government.</p><p><a href=\"http://2.bp.blogspot.com/-zxcuUY7IcrU/T-nUeQKZj-I/AAAAAAAAAT0/lrqgsYhqzZE/s1600/Fed%2BDebt_Trade_1960.png\" imageanchor=\"1\" style=\"clear: left; float: left; margin-bottom: 1em; margin-right: 1em;\"><img border=\"0\" decoding=\"async\" fetchpriority=\"high\" height=\"230\" src=\"http://www.milobookclub.com/wp-content/uploads/2012/06/FedDebt_Trade_1960.png\" width=\"320\"/></a>It doesn’t matter if one prefers to utilize different measures of the expansion of the power of the central state, as they will show much the same result.  What this chart shows is a five-decade refutation of the Misean assertion that an increase in trade intrinsically inhibits the expansion of the scale and scope of state power, and particularly after 1994, it shows that a reduction of protectionism does not reduce the continued growth of the state in the slightest.  To the extent that any claim of causation can be made, (and I am not making one here), we must conclude that it is arguments and policies in favor of free trade that “help to expand the power of the state” and “move in the direction of central economic planning.”</p><p>This should also not be mistaken for a claim that an increase in international trade, or even an increase in the trade deficit, is responsible for all, or even for most, of the growing amount of public and private debt.  That would be impossible, since the $738 million in new debt required to pay for the 2011 balance of payments deficit in goods would barely cover two quarters worth of new federal debt alone, and obviously the federal government is neither purchasing nor financing the purchase of all foreign imports.</p><p>Mr. North claims that <a href=\"http://lewrockwell.com/north/north1160.html\">the central economic issue</a> dividing the right wing movement is the issue of protectionism.  This may well be true, I have no opinion on the matter except to say that I believe there is a much stronger right wing case against free trade than can be made for it.  After all, the political right generally considers concepts such as national identity, culture, and tradition to be matters of serious and even vital import whereas the political left disdains them, and in some cases even denies their existence.  So when Mr. North refers to “invisible lines known as borders”, it should be clear that although he is a man of the right, he is addressing this issue from a distinctly leftward position.</p><p>Where Mr. North appears to go fundamentally awry on this issue is his inability to distinguish between the state and the nation.  He claims, correctly enough, that the statist equates the state and society and sees the state as the one true agent of the nation.  He notes that some statists actually believe that the state is the same as the nation, and this is true.  However, although North appears to understand that the state is not the nation, he clearly fails to appreciate that his arguments against the state do not necessarily apply to the nation.  Indeed, the use of the term nation-state in a non-ironic manner is to reveal an outdated mindset that fails to recognize the way the laws and goverments of most Western states are openly anti-nationalistic.</p><p>North asserts the collectivist begins with the concept of the state as the final authority, while libertarian theory begins with the concept of the individual as the final authority.  But as a Christian who claims that his view of economics begins with God as the final authority, North not only shows that he is no libertarian, but should recognize that nations do exist, that they are more than mere invisible lines, and that they are neither states nor individuals.  A nation can be a state, but in most cases, nations are spread across two or more states, and many states encompass multiple nations.  This adds a complicating factor to North’s case that he simply ignores in his attempt to create a false dichotomy between the libertarian free trader and the protectionist collectivist.</p><p>North clearly recognizes he has a problem here, as he acknowledges that conservatives <i>say</i> they don’t equate the state with the nation, but then promptly conflates the two into “the nation-state” before attempting to distract the reader by waving the red herring of mercantilism, which was a coherent historical system that has very little to do with modern protectionism except for also favoring the use of tariffs.  He offers nothing but misleading  rhetoric combined with inept logic here, and promptly goes back to complaining about the state again without ever dealing with the legitimate problems raised concerning the material difference between the state and the nation.  And in the end, he finally gives up and throws in the towel by attempting to deny the existence of nations.</p><p><i>“There is a true bait-and-switch operation going on here. Defenders of tariffs present themselves as defenders of the nation, when in fact the nation, from the point of view of economics, is not a collective entity. The nation, from an economic standpoint, is simply a convenient name that we give to people inside invisible judicial lines known as national borders.”</i></p><p>But the only bait-and-switch taking place here is by North, who is substituting “nation” for “state” and attempting to hide this by claiming that this substitution is justified “from an economic standpoint”.  But the bulk of North’s case and most his complaints about protectionism, such as the oft-repeated “badges and guns” argument, have nothing to do with economics at all.  This substitution leads North into a totally false claim about how the “entire concept of protectionism” depends upon a series of propositions that no protectionist needs to hold.  North’s simplistic approach simply cannot account for the possibility that anyone might be aware of the potential divergence between the interest of the nation and the interests of the state, and favor the former without promoting the latter.  And it is truly ironic that he accuses protectionists of “welfare statism” when his free trade argument amounts to nothing more than international welfare and the distribution of wealth from societies with high living standards to those with lower ones.</p><p>Of course, it should not be surprising that in what increasingly appears to be his dotage, North is incapable of grasping complex issues.  He even seems to have completely forgotten that 12 years ago <a href=\"http://www.lewrockwell.com/north/north18.html\">he himself advocated the use of tariffs</a>, with all those terrible badges and guns, in the interests of liberty.  He complains that those who start their analysis with the nation and still seek to defend the free market suffer from intellectual schizophrenia and do not know how to think straight, but in doing so, only demonstrates his failure to understand that the nationalist argument <i>includes</i> economic elements but is not limited to them.</p><p>I strongly suspect that North’s refusal to recognize the link between free trade and revolutionary globalism identified by Marx is because, as a post-millenialist, he himself is a utopian globalist who favors the destruction of nations.  This also explains his callous indifference towards not only the wealth of nations, but even their existence, as like Marx, he anticipates <s>the Worker’s Paradise</s>literal Heaven on Earth.</p><p>The Globalist Propositions of Free Trade are as follows:</p><ul><li>The nation does not exist.</li><li>The state is defined by invisible lines.</li><li>The individual has no responsibility to anyone beside himself.</li><li>Everyone has the right to work and live anywhere in the world they want.</li><li>Free Trade organizations and agreements have nothing to do with free trade, even if they lower tariffs and result in increased international trade.</li><li>The state does not require funding.</li><li>All government is unnecessary and illegitimate.</li></ul></div>",
  "content_text": "If the free-traders cannot understand how one nation can grow rich at the expense of another, we need not wonder, since these same gentlemen also refuse to understand how within one country one class can enrich itself at the expense of another….  But, in general, the protective system of our day is conservative, while the free trade system is destructive. It breaks up old nationalities and pushes the antagonism of the proletariat and the bourgeoisie to the extreme point. In a word, the free trade system hastens the social revolution. It is in this revolutionary sense alone, gentlemen, that I vote in favor of free trade.\n–\nOn the Question of Free Trade\n, Karl Marx, 1848\nMises may have never wavered from the view that free trade is a crucial economic policy in the program to restrict the growth of socialism.  This does not alter the easily demonstrated fact that Mises was completely wrong on this particular issue, as can be seen by taking the position of Karl Marx into account, or examining the following chart, which shows the very strong statistical correlation, 0.95, between the increasing volume of international trade and the increase in the debt owed by the U.S. federal government.\nIt doesn’t matter if one prefers to utilize different measures of the expansion of the power of the central state, as they will show much the same result.  What this chart shows is a five-decade refutation of the Misean assertion that an increase in trade intrinsically inhibits the expansion of the scale and scope of state power, and particularly after 1994, it shows that a reduction of protectionism does not reduce the continued growth of the state in the slightest.  To the extent that any claim of causation can be made, (and I am not making one here), we must conclude that it is arguments and policies in favor of free trade that “help to expand the power of the state” and “move in the direction of central economic planning.”\nThis should also not be mistaken for a claim that an increase in international trade, or even an increase in the trade deficit, is responsible for all, or even for most, of the growing amount of public and private debt.  That would be impossible, since the $738 million in new debt required to pay for the 2011 balance of payments deficit in goods would barely cover two quarters worth of new federal debt alone, and obviously the federal government is neither purchasing nor financing the purchase of all foreign imports.\nMr. North claims that\nthe central economic issue\ndividing the right wing movement is the issue of protectionism.  This may well be true, I have no opinion on the matter except to say that I believe there is a much stronger right wing case against free trade than can be made for it.  After all, the political right generally considers concepts such as national identity, culture, and tradition to be matters of serious and even vital import whereas the political left disdains them, and in some cases even denies their existence.  So when Mr. North refers to “invisible lines known as borders”, it should be clear that although he is a man of the right, he is addressing this issue from a distinctly leftward position.\nWhere Mr. North appears to go fundamentally awry on this issue is his inability to distinguish between the state and the nation.  He claims, correctly enough, that the statist equates the state and society and sees the state as the one true agent of the nation.  He notes that some statists actually believe that the state is the same as the nation, and this is true.  However, although North appears to understand that the state is not the nation, he clearly fails to appreciate that his arguments against the state do not necessarily apply to the nation.  Indeed, the use of the term nation-state in a non-ironic manner is to reveal an outdated mindset that fails to recognize the way the laws and goverments of most Western states are openly anti-nationalistic.\nNorth asserts the collectivist begins with the concept of the state as the final authority, while libertarian theory begins with the concept of the individual as the final authority.  But as a Christian who claims that his view of economics begins with God as the final authority, North not only shows that he is no libertarian, but should recognize that nations do exist, that they are more than mere invisible lines, and that they are neither states nor individuals.  A nation can be a state, but in most cases, nations are spread across two or more states, and many states encompass multiple nations.  This adds a complicating factor to North’s case that he simply ignores in his attempt to create a false dichotomy between the libertarian free trader and the protectionist collectivist.\nNorth clearly recognizes he has a problem here, as he acknowledges that conservatives\nsay\nthey don’t equate the state with the nation, but then promptly conflates the two into “the nation-state” before attempting to distract the reader by waving the red herring of mercantilism, which was a coherent historical system that has very little to do with modern protectionism except for also favoring the use of tariffs.  He offers nothing but misleading  rhetoric combined with inept logic here, and promptly goes back to complaining about the state again without ever dealing with the legitimate problems raised concerning the material difference between the state and the nation.  And in the end, he finally gives up and throws in the towel by attempting to deny the existence of nations.\n“There is a true bait-and-switch operation going on here. Defenders of tariffs present themselves as defenders of the nation, when in fact the nation, from the point of view of economics, is not a collective entity. The nation, from an economic standpoint, is simply a convenient name that we give to people inside invisible judicial lines known as national borders.”\nBut the only bait-and-switch taking place here is by North, who is substituting “nation” for “state” and attempting to hide this by claiming that this substitution is justified “from an economic standpoint”.  But the bulk of North’s case and most his complaints about protectionism, such as the oft-repeated “badges and guns” argument, have nothing to do with economics at all.  This substitution leads North into a totally false claim about how the “entire concept of protectionism” depends upon a series of propositions that no protectionist needs to hold.  North’s simplistic approach simply cannot account for the possibility that anyone might be aware of the potential divergence between the interest of the nation and the interests of the state, and favor the former without promoting the latter.  And it is truly ironic that he accuses protectionists of “welfare statism” when his free trade argument amounts to nothing more than international welfare and the distribution of wealth from societies with high living standards to those with lower ones.\nOf course, it should not be surprising that in what increasingly appears to be his dotage, North is incapable of grasping complex issues.  He even seems to have completely forgotten that 12 years ago\nhe himself advocated the use of tariffs\n, with all those terrible badges and guns, in the interests of liberty.  He complains that those who start their analysis with the nation and still seek to defend the free market suffer from intellectual schizophrenia and do not know how to think straight, but in doing so, only demonstrates his failure to understand that the nationalist argument\nincludes\neconomic elements but is not limited to them.\nI strongly suspect that North’s refusal to recognize the link between free trade and revolutionary globalism identified by Marx is because, as a post-millenialist, he himself is a utopian globalist who favors the destruction of nations.  This also explains his callous indifference towards not only the wealth of nations, but even their existence, as like Marx, he anticipates\nthe Worker’s Paradise\nliteral Heaven on Earth.\nThe Globalist Propositions of Free Trade are as follows:\nThe nation does not exist.\nThe state is defined by invisible lines.\nThe individual has no responsibility to anyone beside himself.\nEveryone has the right to work and live anywhere in the world they want.\nFree Trade organizations and agreements have nothing to do with free trade, even if they lower tariffs and result in increased international trade.\nThe state does not require funding.\nAll government is unnecessary and illegitimate.",
  "tags": [
    "free trade"
  ],
  "categories": [],
  "sitemap_lastmod": "2012-06-27T11:05:00+00:00"
}