{
  "url": "https://voxday.net/2012/06/08/israel-and-immigration-ii/",
  "scraped_at": "2025-12-14T04:56:17.355379",
  "title": "Israel and Immigration II",
  "date_display": "June 8, 2012",
  "date_iso": "2012-06-08T17:42:00+00:00",
  "date_from_url": "2012-06-08",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>Chelm continues to insist that <a href=\"http://www.wisemanofchelm.com/2012/06/vox-is-wrong-in-comparing-israels.html\">Vox is Wrong</a> in Comparing Israel’s African Immigrant Problem and the Medieval Jewish Expulsions:</p><blockquote><p> This post is going to be dedicated to Vox’s assertion that Israel’s deportation of African Immigrants would provide and ex post facto justification of the medieval deportations of Jews and the Arab expulsions in the 1950s.  This is of course, laughable, but before I start, I want to point out a few places where Vox has conceded my arguments in his last post on the subject.  Vox wrote:</p><p><i>I do agree that Americans are largely unprepared for European openness about matters of race in general and Jews in particular. I would simply assert that I am using primarily American language on the blog, though I suppose it’s entirely possible that I’m not always as conscious of the distinctions anymore given how long it has been since I left.</i></p><p>In this paragraph Vox has conceded the following points:</p><p> He did not dispute that there is a correlation between the frequency anti-semitic speech and actual violence against Jews.<br> He did not dispute that an increase in anti-semitic speech often proceeds actual violence against Jews.<br> And that his writing regarding Jews can reasonably be viewed as a change in discourse for the subject of Jews in America… so can be reasonably be classified as dangerous.</br></br></p><p>…which was the the whole point of my original post, that the alt-right philosophy is dangerous.   So, thank you Vox for conceding the point.</p></blockquote><p>I found this to be more than a little amusing, because Chelm has confused a failure to dispute something with a concession.  In that paragraph, I also failed to dispute the Moon landings, the historical legitimacy of the Protocols of the Elders of Zion, the superiority of the Green Bay Packers, and the Palestinian right of return.  But I did not concede any of those things, any more than I conceded the four points that Chelm has tried to claim that I conceded.  In his eagerness to score a point and claim a concession, Chelm has done nothing more than attack his own credibility.</p><p>But since this is a teachable moment, I will not use this minor debacle as an excuse to blow off the rest of his argument, but will proceed to read through it.</p><blockquote><p> First, I would like to remind Vox that I believe that a mass deportation of the 60,000 African immigrants in Israel is not likely to happen.  The government of Israel has willingly taken them into the country (if unlawfully) and now bears some responsibility for their welfare.  Even the proposals of deportation floated by the Israeli government envisions giving the immigrants a stipend after deporting them.</p></blockquote><p>While I’m sure we are all interested in Chelm’s ability to prognosticate, it would appear events have already overtaken his stated opinion, as Netanyahu has <a href=\"http://www.haaretz.com/news/diplomacy-defense/netanyahu-orders-swift-deportation-of-25-000-illegal-african-migrants-1.434190\">ordered the deportation</a> of 25,000 of the 60,000 undocumented workers, or as the Israelis describe them, illegal infiltrators.  “Prime Minister Benjamin Netanyahu ordered his ministers to accelerate efforts to deport citizens of South Sudan, the Ivory Coast, Ghana and Ethiopia who are living in Israel illegally on Sunday.”  Moreover, the other 35,000 are going to be installed in desert holding facilities, as Netanyahu “ordered a substantial expansion of the Saharonim lockup in the Negev.”  For all that the Jews never seem to stop complaining about the Jewish ghettos of Europe, they can’t honestly say that they spent the entire Middle Ages jailed in the desert.</p><blockquote><p> I take issue with his characterization of the deportations as non-violent.  All deportation actions are by their very nature violent, in that the threat of violence is required to compel compliance with the deportation order.  I assume he is using non-violent vs. violent as a proxy for the government exercising legitimate vs illegitimate authority… and that he believes that the massacres were illegitimate, while deportations were a legitimate exercise of the authority of state.  If that is the case, he should have said so, because to characterize the deportations as non-violent fits a rhetorical pattern Vox has of minimizing and trivializing the impact of European persecution of the Jews and reveals to some extent his bias against them.</p></blockquote><p>This is a red herring.  First, the threat of violence is not the use of violence.  Second, if all deportations are intrinsically violent, then obviously the Israeli deportations of the Africans are violent as well and there is no point in getting into the issue as it proves my assertion of equivalence.  The reason that I was pointing out the non-violent nature of the historical Jewish deportations is because I was being careful to distinguish between them and the pogroms which were often very violent in nature.  But Chelm is correct and I believe that the massacres were illegitimate – note that many of them were even illegal at the time, and some of them, such as the worst one in English history, brought down the wrath of the king on those who committed them – whereas the deportations were a legitimate exercise of the relevant authority then as now.</p><p>I will address the rest of his post tomorrow.  However, Chelm may wish to note that his attempt to deny the historical parallels is being made increasingly difficult by the actions of the people in Israel.</p><p><i>“An apartment housing 10 Eritreans has been firebombed in Jerusalem, against the backdrop of rising anti-migrant sentiment in Israel.  Four of the occupants were taken to hospital suffering burns and smoke inhalation. Graffiti sprayed on the walls of the building said: “Get out of the neighbourhood.”  During a tour of the fence on Sunday, a member of the Israeli parliament said that troops should fire on anyone attempting to cross the border illegally. “Anyone that penetrates Israel’s border should be shot, a Swedish tourist, Sudanese from Eritrea, Eritreans from Sudan, Asians from Sinai. Whoever touches Israel’s border – shot,” said Aryeh Eldad.”</i></p></div>",
  "content_text": "Chelm continues to insist that\nVox is Wrong\nin Comparing Israel’s African Immigrant Problem and the Medieval Jewish Expulsions:\nThis post is going to be dedicated to Vox’s assertion that Israel’s deportation of African Immigrants would provide and ex post facto justification of the medieval deportations of Jews and the Arab expulsions in the 1950s.  This is of course, laughable, but before I start, I want to point out a few places where Vox has conceded my arguments in his last post on the subject.  Vox wrote:\nI do agree that Americans are largely unprepared for European openness about matters of race in general and Jews in particular. I would simply assert that I am using primarily American language on the blog, though I suppose it’s entirely possible that I’m not always as conscious of the distinctions anymore given how long it has been since I left.\nIn this paragraph Vox has conceded the following points:\nHe did not dispute that there is a correlation between the frequency anti-semitic speech and actual violence against Jews.\nHe did not dispute that an increase in anti-semitic speech often proceeds actual violence against Jews.\nAnd that his writing regarding Jews can reasonably be viewed as a change in discourse for the subject of Jews in America… so can be reasonably be classified as dangerous.\n…which was the the whole point of my original post, that the alt-right philosophy is dangerous.   So, thank you Vox for conceding the point.\nI found this to be more than a little amusing, because Chelm has confused a failure to dispute something with a concession.  In that paragraph, I also failed to dispute the Moon landings, the historical legitimacy of the Protocols of the Elders of Zion, the superiority of the Green Bay Packers, and the Palestinian right of return.  But I did not concede any of those things, any more than I conceded the four points that Chelm has tried to claim that I conceded.  In his eagerness to score a point and claim a concession, Chelm has done nothing more than attack his own credibility.\nBut since this is a teachable moment, I will not use this minor debacle as an excuse to blow off the rest of his argument, but will proceed to read through it.\nFirst, I would like to remind Vox that I believe that a mass deportation of the 60,000 African immigrants in Israel is not likely to happen.  The government of Israel has willingly taken them into the country (if unlawfully) and now bears some responsibility for their welfare.  Even the proposals of deportation floated by the Israeli government envisions giving the immigrants a stipend after deporting them.\nWhile I’m sure we are all interested in Chelm’s ability to prognosticate, it would appear events have already overtaken his stated opinion, as Netanyahu has\nordered the deportation\nof 25,000 of the 60,000 undocumented workers, or as the Israelis describe them, illegal infiltrators.  “Prime Minister Benjamin Netanyahu ordered his ministers to accelerate efforts to deport citizens of South Sudan, the Ivory Coast, Ghana and Ethiopia who are living in Israel illegally on Sunday.”  Moreover, the other 35,000 are going to be installed in desert holding facilities, as Netanyahu “ordered a substantial expansion of the Saharonim lockup in the Negev.”  For all that the Jews never seem to stop complaining about the Jewish ghettos of Europe, they can’t honestly say that they spent the entire Middle Ages jailed in the desert.\nI take issue with his characterization of the deportations as non-violent.  All deportation actions are by their very nature violent, in that the threat of violence is required to compel compliance with the deportation order.  I assume he is using non-violent vs. violent as a proxy for the government exercising legitimate vs illegitimate authority… and that he believes that the massacres were illegitimate, while deportations were a legitimate exercise of the authority of state.  If that is the case, he should have said so, because to characterize the deportations as non-violent fits a rhetorical pattern Vox has of minimizing and trivializing the impact of European persecution of the Jews and reveals to some extent his bias against them.\nThis is a red herring.  First, the threat of violence is not the use of violence.  Second, if all deportations are intrinsically violent, then obviously the Israeli deportations of the Africans are violent as well and there is no point in getting into the issue as it proves my assertion of equivalence.  The reason that I was pointing out the non-violent nature of the historical Jewish deportations is because I was being careful to distinguish between them and the pogroms which were often very violent in nature.  But Chelm is correct and I believe that the massacres were illegitimate – note that many of them were even illegal at the time, and some of them, such as the worst one in English history, brought down the wrath of the king on those who committed them – whereas the deportations were a legitimate exercise of the relevant authority then as now.\nI will address the rest of his post tomorrow.  However, Chelm may wish to note that his attempt to deny the historical parallels is being made increasingly difficult by the actions of the people in Israel.\n“An apartment housing 10 Eritreans has been firebombed in Jerusalem, against the backdrop of rising anti-migrant sentiment in Israel.  Four of the occupants were taken to hospital suffering burns and smoke inhalation. Graffiti sprayed on the walls of the building said: “Get out of the neighbourhood.”  During a tour of the fence on Sunday, a member of the Israeli parliament said that troops should fire on anyone attempting to cross the border illegally. “Anyone that penetrates Israel’s border should be shot, a Swedish tourist, Sudanese from Eritrea, Eritreans from Sudan, Asians from Sinai. Whoever touches Israel’s border – shot,” said Aryeh Eldad.”",
  "tags": [
    "immigration",
    "Vibrancy is our strength"
  ],
  "categories": [],
  "sitemap_lastmod": "2012-06-08T16:42:00+00:00"
}