{
  "url": "https://voxday.net/2012/06/22/losing-it-on-free-trade/",
  "scraped_at": "2025-12-14T04:57:16.594327",
  "title": "Losing it on free trade",
  "date_display": "June 22, 2012",
  "date_iso": "2012-06-22T12:30:00+00:00",
  "date_from_url": "2012-06-22",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>Gary North now demonstrates that he’s not only logically inept, but even appears to be willing to lie about his opponents in defense of his free trade dogma.  I found this to be more than a little remarkable since I had previously considered him to be short-sighted and misguided on the topic, as well as rather lazy since he couldn’t be bothered to read the material on which he was commenting, but I never imagined that he would also be <a href=\"http://lewrockwell.com/north/north1158.html\">intellectually dishonest</a>:</p><blockquote><p> I have found over the years that when I debate with people who promote tariffs, meaning sales taxes on imported goods that are enforced by people with badges and guns, they always adopt arguments that apply only to America’s side of the border. They refuse to adopt those very same arguments for people on the other side of the border.</p><p>I challenge defenders of tariffs to state their arguments in terms of both of the people who want to trade, not just the American. The ethics and economics of restricted trade surely apply to the person who wants to trade on the other side of the invisible line known as a national border. If the arguments for restricted trade apply to the American economy, then surely they apply to the other nation’s economy. Logic and ethics do not change just because we cross an invisible judicial line. I take this position because I want the pro-tariff person to face the implications of his position.</p><p>It never ceases to amaze me that I am almost never able to persuade a person who defends tariffs to follow the logic of his argument. Without exception, the person insists that the invisible line dividing two jurisdictions called nations is economically significant, and therefore sales taxes on imported goods on the American side of the border are legitimate, wise, and beneficial to the vast majority of Americans. Yet, when I ask him to make exactly the same case with respect to the people on the other side of the border, which means either Canadians or Mexicans, the person has enormous difficulty in making his case. What seems utterly clear to him with respect to Americans on their side of the border seems ridiculous when he tries to state the case from the point of view of the Mexican or the Canadian on the other side of the border.</p><p>Why is this? Why is it that an argument that sounds utterly logical and utterly ethical from the point of view of an American who defends American tariffs on imported goods should not feel equally logical and equally ethical from the point of view of the Mexican or Canadian on the other side of the border?</p><p>There is a reason for this. His argument is ludicrous. When he applies it to people across the border, the argument becomes far more obviously ludicrous. So, he prefers not to consider what happens on the other side of the border.</p></blockquote><p>I’ll type this very slow so that Mr. North can understand it because the argument isn’t ludicrous at all.  National interests diverge.  Nations compete.  At times their interests run in parallel, at other times they are in direct opposition.  It is in the American national interest that Americans prosper.  It may or may not be in the American national interest that Mexico, China, or Russia prosper.  Logic and ethics do not change depending upon the judicial line, but the objective pursued does.  Just as it is not intrinsically unethical for an American to act in accordance with the American national interest, it is not automatically unethical for the Mexican to act in accordance with the interest of the Mexican people, even when both actions happen to oppose each other.</p><p>This really isn’t difficult to understand.  The Minnesota Vikings and the Green Bay Packers play by the same rules of the game, and yet the Vikings’ objective is to get the football in the Green Bay end zone and the Packers’ objective is to keep it out.  No one claims it is unethical for the Vikings to attempt to score or for the Packers to attempt to keep them from scoring.  If we apply North’s hapless reasoning to NFL football instead of international trade, we’d have to conclude that both teams are acting illogically and unethically by simply playing the game.</p><p>North appears to be confusing the anti-free trade argument with the fair trade argument, which accepts free trade doctrine but argues it should only be applied on a reciprocal basis.  I should be very curious to see Mr. North identify these “protectionist for me, but not for three” folks.  I’ve certainly never read Ian Fletcher write anything about this unbalanced and hypocritical doctrine nor does it describe my own anti-free trade position.</p><p>Furthermore, I note that North isn’t discussing economics anymore, but the ethics and morality of free trade.  But if we’re going to discuss the ethics and morality of free trade instead the economics, then it is necessary to consider whether it is moral for an American to place his own interests above every other American’s, and if it is ethical for a Mexican to place higher priority on the prosperity of the people of Peru above the prosperity of the people of Mexico.  Is it right for Mr. North to starve his children in order to feed the children of Chile?  Does he have no more responsibility to his relatives or to his neighbors than to the people of Argentina or Andorra?</p><p>And would it truly have been in the interests of either the American or the Russian people, or interests of the many nations under the Soviet heel, for the USA to prop up the Soviet economy through free trade?  And if Mr. North is going to claim that there are no legitimate national interests or barriers to trade, does he understand that necessitates free international trade in plutonium, the smallpox virus, and armed drones, as well as granting green cards to as many members of the Red Army that China wishes to transport to the United States?</p><p>The foolish utopianism of North and his kind is usefully revealed in terms such as “the invisible line known as a national border”.  The significant line isn’t geography, but rather people, and when the lines are not drawn in accordance with the population, trouble begins.  Germany unified despite being divided into two different states because the Germans are one nation.  Yugoslavia and Czechoslovakia broke up because multiple nations were trapped together in one state.  The European Union was founded on the principles North espouses and it is foundering because it refused to take those “invisible lines” into account.  Nations are more than mere jurisdictions.</p><p>The observable fact is that if you scratch a free trader, you reveal the globalist underneath. And since there is no greater risk to human freedom than that posed by a central global state, they are working to bring about precisely that which they fear most.  And in their myopic disregard for nations, societies, and civilization, they reveal themselves to be barbarians as well.</p><p>North’s perspective isn’t so much wrong as it is simple and short-sighted.  After a decade of the disastrous Bush wars, most sensible people now understand that it is not in America’s interest nor is it America’s responsibility to police the world or bring democracy to the world.  North’s objective is even more problematic, as he wants America to enrich the world at the expense of the American people.</p><p>One reason the free trade doctrine is so inherently untrustworthy is that its supporters reliably fail to understand that they are presenting various aspects of multiple different arguments as if they were one coherent case, which they quite clearly are not.  Moreover, North is simply lying – yes, I am accusing him outright of lying – when he writes: <i>“The difference between the defender of tariffs and the defender of market liberty is this: the defender of tariffs does not believe, nor does he go public, with a systematic defense of the legitimacy of tariffs on the other side of the border. What he wants is a no-tariff situation on the other side of the border, and a tariff law on this side of the border. He wants Americans to be able to sell whatever they want at the best possible price to people on the other side of the border. But he does not want to have people on the other side of the border to be legally allowed to sell at the best possible price for people on this side of the border.”</i></p><p>I am calling Mr. North out on this blatant lie and shameless misrepresentation of those advocating barriers to international trade.  It is completely and blatantly false.  I do believe, and I am quite willing to go public with a systematic defense of the legitimacy of tariffs on both sides of every international border.  Every nation has the right to defend its own interests as its people see fit.  The same logic in defense of American interests applies to the defense of Mexican, Canadian, and Chinese interests.  Other nations have the same right, and indeed, the same responsibility, to utilize tariffs to protect their native industries and domestic markets.  Now, due to the smaller size of many nations, logic may dictate that their tariff laws be different than the USA’s; there is no sense in protecting jobs that don’t exist in nonexistent industries, after all.  But that doesn’t change the fact that North’s accusation is completely false.</p></div>",
  "content_text": "Gary North now demonstrates that he’s not only logically inept, but even appears to be willing to lie about his opponents in defense of his free trade dogma.  I found this to be more than a little remarkable since I had previously considered him to be short-sighted and misguided on the topic, as well as rather lazy since he couldn’t be bothered to read the material on which he was commenting, but I never imagined that he would also be\nintellectually dishonest\n:\nI have found over the years that when I debate with people who promote tariffs, meaning sales taxes on imported goods that are enforced by people with badges and guns, they always adopt arguments that apply only to America’s side of the border. They refuse to adopt those very same arguments for people on the other side of the border.\nI challenge defenders of tariffs to state their arguments in terms of both of the people who want to trade, not just the American. The ethics and economics of restricted trade surely apply to the person who wants to trade on the other side of the invisible line known as a national border. If the arguments for restricted trade apply to the American economy, then surely they apply to the other nation’s economy. Logic and ethics do not change just because we cross an invisible judicial line. I take this position because I want the pro-tariff person to face the implications of his position.\nIt never ceases to amaze me that I am almost never able to persuade a person who defends tariffs to follow the logic of his argument. Without exception, the person insists that the invisible line dividing two jurisdictions called nations is economically significant, and therefore sales taxes on imported goods on the American side of the border are legitimate, wise, and beneficial to the vast majority of Americans. Yet, when I ask him to make exactly the same case with respect to the people on the other side of the border, which means either Canadians or Mexicans, the person has enormous difficulty in making his case. What seems utterly clear to him with respect to Americans on their side of the border seems ridiculous when he tries to state the case from the point of view of the Mexican or the Canadian on the other side of the border.\nWhy is this? Why is it that an argument that sounds utterly logical and utterly ethical from the point of view of an American who defends American tariffs on imported goods should not feel equally logical and equally ethical from the point of view of the Mexican or Canadian on the other side of the border?\nThere is a reason for this. His argument is ludicrous. When he applies it to people across the border, the argument becomes far more obviously ludicrous. So, he prefers not to consider what happens on the other side of the border.\nI’ll type this very slow so that Mr. North can understand it because the argument isn’t ludicrous at all.  National interests diverge.  Nations compete.  At times their interests run in parallel, at other times they are in direct opposition.  It is in the American national interest that Americans prosper.  It may or may not be in the American national interest that Mexico, China, or Russia prosper.  Logic and ethics do not change depending upon the judicial line, but the objective pursued does.  Just as it is not intrinsically unethical for an American to act in accordance with the American national interest, it is not automatically unethical for the Mexican to act in accordance with the interest of the Mexican people, even when both actions happen to oppose each other.\nThis really isn’t difficult to understand.  The Minnesota Vikings and the Green Bay Packers play by the same rules of the game, and yet the Vikings’ objective is to get the football in the Green Bay end zone and the Packers’ objective is to keep it out.  No one claims it is unethical for the Vikings to attempt to score or for the Packers to attempt to keep them from scoring.  If we apply North’s hapless reasoning to NFL football instead of international trade, we’d have to conclude that both teams are acting illogically and unethically by simply playing the game.\nNorth appears to be confusing the anti-free trade argument with the fair trade argument, which accepts free trade doctrine but argues it should only be applied on a reciprocal basis.  I should be very curious to see Mr. North identify these “protectionist for me, but not for three” folks.  I’ve certainly never read Ian Fletcher write anything about this unbalanced and hypocritical doctrine nor does it describe my own anti-free trade position.\nFurthermore, I note that North isn’t discussing economics anymore, but the ethics and morality of free trade.  But if we’re going to discuss the ethics and morality of free trade instead the economics, then it is necessary to consider whether it is moral for an American to place his own interests above every other American’s, and if it is ethical for a Mexican to place higher priority on the prosperity of the people of Peru above the prosperity of the people of Mexico.  Is it right for Mr. North to starve his children in order to feed the children of Chile?  Does he have no more responsibility to his relatives or to his neighbors than to the people of Argentina or Andorra?\nAnd would it truly have been in the interests of either the American or the Russian people, or interests of the many nations under the Soviet heel, for the USA to prop up the Soviet economy through free trade?  And if Mr. North is going to claim that there are no legitimate national interests or barriers to trade, does he understand that necessitates free international trade in plutonium, the smallpox virus, and armed drones, as well as granting green cards to as many members of the Red Army that China wishes to transport to the United States?\nThe foolish utopianism of North and his kind is usefully revealed in terms such as “the invisible line known as a national border”.  The significant line isn’t geography, but rather people, and when the lines are not drawn in accordance with the population, trouble begins.  Germany unified despite being divided into two different states because the Germans are one nation.  Yugoslavia and Czechoslovakia broke up because multiple nations were trapped together in one state.  The European Union was founded on the principles North espouses and it is foundering because it refused to take those “invisible lines” into account.  Nations are more than mere jurisdictions.\nThe observable fact is that if you scratch a free trader, you reveal the globalist underneath. And since there is no greater risk to human freedom than that posed by a central global state, they are working to bring about precisely that which they fear most.  And in their myopic disregard for nations, societies, and civilization, they reveal themselves to be barbarians as well.\nNorth’s perspective isn’t so much wrong as it is simple and short-sighted.  After a decade of the disastrous Bush wars, most sensible people now understand that it is not in America’s interest nor is it America’s responsibility to police the world or bring democracy to the world.  North’s objective is even more problematic, as he wants America to enrich the world at the expense of the American people.\nOne reason the free trade doctrine is so inherently untrustworthy is that its supporters reliably fail to understand that they are presenting various aspects of multiple different arguments as if they were one coherent case, which they quite clearly are not.  Moreover, North is simply lying – yes, I am accusing him outright of lying – when he writes:\n“The difference between the defender of tariffs and the defender of market liberty is this: the defender of tariffs does not believe, nor does he go public, with a systematic defense of the legitimacy of tariffs on the other side of the border. What he wants is a no-tariff situation on the other side of the border, and a tariff law on this side of the border. He wants Americans to be able to sell whatever they want at the best possible price to people on the other side of the border. But he does not want to have people on the other side of the border to be legally allowed to sell at the best possible price for people on this side of the border.”\nI am calling Mr. North out on this blatant lie and shameless misrepresentation of those advocating barriers to international trade.  It is completely and blatantly false.  I do believe, and I am quite willing to go public with a systematic defense of the legitimacy of tariffs on both sides of every international border.  Every nation has the right to defend its own interests as its people see fit.  The same logic in defense of American interests applies to the defense of Mexican, Canadian, and Chinese interests.  Other nations have the same right, and indeed, the same responsibility, to utilize tariffs to protect their native industries and domestic markets.  Now, due to the smaller size of many nations, logic may dictate that their tariff laws be different than the USA’s; there is no sense in protecting jobs that don’t exist in nonexistent industries, after all.  But that doesn’t change the fact that North’s accusation is completely false.",
  "tags": [
    "economics",
    "free trade"
  ],
  "categories": [],
  "sitemap_lastmod": "2012-06-22T11:30:00+00:00"
}