{
  "url": "https://voxday.net/2012/06/14/mailvox-permissive-will-of-red-handed/",
  "scraped_at": "2025-12-14T04:56:43.075199",
  "title": "Mailvox: the permissive will of a red-handed god",
  "date_display": "June 14, 2012",
  "date_iso": "2012-06-14T15:12:00+00:00",
  "date_from_url": "2012-06-14",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>KH asks about the so-called “permissive will” that is part of the Calvinist concept of the divine:</p><blockquote><p> I have followed your discussion of Calvinism with great interest.  Some of these questions come up routinely in an on going group Bible study.  Recently, one Calvinist used the term “permissive will” in reference to God allowing a natural disaster to kill people.  (The term was new to me). He argued that God does not cause these tragedies but permits them or allows Satan to cause them.  The problem I perceived with this argument is that one is still blaming God for the earthquake or tornado fatalities, whether it was His “permissive/passive” or active will.  The term “permissive will” seemed like a euphemism to get around the belief of God controlling every storm and fault line without actually accusing Him of murder.  I still feel like there was a missed opportunity for the use of logic to take out that argument.  How would you have responded to the use of that term?</p></blockquote><p>This is one of the concepts I lampoon in my occasional reference to the nine billion wills of God – actually, I think I previously referred to 17, but nine billion more appropriately reflects my view of the matter – and <a href=\"http://bible.org/question/can-you-help-me-understand-gods-perfect-will-versus-his-permissive-will\">it refers to the distinctions</a> that some Calvinists make between the “perfect”, the “permissive”, the “decreed”, the “directive”, the “perceptive”, and the “directed” wills of God.  This isn’t quite as insane as it sounds, as there is a necessary and legitimate reason to distinguish between what God demands, what God decrees, what God anticipates, and what God wishes but does not expect, all of which can be reasonably described as what He wills.</p><p>However, KH is correct in smelling a rat.  Those inclined to omniderigence will draw no such distinction; John Piper, for example, is straightforward about his belief in a literally murderous Jesus Christ who purposefully kills people with tornadoes.  But this is a theologically incorrect use of “permissive will”, as that is what is used to explain Man’s ability to sin, not Man’s suffering natural disasters, which is generally considered to be a consequence of God’s “perfect will”.</p><p>This use of “permissive will” actually sounds rather more like my very non-Calvinist perspective, although I would never use such a term to describe what I observe to be Satan’s partial sovereignty over the world.  It is always intriguing to compare the Calvinist claims of God’s sovereignty with the contradictory claims of Jesus Christ and the Apostle Paul concerning the being they describe as “the prince of this world” and “the god of this age”.</p></div>",
  "content_text": "KH asks about the so-called “permissive will” that is part of the Calvinist concept of the divine:\nI have followed your discussion of Calvinism with great interest.  Some of these questions come up routinely in an on going group Bible study.  Recently, one Calvinist used the term “permissive will” in reference to God allowing a natural disaster to kill people.  (The term was new to me). He argued that God does not cause these tragedies but permits them or allows Satan to cause them.  The problem I perceived with this argument is that one is still blaming God for the earthquake or tornado fatalities, whether it was His “permissive/passive” or active will.  The term “permissive will” seemed like a euphemism to get around the belief of God controlling every storm and fault line without actually accusing Him of murder.  I still feel like there was a missed opportunity for the use of logic to take out that argument.  How would you have responded to the use of that term?\nThis is one of the concepts I lampoon in my occasional reference to the nine billion wills of God – actually, I think I previously referred to 17, but nine billion more appropriately reflects my view of the matter – and\nit refers to the distinctions\nthat some Calvinists make between the “perfect”, the “permissive”, the “decreed”, the “directive”, the “perceptive”, and the “directed” wills of God.  This isn’t quite as insane as it sounds, as there is a necessary and legitimate reason to distinguish between what God demands, what God decrees, what God anticipates, and what God wishes but does not expect, all of which can be reasonably described as what He wills.\nHowever, KH is correct in smelling a rat.  Those inclined to omniderigence will draw no such distinction; John Piper, for example, is straightforward about his belief in a literally murderous Jesus Christ who purposefully kills people with tornadoes.  But this is a theologically incorrect use of “permissive will”, as that is what is used to explain Man’s ability to sin, not Man’s suffering natural disasters, which is generally considered to be a consequence of God’s “perfect will”.\nThis use of “permissive will” actually sounds rather more like my very non-Calvinist perspective, although I would never use such a term to describe what I observe to be Satan’s partial sovereignty over the world.  It is always intriguing to compare the Calvinist claims of God’s sovereignty with the contradictory claims of Jesus Christ and the Apostle Paul concerning the being they describe as “the prince of this world” and “the god of this age”.",
  "tags": [
    "Christianity",
    "mailvox"
  ],
  "categories": [],
  "sitemap_lastmod": "2012-06-14T14:12:00+00:00"
}