{
  "url": "https://voxday.net/2012/06/28/mailvox-of-free-trade-austrians-and/",
  "scraped_at": "2025-12-14T04:57:44.044170",
  "title": "Mailvox: of free trade, Austrians, and authors",
  "date_display": "June 28, 2012",
  "date_iso": "2012-06-28T09:40:00+00:00",
  "date_from_url": "2012-06-28",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>CA asks about protectionism in Alabama:</p><blockquote><p>If I understand your position correctly, you say the free movement of labor is an inherent flaw in the free trade ideology.  If this is true, the recently passed Alabama HB 56 would theoretically correct for the free movement of labor by forcing illegal immigrants out of the workforce.  Apparently it did force them out of the workforce and now Alabama farmers cannot find enough labor to meet their needs because legal workers are unable or unwilling to perform the work that the illegal immigrants had been doing.  The situation turns the “they took our jobs” argument on its head.</p><p>Would you chalk this up to the fact that Americans have become soft and lazy because illegal immigrants have been doing all the hard work for so long?  Do you expect that, if the law is kept on the books, legal workers will eventually take the reigns when the situation becomes more dire?  Am I entirely missing the point somewhere?  Basically, how do you fit this empirical data into your anti-free trade theory?</p><p>I have been enjoying this discussion, btw, thanks for the intellectual stimulation.</p></blockquote><p>First, I have to offer a mild correction to the statement that “Alabama farmers cannot find enough labor to meet their needs because legal workers are unable or unwilling to perform the work that the illegal immigrants had been doing”.  The fact is that Alabama farmers cannot find enough labor to meet their needs because legal workers are unable or unwilling to perform the work that the illegal immigrants had been doing <i>at the same lower wages the immigrants had been receiving</i>.  Would they have any trouble finding sufficient labor if they paid $1 milllion per hour?  Of course not.  So, it’s not a problem of a shortage of labor, but rather, insufficient wages.</p><p>How does this fit into my anti-free trade theory?  Perfectly.  In the free trade scenario, the low-wage laborers migrate legally to Alabama and stay there, increasing the farmers’ profits at the expense of the Alabama workers and the local Alabama culture which is now permanently transformed into Mexico-Alabama.  The Alabama workers must either reduce their standard of living by accepting Mexican wages or leave Alabama in search of a place where they can find higher wages.  Even if overall wealth is increased temporarily, it comes at a high cost in societal destruction, as even if Alabama’s population remains the same, its demographics do not.</p><p>And since immigrants are disproportionately young men, the qualitative change in the workforce likely means exchanging young, single Hispanic men for Alabama family men.  This will tend to increase crime, lower property values, reduce social cohesion, and incur other costs that don’t show up in the simple economic calculations.</p><p>AM, on the other hand, thinks that opposition to free trade is impossible for a libertarian:</p><blockquote><p>According to the lead for your columns you are a “Christian libertarian.”  Perhaps you really are a Christian.  Your column on free trade definitely scratches the libertarian part.  You also seem to believe that NAFTA, etc. are free trade agreements.  You also fail to explain any harm from real free trade or any benefits from using force and violence to interfere with individuals who want to trade.  You are good at name calling of Ricardo and others who advance the principles of comparative advantage.  Yet you have not one word about what is wrong with the principles.  I eagerly await your analysis and criticism of the principles of comparative advantage.  I suspect I will be waiting a long time.  Government borrowing is a problem.  That it borrows from those the people of the US trade with, rather than from people of the US doesn’t make the borrowing any more destructive.</p></blockquote><p>I can see how some libertarians can reasonably argue that I am No True Libertarian, but their thinking is simplistic and relies upon the fallacious concept that maximizing human liberty requires maximizing the legal range of human behavior.  I will eventually be presenting a positive case for opposing free trade in some circumstances as part of my argument for National Libertarianism.  In the meatime, as we can see from the example of this email, many free trade advocates are blatantly dishonest.  Let’s list just a few of the obvious falsehoods some of them keep repeating:</p><p>1.  Free trade does not mean free trade in services.<br> 2.  Free trade does not involve the free movement of labor.<br> 3.  Free trade does not involve free trade agreements.<br> 4.  Free trade is binary.</br></br></br></p><p>AM also throws in numerous other falsehoods as well, but I expect most of you can see how absurd they are since, just to give one example, I have obviously supplied considerably more than one word about what is wrong with the principles of comparative advantage.  But let’s focus on the idea that NAFTA, GATT and other free trade agreements are not free trade agreements.</p><p>Now, I don’t deny that these various agreements do not constitute perfectly free trade.  After all, we still have immigration laws, work visas, and numerous other means of preventing the free movement of labor and various tariffs are still on the books.  But there is no denying that these free trade agreements have led to a greater volume of trade as well as a reduction in tariff rates and the number of tariffs. <a href=\"http://reference.allrefer.com/country-guide-study/mexico/mexico82.html\">Consider the facts</a>:</p><p><i> NAFTA provides for the elimination of Mexican tariffs on 5,900 categories of imports from the United States and Canada (mostly machinery and intermediate goods), representing more than 40 percent of Mexico’s overall trade. Other products are reclassified in a simplified tariff list having four rate bands–5 percent, 10 percent, 15 percent, and 20 percent. The United States eliminated tariffs on 3,100 additional categories of Mexican goods, bringing to 80 percent the portion of all Mexican exports to the United States that will be free from tariffs. Some 4,200 categories already had been included in the General System of Preferences (GSP) and were thus already exempt from tariffs. The treaty eliminates some tariffs immediately and phases out the rest over five, ten, or fifteen years, with vulnerable industries in the United States and Mexico receiving the longest protection.</i></p><p>Mexico’s deadlines for lowering trade barriers are generally longer than those for Canada and the United States. The latter countries are required to lift immediately their tariffs on some 80 percent of Mexico’s nonoil exports, while Mexico must grant immediate free entry to 42 percent of United States and Canadian exports. Special rules apply for trade in textiles, vehicles and auto parts, and agricultural products. The treaty also governs trade in services, including overland transport, telecommunications, and financial services, and it includes provisions for the liberalization of government procurement.</p><p>NAFTA requires Mexico to abolish protectionist limitations on foreign investment (except in the energy sector), allow free profit repatriation by United States and Canadian firms, and guarantee investors against property seizure without full compensation. The treaty allows foreign banks to take up to 25 percent of Mexico’s banking market and allows foreign brokerages to take 30 percent of the securities business by 2004, after which all restrictions are to be eliminated.</p><p>The dishonesty of the “free trade agreements are not free trade” argument is readily apparent in the way in which the free trade arguments oppose adding new tariffs, raising tariff rates, or reducing immigration on the basis of their free trade doctrine while simultaneously attempting to claim that no amount of eliminated tariffs, reduced tariff rates, or increased immigration can be considered free trade.  They’re claiming that the protectionist pros and cons can be judged on a graduated basis, but the pros and cons of free trade cannot be.  This is not only dishonest, but is obviously absurd, since the benefits of free trade cannot magically arrive all at once with the Traders’ Paradise if the costs of protectionism appear piecemeal.</p><p>NAFTA is not an entirely free trade agreement, but it is an agreement to engage in freer trade, it has in fact led to freer trade, and as such, it serves perfectly well as an example of the failure of free trade doctrine.  I note that in all the denials of connection between NAFTA, GATT, and other free trade agreements and genuine free trade, very few free trade advocates have come out and called for the cancellation of those agreements.  This is not to say that no free traders ever opposed NAFTA; it should come as no surprise that <a href=\"http://mises.org/econsense/ch87.asp\">Murray Rothbard did</a>.</p><p>And on a mildly amusing tangential note, I’m not the only one who has noted Gary North’s inability to distinguish between related, but distinct concepts.</p><blockquote><p>According to Gary: “[Mises’s] disciple Murray Rothbard promoted 100% reserve banking. But, because he [Rothbard] opposed the existence of the state, his call for 100% reserves was not a call for legislation requiring 100% reserves.”</p><p>Murray Rothbard of course opposed the state. But, according to Gary, Murray would therefore have to oppose all legislation or laws. Yet, clearly, Murray (as a libertarian, not an Austrian), favored laws against murder, rape, etc. In his view, they would be implemented not by the government, but by private defense agencies. It is a misconstrual of free market anarchism to say that advocates of this philosophy oppose all laws. Au contraire: We are supporters of proper law, i.e., laws upholding individual rights and private property. Indeed, our criticism of the government is that it violates such proper law.</p></blockquote><p>And finally, a member of the Dread Ilk has published <a href=\"http://www.amazon.com/dp/B008ET8BZA\">a book on Round One</a>.  No doubt Nate will want to check it out.</p></div>",
  "content_text": "CA asks about protectionism in Alabama:\nIf I understand your position correctly, you say the free movement of labor is an inherent flaw in the free trade ideology.  If this is true, the recently passed Alabama HB 56 would theoretically correct for the free movement of labor by forcing illegal immigrants out of the workforce.  Apparently it did force them out of the workforce and now Alabama farmers cannot find enough labor to meet their needs because legal workers are unable or unwilling to perform the work that the illegal immigrants had been doing.  The situation turns the “they took our jobs” argument on its head.\nWould you chalk this up to the fact that Americans have become soft and lazy because illegal immigrants have been doing all the hard work for so long?  Do you expect that, if the law is kept on the books, legal workers will eventually take the reigns when the situation becomes more dire?  Am I entirely missing the point somewhere?  Basically, how do you fit this empirical data into your anti-free trade theory?\nI have been enjoying this discussion, btw, thanks for the intellectual stimulation.\nFirst, I have to offer a mild correction to the statement that “Alabama farmers cannot find enough labor to meet their needs because legal workers are unable or unwilling to perform the work that the illegal immigrants had been doing”.  The fact is that Alabama farmers cannot find enough labor to meet their needs because legal workers are unable or unwilling to perform the work that the illegal immigrants had been doing\nat the same lower wages the immigrants had been receiving\n.  Would they have any trouble finding sufficient labor if they paid $1 milllion per hour?  Of course not.  So, it’s not a problem of a shortage of labor, but rather, insufficient wages.\nHow does this fit into my anti-free trade theory?  Perfectly.  In the free trade scenario, the low-wage laborers migrate legally to Alabama and stay there, increasing the farmers’ profits at the expense of the Alabama workers and the local Alabama culture which is now permanently transformed into Mexico-Alabama.  The Alabama workers must either reduce their standard of living by accepting Mexican wages or leave Alabama in search of a place where they can find higher wages.  Even if overall wealth is increased temporarily, it comes at a high cost in societal destruction, as even if Alabama’s population remains the same, its demographics do not.\nAnd since immigrants are disproportionately young men, the qualitative change in the workforce likely means exchanging young, single Hispanic men for Alabama family men.  This will tend to increase crime, lower property values, reduce social cohesion, and incur other costs that don’t show up in the simple economic calculations.\nAM, on the other hand, thinks that opposition to free trade is impossible for a libertarian:\nAccording to the lead for your columns you are a “Christian libertarian.”  Perhaps you really are a Christian.  Your column on free trade definitely scratches the libertarian part.  You also seem to believe that NAFTA, etc. are free trade agreements.  You also fail to explain any harm from real free trade or any benefits from using force and violence to interfere with individuals who want to trade.  You are good at name calling of Ricardo and others who advance the principles of comparative advantage.  Yet you have not one word about what is wrong with the principles.  I eagerly await your analysis and criticism of the principles of comparative advantage.  I suspect I will be waiting a long time.  Government borrowing is a problem.  That it borrows from those the people of the US trade with, rather than from people of the US doesn’t make the borrowing any more destructive.\nI can see how some libertarians can reasonably argue that I am No True Libertarian, but their thinking is simplistic and relies upon the fallacious concept that maximizing human liberty requires maximizing the legal range of human behavior.  I will eventually be presenting a positive case for opposing free trade in some circumstances as part of my argument for National Libertarianism.  In the meatime, as we can see from the example of this email, many free trade advocates are blatantly dishonest.  Let’s list just a few of the obvious falsehoods some of them keep repeating:\n1.  Free trade does not mean free trade in services.\n2.  Free trade does not involve the free movement of labor.\n3.  Free trade does not involve free trade agreements.\n4.  Free trade is binary.\nAM also throws in numerous other falsehoods as well, but I expect most of you can see how absurd they are since, just to give one example, I have obviously supplied considerably more than one word about what is wrong with the principles of comparative advantage.  But let’s focus on the idea that NAFTA, GATT and other free trade agreements are not free trade agreements.\nNow, I don’t deny that these various agreements do not constitute perfectly free trade.  After all, we still have immigration laws, work visas, and numerous other means of preventing the free movement of labor and various tariffs are still on the books.  But there is no denying that these free trade agreements have led to a greater volume of trade as well as a reduction in tariff rates and the number of tariffs.\nConsider the facts\n:\nNAFTA provides for the elimination of Mexican tariffs on 5,900 categories of imports from the United States and Canada (mostly machinery and intermediate goods), representing more than 40 percent of Mexico’s overall trade. Other products are reclassified in a simplified tariff list having four rate bands–5 percent, 10 percent, 15 percent, and 20 percent. The United States eliminated tariffs on 3,100 additional categories of Mexican goods, bringing to 80 percent the portion of all Mexican exports to the United States that will be free from tariffs. Some 4,200 categories already had been included in the General System of Preferences (GSP) and were thus already exempt from tariffs. The treaty eliminates some tariffs immediately and phases out the rest over five, ten, or fifteen years, with vulnerable industries in the United States and Mexico receiving the longest protection.\nMexico’s deadlines for lowering trade barriers are generally longer than those for Canada and the United States. The latter countries are required to lift immediately their tariffs on some 80 percent of Mexico’s nonoil exports, while Mexico must grant immediate free entry to 42 percent of United States and Canadian exports. Special rules apply for trade in textiles, vehicles and auto parts, and agricultural products. The treaty also governs trade in services, including overland transport, telecommunications, and financial services, and it includes provisions for the liberalization of government procurement.\nNAFTA requires Mexico to abolish protectionist limitations on foreign investment (except in the energy sector), allow free profit repatriation by United States and Canadian firms, and guarantee investors against property seizure without full compensation. The treaty allows foreign banks to take up to 25 percent of Mexico’s banking market and allows foreign brokerages to take 30 percent of the securities business by 2004, after which all restrictions are to be eliminated.\nThe dishonesty of the “free trade agreements are not free trade” argument is readily apparent in the way in which the free trade arguments oppose adding new tariffs, raising tariff rates, or reducing immigration on the basis of their free trade doctrine while simultaneously attempting to claim that no amount of eliminated tariffs, reduced tariff rates, or increased immigration can be considered free trade.  They’re claiming that the protectionist pros and cons can be judged on a graduated basis, but the pros and cons of free trade cannot be.  This is not only dishonest, but is obviously absurd, since the benefits of free trade cannot magically arrive all at once with the Traders’ Paradise if the costs of protectionism appear piecemeal.\nNAFTA is not an entirely free trade agreement, but it is an agreement to engage in freer trade, it has in fact led to freer trade, and as such, it serves perfectly well as an example of the failure of free trade doctrine.  I note that in all the denials of connection between NAFTA, GATT, and other free trade agreements and genuine free trade, very few free trade advocates have come out and called for the cancellation of those agreements.  This is not to say that no free traders ever opposed NAFTA; it should come as no surprise that\nMurray Rothbard did\n.\nAnd on a mildly amusing tangential note, I’m not the only one who has noted Gary North’s inability to distinguish between related, but distinct concepts.\nAccording to Gary: “[Mises’s] disciple Murray Rothbard promoted 100% reserve banking. But, because he [Rothbard] opposed the existence of the state, his call for 100% reserves was not a call for legislation requiring 100% reserves.”\nMurray Rothbard of course opposed the state. But, according to Gary, Murray would therefore have to oppose all legislation or laws. Yet, clearly, Murray (as a libertarian, not an Austrian), favored laws against murder, rape, etc. In his view, they would be implemented not by the government, but by private defense agencies. It is a misconstrual of free market anarchism to say that advocates of this philosophy oppose all laws. Au contraire: We are supporters of proper law, i.e., laws upholding individual rights and private property. Indeed, our criticism of the government is that it violates such proper law.\nAnd finally, a member of the Dread Ilk has published\na book on Round One\n.  No doubt Nate will want to check it out.",
  "tags": [
    "mailvox"
  ],
  "categories": [],
  "sitemap_lastmod": "2012-06-28T08:40:00+00:00"
}