{
  "url": "https://voxday.net/2012/06/20/mmr-causes-autism-again/",
  "scraped_at": "2025-12-14T04:57:05.548615",
  "title": "MMR caused this case of autism",
  "date_display": "June 20, 2012",
  "date_iso": "2012-06-20T12:40:00+00:00",
  "date_from_url": "2012-06-20",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>Ever notice that science fetishists love to point to the courts when it suits them, then quickly reverse course and point out that that the law isn’t science <a href=\"http://www.dailymail.co.uk/news/article-2160054/MMR-A-mothers-victory-The-vast-majority-doctors-say-link-triple-jab-autism-Italian-court-case-reignite-controversial-debate.html\">when it doesn’t</a>?</p><blockquote><p> At nine months old, Valentino Bocca was as bright as a button. In a favourite family photo, taken by his father, the baby boy wriggles in his mother’s arms and laughs for the camera. His parents look at the precious picture often these days. It is a reminder of their only son before they took him on a sunny morning to the local public health clinic for a routine childhood vaccination.</p><p>Valentino was never the same child after the jab in his arm. He developed autism and, in a landmark judgment, a judge has ruled that his devastating disability was provoked by the inoculation against measles, mumps and rubella (MMR).<br> The case of Valentino Bocca age nine from Rimini Italy has reignited the debate over a possible link between the MMR and autism after a judge ruled his disability was provoked by the jab.</br></p><p>The judgment in a provincial Italian court challenges the settled view of the majority of the medical profession — and could have profound implications in Britain and across the world.  Valentino’s parents, Antonella, 44, and Maurizio, 43, have been awarded £140,000, to be paid by Italy’s Ministry of Health and they plan a civil action against the Italian government that may get them £800,000 more….  The judge’s view has since been endorsed by Italy’s High Court of Law (the equivalent of our Supreme Court) which ruled that the Italian government must pay compensation to children damaged by any jabs given under the Ministry of Health auspices — even if they are not compulsory ones.</p></blockquote><p>The problem faced by the pro-vaccine camp is twofold.  First, what passes for the science on this issue is dreadful and really should not be described as science.  The same scientific community that didn’t hesitate to give syphilis to black men and performed experiments on Jewish concentration camp internees is suddenly claiming that it would be terribly <i>unethical</i> to allow children to remain unvaccinated or even push back the vaccine schedule a few months in order to gather meaningful scientific evidence on the safety of vaccines and the vaccine schedule.  Statistical surveys of populations are not proper science, and furthermore, have absolutely nothing to do with whether one individual will be negatively affected by a vaccine or not.</p><p>The constant bleating that “no scientific evidence of a link between the MMR vaccine and autism” has been found is so irrelevant and misleading as to be dishonest.  I doubt there is any scientific evidence between a punch in the nose and death either, but there is no question that people have been killed by a single punch before because people have seen it happen.  For some reason, the process of simple observation that everyone believes is perfectly reliable when one person punches another in the face suddenly becomes not only unreliable, but downright anti-scientific when one person injects various foreign substances into a child.  I have personally witnessed an infant scream and immediately collapse into unconsciousness when given a shot, and I absolutely defy any moronic scientist to claim it was not the result of the vaccine being administered.  Fortunately, there were no ill effects apparent after the infant regained consciousness, but after witnessing that, I would no sooner permit any child of mine to be vaccinated at such a young age than I would permit someone to hit me in the head with a hammer… no matter how many statistical surveys are presented by scientists claiming that there is no scientific evidence showing any link between being hit in the head with a hammer and autism.</p><p>Second, the legal standard is “beyond a reasonable degree of doubt”.  And it is well beyond a reasonable degree of doubt that certain vaccines have caused autism in some children.  Very few vaccine skeptics are saying that no children can be vaccinated against anything or that all vaccines are intrinsically evil – although the whole fetal tissue thing on which some vaccines are based is, quite clearly, evil on its face – but most parents are not complete idiots incapable of recognizing when their normal child suddenly loses speech and motor abilities that it previously possessed, or linking it to probable causes.  In fact, the awareness that vaccines are, beyond any reasonable degree of doubt, responsible for autism and other damage is precisely why Congress passed a law removing vaccine makers and administrators from legal liability.</p><p>It is far beyond the current state of biological science to claim one particular administration of a vaccine did not cause one specific case of autism and any honest scientist would admit it.  Can you imagine if other culpable parties began to try defending themselves using the “no scientific link” defense?  Science simply doesn’t work that way, especially “science” that is nothing more than statistical analysis, and those who attempt to appeal to science in such fashion are guilty of dishonesty, empty propaganda, and the abuse of science.</p><p>Anyhow, this is a welcome outcome and I hope that the threat of being financially ruined by their victims will force Big Pharma to spend more effort in improving the safety of their products than in lobbying the various governments to mandate more vaccines and providing them with additional protection from liability.  Science is not the law, nor should it ever be confused for it.  We don’t need scientists to determine if a specific vaccine has harmed a specific individual any more than we need them to determine if a specific individual has robbed a specific bank, in fact, scientists should not be involved in the legal discussion at all given their shoddy faux-science and oft-demonstrated biases on the matter.</p></div>",
  "content_text": "Ever notice that science fetishists love to point to the courts when it suits them, then quickly reverse course and point out that that the law isn’t science\nwhen it doesn’t\n?\nAt nine months old, Valentino Bocca was as bright as a button. In a favourite family photo, taken by his father, the baby boy wriggles in his mother’s arms and laughs for the camera. His parents look at the precious picture often these days. It is a reminder of their only son before they took him on a sunny morning to the local public health clinic for a routine childhood vaccination.\nValentino was never the same child after the jab in his arm. He developed autism and, in a landmark judgment, a judge has ruled that his devastating disability was provoked by the inoculation against measles, mumps and rubella (MMR).\nThe case of Valentino Bocca age nine from Rimini Italy has reignited the debate over a possible link between the MMR and autism after a judge ruled his disability was provoked by the jab.\nThe judgment in a provincial Italian court challenges the settled view of the majority of the medical profession — and could have profound implications in Britain and across the world.  Valentino’s parents, Antonella, 44, and Maurizio, 43, have been awarded £140,000, to be paid by Italy’s Ministry of Health and they plan a civil action against the Italian government that may get them £800,000 more….  The judge’s view has since been endorsed by Italy’s High Court of Law (the equivalent of our Supreme Court) which ruled that the Italian government must pay compensation to children damaged by any jabs given under the Ministry of Health auspices — even if they are not compulsory ones.\nThe problem faced by the pro-vaccine camp is twofold.  First, what passes for the science on this issue is dreadful and really should not be described as science.  The same scientific community that didn’t hesitate to give syphilis to black men and performed experiments on Jewish concentration camp internees is suddenly claiming that it would be terribly\nunethical\nto allow children to remain unvaccinated or even push back the vaccine schedule a few months in order to gather meaningful scientific evidence on the safety of vaccines and the vaccine schedule.  Statistical surveys of populations are not proper science, and furthermore, have absolutely nothing to do with whether one individual will be negatively affected by a vaccine or not.\nThe constant bleating that “no scientific evidence of a link between the MMR vaccine and autism” has been found is so irrelevant and misleading as to be dishonest.  I doubt there is any scientific evidence between a punch in the nose and death either, but there is no question that people have been killed by a single punch before because people have seen it happen.  For some reason, the process of simple observation that everyone believes is perfectly reliable when one person punches another in the face suddenly becomes not only unreliable, but downright anti-scientific when one person injects various foreign substances into a child.  I have personally witnessed an infant scream and immediately collapse into unconsciousness when given a shot, and I absolutely defy any moronic scientist to claim it was not the result of the vaccine being administered.  Fortunately, there were no ill effects apparent after the infant regained consciousness, but after witnessing that, I would no sooner permit any child of mine to be vaccinated at such a young age than I would permit someone to hit me in the head with a hammer… no matter how many statistical surveys are presented by scientists claiming that there is no scientific evidence showing any link between being hit in the head with a hammer and autism.\nSecond, the legal standard is “beyond a reasonable degree of doubt”.  And it is well beyond a reasonable degree of doubt that certain vaccines have caused autism in some children.  Very few vaccine skeptics are saying that no children can be vaccinated against anything or that all vaccines are intrinsically evil – although the whole fetal tissue thing on which some vaccines are based is, quite clearly, evil on its face – but most parents are not complete idiots incapable of recognizing when their normal child suddenly loses speech and motor abilities that it previously possessed, or linking it to probable causes.  In fact, the awareness that vaccines are, beyond any reasonable degree of doubt, responsible for autism and other damage is precisely why Congress passed a law removing vaccine makers and administrators from legal liability.\nIt is far beyond the current state of biological science to claim one particular administration of a vaccine did not cause one specific case of autism and any honest scientist would admit it.  Can you imagine if other culpable parties began to try defending themselves using the “no scientific link” defense?  Science simply doesn’t work that way, especially “science” that is nothing more than statistical analysis, and those who attempt to appeal to science in such fashion are guilty of dishonesty, empty propaganda, and the abuse of science.\nAnyhow, this is a welcome outcome and I hope that the threat of being financially ruined by their victims will force Big Pharma to spend more effort in improving the safety of their products than in lobbying the various governments to mandate more vaccines and providing them with additional protection from liability.  Science is not the law, nor should it ever be confused for it.  We don’t need scientists to determine if a specific vaccine has harmed a specific individual any more than we need them to determine if a specific individual has robbed a specific bank, in fact, scientists should not be involved in the legal discussion at all given their shoddy faux-science and oft-demonstrated biases on the matter.",
  "tags": [
    "law",
    "science"
  ],
  "categories": [],
  "sitemap_lastmod": "2012-06-20T11:40:00+00:00"
}