{
  "url": "https://voxday.net/2012/06/02/neocon-occupied-territory/",
  "scraped_at": "2025-12-14T04:55:51.684648",
  "title": "Neocon-occupied territory",
  "date_display": "June 2, 2012",
  "date_iso": "2012-06-02T13:39:00+00:00",
  "date_from_url": "2012-06-02",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>You don’t have to take my word for it.  Or Pat Buchanan’s, for that matter.  That’s Bill Kristol’s position concerning the Republican Party and <a href=\"http://takimag.com/article/how_bill_kristol_purged_the_arabists_patrick_buchanan\">he’s proud of it</a>:</p><blockquote><p> “The big story in the Republican Party over the last 30 years, and I’m very happy about this,” said Kristol, is the “eclipsing” of the George H.W. Bush-James Baker-Brent Scowcroft realists, “an Arabist old-fashioned Republican Party … very concerned about relations with Arab states that were not friendly with Israel … .”</p><p>That Bush crowd is yesterday, said Kristol. And not only had the “Arabists” like President Bush been shoved aside by the neocons, the “Pat Buchanan/Ron Paul type” of Republican has been purged.  “At B’nai Jeshurun,” writes Weiss, “Kristol admitted to playing a role in expelling members of the Republican Party he does not agree with.” These are Republicans you had to “repudiate,” said Kristol, people “of whom I disapprove so much that I won’t appear with them.”</p><p>“I’ve encouraged that they be expelled or not welcomed into the Republican Party. I’d be happy if Ron Paul left. I was very happy when Pat Buchanan was allowed—really encouraged … by George Bush … to go off and run as a third-party candidate.”</p><p>Kristol’s point: Refuse to toe the neo-con line on Israel, and you have no future in the Republican Party.</p></blockquote><p>Since I’m not a Republican, I’m not terribly concerned that it happens to be under the influence of big government neocons instead of big government pseudo-conservatives.  It’s probably all for the better, in fact, as monomaniacal lunatics like Kristol will always overreach themselves and sow the seeds of their own destruction.  It’s fairly apparent that the Republican Party has essentially become the Democratic Party of thirty years ago.  But I think there are a lot of grass roots Republicans who would be surprised at the idea that both Ron Paul and Pat Buchanan should be purged from the Republican Party in the name of an Israel Über Alles foreign policy.</p><p>Kristol’s crowing is a little ironic these days, as Jewish congressmen are beginning to learn that the third world immigrants they have championed in their effort to strengthen America through diversity and vibrancy <a href=\"http://blog.nj.com/dr_aref_assaf/2012/05/congressman_pascrell_is_best_for_new_jersey.html\">tend to be unimpressed</a> by boasts about how much money they have helped funnel to Israel.  Given the demographic patterns, it wouldn’t be surprising to see the Israel lobby lose control of the Democrats even as they exercise greater influence over Republicans.  Christians of European descent can be convinced to support Israel through Christian Zionism or Holocaust guilt, but it’s a little tougher to play those cards with atheists, Muslims, Africans, Hispanics, and Asians.</p><p>I wonder what Kristol’s reaction would be if the Republicans decided to expel him and other neocons like him instead?</p></div>",
  "content_text": "You don’t have to take my word for it.  Or Pat Buchanan’s, for that matter.  That’s Bill Kristol’s position concerning the Republican Party and\nhe’s proud of it\n:\n“The big story in the Republican Party over the last 30 years, and I’m very happy about this,” said Kristol, is the “eclipsing” of the George H.W. Bush-James Baker-Brent Scowcroft realists, “an Arabist old-fashioned Republican Party … very concerned about relations with Arab states that were not friendly with Israel … .”\nThat Bush crowd is yesterday, said Kristol. And not only had the “Arabists” like President Bush been shoved aside by the neocons, the “Pat Buchanan/Ron Paul type” of Republican has been purged.  “At B’nai Jeshurun,” writes Weiss, “Kristol admitted to playing a role in expelling members of the Republican Party he does not agree with.” These are Republicans you had to “repudiate,” said Kristol, people “of whom I disapprove so much that I won’t appear with them.”\n“I’ve encouraged that they be expelled or not welcomed into the Republican Party. I’d be happy if Ron Paul left. I was very happy when Pat Buchanan was allowed—really encouraged … by George Bush … to go off and run as a third-party candidate.”\nKristol’s point: Refuse to toe the neo-con line on Israel, and you have no future in the Republican Party.\nSince I’m not a Republican, I’m not terribly concerned that it happens to be under the influence of big government neocons instead of big government pseudo-conservatives.  It’s probably all for the better, in fact, as monomaniacal lunatics like Kristol will always overreach themselves and sow the seeds of their own destruction.  It’s fairly apparent that the Republican Party has essentially become the Democratic Party of thirty years ago.  But I think there are a lot of grass roots Republicans who would be surprised at the idea that both Ron Paul and Pat Buchanan should be purged from the Republican Party in the name of an Israel Über Alles foreign policy.\nKristol’s crowing is a little ironic these days, as Jewish congressmen are beginning to learn that the third world immigrants they have championed in their effort to strengthen America through diversity and vibrancy\ntend to be unimpressed\nby boasts about how much money they have helped funnel to Israel.  Given the demographic patterns, it wouldn’t be surprising to see the Israel lobby lose control of the Democrats even as they exercise greater influence over Republicans.  Christians of European descent can be convinced to support Israel through Christian Zionism or Holocaust guilt, but it’s a little tougher to play those cards with atheists, Muslims, Africans, Hispanics, and Asians.\nI wonder what Kristol’s reaction would be if the Republicans decided to expel him and other neocons like him instead?",
  "tags": [
    "politics",
    "Vibrancy is our strength"
  ],
  "categories": [],
  "sitemap_lastmod": "2012-06-02T12:39:00+00:00"
}