{
  "url": "https://voxday.net/2012/06/28/obama-wins/",
  "scraped_at": "2025-12-14T04:57:45.901264",
  "title": "Supreme Court: Obamacare is constitutional",
  "date_display": "June 28, 2012",
  "date_iso": "2012-06-28T14:14:00+00:00",
  "date_from_url": "2012-06-28",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>This is <a href=\"http://www.scotusblog.com/cover-it-live/\">the first Scotusblog take</a>: <i>“So the mandate is constitutional. Chief Justice Roberts joins the left of the Court….  The bottom line: the entire ACA is upheld, with the exception that the federal government’s power to terminate states’ Medicaid funds is narrowly read.”</i></p><p>People are still reading the opinion, but it would appear that the Court did its usual trick of admitting that the law is unconstitutional on its face, but finding a way of allowing it to come into force anyhow.  And the support of the Bush-appointed Roberts for Obamacare demonstrates the complete absurdity of appealing to the Supreme Court to justify voting for Republican presidents.  After nearly 40 years of this, you’d think Charlie Brown would realize that Lucy is never going to hold the football no matter what she says.</p><p>UPDATE: Bingo. <i>“The Court holds that the mandate violates the Commerce Clause, but that doesn’t matter b/c there are five votes for the mandate to be constitutional under the taxing power.”</i></p><p>UPDATE 2: <i>In Plain English: The Affordable Care Act, including its individual mandate that virtually all Americans buy health insurance, is constitutional. There were not five votes to uphold it on the ground that Congress could use its power to regulate commerce between the states to require everyone to buy health insurance. However, five Justices agreed that the penalty that someone must pay if he refuses to buy insurance is a kind of tax that Congress can impose using its taxing power. That is all that matters. Because the mandate survives, the Court did not need to decide what other parts of the statute were constitutional, except for a provision that required states to comply with new eligibility requirements for Medicaid or risk losing their funding. On that question, the Court held that the provision is constitutional as long as states would only lose new funds if they didn’t comply with the new requirements, rather than all of their funding…. to answer a common question, the whole ACA is constitutional, so the provision requiring insurers to cover young adults until they are 26 survives as well. </i></p></div>",
  "content_text": "This is\nthe first Scotusblog take\n:\n“So the mandate is constitutional. Chief Justice Roberts joins the left of the Court….  The bottom line: the entire ACA is upheld, with the exception that the federal government’s power to terminate states’ Medicaid funds is narrowly read.”\nPeople are still reading the opinion, but it would appear that the Court did its usual trick of admitting that the law is unconstitutional on its face, but finding a way of allowing it to come into force anyhow.  And the support of the Bush-appointed Roberts for Obamacare demonstrates the complete absurdity of appealing to the Supreme Court to justify voting for Republican presidents.  After nearly 40 years of this, you’d think Charlie Brown would realize that Lucy is never going to hold the football no matter what she says.\nUPDATE: Bingo.\n“The Court holds that the mandate violates the Commerce Clause, but that doesn’t matter b/c there are five votes for the mandate to be constitutional under the taxing power.”\nUPDATE 2:\nIn Plain English: The Affordable Care Act, including its individual mandate that virtually all Americans buy health insurance, is constitutional. There were not five votes to uphold it on the ground that Congress could use its power to regulate commerce between the states to require everyone to buy health insurance. However, five Justices agreed that the penalty that someone must pay if he refuses to buy insurance is a kind of tax that Congress can impose using its taxing power. That is all that matters. Because the mandate survives, the Court did not need to decide what other parts of the statute were constitutional, except for a provision that required states to comply with new eligibility requirements for Medicaid or risk losing their funding. On that question, the Court held that the provision is constitutional as long as states would only lose new funds if they didn’t comply with the new requirements, rather than all of their funding…. to answer a common question, the whole ACA is constitutional, so the provision requiring insurers to cover young adults until they are 26 survives as well.",
  "tags": [
    "law"
  ],
  "categories": [],
  "sitemap_lastmod": "2012-06-28T13:14:00+00:00"
}