{
  "url": "https://voxday.net/2012/06/12/of-bailouts-and-bullet-biting/",
  "scraped_at": "2025-12-14T04:56:30.250797",
  "title": "Of bailouts and bullet- biting",
  "date_display": "June 12, 2012",
  "date_iso": "2012-06-12T11:45:00+00:00",
  "date_from_url": "2012-06-12",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>It may be illuminating to compare what I wrote in RGD to the various ways countries mentioned in it have responded to the debt crisis.  Consider the following quote from the book:</p><p><i>“According to Austrian theory, the effects of the housing bust on the overall economy should be much greater in countries like Estonia, Spain, and Ireland than in Austria, Germany, and Poland, and to the extent that inexpensive debt was made available to that and other sectors of the economy, we would expect to see that signs of the resulting economic contraction are similarly greater as well. Therefore we should see unemployment rising faster, prices falling further, GDP contracting more, and government deficits growing larger in the three housing boom countries than in the three non-boom ones.”</i></p><p>From today’s NYT on <a href=\"http://www.nytimes.com/2012/06/12/opinion/now-spain.html?_r=1&amp;hp\">the Spanish bank bailout</a>:</p><blockquote><p> Two weeks after Prime Minister Mariano Rajoy of Spain vowed “there will be no Spanish banking rescue,” and after days of delay in which Mr. Rajoy pressed European officials for sounder rescue terms, Spain has now joined Greece, Ireland and Portugal as the latest bailout recipient. Catastrophe averted? Hardly.</p></blockquote><p>Spain, check.  Ireland, check.  But no Estonia?  What happened there?  Why hasn’t Estonia required a bank bailout?  The answer can be found in <a href=\"http://www.bloomberg.com/news/2012-06-01/estonia-s-rating-affirmed-by-fitch-amid-economic-recovery-1-.html\">the rationale given</a> by Fitch Ratings decision to affirm the little country’s credit rating.</p><p><i>“The rating decision reflects “the country’s near seamless transition to full membership of the euro zone starting on 1 January 2011, coupled with a more balanced economic recovery and the continued deleveraging of the private sector”….  Estonia was the only euro-area member to report budget surpluses for the last two years and had the lowest public debt among the region’s 17 members in 2011 at 6 percent of gross domestic product.”</i></p><p>Translation: Estonia is the only one of the three housing boom countries I noted in RGD that chose to bite the bullet and accept economic contraction and debt default rather than attempt to put off dealing with it in the interest of its banking sector.  As even Paul Krugman <a href=\"http://krugman.blogs.nytimes.com/2012/06/06/estonian-rhapsdoy/\">has begrudgingly noted</a>, they’ve hit bottom and are now in an ongoing process of recovery.  But first they took a 20 percent hit to GDP, which is very much in line with what I said would have to be the case in RGD.  All the multiple bailouts in Europe and the USA have accomplished is ensure that the trough will have to be bigger and deeper in the end.</p></div>",
  "content_text": "It may be illuminating to compare what I wrote in RGD to the various ways countries mentioned in it have responded to the debt crisis.  Consider the following quote from the book:\n“According to Austrian theory, the effects of the housing bust on the overall economy should be much greater in countries like Estonia, Spain, and Ireland than in Austria, Germany, and Poland, and to the extent that inexpensive debt was made available to that and other sectors of the economy, we would expect to see that signs of the resulting economic contraction are similarly greater as well. Therefore we should see unemployment rising faster, prices falling further, GDP contracting more, and government deficits growing larger in the three housing boom countries than in the three non-boom ones.”\nFrom today’s NYT on\nthe Spanish bank bailout\n:\nTwo weeks after Prime Minister Mariano Rajoy of Spain vowed “there will be no Spanish banking rescue,” and after days of delay in which Mr. Rajoy pressed European officials for sounder rescue terms, Spain has now joined Greece, Ireland and Portugal as the latest bailout recipient. Catastrophe averted? Hardly.\nSpain, check.  Ireland, check.  But no Estonia?  What happened there?  Why hasn’t Estonia required a bank bailout?  The answer can be found in\nthe rationale given\nby Fitch Ratings decision to affirm the little country’s credit rating.\n“The rating decision reflects “the country’s near seamless transition to full membership of the euro zone starting on 1 January 2011, coupled with a more balanced economic recovery and the continued deleveraging of the private sector”….  Estonia was the only euro-area member to report budget surpluses for the last two years and had the lowest public debt among the region’s 17 members in 2011 at 6 percent of gross domestic product.”\nTranslation: Estonia is the only one of the three housing boom countries I noted in RGD that chose to bite the bullet and accept economic contraction and debt default rather than attempt to put off dealing with it in the interest of its banking sector.  As even Paul Krugman\nhas begrudgingly noted\n, they’ve hit bottom and are now in an ongoing process of recovery.  But first they took a 20 percent hit to GDP, which is very much in line with what I said would have to be the case in RGD.  All the multiple bailouts in Europe and the USA have accomplished is ensure that the trough will have to be bigger and deeper in the end.",
  "tags": [
    "economics",
    "RGD"
  ],
  "categories": [],
  "sitemap_lastmod": "2012-06-12T10:45:00+00:00"
}