{
  "url": "https://voxday.net/2012/06/16/oh-relax-and-enjoy-it-kate/",
  "scraped_at": "2025-12-14T04:56:51.888716",
  "title": "Oh, relax and enjoy it, Kate",
  "date_display": "June 16, 2012",
  "date_iso": "2012-06-16T12:55:00+00:00",
  "date_from_url": "2012-06-16",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>One of the things I find remarkable is the readiness of outspoken feminist women <a href=\"http://kateordie.tumblr.com/post/24988635952/sometimes-i-have-the-time-and-patience-to-get-from\">to crucify themselves with their own words</a>.  It’s as if they have absolutely no conception of the logical consequences of their ideas, and despite their confrontational tone, they appear to have no expectation that their position can or will be criticized.</p><p>Consider the following excerpts from the linked cartoon, which features a retarded form of Socratic dialogue between a cartoon figure and an even more cartoonish version of anti-feminist arguments.</p><blockquote><p> <i>It’s not fair that I have to be terrified when I go jogging after 6 PM or when I’m on the bus or going to get milk.</i></p><p>Then don’t go out alone at night.  That’s common sense.</p><p><i>That’s rape culture!  When you tell me it’s my responsibility not to get hurt, you take away the responsibility of a human being not to rape!</i></p><p>Why are we even talking about this?  I’m not a rapist.</p><p><i>Because it gets really fucking exhausting trying to believe in a future where I’m not treated like a crazy person for believing in <u>equality</u>!</i></p></blockquote><p>First of all, Kate being terrified of rape when she goes to get milk is her problem.  Some women are terrified of bats, others are afraid of heights, and those fears are no more your problem or my problem than Kate’s terror of rape on the milk run.  It is very, very easy for Kate to significantly reduce her chances of being raped, as getting a concealed carry permit and avoiding the company of black and Hispanic men will virtually eliminate the possibility that she will be forcibly raped.  Even without taking any such defensive measures, the national rate of forcible rape is only 24.7 per 100,000 population, one-third lower than it was in 1990.  This means that in a population of 308 million, Kate’s chances of being raped in any given year are less than one in 12,000 and declining.  This cannot be reasonably described as a “rape culture”.</p><p>If Kate genuinely lives in constant terror of a one in 12,000 risk, she is delusional and may be clinically paranoid.  And this doesn’t even begin to take into account that unless a woman is raped at home by someone breaking into her residence, it is very difficult for a woman to get raped without her not only contributing to the situation, but contributing <i>significantly</i> to it.  And yes, in such situations, that does make the victim at least partially culpable from a legal perspective.  If you don’t understand that, try looking at it this way.  If insurance companies sold rape insurance, are there any behaviors that would conceivably increase or decrease the premium?</p><p>Furthermore, Kate is quite obviously crazy.  If she had said “it gets really fucking exhausting trying to believe in a future where I’m not treated like a crazy person for believing in rainbow-tailed unicorns”, everyone would quite correctly conclude that she is a lunatic.  But there is no more evidence for equality than there is for rainbow-tailed unicorns.  Human equality simply doesn’t exist and it has never existed. As I have pointed out before, both logic and genetic science demonstrate that human beings are not even all equally human.  Her lunacy is further evidenced by her bizarre attempt to justify her broaching the topic with the non-rapist by an appeal to her own exhaustion.  That does not follow.  Moreover, it is apparent that Kate, by her own admission, doesn’t actually believe in equality anyway.  Consider her final rant:</p><p><b><i>So fuck ANYONE who thinks they have the right to tell me not to care!  FUCK THEM!  I do care.  I will always care.</i></b></p><p>Here Kate is expressly denying that others have the right to free speech, which is not only encoded into various legal systems but also happens to observably exist in a material manner, while simultaneously asserting the legitimacy of her attempt to believe in a future that is not only nonexistent, but improbable to the point of near impossibility. From which we are forced to conclude that she’s not only crazy, she’s outrageously stupid to boot.</p><p>The fundamentally nonsensical thing about her position is that she wants others to do what she will not.  If she can’t be bothered to put any effort into defending herself against rape, why should anyone else?  If it’s not her responsibility to act on something about which she professes to care so deeply, how could it possibly be mine, or anyone else’s, when we do not care in the slightest about her feelings or her fate.</p><p>Kate declares her opinion that angry posturing on behalf of nonexistent female rights is “hot as hell”.  Which is fine, I suppose, so long as she is hoping to attract angry, rancid feminist women.  But it certainly isn’t going to be attractive to men who have access to better options, such as Internet porn or voluntary chastity.</p><p>For further amusement, I highly recommend <a href=\"http://freethoughtblogs.com/pharyngula/2012/06/15/heres-the-situation/#comments\">the emotional posturing in which various Pharyngulans are engaging</a> as they attempt to demonstrate which one of them is the anti-rapiest of all.  Apparently the winner will be awarded a tiara carved from the horn of a pink unicorn by PZ Myers himself.  This was one of the finer examples of the intellectual fireworks on display:</p><blockquote><p> I can’t think of one, even one, precaution that a woman (or man) can take that actually has a good chance of preventing rape that would also be considered “reasonable” by any rational or honest individual….  And if you want to talk about “reasonable” precautions, I think, the first burden on you is to describe your proposed precaution and demonstrate that it actually works to prevent rape.</p></blockquote><p>This total inability of humanity to prevent any rape no doubt explains why rape rates never change over time and do not vary from one nation to another.  It is a very strange belief system indeed where human action can modify the global climate, but rape is random, inevitable, and completely immune to human action.  Of course, it would be deplorably raciss to notice that a 31 percent increase in the number of incarcerated black men, mostly for harmless drug charges, has corresponded with the 33 percent decline in forcible rapes per 100,000, from 41.2 in 1990 to 27.5 in 2010.</p></div>",
  "content_text": "One of the things I find remarkable is the readiness of outspoken feminist women\nto crucify themselves with their own words\n.  It’s as if they have absolutely no conception of the logical consequences of their ideas, and despite their confrontational tone, they appear to have no expectation that their position can or will be criticized.\nConsider the following excerpts from the linked cartoon, which features a retarded form of Socratic dialogue between a cartoon figure and an even more cartoonish version of anti-feminist arguments.\nIt’s not fair that I have to be terrified when I go jogging after 6 PM or when I’m on the bus or going to get milk.\nThen don’t go out alone at night.  That’s common sense.\nThat’s rape culture!  When you tell me it’s my responsibility not to get hurt, you take away the responsibility of a human being not to rape!\nWhy are we even talking about this?  I’m not a rapist.\nBecause it gets really fucking exhausting trying to believe in a future where I’m not treated like a crazy person for believing in\nequality\n!\nFirst of all, Kate being terrified of rape when she goes to get milk is her problem.  Some women are terrified of bats, others are afraid of heights, and those fears are no more your problem or my problem than Kate’s terror of rape on the milk run.  It is very, very easy for Kate to significantly reduce her chances of being raped, as getting a concealed carry permit and avoiding the company of black and Hispanic men will virtually eliminate the possibility that she will be forcibly raped.  Even without taking any such defensive measures, the national rate of forcible rape is only 24.7 per 100,000 population, one-third lower than it was in 1990.  This means that in a population of 308 million, Kate’s chances of being raped in any given year are less than one in 12,000 and declining.  This cannot be reasonably described as a “rape culture”.\nIf Kate genuinely lives in constant terror of a one in 12,000 risk, she is delusional and may be clinically paranoid.  And this doesn’t even begin to take into account that unless a woman is raped at home by someone breaking into her residence, it is very difficult for a woman to get raped without her not only contributing to the situation, but contributing\nsignificantly\nto it.  And yes, in such situations, that does make the victim at least partially culpable from a legal perspective.  If you don’t understand that, try looking at it this way.  If insurance companies sold rape insurance, are there any behaviors that would conceivably increase or decrease the premium?\nFurthermore, Kate is quite obviously crazy.  If she had said “it gets really fucking exhausting trying to believe in a future where I’m not treated like a crazy person for believing in rainbow-tailed unicorns”, everyone would quite correctly conclude that she is a lunatic.  But there is no more evidence for equality than there is for rainbow-tailed unicorns.  Human equality simply doesn’t exist and it has never existed. As I have pointed out before, both logic and genetic science demonstrate that human beings are not even all equally human.  Her lunacy is further evidenced by her bizarre attempt to justify her broaching the topic with the non-rapist by an appeal to her own exhaustion.  That does not follow.  Moreover, it is apparent that Kate, by her own admission, doesn’t actually believe in equality anyway.  Consider her final rant:\nSo fuck ANYONE who thinks they have the right to tell me not to care!  FUCK THEM!  I do care.  I will always care.\nHere Kate is expressly denying that others have the right to free speech, which is not only encoded into various legal systems but also happens to observably exist in a material manner, while simultaneously asserting the legitimacy of her attempt to believe in a future that is not only nonexistent, but improbable to the point of near impossibility. From which we are forced to conclude that she’s not only crazy, she’s outrageously stupid to boot.\nThe fundamentally nonsensical thing about her position is that she wants others to do what she will not.  If she can’t be bothered to put any effort into defending herself against rape, why should anyone else?  If it’s not her responsibility to act on something about which she professes to care so deeply, how could it possibly be mine, or anyone else’s, when we do not care in the slightest about her feelings or her fate.\nKate declares her opinion that angry posturing on behalf of nonexistent female rights is “hot as hell”.  Which is fine, I suppose, so long as she is hoping to attract angry, rancid feminist women.  But it certainly isn’t going to be attractive to men who have access to better options, such as Internet porn or voluntary chastity.\nFor further amusement, I highly recommend\nthe emotional posturing in which various Pharyngulans are engaging\nas they attempt to demonstrate which one of them is the anti-rapiest of all.  Apparently the winner will be awarded a tiara carved from the horn of a pink unicorn by PZ Myers himself.  This was one of the finer examples of the intellectual fireworks on display:\nI can’t think of one, even one, precaution that a woman (or man) can take that actually has a good chance of preventing rape that would also be considered “reasonable” by any rational or honest individual….  And if you want to talk about “reasonable” precautions, I think, the first burden on you is to describe your proposed precaution and demonstrate that it actually works to prevent rape.\nThis total inability of humanity to prevent any rape no doubt explains why rape rates never change over time and do not vary from one nation to another.  It is a very strange belief system indeed where human action can modify the global climate, but rape is random, inevitable, and completely immune to human action.  Of course, it would be deplorably raciss to notice that a 31 percent increase in the number of incarcerated black men, mostly for harmless drug charges, has corresponded with the 33 percent decline in forcible rapes per 100,000, from 41.2 in 1990 to 27.5 in 2010.",
  "tags": [
    "trainwreck",
    "women"
  ],
  "categories": [],
  "sitemap_lastmod": "2012-06-16T11:55:00+00:00"
}