{
  "url": "https://voxday.net/2012/06/21/on-bridesmaids/",
  "scraped_at": "2025-12-14T04:57:12.847409",
  "title": "On Bridesmaids",
  "date_display": "June 21, 2012",
  "date_iso": "2012-06-21T13:00:00+00:00",
  "date_from_url": "2012-06-21",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>For those of you who find the free trade discussion to be too esoteric, this might be a little more to your taste.  I watched the movie last night.  It mostly sucked, although not completely, and it did have the occasional, mildly amusing moment.  I actually quite like Kristen Wiig, but she’s much better in smaller doses as her little trick of smiling, passive-aggressive, low-key argument becomes less and less amusing as the movie slogs on.  Even the title is misleading, as at least two of the bridesmaids could have been cut out of the movie without anyone noticing and the tedious airplane scene is the longest and least entertaining travel piece since Tyrion Lannister floated along the river in <i>A Dance with Dragons.</i></p><p>It was basically one step above the usual SNL star goes to the movies, but if we are to accept that it is “the female answer to <i>The Hangover</i>“, then it usefully serves as definitive proof that women are simply not funny.  To put it in perspective, the ESPN commentary by Cotton and Pepper in <i>Dodgeball</i> alone is funnier than the entire <i>Bridesmaids</i> movie and it is an absolute travesty to even mention <i>Bridesmaids</i> in the same paragraph as <i>The Hangover</i>.  In fact, I’m sorely tempted to write a post criticizing myself for doing that here.</p><p>It doesn’t surprise me that the critics ratings are so much higher than the audience ratings.  This is a movie you must find funny, hein?  Equality and social progress demand it!  But it just isn’t.</p></div>",
  "content_text": "For those of you who find the free trade discussion to be too esoteric, this might be a little more to your taste.  I watched the movie last night.  It mostly sucked, although not completely, and it did have the occasional, mildly amusing moment.  I actually quite like Kristen Wiig, but she’s much better in smaller doses as her little trick of smiling, passive-aggressive, low-key argument becomes less and less amusing as the movie slogs on.  Even the title is misleading, as at least two of the bridesmaids could have been cut out of the movie without anyone noticing and the tedious airplane scene is the longest and least entertaining travel piece since Tyrion Lannister floated along the river in\nA Dance with Dragons.\nIt was basically one step above the usual SNL star goes to the movies, but if we are to accept that it is “the female answer to\nThe Hangover\n“, then it usefully serves as definitive proof that women are simply not funny.  To put it in perspective, the ESPN commentary by Cotton and Pepper in\nDodgeball\nalone is funnier than the entire\nBridesmaids\nmovie and it is an absolute travesty to even mention\nBridesmaids\nin the same paragraph as\nThe Hangover\n.  In fact, I’m sorely tempted to write a post criticizing myself for doing that here.\nIt doesn’t surprise me that the critics ratings are so much higher than the audience ratings.  This is a movie you must find funny, hein?  Equality and social progress demand it!  But it just isn’t.",
  "tags": [
    "movies"
  ],
  "categories": [],
  "sitemap_lastmod": "2012-06-21T12:00:00+00:00"
}