{
  "url": "https://voxday.net/2012/06/19/pat-buchanan-vs-gary-nor/",
  "scraped_at": "2025-12-14T04:57:00.966601",
  "title": "An Austrian case against free trade",
  "date_display": "June 19, 2012",
  "date_iso": "2012-06-19T09:32:00+00:00",
  "date_from_url": "2012-06-19",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>Not long ago, Gary North wrote a column with some rather incendiary claims entitled “<a href=\"http://lewrockwell.com/north/north1153.html\">Free Trade: The Litmus Test of Economics</a>“.  In it, he relied on the 18th century arguments of David Hume and Adam Smith, both of which have been refuted by me, Ian Fletcher, and numerous other skeptics of free trade.  Is our skepticism based on what North calls “trust in state power”?  Is it really “faith in the economic productivity of men with badges and guns”?</p><p>Of course not.  One of the interesting things about myopic free traders like North is that they stubbornly refuse to pay any attention to economic history or the observable consequences of their logic when it is tested by real world application.  This is why they are constantly retreating to oft-refuted arguments that are more than 200 years old rather than attempting to defend their position on the basis of the post-NAFTA performance of the US economy or the economic state of the European common market now known as the European Union.</p><p>As an aside, I note that the European Union is one of the most fascistic, illiberal, intrusive, and centralized state powers in the world and it was largely constructed upon free trade-based arguments.  Contrast North’s superficial and outdated polemic with <a href=\"http://www.wnd.com/2012/06/we-need-more-economic-nationalists/\">Pat Buchanan’s WND column</a> today which observes some very recent results of the latest experiment in free trade.<br/></p><blockquote><p> “The entry into force of the U.S.-Korea trade agreement on March 15, 2012, means countless new opportunities for U.S. exporters to sell more made-in-America goods, services and agricultural products to Korean customers – and to support more good jobs here at home.”</p><p>Thus did the Office of the U.S. Trade Representative rhapsodize about the potential of our new trade treaty with South Korea.  And how has it worked out for Uncle Sam?  Well, courtesy of Martin Crutsinger of the Associated Press, the trade figures are in for April, the first full month under the trade deal with South Korea.</p><p>And, surprise! The U.S. trade deficit with Korea tripled in one month. Imports from South Korea jumped 15 percent to $5.5 billion in April, while U.S. exports to South Korea fell 12 percent to $3.7 billion. Suddenly, the U.S. trade deficit with Seoul surged to an annual rate of $22 billion.</p><p>Shades of NAFTA. When it passed in 1993, we had a $1.6 billion trade surplus with Mexico. By 2010, our trade deficit with Mexico had reached $61.6 billion.</p></blockquote><p>Verdict: Buchanan brutally kicks North’s ass.  North’s only response to this would be to celebrate the growing trade deficit because “the world is richer than it was in 1973”.  Regardless of whether that is true or not, the more relevant fact is that the United States of America is considerably poorer than it was in 1973, with lower wages, higher unemployment, and reduced net wealth.  While there is no question that North’s ideological heart is in the right place, his intellectual limitations in the field of economics become readily apparent when one sees how he praises Henry Hazlitt’s hapless attempt to justify free trade:</p><p><i>“Henry Hazlitt’s classic little book, Economics in One Lesson, so completely destroys the arguments of the tariff supporters that there is nothing left of their position; still they keep coming. For two centuries their position has been intellectually bankrupt; still they keep coming.”</i></p><p>I found this statement more than a little amusing, of course, because it was trivially easy to show how Hazlitt’s book not only fails to completely destroy the anti-free trade case, but is a remarkably incompetent argument when examined in detail.  I say this because I identified no less than 13 specific errors in his chapter on free trade in the <a href=\"http://www.milobookclub.com/2011/06/14/mailvox-hazlitt-international-trade-2/\">first </a>and <a href=\"http://www.milobookclub.com/2011/06/18/mailvox-hazlitt-international-trade_18/\">second parts</a> of the Hazlitt International Trade Challenge.  Like most conventional – if not mainstream – economists, North is handicapped by his failure to pay any attention to debt.  The following pair of charts show why North and other free traders feel their position is supported by the macroeconomic statistics, then show why their position is absolutely and utterly untenable.</p><p><a href=\"http://1.bp.blogspot.com/-QdP_ez0pJOE/T-BUc9izkpI/AAAAAAAAATY/0zeJxpC9xUg/s1600/Trade_1960-2010_A.png\" imageanchor=\"1\" style=\"clear: left; float: left; margin-bottom: 1em; margin-right: 1em;\"><img border=\"0\" decoding=\"async\" fetchpriority=\"high\" height=\"245\" src=\"http://www.milobookclub.com/wp-content/uploads/2012/06/Trade_1960-2010_A.png\" width=\"320\"/></a>This chart shows the free trade case.  Since 1960, the trade deficit has gone from +3.5 billion to -494.7 billion while GDP/Capita has grown from $2,935.49 to $47,790.09.  The growth in GDP has increased much faster than the population growth, therefore it appears to be obvious that the trade deficit is not only making the world richer, it is making the United States richer.  However, this does not tell the entire story.  As I mentioned previously, both the classical and the conventional free trade cases, like the Neo-Keynesian case for government intervention, completely fail to take debt into account.</p><p><a href=\"http://1.bp.blogspot.com/-bjAtcUauHeA/T-BVz4g_edI/AAAAAAAAATk/sGyyqE6umZA/s1600/Trade_1960-2010_B.png\" imageanchor=\"1\" style=\"clear: right; float: right; margin-bottom: 1em; margin-left: 1em;\"><noscript><img border=\"0\" decoding=\"async\" height=\"245\" src=\"http://www.milobookclub.com/wp-content/uploads/2012/06/Trade_1960-2010_B.png\" width=\"320\"/></noscript><img border=\"0\" class=\"lazyload\" data-src=\"http://www.milobookclub.com/wp-content/uploads/2012/06/Trade_1960-2010_B.png\" decoding=\"async\" height=\"245\" src=\"data:image/svg+xml,%3Csvg%20xmlns=%22http://www.w3.org/2000/svg%22%20viewBox=%220%200%20320%20245%22%3E%3C/svg%3E\" width=\"320\"/></a>Notice how adding the overall debt level of the economy completely changes the picture and makes it obvious how the trade deficit is impoverishing the USA despite the increase in GDP.  GDP that does not account for debt is a terrible measure of wealth and every bit as misleading as GDP that does not account for inflation, as it is nothing more than a metric intended to track national income.  Whereas per capita wealth, measured by GDP/capita – debt/capita was only -$1,417 in 1960, it has increased by two orders of magnitude to -$120,014.  Debt that could once be paid off in 17 months would now require 42 months.</p><p>The prosperity that North and others claim free trade has brought the USA is nothing but a mirage and is the simple result of Americans <i>borrowing</i> to buy those foreign goods and services with money they will have to pay back from a smaller industrial base competing against much more serious competitors than they faced 50 years ago.</p><p>The case for free trade was always logically flawed, and on the empirical level simply cannot survive the incorporation of debt into the equation, as the historical statistics clearly demonstrate the intrinsic falsity that was always apparent to the sufficiently careful economic analyst.  Free trade has not made the USA more wealthy, any more than buying giant houses with no-money down mortgages during the housing boom made those individuals who bought them rich.  It hardly amounts to “state worship” to note that debt is not wealth.  And it should be clear that by depriving the local consumers of their jobs and their ability to pay for imported goods and services, <i><b>free trade necessarily requires either a decline in living standards or a constantly increasing debt load</b></i> for countries on the red side of the trade deficit.</p><p>An so, as strange as it may sound, this observation points towards the legitimate possibility of developing the apparently oxymoronic Austrian case against free trade.</p></div>",
  "content_text": "Not long ago, Gary North wrote a column with some rather incendiary claims entitled “\nFree Trade: The Litmus Test of Economics\n“.  In it, he relied on the 18th century arguments of David Hume and Adam Smith, both of which have been refuted by me, Ian Fletcher, and numerous other skeptics of free trade.  Is our skepticism based on what North calls “trust in state power”?  Is it really “faith in the economic productivity of men with badges and guns”?\nOf course not.  One of the interesting things about myopic free traders like North is that they stubbornly refuse to pay any attention to economic history or the observable consequences of their logic when it is tested by real world application.  This is why they are constantly retreating to oft-refuted arguments that are more than 200 years old rather than attempting to defend their position on the basis of the post-NAFTA performance of the US economy or the economic state of the European common market now known as the European Union.\nAs an aside, I note that the European Union is one of the most fascistic, illiberal, intrusive, and centralized state powers in the world and it was largely constructed upon free trade-based arguments.  Contrast North’s superficial and outdated polemic with\nPat Buchanan’s WND column\ntoday which observes some very recent results of the latest experiment in free trade.\n“The entry into force of the U.S.-Korea trade agreement on March 15, 2012, means countless new opportunities for U.S. exporters to sell more made-in-America goods, services and agricultural products to Korean customers – and to support more good jobs here at home.”\nThus did the Office of the U.S. Trade Representative rhapsodize about the potential of our new trade treaty with South Korea.  And how has it worked out for Uncle Sam?  Well, courtesy of Martin Crutsinger of the Associated Press, the trade figures are in for April, the first full month under the trade deal with South Korea.\nAnd, surprise! The U.S. trade deficit with Korea tripled in one month. Imports from South Korea jumped 15 percent to $5.5 billion in April, while U.S. exports to South Korea fell 12 percent to $3.7 billion. Suddenly, the U.S. trade deficit with Seoul surged to an annual rate of $22 billion.\nShades of NAFTA. When it passed in 1993, we had a $1.6 billion trade surplus with Mexico. By 2010, our trade deficit with Mexico had reached $61.6 billion.\nVerdict: Buchanan brutally kicks North’s ass.  North’s only response to this would be to celebrate the growing trade deficit because “the world is richer than it was in 1973”.  Regardless of whether that is true or not, the more relevant fact is that the United States of America is considerably poorer than it was in 1973, with lower wages, higher unemployment, and reduced net wealth.  While there is no question that North’s ideological heart is in the right place, his intellectual limitations in the field of economics become readily apparent when one sees how he praises Henry Hazlitt’s hapless attempt to justify free trade:\n“Henry Hazlitt’s classic little book, Economics in One Lesson, so completely destroys the arguments of the tariff supporters that there is nothing left of their position; still they keep coming. For two centuries their position has been intellectually bankrupt; still they keep coming.”\nI found this statement more than a little amusing, of course, because it was trivially easy to show how Hazlitt’s book not only fails to completely destroy the anti-free trade case, but is a remarkably incompetent argument when examined in detail.  I say this because I identified no less than 13 specific errors in his chapter on free trade in the\nfirst\nand\nsecond parts\nof the Hazlitt International Trade Challenge.  Like most conventional – if not mainstream – economists, North is handicapped by his failure to pay any attention to debt.  The following pair of charts show why North and other free traders feel their position is supported by the macroeconomic statistics, then show why their position is absolutely and utterly untenable.\nThis chart shows the free trade case.  Since 1960, the trade deficit has gone from +3.5 billion to -494.7 billion while GDP/Capita has grown from $2,935.49 to $47,790.09.  The growth in GDP has increased much faster than the population growth, therefore it appears to be obvious that the trade deficit is not only making the world richer, it is making the United States richer.  However, this does not tell the entire story.  As I mentioned previously, both the classical and the conventional free trade cases, like the Neo-Keynesian case for government intervention, completely fail to take debt into account.\nNotice how adding the overall debt level of the economy completely changes the picture and makes it obvious how the trade deficit is impoverishing the USA despite the increase in GDP.  GDP that does not account for debt is a terrible measure of wealth and every bit as misleading as GDP that does not account for inflation, as it is nothing more than a metric intended to track national income.  Whereas per capita wealth, measured by GDP/capita – debt/capita was only -$1,417 in 1960, it has increased by two orders of magnitude to -$120,014.  Debt that could once be paid off in 17 months would now require 42 months.\nThe prosperity that North and others claim free trade has brought the USA is nothing but a mirage and is the simple result of Americans\nborrowing\nto buy those foreign goods and services with money they will have to pay back from a smaller industrial base competing against much more serious competitors than they faced 50 years ago.\nThe case for free trade was always logically flawed, and on the empirical level simply cannot survive the incorporation of debt into the equation, as the historical statistics clearly demonstrate the intrinsic falsity that was always apparent to the sufficiently careful economic analyst.  Free trade has not made the USA more wealthy, any more than buying giant houses with no-money down mortgages during the housing boom made those individuals who bought them rich.  It hardly amounts to “state worship” to note that debt is not wealth.  And it should be clear that by depriving the local consumers of their jobs and their ability to pay for imported goods and services,\nfree trade necessarily requires either a decline in living standards or a constantly increasing debt load\nfor countries on the red side of the trade deficit.\nAn so, as strange as it may sound, this observation points towards the legitimate possibility of developing the apparently oxymoronic Austrian case against free trade.",
  "tags": [
    "economics",
    "free trade"
  ],
  "categories": [],
  "sitemap_lastmod": "2012-06-19T08:32:00+00:00"
}