{
  "url": "https://voxday.net/2012/06/06/rip-ray-bradbury/",
  "scraped_at": "2025-12-14T04:56:06.414561",
  "title": "RIP Ray Bradbury",
  "date_display": "June 6, 2012",
  "date_iso": "2012-06-06T15:35:00+00:00",
  "date_from_url": "2012-06-06",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p><i>Ray Bradbury — author of The Martian Chronicles, Fahrenheit 451, Something Wicked This Way Comes, and many more literary classics — died this morning in Los Angeles, at the age of 91.</i></p><p>Ray Bradbury was one of my consistently favorite authors since I first read <i>The Veldt</i> in junior high.  While my memories of other favorite authors from my youth were diminished when I read them later in life, <i>Dandelion Wine</i> remains one of my favorite novels.  He also wrote the most powerful Christian science fiction story I’ve ever read; despite never once mentioning Jesus Christ or even delving into Christian theology, he painted an indelible image of the difference between those who do not truly seek and those who find.</p><p>He was the master of the small, the personal, and the intimate.  Somehow, he managed to capture the essence of childhood in his words.  I know some found him too schmalzy and precious, but I think he did a better job of capturing the little joys of life than anyone.  He had the gift of giving a story poignancy with just a simple twist, or a turn of phrase; even when his literary tricks had become predictable, they were still emotionally powerful.  I also admired his darker side; his was the nervous walk through the warm darkness of a summer night in your hometown, not the icy primordial terror of Lovecraft, the feverish descent into insanity of Maupassant, or the cartoonish schlockfest of modern horror.</p><p>I didn’t know Ray Bradbury.  I can’t honestly say I will mis him.  But I am grateful for him and I am glad that he wrote the books that still have a treasured place in my library.</p></div>",
  "content_text": "Ray Bradbury — author of The Martian Chronicles, Fahrenheit 451, Something Wicked This Way Comes, and many more literary classics — died this morning in Los Angeles, at the age of 91.\nRay Bradbury was one of my consistently favorite authors since I first read\nThe Veldt\nin junior high.  While my memories of other favorite authors from my youth were diminished when I read them later in life,\nDandelion Wine\nremains one of my favorite novels.  He also wrote the most powerful Christian science fiction story I’ve ever read; despite never once mentioning Jesus Christ or even delving into Christian theology, he painted an indelible image of the difference between those who do not truly seek and those who find.\nHe was the master of the small, the personal, and the intimate.  Somehow, he managed to capture the essence of childhood in his words.  I know some found him too schmalzy and precious, but I think he did a better job of capturing the little joys of life than anyone.  He had the gift of giving a story poignancy with just a simple twist, or a turn of phrase; even when his literary tricks had become predictable, they were still emotionally powerful.  I also admired his darker side; his was the nervous walk through the warm darkness of a summer night in your hometown, not the icy primordial terror of Lovecraft, the feverish descent into insanity of Maupassant, or the cartoonish schlockfest of modern horror.\nI didn’t know Ray Bradbury.  I can’t honestly say I will mis him.  But I am grateful for him and I am glad that he wrote the books that still have a treasured place in my library.",
  "tags": [
    "books"
  ],
  "categories": [],
  "sitemap_lastmod": "2012-06-06T14:35:00+00:00"
}