{
  "url": "https://voxday.net/2012/06/05/scientist-beats-up-pz/",
  "scraped_at": "2025-12-14T04:56:00.827611",
  "title": "A scientist beats up PZ",
  "date_display": "June 5, 2012",
  "date_iso": "2012-06-05T11:27:00+00:00",
  "date_from_url": "2012-06-05",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>As if the Fowl Atheist didn’t have enough trouble with all the religious people methodically exposing his rank idiocy whenever he opens his mouth, now even atheist scientists are calling him out on his clueless nonsense.  David Sloan Wilson points out the obvious, which is that <a href=\"http://www.huffingtonpost.com/david-sloan-wilson/pz-myers-not-functioning-_b_1548392.html\">PZ Myers doesn’t act or think in a scientific manner</a> where religion is concerned.</p><blockquote><p> In the spirit of science as a process of constructive disagreement, Evolution: This View of Life is pleased to feature a critique of my previous article “The New Atheism and Evolutionary Religious Studies: Clarifying Their Relationship” by evolutionist and prolific blogger PZ Myers, titled “You Want Evidence that Religion is Bad for Our Species? OPEN YOUR EYES.” Unfortunately, Myer’s critique raises the issue of whether he is functioning as a scientist at all on the subject of religion.</p><p>Imagine Myers teaching a class on his academic specialty — evolutionary developmental biology (evo-devo) — and telling his students that all they must do to understand the topic is to open their eyes. This would be absurd. The whole point of science is to understand topics that are too complex to be self-evident.  I have written about the problem of scientists who use their reputation in one topic area to hold forth on other topic areas without doing the same homework that a good science journalist would do, and even without functioning as a scientist in any way at all. PZ Myers has a fine reputation as an evolutionary developmental biologist, but on the topic of religion he is defrocked.</p></blockquote><p>As longtime readers here know, it’s not just the subject of religion concerning which PZ is hapless, but pretty much every subject he attempts to address outside of his own professional specialty.  He’s equally incompetent with regards to philosophy, politics, and economics, just to name three more.  And even with regards to his scientific specialty, he hasn’t mastered it sufficiently to be confident of winning a debate on evolution by natural selection with me.  But for the purposes of both amusement and edification, consider <a href=\"http://freethoughtblogs.com/pharyngula/2012/05/30/real-scientists-dont-let-the-evidence-get-in-the-way-of-the-theory/\">PZ’s inept response</a> to Wilson, especially the specific questions he poses:</p><p><i>Rather than condescendingly telling us about evolutionary dynamics, I’d like Wilson to get specific.</i></p><p>1.  How does depriving girls of an education benefit women?</p><p>2.  How does raising girls with the expectation that their purpose in life is to bear children benefit women?</p><p>3.  How does throwing acid in their faces when they demand independence from men benefit women?</p><p>4.  How do honor killings benefit women?</p><p>5.  How does stoning rape victims benefit women?</p><p>6.  How does female genital mutilation benefit women?</p><p>7.  How does letting women die rather than giving them an abortion benefit women?</p><p>What is amusing here is the way that PZ throws out these questions as if they are at all difficult to answer, as if he is making some sort of cogent point simply by asking them.  Now, I’m sure Wilson would come up with some different answers, but as will be seen by the answers I provide, by asking some of them, Myers is doing little more than demonstrating the very unscientific attitude of which he is accused!  It’s important to understand that one need not find these answers to be absolutely conclusive or even convincing to recognize that they are <i>scientifically valid</i> answers, which is to say that they can be used to generate hypotheses and then subsequently put to the scientific test, at least to the extent that social science can reasonably be considered science.</p><p>1.  Because educating women is strongly correlated with reducing their disposition and ability to reproduce themselves.  Educating them tends to make them evolutionary dead ends.  “Germany now has the highest number of childless women in the world. This trend has been going on since at least the 90s. What we also know is that the higher the level of education, the more likely a woman is to remain childless.” -Professor Norbert Schneider, Mainz University.  40% of German women with college degrees are childless.  Does PZ seriously wish to claim that not reproducing is <i>intrinsically</i> beneficial to women?  Does he really find it hard to understand how <i>not reproducing</i> is evolutionary disadvantageous?</p><p>2.  Because raising girls with the expectation that their purpose in life is to bear children allows them to pursue marriage at the age of their peak fertility, increase the wage rates of their prospective marital partners, and live in stable, low-crime, homogenous societies that are not demographically dying.  It also grants them privileged status, as they alone are able to ensure the continued survival of the society and the species alike.  Women are not <i>needed</i> in any profession or occupation except that of child-bearer and child-rearer, and even in the case of the latter, they are only superior, they are not absolutely required.</p><p>3.  Because female independence is strongly correlated with a whole host of social ills.  Using the utilitarian metric favored by most atheists, a few acid-burned faces is a small price to pay for lasting marriages, stable families, legitimate children, low levels of debt, strong currencies, affordable housing, homogenous populations, low levels of crime, and demographic stability.  If PZ has turned against utilitarianism or the concept of the collective welfare trumping the interests of the individual, I should be fascinated to hear it.</p><p>4.  Because female promiscuity and divorce are strongly correlated with a whole host of social ills, from low birth and marriage rates to high levels of illegitimacy.</p><p>5.  I don’t see how this benefits women in any way.  The effect in dramatically reducing the number of false rape accusations would, of course, benefit men, but since there is no reliable penalty for false rape accusations in modern society, reducing it would be of little benefit to them.</p><p>6.  By reducing female promiscuity, which is strongly correlated with a whole host of social ills, from low birth and marriage rates to high levels of illegitimacy.  But it may not even do so, in which case there wouldn’t appear to be any case for it, since female genital mutilation tends to make health matters worse, unlike male genital mutilation, which appears to improve health matters somewhat.</p><p>7.  Because far more women are aborted than die as a result of their pregnancies going awry.  The very idea that letting a few women die is worse than killing literally <i>millions</i> of unborn women shows that PZ not only isn’t thinking like a scientist, he’s quite clearly not thinking rationally at all.  If PZ is going to be intellectually consistent here, then he should be quite willing to support the abortion of all black fetuses, since blacks disproportionately commit murder and 17x more people could be saved by aborting black fetuses than permitting the use of abortion to save the life of a mother.  466 American women die in pregnancy every year whereas 8,012 people died at the hands of black murderers in 2010.</p><p>The scientific attitude would be to develop a hypothesis and test it as best one is able.  But it’s quite clear that PZ doesn’t want to consider the possibility of anything beyond his philosophical commitment to the unicorn of so-called “equality”.  Wilson is right to observe that PZ’s behavior with regards to these matters is entirely unscientific, indeed, one might even surmise that it is outright <i>anti-scientific</i>.</p></div>",
  "content_text": "As if the Fowl Atheist didn’t have enough trouble with all the religious people methodically exposing his rank idiocy whenever he opens his mouth, now even atheist scientists are calling him out on his clueless nonsense.  David Sloan Wilson points out the obvious, which is that\nPZ Myers doesn’t act or think in a scientific manner\nwhere religion is concerned.\nIn the spirit of science as a process of constructive disagreement, Evolution: This View of Life is pleased to feature a critique of my previous article “The New Atheism and Evolutionary Religious Studies: Clarifying Their Relationship” by evolutionist and prolific blogger PZ Myers, titled “You Want Evidence that Religion is Bad for Our Species? OPEN YOUR EYES.” Unfortunately, Myer’s critique raises the issue of whether he is functioning as a scientist at all on the subject of religion.\nImagine Myers teaching a class on his academic specialty — evolutionary developmental biology (evo-devo) — and telling his students that all they must do to understand the topic is to open their eyes. This would be absurd. The whole point of science is to understand topics that are too complex to be self-evident.  I have written about the problem of scientists who use their reputation in one topic area to hold forth on other topic areas without doing the same homework that a good science journalist would do, and even without functioning as a scientist in any way at all. PZ Myers has a fine reputation as an evolutionary developmental biologist, but on the topic of religion he is defrocked.\nAs longtime readers here know, it’s not just the subject of religion concerning which PZ is hapless, but pretty much every subject he attempts to address outside of his own professional specialty.  He’s equally incompetent with regards to philosophy, politics, and economics, just to name three more.  And even with regards to his scientific specialty, he hasn’t mastered it sufficiently to be confident of winning a debate on evolution by natural selection with me.  But for the purposes of both amusement and edification, consider\nPZ’s inept response\nto Wilson, especially the specific questions he poses:\nRather than condescendingly telling us about evolutionary dynamics, I’d like Wilson to get specific.\n1.  How does depriving girls of an education benefit women?\n2.  How does raising girls with the expectation that their purpose in life is to bear children benefit women?\n3.  How does throwing acid in their faces when they demand independence from men benefit women?\n4.  How do honor killings benefit women?\n5.  How does stoning rape victims benefit women?\n6.  How does female genital mutilation benefit women?\n7.  How does letting women die rather than giving them an abortion benefit women?\nWhat is amusing here is the way that PZ throws out these questions as if they are at all difficult to answer, as if he is making some sort of cogent point simply by asking them.  Now, I’m sure Wilson would come up with some different answers, but as will be seen by the answers I provide, by asking some of them, Myers is doing little more than demonstrating the very unscientific attitude of which he is accused!  It’s important to understand that one need not find these answers to be absolutely conclusive or even convincing to recognize that they are\nscientifically valid\nanswers, which is to say that they can be used to generate hypotheses and then subsequently put to the scientific test, at least to the extent that social science can reasonably be considered science.\n1.  Because educating women is strongly correlated with reducing their disposition and ability to reproduce themselves.  Educating them tends to make them evolutionary dead ends.  “Germany now has the highest number of childless women in the world. This trend has been going on since at least the 90s. What we also know is that the higher the level of education, the more likely a woman is to remain childless.” -Professor Norbert Schneider, Mainz University.  40% of German women with college degrees are childless.  Does PZ seriously wish to claim that not reproducing is\nintrinsically\nbeneficial to women?  Does he really find it hard to understand how\nnot reproducing\nis evolutionary disadvantageous?\n2.  Because raising girls with the expectation that their purpose in life is to bear children allows them to pursue marriage at the age of their peak fertility, increase the wage rates of their prospective marital partners, and live in stable, low-crime, homogenous societies that are not demographically dying.  It also grants them privileged status, as they alone are able to ensure the continued survival of the society and the species alike.  Women are not\nneeded\nin any profession or occupation except that of child-bearer and child-rearer, and even in the case of the latter, they are only superior, they are not absolutely required.\n3.  Because female independence is strongly correlated with a whole host of social ills.  Using the utilitarian metric favored by most atheists, a few acid-burned faces is a small price to pay for lasting marriages, stable families, legitimate children, low levels of debt, strong currencies, affordable housing, homogenous populations, low levels of crime, and demographic stability.  If PZ has turned against utilitarianism or the concept of the collective welfare trumping the interests of the individual, I should be fascinated to hear it.\n4.  Because female promiscuity and divorce are strongly correlated with a whole host of social ills, from low birth and marriage rates to high levels of illegitimacy.\n5.  I don’t see how this benefits women in any way.  The effect in dramatically reducing the number of false rape accusations would, of course, benefit men, but since there is no reliable penalty for false rape accusations in modern society, reducing it would be of little benefit to them.\n6.  By reducing female promiscuity, which is strongly correlated with a whole host of social ills, from low birth and marriage rates to high levels of illegitimacy.  But it may not even do so, in which case there wouldn’t appear to be any case for it, since female genital mutilation tends to make health matters worse, unlike male genital mutilation, which appears to improve health matters somewhat.\n7.  Because far more women are aborted than die as a result of their pregnancies going awry.  The very idea that letting a few women die is worse than killing literally\nmillions\nof unborn women shows that PZ not only isn’t thinking like a scientist, he’s quite clearly not thinking rationally at all.  If PZ is going to be intellectually consistent here, then he should be quite willing to support the abortion of all black fetuses, since blacks disproportionately commit murder and 17x more people could be saved by aborting black fetuses than permitting the use of abortion to save the life of a mother.  466 American women die in pregnancy every year whereas 8,012 people died at the hands of black murderers in 2010.\nThe scientific attitude would be to develop a hypothesis and test it as best one is able.  But it’s quite clear that PZ doesn’t want to consider the possibility of anything beyond his philosophical commitment to the unicorn of so-called “equality”.  Wilson is right to observe that PZ’s behavior with regards to these matters is entirely unscientific, indeed, one might even surmise that it is outright\nanti-scientific\n.",
  "tags": [
    "atheism",
    "PZ",
    "science"
  ],
  "categories": [],
  "sitemap_lastmod": "2012-06-05T10:27:00+00:00"
}