{
  "url": "https://voxday.net/2012/06/07/still-sniping-still-running/",
  "scraped_at": "2025-12-14T04:56:10.044591",
  "title": "Still sniping, still running",
  "date_display": "June 7, 2012",
  "date_iso": "2012-06-07T13:21:00+00:00",
  "date_from_url": "2012-06-07",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>It would appear PZ Myers is now too delicate to respond to me directly, so <a href=\"http://freethoughtblogs.com/pharyngula/2012/06/06/vox-day-is-one-sick-puppy/\">he’s responding to someone else quoting what I wrote</a>, which totally doesn’t count as responding:</p><blockquote><p> I don’t do debates anymore. One reason is that they give the other side far too much credibility; another is that the format rewards rhetoric, not honesty. But the other big reason is sheer disgust at the spectacle these loons can put on.</p><p>Imagine this metaphorical situation: you’re at a debate, and your opponent stands up and in the first round, starts punching himself in the face. Punching hard, until the blood spurts in great red rivers out of his nose. You’re aghast, but when your turn comes up, you try to make your points; in rebuttal, he pulls out a knife and starts gouging out one of his eyeballs. You just want to stop the whole debacle, call an ambulance, and have the poor warped goon hauled away. But then afterwards, he crows victory.</p><p>That’s a bit of hyperbole, but not by much. Theodore Beale, aka Vox Day, has leapt upon my post in which I used the status of women as evidence that religion does harm to humanity, and eagerly tries to rebut me in a spectacular act of self-mutilation. I won’t link directly to poor sick Theodore Beale — he needs psychiatric help — but fortunately Dave Futrelle quotes him extensively, so you can get the gist without feeding Beale’s pathology directly.</p></blockquote><p>Right, that’s why the man whose intellectual courage inspired me to dub him “The Fowl Atheist” doesn’t debate anyone.  It’s not because he can’t argue his way out of a paper bag and knows that he’ll get his pudgy ass exposed to the public before it is kicked all over the place, it’s because he’s too much of a <i>humanitarian</i>.  You’d think he would know no one is going to buy that excuse, he’s a high-AQ <i>militant atheist</i> after all.  He’s <a href=\"http://freethoughtblogs.com/pharyngula/2012/04/15/sunday-sacrilege-sacking-the-city-of-god/\">a fierce and focused hunter</a>, with hunter’s hands and hunter’s eyes, not Sister Mary Margaret feeding the poor at the homeless shelter!  I find it a little ironic that a man who openly admits <a href=\"http://scienceblogs.com/pharyngula/2007/08/im_mostly_normal.php\">to being closer to having Asperger’s Syndrome than being neurotypical</a> is attempting to claim I need psychiatric help.</p><p>I never cease to find amusing how quickly these inept atheists resort to accusations of mental illness whenever their illogic is publicly illuminated and dissected.  Why, one might almost begin to suspect they are projecting!</p><blockquote><p> But there’s enough bile to make you wonder. I was arguing that many features of religion clearly don’t benefit women, so I asked:</p><p> <i>How does throwing acid in their faces when they demand independence from men benefit women?</i></p><p>So Teddy rebuts that in the most appalling way.</p><p><i>[F]emale independence is strongly correlated with a whole host of social ills. Using the utilitarian metric favored by most atheists, a few acid-burned faces is a small price to pay for lasting marriages, stable families, legitimate children, low levels of debt, strong currencies, affordable housing, homogenous populations, low levels of crime, and demographic stability. If PZ has turned against utilitarianism or the concept of the collective welfare trumping the interests of the individual, I should be fascinated to hear it.</i></p><p>Say what? So his answer to how this benefits women is to say it’s bad for society for women to be independent, and that honor killings, stonings, and mutilation of women is a small price?</p><p>I think he just made my case for me.</p></blockquote><p>Yes, that is precisely the answer.  But this doesn’t make his case for him, instead, his response to my scientific answer only confirms <a href=\"http://www.huffingtonpost.com/david-sloan-wilson/pz-myers-not-functioning-_b_1548392.html\">Wilson’s original case</a> against him, in which he claimed that PZ doesn’t act or think in a scientific manner.  And while Wilson is correct and PZ truly doesn’t think like a scientist in any way, shape, or form, it’s actually worse than that because it’s clear that he also doesn’t understand what he reads.  I not only provided an answer to his question that can be empirically and objectively analyzed, it was a scientific answer that was entirely in keeping with PZ’s own previously expressed statements on the subject.   Consider <a href=\" http://scienceblogs.com/pharyngula/2010/05/04/sam-harris-v-sean-carroll/\">what PZ wrote about the Taliban’s oppression of women</a> only two years ago:</p><p><i>I also think that the desire for a successful society is not a scientific premise…it’s a kind of Darwinian criterion, because unsuccessful societies don’t survive.  Can we use science to determine whether that is a good strategy for human success? I think we can, but not in the way Harris is trying to do so: we could ask empirically, after the fact, whether the Taliban was successful in expanding, maintaining its population, and responding to its environment in a productive way. We cannot, though, say a priori that it is wrong because abusing and denigrating half the population is unconscionable and vile, because that is not a scientific foundation for the conclusion. It’s an emotional one; it’s also a rational one, given the premise that we should treat all people equitably…but that premise can’t claim scientific justification.</i></p><p>So while the desire for a successful society is not a scientific premise, determining the way in which a society can become successful is.  Note that Myers admits that one cannot say throwing acid in a woman’s face when she demands independence is wrong from <i>the scientific perspective</i>.  He even acknowledges that science could support, on the basis of the Darwinian criterion, horrific actions in support of societal success and survival.  This is not to say he supports such actions, only that his opposition to them is based on entirely non-scientific reasoning.  In that previous post, he adds:</p><p><i>I agree with Harris entirely that the oppression of women is an evil, a wrong, a violation of a social contract that all members of a society should share. I just don’t see a scientific reason for that — I see reasons of biological predisposition (we are empathic, social animals), of culture (this is a conclusion of Enlightenment history), and personal values, but not science. Science is an amoral judge: science could find that a slave culture of ant-like servility was a species optimum, or that a strong behavioral sexual dimorphism, where men and women had radically different statuses in society, was an excellent working solution.</i></p><p>So, we see that Wilson was correct.  PZ is not thinking as a scientist about these matters, by his own words he is clearly thinking about them according to his biological predisposition, his culture, and his personal values.  Of course, the biological predisposition, the culture, and the personal values of those who throw acid in women’s faces to keep them in their place are not only different than PZ’s, but may actually be superior to them in both scientific and moral terms.  PZ hasn’t even begun to attempt to make any case for the superiority of his own biological predisposition, culture, and personal values, in fact, he has devoted considerable effort over the years to demonizing the Christian culture in which he was raised.</p><blockquote><p> But how about this: Beale has not made the case that destroying women’s lives is a necessary price to pay for social stability. I reject his bargain; I say we can have a more stable, healthier, stronger society if human beings live in mutually loving and respectful relationships. I do not have to hover over my wife with a threatening jar of acid in order for both of us to live together happily; in fact, a life where I had to compel a partnership with terror would be a horror and a nightmare.</p><p>One more. I also asked this:</p><p> <i>How does letting women die rather than giving them an abortion benefit women?</i></p><p>Here’s his answer.</p><p> <i>Because far more women are aborted than die as a result of their pregnancies going awry. The very idea that letting a few women die is worse than killing literally millions of unborn women shows that PZ not only isn’t thinking like a scientist, he’s quite clearly not thinking rationally at all. If PZ is going to be intellectually consistent here, then he should be quite willing to support the abortion of all black fetuses, since blacks disproportionately commit murder and 17x more people could be saved by aborting black fetuses than permitting the use of abortion to save the life of a mother. 466 American women die in pregnancy every year whereas 8,012 people died at the hands of black murderers in 2010.</i></p><p>A fetus is not a woman. I’m used to hearing those wacky anti-choicers call the fetus a “baby”, with all those emotional connotations, but this is the first time I’ve heard them called “women”.</p><p>The racist tirade is just sickening. So now Beale wants us to lump all black people together as “murderers” to justify forced sterilization, as a logical consequence of my values? I’ve heard of that tactic somewhere else before.</p><p>Again with the logical fallacies. Here’s a hint: the death of women in back-alley abortions can be directly addressed by legalizing abortion and providing responsible medical treatment; the socioeconomic conditions that create an environment of crime are not addressed by racially-defined forced abortion. If we want to end murders by any population (yes, please), the answer is not the extermination of that population, but the correction of social and economic inequity and providing opportunity for advancement.</p></blockquote><p>Of course I haven’t made the case that destroying women’s lives is a necessary price to pay for social stability.  I didn’t need to make that case in order to make my point, which is that the scientific case could be made and that in refusing to consider it, PZ was proving Wilson right about his failure to think like a scientist about it.  He can say whatever he likes, but his position would be no weaker if he had instead declared that we can have a more stable, healthier, stronger society if human beings began the day by pledging their loyalty to Yog-Sothoth and committing seven deadly sins each morning before breakfast.</p><p>PZ then reveals that in addition to his demonstrated inability to think like a scientist, he’s not even able to think logically.  If “a fetus is not a woman”, then obviously “a black fetus is not a black adult”.  It’s simple multiplication by zero.  If there is no harm done in aborting one fetus, there can be no harm in aborting all the black fetuses in America, plus there will be a net benefit that will save 17 times more lives every single year than merely permitting abortions to save the lives of pregnant women.  The logical consequences of PZ’s position on abortion are inescapable.  If it is worthwhile to utilize abortion to save 466 pregnant women every year, then it is clearly worthwhile to utilize it to save 8,012 murder victims, as either way, the cost is trivial, since according to PZ, the fetus is not a baby, a woman, or a black adult meriting protection of the law.  The appeal to socioeconomic conditions is irrelevant, as PZ is wrong and murders committed by blacks can be directly addressed by utilizing abortion; nonexistent people cannot murder anyone.  That there may or may not be other ways of addressing the same social ill does not change that simple and undeniable fact.</p><p>I further note that I am not a supporter of abortion for any reason, including the elimination of crime and the life of the mother.  I am merely explicating the logical consequences of PZ’s reasoning.  Nor is it racist to cite the FBI’s Uniform Crime Report; one could make precisely the same case, although it would be a less effective and efficient one, for the abortion of white fetuses.  If PZ doesn’t like the inescapable logical implications of his reasoning, then I suggest he should consider rethinking his assumptions.  And if he doesn’t like scientists and non-scientists alike pointing out the obvious fact that he does not reason or behave like a scientist, perhaps he should start trying to actually think like one rather than like an irrational, emotional, atheist propagandist.</p><blockquote><p> And with that, I’m sufficiently repulsed not to want to continue. Beale/Day has apparently been whiningly demanding to debate me for the last few years; now you know why I won’t even consider it. Getting his words as second-hand text is nauseating enough, I’d rather not have to deal with the poisonous little scumbag directly.</p></blockquote><p>Still sniping and running.  After all these years, still sniping and running.  The thing is, as anyone who has ever fired a gun knows, it’s a lot easier to hit your target if you stand still and take the time to aim at it.  Of course, then you have to take the risk that you’re up against a much better marksman who will blow you away before you can even get a shot off….</p></div>",
  "content_text": "It would appear PZ Myers is now too delicate to respond to me directly, so\nhe’s responding to someone else quoting what I wrote\n, which totally doesn’t count as responding:\nI don’t do debates anymore. One reason is that they give the other side far too much credibility; another is that the format rewards rhetoric, not honesty. But the other big reason is sheer disgust at the spectacle these loons can put on.\nImagine this metaphorical situation: you’re at a debate, and your opponent stands up and in the first round, starts punching himself in the face. Punching hard, until the blood spurts in great red rivers out of his nose. You’re aghast, but when your turn comes up, you try to make your points; in rebuttal, he pulls out a knife and starts gouging out one of his eyeballs. You just want to stop the whole debacle, call an ambulance, and have the poor warped goon hauled away. But then afterwards, he crows victory.\nThat’s a bit of hyperbole, but not by much. Theodore Beale, aka Vox Day, has leapt upon my post in which I used the status of women as evidence that religion does harm to humanity, and eagerly tries to rebut me in a spectacular act of self-mutilation. I won’t link directly to poor sick Theodore Beale — he needs psychiatric help — but fortunately Dave Futrelle quotes him extensively, so you can get the gist without feeding Beale’s pathology directly.\nRight, that’s why the man whose intellectual courage inspired me to dub him “The Fowl Atheist” doesn’t debate anyone.  It’s not because he can’t argue his way out of a paper bag and knows that he’ll get his pudgy ass exposed to the public before it is kicked all over the place, it’s because he’s too much of a\nhumanitarian\n.  You’d think he would know no one is going to buy that excuse, he’s a high-AQ\nmilitant atheist\nafter all.  He’s\na fierce and focused hunter\n, with hunter’s hands and hunter’s eyes, not Sister Mary Margaret feeding the poor at the homeless shelter!  I find it a little ironic that a man who openly admits\nto being closer to having Asperger’s Syndrome than being neurotypical\nis attempting to claim I need psychiatric help.\nI never cease to find amusing how quickly these inept atheists resort to accusations of mental illness whenever their illogic is publicly illuminated and dissected.  Why, one might almost begin to suspect they are projecting!\nBut there’s enough bile to make you wonder. I was arguing that many features of religion clearly don’t benefit women, so I asked:\nHow does throwing acid in their faces when they demand independence from men benefit women?\nSo Teddy rebuts that in the most appalling way.\n[F]emale independence is strongly correlated with a whole host of social ills. Using the utilitarian metric favored by most atheists, a few acid-burned faces is a small price to pay for lasting marriages, stable families, legitimate children, low levels of debt, strong currencies, affordable housing, homogenous populations, low levels of crime, and demographic stability. If PZ has turned against utilitarianism or the concept of the collective welfare trumping the interests of the individual, I should be fascinated to hear it.\nSay what? So his answer to how this benefits women is to say it’s bad for society for women to be independent, and that honor killings, stonings, and mutilation of women is a small price?\nI think he just made my case for me.\nYes, that is precisely the answer.  But this doesn’t make his case for him, instead, his response to my scientific answer only confirms\nWilson’s original case\nagainst him, in which he claimed that PZ doesn’t act or think in a scientific manner.  And while Wilson is correct and PZ truly doesn’t think like a scientist in any way, shape, or form, it’s actually worse than that because it’s clear that he also doesn’t understand what he reads.  I not only provided an answer to his question that can be empirically and objectively analyzed, it was a scientific answer that was entirely in keeping with PZ’s own previously expressed statements on the subject.   Consider\nwhat PZ wrote about the Taliban’s oppression of women\nonly two years ago:\nI also think that the desire for a successful society is not a scientific premise…it’s a kind of Darwinian criterion, because unsuccessful societies don’t survive.  Can we use science to determine whether that is a good strategy for human success? I think we can, but not in the way Harris is trying to do so: we could ask empirically, after the fact, whether the Taliban was successful in expanding, maintaining its population, and responding to its environment in a productive way. We cannot, though, say a priori that it is wrong because abusing and denigrating half the population is unconscionable and vile, because that is not a scientific foundation for the conclusion. It’s an emotional one; it’s also a rational one, given the premise that we should treat all people equitably…but that premise can’t claim scientific justification.\nSo while the desire for a successful society is not a scientific premise, determining the way in which a society can become successful is.  Note that Myers admits that one cannot say throwing acid in a woman’s face when she demands independence is wrong from\nthe scientific perspective\n.  He even acknowledges that science could support, on the basis of the Darwinian criterion, horrific actions in support of societal success and survival.  This is not to say he supports such actions, only that his opposition to them is based on entirely non-scientific reasoning.  In that previous post, he adds:\nI agree with Harris entirely that the oppression of women is an evil, a wrong, a violation of a social contract that all members of a society should share. I just don’t see a scientific reason for that — I see reasons of biological predisposition (we are empathic, social animals), of culture (this is a conclusion of Enlightenment history), and personal values, but not science. Science is an amoral judge: science could find that a slave culture of ant-like servility was a species optimum, or that a strong behavioral sexual dimorphism, where men and women had radically different statuses in society, was an excellent working solution.\nSo, we see that Wilson was correct.  PZ is not thinking as a scientist about these matters, by his own words he is clearly thinking about them according to his biological predisposition, his culture, and his personal values.  Of course, the biological predisposition, the culture, and the personal values of those who throw acid in women’s faces to keep them in their place are not only different than PZ’s, but may actually be superior to them in both scientific and moral terms.  PZ hasn’t even begun to attempt to make any case for the superiority of his own biological predisposition, culture, and personal values, in fact, he has devoted considerable effort over the years to demonizing the Christian culture in which he was raised.\nBut how about this: Beale has not made the case that destroying women’s lives is a necessary price to pay for social stability. I reject his bargain; I say we can have a more stable, healthier, stronger society if human beings live in mutually loving and respectful relationships. I do not have to hover over my wife with a threatening jar of acid in order for both of us to live together happily; in fact, a life where I had to compel a partnership with terror would be a horror and a nightmare.\nOne more. I also asked this:\nHow does letting women die rather than giving them an abortion benefit women?\nHere’s his answer.\nBecause far more women are aborted than die as a result of their pregnancies going awry. The very idea that letting a few women die is worse than killing literally millions of unborn women shows that PZ not only isn’t thinking like a scientist, he’s quite clearly not thinking rationally at all. If PZ is going to be intellectually consistent here, then he should be quite willing to support the abortion of all black fetuses, since blacks disproportionately commit murder and 17x more people could be saved by aborting black fetuses than permitting the use of abortion to save the life of a mother. 466 American women die in pregnancy every year whereas 8,012 people died at the hands of black murderers in 2010.\nA fetus is not a woman. I’m used to hearing those wacky anti-choicers call the fetus a “baby”, with all those emotional connotations, but this is the first time I’ve heard them called “women”.\nThe racist tirade is just sickening. So now Beale wants us to lump all black people together as “murderers” to justify forced sterilization, as a logical consequence of my values? I’ve heard of that tactic somewhere else before.\nAgain with the logical fallacies. Here’s a hint: the death of women in back-alley abortions can be directly addressed by legalizing abortion and providing responsible medical treatment; the socioeconomic conditions that create an environment of crime are not addressed by racially-defined forced abortion. If we want to end murders by any population (yes, please), the answer is not the extermination of that population, but the correction of social and economic inequity and providing opportunity for advancement.\nOf course I haven’t made the case that destroying women’s lives is a necessary price to pay for social stability.  I didn’t need to make that case in order to make my point, which is that the scientific case could be made and that in refusing to consider it, PZ was proving Wilson right about his failure to think like a scientist about it.  He can say whatever he likes, but his position would be no weaker if he had instead declared that we can have a more stable, healthier, stronger society if human beings began the day by pledging their loyalty to Yog-Sothoth and committing seven deadly sins each morning before breakfast.\nPZ then reveals that in addition to his demonstrated inability to think like a scientist, he’s not even able to think logically.  If “a fetus is not a woman”, then obviously “a black fetus is not a black adult”.  It’s simple multiplication by zero.  If there is no harm done in aborting one fetus, there can be no harm in aborting all the black fetuses in America, plus there will be a net benefit that will save 17 times more lives every single year than merely permitting abortions to save the lives of pregnant women.  The logical consequences of PZ’s position on abortion are inescapable.  If it is worthwhile to utilize abortion to save 466 pregnant women every year, then it is clearly worthwhile to utilize it to save 8,012 murder victims, as either way, the cost is trivial, since according to PZ, the fetus is not a baby, a woman, or a black adult meriting protection of the law.  The appeal to socioeconomic conditions is irrelevant, as PZ is wrong and murders committed by blacks can be directly addressed by utilizing abortion; nonexistent people cannot murder anyone.  That there may or may not be other ways of addressing the same social ill does not change that simple and undeniable fact.\nI further note that I am not a supporter of abortion for any reason, including the elimination of crime and the life of the mother.  I am merely explicating the logical consequences of PZ’s reasoning.  Nor is it racist to cite the FBI’s Uniform Crime Report; one could make precisely the same case, although it would be a less effective and efficient one, for the abortion of white fetuses.  If PZ doesn’t like the inescapable logical implications of his reasoning, then I suggest he should consider rethinking his assumptions.  And if he doesn’t like scientists and non-scientists alike pointing out the obvious fact that he does not reason or behave like a scientist, perhaps he should start trying to actually think like one rather than like an irrational, emotional, atheist propagandist.\nAnd with that, I’m sufficiently repulsed not to want to continue. Beale/Day has apparently been whiningly demanding to debate me for the last few years; now you know why I won’t even consider it. Getting his words as second-hand text is nauseating enough, I’d rather not have to deal with the poisonous little scumbag directly.\nStill sniping and running.  After all these years, still sniping and running.  The thing is, as anyone who has ever fired a gun knows, it’s a lot easier to hit your target if you stand still and take the time to aim at it.  Of course, then you have to take the risk that you’re up against a much better marksman who will blow you away before you can even get a shot off….",
  "tags": [
    "PZ",
    "science",
    "trainwreck"
  ],
  "categories": [],
  "sitemap_lastmod": "2012-06-07T12:21:00+00:00"
}