{
  "url": "https://voxday.net/2012/06/13/value-of-predictive-models/",
  "scraped_at": "2025-12-14T04:56:35.741507",
  "title": "The value of predictive models",
  "date_display": "June 13, 2012",
  "date_iso": "2012-06-13T10:21:00+00:00",
  "date_from_url": "2012-06-13",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>Thomas Friedman fails to understand why not only the Europe Union and the Arab states, but the United States as well, <a href=\"http://www.nytimes.com/2012/06/13/opinion/friedman-two-worlds-cracking-up.html?hp\">are in the process of breaking up</a>:<br/></p><blockquote><p> Europeans failed to build Europe, and that is now a big problem because, as its common currency comes under pressure and the E.U. goes deeper into recession, the whole world feels the effects. The Syrians failed to build Syria, the Egyptians failed to build Egypt, the Libyans failed to build Libya, the Yemenis failed to build Yemen. Those are even bigger problems because, as their states have been stressed or fractured, no one knows how they’ll be put back together again.</p><p>To put it another way: In Europe, the supranational project did not work, and now, to a degree, Europe is falling back into individual states. In the Arab world, the national project did not work, so some of the Arab states are falling back onto sects, tribes, regions and clans.</p><p>In Europe, the supranational project did not work because the European states were never ready to cede control over their budgets to a central authority that would ensure a common fiscal policy to back up a common currency.  In the Arab world, the national project did not work — in many, but not all cases — because the tribes, sects, clans and regional groups that make up these Arab states, whose borders were drawn up by colonial powers, were unwilling or unable to meld genuine national communities….</p><p>One question historians will puzzle over is why both great geopolitical systems fractured at once? The answer, I believe, is the intensifying merger of globalization and the information technology revolution, which made the world dramatically flatter in the last five years, as we went from connected to hyperconnected. In the Arab world, this hyper-connectivity simultaneously left youths better able to see how far behind they were — with all the anxiety that induced — and enabled them to communicate and collaborate to do something about it, cracking open their ossified states.  In Europe, hyperconnectedness both exposed just how uncompetitive some of their economies were, but also how interdependent they had become. It was a deadly combination.</p></blockquote><p>Friedman is wrong.  Historians will not puzzle, as we know the answer already, which does not originate in communications technology, but economics.  Robert Prechter not only provided the answer, but repeatedly predicted these political events, beginning with his landmark <i>Pioneering Studies in Socionomics</i>.  Peace and political unity are strongly correlated with periods of economic growth.  That’s why history has always tended to skate over those boring periods where nothing happened, no one went to war, and people gradually got wealthier.  The six-decade post-WWII period has been one of the longest periods of economic growth in the West since the fall of the Roman empire, so it should not be surprising that there was relative peace and partially successful attempts to build supranational organizations during that time.</p><p>However, the prosperity brought about by the post-war rebuilding of a world shattered by global war ended in 1970s and was artificially extended by the large scale substitution of credit for economic growth and wealth production.  With the end of the perceived prosperity, the centrifugal force bringing people together has also ended and now the political inertia is moving in the opposite direction.  Given the negative economic prospects for the next decade or two, it will be much more surprising if the various political unions do not break apart as the people brought into the various countries, drawn by the economic prosperity, will tend to become the focus of the divisive forces that will break apart the states on their various fault lines.</p></div>",
  "content_text": "Thomas Friedman fails to understand why not only the Europe Union and the Arab states, but the United States as well,\nare in the process of breaking up\n:\nEuropeans failed to build Europe, and that is now a big problem because, as its common currency comes under pressure and the E.U. goes deeper into recession, the whole world feels the effects. The Syrians failed to build Syria, the Egyptians failed to build Egypt, the Libyans failed to build Libya, the Yemenis failed to build Yemen. Those are even bigger problems because, as their states have been stressed or fractured, no one knows how they’ll be put back together again.\nTo put it another way: In Europe, the supranational project did not work, and now, to a degree, Europe is falling back into individual states. In the Arab world, the national project did not work, so some of the Arab states are falling back onto sects, tribes, regions and clans.\nIn Europe, the supranational project did not work because the European states were never ready to cede control over their budgets to a central authority that would ensure a common fiscal policy to back up a common currency.  In the Arab world, the national project did not work — in many, but not all cases — because the tribes, sects, clans and regional groups that make up these Arab states, whose borders were drawn up by colonial powers, were unwilling or unable to meld genuine national communities….\nOne question historians will puzzle over is why both great geopolitical systems fractured at once? The answer, I believe, is the intensifying merger of globalization and the information technology revolution, which made the world dramatically flatter in the last five years, as we went from connected to hyperconnected. In the Arab world, this hyper-connectivity simultaneously left youths better able to see how far behind they were — with all the anxiety that induced — and enabled them to communicate and collaborate to do something about it, cracking open their ossified states.  In Europe, hyperconnectedness both exposed just how uncompetitive some of their economies were, but also how interdependent they had become. It was a deadly combination.\nFriedman is wrong.  Historians will not puzzle, as we know the answer already, which does not originate in communications technology, but economics.  Robert Prechter not only provided the answer, but repeatedly predicted these political events, beginning with his landmark\nPioneering Studies in Socionomics\n.  Peace and political unity are strongly correlated with periods of economic growth.  That’s why history has always tended to skate over those boring periods where nothing happened, no one went to war, and people gradually got wealthier.  The six-decade post-WWII period has been one of the longest periods of economic growth in the West since the fall of the Roman empire, so it should not be surprising that there was relative peace and partially successful attempts to build supranational organizations during that time.\nHowever, the prosperity brought about by the post-war rebuilding of a world shattered by global war ended in 1970s and was artificially extended by the large scale substitution of credit for economic growth and wealth production.  With the end of the perceived prosperity, the centrifugal force bringing people together has also ended and now the political inertia is moving in the opposite direction.  Given the negative economic prospects for the next decade or two, it will be much more surprising if the various political unions do not break apart as the people brought into the various countries, drawn by the economic prosperity, will tend to become the focus of the divisive forces that will break apart the states on their various fault lines.",
  "tags": [
    "economics",
    "society"
  ],
  "categories": [],
  "sitemap_lastmod": "2012-06-13T09:21:00+00:00"
}