{
  "url": "https://voxday.net/2017/11/15/a-lesson-in-corporate-chaos/",
  "scraped_at": "2025-12-19T10:31:38.482488",
  "title": "A lesson in corporate chaos",
  "date_display": "November 15, 2017",
  "date_iso": "2017-11-15T13:00:00+00:00",
  "date_from_url": "2017-11-15",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>This is a fascinating clash of two tech CEOs on Twitter, both of whom are quite clearly unready for prime time and are perfectly willing to blow up their own enterprises in defense of their ideologies.</p><blockquote><p>Vinay Gupta‏ @leashless<br>I don’t deny your right to do what you want with your own tools in your own time. But I’m telling you this, and I am not to be fucked with: most of us will not rest until we figure out how to fuck you if you colonize our platform. We are hostile to your goals. Be elsewhere.</br></p><p>Vinay Gupta‏ @leashless<br>If you try to twist our work into a weapon for your cultural war, it will damage our attempt to transform the global economy. You will be in our way, and we will fuck you. We are smart: in all probability it can be done without platform changes. Get your own toys. Get off ours.</br></p><p>Vinay Gupta‏ @leashless<br>Go and build your own infrastructure, you dumb motherfuckers.</br></p><p>You want to parasitize our hard work with your massively bigoted political project, and you expect us to just roll over?</p><p>Don’t be fucking stupid. We have backbone. We have will. We will fight back. Lots of Jews too.</p><p>Vinay Gupta‏ @leashless<br>We did this work, on Ethereum, to make a better world. If you force us to figure out how to defend our vision of a better world against people who try and use our own tools against is, we will find ways to fight back.</br></p><p>And we are the ones with the power here. Make your plans.</p><p>Vinay Gupta‏ @leashless<br>By all means, put your entire life’s work into the hands of people who hate a d oppose you at every level. You’ll find it goes as well as running a city when the power station staff go on strike. We do infrastructure. You depend on us.</br></p><p>We will find ways. Count on it.</p><p>Gab @getongab<br>Well folks this is how “open,” “decentralized,” and “inclusive” the Ethereum project is. If you’re thinking about building on top of it, think again.</br></p><p>Vinay Gupta‏ @leashless<br>I am proud that this has gone viral. I did not work on cryptography to empower racists, but normal, good people.</br></p><p>Ivan Throne‏ @DarkTriadMan<br>Why, it is almost as if @voxday had a point about from-the-ground-up vulnerabilities once, isn’t it?</br></p></blockquote><p>At this point, I think one can make a very good case about social media potentially doing more harm than good for the average company. I wasn’t interested in using Etherium, but after seeing how these literal communists intend to use it to transform the global economy, I’ll go out of my way to support their competitors.</p><p>You have to be pretty stupid to go on Gab and volunteer yourself for the targeted harassment and libel that will be directed your way in the name of free speech. And you’d have to be an utter moron to even consider putting your livelihood in the hands of the out-of-control SJWs at Etherium. Both Gab and Etherium observably fail to grasp that providing confidence to the consumer is the single most important factor in corporate success.</p></div>",
  "content_text": "This is a fascinating clash of two tech CEOs on Twitter, both of whom are quite clearly unready for prime time and are perfectly willing to blow up their own enterprises in defense of their ideologies.\nVinay Gupta‏ @leashless\nI don’t deny your right to do what you want with your own tools in your own time. But I’m telling you this, and I am not to be fucked with: most of us will not rest until we figure out how to fuck you if you colonize our platform. We are hostile to your goals. Be elsewhere.\nVinay Gupta‏ @leashless\nIf you try to twist our work into a weapon for your cultural war, it will damage our attempt to transform the global economy. You will be in our way, and we will fuck you. We are smart: in all probability it can be done without platform changes. Get your own toys. Get off ours.\nVinay Gupta‏ @leashless\nGo and build your own infrastructure, you dumb motherfuckers.\nYou want to parasitize our hard work with your massively bigoted political project, and you expect us to just roll over?\nDon’t be fucking stupid. We have backbone. We have will. We will fight back. Lots of Jews too.\nVinay Gupta‏ @leashless\nWe did this work, on Ethereum, to make a better world. If you force us to figure out how to defend our vision of a better world against people who try and use our own tools against is, we will find ways to fight back.\nAnd we are the ones with the power here. Make your plans.\nVinay Gupta‏ @leashless\nBy all means, put your entire life’s work into the hands of people who hate a d oppose you at every level. You’ll find it goes as well as running a city when the power station staff go on strike. We do infrastructure. You depend on us.\nWe will find ways. Count on it.\nGab @getongab\nWell folks this is how “open,” “decentralized,” and “inclusive” the Ethereum project is. If you’re thinking about building on top of it, think again.\nVinay Gupta‏ @leashless\nI am proud that this has gone viral. I did not work on cryptography to empower racists, but normal, good people.\nIvan Throne‏ @DarkTriadMan\nWhy, it is almost as if @voxday had a point about from-the-ground-up vulnerabilities once, isn’t it?\nAt this point, I think one can make a very good case about social media potentially doing more harm than good for the average company. I wasn’t interested in using Etherium, but after seeing how these literal communists intend to use it to transform the global economy, I’ll go out of my way to support their competitors.\nYou have to be pretty stupid to go on Gab and volunteer yourself for the targeted harassment and libel that will be directed your way in the name of free speech. And you’d have to be an utter moron to even consider putting your livelihood in the hands of the out-of-control SJWs at Etherium. Both Gab and Etherium observably fail to grasp that providing confidence to the consumer is the single most important factor in corporate success.",
  "tags": [
    "freakshow",
    "technology"
  ],
  "categories": [],
  "sitemap_lastmod": "2017-11-15T13:00:00+00:00"
}