{
  "url": "https://voxday.net/2017/11/05/a-poem-updated/",
  "scraped_at": "2025-12-19T10:30:23.385089",
  "title": "A poem, updated",
  "date_display": "November 5, 2017",
  "date_iso": "2017-11-05T13:00:00+00:00",
  "date_from_url": "2017-11-05",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p><i>There’s a miserable family called Stein:</i><br><i>There’s Gert and there’s Ep and there’s Wein.</i><br><i>Gert’s poems are noise,</i><br><i>Ep sold little boys,</i><br><i>And Hollywood was raped by Wein.</i><br><i><br/></i>It’s rather remarkable to see how some Judeo-Christians will twist and contort themselves to try to somehow a) condemn pedophilia and child molestation while b) avoiding any condemnation of the teachings of their rabbis or the rabbis themselves.</br></br></br></br></br></p><p>Consider this recent Twitter exchange:</p><blockquote><p>Supreme Dark Lord‏ @voxday<br>Hollywood values are Jewish values. There are no “Judeo-Christian” values. Ask any rabbi.</br></p><p>((( ?)))‏ @usershem<br>Why imply that Hollywood degeneracy is a Jewish value?</br></p><p>Mr. Smith‏ @ClazyAsylum<br>Is this the Jewish version of “Islam is a religion of peace”?</br></p><p>((( ?)))‏ @usershem<br>Judaism is not degenerate</br></p><p>Supreme Dark Lord‏ @voxday<br>The entire history of the Jews in the USA proves that to be a false statement. Do you accept Christian morality as the metric?</br></p><p>((( ?)))‏ @usershem<br>I agree that most Jews are degenerate. I disagree that Judaism is degenerate. Most Jews don’t follow Judaism.</br></p><p>Mr. Smith‏ @ClazyAsylum<br>Following Judaism wouldn’t be degenerate at all. <a href=\"https://pbs.twimg.com/media/DNtP7hoVAAU_eNy.jpg\">Oh, wait…</a> (Warning: picture of rabbi performing <i>metzitzah b’peh</i>.)</br></p><p>((( ?)))‏ @usershem<br>What does the rampant pedophilia in the church tell us about Christians?</br></p><p>Supreme Dark Lord‏ @voxday<br>That Vatican II was an abomination, it is a mistake to permit homosexuals in the Church, and Christians should be guided by the Bible.</br></p><p>((( ?)))‏ @usershem<br>I have not seen you condemn pedophila in the church in this exchange. Tell us more about your Christian values.</br></p><p>Supreme Dark Lord‏ @voxday<br>Weak, degenerate. All pedophile clergy in the Church should be excommunicated, then executed. Do you support the same for those rabbis?</br></p><p>((( ?)))‏ @usershem<br>Why can you disavow degeneracy on behalf of Christians but I can’t disavow degeneracy on behalf of Jews?</br></p><p>Supreme Dark Lord‏ @voxday<br>You can. But you are not disavowing the teachings or the authorities that EXPRESSLY PERMIT that degenerate behavior.</br></p><p>((( ?)))‏ @usershem<br>Show me a degenerate teaching and I will condemn it and the claimed authority that teaches it.</br></p><p>Supreme Dark Lord‏ @voxday<br>Do you condemn and disavow Rabbi Simeon ben Yohai? At what age does the Talmud say “the sexual matureness of woman is reached”?</br></p><p>((( ?)))‏ @usershem<br>I’m not a fan of Shimon bar Yohai, since he had a low opinion of common folks.</br></p><p>Supreme Dark Lord‏ @voxday<br>That is not a disavowal. Do it unambiguously. Don’t play word games. Condemn him and disavow him as an evil man teaching evil laws.</br></p><p>((( ?)))‏ @usershem<br>I’m not sure what you hate about bar yohai so much, but I condemn all rape, pedophilia and degeneracy, and any who condone it</br></p><p>Supreme Dark Lord‏ @voxday<br>You are not fooling anyone, liar. You know Simeon ben Yohai’s teachings and yet you will not condemn or disavow him. Why not?</br></p><p>((( ?)))‏ @usershem<br>As far as I know he did not condone pedophilia, but if he did I condemn and disavow. How can I be clearer?</br></p><p>((( ?)))‏ @usershem<br>As for the Talmud, there is a difference between when a woman is a woman and when one is allowed to marry her.</br></p><p>((( ?)))‏ @usershem<br>Talmud does not permit rape, pedophilia or child marriage.</br></p><p>((( ?)))‏ @usershem<br>It does however hold that if a young child is molested/raped in violation of the law she remains a virgin for legal/marriage purposes</br></p><p>((( ?)))‏ @usershem<br>So degenerate, protecting the innocent.</br></p><p>Supreme Dark Lord‏ @voxday<br>No, it is to protect the ASSAILANT. The innocent cannot throw guilt on him. You are literally defending pedophiles now, degenerate.</br></p><p>((( ?)))‏ @usershem<br>Just because a raped child is legally considered a virgin doesn’t mean the rapist is not punished. You are the one contorting.</br></p><p>Supreme Dark Lord‏ @voxday<br>Either condemn Simeon ben Yohai as an evil man teaching evil practices and disavow him or stand revealed as a degenerate pedo-defender.</br></p></blockquote><p>Needless to say, he continued to equivocate and feign ignorance until I finally blocked him for wormtonguery. Now, don’t take my word for any of this. Look up the rabbi’s teachings on sex, marriage, and children, then decide for yourself. But do notice that usershem NEVER ANSWERED the questions that would have nailed down his position, whether it was a Christian metric for morality or the age of female sexual maturity. His behavior was even intellectually shadier than it looks here, because on another tangent he defended the degenerate practice of <i>metzitzah b’peh</i> as abuse, but not molestation, because he somehow magically knows the pure intentions of every rabbi who ever put mouth to underage genitals.</p><p>Also notice the way his attempt to deflect moral degeneracy onto the Christian Church was abandoned as soon as he realized that I was not going to defend the degenerates there, but was perfectly happy to condemn them, disavow them, and see them punished. The contrast between my reaction and his on the subject could not be more clear.</p><p>This is the Judeo-Christianity that our conservative friends hail so warmly. This is the Judeo-Christian values that many conservatives claim to be the basis for America’s founding. This is the intellectual spirit of Judeo-Christ. It is devoted to the exact opposite of the truth as it is designed to conceal, obfuscate, distract, and mislead.</p><p>I did find it a little ironic to see how willing this usershem was to throw literally “most Jews” under the degenerate bus in order to try to break the observable link between the religious teachings and the infamous Hollywood/Media/Wall Street degeneracy. There are plenty of decent Jews who abide by the Christian standards of morality as well as any Christian, and indeed, there are more than a few Christians who happen to be of Jewish descent. They would not hesitate to condemn evil teachings or evil men.</p><p>But it should be obvious that “Judeo-Christianity” is not Christianity and that “Judeo-Christian values” are not Christian values and neither reflect nor respect Christian morality.</p><p>Now, I understand that the urge to defend one’s identity is a natural, powerful, and instinctive one. But should you ever find yourself tempted to defend the ongoing commission of unmitigated evil targeting innocent children on the grounds of tradition, fear, or good intentions, you should seriously consider the source of that temptation. There simply is no defending <a href=\"http://www.dailymail.co.uk/news/article-5051389/Millionaire-antiques-dealer-55-charged-death.html\">this sort of thing</a>, or pretending that there is no possible connection between the medieval teachings and the actions today.</p><p>UPDATE: Larry David <a href=\"https://youtu.be/G0eeNijdv3I?t=225\">does his best</a> to get out in front of the growing Hollywood Values scandal.</p></div>",
  "content_text": "There’s a miserable family called Stein:\nThere’s Gert and there’s Ep and there’s Wein.\nGert’s poems are noise,\nEp sold little boys,\nAnd Hollywood was raped by Wein.\nIt’s rather remarkable to see how some Judeo-Christians will twist and contort themselves to try to somehow a) condemn pedophilia and child molestation while b) avoiding any condemnation of the teachings of their rabbis or the rabbis themselves.\nConsider this recent Twitter exchange:\nSupreme Dark Lord‏ @voxday\nHollywood values are Jewish values. There are no “Judeo-Christian” values. Ask any rabbi.\n((( ?)))‏ @usershem\nWhy imply that Hollywood degeneracy is a Jewish value?\nMr. Smith‏ @ClazyAsylum\nIs this the Jewish version of “Islam is a religion of peace”?\n((( ?)))‏ @usershem\nJudaism is not degenerate\nSupreme Dark Lord‏ @voxday\nThe entire history of the Jews in the USA proves that to be a false statement. Do you accept Christian morality as the metric?\n((( ?)))‏ @usershem\nI agree that most Jews are degenerate. I disagree that Judaism is degenerate. Most Jews don’t follow Judaism.\nMr. Smith‏ @ClazyAsylum\nFollowing Judaism wouldn’t be degenerate at all.\nOh, wait…\n(Warning: picture of rabbi performing\nmetzitzah b’peh\n.)\n((( ?)))‏ @usershem\nWhat does the rampant pedophilia in the church tell us about Christians?\nSupreme Dark Lord‏ @voxday\nThat Vatican II was an abomination, it is a mistake to permit homosexuals in the Church, and Christians should be guided by the Bible.\n((( ?)))‏ @usershem\nI have not seen you condemn pedophila in the church in this exchange. Tell us more about your Christian values.\nSupreme Dark Lord‏ @voxday\nWeak, degenerate. All pedophile clergy in the Church should be excommunicated, then executed. Do you support the same for those rabbis?\n((( ?)))‏ @usershem\nWhy can you disavow degeneracy on behalf of Christians but I can’t disavow degeneracy on behalf of Jews?\nSupreme Dark Lord‏ @voxday\nYou can. But you are not disavowing the teachings or the authorities that EXPRESSLY PERMIT that degenerate behavior.\n((( ?)))‏ @usershem\nShow me a degenerate teaching and I will condemn it and the claimed authority that teaches it.\nSupreme Dark Lord‏ @voxday\nDo you condemn and disavow Rabbi Simeon ben Yohai? At what age does the Talmud say “the sexual matureness of woman is reached”?\n((( ?)))‏ @usershem\nI’m not a fan of Shimon bar Yohai, since he had a low opinion of common folks.\nSupreme Dark Lord‏ @voxday\nThat is not a disavowal. Do it unambiguously. Don’t play word games. Condemn him and disavow him as an evil man teaching evil laws.\n((( ?)))‏ @usershem\nI’m not sure what you hate about bar yohai so much, but I condemn all rape, pedophilia and degeneracy, and any who condone it\nSupreme Dark Lord‏ @voxday\nYou are not fooling anyone, liar. You know Simeon ben Yohai’s teachings and yet you will not condemn or disavow him. Why not?\n((( ?)))‏ @usershem\nAs far as I know he did not condone pedophilia, but if he did I condemn and disavow. How can I be clearer?\n((( ?)))‏ @usershem\nAs for the Talmud, there is a difference between when a woman is a woman and when one is allowed to marry her.\n((( ?)))‏ @usershem\nTalmud does not permit rape, pedophilia or child marriage.\n((( ?)))‏ @usershem\nIt does however hold that if a young child is molested/raped in violation of the law she remains a virgin for legal/marriage purposes\n((( ?)))‏ @usershem\nSo degenerate, protecting the innocent.\nSupreme Dark Lord‏ @voxday\nNo, it is to protect the ASSAILANT. The innocent cannot throw guilt on him. You are literally defending pedophiles now, degenerate.\n((( ?)))‏ @usershem\nJust because a raped child is legally considered a virgin doesn’t mean the rapist is not punished. You are the one contorting.\nSupreme Dark Lord‏ @voxday\nEither condemn Simeon ben Yohai as an evil man teaching evil practices and disavow him or stand revealed as a degenerate pedo-defender.\nNeedless to say, he continued to equivocate and feign ignorance until I finally blocked him for wormtonguery. Now, don’t take my word for any of this. Look up the rabbi’s teachings on sex, marriage, and children, then decide for yourself. But do notice that usershem NEVER ANSWERED the questions that would have nailed down his position, whether it was a Christian metric for morality or the age of female sexual maturity. His behavior was even intellectually shadier than it looks here, because on another tangent he defended the degenerate practice of\nmetzitzah b’peh\nas abuse, but not molestation, because he somehow magically knows the pure intentions of every rabbi who ever put mouth to underage genitals.\nAlso notice the way his attempt to deflect moral degeneracy onto the Christian Church was abandoned as soon as he realized that I was not going to defend the degenerates there, but was perfectly happy to condemn them, disavow them, and see them punished. The contrast between my reaction and his on the subject could not be more clear.\nThis is the Judeo-Christianity that our conservative friends hail so warmly. This is the Judeo-Christian values that many conservatives claim to be the basis for America’s founding. This is the intellectual spirit of Judeo-Christ. It is devoted to the exact opposite of the truth as it is designed to conceal, obfuscate, distract, and mislead.\nI did find it a little ironic to see how willing this usershem was to throw literally “most Jews” under the degenerate bus in order to try to break the observable link between the religious teachings and the infamous Hollywood/Media/Wall Street degeneracy. There are plenty of decent Jews who abide by the Christian standards of morality as well as any Christian, and indeed, there are more than a few Christians who happen to be of Jewish descent. They would not hesitate to condemn evil teachings or evil men.\nBut it should be obvious that “Judeo-Christianity” is not Christianity and that “Judeo-Christian values” are not Christian values and neither reflect nor respect Christian morality.\nNow, I understand that the urge to defend one’s identity is a natural, powerful, and instinctive one. But should you ever find yourself tempted to defend the ongoing commission of unmitigated evil targeting innocent children on the grounds of tradition, fear, or good intentions, you should seriously consider the source of that temptation. There simply is no defending\nthis sort of thing\n, or pretending that there is no possible connection between the medieval teachings and the actions today.\nUPDATE: Larry David\ndoes his best\nto get out in front of the growing Hollywood Values scandal.",
  "tags": [
    "Christianity",
    "law",
    "Zion"
  ],
  "categories": [],
  "sitemap_lastmod": "2017-11-05T13:00:00+00:00"
}