{
  "url": "https://voxday.net/2017/11/02/best-of-brainstorm/",
  "scraped_at": "2025-12-19T10:29:58.561615",
  "title": "Best of Brainstorm",
  "date_display": "November 2, 2017",
  "date_iso": "2017-11-02T01:45:00+00:00",
  "date_from_url": "2017-11-02",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>I received this email today:</p><blockquote class=\"tr_bq\"><p>The webinar “Open Brainstorm with Steve Keen” you ran on our GoToWebinar platform made it to our Top 100 PERSONAL_DEVELOPMENT webinars in 2017. Congratulations on a webinar job well done! ?</p></blockquote><p>So, that’s nice, I suppose. We’re all about the PERSONAL DEVELOPMENT here, right? In more important news, I’ve just about resolved our issues with the webinar provider and will be able to start doing Brainstorms again. The short version is that their company was bought or otherwise reorganized, somewhere along the way a billing mistake was made, and it took an impressively long time to convince someone with sufficient authority there to fix the issue. It was almost amusing when an account representative called today to ask about finally settling the unpaid invoice, I explained that I <u>still</u> had not received any corrected invoice nor did I even know what amount would settle it, to which the woman cheerfully responded she had it right there before promptly producing one with the original incorrect amount.</p><p>You know it’s bad when you don’t even get irritated any more, let alone angry, but simply chuckle a little as it gradually begins to dawn on the person on the other side of the line that you have, in fact, been telling them the simple truth all along.</p></div>",
  "content_text": "I received this email today:\nThe webinar “Open Brainstorm with Steve Keen” you ran on our GoToWebinar platform made it to our Top 100 PERSONAL_DEVELOPMENT webinars in 2017. Congratulations on a webinar job well done! ?\nSo, that’s nice, I suppose. We’re all about the PERSONAL DEVELOPMENT here, right? In more important news, I’ve just about resolved our issues with the webinar provider and will be able to start doing Brainstorms again. The short version is that their company was bought or otherwise reorganized, somewhere along the way a billing mistake was made, and it took an impressively long time to convince someone with sufficient authority there to fix the issue. It was almost amusing when an account representative called today to ask about finally settling the unpaid invoice, I explained that I\nstill\nhad not received any corrected invoice nor did I even know what amount would settle it, to which the woman cheerfully responded she had it right there before promptly producing one with the original incorrect amount.\nYou know it’s bad when you don’t even get irritated any more, let alone angry, but simply chuckle a little as it gradually begins to dawn on the person on the other side of the line that you have, in fact, been telling them the simple truth all along.",
  "tags": [
    "Brainstorm",
    "technology"
  ],
  "categories": [],
  "sitemap_lastmod": "2017-11-02T01:45:00+00:00"
}