{
  "url": "https://voxday.net/2017/11/06/book-review-sapiens-by-yuval-harari-iii/",
  "scraped_at": "2025-12-19T10:30:32.378108",
  "title": "Book Review: SAPIENS by Yuval Harari III",
  "date_display": "November 6, 2017",
  "date_iso": "2017-11-06T18:38:00+00:00",
  "date_from_url": "2017-11-06",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>Review of Yuval Harari’s <i>Sapiens: A Brief History of Humankind</i><br>by C.R.Hallpike</br></p><p>Part III of IV</p><div></div><p>Anyway, what was needed here to control these much larger populations were networks of mass co-operation, under the control of kings, and Harari takes us almost immediately into the world of the ancient empires of Egypt, and Mesopotamia, and Persia and China. But how were these networks of mass communication created?</p><p>He recognises, quite rightly, the importance of writing and mathematics in human history, and claims they were crucial in the emergence of the state:</p><p><i>…in order to maintain a large kingdom, mathematical data was vital. It was never enough to legislate laws and tell stories about guardian gods. One also had to collect taxes. In order to tax hundreds of thousands of people, it was imperative to collect data about people’s incomes and possessions; data about payments made; data about arrears, debts and fines; data about discounts and exemptions. This added up to millions of data bits, which had to be stored and processed (p. 137).</i></p><p>This was beyond the power of the human brain, however.</p><p><i>This mental limitation severely constrained the size and complexity of human collectives. When the amount of people in  a particular society crossed a critical threshold, it became necessary to store and process large amounts of mathematical data. Since the human brain could not do it, the system collapsed. For thousands of years after the Agricultural Revolution, human social networks remained relatively small and simple (p. 137).</i></p><p>But it is simply not true that kingdoms need to collect vast quantities of financial data in order to tax their subjects, or that social systems beyond a certain size collapsed until they had invented writing and a numerical system for recording this data. If Harari were right it would not have been possible for any kingdoms at all to have developed in Sub-Saharan Africa, for example, because there were no forms of writing systems in this region until quite late when a few developed under European or Islamic influence (Ethiopia was a special case.)  Nevertheless, pre-colonial Africa was actually littered with states and even empires that functioned perfectly well without writing.</p><p>They were able to do this because of the undemanding administrative conditions of early kingdoms. These are based on subsistence agriculture without money and have primitive modes of transport, unless they have easy access to river transport like Egypt, Mesopotamia or China. They also have a simple administrative structure based on a hierarchy of local chiefs or officials who play a prominent part in the organization of tribute. The actual expenses of government, apart from the royal court, are therefore relatively small, and the king may have large herds of cattle or other stock, and large estates and labourers to work them to provide food and beer for guests. The primary duty of a ruler is generosity to his nobles and guests, and to his subjects in distress, not to construct vast public works like pyramids. The basic needs of a ruler, besides food supplies, would be prestige articles as gifts of honour, craft products, livestock, and above all men as soldiers and labourers. In Baganda, one of the largest African states, with a population of around two million, tax messengers were sent out when palace resources were running low:</p><p><i>The goods collected were of various kinds –  livestock, cowry shells, iron hoe-blades, and the cloths made from the bark of a fig-tree beaten out thin [for clothing and bedding]…Cattle were required of superior chiefs, goats and hoes of lesser ones, and the peasants contributed the cowry shells and barkcloths….the tax-gatherers did not take a proportion of every herd but required a fixed number of cattle from each chief. Of course the hoes and barkcloths had to be new, and they were not made and stored up in anticipation of the tax-collection. It took some little time to produce the required number, and the tax-gatherers had to wait for this and then supervise the transport of the goods and cattle, first to the saza [district] headquarters and then to the capital. The amount due was calculated in consultation with the subordinates of the saza chiefs who were supposed to know the exact number of men under their authority, and they were responsible for seeing that it was delivered (Mair 1962:163). </i><i>(Manpower was recruited in basically the same way, and in Africa generally was made up of slaves and corvée labour.)</i></p><p>Nor do early states require written law codes in the style of Hamurabi, and most cases can be settled orally by traditional local courts. No doubt, the demands of administering early states made writing and mathematical notation very useful, and eventually indispensable, but the kinds of financial data that Harari deems essential for a tax system could only have been available in very advanced societies. As we have just seen, very much simpler systems were quite viable. (Since the Sumerian system of mathematical notation is the example that Harari chooses to illustrate the link between taxation, writing, and mathematics, it is a pity that he gets it wrong. The Sumerians did not, as he supposes, use a ‘a combination of base 6 and base 10 numeral systems’. As is well-known, they actually used base 60, with sub-base 10 to count from 1 – 59, 61 – 119, and so on. [Chrisomalis 2010:241-45])<br><i><br/></i><i>When the Agricultural Revolution opened opportunities for the creation of crowded cities and mighty empires, people invented stories about great gods, motherlands and joint-stock companies to provide the needed social links. (p. 115)  </i></br></p><p>The idea of people ‘inventing’ religious beliefs to ‘provide the needed social links’ comes out of the same rationalist stable as the claim that kings invented religious beliefs to justify their oppression of their subjects and that capitalists did the same to justify their exploitation of their workers. Religious belief simply doesn’t work like that. It is true, however, that what he calls universal and missionary religions started appearing in the first millennium BC.</p><p><i>Their emergence was one of the most important revolutions in history, and made a vital contribution to the unification of humankind, much like the emergence of universal empires and universal money. (p. 235)</i></p><p>But his chapter on the rise of the universal religions is extremely weak, and his explanation  of monotheism, for example, goes as follows:<br><i><br/></i><i>With time some followers of polytheist gods became so fond of their particular patron that they drifted away from the basic polytheist insight. They began to believe that their god was the only god, and that He was in fact the supreme power of the universe. Yet at the same time they continued to view Him as possessing interests and biases, and believed that they could strike deals with Him. Thus were born monotheist religions, whose followers beseech the supreme power of the universe to help them recover from illness, win the lottery and gain victory in war. (p. 242)</i><br><i><br/></i>This is amateurish speculation, and Harari does not even seem to have heard of the Axial Age. This is the term applied by historians to the period of social turmoil that occurred during the first millennium BC across Eurasia, of political instability, warfare, increased commerce and the appearance of coinage, and urbanization, that in various ways eroded traditional social values and social bonds. The search for meaning led to a new breed of thinkers, prophets and philosophers who searched for a more transcendent and universal authority on how we should live and gain tranquillity of mind, that went beyond the limits of their own society and traditions, and beyond purely material prosperity. People developed a much more articulate awareness of the mind and the self than hitherto, and also rejected the old pagan values of worldly success and materialism. As one authority has put it:</br></br></p><p>‘Everywhere one notices attempts to introduce greater purity, greater justice, greater perfection, and a more universal explanation of things’ (Momigliano 1975:8-9; see also Hallpike 2008:236-65).</p><p>One of the consequences of this new cultural order was a fundamental rethinking of religion, so that the old pagan gods began to seem morally and intellectually contemptible. Instead of this naively human image of the gods, said the Greek Xenophanes, ‘One God there is…in no way like mortal creatures either in bodily form or in the thought of his mind… effectively, he wields all things by the thought of his mind.’ So we find all across the Old World the idea developing of a rational cosmic order, a divine universal law, known to the Greeks as Logos, to the Indians as Brahman, to the Jews as Hokhma, and to the Chinese as Tao. This also involved the very important idea that the essential and distinctive mental element in man is akin to the creative and ordering element in the cosmos, of Man as microcosm in relation to the macrocosm.</p><p><span style=\"white-space: pre;\"> </span>Intellectually, the idea that the universe makes sense at some deep level, that it is governed by a unified body of rational laws given by a divine Creator, became an essential belief for the development of science, not only among the Greeks, but in the Middle Ages and the Renaissance. As Joseph Needham has said, ‘…historically the question remains whether natural science could ever have reached its present stage of development without passing through a “theological stage” ‘ (Needham 1956:582).</p><p>Against this new intellectual background it also became much easier to think of Man not as a citizen of a particular state, but in universal terms as a moral being. There is the growth of the idea of a common humanity which transcends the boundaries of nation and culture and social distinctions of rank, such as slavery, so that all good men are brothers, and the ideal condition of Man would be universal peace (Hallpike 2016:167-218).</p><p>Harari tries to create a distinction between ‘monotheistic’ religions such as Judaism, Christianity, and Islam, and ‘natural law religions’, without gods in which he includes Buddhism, Taoism, Confucianism, Stoicism, and the Epicureans. From what I have said about the concepts of Logos, Hokhma, Brahman, and Tao it should be clear that his two types of religion actually had  much in common. In Christianity, for example, Jesus was almost immediately identified with the Logos. The Epicureans, however, do not belong in this group at all as they were ancient materialist atheists who did not believe in natural law of any kind.<span style=\"white-space: pre;\"> </span>One of the most obvious facts about states in history is that they all were hierarchical, dividing people into different classes with kings and nobles at the top enjoying wealth and luxury, and peasants or slaves at the bottom in poverty, men privileged over women, some ethnic groups privileged over others, and so on. Harari attributes all this to the invention of writing, and to the ‘imagined orders’ that sustained the large networks involved in state organization.</p><p><i>The imagined orders sustaining these networks were neither neutral nor fair. They divided people into make-believe groups, arranged in a hierarchy. The upper levels enjoyed privileges and power, while the lower ones suffered from discrimination. Hammurabi’s Code, for example established a pecking order of superiors, commoners and slaves. Superiors got all the good things in life. Commoners got what was left. Slaves got a beating if they complained. (p. 149)</i><br><i><br/></i> But since these sorts of hierarchies in state societies are universal in what sense can they have simply been ‘make-believe’? Doesn’t this universality suggest that there were actually laws of social and economic development at work here which require sociological analysis? Simply saying that ‘there is no justice in history’ is hardly good enough. In particular, he fails to notice two very significant types of inequality, that of merchants in relation to the upper classes, and of craftsmen in relation to scholars, which had major implications for the development of civilisation, but to which I shall return later.</br></p><p>Harari says that religion and empires have been two of the three great unifiers of the human race, along with money:<i> </i><br><i><br/></i><i>Empires were one of the main reasons for the drastic reduction in human diversity. The imperial steamroller gradually obliterated the unique characteristics of numerous peoples…forging out of them new and much larger groups (p. 213)</i></br></p><p>These claims have a good deal of truth but they are also quite familiar, so I shall not go into Harari’s discussion of this theme, except for his strange notion of ‘Afro-Asia’, which he describes not only as an ecological system but also as having some sort of cultural unity, e.g. <i>‘During the first millennium BC, religions of an altogether new kind began to spread through Afro-Asia’ (p. 249). </i></p><p>Culturally, however, sub-Saharan Africa was entirely cut off from developments in Europe and Asia until Islamic influence began spreading into West Africa in the eighth century AD, and has been largely irrelevant to world history except as a source of slaves and raw materials. And as Diamond pointed out in Guns, Germs and Steel, Africa is an entirely distinct ecological system because it is oriented north/south, so that it is divided by its climatic zones, whereas Eurasia is oriented east/west, so that the same climatic zones extend all across it, and wheat and horses for example are found all the way from Ireland to Japan.<br><span style=\"white-space: pre;\"> </span><br>Harari says that at the beginning of the sixteenth century, 90{b05c51a15f0a42d8e7dd687f4cc4bfffd66a97ee173a2742c6182468204332c9} of humans still lived in ‘the single mega-world of Afro-Asia’, while the rest lived in the Meso-American, Andean, and Oceanic worlds. ‘Over the next 300 years the Afro-Asian giant swallowed up all the other worlds’, by which he actually means the expanding colonial empires of the Spanish, Portuguese, Dutch, French and British.</br></br></p><p>But to refer to these nations as ‘Afro-Asian’  is conspicuously absurd, and the whole concept of Afro-Asia is actually meaningless from every point of view. The general idea of Eurasia, however, does make a good deal of cultural as well as ecological sense, not only because it recognises the obvious importance of Europe, but because of the cultural links that went to and fro across it, so that the early navigators of the fifteenth century were using the Chinese inventions of magnetic compasses, stern-post rudders, paper for their charts, and gunpowder, and were making their voyages to find sea-routes from Europe to China and the East Indies rather than relying on overland trade.</p><p><i>Part IV will be posted tomorrow.</i></p></div>",
  "content_text": "Review of Yuval Harari’s\nSapiens: A Brief History of Humankind\nby C.R.Hallpike\nPart III of IV\nAnyway, what was needed here to control these much larger populations were networks of mass co-operation, under the control of kings, and Harari takes us almost immediately into the world of the ancient empires of Egypt, and Mesopotamia, and Persia and China. But how were these networks of mass communication created?\nHe recognises, quite rightly, the importance of writing and mathematics in human history, and claims they were crucial in the emergence of the state:\n…in order to maintain a large kingdom, mathematical data was vital. It was never enough to legislate laws and tell stories about guardian gods. One also had to collect taxes. In order to tax hundreds of thousands of people, it was imperative to collect data about people’s incomes and possessions; data about payments made; data about arrears, debts and fines; data about discounts and exemptions. This added up to millions of data bits, which had to be stored and processed (p. 137).\nThis was beyond the power of the human brain, however.\nThis mental limitation severely constrained the size and complexity of human collectives. When the amount of people in  a particular society crossed a critical threshold, it became necessary to store and process large amounts of mathematical data. Since the human brain could not do it, the system collapsed. For thousands of years after the Agricultural Revolution, human social networks remained relatively small and simple (p. 137).\nBut it is simply not true that kingdoms need to collect vast quantities of financial data in order to tax their subjects, or that social systems beyond a certain size collapsed until they had invented writing and a numerical system for recording this data. If Harari were right it would not have been possible for any kingdoms at all to have developed in Sub-Saharan Africa, for example, because there were no forms of writing systems in this region until quite late when a few developed under European or Islamic influence (Ethiopia was a special case.)  Nevertheless, pre-colonial Africa was actually littered with states and even empires that functioned perfectly well without writing.\nThey were able to do this because of the undemanding administrative conditions of early kingdoms. These are based on subsistence agriculture without money and have primitive modes of transport, unless they have easy access to river transport like Egypt, Mesopotamia or China. They also have a simple administrative structure based on a hierarchy of local chiefs or officials who play a prominent part in the organization of tribute. The actual expenses of government, apart from the royal court, are therefore relatively small, and the king may have large herds of cattle or other stock, and large estates and labourers to work them to provide food and beer for guests. The primary duty of a ruler is generosity to his nobles and guests, and to his subjects in distress, not to construct vast public works like pyramids. The basic needs of a ruler, besides food supplies, would be prestige articles as gifts of honour, craft products, livestock, and above all men as soldiers and labourers. In Baganda, one of the largest African states, with a population of around two million, tax messengers were sent out when palace resources were running low:\nThe goods collected were of various kinds –  livestock, cowry shells, iron hoe-blades, and the cloths made from the bark of a fig-tree beaten out thin [for clothing and bedding]…Cattle were required of superior chiefs, goats and hoes of lesser ones, and the peasants contributed the cowry shells and barkcloths….the tax-gatherers did not take a proportion of every herd but required a fixed number of cattle from each chief. Of course the hoes and barkcloths had to be new, and they were not made and stored up in anticipation of the tax-collection. It took some little time to produce the required number, and the tax-gatherers had to wait for this and then supervise the transport of the goods and cattle, first to the saza [district] headquarters and then to the capital. The amount due was calculated in consultation with the subordinates of the saza chiefs who were supposed to know the exact number of men under their authority, and they were responsible for seeing that it was delivered (Mair 1962:163).\n(Manpower was recruited in basically the same way, and in Africa generally was made up of slaves and corvée labour.)\nNor do early states require written law codes in the style of Hamurabi, and most cases can be settled orally by traditional local courts. No doubt, the demands of administering early states made writing and mathematical notation very useful, and eventually indispensable, but the kinds of financial data that Harari deems essential for a tax system could only have been available in very advanced societies. As we have just seen, very much simpler systems were quite viable. (Since the Sumerian system of mathematical notation is the example that Harari chooses to illustrate the link between taxation, writing, and mathematics, it is a pity that he gets it wrong. The Sumerians did not, as he supposes, use a ‘a combination of base 6 and base 10 numeral systems’. As is well-known, they actually used base 60, with sub-base 10 to count from 1 – 59, 61 – 119, and so on. [Chrisomalis 2010:241-45])\nWhen the Agricultural Revolution opened opportunities for the creation of crowded cities and mighty empires, people invented stories about great gods, motherlands and joint-stock companies to provide the needed social links. (p. 115)\nThe idea of people ‘inventing’ religious beliefs to ‘provide the needed social links’ comes out of the same rationalist stable as the claim that kings invented religious beliefs to justify their oppression of their subjects and that capitalists did the same to justify their exploitation of their workers. Religious belief simply doesn’t work like that. It is true, however, that what he calls universal and missionary religions started appearing in the first millennium BC.\nTheir emergence was one of the most important revolutions in history, and made a vital contribution to the unification of humankind, much like the emergence of universal empires and universal money. (p. 235)\nBut his chapter on the rise of the universal religions is extremely weak, and his explanation  of monotheism, for example, goes as follows:\nWith time some followers of polytheist gods became so fond of their particular patron that they drifted away from the basic polytheist insight. They began to believe that their god was the only god, and that He was in fact the supreme power of the universe. Yet at the same time they continued to view Him as possessing interests and biases, and believed that they could strike deals with Him. Thus were born monotheist religions, whose followers beseech the supreme power of the universe to help them recover from illness, win the lottery and gain victory in war. (p. 242)\nThis is amateurish speculation, and Harari does not even seem to have heard of the Axial Age. This is the term applied by historians to the period of social turmoil that occurred during the first millennium BC across Eurasia, of political instability, warfare, increased commerce and the appearance of coinage, and urbanization, that in various ways eroded traditional social values and social bonds. The search for meaning led to a new breed of thinkers, prophets and philosophers who searched for a more transcendent and universal authority on how we should live and gain tranquillity of mind, that went beyond the limits of their own society and traditions, and beyond purely material prosperity. People developed a much more articulate awareness of the mind and the self than hitherto, and also rejected the old pagan values of worldly success and materialism. As one authority has put it:\n‘Everywhere one notices attempts to introduce greater purity, greater justice, greater perfection, and a more universal explanation of things’ (Momigliano 1975:8-9; see also Hallpike 2008:236-65).\nOne of the consequences of this new cultural order was a fundamental rethinking of religion, so that the old pagan gods began to seem morally and intellectually contemptible. Instead of this naively human image of the gods, said the Greek Xenophanes, ‘One God there is…in no way like mortal creatures either in bodily form or in the thought of his mind… effectively, he wields all things by the thought of his mind.’ So we find all across the Old World the idea developing of a rational cosmic order, a divine universal law, known to the Greeks as Logos, to the Indians as Brahman, to the Jews as Hokhma, and to the Chinese as Tao. This also involved the very important idea that the essential and distinctive mental element in man is akin to the creative and ordering element in the cosmos, of Man as microcosm in relation to the macrocosm.\nIntellectually, the idea that the universe makes sense at some deep level, that it is governed by a unified body of rational laws given by a divine Creator, became an essential belief for the development of science, not only among the Greeks, but in the Middle Ages and the Renaissance. As Joseph Needham has said, ‘…historically the question remains whether natural science could ever have reached its present stage of development without passing through a “theological stage” ‘ (Needham 1956:582).\nAgainst this new intellectual background it also became much easier to think of Man not as a citizen of a particular state, but in universal terms as a moral being. There is the growth of the idea of a common humanity which transcends the boundaries of nation and culture and social distinctions of rank, such as slavery, so that all good men are brothers, and the ideal condition of Man would be universal peace (Hallpike 2016:167-218).\nHarari tries to create a distinction between ‘monotheistic’ religions such as Judaism, Christianity, and Islam, and ‘natural law religions’, without gods in which he includes Buddhism, Taoism, Confucianism, Stoicism, and the Epicureans. From what I have said about the concepts of Logos, Hokhma, Brahman, and Tao it should be clear that his two types of religion actually had  much in common. In Christianity, for example, Jesus was almost immediately identified with the Logos. The Epicureans, however, do not belong in this group at all as they were ancient materialist atheists who did not believe in natural law of any kind.\nOne of the most obvious facts about states in history is that they all were hierarchical, dividing people into different classes with kings and nobles at the top enjoying wealth and luxury, and peasants or slaves at the bottom in poverty, men privileged over women, some ethnic groups privileged over others, and so on. Harari attributes all this to the invention of writing, and to the ‘imagined orders’ that sustained the large networks involved in state organization.\nThe imagined orders sustaining these networks were neither neutral nor fair. They divided people into make-believe groups, arranged in a hierarchy. The upper levels enjoyed privileges and power, while the lower ones suffered from discrimination. Hammurabi’s Code, for example established a pecking order of superiors, commoners and slaves. Superiors got all the good things in life. Commoners got what was left. Slaves got a beating if they complained. (p. 149)\nBut since these sorts of hierarchies in state societies are universal in what sense can they have simply been ‘make-believe’? Doesn’t this universality suggest that there were actually laws of social and economic development at work here which require sociological analysis? Simply saying that ‘there is no justice in history’ is hardly good enough. In particular, he fails to notice two very significant types of inequality, that of merchants in relation to the upper classes, and of craftsmen in relation to scholars, which had major implications for the development of civilisation, but to which I shall return later.\nHarari says that religion and empires have been two of the three great unifiers of the human race, along with money:\nEmpires were one of the main reasons for the drastic reduction in human diversity. The imperial steamroller gradually obliterated the unique characteristics of numerous peoples…forging out of them new and much larger groups (p. 213)\nThese claims have a good deal of truth but they are also quite familiar, so I shall not go into Harari’s discussion of this theme, except for his strange notion of ‘Afro-Asia’, which he describes not only as an ecological system but also as having some sort of cultural unity, e.g.\n‘During the first millennium BC, religions of an altogether new kind began to spread through Afro-Asia’ (p. 249).\nCulturally, however, sub-Saharan Africa was entirely cut off from developments in Europe and Asia until Islamic influence began spreading into West Africa in the eighth century AD, and has been largely irrelevant to world history except as a source of slaves and raw materials. And as Diamond pointed out in Guns, Germs and Steel, Africa is an entirely distinct ecological system because it is oriented north/south, so that it is divided by its climatic zones, whereas Eurasia is oriented east/west, so that the same climatic zones extend all across it, and wheat and horses for example are found all the way from Ireland to Japan.\nHarari says that at the beginning of the sixteenth century, 90{b05c51a15f0a42d8e7dd687f4cc4bfffd66a97ee173a2742c6182468204332c9} of humans still lived in ‘the single mega-world of Afro-Asia’, while the rest lived in the Meso-American, Andean, and Oceanic worlds. ‘Over the next 300 years the Afro-Asian giant swallowed up all the other worlds’, by which he actually means the expanding colonial empires of the Spanish, Portuguese, Dutch, French and British.\nBut to refer to these nations as ‘Afro-Asian’  is conspicuously absurd, and the whole concept of Afro-Asia is actually meaningless from every point of view. The general idea of Eurasia, however, does make a good deal of cultural as well as ecological sense, not only because it recognises the obvious importance of Europe, but because of the cultural links that went to and fro across it, so that the early navigators of the fifteenth century were using the Chinese inventions of magnetic compasses, stern-post rudders, paper for their charts, and gunpowder, and were making their voyages to find sea-routes from Europe to China and the East Indies rather than relying on overland trade.\nPart IV will be posted tomorrow.",
  "tags": [
    "BookReview",
    "history",
    "science"
  ],
  "categories": [],
  "sitemap_lastmod": "2017-11-06T18:38:00+00:00"
}