{
  "url": "https://voxday.net/2017/11/08/book-review-sapiens-by-yuval-harari-iv/",
  "scraped_at": "2025-12-19T10:30:47.261705",
  "title": "Book Review: SAPIENS by Yuval Harari IV",
  "date_display": "November 8, 2017",
  "date_iso": "2017-11-08T16:36:00+00:00",
  "date_from_url": "2017-11-08",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>Review of Yuval Harari’s <i>Sapiens: A Brief History of Humankind</i><br>by C.R.Hallpike<br><a href=\"http://www.hallpike.com/A{b05c51a15f0a42d8e7dd687f4cc4bfffd66a97ee173a2742c6182468204332c9}20review{b05c51a15f0a42d8e7dd687f4cc4bfffd66a97ee173a2742c6182468204332c9}20of{b05c51a15f0a42d8e7dd687f4cc4bfffd66a97ee173a2742c6182468204332c9}20Sapiens.pdf\"><i>The complete PDF</i></a></br></br></p><p>Part IV of IV</p><p>Harari’s next major turning point in world history he refers to, reasonably enough, as  ‘The Scientific Revolution’.  <i>Around AD 1500 ‘It began in western Europe, a large peninsula on the western tip of Afro-Asia, which up till then played no important role in history.’ (p. 272) </i>This is a unconvincing assessment of a region that had been the seat of the Roman Empire, the Christian Church, and Greek science which was one of the essential foundations of the Scientific Revolution. Harari’s opinions about how this got started are even less persuasive:</p><p><i>The Scientific Revolution has not been a revolution of knowledge. It has above all been a revolution of ignorance. The great discovery that launched the Scientific Revolution was the discovery that humans do not know the answers to their most important question. (</i><i>p. </i><i>279).</i></p><p>This is a statement whose truth is not immediately obvious, and he justifies it as follows:<br><i><br/></i><i>Premodern traditions of knowledge such as Islam, Christianity, Buddhism and Confucianism asserted that everything that is important to know about the world was already known. The great gods, or the one almighty God, or the wise people of the past possessed all-encompassing wisdom, which they revealed to us in scriptures and oral traditions (</i><i>pp. </i><i>279-80).</i></br></p><p>These traditions may have claimed to know all that was essential to salvation and peace of mind, but that kind of knowledge had nothing whatsoever to do with pre-modern traditions of science. In Europe this meant Aristotle and Greek natural philosophy but about which, astonishingly, Harari has nothing at all to say anywhere in his book. Apart from a willingness to admit ignorance and embrace new knowledge, science</p><p><i>…has a common core of research methods, which are all based on collecting empirical observations – those we can observe with at least one of our senses – and putting them together with the help of mathematical tools (</i><i>p. </i><i>283).</i></p><p>This is a nineteenth-century view of what science does, whereas the really distinctive feature of modern science is that it tests theory by experiment, and does not simply collect empirical observations. On why modern science developed specifically in Europe Harari has the following explanation:</p><p><i>The key factor was that the plant-seeking botanist and the colony-seeking naval officer shared a similar mindset. Both scientist and conqueror began by admitting ignorance – they both said ‘I don’t know what’s out there.’ They both felt compelled to go out and make new discoveries. And they both hoped that the new knowledge would make them masters of the world (pp. 316-17).</i></p><p>Botany was actually of quite minor importance in the early stages of modern science, which was dominated by studies of terrestrial and celestial motion (Copernicus, Galileo, Kepler, and Newton), and by chemistry which involved the revival of Greek atomism. And Columbus, to take a useful example of ‘a colony-seeking naval officer’ knew quite well what was out there. He knew that the earth is round, and concluded that if he sailed west for long enough he would find a new route to the East Indies. So when he reached the islands of the Caribbean he was convinced that their inhabitants were ‘Indians’ and never changed his mind. I think we can perhaps do a little better than Harari in explaining the European origin of modern science.</p><p>Greek science was dominated by the belief that reason, and particularly mathematics, was the true path to knowledge and its role was to be the tutor of the senses, not to be taught by them. The idea of performing an experiment did not really exist, and the great Alexandrian engineer Hero, for example believed that water pressure does not increase with depth. He defended this belief with an ingenious theory from Archimedes, but ignored the practical experiment of taking a glass down to the bottom of a pool where it could easily have been seen that the water rises higher inside the glass the deeper it is taken. Aristotle’s theories of terrestrial and celestial motion, and Ptolemy’s elaborate geometrical model of the heavens, for example, were seen as triumphs of reason, and were inherited by the medieval European universities who began a critical study of them. The importance of Greek science, however,  was not that it was right – it contained fundamental errors – but that it presented a coherent theoretical model of how the world worked that stimulated thought and could be tested.</p><p><span style=\"white-space: pre;\"></span>The Islamic world had transmitted much of Greek science to medieval Europe, and Aristotle in particular was greatly admired by Muslim scholars as ‘The Philosopher’. But under the influence of the clerics Islam eventually turned against reason and science as dangerous to religion, and this renaissance died out. In rather similar fashion, the Byzantine Emperor Justinian closed the philosophy schools of Athens in 529 AD because he considered them dangerous to Christianity. But while in the thirteenth century several Popes, for the same reason, tried to forbid the study of Aristotle in the universities, they were ignored and in fact by the end of the century Aquinas had been able to publish his synthesis of Aristotelian philosophy and Christian theology in the Summa Theologica.<span style=\"white-space: pre;\"> </span></p><p>This illustrates a vital difference between Europe and the other imperial civilisations. Whereas the Caliph and the Byzantine Emperor had the authority to impose intellectual orthodoxy, in Europe the Popes could not enforce their will on society, and neither could the secular authorities, because there were too many competing jurisdictions – of the Holy Roman Emperor, of kings, of free cities, of universities, and between church and state themselves. Another vital difference was that in the other imperial civilisations there was that basic gulf between scholars and artisans and between merchants and the rest of the upper classes to which I referred earlier. Medieval European towns and cities, however, were run by merchants, together with the artisans and their guilds, so that the social status of artisans in particular was very much higher than in other cultures, and it was possible for them to interact socially with learned scholars. This interaction with scholars occurred in the context of a wide range of interests that combined book-learning with practical skills: alchemy, astrology, medicine, painting, printing, clock-making, the magnetic compass, gunpowder and gunnery, lens-grinding for spectacles, and so on. These skills were also intimately involved in the making of money in a commercially dynamic society.</p><p>It is highly significant that this interaction between scholars and artisans also occurred in the intellectual atmosphere of ‘natural magic’, the belief that the entire universe is a vast system of interrelated correspondences, a hierarchy in which everything acts upon everything else. Alchemy and astrology were the most important components of this tradition, but by the thirteenth century Roger Bacon, for example, was arguing that by applying philosophy and mathematics to the study of nature it would be possible to produce all sorts of technological marvels such as horseless vehicles, flying machines, and glasses for seeing great distances. It was not therefore the admission of ignorance that was truly revolutionary, but  the idea that science could be useful in mastering nature for the benefit of Man.</p><p>By the time of Galileo, whom Harari does not even mention, the idea that science should be useful had become a dominant idea of Western science. Galileo was very much in the natural magic tradition and was a prime example of a man of learning who was equally at home in the workshop as in the library – as is well-known, when he heard of the Dutch invention of the telescope he constructed one himself and ground his own lenses to do so. But Galileo was also enormously important in showing the crucial part that experiment had in the advancement of science. He was keenly interested in Aristotle’s theory of terrestrial motion and is said to have tested the theory that heavier bodies fall faster than light ones by dropping them from the leaning tower of Pisa. This is somewhat mythical, but he certainly carried out detailed experiments with metal balls by rolling them down sloping planks to discover the basic laws of acceleration. He did not simply observe, but designed specific experiments to test theories. This is the hall-mark of modern science, and it emerged in the circumstances that I have just described so that reason and the evidence of the senses were thus harmonized in the modern form of natural science. (On the origins of science see Hallpike 2008:288-353; 396-428).</p><p>Science, then, is not exactly Harari’s strong point, so we need spend little time on the concluding part of his book, which is taken up with speculation about where science and technology are likely to take the human race in the next hundred years. He concludes, however, with some plaintive remarks about our inability to plan our future: <i>‘we remain unsure of our goals’, ‘nobody knows where we are going’, ‘we are more powerful than ever before, but have very little idea what to do with all that power’ (pp. 465-66). </i>He has just written a book showing that mankind’s social and cultural evolution has been a process over which no-one could have had any control. So why does he suddenly seize upon the extraordinary fiction that there ought to be some ‘we’ who could now decide where we all go next? Even if such a ‘we’ existed, let us say in the form of the United Nations, how could it know what to do anyway? </p><p>Throughout the book there is also a strange vacillation between hard-nosed Darwinism and egalitarian sentiment. On one hand Harari quite justifiably mocks the humanists’ naive belief in human rights, for not realising that these rights are based on Christianity, and that a huge gulf has actually opened up between the findings of science and modern liberal ideals. But on the other hand it is rather bewildering to find him also indulging in long poetic laments about the thousands of years of injustice, inequality and suffering imposed on the masses by the great states and empires of history, and our cruelty to our animal ‘slaves’ whom we have slaughtered and exterminated in such vast numbers, so that he concludes ‘The Sapiens reign on earth has so far produced little that we can be proud of’. But a consistent Darwinist should surely rejoice to see such a fine demonstration of the survival of the fittest, with other species either decimated or subjected to human rule, and the poor regularly ground under foot in the struggle for survival. Indeed, the future looks even better for Darwinism, with nation states themselves about to be submerged by a mono-cultural world order, in which we ourselves are destined to be replaced by a superhuman race of robots.</p><p>It has been rightly said that:</p><p><i>Harari’s view of culture and of ethical norms as fundamentally fictional makes impossible any coherent moral framework for thinking about and shaping our future. And it asks us to pretend that we are not what we know ourselves to be – thinking and feeling subjects, moral agents with free will, and social beings whose culture builds upon the facts of the physical world but is not limited to them (Sexton 2015:120).</i></p><p>Summing up the book as a whole, one has often had to point out how surprisingly little he seems to have read on quite a number of essential topics. It would be fair to say that whenever his facts are broadly correct they are not new, and whenever he tries to strike out on his own he often gets things wrong, sometimes seriously. So we should not judge Sapiens as a serious contribution to knowledge but as ‘infotainment’, a publishing event to titillate its readers by a wild intellectual ride across the  landscape of history, dotted with sensational displays of speculation, and ending with blood-curdling predictions about human destiny. By these criteria it is a most successful book. </p></div>",
  "content_text": "Review of Yuval Harari’s\nSapiens: A Brief History of Humankind\nby C.R.Hallpike\nThe complete PDF\nPart IV of IV\nHarari’s next major turning point in world history he refers to, reasonably enough, as  ‘The Scientific Revolution’.\nAround AD 1500 ‘It began in western Europe, a large peninsula on the western tip of Afro-Asia, which up till then played no important role in history.’ (p. 272)\nThis is a unconvincing assessment of a region that had been the seat of the Roman Empire, the Christian Church, and Greek science which was one of the essential foundations of the Scientific Revolution. Harari’s opinions about how this got started are even less persuasive:\nThe Scientific Revolution has not been a revolution of knowledge. It has above all been a revolution of ignorance. The great discovery that launched the Scientific Revolution was the discovery that humans do not know the answers to their most important question. (\np.\n279).\nThis is a statement whose truth is not immediately obvious, and he justifies it as follows:\nPremodern traditions of knowledge such as Islam, Christianity, Buddhism and Confucianism asserted that everything that is important to know about the world was already known. The great gods, or the one almighty God, or the wise people of the past possessed all-encompassing wisdom, which they revealed to us in scriptures and oral traditions (\npp.\n279-80).\nThese traditions may have claimed to know all that was essential to salvation and peace of mind, but that kind of knowledge had nothing whatsoever to do with pre-modern traditions of science. In Europe this meant Aristotle and Greek natural philosophy but about which, astonishingly, Harari has nothing at all to say anywhere in his book. Apart from a willingness to admit ignorance and embrace new knowledge, science\n…has a common core of research methods, which are all based on collecting empirical observations – those we can observe with at least one of our senses – and putting them together with the help of mathematical tools (\np.\n283).\nThis is a nineteenth-century view of what science does, whereas the really distinctive feature of modern science is that it tests theory by experiment, and does not simply collect empirical observations. On why modern science developed specifically in Europe Harari has the following explanation:\nThe key factor was that the plant-seeking botanist and the colony-seeking naval officer shared a similar mindset. Both scientist and conqueror began by admitting ignorance – they both said ‘I don’t know what’s out there.’ They both felt compelled to go out and make new discoveries. And they both hoped that the new knowledge would make them masters of the world (pp. 316-17).\nBotany was actually of quite minor importance in the early stages of modern science, which was dominated by studies of terrestrial and celestial motion (Copernicus, Galileo, Kepler, and Newton), and by chemistry which involved the revival of Greek atomism. And Columbus, to take a useful example of ‘a colony-seeking naval officer’ knew quite well what was out there. He knew that the earth is round, and concluded that if he sailed west for long enough he would find a new route to the East Indies. So when he reached the islands of the Caribbean he was convinced that their inhabitants were ‘Indians’ and never changed his mind. I think we can perhaps do a little better than Harari in explaining the European origin of modern science.\nGreek science was dominated by the belief that reason, and particularly mathematics, was the true path to knowledge and its role was to be the tutor of the senses, not to be taught by them. The idea of performing an experiment did not really exist, and the great Alexandrian engineer Hero, for example believed that water pressure does not increase with depth. He defended this belief with an ingenious theory from Archimedes, but ignored the practical experiment of taking a glass down to the bottom of a pool where it could easily have been seen that the water rises higher inside the glass the deeper it is taken. Aristotle’s theories of terrestrial and celestial motion, and Ptolemy’s elaborate geometrical model of the heavens, for example, were seen as triumphs of reason, and were inherited by the medieval European universities who began a critical study of them. The importance of Greek science, however,  was not that it was right – it contained fundamental errors – but that it presented a coherent theoretical model of how the world worked that stimulated thought and could be tested.\nThe Islamic world had transmitted much of Greek science to medieval Europe, and Aristotle in particular was greatly admired by Muslim scholars as ‘The Philosopher’. But under the influence of the clerics Islam eventually turned against reason and science as dangerous to religion, and this renaissance died out. In rather similar fashion, the Byzantine Emperor Justinian closed the philosophy schools of Athens in 529 AD because he considered them dangerous to Christianity. But while in the thirteenth century several Popes, for the same reason, tried to forbid the study of Aristotle in the universities, they were ignored and in fact by the end of the century Aquinas had been able to publish his synthesis of Aristotelian philosophy and Christian theology in the Summa Theologica.\nThis illustrates a vital difference between Europe and the other imperial civilisations. Whereas the Caliph and the Byzantine Emperor had the authority to impose intellectual orthodoxy, in Europe the Popes could not enforce their will on society, and neither could the secular authorities, because there were too many competing jurisdictions – of the Holy Roman Emperor, of kings, of free cities, of universities, and between church and state themselves. Another vital difference was that in the other imperial civilisations there was that basic gulf between scholars and artisans and between merchants and the rest of the upper classes to which I referred earlier. Medieval European towns and cities, however, were run by merchants, together with the artisans and their guilds, so that the social status of artisans in particular was very much higher than in other cultures, and it was possible for them to interact socially with learned scholars. This interaction with scholars occurred in the context of a wide range of interests that combined book-learning with practical skills: alchemy, astrology, medicine, painting, printing, clock-making, the magnetic compass, gunpowder and gunnery, lens-grinding for spectacles, and so on. These skills were also intimately involved in the making of money in a commercially dynamic society.\nIt is highly significant that this interaction between scholars and artisans also occurred in the intellectual atmosphere of ‘natural magic’, the belief that the entire universe is a vast system of interrelated correspondences, a hierarchy in which everything acts upon everything else. Alchemy and astrology were the most important components of this tradition, but by the thirteenth century Roger Bacon, for example, was arguing that by applying philosophy and mathematics to the study of nature it would be possible to produce all sorts of technological marvels such as horseless vehicles, flying machines, and glasses for seeing great distances. It was not therefore the admission of ignorance that was truly revolutionary, but  the idea that science could be useful in mastering nature for the benefit of Man.\nBy the time of Galileo, whom Harari does not even mention, the idea that science should be useful had become a dominant idea of Western science. Galileo was very much in the natural magic tradition and was a prime example of a man of learning who was equally at home in the workshop as in the library – as is well-known, when he heard of the Dutch invention of the telescope he constructed one himself and ground his own lenses to do so. But Galileo was also enormously important in showing the crucial part that experiment had in the advancement of science. He was keenly interested in Aristotle’s theory of terrestrial motion and is said to have tested the theory that heavier bodies fall faster than light ones by dropping them from the leaning tower of Pisa. This is somewhat mythical, but he certainly carried out detailed experiments with metal balls by rolling them down sloping planks to discover the basic laws of acceleration. He did not simply observe, but designed specific experiments to test theories. This is the hall-mark of modern science, and it emerged in the circumstances that I have just described so that reason and the evidence of the senses were thus harmonized in the modern form of natural science. (On the origins of science see Hallpike 2008:288-353; 396-428).\nScience, then, is not exactly Harari’s strong point, so we need spend little time on the concluding part of his book, which is taken up with speculation about where science and technology are likely to take the human race in the next hundred years. He concludes, however, with some plaintive remarks about our inability to plan our future:\n‘we remain unsure of our goals’, ‘nobody knows where we are going’, ‘we are more powerful than ever before, but have very little idea what to do with all that power’ (pp. 465-66).\nHe has just written a book showing that mankind’s social and cultural evolution has been a process over which no-one could have had any control. So why does he suddenly seize upon the extraordinary fiction that there ought to be some ‘we’ who could now decide where we all go next? Even if such a ‘we’ existed, let us say in the form of the United Nations, how could it know what to do anyway?\nThroughout the book there is also a strange vacillation between hard-nosed Darwinism and egalitarian sentiment. On one hand Harari quite justifiably mocks the humanists’ naive belief in human rights, for not realising that these rights are based on Christianity, and that a huge gulf has actually opened up between the findings of science and modern liberal ideals. But on the other hand it is rather bewildering to find him also indulging in long poetic laments about the thousands of years of injustice, inequality and suffering imposed on the masses by the great states and empires of history, and our cruelty to our animal ‘slaves’ whom we have slaughtered and exterminated in such vast numbers, so that he concludes ‘The Sapiens reign on earth has so far produced little that we can be proud of’. But a consistent Darwinist should surely rejoice to see such a fine demonstration of the survival of the fittest, with other species either decimated or subjected to human rule, and the poor regularly ground under foot in the struggle for survival. Indeed, the future looks even better for Darwinism, with nation states themselves about to be submerged by a mono-cultural world order, in which we ourselves are destined to be replaced by a superhuman race of robots.\nIt has been rightly said that:\nHarari’s view of culture and of ethical norms as fundamentally fictional makes impossible any coherent moral framework for thinking about and shaping our future. And it asks us to pretend that we are not what we know ourselves to be – thinking and feeling subjects, moral agents with free will, and social beings whose culture builds upon the facts of the physical world but is not limited to them (Sexton 2015:120).\nSumming up the book as a whole, one has often had to point out how surprisingly little he seems to have read on quite a number of essential topics. It would be fair to say that whenever his facts are broadly correct they are not new, and whenever he tries to strike out on his own he often gets things wrong, sometimes seriously. So we should not judge Sapiens as a serious contribution to knowledge but as ‘infotainment’, a publishing event to titillate its readers by a wild intellectual ride across the  landscape of history, dotted with sensational displays of speculation, and ending with blood-curdling predictions about human destiny. By these criteria it is a most successful book.",
  "tags": [
    "BookReview",
    "science"
  ],
  "categories": [],
  "sitemap_lastmod": "2017-11-08T16:36:00+00:00"
}