{
  "url": "https://voxday.net/2017/11/04/book-review-sapiens-by-yuval-harari-ii/",
  "scraped_at": "2025-12-19T10:30:20.430252",
  "title": "Book Review: SAPIENS by Yuval Harari II",
  "date_display": "November 4, 2017",
  "date_iso": "2017-11-04T20:45:00+00:00",
  "date_from_url": "2017-11-04",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p><b>Review of Yuval Harari’s <i>Sapiens: A Brief History of Humankind</i></b><br>by C.R.Hallpike</br></p><p>Part II of IV</p><p>Harari’s belief that the Cognitive Revolution provided the modes of thought and reasoning that are the basis of our scientific civilisation could not therefore be further from the truth. We may accept that people became able to speak in sentences at this time, and language is certainly essential to human culture, but anthropologists and developmental psychologists, in their studies of primitive societies, have found that their language development and their modes of thought about space, time, classification, causality and the self have much more resemblance to those of the Piraha than to those of members of modern industrial societies. The Piraha are an extreme case, but the Tauade of Papua New Guinea, for example, with whom I lived only had the idea of single and pair, and no form of calendar or time-reckoning. Harari clearly has no knowledge at all of cross-cultural developmental psychology, and of how modes of thought develop in relation to the natural and socio-cultural environments. The people who carved the Stadel lion-man around 30,000 years ago and the Piraha had the same ability to learn as we do, which is why Piraha children can learn to count, but these cognitive skills have to be learnt: we are not born with them all ready to go. Cross-cultural developmental psychology has shown that the development of the cognitive skills of modern humans actually requires literacy and schooling, large-scale bureaucratic societies and complex urban life, the experience of cultural differences, and familiarity with modern technology, to name some of the more important requirements (see Hallpike 1979).</p><p>While Harari recognises that we know almost nothing about the beliefs and social organization of ancient foragers, he agrees that the constraints of their mode of life would have limited them to small-scale groups based on the family without permanent settlements (unless they could fish), and with no domestic animals. But then he launches into some remarkable speculations about what they might nevertheless have achieved in the tens of thousands of years between the Cognitive Revolution and the beginning of agriculture.</p><p><i>These long millennia may have witnessed wars and revolutions, ecstatic religious movements, profound philosophical theories, incomparable artistic masterpieces…The foragers may have had their all-conquering Napoleons who ruled empires half the size of Luxembourg; gifted Beethovens who lacked symphony orchestras but brought people to tears with the sound of their bamboo flutes…’ and so on (pp. 68-9).</i></p><p>Er, no. They couldn’t. All these imagined triumphs of the hunter-gatherers would actually have required a basis of large populations, centralized political control and probably literate civilisation, which in turn would have required the development of agriculture.</p><p>This is normally regarded as, after language, the innovation that made possible the extraordinary flowering of human abilities. As Harari correctly points out, agriculture developed independently in a number of parts of the world, and tribal societies based on farming became extremely common, many of them surviving into modern times. But he describes the Agricultural Revolution as ‘history’s biggest fraud’ because individuals in fully developed farming societies generally had an inferior diet and harder work than foragers, and their food supply depended on a limited range of crops that were vulnerable to drought, pests, and invaders, unlike the more varied food resources of hunter-gatherers.</p><p>These criticisms of agriculture are, of course, quite familiar, and up to a point legitimate. But if agriculture was really such a bad deal why would humans ever have gone along with it? Harari begins by suggesting that wheat and other crops actually domesticated us, and made us work for them, rather than the other way round, but this doesn’t get him very far in explaining the persistence of agriculture, and instead he argues that wheat offered nothing to individuals, but only to the species by enabling the growth of larger populations. But since it is actually individuals who have to do all the hard work of sowing and reaping this won’t do either, so finally he says that people persisted in the agricultural way of life because they were in search of an easier life, and couldn’t anticipate the full consequences of agriculture.<br><i><br/></i><i>Whenever they decided to do a bit of extra work – say, to hoe the fields instead of scattering the seeds on the surface – people thought, “Yes, we will have to work harder, but the harvest will be so bountiful! We won’t have to worry any more about lean years. Our children will never go to sleep hungry.” It made sense. If you worked harder, you would have a better life. That was the plan. (p. 97)</i></br></p><p>It didn’t work out that way, however, because people didn’t foresee population growth, poor diet and disease. Since it would have taken many generations to realise all the disadvantages of agriculture, by that time the population would have grown so large that it would have been impossible to go back to foraging, so the agricultural trap closed on Man for evermore.</p><p>The change from foraging to agriculture as principal mode of subsistence would have actually taken hundreds of years in many cases, and there are many important advantages of agriculture which he ignores. It is likely that one of the primary attractions of planting crops was that it allowed people to live in fixed settlements for some or all of the year, for a variety of reasons. Some favoured locations would have provided access to a plentiful supply of food or water; a whole series of craft activities are all more conveniently carried out in permanent or semi-permanent settlements; and these are also very convenient for holding ceremonies such as initiations and feasts. We also know that the food surplus from agriculture can be used in systems of exchange and competitive feasting, for trading with different groups, and for feeding domestic animals. A larger population also has many attractions in itself: it permits a much richer social life than is possible for small foraging bands,  with more impressive ceremonies, a larger labour force for social projects such as irrigation and communal buildings, and more effective defence against local enemies. Agriculture would therefore have had many attractions which would have been obvious to the people concerned, (see Hallpike 2008:52-65).</p><p><span style=\"white-space: pre;\"></span>Agriculture with the domestication of animals, then, was the essential foundation for the growth of really large populations which are in turn essential for the development of complex cultures and social systems in a new ‘tribal’ form of social organization. Land ownership became closely related to kin groups of clans and lineages, which were in turn the basis of formal systems of political authority based on elders or chiefs who could mediate in disputes and sometimes assume priestly functions. A whole variety of groups sprang up based not only on kinship but on residence, work, voluntary association, age, and gender and these group structures and hierarchical organization made it much easier to co-ordinate the larger populations that developed (see Hallpike 2008:66-121). This tribal organization was the essential precursor of the state, particularly through the development of political authority which was always legitimated by descent and religious status. By the state I mean centralised political authority, usually a king, supported by tribute and taxes, and with a monopoly of armed force. Although it has been estimated that only about 20{745b48424592519896714d7eb9f12ef71c35f3ab17441a70b87f3207bf0913ca} of tribal societies in Africa, the Americas, Polynesia, New Guinea, and many parts of Asia actually developed the state, the state was almost as important a revolution in human history as agriculture itself, because of all the further developments it made possible, and a large literature on the process of state formation has developed (e.g. Claessen &amp; Skalnik 1978, Hallpike 1986, 2008, Trigger 2003).</p><p>Unfortunately, Harari not only knows very little about tribal societies but seems to have read almost nothing on the literature on state formation either, which he tries to explain as follows:</p><p><i>The stress of farming [worrying about the weather, drought, floods, bandits, next year’s famine and so on] had far reaching consequences. It was the foundation of large-scale political and social systems. Sadly, the diligent peasants almost never achieved the future economic security they so craved through their hard work in the present. Everywhere, rulers and elites sprang up, living off the peasants’ surplus food. (p. 114) </i></p><p>The reader might well wonder how peasants worrying about next year’s possible famine could possibly have been the foundation of any major political developments, and why in any case they would have meekly allowed their crops to be plundered, as well as where these rulers and elites suddenly sprang from. If Harari knew more about tribal societies he would have realised that the notion of a leader imposing his will on his followers misses the whole point of leadership in pre-state societies, which is that the leader has to attract people by having something to offer them, not by threatening them, because he has no means of doing this. To have power over people one must control something they want: food, land, personal security, status, wealth, the favour of the gods, knowledge, and so on.</p><p>In other words, there must be dependency, and leaders must be seen as benefactors. In tribal societies, where people are not self-sufficient in defence, or in access to resources or to the supernatural, they will therefore be willing to accept inequality of power because they obviously get something out of war-leaders, or clan heads, or priests. Political authority in tribal society develops in particular through the kinship system, with hereditary clan heads, who are also believed to have the mystical power to bless their dependents. When states develop we always find that the legitimacy of kings is based on two factors: descent and religion. It is only after the advent of the state can power be riveted on to people by force whether they like it or not, and when it is too late for them to do anything about it except by violent rebellion.</p><p>Part III of Dr. Hallpike’s review will be posted tomorrow.<br><a href=\"http://voxday.blogspot.com/2017/11/book-review-sapiens-by-yuval-harari.html\">Part I</a></br></p></div>",
  "content_text": "Review of Yuval Harari’s\nSapiens: A Brief History of Humankind\nby C.R.Hallpike\nPart II of IV\nHarari’s belief that the Cognitive Revolution provided the modes of thought and reasoning that are the basis of our scientific civilisation could not therefore be further from the truth. We may accept that people became able to speak in sentences at this time, and language is certainly essential to human culture, but anthropologists and developmental psychologists, in their studies of primitive societies, have found that their language development and their modes of thought about space, time, classification, causality and the self have much more resemblance to those of the Piraha than to those of members of modern industrial societies. The Piraha are an extreme case, but the Tauade of Papua New Guinea, for example, with whom I lived only had the idea of single and pair, and no form of calendar or time-reckoning. Harari clearly has no knowledge at all of cross-cultural developmental psychology, and of how modes of thought develop in relation to the natural and socio-cultural environments. The people who carved the Stadel lion-man around 30,000 years ago and the Piraha had the same ability to learn as we do, which is why Piraha children can learn to count, but these cognitive skills have to be learnt: we are not born with them all ready to go. Cross-cultural developmental psychology has shown that the development of the cognitive skills of modern humans actually requires literacy and schooling, large-scale bureaucratic societies and complex urban life, the experience of cultural differences, and familiarity with modern technology, to name some of the more important requirements (see Hallpike 1979).\nWhile Harari recognises that we know almost nothing about the beliefs and social organization of ancient foragers, he agrees that the constraints of their mode of life would have limited them to small-scale groups based on the family without permanent settlements (unless they could fish), and with no domestic animals. But then he launches into some remarkable speculations about what they might nevertheless have achieved in the tens of thousands of years between the Cognitive Revolution and the beginning of agriculture.\nThese long millennia may have witnessed wars and revolutions, ecstatic religious movements, profound philosophical theories, incomparable artistic masterpieces…The foragers may have had their all-conquering Napoleons who ruled empires half the size of Luxembourg; gifted Beethovens who lacked symphony orchestras but brought people to tears with the sound of their bamboo flutes…’ and so on (pp. 68-9).\nEr, no. They couldn’t. All these imagined triumphs of the hunter-gatherers would actually have required a basis of large populations, centralized political control and probably literate civilisation, which in turn would have required the development of agriculture.\nThis is normally regarded as, after language, the innovation that made possible the extraordinary flowering of human abilities. As Harari correctly points out, agriculture developed independently in a number of parts of the world, and tribal societies based on farming became extremely common, many of them surviving into modern times. But he describes the Agricultural Revolution as ‘history’s biggest fraud’ because individuals in fully developed farming societies generally had an inferior diet and harder work than foragers, and their food supply depended on a limited range of crops that were vulnerable to drought, pests, and invaders, unlike the more varied food resources of hunter-gatherers.\nThese criticisms of agriculture are, of course, quite familiar, and up to a point legitimate. But if agriculture was really such a bad deal why would humans ever have gone along with it? Harari begins by suggesting that wheat and other crops actually domesticated us, and made us work for them, rather than the other way round, but this doesn’t get him very far in explaining the persistence of agriculture, and instead he argues that wheat offered nothing to individuals, but only to the species by enabling the growth of larger populations. But since it is actually individuals who have to do all the hard work of sowing and reaping this won’t do either, so finally he says that people persisted in the agricultural way of life because they were in search of an easier life, and couldn’t anticipate the full consequences of agriculture.\nWhenever they decided to do a bit of extra work – say, to hoe the fields instead of scattering the seeds on the surface – people thought, “Yes, we will have to work harder, but the harvest will be so bountiful! We won’t have to worry any more about lean years. Our children will never go to sleep hungry.” It made sense. If you worked harder, you would have a better life. That was the plan. (p. 97)\nIt didn’t work out that way, however, because people didn’t foresee population growth, poor diet and disease. Since it would have taken many generations to realise all the disadvantages of agriculture, by that time the population would have grown so large that it would have been impossible to go back to foraging, so the agricultural trap closed on Man for evermore.\nThe change from foraging to agriculture as principal mode of subsistence would have actually taken hundreds of years in many cases, and there are many important advantages of agriculture which he ignores. It is likely that one of the primary attractions of planting crops was that it allowed people to live in fixed settlements for some or all of the year, for a variety of reasons. Some favoured locations would have provided access to a plentiful supply of food or water; a whole series of craft activities are all more conveniently carried out in permanent or semi-permanent settlements; and these are also very convenient for holding ceremonies such as initiations and feasts. We also know that the food surplus from agriculture can be used in systems of exchange and competitive feasting, for trading with different groups, and for feeding domestic animals. A larger population also has many attractions in itself: it permits a much richer social life than is possible for small foraging bands,  with more impressive ceremonies, a larger labour force for social projects such as irrigation and communal buildings, and more effective defence against local enemies. Agriculture would therefore have had many attractions which would have been obvious to the people concerned, (see Hallpike 2008:52-65).\nAgriculture with the domestication of animals, then, was the essential foundation for the growth of really large populations which are in turn essential for the development of complex cultures and social systems in a new ‘tribal’ form of social organization. Land ownership became closely related to kin groups of clans and lineages, which were in turn the basis of formal systems of political authority based on elders or chiefs who could mediate in disputes and sometimes assume priestly functions. A whole variety of groups sprang up based not only on kinship but on residence, work, voluntary association, age, and gender and these group structures and hierarchical organization made it much easier to co-ordinate the larger populations that developed (see Hallpike 2008:66-121). This tribal organization was the essential precursor of the state, particularly through the development of political authority which was always legitimated by descent and religious status. By the state I mean centralised political authority, usually a king, supported by tribute and taxes, and with a monopoly of armed force. Although it has been estimated that only about 20{745b48424592519896714d7eb9f12ef71c35f3ab17441a70b87f3207bf0913ca} of tribal societies in Africa, the Americas, Polynesia, New Guinea, and many parts of Asia actually developed the state, the state was almost as important a revolution in human history as agriculture itself, because of all the further developments it made possible, and a large literature on the process of state formation has developed (e.g. Claessen & Skalnik 1978, Hallpike 1986, 2008, Trigger 2003).\nUnfortunately, Harari not only knows very little about tribal societies but seems to have read almost nothing on the literature on state formation either, which he tries to explain as follows:\nThe stress of farming [worrying about the weather, drought, floods, bandits, next year’s famine and so on] had far reaching consequences. It was the foundation of large-scale political and social systems. Sadly, the diligent peasants almost never achieved the future economic security they so craved through their hard work in the present. Everywhere, rulers and elites sprang up, living off the peasants’ surplus food. (p. 114)\nThe reader might well wonder how peasants worrying about next year’s possible famine could possibly have been the foundation of any major political developments, and why in any case they would have meekly allowed their crops to be plundered, as well as where these rulers and elites suddenly sprang from. If Harari knew more about tribal societies he would have realised that the notion of a leader imposing his will on his followers misses the whole point of leadership in pre-state societies, which is that the leader has to attract people by having something to offer them, not by threatening them, because he has no means of doing this. To have power over people one must control something they want: food, land, personal security, status, wealth, the favour of the gods, knowledge, and so on.\nIn other words, there must be dependency, and leaders must be seen as benefactors. In tribal societies, where people are not self-sufficient in defence, or in access to resources or to the supernatural, they will therefore be willing to accept inequality of power because they obviously get something out of war-leaders, or clan heads, or priests. Political authority in tribal society develops in particular through the kinship system, with hereditary clan heads, who are also believed to have the mystical power to bless their dependents. When states develop we always find that the legitimacy of kings is based on two factors: descent and religion. It is only after the advent of the state can power be riveted on to people by force whether they like it or not, and when it is too late for them to do anything about it except by violent rebellion.\nPart III of Dr. Hallpike’s review will be posted tomorrow.\nPart I",
  "tags": [
    "BookReview",
    "science"
  ],
  "categories": [],
  "sitemap_lastmod": "2017-11-04T20:45:00+00:00"
}