{
  "url": "https://voxday.net/2017/11/07/book-review-a-throne-of-bones-by-vox-day/",
  "scraped_at": "2025-12-19T10:30:39.876069",
  "title": "Book Review: A THRONE OF BONES by Vox Day",
  "date_display": "November 7, 2017",
  "date_iso": "2017-11-07T16:00:00+00:00",
  "date_from_url": "2017-11-07",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p><a href=\"https://dystopiasoak.blogspot.com/2017/11/first-fantasy-since-tolkien-throne-of.html\">A review by Dystopia Soak</a>. I always find it intriguing to discover how few of my blog readers read my fiction. That’s fine, it doesn’t bother me in the slightest, as everyone has different tastes and preferences. It’s not as if most regulars here get into Eco, Hesse, and Murakami either. But it is still satisfying to hear when someone finally gets around to giving it a shot and then discovers that it’s really not that bad.</p><blockquote><p>After Tolkien, no fantasy novel captured my attention again, though not for lack of trying. Over the decades, I picked up a lot of authors, each of them creating worlds and plots as anaemic and derivative as the rest. Few held my attention for even a chapter. By the late 90s I had stopped picking them up altogether. As far as genres went, fantasy was a dead end.</p><p>Then my wife heard about a new television series, and we binge watched a couple of seasons. No prizes for guessing what it was. After the first few episodes, I was so inspired I took a ‘look inside’ the first instalment on Amazon. George R.R. Martin was as good on paper as Benioff and Weiss were on screen. This was good stuff, and I started to wonder if I had finally found what I was looking for.</p><p>Alas, no. By the time I got my hands on a copy of Game of Thrones, Martin’s predilection for proving points by killing characters had become tiresome. As had his points about the cartoonish nature of good battling evil. I watched on, losing interest, putting aside the book, which I never started. Besides, my wife heard about Breaking Bad, and GoT faded into the background.</p><p>I could be forgiven, then, for skipping over reviews extolling the virtues of a new epic high fantasy by Vox Day when they first started appearing. For several years, I ignored advice to read Throne of Bones from people who struck me as otherwise sensible. I had had enough. It was one thing to read the man’s blog, but quite another to have my antipathy towards the genre confirmed.</p><p>That turned out to be a foolish mistake, because Vox Day is not like other fantasy writers. Where others try to mock and tear down all that is central to Western civilisation, Day has returned to the very heart of what makes the West great. And by doing so has provided us with the first true epic high fantasy since Tolkien to confront the consequences of losing out to barbarism.</p></blockquote><p>If you haven’t read <b><i><a href=\"http://amzn.to/1THmHo5\">A THRONE OF BONES</a></i></b> yet, it’s available in Kindle, KU, hardcover, and paperback. And audiobook fans will be pleased to know that Jeremy Daw has begun recording what will be a 36-hour monster. He has already recorded <b><i><a href=\"http://amzn.to/2y3vNtA\">THE LAST WITCHKING &amp; OTHER STORIES</a></i></b> if you want to hear what he sounds like.</p><p>Those who have expressed interest in giving out copies of SJWADD to members of their organizations should be pleased to know that the paperback should be available on Amazon by the end of the week. And speaking of reviews, of a sort, it was nice to see this in a piece on Hollywood Values champion James Toback <a href=\"http://takimag.com/article/jimmy_toback_warren_beatty_and_a_whole_lotta_tuchus_spielman/\">over at Taki’s place</a>:</p><blockquote><p>Regarding the allegations being made against him, Toback told the up for sale ass brownie known as <i>Rolling Stone</i>:</p><p><i>The idea that I would offer a part to anyone for any other reason than that he or she was gonna be the best of anyone I could find is so disgusting to me. And anyone who says it is a lying cocksucker or cunt or both. Can I be any clearer than that?</i></p><p>Toback’s statement signals that he’s either well versed in Vox Day’s 2015 masterpiece <b><i><a href=\"http://amzn.to/1sBYA10\">SJWs Always Lie</a></i></b>, a psychopath, or both.</p></blockquote><p>Read <a href=\"http://takimag.com/article/jimmy_toback_warren_beatty_and_a_whole_lotta_tuchus_spielman/\">the whole thing there</a>. But as grateful as I am for Mr. Spielman’s praise of my book, I can’t say that I agree with his hypothesis. As Nick Cole and I have both independently concluded, the Hollywood Values scandal is not aimed at Warren Beatty (who, as an Alpha, never needed to engage in the predatory Gamma behavior exhibited by Weinstein and Toback), but rather, is primarily a defensive burn by the powerful Hollywood gays to try to distract from their exposure and eventual reckoning.</p><p>As Nick pointed out, Dustin Hoffman? How long has it been since he was even remotely relevant? That is the desperate behavior of evil men on a sinking ship throwing out everyone and everything they can get their hands on in a futile attempt to keep the ship from going underwater.</p></div>",
  "content_text": "A review by Dystopia Soak\n. I always find it intriguing to discover how few of my blog readers read my fiction. That’s fine, it doesn’t bother me in the slightest, as everyone has different tastes and preferences. It’s not as if most regulars here get into Eco, Hesse, and Murakami either. But it is still satisfying to hear when someone finally gets around to giving it a shot and then discovers that it’s really not that bad.\nAfter Tolkien, no fantasy novel captured my attention again, though not for lack of trying. Over the decades, I picked up a lot of authors, each of them creating worlds and plots as anaemic and derivative as the rest. Few held my attention for even a chapter. By the late 90s I had stopped picking them up altogether. As far as genres went, fantasy was a dead end.\nThen my wife heard about a new television series, and we binge watched a couple of seasons. No prizes for guessing what it was. After the first few episodes, I was so inspired I took a ‘look inside’ the first instalment on Amazon. George R.R. Martin was as good on paper as Benioff and Weiss were on screen. This was good stuff, and I started to wonder if I had finally found what I was looking for.\nAlas, no. By the time I got my hands on a copy of Game of Thrones, Martin’s predilection for proving points by killing characters had become tiresome. As had his points about the cartoonish nature of good battling evil. I watched on, losing interest, putting aside the book, which I never started. Besides, my wife heard about Breaking Bad, and GoT faded into the background.\nI could be forgiven, then, for skipping over reviews extolling the virtues of a new epic high fantasy by Vox Day when they first started appearing. For several years, I ignored advice to read Throne of Bones from people who struck me as otherwise sensible. I had had enough. It was one thing to read the man’s blog, but quite another to have my antipathy towards the genre confirmed.\nThat turned out to be a foolish mistake, because Vox Day is not like other fantasy writers. Where others try to mock and tear down all that is central to Western civilisation, Day has returned to the very heart of what makes the West great. And by doing so has provided us with the first true epic high fantasy since Tolkien to confront the consequences of losing out to barbarism.\nIf you haven’t read\nA THRONE OF BONES\nyet, it’s available in Kindle, KU, hardcover, and paperback. And audiobook fans will be pleased to know that Jeremy Daw has begun recording what will be a 36-hour monster. He has already recorded\nTHE LAST WITCHKING & OTHER STORIES\nif you want to hear what he sounds like.\nThose who have expressed interest in giving out copies of SJWADD to members of their organizations should be pleased to know that the paperback should be available on Amazon by the end of the week. And speaking of reviews, of a sort, it was nice to see this in a piece on Hollywood Values champion James Toback\nover at Taki’s place\n:\nRegarding the allegations being made against him, Toback told the up for sale ass brownie known as\nRolling Stone\n:\nThe idea that I would offer a part to anyone for any other reason than that he or she was gonna be the best of anyone I could find is so disgusting to me. And anyone who says it is a lying cocksucker or cunt or both. Can I be any clearer than that?\nToback’s statement signals that he’s either well versed in Vox Day’s 2015 masterpiece\nSJWs Always Lie\n, a psychopath, or both.\nRead\nthe whole thing there\n. But as grateful as I am for Mr. Spielman’s praise of my book, I can’t say that I agree with his hypothesis. As Nick Cole and I have both independently concluded, the Hollywood Values scandal is not aimed at Warren Beatty (who, as an Alpha, never needed to engage in the predatory Gamma behavior exhibited by Weinstein and Toback), but rather, is primarily a defensive burn by the powerful Hollywood gays to try to distract from their exposure and eventual reckoning.\nAs Nick pointed out, Dustin Hoffman? How long has it been since he was even remotely relevant? That is the desperate behavior of evil men on a sinking ship throwing out everyone and everything they can get their hands on in a futile attempt to keep the ship from going underwater.",
  "tags": [
    "BookReview"
  ],
  "categories": [],
  "sitemap_lastmod": "2017-11-07T16:00:00+00:00"
}