{
  "url": "https://voxday.net/2017/11/06/changes-at-castalia/",
  "scraped_at": "2025-12-19T10:30:30.903316",
  "title": "Changes at Castalia",
  "date_display": "November 6, 2017",
  "date_iso": "2017-11-06T13:00:00+00:00",
  "date_from_url": "2017-11-06",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>Jeffro Johnson <a href=\"http://www.castaliahouse.com/farewell/\">steps down</a> as the Castalia House blog editor:</p><blockquote><p>So much is happening in the wider scene today that I can barely keep up with even a portion of it. Along with that, I find that areas of my life outside of gaming and fiction have increasingly laid greater and greater claims to my time. And while I wish I could do all the things that I can think of that could really capitalize on everything that’s developed here… I’m afraid I instead have to admit that I’ve run with all of this about as far as I can.</p><p>It’s a tough thing to do, but I think it’s the right thing for me at this time. So I’m handing over editorship of Castalia House blog to Morgan Holmes, who has been writing about classic fantasy and science fiction here almost as long as I have. (Good luck, man!)</p><p>To everyone at Castalia House and to all the readers and bloggers here… thank you. You’ve all inspired me greatly and have continually surprised me with your dedication and your love for the field. It really has been an exciting trip, and I’m grateful to everyone that took the time to join with me in this voyage of discovery.</p></blockquote><p>Read the whole thing there. Jeffro did an excellent job of building up the Castalia House blog, in terms of content, quality, <i>and </i>traffic, and he leaves the blog a much stronger, healthier site than he found it. We should all hope to do half as well with any responsibility we are given! He will be succeeded by Morgan, the longtime CH blogger, in whom we all have a great deal of confidence.</p><p>Jeffro remains a Castalia House author, of course, and we are hoping that he will eventually provide us with a successor of some kind to his landmark <b><i><a href=\"http://amzn.to/2jRxv63\">Appendix N: The Literary History of Dungeons &amp; Dragons</a></i></b>. We may even try to talk him into writing a campaign book for the Alt★Hero role-playing game! If you’d like to express your gratitude to Jeffro for his contributions, I think picking up a copy of his book today would be a great way to do so.</p></div>",
  "content_text": "Jeffro Johnson\nsteps down\nas the Castalia House blog editor:\nSo much is happening in the wider scene today that I can barely keep up with even a portion of it. Along with that, I find that areas of my life outside of gaming and fiction have increasingly laid greater and greater claims to my time. And while I wish I could do all the things that I can think of that could really capitalize on everything that’s developed here… I’m afraid I instead have to admit that I’ve run with all of this about as far as I can.\nIt’s a tough thing to do, but I think it’s the right thing for me at this time. So I’m handing over editorship of Castalia House blog to Morgan Holmes, who has been writing about classic fantasy and science fiction here almost as long as I have. (Good luck, man!)\nTo everyone at Castalia House and to all the readers and bloggers here… thank you. You’ve all inspired me greatly and have continually surprised me with your dedication and your love for the field. It really has been an exciting trip, and I’m grateful to everyone that took the time to join with me in this voyage of discovery.\nRead the whole thing there. Jeffro did an excellent job of building up the Castalia House blog, in terms of content, quality,\nand\ntraffic, and he leaves the blog a much stronger, healthier site than he found it. We should all hope to do half as well with any responsibility we are given! He will be succeeded by Morgan, the longtime CH blogger, in whom we all have a great deal of confidence.\nJeffro remains a Castalia House author, of course, and we are hoping that he will eventually provide us with a successor of some kind to his landmark\nAppendix N: The Literary History of Dungeons & Dragons\n. We may even try to talk him into writing a campaign book for the Alt★Hero role-playing game! If you’d like to express your gratitude to Jeffro for his contributions, I think picking up a copy of his book today would be a great way to do so.",
  "tags": [
    "CastaliaHouse"
  ],
  "categories": [],
  "sitemap_lastmod": "2017-11-06T13:00:00+00:00"
}