{
  "url": "https://voxday.net/2017/11/11/closing-in/",
  "scraped_at": "2025-12-19T10:31:06.677275",
  "title": "Closing in",
  "date_display": "November 11, 2017",
  "date_iso": "2017-11-11T10:16:00+00:00",
  "date_from_url": "2017-11-11",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>Remember what I said about the big Hollywood dam starting to crack <a href=\"http://voxday.blogspot.com/2017/11/hollywood-values-in-media.html\">the other day</a>? This would appear to be <a href=\"http://www.crazydaysandnights.net/2017/11/todays-blind-items-molesters-killed-her.html\">a very large fissure developing</a>.</p><blockquote><p>Anyway, on this particular show, there was a special guest star. A very special guest star. Still not a tween, everyone knew who she was. Executives flocked to the studio that day to see her. She was first molested when she was 5 or 6 and had continued to be molested throughout her hit movies and also on a previous show.</p><p>One of the stars of the show who has spent her life bouncing in and out of rehab because of what she saw, and who was actually nominated for awards from the show, described the atmosphere that day.</p><p>“A bunch of f**king pigs. I had just turned 12 or 13. I was the same age as the actress coming in. Maybe a little older. We had been shooting for months and I was old news. They knew I would do what they wanted, but they always wanted someone new. This was someone new and someone they all knew. They had it set up like a peep show almost. She had finished shooting that morning and they brought her out on a stage. The stage was used most of the time for a game show that was taped there. That game show is still on today. I can’t watch it knowing what happened to her there. They brought her out and the front four rows of this theatre were filled with guys who were already rubbing themselves. The girl was wearing a bikini. The show took place around a beach just so they could make these girls wear next to nothing. They had her walk around under the lights. The lights were focused on her and she couldn’t really see out to the audience. She was squinting. It must have been blinding for her. They had her walk back and forth. Then they had her start dancing. All of these guys were doing what another star at that same studio got busted for. This went on for about 20 minutes. Then three of the guys took her to a different area of the studio.”</p></blockquote><p>Item: <i>“She was first molested when she was 5 or 6.”</i></p><p>Item: “Heather O’Rourke was discovered by director Steven Spielberg when she was visiting MGM’s studios.”</p><p>Item: <i>“That crap story ended up killing the girl because the parents believed the executives.”</i></p><p>Item: “Heather O’Rourke died at the age of 12 of cardiac arrest and septic shock.”</p><p>Item: <i>Do you believe Steven Spielberg is an ideal guide and influence for our culture? Do Steven Spielberg’s films question our culture? What do Steven Spielberg’s films question? Does Steven Spielberg focus much of his fantasy life on young people? Did he portray children wallowing in sewers filled with fecal matter in Schindler’s List? Did he use children to finger paint an adult in Hook? Does he collect the illustrations of Norman Rockwell, such as the one showing a young boy in his underwear examined by a doctor? Are the inclinations of Steven Spielberg above suspicion by the media-fed culture? Was Steven Spielberg very friendly with Michael Jackson? Wasn’t Michael Jackson supposed to play Peter Pan in Steven Spielberg’s version of the story? Now that Michael Jackson is no longer held in favor by the mass media, does Spielberg associate with him? Do Michael Jackson and Steven Spielberg share similar opinions about the sexuality of young boys?</i><br>– <a href=\"https://squawker.org/culture-wars/a-2003-essay-by-actor-crispin-glover-suggests-steven-spielberg-appreciated-the-sexuality-of-young-boys/\">Crispin Glover</a></br></p><p>It’s only a matter of time now. I have always disliked Spielberg’s movies, even since I was in elementary school. There was always a <i>wrongness </i>about them, as if they gave off a repellent odor that one could detect even from the trailers. To this day, I haven’t seen many popular Spielberg movies, including Close Encounters, ET, Poltergeist, and Gremlins; after reviewing a comprehensive list of his filmography, it turns out that I’ve seen a total of nine movies in which he has played some role.</p><p>And now it appears we have a pretty good idea of exactly what that <i>wrongness </i>was.</p><p>UPDATE: I think we now have a clue as to why my Twitter account was suspended. Remember the meme about Indiana Jones being a pedophile? Unlike all of my other tweeted images, including the mock Beard covers, <a href=\"https://pbs.twimg.com/media/DNtCZGLX0AA-h2k.jpg\">it is no longer available</a>. As is the recent /pol/ thread on <a href=\"https://boards.4chan.org/pol/thread/148878875/spielbergs-list-thread-was-deleted-shortly-after\">Spielberg’s List</a>.</p></div>",
  "content_text": "Remember what I said about the big Hollywood dam starting to crack\nthe other day\n? This would appear to be\na very large fissure developing\n.\nAnyway, on this particular show, there was a special guest star. A very special guest star. Still not a tween, everyone knew who she was. Executives flocked to the studio that day to see her. She was first molested when she was 5 or 6 and had continued to be molested throughout her hit movies and also on a previous show.\nOne of the stars of the show who has spent her life bouncing in and out of rehab because of what she saw, and who was actually nominated for awards from the show, described the atmosphere that day.\n“A bunch of f**king pigs. I had just turned 12 or 13. I was the same age as the actress coming in. Maybe a little older. We had been shooting for months and I was old news. They knew I would do what they wanted, but they always wanted someone new. This was someone new and someone they all knew. They had it set up like a peep show almost. She had finished shooting that morning and they brought her out on a stage. The stage was used most of the time for a game show that was taped there. That game show is still on today. I can’t watch it knowing what happened to her there. They brought her out and the front four rows of this theatre were filled with guys who were already rubbing themselves. The girl was wearing a bikini. The show took place around a beach just so they could make these girls wear next to nothing. They had her walk around under the lights. The lights were focused on her and she couldn’t really see out to the audience. She was squinting. It must have been blinding for her. They had her walk back and forth. Then they had her start dancing. All of these guys were doing what another star at that same studio got busted for. This went on for about 20 minutes. Then three of the guys took her to a different area of the studio.”\nItem:\n“She was first molested when she was 5 or 6.”\nItem: “Heather O’Rourke was discovered by director Steven Spielberg when she was visiting MGM’s studios.”\nItem:\n“That crap story ended up killing the girl because the parents believed the executives.”\nItem: “Heather O’Rourke died at the age of 12 of cardiac arrest and septic shock.”\nItem:\nDo you believe Steven Spielberg is an ideal guide and influence for our culture? Do Steven Spielberg’s films question our culture? What do Steven Spielberg’s films question? Does Steven Spielberg focus much of his fantasy life on young people? Did he portray children wallowing in sewers filled with fecal matter in Schindler’s List? Did he use children to finger paint an adult in Hook? Does he collect the illustrations of Norman Rockwell, such as the one showing a young boy in his underwear examined by a doctor? Are the inclinations of Steven Spielberg above suspicion by the media-fed culture? Was Steven Spielberg very friendly with Michael Jackson? Wasn’t Michael Jackson supposed to play Peter Pan in Steven Spielberg’s version of the story? Now that Michael Jackson is no longer held in favor by the mass media, does Spielberg associate with him? Do Michael Jackson and Steven Spielberg share similar opinions about the sexuality of young boys?\n–\nCrispin Glover\nIt’s only a matter of time now. I have always disliked Spielberg’s movies, even since I was in elementary school. There was always a\nwrongness\nabout them, as if they gave off a repellent odor that one could detect even from the trailers. To this day, I haven’t seen many popular Spielberg movies, including Close Encounters, ET, Poltergeist, and Gremlins; after reviewing a comprehensive list of his filmography, it turns out that I’ve seen a total of nine movies in which he has played some role.\nAnd now it appears we have a pretty good idea of exactly what that\nwrongness\nwas.\nUPDATE: I think we now have a clue as to why my Twitter account was suspended. Remember the meme about Indiana Jones being a pedophile? Unlike all of my other tweeted images, including the mock Beard covers,\nit is no longer available\n. As is the recent /pol/ thread on\nSpielberg’s List\n.",
  "tags": [
    "freakshow",
    "movies"
  ],
  "categories": [],
  "sitemap_lastmod": "2017-11-11T10:16:00+00:00"
}