{
  "url": "https://voxday.net/2017/11/09/derb-on-the-16-points/",
  "scraped_at": "2025-12-19T10:30:53.286400",
  "title": "Derb on the 16 Points",
  "date_display": "November 9, 2017",
  "date_iso": "2017-11-09T16:00:00+00:00",
  "date_from_url": "2017-11-09",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>While I like and respect John Derbyshire, and bow to his demonstrated expertise in mathematics, he should probably resist the temptation to express any strong opinions on economics and political economy, as evidenced by <a href=\"http://www.unz.com/jderbyshire/derb-at-the-mencken-club-am-i-alt-right/\">his recent speech on the Alt-Right</a>. In any event, here is my response to it.</p><blockquote class=\"tr_bq\"><p>Point 1: I don’t know what a Marxian is. Typo for “Martian”?</p></blockquote><p>Ha very ha. Anyhow, “Marxian” distinguishes those who accept elements of, and are heavily influenced by, various aspects of Karl Marx’s theories of history and political economy from those who accept and advocate Karl Marx’s political ideologies and policies. The former is a Marxian, the latter is a Marxist. I studied under a reasonably well-known Marxian, Robert Chernomas, which is why I am very well schooled in the substantive material differences between the two.</p><p>But you need not take my word for it.</p><p><i>Marxian economics refers to several different theories and includes multiple schools of thought which are sometimes opposed to each other, and in many cases Marxian analysis is used to complement or supplement other economic approaches. Because one does not necessarily have to be politically Marxist to be economically Marxian, the two adjectives coexist in usage rather than being synonymous. They share a semantic field while also allowing connotative and denotative differences.</i><br>– <a href=\"https://infogalactic.com/info/Marxian_economics\">Marxian Economics</a>, Infogalactic</br></p><p>Sadly, Prof. Chernomas did not make Wikipedia’s list of <a href=\"https://en.wikipedia.org/wiki/List_of_Marxian_economists\">Marxian Economists</a>. The point is, this is not one of my neologisms nor is it an even remotely esoteric concept.</p><blockquote class=\"tr_bq\"><p>Point 3: Let’s not get ideas above our station here. Aristotle had a philosophy. Descartes had a philosophy. Kant had a philosophy. What the Alt Right has is an attitude.</p></blockquote><p>Fair enough, although it is rather more than that. At least in the form described by the 16 points, the Alt-Right has a <i>political </i>philosophy that is more specific and coherent than anything currently on offer from conservatives, liberals, progressives, globalists, or the Fake Right. If we are merely an “attitude”, then how does one describe those things to which we are an alternative?</p><blockquote class=\"tr_bq\"><p>Point 4: I think the Jews should have gotten a mention there, since half of the Christian Bible is about them.</p></blockquote><p>Absolutely not. The Jews are not part of Western civilization. They pre-date it, they are of the East, and a significant portion of their cultural tradition is pre-civilized. The fact that the primary architects of the present effort to destroy Western civilization, particularly its pillars of Christianity and the European nations, are Jewish suffice to make it very clear that, while some Jews may be <i>in </i>the West, they are not <i>of </i>the West. Judaism is a conscious rejection of Christianity, and therefore, of the West.</p><blockquote class=\"tr_bq\"><p>Point 6: When the slave traders arrive from Alpha Centauri, or an asteroid hits, or a supervolcano pops, we shall all become globalists overnight.</p></blockquote><p>No, we won’t. Reality is not Star Trek. The entire written history of Man indicates that should slave traders arrive from Alpha Centauri, the various human elites will hasten to make deals with them to set up satrapies over which they will rule to provide them with the slaves they seek. See: the history of the slave trade in Africa.</p><blockquote><p>Point 8: It’s what? The word “scientody” is not known to dictionary.com; nor is it in my 1971 OED with supplement; nor in my 1993 Webster’s.</p><p>I tried digging for etymologies, but got lost in a thicket of possibilities. Greek hodos, a path or way; so “the way of science”? Or perhaps eidos, a shape or form, giving us the “-oid” suffix (spheroid, rheumatoid); so “science-like”? Then there’s aoide, a song, giving … what? “Harmonizes like science”? Or maybe it’s the Latin root odor, a smell; “smells like science.”</p><p>In any case, all three of the “understandings” here are gibberish.</p><p>a) There is a large body of solidly-established scientific results that are not liable to future revision.</p><p>Saturn is further from the Sun at any point of its orbit than Jupiter is at any point of its. A water molecule has two hydrogen atoms and one oxygen atom. Natural selection plays an important role in the evolution of life.</p><p>I promise Vox Day there will be no future revisions of these facts, at any rate not on any time span he or I need worry about. (I add that qualification because there are conceivable astronomical events that could alter the sequence of planetary orbits—a very close encounter with a rogue star, for example. Those are once-in-a-billion-year occurrences, though.)</p><p>b) “Scientistry”? Wha?</p><p>c) The scientific consensus is unscientific? Huh? And why is the consensus “so-called”? There usually—not always, but usually—is a scientific consensus. It occasionally turns out to have been wrong, but it’s a consensus none the less, not a “so-called” consensus.</p></blockquote><p>To simply call everything “science” is to be misleading, often intentionally. Science has no intrinsic authority, it is less reliable than engineering, and increasingly, references to it are a deceitful bait-and-switch, in which the overly credulous are led to believe that because an individual with certain credentials is asserting something, that statement is supported by documentary evidence gathered through the scientific method of hypothesis, experiment, and successful replication.</p><p>In most – not many, but <i>most </i>– cases, that is simply not true. Even if you don’t use these three neologisms to describe the three aspects of science, you must learn to distinguish between them or you will repeatedly fall for this intentional bait-and-switch. In order of reliability, the three aspects of science are:</p><p>Scientody: the process<br>Scientage: the knowledge base<br>Scientistry: the profession</br></br></p><p>The scientific consensus is is “so-called” because while it may be a consensus, it is <i>intrinsically </i>unscientific. This is obvious, observable, and undeniable. Taking a vote of the current opinions of scientists is no more scientody than is collecting their cumulative bodily evacuations for hygienic disposal. The expressed opinions that make up the consensus may be based on anything from a personal use of the scientific process to a) desire to obtain grant money, b) political ideology, c) identity, d) mental illness, e) sexual desire, f) personal ambition, or g) anything else capable of influencing one’s opinion.</p><blockquote class=\"tr_bq\"><p>Point 13: I’m an economic ignoramus, but I’d like to see a good logical proof of the proposition that free trade requires free movement of peoples. I am sincerely open to being enlightened on this point.</p></blockquote><p>Free trade, by definition, concerns unrestricted exchanges between two private parties. These exchanges may involve goods, capital, services, and labor. In order to freely provide services or labor, the providing party must be able to travel to the location of the receiving party in order to fulfill his end of the exchange. Therefore, free trade requires the free movement of peoples.</p><p>As a bonus proof, I will point out that in order to achieve the maximum efficiencies theoretically provided by the free market, both labor and capital must be able to travel to the most efficient production sites. Any failure to restrict this travel will necessarily create inefficiencies and therefore prevent the economy from reaching its maximum growth potential.</p><blockquote class=\"tr_bq\"><p>Point 14. I doubt there is an existential threat to white people. </p></blockquote><p>Derb has more than enough math to work out the amount of cross-breeding required to render the entire population of the Earth insufficiently white to reproduce itself. The threat is not yet dire, but if <a href=\"https://pbs.twimg.com/media/DKAw9taUEAIzArX.jpg\">the present trends proceed in a linear fashio</a>n, they will become dire within our children’s lifetimes.</p><blockquote class=\"tr_bq\"><p>Point 15: That’s a bit kumbaya-ish (or “-oid”). No doubt the Bushmen of the Kalahari are much better at hunting with spears than are Norwegians or Japanese. As Greg Cochran points out, though: “innate superiority at obsolete tasks (a born buggy-whip maker?) doesn’t necessarily translate to modern superiority, or even adequacy.”</p></blockquote><p>Superiority at an obsolete task, or at a task presently disvalued by modern liberal society, does not mean that it does not exist. Given the rate at which the Western world is descending into plumbing-free barbarism, hunting with spears may well prove to be a more important skill in the near future than the ability to solve advanced mathematical problems.</p><p>As for the other points, I do not object to the various nits being picked, as in most cases I tend to agree with them. I do not claim to have always planted my flag in the optimal place in the gradient between precision and brevity. As to the original question being posed, I consider Derb to be an honored elder who well merits a place of respect in the Alternative Right on the basis of his fearless iconoclasm and the personal sacrifices he has made in the interest of telling the truth.</p></div>",
  "content_text": "While I like and respect John Derbyshire, and bow to his demonstrated expertise in mathematics, he should probably resist the temptation to express any strong opinions on economics and political economy, as evidenced by\nhis recent speech on the Alt-Right\n. In any event, here is my response to it.\nPoint 1: I don’t know what a Marxian is. Typo for “Martian”?\nHa very ha. Anyhow, “Marxian” distinguishes those who accept elements of, and are heavily influenced by, various aspects of Karl Marx’s theories of history and political economy from those who accept and advocate Karl Marx’s political ideologies and policies. The former is a Marxian, the latter is a Marxist. I studied under a reasonably well-known Marxian, Robert Chernomas, which is why I am very well schooled in the substantive material differences between the two.\nBut you need not take my word for it.\nMarxian economics refers to several different theories and includes multiple schools of thought which are sometimes opposed to each other, and in many cases Marxian analysis is used to complement or supplement other economic approaches. Because one does not necessarily have to be politically Marxist to be economically Marxian, the two adjectives coexist in usage rather than being synonymous. They share a semantic field while also allowing connotative and denotative differences.\n–\nMarxian Economics\n, Infogalactic\nSadly, Prof. Chernomas did not make Wikipedia’s list of\nMarxian Economists\n. The point is, this is not one of my neologisms nor is it an even remotely esoteric concept.\nPoint 3: Let’s not get ideas above our station here. Aristotle had a philosophy. Descartes had a philosophy. Kant had a philosophy. What the Alt Right has is an attitude.\nFair enough, although it is rather more than that. At least in the form described by the 16 points, the Alt-Right has a\npolitical\nphilosophy that is more specific and coherent than anything currently on offer from conservatives, liberals, progressives, globalists, or the Fake Right. If we are merely an “attitude”, then how does one describe those things to which we are an alternative?\nPoint 4: I think the Jews should have gotten a mention there, since half of the Christian Bible is about them.\nAbsolutely not. The Jews are not part of Western civilization. They pre-date it, they are of the East, and a significant portion of their cultural tradition is pre-civilized. The fact that the primary architects of the present effort to destroy Western civilization, particularly its pillars of Christianity and the European nations, are Jewish suffice to make it very clear that, while some Jews may be\nin\nthe West, they are not\nof\nthe West. Judaism is a conscious rejection of Christianity, and therefore, of the West.\nPoint 6: When the slave traders arrive from Alpha Centauri, or an asteroid hits, or a supervolcano pops, we shall all become globalists overnight.\nNo, we won’t. Reality is not Star Trek. The entire written history of Man indicates that should slave traders arrive from Alpha Centauri, the various human elites will hasten to make deals with them to set up satrapies over which they will rule to provide them with the slaves they seek. See: the history of the slave trade in Africa.\nPoint 8: It’s what? The word “scientody” is not known to dictionary.com; nor is it in my 1971 OED with supplement; nor in my 1993 Webster’s.\nI tried digging for etymologies, but got lost in a thicket of possibilities. Greek hodos, a path or way; so “the way of science”? Or perhaps eidos, a shape or form, giving us the “-oid” suffix (spheroid, rheumatoid); so “science-like”? Then there’s aoide, a song, giving … what? “Harmonizes like science”? Or maybe it’s the Latin root odor, a smell; “smells like science.”\nIn any case, all three of the “understandings” here are gibberish.\na) There is a large body of solidly-established scientific results that are not liable to future revision.\nSaturn is further from the Sun at any point of its orbit than Jupiter is at any point of its. A water molecule has two hydrogen atoms and one oxygen atom. Natural selection plays an important role in the evolution of life.\nI promise Vox Day there will be no future revisions of these facts, at any rate not on any time span he or I need worry about. (I add that qualification because there are conceivable astronomical events that could alter the sequence of planetary orbits—a very close encounter with a rogue star, for example. Those are once-in-a-billion-year occurrences, though.)\nb) “Scientistry”? Wha?\nc) The scientific consensus is unscientific? Huh? And why is the consensus “so-called”? There usually—not always, but usually—is a scientific consensus. It occasionally turns out to have been wrong, but it’s a consensus none the less, not a “so-called” consensus.\nTo simply call everything “science” is to be misleading, often intentionally. Science has no intrinsic authority, it is less reliable than engineering, and increasingly, references to it are a deceitful bait-and-switch, in which the overly credulous are led to believe that because an individual with certain credentials is asserting something, that statement is supported by documentary evidence gathered through the scientific method of hypothesis, experiment, and successful replication.\nIn most – not many, but\nmost\n– cases, that is simply not true. Even if you don’t use these three neologisms to describe the three aspects of science, you must learn to distinguish between them or you will repeatedly fall for this intentional bait-and-switch. In order of reliability, the three aspects of science are:\nScientody: the process\nScientage: the knowledge base\nScientistry: the profession\nThe scientific consensus is is “so-called” because while it may be a consensus, it is\nintrinsically\nunscientific. This is obvious, observable, and undeniable. Taking a vote of the current opinions of scientists is no more scientody than is collecting their cumulative bodily evacuations for hygienic disposal. The expressed opinions that make up the consensus may be based on anything from a personal use of the scientific process to a) desire to obtain grant money, b) political ideology, c) identity, d) mental illness, e) sexual desire, f) personal ambition, or g) anything else capable of influencing one’s opinion.\nPoint 13: I’m an economic ignoramus, but I’d like to see a good logical proof of the proposition that free trade requires free movement of peoples. I am sincerely open to being enlightened on this point.\nFree trade, by definition, concerns unrestricted exchanges between two private parties. These exchanges may involve goods, capital, services, and labor. In order to freely provide services or labor, the providing party must be able to travel to the location of the receiving party in order to fulfill his end of the exchange. Therefore, free trade requires the free movement of peoples.\nAs a bonus proof, I will point out that in order to achieve the maximum efficiencies theoretically provided by the free market, both labor and capital must be able to travel to the most efficient production sites. Any failure to restrict this travel will necessarily create inefficiencies and therefore prevent the economy from reaching its maximum growth potential.\nPoint 14. I doubt there is an existential threat to white people.\nDerb has more than enough math to work out the amount of cross-breeding required to render the entire population of the Earth insufficiently white to reproduce itself. The threat is not yet dire, but if\nthe present trends proceed in a linear fashio\nn, they will become dire within our children’s lifetimes.\nPoint 15: That’s a bit kumbaya-ish (or “-oid”). No doubt the Bushmen of the Kalahari are much better at hunting with spears than are Norwegians or Japanese. As Greg Cochran points out, though: “innate superiority at obsolete tasks (a born buggy-whip maker?) doesn’t necessarily translate to modern superiority, or even adequacy.”\nSuperiority at an obsolete task, or at a task presently disvalued by modern liberal society, does not mean that it does not exist. Given the rate at which the Western world is descending into plumbing-free barbarism, hunting with spears may well prove to be a more important skill in the near future than the ability to solve advanced mathematical problems.\nAs for the other points, I do not object to the various nits being picked, as in most cases I tend to agree with them. I do not claim to have always planted my flag in the optimal place in the gradient between precision and brevity. As to the original question being posed, I consider Derb to be an honored elder who well merits a place of respect in the Alternative Right on the basis of his fearless iconoclasm and the personal sacrifices he has made in the interest of telling the truth.",
  "tags": [
    "#AltRight",
    "philosophy"
  ],
  "categories": [],
  "sitemap_lastmod": "2017-11-09T16:00:00+00:00"
}