{
  "url": "https://voxday.net/2017/11/20/espn-doubles-down/",
  "scraped_at": "2025-12-19T10:32:11.182946",
  "title": "ESPN doubles down",
  "date_display": "November 20, 2017",
  "date_iso": "2017-11-20T13:00:00+00:00",
  "date_from_url": "2017-11-20",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>As you would expect, of course. Because SJWs are always going to do what SJWs do. <a href=\"https://www.newsbusters.org/blogs/nb/tom-blumer/2017/11/19/espns-scott-van-pelt-insults-millions-who-no-longer-watch-it\">ESPN’s Scott Van Pelt can’t imagine how anyone might spend their evenings</a> rather than sit slack-jawed in front of the television every night:</p><blockquote><p>VAN PELT: Sure. Of course. I mean, right. Everything you said is true, I’m going to boycott this — And for the folks, if you truly wanna boycott the NFL or if you wanna boycott ESPN, the notion that some guy sitting out there, or gal, and they decide, “You know what, I’m gonna go ahead and cut my entire cable package because ESPN gave an award on a made-up show in July because there’s no sports to a woman who used to be a man, so I’m now not gonna have any cable TV at all, and I’m gonna sit around at night and read books by candlelight like olden times because of that.” That’s just, that’s not happening.</p><p>And if you did that, then you’re so dumb that I can’t even pray for you because you’re beyond hope. If that was your reaction to this — was to deny yourself the ability to watch television — I mean that just hasn’t happened and didn’t happen.</p></blockquote><p>It can really be rather remarkable to be provided a clear description of the drivel that passes for SJW thought processes. There is so much wrong with their thinking that it is hard to know where to even start.</p><p>SJWs simply don’t understand that we view their moral imperatives and assumptions in much the same way that they view the KKK and the German National Socialist Workers Party. We are no more inclined to fund their incessant celebrations of immorality and insanity than they are inclined to pay for the racism, sexism, and fill-in-the-blank-ophobia they so vehemently decry.</p><p>We can live without cable TV. We can live without ESPN. And we know that they cannot survive without us. Cut the cord. Starve the SJW media. And if you want to understand why they will never back down, not even when their corporate survival depends upon it, <a href=\"http://amzn.to/2xt9dWb\">read SJWADD</a>.</p><p>Though I wonder if Van Pelt would feel differently if he knew people were sitting around at night reading <a href=\"http://amzn.to/1OlqOY7\">the 4GW Handbook</a>?</p></div>",
  "content_text": "As you would expect, of course. Because SJWs are always going to do what SJWs do.\nESPN’s Scott Van Pelt can’t imagine how anyone might spend their evenings\nrather than sit slack-jawed in front of the television every night:\nVAN PELT: Sure. Of course. I mean, right. Everything you said is true, I’m going to boycott this — And for the folks, if you truly wanna boycott the NFL or if you wanna boycott ESPN, the notion that some guy sitting out there, or gal, and they decide, “You know what, I’m gonna go ahead and cut my entire cable package because ESPN gave an award on a made-up show in July because there’s no sports to a woman who used to be a man, so I’m now not gonna have any cable TV at all, and I’m gonna sit around at night and read books by candlelight like olden times because of that.” That’s just, that’s not happening.\nAnd if you did that, then you’re so dumb that I can’t even pray for you because you’re beyond hope. If that was your reaction to this — was to deny yourself the ability to watch television — I mean that just hasn’t happened and didn’t happen.\nIt can really be rather remarkable to be provided a clear description of the drivel that passes for SJW thought processes. There is so much wrong with their thinking that it is hard to know where to even start.\nSJWs simply don’t understand that we view their moral imperatives and assumptions in much the same way that they view the KKK and the German National Socialist Workers Party. We are no more inclined to fund their incessant celebrations of immorality and insanity than they are inclined to pay for the racism, sexism, and fill-in-the-blank-ophobia they so vehemently decry.\nWe can live without cable TV. We can live without ESPN. And we know that they cannot survive without us. Cut the cord. Starve the SJW media. And if you want to understand why they will never back down, not even when their corporate survival depends upon it,\nread SJWADD\n.\nThough I wonder if Van Pelt would feel differently if he knew people were sitting around at night reading\nthe 4GW Handbook\n?",
  "tags": [
    "SJW",
    "sports"
  ],
  "categories": [],
  "sitemap_lastmod": "2017-11-20T13:00:00+00:00"
}