{
  "url": "https://voxday.net/2017/11/22/fake-americans-fake-solutions/",
  "scraped_at": "2025-12-19T10:32:24.951956",
  "title": "Fake Americans, fake solutions",
  "date_display": "November 22, 2017",
  "date_iso": "2017-11-22T09:03:00+00:00",
  "date_from_url": "2017-11-22",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>This article by an early Fake American <a href=\"https://imprimis.hillsdale.edu/the-problem-of-identity-politics-and-its-solution/\">conclusively proves the power of identity politics</a> even as he attempts to “solve” the problem of them.</p><blockquote class=\"tr_bq\"><p>The beginnings of identity politics can be traced to 1973, the year the first volume of Alexander Solzhenitsyn’s Gulag Archipelago—a book that demolished any pretense of communism’s moral authority—was published in the West. The ideological challenge of socialism was fading, its fighting spirit dwindling. This presented a challenge for the Left: how to carry on the fight against capitalism when its major ideological alternative was no longer viable?</p></blockquote><p>No, the beginning of identity politics in the United States can be traced to the mass immigration of Italians and Irish back in the 1800s. But as students of Roman and Byzantine history know, mass immigration and the identity politics that follow from it long precede the existence of the United States.</p><blockquote class=\"tr_bq\"><p>In 2004, Harvard political scientist Samuel Huntington published Who Are We? Huntington examined the stunning immigration, both legal and illegal, from Mexico and argued that it was undermining longstanding notions of American national identity. America, Huntington said, has both a creed and a culture. The creed is formulated in the founding documents of our nation and in the speeches of Abraham Lincoln. The culture derives from the Anglo-Protestant settlers who first peopled North America. Huntington worried about a “hispanicization” of American culture. This book was controversial, to say the least. Nor was it without weaknesses. It is hard for this descendant of Irish and Italian immigrants to accept the notion that America’s culture is monolithically Anglo-Protestant.</p></blockquote><p>Every single time. And why would it be hard for Mr. Continetti to accept a basic fact of American history?<i> Because his name is Continetti</i>. The amusing thing is that he would probably angrily deny my claim to be a true blue Italian despite the fact that <i>by his own illogic</i>, I am more genuinely Italian than he is. Those who deny identity politics while clinging to their own identities will inevitably descend into self-parody sooner or later.</p><blockquote class=\"tr_bq\"><p>Identity politics is a veneer over the class politics that truly defines our society, and education is the best prism through which to view class in America today. </p></blockquote><p>Ironic, that a self-styled conservative would turn to a Marxian analysis in order to deny the identity politics that give him feelbads. Conservatives really have become yesterday’s liberals. Identity politics is not a veneer. It is the inevitable consequence of rival identities. Note that in Singapore, the leadership began consciously managing identity politics and to characterize Singaporeans by citizenship rather than national identity because its population was only 75 percent Chinese, (13.7 Malay, 8.7 Indian, 2.6 various), a percentage they felt to be too low to support genuine nationalism.</p><blockquote class=\"tr_bq\"><p>To combat identity politics, we must emphasize an American nationalism based on both a commitment to the ideals of the American Founding and a shared love of our national history and culture—a history and culture of individual freedom and religious pluralism, resistant to centralized authority and ever expanding into new frontiers and new possibilities.</p></blockquote><p>Who is this “we”, kemosabe? How is this fake nationalism going to survive when it is based on a commitment that no one has to actually make and a love that is never going to be measured or held accountable? Will those who refuse to commit or simply don’t possess the love be stripped of their paper nationality and expelled? If not, then this is just more high-minded Fake American blather meant to disguise the fact that while they are citizens of the same multinational imperial state, neither they nor their ancestors were ever truly Americans.</p><p>UPDATE: So much for <a href=\"https://twitter.com/BillKristol/status/933074207637991424\">propositional conservatism</a>. He has to go back.</p><blockquote class=\"tr_bq\"><p>The GOP tax bill’s bringing out my inner socialist. The sex scandals are bringing out my inner feminist. Donald Trump and Roy Moore are bringing out my inner liberal. WHAT IS HAPPENING?</p></blockquote></div>",
  "content_text": "This article by an early Fake American\nconclusively proves the power of identity politics\neven as he attempts to “solve” the problem of them.\nThe beginnings of identity politics can be traced to 1973, the year the first volume of Alexander Solzhenitsyn’s Gulag Archipelago—a book that demolished any pretense of communism’s moral authority—was published in the West. The ideological challenge of socialism was fading, its fighting spirit dwindling. This presented a challenge for the Left: how to carry on the fight against capitalism when its major ideological alternative was no longer viable?\nNo, the beginning of identity politics in the United States can be traced to the mass immigration of Italians and Irish back in the 1800s. But as students of Roman and Byzantine history know, mass immigration and the identity politics that follow from it long precede the existence of the United States.\nIn 2004, Harvard political scientist Samuel Huntington published Who Are We? Huntington examined the stunning immigration, both legal and illegal, from Mexico and argued that it was undermining longstanding notions of American national identity. America, Huntington said, has both a creed and a culture. The creed is formulated in the founding documents of our nation and in the speeches of Abraham Lincoln. The culture derives from the Anglo-Protestant settlers who first peopled North America. Huntington worried about a “hispanicization” of American culture. This book was controversial, to say the least. Nor was it without weaknesses. It is hard for this descendant of Irish and Italian immigrants to accept the notion that America’s culture is monolithically Anglo-Protestant.\nEvery single time. And why would it be hard for Mr. Continetti to accept a basic fact of American history?\nBecause his name is Continetti\n. The amusing thing is that he would probably angrily deny my claim to be a true blue Italian despite the fact that\nby his own illogic\n, I am more genuinely Italian than he is. Those who deny identity politics while clinging to their own identities will inevitably descend into self-parody sooner or later.\nIdentity politics is a veneer over the class politics that truly defines our society, and education is the best prism through which to view class in America today.\nIronic, that a self-styled conservative would turn to a Marxian analysis in order to deny the identity politics that give him feelbads. Conservatives really have become yesterday’s liberals. Identity politics is not a veneer. It is the inevitable consequence of rival identities. Note that in Singapore, the leadership began consciously managing identity politics and to characterize Singaporeans by citizenship rather than national identity because its population was only 75 percent Chinese, (13.7 Malay, 8.7 Indian, 2.6 various), a percentage they felt to be too low to support genuine nationalism.\nTo combat identity politics, we must emphasize an American nationalism based on both a commitment to the ideals of the American Founding and a shared love of our national history and culture—a history and culture of individual freedom and religious pluralism, resistant to centralized authority and ever expanding into new frontiers and new possibilities.\nWho is this “we”, kemosabe? How is this fake nationalism going to survive when it is based on a commitment that no one has to actually make and a love that is never going to be measured or held accountable? Will those who refuse to commit or simply don’t possess the love be stripped of their paper nationality and expelled? If not, then this is just more high-minded Fake American blather meant to disguise the fact that while they are citizens of the same multinational imperial state, neither they nor their ancestors were ever truly Americans.\nUPDATE: So much for\npropositional conservatism\n. He has to go back.\nThe GOP tax bill’s bringing out my inner socialist. The sex scandals are bringing out my inner feminist. Donald Trump and Roy Moore are bringing out my inner liberal. WHAT IS HAPPENING?",
  "tags": [
    "immigration",
    "nationalism",
    "politics"
  ],
  "categories": [],
  "sitemap_lastmod": "2017-11-22T09:03:00+00:00"
}