{
  "url": "https://voxday.net/2017/11/28/harry-and-the-half-blood-princess/",
  "scraped_at": "2025-12-19T10:33:02.449997",
  "title": "Harry and the Half-Blood Princess",
  "date_display": "November 28, 2017",
  "date_iso": "2017-11-28T09:33:00+00:00",
  "date_from_url": "2017-11-28",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>I was asked for my take on the recent engagement of Prince Harry, so here it is.</p><p>The fact that the engagement of Harry Windsor to <i>Suits </i>actress Meghan Markle is an obvious mistake that is likely to end in disaster can be observed in the fact that every media outlet in the UK, who collectively are normally the bitchiest, most skeptical media this side of a Hollywood gossip column, is tripping all over each other in a competition to see who can coo more positively about how an English prince is marrying a divorced, mixed-race American actress who is pushing forty.</p><p>(Yes, I know they say she’s 36, but if that’s actually true, she’ll be the first actress ever known to honestly report her age. Hollywood ages are the opposite of reported NBA heights and Democratic poll shares; to get a more accurate estimate, you need to add two or three.)</p><p>Think about it. How on Earth did the British media, which has <i>never </i>missed a possible Harry Potter-related headline just happen to miss this one? And yes, I know she will be a duchess, not a princess, that’s not the point. The real reason the British media is so happy about Ms Markle instead of the traditional twenty-something English Rose one would have expected is that it can now anoint the couple the symbol of the New Britain, which is Not British, but Afri-Pakistani. About the only thing she is missing is being a Muslim.</p><p>The thing one has to keep in mind about all this is that Harry is, for the most part, an idiot. That’s not my word, that’s a quote from an otherwise fawning article about the man. <i>“Harry was again mortified, more for embarrassing his grandmother again than for what he had brought on himself. Yes, he was an idiot, but Harry has always been a bit of a wild child with a tendency to party harder than most.”</i></p><p>Sure, it was idiotic to dress up like a Nazi or party naked in Las Vegas, but surely this time, he’s got it right with his older American actress divorcee, right? No red flags there! There was a time, not too long ago, that even a king would have to abdicate in order to marry such a creature, and given how that marriage ended, it’s more than a little remarkable that the man’s niece blithely granted her royal permission for Prince Harry to follow in his great-uncle’s footsteps. In light of her approval, one wonders what would be sufficient to cause that permission to be denied, a history of axe-murdering? Multiple arrests for DUI and prostitution?</p><p>Harry is a prime example of a situational alpha who is a low delta at heart, and a delta with some noticeable gamma strains to boot. On the one hand, he’s extremely rich, extremely famous, tall, courageous, and better-looking than the average man. On the other, he has always <i>severely </i>underkicked his coverage; he’s had a long tendency to involve himself with older, not-very-attractive women. One would expect a “wild child” in his position to have a track record with women that made Leonardo diCaprio’s look modest, but if the media is to be believed, Harry has mostly been involved with women who are a bit old, a bit fat, or a bit plain.</p><p>There is nothing wrong with any of that, of course, but the pattern is indicative of a deep internal insecurity where women are concerned. And if you doubt my take on the matter, consider this observation from an article about the couple’s first post-engagement appearance together.</p><blockquote class=\"tr_bq\"><p>As they walked around the garden, Meghan could be seen wrapping a protective arm around her fiancé and tenderly patting his back. ‘The dramatic thing was that she was leading him, just like a professional dancer leading the amateur on Strictly,’ says Judi. ‘She was leading the choreography rather than him, which is quite outstanding for a royal couple. She also has this trait of putting her hands on top of this. The person who does this is normally the one in control – she’s leading the game.’ </p></blockquote><p>Interpretation: <i>Harry is a Mama’s boy who lost his mother at a young age and has never recovered from the loss. His sociosexual rank is completely out of whack as a result, as he combines elite social rank with infantile sexuality that is desperate for the Lost Mommy. Unless she possesses acute foresight and iron-clad self-discipline, this older actress is most likely going to eat the prince alive and control his life to an extent that will become distasteful to his family, to the public, and eventually, to Harry himself.</i></p><p>That doesn’t mean the marriage won’t work out. There are stranger combinations that have made true love matches and successfully paired-off for life. It simply means that the odds against that happening are formidable. I would give a 10 percent chance that it doesn’t ultimately end in divorce.</p><p>And, of course, this doesn’t even get into the fact that due to FATCA, as the spouse of an American, Harry Windsor will now have to file an annual tax return with the IRS as a non-resident alien, and any future children with Ms Markle will be Americans subject to the US tax regime. Forget Queen Elizabeth’s approval; I can’t believe his <i>accountant </i>let him marry the woman.</p></div>",
  "content_text": "I was asked for my take on the recent engagement of Prince Harry, so here it is.\nThe fact that the engagement of Harry Windsor to\nSuits\nactress Meghan Markle is an obvious mistake that is likely to end in disaster can be observed in the fact that every media outlet in the UK, who collectively are normally the bitchiest, most skeptical media this side of a Hollywood gossip column, is tripping all over each other in a competition to see who can coo more positively about how an English prince is marrying a divorced, mixed-race American actress who is pushing forty.\n(Yes, I know they say she’s 36, but if that’s actually true, she’ll be the first actress ever known to honestly report her age. Hollywood ages are the opposite of reported NBA heights and Democratic poll shares; to get a more accurate estimate, you need to add two or three.)\nThink about it. How on Earth did the British media, which has\nnever\nmissed a possible Harry Potter-related headline just happen to miss this one? And yes, I know she will be a duchess, not a princess, that’s not the point. The real reason the British media is so happy about Ms Markle instead of the traditional twenty-something English Rose one would have expected is that it can now anoint the couple the symbol of the New Britain, which is Not British, but Afri-Pakistani. About the only thing she is missing is being a Muslim.\nThe thing one has to keep in mind about all this is that Harry is, for the most part, an idiot. That’s not my word, that’s a quote from an otherwise fawning article about the man.\n“Harry was again mortified, more for embarrassing his grandmother again than for what he had brought on himself. Yes, he was an idiot, but Harry has always been a bit of a wild child with a tendency to party harder than most.”\nSure, it was idiotic to dress up like a Nazi or party naked in Las Vegas, but surely this time, he’s got it right with his older American actress divorcee, right? No red flags there! There was a time, not too long ago, that even a king would have to abdicate in order to marry such a creature, and given how that marriage ended, it’s more than a little remarkable that the man’s niece blithely granted her royal permission for Prince Harry to follow in his great-uncle’s footsteps. In light of her approval, one wonders what would be sufficient to cause that permission to be denied, a history of axe-murdering? Multiple arrests for DUI and prostitution?\nHarry is a prime example of a situational alpha who is a low delta at heart, and a delta with some noticeable gamma strains to boot. On the one hand, he’s extremely rich, extremely famous, tall, courageous, and better-looking than the average man. On the other, he has always\nseverely\nunderkicked his coverage; he’s had a long tendency to involve himself with older, not-very-attractive women. One would expect a “wild child” in his position to have a track record with women that made Leonardo diCaprio’s look modest, but if the media is to be believed, Harry has mostly been involved with women who are a bit old, a bit fat, or a bit plain.\nThere is nothing wrong with any of that, of course, but the pattern is indicative of a deep internal insecurity where women are concerned. And if you doubt my take on the matter, consider this observation from an article about the couple’s first post-engagement appearance together.\nAs they walked around the garden, Meghan could be seen wrapping a protective arm around her fiancé and tenderly patting his back. ‘The dramatic thing was that she was leading him, just like a professional dancer leading the amateur on Strictly,’ says Judi. ‘She was leading the choreography rather than him, which is quite outstanding for a royal couple. She also has this trait of putting her hands on top of this. The person who does this is normally the one in control – she’s leading the game.’\nInterpretation:\nHarry is a Mama’s boy who lost his mother at a young age and has never recovered from the loss. His sociosexual rank is completely out of whack as a result, as he combines elite social rank with infantile sexuality that is desperate for the Lost Mommy. Unless she possesses acute foresight and iron-clad self-discipline, this older actress is most likely going to eat the prince alive and control his life to an extent that will become distasteful to his family, to the public, and eventually, to Harry himself.\nThat doesn’t mean the marriage won’t work out. There are stranger combinations that have made true love matches and successfully paired-off for life. It simply means that the odds against that happening are formidable. I would give a 10 percent chance that it doesn’t ultimately end in divorce.\nAnd, of course, this doesn’t even get into the fact that due to FATCA, as the spouse of an American, Harry Windsor will now have to file an annual tax return with the IRS as a non-resident alien, and any future children with Ms Markle will be Americans subject to the US tax regime. Forget Queen Elizabeth’s approval; I can’t believe his\naccountant\nlet him marry the woman.",
  "tags": [
    "AlphaGame",
    "women"
  ],
  "categories": [],
  "sitemap_lastmod": "2017-11-28T09:33:00+00:00"
}