{
  "url": "https://voxday.net/2017/11/22/hashtag-canceled/",
  "scraped_at": "2025-12-19T10:32:29.438535",
  "title": "Hashtag canceled",
  "date_display": "November 22, 2017",
  "date_iso": "2017-11-22T18:00:00+00:00",
  "date_from_url": "2017-11-22",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p><i>A longtime DC Comics fan explains why he recently canceled his subscription.</i></p><p>Like many kids, I enjoyed comics, but as I got older I gave them up so it had been decades since I’d bought one. In 2016 DC, realizing that their sales were slumping and the effect of SJWs on their comic franchises, launched <i>Rebirth</i>, which was a supposed return to the roots of the characters. I’ve always liked Batman and Superman and decided to give them a shot. My focus here is with the political and moral implications of the various comics, not specific plots, unless they were especially good or bad. The art ranged from really good at times to mediocre but that’s outside the scope of this too. I’m not looking for political perfection in my comics and I expect them to be as far left as the average TV program–which is at minimum center left.</p><p>However, I was finally forced to conclude that <i>Rebirth </i>is an SJW bait-and-switch aimed at traditional fans, and that all of the reborn comics will eventually be as converged as they were before. And that’s not even taking into account the fact that Marvel’s big SJW, Brian Bendis, is now coming to DC to do to Superman what he did to the various Marvel lines.</p><p><b>Detective Comics: </b>Read #934-956</p><p>The main arc is that Batman assembles a team to help in Gotham which includes Batwoman and even Clayface. The Clayface plot was actually pretty good of why he was a villain and him trying his best to reform his life. A positive highlight was the Victim Squad. They were a group of people who through Batman’s actions in the past were “collateral damage”. They had physical ailments, suffered loss, etc. They collectively decided that since something bad happened to them it justified whatever they wanted to do to the world and of course wanted revenge. I think this was a direct swipe at the victim culture. Another interesting plot is that Batwoman’s father is a military man who is running a black op to take out sleeper agents in Gotham. Batman stops him and moralizes at him, then throws him in jail. All well and good except Batman is dead wrong, the military guy is right, and there are sleeper agents in Gotham. I stopped reading it at Robin’s (Tim Drake) death because it was such a stupid plot device, and the it was obvious they were going to bring him back quickly making his death meaningless. The series has a few lesbians as as friends of the team and mentions that Batwoman was forced to leave the US Military Academy due to her being in a lesbian relationship. I’d say overall it’s center left, but not full SJW.</p><p><b>Titans:</b> Read #1-10</p><p>Not much to say here. It’s pretty boring, but the art was nice. I didn’t really care about the characters and I don’t remember a lot of heavy politics by the time I gave it up.</p><p><b>Superman:</b> Read #1-#35</p><p>This is the best of what I read. Superman is heroic, always tries to do what is right, including being a good father and husband to Lois. The art is good, the plots are classic, with an interesting twist that Lex Luthor is now a good guy (maybe). The best part of this series is the interaction between Superman and his son. I don’t even think I could nitpick this series if I wanted to as Krypto “Superdog” is even in it and defends Superboy and Superman. This is what comics should be like.</p><p><b><a href=\"https://www.newsarama.com/37431-preview-doomsday-clock-1.html\">Doomday Clock:</a></b></p><p><a href=\"https://img.purch.com/o/aHR0cDovL3d3dy5uZXdzYXJhbWEuY29tL2ltYWdlcy9pLzAwMC8yMTMvODI1L29yaWdpbmFsL0REQ0xPQ0tfMV8yLmpwZw==\" imageanchor=\"1\" style=\"clear: right; float: right; margin-bottom: 1em; margin-left: 1em;\"><img border=\"0\" data-original-height=\"800\" data-original-width=\"521\" decoding=\"async\" fetchpriority=\"high\" height=\"320\" src=\"https://img.purch.com/o/aHR0cDovL3d3dy5uZXdzYXJhbWEuY29tL2ltYWdlcy9pLzAwMC8yMTMvODI1L29yaWdpbmFsL0REQ0xPQ0tfMV8yLmpwZw==\" width=\"208\"/></a>I read the preview and it is 100{75555d9e07a24e4b9ce698107dbbd309d5544f8e8057bab8f219509a7e001883} converged. “Undeplorables”, Russia is the enemy, and William F. Buckley Jr. is a villain. This is the future of DC now, as this event will impact the continuity going forward.<br><b><br/></b><b>Action Comics:</b> #957-987</br></p><p>This is the series which made me give up on DC. It starts out reasonably well and retells Superman’s origins, death at the hands of Doomsday, and explains how this Superman got here as apparently he died again before this series of illness and this Superman is from New Earth, not Earth Prime on which things happen now. (Confused yet? Welcome to the silliness of comic continuity.) The plot dragged down as Doomsday showed back up but there was no tension because they weren’t going to kill Superman again with Doomsday since started with Superman #1. They high point is where Lois and Jon (Superboy) pray for their father during the fight.</p><p>From there it goes downhill plot-wise and the SJWs show back up. First after raising their son in an idyllic countryside about an hour from Metropolis Lois decides that she isn’t fulfilled and a whole lot of horrible rationalizing begins by Lois and Superman of why she needs to go back to work at the Daily Planet, live in an apartment, and Superman of course goes along with all of it. Even though they both admit it’s not necessary monetarily, and Jon loves his friends and where he lives. He complains but they don’t give a shit and move him to a skyscraper because it makes them happy. (Are Babyboomers writing this?)</p><p>Then an SJW writer takes over and “the worst evil humans can commit” is brought about by some guy named Dr. Oz which includes a white hunter teaching his son in Africa to poach rhino horns, white rebels in Africa stealing medicine, white sweatshop owners, and a white guy who lost his job to Hispanics – expressly illegal immigrants – tries to gun them down while wearing an American flag bandanna on his head. I stopped reading right then, and got my money refunded on my Kindle. In fact I had purchased a few others I had not read yet and got my money refunded on all of them too.</p><p>With the recent Bendis hire, I can only imagine where things are headed. I’m sure Superman will be fully converged soon. I’m a casual fan, so any corrections in the above with regards to plot or characters is appreciated and I’m sure that the serious fans will have a lot of good insights to add which I missed. I’m also curious to know about some of the other series like Green Arrow or Wonder Woman are like, and what state they are in since <i>Rebirth</i>.</p></div>",
  "content_text": "A longtime DC Comics fan explains why he recently canceled his subscription.\nLike many kids, I enjoyed comics, but as I got older I gave them up so it had been decades since I’d bought one. In 2016 DC, realizing that their sales were slumping and the effect of SJWs on their comic franchises, launched\nRebirth\n, which was a supposed return to the roots of the characters. I’ve always liked Batman and Superman and decided to give them a shot. My focus here is with the political and moral implications of the various comics, not specific plots, unless they were especially good or bad. The art ranged from really good at times to mediocre but that’s outside the scope of this too. I’m not looking for political perfection in my comics and I expect them to be as far left as the average TV program–which is at minimum center left.\nHowever, I was finally forced to conclude that\nRebirth\nis an SJW bait-and-switch aimed at traditional fans, and that all of the reborn comics will eventually be as converged as they were before. And that’s not even taking into account the fact that Marvel’s big SJW, Brian Bendis, is now coming to DC to do to Superman what he did to the various Marvel lines.\nDetective Comics:\nRead #934-956\nThe main arc is that Batman assembles a team to help in Gotham which includes Batwoman and even Clayface. The Clayface plot was actually pretty good of why he was a villain and him trying his best to reform his life. A positive highlight was the Victim Squad. They were a group of people who through Batman’s actions in the past were “collateral damage”. They had physical ailments, suffered loss, etc. They collectively decided that since something bad happened to them it justified whatever they wanted to do to the world and of course wanted revenge. I think this was a direct swipe at the victim culture. Another interesting plot is that Batwoman’s father is a military man who is running a black op to take out sleeper agents in Gotham. Batman stops him and moralizes at him, then throws him in jail. All well and good except Batman is dead wrong, the military guy is right, and there are sleeper agents in Gotham. I stopped reading it at Robin’s (Tim Drake) death because it was such a stupid plot device, and the it was obvious they were going to bring him back quickly making his death meaningless. The series has a few lesbians as as friends of the team and mentions that Batwoman was forced to leave the US Military Academy due to her being in a lesbian relationship. I’d say overall it’s center left, but not full SJW.\nTitans:\nRead #1-10\nNot much to say here. It’s pretty boring, but the art was nice. I didn’t really care about the characters and I don’t remember a lot of heavy politics by the time I gave it up.\nSuperman:\nRead #1-#35\nThis is the best of what I read. Superman is heroic, always tries to do what is right, including being a good father and husband to Lois. The art is good, the plots are classic, with an interesting twist that Lex Luthor is now a good guy (maybe). The best part of this series is the interaction between Superman and his son. I don’t even think I could nitpick this series if I wanted to as Krypto “Superdog” is even in it and defends Superboy and Superman. This is what comics should be like.\nDoomday Clock:\nI read the preview and it is 100{75555d9e07a24e4b9ce698107dbbd309d5544f8e8057bab8f219509a7e001883} converged. “Undeplorables”, Russia is the enemy, and William F. Buckley Jr. is a villain. This is the future of DC now, as this event will impact the continuity going forward.\nAction Comics:\n#957-987\nThis is the series which made me give up on DC. It starts out reasonably well and retells Superman’s origins, death at the hands of Doomsday, and explains how this Superman got here as apparently he died again before this series of illness and this Superman is from New Earth, not Earth Prime on which things happen now. (Confused yet? Welcome to the silliness of comic continuity.) The plot dragged down as Doomsday showed back up but there was no tension because they weren’t going to kill Superman again with Doomsday since started with Superman #1. They high point is where Lois and Jon (Superboy) pray for their father during the fight.\nFrom there it goes downhill plot-wise and the SJWs show back up. First after raising their son in an idyllic countryside about an hour from Metropolis Lois decides that she isn’t fulfilled and a whole lot of horrible rationalizing begins by Lois and Superman of why she needs to go back to work at the Daily Planet, live in an apartment, and Superman of course goes along with all of it. Even though they both admit it’s not necessary monetarily, and Jon loves his friends and where he lives. He complains but they don’t give a shit and move him to a skyscraper because it makes them happy. (Are Babyboomers writing this?)\nThen an SJW writer takes over and “the worst evil humans can commit” is brought about by some guy named Dr. Oz which includes a white hunter teaching his son in Africa to poach rhino horns, white rebels in Africa stealing medicine, white sweatshop owners, and a white guy who lost his job to Hispanics – expressly illegal immigrants – tries to gun them down while wearing an American flag bandanna on his head. I stopped reading right then, and got my money refunded on my Kindle. In fact I had purchased a few others I had not read yet and got my money refunded on all of them too.\nWith the recent Bendis hire, I can only imagine where things are headed. I’m sure Superman will be fully converged soon. I’m a casual fan, so any corrections in the above with regards to plot or characters is appreciated and I’m sure that the serious fans will have a lot of good insights to add which I missed. I’m also curious to know about some of the other series like Green Arrow or Wonder Woman are like, and what state they are in since\nRebirth\n.",
  "tags": [
    "Alt-Hero",
    "SJW"
  ],
  "categories": [],
  "sitemap_lastmod": "2017-11-22T18:00:00+00:00"
}