{
  "url": "https://voxday.net/2017/11/09/in-over-his-head/",
  "scraped_at": "2025-12-19T10:30:50.341308",
  "title": "In over his head",
  "date_display": "November 9, 2017",
  "date_iso": "2017-11-09T09:34:00+00:00",
  "date_from_url": "2017-11-09",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>Now, I generally enjoy reading both John Derbyshire and Zman, and I think they’re both intelligent iconoclasts, but every now and then I am surprised to discover how conceptually limited various would-be critics can be when they attempt to criticize me. They preen, they posture, and they pontificate even as they demonstrate that they neither understand me nor know whereof they speak. That may sound a little arrogant, but bear with me a moment and you’ll see what I mean.</p><p>The Zman mentioned this in <a href=\"http://thezman.com/wordpress/?p=11972\">his interesting summar</a>y of attending the Mencken Club:</p><blockquote class=\"tr_bq\"><p>John was first up and he used Vox Day’s 16-points blog post as the framework for his talk. He made the point that Vox is by no means the leader of the alt-right or the voice of it, but a representative sample that is useful for analyzing the movement. His comments about item number eight were laugh out loud funny, to the empirically minded. What John was doing was introducing the general ideas of the alt-right to a crowd that is not spending their evenings in the meme war. He did a good job presenting the broad strokes.</p></blockquote><p>This is all very well, but it led to the following string of comments which revealed some unexpected conceptual limitations on the part of the Zman. His failure to grasp either the obvious linguistics involved or to understand the basic nature of science is, to put it mildly, surprising. I find myself wondering if these failures are a logical consequence of his atheistic philosophical incoherence running headlong into its own conclusions, a kneejerk reaction to displeasure with something I have said, or simply an indication of his cognitive limitations.</p><blockquote><p><b>Toddy+Cat</b><br><i>Personally, I’d be very interested to hear what John Derbyshire had to say about Vox’s point number eight. Derbyshire is great intellect, a fantastic writer, and has enough moral courage for several men, but he (like all of us) is a product of his Time, and sometimes has way too much respect for “science” and the “scientific community”. He sometimes does not seem to realize just how politicized “science” has become in our day. As much as both he and I might regret it, this ain’t 1955.</i></br></p><p><b>thezman</b><br>He comically analyzed the possible entomology of the words, “scientodific” and “scientody”. He also pointed out the absurdity of the claim that scientific conclusions are liable to future revision. For instance, Mars is closer to the sun than Jupiter, a conclusion of science that will never be liable to revision. John correctly pointed out that number eight is gibberish.</br></p><p>I’ve written a little about this topic. I’ll be revisiting it frequently. I think there may even be a book in it, if I can manage to squeeze more than 24 hours from each day. Suffice it to say that I don’t think science and technology can be jammed into the moral philosophy of the 17th and 18th century. Therefore, we wither kill all the scientists or create a new moral philosophy.</p><p><b>Heywood</b><br><i>Mars is closer to the sun than Jupiter… Anyway, that’s a stupid argument. While facts may be immutable – for a time, which may be long, like in the case above – our interpretations in the form of theories are always placeholders. Good till something better comes along, which, btw, must have the same predicative power as the old theory had where it was applicable, while extending the range of predictability. See classic Newtonian mechanics vs. theory of relativity. And as it happens, neither addresses Vox’s point of all so many modern “scientists” who employ the trappings and outer forms of science while gleefully ignoring everything that makes it actually useful. Nothing of this strikes me as overly difficult to either comprehend or establish, given the state of sciences today.</i></br></p><p><b>thezman</b><br>I’ve heard every iteration of factual nihilism and I have no interest in taking it seriously. It’s just another way of putting the goal posts on roller skates.</br></p><p><b>Man of the West</b><br><i>Zman said: “He also pointed out the absurdity of the claim that scientific conclusions are liable to future revision” I am assuming and hoping that what John meant is that SOME scientific conclusions are not open to revision, as his example — though questionable as science — shows. Because if not, and if the above statement is what he actually meant, then it is foolishness of a high order given the provisional nature of science and the fact that we know that there are unknown errors in scientific conclusions (as the replication crisis is presently showing us) that may be discovered at a later time.</i><br><i><br/></i><i>Of course, John may have a unique definition of ‘science’ or of the word ‘conclusions’ which gives him some wiggle room, but then he is just playing semantic games.</i></br></br></p><p><b>thezman</b><br>Think of it this way. There is a set of things that have to be true or nothing is true. There is a set of things that are most likely true, but have yet to be conclusively proven. There are a set of things that may be true, but there’s either no way to test them or the efforts to prove them have fallen short. Finally, there is the set of things that are unknown.</br></p><p>Scientific conclusions are the first set. The second and third sets are open to revision and challenge. It’s not a matter of semantics. It is about definitions. People tend not to grasp the definitions of science, because the have had little exposure to math or science.</p><p><b>Byzantine_General</b><br><i>Your first category encompasses logic and mathematics. Your second includes theories of gravitation, where Einstein’s superceded Newton’s. But your words seem to place today’s scientific “conclusions” in the first category, rather than the second. Can you explain without casting nasturtiums?</i><br><i><br/></i><i>“Factual nihilism”. Hmph.</i><br><b><br/></b><b>thezman</b><br>I wrote, “Scientific conclusions are the first set.” That seems to cover it. Science, like mathematics, is about the accumulation of axioms, things that are assumed to be true by their nature. Put another way, if everything is open to revision, there is no truth.<br><b><br/></b><b>Byzantine_General</b><br><i>I am gobsmacked, and I say this lovingly, by your wrong-headedness.</i><br><i><br/></i><i>Science deals in theories, not conclusions. Theories are always contingent; we strenuously fail to falsify them, accumulate partial belief in them, build on and with them, but can never reach axiomatic mathematical certainty.</i><br><i><br/></i><i>Not long ago, the best available theory was that neutrinos had zero mass. It could have been loosely said that science had concluded that this was the case. But the progress of science demands that it does not make conclusions.</i><br><i><br/></i><i>A pesky observation (that the wrong kind of neutrinos were arriving on Earth from the Sun) forced that theory to be abandoned. A better theory accounted for the observation (and all previous observations), and entailed a non-zero mass. This is a perfect example of scientific progress.</i><br><i><br/></i><i>Axioms are not subject to abandonment. Had the zero mass of the neutrino been treated as an axiom, we would have been forced to reject the observation and the better theory, because the contradiction of an axiom is automatically false.</i><br><i><br/></i><i>Karl Popper’s criterion for deciding whether a theory is scientific is whether it could by some conceivable observation be falsified. Theories that can withstand any contrary evidence are called “religions”.</i><br><b><br/></b><b>thezman</b><br>Karl Popper was wrong. If everything can be falsified, then there is no truth. That’s nihilism.</br></br></br></br></br></br></br></br></br></br></br></br></br></p></blockquote><p>This is one of those moments when you suddenly realize that someone simply isn’t as intelligent as you had previously thought they were. One does not need to be a Popperian to recognize the obvious fact that many, if not <i>most</i>, scientific conclusions are intrinsically provisional, if not based entirely on false foundations. The Zman is making a common error in confusing the scientific method with a means of determining absolute truth; scientody is actually nothing more than a tool for determining what is <i>not </i>true from a material perspective and therefore can only ever be a means of narrowing the possible scope of the truth of things that remain firmly within the temporally accessible aspects of the material realm.</p><p>History, for example, is a matter of firmly established fact, and yet remains largely outside the realm of science and its conclusions.</p><p>In claiming that a correct understanding of science is nihilism, he confuses the subset of observable facts with the much larger set of scientific conclusions. And in asserting that science is about the accumulation of axioms with the alternative being nihilism. he demonstrates that he understands neither science nor mathematics nor the philosophy of science. Or, for that matter, nihilism.</p><p>Speaking of etymology, it seems we’re going to need to coin a new term for this sort of high midwittery.</p><p>UPDATE: I don’t think the Zman properly grasped <a href=\"http://www.unz.com/jderbyshire/derb-at-the-mencken-club-am-i-alt-right/\">what John Derbyshire was saying</a> at all. But I will post my response to Derb’s comments in a separate post.</p><p>UPDATE: Yeah, he’s just not very bright. He didn’t even hesitate to double down in response to this post.</p><blockquote><p>Much more is known now about the natural world, than was known fifty years ago, and much more was known then than in 1580. So there has been a great accumulation or growth of knowledge in the last four hundred years.</p><p>This is an extremely well-known fact. Let’s call this (A). A person, who did not know (A), would be uncommonly ignorant. To assert that all scientific conclusions are open to revision, as Vox Day has done, is to deny the existence of (A). I see he is now pushing around the goal post on wheels to try and obscure the fact he made a ridiculous statement, but that changes nothing.</p></blockquote></div>",
  "content_text": "Now, I generally enjoy reading both John Derbyshire and Zman, and I think they’re both intelligent iconoclasts, but every now and then I am surprised to discover how conceptually limited various would-be critics can be when they attempt to criticize me. They preen, they posture, and they pontificate even as they demonstrate that they neither understand me nor know whereof they speak. That may sound a little arrogant, but bear with me a moment and you’ll see what I mean.\nThe Zman mentioned this in\nhis interesting summar\ny of attending the Mencken Club:\nJohn was first up and he used Vox Day’s 16-points blog post as the framework for his talk. He made the point that Vox is by no means the leader of the alt-right or the voice of it, but a representative sample that is useful for analyzing the movement. His comments about item number eight were laugh out loud funny, to the empirically minded. What John was doing was introducing the general ideas of the alt-right to a crowd that is not spending their evenings in the meme war. He did a good job presenting the broad strokes.\nThis is all very well, but it led to the following string of comments which revealed some unexpected conceptual limitations on the part of the Zman. His failure to grasp either the obvious linguistics involved or to understand the basic nature of science is, to put it mildly, surprising. I find myself wondering if these failures are a logical consequence of his atheistic philosophical incoherence running headlong into its own conclusions, a kneejerk reaction to displeasure with something I have said, or simply an indication of his cognitive limitations.\nToddy+Cat\nPersonally, I’d be very interested to hear what John Derbyshire had to say about Vox’s point number eight. Derbyshire is great intellect, a fantastic writer, and has enough moral courage for several men, but he (like all of us) is a product of his Time, and sometimes has way too much respect for “science” and the “scientific community”. He sometimes does not seem to realize just how politicized “science” has become in our day. As much as both he and I might regret it, this ain’t 1955.\nthezman\nHe comically analyzed the possible entomology of the words, “scientodific” and “scientody”. He also pointed out the absurdity of the claim that scientific conclusions are liable to future revision. For instance, Mars is closer to the sun than Jupiter, a conclusion of science that will never be liable to revision. John correctly pointed out that number eight is gibberish.\nI’ve written a little about this topic. I’ll be revisiting it frequently. I think there may even be a book in it, if I can manage to squeeze more than 24 hours from each day. Suffice it to say that I don’t think science and technology can be jammed into the moral philosophy of the 17th and 18th century. Therefore, we wither kill all the scientists or create a new moral philosophy.\nHeywood\nMars is closer to the sun than Jupiter… Anyway, that’s a stupid argument. While facts may be immutable – for a time, which may be long, like in the case above – our interpretations in the form of theories are always placeholders. Good till something better comes along, which, btw, must have the same predicative power as the old theory had where it was applicable, while extending the range of predictability. See classic Newtonian mechanics vs. theory of relativity. And as it happens, neither addresses Vox’s point of all so many modern “scientists” who employ the trappings and outer forms of science while gleefully ignoring everything that makes it actually useful. Nothing of this strikes me as overly difficult to either comprehend or establish, given the state of sciences today.\nthezman\nI’ve heard every iteration of factual nihilism and I have no interest in taking it seriously. It’s just another way of putting the goal posts on roller skates.\nMan of the West\nZman said: “He also pointed out the absurdity of the claim that scientific conclusions are liable to future revision” I am assuming and hoping that what John meant is that SOME scientific conclusions are not open to revision, as his example — though questionable as science — shows. Because if not, and if the above statement is what he actually meant, then it is foolishness of a high order given the provisional nature of science and the fact that we know that there are unknown errors in scientific conclusions (as the replication crisis is presently showing us) that may be discovered at a later time.\nOf course, John may have a unique definition of ‘science’ or of the word ‘conclusions’ which gives him some wiggle room, but then he is just playing semantic games.\nthezman\nThink of it this way. There is a set of things that have to be true or nothing is true. There is a set of things that are most likely true, but have yet to be conclusively proven. There are a set of things that may be true, but there’s either no way to test them or the efforts to prove them have fallen short. Finally, there is the set of things that are unknown.\nScientific conclusions are the first set. The second and third sets are open to revision and challenge. It’s not a matter of semantics. It is about definitions. People tend not to grasp the definitions of science, because the have had little exposure to math or science.\nByzantine_General\nYour first category encompasses logic and mathematics. Your second includes theories of gravitation, where Einstein’s superceded Newton’s. But your words seem to place today’s scientific “conclusions” in the first category, rather than the second. Can you explain without casting nasturtiums?\n“Factual nihilism”. Hmph.\nthezman\nI wrote, “Scientific conclusions are the first set.” That seems to cover it. Science, like mathematics, is about the accumulation of axioms, things that are assumed to be true by their nature. Put another way, if everything is open to revision, there is no truth.\nByzantine_General\nI am gobsmacked, and I say this lovingly, by your wrong-headedness.\nScience deals in theories, not conclusions. Theories are always contingent; we strenuously fail to falsify them, accumulate partial belief in them, build on and with them, but can never reach axiomatic mathematical certainty.\nNot long ago, the best available theory was that neutrinos had zero mass. It could have been loosely said that science had concluded that this was the case. But the progress of science demands that it does not make conclusions.\nA pesky observation (that the wrong kind of neutrinos were arriving on Earth from the Sun) forced that theory to be abandoned. A better theory accounted for the observation (and all previous observations), and entailed a non-zero mass. This is a perfect example of scientific progress.\nAxioms are not subject to abandonment. Had the zero mass of the neutrino been treated as an axiom, we would have been forced to reject the observation and the better theory, because the contradiction of an axiom is automatically false.\nKarl Popper’s criterion for deciding whether a theory is scientific is whether it could by some conceivable observation be falsified. Theories that can withstand any contrary evidence are called “religions”.\nthezman\nKarl Popper was wrong. If everything can be falsified, then there is no truth. That’s nihilism.\nThis is one of those moments when you suddenly realize that someone simply isn’t as intelligent as you had previously thought they were. One does not need to be a Popperian to recognize the obvious fact that many, if not\nmost\n, scientific conclusions are intrinsically provisional, if not based entirely on false foundations. The Zman is making a common error in confusing the scientific method with a means of determining absolute truth; scientody is actually nothing more than a tool for determining what is\nnot\ntrue from a material perspective and therefore can only ever be a means of narrowing the possible scope of the truth of things that remain firmly within the temporally accessible aspects of the material realm.\nHistory, for example, is a matter of firmly established fact, and yet remains largely outside the realm of science and its conclusions.\nIn claiming that a correct understanding of science is nihilism, he confuses the subset of observable facts with the much larger set of scientific conclusions. And in asserting that science is about the accumulation of axioms with the alternative being nihilism. he demonstrates that he understands neither science nor mathematics nor the philosophy of science. Or, for that matter, nihilism.\nSpeaking of etymology, it seems we’re going to need to coin a new term for this sort of high midwittery.\nUPDATE: I don’t think the Zman properly grasped\nwhat John Derbyshire was saying\nat all. But I will post my response to Derb’s comments in a separate post.\nUPDATE: Yeah, he’s just not very bright. He didn’t even hesitate to double down in response to this post.\nMuch more is known now about the natural world, than was known fifty years ago, and much more was known then than in 1580. So there has been a great accumulation or growth of knowledge in the last four hundred years.\nThis is an extremely well-known fact. Let’s call this (A). A person, who did not know (A), would be uncommonly ignorant. To assert that all scientific conclusions are open to revision, as Vox Day has done, is to deny the existence of (A). I see he is now pushing around the goal post on wheels to try and obscure the fact he made a ridiculous statement, but that changes nothing.",
  "tags": [
    "#AltRight",
    "philosophy",
    "science"
  ],
  "categories": [],
  "sitemap_lastmod": "2017-11-09T09:34:00+00:00"
}