{
  "url": "https://voxday.net/2017/11/10/mailvox-posturing-and-plagiarism/",
  "scraped_at": "2025-12-19T10:31:03.743196",
  "title": "Mailvox: posturing and plagiarism",
  "date_display": "November 10, 2017",
  "date_iso": "2017-11-10T16:00:00+00:00",
  "date_from_url": "2017-11-10",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>Tublecane <a href=\"http://voxday.blogspot.com/2017/11/a-failure-to-grasp-obvious.html#c4690505103778602278\">accuses the Zman of plagiarizing</a> David Stove</p><blockquote><p>If those paragraphs you quoted <a href=\"http://voxday.blogspot.com/2017/11/a-failure-to-grasp-obvious.html\">in your update</a> are supposed to be Z-man’s words, uttered without reference to their source, oh boy. I thought they sounded familiar, so I checked my copy of David Stove’s <i>Scientific Irrationalism</i> and Z-man copies verbiage found on page one. Right down to the year 1580, the letter “A,” and the phrase “uncommonly ignorant.”</p><p>Stove, being much brighter than the Z-men of the world, wasn’t making an “everything scientists say is factual, so shut up” argument. He doesn’t even share Z-man’s opinion on Popperian falsifiabilty, though he lays into Popper and finds him guilty of launching a line of irrationalism (or a “postmodern cult,” as the subtitle has it) in the philosophy and historiography of science. A line which isn’t so bad with Popper but gets worse and worse as you go through Kuhn, Lakatos, and Feyerabend.</p><p>The point about accumulation of knowledge, which is robust in Stove’s book, is neither here nor there regarding the subject at hand. Z-man thinks he’s dealing with nihilists, and nihilists would have trouble with facts accumulating. But of course that has nothing to do with how you characterize varieties of “science” in the 16 Points. Science since 1580 could have simultaneously been more wrong than right and still served to advance human knowledge.</p><p>Upon closer inspection, Z-man explicitly mentions David Stove’s Popper and After, but in a separate post from the one in which he steals from it.</p><p>I call plagiarism!</p><p>Moreover, plagiarism that would be insulting to Stove, RIP, since he wouldn’t be caught making an argument as silly as Z-man’s.</p></blockquote><p>I haven’t read any of David Stove’s books, so I can’t testify to the accuracy of the accusation of plagiarism. But it’s not particularly surprising to be informed that the argument the Zman’s was making is not his own, as 8 hours before Tublecane posted his comment, I had made this observation: <i>“One definitely has the impression that the Zman has not read Popper, or even Kuhn, himself, but rather, has read what people have written about Popper.”</i><br><i><br/></i>In any event, this demonstrates why it is important not to feign knowledge you do not possess, not to pass off the arguments of others as your own, and not to express opinions on subjects you do not know very much about. Especially on the Internet, someone is bound to eventually notice that you are an intellectual fraud.</br></p></div>",
  "content_text": "Tublecane\naccuses the Zman of plagiarizing\nDavid Stove\nIf those paragraphs you quoted\nin your update\nare supposed to be Z-man’s words, uttered without reference to their source, oh boy. I thought they sounded familiar, so I checked my copy of David Stove’s\nScientific Irrationalism\nand Z-man copies verbiage found on page one. Right down to the year 1580, the letter “A,” and the phrase “uncommonly ignorant.”\nStove, being much brighter than the Z-men of the world, wasn’t making an “everything scientists say is factual, so shut up” argument. He doesn’t even share Z-man’s opinion on Popperian falsifiabilty, though he lays into Popper and finds him guilty of launching a line of irrationalism (or a “postmodern cult,” as the subtitle has it) in the philosophy and historiography of science. A line which isn’t so bad with Popper but gets worse and worse as you go through Kuhn, Lakatos, and Feyerabend.\nThe point about accumulation of knowledge, which is robust in Stove’s book, is neither here nor there regarding the subject at hand. Z-man thinks he’s dealing with nihilists, and nihilists would have trouble with facts accumulating. But of course that has nothing to do with how you characterize varieties of “science” in the 16 Points. Science since 1580 could have simultaneously been more wrong than right and still served to advance human knowledge.\nUpon closer inspection, Z-man explicitly mentions David Stove’s Popper and After, but in a separate post from the one in which he steals from it.\nI call plagiarism!\nMoreover, plagiarism that would be insulting to Stove, RIP, since he wouldn’t be caught making an argument as silly as Z-man’s.\nI haven’t read any of David Stove’s books, so I can’t testify to the accuracy of the accusation of plagiarism. But it’s not particularly surprising to be informed that the argument the Zman’s was making is not his own, as 8 hours before Tublecane posted his comment, I had made this observation:\n“One definitely has the impression that the Zman has not read Popper, or even Kuhn, himself, but rather, has read what people have written about Popper.”\nIn any event, this demonstrates why it is important not to feign knowledge you do not possess, not to pass off the arguments of others as your own, and not to express opinions on subjects you do not know very much about. Especially on the Internet, someone is bound to eventually notice that you are an intellectual fraud.",
  "tags": [
    "mailvox",
    "science",
    "trainwreck"
  ],
  "categories": [],
  "sitemap_lastmod": "2017-11-10T16:00:00+00:00"
}