{
  "url": "https://voxday.net/2017/11/26/mailvox-atheists-always-bait-and-switch/",
  "scraped_at": "2025-12-19T10:32:48.797343",
  "title": "Mailvox: atheists always bait-and-switch",
  "date_display": "November 26, 2017",
  "date_iso": "2017-11-26T09:38:00+00:00",
  "date_from_url": "2017-11-26",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>Mr. Rational demonstrates why no one trusts atheists, including their fellow atheists:</p><blockquote><p>You’re playing semantic games here by deliberately selecting a nonsensical phrase, Vox.  “The Significance of Human Existence” makes perfect sense, and yes, random events in human history are perfectly understandable in that context.</p><p>This is another example of your need to have a First Cause for everything.  It’s just a more advanced version of the animism of savages.  You can’t not see intent and agency in everything because it makes you insecure, and like the left’s search for racism in society what you need to find will be found… somehow.</p><p>E.O. Wilson is one of the greatest minds of our age, and you reduce yourself to paraphrasing his book title in a silly fashion.  Talk about ankle-biting.</p></blockquote><p>This is simply embarrassing for Mr. Rational. It would appear that the sight of “one of the greatest minds of our age” being caught out has triggered him. Badly. That “silly fashion” of which he complains is <i>the most generous interpretation</i> of Wilson’s title possible; the alternative is that Wilson is every bit as dishonest as the Richard Dawkins and Sam Harrises of the world.</p><p>I am not playing a semantic game. I am observing that there is ABSOLUTELY NO DEFINITION of the term “meaning” that allows E.O. Wilson to be considered simultaneously a) philosophically competent and  b) intellectually honest. As another commenter has already noted, Wilson’s book was not titled <i>The <b>Significance </b>of Human Existence</i>, but rather, <i>The <b>Meaning </b>of Human Existence</i>. A second bait-and-switch is not going to justify the first.</p><p>Also notice how the triggered little gamma male immediately leaps to making the philosophy personal. He cannot accept that “one of the greatest minds of our age” is either incorrect or lying, and that fact that I am the one who caught him out only makes his acceptance of that <i>easily observably fact</i> all the more difficult. Unlike both Wilson and Mr. Rational, I am perfectly willing to contemplate the possibility that there is neither intent nor agency in human existence, it is only that unlike them, I am sufficiently competent to understand and accept the logical consequences of that lack of meaning.</p><p>You’re too short for this ride, Mr. Rational. I will not again be rescuing your very stupid, very dishonest comments from the spam where they clearly belong, and will henceforth spam them. Since there is neither meaning nor significance in that decision, he really has no grounds for complaint. And even if he did, well, what could that possibly matter?</p><p>Groggy thinks I made a mistake.</p><blockquote><p>Vox, carefully parsing the dictionary definitions above which you provided, “what actually is” is not a valid definition to extract.</p><p><i>what is intended to be, or actually is, expressed or indicated; signification; import</i></p><p>It does NOT say that meaning can be “what actually is”.</p><p>It says that meaning can be:</p><ol><li><i>what is intended to be expressed or indicated</i></li><li><i>what actually is expressed or indicated</i></li></ol></blockquote><div>I actually share Groggy’s interpretation, but as I mentioned above, I felt that it was best to be generous and give Mr. Wilson’s defenders the maximum amount of rope with which to hang the man. Rather than being able to quibble over the parsing of the definition, his defenders are forced to either admit to his error, admit to his dishonesty, or commit their own intellectual sins.</div></div>",
  "content_text": "Mr. Rational demonstrates why no one trusts atheists, including their fellow atheists:\nYou’re playing semantic games here by deliberately selecting a nonsensical phrase, Vox.  “The Significance of Human Existence” makes perfect sense, and yes, random events in human history are perfectly understandable in that context.\nThis is another example of your need to have a First Cause for everything.  It’s just a more advanced version of the animism of savages.  You can’t not see intent and agency in everything because it makes you insecure, and like the left’s search for racism in society what you need to find will be found… somehow.\nE.O. Wilson is one of the greatest minds of our age, and you reduce yourself to paraphrasing his book title in a silly fashion.  Talk about ankle-biting.\nThis is simply embarrassing for Mr. Rational. It would appear that the sight of “one of the greatest minds of our age” being caught out has triggered him. Badly. That “silly fashion” of which he complains is\nthe most generous interpretation\nof Wilson’s title possible; the alternative is that Wilson is every bit as dishonest as the Richard Dawkins and Sam Harrises of the world.\nI am not playing a semantic game. I am observing that there is ABSOLUTELY NO DEFINITION of the term “meaning” that allows E.O. Wilson to be considered simultaneously a) philosophically competent and  b) intellectually honest. As another commenter has already noted, Wilson’s book was not titled\nThe\nSignificance\nof Human Existence\n, but rather,\nThe\nMeaning\nof Human Existence\n. A second bait-and-switch is not going to justify the first.\nAlso notice how the triggered little gamma male immediately leaps to making the philosophy personal. He cannot accept that “one of the greatest minds of our age” is either incorrect or lying, and that fact that I am the one who caught him out only makes his acceptance of that\neasily observably fact\nall the more difficult. Unlike both Wilson and Mr. Rational, I am perfectly willing to contemplate the possibility that there is neither intent nor agency in human existence, it is only that unlike them, I am sufficiently competent to understand and accept the logical consequences of that lack of meaning.\nYou’re too short for this ride, Mr. Rational. I will not again be rescuing your very stupid, very dishonest comments from the spam where they clearly belong, and will henceforth spam them. Since there is neither meaning nor significance in that decision, he really has no grounds for complaint. And even if he did, well, what could that possibly matter?\nGroggy thinks I made a mistake.\nVox, carefully parsing the dictionary definitions above which you provided, “what actually is” is not a valid definition to extract.\nwhat is intended to be, or actually is, expressed or indicated; signification; import\nIt does NOT say that meaning can be “what actually is”.\nIt says that meaning can be:\nwhat is intended to be expressed or indicated\nwhat actually is expressed or indicated\nI actually share Groggy’s interpretation, but as I mentioned above, I felt that it was best to be generous and give Mr. Wilson’s defenders the maximum amount of rope with which to hang the man. Rather than being able to quibble over the parsing of the definition, his defenders are forced to either admit to his error, admit to his dishonesty, or commit their own intellectual sins.",
  "tags": [
    "atheism",
    "mailvox"
  ],
  "categories": [],
  "sitemap_lastmod": "2017-11-26T09:38:00+00:00"
}