{
  "url": "https://voxday.net/2017/11/23/mailvox-midwit-history/",
  "scraped_at": "2025-12-19T10:32:32.466493",
  "title": "Mailvox: midwit history",
  "date_display": "November 23, 2017",
  "date_iso": "2017-11-23T11:16:00+00:00",
  "date_from_url": "2017-11-23",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>It’s no secret that I am not a fan of midwits. These responses to <a href=\"http://voxday.blogspot.com/2017/11/fake-americans-fake-solutions.html\">my previous post</a> on Fake Americans and their Fake History may help explain why. They are the walking, talking examples of Dunning-Kruger in action. When I talk about them being relative retards, this is exactly the sort of thing I’m describing. Be sure to note how JM actually thinks he is <i>correcting </i>me.</p><blockquote class=\"tr_bq\"><p>According to your theory Britain, Canada (until two decades ago or so), Australia and New Zealand should be the best examples of freedom loving people in a land where the rule of law exists, where the government is not massive and social and economic freedoms are respected, in other words, Switzerland or close to it since their populations are by far MUCH MORE ANGLO than whatever you find in the U.S., less “tainted” by Germans, Italians, French and so on. I think we can all safely agree and that ALL the countries mentioned and less free and their populations endure more oppressive governments (female idiocy to the max, PC quasi-dictatorship, socialist policies, end to the right to bear arms, etc etc.). The worst part is that peoples of those countries CLAIMED FOR, ELECTED, AND ENACTED their governments actions with glee, only a tiny minority resisted or tried to do so. </p></blockquote><p>That’s ridiculous. The “British brethren” of the British Empire were obviously <i>a different subset</i> of Anglo stock than the American <i>settlers</i>. Anglo-Saxon Protestant heritage is a <i>necessary </i>requirement of reliable community support for individual liberty and limited government, but it is not a <i>sufficient </i>one. Many Canadians are descended from British settlers who were loyal to the crown and were driven out. Australia is descended from criminal deportees; if you ever wondered why Sydney is a center of gay depravity, look up the crimes for which many of those criminals were deported.</p><p>As for the British themselves, they went through several hundred years of exporting and killing off their best and boldest. It should be no surprise that those who remain today are little more than island-dwelling dodo birds, blithely welcoming the newcomers who have already replaced them in their capital.</p><p>Anyone who thinks Switzerland is a bastion of individual liberty has never spent more than five minutes there. A friend of mine who worked in Zurich for five years collected various fines I would not have believed possible, including one for excess noise after 10 PM and another for turning on his fog lights when the amount of rain did not necessitate doing so. To put it his way, “imagine a homeowner’s association run by uptight German women.”</p><blockquote class=\"tr_bq\"><p>Whether you like it or not, your theory is full of holes and cannot explain why the peoples whose entrance you decry were allowed to enter en masse by the “virtuous protestant men of British stock” that inhabited the US back then, while the countries that should be shining examples of freedom due to their Protestant ethic (hahaha) and Anglo-saxon “pure” heritage sink ever so low. You don’t seem to realize that Irish and Italians were brought as low cost labor not out of a “duty bring white men of good character”. You don’t seem to realize that if anything, the mixture of European peoples in the U.S. might have slowed down the destruction of the liberties that many Americans take for granted etc.</p></blockquote><p>This guy’s binary reasoning is so inept that he would similarly argue that my theory of NFL defense is full of holes and cannot explain how the Vikings were able to score on the Rams; obviously if the Vikings reached the end zone, then the Rams must have <i>intended </i>for them to do so.  And the idea that the addition of various peoples with no tradition of liberty or limited government somehow managed to slow down the destruction of now-vanished American liberties that their most illustrious members openly worked to destroy is simply too stupid to be mendacious.</p><p>Every generation has a faction arguing that relaxing the rules can’t possibly do any harm. The Founders were no exception; the fact that they were naive about immigration and failed to adequately protect their posterity from themselves does not change the fact that their original vision for the United States in no way approximated anything even remotely close to what we see today. The irony is that in JM’s arguing for American civic nationalism and the irrelevance of national origin, he is actually making a strong case for utterly ruthless ethnic cleansing, as evidently permitting even one otherwise unobjectionable exception is sufficient cause to give future civic nationalists grounds to destroy the nation.</p><p>Sertorius is similarly confused, but less obnoxious:</p><blockquote class=\"tr_bq\"><p>The Framers absolutely intended a British ethnostate, yet welcomed all white men of good character. Which was it? And since “intention” implies instrumentality, where exactly are the plans–even if they’re just jottings on a cocktail napkin–that will bring forth such a polity?</p></blockquote><p>Both. First, they had a very different definition of “white” than we do today. Second, they only intended to allow enough whites of good character to permit them to fully assimilate through interbreeding. (Notice that they didn’t establish a reliable mechanism for policing “good character” either, therefore they must have intended to import criminals and Satanists, right?) Third, they had set up a structure in which the several States were supposed to be entirely sovereign. They felt that this arrangement would suffice to address any fundamental differences; what would it matter to Massachusetts or Virginia if Pennsylvania was adulterated by Germans? Of course, the Civil War proved them wrong only four-score-and-change years later.</p><p>The Founding Fathers didn’t intend a single British ethnostate, but rather, a number of distinct British ethnostates as well as a few mixed white ethnostates. If you recall, they were rather favorably influenced by the historical Greek city-states. This is exactly why citizens of the USA should be praying for a reasonably peaceful breakup and non-violent ethnic cleansing instead of desperately trying to preserve the unsalvageable.</p><p>The real problem the civic nationalists have with history is that it clearly spells out the horrors that are likely on the way for the West. They avert their eyes and offer silly, nonsensical arguments about the intentions of the Founders in order to dispel the fear that is quietly gnawing at their bellies. But it won’t work, and in any event, nothing they say, and nothing I write, is going to make <i>any difference whatsoever</i>. I have no doubt that back in 372 AD, there was a Roman living in the town of Marcianopolis who was looking on in disbelief as 200,000 desperate Visigoths were permitted to cross the Danube to protect them from the Huns. Because refugees.</p><p>What could he have done about that? What possible difference could his arguments and his opinion have made? I like to think that Roman was smart enough to leave Marcianopolis and go very far away before Fritigern rose up to pillage the Roman north and slaughter the Emperor Valens at Adrianople six years later.</p></div>",
  "content_text": "It’s no secret that I am not a fan of midwits. These responses to\nmy previous post\non Fake Americans and their Fake History may help explain why. They are the walking, talking examples of Dunning-Kruger in action. When I talk about them being relative retards, this is exactly the sort of thing I’m describing. Be sure to note how JM actually thinks he is\ncorrecting\nme.\nAccording to your theory Britain, Canada (until two decades ago or so), Australia and New Zealand should be the best examples of freedom loving people in a land where the rule of law exists, where the government is not massive and social and economic freedoms are respected, in other words, Switzerland or close to it since their populations are by far MUCH MORE ANGLO than whatever you find in the U.S., less “tainted” by Germans, Italians, French and so on. I think we can all safely agree and that ALL the countries mentioned and less free and their populations endure more oppressive governments (female idiocy to the max, PC quasi-dictatorship, socialist policies, end to the right to bear arms, etc etc.). The worst part is that peoples of those countries CLAIMED FOR, ELECTED, AND ENACTED their governments actions with glee, only a tiny minority resisted or tried to do so.\nThat’s ridiculous. The “British brethren” of the British Empire were obviously\na different subset\nof Anglo stock than the American\nsettlers\n. Anglo-Saxon Protestant heritage is a\nnecessary\nrequirement of reliable community support for individual liberty and limited government, but it is not a\nsufficient\none. Many Canadians are descended from British settlers who were loyal to the crown and were driven out. Australia is descended from criminal deportees; if you ever wondered why Sydney is a center of gay depravity, look up the crimes for which many of those criminals were deported.\nAs for the British themselves, they went through several hundred years of exporting and killing off their best and boldest. It should be no surprise that those who remain today are little more than island-dwelling dodo birds, blithely welcoming the newcomers who have already replaced them in their capital.\nAnyone who thinks Switzerland is a bastion of individual liberty has never spent more than five minutes there. A friend of mine who worked in Zurich for five years collected various fines I would not have believed possible, including one for excess noise after 10 PM and another for turning on his fog lights when the amount of rain did not necessitate doing so. To put it his way, “imagine a homeowner’s association run by uptight German women.”\nWhether you like it or not, your theory is full of holes and cannot explain why the peoples whose entrance you decry were allowed to enter en masse by the “virtuous protestant men of British stock” that inhabited the US back then, while the countries that should be shining examples of freedom due to their Protestant ethic (hahaha) and Anglo-saxon “pure” heritage sink ever so low. You don’t seem to realize that Irish and Italians were brought as low cost labor not out of a “duty bring white men of good character”. You don’t seem to realize that if anything, the mixture of European peoples in the U.S. might have slowed down the destruction of the liberties that many Americans take for granted etc.\nThis guy’s binary reasoning is so inept that he would similarly argue that my theory of NFL defense is full of holes and cannot explain how the Vikings were able to score on the Rams; obviously if the Vikings reached the end zone, then the Rams must have\nintended\nfor them to do so.  And the idea that the addition of various peoples with no tradition of liberty or limited government somehow managed to slow down the destruction of now-vanished American liberties that their most illustrious members openly worked to destroy is simply too stupid to be mendacious.\nEvery generation has a faction arguing that relaxing the rules can’t possibly do any harm. The Founders were no exception; the fact that they were naive about immigration and failed to adequately protect their posterity from themselves does not change the fact that their original vision for the United States in no way approximated anything even remotely close to what we see today. The irony is that in JM’s arguing for American civic nationalism and the irrelevance of national origin, he is actually making a strong case for utterly ruthless ethnic cleansing, as evidently permitting even one otherwise unobjectionable exception is sufficient cause to give future civic nationalists grounds to destroy the nation.\nSertorius is similarly confused, but less obnoxious:\nThe Framers absolutely intended a British ethnostate, yet welcomed all white men of good character. Which was it? And since “intention” implies instrumentality, where exactly are the plans–even if they’re just jottings on a cocktail napkin–that will bring forth such a polity?\nBoth. First, they had a very different definition of “white” than we do today. Second, they only intended to allow enough whites of good character to permit them to fully assimilate through interbreeding. (Notice that they didn’t establish a reliable mechanism for policing “good character” either, therefore they must have intended to import criminals and Satanists, right?) Third, they had set up a structure in which the several States were supposed to be entirely sovereign. They felt that this arrangement would suffice to address any fundamental differences; what would it matter to Massachusetts or Virginia if Pennsylvania was adulterated by Germans? Of course, the Civil War proved them wrong only four-score-and-change years later.\nThe Founding Fathers didn’t intend a single British ethnostate, but rather, a number of distinct British ethnostates as well as a few mixed white ethnostates. If you recall, they were rather favorably influenced by the historical Greek city-states. This is exactly why citizens of the USA should be praying for a reasonably peaceful breakup and non-violent ethnic cleansing instead of desperately trying to preserve the unsalvageable.\nThe real problem the civic nationalists have with history is that it clearly spells out the horrors that are likely on the way for the West. They avert their eyes and offer silly, nonsensical arguments about the intentions of the Founders in order to dispel the fear that is quietly gnawing at their bellies. But it won’t work, and in any event, nothing they say, and nothing I write, is going to make\nany difference whatsoever\n. I have no doubt that back in 372 AD, there was a Roman living in the town of Marcianopolis who was looking on in disbelief as 200,000 desperate Visigoths were permitted to cross the Danube to protect them from the Huns. Because refugees.\nWhat could he have done about that? What possible difference could his arguments and his opinion have made? I like to think that Roman was smart enough to leave Marcianopolis and go very far away before Fritigern rose up to pillage the Roman north and slaughter the Emperor Valens at Adrianople six years later.",
  "tags": [
    "history",
    "immigration",
    "mailvox",
    "nationalism"
  ],
  "categories": [],
  "sitemap_lastmod": "2017-11-23T11:16:00+00:00"
}