{
  "url": "https://voxday.net/2017/11/30/mailvox-an-enemy-in-disarray/",
  "scraped_at": "2025-12-19T10:33:17.325368",
  "title": "Mailvox: an enemy in disarray",
  "date_display": "November 30, 2017",
  "date_iso": "2017-11-30T09:51:00+00:00",
  "date_from_url": "2017-11-30",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>Sidehill Dodger fails to see the benefit in routing the enemy:</p><blockquote><p><i>And it does look like a purge – so many, so fast, such big names, so many corporations. The only thing I know that’s close is something literally out of Stalinist Russia, or Mao’s China.</i></p><p>That’s exactly the feeling I get whenever I see the daily list of those to be purged. Yes, I know it’s mostly the liberals who are getting hit, but somehow I just can’t feel the Schadenfreude.</p><p>I am puzzled by Vox’s attitude, the gleeful way he welcomes the burnings. He says we “have to believe the women”. What, really? He’s a smart guy, so I have to recognize that maybe I’m missing something. But I have no clue as to what it might be. It seems to me that though individual lefties are being taken out, the Left as a whole grows stronger as the tumbrels roll toward the guillotine. What is the message men hear from the Media? That it’s evil to be male. So look for an upward tick in soy prices, and transgender surgeries. How is this good?</p></blockquote><p>Whose side does the Dodger think these people are on anyway? When the enemy line breaks, <i>that’s when you send in the cavalry!</i> The Left is most certainly NOT growing stronger as the rottenness at the core of the institutions it controls is exposed; what we have seen so far is merely a few pieces of infected bark being removed.</p><p>Men are given the message that it is evil to be white and male and Christian every day by the media. So how can it possibly not be good when that media is exposed as liars and hypocrites, and their message is shown to be as false as false can be?</p><p>One should always celebrate when the truth wins out. And there is nothing even remotely uncomfortable about these truths for us, ugly as they are. Sidehill Dodger demonstrates the lugubrious uselessness of the conservative, who sees nothing but future defeat in every victory. And if nothing else, a media that is in disarray is one that is not attacking Western civilization, which is why we should assist the God-Emperor and whoever else is exposing these creeps and sex criminals embedded in Hollywood, politics, and the media with enthusiasm and energy.</p><p>What part of “we are in a cultural war” does the Dodger not understand? The time for shedding tears for the enemy fallen is <i>after </i>the victory is complete, not when the issue is still in doubt.</p></div>",
  "content_text": "Sidehill Dodger fails to see the benefit in routing the enemy:\nAnd it does look like a purge – so many, so fast, such big names, so many corporations. The only thing I know that’s close is something literally out of Stalinist Russia, or Mao’s China.\nThat’s exactly the feeling I get whenever I see the daily list of those to be purged. Yes, I know it’s mostly the liberals who are getting hit, but somehow I just can’t feel the Schadenfreude.\nI am puzzled by Vox’s attitude, the gleeful way he welcomes the burnings. He says we “have to believe the women”. What, really? He’s a smart guy, so I have to recognize that maybe I’m missing something. But I have no clue as to what it might be. It seems to me that though individual lefties are being taken out, the Left as a whole grows stronger as the tumbrels roll toward the guillotine. What is the message men hear from the Media? That it’s evil to be male. So look for an upward tick in soy prices, and transgender surgeries. How is this good?\nWhose side does the Dodger think these people are on anyway? When the enemy line breaks,\nthat’s when you send in the cavalry!\nThe Left is most certainly NOT growing stronger as the rottenness at the core of the institutions it controls is exposed; what we have seen so far is merely a few pieces of infected bark being removed.\nMen are given the message that it is evil to be white and male and Christian every day by the media. So how can it possibly not be good when that media is exposed as liars and hypocrites, and their message is shown to be as false as false can be?\nOne should always celebrate when the truth wins out. And there is nothing even remotely uncomfortable about these truths for us, ugly as they are. Sidehill Dodger demonstrates the lugubrious uselessness of the conservative, who sees nothing but future defeat in every victory. And if nothing else, a media that is in disarray is one that is not attacking Western civilization, which is why we should assist the God-Emperor and whoever else is exposing these creeps and sex criminals embedded in Hollywood, politics, and the media with enthusiasm and energy.\nWhat part of “we are in a cultural war” does the Dodger not understand? The time for shedding tears for the enemy fallen is\nafter\nthe victory is complete, not when the issue is still in doubt.",
  "tags": [
    "freakshow",
    "media",
    "war"
  ],
  "categories": [],
  "sitemap_lastmod": "2017-11-30T09:51:00+00:00"
}