{
  "url": "https://voxday.net/2017/11/03/mailvox-it-is-none-of-your-business/",
  "scraped_at": "2025-12-19T10:30:10.989125",
  "title": "Mailvox: It is none of your business",
  "date_display": "November 3, 2017",
  "date_iso": "2017-11-03T12:00:00+00:00",
  "date_from_url": "2017-11-03",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>Non-Hollywood Reporter finally manages to be on-topic.</p><blockquote><p>Vox, your greatest mate who you said you’d stand by forever said he attended several Hollywood parties where he witnessed “very young” boys being raped. You knew this at the time.</p><p>Your best friend who you stand by also said he wouldn’t name the rapists because it would be “indiscreet”.</p><p>Have you asked your best friend Milo to name these pedophiles publicly, or at least make a statement to the police?</p><p>If not, why not?</p><p>Why do you keep deleting these questions and never answering them?</p><p>Do you think you can delete them forever?</p></blockquote><p>First, Non-Hollywood Reporter is lying and has been banned and spammed for spamming unrelated topics in a monomaniacal manner. Milo is my friend. Milo is not my best friend. Second, it is absolutely none of Non-Hollywood Reporter’s business what I have discussed with Milo or anyone else. Nor is it anyone else’s business. One of the reasons even people who don’t particularly like me tend to trust me is because I am demonstrably capable of keeping things in confidence. Third, I do not owe any answer to the Non-Hollywood Reporter or anyone else <i>for someone else’s decisions and behavior</i>, be they ally, friend, or foe.</p><p>I will never permit anyone to use me to put additional public pressure on a friend or ally. Go ahead and try to attack me on the basis of questions I will not answer if you like. You will do so in vain. My track record on this particular issue more than speaks for itself <i>and will continue to do so</i> in a very material way. So, for that matter, does Milo’s, as he has publicly identified <a href=\"https://www.facebook.com/myiannopoulos/posts/851263248344905\">three more pedophiles</a> than virtually every journalist and reporter who has condemned him for not doing more than he has.</p><blockquote><p>I have outed THREE pedophiles in my career as a journalist. That’s three more than any of my critics and a peculiar strategy for a supposed pedophile apologist.<br>(a) Luke Bozier, former business partner of Louise Mensch<br>(b) Nicholas Nyberg, anti-GamerGate activist who self-described as a pedophile and white nationalist<br>(c) Chris Leydon, a London photographer who has a rape trial starting March 13 thanks to my reporting.</br></br></br></p><p>I have never defended and would never defend child abusers, as my reporting history shows.</p></blockquote><p>I kept deleting the questions because they were a) off-topic, b) obviously rhetorical, and c) primarily intended to discredit and disqualify me and others. I certainly can delete them forever if I so choose; the moderators and I will simply prevent any comment by Non-Hollywood Reporter from even appearing momentarily on this blog. However, I chose to address them today to make several points.</p><ol><li>No commenter will ever succeed in pressuring me to do anything. Even the attempt to do so is sufficient grounds for banning and spamming. /pol/ is not your private army. Neither am I, my VFM, or the Dread Ilk.</li><li>I do not even betray the confidences of my enemies. I absolutely do not betray the confidences of my friends and allies.</li><li>Your ignorance of my actions is not evidence of the non-existence of my actions.</li><li>I am not perfect. I am as fallible as any man. But as those who know me and work with me can attest, I am consistent.</li><li>I do not answer to anyone but my Lord and Savior, and His Father.</li></ol></div>",
  "content_text": "Non-Hollywood Reporter finally manages to be on-topic.\nVox, your greatest mate who you said you’d stand by forever said he attended several Hollywood parties where he witnessed “very young” boys being raped. You knew this at the time.\nYour best friend who you stand by also said he wouldn’t name the rapists because it would be “indiscreet”.\nHave you asked your best friend Milo to name these pedophiles publicly, or at least make a statement to the police?\nIf not, why not?\nWhy do you keep deleting these questions and never answering them?\nDo you think you can delete them forever?\nFirst, Non-Hollywood Reporter is lying and has been banned and spammed for spamming unrelated topics in a monomaniacal manner. Milo is my friend. Milo is not my best friend. Second, it is absolutely none of Non-Hollywood Reporter’s business what I have discussed with Milo or anyone else. Nor is it anyone else’s business. One of the reasons even people who don’t particularly like me tend to trust me is because I am demonstrably capable of keeping things in confidence. Third, I do not owe any answer to the Non-Hollywood Reporter or anyone else\nfor someone else’s decisions and behavior\n, be they ally, friend, or foe.\nI will never permit anyone to use me to put additional public pressure on a friend or ally. Go ahead and try to attack me on the basis of questions I will not answer if you like. You will do so in vain. My track record on this particular issue more than speaks for itself\nand will continue to do so\nin a very material way. So, for that matter, does Milo’s, as he has publicly identified\nthree more pedophiles\nthan virtually every journalist and reporter who has condemned him for not doing more than he has.\nI have outed THREE pedophiles in my career as a journalist. That’s three more than any of my critics and a peculiar strategy for a supposed pedophile apologist.\n(a) Luke Bozier, former business partner of Louise Mensch\n(b) Nicholas Nyberg, anti-GamerGate activist who self-described as a pedophile and white nationalist\n(c) Chris Leydon, a London photographer who has a rape trial starting March 13 thanks to my reporting.\nI have never defended and would never defend child abusers, as my reporting history shows.\nI kept deleting the questions because they were a) off-topic, b) obviously rhetorical, and c) primarily intended to discredit and disqualify me and others. I certainly can delete them forever if I so choose; the moderators and I will simply prevent any comment by Non-Hollywood Reporter from even appearing momentarily on this blog. However, I chose to address them today to make several points.\nNo commenter will ever succeed in pressuring me to do anything. Even the attempt to do so is sufficient grounds for banning and spamming. /pol/ is not your private army. Neither am I, my VFM, or the Dread Ilk.\nI do not even betray the confidences of my enemies. I absolutely do not betray the confidences of my friends and allies.\nYour ignorance of my actions is not evidence of the non-existence of my actions.\nI am not perfect. I am as fallible as any man. But as those who know me and work with me can attest, I am consistent.\nI do not answer to anyone but my Lord and Savior, and His Father.",
  "tags": [
    "anklebiters",
    "mailvox"
  ],
  "categories": [],
  "sitemap_lastmod": "2017-11-03T12:00:00+00:00"
}