{
  "url": "https://voxday.net/2017/11/07/mailvox-convergence-kills-the-cons/",
  "scraped_at": "2025-12-19T10:30:36.807492",
  "title": "Mailvox: convergence kills the cons",
  "date_display": "November 7, 2017",
  "date_iso": "2017-11-07T13:00:00+00:00",
  "date_from_url": "2017-11-07",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p><i>A former conference speaker who is still very much in demand explains why he doesn’t even attend technology conferences anymore. Sounds like we don’t just need #AltTech, but #AltCon as well.</i></p><p>These technology conferences are usually run by community-minded people, not corporates, by people who devote themselves to the endeavor, enter into huge financial risk and often wind up losing money at the end of it. Yet <a href=\"https://medium.com/@peggyrayzis/why-i-cancelled-my-reactiveconf-talk-3a463bf14bd8\">this kind of over-the-top virtue display </a>is becoming increasingly common. Once upon a time I seriously considered launching a conference myself, but there’s no way I’d expose myself to this kind of drama, which is almost guaranteed now.</p><p>These tech community controversies fall into 3 broad categories:</p><p><b>1. Not enough speaker diversity.</b><br>You’re guaranteed this kind of outrage now if you don’t have 50{b05c51a15f0a42d8e7dd687f4cc4bfffd66a97ee173a2742c6182468204332c9} or more women speakers. I’m certain the bar will move once parity is achieved and you then need PoC, then trans, then … You even have popular speakers now making statements like “I won’t speak at a conference or be on a panel unless there are least 50{b05c51a15f0a42d8e7dd687f4cc4bfffd66a97ee173a2742c6182468204332c9} women and PoC” <a href=\"http://dailycaller.com/2017/09/25/tech-ceo-isaac-schlueter-calls-for-fewer-white-men-in-tech/\">such as this fellow</a>. ElectronConf is a hilarious example of this controversy. Electron is an important and rapidly growing technology. It’s what applications like Slack, Skype and Brave and many other desktop applications are built on. It’s an open source project run and owned by GitHub. They announced their first conference in 2016, got speaker proposals, and even did a blind speaker selection, but ended up with all male speakers, which is obviously not surprising to the rational observer. This kicked off a controversy. The conference was initially postponed, then went dark and completely disappeared. It’s supposedly back again for 2018 and calling for speakers, but there is no reason to assume the same thing won’t happen again.</br></p><p><b>2. I won’t speak if X is speaking!</b><br>Identify a problematic speaker on the list along with yourself and make a big show of how you are cancelling your talk because you won’t appear at a venue that promotes problematic Mr X. Often the timing is guaranteed to give the organizers an aneurysm. Nodevember in Nashville in 2016 was a great example of this. Doug Crockford, a well-respected old-guard from the JavaScript community,  literally wrote the book on JavaScript best practices that was a reference for many years–<i>JavaScript: The Good Parts</i>, was on the speaker list but had recently caused conference controversy for “slut shaming” because he was making a technical point and referred to the “old web” as “promiscuous” and the “new web” as “consensual”, the case being that he was equating promiscuity with something negative. Kassandra Perch, a typical screechy non-contributing SJW who creates controversy wherever she goes, pulled out and made a scene. She was backed up by the usual Twitter suspects in that community and caused a headache for the organizers. The organizers then had a falling out because one took it upon himself to disinvite Crockford immediately, while another organizer stepped down in protest of the first guy’s unilateral action and released a public statement about it. All hell broke lose. This is a conference organized by individuals, who invest their own time to make a fun community thing and have to go begging for sponsorships to make it happen. Somehow they survived and are still doing it each year.</br></p><p><b>3. A man looked at me! Reeeeee!</b><br>This used to be a common tactic as a tool used to justify and introduce Codes of Conduct as a standard practice at conferences in the first place, before they were pushed into our code repositories. There is rarely evidence of actual wrongdoing, just hearsay, and often even that hearsay is a head-scratcher. Now you can’t run one of these without a CoC, you just won’t get sponsors because they’ll be targeted if you don’t. See LambdaConf as the last non-CoC conf that has now introduced their own, a bit less SJWized version in an attempt to have one but not completely submit to the narrative. Now that all the conferences have CoCs, the screeching is about supposed violations that aren’t <i>correctly handled</i>. They are either pure virtue-signaling or an attempt to undermine the unconverged organization committee. It’s not surprising that this current controversy is around a conference in eastern Europe where they are less attuned to SJW culture and don’t properly understand how to feed that dragon. They probably stepped on a tripwire and alerted this individual that they hadn’t fully signed up to the narrative. The non-West suffers the most from this and comes because they see a need to invite Western big-names to attract ticket sales.</br></p><p>As that guy you interviewed in <a href=\"http://amzn.to/2xt9dWb\" style=\"font-style: italic; font-weight: bold;\">SJWs Always Double Down</a> said, tech community conferences were the initial gateway for SJW convergence of open source, and my assessment is that they’ll be the canary in the coal mine for the costs that convergence will eventually extract from open source. Tech conferences are becoming too risky to organize. The rules around what is acceptable, who you can have speak, ratios of acceptable groups to feature in your speaker lineup, and so forth, are just too hard to understand as the SJW standards mutate over time. The financial risks are huge and you have to rely on large sponsors to fund your events; ticket sales don’t do it. But your sponsors are flighty and will withdraw at the first hint of controversy. Quality speakers are becoming increasingly difficult to book and the ratio of knowns to unknowns will deteriorate too far to attract sufficient ticket sales. Particularly when you have to insert so many token speakers who don’t contribute to the attractiveness of the conference, and will sometimes even detract from it.</p><p>Of course women and other minority groups in tech will bear the greatest cost. The rest of us will just have fewer venues to meet with our peers and hear about cutting edge developments in person. But women, PoC, trans people, etc. are already being promoted at significantly higher numbers than they exist at large in tech with the bar being set very low to make this happen. Low-quality speakers from these minority groups are all too common. The same names keep appearing and people wonder why because they never seem to have anything interesting to add. Non-technical soft talks are becoming too common, and nobody wants to go to a tech conference to be moralized at, but it’s now standard practice.</p><p>The tech community at large is being presented with artificial evidence that these minority groups are simply full of low-quality and non-contributing individuals. Then we’re told that that this is caused by rampant sexism, racism, and transphobia in tech. I don’t believe this is true but I wouldn’t blame regular conference attendees and video watchers from concluding that their non-white, non-cis, non-male peers are indeed of lesser quality considering the anecdotal evidence being force fed to them. There are great women, PoC, trans, whatever, people in tech, but the high-quality ones exist in proportion to their numbers overall. And those overall numbers are small. For all the reasons that James Damore was chastised for pointing out.</p></div>",
  "content_text": "A former conference speaker who is still very much in demand explains why he doesn’t even attend technology conferences anymore. Sounds like we don’t just need #AltTech, but #AltCon as well.\nThese technology conferences are usually run by community-minded people, not corporates, by people who devote themselves to the endeavor, enter into huge financial risk and often wind up losing money at the end of it. Yet\nthis kind of over-the-top virtue display\nis becoming increasingly common. Once upon a time I seriously considered launching a conference myself, but there’s no way I’d expose myself to this kind of drama, which is almost guaranteed now.\nThese tech community controversies fall into 3 broad categories:\n1. Not enough speaker diversity.\nYou’re guaranteed this kind of outrage now if you don’t have 50{b05c51a15f0a42d8e7dd687f4cc4bfffd66a97ee173a2742c6182468204332c9} or more women speakers. I’m certain the bar will move once parity is achieved and you then need PoC, then trans, then … You even have popular speakers now making statements like “I won’t speak at a conference or be on a panel unless there are least 50{b05c51a15f0a42d8e7dd687f4cc4bfffd66a97ee173a2742c6182468204332c9} women and PoC”\nsuch as this fellow\n. ElectronConf is a hilarious example of this controversy. Electron is an important and rapidly growing technology. It’s what applications like Slack, Skype and Brave and many other desktop applications are built on. It’s an open source project run and owned by GitHub. They announced their first conference in 2016, got speaker proposals, and even did a blind speaker selection, but ended up with all male speakers, which is obviously not surprising to the rational observer. This kicked off a controversy. The conference was initially postponed, then went dark and completely disappeared. It’s supposedly back again for 2018 and calling for speakers, but there is no reason to assume the same thing won’t happen again.\n2. I won’t speak if X is speaking!\nIdentify a problematic speaker on the list along with yourself and make a big show of how you are cancelling your talk because you won’t appear at a venue that promotes problematic Mr X. Often the timing is guaranteed to give the organizers an aneurysm. Nodevember in Nashville in 2016 was a great example of this. Doug Crockford, a well-respected old-guard from the JavaScript community,  literally wrote the book on JavaScript best practices that was a reference for many years–\nJavaScript: The Good Parts\n, was on the speaker list but had recently caused conference controversy for “slut shaming” because he was making a technical point and referred to the “old web” as “promiscuous” and the “new web” as “consensual”, the case being that he was equating promiscuity with something negative. Kassandra Perch, a typical screechy non-contributing SJW who creates controversy wherever she goes, pulled out and made a scene. She was backed up by the usual Twitter suspects in that community and caused a headache for the organizers. The organizers then had a falling out because one took it upon himself to disinvite Crockford immediately, while another organizer stepped down in protest of the first guy’s unilateral action and released a public statement about it. All hell broke lose. This is a conference organized by individuals, who invest their own time to make a fun community thing and have to go begging for sponsorships to make it happen. Somehow they survived and are still doing it each year.\n3. A man looked at me! Reeeeee!\nThis used to be a common tactic as a tool used to justify and introduce Codes of Conduct as a standard practice at conferences in the first place, before they were pushed into our code repositories. There is rarely evidence of actual wrongdoing, just hearsay, and often even that hearsay is a head-scratcher. Now you can’t run one of these without a CoC, you just won’t get sponsors because they’ll be targeted if you don’t. See LambdaConf as the last non-CoC conf that has now introduced their own, a bit less SJWized version in an attempt to have one but not completely submit to the narrative. Now that all the conferences have CoCs, the screeching is about supposed violations that aren’t\ncorrectly handled\n. They are either pure virtue-signaling or an attempt to undermine the unconverged organization committee. It’s not surprising that this current controversy is around a conference in eastern Europe where they are less attuned to SJW culture and don’t properly understand how to feed that dragon. They probably stepped on a tripwire and alerted this individual that they hadn’t fully signed up to the narrative. The non-West suffers the most from this and comes because they see a need to invite Western big-names to attract ticket sales.\nAs that guy you interviewed in\nSJWs Always Double Down\nsaid, tech community conferences were the initial gateway for SJW convergence of open source, and my assessment is that they’ll be the canary in the coal mine for the costs that convergence will eventually extract from open source. Tech conferences are becoming too risky to organize. The rules around what is acceptable, who you can have speak, ratios of acceptable groups to feature in your speaker lineup, and so forth, are just too hard to understand as the SJW standards mutate over time. The financial risks are huge and you have to rely on large sponsors to fund your events; ticket sales don’t do it. But your sponsors are flighty and will withdraw at the first hint of controversy. Quality speakers are becoming increasingly difficult to book and the ratio of knowns to unknowns will deteriorate too far to attract sufficient ticket sales. Particularly when you have to insert so many token speakers who don’t contribute to the attractiveness of the conference, and will sometimes even detract from it.\nOf course women and other minority groups in tech will bear the greatest cost. The rest of us will just have fewer venues to meet with our peers and hear about cutting edge developments in person. But women, PoC, trans people, etc. are already being promoted at significantly higher numbers than they exist at large in tech with the bar being set very low to make this happen. Low-quality speakers from these minority groups are all too common. The same names keep appearing and people wonder why because they never seem to have anything interesting to add. Non-technical soft talks are becoming too common, and nobody wants to go to a tech conference to be moralized at, but it’s now standard practice.\nThe tech community at large is being presented with artificial evidence that these minority groups are simply full of low-quality and non-contributing individuals. Then we’re told that that this is caused by rampant sexism, racism, and transphobia in tech. I don’t believe this is true but I wouldn’t blame regular conference attendees and video watchers from concluding that their non-white, non-cis, non-male peers are indeed of lesser quality considering the anecdotal evidence being force fed to them. There are great women, PoC, trans, whatever, people in tech, but the high-quality ones exist in proportion to their numbers overall. And those overall numbers are small. For all the reasons that James Damore was chastised for pointing out.",
  "tags": [
    "SJW",
    "technology"
  ],
  "categories": [],
  "sitemap_lastmod": "2017-11-07T13:00:00+00:00"
}