{
  "url": "https://voxday.net/2017/11/29/matt-lauer-gets-weinsteined/",
  "scraped_at": "2025-12-19T10:33:11.411398",
  "title": "Matt Lauer gets Weinsteined",
  "date_display": "November 29, 2017",
  "date_iso": "2017-11-29T12:46:00+00:00",
  "date_from_url": "2017-11-29",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>Is there anyone in the media who doesn’t <a href=\"http://money.cnn.com/2017/11/29/media/matt-lauer/index.html\">abuse their position</a> to sexually harass women?</p><blockquote><p>Matt Lauer was fired from NBC News on Wednesday after an employee filed a complaint about “inappropriate sexual behavior in the workplace,” the network announced. Savannah Guthrie made the announcement at the top of the “Today” show. Lauer has been the cornerstone of the program, one of the most profitable franchises on television, for two decades.</p><p>NBC News chairman Andrew Lack said in a memo to staff that it was the first complaint lodged against Lauer in his career at the network. But he said “we were also presented with reason to believe this may not have been an isolated incident.”</p><p>Lauer was not immediately reachable for comment. An NBC News spokeswoman declined to comment about the details of the allegation against him. Reporters for The New York Times had been investigating Lauer for several weeks, according to sources who had been contacted by the Times.</p></blockquote><p>It just keeps getting better. The Hollywood pedos must really be getting desperate. They’re throwing anyone and everyone to the wolves in a futile attempt to distract the American public from their own crimes. That’s fine. The more, the merrier!</p><p>But why are none of these monsters in jail yet? Why is Al Frankengroper still in the U.S. Senate?</p><p>The best consequence of all this is that the SJW-converged media is going to be a) increasingly female and b) increasingly irrelevant going forward.</p><p>UPDATE: <i>ESPN says it is eliminating 150 studio and production employees as the sports broadcasting giant continues to shift its focus to a more digital future. The company says the layoffs, which were announced Wednesday morning in a memo to employees, don’t include on-air talent and will have a minimal impact on the network’s signature SportsCenter news program.</i></p><p>Translation: more layoffs, including on-air talent, are coming in the new year.</p><p>UPDATE: Still more winning!</p><p><i>NPR Chief News Editor David Sweeney has left the company following allegations of sexual harassment filed against him by at least three female journalists.</i></p></div>",
  "content_text": "Is there anyone in the media who doesn’t\nabuse their position\nto sexually harass women?\nMatt Lauer was fired from NBC News on Wednesday after an employee filed a complaint about “inappropriate sexual behavior in the workplace,” the network announced. Savannah Guthrie made the announcement at the top of the “Today” show. Lauer has been the cornerstone of the program, one of the most profitable franchises on television, for two decades.\nNBC News chairman Andrew Lack said in a memo to staff that it was the first complaint lodged against Lauer in his career at the network. But he said “we were also presented with reason to believe this may not have been an isolated incident.”\nLauer was not immediately reachable for comment. An NBC News spokeswoman declined to comment about the details of the allegation against him. Reporters for The New York Times had been investigating Lauer for several weeks, according to sources who had been contacted by the Times.\nIt just keeps getting better. The Hollywood pedos must really be getting desperate. They’re throwing anyone and everyone to the wolves in a futile attempt to distract the American public from their own crimes. That’s fine. The more, the merrier!\nBut why are none of these monsters in jail yet? Why is Al Frankengroper still in the U.S. Senate?\nThe best consequence of all this is that the SJW-converged media is going to be a) increasingly female and b) increasingly irrelevant going forward.\nUPDATE:\nESPN says it is eliminating 150 studio and production employees as the sports broadcasting giant continues to shift its focus to a more digital future. The company says the layoffs, which were announced Wednesday morning in a memo to employees, don’t include on-air talent and will have a minimal impact on the network’s signature SportsCenter news program.\nTranslation: more layoffs, including on-air talent, are coming in the new year.\nUPDATE: Still more winning!\nNPR Chief News Editor David Sweeney has left the company following allegations of sexual harassment filed against him by at least three female journalists.",
  "tags": [
    "law",
    "media"
  ],
  "categories": [],
  "sitemap_lastmod": "2017-11-29T12:46:00+00:00"
}