{
  "url": "https://voxday.net/2017/11/27/morality-is-objective/",
  "scraped_at": "2025-12-19T10:32:55.061042",
  "title": "Morality is objective",
  "date_display": "November 27, 2017",
  "date_iso": "2017-11-27T10:22:00+00:00",
  "date_from_url": "2017-11-27",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>Again and again, we see that the rationales and justifications offered by atheists for their disbelief simply don’t stand up to even cursory philosophical analysis. (This is not to say their disbelief is not genuine, merely that its cause is seldom rooted in the explanations provided.) While on the emotional side, atheism may be little more than social autism, on the intellectual side, it appears to be primarily a combination of historical and philosophical ignorance.</p><p>Consider the following exchange:</p><blockquote><p>AB: some people, psychopaths especially have no capacity for moral reasoning and no moral agency.</p><p>VD: Of course they do, if you define morality correctly. The fact that psychopaths have no EMPATHY does not mean they have no moral agency, because morality does not depend upon empathy.</p><p>AB: I think understand what you are saying but I simply cannot grok the idea fully as I cannot see morality as objective.</p></blockquote><p>This is little more than a failure to understand what morality is, because while the existence of God is nominally disputable, the objectivity of morality is not, and more importantly, cannot be disputed.</p><p>The definitions of <i>morality </i>refer us to the definition of <i>moral</i>, which is given a follows:</p><ol><li>of, relating to, or concerned with the principles or rules of right conduct or the distinction between right and wrong;</li><li>expressing or conveying truths or counsel as to right conduct, as a speaker or a literary work.</li><li>founded on the fundamental principles of right conduct rather than on legalities, enactment, or custom.</li><li>capable of conforming to the rules of right conduct: a moral being.</li><li>conforming to the rules of right conduct</li></ol><p>Now, if “the fundamental principles of right conduct” are not mere legalities, enactment, or custom, then they must be objective, for the obvious reason that if the standard for right conduct is subjective, then no such standard exists, not being <i>a fundamental principle</i>. Morality not only is not subjective, it <i>cannot </i>be subjective, because a subjective fundamental principle is both an oxymoron and an actual contradiction in terms.</p><p>A psychopath has both a capacity for moral reasoning and moral agency because he is capable of conforming to the rules of right conduct even if he does not feel any empathy for others. He can even conform to the Golden Rule; even a psychopath knows how he prefers to be treated himself.</p><p>AB’s fundamental mistake is that he confuses the concept of a personal ethos with morality. But a personal ethos is an ersatz morality and is no more a system of universally applicable rules than a preference for calling pass plays over running plays or playing man-to-man defense instead of zone are official NFL rules.</p></div>",
  "content_text": "Again and again, we see that the rationales and justifications offered by atheists for their disbelief simply don’t stand up to even cursory philosophical analysis. (This is not to say their disbelief is not genuine, merely that its cause is seldom rooted in the explanations provided.) While on the emotional side, atheism may be little more than social autism, on the intellectual side, it appears to be primarily a combination of historical and philosophical ignorance.\nConsider the following exchange:\nAB: some people, psychopaths especially have no capacity for moral reasoning and no moral agency.\nVD: Of course they do, if you define morality correctly. The fact that psychopaths have no EMPATHY does not mean they have no moral agency, because morality does not depend upon empathy.\nAB: I think understand what you are saying but I simply cannot grok the idea fully as I cannot see morality as objective.\nThis is little more than a failure to understand what morality is, because while the existence of God is nominally disputable, the objectivity of morality is not, and more importantly, cannot be disputed.\nThe definitions of\nmorality\nrefer us to the definition of\nmoral\n, which is given a follows:\nof, relating to, or concerned with the principles or rules of right conduct or the distinction between right and wrong;\nexpressing or conveying truths or counsel as to right conduct, as a speaker or a literary work.\nfounded on the fundamental principles of right conduct rather than on legalities, enactment, or custom.\ncapable of conforming to the rules of right conduct: a moral being.\nconforming to the rules of right conduct\nNow, if “the fundamental principles of right conduct” are not mere legalities, enactment, or custom, then they must be objective, for the obvious reason that if the standard for right conduct is subjective, then no such standard exists, not being\na fundamental principle\n. Morality not only is not subjective, it\ncannot\nbe subjective, because a subjective fundamental principle is both an oxymoron and an actual contradiction in terms.\nA psychopath has both a capacity for moral reasoning and moral agency because he is capable of conforming to the rules of right conduct even if he does not feel any empathy for others. He can even conform to the Golden Rule; even a psychopath knows how he prefers to be treated himself.\nAB’s fundamental mistake is that he confuses the concept of a personal ethos with morality. But a personal ethos is an ersatz morality and is no more a system of universally applicable rules than a preference for calling pass plays over running plays or playing man-to-man defense instead of zone are official NFL rules.",
  "tags": [
    "atheism",
    "mailvox",
    "philosophy"
  ],
  "categories": [],
  "sitemap_lastmod": "2017-11-27T10:22:00+00:00"
}