{
  "url": "https://voxday.net/2017/11/04/name-the-sophistry/",
  "scraped_at": "2025-12-19T10:30:18.774010",
  "title": "Name the sophistry",
  "date_display": "November 4, 2017",
  "date_iso": "2017-11-04T16:06:00+00:00",
  "date_from_url": "2017-11-04",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>This was an exchange on Twitter following my tweet of a link to the post below about the theologically nonsensical idea that racism is a sin. Those who have read <b><i><a href=\"http://amzn.to/2xt9dWb\">SJWs Always Double Down</a></i></b> should be able to identify it correctly.</p><blockquote><p>Supreme Dark Lord‏ @voxday<br>Racism is an invented sin. Every so-called pastor who preaches against racism should be expelled from the pulpit.</br></p><p>Fishcake‏ @toonaphish<br>To be fair, James 2 specifically talk about the sin of partiality, of which prejudice is just am offshoot.</br></p><p>Supreme Dark Lord‏ @voxday<br>That is false. The sin of partiality refers to treating rich people better than poor people in the Church. Anti-racism is partiality.</br></p><p>Fishcake‏ @toonaphish<br>James 2 specifically starts off saying, “how can you claim to have faith in Jesus Christ if you favor some over others.”</br></p><p>Supreme Dark Lord‏ @voxday<br>That’s true. But what is favoring some over others? Affirmative action policies? Or a belief in a genetic explanation for human variations?</br></p><p>Fishcake‏ @toonaphish<br>Favoritism is stripping humanity of their soul while making preferred decisions based on the purely physical.</br></p><p>Supreme Dark Lord‏ @voxday<br>You are a liar.</br></p></blockquote><p>Notice in particular the way in which the anti-racist is completely unable to defend his Scriptural position, and is therefore forced to retreat almost immediately into shameless sophistry.</p></div>",
  "content_text": "This was an exchange on Twitter following my tweet of a link to the post below about the theologically nonsensical idea that racism is a sin. Those who have read\nSJWs Always Double Down\nshould be able to identify it correctly.\nSupreme Dark Lord‏ @voxday\nRacism is an invented sin. Every so-called pastor who preaches against racism should be expelled from the pulpit.\nFishcake‏ @toonaphish\nTo be fair, James 2 specifically talk about the sin of partiality, of which prejudice is just am offshoot.\nSupreme Dark Lord‏ @voxday\nThat is false. The sin of partiality refers to treating rich people better than poor people in the Church. Anti-racism is partiality.\nFishcake‏ @toonaphish\nJames 2 specifically starts off saying, “how can you claim to have faith in Jesus Christ if you favor some over others.”\nSupreme Dark Lord‏ @voxday\nThat’s true. But what is favoring some over others? Affirmative action policies? Or a belief in a genetic explanation for human variations?\nFishcake‏ @toonaphish\nFavoritism is stripping humanity of their soul while making preferred decisions based on the purely physical.\nSupreme Dark Lord‏ @voxday\nYou are a liar.\nNotice in particular the way in which the anti-racist is completely unable to defend his Scriptural position, and is therefore forced to retreat almost immediately into shameless sophistry.",
  "tags": [
    "Christianity",
    "SJW"
  ],
  "categories": [],
  "sitemap_lastmod": "2017-11-04T16:06:00+00:00"
}