{
  "url": "https://voxday.net/2017/11/25/never-go-full-sjw-not-even-in-comics/",
  "scraped_at": "2025-12-19T10:32:42.893447",
  "title": "Never go full SJW, not even in comics",
  "date_display": "November 25, 2017",
  "date_iso": "2017-11-25T12:07:00+00:00",
  "date_from_url": "2017-11-25",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p><i>You may recall that last week, I posted an image of a GI Joe cover that many of you doubted could possibly be real. Well, it was. And here is <a href=\"https://www.bleedingcool.com/2017/11/23/aubrey-sitterson-socialist-gi-joe/\">an interview with the current writer of GI Joe</a>, Aubrey Sitterson, with Bleeding Cool, which may prove to be more than a little informative. Note how this line was practically paraphrased from SJWAL’s description of the purpose of narrative propaganda: “It’s speculative fiction, right? So why not use it to conjure up a better world?”</i><br><b><br/></b><b>BC: Some Joe fans take issue with a person of your political persuasions writing GI Joe. Tell us why that’s actually a good thing.</b></br></p><p>AS: I’m a socialist, and that’s been a tough pill for some folks to swallow. That’s in part because in this country, the military is almost universally seen as a right wing institution, but that’s actually far from a universal sentiment. There are too many countries to list where the military has fought off right-wing coups or fundamentalist takeovers, or even where the military has sided with socialist insurgencies. In South American history, it’s not even uncommon for socialist activists to become soldiers themselves! It’s a common Marxist refrain, but that’s because it’s true: The military has revolutionary potential.</p><div class=\"separator\" style=\"clear: both; text-align: center;\"><a href=\"https://rzzy0b736k-flywheel.netdna-ssl.com/wp-content/uploads/2017/01/GIJOE_ONGO2016_05-cvrSUBA.jpg\" imageanchor=\"1\" style=\"clear: right; float: right; margin-bottom: 1em; margin-left: 1em;\"><img border=\"0\" data-original-height=\"800\" data-original-width=\"527\" decoding=\"async\" fetchpriority=\"high\" height=\"320\" src=\"https://rzzy0b736k-flywheel.netdna-ssl.com/wp-content/uploads/2017/01/GIJOE_ONGO2016_05-cvrSUBA.jpg\" width=\"210\"/></a></div><p>There’s nothing inherently right wing about the military, it’s just how the military has generally been used in United States history. One of the big questions I posed to myself, especially writing this book in the midst of Trump taking office and the rise of the alt-right, was figuring out what a socialist GI Joe book would even look like. After a lot of thought, it came down to tweaking not only our general perception of the military’s goals, but also the methods by which it achieves them. A socialist military doesn’t exist to further enrich the monied classes or enforce property rights or promote imperialist agenda. Instead, it has a far simpler, far more noble goal: Protecting and empowering people.</p><p>The book is designed to be aspirational, so I tried to write Joe as an idealized military – what the military would be if I could wave a magic wand and make it so. That’s why GI Joe became an international organization, one more concerned with protecting the population of the planet than promoting any single country’s interests, and also a big part of why we switched all of the Joes over to using laser weapons. It’s speculative fiction, right? So why not use it to conjure up a better world?</p><p>Using lasers also solved another big problem with doing a leftist take on GI Joe: Guns. I love gunporn action flicks as much as anyone, more than most, honestly, but what flies in John Wick or Commando simply ain’t appropriate in GI Joe, which is, at its core, and in my favorite incarnation, decidedly a kids’ property. I grew up watching all kinds of stuff that glorified gun violence and while I don’t think it broke me as a person or anything, that kind of material definitely contributes to the exaltation of firearms. And in 2017, with what feels like near-constant mass shootings, fetishizing guns in a children’s property isn’t just gross, it’s wrong.</p><p>That’s the behind-the-scenes reason on why the Joes use nonlethal lasers, but there’s also an excellent story reason as well: If the Joes are the best in their chosen fields, and they’re all working together…why would they even need to kill people? The Joes are strong and capable enough that they can afford to be nice, to give people the benefit of the doubt, even if doing so puts them at risk. And truthfully, that’s the very definition of a hero.<br><b><br/></b><b>BC: You’ve been the target of what we’ll call “backlash” for some of the changes you’ve made to GI Joe, but GI Joe as a property has been, in a lot of ways, progressive since the ’80s. In that respect, what parts of that legacy did you build on for your take on GI Joe?</b></br></p><p>AS: “Backlash” is a nice word for it, right? Though they’ve thankfully calmed down now, I was getting death threats for more than a month. One of the most perplexing things about that whole situation (outside of how someone could get so upset over a comic book that they’d threaten someone’s life) was that GI Joe has been progressive since the very first issue of Real American Hero. War was never something to be celebrated in that book — it was a sad necessity, albeit one where heroes could be elevated through valor. And that progressive trend was continued in the Sunbow series a few years later, with a level of gender, ethnic and racial representation that was simply unheard of at the time. And while the Joes were a diverse group of friends, the Cobra villains were, by-and-large, homogenous white males. That’s shockingly progressive for smack dab in the middle of Reagan’s America.</p><p>GI Joe is, at its core, a progressive concept, so I didn’t have to go in and do any heavy lifting. Instead, it was all about figuring out ways to continue that trend, but in a way that’s appropriate for 2017. Our new Salvo is a great example of that, albeit one for which I continue to catch a lot of heat from a certain vocal minority of Joe fans. Making Salvo a Samoan woman served a couple purposes. First, it gave us another international Joe for our newly international team. Changing the character’s race and gender not only gave us some Polynesian representation, but also helped us dodge some problematic visual associations, as Salvo’s original look (bald, heavily muscled white guy with giant guns and a shirt that says “THE RIGHT OF MIGHT”) reads as… a little too alt-right. It also presented an opportunity to introduce a different body type into the group, which I thought was important.</p><p><i>So, the SJW definition of a hero is “someone who is strong enough to be nice and give people the benefit of the doubt, even if doing so puts himself at risk.” That explains the SJW position on immigration, does it not? Okay, so that’s the shot. Now here is the chaser, <a href=\"https://www.bleedingcool.com/2017/11/23/sitterson-scarletts-strike-force-cancelled/\">a news item posted later that same da</a>y by the same comics news site, Bleeding Cool.</i></p><blockquote><p>There’s still more than a week before the December 5th final order cutoff for retailers to order Scarlett’s Strike Force, the new GI Joe series launching out of IDW’s First Strike super-mega-crossover event. But before all the orders are in for the first issue, set to hit stores on December 20th, the book has already been canceled by IDW.</p><p>“Unfortunately, IDW told me early this month that Scarlett’s Strike Force was being canceled after issue #3,” writer Aubrey Sitterson told Bleeding Cool in an exclusive interview. “And with up through issue #4 already written, that means ending on a pretty outrageous cliffhanger.”</p><p>Since the first issue is more than a month away from hitting stores, with time yet left for retailers and fans to order it, it might seem premature for the book to already be canceled, but Sitterson relayed the reason he was given by his publisher, as unlikely as it sounds: “IDW told me they made the decision due to low sales.”</p></blockquote><p><i>Good riddance! IDW appears to be figuring out that SJWs are a cancer a little faster than either Marvel or DC is. Of course, IDW has considerably less margin for error, since they aren’t being propped up by their movie-licensing revenue. </i><br><i><br/></i><i>UPDATE: No, my assumption was incorrect. Apparently IDW has learned nothing from this incident and the decision was imposed upon them from above. “IDW stood by Sitterson (he did keep his job as the writer after all). Their initial support statement was only retracted after Hasbro allegedly got involved.”</i><br><i><br/></i><i>Snicker-snack….</i></br></br></p></div>",
  "content_text": "You may recall that last week, I posted an image of a GI Joe cover that many of you doubted could possibly be real. Well, it was. And here is\nan interview with the current writer of GI Joe\n, Aubrey Sitterson, with Bleeding Cool, which may prove to be more than a little informative. Note how this line was practically paraphrased from SJWAL’s description of the purpose of narrative propaganda: “It’s speculative fiction, right? So why not use it to conjure up a better world?”\nBC: Some Joe fans take issue with a person of your political persuasions writing GI Joe. Tell us why that’s actually a good thing.\nAS: I’m a socialist, and that’s been a tough pill for some folks to swallow. That’s in part because in this country, the military is almost universally seen as a right wing institution, but that’s actually far from a universal sentiment. There are too many countries to list where the military has fought off right-wing coups or fundamentalist takeovers, or even where the military has sided with socialist insurgencies. In South American history, it’s not even uncommon for socialist activists to become soldiers themselves! It’s a common Marxist refrain, but that’s because it’s true: The military has revolutionary potential.\nThere’s nothing inherently right wing about the military, it’s just how the military has generally been used in United States history. One of the big questions I posed to myself, especially writing this book in the midst of Trump taking office and the rise of the alt-right, was figuring out what a socialist GI Joe book would even look like. After a lot of thought, it came down to tweaking not only our general perception of the military’s goals, but also the methods by which it achieves them. A socialist military doesn’t exist to further enrich the monied classes or enforce property rights or promote imperialist agenda. Instead, it has a far simpler, far more noble goal: Protecting and empowering people.\nThe book is designed to be aspirational, so I tried to write Joe as an idealized military – what the military would be if I could wave a magic wand and make it so. That’s why GI Joe became an international organization, one more concerned with protecting the population of the planet than promoting any single country’s interests, and also a big part of why we switched all of the Joes over to using laser weapons. It’s speculative fiction, right? So why not use it to conjure up a better world?\nUsing lasers also solved another big problem with doing a leftist take on GI Joe: Guns. I love gunporn action flicks as much as anyone, more than most, honestly, but what flies in John Wick or Commando simply ain’t appropriate in GI Joe, which is, at its core, and in my favorite incarnation, decidedly a kids’ property. I grew up watching all kinds of stuff that glorified gun violence and while I don’t think it broke me as a person or anything, that kind of material definitely contributes to the exaltation of firearms. And in 2017, with what feels like near-constant mass shootings, fetishizing guns in a children’s property isn’t just gross, it’s wrong.\nThat’s the behind-the-scenes reason on why the Joes use nonlethal lasers, but there’s also an excellent story reason as well: If the Joes are the best in their chosen fields, and they’re all working together…why would they even need to kill people? The Joes are strong and capable enough that they can afford to be nice, to give people the benefit of the doubt, even if doing so puts them at risk. And truthfully, that’s the very definition of a hero.\nBC: You’ve been the target of what we’ll call “backlash” for some of the changes you’ve made to GI Joe, but GI Joe as a property has been, in a lot of ways, progressive since the ’80s. In that respect, what parts of that legacy did you build on for your take on GI Joe?\nAS: “Backlash” is a nice word for it, right? Though they’ve thankfully calmed down now, I was getting death threats for more than a month. One of the most perplexing things about that whole situation (outside of how someone could get so upset over a comic book that they’d threaten someone’s life) was that GI Joe has been progressive since the very first issue of Real American Hero. War was never something to be celebrated in that book — it was a sad necessity, albeit one where heroes could be elevated through valor. And that progressive trend was continued in the Sunbow series a few years later, with a level of gender, ethnic and racial representation that was simply unheard of at the time. And while the Joes were a diverse group of friends, the Cobra villains were, by-and-large, homogenous white males. That’s shockingly progressive for smack dab in the middle of Reagan’s America.\nGI Joe is, at its core, a progressive concept, so I didn’t have to go in and do any heavy lifting. Instead, it was all about figuring out ways to continue that trend, but in a way that’s appropriate for 2017. Our new Salvo is a great example of that, albeit one for which I continue to catch a lot of heat from a certain vocal minority of Joe fans. Making Salvo a Samoan woman served a couple purposes. First, it gave us another international Joe for our newly international team. Changing the character’s race and gender not only gave us some Polynesian representation, but also helped us dodge some problematic visual associations, as Salvo’s original look (bald, heavily muscled white guy with giant guns and a shirt that says “THE RIGHT OF MIGHT”) reads as… a little too alt-right. It also presented an opportunity to introduce a different body type into the group, which I thought was important.\nSo, the SJW definition of a hero is “someone who is strong enough to be nice and give people the benefit of the doubt, even if doing so puts himself at risk.” That explains the SJW position on immigration, does it not? Okay, so that’s the shot. Now here is the chaser,\na news item posted later that same da\ny by the same comics news site, Bleeding Cool.\nThere’s still more than a week before the December 5th final order cutoff for retailers to order Scarlett’s Strike Force, the new GI Joe series launching out of IDW’s First Strike super-mega-crossover event. But before all the orders are in for the first issue, set to hit stores on December 20th, the book has already been canceled by IDW.\n“Unfortunately, IDW told me early this month that Scarlett’s Strike Force was being canceled after issue #3,” writer Aubrey Sitterson told Bleeding Cool in an exclusive interview. “And with up through issue #4 already written, that means ending on a pretty outrageous cliffhanger.”\nSince the first issue is more than a month away from hitting stores, with time yet left for retailers and fans to order it, it might seem premature for the book to already be canceled, but Sitterson relayed the reason he was given by his publisher, as unlikely as it sounds: “IDW told me they made the decision due to low sales.”\nGood riddance! IDW appears to be figuring out that SJWs are a cancer a little faster than either Marvel or DC is. Of course, IDW has considerably less margin for error, since they aren’t being propped up by their movie-licensing revenue.\nUPDATE: No, my assumption was incorrect. Apparently IDW has learned nothing from this incident and the decision was imposed upon them from above. “IDW stood by Sitterson (he did keep his job as the writer after all). Their initial support statement was only retracted after Hasbro allegedly got involved.”\nSnicker-snack….",
  "tags": [
    "Alt-Hero",
    "SJW"
  ],
  "categories": [],
  "sitemap_lastmod": "2017-11-25T12:07:00+00:00"
}