{
  "url": "https://voxday.net/2017/11/25/not-a-good-start/",
  "scraped_at": "2025-12-19T10:32:45.848241",
  "title": "Not a good start",
  "date_display": "November 25, 2017",
  "date_iso": "2017-11-25T17:35:00+00:00",
  "date_from_url": "2017-11-25",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>After reading Tom Wolfe’s unstinting praise of EO Wilson, I decided I need to read the man’s work. Who could fail to be interested after this sort of billing?<br><i><br/></i><i>He could be stuck anywhere on God’s green earth and he would always be the smartest person in his class. That remained true after he graduated with a bachelor’s degree and a master’s in biology from the University of Alabama and became a doctoral candidate and then a teacher of biology at Harvard for the next half century. He remained the best in his class every inch of the way. Seething Harvard savant after seething Harvard savant, including one Nobel laureate, has seen his reputation eclipsed by this terribly reserved, terribly polite Alabamian, Edward O. Wilson.</i></br></p><p>Fantastic. But as I am insufficiently learned to read his scientific work critically, I elected to begin with his philosophical work, specifically, <i>The Meaning of Human Existence</i>. And I was unexpectedly disappointed on only the second page. To say that it does not begin well for a man of supposedly superlative intelligence would be an understatement.</p><blockquote><p>In ordinary usage the word “meaning” implies intention, intention implies design, and design implies a designer. Any entity, any process, or definition of any word itself is put into play as a result of an intended consequence in the mind of the designer. This is the heart of the philosophical worldview of organized religions, and in particular their creation stories. Humanity, it assumes, exists for a purpose. Individuals have a purpose in being on Earth. Both humanity and individuals have meaning.</p><p>There is a second, broader way the word “meaning” is used and a very different worldview implied. It is that the accidents of history, not the intentions of a designer, are the source of meaning. There is no advance design, but instead overlapping networks of physical cause and effect. The unfolding of history is obedient only to the general laws of the Universe. Each event is random yet alters the probability of later events. During organic evolution, for example, the origin of one adaptation by natural selection makes the origin of certain other adaptations more likely. This concept of meaning, insofar as it illuminates humanity and the rest of life, is the worldview of science.</p></blockquote><p>What? All right, hold on just one sociobiologically-constructed minute. No one, literally <i>no one</i>, ever uses the word “meaning” that way. Even less so can this usage be excused in the case of an author who is writing in the intrinsically philosophical context of attempting to explain the significance of Man’s existence. Let’s reference the dictionary.</p><p>MEANING, <i>noun</i></p><ol><li>what is intended to be, or actually is, expressed or indicated; signification; import</li><li>the end, purpose, or significance of something</li></ol><p>Hmmm. He has at least a superficial excuse. It appears that Wilson is playing a little fast-and-loose with the definition of “meaning” here. He is clearly using it in the sense of “what actually is”. That is (unexpectedly) fair enough, except for the fact that by selecting that specific <i>meaning </i>of the word,(1) he reduces both his statement and the thesis of his book to basic tautologies.</p><p>Consider the title: <i>The Meaning of Human Existence</i>. Now let’s incorporate this second, broader way the word meaning is used, according to Wilson: <i>The Actual Is of Human Existence</i>. What, one wonders, can we derive from Wilson’s bold statement that humans actually exist? Are we to assume it is a catalog of facts about humanity rather than a statement about the significance of humanity’s existence? It’s more akin to a bad comedy routine than a genuine philosophical statement.</p><p>“What do you mean by that?”<br>“What it is. What it actually is.”<br>“I know what you <i>said</i>. But what do you <i>mean?</i>“<br>“What I said. What else could I mean?”<br>“Don’t you mean what else could I actually is?”<br>“Don’t you?”</br></br></br></br></br></p><p>In fact, I even suspect Wilson of cherry-picking this definition in order to beg the question he appears to be feigning to propose given the fact that it does not appear in other dictionaries, such as the Oxford online dictionary.</p><p>MEANING, <i>noun</i></p><ol><li>What is meant by a word, text, concept, or action.</li><li>Implied or explicit significance.</li><li>Important or worthwhile quality; purpose.</li></ol><p>But the definition provided is even worse than the self-parody it appears to be. Remember, Wilson didn’t directly state that meaning is that which actually is, he declared the second way the word is used to be is that the accidents of history “are the source of meaning”. So, he’s actually using the word meaning <i>in his own definition of the word meaning</i>. This is either intellectual incompetence or intellectual shadiness, and while I cannot say which is the case yet, I am now on high alert to the probability of either… or both.</p><p>Given this shaky – or shady – foundation, I do not have very high hopes for the philosophy that Mr. Wilson has constructed upon it. I completely understand why some find my intellectual arrogance to be unseemly and offputting, but honestly, can you not in turn understand how I come by it, given how often this sort of thing happens?<br><i><br/></i><i><br/></i><i>(1) One can legitimately groan at that one. It does nicely underline my point, though.</i></br></p></div>",
  "content_text": "After reading Tom Wolfe’s unstinting praise of EO Wilson, I decided I need to read the man’s work. Who could fail to be interested after this sort of billing?\nHe could be stuck anywhere on God’s green earth and he would always be the smartest person in his class. That remained true after he graduated with a bachelor’s degree and a master’s in biology from the University of Alabama and became a doctoral candidate and then a teacher of biology at Harvard for the next half century. He remained the best in his class every inch of the way. Seething Harvard savant after seething Harvard savant, including one Nobel laureate, has seen his reputation eclipsed by this terribly reserved, terribly polite Alabamian, Edward O. Wilson.\nFantastic. But as I am insufficiently learned to read his scientific work critically, I elected to begin with his philosophical work, specifically,\nThe Meaning of Human Existence\n. And I was unexpectedly disappointed on only the second page. To say that it does not begin well for a man of supposedly superlative intelligence would be an understatement.\nIn ordinary usage the word “meaning” implies intention, intention implies design, and design implies a designer. Any entity, any process, or definition of any word itself is put into play as a result of an intended consequence in the mind of the designer. This is the heart of the philosophical worldview of organized religions, and in particular their creation stories. Humanity, it assumes, exists for a purpose. Individuals have a purpose in being on Earth. Both humanity and individuals have meaning.\nThere is a second, broader way the word “meaning” is used and a very different worldview implied. It is that the accidents of history, not the intentions of a designer, are the source of meaning. There is no advance design, but instead overlapping networks of physical cause and effect. The unfolding of history is obedient only to the general laws of the Universe. Each event is random yet alters the probability of later events. During organic evolution, for example, the origin of one adaptation by natural selection makes the origin of certain other adaptations more likely. This concept of meaning, insofar as it illuminates humanity and the rest of life, is the worldview of science.\nWhat? All right, hold on just one sociobiologically-constructed minute. No one, literally\nno one\n, ever uses the word “meaning” that way. Even less so can this usage be excused in the case of an author who is writing in the intrinsically philosophical context of attempting to explain the significance of Man’s existence. Let’s reference the dictionary.\nMEANING,\nnoun\nwhat is intended to be, or actually is, expressed or indicated; signification; import\nthe end, purpose, or significance of something\nHmmm. He has at least a superficial excuse. It appears that Wilson is playing a little fast-and-loose with the definition of “meaning” here. He is clearly using it in the sense of “what actually is”. That is (unexpectedly) fair enough, except for the fact that by selecting that specific\nmeaning\nof the word,(1) he reduces both his statement and the thesis of his book to basic tautologies.\nConsider the title:\nThe Meaning of Human Existence\n. Now let’s incorporate this second, broader way the word meaning is used, according to Wilson:\nThe Actual Is of Human Existence\n. What, one wonders, can we derive from Wilson’s bold statement that humans actually exist? Are we to assume it is a catalog of facts about humanity rather than a statement about the significance of humanity’s existence? It’s more akin to a bad comedy routine than a genuine philosophical statement.\n“What do you mean by that?”\n“What it is. What it actually is.”\n“I know what you\nsaid\n. But what do you\nmean?\n“\n“What I said. What else could I mean?”\n“Don’t you mean what else could I actually is?”\n“Don’t you?”\nIn fact, I even suspect Wilson of cherry-picking this definition in order to beg the question he appears to be feigning to propose given the fact that it does not appear in other dictionaries, such as the Oxford online dictionary.\nMEANING,\nnoun\nWhat is meant by a word, text, concept, or action.\nImplied or explicit significance.\nImportant or worthwhile quality; purpose.\nBut the definition provided is even worse than the self-parody it appears to be. Remember, Wilson didn’t directly state that meaning is that which actually is, he declared the second way the word is used to be is that the accidents of history “are the source of meaning”. So, he’s actually using the word meaning\nin his own definition of the word meaning\n. This is either intellectual incompetence or intellectual shadiness, and while I cannot say which is the case yet, I am now on high alert to the probability of either… or both.\nGiven this shaky – or shady – foundation, I do not have very high hopes for the philosophy that Mr. Wilson has constructed upon it. I completely understand why some find my intellectual arrogance to be unseemly and offputting, but honestly, can you not in turn understand how I come by it, given how often this sort of thing happens?\n(1) One can legitimately groan at that one. It does nicely underline my point, though.",
  "tags": [
    "philosophy",
    "science",
    "trainwreck"
  ],
  "categories": [],
  "sitemap_lastmod": "2017-11-25T17:35:00+00:00"
}