{
  "url": "https://voxday.net/2017/11/24/only-a-day-of-gratitude/",
  "scraped_at": "2025-12-19T10:32:41.422867",
  "title": "Only a DAY of gratitude?",
  "date_display": "November 24, 2017",
  "date_iso": "2017-11-24T21:59:00+00:00",
  "date_from_url": "2017-11-24",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>Steve Sailer <a href=\"http://www.unz.com/isteve/we-need-a-national-holiday-of-adulation-and-gratitude-for-jewish-immigration\">reveals his hateful anti-semitic hatefulness</a> as he proposes but ONE measly day to celebrate Jewish immigration and thank these valuable contributors to America for their efforts in making America more deeply and truly American:</p><blockquote><p>Reading the columns of David Brooks, Bret “I have always thought of the United States as a country that belongs first to its newcomers” Stephens, and Roger Cohen, I now realize we should have a national holiday celebrating the immigration of their ancestors to the United States.</p><p>This National Day of Adulation and Gratitude for Jewish Immigration might be the only hope of keeping them from trying so hard to convert every other American national holiday into an occasion for their own ethnocentric ancestor worship.</p><p>Worse, instead of frankly admitting that they really, really like their own kind, the Brookses, Stephens, and Cohens feel compelled to concoct elaborate globalist theories about why every single American national holiday is a mandate for letting in not just their forefathers, but every scimitar-waving Muslim on earth.</p></blockquote><p>If Steve didn’t hate and envy Jews, he would have proposed <i>at least</i> a week of celebration, although perhaps repurposing the 40 Days of Lent would be more appropriately demonstrate the boundless debt of gratitude every American no doubt feels to these true blue Americans who are exactly like every other American except for having arrived later and being more special.</p></div>",
  "content_text": "Steve Sailer\nreveals his hateful anti-semitic hatefulness\nas he proposes but ONE measly day to celebrate Jewish immigration and thank these valuable contributors to America for their efforts in making America more deeply and truly American:\nReading the columns of David Brooks, Bret “I have always thought of the United States as a country that belongs first to its newcomers” Stephens, and Roger Cohen, I now realize we should have a national holiday celebrating the immigration of their ancestors to the United States.\nThis National Day of Adulation and Gratitude for Jewish Immigration might be the only hope of keeping them from trying so hard to convert every other American national holiday into an occasion for their own ethnocentric ancestor worship.\nWorse, instead of frankly admitting that they really, really like their own kind, the Brookses, Stephens, and Cohens feel compelled to concoct elaborate globalist theories about why every single American national holiday is a mandate for letting in not just their forefathers, but every scimitar-waving Muslim on earth.\nIf Steve didn’t hate and envy Jews, he would have proposed\nat least\na week of celebration, although perhaps repurposing the 40 Days of Lent would be more appropriately demonstrate the boundless debt of gratitude every American no doubt feels to these true blue Americans who are exactly like every other American except for having arrived later and being more special.",
  "tags": [
    "history",
    "Zion"
  ],
  "categories": [],
  "sitemap_lastmod": "2017-11-24T21:59:00+00:00"
}