{
  "url": "https://voxday.net/2017/11/11/plagiarism-is-plagiarism/",
  "scraped_at": "2025-12-19T10:31:08.133155",
  "title": "Plagiarism is plagiarism",
  "date_display": "November 11, 2017",
  "date_iso": "2017-11-11T13:00:00+00:00",
  "date_from_url": "2017-11-11",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>Toddy-Cat isn’t quite sure that the Zman is a plagiarist.<br><i><br/></i><i>“I’m not sure that not citing a source in a response to a blog comment actually rises to the dignity of ‘plagiarism’”.</i></br></p><p>That degree of uncertainty is fair, especially if you haven’t actually read the source yourself, as I have not. But, as Tublecane demonstrates, once you look at Stove’s actual words and compare them to the Zman’s words, you are forced to conclude there is nothing to be uncertain about:</p><blockquote><p>I thought of the paraphrasing defense, but that doesn’t hold up. It’s not that Z-man comes off sounding like Stove because uses the same general form of argument, borrowing a phrase or two…. I believe it was deliberate. Compare:</p><p>thezman: “Much more is known now about the natural world, than was known fifty years ago…”</p><p><i>Scientific Irrationalism</i> by David Stove, (p.1) <b>“Much more is known now than was known fifty years ago…”</b></p><p>thezman: “…and much more was known then than in 1580.”</p><p>Stove: <b>“…and much more was known then than in 1580.”</b></p><p>thezman: “So there has been a great accumulation or growth of knowledge in the last four hundred years.”</p><p>Stove: <b>“So there has been a great accumulation or growth of knowledge in the last four hundred years.”</b></p><p>thezman: “This is an extremely well-known fact.”</p><p>Stove: <b>“This is an extremely well-known fact…”</b></p><p>thezman: “Let’s call this (A).”</p><p>Stove: <b>“…which I will refer to as (A).”</b></p><p>thezman: “A person, who did not know (A), would be uncommonly ignorant.”</p><p>Stove: <b>“A philosopher, in particular, who did not know it, would be uncommonly ignorant.”</b></p><p>The remainder of the post veers away from Stove’s text, though I wouldn’t be surprised if it were stolen from somewhere else. Now, whether such a thing as plagiarism exists in internet comment sections, that’s a different matter. I say yes, because it’s publicly passing off someone else’s writing as your own.</p></blockquote><p>Tublecane is correct. The Zman clearly attempted to pass off David Stove’s writing and ideas as his own in order to try to place himself in an intellectually superior position from which he could then pass judgment. It’s not merely a question of what he did, but why he did it in that particular manner. He is observably a plagiarist. This observation is further supported by the fact that the Zman didn’t understand the argument that Stove was making about Karl Popper, nor does he understand Popper’s positions, nor does he even understand the fundamental differences between a) logic, b) math, and c) science, let alone the current need for the etymological division of “science” into its three aspects of scientody, scientage, and scientistry.</p><p>Ogre agrees. “<i>It’s absolutely plagiarism in the sense of “presenting the words of another as your own.” And that’s really the only kind of plagiarism we care about here. Whether it could be considered academic plagiarism (I don’t know) or copyright infringement (its not), its still a dishonest and unethical thing to do. Especially given the context in which it was presented. It’s just more evidence of his posturing–passing off another’s arguments and expressions as his own in order to bolster his perceived intelligence.”</i></p><p>As has been the case <i>every single time</i> I have exposed the pretenses and posturings of someone who has fans, some of those fans are attempting to change the subject away from the failings of that particular individual to my theoretical motivations in destroying that individual’s intellectual reputation. To those fans, I will simply point out that my motivations are irrelevant, the facts are readily observable to everyone, and that this is what I do every time anyone comes at me, be they friend or foe.</p><p>The Zman and his would-be defenders can dance and defend and distract and theorize all they like. It won’t make any difference. The point is that he’s not particularly smart, he’s not very well-read – it wouldn’t surprise me to learn he hasn’t actually read much of the Stove book past the first page since he clearly didn’t understand it – and most importantly, <i>he’s not very honest</i>. And his moral and intellectual failings have nothing to do with me, as I am merely one of the many people who has happened to observe them.</p><p>The main difference between me and most of those who wish to somehow minimize my influence or discredit me is not that I am at least a standard deviation more intelligent than they are, although that is often true. The main difference is that for 16 years I have had tens of thousands of opponents poring over my every word written in column, blog post, comment, tweet, and book, looking for every possible mistake they can exploit, and most of my critics have not.</p><p>So, even if I lacked both confidence in my own words and personal integrity, I know better than to ever make the sort of stupid, obvious, dishonest, and self-discrediting mistake that the Zman did in plagiarizing David Stove’s words and attempting to pass off Stove’s ideas as his own. At the end of the day, a man must decide whether he values his integrity or he values the opinions of others. My decision should be obvious from my mantra: MPAI.</p></div>",
  "content_text": "Toddy-Cat isn’t quite sure that the Zman is a plagiarist.\n“I’m not sure that not citing a source in a response to a blog comment actually rises to the dignity of ‘plagiarism’”.\nThat degree of uncertainty is fair, especially if you haven’t actually read the source yourself, as I have not. But, as Tublecane demonstrates, once you look at Stove’s actual words and compare them to the Zman’s words, you are forced to conclude there is nothing to be uncertain about:\nI thought of the paraphrasing defense, but that doesn’t hold up. It’s not that Z-man comes off sounding like Stove because uses the same general form of argument, borrowing a phrase or two…. I believe it was deliberate. Compare:\nthezman: “Much more is known now about the natural world, than was known fifty years ago…”\nScientific Irrationalism\nby David Stove, (p.1)\n“Much more is known now than was known fifty years ago…”\nthezman: “…and much more was known then than in 1580.”\nStove:\n“…and much more was known then than in 1580.”\nthezman: “So there has been a great accumulation or growth of knowledge in the last four hundred years.”\nStove:\n“So there has been a great accumulation or growth of knowledge in the last four hundred years.”\nthezman: “This is an extremely well-known fact.”\nStove:\n“This is an extremely well-known fact…”\nthezman: “Let’s call this (A).”\nStove:\n“…which I will refer to as (A).”\nthezman: “A person, who did not know (A), would be uncommonly ignorant.”\nStove:\n“A philosopher, in particular, who did not know it, would be uncommonly ignorant.”\nThe remainder of the post veers away from Stove’s text, though I wouldn’t be surprised if it were stolen from somewhere else. Now, whether such a thing as plagiarism exists in internet comment sections, that’s a different matter. I say yes, because it’s publicly passing off someone else’s writing as your own.\nTublecane is correct. The Zman clearly attempted to pass off David Stove’s writing and ideas as his own in order to try to place himself in an intellectually superior position from which he could then pass judgment. It’s not merely a question of what he did, but why he did it in that particular manner. He is observably a plagiarist. This observation is further supported by the fact that the Zman didn’t understand the argument that Stove was making about Karl Popper, nor does he understand Popper’s positions, nor does he even understand the fundamental differences between a) logic, b) math, and c) science, let alone the current need for the etymological division of “science” into its three aspects of scientody, scientage, and scientistry.\nOgre agrees. “\nIt’s absolutely plagiarism in the sense of “presenting the words of another as your own.” And that’s really the only kind of plagiarism we care about here. Whether it could be considered academic plagiarism (I don’t know) or copyright infringement (its not), its still a dishonest and unethical thing to do. Especially given the context in which it was presented. It’s just more evidence of his posturing–passing off another’s arguments and expressions as his own in order to bolster his perceived intelligence.”\nAs has been the case\nevery single time\nI have exposed the pretenses and posturings of someone who has fans, some of those fans are attempting to change the subject away from the failings of that particular individual to my theoretical motivations in destroying that individual’s intellectual reputation. To those fans, I will simply point out that my motivations are irrelevant, the facts are readily observable to everyone, and that this is what I do every time anyone comes at me, be they friend or foe.\nThe Zman and his would-be defenders can dance and defend and distract and theorize all they like. It won’t make any difference. The point is that he’s not particularly smart, he’s not very well-read – it wouldn’t surprise me to learn he hasn’t actually read much of the Stove book past the first page since he clearly didn’t understand it – and most importantly,\nhe’s not very honest\n. And his moral and intellectual failings have nothing to do with me, as I am merely one of the many people who has happened to observe them.\nThe main difference between me and most of those who wish to somehow minimize my influence or discredit me is not that I am at least a standard deviation more intelligent than they are, although that is often true. The main difference is that for 16 years I have had tens of thousands of opponents poring over my every word written in column, blog post, comment, tweet, and book, looking for every possible mistake they can exploit, and most of my critics have not.\nSo, even if I lacked both confidence in my own words and personal integrity, I know better than to ever make the sort of stupid, obvious, dishonest, and self-discrediting mistake that the Zman did in plagiarizing David Stove’s words and attempting to pass off Stove’s ideas as his own. At the end of the day, a man must decide whether he values his integrity or he values the opinions of others. My decision should be obvious from my mantra: MPAI.",
  "tags": [
    "anklebiters",
    "science",
    "trainwreck"
  ],
  "categories": [],
  "sitemap_lastmod": "2017-11-11T13:00:00+00:00"
}