{
  "url": "https://voxday.net/2017/11/21/sales-of-books-candles-rise/",
  "scraped_at": "2025-12-19T10:32:15.884766",
  "title": "Sales of books, candles, rise",
  "date_display": "November 21, 2017",
  "date_iso": "2017-11-21T01:26:00+00:00",
  "date_from_url": "2017-11-21",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>It would certainly be amusing if Scott Van Pelt was numbered amidst <a href=\"https://www.si.com/tech-media/2017/11/09/espn-layoffs-staffers-sportscenter-talent-cuts?utm_campaign=sinow&amp;utm_source=twitter.com&amp;utm_medium=social&amp;xid=socialflow_twitter_si\">the many coming ESPN layoffs</a>:</p><blockquote><p>ESPN will lay off more than 100 staffers after the Thanksgiving holidays, multiple sources tell Sports Illustrated. The layoffs, which were described by a person briefed on the plans, will hit positions across ESPN including front-facing talent on the television side, producers, executives, and digital and technology staffers. The SportsCenter franchise is expected to be hit hard—including on-air people—given the frequency of the show has lessened considerably on main network ESPN.</p><p>The network declined comment to SI on Thursday afternoon…. ESPN continues to be impacted by the changing habits of consumers including cord-cutting and cord-nevers (those who have never purchased a cable subscription) as well as the rising costs of sports rights. The network has dropped in households from 100.13 million in 2011 to an estimated 87.5 million households today.</p></blockquote><p>Notice that all these SJW-infested companies are in double-digit decline. I was told this evening that Marvel is going to try to turn things around, but the problem is, they are either going to have to clean house almost completely or their new editor-in-chief is going to find himself at war with nearly 100 percent of his current writers and artists. And I find it impossible to believe that Disney, of all companies, is going to engage in full-scale deconvergence operations.</p><p>Regardless, I will bet that within 24 months, either Marvel or DC will be asking me to work with them in some capacity. Because <i>we even do SJW better</i> than they do, as you will see later this week.</p><p>In the meantime, ESPN has new policies designed to try to prevent their more outspoken SJWs from attacking their viewers: <i>“Communication with producers and editors must take place prior to commentary on any political or social issues to manage volume and ensure a fair and effective presentation.”</i><br><i><br/></i>It’s far too late for that. They’re not fooling anyone.</br></p></div>",
  "content_text": "It would certainly be amusing if Scott Van Pelt was numbered amidst\nthe many coming ESPN layoffs\n:\nESPN will lay off more than 100 staffers after the Thanksgiving holidays, multiple sources tell Sports Illustrated. The layoffs, which were described by a person briefed on the plans, will hit positions across ESPN including front-facing talent on the television side, producers, executives, and digital and technology staffers. The SportsCenter franchise is expected to be hit hard—including on-air people—given the frequency of the show has lessened considerably on main network ESPN.\nThe network declined comment to SI on Thursday afternoon…. ESPN continues to be impacted by the changing habits of consumers including cord-cutting and cord-nevers (those who have never purchased a cable subscription) as well as the rising costs of sports rights. The network has dropped in households from 100.13 million in 2011 to an estimated 87.5 million households today.\nNotice that all these SJW-infested companies are in double-digit decline. I was told this evening that Marvel is going to try to turn things around, but the problem is, they are either going to have to clean house almost completely or their new editor-in-chief is going to find himself at war with nearly 100 percent of his current writers and artists. And I find it impossible to believe that Disney, of all companies, is going to engage in full-scale deconvergence operations.\nRegardless, I will bet that within 24 months, either Marvel or DC will be asking me to work with them in some capacity. Because\nwe even do SJW better\nthan they do, as you will see later this week.\nIn the meantime, ESPN has new policies designed to try to prevent their more outspoken SJWs from attacking their viewers:\n“Communication with producers and editors must take place prior to commentary on any political or social issues to manage volume and ensure a fair and effective presentation.”\nIt’s far too late for that. They’re not fooling anyone.",
  "tags": [
    "media",
    "SJW"
  ],
  "categories": [],
  "sitemap_lastmod": "2017-11-21T01:26:00+00:00"
}