{
  "url": "https://voxday.net/2017/11/19/the-handicap-of-high-iq/",
  "scraped_at": "2025-12-19T10:32:03.733037",
  "title": "The handicap of high IQ",
  "date_display": "November 19, 2017",
  "date_iso": "2017-11-19T13:00:00+00:00",
  "date_from_url": "2017-11-19",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>This recent finding <a href=\"https://www.zmescience.com/science/psychology-science/smart-leaders-poor-leaders-0432432/\">on intelligence and leadership</a> will not surprise anyone at this blog:</p><blockquote><p>Although intelligence is positively correlated with inspiring and capable leadership, there’s a point where a leader’s IQ offers diminishing returns or can actually lead to detrimental leadership.</p><p>The findings were made by psychologists at the University of Lausanne, Switzerland, who assessed 379 mid-level leaders employed by private companies in 30 mainly European countries. The average age of the participants was 38 and 27 percent of them were women.</p><p>Each participant was asked to complete the Wonderlic Personnel Test, a cognitive ability test widely used by employers and educational institutions around the world. The average IQ of the participants was 111, which is well above the average IQ score of 100 for the general population….</p><p>As previous studies showed, the Swiss researchers found that there was a linear relationship between intelligence and effective leadership — but only up to a point. This association plateaued and then reversed at IQ 120. Leaders who scored above this threshold scored lowered on transformational and instrumental leadership than less intelligent leaders, as rated by standardized tests. Over an IQ score of 128, the poorer leadership style was plainer and statistically significant, as reported in the Journal of Applied Psychology.</p><p>It’s important to note at this point at these ‘very smart’ leaders didn’t employ detrimental leadership styles but rather just scored lower than their ‘less smart’ peers on useful leadership style.</p></blockquote><p>You’ll notice that these findings are perfectly consistent with both <a href=\"http://voxday.blogspot.com/2015/05/the-excluded.html\">the observed exclusion of the cognitive elite</a> from the professional elite as well as <a href=\"http://voxday.blogspot.com/2016/12/the-iq-delta.html\">my distinction</a> between VHIQ and UHIQ. It may also help you understand why I consistently refuse the various leadership positions I am regularly offered as well as why I am so careful about the volunteers I accept.</p><p>I intensely dislike explaining things in unnecessary detail, much less justifying things to anyone, especially subordinates. I simply cannot work with people who insist on both a) having the obvious spelled out to them and b) taking umbrage at having things explained step-by-step for them from the beginning as if they were stupid. (Their words, not mine.) Here is the problem with that conceptual dichotomy: if you have to have the obvious spelled out to you, if you can’t immediately grasp the whole chain of reasoning from start to finish, then it is necessary to spell everything out from the beginning because <i>the other person cannot possibly know at what point your ability to go from A to Z broke down.</i><br><i><br/></i>Another problem is the way in which many, if not most, people are unable to recognize that for every effect, there <i>must be</i> a cause. If I ask a question, then I want the answer to it. I don’t care if you’ve told me the answer 40 times before. I don’t care if you think I should already know the answer. I don’t care if you think there is a different question that I should have asked. Just answer the damned question; I guarantee doing so will take considerably less time than engaging in a debate over any of the various possible permutations of a discussion exploring the reasons why you should not be under any obligation to answer the aforementioned question. What is more likely, the probability that I have forgotten what you have said or the probability that I derive some sort of strange pleasure from forcing you to answer the same question again? <i>Just answer the question that was asked.</i> If that causes any questions to arise on your part, that’s fine, but ask them <i>after </i>you answer mine first.<br><i><br/></i>I have also noticed that many people seem to rather enjoy playing dumb, ignoring the most likely context, and insisting on having everything explained to them instead of using their common sense to assume the probable. For example, if I say “wash the car” to my friend, is it reasonable for him to say, “whatever car do you mean? There are millions, tens of millions of cars in the world? How can I possibly take action when I have no idea what car you could possibly be referring to?”</br></br></p><p>To which my response is: “There is one car in the driveway. It is mine. It is dirty. You borrowed it yesterday. Do you really think I am referring to the presidential limo – no, wait, let’s not confuse you and be too general, do you really think I am referring to the U.S. presidential limo?”</p><p>Now, the most likely context may or may not be the correct one. But it is surely the correct assumption, which one can either listen and wait to see confirmed by subsequent details, or in the absence of those, a simple question. But to pretend that no actionable information has been presented and that one is operating in a complete absence of data is false, disingenuous, and may even be reasonably considered dishonest. Whether this behavior is the result of looking to excuse inaction, to avoid thinking, or to avoid any responsibility for decision-making, I do not know. Regardless, a highly intelligent person is likely to find this sort of pedantic pseudo-ignorance to be aggravating, and thereby, right from the start, find himself behind the leadership eight-ball in the eyes of his subordinates.</p><p>In my opinion, an important aspect of good leadership is a collection of good followers who actively <i>want to be led</i>. I don’t think it is a coincidence that the “poorer leadership” line of demarcation observed happens to almost perfectly line up with the so-called 2SD “communications gap”. Unfortunately, I don’t have any useful advice for the 2SD+ crowd, other than “find smarter subordinates” and “never be surprised by any failure to understand what you think to be obvious.”</p></div>",
  "content_text": "This recent finding\non intelligence and leadership\nwill not surprise anyone at this blog:\nAlthough intelligence is positively correlated with inspiring and capable leadership, there’s a point where a leader’s IQ offers diminishing returns or can actually lead to detrimental leadership.\nThe findings were made by psychologists at the University of Lausanne, Switzerland, who assessed 379 mid-level leaders employed by private companies in 30 mainly European countries. The average age of the participants was 38 and 27 percent of them were women.\nEach participant was asked to complete the Wonderlic Personnel Test, a cognitive ability test widely used by employers and educational institutions around the world. The average IQ of the participants was 111, which is well above the average IQ score of 100 for the general population….\nAs previous studies showed, the Swiss researchers found that there was a linear relationship between intelligence and effective leadership — but only up to a point. This association plateaued and then reversed at IQ 120. Leaders who scored above this threshold scored lowered on transformational and instrumental leadership than less intelligent leaders, as rated by standardized tests. Over an IQ score of 128, the poorer leadership style was plainer and statistically significant, as reported in the Journal of Applied Psychology.\nIt’s important to note at this point at these ‘very smart’ leaders didn’t employ detrimental leadership styles but rather just scored lower than their ‘less smart’ peers on useful leadership style.\nYou’ll notice that these findings are perfectly consistent with both\nthe observed exclusion of the cognitive elite\nfrom the professional elite as well as\nmy distinction\nbetween VHIQ and UHIQ. It may also help you understand why I consistently refuse the various leadership positions I am regularly offered as well as why I am so careful about the volunteers I accept.\nI intensely dislike explaining things in unnecessary detail, much less justifying things to anyone, especially subordinates. I simply cannot work with people who insist on both a) having the obvious spelled out to them and b) taking umbrage at having things explained step-by-step for them from the beginning as if they were stupid. (Their words, not mine.) Here is the problem with that conceptual dichotomy: if you have to have the obvious spelled out to you, if you can’t immediately grasp the whole chain of reasoning from start to finish, then it is necessary to spell everything out from the beginning because\nthe other person cannot possibly know at what point your ability to go from A to Z broke down.\nAnother problem is the way in which many, if not most, people are unable to recognize that for every effect, there\nmust be\na cause. If I ask a question, then I want the answer to it. I don’t care if you’ve told me the answer 40 times before. I don’t care if you think I should already know the answer. I don’t care if you think there is a different question that I should have asked. Just answer the damned question; I guarantee doing so will take considerably less time than engaging in a debate over any of the various possible permutations of a discussion exploring the reasons why you should not be under any obligation to answer the aforementioned question. What is more likely, the probability that I have forgotten what you have said or the probability that I derive some sort of strange pleasure from forcing you to answer the same question again?\nJust answer the question that was asked.\nIf that causes any questions to arise on your part, that’s fine, but ask them\nafter\nyou answer mine first.\nI have also noticed that many people seem to rather enjoy playing dumb, ignoring the most likely context, and insisting on having everything explained to them instead of using their common sense to assume the probable. For example, if I say “wash the car” to my friend, is it reasonable for him to say, “whatever car do you mean? There are millions, tens of millions of cars in the world? How can I possibly take action when I have no idea what car you could possibly be referring to?”\nTo which my response is: “There is one car in the driveway. It is mine. It is dirty. You borrowed it yesterday. Do you really think I am referring to the presidential limo – no, wait, let’s not confuse you and be too general, do you really think I am referring to the U.S. presidential limo?”\nNow, the most likely context may or may not be the correct one. But it is surely the correct assumption, which one can either listen and wait to see confirmed by subsequent details, or in the absence of those, a simple question. But to pretend that no actionable information has been presented and that one is operating in a complete absence of data is false, disingenuous, and may even be reasonably considered dishonest. Whether this behavior is the result of looking to excuse inaction, to avoid thinking, or to avoid any responsibility for decision-making, I do not know. Regardless, a highly intelligent person is likely to find this sort of pedantic pseudo-ignorance to be aggravating, and thereby, right from the start, find himself behind the leadership eight-ball in the eyes of his subordinates.\nIn my opinion, an important aspect of good leadership is a collection of good followers who actively\nwant to be led\n. I don’t think it is a coincidence that the “poorer leadership” line of demarcation observed happens to almost perfectly line up with the so-called 2SD “communications gap”. Unfortunately, I don’t have any useful advice for the 2SD+ crowd, other than “find smarter subordinates” and “never be surprised by any failure to understand what you think to be obvious.”",
  "tags": [
    "IQ",
    "science"
  ],
  "categories": [],
  "sitemap_lastmod": "2017-11-19T13:00:00+00:00"
}