{
  "url": "https://voxday.net/2017/11/10/the-fiend-roy-moore/",
  "scraped_at": "2025-12-19T10:31:02.257295",
  "title": "The fiend Roy Moore",
  "date_display": "November 10, 2017",
  "date_iso": "2017-11-10T13:00:00+00:00",
  "date_from_url": "2017-11-10",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>Well, <a href=\"https://www.washingtonpost.com/investigations/woman-says-roy-moore-initiated-sexual-encounter-when-she-was-14-he-was-32/2017/11/09/1f495878-c293-11e7-afe9-4f60b5a6c4a0_story.html?utm_term=.2a32b50d0903\">if dating a girl who is of the age of consent</a> and not taking advantage of her over several months of dating doesn’t disqualify a man for the Senate, I don’t know what does!</p><blockquote><p>Debbie Wesson Gibson says that she was 17 in the spring of 1981 when Moore spoke to her Etowah High School civics class about serving as the assistant district attorney. She says that when he asked her out, she asked her mother what she would say if she wanted to date a 34-year-old man. Gibson says her mother asked her who the man was, and when Gibson said “Roy Moore,” her mother said, “I’d say you were the luckiest girl in the world.”</p><p>Among locals in Gadsden, a town of about 47,000 back then, Moore “had this godlike, almost deity status — he was a hometown boy made good,” Gibson says, “West Point and so forth.”</p><p>Gibson says that they dated for two to three months, and that he took her to his house, read her poetry and played his guitar. She says he kissed her once in his bedroom and once by the pool at a local country club.</p><p>“Looking back, I’m glad nothing bad happened,” says Gibson, who now lives in Florida. “As a mother of daughters, I realize that our age difference at that time made our dating inappropriate.”</p></blockquote><p>Now, I wasn’t there, but I will say that an older man who dates a younger woman for two to three months with her mother’s approval and <i>doesn’t </i>have sex with her is not the sort of man who behaves in the manner that his accuser is claiming. Especially in light of the timing, this is almost certainly politically motivated slander and Fake News.</p><p>Quite on the other end of the credibility scale, Steve Sailer <a href=\"http://www.unz.com/isteve/jon-stewart-the-conscience-of-television-defends-louis-c-k-the-conscience-of-comedy/\">just busted (((Jon Leibowitz</a>))) for attempting to sweep (((Louis CK’s serial sexual harassment under the rug, while (((Matthew Weiner))) is the latest Hollywood Values paragon to be accused of sexual harassment.</p><p>Why is one accusation credible while the other isn’t? Compare how Moore’s behavior towards other was described <a href=\"https://pjmedia.com/instapundit/280548/\">compared with Weiner’s</a>.</p><blockquote class=\"tr_bq\"><p>At times he seemed a classic bully: obsequious toward those above him, condescending and harsh toward those he perceived as having less power to help or harm him. After one confrontation, costume designer Juliet Polcsa began carrying a minicassette recorder to tape her interactions with Weiner.</p></blockquote><p>And then there is this.</p><blockquote class=\"tr_bq\"><p>Matt originally hired Kater as his personal assistant. She was soon promoted to be his writer’s assistant, and by the end of that same season, Matt offered her the opportunity to co-write the season finale — a particularly important show for him as Weiner also directs the final episode of each season. Then, without requiring Kater to generate any other spec material on her own (usually required for a writer’s advancement), Matt promoted her to be a full-time staff writer for this past season. </p></blockquote><p>That’s a totally normal timeframe for advancement, right? Weiner wasn’t treating Kater any differently than any other PA/writer’s assistant/co-writer/staff writer, right? She was just so super-talented that she never worked in the industry again, right?</p></div>",
  "content_text": "Well,\nif dating a girl who is of the age of consent\nand not taking advantage of her over several months of dating doesn’t disqualify a man for the Senate, I don’t know what does!\nDebbie Wesson Gibson says that she was 17 in the spring of 1981 when Moore spoke to her Etowah High School civics class about serving as the assistant district attorney. She says that when he asked her out, she asked her mother what she would say if she wanted to date a 34-year-old man. Gibson says her mother asked her who the man was, and when Gibson said “Roy Moore,” her mother said, “I’d say you were the luckiest girl in the world.”\nAmong locals in Gadsden, a town of about 47,000 back then, Moore “had this godlike, almost deity status — he was a hometown boy made good,” Gibson says, “West Point and so forth.”\nGibson says that they dated for two to three months, and that he took her to his house, read her poetry and played his guitar. She says he kissed her once in his bedroom and once by the pool at a local country club.\n“Looking back, I’m glad nothing bad happened,” says Gibson, who now lives in Florida. “As a mother of daughters, I realize that our age difference at that time made our dating inappropriate.”\nNow, I wasn’t there, but I will say that an older man who dates a younger woman for two to three months with her mother’s approval and\ndoesn’t\nhave sex with her is not the sort of man who behaves in the manner that his accuser is claiming. Especially in light of the timing, this is almost certainly politically motivated slander and Fake News.\nQuite on the other end of the credibility scale, Steve Sailer\njust busted (((Jon Leibowitz\n))) for attempting to sweep (((Louis CK’s serial sexual harassment under the rug, while (((Matthew Weiner))) is the latest Hollywood Values paragon to be accused of sexual harassment.\nWhy is one accusation credible while the other isn’t? Compare how Moore’s behavior towards other was described\ncompared with Weiner’s\n.\nAt times he seemed a classic bully: obsequious toward those above him, condescending and harsh toward those he perceived as having less power to help or harm him. After one confrontation, costume designer Juliet Polcsa began carrying a minicassette recorder to tape her interactions with Weiner.\nAnd then there is this.\nMatt originally hired Kater as his personal assistant. She was soon promoted to be his writer’s assistant, and by the end of that same season, Matt offered her the opportunity to co-write the season finale — a particularly important show for him as Weiner also directs the final episode of each season. Then, without requiring Kater to generate any other spec material on her own (usually required for a writer’s advancement), Matt promoted her to be a full-time staff writer for this past season.\nThat’s a totally normal timeframe for advancement, right? Weiner wasn’t treating Kater any differently than any other PA/writer’s assistant/co-writer/staff writer, right? She was just so super-talented that she never worked in the industry again, right?",
  "tags": [
    "media",
    "politics"
  ],
  "categories": [],
  "sitemap_lastmod": "2017-11-10T13:00:00+00:00"
}