{
  "url": "https://voxday.net/2017/11/24/the-war-on-canadas-small-towns/",
  "scraped_at": "2025-12-19T10:32:39.925157",
  "title": "The war on Canada’s small towns",
  "date_display": "November 24, 2017",
  "date_iso": "2017-11-24T13:00:00+00:00",
  "date_from_url": "2017-11-24",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>You may think you can run away from the urban centers, but the pro-immigration elite has plans to subsidize <a href=\"http://www.eurocanadian.ca/2017/11/immigration-is-killing-ontario-small-towns.html?m=1\">the settling of immigrants and refugees in small towns</a> as well:</p><blockquote><p>I was on my way to work one morning around the beginning of March, when I decided to stop at MacDonald’s for a morning coffee, one of the few luxuries I can afford, despite having trained for four different fields of work throughout my life in Ontario, Canada. At my current job, I am by far the highest educated worker, with vast training, including a graduate degree in the chief public service that the organization provides: human services. Yet, I am employed on contract at the lowliest clerical job, with the poorest status, and wages and without benefit, not even vacation time (only money in lieu of vacation). That in it-self should raise the eyebrows of the handful of critical thinkers that still exist in this nation.</p><p>Immigration is a working class issue, make no mistake about it. If you were waiting for the wealthy to intervene and to try and stop immigration, that isn’t going to happen — ever!</p><p>At this point, the immigration tap doesn’t need to only be turned off, we actually need restoration efforts to make up for the losses sustained by Canadians proper — restorative justice.</p><p>I waited for my coffee, which was being poured by a long-time Canadian such as myself. Likely he was forced to take any job in order to continue to live in this town, like citizens in so many other small Ontario towns, which have suffered for decades as the jobs left for nations where products could be manufactured at a lower cost to create a product of poor quality to sell back to people like us.</p><p>I reached for the newspaper rack, and ended up with a newspaper in my hand, which I have learned through the application of my critical thinking skills to distrust and despise. Yet, it was in my hand, so I read the headline, “The Future Of Ontario’s Small Towns Is Immigration.”</p><p>I was served my coffee and I gulped it down, not paying attention to it, but rather the headline and burning my mouth and throat in the process. The pain was no comparison to the raw feeling of acid burning in my gut as I continued to read the front page newspaper story, which the low wage workers serving me would likely never even get a chance to glance at throughout their stress-full day at work.</p><p>Imagine having watched your entire community being fed a steady diet of raw potatoes and turnips for thirty years, and in order to survive you’ve swallowed it, but not because you liked it, but because you had been led to believe it was the only way to survive. And then one day you discovered that you could have been eating steak and lobster, and it was all a grand farce, because the joke was on you and the rest of the folks in your towns and communities all across the nation.</p><p>Reading that Toronto Star article, on that freezing cold morning in March, I recognized that “we” the working class had all been made complete fools, not once but again and again and again, as lie after lie was unveiled for us by grinning political shysters.</p></blockquote><p>In case you haven’t figured it out yet, you’re not going to vote the invaders out. Immigration is not “good for the economy”. It is not “good for Americans”. It is not “good for Canadians”. It is, in fact, considerably worse for the native populations in the long term than Operation Barbarossa was for the Russians.</p><p>All of the 3.4 million invading Germans were expelled from Soviet territory within three years. How long will it take to expel the 80 million invaders of the USA? The frightening thing is that immigration on this scale isn’t just invasion, it is <i>permanent occupation</i>.</p></div>",
  "content_text": "You may think you can run away from the urban centers, but the pro-immigration elite has plans to subsidize\nthe settling of immigrants and refugees in small towns\nas well:\nI was on my way to work one morning around the beginning of March, when I decided to stop at MacDonald’s for a morning coffee, one of the few luxuries I can afford, despite having trained for four different fields of work throughout my life in Ontario, Canada. At my current job, I am by far the highest educated worker, with vast training, including a graduate degree in the chief public service that the organization provides: human services. Yet, I am employed on contract at the lowliest clerical job, with the poorest status, and wages and without benefit, not even vacation time (only money in lieu of vacation). That in it-self should raise the eyebrows of the handful of critical thinkers that still exist in this nation.\nImmigration is a working class issue, make no mistake about it. If you were waiting for the wealthy to intervene and to try and stop immigration, that isn’t going to happen — ever!\nAt this point, the immigration tap doesn’t need to only be turned off, we actually need restoration efforts to make up for the losses sustained by Canadians proper — restorative justice.\nI waited for my coffee, which was being poured by a long-time Canadian such as myself. Likely he was forced to take any job in order to continue to live in this town, like citizens in so many other small Ontario towns, which have suffered for decades as the jobs left for nations where products could be manufactured at a lower cost to create a product of poor quality to sell back to people like us.\nI reached for the newspaper rack, and ended up with a newspaper in my hand, which I have learned through the application of my critical thinking skills to distrust and despise. Yet, it was in my hand, so I read the headline, “The Future Of Ontario’s Small Towns Is Immigration.”\nI was served my coffee and I gulped it down, not paying attention to it, but rather the headline and burning my mouth and throat in the process. The pain was no comparison to the raw feeling of acid burning in my gut as I continued to read the front page newspaper story, which the low wage workers serving me would likely never even get a chance to glance at throughout their stress-full day at work.\nImagine having watched your entire community being fed a steady diet of raw potatoes and turnips for thirty years, and in order to survive you’ve swallowed it, but not because you liked it, but because you had been led to believe it was the only way to survive. And then one day you discovered that you could have been eating steak and lobster, and it was all a grand farce, because the joke was on you and the rest of the folks in your towns and communities all across the nation.\nReading that Toronto Star article, on that freezing cold morning in March, I recognized that “we” the working class had all been made complete fools, not once but again and again and again, as lie after lie was unveiled for us by grinning political shysters.\nIn case you haven’t figured it out yet, you’re not going to vote the invaders out. Immigration is not “good for the economy”. It is not “good for Americans”. It is not “good for Canadians”. It is, in fact, considerably worse for the native populations in the long term than Operation Barbarossa was for the Russians.\nAll of the 3.4 million invading Germans were expelled from Soviet territory within three years. How long will it take to expel the 80 million invaders of the USA? The frightening thing is that immigration on this scale isn’t just invasion, it is\npermanent occupation\n.",
  "tags": [
    "immigration",
    "war"
  ],
  "categories": [],
  "sitemap_lastmod": "2017-11-24T13:00:00+00:00"
}