{
  "url": "https://voxday.net/2005/05/07/blogstar-crystal-lake-observatory/",
  "scraped_at": "2026-01-08T20:02:27.478354",
  "title": "Blogstar: The Crystal Lake Observatory",
  "date_display": "May 7, 2005",
  "date_iso": "2005-05-07T11:57:00+00:00",
  "date_from_url": "2005-05-07",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p><b>The Evolution of Character</b><br>by <a href=\"http://www.livingfree23.blogspot.com/\">The Crystal Lake Observatory</a></br></p><p>A rare event it is when I – out of boredom – view a program with such vapidity as I did <i>The O’Reilly Factor</i> the other night. O’Reilly and a Catholic priest was discussing the new pope and, in their discussion, the lack of integrity and character was exalted to the highest realms for the sake of institutional survival and conformity. O’Reilly felt that Catholic doctrine needed to be changed (on such issues as contraception, for example) in order to make the Catholic church more palatable to those of us who disagree. Thank you, O Reilly, for reducing the Catholic Church to a social club where changes in policy can be made in order to draw in more members.</p><p>To some there is a seductive pull to this kind of compromise. It isn’t just an issue of liberal and moderate seminarians, clergy members, or even the laity of any church – whatever the denomination. It exists everywhere. There’s nothing wrong with changing one’s mind after sincere, internal, and rational deliberation upon discovery of some error; there is nothing wrong with conscientious hearts attempting at least to remedy that error. It is vile to change one’s position on anything for self-serving reasons or to please others. Politicians are famous for it, but the current state of things in this world has put even the church in the position of politician.</p><p>How weak we must be to bow before the storms of trial, to sell our souls in order to gain something for ourselves! It is admirable to remain true to one’s principles and despicable to abandon them. Of what worth will any of our values be if we are too afraid to keep them? How trustworthy does that make us? And if we love God, family, and our neighbours, isn’t it hypocritical to give up our mores and beliefs in order to satisfy some urge to become like everybody else? In a way, it would have been better – in a moral sense – for us to have always been selfish in both word and deed. At least, we wouldn’t be hypocrites and cheats.  Admittedly, it is difficult to remain standing in the face of harsh criticism, hard times, and persecution. The temptation to just give it up is very real. Such empathy does not absolve the compromisers as ‘faithless’, though.</p><p>O how seductive that reasoning is. It almost makes sense. The church is told to change or die. It has been said by the likes of heretic Bishop Spong and there are many, many others who say this every day. It really sounds like something the devil would say. People seem to assume that our culture will become more and more ‘liberal.’ Giving up ‘truth’ for evolution, they fall into the progressive mentality that the church will become mired in obscurity, the fringe, and then down into nothingness if it remains so fundamentalist. We are told everyday to get with the twenty-first century and conform to the greater culture, but true religion is not only to take care of the poor but also to remain unstained from this world. The narrow way is not the popular, nor is it always easy.</p><p>The days are dark and the nights are death itself. We throw away spouses because it is convenient and children because we don’t want the responsibility. We steal for utopia in the form of mandatory taxation. Morals and ethics are whatever we want them to be and isn’t it grievous? We are treacherous and live for ourselves..</p><p>and..here I am, the moralist excoriating the sins of others, the sins of this world.</p><p>Such a moral slide doesn’t just exist within the church. It is just an issue that is closest to my heart, and bothers me to no end when people in the church behave as if God’s truth is no truth.</p><p>Loyalty has always been very important and the greatest guilt I’ve felt comes when I behave treacherously. I hate betrayal in others; I hate it in myself. I’ve had to ask myself the question of what is really important in my life – everyone’s approval, convenience, or personal excellence? I guess that is up to each one of us to determine. Who or what will you serve?</p></div>",
  "content_text": "The Evolution of Character\nby\nThe Crystal Lake Observatory\nA rare event it is when I – out of boredom – view a program with such vapidity as I did\nThe O’Reilly Factor\nthe other night. O’Reilly and a Catholic priest was discussing the new pope and, in their discussion, the lack of integrity and character was exalted to the highest realms for the sake of institutional survival and conformity. O’Reilly felt that Catholic doctrine needed to be changed (on such issues as contraception, for example) in order to make the Catholic church more palatable to those of us who disagree. Thank you, O Reilly, for reducing the Catholic Church to a social club where changes in policy can be made in order to draw in more members.\nTo some there is a seductive pull to this kind of compromise. It isn’t just an issue of liberal and moderate seminarians, clergy members, or even the laity of any church – whatever the denomination. It exists everywhere. There’s nothing wrong with changing one’s mind after sincere, internal, and rational deliberation upon discovery of some error; there is nothing wrong with conscientious hearts attempting at least to remedy that error. It is vile to change one’s position on anything for self-serving reasons or to please others. Politicians are famous for it, but the current state of things in this world has put even the church in the position of politician.\nHow weak we must be to bow before the storms of trial, to sell our souls in order to gain something for ourselves! It is admirable to remain true to one’s principles and despicable to abandon them. Of what worth will any of our values be if we are too afraid to keep them? How trustworthy does that make us? And if we love God, family, and our neighbours, isn’t it hypocritical to give up our mores and beliefs in order to satisfy some urge to become like everybody else? In a way, it would have been better – in a moral sense – for us to have always been selfish in both word and deed. At least, we wouldn’t be hypocrites and cheats.  Admittedly, it is difficult to remain standing in the face of harsh criticism, hard times, and persecution. The temptation to just give it up is very real. Such empathy does not absolve the compromisers as ‘faithless’, though.\nO how seductive that reasoning is. It almost makes sense. The church is told to change or die. It has been said by the likes of heretic Bishop Spong and there are many, many others who say this every day. It really sounds like something the devil would say. People seem to assume that our culture will become more and more ‘liberal.’ Giving up ‘truth’ for evolution, they fall into the progressive mentality that the church will become mired in obscurity, the fringe, and then down into nothingness if it remains so fundamentalist. We are told everyday to get with the twenty-first century and conform to the greater culture, but true religion is not only to take care of the poor but also to remain unstained from this world. The narrow way is not the popular, nor is it always easy.\nThe days are dark and the nights are death itself. We throw away spouses because it is convenient and children because we don’t want the responsibility. We steal for utopia in the form of mandatory taxation. Morals and ethics are whatever we want them to be and isn’t it grievous? We are treacherous and live for ourselves..\nand..here I am, the moralist excoriating the sins of others, the sins of this world.\nSuch a moral slide doesn’t just exist within the church. It is just an issue that is closest to my heart, and bothers me to no end when people in the church behave as if God’s truth is no truth.\nLoyalty has always been very important and the greatest guilt I’ve felt comes when I behave treacherously. I hate betrayal in others; I hate it in myself. I’ve had to ask myself the question of what is really important in my life – everyone’s approval, convenience, or personal excellence? I guess that is up to each one of us to determine. Who or what will you serve?",
  "tags": [],
  "categories": [],
  "sitemap_lastmod": "2005-05-07T10:57:00+00:00"
}