{
  "url": "https://voxday.net/2005/05/15/blood-on-keyboard/",
  "scraped_at": "2026-01-08T20:03:54.362298",
  "title": "Blood on the keyboard",
  "date_display": "May 15, 2005",
  "date_iso": "2005-05-15T14:47:00+00:00",
  "date_from_url": "2005-05-15",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>The London Times demonstrates how Michael Isikoff of Newsweek incited Muslims to riots and murder:</p><blockquote><p>Newsweek sparks global riots with one paragraph on Koran: Claim that the Holy book was defiled by US guards at Guantanamo Bay has incensed Muslims</p><p>AT LEAST nine people were killed yesterday as a wave of anti-American demonstrations swept the Islamic world from the Gaza Strip to the Java Sea, sparked by a single paragraph in a magazine alleging that US military interrogators had desecrated the Koran.</p></blockquote><p>Powerline explains how, to top it all off, <a href=\"http://powerlineblog.com/archives/010465.php\">Isikoff got his facts wrong</a>.  “So Isikoff relied on a telephone call with an anonymous government official paraphrasing a forthcoming report, confirmed by placing a draft of the Periscope item before another anonymous government official. Isikoff never saw the underlying report or even had it read to him.”</p><p>Nice work, Michael.  Hope you sleep well tonight.</p><p>Did he intend it?  I can’t imagine so.  But what sort of moron doesn’t realize that this sort of thing is bound to happen?  Now, if the reported event had been true, the subsequent riots would be merely the usual tragic stupidity common in that part of the world.  Isikoff’s decision to risk inspiring this level of violence over something that may never have happened is irresponsibility of a shocking degree.</p></div>",
  "content_text": "The London Times demonstrates how Michael Isikoff of Newsweek incited Muslims to riots and murder:\nNewsweek sparks global riots with one paragraph on Koran: Claim that the Holy book was defiled by US guards at Guantanamo Bay has incensed Muslims\nAT LEAST nine people were killed yesterday as a wave of anti-American demonstrations swept the Islamic world from the Gaza Strip to the Java Sea, sparked by a single paragraph in a magazine alleging that US military interrogators had desecrated the Koran.\nPowerline explains how, to top it all off,\nIsikoff got his facts wrong\n.  “So Isikoff relied on a telephone call with an anonymous government official paraphrasing a forthcoming report, confirmed by placing a draft of the Periscope item before another anonymous government official. Isikoff never saw the underlying report or even had it read to him.”\nNice work, Michael.  Hope you sleep well tonight.\nDid he intend it?  I can’t imagine so.  But what sort of moron doesn’t realize that this sort of thing is bound to happen?  Now, if the reported event had been true, the subsequent riots would be merely the usual tragic stupidity common in that part of the world.  Isikoff’s decision to risk inspiring this level of violence over something that may never have happened is irresponsibility of a shocking degree.",
  "tags": [],
  "categories": [],
  "sitemap_lastmod": "2005-05-15T13:47:00+00:00"
}