{
  "url": "https://voxday.net/2005/05/11/book-review-old-mans-war-by-john/",
  "scraped_at": "2026-01-08T20:03:08.300702",
  "title": "Book Review: Old Man’s War by John Scalzi",
  "date_display": "May 11, 2005",
  "date_iso": "2005-05-11T07:47:00+00:00",
  "date_from_url": "2005-05-11",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p><a href=\"http://www.amazon.com/exec/obidos/tg/detail/-/0765309408/qid=1115801631/sr=8-1/ref=pd_csp_1/104-5297987-8347162?v=glance&amp;s=books&amp;n=507846\">OLD MAN’S WAR</a><br>by John Scalzi<br>Tor Books<br>Rating: 7 of 10</br></br></br></p><p>Style: 4 stars<br>Story: 3 stars<br>Characters: 2 stars<br>Creativity: 4 stars</br></br></br></p><p>Those of you who remember the Electrolite affair, wherein a small horde of science fiction and fantasy writers discovered, to their horror, that not everyone in the SFWA is in sync with their androgynous vision of humanity, may recall Mr. Scalzi as one of my foremost critics at the time.  Unlike many of his socially maladjusted peers, however, Mr. Scalzi is capable of distinguishing between an opposing point of view and the individual who holds it and we engaged in a friendly post-contretemps exchange of emails in which I volunteered to review his latest novel, OLD MAN’S WAR.</p><p>Having recently re-read GLORY ROAD and HAVE SPACE SUIT WILL TRAVEL, I can state with some delight that Mr. Scalzi is as close to resurrecting Robert Heinlein as we are likely to enjoy without serious advances in the black art of necromancy.  OLD MAN’S WAR is both stylistically and thematically informed by Heinlein, especially STARSHIP TROOPERS, but manages to be so without being a thinly disguised ripoff.  In this book, Scalzi wisely dispenses (for the most part) with the usual authorly fixation on Making A Point, instead focusing on enthusiastically telling a military adventure tale that entertains the reader.  There are one or two twists that come as a genuine surprise, and when he does mix a little sentiment into the melange, he does so rather deftly, in a manner that enhances the adventure tale instead of detracting from it.</p><p><b>Style</b>:  Definite points for managing to pull off the forthright Heileinesque prose, which so many have attempted and failed.  Scalzi is a straightforward writer and his strength is descriptive simplicity.  There are a few rough spots in the early going – for example, Scalzi is unable to resist the all-too-typical dialogue where an unbeliever lectures the crude caricature of a believer using his superior knowledge of the Bible – but he quickly settles into a groove and lets the reader relax and get carried away by the story.</p><p><b>Story</b>:  Space opera, to a certain extent, but good space opera.  Or perhaps space infantry opera would be a better term.  Scalzi wisely eschews long and boring descriptions of how every piece of technology works in favor of moving the story along.  And the story is a good one, revolving around the idea that technological advances now allow old and decrepit individuals over the age of 70 to be rejuvenated, albeit at the cost of joining Earth’s galactic infantry.  Given this unique blend of Golden Age feel and geriatric plot, one might call it the first “rejuvenile” novel.  Nicely plotted and with plenty of action, OLD MAN’S WAR is in some ways more coherent than its classic predecessor, STARSHIP TROOPERS.</p><p><b>Characters:</b>:  This is probably the weakest link of the book.  While Scalzi makes some effort to provide motivations for his characters, only the protagonist and, ironically, a character who knows next to nothing of herself, come across in full-color.  The crude bigot who gets his, the delightful gay man, the crusty drill sergeant, the overenthusiastic fool and the sexually uninhibited beautiful women are all oft-seen staples of SF fiction and they’re simply plugged in as required here.  That being said, they’re no more cardboard than one sees in most novels today and they serve their purposes well.</p><p><b>Creativity:</b>:  It is very hard to come up with a new spin on anything these days.  Scalzi does so and he does it with that effortless ease that causes one to shake one’s head and marvel that no one had thought of it before.  His plot twists are also well-conceived and based on a logical extension of the technological innovations around which he’s built his story.  This isn’t the mind-blowing originality of Stross here, but in my opinion, it’s nearly as hard to come up with a genuinely new twist on a classic tale as it is to simply throw all the rules out and start from scratch.</p><p><b>Text Sample:</b><em> Dr. Russell smiled. “Mr. Perry, when you signed up to join the army, you thought we’d make you young again, right?”</em></p><p>“Yes,” I said. “Everybody does. You can’t fight a war with old people, yet you recruit them. You have to have some way to make them young again.”</p><p>“How do you think we do it?” Dr. Russell asked.</p><p>“I don’t know,” I said. “Gene therapy. Cloned replacement parts. You’d swap out old parts somehow and put in new ones.”</p><p>“You’re half right,” Dr. Russell said. “We do use gene therapy and cloned replacements. But we don’t ‘swap out’ anything, except you.”</p><p>“I don’t understand,” I said. I felt very cold, like reality was being tugged out from under my feet.</p><p>“Your body is old, Mr. Perry. It’s old and it won’t work for much longer. There’s no point in trying to save it or upgrade it. It’s not something that gains value when it ages or has replaceable parts that keep it running like new. All a human body does when it gets older is get old. So we’re going to get rid of it. We’re getting rid of it all. The only part of you that we’re going to save is the only part of you that hasn’t decayed — your mind, your consciousness, your sense of self. “</p><p>Dr. Russell walked over to the far door, where the Colonials had exited, and rapped on it. Then he turned back to me. “Take a good look at your body, Mr. Perry,” he said. “Because you’re about to say goodbye to it. You’re going somewhere else.”</p><p>“Where am I going, Dr. Russell?” I asked. I could barely make enough spit to talk.</p><p>“You’re going here,” he said, and opened the door.</p><p>From the other side, the Colonials came back in. One of them was pushing a wheelchair with someone in it. I craned my head to take a look. And I began to shake.</p><p>It was me.</p><p>Fifty years ago.<br/></p><p><em>Note: this is not part of the review, but I would be remiss if I failed to note my great personal amusement that my accusation of Mr. Scalzi’s apparent rectal fixation during the Electrolite dustup appears to have been well-founded as it is rather strongly supported by the text of this novel.</em></p></div>",
  "content_text": "OLD MAN’S WAR\nby John Scalzi\nTor Books\nRating: 7 of 10\nStyle: 4 stars\nStory: 3 stars\nCharacters: 2 stars\nCreativity: 4 stars\nThose of you who remember the Electrolite affair, wherein a small horde of science fiction and fantasy writers discovered, to their horror, that not everyone in the SFWA is in sync with their androgynous vision of humanity, may recall Mr. Scalzi as one of my foremost critics at the time.  Unlike many of his socially maladjusted peers, however, Mr. Scalzi is capable of distinguishing between an opposing point of view and the individual who holds it and we engaged in a friendly post-contretemps exchange of emails in which I volunteered to review his latest novel, OLD MAN’S WAR.\nHaving recently re-read GLORY ROAD and HAVE SPACE SUIT WILL TRAVEL, I can state with some delight that Mr. Scalzi is as close to resurrecting Robert Heinlein as we are likely to enjoy without serious advances in the black art of necromancy.  OLD MAN’S WAR is both stylistically and thematically informed by Heinlein, especially STARSHIP TROOPERS, but manages to be so without being a thinly disguised ripoff.  In this book, Scalzi wisely dispenses (for the most part) with the usual authorly fixation on Making A Point, instead focusing on enthusiastically telling a military adventure tale that entertains the reader.  There are one or two twists that come as a genuine surprise, and when he does mix a little sentiment into the melange, he does so rather deftly, in a manner that enhances the adventure tale instead of detracting from it.\nStyle\n:  Definite points for managing to pull off the forthright Heileinesque prose, which so many have attempted and failed.  Scalzi is a straightforward writer and his strength is descriptive simplicity.  There are a few rough spots in the early going – for example, Scalzi is unable to resist the all-too-typical dialogue where an unbeliever lectures the crude caricature of a believer using his superior knowledge of the Bible – but he quickly settles into a groove and lets the reader relax and get carried away by the story.\nStory\n:  Space opera, to a certain extent, but good space opera.  Or perhaps space infantry opera would be a better term.  Scalzi wisely eschews long and boring descriptions of how every piece of technology works in favor of moving the story along.  And the story is a good one, revolving around the idea that technological advances now allow old and decrepit individuals over the age of 70 to be rejuvenated, albeit at the cost of joining Earth’s galactic infantry.  Given this unique blend of Golden Age feel and geriatric plot, one might call it the first “rejuvenile” novel.  Nicely plotted and with plenty of action, OLD MAN’S WAR is in some ways more coherent than its classic predecessor, STARSHIP TROOPERS.\nCharacters:\n:  This is probably the weakest link of the book.  While Scalzi makes some effort to provide motivations for his characters, only the protagonist and, ironically, a character who knows next to nothing of herself, come across in full-color.  The crude bigot who gets his, the delightful gay man, the crusty drill sergeant, the overenthusiastic fool and the sexually uninhibited beautiful women are all oft-seen staples of SF fiction and they’re simply plugged in as required here.  That being said, they’re no more cardboard than one sees in most novels today and they serve their purposes well.\nCreativity:\n:  It is very hard to come up with a new spin on anything these days.  Scalzi does so and he does it with that effortless ease that causes one to shake one’s head and marvel that no one had thought of it before.  His plot twists are also well-conceived and based on a logical extension of the technological innovations around which he’s built his story.  This isn’t the mind-blowing originality of Stross here, but in my opinion, it’s nearly as hard to come up with a genuinely new twist on a classic tale as it is to simply throw all the rules out and start from scratch.\nText Sample:\nDr. Russell smiled. “Mr. Perry, when you signed up to join the army, you thought we’d make you young again, right?”\n“Yes,” I said. “Everybody does. You can’t fight a war with old people, yet you recruit them. You have to have some way to make them young again.”\n“How do you think we do it?” Dr. Russell asked.\n“I don’t know,” I said. “Gene therapy. Cloned replacement parts. You’d swap out old parts somehow and put in new ones.”\n“You’re half right,” Dr. Russell said. “We do use gene therapy and cloned replacements. But we don’t ‘swap out’ anything, except you.”\n“I don’t understand,” I said. I felt very cold, like reality was being tugged out from under my feet.\n“Your body is old, Mr. Perry. It’s old and it won’t work for much longer. There’s no point in trying to save it or upgrade it. It’s not something that gains value when it ages or has replaceable parts that keep it running like new. All a human body does when it gets older is get old. So we’re going to get rid of it. We’re getting rid of it all. The only part of you that we’re going to save is the only part of you that hasn’t decayed — your mind, your consciousness, your sense of self. “\nDr. Russell walked over to the far door, where the Colonials had exited, and rapped on it. Then he turned back to me. “Take a good look at your body, Mr. Perry,” he said. “Because you’re about to say goodbye to it. You’re going somewhere else.”\n“Where am I going, Dr. Russell?” I asked. I could barely make enough spit to talk.\n“You’re going here,” he said, and opened the door.\nFrom the other side, the Colonials came back in. One of them was pushing a wheelchair with someone in it. I craned my head to take a look. And I began to shake.\nIt was me.\nFifty years ago.\nNote: this is not part of the review, but I would be remiss if I failed to note my great personal amusement that my accusation of Mr. Scalzi’s apparent rectal fixation during the Electrolite dustup appears to have been well-founded as it is rather strongly supported by the text of this novel.",
  "tags": [],
  "categories": [],
  "sitemap_lastmod": "2005-05-11T06:47:00+00:00"
}