{
  "url": "https://voxday.net/2005/05/20/convenient-discovery/",
  "scraped_at": "2026-01-08T20:04:22.098506",
  "title": "A convenient discovery",
  "date_display": "May 20, 2005",
  "date_iso": "2005-05-20T08:41:00+00:00",
  "date_from_url": "2005-05-20",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>Thomas Friedman writes in the NYT:</p><blockquote><p>I don’t understand a concept of the sacred that says a book is more sacred than a human life. A holy book, whether the Bible or the Koran, is only holy to the extent that it shapes human life and behavior.</p><p>“Look, Newsweek may have violated journalistic rules, but what jihadist terrorists are doing in Iraq and Afghanistan – blowing up innocent Muslims struggling to build an alternative society to dictatorship – surely destroys the Koran. They are the real enemies of Islam because they are depriving Muslims of a better future. From what I know of Islam, it teaches that you show reverence to God by showing reverence for his creations, not just his words. Why don’t your spiritual leaders say that? I am asking, because I want to know.”</p></blockquote><p><em>Santo cielo!</em> I know that I’ve stated many times that journalists are astoundingly ignorant, but Thomas Friedman is someone whose book, FROM BEIRUT TO JERUSALEM, I read in high school as a uniquely well-informed description of the Middle East.  A book is holy to the extent that it accurately reflects the Word of God, not how it shapes human life and behavior.  By Friedman’s bizarre definition, Star Wars is holy because it gets people to line up in front of empty theatres for weeks in advance, to say nothing of its effect on the language.</p><p>Second, the reason that Muslim spiritual leaders are not saying that Muslims should show reverence to God by showing reverence to His creation is because this statement has nothing to do with Islam.  The fact that Thomas Friedman has made a religion of his humanism does not mean that humanism is an inherent part of any historical religion.</p><p>I find it very telling that after decades of repeatedly excusing “the rage of the Arab street”, the legacy media has finally deigned to notice the hair-trigger, nonsensical nature of Muslim violence now that the alternative would be placing the blame for the riots on Newsweek.</p></div>",
  "content_text": "Thomas Friedman writes in the NYT:\nI don’t understand a concept of the sacred that says a book is more sacred than a human life. A holy book, whether the Bible or the Koran, is only holy to the extent that it shapes human life and behavior.\n“Look, Newsweek may have violated journalistic rules, but what jihadist terrorists are doing in Iraq and Afghanistan – blowing up innocent Muslims struggling to build an alternative society to dictatorship – surely destroys the Koran. They are the real enemies of Islam because they are depriving Muslims of a better future. From what I know of Islam, it teaches that you show reverence to God by showing reverence for his creations, not just his words. Why don’t your spiritual leaders say that? I am asking, because I want to know.”\nSanto cielo!\nI know that I’ve stated many times that journalists are astoundingly ignorant, but Thomas Friedman is someone whose book, FROM BEIRUT TO JERUSALEM, I read in high school as a uniquely well-informed description of the Middle East.  A book is holy to the extent that it accurately reflects the Word of God, not how it shapes human life and behavior.  By Friedman’s bizarre definition, Star Wars is holy because it gets people to line up in front of empty theatres for weeks in advance, to say nothing of its effect on the language.\nSecond, the reason that Muslim spiritual leaders are not saying that Muslims should show reverence to God by showing reverence to His creation is because this statement has nothing to do with Islam.  The fact that Thomas Friedman has made a religion of his humanism does not mean that humanism is an inherent part of any historical religion.\nI find it very telling that after decades of repeatedly excusing “the rage of the Arab street”, the legacy media has finally deigned to notice the hair-trigger, nonsensical nature of Muslim violence now that the alternative would be placing the blame for the riots on Newsweek.",
  "tags": [],
  "categories": [],
  "sitemap_lastmod": "2005-05-20T07:41:00+00:00"
}