{
  "url": "https://voxday.net/2005/05/13/hitler-and-christianity/",
  "scraped_at": "2026-01-08T20:03:37.815443",
  "title": "Hitler and Christianity",
  "date_display": "May 13, 2005",
  "date_iso": "2005-05-13T20:25:00+00:00",
  "date_from_url": "2005-05-13",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>The 30-point program for the National Reich Church, drawn up by the Fuehrer’s Delegate for the Entire Intellectual and Philosophical Education and Instruction for the National Socialist Party:</p><blockquote><p>First.  The National Reich’s Church of Germany (hereinafter called the N.R. and represented in this telegram by the symbol “N”.Categorically claims the exclusive right and the exclusive power to control all churches within the borders of the Reich; it declares these to be national churches of the German Reich.</p><p>Second. The German people must not serve the N. The N is absolutely and exclusively in the service of but one doctrine: race and nation.</p><p>Third. The field of activity of the N will expand to the limits of Germany’s territorial and colonial possessions.</p><p>Fourth. The N does not force any German to seek membership therein. The N will do everything within its power to secure the adherence of every German soul. Other churches or similar communities and unions particularly such as are under international control or management cannot and shall not be tolerated in Germany.</p><p>Fifth. The N is determined to exterminate irrevocably and by every means the strange and foreign christian faiths imported into Germany in the illomened year 800.</p><p>Sixth. The existing churches may not be architecturally altered, as they represent the property of the German nation, German culture and to a certain extent the historical development of the nation. As property of the German nation they are not only to be valued but to be preserved.</p><p>Seventh. The N has no scribes, pastors, chaplains or priests but National Reich orators are to speak in them.</p><p>Eighth. The N services are held only in the evening and not in the morning. These services are to take place on Saturday’s with solemn illumination.</p><p>Ninth. In the N German men and women, German youths and girls will acknowledge God and his eternal works</p><p>Tenth. The N irrevocably strives for complete union with the state. It must obey the state as one of its servants. As such it demands that all landed possessions of all churches and religious denominations be handed over to the state. It forbids that in<br>future churches should secure ownership of even the smallest piece of German soil or that such be ever given back to them. Not the churches conquer and cultivate land and soil but exclusively the German nation, the German state.</br></p><p>Eleventh. N orators may never be those who today emphasize with all tricks and cunning verbally and in writing the necessity of maintaining and teaching of christianity in Germany; they not only lie to themselves but also the German nation goaded by their love of the positions they hold and the sweet bread they eat.</p><p>Twelfth. N orators hold office, government officials under Civil Service rules.</p><p>Thirteenth. The N demands immediate cessation of the publishing and dissemination of the Bible in Germany as well as the publication of Sunday papers, pamphlets, publications and books or religious nature.</p><p>Fourteenth. The N has to take severe measures in order to prevent the Bible and other christian publications being imported into Germany.</p><p>Fifteenth. The N declares that to it, and therefore to the German nation, it has been decided Fuhrer’s “Mein Kampf” is the greatest of all documents. It is conscious that this book contains not only the greatest, and that it embodies the purest and truest ethics for the present and future life of our nation.</p><p>Sixteenth. The N has made it its sacred duty to use all its energy to popularize the coeternal “Mein Kampf” and to let every German live and complete his life according to this book.</p><p>Seventeenth. The N demands that further editions of this book, whatever form they may take, be in content and pagination exactly similar to the present popular edition.</p><p>Eighteenth. The N will clear away from its altars all crucifix plural Bibles and pictures of Saints.</p><p>Nineteenth. On the altars there must be nothing but “Mein Kampf”, to the German nation and therefore to God the most sacred book and to the left of the altar a sword.</p><p>Twentieth. The N speakers must during N services propound this book to the congregation to the best of their knowledge and ability.</p><p>Twenty-first. The N does not acknowledge forgiveness of sins. It represents the standpoint which it will always proclaim that a sin once committed will be ruthlessly punished by the honorable and indestructible laws of nature and punishment will follow during the sinner’s lifetime.</p><p>Twenty-second. The N repudiates the christening of German children particularly the christening with water and the Holy Ghost.</p><p>Twenty-third. The parents of a child (or if a new born child) must only take the German oath before the altar which is worded as follows:  The man: “In the name of God I take this Holy oath that I the father of this child, and my wife, are of proven Aryan descent. As a father I agree to bring up this child in the German spirit and as a member of the German race”.  The women: “In the name of God I take this Holy oath that I (name) bore my husband a child and that I its mother am of proven Aryan descent. As a  mother I swear to bring up this child in the German<br>spirit and as a member of the German race”. The German diploma can only be issued to newly born children on the strength of the German oath.</br></p><p>Twenty-fourth. The N abolishes confirmation and religious education as well as the communion the religious preparation for the communion. The educational institutions are and remain the family, the schools, the German youth, the Hitler youth, and the Union of German girls.</p><p>Twenty-fifth. In order that school graduation of our German youth be given an especially solemn character all N must put themselves at the disposal of German youth, the Hitler youth and the Union of German girls on the day of the state’s youth which will be on the Friday before Easter. On this day the leaders of these organizations exclusively may speak</p><p>Twenty-six. The marriage ceremony of German men and women will consist of taking an oath of faithfulness and placing the right hand on the sword. There will not be any unworthy kneeling in N ceremonies.</p><p>Twenty-seven. The N declares the tenth day before Whit Sunday to be the national holiday of the German family.</p><p>Twenty-eight. The N rejects the customary day of prayer and atonement. It demands that this be transferred to the holiday commemorating the laying of the foundation stone of the N.</p><p>Twenty-nine. The N will not tolerate the establishment of any new clerical religious insignia.</p><p>Thirty. On the day of its foundation the Christian cross must be removed from all churches, cathedrals and chapels within the Reich and its colonies and it must be superseded by the only unconquerable symbol of Germany the “Haken Krevz”.</p></blockquote><p>Of course, against all this is a few quotes intended for public consumption by a Christian nation – Howard Dean and his favorite book from the New Testament, Job, springs to mind – and the fact that Hitler was an altar boy.</p><p>I’m just wondering how many atheists who are <a href=\"http://www.vanguardnewsnetwork.com/lettersOct-Nov03/30704westphaliabookrev.htm\">desperate to prove that Hitler was all but a Bible-thumping Southern Baptist</a> would qualify as Christians themselves by that reckoning.  Did your parents baptize you as a child?  Did you get confirmed?  Well, forget what you believe now, obviously you, too, are a Christian and all of your future acts as an adult are to be completely defined by your childhood upbringing.</p><p>Positive Christianity was included in the National Socialist program, of course, but it’s worth remembering that <em>the adjective modifies the noun</em>.  In this case, the above document demonstrates how the adjective modifies the noun to such an<br> extent as to create an entirely different religion.</br></p><p>The Antichrist, too, will claim to be Christian.  And as is too often the case with Hitler and his party, only Christians will know better.</p></div>",
  "content_text": "The 30-point program for the National Reich Church, drawn up by the Fuehrer’s Delegate for the Entire Intellectual and Philosophical Education and Instruction for the National Socialist Party:\nFirst.  The National Reich’s Church of Germany (hereinafter called the N.R. and represented in this telegram by the symbol “N”.Categorically claims the exclusive right and the exclusive power to control all churches within the borders of the Reich; it declares these to be national churches of the German Reich.\nSecond. The German people must not serve the N. The N is absolutely and exclusively in the service of but one doctrine: race and nation.\nThird. The field of activity of the N will expand to the limits of Germany’s territorial and colonial possessions.\nFourth. The N does not force any German to seek membership therein. The N will do everything within its power to secure the adherence of every German soul. Other churches or similar communities and unions particularly such as are under international control or management cannot and shall not be tolerated in Germany.\nFifth. The N is determined to exterminate irrevocably and by every means the strange and foreign christian faiths imported into Germany in the illomened year 800.\nSixth. The existing churches may not be architecturally altered, as they represent the property of the German nation, German culture and to a certain extent the historical development of the nation. As property of the German nation they are not only to be valued but to be preserved.\nSeventh. The N has no scribes, pastors, chaplains or priests but National Reich orators are to speak in them.\nEighth. The N services are held only in the evening and not in the morning. These services are to take place on Saturday’s with solemn illumination.\nNinth. In the N German men and women, German youths and girls will acknowledge God and his eternal works\nTenth. The N irrevocably strives for complete union with the state. It must obey the state as one of its servants. As such it demands that all landed possessions of all churches and religious denominations be handed over to the state. It forbids that in\nfuture churches should secure ownership of even the smallest piece of German soil or that such be ever given back to them. Not the churches conquer and cultivate land and soil but exclusively the German nation, the German state.\nEleventh. N orators may never be those who today emphasize with all tricks and cunning verbally and in writing the necessity of maintaining and teaching of christianity in Germany; they not only lie to themselves but also the German nation goaded by their love of the positions they hold and the sweet bread they eat.\nTwelfth. N orators hold office, government officials under Civil Service rules.\nThirteenth. The N demands immediate cessation of the publishing and dissemination of the Bible in Germany as well as the publication of Sunday papers, pamphlets, publications and books or religious nature.\nFourteenth. The N has to take severe measures in order to prevent the Bible and other christian publications being imported into Germany.\nFifteenth. The N declares that to it, and therefore to the German nation, it has been decided Fuhrer’s “Mein Kampf” is the greatest of all documents. It is conscious that this book contains not only the greatest, and that it embodies the purest and truest ethics for the present and future life of our nation.\nSixteenth. The N has made it its sacred duty to use all its energy to popularize the coeternal “Mein Kampf” and to let every German live and complete his life according to this book.\nSeventeenth. The N demands that further editions of this book, whatever form they may take, be in content and pagination exactly similar to the present popular edition.\nEighteenth. The N will clear away from its altars all crucifix plural Bibles and pictures of Saints.\nNineteenth. On the altars there must be nothing but “Mein Kampf”, to the German nation and therefore to God the most sacred book and to the left of the altar a sword.\nTwentieth. The N speakers must during N services propound this book to the congregation to the best of their knowledge and ability.\nTwenty-first. The N does not acknowledge forgiveness of sins. It represents the standpoint which it will always proclaim that a sin once committed will be ruthlessly punished by the honorable and indestructible laws of nature and punishment will follow during the sinner’s lifetime.\nTwenty-second. The N repudiates the christening of German children particularly the christening with water and the Holy Ghost.\nTwenty-third. The parents of a child (or if a new born child) must only take the German oath before the altar which is worded as follows:  The man: “In the name of God I take this Holy oath that I the father of this child, and my wife, are of proven Aryan descent. As a father I agree to bring up this child in the German spirit and as a member of the German race”.  The women: “In the name of God I take this Holy oath that I (name) bore my husband a child and that I its mother am of proven Aryan descent. As a  mother I swear to bring up this child in the German\nspirit and as a member of the German race”. The German diploma can only be issued to newly born children on the strength of the German oath.\nTwenty-fourth. The N abolishes confirmation and religious education as well as the communion the religious preparation for the communion. The educational institutions are and remain the family, the schools, the German youth, the Hitler youth, and the Union of German girls.\nTwenty-fifth. In order that school graduation of our German youth be given an especially solemn character all N must put themselves at the disposal of German youth, the Hitler youth and the Union of German girls on the day of the state’s youth which will be on the Friday before Easter. On this day the leaders of these organizations exclusively may speak\nTwenty-six. The marriage ceremony of German men and women will consist of taking an oath of faithfulness and placing the right hand on the sword. There will not be any unworthy kneeling in N ceremonies.\nTwenty-seven. The N declares the tenth day before Whit Sunday to be the national holiday of the German family.\nTwenty-eight. The N rejects the customary day of prayer and atonement. It demands that this be transferred to the holiday commemorating the laying of the foundation stone of the N.\nTwenty-nine. The N will not tolerate the establishment of any new clerical religious insignia.\nThirty. On the day of its foundation the Christian cross must be removed from all churches, cathedrals and chapels within the Reich and its colonies and it must be superseded by the only unconquerable symbol of Germany the “Haken Krevz”.\nOf course, against all this is a few quotes intended for public consumption by a Christian nation – Howard Dean and his favorite book from the New Testament, Job, springs to mind – and the fact that Hitler was an altar boy.\nI’m just wondering how many atheists who are\ndesperate to prove that Hitler was all but a Bible-thumping Southern Baptist\nwould qualify as Christians themselves by that reckoning.  Did your parents baptize you as a child?  Did you get confirmed?  Well, forget what you believe now, obviously you, too, are a Christian and all of your future acts as an adult are to be completely defined by your childhood upbringing.\nPositive Christianity was included in the National Socialist program, of course, but it’s worth remembering that\nthe adjective modifies the noun\n.  In this case, the above document demonstrates how the adjective modifies the noun to such an\nextent as to create an entirely different religion.\nThe Antichrist, too, will claim to be Christian.  And as is too often the case with Hitler and his party, only Christians will know better.",
  "tags": [],
  "categories": [],
  "sitemap_lastmod": "2005-05-13T19:25:00+00:00"
}