{
  "url": "https://voxday.net/2005/05/03/impressively-dumb/",
  "scraped_at": "2026-01-08T20:02:01.930592",
  "title": "Impressively dumb",
  "date_display": "May 3, 2005",
  "date_iso": "2005-05-03T17:12:00+00:00",
  "date_from_url": "2005-05-03",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><blockquote><p>Browns tight end Kellen Winslow Jr. sustained injuries after being thrown from his motorcycle at a speed approximating 35 mph on Sunday night. Winslow will remain in the Cleveland Clinic for an indefinite period until swelling in his right shoulder and right knee is reduced and further evaluation can be completed, according to a club statement. Bill Bonsiewicz, Browns VP of communications, said he was unaware if Winslow underwent surgery or if surgery would be needed. Bonsiewicz declined to characterize Winslow’s playing status for the 2005 season. <br>— Cleveland Plain Dealer</br></p><p>The NFL Network reported Winslow’s contract contains wording that forbids him to ride a motorcycle. If Winslow breached the contract he may have to repay part or all of his $6 million signing bonus and $4.4 million option. <br>— Akron Beacon Journal</br></p></blockquote><p>So much for the Browns savior-in-waiting.  If I were Cleveland’s head coach, I’d be tempted to use this as an excuse to simply drop the guy, or at least trade him.  Talent doesn’t do you much good when you’re a bonehead of this caliber.  Randy Moss may be annoying and he may not play every play, but at least he manages to get on the field every now and then.</p></div>",
  "content_text": "Browns tight end Kellen Winslow Jr. sustained injuries after being thrown from his motorcycle at a speed approximating 35 mph on Sunday night. Winslow will remain in the Cleveland Clinic for an indefinite period until swelling in his right shoulder and right knee is reduced and further evaluation can be completed, according to a club statement. Bill Bonsiewicz, Browns VP of communications, said he was unaware if Winslow underwent surgery or if surgery would be needed. Bonsiewicz declined to characterize Winslow’s playing status for the 2005 season.\n— Cleveland Plain Dealer\nThe NFL Network reported Winslow’s contract contains wording that forbids him to ride a motorcycle. If Winslow breached the contract he may have to repay part or all of his $6 million signing bonus and $4.4 million option.\n— Akron Beacon Journal\nSo much for the Browns savior-in-waiting.  If I were Cleveland’s head coach, I’d be tempted to use this as an excuse to simply drop the guy, or at least trade him.  Talent doesn’t do you much good when you’re a bonehead of this caliber.  Randy Moss may be annoying and he may not play every play, but at least he manages to get on the field every now and then.",
  "tags": [],
  "categories": [],
  "sitemap_lastmod": "2005-05-03T16:12:00+00:00"
}