{
  "url": "https://voxday.net/2005/05/10/mailvox-vox-gets-chastised-by-prophets/",
  "scraped_at": "2026-01-08T20:03:00.821317",
  "title": "Mailvox: Vox gets chastised by the prophets",
  "date_display": "May 10, 2005",
  "date_iso": "2005-05-10T14:41:00+00:00",
  "date_from_url": "2005-05-10",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>BR informs me of a few Bush-related prophecies:</p><blockquote><p>Anyhow, what God said through Kenneth Copeland is that 2004 was the Year of Fullness and the year 2005 is the Year of Overflow.  Us Christians are going to get our rewards and the sinners also reached the Year of Fullness for their sins and then they are going to be punished for their sins.  God was going to punish those who did not vote for George Bush, so it is very possible God spoke to the preacher and he kicked out the people who did not vote for President Bush.  God said His Children would listen to Him and vote for the person He picked and He picked George Bush.  If you didn’t hear that, then you aren’t listening to God.  There is something missing in your walk with Jesus and I tried to tell you about that, before.</p></blockquote><p>It’s true, I didn’t vote for George Bush.  How can I argue with that?  I’m not surprised that something is missing, I guess I’m just kind of surprised it turns out to be that.  I’m afraid haven’t been reading my Bible very much either, but what is that compared to turning my back on God’s chosen leader?</p><blockquote><p>“The Spirit of the Lord says Now that you have put the man that I have chosen into the White House… and you did… I will send you an unusual fire. I will send you an unusual rain. I will send you an unusual measure of My Spirit says the Lord… <br>…For you have raised up a gatekeeper over this Nation, George W. Bush. Though many do not agree with the way he is, I raised him up to pray. I raised him up to open up the gates of righteousness. I raised him up that he may open the floodgates, that heaven may bring forth a blessing upon this Nation. <br>Fallujah, there is a battle that will come to a swift end. For God will honor His President and give a swift victory in Fallujah. For as Arafat slips into eternity, I’m raising up a new generation that shall bring a short period of peace. And that short period of peace will give me access into the land that they call holy. Watch me, for the great victory that shall come before January in Fallujah and the regions surrounding Iraq, you will see it and they will not believe it. They will say it’s impossible, it’s impossible, but God says how can it be impossible when you have elected a gatekeeper that shall watch over this Nation with prayer and with praise? That’s why you shall be honored – Fallujah!”</br></br></p></blockquote><p>I don’t really recall that Fallujah was ever in doubt.  I mean, on the one hand, we had the most feared fighting force since the Waffen-SS with armor support and air supremacy, on the other, a few barely trained guerilla fighters armed with AK-47s and old Russian rocket launchers.  But perhaps I simply failed to note its significance and the Creasy estate will soon be releasing 16 DECISIVE BATTLES OF THE WORLD, with Fallujah taking its rightful place beside Marathon, Arbela, Hastings and Waterloo.</p><blockquote><p>(Dated 2/11/2005) The Spirit of God told me to tell you “He will root out and pluck out the corruption that exists in high places in the politics of this Nation. And every accusation that comes against the President, an accusation that is not warranted, that is not of the Spirit, that arises, I will expose two that are corrupt within the political system, pluck them out, expose them, take their clothes off so that they are naked before the people. For this shall not continue in this Nation. For I have raised this Nation up as a righteous Nation. I am raising up Daniels in Washington, D.C. Daniels that will explain to the King how he should act and how he should live. I want you to know that Daniels are being raised up in the schools and in the Universities. Watch, in the next three months for the corruptions that are going to be exposed and every accusation that rises against those that are placed in high places, there will be two that I will undress. There will be two that I’ll expose and I will clean the house so that righteousness will prevail in this Nation, says the Lord.”</p></blockquote><p>Tom DeLay?  Although if someone is getting undressed, you have to assume that either a Clinton or a Kennedy is involved.  In any case, I suppose shouldn’t express my doubts about the veracity of this last prophecy.  There’s still one more day before the three months are up.</p><p>The thing that always makes me wonder about this sort of thing is this.  If God picked George Bush, then didn’t he pick Bill Clinton too?  I don’t seem to recall a lot of conservative Christians beating on that drum six years ago.</p></div>",
  "content_text": "BR informs me of a few Bush-related prophecies:\nAnyhow, what God said through Kenneth Copeland is that 2004 was the Year of Fullness and the year 2005 is the Year of Overflow.  Us Christians are going to get our rewards and the sinners also reached the Year of Fullness for their sins and then they are going to be punished for their sins.  God was going to punish those who did not vote for George Bush, so it is very possible God spoke to the preacher and he kicked out the people who did not vote for President Bush.  God said His Children would listen to Him and vote for the person He picked and He picked George Bush.  If you didn’t hear that, then you aren’t listening to God.  There is something missing in your walk with Jesus and I tried to tell you about that, before.\nIt’s true, I didn’t vote for George Bush.  How can I argue with that?  I’m not surprised that something is missing, I guess I’m just kind of surprised it turns out to be that.  I’m afraid haven’t been reading my Bible very much either, but what is that compared to turning my back on God’s chosen leader?\n“The Spirit of the Lord says Now that you have put the man that I have chosen into the White House… and you did… I will send you an unusual fire. I will send you an unusual rain. I will send you an unusual measure of My Spirit says the Lord…\n…For you have raised up a gatekeeper over this Nation, George W. Bush. Though many do not agree with the way he is, I raised him up to pray. I raised him up to open up the gates of righteousness. I raised him up that he may open the floodgates, that heaven may bring forth a blessing upon this Nation.\nFallujah, there is a battle that will come to a swift end. For God will honor His President and give a swift victory in Fallujah. For as Arafat slips into eternity, I’m raising up a new generation that shall bring a short period of peace. And that short period of peace will give me access into the land that they call holy. Watch me, for the great victory that shall come before January in Fallujah and the regions surrounding Iraq, you will see it and they will not believe it. They will say it’s impossible, it’s impossible, but God says how can it be impossible when you have elected a gatekeeper that shall watch over this Nation with prayer and with praise? That’s why you shall be honored – Fallujah!”\nI don’t really recall that Fallujah was ever in doubt.  I mean, on the one hand, we had the most feared fighting force since the Waffen-SS with armor support and air supremacy, on the other, a few barely trained guerilla fighters armed with AK-47s and old Russian rocket launchers.  But perhaps I simply failed to note its significance and the Creasy estate will soon be releasing 16 DECISIVE BATTLES OF THE WORLD, with Fallujah taking its rightful place beside Marathon, Arbela, Hastings and Waterloo.\n(Dated 2/11/2005) The Spirit of God told me to tell you “He will root out and pluck out the corruption that exists in high places in the politics of this Nation. And every accusation that comes against the President, an accusation that is not warranted, that is not of the Spirit, that arises, I will expose two that are corrupt within the political system, pluck them out, expose them, take their clothes off so that they are naked before the people. For this shall not continue in this Nation. For I have raised this Nation up as a righteous Nation. I am raising up Daniels in Washington, D.C. Daniels that will explain to the King how he should act and how he should live. I want you to know that Daniels are being raised up in the schools and in the Universities. Watch, in the next three months for the corruptions that are going to be exposed and every accusation that rises against those that are placed in high places, there will be two that I will undress. There will be two that I’ll expose and I will clean the house so that righteousness will prevail in this Nation, says the Lord.”\nTom DeLay?  Although if someone is getting undressed, you have to assume that either a Clinton or a Kennedy is involved.  In any case, I suppose shouldn’t express my doubts about the veracity of this last prophecy.  There’s still one more day before the three months are up.\nThe thing that always makes me wonder about this sort of thing is this.  If God picked George Bush, then didn’t he pick Bill Clinton too?  I don’t seem to recall a lot of conservative Christians beating on that drum six years ago.",
  "tags": [],
  "categories": [],
  "sitemap_lastmod": "2005-05-10T13:41:00+00:00"
}