{
  "url": "https://voxday.net/2005/05/23/q-is-for-queer-and-i-dont-mean-gay/",
  "scraped_at": "2026-01-08T20:04:45.855961",
  "title": "Q is for queer (and I don’t mean gay)",
  "date_display": "May 23, 2005",
  "date_iso": "2005-05-23T18:43:00+00:00",
  "date_from_url": "2005-05-23",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><blockquote><p>Experts in source-criticism now know that <a href=\"http://www.mark-shea.com/LOTR.html\">The Lord of the Rings is a redaction of sources</a> ranging from the Red Book of Westmarch (W) to Elvish Chronicles (E) to Gondorian records (G) to orally transmitted tales of the Rohirrim (R). The conflicting ethnic, social and religious groups which preserved these stories all had their own agendas, as did the “Tolkien” (T) and “Peter Jackson” (PJ) redactors, who are often in conflict with each other as well but whose conflicting accounts of the same events reveals a great deal about the political and religious situations which helped to form our popular notions about Middle Earth and the so-called “War of the Ring.”. Into this mix are also thrown a great deal of folk materials about a supposed magic “ring” and some obscure figures named “Frodo” and “Sam”. In all likelihood, these latter figures are totems meant to personify the popularity of Aragorn with the rural classes.</p><p>Because The Lord of the Rings is a composite of sources, we may be quite certain that “Tolkien” (if he ever existed) did not “write” this work in the conventional sense, but that it was assembled over a long period of time by someone else of the same name. We know this because a work of the range, depth, and detail of The Lord of the Rings is far beyond the capacity of any modern expert in source-criticism to ever imagine creating themselves.</p><p>The tension between source materials and the various redactors is evident in several cases. T is heavily dependent upon Gondorian records and clearly elevates the claims of the Aragorn monarchy over the House of Denethor. From this it is obvious that the real “War of the Ring” was a dynastic struggle between these two clans for supremacy in Gondor. The G source, which plays such a prominent role in the T-redacted account of Aragorn, is significantly downplayed by the PJ redactor in favor of E versions. In the T account, Aragorn is portrayed as a stainless saint, utterly sure of his claims to the throne and so self-possessed that he never doubts for a moment his right to seize power. Likewise, in the T account, the Rohirrim are conveniently portrayed as willing allies and vassals to the Aragorn monarchy, living in perfect harmony with the Master Race of Numenoreans who rule Gondor.</p><p>Yet even the T redactor cannot eliminate from the R source the towering Amazon figure of Eowyn, who is recorded as taking up arms the moment the previous king of Rohan, Theoden, is dead. Clearly we are looking at a heavily reworked coup d’etat attempt by the princess of the Rohirrim against Aragorn’s supremacy. Yet this hard kernel of historical fact is cleverly sublimated under folk materials (apparently legends of the obscure figure of “Meriadoc”). Instead of the historical account of her attempt on Aragorn’s throne as it originally stood in R, she is instead depicted as engaging in battle with a mythical “Lord of the Nazgul” (apparently a figure from W sources) and shown fighting on Aragorn’s side. This attempt to sublimate Eowyn does not convince the trained eye of the source-criticism expert, who astutely notes that Eowyn is wounded in battle at the same moment Denethor dies. Obviously, Eowyn and Denethor were in league against Aragorn but were defeated by the latter’s partisans simultaneously.</p></blockquote><p>I’ve read this before, but after seeing a link on The Corner, I couldn’t resist. This is simply beautiful; a nearly perfect taunt.  I don’t know if there’s ever been anything so completely and utterly ridiculous as the circular argument that insists parts of the Bible are unreliable because they conflict with Q.  Now, the document Q does not exist, but is theorized to perhaps have existed, and is therefore considered to be more reliable than documents we know for certain to exist and can actually examine.</p><p>Got that?</p></div>",
  "content_text": "Experts in source-criticism now know that\nThe Lord of the Rings is a redaction of sources\nranging from the Red Book of Westmarch (W) to Elvish Chronicles (E) to Gondorian records (G) to orally transmitted tales of the Rohirrim (R). The conflicting ethnic, social and religious groups which preserved these stories all had their own agendas, as did the “Tolkien” (T) and “Peter Jackson” (PJ) redactors, who are often in conflict with each other as well but whose conflicting accounts of the same events reveals a great deal about the political and religious situations which helped to form our popular notions about Middle Earth and the so-called “War of the Ring.”. Into this mix are also thrown a great deal of folk materials about a supposed magic “ring” and some obscure figures named “Frodo” and “Sam”. In all likelihood, these latter figures are totems meant to personify the popularity of Aragorn with the rural classes.\nBecause The Lord of the Rings is a composite of sources, we may be quite certain that “Tolkien” (if he ever existed) did not “write” this work in the conventional sense, but that it was assembled over a long period of time by someone else of the same name. We know this because a work of the range, depth, and detail of The Lord of the Rings is far beyond the capacity of any modern expert in source-criticism to ever imagine creating themselves.\nThe tension between source materials and the various redactors is evident in several cases. T is heavily dependent upon Gondorian records and clearly elevates the claims of the Aragorn monarchy over the House of Denethor. From this it is obvious that the real “War of the Ring” was a dynastic struggle between these two clans for supremacy in Gondor. The G source, which plays such a prominent role in the T-redacted account of Aragorn, is significantly downplayed by the PJ redactor in favor of E versions. In the T account, Aragorn is portrayed as a stainless saint, utterly sure of his claims to the throne and so self-possessed that he never doubts for a moment his right to seize power. Likewise, in the T account, the Rohirrim are conveniently portrayed as willing allies and vassals to the Aragorn monarchy, living in perfect harmony with the Master Race of Numenoreans who rule Gondor.\nYet even the T redactor cannot eliminate from the R source the towering Amazon figure of Eowyn, who is recorded as taking up arms the moment the previous king of Rohan, Theoden, is dead. Clearly we are looking at a heavily reworked coup d’etat attempt by the princess of the Rohirrim against Aragorn’s supremacy. Yet this hard kernel of historical fact is cleverly sublimated under folk materials (apparently legends of the obscure figure of “Meriadoc”). Instead of the historical account of her attempt on Aragorn’s throne as it originally stood in R, she is instead depicted as engaging in battle with a mythical “Lord of the Nazgul” (apparently a figure from W sources) and shown fighting on Aragorn’s side. This attempt to sublimate Eowyn does not convince the trained eye of the source-criticism expert, who astutely notes that Eowyn is wounded in battle at the same moment Denethor dies. Obviously, Eowyn and Denethor were in league against Aragorn but were defeated by the latter’s partisans simultaneously.\nI’ve read this before, but after seeing a link on The Corner, I couldn’t resist. This is simply beautiful; a nearly perfect taunt.  I don’t know if there’s ever been anything so completely and utterly ridiculous as the circular argument that insists parts of the Bible are unreliable because they conflict with Q.  Now, the document Q does not exist, but is theorized to perhaps have existed, and is therefore considered to be more reliable than documents we know for certain to exist and can actually examine.\nGot that?",
  "tags": [],
  "categories": [],
  "sitemap_lastmod": "2005-05-23T17:43:00+00:00"
}