{
  "url": "https://voxday.net/2005/05/18/slow-minds-in-media/",
  "scraped_at": "2026-01-08T20:04:09.076598",
  "title": "Slow minds in the media",
  "date_display": "May 18, 2005",
  "date_iso": "2005-05-18T11:32:00+00:00",
  "date_from_url": "2005-05-18",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>You know they’re hopeless when they <a href=\"http://www.lifesite.net/ldn/2002/oct/021003a.html\">can’t even outwit a swimsuit model</a>:</p><blockquote><p>KATHY IRELAND: “Is it all right for the government to allow the murder of an innocent human being? The evidence I see tells me the unborn is a human being. From the moment of conception, a new life comes into being with a complete genetic <br>blueprint. The sex is determined. The blood type is determined.”</br></p><p>COLMES: “Well, we have a system of laws and a Supreme Court decision that does not define life the way you do. So legally, that’s not how it would be defined.  If you want to define it that way for your personal — that’s how you want to do it, that’s fine, but that’s not the standing law of this country.”</p></blockquote><p>Of course, it does help to have scientific fact and logic on your side.  But still….</p></div>",
  "content_text": "You know they’re hopeless when they\ncan’t even outwit a swimsuit model\n:\nKATHY IRELAND: “Is it all right for the government to allow the murder of an innocent human being? The evidence I see tells me the unborn is a human being. From the moment of conception, a new life comes into being with a complete genetic\nblueprint. The sex is determined. The blood type is determined.”\nCOLMES: “Well, we have a system of laws and a Supreme Court decision that does not define life the way you do. So legally, that’s not how it would be defined.  If you want to define it that way for your personal — that’s how you want to do it, that’s fine, but that’s not the standing law of this country.”\nOf course, it does help to have scientific fact and logic on your side.  But still….",
  "tags": [],
  "categories": [],
  "sitemap_lastmod": "2005-05-18T10:32:00+00:00"
}