{
  "url": "https://voxday.net/2024/02/16/a-bizarre-headline/",
  "scraped_at": "2026-01-08T14:24:26.828732",
  "title": "A Bizarre Headline",
  "date_display": "February 16, 2024",
  "date_iso": "2024-02-16T13:35:01+00:00",
  "date_from_url": "2024-02-16",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p><em>Iran declares Antarctica its property in direct challenge to Biden, global treaty. Iranian Navy commander announces planned military base in South Pole.</em></p><p>Okay… so that’s strange. Aside from the penguins, who really cares about the South Pole? What is the reason for the expressed Iranian interest there, and how would that be of any concern to the USA?</p><blockquote class=\"wp-block-quote is-layout-flow wp-block-quote-is-layout-flow\"><p>The Kurgan suggests <a href=\"https://www.gfilotto.com/iran-and-antarctica\">this could be an implied threat</a> by the Iranian government to expose some of Clown World’s unsettling historical secrets to the world.</p><p>If you have read any of my <em>Overlords of Mars</em> series of books, or even the complete collection, <em>Nazi Moon</em>, the seemingly bizarre headline takes on a potentially quite interesting outlook.</p><p>Although my series is science fiction in the traditional style of the genre, the fact is that if I had to bet money on it one way or the other, I would absolutely bet that the Nazis did have at least one and possibly more bases in Antarctica, aside from the semi-mythological <em>Base 211</em>, and it is absolutely possible they also had a submarine base there that permitted them to develop the technology that allowed them to keep the Americans away during <a href=\"https://infogalactic.com/info/Operation_Highjump\">Operation Highjump</a>. And that the subsequent operation Argus of dropping nukes in Antarctica in the 1958s was a continuation of the secret war between the antigravity owning Nazis in Antarctica and the American creation of the deep state.</p><p>If any of the above speculations hold any truth at all, and there is very good evidence to suggest this is at least partially the case, then what Iran is really doing, is a gentle threat of exposure to America. Putin did a similar thing a few times, threatening to release all the relevant satellite data concerning the 9/11 attacks… Russia also did a much subtler gameplay on the Moon landings, not quite threatening to expose them as fake, but simply implying Russia knew the truth about them, which I think they do.</p><p>At any rate, exposing even just an old Nazi base in Antarctica would, in the end bring down the whole WWII narrative.</p></blockquote><p>It does put a rather sinister spin on one of my favorite memes. What if penguins aren’t just cute little flightless waterfowl, but miniature Nazi icetroopers in service to the newly-awakened elder gods?</p><div class=\"wp-block-image\"><figure class=\"aligncenter size-full\"><img alt=\"\" class=\"wp-image-61811\" decoding=\"async\" fetchpriority=\"high\" height=\"344\" sizes=\"(max-width: 512px) 100vw, 512px\" src=\"https://voxday.net/wp-content/uploads/2024/02/image-40.png\" srcset=\"https://voxday.net/wp-content/uploads/2024/02/image-40.png 512w, https://voxday.net/wp-content/uploads/2024/02/image-40-300x202.png 300w\" width=\"512\"/></figure></div><p><em><a href=\"https://social.infogalactic.com/micropost/a1a3c083-d280-4ca9-ab75-bb1e560098cf\">DISCUSS ON SG</a></em></p></div>",
  "content_text": "Iran declares Antarctica its property in direct challenge to Biden, global treaty. Iranian Navy commander announces planned military base in South Pole.\nOkay… so that’s strange. Aside from the penguins, who really cares about the South Pole? What is the reason for the expressed Iranian interest there, and how would that be of any concern to the USA?\nThe Kurgan suggests\nthis could be an implied threat\nby the Iranian government to expose some of Clown World’s unsettling historical secrets to the world.\nIf you have read any of my\nOverlords of Mars\nseries of books, or even the complete collection,\nNazi Moon\n, the seemingly bizarre headline takes on a potentially quite interesting outlook.\nAlthough my series is science fiction in the traditional style of the genre, the fact is that if I had to bet money on it one way or the other, I would absolutely bet that the Nazis did have at least one and possibly more bases in Antarctica, aside from the semi-mythological\nBase 211\n, and it is absolutely possible they also had a submarine base there that permitted them to develop the technology that allowed them to keep the Americans away during\nOperation Highjump\n. And that the subsequent operation Argus of dropping nukes in Antarctica in the 1958s was a continuation of the secret war between the antigravity owning Nazis in Antarctica and the American creation of the deep state.\nIf any of the above speculations hold any truth at all, and there is very good evidence to suggest this is at least partially the case, then what Iran is really doing, is a gentle threat of exposure to America. Putin did a similar thing a few times, threatening to release all the relevant satellite data concerning the 9/11 attacks… Russia also did a much subtler gameplay on the Moon landings, not quite threatening to expose them as fake, but simply implying Russia knew the truth about them, which I think they do.\nAt any rate, exposing even just an old Nazi base in Antarctica would, in the end bring down the whole WWII narrative.\nIt does put a rather sinister spin on one of my favorite memes. What if penguins aren’t just cute little flightless waterfowl, but miniature Nazi icetroopers in service to the newly-awakened elder gods?\nDISCUSS ON SG",
  "tags": [
    "Clown World",
    "conspiracy",
    "news"
  ],
  "categories": [],
  "sitemap_lastmod": "2024-02-16T13:35:03+00:00"
}