{
  "url": "https://voxday.net/2024/02/16/a-library-survey/",
  "scraped_at": "2026-01-08T14:24:28.313164",
  "title": "A Library Survey",
  "date_display": "February 16, 2024",
  "date_iso": "2024-02-16T15:04:17+00:00",
  "date_from_url": "2024-02-16",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>We already know what the next book in the Castalia Library/Libraria subscription series will be, and will announce it on the first of March. We’re also working on obtaining the rights to some works we are very confident will please everyone. And we know the two volumes of <em>A SEA OF SKULLS</em> will be in the mix later this year after we get the regular hardcover edition out. But we’re interested in hearing from you what other books might be of interest to you this year; here are <a href=\"https://castalialibrary.substack.com/p/library-survey-1\">some of the books we’re considering</a>.</p><p>We are also offering a first look at some very rare books indeed.</p><p>Also on the Library stack today is <a href=\"https://castalialibrary.substack.com/p/studies-on-the-napoleonic-wars-008\">the seventh and final part</a> of Oman’s first chapter. And while I agree with the great historian with regards to the chief lesson of history, thanks to our advantage of 95 years of hindsight, I think we can safely conclude Oman’s hopes for the “new and vigorous age” were dashed to pieces, and that the Pessimists were entirely correct about the prospects for modernity.</p><blockquote class=\"wp-block-quote is-layout-flow wp-block-quote-is-layout-flow\"><p>From the outlook of the ordinary man we are no longer at the end of a feeble and moribund Christendom, but at the start of a new and vigorous age, full of ideals, moral, cultural, philosophical, religious, and materialistic. As I said in an earlier page, it would take a whole book to discuss the question how far the Revival of Learning, the Reformation, the discovery of America and the Cape Route to the Indies, or scientific discovery which knocked the Geocentric Theory on the head, were each of them responsible for the new historical perspective of the civilized world. But the change was complete and astounding; and the foundations of the modern ways of thought had been laid, while the “Seven Ages” in their depressing series had dropped out of men’s conception of the Universe. A new visualization of the world had begun…</p><p>The Pessimist, incidentally, has enjoyed one of those periods in which he is able to snarl “I told you so” to a disconcerted world. But all down history the Pessimist has never had the last word. I prefer to range myself with the Optimists, and hope to survive long enough to see another vista of hope before my own generation has passed away.</p><p>I know not whether the change of perspective will come by means of the League of Nations, which has provoked so much enthusiasm in so many quarters, or whether it will be the result of a saner nationalism which can combine true patriotism with a proper regard for the rights of one’s neighbours. All I know is that the world-mind works by action and reaction, and that a swing of the pendulum in one direction will ultimately be followed by a swing in the other.</p><p>That to my mind is the teaching of history.</p> <cite>Man’s Outlook on History, Sir Charles Oman, 1929</cite></blockquote><p>Needless to say, the globalist neoliberal modernity that has come to be known as Clown World did not turn out to be an improvement upon Christendom, its moral, cultural, philosophical, religious, and materialistic ideals notwithstanding.</p><p><a href=\"https://social.infogalactic.com/micropost/d5bb2c08-c5f2-40db-9e99-b435141ebbda\"><em>DISCUSS ON SG</em></a></p></div>",
  "content_text": "We already know what the next book in the Castalia Library/Libraria subscription series will be, and will announce it on the first of March. We’re also working on obtaining the rights to some works we are very confident will please everyone. And we know the two volumes of\nA SEA OF SKULLS\nwill be in the mix later this year after we get the regular hardcover edition out. But we’re interested in hearing from you what other books might be of interest to you this year; here are\nsome of the books we’re considering\n.\nWe are also offering a first look at some very rare books indeed.\nAlso on the Library stack today is\nthe seventh and final part\nof Oman’s first chapter. And while I agree with the great historian with regards to the chief lesson of history, thanks to our advantage of 95 years of hindsight, I think we can safely conclude Oman’s hopes for the “new and vigorous age” were dashed to pieces, and that the Pessimists were entirely correct about the prospects for modernity.\nFrom the outlook of the ordinary man we are no longer at the end of a feeble and moribund Christendom, but at the start of a new and vigorous age, full of ideals, moral, cultural, philosophical, religious, and materialistic. As I said in an earlier page, it would take a whole book to discuss the question how far the Revival of Learning, the Reformation, the discovery of America and the Cape Route to the Indies, or scientific discovery which knocked the Geocentric Theory on the head, were each of them responsible for the new historical perspective of the civilized world. But the change was complete and astounding; and the foundations of the modern ways of thought had been laid, while the “Seven Ages” in their depressing series had dropped out of men’s conception of the Universe. A new visualization of the world had begun…\nThe Pessimist, incidentally, has enjoyed one of those periods in which he is able to snarl “I told you so” to a disconcerted world. But all down history the Pessimist has never had the last word. I prefer to range myself with the Optimists, and hope to survive long enough to see another vista of hope before my own generation has passed away.\nI know not whether the change of perspective will come by means of the League of Nations, which has provoked so much enthusiasm in so many quarters, or whether it will be the result of a saner nationalism which can combine true patriotism with a proper regard for the rights of one’s neighbours. All I know is that the world-mind works by action and reaction, and that a swing of the pendulum in one direction will ultimately be followed by a swing in the other.\nThat to my mind is the teaching of history.\nMan’s Outlook on History, Sir Charles Oman, 1929\nNeedless to say, the globalist neoliberal modernity that has come to be known as Clown World did not turn out to be an improvement upon Christendom, its moral, cultural, philosophical, religious, and materialistic ideals notwithstanding.\nDISCUSS ON SG",
  "tags": [
    "books",
    "Castalia Library",
    "history"
  ],
  "categories": [],
  "sitemap_lastmod": "2024-02-16T16:42:56+00:00"
}