{
  "url": "https://voxday.net/2024/02/05/all-crusaders-now/",
  "scraped_at": "2026-01-08T14:23:17.326634",
  "title": "All Crusaders Now",
  "date_display": "February 5, 2024",
  "date_iso": "2024-02-05T10:51:54+00:00",
  "date_from_url": "2024-02-05",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>If you kept your blood pure, you passed the first test. But even if you failed the first test, you have the opportunity to repent and refuse to submit again. The <a href=\"https://biblescienceforum.com/2023/04/06/demon-possession-from-covid-shots/comment-page-1/\">demonic account of 7 doses</a> of the vaxx to destroy a Christian’s faith <a href=\"https://voxday.net/2021/10/24/be-vigilant/\">sounded considerably more outlandish</a> than it does now that people with rictus faces and crazy eyes are publicly boasting of their sixth vaxxing and preaching the gospel of earthly salvation through genetic mutation.</p><blockquote class=\"wp-block-quote is-layout-flow wp-block-quote-is-layout-flow\"><p>Sadly, most people nowadays are lukewarm. As mention by Father Athanasios Mitilinaios, most Christians are lukewarm. We too are lukewarm and need to stop being lukewarm.</p><p>To a faithful person of God death does not exist, this is the reality. We have forgotten this and we presently fear death. Not only do we fear death, we also fear being fined, possible imprisonment, and prosecution. In NO case can a person call themselves a Christian if they fear death. When a person fears dying, they become an idolater or an atheist.</p><p>Instead a Christian should long to die. The saints wanted to die. The reason why Christians truly want to pass away is so they can be fully united to the Lord they worship and love above all else. They want to go and are joyful when they are passing away. However, they never cause death to themselves, they do not commit suicide. But when the opportunity arises to become a martyr and confessor for Christ, they do this without fear of death.</p><p>Unfortunately, these things are not being heard from the Preachers, Bishops and Priests, but as you know are heard from the demons.</p><p>A well-respected Priest-monk who perform exorcisms, once told me what a demon said to him. The demon said to him, “How are you Christians fearful of death? I have seduced and deceived you into taking the vaccine with the fear of death!” A demon again confesses that the vaccines are his doing. In fact, he says, “We did a ceremony at a Lodge in America for the vaccines.”</p><p>See what the demon confesses! The demon continues: “What did you fear? For you (Christians), death does not exist.” For Christians, death does not exist. Do you understand, fellow brothers and sisters, where we’ve come to?</p><p>In the Gospels, Christ said something correlating with our present situation. When He entered Jerusalem and the children were calling out, “Hosana! Blessed is He who comes in the name of the Lord!” The children were proclaiming Jesus as the awaited Messiah. And others who were indignant were saying to Jesus, “Are you hearing what they are saying to you?” Christ responds, “I tell you that if these should hold their peace, the stones would immediately cry out.”</p><p>So correlating with today’s situation, now that the Priest and Archpriest are not proclaiming that death has been conquered, the demons are proclaiming it instead: “How are you Christians fearful of death? And are all running to take this vaccine?”</p><p>Which isn’t really a vaccine, but rather a gene therapy/technology, with the aim of oppressing humans. This is the aim, which is why there will be more dosages. In fact, there are many people who say there will be 7 dosages. The demons also state that there will be 7 dosages.</p><p>Those who were deceived into taking the first or second dosage, hopefully, will not take the remaining dosages. May they repent, weep and go to confession, because their salvation is in danger.</p></blockquote><p>We knew, <em>we absolutely knew</em>, that the vaxx was unnecessary. And we strongly suspected that it was evil, because it was pushed on the basis of fear, which is how Satan usually goes about manipulating men and accomplishing his goals. And the fact that there are a) at least six doses and b) claims that there will be seven, points strongly to the vaxx being directly connected to the ritual that was performed prior to its release, and which some of us even felt being performed at the time.</p><p>The events in Israel, and Prime Minister Netanyahu’s sudden embrace of the religious fanatics there, also point toward <a href=\"https://christconquers.wordpress.com/2010/06/06/elder-paisios-against-zionists-and-cowardly-orthodox/\">the warnings that were given</a> by an Orthodox monk from Mount Athos back in 1994. While I am intrinsically skeptical of all so-called “prophecies”, especially the evil ones, it’s important to keep in mind that there are still powerful people who believe in them entirely. <a href=\"https://lamecherry.blogspot.com/2024/01/thee-netanyahu-prophecy.html\">Such as, apparently, Mr. Netanyahu</a>, which may explain his aberrant behavior in the year before the green flag event of October 7th and the subsequent Gazacaust.</p><p><em>There is a prophecy about all of this from Rabbi Schneerson, who is the Kushner’s religious leader, and everyone in the state of Tel Aviv knows that the Rabbi told Netanyahu that he would be the last prime minister of the state, and would hand the keys of the nation over to the messiah. Netanyahu is the gatekeeper. This was all spoken of 30 years ago when Netanyahu met Schneerson in New York City.</em></p><p>Whether this might be the Great Delusion <a href=\"https://www.biblegateway.com/passage/?search=2%20Thessalonians%202&amp;version=KJV\">of 2 Thessalonians 2</a>, a forerunner, or simply the fallen world being fallen, we can already observe how many have already been deceived. So, no fear. No tolerance. No more being lukewarm. It’s time to stop listening to the insane ravings of the world, time to turn to the Bible when temptations come, and time to start paying attention to the still, small voice that tells you the right thing to do.</p><p><em>We have to witness our faith with boldness, because if we continue to be silent we’ll have to answer in the end. You see, if we don’t begin to make war against evil, to expose those who tempt believers, then the evil will grow larger.</em><br/>– Elder Paisios, Monk of Mount Athos, (1924-1994)</p><p>We are all crusaders now.</p><div class=\"wp-block-image\"><figure class=\"aligncenter size-full\"><img alt=\"\" class=\"wp-image-61635\" decoding=\"async\" fetchpriority=\"high\" height=\"374\" sizes=\"(max-width: 512px) 100vw, 512px\" src=\"https://voxday.net/wp-content/uploads/2024/02/image-11.png\" srcset=\"https://voxday.net/wp-content/uploads/2024/02/image-11.png 512w, https://voxday.net/wp-content/uploads/2024/02/image-11-300x219.png 300w\" width=\"512\"/></figure></div><p><em><a href=\"https://social.infogalactic.com/micropost/cd9ca045-adb0-40e1-b884-1c3b16b455aa\">DISCUSS ON SG</a></em></p></div>",
  "content_text": "If you kept your blood pure, you passed the first test. But even if you failed the first test, you have the opportunity to repent and refuse to submit again. The\ndemonic account of 7 doses\nof the vaxx to destroy a Christian’s faith\nsounded considerably more outlandish\nthan it does now that people with rictus faces and crazy eyes are publicly boasting of their sixth vaxxing and preaching the gospel of earthly salvation through genetic mutation.\nSadly, most people nowadays are lukewarm. As mention by Father Athanasios Mitilinaios, most Christians are lukewarm. We too are lukewarm and need to stop being lukewarm.\nTo a faithful person of God death does not exist, this is the reality. We have forgotten this and we presently fear death. Not only do we fear death, we also fear being fined, possible imprisonment, and prosecution. In NO case can a person call themselves a Christian if they fear death. When a person fears dying, they become an idolater or an atheist.\nInstead a Christian should long to die. The saints wanted to die. The reason why Christians truly want to pass away is so they can be fully united to the Lord they worship and love above all else. They want to go and are joyful when they are passing away. However, they never cause death to themselves, they do not commit suicide. But when the opportunity arises to become a martyr and confessor for Christ, they do this without fear of death.\nUnfortunately, these things are not being heard from the Preachers, Bishops and Priests, but as you know are heard from the demons.\nA well-respected Priest-monk who perform exorcisms, once told me what a demon said to him. The demon said to him, “How are you Christians fearful of death? I have seduced and deceived you into taking the vaccine with the fear of death!” A demon again confesses that the vaccines are his doing. In fact, he says, “We did a ceremony at a Lodge in America for the vaccines.”\nSee what the demon confesses! The demon continues: “What did you fear? For you (Christians), death does not exist.” For Christians, death does not exist. Do you understand, fellow brothers and sisters, where we’ve come to?\nIn the Gospels, Christ said something correlating with our present situation. When He entered Jerusalem and the children were calling out, “Hosana! Blessed is He who comes in the name of the Lord!” The children were proclaiming Jesus as the awaited Messiah. And others who were indignant were saying to Jesus, “Are you hearing what they are saying to you?” Christ responds, “I tell you that if these should hold their peace, the stones would immediately cry out.”\nSo correlating with today’s situation, now that the Priest and Archpriest are not proclaiming that death has been conquered, the demons are proclaiming it instead: “How are you Christians fearful of death? And are all running to take this vaccine?”\nWhich isn’t really a vaccine, but rather a gene therapy/technology, with the aim of oppressing humans. This is the aim, which is why there will be more dosages. In fact, there are many people who say there will be 7 dosages. The demons also state that there will be 7 dosages.\nThose who were deceived into taking the first or second dosage, hopefully, will not take the remaining dosages. May they repent, weep and go to confession, because their salvation is in danger.\nWe knew,\nwe absolutely knew\n, that the vaxx was unnecessary. And we strongly suspected that it was evil, because it was pushed on the basis of fear, which is how Satan usually goes about manipulating men and accomplishing his goals. And the fact that there are a) at least six doses and b) claims that there will be seven, points strongly to the vaxx being directly connected to the ritual that was performed prior to its release, and which some of us even felt being performed at the time.\nThe events in Israel, and Prime Minister Netanyahu’s sudden embrace of the religious fanatics there, also point toward\nthe warnings that were given\nby an Orthodox monk from Mount Athos back in 1994. While I am intrinsically skeptical of all so-called “prophecies”, especially the evil ones, it’s important to keep in mind that there are still powerful people who believe in them entirely.\nSuch as, apparently, Mr. Netanyahu\n, which may explain his aberrant behavior in the year before the green flag event of October 7th and the subsequent Gazacaust.\nThere is a prophecy about all of this from Rabbi Schneerson, who is the Kushner’s religious leader, and everyone in the state of Tel Aviv knows that the Rabbi told Netanyahu that he would be the last prime minister of the state, and would hand the keys of the nation over to the messiah. Netanyahu is the gatekeeper. This was all spoken of 30 years ago when Netanyahu met Schneerson in New York City.\nWhether this might be the Great Delusion\nof 2 Thessalonians 2\n, a forerunner, or simply the fallen world being fallen, we can already observe how many have already been deceived. So, no fear. No tolerance. No more being lukewarm. It’s time to stop listening to the insane ravings of the world, time to turn to the Bible when temptations come, and time to start paying attention to the still, small voice that tells you the right thing to do.\nWe have to witness our faith with boldness, because if we continue to be silent we’ll have to answer in the end. You see, if we don’t begin to make war against evil, to expose those who tempt believers, then the evil will grow larger.\n– Elder Paisios, Monk of Mount Athos, (1924-1994)\nWe are all crusaders now.\nDISCUSS ON SG",
  "tags": [
    "Christianity",
    "religion",
    "Vaxx"
  ],
  "categories": [],
  "sitemap_lastmod": "2024-02-05T10:57:37+00:00"
}