{
  "url": "https://voxday.net/2024/02/15/angels-vs-demons/",
  "scraped_at": "2026-01-08T14:24:19.442957",
  "title": "Angels vs Demons",
  "date_display": "February 15, 2024",
  "date_iso": "2024-02-15T11:08:08+00:00",
  "date_from_url": "2024-02-15",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>There shouldn’t be any question which side <a href=\"https://sputnikglobe.com/20240213/pepe-escobar-life-during-wartime--on-the-road-in-donbass-1116752456.html\">is on the side of the angels</a> and which is most definitely not in what purports to be a war between Russia and Ukraine. One side is openly Christian and is fighting on their own land. The other side is led by an avowedly anti-Christian regime that is funded by Clown World and is literally persecuting priests and closing down churches.</p><blockquote class=\"wp-block-quote is-layout-flow wp-block-quote-is-layout-flow\"><p>It’s a cold, rainy, damp morning in the deep Donbass countryside, at a secret location close to the Urozhaynoye direction; a nondescript country house, crucially under the fog, which prevents the work of enemy drones.</p><p>Father Igor, a military priest, is blessing a group of local contract-signed volunteers to the Archangel Gabriel battalion, ready to go to the front lines of the US vs. Russia proxy war. The man in charge of the battalion is one of the top-ranking officers of Orthodox Christian units in the DPR. A small shrine is set up in the corner of a small, cramped room, decorated with icons. Candles are lit, and three soldiers hold the red flag with the icon of Jesus in the center. After prayers and a small homily, Father Igor blesses each soldier.</p><p>This is yet another stop in a sort of itinerant icon road show, started in Kherson, then Zaporozhye and all the way to the myriad DPR front lines, led by my gracious host Andrey Afanasiev, military correspondent for the Spas channel, and later joined in Donetsk by a decorated fighter for the Archangel Michael battalion, an extremely bright and engaging young man codename Pilot.</p><p>There are between 28 and 30 Orthodox Christian battalions fighting in Donbass. That’s the power of Orthodox Christianity. To see them at work is to understand the essentials: how the Russian soul is capable of any sacrifice to protect the core values of its civilization.</p></blockquote><p>A fact that has been assiduously avoided by the pro-NATO media is that a significant number of the “Russian” forces, and a disproportionate number of the Russian casualties, are not soldiers of the Russian Army. They are members of the local militias who are residents of the Donbass, the two republics that <a href=\"https://infogalactic.com/info/Donetsk_People%27s_Republic\">voted for their independence in 2014</a> and were formally annexed by Russia in 2022, and many of those soldiers have been fighting the Ukrainian military forces for a decade.</p><p>It’s as if Texas declared independence, was invaded and occupied by the US military, which was later driven out by the Texans with the assistance of Mexico. The analogy is imperfect, because Russia has taken, and will continue to take, Ukrainian land outside of the Donbas, but the special military operation is, and has always been, more a war of liberation than a foreign military invasion.</p><p>Russia has relied upon the local militias, as well as the Chechens and private military companies, in order to preserve most of its regular troops to fight the US Army. And, of course, the morale of the local militias is incredibly high because they are literally fighting for their land and their own homes.</p><div class=\"wp-block-image\"><figure class=\"aligncenter size-full\"><img alt=\"\" class=\"wp-image-61798\" decoding=\"async\" fetchpriority=\"high\" height=\"512\" sizes=\"(max-width: 512px) 100vw, 512px\" src=\"https://voxday.net/wp-content/uploads/2024/02/image-37.png\" srcset=\"https://voxday.net/wp-content/uploads/2024/02/image-37.png 512w, https://voxday.net/wp-content/uploads/2024/02/image-37-300x300.png 300w, https://voxday.net/wp-content/uploads/2024/02/image-37-150x150.png 150w\" width=\"512\"/></figure></div><p><em><a href=\"https://social.infogalactic.com/micropost/eea69534-cdd6-4447-8784-07491855758c\">DISCUSS ON SG</a></em></p></div>",
  "content_text": "There shouldn’t be any question which side\nis on the side of the angels\nand which is most definitely not in what purports to be a war between Russia and Ukraine. One side is openly Christian and is fighting on their own land. The other side is led by an avowedly anti-Christian regime that is funded by Clown World and is literally persecuting priests and closing down churches.\nIt’s a cold, rainy, damp morning in the deep Donbass countryside, at a secret location close to the Urozhaynoye direction; a nondescript country house, crucially under the fog, which prevents the work of enemy drones.\nFather Igor, a military priest, is blessing a group of local contract-signed volunteers to the Archangel Gabriel battalion, ready to go to the front lines of the US vs. Russia proxy war. The man in charge of the battalion is one of the top-ranking officers of Orthodox Christian units in the DPR. A small shrine is set up in the corner of a small, cramped room, decorated with icons. Candles are lit, and three soldiers hold the red flag with the icon of Jesus in the center. After prayers and a small homily, Father Igor blesses each soldier.\nThis is yet another stop in a sort of itinerant icon road show, started in Kherson, then Zaporozhye and all the way to the myriad DPR front lines, led by my gracious host Andrey Afanasiev, military correspondent for the Spas channel, and later joined in Donetsk by a decorated fighter for the Archangel Michael battalion, an extremely bright and engaging young man codename Pilot.\nThere are between 28 and 30 Orthodox Christian battalions fighting in Donbass. That’s the power of Orthodox Christianity. To see them at work is to understand the essentials: how the Russian soul is capable of any sacrifice to protect the core values of its civilization.\nA fact that has been assiduously avoided by the pro-NATO media is that a significant number of the “Russian” forces, and a disproportionate number of the Russian casualties, are not soldiers of the Russian Army. They are members of the local militias who are residents of the Donbass, the two republics that\nvoted for their independence in 2014\nand were formally annexed by Russia in 2022, and many of those soldiers have been fighting the Ukrainian military forces for a decade.\nIt’s as if Texas declared independence, was invaded and occupied by the US military, which was later driven out by the Texans with the assistance of Mexico. The analogy is imperfect, because Russia has taken, and will continue to take, Ukrainian land outside of the Donbas, but the special military operation is, and has always been, more a war of liberation than a foreign military invasion.\nRussia has relied upon the local militias, as well as the Chechens and private military companies, in order to preserve most of its regular troops to fight the US Army. And, of course, the morale of the local militias is incredibly high because they are literally fighting for their land and their own homes.\nDISCUSS ON SG",
  "tags": [
    "Christianity",
    "Russia",
    "war"
  ],
  "categories": [],
  "sitemap_lastmod": "2024-02-15T11:08:10+00:00"
}