{
  "url": "https://voxday.net/2024/02/14/bambi-sanctions-godzilla/",
  "scraped_at": "2026-01-08T14:24:13.916514",
  "title": "Bambi Sanctions Godzilla",
  "date_display": "February 14, 2024",
  "date_iso": "2024-02-14T11:24:40+00:00",
  "date_from_url": "2024-02-14",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>The EU leaders are subjecting their economies to the same savage attrition that the Kiev regime is subjecting all the men of Ukraine. Only Kiev hasn’t been stupid enough <a href=\"https://www.rt.com/news/592410-china-india-eu-sanctions/\">to declare war on China</a> as well as Russia.</p><blockquote class=\"wp-block-quote is-layout-flow wp-block-quote-is-layout-flow\"><p>Beijing rejects “illegal sanctions” and will defend the interests of its companies, the Chinese Foreign Ministry has said following a report that the EU could blacklist some of the country’s firms for allegedly helping Russia to evade the bloc’s restrictions.</p><p>The EU is planning to place restrictions on three Chinese businesses and one Indian company as part of its 13th round of sanctions on Russia over its conflict with Ukraine, the Financial Times reported on Monday.</p><p>Brussels believes the firms in question are helping Moscow to circumvent existing restrictions, especially through the supply of electronic components that can be repurposed for use in drones and other weapons systems. If the plan is approved by member states, it will see the EU sanction companies from mainland China and India – two of the bloc’s key trading partners – for the first time.</p><p>”We are aware of the relevant reports,” the Chinese Foreign Ministry said in a statement on Tuesday. “China firmly opposes illegal sanctions or ‘long-arm jurisdiction’ against China on the grounds of cooperation between China and Russia. Chinese and Russian companies carry out normal exchanges and cooperation and do not target third parties, nor should they be interfered with or influenced by third parties,” the ministry said.</p><p>Beijing “will take necessary measures to resolutely safeguard the legitimate rights and interests of Chinese enterprises.”</p></blockquote><p>This decision to sanction Chinese companies goes so far beyond stupid as to genuinely raise the question if the Europeans are intentionally destroying their own economies and industrial capabilities at the orders of Washington in order to prevent their companies from being able to compete with the USA once the Great Bifurcation is complete and the West no longer has the ability to trade with Asia, Africa, or Araby.</p><p>Every single one of the twelve rounds of Russian sanctions has not only failed, but made the Russian economy stronger. Given that the Chinese economy is much larger, not only than Russia, but also than the combined economies of the European Union, what are the chances that this expansive thirteenth round will be any less disastrous.</p><p>It’s never been more clear that the post-WWII occupation of Western Europe by the United States never ended, or that the dirty sixties hippies were essentially correct and the good old conservative Republicans were totally wrong. The USA truly is an empire imposed by military force, it was never an armed force of charitable do-gooders just trying to help everyone by spreading peace and democracy around the world.</p><p>In the meantime, the Chinese have just demonstrated what they think of Switzerland’s now-defunct neutrality.</p><blockquote class=\"wp-block-quote is-layout-flow wp-block-quote-is-layout-flow\"><p><strong>Bloomberg: </strong><em>The Swiss government is going to hold a peace conference for the Ukraine-Russia war soon. Does China have any intention to attend that?</em></p><p><strong>Wang Wenbin: </strong>China’s position on the Ukraine crisis is consistent and clear. We have played a constructive role in advocating an end to the fight and a political settlement of the crisis. We will continue to promote peace talks and work for a political settlement of the crisis in our own way.</p><p><strong>Bloomberg: </strong><em>Did you say you will use this forum to promote the settlement or you said you’ll use any forum to promote the settlement of the crisis?</em></p><p><strong>Wang Wenbin:</strong> We will continue to play a constructive role in promoting the political settlement of the crisis in our own way.</p></blockquote><p><strong>Translation: </strong>No, we will not attend, participate, or promote any attempt by a pro-NATO government to play arbiter. You’re not neutral, you took Ukraine’s side, and you’re not fooling anyone. Also, don’t even think about trying to sanction our companies or we will sanction you right back, and you need our market more than we need yours.</p><div class=\"wp-block-image\"><figure class=\"aligncenter size-full\"><img alt=\"\" class=\"wp-image-61787\" decoding=\"async\" fetchpriority=\"high\" height=\"288\" sizes=\"(max-width: 512px) 100vw, 512px\" src=\"https://voxday.net/wp-content/uploads/2024/02/image-33.png\" srcset=\"https://voxday.net/wp-content/uploads/2024/02/image-33.png 512w, https://voxday.net/wp-content/uploads/2024/02/image-33-300x169.png 300w\" width=\"512\"/></figure></div><p><em><a href=\"https://social.infogalactic.com/micropost/bf1c0f9c-31ea-479b-8fd0-4051d5aac61f\">DISCUSS ON SG</a></em></p></div>",
  "content_text": "The EU leaders are subjecting their economies to the same savage attrition that the Kiev regime is subjecting all the men of Ukraine. Only Kiev hasn’t been stupid enough\nto declare war on China\nas well as Russia.\nBeijing rejects “illegal sanctions” and will defend the interests of its companies, the Chinese Foreign Ministry has said following a report that the EU could blacklist some of the country’s firms for allegedly helping Russia to evade the bloc’s restrictions.\nThe EU is planning to place restrictions on three Chinese businesses and one Indian company as part of its 13th round of sanctions on Russia over its conflict with Ukraine, the Financial Times reported on Monday.\nBrussels believes the firms in question are helping Moscow to circumvent existing restrictions, especially through the supply of electronic components that can be repurposed for use in drones and other weapons systems. If the plan is approved by member states, it will see the EU sanction companies from mainland China and India – two of the bloc’s key trading partners – for the first time.\n”We are aware of the relevant reports,” the Chinese Foreign Ministry said in a statement on Tuesday. “China firmly opposes illegal sanctions or ‘long-arm jurisdiction’ against China on the grounds of cooperation between China and Russia. Chinese and Russian companies carry out normal exchanges and cooperation and do not target third parties, nor should they be interfered with or influenced by third parties,” the ministry said.\nBeijing “will take necessary measures to resolutely safeguard the legitimate rights and interests of Chinese enterprises.”\nThis decision to sanction Chinese companies goes so far beyond stupid as to genuinely raise the question if the Europeans are intentionally destroying their own economies and industrial capabilities at the orders of Washington in order to prevent their companies from being able to compete with the USA once the Great Bifurcation is complete and the West no longer has the ability to trade with Asia, Africa, or Araby.\nEvery single one of the twelve rounds of Russian sanctions has not only failed, but made the Russian economy stronger. Given that the Chinese economy is much larger, not only than Russia, but also than the combined economies of the European Union, what are the chances that this expansive thirteenth round will be any less disastrous.\nIt’s never been more clear that the post-WWII occupation of Western Europe by the United States never ended, or that the dirty sixties hippies were essentially correct and the good old conservative Republicans were totally wrong. The USA truly is an empire imposed by military force, it was never an armed force of charitable do-gooders just trying to help everyone by spreading peace and democracy around the world.\nIn the meantime, the Chinese have just demonstrated what they think of Switzerland’s now-defunct neutrality.\nBloomberg:\nThe Swiss government is going to hold a peace conference for the Ukraine-Russia war soon. Does China have any intention to attend that?\nWang Wenbin:\nChina’s position on the Ukraine crisis is consistent and clear. We have played a constructive role in advocating an end to the fight and a political settlement of the crisis. We will continue to promote peace talks and work for a political settlement of the crisis in our own way.\nBloomberg:\nDid you say you will use this forum to promote the settlement or you said you’ll use any forum to promote the settlement of the crisis?\nWang Wenbin:\nWe will continue to play a constructive role in promoting the political settlement of the crisis in our own way.\nTranslation:\nNo, we will not attend, participate, or promote any attempt by a pro-NATO government to play arbiter. You’re not neutral, you took Ukraine’s side, and you’re not fooling anyone. Also, don’t even think about trying to sanction our companies or we will sanction you right back, and you need our market more than we need yours.\nDISCUSS ON SG",
  "tags": [
    "China",
    "economics",
    "EU"
  ],
  "categories": [],
  "sitemap_lastmod": "2024-02-14T13:30:26+00:00"
}