{
  "url": "https://voxday.net/2024/02/01/castalia-library-on-substack/",
  "scraped_at": "2026-01-08T14:22:54.646745",
  "title": "Castalia Library on Substack",
  "date_display": "February 1, 2024",
  "date_iso": "2024-02-01T14:06:23+00:00",
  "date_from_url": "2024-02-01",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>In the aftermath of the extremely successful launch of <a href=\"https://sigmagame.substack.com/p/a-violation-of-the-pecking-order\">the Sigma Game substack</a>, I brought up the idea of a substack devoted to Castalia Library with the idea that it might help those who somehow miss out on a) blog posts, b) the monthly emails, c) Gab and SocialGalactic announcements, and d) LibraryThing posts keep tabs on the current state of things with the various Castalia Library books, including Library, Libraria, History, the Junior Classics, and the various one-off editions.</p><p>The response was overwhelmingly positive, and since Castalia Library is nothing if not responsive to its subscribers, I duly set up <a href=\"https://castalialibrary.substack.com/\">a Castalia Library substack</a>. Those who sign up for a free subscription will be kept up to date on the latest production schedules with regular emails, and it should even be possible to allow new subscribers to sign up through the paid subscription option at some point.</p><p>It should be noted that this substack is absolutely not a substitute for anything else or any other platform. Rather, it is an attempt to cast a wider net, as the primary challenge facing Castalia Library at the moment is that the vast majority of book collectors, and therefore, the vast majority of its potential subscribers and customers, have never heard of it. So even if you’re on the mailing lists and receiving the monthly emails, it’s probably not a bad idea to widen your net before you get caught in a bounce and your email is scrubbed by the mail service.</p><p>And speaking of the Sigma Game substack, I would be remiss if I neglected to mention <a href=\"https://sigmagame.substack.com/p/a-violation-of-the-pecking-order\">today’s post</a> on my thoughts concerning a female SSH and the various attempts to construct it. No offense intended to the various men and women who have thus far attempted to formulate one, but the fact is that most of those who do appear to be more interested in relating various anecdotes about their personal experiences than in an objective analysis of the complexities of female social interaction.</p><p>Not that it’s my concern or my interest, but I would point out that anyone who fails to take into account either the fat factor or the sexual availability and experience factor in what purports to be a “socio-sexual” hierarchy can’t reasonably be considered to be serious about the task. And due to the female discomfort in honestly addressing both of those issues, to say nothing of the male ignorance, and inability to grasp the details, of female competition, I find it difficult to believe that anyone will succeed in describing a functional female SSH any time soon.</p><div class=\"wp-block-image\"><figure class=\"aligncenter size-full\"><a href=\"https://sigmagame.substack.com/p/a-violation-of-the-pecking-order\"><img alt=\"\" class=\"wp-image-61577\" decoding=\"async\" fetchpriority=\"high\" height=\"512\" sizes=\"(max-width: 512px) 100vw, 512px\" src=\"https://voxday.net/wp-content/uploads/2024/02/image.png\" srcset=\"https://voxday.net/wp-content/uploads/2024/02/image.png 512w, https://voxday.net/wp-content/uploads/2024/02/image-300x300.png 300w, https://voxday.net/wp-content/uploads/2024/02/image-150x150.png 150w\" width=\"512\"/></a></figure></div><p><em><a href=\"https://social.infogalactic.com/micropost/0134bd82-b007-41ab-bb1d-d9633e995933\">DISCUSS ON SG</a></em></p></div>",
  "content_text": "In the aftermath of the extremely successful launch of\nthe Sigma Game substack\n, I brought up the idea of a substack devoted to Castalia Library with the idea that it might help those who somehow miss out on a) blog posts, b) the monthly emails, c) Gab and SocialGalactic announcements, and d) LibraryThing posts keep tabs on the current state of things with the various Castalia Library books, including Library, Libraria, History, the Junior Classics, and the various one-off editions.\nThe response was overwhelmingly positive, and since Castalia Library is nothing if not responsive to its subscribers, I duly set up\na Castalia Library substack\n. Those who sign up for a free subscription will be kept up to date on the latest production schedules with regular emails, and it should even be possible to allow new subscribers to sign up through the paid subscription option at some point.\nIt should be noted that this substack is absolutely not a substitute for anything else or any other platform. Rather, it is an attempt to cast a wider net, as the primary challenge facing Castalia Library at the moment is that the vast majority of book collectors, and therefore, the vast majority of its potential subscribers and customers, have never heard of it. So even if you’re on the mailing lists and receiving the monthly emails, it’s probably not a bad idea to widen your net before you get caught in a bounce and your email is scrubbed by the mail service.\nAnd speaking of the Sigma Game substack, I would be remiss if I neglected to mention\ntoday’s post\non my thoughts concerning a female SSH and the various attempts to construct it. No offense intended to the various men and women who have thus far attempted to formulate one, but the fact is that most of those who do appear to be more interested in relating various anecdotes about their personal experiences than in an objective analysis of the complexities of female social interaction.\nNot that it’s my concern or my interest, but I would point out that anyone who fails to take into account either the fat factor or the sexual availability and experience factor in what purports to be a “socio-sexual” hierarchy can’t reasonably be considered to be serious about the task. And due to the female discomfort in honestly addressing both of those issues, to say nothing of the male ignorance, and inability to grasp the details, of female competition, I find it difficult to believe that anyone will succeed in describing a functional female SSH any time soon.\nDISCUSS ON SG",
  "tags": [
    "Castalia",
    "Sigma Game",
    "SSH",
    "women"
  ],
  "categories": [],
  "sitemap_lastmod": "2024-02-01T14:16:18+00:00"
}