{
  "url": "https://voxday.net/2024/02/04/castalia-library-stacks/",
  "scraped_at": "2026-01-08T14:23:08.655007",
  "title": "Castalia Library Stacks",
  "date_display": "February 4, 2024",
  "date_iso": "2024-02-04T00:18:29+00:00",
  "date_from_url": "2024-02-04",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>We’re pleased to report a few new developments that will be of interest to Library and History subscribers. First, the test stamping of Castalia History Book 2 was successful and <a href=\"https://castalialibrary.substack.com/p/the-cambridge-medieval-history-v1\">you can see the results</a> at the new Castalia Library substack. These are promising to be our most aesthetically successful books yet. While we are still utilizing the mailing list and the LibraryThing group, too many subscribers have somehow been falling through the cracks, so we’ve created this new substack that everyone who is interested can follow either through the site or the emails.</p><div class=\"wp-block-image\"><figure class=\"aligncenter size-full\"><img alt=\"\" class=\"wp-image-61614\" decoding=\"async\" fetchpriority=\"high\" height=\"531\" sizes=\"(max-width: 512px) 100vw, 512px\" src=\"https://voxday.net/wp-content/uploads/2024/02/image-8.png\" srcset=\"https://voxday.net/wp-content/uploads/2024/02/image-8.png 512w, https://voxday.net/wp-content/uploads/2024/02/image-8-289x300.png 289w\" width=\"512\"/></figure></div><p>Second, since there won’t be daily updates, at least not until we’re doing a LOT more books, we are going to be serializing one of our Library books there. There isn’t much point in doing <em>Dracula</em>, since there is already an extremely popular substack dedicated to serializing that, so we’re giving you the choice of one of four current or coming Library/History books. There is a poll there running for the next two days, so feel free <a href=\"https://castalialibrary.substack.com/p/a-library-serialized\">to make your voice heard</a>.</p><ul class=\"wp-block-list\"><li><em>DISCOURSES ON LIVY</em> by Niccolo Machiavelli</li><li><em>STUDIES ON THE NAPOLEONIC WARS</em> by Sir Charles Oman</li><li><em>PRIDE AND PREJUDICE</em> by Jane Austen</li><li><em>WAR AND PEACE</em> by Leo Tolstoy</li></ul><p>And third, speaking of serialization, we’ve set up a substack <a href=\"https://juniorclassics.substack.com/\">dedicated to the Junior Classics</a>. This may or may not be of any interest to those who already have them, in leather, hardcover, or ebook, but we think it is a good way of helping bring them to the attention of homeschool parents and others who have never heard of the Junior Classics.</p><p>If you’re wondering why we’re utilizing Substack now, the fact that <a href=\"https://sigmagame.substack.com/\">the Sigma Game substack</a> already has 137k views in little more than two weeks should suffice to explain it. I expect it to surpass this blog in terms of traffic by the time the book comes out.</p><p>We’re also working hard on getting production caught up, and the leathers for both volumes of War and Peace as well as four other books are being ordered now that we have the final size of the interiors. On the bindery front, both hubbing tools have been made and the first one will be tested as soon as the coming week. That’s the last major challenge we face before Team Europe can start tackling <em>The Iliad</em> and <em>The Odyssey</em>.</p><p><em><a href=\"https://social.infogalactic.com/micropost/5f7e1d5a-9fb1-48b5-85b5-2fee56b8c814\">DISCUSS ON SG</a></em></p></div>",
  "content_text": "We’re pleased to report a few new developments that will be of interest to Library and History subscribers. First, the test stamping of Castalia History Book 2 was successful and\nyou can see the results\nat the new Castalia Library substack. These are promising to be our most aesthetically successful books yet. While we are still utilizing the mailing list and the LibraryThing group, too many subscribers have somehow been falling through the cracks, so we’ve created this new substack that everyone who is interested can follow either through the site or the emails.\nSecond, since there won’t be daily updates, at least not until we’re doing a LOT more books, we are going to be serializing one of our Library books there. There isn’t much point in doing\nDracula\n, since there is already an extremely popular substack dedicated to serializing that, so we’re giving you the choice of one of four current or coming Library/History books. There is a poll there running for the next two days, so feel free\nto make your voice heard\n.\nDISCOURSES ON LIVY\nby Niccolo Machiavelli\nSTUDIES ON THE NAPOLEONIC WARS\nby Sir Charles Oman\nPRIDE AND PREJUDICE\nby Jane Austen\nWAR AND PEACE\nby Leo Tolstoy\nAnd third, speaking of serialization, we’ve set up a substack\ndedicated to the Junior Classics\n. This may or may not be of any interest to those who already have them, in leather, hardcover, or ebook, but we think it is a good way of helping bring them to the attention of homeschool parents and others who have never heard of the Junior Classics.\nIf you’re wondering why we’re utilizing Substack now, the fact that\nthe Sigma Game substack\nalready has 137k views in little more than two weeks should suffice to explain it. I expect it to surpass this blog in terms of traffic by the time the book comes out.\nWe’re also working hard on getting production caught up, and the leathers for both volumes of War and Peace as well as four other books are being ordered now that we have the final size of the interiors. On the bindery front, both hubbing tools have been made and the first one will be tested as soon as the coming week. That’s the last major challenge we face before Team Europe can start tackling\nThe Iliad\nand\nThe Odyssey\n.\nDISCUSS ON SG",
  "tags": [
    "books",
    "Castalia House"
  ],
  "categories": [],
  "sitemap_lastmod": "2024-02-04T01:13:06+00:00"
}