{
  "url": "https://voxday.net/2024/02/04/ethnic-cleansing-in-the-eu/",
  "scraped_at": "2026-01-08T14:23:10.540863",
  "title": "Ethnic Cleansing in the EU",
  "date_display": "February 4, 2024",
  "date_iso": "2024-02-04T11:20:09+00:00",
  "date_from_url": "2024-02-04",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>If you ever wonder why I expect that the tens of millions of Arab and African migrants who have invaded Europe will not be permitted to stay there permanently, note that <a href=\"https://www.rt.com/russia/591697-latvia-deports-russian-speaking-residents/\">an EU state has already begun</a> the process of deporting large numbers of unwanted foreign residents.</p><blockquote class=\"wp-block-quote is-layout-flow wp-block-quote-is-layout-flow\"><p>Latvia is attempting to deport thousands of Russian-speaking people – and apparently, these ‘purges’ affect not only newcomers who have recently applied for a residency permit, but people who have lived in the country their entire lives.</p><p><em>The New York Times</em> recently told the story of Russian-speaking widow Nina Marcinkevica, who was born in Latvia 63 years ago, when the Baltic republic was still part of the Soviet Union. She married and raised a family there, and has never lived anywhere else. Nina resides in the predominantly Russian-speaking city of Daugavpils in the eastern part of the country. In the fall, she received an official notice stating that she had lost her rights to residency, her state pension, and medical care. “You must leave the territory of the Republic of Latvia by November 30, 2023,” the letter stated.</p><p>The Latvian authorities have the opportunity to expel Marcinkevica due to her Russian citizenship. Over 3,200 Russian nationals living in Latvia received notifications about potential deportation in early October, according to the news portal Rus.lsm.lv.</p></blockquote><p>This isn’t the outrage it is portrayed to be. The Latvian people absolutely have the right to their own country, and no Russian or any other non-Latvian has the right to invade their borders or reside among them if the Latvian people don’t want them there. Particularly in a democracy, even a limited representative democracy, mass immigration and the free movement of people cannot be permitted by any nation which wishes to survive as a nation.</p><p>But it is incredibly hypocritical, given the way in which the EU authorities have, despite the clear opposition of the majority of its peoples, encouraged the mass invasion of the European nations. Which means that even in the unlikely event that the EU doesn’t collapse in the next ten years, a clear legal precedent has been set for the mass repatriation of migrant populations that have proven to be incompatible with the languages, laws, and cultural traditions of the host nation.</p><p>Finland appears to be following Latvia’s lead, as it plans to pass a law banning Russians from acquiring property in Finland. No doubt repatriations will soon follow.</p><p><em>Finland is preparing to completely prohibit Russian citizens from purchasing real estate in the country, Defense Minister Antti Hakkanen said in a statement published on Finland’s official government website on Friday.</em></p><p>In truth, given current economic and cultural trajectories, the children of those Russians expelled from Latvia or Finland will probably be deeply grateful that their parents returned to Mother Russia, however involuntarily the return.</p><p><em><a href=\"https://social.infogalactic.com/micropost/7b2b2c97-ec18-4f8e-b7eb-c788e0fefe2d\">DISCUSS ON SG</a></em></p></div>",
  "content_text": "If you ever wonder why I expect that the tens of millions of Arab and African migrants who have invaded Europe will not be permitted to stay there permanently, note that\nan EU state has already begun\nthe process of deporting large numbers of unwanted foreign residents.\nLatvia is attempting to deport thousands of Russian-speaking people – and apparently, these ‘purges’ affect not only newcomers who have recently applied for a residency permit, but people who have lived in the country their entire lives.\nThe New York Times\nrecently told the story of Russian-speaking widow Nina Marcinkevica, who was born in Latvia 63 years ago, when the Baltic republic was still part of the Soviet Union. She married and raised a family there, and has never lived anywhere else. Nina resides in the predominantly Russian-speaking city of Daugavpils in the eastern part of the country. In the fall, she received an official notice stating that she had lost her rights to residency, her state pension, and medical care. “You must leave the territory of the Republic of Latvia by November 30, 2023,” the letter stated.\nThe Latvian authorities have the opportunity to expel Marcinkevica due to her Russian citizenship. Over 3,200 Russian nationals living in Latvia received notifications about potential deportation in early October, according to the news portal Rus.lsm.lv.\nThis isn’t the outrage it is portrayed to be. The Latvian people absolutely have the right to their own country, and no Russian or any other non-Latvian has the right to invade their borders or reside among them if the Latvian people don’t want them there. Particularly in a democracy, even a limited representative democracy, mass immigration and the free movement of people cannot be permitted by any nation which wishes to survive as a nation.\nBut it is incredibly hypocritical, given the way in which the EU authorities have, despite the clear opposition of the majority of its peoples, encouraged the mass invasion of the European nations. Which means that even in the unlikely event that the EU doesn’t collapse in the next ten years, a clear legal precedent has been set for the mass repatriation of migrant populations that have proven to be incompatible with the languages, laws, and cultural traditions of the host nation.\nFinland appears to be following Latvia’s lead, as it plans to pass a law banning Russians from acquiring property in Finland. No doubt repatriations will soon follow.\nFinland is preparing to completely prohibit Russian citizens from purchasing real estate in the country, Defense Minister Antti Hakkanen said in a statement published on Finland’s official government website on Friday.\nIn truth, given current economic and cultural trajectories, the children of those Russians expelled from Latvia or Finland will probably be deeply grateful that their parents returned to Mother Russia, however involuntarily the return.\nDISCUSS ON SG",
  "tags": [
    "EU",
    "immigration",
    "law",
    "Russia"
  ],
  "categories": [],
  "sitemap_lastmod": "2024-02-04T11:25:06+00:00"
}