{
  "url": "https://voxday.net/2024/02/26/false-metrics-false-conclusions/",
  "scraped_at": "2026-01-08T14:25:26.012416",
  "title": "False Metrics, False Conclusions",
  "date_display": "February 26, 2024",
  "date_iso": "2024-02-26T10:38:08+00:00",
  "date_from_url": "2024-02-26",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>As has been repeatedly pointed out by Owen and others, the more one lies, the more one loses the ability to recognize the truth even when it is staring one right in the face. The idea that China’s economy is collapsing, and therefore the Chinese Communist Party is on the verge of succumbing to a populist color revolution that will produce a neoliberal democratic government subservient to Clown World, has been floated persistently ever since Xi Jinping cancelled the planned “Jump to China” in 2015. A recent <em>Washington Post</em> article is only <a href=\"https://www.washingtonpost.com/opinions/2024/02/21/china-economy-demographics-us-china-trade/\">the latest example</a> of this economic illiteracy:</p><blockquote class=\"wp-block-quote is-layout-flow wp-block-quote-is-layout-flow\"><p>Economists have started revising their predictions on when China might overtake the U.S. economically — and if it ever will. Despite Mr. Xi lifting the world’s most draconian covid-19 restrictions at the end of 2022, construction in China has slowed, manufacturing prices have declined and consumer spending has flattened. China’s stock market has lost $6 trillion in value in three years. A dozen cities and provinces have been told to halt construction of infrastructure projects — cutting into their main source of revenue.</p><p>The biggest economic threat has come from the slowdown in the property market. Building has slowed, and more than 50 major developers are either out of cash or have defaulted. Fears abound of insolvencies leaving millions of unfinished housing projects… China recorded a respectable 5.2 percent economic growth rate last year, but the real rate is lower when adjusted for falling prices. Rather than being an economic juggernaut, China seems likely to be entering a period of deflation, the sorts of conditions that led to Japan’s “lost decade.”</p> <cite>Xi is Taking China’s Economy, WASHINGTON POST, 21 February 2024</cite></blockquote><p><strong>Translation into Sane Economics:</strong> China is doing exactly what the USA should have done back in 2008 or sooner. It is clearing the bad debt out of its economy, refusing to prop up bankrupt corporations, and preventing further malinvestment from taking place.</p><p>This isn’t merely feel-good propaganda for neoclowns in Washington, it’s economic illiteracy and evidence that the <em>Washington Post </em>can’t even get its neo-Samuelsonian economics right. Note that the real economic growth rate is not LOWER than 5.2 percent when adjusted for falling prices, it is HIGHER. Growth rates measure GDP, which are priced in currency. So when prices increase, the real GDP and the real growth rate are lower. When prices fall, the real GDP and the real growth rate are higher.</p><p>Remember, modern neo-Samuelsonian economics <em>do not take debt into account</em>, not even when the vast majority of the money supply is comprised of credit-money rather than gold or paper money. Which is why, in Clown World economics, borrowing and spending money that is created out of thin air counts as economic growth, and writing off bad debt counts as economic contraction.</p><p>Just as trade wars are GDP-beneficial for nations with trade deficits, deflation is real growth rate-beneficial for nations with credit money. <em>Russia Today</em> <a href=\"https://www.rt.com/news/593120-xi-china-economy-destroy/\">knows better too</a>:</p><blockquote class=\"wp-block-quote is-layout-flow wp-block-quote-is-layout-flow\"><p>If there’s one thoroughly unoriginal strand of thought on China present in the mainstream media today, it is the idea that China’s economy has been wrecked, and that Xi Jinping’s policies are to blame. Such commentary, pushed by every major mainstream outlet on a weekly basis, frequently promotes a narrative of the “end” of China’s rise, often talks about “decline” and squarely places responsibility on Xi Jinping, who supposedly ended the dynamic of an open and prosperous China for increasingly centralized, authoritarian rule and a return to communist fundamentals.</p><p>Such an article was pushed this week by the editorial board of the Washington Post, in a piece titled “Xi is tanking China’s economy. That’s bad for the US”. The article was hardly original in its premise, stating the above argument pretty much word for word…</p><p>First, what is always, always ignored is that Xi Jinping deliberately set about changing the structure of China’s economy in order to end a growth boom based solely on real estate and debt. The newspapers love to waffle on about the “real estate crisis” and Evergrande, but can you imagine how big the problem would have been had previous policies been continued and China pushed for obscene 10% growth targets based on an explosion of debt? Xi Jinping ended this and initiated a process of deleveraging which deliberately slowed down China’s economic growth to around 6% when he came to power. Why? Because debt is not a sustainable mechanism and his policy has been literally to push the real estate industry into a managed recession, even if that has short-term repercussions.</p><p>Secondly, Xi Jinping’s policy has been to reinvent China’s economy to meet upcoming challenges by transforming it from a low end, export, real estate boom economy, into a high-end technological powerhouse. Instead of investing aimlessly in local government real estate booms, China has redirected state money to building up high-value industries including renewable energy, computing, semiconductors, automobiles, aviation, among other things. It is primarily this bid to become the global technological leader (by default of size) that has triggered the backlash from the US on an economic level and thus the bid to try and cripple China’s technological advance through export controls, which in fact show little evidence of working.</p> <cite>Xi isn’t destroying China’s economy – he’s changing it, RUSSIA TODAY, 26 February 2024</cite></blockquote><p>Just as everything looks like a nail to the man whose only tool is a hammer, the Neo-Samuelsonians of Clown World do not understand any economic policy that does not rely upon expanding the money supply and increasing GDP through the issuance of more debt. Which, of course, is why they neither see nor understand that China’s economy is neither contracting nor collapsing, it is rather being cleansed of bad debt and reconfigured into a more realistic economy capable of providing genuine economic growth as measured in production, real goods, and manufacturing capacity rather than in money, fake services, and ever-increasing credit.</p><p>China is not following the Japanese example; to the contrary, it is doing the precise opposite and refusing to prop up its zombie banks and overleveraged corporations. The fact that Xi Jinping has the wits and the courage to do what neither Ben Bernanke nor any US President has had the wisdom to do should not concern the neoclowns. It should absolutely terrify them, because it means that Clown World will have absolutely no chance whatsoever to even begin to make up <a href=\"https://www.americanmachinist.com/news/article/21283444/global-steel-production-inches-forward-world-steel-assn-january-2024\">its massive steel-production</a> and manufacturing-capacity disadvantages vis-a-vis China.</p><p>Remember, the economists who are telling you that China’s economy is collapsing are the same economists who told you Western sanctions were going to cripple the Russian economy. Their axioms are incorrect, their metrics are false, and therefore, their conclusions are guaranteed to be wrong.</p><div class=\"wp-block-image\"><figure class=\"aligncenter size-full\"><img alt=\"\" class=\"wp-image-61969\" decoding=\"async\" fetchpriority=\"high\" height=\"512\" sizes=\"(max-width: 512px) 100vw, 512px\" src=\"https://voxday.net/wp-content/uploads/2024/02/image-61.png\" srcset=\"https://voxday.net/wp-content/uploads/2024/02/image-61.png 512w, https://voxday.net/wp-content/uploads/2024/02/image-61-300x300.png 300w, https://voxday.net/wp-content/uploads/2024/02/image-61-150x150.png 150w\" width=\"512\"><figcaption class=\"wp-element-caption\"><em>Unlike the USA, China is dumping its bad debt.</em></figcaption></img></figure></div><p><em><a href=\"https://social.infogalactic.com/micropost/79bb692e-e359-45c7-a728-caf0c9d6a6c0\">DISCUSS ON SG</a></em></p></div>",
  "content_text": "As has been repeatedly pointed out by Owen and others, the more one lies, the more one loses the ability to recognize the truth even when it is staring one right in the face. The idea that China’s economy is collapsing, and therefore the Chinese Communist Party is on the verge of succumbing to a populist color revolution that will produce a neoliberal democratic government subservient to Clown World, has been floated persistently ever since Xi Jinping cancelled the planned “Jump to China” in 2015. A recent\nWashington Post\narticle is only\nthe latest example\nof this economic illiteracy:\nEconomists have started revising their predictions on when China might overtake the U.S. economically — and if it ever will. Despite Mr. Xi lifting the world’s most draconian covid-19 restrictions at the end of 2022, construction in China has slowed, manufacturing prices have declined and consumer spending has flattened. China’s stock market has lost $6 trillion in value in three years. A dozen cities and provinces have been told to halt construction of infrastructure projects — cutting into their main source of revenue.\nThe biggest economic threat has come from the slowdown in the property market. Building has slowed, and more than 50 major developers are either out of cash or have defaulted. Fears abound of insolvencies leaving millions of unfinished housing projects… China recorded a respectable 5.2 percent economic growth rate last year, but the real rate is lower when adjusted for falling prices. Rather than being an economic juggernaut, China seems likely to be entering a period of deflation, the sorts of conditions that led to Japan’s “lost decade.”\nXi is Taking China’s Economy, WASHINGTON POST, 21 February 2024\nTranslation into Sane Economics:\nChina is doing exactly what the USA should have done back in 2008 or sooner. It is clearing the bad debt out of its economy, refusing to prop up bankrupt corporations, and preventing further malinvestment from taking place.\nThis isn’t merely feel-good propaganda for neoclowns in Washington, it’s economic illiteracy and evidence that the\nWashington Post\ncan’t even get its neo-Samuelsonian economics right. Note that the real economic growth rate is not LOWER than 5.2 percent when adjusted for falling prices, it is HIGHER. Growth rates measure GDP, which are priced in currency. So when prices increase, the real GDP and the real growth rate are lower. When prices fall, the real GDP and the real growth rate are higher.\nRemember, modern neo-Samuelsonian economics\ndo not take debt into account\n, not even when the vast majority of the money supply is comprised of credit-money rather than gold or paper money. Which is why, in Clown World economics, borrowing and spending money that is created out of thin air counts as economic growth, and writing off bad debt counts as economic contraction.\nJust as trade wars are GDP-beneficial for nations with trade deficits, deflation is real growth rate-beneficial for nations with credit money.\nRussia Today\nknows better too\n:\nIf there’s one thoroughly unoriginal strand of thought on China present in the mainstream media today, it is the idea that China’s economy has been wrecked, and that Xi Jinping’s policies are to blame. Such commentary, pushed by every major mainstream outlet on a weekly basis, frequently promotes a narrative of the “end” of China’s rise, often talks about “decline” and squarely places responsibility on Xi Jinping, who supposedly ended the dynamic of an open and prosperous China for increasingly centralized, authoritarian rule and a return to communist fundamentals.\nSuch an article was pushed this week by the editorial board of the Washington Post, in a piece titled “Xi is tanking China’s economy. That’s bad for the US”. The article was hardly original in its premise, stating the above argument pretty much word for word…\nFirst, what is always, always ignored is that Xi Jinping deliberately set about changing the structure of China’s economy in order to end a growth boom based solely on real estate and debt. The newspapers love to waffle on about the “real estate crisis” and Evergrande, but can you imagine how big the problem would have been had previous policies been continued and China pushed for obscene 10% growth targets based on an explosion of debt? Xi Jinping ended this and initiated a process of deleveraging which deliberately slowed down China’s economic growth to around 6% when he came to power. Why? Because debt is not a sustainable mechanism and his policy has been literally to push the real estate industry into a managed recession, even if that has short-term repercussions.\nSecondly, Xi Jinping’s policy has been to reinvent China’s economy to meet upcoming challenges by transforming it from a low end, export, real estate boom economy, into a high-end technological powerhouse. Instead of investing aimlessly in local government real estate booms, China has redirected state money to building up high-value industries including renewable energy, computing, semiconductors, automobiles, aviation, among other things. It is primarily this bid to become the global technological leader (by default of size) that has triggered the backlash from the US on an economic level and thus the bid to try and cripple China’s technological advance through export controls, which in fact show little evidence of working.\nXi isn’t destroying China’s economy – he’s changing it, RUSSIA TODAY, 26 February 2024\nJust as everything looks like a nail to the man whose only tool is a hammer, the Neo-Samuelsonians of Clown World do not understand any economic policy that does not rely upon expanding the money supply and increasing GDP through the issuance of more debt. Which, of course, is why they neither see nor understand that China’s economy is neither contracting nor collapsing, it is rather being cleansed of bad debt and reconfigured into a more realistic economy capable of providing genuine economic growth as measured in production, real goods, and manufacturing capacity rather than in money, fake services, and ever-increasing credit.\nChina is not following the Japanese example; to the contrary, it is doing the precise opposite and refusing to prop up its zombie banks and overleveraged corporations. The fact that Xi Jinping has the wits and the courage to do what neither Ben Bernanke nor any US President has had the wisdom to do should not concern the neoclowns. It should absolutely terrify them, because it means that Clown World will have absolutely no chance whatsoever to even begin to make up\nits massive steel-production\nand manufacturing-capacity disadvantages vis-a-vis China.\nRemember, the economists who are telling you that China’s economy is collapsing are the same economists who told you Western sanctions were going to cripple the Russian economy. Their axioms are incorrect, their metrics are false, and therefore, their conclusions are guaranteed to be wrong.\nUnlike the USA, China is dumping its bad debt.\nDISCUSS ON SG",
  "tags": [
    "China",
    "economics"
  ],
  "categories": [],
  "sitemap_lastmod": "2024-02-26T11:57:10+00:00"
}