{
  "url": "https://voxday.net/2024/02/11/free-trade-is-economic-heroin/",
  "scraped_at": "2026-01-08T14:23:54.761124",
  "title": "Free Trade is Economic Heroin",
  "date_display": "February 11, 2024",
  "date_iso": "2024-02-11T11:21:03+00:00",
  "date_from_url": "2024-02-11",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>In all the many defenses of Free Trade going back to David Ricardo and his fatally-flawed concept of Comparative Advantage, and in all of the critiques going back to the 18th century mercantilists, one of the issues that no one either side of the economic issue ever seems to discuss is the inherent fragility of free trade and the way in which that fragility is imposed upon the economies of nations foolish enough to adopt a free trade policy.</p><p>I’ve already laid out, in statistically-significant detail, the proof of the total incompatibility of free trade with nationhood, in my Efficiency of Labor Mobility critique of free trade. But the scale and scope of that argument, combined with its requirement to have a basic grasp of neo-Keynesian economic theory, has proven to be well beyond the average individual and the average free trade economist alike. Lest you think I exaggerate, the total inability of the author of an introductory textbook on Austrian Economics to understand the critique, let alone formulate a response to it, really has to be read in order to be believed.</p><p>But <a href=\"https://www.rt.com/news/592247-eu-leaders-threatened-hungary/\">the European Union’s successful attempt</a> to force the Hungarian government to approve its economic aid package for Ukraine demonstrates another fundamental problem with free trade that even the average heroin addict is able to comprehend. It goes well beyond the obvious problem that many have previously observed with the regards to the way in which free trade can result in needing to buy weapons and raw materials from a trading partner with whom one is at war.</p><blockquote class=\"wp-block-quote is-layout-flow wp-block-quote-is-layout-flow\"><p>Several EU heads of state directly told Hungarian Prime Minister Viktor Orban that they would crash the Hungarian economy if he blocked a €50 billion ($54 billion) economic aid package for Ukraine, his adviser, Balazs Orban, has revealed.</p><p>EU leaders signed off on the mammoth four-year aid package earlier this month, after the Hungarian leader lifted his veto in exchange for some minor concessions from the bloc’s 26 other member states. These concessions included an annual debate on its implementation and a promise to review its impact on the EU budget after two years.</p><p>Before the package was approved, the <em>Financial Times</em> reported that the European Council had drawn up a plan to cut funding to Budapest and tank the Hungarian economy if Budapest maintained its veto. According to the <em>Financial Times</em>, the EU planned on pulling funding from Hungary, thereby hampering its ability to subsidize foreign direct investment and eventually crashing the value of the Hungarian forint.</p> <cite>EU leaders threatened to ‘politically rape’ us – Hungary, RUSSIA TODAY, 10 February 2024</cite></blockquote><p>In other words, since the Hungarian government foolishly permitted itself to become dependent upon the transfer of free money created <em>ex nihilo</em> by German banks, it now no longer has the ability to establish its own policies in the interest of the citizens of Hungary. Hungary might as well be a heroin addict attempting to defy the wishes of his heroin dealer.</p><p>This illustrates both the anti-democratic nature of free trade and usefully explains why Clown World is so hell-bent on imposing free trade policies everywhere from Azerbaijan to Zambia. Once Clown World can get a nation hooked on its destructive economic drug, it can literally dictate that nation’s policy. Only going clean, like Russia was inadvertently forced to do by the sanctions regime enforced by the West, can free an economy from the external chains and intrinsic fragility imposed by free trade.</p><p>Free trade is economic heroin for a nation. It might make things feel good for a while, but it’s very bad for your health and will eventually kill you if you don’t get off of it.</p><p><em><a href=\"https://social.infogalactic.com/micropost/3f8d2411-0ac6-45c3-998e-9339000def1f\">DISCUSS ON SG</a></em></p></div>",
  "content_text": "In all the many defenses of Free Trade going back to David Ricardo and his fatally-flawed concept of Comparative Advantage, and in all of the critiques going back to the 18th century mercantilists, one of the issues that no one either side of the economic issue ever seems to discuss is the inherent fragility of free trade and the way in which that fragility is imposed upon the economies of nations foolish enough to adopt a free trade policy.\nI’ve already laid out, in statistically-significant detail, the proof of the total incompatibility of free trade with nationhood, in my Efficiency of Labor Mobility critique of free trade. But the scale and scope of that argument, combined with its requirement to have a basic grasp of neo-Keynesian economic theory, has proven to be well beyond the average individual and the average free trade economist alike. Lest you think I exaggerate, the total inability of the author of an introductory textbook on Austrian Economics to understand the critique, let alone formulate a response to it, really has to be read in order to be believed.\nBut\nthe European Union’s successful attempt\nto force the Hungarian government to approve its economic aid package for Ukraine demonstrates another fundamental problem with free trade that even the average heroin addict is able to comprehend. It goes well beyond the obvious problem that many have previously observed with the regards to the way in which free trade can result in needing to buy weapons and raw materials from a trading partner with whom one is at war.\nSeveral EU heads of state directly told Hungarian Prime Minister Viktor Orban that they would crash the Hungarian economy if he blocked a €50 billion ($54 billion) economic aid package for Ukraine, his adviser, Balazs Orban, has revealed.\nEU leaders signed off on the mammoth four-year aid package earlier this month, after the Hungarian leader lifted his veto in exchange for some minor concessions from the bloc’s 26 other member states. These concessions included an annual debate on its implementation and a promise to review its impact on the EU budget after two years.\nBefore the package was approved, the\nFinancial Times\nreported that the European Council had drawn up a plan to cut funding to Budapest and tank the Hungarian economy if Budapest maintained its veto. According to the\nFinancial Times\n, the EU planned on pulling funding from Hungary, thereby hampering its ability to subsidize foreign direct investment and eventually crashing the value of the Hungarian forint.\nEU leaders threatened to ‘politically rape’ us – Hungary, RUSSIA TODAY, 10 February 2024\nIn other words, since the Hungarian government foolishly permitted itself to become dependent upon the transfer of free money created\nex nihilo\nby German banks, it now no longer has the ability to establish its own policies in the interest of the citizens of Hungary. Hungary might as well be a heroin addict attempting to defy the wishes of his heroin dealer.\nThis illustrates both the anti-democratic nature of free trade and usefully explains why Clown World is so hell-bent on imposing free trade policies everywhere from Azerbaijan to Zambia. Once Clown World can get a nation hooked on its destructive economic drug, it can literally dictate that nation’s policy. Only going clean, like Russia was inadvertently forced to do by the sanctions regime enforced by the West, can free an economy from the external chains and intrinsic fragility imposed by free trade.\nFree trade is economic heroin for a nation. It might make things feel good for a while, but it’s very bad for your health and will eventually kill you if you don’t get off of it.\nDISCUSS ON SG",
  "tags": [
    "Clown World",
    "economics",
    "EU",
    "free trade"
  ],
  "categories": [],
  "sitemap_lastmod": "2024-02-11T11:57:25+00:00"
}