{
  "url": "https://voxday.net/2024/02/23/he-is-now/",
  "scraped_at": "2026-01-08T14:25:08.375306",
  "title": "He is Now",
  "date_display": "February 23, 2024",
  "date_iso": "2024-02-23T12:51:14+00:00",
  "date_from_url": "2024-02-23",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>Fred Reed explains how <a href=\"https://fredoneverything.org/here-we-go-again-in-the-holy-land/\">the Gazacaust is manufacturing anti-semites</a> around the world.</p><blockquote class=\"wp-block-quote is-layout-flow wp-block-quote-is-layout-flow\"><p>What kind of human will intentionally bomb a hospital? Or a refugee camp? Is there nothing so foul that an Israeli pilot will not do it? What could be more cowardly? What would it take to get you, the reader, to bomb a hospital?</p><p>Of course it is not the scale of what Israel is doing, but the dogged, unrelenting coldbloodedness of it, its shamelessness. It would never occur to a military man, Israeli or otherwise, to say, “No, I won’t do that.” In my decades of covering the armed forces I found officers often to be long on physical courage but almost always to lack moral courage. Soldiers pride themselves on following orders and if the orders are to bomb a refugee camp, well, the pilot was just following orders. This is what Eichmann said, though he wasn’t a soldier. The cult of obedience removes all moral responsibility.</p><p>Note that Washington is as culpable as Israel for the slaughter in Gaza. Israel depends utterly for its survival on American support. If Washington told the Israelis to stand on their heads buck naked and sing Yankee Doodle in three-part harmony, or lose all American support, in two minutes they would be upside down and wailing. The killing continues because Washington wants it to continue.</p><p>The historically literate will note that the mass deliberate bombing of civilians is not particularly Israeli, but an invention largely made and certainly perfected by the United States. The British-American air war against Germany targeted civilians. Everyone knows about the firestorms in Hamburg and Dresden, and for that matter Hiroshima and Nagasaki, though countless other German cities were so targeted, with Tokyo being firebombed to burn thousands to death. Germans who lived through this tell of exactly the results seen in Gaza, rubble, fire, dead and dying children. <em>Plus ca change, plus ca doesn’t</em>.</p><p>The eternal cry of the Jew: “The whole world hates me. What’s wrong with the whole world?” Well, here is an answer that will serve for a few decades. Before Gaza, there was around the web the usual low-key hostility to Jews, like the 4K background radiation. Now nice liberals make venomous comments about how Hitler should have finished, etc. For all I know, ninety percent of American Jews may oppose the killing, and certainly many do, but this doesn’t seem to matter. Selling the Holocaust will be harder for a few years. It will make no practical difference.</p><p>It is easy to see why. A friend, conservative, by no means a milquetoast, for a while watched video from Gaza. He saw a little girl, horribly hurt, legs gone but still alive, with adults, apparently her family, going stark bugfuck crazy. The child would not live for more than a minute or two, massive femoral bleeding being of short duration. My friend began sobbing, not his style.</p><p>Never an antisemite, he is now.</p> <cite>Here We Go Again, FRED REED, 24 January 2024</cite></blockquote><p>Being historically literate, I’ve never given a fragment of an airborne rodent’s posterior for the so-called “Holocaust” or bought into the endless pity party of things that happened eight decades ago. I even pointed out, correctly, that no one under the age of 40 is emotionally moved by appeals to the Holocaust, the endless Boomerism of the mainstream media narrative notwithstanding, in a public debate with a former British Member of Parliament.</p><p>But the Gazacaust is happening <em>right now</em>. The pointless sacrifice of hundreds of thousands of Ukrainian lives on the altar of Clown World by the Kiev regime is happening <em>right now</em>. The foreign invasion of the United States has been happening <em>right now</em>. These are the events that will shape the future, not a shameless, outdated appeal to victimhood that somehow still dominates the political scene and dictates the laws in the USA, the UK, and the rest of Clown World.</p><p>No matter how one wants to believe oneself to be a good person, subscribing to all the right beliefs and approved narratives, sooner or later, everyone will be forced to make the decision whether they are going to recognize evil to be evil, or if they are going to declare it to be good.</p><div class=\"wp-block-image\"><figure class=\"aligncenter size-full\"><img alt=\"\" class=\"wp-image-61924\" decoding=\"async\" fetchpriority=\"high\" height=\"322\" sizes=\"(max-width: 512px) 100vw, 512px\" src=\"https://voxday.net/wp-content/uploads/2024/02/image-56.png\" srcset=\"https://voxday.net/wp-content/uploads/2024/02/image-56.png 512w, https://voxday.net/wp-content/uploads/2024/02/image-56-300x189.png 300w\" width=\"512\"/></figure></div><p><em><a href=\"https://social.infogalactic.com/micropost/2bf5f451-d789-4ac7-beaa-c05b0ad1ad09\">DISCUSS ON SG</a></em></p></div>",
  "content_text": "Fred Reed explains how\nthe Gazacaust is manufacturing anti-semites\naround the world.\nWhat kind of human will intentionally bomb a hospital? Or a refugee camp? Is there nothing so foul that an Israeli pilot will not do it? What could be more cowardly? What would it take to get you, the reader, to bomb a hospital?\nOf course it is not the scale of what Israel is doing, but the dogged, unrelenting coldbloodedness of it, its shamelessness. It would never occur to a military man, Israeli or otherwise, to say, “No, I won’t do that.” In my decades of covering the armed forces I found officers often to be long on physical courage but almost always to lack moral courage. Soldiers pride themselves on following orders and if the orders are to bomb a refugee camp, well, the pilot was just following orders. This is what Eichmann said, though he wasn’t a soldier. The cult of obedience removes all moral responsibility.\nNote that Washington is as culpable as Israel for the slaughter in Gaza. Israel depends utterly for its survival on American support. If Washington told the Israelis to stand on their heads buck naked and sing Yankee Doodle in three-part harmony, or lose all American support, in two minutes they would be upside down and wailing. The killing continues because Washington wants it to continue.\nThe historically literate will note that the mass deliberate bombing of civilians is not particularly Israeli, but an invention largely made and certainly perfected by the United States. The British-American air war against Germany targeted civilians. Everyone knows about the firestorms in Hamburg and Dresden, and for that matter Hiroshima and Nagasaki, though countless other German cities were so targeted, with Tokyo being firebombed to burn thousands to death. Germans who lived through this tell of exactly the results seen in Gaza, rubble, fire, dead and dying children.\nPlus ca change, plus ca doesn’t\n.\nThe eternal cry of the Jew: “The whole world hates me. What’s wrong with the whole world?” Well, here is an answer that will serve for a few decades. Before Gaza, there was around the web the usual low-key hostility to Jews, like the 4K background radiation. Now nice liberals make venomous comments about how Hitler should have finished, etc. For all I know, ninety percent of American Jews may oppose the killing, and certainly many do, but this doesn’t seem to matter. Selling the Holocaust will be harder for a few years. It will make no practical difference.\nIt is easy to see why. A friend, conservative, by no means a milquetoast, for a while watched video from Gaza. He saw a little girl, horribly hurt, legs gone but still alive, with adults, apparently her family, going stark bugfuck crazy. The child would not live for more than a minute or two, massive femoral bleeding being of short duration. My friend began sobbing, not his style.\nNever an antisemite, he is now.\nHere We Go Again, FRED REED, 24 January 2024\nBeing historically literate, I’ve never given a fragment of an airborne rodent’s posterior for the so-called “Holocaust” or bought into the endless pity party of things that happened eight decades ago. I even pointed out, correctly, that no one under the age of 40 is emotionally moved by appeals to the Holocaust, the endless Boomerism of the mainstream media narrative notwithstanding, in a public debate with a former British Member of Parliament.\nBut the Gazacaust is happening\nright now\n. The pointless sacrifice of hundreds of thousands of Ukrainian lives on the altar of Clown World by the Kiev regime is happening\nright now\n. The foreign invasion of the United States has been happening\nright now\n. These are the events that will shape the future, not a shameless, outdated appeal to victimhood that somehow still dominates the political scene and dictates the laws in the USA, the UK, and the rest of Clown World.\nNo matter how one wants to believe oneself to be a good person, subscribing to all the right beliefs and approved narratives, sooner or later, everyone will be forced to make the decision whether they are going to recognize evil to be evil, or if they are going to declare it to be good.\nDISCUSS ON SG",
  "tags": [
    "history",
    "trainwreck",
    "Zion"
  ],
  "categories": [],
  "sitemap_lastmod": "2024-02-23T15:03:24+00:00"
}