{
  "url": "https://voxday.net/2024/02/29/mailvox-the-logic-of-the-cult-of-free/",
  "scraped_at": "2026-01-08T14:25:43.382143",
  "title": "Mailvox: The Logic of the Cult of Free",
  "date_display": "February 29, 2024",
  "date_iso": "2024-02-29T15:56:24+00:00",
  "date_from_url": "2024-02-29",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>I thought this <a href=\"https://gab.com/BeathalainnRed/posts/112009690326265811\">exchange with a member of the Cult of Free</a> who is upset over Torba’s very sensible decision to stop permitting users who pay nothing for Gab’s services to utilize them at considerable expense to Gab was informative, as it raised a basic philosophical issue that some people obviously fail to understand.</p><blockquote class=\"wp-block-quote is-layout-flow wp-block-quote-is-layout-flow\"><p><em>You might want to check and see how many of the “free cult” are among YOUR followers. Most paid users rely on their “free” followers to make people like you more “relevant” and give people like you a reason to pay to be here. The “free cult” also brings other people to Gab and some spend their money on products being sold on Gab. THAT is the REAL WORLD. Andrew Torba, paid users and “attention seekers” like yourself, are NOTHING without the “free cult”!</em></p><p>Totally wrong. I don’t care at all about the “free followers”. We have a community of more than 10,000, all of whom have skin in the game and are not only supportive, but reliable. Free followers are, by and large, useless cowards who abandon ship whenever their feelings get hurt.</p><p><em>I do hope all of the “free followers” read this and realize that they are considered “nothing” to people like you. Have fun in your imagined “important” world!</em></p></blockquote><p>So, do all of the so-called “free followers” here at VP realize that you are considered nothing to me? Have I failed to make that sufficiently clear to all and sundry? Are you fully cognizant of the fact that this blog existed before you were here, exists without any help or support from you now, and will continue to exist long after you cease visiting here?</p><p>Is everyone perfectly clear on that?</p><p>While I have nothing against people who read this site, or Sigma Game, or Castalia Library, or Castalia House, or the Arkhaven blog, or Arktoons, and still decide not to participate in or support any of our community’s various projects for what are no doubt very good reasons, I don’t regard them as being important, I don’t rely upon them in any way, and, in fact, I don’t think about them at all. They’re not on my radar.</p><p>If you’re not involved, you are irrelevant. There’s nothing wrong, or even negative, about being irrelevant. You’re not a problem, you’re simply not a factor at all. For better or for worse, you don’t matter any more than some random individual in Ghana or Myanmar who has never heard of me.</p><p>Everyone is welcome to read this site for free. That’s literally what it’s here for. I would write here and post here even if there were only two or three people visiting the site every day instead of 30,000; it gives me no more and no less pleasure to go through the discipline of articulating my thoughts on a regular basis now than when there were only a few thousand pageviews a month back in 2003. But this site is just something I do for my own reasons, it is not a business, it employs no one, and it does not require any resources to make it work. <em>Die Gedanken, sie sind frei.</em></p><p>The Cult of Free was created by the false application of an outmoded business model to a series of government-funded data-mining platforms. It’s not a surprise that so many people were misled by this; even 30 years after Roland T. Rust and Richard W. Oliver published “The Death of Advertising” in Vol. 23, Issue No. 4 of the <em>Journal of Advertising</em>, the Cult of Free retards still think that sites like Gab can be funded by nonexistent advertising revenue.</p><p>They don’t realize that X has never, ever, made a profit. They aren’t aware that Google loses $2 billion or more on YouTube every year. And they have no idea how Meta actually makes its money. Silicon Valley’s One Million Eyeballs and Exit model was always fraudulent, on every single conceptual level, even though it appeared to work well for certain favored ticket-takers.</p><p>What is necessary, what is vital, what is absolutely required for an operation that is going to survive and thrive over the long haul is to build a community of 10,000 or more people and provide them with enough value for them to justify their moral and material support. We are very, very fortunate to have been able to do that, and it is my goal, every single day, to provide an excuse, a reason, or a justification for all of our supporters to continue with their support.</p><p>I don’t have the time or the bandwidth to think about those who not only don’t have skin in the game, they simply aren’t in the game at all. The value of the free content they create is zero. I know this for a fact, because when I shut down comments at this blog, all the same stupid arguments were mustered against it. I was “killing the blog” by shutting down the discourse here, or so they claimed. “Just as many people come to read the comments as read your posts,” they argued. The result: absolutely no change in traffic at all.</p><p>And here is how you know the so-called “support” of freeloaders is worthless: <em>they never even do the free and easy things they could be doing to benefit the community without spending a single dime.</em></p><p>This isn’t a request for anyone to do anything at all. It is merely an philosophical explanation.</p><div class=\"wp-block-image\"><figure class=\"aligncenter size-full\"><img alt=\"\" class=\"wp-image-62014\" decoding=\"async\" fetchpriority=\"high\" height=\"512\" sizes=\"(max-width: 512px) 100vw, 512px\" src=\"https://voxday.net/wp-content/uploads/2024/02/image-65.png\" srcset=\"https://voxday.net/wp-content/uploads/2024/02/image-65.png 512w, https://voxday.net/wp-content/uploads/2024/02/image-65-300x300.png 300w, https://voxday.net/wp-content/uploads/2024/02/image-65-150x150.png 150w\" width=\"512\"/></figure></div><p><em><a href=\"https://social.infogalactic.com/micropost/4cd34ce5-462d-4d2d-b32d-a10d759a0d74\">DISCUSS ON SG</a></em></p></div>",
  "content_text": "I thought this\nexchange with a member of the Cult of Free\nwho is upset over Torba’s very sensible decision to stop permitting users who pay nothing for Gab’s services to utilize them at considerable expense to Gab was informative, as it raised a basic philosophical issue that some people obviously fail to understand.\nYou might want to check and see how many of the “free cult” are among YOUR followers. Most paid users rely on their “free” followers to make people like you more “relevant” and give people like you a reason to pay to be here. The “free cult” also brings other people to Gab and some spend their money on products being sold on Gab. THAT is the REAL WORLD. Andrew Torba, paid users and “attention seekers” like yourself, are NOTHING without the “free cult”!\nTotally wrong. I don’t care at all about the “free followers”. We have a community of more than 10,000, all of whom have skin in the game and are not only supportive, but reliable. Free followers are, by and large, useless cowards who abandon ship whenever their feelings get hurt.\nI do hope all of the “free followers” read this and realize that they are considered “nothing” to people like you. Have fun in your imagined “important” world!\nSo, do all of the so-called “free followers” here at VP realize that you are considered nothing to me? Have I failed to make that sufficiently clear to all and sundry? Are you fully cognizant of the fact that this blog existed before you were here, exists without any help or support from you now, and will continue to exist long after you cease visiting here?\nIs everyone perfectly clear on that?\nWhile I have nothing against people who read this site, or Sigma Game, or Castalia Library, or Castalia House, or the Arkhaven blog, or Arktoons, and still decide not to participate in or support any of our community’s various projects for what are no doubt very good reasons, I don’t regard them as being important, I don’t rely upon them in any way, and, in fact, I don’t think about them at all. They’re not on my radar.\nIf you’re not involved, you are irrelevant. There’s nothing wrong, or even negative, about being irrelevant. You’re not a problem, you’re simply not a factor at all. For better or for worse, you don’t matter any more than some random individual in Ghana or Myanmar who has never heard of me.\nEveryone is welcome to read this site for free. That’s literally what it’s here for. I would write here and post here even if there were only two or three people visiting the site every day instead of 30,000; it gives me no more and no less pleasure to go through the discipline of articulating my thoughts on a regular basis now than when there were only a few thousand pageviews a month back in 2003. But this site is just something I do for my own reasons, it is not a business, it employs no one, and it does not require any resources to make it work.\nDie Gedanken, sie sind frei.\nThe Cult of Free was created by the false application of an outmoded business model to a series of government-funded data-mining platforms. It’s not a surprise that so many people were misled by this; even 30 years after Roland T. Rust and Richard W. Oliver published “The Death of Advertising” in Vol. 23, Issue No. 4 of the\nJournal of Advertising\n, the Cult of Free retards still think that sites like Gab can be funded by nonexistent advertising revenue.\nThey don’t realize that X has never, ever, made a profit. They aren’t aware that Google loses $2 billion or more on YouTube every year. And they have no idea how Meta actually makes its money. Silicon Valley’s One Million Eyeballs and Exit model was always fraudulent, on every single conceptual level, even though it appeared to work well for certain favored ticket-takers.\nWhat is necessary, what is vital, what is absolutely required for an operation that is going to survive and thrive over the long haul is to build a community of 10,000 or more people and provide them with enough value for them to justify their moral and material support. We are very, very fortunate to have been able to do that, and it is my goal, every single day, to provide an excuse, a reason, or a justification for all of our supporters to continue with their support.\nI don’t have the time or the bandwidth to think about those who not only don’t have skin in the game, they simply aren’t in the game at all. The value of the free content they create is zero. I know this for a fact, because when I shut down comments at this blog, all the same stupid arguments were mustered against it. I was “killing the blog” by shutting down the discourse here, or so they claimed. “Just as many people come to read the comments as read your posts,” they argued. The result: absolutely no change in traffic at all.\nAnd here is how you know the so-called “support” of freeloaders is worthless:\nthey never even do the free and easy things they could be doing to benefit the community without spending a single dime.\nThis isn’t a request for anyone to do anything at all. It is merely an philosophical explanation.\nDISCUSS ON SG",
  "tags": [
    "#AltTech",
    "economics",
    "mailvox",
    "philosophy"
  ],
  "categories": [],
  "sitemap_lastmod": "2024-02-29T15:59:10+00:00"
}