{
  "url": "https://voxday.net/2024/02/03/natos-sicilian-expedition/",
  "scraped_at": "2026-01-08T14:23:05.348040",
  "title": "NATO’s Sicilian Expedition",
  "date_display": "February 3, 2024",
  "date_iso": "2024-02-03T11:27:03+00:00",
  "date_from_url": "2024-02-03",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>Russian generals and military analysts increasingly betray open disdain for the incompetence of their Western counterparts. Even the ever-wary Putin, despite his habitual caution and openness to negotiation, radiates a distinct contempt for the enemies of Russia, perhaps in part due to his anticipation of them reliably choosing suboptimal courses.</p><p>And lest one think that the Russians are simply striking poses in order to put themselves in a better negotiating position, consider <a href=\"https://ria.ru/20240202/nato-1925140885.html\">the insane new British plan to do just that</a> as reported yesterday by RIA Novosti. Autotranslated from the Russian:</p><blockquote class=\"wp-block-quote is-layout-flow wp-block-quote-is-layout-flow\"><p><strong>MOSCOW, Feb 2 — RIA Novosti.</strong> Great Britain invited NATO allies to consider sending an alliance expeditionary force to Ukraine, an informed source told RIA Novosti.</p><p>“In connection with the unfavorable development of events for Kiev at the Ukrainian theater of operations (TVD), Britain invited NATO allies to consider sending an alliance expeditionary force to Ukraine, as well as establishing a no-fly zone over the territory controlled by the Kiev authorities and increasing the supply of weapons and equipment VSU”, — said the agency interlocutor.</p><p>Nevertheless, the British side expects that with a significant weakening of the Armed Forces and the successful advancement of the Russian army deep into the territory of the former Soviet republic, the Allies will approve the initiative, the source noted. He specified that the kingdom offers to secretly transfer to Ukraine large highly maneuverable NATO forces from the border regions of Romania and Poland for the occupation of defensive lines on the right bank of the Dnieper.</p><p>In addition, the British plan involves the deployment in Norway and Finland of a contingent of the alliance and armies of individual members of the organization to “spray” the forces and means of the Russian troops, he said. “At the same time, attacks can be made on strategic infrastructure facilities in the northern regions of Russia,” — the source emphasized.</p><p>Then, according to him, the NATO military will create a buffer zone within the occupied positions, including the border with Belarus and the territory around Kiev, and the released reserves of the Armed Forces will be sent to the special operation zone. Thus, according to London, NATO will supposedly be able to undermine Russia’s offensive capabilities and Russia will have to negotiate, he said.</p><p>Britain intends to complete the preparation of such a scenario by May of this year, the source of the agency summarized.</p> <cite>London proposed to send NATO expeditionary force to Ukraine, RIA NOVOSTI, 2 February 2024</cite></blockquote><p>The last time Britain organized an expeditionary force against Russia, it did not go well. Very few in the West now recall <a href=\"https://infogalactic.com/info/North_Russia_intervention\">the North Russian Intervention</a>, which involved 32,000 British, French, and US troops being sent to Archangel for a year-and-a-half. But the Russians assuredly have not forgotten it. From Infogalactic:</p><p><em>The North Russia intervention, also known as the Northern Russian expedition, the Archangel campaign, and the Murman deployment, was part of the Allied intervention in the Russian Civil War after the October Revolution. The intervention brought about the involvement of foreign troops in the Russian Civil War on the side of the White movement. The movement was ultimately defeated, while the British-led Allied forces withdrew from Northern Russia after fighting a number of defensive actions against the Bolsheviks, such as the Battle of Bolshie Ozerki. The campaign lasted from March 1918, during the final months of World War I, to October 1919.</em></p><div class=\"wp-block-image\"><figure class=\"aligncenter size-full\"><img alt=\"\" class=\"wp-image-61604\" decoding=\"async\" fetchpriority=\"high\" height=\"304\" sizes=\"(max-width: 512px) 100vw, 512px\" src=\"https://voxday.net/wp-content/uploads/2024/02/image-5.png\" srcset=\"https://voxday.net/wp-content/uploads/2024/02/image-5.png 512w, https://voxday.net/wp-content/uploads/2024/02/image-5-300x178.png 300w\" width=\"512\"/></figure></div><p>Presumably, the USA is behind this latest British brainstorm, just as it was behind the decision of the Kiev regime to fight a proxy war for NATO <a href=\"https://www.commondreams.org/news/2022/05/06/boris-johnson-pressured-zelenskyy-ditch-peace-talks-russia-ukrainian-paper\">instead of surrendering in April 2022</a> at the behest of then-British Prime Minister Boris Johnson. But perhaps the neoclowns should focus on winning their latest war in Yemen and defeating that formidable military power before setting up to lose on yet another front in Ukraine.</p><p>Although it would be historically fitting if NATO were to end with its own Sicilian Expedition.</p><p><em><a href=\"https://social.infogalactic.com/micropost/22b2dc7a-da02-4f46-adf8-bca476212f82\">DISCUSS ON SG</a></em></p></div>",
  "content_text": "Russian generals and military analysts increasingly betray open disdain for the incompetence of their Western counterparts. Even the ever-wary Putin, despite his habitual caution and openness to negotiation, radiates a distinct contempt for the enemies of Russia, perhaps in part due to his anticipation of them reliably choosing suboptimal courses.\nAnd lest one think that the Russians are simply striking poses in order to put themselves in a better negotiating position, consider\nthe insane new British plan to do just that\nas reported yesterday by RIA Novosti. Autotranslated from the Russian:\nMOSCOW, Feb 2 — RIA Novosti.\nGreat Britain invited NATO allies to consider sending an alliance expeditionary force to Ukraine, an informed source told RIA Novosti.\n“In connection with the unfavorable development of events for Kiev at the Ukrainian theater of operations (TVD), Britain invited NATO allies to consider sending an alliance expeditionary force to Ukraine, as well as establishing a no-fly zone over the territory controlled by the Kiev authorities and increasing the supply of weapons and equipment VSU”, — said the agency interlocutor.\nNevertheless, the British side expects that with a significant weakening of the Armed Forces and the successful advancement of the Russian army deep into the territory of the former Soviet republic, the Allies will approve the initiative, the source noted. He specified that the kingdom offers to secretly transfer to Ukraine large highly maneuverable NATO forces from the border regions of Romania and Poland for the occupation of defensive lines on the right bank of the Dnieper.\nIn addition, the British plan involves the deployment in Norway and Finland of a contingent of the alliance and armies of individual members of the organization to “spray” the forces and means of the Russian troops, he said. “At the same time, attacks can be made on strategic infrastructure facilities in the northern regions of Russia,” — the source emphasized.\nThen, according to him, the NATO military will create a buffer zone within the occupied positions, including the border with Belarus and the territory around Kiev, and the released reserves of the Armed Forces will be sent to the special operation zone. Thus, according to London, NATO will supposedly be able to undermine Russia’s offensive capabilities and Russia will have to negotiate, he said.\nBritain intends to complete the preparation of such a scenario by May of this year, the source of the agency summarized.\nLondon proposed to send NATO expeditionary force to Ukraine, RIA NOVOSTI, 2 February 2024\nThe last time Britain organized an expeditionary force against Russia, it did not go well. Very few in the West now recall\nthe North Russian Intervention\n, which involved 32,000 British, French, and US troops being sent to Archangel for a year-and-a-half. But the Russians assuredly have not forgotten it. From Infogalactic:\nThe North Russia intervention, also known as the Northern Russian expedition, the Archangel campaign, and the Murman deployment, was part of the Allied intervention in the Russian Civil War after the October Revolution. The intervention brought about the involvement of foreign troops in the Russian Civil War on the side of the White movement. The movement was ultimately defeated, while the British-led Allied forces withdrew from Northern Russia after fighting a number of defensive actions against the Bolsheviks, such as the Battle of Bolshie Ozerki. The campaign lasted from March 1918, during the final months of World War I, to October 1919.\nPresumably, the USA is behind this latest British brainstorm, just as it was behind the decision of the Kiev regime to fight a proxy war for NATO\ninstead of surrendering in April 2022\nat the behest of then-British Prime Minister Boris Johnson. But perhaps the neoclowns should focus on winning their latest war in Yemen and defeating that formidable military power before setting up to lose on yet another front in Ukraine.\nAlthough it would be historically fitting if NATO were to end with its own Sicilian Expedition.\nDISCUSS ON SG",
  "tags": [
    "history",
    "Russia",
    "UK",
    "war"
  ],
  "categories": [],
  "sitemap_lastmod": "2024-02-03T13:03:45+00:00"
}