{
  "url": "https://voxday.net/2024/02/01/sex-parties-on-capitol-hill/",
  "scraped_at": "2026-01-08T14:22:56.458203",
  "title": "Sex Parties on Capitol Hill",
  "date_display": "February 1, 2024",
  "date_iso": "2024-02-01T19:05:55+00:00",
  "date_from_url": "2024-02-01",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>The Founding Fathers weren’t fond of political parties, but I don’t think they had this sort of political party in mind when they were criticizing them. James O’Keefe goes undercover again and gets a Republican congressional aide to admit, on camera, that Washington DC is <a href=\"https://vid8.poal.co/user/AmericanThinker/2CqEoUB\">running on sexual blackmail</a>:</p><blockquote class=\"wp-block-quote is-layout-flow wp-block-quote-is-layout-flow\"><p><strong>Titus Warren: </strong>There’s a lot of things that I do here and there’s a lot of things that I see with my own eyes. Madison Cawthorn wasn’t lying neither. That man in the wheelchair. That video that came out with the guy in the Senate office building in the hearing room…<br/><strong>James O’Keefe:</strong> Oh yes, I saw that.<br/><strong>Titus Warren: </strong>Okay. The guy was blackmailed.<br/><strong>James O’Keefe:</strong> Whoa.<br/><strong>Titus Warren: </strong>So most members, they actually have spouses ’cause they’re married. They have affairs with other council people, congress people, congress members in office. And they have like parties and stuff.<br/><strong>James O’Keefe:</strong> Like you’re talking about sex parties…<br/><strong>Titus Warren: </strong>Yeah, they…<br/><strong>James O’Keefe:</strong> Whoa.<br/><strong>Titus Warren:</strong> The ones who talk a lot.<br/><strong>James O’Keefe: </strong>So these parties are like, it gets hot and heavy.<br/><strong>Titus Warren:</strong> Yeah. It’s like an in-house thing. If you know, you know, and if you don’t you don’t. But nine out of ten times everybody in there knows. But they actually, that is a fact. They actually do have these parties.<br/><strong>James O’Keefe:</strong> Does that happen a lot? Like people do something sexual and they’re blackmailed? Have you seen that?<br/><strong>Titus Warren: </strong>So it happens every now and then.<br/><strong>James O’Keefe:</strong> But they get blackmailed.<br/><strong>Titus Warren: </strong>Exactly.<br/><strong>James O’Keefe:</strong> Holy shit…<br/><strong>Titus Warren: </strong>Because it’s like they have a leverage of like, if you have something like that, it’s called leverage. And so what they do, they use it against you to get something else. Majority of members that come late are always 9/10 times hungover from the night before.<br/><strong>James O’Keefe: </strong>From the sex party?<br/><strong>Titus Warren:</strong> (Nods head) Yes. So on the voting. You already have a piece of paper that tells you how to vote, known as a suggestion. It’s not a suggestion.</p></blockquote><p>I don’t think pedocratic government by hedonistic perverts being funded by foreign interests and blackmailed by other foreign interests is normally what was historically meant by “democracy”. Nor is there any American national interest to be found in expanding this form of democracy elsewhere around the world.</p><p><em><a href=\"https://social.infogalactic.com/micropost/629304fa-3871-41af-b616-3bfc46d05731\">DISCUSS ON SG</a></em></p></div>",
  "content_text": "The Founding Fathers weren’t fond of political parties, but I don’t think they had this sort of political party in mind when they were criticizing them. James O’Keefe goes undercover again and gets a Republican congressional aide to admit, on camera, that Washington DC is\nrunning on sexual blackmail\n:\nTitus Warren:\nThere’s a lot of things that I do here and there’s a lot of things that I see with my own eyes. Madison Cawthorn wasn’t lying neither. That man in the wheelchair. That video that came out with the guy in the Senate office building in the hearing room…\nJames O’Keefe:\nOh yes, I saw that.\nTitus Warren:\nOkay. The guy was blackmailed.\nJames O’Keefe:\nWhoa.\nTitus Warren:\nSo most members, they actually have spouses ’cause they’re married. They have affairs with other council people, congress people, congress members in office. And they have like parties and stuff.\nJames O’Keefe:\nLike you’re talking about sex parties…\nTitus Warren:\nYeah, they…\nJames O’Keefe:\nWhoa.\nTitus Warren:\nThe ones who talk a lot.\nJames O’Keefe:\nSo these parties are like, it gets hot and heavy.\nTitus Warren:\nYeah. It’s like an in-house thing. If you know, you know, and if you don’t you don’t. But nine out of ten times everybody in there knows. But they actually, that is a fact. They actually do have these parties.\nJames O’Keefe:\nDoes that happen a lot? Like people do something sexual and they’re blackmailed? Have you seen that?\nTitus Warren:\nSo it happens every now and then.\nJames O’Keefe:\nBut they get blackmailed.\nTitus Warren:\nExactly.\nJames O’Keefe:\nHoly shit…\nTitus Warren:\nBecause it’s like they have a leverage of like, if you have something like that, it’s called leverage. And so what they do, they use it against you to get something else. Majority of members that come late are always 9/10 times hungover from the night before.\nJames O’Keefe:\nFrom the sex party?\nTitus Warren:\n(Nods head) Yes. So on the voting. You already have a piece of paper that tells you how to vote, known as a suggestion. It’s not a suggestion.\nI don’t think pedocratic government by hedonistic perverts being funded by foreign interests and blackmailed by other foreign interests is normally what was historically meant by “democracy”. Nor is there any American national interest to be found in expanding this form of democracy elsewhere around the world.\nDISCUSS ON SG",
  "tags": [
    "freakshow",
    "politics"
  ],
  "categories": [],
  "sitemap_lastmod": "2024-02-01T19:12:51+00:00"
}