{
  "url": "https://voxday.net/2024/02/02/the-russian-art-of-war/",
  "scraped_at": "2026-01-08T14:23:03.884383",
  "title": "The Russian Art of War",
  "date_display": "February 2, 2024",
  "date_iso": "2024-02-02T21:32:46+00:00",
  "date_from_url": "2024-02-02",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>A new book by a French colonel <a href=\"https://www.thepostil.com/the-russian-art-of-war-how-the-west-led-ukraine-to-defeat/\">explains the difference</a> between Western and Russian military thought, and how the superiority of the latter is why the former loses its wars:</p><blockquote class=\"wp-block-quote is-layout-flow wp-block-quote-is-layout-flow\"><p>Throughout the Cold War period, the Soviet Union saw itself as the spearhead of a historical struggle that would lead to a confrontation between the “capitalist” system and “progressive forces.” This perception of a permanent and inescapable war led the Soviets to study war in a quasi-scientific way, and to structure this thinking into an architecture of military thought that has no equal in the Western world.</p><p>The problem with the vast majority of our so-called military experts is their inability to understand the Russian approach to war. It is the result of an approach we have already seen in waves of terrorist attacks—the adversary is so stupidly demonized that we refrain from understanding his way of thinking. As a result, we are unable to develop strategies, articulate our forces, or even equip them for the realities of war. The corollary of this approach is that our frustrations are translated by unscrupulous media into a narrative that feeds hatred and increases our vulnerability. We are thus unable to find rational, effective solutions to the problem.</p><p>The way Russians understand conflict is holistic. In other words, they see the processes that develop and lead to the situation at any given moment. This explains why Vladimir Putin’s speeches invariably include a return to history. In the West, we tend to focus on X moment and try to see how it might evolve. We want an immediate response to the situation we see today. The idea that “from the understanding of how the crisis arose comes the way to resolve it” is totally foreign to the West. In September 2023, an English-speaking journalist even pulled out the “duck test” for me: “if it looks like a duck, swims like a duck and quacks like a duck, it’s probably a duck.” In other words, all the West needs to assess a situation is an image that fits their prejudices. Reality is much more subtle than the duck model….</p><p>The reason the Russians are better than the West in Ukraine is that they see the conflict as a process; whereas we see it as a series of separate actions. The Russians see events as a film. We see them as photographs. They see the forest, while we focus on the trees. That is why we place the start of the conflict on February 24, 2022, or the start of the Palestinian conflict on October 7, 2023. We ignore the contexts that bother us and wage conflicts we do not understand. That is why we lose our wars…</p><hr class=\"wp-block-separator has-alpha-channel-opacity\"/><p>In Russia, unsurprisingly, the principles of the military art of the Soviet forces inspired those currently in use:</p><ul class=\"wp-block-list\"><li>readiness to carry out assigned missions;</li><li>concentration of efforts on solving a specific mission;</li><li>surprise (unconventionality) of military action vis-à-vis the enemy;</li><li>finality determines a set of tasks and the level of resolution of each one;</li><li>totality of available means determines the way to resolve the mission and achieve the objective (correlation of forces);</li><li>coherence of leadership (unity of command);</li><li>economy of forces, resources, time and space;</li><li>support and restoration of combat capability;</li><li>freedom of maneuver.</li><li>It should be noted that these principles apply not only to the implementation of military action as such. They are also applicable as a system of thought to other non-operational activities.</li></ul><p>An honest analysis of the conflict in Ukraine would have identified these various principles and drawn useful conclusions for Ukraine. But none of the self-proclaimed experts on TV were intellectually able to do so.</p><p>Thus, Westerners are systematically surprised by the Russians in the fields of technology (e.g., hypersonic weapons), doctrine (e.g., operative art) and economics (e.g., resilience to sanctions). In a way, the Russians are taking advantage of our prejudices to exploit the principle of surprise. We can see this in the Ukrainian conflict, where the Western narrative led Ukraine to totally underestimate Russian capabilities, which was a major factor in its defeat. That is why Russia did not really try to counter this narrative and let it play out—the belief that we are superior makes us vulnerable….</p></blockquote><p>This is very, very similar to what Martyanov describes in the current Castalia Library book, <em>Losing Military Supremacy</em>. Which should come as no surprise, as both men are familiar with Russian military thought and how different it is than what Victor Davis Hanson once described as the Western way of war. The short term thinking of the Western military strategists can most easily be seen in their historical obsession with “the decisive battle” and strange focus on the idea that losing a battle or two, or even denying him a sufficiently impressive victory, will somehow weaken the enemy leader and magically cause him to be replaced by a more amenable successor.</p><p>Which is why the Russians are patiently winning a brutal attrition war in Ukraine while the US bleeds itself out everywhere from Afghanistan <a href=\"https://www.naturalnews.com/2024-01-31-us-troops-ground-yemen-white-house-confirms.html\">to Yemen</a>.</p><p><em><a href=\"https://social.infogalactic.com/micropost/43ab25b3-8e9d-4a01-bbcc-9dbed7b04022\">DISCUSS ON SG</a></em></p></div>",
  "content_text": "A new book by a French colonel\nexplains the difference\nbetween Western and Russian military thought, and how the superiority of the latter is why the former loses its wars:\nThroughout the Cold War period, the Soviet Union saw itself as the spearhead of a historical struggle that would lead to a confrontation between the “capitalist” system and “progressive forces.” This perception of a permanent and inescapable war led the Soviets to study war in a quasi-scientific way, and to structure this thinking into an architecture of military thought that has no equal in the Western world.\nThe problem with the vast majority of our so-called military experts is their inability to understand the Russian approach to war. It is the result of an approach we have already seen in waves of terrorist attacks—the adversary is so stupidly demonized that we refrain from understanding his way of thinking. As a result, we are unable to develop strategies, articulate our forces, or even equip them for the realities of war. The corollary of this approach is that our frustrations are translated by unscrupulous media into a narrative that feeds hatred and increases our vulnerability. We are thus unable to find rational, effective solutions to the problem.\nThe way Russians understand conflict is holistic. In other words, they see the processes that develop and lead to the situation at any given moment. This explains why Vladimir Putin’s speeches invariably include a return to history. In the West, we tend to focus on X moment and try to see how it might evolve. We want an immediate response to the situation we see today. The idea that “from the understanding of how the crisis arose comes the way to resolve it” is totally foreign to the West. In September 2023, an English-speaking journalist even pulled out the “duck test” for me: “if it looks like a duck, swims like a duck and quacks like a duck, it’s probably a duck.” In other words, all the West needs to assess a situation is an image that fits their prejudices. Reality is much more subtle than the duck model….\nThe reason the Russians are better than the West in Ukraine is that they see the conflict as a process; whereas we see it as a series of separate actions. The Russians see events as a film. We see them as photographs. They see the forest, while we focus on the trees. That is why we place the start of the conflict on February 24, 2022, or the start of the Palestinian conflict on October 7, 2023. We ignore the contexts that bother us and wage conflicts we do not understand. That is why we lose our wars…\nIn Russia, unsurprisingly, the principles of the military art of the Soviet forces inspired those currently in use:\nreadiness to carry out assigned missions;\nconcentration of efforts on solving a specific mission;\nsurprise (unconventionality) of military action vis-à-vis the enemy;\nfinality determines a set of tasks and the level of resolution of each one;\ntotality of available means determines the way to resolve the mission and achieve the objective (correlation of forces);\ncoherence of leadership (unity of command);\neconomy of forces, resources, time and space;\nsupport and restoration of combat capability;\nfreedom of maneuver.\nIt should be noted that these principles apply not only to the implementation of military action as such. They are also applicable as a system of thought to other non-operational activities.\nAn honest analysis of the conflict in Ukraine would have identified these various principles and drawn useful conclusions for Ukraine. But none of the self-proclaimed experts on TV were intellectually able to do so.\nThus, Westerners are systematically surprised by the Russians in the fields of technology (e.g., hypersonic weapons), doctrine (e.g., operative art) and economics (e.g., resilience to sanctions). In a way, the Russians are taking advantage of our prejudices to exploit the principle of surprise. We can see this in the Ukrainian conflict, where the Western narrative led Ukraine to totally underestimate Russian capabilities, which was a major factor in its defeat. That is why Russia did not really try to counter this narrative and let it play out—the belief that we are superior makes us vulnerable….\nThis is very, very similar to what Martyanov describes in the current Castalia Library book,\nLosing Military Supremacy\n. Which should come as no surprise, as both men are familiar with Russian military thought and how different it is than what Victor Davis Hanson once described as the Western way of war. The short term thinking of the Western military strategists can most easily be seen in their historical obsession with “the decisive battle” and strange focus on the idea that losing a battle or two, or even denying him a sufficiently impressive victory, will somehow weaken the enemy leader and magically cause him to be replaced by a more amenable successor.\nWhich is why the Russians are patiently winning a brutal attrition war in Ukraine while the US bleeds itself out everywhere from Afghanistan\nto Yemen\n.\nDISCUSS ON SG",
  "tags": [
    "books",
    "history",
    "Russia",
    "war"
  ],
  "categories": [],
  "sitemap_lastmod": "2024-02-02T21:32:49+00:00"
}