{
  "url": "https://voxday.net/2024/02/24/the-revival-of-swiss-neutrality/",
  "scraped_at": "2026-01-08T14:25:12.037202",
  "title": "The Revival of Swiss Neutrality",
  "date_display": "February 24, 2024",
  "date_iso": "2024-02-24T14:00:19+00:00",
  "date_from_url": "2024-02-24",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>Switzerland’s futile attempt to host Ukrainian peace talks this summer is <a href=\"https://www.reuters.com/world/europe/switzerland-doubtful-russia-will-join-start-ukraine-peace-summit-2024-02-24/\">already dead prior to arrival</a> thanks to the government’s foolish decision to try to take sides in the Russian-NATO war without being willing to admit that it is no longer a neutral party to the conflict.</p><blockquote class=\"wp-block-quote is-layout-flow wp-block-quote-is-layout-flow\"><p>Russia is unlikely to take part at the outset of a high-level Ukraine peace conference which neutral Switzerland plans to host in the coming months, Swiss President Viola Amherd was quoted as saying by a newspaper on Saturday. Amherd’s interview with the <em>Neue Zuercher Zeitung</em> daily was published a few hours after Swiss Foreign Minister Ignazio Cassis told the United Nations that Bern aimed to hold the conference “by this summer” after the idea was floated in January.</p><p>When asked whether Switzerland had since received any more positive signals from Russia, Amherd told the newspaper: “Right now, it looks as though Russia will not take part in a first round of the conference.<br/>“We’re in the process of starting off with a very broad alliance consisting of the BRICS countries, countries from the Arab world, as well as from the global south.”</p></blockquote><p>China has already made it clear that it will not be participating either. And, if Switzerland is foolish enough to give into Clown World pressure and go along with the latest EU, UK, and US sanctions on China, it will soon find itself being regarded as a hostile nation by the two most important military powers on Earth, which would be an incredible achievement of total diplomatic incompetence given 500 years of successful neutrality that survived everything except living next door to Napoleon.</p><p>Fortunately, 91 percent of the Swiss citizenry <a href=\"https://proschweiz.ch/homage-to-swiss-neutrality/\">favors a return to true and comprehensive neutrality</a>, and signatures are being gathered for a constitutional referendum that would prevent the satanic globalists and corrupt would-be eurocrats in the government from further involving the nation in Clown World’s self-destructive schemes.</p><blockquote class=\"wp-block-quote is-layout-flow wp-block-quote-is-layout-flow\"><p>The current world situation dramatically demonstrates the need for a country like Switzerland to mediate between war and conflict parties and to provide a platform for negotiations. Nevertheless, certain domestic circles and also foreign diplomats are trying to put pressure on Switzerland to fully participate in sanctions against Russia and to allow arms deliveries, if not directly then at least indirectly. The narrative of these neutrality diluters is always the same: Switzerland’s neutrality is an outdated model and must be reconsidered or adapted or even ditched. In light of the emerging amalgamation of security policy and foreign policy of the EU and the European arm of NATO, the calls for a “relativization of neutrality“ in favor of a misconceived solidarity are getting louder and louder. These gravediggers of neutrality must be countered with the following:</p><ol class=\"wp-block-list\"><li>The perpetual, integral and armed neutrality is absolute and geared towards emergencies. It cannot be modified easily and at will on the basis of a current event. Thus, there is no such thing as “Putin neutrality” or the like. The perpetual, integral and armed neutrality guaranteed to us at the Congress of Vienna, also with Russia’s explicit approval, sends an unmistakable signal to other countries and our partners that we will reliably and fully adhere to our neutrality in the long – term and will – if necessary – defend it with our armed forces.</li><li>The concept of neutrality is fundamentally directed towards wars. In a war, there are always attackers and defenders. It is therefore intellectually dishonest to relativize neutrality in relation to the Russia-Ukraine conflict or even to ditch it in order to position ourselves unilaterally against an aggressor. For a neutral state, the “good-evil” scheme is suspended, which enables it to offer its good offices. The fact that Putin claims Art. 51 of the UN Charter for himself in order to rush to help an ally is possibly covered by international law but certainly problematic, but nevertheless not unusual: China and the USA have also frequently drawn on this problematic article, the latter without there ever having been an outcry. In this context, especially in a neutral state like Switzerland, there should be careful consideration in order to avoid double standards.</li><li>Our elites know well that neutrality is deeply rooted in the Swiss people. Therefore, they believe they have to operate in a hypocritical manner, propagating neutrality internally while acting in a partisan manner externally. For example, the Federal Council has recklessly offered hand to sanctions against Russia, such as the blocking of Russian bank accounts in Switzerland. This has done massive damage to both, our credibility and our business location: a large number of foreigners have withdrawn their capital from Switzerland and transferred it to other countries. It is certainly legitimate to discuss the value of neutrality. However, this should be done with the involvement of the sovereign, the Swiss people, namely at the ballot box.</li><li>Our armed neutrality has effectively protected us from external aggressors, especially during World War II. It is not an outdated model, as some try to make us believe, but on the contrary an inspiring model for the future: based on credibility, continuity, predictability and reliability, we secure our prosperity and security, especially for our young generation. The Swiss People does not expect the Federal Council and our politicians to engage in power politics, but rather to protect our people and safeguard our prosperity. This is the very duty of the Federal Council: to integrate our neutrality policy into our foreign policy and to explain our neutrality in a comprehensible way in the foreign policy arena. In the area of good offices, in receiving a large number of refugees – as is currently the case from Ukraine – as well as comprehensive offers for negotiations, Switzerland is and will be able to make major contributions to global peacebuilding and peacekeeping. We must not easily give up this trump card!</li></ol> <cite>Homage to Swiss Neutrality, PRO-SCHWEIZ</cite></blockquote><p>Pro-Schweiz has until May 8, 2024 <a href=\"https://proschweiz.ch/neutralitaetsinitiative/\">to obtain the 100,000 signatures</a> required to put the initiative on the ballot. <em>(Note to the Bears: if you’re not a Swiss citizen, you can’t sign the petition, so don’t even think about it. Note to everyone else: yes, it is absolutely necessary to spell that out.)</em> And although the media has been ludicrously describing the concept of constitutional neutrality as a “right-wing” objective, it has substantial support among the Left and Green parties as well.</p><blockquote class=\"wp-block-quote is-layout-flow wp-block-quote-is-layout-flow\"><p>The Federal Constitution is amended as follows:</p><p>Article 54a Swiss Neutrality</p><p>1. Switzerland is neutral. Its neutrality is perpetual and armed.</p><p>2. Switzerland does not join any military or defense alliance. An exception is made for cooperation with such alliances in the event of a direct military attack on Switzerland or in the case of actions preparing for such an attack.</p><p>3. Switzerland does not participate in military conflicts between third states and does not take non-military coercive measures against belligerent states. Exceptions are Switzerland’s obligations to the United Nations (UN) and measures to prevent the circumvention of non-military coercive measures by other states.</p><p>4. Switzerland uses its perpetual neutrality for the prevention and resolution of conflicts and is available as a mediator.</p> <cite>Call from Left and Green Supporters: Yes to the Neutrality Initiative!, SWISS STANDPOINT, 24 January 2024</cite></blockquote><p>Anyhow, people all around the world should hope that the failure of the 2024 peace summit will serve to remind the Swiss people of the way in which their historic commitment to neutrality will much better serve the world than their becoming a small and voiceless cog in the Clown World machine.</p><div class=\"wp-block-image\"><figure class=\"aligncenter size-full\"><a href=\"https://proschweiz.ch/neutralitaetsinitiative/\"><img alt=\"\" class=\"wp-image-61940\" decoding=\"async\" fetchpriority=\"high\" height=\"546\" sizes=\"(max-width: 512px) 100vw, 512px\" src=\"https://voxday.net/wp-content/uploads/2024/02/image-60.png\" srcset=\"https://voxday.net/wp-content/uploads/2024/02/image-60.png 512w, https://voxday.net/wp-content/uploads/2024/02/image-60-281x300.png 281w\" width=\"512\"/></a></figure></div><p><em><a href=\"https://social.infogalactic.com/micropost/7bc09fc0-e8d3-4039-97db-f7c673843d1f\">DISCUSS ON SG</a></em></p></div>",
  "content_text": "Switzerland’s futile attempt to host Ukrainian peace talks this summer is\nalready dead prior to arrival\nthanks to the government’s foolish decision to try to take sides in the Russian-NATO war without being willing to admit that it is no longer a neutral party to the conflict.\nRussia is unlikely to take part at the outset of a high-level Ukraine peace conference which neutral Switzerland plans to host in the coming months, Swiss President Viola Amherd was quoted as saying by a newspaper on Saturday. Amherd’s interview with the\nNeue Zuercher Zeitung\ndaily was published a few hours after Swiss Foreign Minister Ignazio Cassis told the United Nations that Bern aimed to hold the conference “by this summer” after the idea was floated in January.\nWhen asked whether Switzerland had since received any more positive signals from Russia, Amherd told the newspaper: “Right now, it looks as though Russia will not take part in a first round of the conference.\n“We’re in the process of starting off with a very broad alliance consisting of the BRICS countries, countries from the Arab world, as well as from the global south.”\nChina has already made it clear that it will not be participating either. And, if Switzerland is foolish enough to give into Clown World pressure and go along with the latest EU, UK, and US sanctions on China, it will soon find itself being regarded as a hostile nation by the two most important military powers on Earth, which would be an incredible achievement of total diplomatic incompetence given 500 years of successful neutrality that survived everything except living next door to Napoleon.\nFortunately, 91 percent of the Swiss citizenry\nfavors a return to true and comprehensive neutrality\n, and signatures are being gathered for a constitutional referendum that would prevent the satanic globalists and corrupt would-be eurocrats in the government from further involving the nation in Clown World’s self-destructive schemes.\nThe current world situation dramatically demonstrates the need for a country like Switzerland to mediate between war and conflict parties and to provide a platform for negotiations. Nevertheless, certain domestic circles and also foreign diplomats are trying to put pressure on Switzerland to fully participate in sanctions against Russia and to allow arms deliveries, if not directly then at least indirectly. The narrative of these neutrality diluters is always the same: Switzerland’s neutrality is an outdated model and must be reconsidered or adapted or even ditched. In light of the emerging amalgamation of security policy and foreign policy of the EU and the European arm of NATO, the calls for a “relativization of neutrality“ in favor of a misconceived solidarity are getting louder and louder. These gravediggers of neutrality must be countered with the following:\nThe perpetual, integral and armed neutrality is absolute and geared towards emergencies. It cannot be modified easily and at will on the basis of a current event. Thus, there is no such thing as “Putin neutrality” or the like. The perpetual, integral and armed neutrality guaranteed to us at the Congress of Vienna, also with Russia’s explicit approval, sends an unmistakable signal to other countries and our partners that we will reliably and fully adhere to our neutrality in the long – term and will – if necessary – defend it with our armed forces.\nThe concept of neutrality is fundamentally directed towards wars. In a war, there are always attackers and defenders. It is therefore intellectually dishonest to relativize neutrality in relation to the Russia-Ukraine conflict or even to ditch it in order to position ourselves unilaterally against an aggressor. For a neutral state, the “good-evil” scheme is suspended, which enables it to offer its good offices. The fact that Putin claims Art. 51 of the UN Charter for himself in order to rush to help an ally is possibly covered by international law but certainly problematic, but nevertheless not unusual: China and the USA have also frequently drawn on this problematic article, the latter without there ever having been an outcry. In this context, especially in a neutral state like Switzerland, there should be careful consideration in order to avoid double standards.\nOur elites know well that neutrality is deeply rooted in the Swiss people. Therefore, they believe they have to operate in a hypocritical manner, propagating neutrality internally while acting in a partisan manner externally. For example, the Federal Council has recklessly offered hand to sanctions against Russia, such as the blocking of Russian bank accounts in Switzerland. This has done massive damage to both, our credibility and our business location: a large number of foreigners have withdrawn their capital from Switzerland and transferred it to other countries. It is certainly legitimate to discuss the value of neutrality. However, this should be done with the involvement of the sovereign, the Swiss people, namely at the ballot box.\nOur armed neutrality has effectively protected us from external aggressors, especially during World War II. It is not an outdated model, as some try to make us believe, but on the contrary an inspiring model for the future: based on credibility, continuity, predictability and reliability, we secure our prosperity and security, especially for our young generation. The Swiss People does not expect the Federal Council and our politicians to engage in power politics, but rather to protect our people and safeguard our prosperity. This is the very duty of the Federal Council: to integrate our neutrality policy into our foreign policy and to explain our neutrality in a comprehensible way in the foreign policy arena. In the area of good offices, in receiving a large number of refugees – as is currently the case from Ukraine – as well as comprehensive offers for negotiations, Switzerland is and will be able to make major contributions to global peacebuilding and peacekeeping. We must not easily give up this trump card!\nHomage to Swiss Neutrality, PRO-SCHWEIZ\nPro-Schweiz has until May 8, 2024\nto obtain the 100,000 signatures\nrequired to put the initiative on the ballot.\n(Note to the Bears: if you’re not a Swiss citizen, you can’t sign the petition, so don’t even think about it. Note to everyone else: yes, it is absolutely necessary to spell that out.)\nAnd although the media has been ludicrously describing the concept of constitutional neutrality as a “right-wing” objective, it has substantial support among the Left and Green parties as well.\nThe Federal Constitution is amended as follows:\nArticle 54a Swiss Neutrality\n1. Switzerland is neutral. Its neutrality is perpetual and armed.\n2. Switzerland does not join any military or defense alliance. An exception is made for cooperation with such alliances in the event of a direct military attack on Switzerland or in the case of actions preparing for such an attack.\n3. Switzerland does not participate in military conflicts between third states and does not take non-military coercive measures against belligerent states. Exceptions are Switzerland’s obligations to the United Nations (UN) and measures to prevent the circumvention of non-military coercive measures by other states.\n4. Switzerland uses its perpetual neutrality for the prevention and resolution of conflicts and is available as a mediator.\nCall from Left and Green Supporters: Yes to the Neutrality Initiative!, SWISS STANDPOINT, 24 January 2024\nAnyhow, people all around the world should hope that the failure of the 2024 peace summit will serve to remind the Swiss people of the way in which their historic commitment to neutrality will much better serve the world than their becoming a small and voiceless cog in the Clown World machine.\nDISCUSS ON SG",
  "tags": [
    "Clown World",
    "Russia",
    "Switzerland",
    "war"
  ],
  "categories": [],
  "sitemap_lastmod": "2024-02-24T14:02:25+00:00"
}