{
  "url": "https://voxday.net/2024/02/25/the-great-bifurcation-widens/",
  "scraped_at": "2026-01-08T14:25:22.735633",
  "title": "The Great Bifurcation Widens",
  "date_display": "February 25, 2024",
  "date_iso": "2024-02-25T18:20:33+00:00",
  "date_from_url": "2024-02-25",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>Both China and India are making it very clear that they will not stop doing business with Russia, and more importantly, that <a href=\"https://www.globaltimes.cn/page/202402/1307668.shtml\">they are neither impressed nor dissuaded</a> by the additional sanctions being imposed upon them by the EU, the UK, and the USA.</p><blockquote class=\"wp-block-quote is-layout-flow wp-block-quote-is-layout-flow\"><p>The EU last week agreed on a new package of sanctions against Russia that for the first time targets Chinese and Indian companies accused of “supporting Moscow’s war efforts,” the Financial Times reported on Thursday.</p><p>The measures of the EU, which will be its 13th package of sanctions imposed in response to Russia’s military operation against Ukraine, were followed by the UK and the US. Britain announced a new package of sanctions against Russia that includes three electronics companies in China, Reuters reported on Friday.</p><p>Then, the Biden administration announced on Friday more than 500 new sanctions against targets in Russia, which reportedly include measures against Russia’s main card payment system, financial and military institutions and entities outside of Russia…</p><p>When it comes to the Ukraine crisis, China’s position has always been consistent. China is not a party directly involved, and it did not choose to be a bystander or add fuel to the fire. China will continue to play a constructive role in bringing an early end to the conflict and restoring peace in Ukraine.</p><p>There is nothing to criticize regarding the pursuit of peace, and it is believed that this thinking is shared by many other emerging countries.</p><p>Fundamentally speaking, Western sanctions against Russia are actually illegal and unilateral actions, which have not been approved by the UN. The US and its European allies, regardless of how powerful they are, do not represent the entire international community. It makes no sense for them to escalate sanctions and exert pressure on other countries by targeting normal economic exchanges between Russia and other countries.</p><p>What Indian External Affairs Minister Subrahmanyam Jaishankar said recently on the sidelines of the Munich conference may just show the view of all those who have not participated in Western sanctions against Russia.</p><p>Jaishankar said, “If I am smart enough to have multiple options, you should be admiring me.” He said that India should not be criticized for having multiple options and reaffirmed its stand and commitment to buying Russian oil.</p><p>The world is not ruled by the US and its European allies only. Their goal of containing Russia is their own business, and they have no right to demand other countries sacrifice their development opportunities to serve Western strategies. When it comes to how to deal with Russia, emerging economies should have the right to consider and choose from their own interests.</p><p>What has happened over the past two years has proved that unilateral sanctions and extreme pressure have not only done great harm to the global economy, but have also disrupted the international order the West has been trying to maintain.</p> <cite>Including Chinese, Indian firms in Russia sanctions unreasonable, GLOBAL TIMES, 25 February 2024</cite></blockquote><p>It’s going to be a difficult year for everyone in the West, and things are going to continue to get more difficult as the flow of free money continues to dwindle away to nothing and the ability of the Fed to export inflation to the rest of the world disappears as the majority of the global population exits Clown World’s economy.</p><p>But with these harder times comes opportunity, as those organizations that are not built on debt and have genuine success based on genuine customers will have the opportunity to grow steadily as their competitors continue to fail. Just to give one example, think about how many alternatives to this blog have vanished over time, while the traffic here is steady and offshoots such as <a href=\"https://sigmagame.substack.com/\">Sigma Game</a> are already averaging 7,500 views per day in its first month.</p><p>Just as success isn’t distributed evenly during credit bubbles, failure isn’t distributed evenly during economic contractions. The key is to focus ruthlessly on your core market, be persistent in your performance, and constantly strive to improve your quality while your competitors are cutting corners and trying to raise their margins to make up for their declining sales.</p><p><em><a href=\"https://social.infogalactic.com/micropost/511ba9f1-7254-4d7d-ae0f-87193917478f\">DISCUSS ON SG</a></em></p></div>",
  "content_text": "Both China and India are making it very clear that they will not stop doing business with Russia, and more importantly, that\nthey are neither impressed nor dissuaded\nby the additional sanctions being imposed upon them by the EU, the UK, and the USA.\nThe EU last week agreed on a new package of sanctions against Russia that for the first time targets Chinese and Indian companies accused of “supporting Moscow’s war efforts,” the Financial Times reported on Thursday.\nThe measures of the EU, which will be its 13th package of sanctions imposed in response to Russia’s military operation against Ukraine, were followed by the UK and the US. Britain announced a new package of sanctions against Russia that includes three electronics companies in China, Reuters reported on Friday.\nThen, the Biden administration announced on Friday more than 500 new sanctions against targets in Russia, which reportedly include measures against Russia’s main card payment system, financial and military institutions and entities outside of Russia…\nWhen it comes to the Ukraine crisis, China’s position has always been consistent. China is not a party directly involved, and it did not choose to be a bystander or add fuel to the fire. China will continue to play a constructive role in bringing an early end to the conflict and restoring peace in Ukraine.\nThere is nothing to criticize regarding the pursuit of peace, and it is believed that this thinking is shared by many other emerging countries.\nFundamentally speaking, Western sanctions against Russia are actually illegal and unilateral actions, which have not been approved by the UN. The US and its European allies, regardless of how powerful they are, do not represent the entire international community. It makes no sense for them to escalate sanctions and exert pressure on other countries by targeting normal economic exchanges between Russia and other countries.\nWhat Indian External Affairs Minister Subrahmanyam Jaishankar said recently on the sidelines of the Munich conference may just show the view of all those who have not participated in Western sanctions against Russia.\nJaishankar said, “If I am smart enough to have multiple options, you should be admiring me.” He said that India should not be criticized for having multiple options and reaffirmed its stand and commitment to buying Russian oil.\nThe world is not ruled by the US and its European allies only. Their goal of containing Russia is their own business, and they have no right to demand other countries sacrifice their development opportunities to serve Western strategies. When it comes to how to deal with Russia, emerging economies should have the right to consider and choose from their own interests.\nWhat has happened over the past two years has proved that unilateral sanctions and extreme pressure have not only done great harm to the global economy, but have also disrupted the international order the West has been trying to maintain.\nIncluding Chinese, Indian firms in Russia sanctions unreasonable, GLOBAL TIMES, 25 February 2024\nIt’s going to be a difficult year for everyone in the West, and things are going to continue to get more difficult as the flow of free money continues to dwindle away to nothing and the ability of the Fed to export inflation to the rest of the world disappears as the majority of the global population exits Clown World’s economy.\nBut with these harder times comes opportunity, as those organizations that are not built on debt and have genuine success based on genuine customers will have the opportunity to grow steadily as their competitors continue to fail. Just to give one example, think about how many alternatives to this blog have vanished over time, while the traffic here is steady and offshoots such as\nSigma Game\nare already averaging 7,500 views per day in its first month.\nJust as success isn’t distributed evenly during credit bubbles, failure isn’t distributed evenly during economic contractions. The key is to focus ruthlessly on your core market, be persistent in your performance, and constantly strive to improve your quality while your competitors are cutting corners and trying to raise their margins to make up for their declining sales.\nDISCUSS ON SG",
  "tags": [
    "China",
    "Clown World",
    "economics"
  ],
  "categories": [],
  "sitemap_lastmod": "2024-02-25T18:20:35+00:00"
}