{
  "url": "https://voxday.net/2024/02/09/tucker-putin-interview-complete-transcript/",
  "scraped_at": "2026-01-08T14:23:44.061170",
  "title": "Tucker-Putin Interview: Complete Transcript",
  "date_display": "February 9, 2024",
  "date_iso": "2024-02-09T13:08:13+00:00",
  "date_from_url": "2024-02-09",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p><em>This is <a href=\"http://www.kremlin.ru/events/president/news/73411\">an autotranslation of the Russian transcript</a> provided by the Kremlin.</em></p><p><strong>INTERVIEW TO TUCKER CARLSON</strong><br/>Vladimir Putin answered questions from Tucker Carlson – journalist, founder of the <em>Tucker Carlson Network</em> video platform.</p><p><strong><strong>TUCKER CARLSON</strong>:</strong> Mr. President, thank you very much.</p><p>On February 24th, 2022, you turned to your country and nation when the conflict in Ukraine began. You said you were acting because you came to the conclusion that with the help of NATO, the United States can start a sudden attack, attack on your country. For Americans are like paranoia. Why do you think America could deliver an unexpected blow in Russia? How did you come to this conclusion?</p><p><strong><strong>VLADIMIR PUTIN</strong>:</strong> It’s not that America was about to deliver an unexpected blow in Russia, I never said. Do we have talk shows or do we have a serious conversation?</p><p><strong><strong>TUCKER CARLSON</strong>:</strong> This is a beautiful quote. Thanks. We have a serious conversation.</p><p><strong><strong>VLADIMIR PUTIN</strong>:</strong> You have a historical basic education, how I understand, huh?</p><p><strong><strong>TUCKER CARLSON</strong>:</strong> Yes.</p><p><strong><strong>VLADIMIR PUTIN</strong>:</strong> Then I will let – just 30 seconds or one minute – give a little historical help. Do you mind?</p><p><strong><strong>TUCKER CARLSON</strong>:</strong> Please of course.</p><p><strong><strong>VLADIMIR PUTIN</strong>:</strong> See where our relations with Ukraine began, from where did she take it, Ukraine?</p><p>The Russian state began to gather as centralized, it is considered a year the creation of the Russian state – 862, when Novgorodians – there is such a city of Novgorod in the north-west of the country – invited Prince Rurik from Scandinavia to the prince, from the Varangians. 862 year old. In 1862 Russia celebrated its 1000th anniversary statehood, and in Novgorod there is a monument dedicated 1000th anniversary of the country.</p><p>In 882, the successor of Rurik, Prince Oleg, who performed, in fact, the functions of the regent in the young son Rurika, and Rurik died by this time, came to Kiev. He removed two brothers from power, who, apparently, were once members of the Ryurik squad, and thus Russia began to develop with two centers: in Kiev and in Novgorod.</p><p>Next, a very significant date in the history of Russia, – 988. This is the Baptism of Russia when Prince Vladimir, this is the great-grandson of Rurik, baptized Russia and received Orthodoxy – Eastern Christianity. Since that time the beginning the centralized Russian state is being strengthened. Why? Common territory, single economic relations, one language and after the baptism of Russia – one faith and power prince. Central Russian begins to take shape state.</p><p>But for various reasons after the introduction succession – also in ancient times, Middle Ages – Yaroslav the Wise, a little later, after he passed away, the succession was difficult, not transmitted directly from father to elder son, and from the prince who passed away, his brother, then sons on different lines. All this led to the fragmentation of Russia – of a single state, which began to take shape as one. Nothing this is not special, the same thing happened in Europe. But the fragmented Russian state has become easy prey to that the empire that Genghis Khan once created. His successors, Khan Batiy, came to Russia, plundered almost all cities ruined them. South the part where Kiev was, by the way, some other cities, they simply lost their independence, and the northern cities retained part of their sovereignty.They paid tribute to Horde, but part of sovereignty saved. And then with the center in Moscow, the beginning a single Russian state is taking shape.</p><p>South part of the Russian lands, including Kiev, began gradually reach for another « magnet » – to the center that was developing in Europe. It was the Grand Lithuanian Principality. He was even called Lithuanian-Russian, because the Russians made up significant part of this state. They spoke ancient Russian, were Orthodox. But then the union of – the union of the Great princes of the Lithuanian and Polish kingdom. After for several years another union was signed already in the spiritual realm, and part Orthodox priests obeyed power Pope. So these lands were part of the Polish-Lithuanian state.</p><p>But the Poles for decades engaged in the impoverishment of this part of the population: they introduced their language there, began to introduce the idea that these are not entirely Russian, that, since they live near the edge, they are Ukrainians. Initially, the word « Ukrainian » meant that man lives on the outskirts of the state, « near the edge », or is engaged in border service, in fact. It didn’t mean some special ethnic group.</p><p>So here the Poles polished in every possible way and in principle treated this part of the Russian lands quite harshly, if not cruelly. All this led to, that this part of the Russian lands began to fight for their rights. And they wrote letters to Warsaw, demanding compliance with their rights so that people, including Kiev, are sent here…</p><p><strong><strong>TUCKER CARLSON</strong>:</strong> When it was, in what years?</p><p><strong><strong>VLADIMIR PUTIN</strong>:</strong> It was in the 13th century. I will now say what happened next, and I will name the dates so that there was no confusion.</p><p>And in 1654, a little earlier, even – people who controlled power in this part Russian lands, appealed to Warsaw, I repeat, demanding that sent people of Russian origin and Orthodox faith. And when Warsaw is basically nothing did not answer and almost rejected these requirements, they began to turn to Moscow so that Moscow would take them to itself. You didn’t think that I came up with something, I will give you these documents…</p><p><strong><strong>TUCKER CARLSON</strong>:</strong> I do not think that you are making up something, no.</p><p><em><a href=\"https://social.infogalactic.com/micropost/e6968778-13b7-42c3-ac1c-5fb8d8ae66a3\">DISCUSS ON SG</a></em></p> <span id=\"more-61718\"></span><p><strong>VLADIMIR PUTIN:</strong> And yet – this documents from the archive, copies. Here are the letters of Bogdan Khmelnitsky, then man, who controlled power in this part of the Russians the lands that we now call Ukraine. He wrote to Warsaw demanding observance of their rights, and after I received refusal, began to write letters to Moscow with a request to take them under the strong hand of the Moscow king. Here [in folder] copies of these documents. I will leave them for you to good memory. There is a translation into Russian, then translate into English.</p><p>Russia did not agree to accept them immediately, because proceeded from the fact that the war with Poland would begin. Still, in 1654, the Zemstvo Cathedral – it was a representative authority of the Ancient Russian state – the decision was made: this part of the ancient Russian lands became part of the Moscow kingdom.</p><p>How and it was supposed that a war with Poland began. She walked for 13 years, then a truce was concluded. And in total, after the conclusion of this act of 1654, after 32 years, in my opinion, peace with Poland was concluded, « the eternal world », as it was then said. And these lands, all the left bank of the Dnieper, including Kiev, moved to Russia, and that’s it the right bank of the Dnieper remained with Poland.</p><p>Then in the time of Catherine II, Russia returned all its historical lands, including south and west. This all went on until the revolution. And before the First World War, taking advantage of these ideas of Ukrainianization, Austrian general the headquarters very actively began to promote the idea of Ukraine and Ukrainianization. Everything is clear for what: because on the eve of the world war, of course, there was a desire to weaken potential adversary, there was a desire to create favorable conditions for yourself in the border strip. And this idea, born once in Poland that people, living in this territory, not quite Russians, they are supposedly a special ethnic group, Ukrainians, began to advance and the Austrian General Staff.</p><p>Ascended and theorists of independence of Ukraine already in the 19th century, who spoke about the need for independence of Ukraine. But, true, all these « pillars » Ukrainian independence said that it should have very good relations with Russia, they insisted on it. However after the 1917 revolution the Bolsheviks tried restore statehood, unfolded Civil war, including [war] with Poland. Peace was signed with Poland in 1921, according to which the western part, on the right bank of the Dnieper, again went to Poland.</p><p>In 1939, after Poland collaborated with Hitler, and Poland collaborated with Hitler, and Hitler offered – all the documents we have – with Poland to conclude peace, a treaty of friendship and alliance, but demanded that Poland give back Germany so called the Danzig Corridor, which connected the bulk of Germany with Königsberg and East Prussia. After the first World War II, this part of the territory was given to Poland, and instead of Danzig the city of Gdansk appeared. Hitler begged them to give peacefully – the Poles refused. Nevertheless collaborated with Hitler and engaged together section of Czechoslovakia.</p><p><strong>TUCKER CARLSON:</strong> May I ask? You say that part of Ukraine is actually Russian lands hundreds of years. Why then, when you became President, you simply did not take them, 24 years ago? You because there was a weapon. Why are you taking so long then waiting?</p><p><strong>VLADIMIR PUTIN:</strong> Now I’ll say, I’m already finishing this historical background. She is boring, maybe, but she explains a lot.</p><p><strong>TUCKER CARLSON:</strong> She’s not boring, no.</p><p><strong>VLADIMIR PUTIN:</strong> Well, great. Then I am very pleased that you appreciated it so. Thank you very much.</p><p>So, before World War II, when Poland collaborated with Germany, refused to comply with Hitler’s requirements, but nevertheless participated with Hitler in the Czechoslovakia section, but since she did not give the Danzig corridor the Poles forced, they played and forced Hitler start the Second World War with them. Why the war began on September 1 1939 from Poland? She turned out to be intractable. Hitler had no choice when implementing his plans, start with Poland.</p><p>By the way, The Soviet Union – I read the archival documents – behaved very honestly, and the Soviet Union requested Poland’s permission to conduct its troops to help Czechoslovakia. But through the mouth of the then Minister of Foreign Affairs Poland’s affairs it was said that even if Soviet aircraft will fly towards Czechoslovakia through the territory of Poland, they will be shot down over the territory of Poland. Well, it doesn’t matter. And the important thing is that the war began, and now Poland itself has become a victim of the policy that was pursued in relation to Czechoslovakia, because according to the famous Molotov protocols – Ribbentrop part of these territories went to Russia, including Western Ukraine. Russia called the Soviet Union thus returned to its historical territories.</p><p>After victory in the Great Patriotic War, like us we say this is World War II, all these territories were finally assigned to Russia, to the Soviet Union. And Poland, in order to compensate, is supposed to have received western, originally German, territories – eastern Germany, part of the land, this western Poland today. And, of course, they again returned the exit to the Baltic Sea, again returned Danzig, who began to be called in Polish. In this way this situation has developed.</p><p>At the formation of the Soviet Union, this is already 1922, the Bolsheviks began to form the USSR and created Soviet Ukraine, which is still generally did not exist.</p><p><strong>TUCKER CARLSON:</strong> All right.</p><p><strong>VLADIMIR PUTIN: </strong>At the same time, Stalin insisted that these republics, which were formed, be included as autonomous entities, but for some reason the founder of the Soviet state, Lenin, insisted on, so that they have the right to secede from the Soviet Union. And, too, for unknown reasons, he endowed the emerging Soviet Ukraine land, people living in these territories, even if they had never been called Ukraine before, for some reason, when forming, it was all « clicked » to the Ukrainian SSR, including the entire Black Sea region, which was received during the time of Catherine II and, in fact, had never had any historical attitude towards Ukraine.</p><p>Even if we remember, we will come back, 1654, when these territories returned to the composition Russian Empire, there were three or four modern regions of Ukraine, no Black Sea there was close. There was simply nothing to talk about.</p><p><strong>TUCKER CARLSON:</strong> In 1654?</p><p><strong>VLADIMIR PUTIN:</strong> Yes exactly.</p><p><strong>TUCKER CARLSON:</strong> You encyclopedic knowledge. But why didn’t you talk about this for the first 22 years of your presidency?</p><p><strong>VLADIMIR PUTIN:</strong> So, Soviet Ukraine received a huge amount territories that never to her had no relationship, first of all, the Black Sea. They once, when Russia their received as a result of Russian-Turkish wars, called Novorossia. But that doesn’t matter. The important thing is that Lenin, the founder of Soviet states, created Ukraine just like that. And for many decades as part of the USSR The Ukrainian SSR has developed, and the Bolsheviks, too for unknown reasons, engaged in Ukrainianization. Not only because there there were immigrants from Ukraine, in the leadership of the Soviet Union, but in general there was such policy – « rootization » it called. This concerned Ukraine and other union republics. National languages, national cultures were introduced, which in general, in principle, of course, is not bad. But in this way Soviet Ukraine was created.</p><p>And after World War II, Ukraine received still part of not only Polish before the war territories – today Western Ukraine, part of the Hungarian territories and part of the Romanian. Romania and Hungary also took part of the territories, and they, these territories are part of Soviet Ukraine and are still there. Therefore, we have every reason to say, that, of course, Ukraine in a certain sense – artificial state created by will Stalin.</p><p><strong>TUCKER CARLSON:</strong> And what do you think, does Hungary have the right to take its land? And other nations can take their lands and maybe return Ukraine to the borders of 1654?</p><p><strong>VLADIMIR PUTIN:</strong> I do not know how to the borders of 1654. Stalin’s reign is called Stalin regime, everyone says that there were many violations of human rights, violations of the rights of other states. In this sense, of course, it is quite possible, if not to say that they have the right to this – to return these lands, then, in any case, it is clear…</p><p><strong>TUCKER CARLSON:</strong> Did you tell Orban about this that he can regain part of the land of Ukraine?</p><p><strong>VLADIMIR PUTIN:</strong> Never said. Never, never. We didn’t even have any talk about this. But I reliably know that the Hungarians, who live there, they certainly want return to your historical homeland.</p><p>More of that, I will tell you a very interesting story now, I’ll be distracted, this is a personal story. I’m somewhere in the early 80s by car from then Leningrad, from St. Petersburg, went just on a trip to the Soviet Union – through Kiev, to Kiev, and then went to Western Ukraine. He drove into the city, Beregovo called, and there are all the names of cities, towns in Russian and in an incomprehensible language for me – in Hungarian. In Russian and in Hungarian. Not in Ukrainian – in Russian and in Hungarian.</p><p>I’m passing through in some village, sitting near houses men in black suits and black cylinders. I say: are these some artists? They say to me: no, these are not artists, these are Hungarians. I say: what are they doing here? How what is it land, they live here. All the names! In Soviet times, in the 80s. They keep Hungarian, names, all national costumes. They are Hungarians and feel like Hungarians. And of course, when the infringement is happening now…</p><p><strong>TUCKER CARLSON:</strong> Yes I think that there is a lot of this. Most likely, many countries are unhappy with the change in borders during changes in the 20th century and before. But the fact is that you have not stated anything like this earlier, until February 2022. And you talked about how you felt a physical threat from NATO, in particular, a nuclear threat, and this prompted you to act. Do I understand you correctly?</p><p><strong>VLADIMIR PUTIN:</strong> I understand that my long dialogs probably don’t include in such an interview genre. Therefore I am at the beginning of you asked: will we have a serious conversation or show? You said you were serious conversation. So don’t be offended by me, please.</p><p>We approached the moment when it was created Soviet Ukraine. Then there was 1991 – the collapse of the Soviet Union. And all that Ukraine received as a gift from Russia, « from the bar shoulder », she dragged with her.</p><p>I AM I am now approaching a very important moment of today. After all, this collapse of the Soviet Union was initiated, in fact, by the leadership of Russia. I don’t know what was guided by then Russian leadership, but I suspect that there there were several reasons to think that everything would be fine.</p><p>Firstly, I think the Russian leadership came from from the fundamental foundations of the relationship between Russia and Ukraine. Actually a common language, there, more than 90 percent spoke Russian; family ties, there every third has some kind of kinship, friendly relations; general culture; common story; finally common religion; general presence within the framework of a single state for centuries; the economy is very interconnected – all this is so fundamental things. All this underlies inevitability our good relationship.</p><p>Second – very important, I want you to be like American citizen and so that your audience they also heard about this: the former Russian leadership assumed that the Soviet Union had ceased its existence, no more dividing ideological lines do not exist. Russia voluntarily and proactively went even to the collapse of the Soviet Union and proceeds from the fact that it will be understood by the so-called – already in quotation marks – « civilized West » as a proposal for cooperation and alliance. That is what Russia expected from both the United States and the so-called collective West as a whole.</p><p>Were smart people, including in Germany. Egon Bar – was such a major politician Social Democratic Party that insisted personally in conversations with the Soviet leadership before the collapse of the Soviet Union, he said, what you need to create a new system security in Europe. Need to help unite Germany, but create a new system where the United States, Canada, Russia, others Central European countries. But not necessary, so that NATO spreads. He said so: if NATO spreads, everything will be the same as in the conditions of the « Cold War », only closer to the borders of Russia. That’s all. Clever was grandfather. Nobody listened to him. Moreover, he somehow angry – also in the archives we have this conversation: if, he says, you will not listen to me, I will never come to Moscow again.Angry at the Soviet leadership. He was right, that’s all this is what happened as he said.</p><p><strong>TUCKER CARLSON:</strong> Yes, of course, his words are realized, you they talked about this many times, it seems to me that this is absolutely true. And many in the States also thought that the relationship between Russia and the US will be normal after the collapse Soviet Union. However, the opposite happened.</p><p>However You never explained why, it seems to you, this happened, why it happened. Yes, maybe the West is afraid strong Russia, but the West is not afraid strong China.</p><p><strong>VLADIMIR PUTIN:</strong> West is afraid of strong China more than strong Russia because there are 150 million people in Russia, and in China – one and a half billion, and China’s economy developing with seven-mile steps – more than five percent per year, was even more. But that’s enough for China. Bismarck once said: the main thing – is potentials. China’s potential is enormous, the first economy in the world today in terms of purchasing power parity, in terms of economy. Already overtaken the United States and long enough, and the pace growing.</p><p>We now we will not say who is afraid of whom, we will not, let’s reason in such categories. And let’s talk about that after 1991, when Russia expected, that she will be taken to the fraternal family « civilized peoples », nothing like this has happened. You deceived us – when I say « you », I don’t personally mean you, of course, and the United States, – promised that there would be no NATO expansion to the east, but five one, five waves of expansion. We all endured, they persuaded everything, they said: no, we our own now, as we say, bourgeois, we have a market economy, there is no power of the Communist Party, let’s to negotiate.</p><p>More that, I also talked about it publicly – now take the elcin time, – there was a moment when « the gray cat ran ». Before that, Yeltsin went to the USA, remember speaking in Congress and talking wonderful words: God bless America. He said everything, these were signals: let us in.</p><p>No, when the events in Yugoslavia began … Before Yeltsina praised – as soon as the events in Yugoslavia began and when he raised his voice for the Serbs, and we could not help but raise our voices for the Serbs, in their defense … I understand, there were complex processes, I understand. But Russia could not help but raise its voices for the Serbs, because the Serbs – is also special, a nation close to us, an Orthodox culture and so on. Well, such a long-suffering people for generations. Well, it doesn’t matter, but the important thing is that Yeltsin expressed support. What did the United States do? In violation of international law, the UN Charter the bombing of Belgrade began.</p><p>The United States released this bottle genie. Moreover, when Russia objected and expressed its indignation, what was said? UN Charter, international law is outdated. Now everyone refers to international law, but then they began to say that it was outdated everything, you need to change everything.</p><p>Really, something needs to be changed, because the balance of power has changed, it is true, but not in this way. By the way, Yeltsin immediately began to pour mud, to indicate that he was an alcoholic, did not understand anything, did not understand. He understood everything and understood everything, I assure you.</p><p>Oh well. I became President in 2000. Thought: okay, that’s it, Yugoslav theme has passed, you must try to restore relations, nevertheless, open this door that Russia tried to pass into. And more of this, I publicly spoke about this, I can repeat, at a meeting here in the Kremlin, with Bill Clinton – leaving power, here next to the next room – I told him, asked a question: listen, Bill, what do you think, if Russia raised the question of joining NATO, do you think this is possible? Suddenly he said: you know, this is interesting, I think so. And in the evening, when we met at dinner, he says: you know, I talked with mine, with my team – no, now it’s impossible. You can ask him, I think he will hear our interview – confirm. I would never say anything like that,if it weren’t. Well, now it’s impossible.</p><p><strong>TUCKER CARLSON:</strong> You were sincere then? Would you join NATO?</p><p><strong>VLADIMIR PUTIN:</strong> Listen, I asked a question: is it possible or not? And I got the answer: no. If I was insincere in his desire to find out the position of the leadership…</p><p><strong>TUCKER CARLSON:</strong> And if he said « yes », would you join NATO?</p><p><strong>VLADIMIR PUTIN:</strong> If he said « yes », the process of rapprochement would begin, and ultimately it could take place if we saw the sincere desire of the partners to do this. But this did not end. Well no, no, okay, good.</p><p><strong>TUCKER CARLSON:</strong> What do you think, why? What are the motives for this? I feel that you are experiencing bitterness about this, I understand. But why do you think the West then pushed you away like that? Where does this hostility come from? Why failed to improve relationships? What were the motives for this, from your point of view?</p><p><strong>VLADIMIR PUTIN:</strong> You said that I feel bitterness from the answer. No it not bitterness, it’s just a statement of fact. We are not the bride and groom, bitterness, resentment – these are not the substances that take place in such cases. Just us they realized that they were not waiting for us there, that’s all. Okay, okay. But let’s build relationships differently, we will look points of contact. Why did we get such a negative answer, you ask your leaders. I can just guess why: too big a country with its own opinion and so on. And the United States – I saw how issues are resolved in NATO…</p><p>I AM I will give one more example now regarding Ukraine. US leadership « clicked » – and all NATO members obediently vote, even if they don’t like something. Now I will say in this connection what happened with Ukraine in 2008, although this is being discussed, nothing new here I won’t tell you.</p><p>Dark no less later, after that, we tried differently build a relationship. For example, there were events in the Middle East, in Iraq, we are very soft, calmly built relations with the States.</p><p>I AM repeatedly raised the question of the United States not supporting either separatism or terrorism in the North Caucasus. But still they continued to do it. And political support, information support, financial support, even military support came from The United States and its satellites in relation to terrorist groups in the Caucasus.</p><p>I once with my colleague, also the President of the United States, raised this question. He says: can’t you have evidence? I say yes. I was ready for this conversation and gave him this evidence. He looked and you know what he said? I apologize, but it was, I will quote, he said: well, I will kick their ass. We were waiting for the answer – there was no answer.</p><p>I AM I say to the FSB director: you write to the CIA, is there any result of a conversation with the President? Wrote once, two, and then received an answer. We have an answer in the archive. The answer came from the CIA: we worked with the opposition in Russia; we believe that this is right and we will continue to work with the opposition. It’s funny. Okay. We realized that there would be no conversation.</p><p><strong>TUCKER CARLSON:</strong> Opposition to you?</p><p><strong>VLADIMIR PUTIN:</strong> Of course, in this case, separatists, terrorists, were meant, who fought with us in the Caucasus. That’s who it was about. They called it the opposition. This is the second moment.</p><p>Third moment, very important, – moment of creation US missile defense systems, the beginning. We talked for a long time The United States does not do this. More than that, after I was invited by Bush’s father, Bush Sr., visit your ocean, there a very serious conversation took place with President Bush, with his team. I suggested that the United States, Russia and Europe jointly create a missile defense system, which, in our opinion, created unilaterally, threatens our safety, despite the fact that officially it was told by the United States that it was being created against missile threats from Iran. Reasoned the same creation of missile defense. I invited them to work together – Russia, USA, Europe. They said it was very interesting. I was asked: are you serious? I say: absolutely.</p><p><strong>TUCKER CARLSON:</strong> When it was, in what year?</p><p><strong>VLADIMIR PUTIN:</strong> I do not remember. It easy to find out on the Internet when I was in the USA at the invitation of Bush Sr. It’s even easier I’ll tell you from whom now.</p><p>To me said: it is very interesting. I say: just imagine if together we will solve such a global strategic security challenge. The world will change. Probably, we will have disputes, probably economic and even political, but we will radically change the situation in the world. Says [in response]: yes. Me asked: are you serious? I say: of course. We need to think, they told me. I say: please.</p><p>Then Minister of Defense Gates, former director, came to this office, where we are talking with you now CIA, and Secretary of State Rice. Here for this table opposite, you see this table, they sat down from this side. I, Minister of Foreign Affairs Affairs, Minister of Defense of Russia – from that side. They told me: yes, we thought, we agree. I say: thank God, great. – « But for some except ».</p><p><strong>TUCKER CARLSON:</strong> That is you twice described how American presidents made some decisions, and then them teams put these solutions downhill?</p><p><strong>VLADIMIR PUTIN:</strong> Exactly. Of course the end we were sent away. I will not to tell details, because I consider it incorrect, yet it was a confidential conversation. But that our offer was rejected, – is a fact.</p><p>Then, it was then that I said: Listen, but then we will be forced to take retaliatory measures. We will create such shock systems, which will certainly overcome the missile defense system. The answer was this: we are not doing against you, and you are doing what you want, proceeding from the fact that it is not against us, not against the United States. I say good. Let’s go. And we created hypersonic systems, and intercontinental range, and continue to develop them. We are now ahead of the creation of drums hypersonic systems of all: and connected States and other countries, – we have them improve every day.</p><p>But we didn’t do it, we suggested going the other way, and we were pushed back.</p><p>Now regarding NATO expansion to the east. Well they promised: no NATO east, inch to east will not be like us has been said. And then what? They said: well, they didn’t fix it on paper, so we will expand it. Five extensions, loaded there and the Baltic states, and the entire East Europe, and so on.</p><p>And now I turn to the main thing: we got to Ukraine. In 2008, at the Bucharest summit, they announced that the doors for Ukraine and Georgia then to NATO open.</p><p>Now about how decisions are made there. Germany, France seemed to be against it, just like some other European countries. But then, as it turned out later, the President Bush, and he’s such a strong guy, strong politician, as I was later told: he pressed us, and we had to agree. It’s funny, like in a kindergarten simple. Where are the guarantees? What a kindergarten, what kind of people are they? On them, you see, « clicked », they agreed. And then they say: Ukraine will not be to NATO, you know. I say: I do not know; I know that you agreed in 2008, and why do not you agree in the future? « Well then clicked on us ». I say: why tomorrow they will not press – and you will agree again. Well, some nonsense. Who to talk to there, I just don’t understand. We are ready to talk. But with whom? Where guarantees? None.</p><p>So, began to develop the territory of Ukraine. What would was not there, I told the background how it developed this territory, what relations were with Russia. There, every second to third had some kind of connection with Russia. And in the elections already in an independent, sovereign Ukraine, which gained independence as a result of the Declaration of Independence, and, by the way, it says that Ukraine – neutral state, and in 2008 suddenly, in front of her opened the door, or gate, to NATO. Here is an interesting movie! We didn’t agree. So here are all the presidents who came to power in Ukraine, they relied on the electorate, or otherwise well treated Russia. It is southeast Ukraine, this is a large number of people. And « to kill » this electorate, which was positive for Russia, was very difficult.</p><p>Viktor Yanukovych came to power, and how: for the first time he won after President Kuchma – organized the third round, which is not provided for in the Constitution of Ukraine. It state coup. Imagine someone didn’t like you in the USA.</p><p><strong>TUCKER CARLSON:</strong> In 2014.</p><p><strong>VLADIMIR PUTIN:</strong> No, before. No, no, that was before. After President Kuchma, Viktor Yanukovych won the election. But his opponents did not recognize this victory, USA supported the opposition, and appointed a third round. What is this? This is a coup. The United States supported him, and came to power as a result of the third round … Imagine that someone didn’t like something in the USA – organized the third round, which is not provided for in the US Constitution. Nevertheless, there [in Ukraine] they did it. Okay, Victor came to power Yushchenko, who was considered prowestern politician. Well, but we also established relations with him, he went to Moscow on visits, we went to Kiev, and I went. We met in an informal setting. Western so western – let. Let it, but people work. The situation should be inside develop, in Ukraine itself independent. After how he led the country,the situation worsened, and Viktor Yanukovych still came to power.</p><p>Maybe be, he was not the best president and politician – I don’t know, I don’t want to give ratings, – but the question arose of association with the European Union. But we are for this always treated very loyal: please. But when they read this association agreement, it turned out that this is a problem for us, because we have a free trade zone with Ukraine, open customs borders, and Ukraine was supposed to open its borders to Europe – and everything flowed into our market.</p><p>We said: no, then it won’t work, we then we will close our borders with Ukraine, customs borders. Yanukovych began to consider how much Ukraine will win and how much will lose, and announced to his counterparties in Europe: I still have to think, before how to sign. As soon as he said, the opposition’s destructive actions, supported by the West, began and everything came to to the Maidan and to the state coup in Ukraine.</p><p><strong>TUCKER CARLSON:</strong> That is, he traded more with Russia than with the European Union, Ukraine?</p><p><strong>VLADIMIR PUTIN:</strong> Of course. It’s not even a matter of trade, although more. Case in cooperative ties on which she stood the entire Ukrainian economy. Cooperation relations between enterprises have been very dense since the Soviet Union. There, one enterprise produced components for final assembly both in Russia and Ukraine, and vice versa. Very close ties were.</p><p>We made a coup, although I will not be from the United States now to speak in detail, I consider it incorrect, but still it was said: you calm Yanukovych there, and we will calm the opposition; let everything is on the path of political settlement. We said: ok, agree, let’s do it. Yanukovych did not apply, as requested us are Americans, no armed forces, no police. And the armed opposition in Kiev held a coup. How to understand this? Who are you at all? – I wanted to ask then United States leadership.</p><p><strong>TUCKER CARLSON:</strong> With the support of whom?</p><p><strong>VLADIMIR PUTIN:</strong> With the support of the CIA, of course. An organization in which, as I understand that you once wanted to work. Maybe thank God that you weren’t taken. Although this is a serious organization, I understand, my former colleagues, that I mean, I worked in the First Chief Management – is intelligence of the Soviet Union. They were our opponents always. Work is work.</p><p>Technically they did everything right, got it, what they wanted, – changed power. But with political point of view is a huge mistake. Here, of course, the political leadership unfinished. Political leadership should it was to see what this would lead to.</p><p>So, in 2008 they opened the doors of Ukraine to NATO. In 2014 conducted a state coup, while those who did not recognize the state coup, and this is the state coup, began to pursue, created a threat to the Crimea, which we were forced to take under their protection. Started the war in Donbass since 2014, using aircraft and artillery against peaceful citizens. After all, it all started. There is video recording when airplanes strike at Donetsk from above. Accepted one large-scale military operation, another one, failed – still being prepared. And still against the background of the military development of this territory and opening of doors to NATO.</p><p>Well, how can we not show concern about what is happening? For our part, that would be criminal carelessness – that’s what it would be. Just political the leadership of the States approached us to hell, for which we could no longer cross, because it destroyed Russia itself. And then we could not leave our co-religionists and, in fact, part of the Russian people under this war machine.</p><p><strong>TUCKER CARLSON:</strong> That is, it was eight years before the conflict began. And what provoked this conflict when you decided that you still need to take this step?</p><p><strong>VLADIMIR PUTIN: </strong>Initially provoked a conflict of state revolution in Ukraine.</p><p>By the way speaking, representatives of three European countries arrived: Germany, Poland and France – and were guarantors signed agreement between the government Yanukovych and the opposition. Signatures of their set as guarantors. Despite this, the opposition made a coup, and all these countries pretended that they did not remember that they were the guarantors of a peaceful settlement. They immediately threw it into the stove, no one remembers.</p><p>I AM I don’t know if they know anything in the United States about this agreement between the opposition and the authorities and about the three guarantors, who instead return this whole process to the political field, – no, supported the coup. Although there was no point in this, believe me. Because President Yanukovych agreed with everything, was ready for early elections in which he had no chance to win, to be honest, there was no chance. Everyone knew that.</p><p>But why a coup, why the victims? Why threats for Crimea? Why then started operations in Donbass? This is what I do not understand. This is where the miscalculation is. CIA brought its case to implementation state coup. And, in my opinion, one of the Secretary of State’s deputies said that they even spent a large amount on this, almost five billion [dollars]. But political the mistake is colossal. Why did this have to be done? All the same could be done, only in the legal way, without any casualties, without the start of military operations and without the loss of Crimea. And we wouldn’t move a finger if it weren’t these bloody events on the Maidan, it would never have occurred to me.</p><p>Because that we agreed that after the collapse The Soviet Union should all be so – on the borders of the union republics. We agreed with that. But we never agreed with the expansion of NATO, all the more we never agreed that Ukraine would be in NATO. We did not agree that there would be NATO bases without any talk with us. We only begged for decades: do not do this, do not do that.</p><p>And what served as a trigger in recent events? Firstly, today’s leadership of Ukraine said that they will not implement the Minsk agreements that were signed as You know, after the events of 2014 in Minsk, where a peace plan was outlined settlement in Donbass. No, the leadership of today’s Ukraine, Minister foreign affairs, all other officials, and then the President himself announced that they did not like anything in these Minsk agreements. In other words, they are not going to fulfill. And the former leaders of Germany, France directly said today – a year and a half ago, – they said bluntly to the whole world that yes, they signed these Minsk agreements, but they never intended to implement them. We were just taken by the nose.</p><p><strong>TUCKER CARLSON:</strong> Have you spoken to the Secretary of State, with the President? Maybe they were you afraid to talk to you? And you told them that if they continue pump up Ukraine with weapons, then you will act?</p><p><strong>VLADIMIR PUTIN:</strong> We are constantly talking about it talked. We turned to the management United States, European countries to this process stopped immediately so that the Minsk agreements were implemented. Frankly saying, I did not know how we would do it, but I was ready to do it. They are difficult for Ukraine, there is very many elements of independence for Donbass, for these territories was provided, this truth. But I was absolutely sure, I will tell you now: I sincerely believed that if all the same will be able to persuade those people who are in Donbass live, – they still had to be persuaded to return to the framework of Ukrainian statehood, – then gradually, gradually the wounds will heal. Gradually when this part of the territory will return to the economic life, in the general social environment, when pensions will be paid, social benefits – all gradually, gradually will grow together. No,nobody wanted it, everyone they only wanted to resolve the issue with the help of military force. But we could not allow.</p><p>And everything came to this situation when in Ukraine announced: no, we will not [execute]. We started preparing for the military actions. They started the war in 2014. Our goal is – to end this war. And we did not start it in 2022, this is an attempt to stop it.</p><p><strong>TUCKER CARLSON:</strong> Do you think you succeeded now to stop? Have you achieved your goals?</p><p><strong>VLADIMIR PUTIN:</strong> No, we have not yet achieved our goals, because one of the goals of – is denazification. This is meant prohibition of all neo-Nazi movements. This is one of the problems that we discussed during the negotiation process, which ended in Istanbul at the beginning of last year, but not on our initiative ended because we – Europeans, in particular – said: it is necessary to create conditions for the final signing of documents. My colleagues in France and Germany said: « How do you imagine how they will sign the contract: with a gun attached to the temple? Needed withdraw troops from Kiev ». I say: OK. We took troops from Kiev.</p><p>How only we took troops from Kiev, immediately our Ukrainian negotiators threw into the trash all our agreements, achieved in Istanbul, and prepared for a long armed confrontation with the help of the United States and their satellites in Europe. This is how the situation developed. And the way she looks now.</p><p><strong>TUCKER CARLSON:</strong> What denazification? What does it mean?</p><p><strong>VLADIMIR PUTIN:</strong> I just want now to say about it. This is very important question.</p><p>Denazification. After gaining independence, Ukraine began seek, as some analysts in the West say, their identity. And I didn’t come up with anything better, how to prioritize this identity false heroes who collaborated with Hitler.</p><p>I AM already said that at the beginning of the 19th century, when theorists appeared independence and sovereignty of Ukraine, they assumed that independent Ukraine should have very good and good relations with Russia. But by virtue of historical development, by virtue of when these territories were part of the Commonwealth, Poland, Ukrainians were brutally persecuted, seized, tried to destroy this identity, behaved very cruelly, it everything remains in the memory of the people. When it started World War II, part of this is extremely the nationalist elite began to work with Hitler, believing, that Hitler will bring them freedom. German troops, even SS troops, they are the dirtiest work to destroy Polish the population, the Jewish population was given just to the collaborators who are with Hitler collaborated. Hence this brutal massacre Polish,Jewish population, Russian too. At the head were persons who are well known: Bandera, Shukhevich. Exactly these people were made national heroes. Here what is the problem. And they always tell us: nationalism and neo-Nazism are in others countries. Yes, there are sprouts, but we push them, and in other countries they are pressed. But in Ukraine – no, in Ukraine they made national heroes, they erect monuments, they are on flags, their names are screaming crowds that walk with torches, as in Nazi Germany. It people who destroyed the Poles, Jews and Russians. We must stop this practice and theory.and in other countries they are pressed. But in Ukraine – no, in Ukraine they made national heroes, they erect monuments, they are on flags, their names are screaming crowds that go with torches, as in Nazi Germany. It people who destroyed the Poles, Jews and Russians. We must stop this practice and theory.and in other countries they are pressed. But in Ukraine – no, in Ukraine they made national heroes, they erect monuments, they are on flags, their names are screaming crowds that go with torches, as in Nazi Germany. It people who destroyed the Poles, Jews and Russians. We must stop this practice and theory.</p><p>Of course, any nation, it has grown, believes part there people … I say that this is part of the common Russian people, they say: no, we are a separate people. Okay, good. If someone considers himself an individual people, has the right to do so. But not based on Nazism, Nazi ideology.</p><p><strong>TUCKER CARLSON:</strong> You will satisfied with the territory that you have now?</p><p><strong>VLADIMIR PUTIN:</strong> I’ll finish now. You are asked a question on neo-Nazism and denazification.</p><p>Here Ukrainian President arrives in Canada – this well known, but hushed up in the West, – and represented in the Canadian parliament a man who, as the speaker of the parliament said, fought during World War II against the Russians. Well, who fought against the Russians during World War II? Hitler and his henchmen. It turned out that this man served in the SS troops, he personally killed both Russians and Poles, and Jews. SS troops formed from Ukrainian nationalists were engaged in this dirty work. President Ukraine stood up with the whole parliament of Canada and applauded to this person. How can you imagine this? Incidentally, the President of Ukraine – is a Jew by nationality.</p><p><strong>TUCKER CARLSON:</strong> And what will you be with this to do? Hitler has been alive for 80 years, Nazi Germany no longer exists, it’s true. You say that you want to put out this fire of Ukrainian nationalism. How do it?</p><p><strong>VLADIMIR PUTIN:</strong> Listen to me. Your question is very subtle… And can I say how I think? Will you be offended?</p><p><strong>TUCKER CARLSON:</strong> Of course I won’t.</p><p><strong>VLADIMIR PUTIN:</strong> He would seem, thin, he is very nasty, this question.</p><p>You say: Hitler has been gone for so many years, 80 years. But his business lives. People who destroyed Jews, Russians and Poles, alive. And the President, the current President of today Ukraine applauds him in the Canadian parliament, applauds standing! Can we say that we are entirely uprooted this ideology if that we see happening today? That’s what denazification in our understanding. We need to get rid of those people who leave this theory and practice in life and try to preserve it, – here what is denazification. That’s what we are under this understand.</p><p><strong>TUCKER CARLSON:</strong> Good. Of course I do not defend Nazism or neo-Nazism. But my question is practical: you do not control the whole country, and it seems to me that you want the whole control her. But how are you then you can uproot ideology, culture, some feelings, history in a country that you do not control? How to achieve this?</p><p><strong>VLADIMIR PUTIN:</strong> And you know, no matter how strange it seems to you, during negotiations in Istanbul we still agreed that – there is all this in writing – neo-Nazism will not be cultivated in Ukraine, including number and will be prohibited at the legislative level.</p><p>Mr. Carlson, we have agreed on this. This, it turns out, can be done during the negotiation process. And there is nothing humiliating for Ukraine as a modern civilized state. Is any state allowed to promote the Nazis? After all, no, right? That’s all.</p><p><strong>TUCKER CARLSON:</strong> Will there be negotiations? And why so far such negotiations – peace talks – regarding there was no settlement of the conflict in Ukraine?</p><p><strong>VLADIMIR PUTIN:</strong> They were, they reached a very high stage of approval positions of a complex process, but still they were almost completed. But after, as we took the troops from Kiev, I already said, the other side, Ukraine, threw away all these agreements and accepted the instructions of Western countries – European under the visor, United States – to fight Russia to a victorious end.</p><p>And more than that: the President of Ukraine is legislative banned from negotiating with Russia. He signed a decree prohibiting everyone from negotiating with Russia. But how will we negotiate if he himself banned himself and forbade everyone? We know that he puts forward some ideas about this settlement. But in order to agree on something, you need conduct a dialogue, right?</p><p><strong>TUCKER CARLSON:</strong> Yes, but you will not speak with Ukrainian President, you will speak with the American President. When was the last time you talked to Joe Biden?</p><p><strong>VLADIMIR PUTIN:</strong> I don’t remember when I talked to him. I don’t remember, you can see.</p><p><strong>TUCKER CARLSON:</strong> You do not remember?</p><p><strong>VLADIMIR PUTIN:</strong> No, but what, should I remember everything or what? I have mine full of affairs. We have domestic political affairs.</p><p><strong>TUCKER CARLSON:</strong> But he finances the war you are waging.</p><p><strong>VLADIMIR PUTIN:</strong> Yes, he finances, but when I’m with him talked, it was before the start of a special military operation, of course, and by the way, I then said – I will not go into details, I never do this, – but I then told him: I believe that you are making a huge mistake of a historical scale, supporting everything that happens there in Ukraine, pushing Russia away. I told him about it – spoke repeatedly, by the way. I think, that it will be correct – here, on this I will limit myself.</p><p><strong>TUCKER CARLSON:</strong> What did he say?</p><p><strong>VLADIMIR PUTIN:</strong> You ask him, you are welcome. It’s easy for you: you are a citizen United States, go and ask him. I’m wrong comment on our conversation.</p><p><strong>TUCKER CARLSON:</strong> But since then you have not talked to him – after February 2022?</p><p><strong>VLADIMIR PUTIN:</strong> No, we didn’t talk. But we have certain contacts. By the way, remember, I am for you talked about my offer together work on a missile defense system?</p><p><strong>TUCKER CARLSON:</strong> Yes.</p><p><strong>VLADIMIR PUTIN:</strong> You can ask everyone – they are all, thank God, alive and well. Both the former President and Condoleezza [Rice] alive and well, and, in my opinion, Mr. Gates, and today’s director of the Central Intelligence Agency Mr. Burns – he was then ambassador to Russia, in my opinion, a very successful ambassador. They are all witnesses to these conversations. Ask them.</p><p>The same thing here: if you are interested in what Mr. President Biden answered me, ask him. In any case, he and I spoke on this topic.</p><p><strong>TUCKER CARLSON:</strong> I understand this very well, but from the outside, for an external observer, it may seem like all this could result in in a situation where the whole world is on the edge wars, maybe even nuclear strikes will be inflicted. Why don’t you call You won’t say to Biden: let’s somehow decide this question.</p><p><strong>VLADIMIR PUTIN:</strong> What to decide? Everything is very simple. I repeat, we have contacts through various departments. I will tell you what we say about this and what we bring to the leadership of the United States: if you really want to stop fighting, you need to stop delivering weapons – everything will end within a few weeks, that’s all, and then you can agree on some conditions before you do – stop.</p><p>What easier? Why should I call him? What to talk about or what to beg for? « Are you going to bet such and such weapons to Ukraine? Oh, I’m afraid, please do not supply ». About what to say something?</p><p><strong>TUCKER CARLSON:</strong> Do you think NATO is worried that it all can outgrow in a global war or even in a nuclear conflict?</p><p><strong>VLADIMIR PUTIN:</strong> Anyway, they talk about it and they try to intimidate their population with an imaginary Russian threat. It obvious fact. And thinking people – are not ordinary people, but thinking people, analysts, those who are engaged in real politics, just smart people – are well aware that this is a fake. The Russian threat is swelling.</p><p><strong>TUCKER CARLSON:</strong> You mean threat of a Russian invasion, for example, to Poland or to Latvia? You can imagine the script, when will you send Russian troops to Poland?</p><p><strong>VLADIMIR PUTIN:</strong> Only in one case: if there will be an attack on Russia from Poland. Why? Because we have no interests in Poland or Latvia – nowhere. Why do we need this? We just have no interests. Some threats.</p><p><strong>TUCKER CARLSON:</strong> Argument – I think you know well – this is what: yes, here he invaded Ukraine, he has territorial claims on the whole continent. You unequivocally say that you do not have such claims of territorial?</p><p><strong>VLADIMIR PUTIN:</strong> This is absolutely excluded. No need to be any analyst: this is contrary to common sense – get involved in some kind of global war. And the global war will put on the brink of destruction all of humanity. It is obvious.</p><p>There is, of course, means of containment. We all the time everyone was scared: tomorrow Russia uses tactical nuclear weapons, tomorrow it uses – no, the day after tomorrow. So what? It just horror stories for the inhabitants, for that to knock out US taxpayers, knock out taxpayers Europe extra money in confrontation with Russia at the Ukrainian theater of operations. The goal of – to weaken Russia as much as possible.</p><p><strong>TUCKER CARLSON:</strong> One of the senior senators of – Chuck Schumer seems to be yesterday said: we need to continue to finance Ukraine, or in the end, American soldiers will have to fight in Ukraine instead of Ukraine. How are you rate such a statement?</p><p><strong>VLADIMIR PUTIN:</strong> This is a provocation, and a cheap provocation. I don’t understand why American soldiers should fight in Ukraine. There are mercenaries from the United States. Most of the mercenaries from Poland, in second place – mercenaries from the USA, on the third – from Georgia. If someone has a desire to send regular troops, this will certainly put humanity on the brink very serious, global conflict. It obviously.</p><p>It need the United States? What for? For thousands kilometers from national territory! Do you have anything to do? You have a lot of problems on the border, problems with migration, problems with state debt – more than 33 trillion dollars. Nothing to do – need to fight in Ukraine?</p><p>Isn’t it better to agree with Russia? To agree, already understanding the situation, which develops today, realizing that Russia will fight for its interests to the end, and, realizing this, in fact, return to common sense, start respecting our country, its interests and seek some solutions? It seems to me that it is much smarter and more rational.</p><p><strong>TUCKER CARLSON:</strong> Who blew up « North stream »?</p><p><strong>VLADIMIR PUTIN:</strong> Of course you are. <em>(Laughter.)</em></p><p><strong>TUCKER CARLSON:</strong> I was busy at that day. I did not blow up « Nord Stream ».</p><p><strong>VLADIMIR PUTIN:</strong> You personally can be, have an alibi, but the CIA [CIA] there is no such alibi.</p><p><strong>TUCKER CARLSON:</strong> Do you have evidence that NATO or the CIA did it?</p><p><strong>VLADIMIR PUTIN:</strong> You know I won’t go into details, but always in such cases they say: look for someone who is interested. But in this case it is necessary look not only for someone who is interested, but also for someone who can do this. Because there can be many interested, but climb to the bottom of the Baltic seas and not everyone can carry out this explosion. These two components must be connected: who is interested and who can.</p><p><strong>TUCKER CARLSON:</strong> But I’m not quite I understand. This is the largest act of industrial terrorism in history and, more the largest CO emission<sub>2</sub> into the atmosphere. But taking into account the fact that you have evidence from your special services, why you will not present such evidence and do not win this war propaganda?</p><p><strong>VLADIMIR PUTIN:</strong> In war propaganda it’s very difficult to defeat the United States, therefore that the United States controls all world media and so many European ones. End Beneficiary the largest European media are American funds. Do you know this? Therefore, you can get involved in this work, but this, as they say, is more expensive for yourself. We can just we will not achieve our sources of information, but we will not achieve the result. To the whole world and so it’s clear what happened, and even American analysts are talking about it directly. Truth.</p><p><strong>TUCKER CARLSON:</strong> Yes, but here is the question – you worked in Germany, it is well known, and the Germans clearly understand that their NATO partners are did, of course, it struck the economy of Germany, – why then the Germans are silent? This confuses me: why did the Germans say nothing on this issue?</p><p><strong>VLADIMIR PUTIN:</strong> It surprises me too. But today’s German leadership is not guided national interests, and guided by interests of the collective West, otherwise difficult explain the logic of their actions or inaction. After all, it’s not only « North Stream – 1 », which blew up. « Nord Stream – 2 » damaged, but one pipe is alive and well, and gas can be supplied to Europe, but Germany does not open it. We are ready, please.</p><p>There are another route through Poland, Yamal – Europe called, too, a large flow can be carried out. Poland closed it, but Poland bites from the Germans, receives money from pan-European funds, and the main donor to these pan-European funds – Germany. Germany feeds Poland to a certain extent. And they took and closed the route to Germany. What for? I do not understand.</p><p>Ukraine, in which the Germans supply weapons and give money. The second sponsor after the United States in terms of financial assistance to Ukraine – this is Germany. Two gas routes pass through Ukraine. They took one route closed simply, Ukrainians. Open the second route and please get gas from Russia. They do not open.</p><p>Why Germans do not say: « Listen guys, we give you money and weapons. Unscrew the valve, please skip from Russia gas for us. We buy at a tripod liquefied gas in Europe, it drops the level our competitiveness, the economy as a whole to zero. Do you want us to give you money? Give us it’s normal to exist, to earn money from our economy, but we give ». No, they don’t do it. Why? Ask they have. <em>(Knocking on the table.)</em> What is it here that they have – the same thing in their head. There people are very incompetent.</p><p><strong>TUCKER CARLSON:</strong> Maybe the world is now divided into two hemispheres: one hemisphere with cheap energy, other – no.</p><p>I AM I want to ask a question: now the multipolar world – You can describe alliances, blocks, who is on whose side, what do you think?</p><p><strong>VLADIMIR PUTIN:</strong> Listen you said the world is divided into two hemisphere. The head is divided into two hemisphere: one is responsible for one area of activity, the other – is more creative and so on. But it’s still one head. It is necessary that the world be united, so that security is common, not designed for this « golden billion ». And then – only in this case – the world will be stable, sustainable and predictable. And as long as the head divided into two parts, this is a disease, severe disease. The world goes through this period of difficult diseases.</p><p>But it seems to me that thanks to honest journalism – they [journalists] how doctors work – can be, it will be possible to somehow combine it all.</p><p><strong>TUCKER CARLSON:</strong> I will give one example. The American dollar united the whole world in many ways. Do you think the dollar will disappear like a reserve currency? Which how did sanctions change the place of the dollar in the world?</p><p><strong>VLADIMIR PUTIN:</strong> You know, this is one of the gross strategic mistakes of political United States Guides – Use dollars as an instrument of foreign policy struggle. The – dollar is the foundation of US power. I think that all this is perfectly understood: how much don’t print dollars, they fly around the world. US inflation is minimal: I think three percent, about 3.4, acceptable to the United States absolutely. And they print endlessly, of course. What is the debt of 33 trillion talking about? This is an emission.</p><p>Dark no less is the main weapon of conservation US power in the world. As soon as the political leadership decided to use the dollar as instrument of political struggle, they inflicted a blow to this American power. I don’t want to use any non-literature expressions, but this is stupidity and a huge mistake.</p><p>Here see what happens in the world. Even among US allies are declining stocks in dollars now. Everyone is looking at the fact that happens and start looking for an opportunity protect yourself. But if in relation to some US countries restrictive measures such as limiting calculations, freezing holdings, and so on, this is a huge alarm and signal for the whole world.</p><p>What happened to us? Until 2022, approximately 80 percent of external settlements Russian trade was in dollars and euros. At this dollar was about 50 percent in our settlements with third countries, and now, in my opinion, only 13 percent left. But we did not prohibit the use of the dollar, we did not strive for this. US decided to limit our calculations in dollars. I think that complete nonsense, you see, from the point of view of the interests of the United States itself, taxpayers of the United States. Because that it strikes the US economy, undermines the power of the United States in the world.</p><p>By the way, the calculations in the RMB were approximately three percent. Now 34 percent we pay in rubles and about the same amount, 34 percent with a small one, in RMB.</p><p>Why Did the United States do this? I can only explain this with arrogance. They probably thought that everything would collapse, but nothing collapsed. See more, other countries, including oil-producing countries, begin to speak and do already, they are counting on the sale of oil in the RMB. Do you understand what is happening or not? Someone understands this in the same United States? What are you doing? Cut yourself off … All experts ask any smart and thinking person in the States: what is a dollar for USA? You kill him yourself.</p><p><strong>TUCKER CARLSON:</strong> I think it’s really fair rating.</p><p>The next question. Maybe you exchanged one colonial power to another, but more so sparing? Maybe BRICS today is in danger that a better colonial power – China will dominate there? Is it good for sovereignty, what do you think? You are worried it?</p><p><strong>VLADIMIR PUTIN:</strong> These horror stories are good for us known. This is a horror story. China and I are neighbors. Neighbors, as well as close relatives, do not choose. We have a common border with them of thousands of kilometers. This is the first.</p><p>The second – we have been used to living together for centuries.</p><p>The third – China’s foreign policy philosophy is non-aggressive, China’s foreign policy idea is always looking for a compromise, and we see it.</p><p>Next such a point. We are always told, and now you tried to set out this horror story in a soft form, but nevertheless this is the same horror story: the volume cooperation with China is growing. Growth rate China’s cooperation with Europe is greater and higher than the pace increased cooperation with China of the Russian Federation. Ask the Europeans: are they not afraid? Maybe, and afraid, I don’t know, but to the Chinese market try to get into anything, especially when they are now colliding with problems in the economy. And Chinese enterprises master the European market.</p><p>Is there little Chinese business in the USA? Yes, political decisions are such that they trying to limit cooperation with China. Mr Tucker, to your own detriment, you do it to your own detriment: limiting cooperation with China, you are damaging yourself. This is a delicate area, and there are no simple linear solutions here, just like with a dollar.</p><p>Therefore, before introducing any illegitimate sanctions – illegitimate in terms of United Nations Charter, – how to think. In my opinion, those who make decisions have problems with this.</p><p><strong>TUCKER CARLSON:</strong> You said a minute ago that today the world will be much better if there are no two competing alliances that compete with each other. Maybe today’s American administration as you say how you you think you are opposed to you, but maybe the next administration in the United States, the government after Joe Biden wants to establish contacts with you and you will want to establish contacts with them? Or it doesn’t play roles?</p><p><strong>VLADIMIR PUTIN:</strong> I’ll say it now.</p><p>But to finish the previous question. We have $ 200 billion, we set the task with my colleague, friend, with Chairman Xi Jinping, which is year should have reached 200 billion dollars of trade with China. And we exceeded this bar. According to our data, this is already 230 billion, according to Chinese statistics – 240 billion dollars, if we count everything in dollars, we have trade with China.</p><p>And a very important thing: we have a balanced one, this trade turnover, and it complements each other both in the high-tech sphere, and in the energy sector, and in the field of scientific developments. He is very balanced.</p><p>As for BRICS as a whole – Russia has become the chairman of BRICS since this year, – then the BRICS countries are developing at a very fast pace.</p><p>Look, God give me memory so as not to make a mistake, but in 1992, in my opinion, the share of countries « sevens » in the global economy was 47 percent, and in 2022 she fell somewhere, in my opinion, to 30 with a little. The share of BRICS countries in 1992 was total 16 percent, and now it exceeds level « sevens ». And this is not connected with any events in Ukraine. Trends the development of the world and the world economy are what they just said, and this is inevitable. This will continue to happen: as the sun rises – impossible to prevent, it is necessary to adapt to this.</p><p>How Are the United States adapting? With the help forces: sanctions, pressure, bombing, use of armed forces. This is due to arrogance. People do not understand in your political elite that the world is changing due to objective circumstances, and you need to correctly, on time, on time make the right decisions to keep your level, excuse me even if someone wants a level of dominance. Such rude actions, including in relation to Russia, say, other countries, lead to the opposite result. This is obvious fact, today it has become apparent.</p><p>You I was asked now: another leader will come and change something? It’s not about the leader, not in the personality of a particular person. I had a very good relationship, say, with Bush. I know he was represented in the States some village guy who thinks little. I assure you that this is not so. I think, that in relation to Russia, he also made many mistakes. I told you about 2008 and the decision in Bucharest to open doors to NATO to Ukraine and so on. It was the same with him, but he pressed the Europeans.</p><p>But in general, at the human level, I had very good and good with him relationship. He is not more bad than any other American or Russian, or European politics. I assure you, he understood what he was doing, as well as others. I and Trump had such a personal relationship.</p><p>Case not in the personality of the leader – it is in the mood of elites. If in American society prevail the idea of dominance at all costs, and with the help of power actions, then nothing will change – will only be worse. And if in the end comes the realization that the world is changing due to objective circumstances, and you need to be able to adapt to them on time, using the advantages that the United States still retains today, then probably something can change.</p><p>Look, China’s economy has become the first economy in the world according to purchasing power parity, in volume they overtook the United States for a long time. Then the USA, and then India – a half billion people, then Japan, in fifth place – Russia. Over the past year, Russia has become the first economy in Europe, despite all the sanctions and restrictions. This is normal from your point vision? Sanctions, restrictions, impossibility settlements in dollars, disconnection from SWIFT, sanctions against our ships carrying oil, aircraft sanctions – sanctions in everything, everywhere. The largest number of sanctions in the world apply, apply against Russia. And we became the first economy in Europe during this time.</p><p>Tools that the United States uses do not work. Well, you need to think what to do. If this awareness comes to the ruling elites, then yes, then the first person of the state will be act in anticipation of what is expected of him voters and people who make decisions at various levels. Then something may change.</p><p><strong>TUCKER CARLSON:</strong> You describe two different systems, say that the leader acts in the interests of voters, but at the same time some decisions by the ruling classes are accepted. You head the country for many years, do you think, with your experience, who makes decisions in America?</p><p><strong>VLADIMIR PUTIN:</strong> I dont know. America – is a complex country, such, on the one hand, conservative, on the other hand, rapidly changing. It’s not easy for us to figure this out.</p><p>Who makes decisions in the election? Is it possible to understand this when each state has its own legislation, each state regulates himself, someone can be removed from elections at the state level. This is two-stage electoral system, it’s very difficult for us to figure this out. Of course, there are two parties that are dominant: Republicans and Democrats. And within the framework of this party system – decision-making centers preparing solutions.</p><p>Then, see why in relation to Russia after the collapse of the Soviet Union, in my opinion, such an erroneous, rude, completely unreasonable policy was carried out pressure? After all, this is a policy of pressure. NATO expansion, support for separatists in the Caucasus, creation of a missile defense system Defense – these are all elements of pressure. Pressure, pressure, pressure … Then dragging Ukraine into NATO. This is all pressure, pressure. Why?</p><p>I AM I think, including because there were created, conditionally speaking, excess production capacities. There have been many the centers were also created by specialists in the Soviet Union, who did not know anything else. They thought they were convincing political leadership: we must continue to hammer Russia, try to spoil it, create several quasi-state entities on this territory and already subjugate in a divided form, use their combined potential for future struggle with China. This is a mistake, including that it is associated with the excessive potential of those who worked to confront the Soviet Union. Need to get rid of this – there must be new, fresh forces, people who look to the future and understand what is happening in the world.</p><p>Look, how Indonesia is developing! 600 million person. Where to get from this? Nowhere. You just need to proceed from the fact that Indonesia will enter, it is already included, in the club of leading economies of the world, be that as it may – someone likes it or I do not like.</p><p>Yes, we understand and realize that in the United States, despite all the economic problems, nevertheless, the normal situation and decent economic growth – 2.5 percent GDP growth, in my opinion.</p><p>But if you ensure the future, then you need to change the approach to the fact that is changing. As I said, the world is everything will change equally, regardless of even how the events in Ukraine end. The world is changing. In the States themselves, experts write that gradually the States still their they change their position in the world, – your experts themselves write, I read them. The only question is how this will happen: painfully, quickly or softly, gradually? And they write it people who are not anti-American, – they just look at the development trends in the world. That’s all. For in order to evaluate them, change policies, need people who think, look forward, can analyze and recommend some solutions at the level of political leadership.</p><p><strong>TUCKER CARLSON:</strong> I have to ask. You clearly said that NATO expansion has become a violation of promises and is a threat your country. But before you sent troops to Ukraine, at a security conference, The US Vice President supported the desire of the President of Ukraine to join NATO. You think that including provoked military operations?</p><p><strong>VLADIMIR PUTIN:</strong> I repeat again: we repeatedly, repeatedly offered to seek a solution problems that arose in Ukraine after state coup 2014, by peaceful means. But no one listened to us. And more than that, the Ukrainian leadership, which was under the full control of the United States, suddenly stated that it would not comply with the Minsk agreements – they don’t like anything there, – and continued the military activity in this territory. And parallel the development of this territory by NATO military structures under the guise of various centers for training and retraining of personnel. Essentially started there create bases. That’s all.</p><p>In Ukraine announced that the Russians are – the law was adopted by the – non-titular nation, and at the same time adopted laws that restrict rights non-titular nations. In Ukraine. Ukraine, having received all these southeastern people as a gift from the Russian people territory, suddenly announced that the Russians on this territory – non-titular nation. Fine? This is all in the aggregate and caused a decision to end the war that neo-Nazis in Ukraine began in 2014, armed way.</p><p><strong>TUCKER CARLSON:</strong> You think Zelensky has freedom, for that to negotiate a settlement this conflict?</p><p><strong>VLADIMIR PUTIN:</strong> I dont know. There details, of course, it’s hard for me to judge. But I think that is, in any case, it was. His father fought with the Nazis, with the Nazis during World War II, I once spoke to him about this. I said: « Volodya, what are you doing? Why are you supporting today neo-Nazis in Ukraine when your father fought with fascism? He is a front-line soldier ». I will not say that he answered, this is a separate topic, and I think it’s wrong.</p><p>But as for freedom of choice – why not? He came to power on expectations the Ukrainian population that it will lead Ukraine to peace. He talked about this – he is due to this and won the election with a huge advantage. But then, when he came to power, in my opinion, I understood two things. Firstly, better not to quarrel with neo-Nazis and nationalists, because they are aggressive and very active – anything can be expected from them. And secondly, the West is led by the United States support them and always will be support those fighting Russia, – it is profitable and safe. So he took an appropriate position, despite the promise to his people to end the war in Ukraine. He tricked his voters.</p><p><strong>TUCKER CARLSON:</strong> You think that now, in February 2024, he has the freedom to speak with your Government, to try somehow with his help the country? Can he do it himself?</p><p><strong>VLADIMIR PUTIN: </strong>Why not? He believes himself head of state, he won the election. Although we in Russia believe that everything that happened after 2014, the primary source of power is the coup, and in this I mean, even today’s power is flawed. But he considers himself president, and in this capacity he is recognized by the United States, and all of Europe, and almost the rest of the world. Why not? He can.</p><p>We were negotiating with Ukraine in Istanbul, agreed, he knew about it. Moreover, the leader of the negotiating group, Mr. Arachamiya, in my opinion, his last name, he still leads the ruling faction parties, presidential parties in Rada. He is still leads the presidential faction in Rada – in the country’s parliament, he still sits there. He even put his signature preliminary on this document, which I tell you about. But then he is publicly said to the whole world: « We were ready to sign this document, but Mr. Johnson arrived, then Prime Minister Great Britain, dissuaded us from this and said that it is better to fight with Russia. They are for us they will give everything so that we return lost during clashes with Russia. And we agreed with that offer ». Look published it statement. He said it publicly.</p><p>Can will they come back to this or not? This is the question: do they want or not? And after that, Mr. President Ukraine issued a decree prohibiting negotiations with us. Let him cancel this decree, and that’s it. We never refused to negotiate. We all the time we hear: is Russia ready, ready? Yes, we did not refuse! They publicly refused. Well, let’s cancels his decree and enters into negotiations. We never refused.</p><p>And the fact that they obeyed the demand or to the persuasion of the former Prime Minister of Great Britain, Mr. Johnson, it seems to me that this is ridiculous and very, as it were, sad. Because, as Mr. Arachamia said, « we still a year and a half ago they could stop these hostilities, end this war, but the British persuaded, and we refused this ». Where now Mr. Johnson? And the war continues.</p><p><strong>TUCKER CARLSON:</strong> This is a good question. Why did he do this?</p><p><strong>VLADIMIR PUTIN:</strong> Yes, hell knows, I don’t understand. The overall installation was. For some reason, everyone had the illusion that Russia could be defeated on the battlefield, – from arrogance, from a pure heart, but not from a big mind.</p><p><strong>TUCKER CARLSON:</strong> You described the connection between Russia and Ukraine, described Russia that it is an Orthodox country, You talked about it. And what does it mean for You? You are the leader of a Christian country like you you describe yourself. What effect does this have on you?</p><p><strong>VLADIMIR PUTIN:</strong> You know, as I said, in 988 Prince Vladimir baptized, he himself was baptized following the example of his grandmother – Princess Olga, and then baptized his squad, and then gradually, for several years, baptized and all of Russia. It was a long process – from pagans to Christians, for many years took. But ultimately this is Orthodoxy, Eastern Christianity, it is deeply rooted in the minds of the Russian people.</p><p>When Russia expanded and absorbed other nations that profess Islam, Buddhism, Judaism, Russia has always been very loyal to those people who profess other religions. This is her strength. It is absolutely definitely.</p><p>And the fact is that in all world religions, which I just spoke about and which are traditional religions of the Russian Federation, in fact, the main points and core values are very similar, if not to say, they are the same. And always Russian authorities were very careful about the culture and religion of those peoples who came into the Russian Empire. This, in my opinion, forms the basis of both security and the sustainability of Russian statehood. Because everything peoples living in Russia mainly consider her motherland.</p><p>If to you, say, from Latin America people relocate, or to Europe – even clearer and a clear example of – people come, but they came from their historical homeland to you or to European countries. And the people who profess different religions in Russia, they consider Russia their Motherland – they do not have another Motherland. We are together, this is one big family. And the values of traditional ones are very similar. When I said « this is one big family », but everyone has their own family, and this is the basis our society. And if we say that the Motherland and the family are specific to each other are very connected, then it is. Because you cannot provide a normal future for our children and for our family if we do not ensure a normal, sustainable future for the whole country, for the motherland. Here why patriotism is so developed in Russia.</p><p><strong>TUCKER CARLSON:</strong> If you will allow, religions are different. The fact is that Christianity – non-violent religion, Christ says: « substitute the other cheek », « do not kill » and so on. And how can a leader be Christian, if you have to kill someone else? How can this be reconciled in yourself?</p><p><strong>VLADIMIR PUTIN:</strong> Very easy when it comes to goes about protecting himself and his family, his homeland. We are not attacking anyone. Where did it start events in Ukraine? From the coup and from the beginning of hostilities in the Donbass – that’s why. And we protect our people, ourselves, our Homeland and our future.</p><p>What concerns religion as a whole, you know, because not in external manifestations, not in go to church every day or hit your head on the floor. She is in the heart. And we have a human-oriented culture. Dostoevsky, which is very known in the West as a genius of Russian culture, Russian literature, – spoke a lot about this about the Russian soul.</p><p>Still, Western society is more pragmatic. Russian a person, a Russian person thinks more about the eternal, thinks more about the values of moral, moral. I don’t know, maybe you won’t agree with me, but still Western culture more pragmatic. I’m not saying this is bad, this enables today’s « gold the billion » to achieve good success in production, even in science and so on. There is nothing here bad – I’m just saying we’re kind of how we look the same, but consciousness is a little built differently.</p><p><strong>TUCKER CARLSON:</strong> That is, you think, is there something supernatural acting? When you look at what is happening in the world, do you see the work of the Lord? Do you tell yourself that here I see actions some superhuman powers?</p><p><strong>VLADIMIR PUTIN:</strong> No, I honestly don’t think so. I think that the world community develops according to its internal laws, and they are what they are. There is no escape from this, it has always been in the history of mankind. Some nations and countries rose, multiplied, strengthened, then they left the international arena in the quality to which they are used. I probably don’t need to give these examples: starting with the same Ordinary conquerors, from Genghis Khan, then from the Golden Horde, ending the great Roman empire. In history humanity, it seems, there was nothing more like the great Roman Empire.</p><p>Dark no less, the potential of the barbarians gradually accumulated, accumulated, and under their blows the Roman Empire fell apart, because that there were more barbarians, they started as a whole develop well, as we say now, economically, they began to strengthen. And that mode, which was imposed by the great Roman empire in the world, it fell apart. Truth, fell apart long – 500 years, this the process of decomposition of the great Roman Empire took 500 years. The difference with the current situation is that change processes today go much faster than during the great Roman Empire.</p><p><strong>TUCKER CARLSON:</strong> But when then the empire of AI begins – artificial intelligence?</p><p><strong>VLADIMIR PUTIN:</strong> You are me in more and more complex questions immerse yourself. In order to answer, you need be, of course, a specialist in the field of large numbers, in the field of this artificial intelligence.</p><p>Humanity has many threats: research in the field of genetics, which can superhuman create, a special person – a warrior man, a human scientist, human athlete. Now they say that in the USA Ilon Musk has already introduced a chip into the brain of a person.</p><p><strong>TUCKER CARLSON:</strong> What do you think of this?</p><p><strong>VLADIMIR PUTIN:</strong> I think that The mask cannot be stopped – it will still do what it sees fit. But we need to somehow negotiate with him, we need to look for some ways to convince him. I think he’s smart man, that is, I am sure that he is a smart person. We must somehow agree with him that this process needs to be canonized, subjugated some rules.</p><p>Humanity, of course, it should be thought about what will happen to him in connection with the development of these latest research and technology in genetics or in artificial intelligence. Prognose approximately what will happen. Therefore, when humanity felt a threat to its existence from nuclear weapons, everything nuclear weapons owners began among themselves to agree, because they understood that their sloppy use can lead to a complete, total destruction.</p><p>When there will be an understanding that the infinite and uncontrolled development of artificial intelligence, either genetics or some other modern directions to stop which impossible, anyway, these studies will, just as it was impossible to hide what gunpowder is from humanity, and it is impossible to stop research in one or another area, these studies will still be, but when humanity feels a threat to itself, humanity as a whole, then, it seems to me, will come period to negotiate on the interstate level about how we will regulate it.</p><p><strong>TUCKER CARLSON:</strong> Thank you very much for the time you are paid. I want to ask another question.</p><p>Evan Gershkovich, he is 32 years old, American journalist, he is in custody already more years, this is a big story in the USA. I want to ask you: you are ready as a goodwill gesture to free him, so that we took him to the USA?</p><p><strong>VLADIMIR PUTIN:</strong> We have done so many gestures of goodwill that it seems to me that we have exhausted everything limits. We are nobody on goodwill gestures never answered with similar gestures. But we, in principle, are ready to say that we do not exclude the possibility that we can do this in the oncoming movement on the part of our partners.</p><p>And when I say « partners », I mean primarily representatives special services. They are in contact between by themselves, and they discuss this topic. We do not taboo on not solving this problem. We ready to solve it, but there are certain conditions that are discussed through partnership channels between special services. It seems to me that this is possible to agree.</p><p><strong>TUCKER CARLSON:</strong> Of course everything is happening for centuries – the country catches a spy, delays he and then exchanges for someone. Of course, this is not my business, but this situation is different in that this person is completely definitely not a spy – it’s just a child. And maybe he, of course, violated your legislation, but he is not a spy and certainly did not spy. Maybe he still in a different category? Maybe be it would be unfair to ask in exchange someone else on him?</p><p><strong>VLADIMIR PUTIN:</strong> You know, you can say what it is spy that is not a spy, but there are certain things prescribed by law. If a person gets secret information does it on conspiratorial basis, then this is called espionage. He did just that: he received classified, secret information, and he did it conspiratorially. I do not know, maybe he was dragged in, someone could drag him into this business, maybe he did all by negligence, by own initiative. But in fact, this is called espionage. And everything is proven, because he was taken red-handed – upon receipt this information. If it were any far-fetched things invented, unproven, then that would be a different story. He was taken red-handed when he received secret information on conspiracy basis. Well what is it?</p><p><strong>TUCKER CARLSON:</strong> You say that he worked for the American government, for NATO, or he is just a journalist who received information that should not have been in his hands? It seems to me that there is still a difference between these two categories.</p><p><strong>VLADIMIR PUTIN:</strong> I don’t know who he worked for. But I repeat again: obtaining secret information on a conspiratorial basis is called espionage, and he worked in the interests of American intelligence agencies, some other structures. I do not think that he worked for Monaco – it is hardly Monaco interested in receiving this information. These special services should agree among themselves, understand? There are some developments there, there are people who, in our opinion, are also not connected with special services.</p><p>Listen, here I will tell you: sitting in one country, country – United States ally, a person who, for patriotic reasons, eliminated a bandit in one of the European capitals. During events in the Caucasus, you know that he [bandit] did? I don’t want to talk, but nonetheless I will say: he laid out our soldiers captured on the road, and then drove through their heads with a car. What kind of person is this and is it human? But there was a patriot who eliminated it in one of the European capitals. He did it’s on your own initiative or not – it another question.</p><p><strong>TUCKER CARLSON:</strong> Evan Gershkovich nothing he didn’t do this, it’s a completely different story.</p><p><strong>VLADIMIR PUTIN:</strong> He did something else.</p><p><strong>TUCKER CARLSON:</strong> He is just a journalist.</p><p><strong>VLADIMIR PUTIN:</strong> He is not easy journalist, I repeat again. This is a journalist who received a secret information on a conspiratorial basis. Well yes, this is a different story at all.</p><p>I AM just talking about those people who are, essentially under the control of the US authorities, where they did not sit in prison, and there is a dialogue between special services. This should be decided quietly, calmly, at a professional level. There are contacts, let work.</p><p>I do not exclude that the person you spoke of, Mr. Gershkovich, may be in his homeland. Why not? It makes no sense to keep him in prison in Russia more or less. But let the colleagues of our intelligence officers on the American side also think about how to solve the problems that our special services face. We are not closed to negotiations. Moreover, these negotiations are ongoing, and there have been many cases when we agreed. We can agree now, but we just need to agree.</p><p><strong>TUCKER CARLSON:</strong> I hope you him let out. Thank you very much, Mr. President.</p><p><strong>VLADIMIR PUTIN:</strong> I would also like to, so that he goes home after all. I speak sincerely absolutely. But, I repeat, the dialogue is going on. The more we make public things of this kind, the more difficult it is to solve them. All should be calm.</p><p><strong>TUCKER CARLSON:</strong> Honestly, with the war, I don’t know, it works it or not. If you will, I will ask another question.</p><p>You may not want to answer for strategic reasons, but are you not worried that what is happening in Ukraine may lead to to something much larger and much more terrible? And as far as you are ready, you are motivated to call, for example, to the States and say: let’s negotiate?</p><p><strong>VLADIMIR PUTIN:</strong> Listen, I’m already said: we did not refuse to negotiate. We do not refuse – this is the western side, and Ukraine, of course, is a satellite of the United States today. This is obvious. True, I don’t want it to sound like some kind of curse or insult to someone, but we understand, yes, what is happening?</p><p>Financial support – 72 billion – gave, Germany is in second place, other European countries, tens of billions dollars go to Ukraine. A huge flow of weapons goes.</p><p>Tell me today’s leadership of Ukraine: listen, let’s sit down, negotiate, cancel your stupid decree or decree and sit down, talk. We are did not refuse.</p><p><strong>TUCKER CARLSON:</strong> Yes, you already have it said. I understand perfectly, of course, that this is not a curse. And in fact, it was reported that Ukraine was not allowed to sign the world at the direction of the former Prime Minister Great Britain, which acted on orders from Washington. That’s why I ask why you do not directly solve these issues with the Biden administration, which controls the Zelensky administration in Ukraine?</p><p><strong>VLADIMIR PUTIN:</strong> If the administration Zelensky in Ukraine refused to negotiate, I proceed from the fact that they did this on the instructions of Washington. Let now, if they see in Washington that this is the wrong decision, let them refuse it, find some kind of pretext subtle, not offensive to anyone, find this solution. We did not make these decisions – there we made a decision, even if they refuse it. That’s all.</p><p>But they made the wrong decision, now we have to look for a way out of this wrong decision, tails to record, correct their errors? They are done, let them correct. We are – for.</p><p><strong>TUCKER CARLSON:</strong> I want to make sure I’m right I understand. That is, you want to achieve in the way negotiations on the decision of what is happening now in Ukraine, right?</p><p><strong>VLADIMIR PUTIN:</strong> Correctly. But we are achieved this, we created a large document in Istanbul, which was initialed by the head of the Ukrainian delegation. There is his signature, on excerpt from this contract – not on everything, but on aging. He put a signature mine, and then he said: « We were ready sign, and the war would have ended a long time ago, a year and a half ago. But Mr. Johnson came, dissuaded us from this, and we missed this chance ». Well missed, made a mistake – let them return to this, that’s all. But why should we fuss and correct someone’s mistakes?</p><p>I understand, we can say that our mistake is that we intensified actions and with the help of weapons decided to end this war, as I said, started in 2014 in Donbass. But I will return you even deeper, I already talked about this, we are now discussing this. Then we will return in 1991, when we were promised NATO not to expand, we will return in 2008, when the gate to NATO opened, back to the Declaration of Independence of Ukraine, where it proclaimed itself a neutral state. Let’s get back to the fact that NATO bases and American bases, English began to arise in Ukraine, to create these threats for us. Let’s get back to the fact that the coup committed in Ukraine in 2014. Meaningless, right? You can roll this ball there and back endlessly. But they are stopped negotiations. Error? Yes. Correct it. We ready. What else?</p><p><strong>TUCKER CARLSON:</strong> Do you think that it would be too humiliating for NATO now to recognize Russia’s control that two years ago compiled Ukrainian territory?</p><p><strong>VLADIMIR PUTIN:</strong> But I said: let them think how to do it with dignity. There are options, but if there is a desire.</p><p>Still noisy, shouting: we need to achieve strategic defeat of Russia, defeat on the battlefield … But now, apparently, awareness comes that this not easy to do, if at all possible. In my opinion opinion, this is impossible by definition, this will never happen. It seems to me that now the realization of this has come to those who control power in the West. But if so and if this awareness has come, think now what to do next. We are ready for this dialogue.</p><p><strong>TUCKER CARLSON:</strong> Are you ready to say, for example, NATO: congratulations you won, let’s make a situation keep as it is now.</p><p><strong>VLADIMIR PUTIN:</strong> You know, this is a subject negotiations that no one wants to conduct with us or, more precisely, they want, but they don’t know how. I know what they want, – I not only see it, but I know, what they want, but they can’t understand how to do it. They thought of it, brought it to the situation in which we are. We didn’t bring it, but our « partners », opponents brought it to this. Ok, let them think now, how to turn it the other way. We do not refuse.</p><p>It would be funny if it weren’t so sad. This endless mobilization in Ukraine, hysteria, internal problems, all this … Sooner or late anyway we will agree. And you know what? Maybe even strange in today’s situation will sound: everything equal relations between nations will recover. It will take a lot of time, but it will recover.</p><p>Absolutely I will give unusual examples. On the battlefield clash, a concrete example: Ukrainian soldiers were surrounded by – this is a concrete example from life, fighting – our soldiers shout to them: « Shans no, give up! Come out, be alive, give up! ». And suddenly from there in Russian, shout in good Russian: « Russians do not give up! » – and everyone died. They are still Russian feel.</p><p>In this sense, what is happening is, to a certain extent, an element of civil war. And everyone thinks in the West that fighting is forever pulled one part of the Russian people from another. No. Reunion will happen. It nowhere and never gone.</p><p>Why Ukrainian authorities pull out the Russian Orthodox Church? Because it does not unite the territory, but the soul, and no one will be able to divide it.</p><p>Finish or something else?</p><p><strong>TUCKER CARLSON:</strong> I have everything then. Thank you big, Mr. President.</p><p><em><a href=\"https://social.infogalactic.com/micropost/e6968778-13b7-42c3-ac1c-5fb8d8ae66a3\">DISCUSS ON SG</a></em></p></div>",
  "content_text": "This is\nan autotranslation of the Russian transcript\nprovided by the Kremlin.\nINTERVIEW TO TUCKER CARLSON\nVladimir Putin answered questions from Tucker Carlson – journalist, founder of the\nTucker Carlson Network\nvideo platform.\nTUCKER CARLSON\n:\nMr. President, thank you very much.\nOn February 24th, 2022, you turned to your country and nation when the conflict in Ukraine began. You said you were acting because you came to the conclusion that with the help of NATO, the United States can start a sudden attack, attack on your country. For Americans are like paranoia. Why do you think America could deliver an unexpected blow in Russia? How did you come to this conclusion?\nVLADIMIR PUTIN\n:\nIt’s not that America was about to deliver an unexpected blow in Russia, I never said. Do we have talk shows or do we have a serious conversation?\nTUCKER CARLSON\n:\nThis is a beautiful quote. Thanks. We have a serious conversation.\nVLADIMIR PUTIN\n:\nYou have a historical basic education, how I understand, huh?\nTUCKER CARLSON\n:\nYes.\nVLADIMIR PUTIN\n:\nThen I will let – just 30 seconds or one minute – give a little historical help. Do you mind?\nTUCKER CARLSON\n:\nPlease of course.\nVLADIMIR PUTIN\n:\nSee where our relations with Ukraine began, from where did she take it, Ukraine?\nThe Russian state began to gather as centralized, it is considered a year the creation of the Russian state – 862, when Novgorodians – there is such a city of Novgorod in the north-west of the country – invited Prince Rurik from Scandinavia to the prince, from the Varangians. 862 year old. In 1862 Russia celebrated its 1000th anniversary statehood, and in Novgorod there is a monument dedicated 1000th anniversary of the country.\nIn 882, the successor of Rurik, Prince Oleg, who performed, in fact, the functions of the regent in the young son Rurika, and Rurik died by this time, came to Kiev. He removed two brothers from power, who, apparently, were once members of the Ryurik squad, and thus Russia began to develop with two centers: in Kiev and in Novgorod.\nNext, a very significant date in the history of Russia, – 988. This is the Baptism of Russia when Prince Vladimir, this is the great-grandson of Rurik, baptized Russia and received Orthodoxy – Eastern Christianity. Since that time the beginning the centralized Russian state is being strengthened. Why? Common territory, single economic relations, one language and after the baptism of Russia – one faith and power prince. Central Russian begins to take shape state.\nBut for various reasons after the introduction succession – also in ancient times, Middle Ages – Yaroslav the Wise, a little later, after he passed away, the succession was difficult, not transmitted directly from father to elder son, and from the prince who passed away, his brother, then sons on different lines. All this led to the fragmentation of Russia – of a single state, which began to take shape as one. Nothing this is not special, the same thing happened in Europe. But the fragmented Russian state has become easy prey to that the empire that Genghis Khan once created. His successors, Khan Batiy, came to Russia, plundered almost all cities ruined them. South the part where Kiev was, by the way, some other cities, they simply lost their independence, and the northern cities retained part of their sovereignty.They paid tribute to Horde, but part of sovereignty saved. And then with the center in Moscow, the beginning a single Russian state is taking shape.\nSouth part of the Russian lands, including Kiev, began gradually reach for another « magnet » – to the center that was developing in Europe. It was the Grand Lithuanian Principality. He was even called Lithuanian-Russian, because the Russians made up significant part of this state. They spoke ancient Russian, were Orthodox. But then the union of – the union of the Great princes of the Lithuanian and Polish kingdom. After for several years another union was signed already in the spiritual realm, and part Orthodox priests obeyed power Pope. So these lands were part of the Polish-Lithuanian state.\nBut the Poles for decades engaged in the impoverishment of this part of the population: they introduced their language there, began to introduce the idea that these are not entirely Russian, that, since they live near the edge, they are Ukrainians. Initially, the word « Ukrainian » meant that man lives on the outskirts of the state, « near the edge », or is engaged in border service, in fact. It didn’t mean some special ethnic group.\nSo here the Poles polished in every possible way and in principle treated this part of the Russian lands quite harshly, if not cruelly. All this led to, that this part of the Russian lands began to fight for their rights. And they wrote letters to Warsaw, demanding compliance with their rights so that people, including Kiev, are sent here…\nTUCKER CARLSON\n:\nWhen it was, in what years?\nVLADIMIR PUTIN\n:\nIt was in the 13th century. I will now say what happened next, and I will name the dates so that there was no confusion.\nAnd in 1654, a little earlier, even – people who controlled power in this part Russian lands, appealed to Warsaw, I repeat, demanding that sent people of Russian origin and Orthodox faith. And when Warsaw is basically nothing did not answer and almost rejected these requirements, they began to turn to Moscow so that Moscow would take them to itself. You didn’t think that I came up with something, I will give you these documents…\nTUCKER CARLSON\n:\nI do not think that you are making up something, no.\nDISCUSS ON SG\nVLADIMIR PUTIN:\nAnd yet – this documents from the archive, copies. Here are the letters of Bogdan Khmelnitsky, then man, who controlled power in this part of the Russians the lands that we now call Ukraine. He wrote to Warsaw demanding observance of their rights, and after I received refusal, began to write letters to Moscow with a request to take them under the strong hand of the Moscow king. Here [in folder] copies of these documents. I will leave them for you to good memory. There is a translation into Russian, then translate into English.\nRussia did not agree to accept them immediately, because proceeded from the fact that the war with Poland would begin. Still, in 1654, the Zemstvo Cathedral – it was a representative authority of the Ancient Russian state – the decision was made: this part of the ancient Russian lands became part of the Moscow kingdom.\nHow and it was supposed that a war with Poland began. She walked for 13 years, then a truce was concluded. And in total, after the conclusion of this act of 1654, after 32 years, in my opinion, peace with Poland was concluded, « the eternal world », as it was then said. And these lands, all the left bank of the Dnieper, including Kiev, moved to Russia, and that’s it the right bank of the Dnieper remained with Poland.\nThen in the time of Catherine II, Russia returned all its historical lands, including south and west. This all went on until the revolution. And before the First World War, taking advantage of these ideas of Ukrainianization, Austrian general the headquarters very actively began to promote the idea of Ukraine and Ukrainianization. Everything is clear for what: because on the eve of the world war, of course, there was a desire to weaken potential adversary, there was a desire to create favorable conditions for yourself in the border strip. And this idea, born once in Poland that people, living in this territory, not quite Russians, they are supposedly a special ethnic group, Ukrainians, began to advance and the Austrian General Staff.\nAscended and theorists of independence of Ukraine already in the 19th century, who spoke about the need for independence of Ukraine. But, true, all these « pillars » Ukrainian independence said that it should have very good relations with Russia, they insisted on it. However after the 1917 revolution the Bolsheviks tried restore statehood, unfolded Civil war, including [war] with Poland. Peace was signed with Poland in 1921, according to which the western part, on the right bank of the Dnieper, again went to Poland.\nIn 1939, after Poland collaborated with Hitler, and Poland collaborated with Hitler, and Hitler offered – all the documents we have – with Poland to conclude peace, a treaty of friendship and alliance, but demanded that Poland give back Germany so called the Danzig Corridor, which connected the bulk of Germany with Königsberg and East Prussia. After the first World War II, this part of the territory was given to Poland, and instead of Danzig the city of Gdansk appeared. Hitler begged them to give peacefully – the Poles refused. Nevertheless collaborated with Hitler and engaged together section of Czechoslovakia.\nTUCKER CARLSON:\nMay I ask? You say that part of Ukraine is actually Russian lands hundreds of years. Why then, when you became President, you simply did not take them, 24 years ago? You because there was a weapon. Why are you taking so long then waiting?\nVLADIMIR PUTIN:\nNow I’ll say, I’m already finishing this historical background. She is boring, maybe, but she explains a lot.\nTUCKER CARLSON:\nShe’s not boring, no.\nVLADIMIR PUTIN:\nWell, great. Then I am very pleased that you appreciated it so. Thank you very much.\nSo, before World War II, when Poland collaborated with Germany, refused to comply with Hitler’s requirements, but nevertheless participated with Hitler in the Czechoslovakia section, but since she did not give the Danzig corridor the Poles forced, they played and forced Hitler start the Second World War with them. Why the war began on September 1 1939 from Poland? She turned out to be intractable. Hitler had no choice when implementing his plans, start with Poland.\nBy the way, The Soviet Union – I read the archival documents – behaved very honestly, and the Soviet Union requested Poland’s permission to conduct its troops to help Czechoslovakia. But through the mouth of the then Minister of Foreign Affairs Poland’s affairs it was said that even if Soviet aircraft will fly towards Czechoslovakia through the territory of Poland, they will be shot down over the territory of Poland. Well, it doesn’t matter. And the important thing is that the war began, and now Poland itself has become a victim of the policy that was pursued in relation to Czechoslovakia, because according to the famous Molotov protocols – Ribbentrop part of these territories went to Russia, including Western Ukraine. Russia called the Soviet Union thus returned to its historical territories.\nAfter victory in the Great Patriotic War, like us we say this is World War II, all these territories were finally assigned to Russia, to the Soviet Union. And Poland, in order to compensate, is supposed to have received western, originally German, territories – eastern Germany, part of the land, this western Poland today. And, of course, they again returned the exit to the Baltic Sea, again returned Danzig, who began to be called in Polish. In this way this situation has developed.\nAt the formation of the Soviet Union, this is already 1922, the Bolsheviks began to form the USSR and created Soviet Ukraine, which is still generally did not exist.\nTUCKER CARLSON:\nAll right.\nVLADIMIR PUTIN:\nAt the same time, Stalin insisted that these republics, which were formed, be included as autonomous entities, but for some reason the founder of the Soviet state, Lenin, insisted on, so that they have the right to secede from the Soviet Union. And, too, for unknown reasons, he endowed the emerging Soviet Ukraine land, people living in these territories, even if they had never been called Ukraine before, for some reason, when forming, it was all « clicked » to the Ukrainian SSR, including the entire Black Sea region, which was received during the time of Catherine II and, in fact, had never had any historical attitude towards Ukraine.\nEven if we remember, we will come back, 1654, when these territories returned to the composition Russian Empire, there were three or four modern regions of Ukraine, no Black Sea there was close. There was simply nothing to talk about.\nTUCKER CARLSON:\nIn 1654?\nVLADIMIR PUTIN:\nYes exactly.\nTUCKER CARLSON:\nYou encyclopedic knowledge. But why didn’t you talk about this for the first 22 years of your presidency?\nVLADIMIR PUTIN:\nSo, Soviet Ukraine received a huge amount territories that never to her had no relationship, first of all, the Black Sea. They once, when Russia their received as a result of Russian-Turkish wars, called Novorossia. But that doesn’t matter. The important thing is that Lenin, the founder of Soviet states, created Ukraine just like that. And for many decades as part of the USSR The Ukrainian SSR has developed, and the Bolsheviks, too for unknown reasons, engaged in Ukrainianization. Not only because there there were immigrants from Ukraine, in the leadership of the Soviet Union, but in general there was such policy – « rootization » it called. This concerned Ukraine and other union republics. National languages, national cultures were introduced, which in general, in principle, of course, is not bad. But in this way Soviet Ukraine was created.\nAnd after World War II, Ukraine received still part of not only Polish before the war territories – today Western Ukraine, part of the Hungarian territories and part of the Romanian. Romania and Hungary also took part of the territories, and they, these territories are part of Soviet Ukraine and are still there. Therefore, we have every reason to say, that, of course, Ukraine in a certain sense – artificial state created by will Stalin.\nTUCKER CARLSON:\nAnd what do you think, does Hungary have the right to take its land? And other nations can take their lands and maybe return Ukraine to the borders of 1654?\nVLADIMIR PUTIN:\nI do not know how to the borders of 1654. Stalin’s reign is called Stalin regime, everyone says that there were many violations of human rights, violations of the rights of other states. In this sense, of course, it is quite possible, if not to say that they have the right to this – to return these lands, then, in any case, it is clear…\nTUCKER CARLSON:\nDid you tell Orban about this that he can regain part of the land of Ukraine?\nVLADIMIR PUTIN:\nNever said. Never, never. We didn’t even have any talk about this. But I reliably know that the Hungarians, who live there, they certainly want return to your historical homeland.\nMore of that, I will tell you a very interesting story now, I’ll be distracted, this is a personal story. I’m somewhere in the early 80s by car from then Leningrad, from St. Petersburg, went just on a trip to the Soviet Union – through Kiev, to Kiev, and then went to Western Ukraine. He drove into the city, Beregovo called, and there are all the names of cities, towns in Russian and in an incomprehensible language for me – in Hungarian. In Russian and in Hungarian. Not in Ukrainian – in Russian and in Hungarian.\nI’m passing through in some village, sitting near houses men in black suits and black cylinders. I say: are these some artists? They say to me: no, these are not artists, these are Hungarians. I say: what are they doing here? How what is it land, they live here. All the names! In Soviet times, in the 80s. They keep Hungarian, names, all national costumes. They are Hungarians and feel like Hungarians. And of course, when the infringement is happening now…\nTUCKER CARLSON:\nYes I think that there is a lot of this. Most likely, many countries are unhappy with the change in borders during changes in the 20th century and before. But the fact is that you have not stated anything like this earlier, until February 2022. And you talked about how you felt a physical threat from NATO, in particular, a nuclear threat, and this prompted you to act. Do I understand you correctly?\nVLADIMIR PUTIN:\nI understand that my long dialogs probably don’t include in such an interview genre. Therefore I am at the beginning of you asked: will we have a serious conversation or show? You said you were serious conversation. So don’t be offended by me, please.\nWe approached the moment when it was created Soviet Ukraine. Then there was 1991 – the collapse of the Soviet Union. And all that Ukraine received as a gift from Russia, « from the bar shoulder », she dragged with her.\nI AM I am now approaching a very important moment of today. After all, this collapse of the Soviet Union was initiated, in fact, by the leadership of Russia. I don’t know what was guided by then Russian leadership, but I suspect that there there were several reasons to think that everything would be fine.\nFirstly, I think the Russian leadership came from from the fundamental foundations of the relationship between Russia and Ukraine. Actually a common language, there, more than 90 percent spoke Russian; family ties, there every third has some kind of kinship, friendly relations; general culture; common story; finally common religion; general presence within the framework of a single state for centuries; the economy is very interconnected – all this is so fundamental things. All this underlies inevitability our good relationship.\nSecond – very important, I want you to be like American citizen and so that your audience they also heard about this: the former Russian leadership assumed that the Soviet Union had ceased its existence, no more dividing ideological lines do not exist. Russia voluntarily and proactively went even to the collapse of the Soviet Union and proceeds from the fact that it will be understood by the so-called – already in quotation marks – « civilized West » as a proposal for cooperation and alliance. That is what Russia expected from both the United States and the so-called collective West as a whole.\nWere smart people, including in Germany. Egon Bar – was such a major politician Social Democratic Party that insisted personally in conversations with the Soviet leadership before the collapse of the Soviet Union, he said, what you need to create a new system security in Europe. Need to help unite Germany, but create a new system where the United States, Canada, Russia, others Central European countries. But not necessary, so that NATO spreads. He said so: if NATO spreads, everything will be the same as in the conditions of the « Cold War », only closer to the borders of Russia. That’s all. Clever was grandfather. Nobody listened to him. Moreover, he somehow angry – also in the archives we have this conversation: if, he says, you will not listen to me, I will never come to Moscow again.Angry at the Soviet leadership. He was right, that’s all this is what happened as he said.\nTUCKER CARLSON:\nYes, of course, his words are realized, you they talked about this many times, it seems to me that this is absolutely true. And many in the States also thought that the relationship between Russia and the US will be normal after the collapse Soviet Union. However, the opposite happened.\nHowever You never explained why, it seems to you, this happened, why it happened. Yes, maybe the West is afraid strong Russia, but the West is not afraid strong China.\nVLADIMIR PUTIN:\nWest is afraid of strong China more than strong Russia because there are 150 million people in Russia, and in China – one and a half billion, and China’s economy developing with seven-mile steps – more than five percent per year, was even more. But that’s enough for China. Bismarck once said: the main thing – is potentials. China’s potential is enormous, the first economy in the world today in terms of purchasing power parity, in terms of economy. Already overtaken the United States and long enough, and the pace growing.\nWe now we will not say who is afraid of whom, we will not, let’s reason in such categories. And let’s talk about that after 1991, when Russia expected, that she will be taken to the fraternal family « civilized peoples », nothing like this has happened. You deceived us – when I say « you », I don’t personally mean you, of course, and the United States, – promised that there would be no NATO expansion to the east, but five one, five waves of expansion. We all endured, they persuaded everything, they said: no, we our own now, as we say, bourgeois, we have a market economy, there is no power of the Communist Party, let’s to negotiate.\nMore that, I also talked about it publicly – now take the elcin time, – there was a moment when « the gray cat ran ». Before that, Yeltsin went to the USA, remember speaking in Congress and talking wonderful words: God bless America. He said everything, these were signals: let us in.\nNo, when the events in Yugoslavia began … Before Yeltsina praised – as soon as the events in Yugoslavia began and when he raised his voice for the Serbs, and we could not help but raise our voices for the Serbs, in their defense … I understand, there were complex processes, I understand. But Russia could not help but raise its voices for the Serbs, because the Serbs – is also special, a nation close to us, an Orthodox culture and so on. Well, such a long-suffering people for generations. Well, it doesn’t matter, but the important thing is that Yeltsin expressed support. What did the United States do? In violation of international law, the UN Charter the bombing of Belgrade began.\nThe United States released this bottle genie. Moreover, when Russia objected and expressed its indignation, what was said? UN Charter, international law is outdated. Now everyone refers to international law, but then they began to say that it was outdated everything, you need to change everything.\nReally, something needs to be changed, because the balance of power has changed, it is true, but not in this way. By the way, Yeltsin immediately began to pour mud, to indicate that he was an alcoholic, did not understand anything, did not understand. He understood everything and understood everything, I assure you.\nOh well. I became President in 2000. Thought: okay, that’s it, Yugoslav theme has passed, you must try to restore relations, nevertheless, open this door that Russia tried to pass into. And more of this, I publicly spoke about this, I can repeat, at a meeting here in the Kremlin, with Bill Clinton – leaving power, here next to the next room – I told him, asked a question: listen, Bill, what do you think, if Russia raised the question of joining NATO, do you think this is possible? Suddenly he said: you know, this is interesting, I think so. And in the evening, when we met at dinner, he says: you know, I talked with mine, with my team – no, now it’s impossible. You can ask him, I think he will hear our interview – confirm. I would never say anything like that,if it weren’t. Well, now it’s impossible.\nTUCKER CARLSON:\nYou were sincere then? Would you join NATO?\nVLADIMIR PUTIN:\nListen, I asked a question: is it possible or not? And I got the answer: no. If I was insincere in his desire to find out the position of the leadership…\nTUCKER CARLSON:\nAnd if he said « yes », would you join NATO?\nVLADIMIR PUTIN:\nIf he said « yes », the process of rapprochement would begin, and ultimately it could take place if we saw the sincere desire of the partners to do this. But this did not end. Well no, no, okay, good.\nTUCKER CARLSON:\nWhat do you think, why? What are the motives for this? I feel that you are experiencing bitterness about this, I understand. But why do you think the West then pushed you away like that? Where does this hostility come from? Why failed to improve relationships? What were the motives for this, from your point of view?\nVLADIMIR PUTIN:\nYou said that I feel bitterness from the answer. No it not bitterness, it’s just a statement of fact. We are not the bride and groom, bitterness, resentment – these are not the substances that take place in such cases. Just us they realized that they were not waiting for us there, that’s all. Okay, okay. But let’s build relationships differently, we will look points of contact. Why did we get such a negative answer, you ask your leaders. I can just guess why: too big a country with its own opinion and so on. And the United States – I saw how issues are resolved in NATO…\nI AM I will give one more example now regarding Ukraine. US leadership « clicked » – and all NATO members obediently vote, even if they don’t like something. Now I will say in this connection what happened with Ukraine in 2008, although this is being discussed, nothing new here I won’t tell you.\nDark no less later, after that, we tried differently build a relationship. For example, there were events in the Middle East, in Iraq, we are very soft, calmly built relations with the States.\nI AM repeatedly raised the question of the United States not supporting either separatism or terrorism in the North Caucasus. But still they continued to do it. And political support, information support, financial support, even military support came from The United States and its satellites in relation to terrorist groups in the Caucasus.\nI once with my colleague, also the President of the United States, raised this question. He says: can’t you have evidence? I say yes. I was ready for this conversation and gave him this evidence. He looked and you know what he said? I apologize, but it was, I will quote, he said: well, I will kick their ass. We were waiting for the answer – there was no answer.\nI AM I say to the FSB director: you write to the CIA, is there any result of a conversation with the President? Wrote once, two, and then received an answer. We have an answer in the archive. The answer came from the CIA: we worked with the opposition in Russia; we believe that this is right and we will continue to work with the opposition. It’s funny. Okay. We realized that there would be no conversation.\nTUCKER CARLSON:\nOpposition to you?\nVLADIMIR PUTIN:\nOf course, in this case, separatists, terrorists, were meant, who fought with us in the Caucasus. That’s who it was about. They called it the opposition. This is the second moment.\nThird moment, very important, – moment of creation US missile defense systems, the beginning. We talked for a long time The United States does not do this. More than that, after I was invited by Bush’s father, Bush Sr., visit your ocean, there a very serious conversation took place with President Bush, with his team. I suggested that the United States, Russia and Europe jointly create a missile defense system, which, in our opinion, created unilaterally, threatens our safety, despite the fact that officially it was told by the United States that it was being created against missile threats from Iran. Reasoned the same creation of missile defense. I invited them to work together – Russia, USA, Europe. They said it was very interesting. I was asked: are you serious? I say: absolutely.\nTUCKER CARLSON:\nWhen it was, in what year?\nVLADIMIR PUTIN:\nI do not remember. It easy to find out on the Internet when I was in the USA at the invitation of Bush Sr. It’s even easier I’ll tell you from whom now.\nTo me said: it is very interesting. I say: just imagine if together we will solve such a global strategic security challenge. The world will change. Probably, we will have disputes, probably economic and even political, but we will radically change the situation in the world. Says [in response]: yes. Me asked: are you serious? I say: of course. We need to think, they told me. I say: please.\nThen Minister of Defense Gates, former director, came to this office, where we are talking with you now CIA, and Secretary of State Rice. Here for this table opposite, you see this table, they sat down from this side. I, Minister of Foreign Affairs Affairs, Minister of Defense of Russia – from that side. They told me: yes, we thought, we agree. I say: thank God, great. – « But for some except ».\nTUCKER CARLSON:\nThat is you twice described how American presidents made some decisions, and then them teams put these solutions downhill?\nVLADIMIR PUTIN:\nExactly. Of course the end we were sent away. I will not to tell details, because I consider it incorrect, yet it was a confidential conversation. But that our offer was rejected, – is a fact.\nThen, it was then that I said: Listen, but then we will be forced to take retaliatory measures. We will create such shock systems, which will certainly overcome the missile defense system. The answer was this: we are not doing against you, and you are doing what you want, proceeding from the fact that it is not against us, not against the United States. I say good. Let’s go. And we created hypersonic systems, and intercontinental range, and continue to develop them. We are now ahead of the creation of drums hypersonic systems of all: and connected States and other countries, – we have them improve every day.\nBut we didn’t do it, we suggested going the other way, and we were pushed back.\nNow regarding NATO expansion to the east. Well they promised: no NATO east, inch to east will not be like us has been said. And then what? They said: well, they didn’t fix it on paper, so we will expand it. Five extensions, loaded there and the Baltic states, and the entire East Europe, and so on.\nAnd now I turn to the main thing: we got to Ukraine. In 2008, at the Bucharest summit, they announced that the doors for Ukraine and Georgia then to NATO open.\nNow about how decisions are made there. Germany, France seemed to be against it, just like some other European countries. But then, as it turned out later, the President Bush, and he’s such a strong guy, strong politician, as I was later told: he pressed us, and we had to agree. It’s funny, like in a kindergarten simple. Where are the guarantees? What a kindergarten, what kind of people are they? On them, you see, « clicked », they agreed. And then they say: Ukraine will not be to NATO, you know. I say: I do not know; I know that you agreed in 2008, and why do not you agree in the future? « Well then clicked on us ». I say: why tomorrow they will not press – and you will agree again. Well, some nonsense. Who to talk to there, I just don’t understand. We are ready to talk. But with whom? Where guarantees? None.\nSo, began to develop the territory of Ukraine. What would was not there, I told the background how it developed this territory, what relations were with Russia. There, every second to third had some kind of connection with Russia. And in the elections already in an independent, sovereign Ukraine, which gained independence as a result of the Declaration of Independence, and, by the way, it says that Ukraine – neutral state, and in 2008 suddenly, in front of her opened the door, or gate, to NATO. Here is an interesting movie! We didn’t agree. So here are all the presidents who came to power in Ukraine, they relied on the electorate, or otherwise well treated Russia. It is southeast Ukraine, this is a large number of people. And « to kill » this electorate, which was positive for Russia, was very difficult.\nViktor Yanukovych came to power, and how: for the first time he won after President Kuchma – organized the third round, which is not provided for in the Constitution of Ukraine. It state coup. Imagine someone didn’t like you in the USA.\nTUCKER CARLSON:\nIn 2014.\nVLADIMIR PUTIN:\nNo, before. No, no, that was before. After President Kuchma, Viktor Yanukovych won the election. But his opponents did not recognize this victory, USA supported the opposition, and appointed a third round. What is this? This is a coup. The United States supported him, and came to power as a result of the third round … Imagine that someone didn’t like something in the USA – organized the third round, which is not provided for in the US Constitution. Nevertheless, there [in Ukraine] they did it. Okay, Victor came to power Yushchenko, who was considered prowestern politician. Well, but we also established relations with him, he went to Moscow on visits, we went to Kiev, and I went. We met in an informal setting. Western so western – let. Let it, but people work. The situation should be inside develop, in Ukraine itself independent. After how he led the country,the situation worsened, and Viktor Yanukovych still came to power.\nMaybe be, he was not the best president and politician – I don’t know, I don’t want to give ratings, – but the question arose of association with the European Union. But we are for this always treated very loyal: please. But when they read this association agreement, it turned out that this is a problem for us, because we have a free trade zone with Ukraine, open customs borders, and Ukraine was supposed to open its borders to Europe – and everything flowed into our market.\nWe said: no, then it won’t work, we then we will close our borders with Ukraine, customs borders. Yanukovych began to consider how much Ukraine will win and how much will lose, and announced to his counterparties in Europe: I still have to think, before how to sign. As soon as he said, the opposition’s destructive actions, supported by the West, began and everything came to to the Maidan and to the state coup in Ukraine.\nTUCKER CARLSON:\nThat is, he traded more with Russia than with the European Union, Ukraine?\nVLADIMIR PUTIN:\nOf course. It’s not even a matter of trade, although more. Case in cooperative ties on which she stood the entire Ukrainian economy. Cooperation relations between enterprises have been very dense since the Soviet Union. There, one enterprise produced components for final assembly both in Russia and Ukraine, and vice versa. Very close ties were.\nWe made a coup, although I will not be from the United States now to speak in detail, I consider it incorrect, but still it was said: you calm Yanukovych there, and we will calm the opposition; let everything is on the path of political settlement. We said: ok, agree, let’s do it. Yanukovych did not apply, as requested us are Americans, no armed forces, no police. And the armed opposition in Kiev held a coup. How to understand this? Who are you at all? – I wanted to ask then United States leadership.\nTUCKER CARLSON:\nWith the support of whom?\nVLADIMIR PUTIN:\nWith the support of the CIA, of course. An organization in which, as I understand that you once wanted to work. Maybe thank God that you weren’t taken. Although this is a serious organization, I understand, my former colleagues, that I mean, I worked in the First Chief Management – is intelligence of the Soviet Union. They were our opponents always. Work is work.\nTechnically they did everything right, got it, what they wanted, – changed power. But with political point of view is a huge mistake. Here, of course, the political leadership unfinished. Political leadership should it was to see what this would lead to.\nSo, in 2008 they opened the doors of Ukraine to NATO. In 2014 conducted a state coup, while those who did not recognize the state coup, and this is the state coup, began to pursue, created a threat to the Crimea, which we were forced to take under their protection. Started the war in Donbass since 2014, using aircraft and artillery against peaceful citizens. After all, it all started. There is video recording when airplanes strike at Donetsk from above. Accepted one large-scale military operation, another one, failed – still being prepared. And still against the background of the military development of this territory and opening of doors to NATO.\nWell, how can we not show concern about what is happening? For our part, that would be criminal carelessness – that’s what it would be. Just political the leadership of the States approached us to hell, for which we could no longer cross, because it destroyed Russia itself. And then we could not leave our co-religionists and, in fact, part of the Russian people under this war machine.\nTUCKER CARLSON:\nThat is, it was eight years before the conflict began. And what provoked this conflict when you decided that you still need to take this step?\nVLADIMIR PUTIN:\nInitially provoked a conflict of state revolution in Ukraine.\nBy the way speaking, representatives of three European countries arrived: Germany, Poland and France – and were guarantors signed agreement between the government Yanukovych and the opposition. Signatures of their set as guarantors. Despite this, the opposition made a coup, and all these countries pretended that they did not remember that they were the guarantors of a peaceful settlement. They immediately threw it into the stove, no one remembers.\nI AM I don’t know if they know anything in the United States about this agreement between the opposition and the authorities and about the three guarantors, who instead return this whole process to the political field, – no, supported the coup. Although there was no point in this, believe me. Because President Yanukovych agreed with everything, was ready for early elections in which he had no chance to win, to be honest, there was no chance. Everyone knew that.\nBut why a coup, why the victims? Why threats for Crimea? Why then started operations in Donbass? This is what I do not understand. This is where the miscalculation is. CIA brought its case to implementation state coup. And, in my opinion, one of the Secretary of State’s deputies said that they even spent a large amount on this, almost five billion [dollars]. But political the mistake is colossal. Why did this have to be done? All the same could be done, only in the legal way, without any casualties, without the start of military operations and without the loss of Crimea. And we wouldn’t move a finger if it weren’t these bloody events on the Maidan, it would never have occurred to me.\nBecause that we agreed that after the collapse The Soviet Union should all be so – on the borders of the union republics. We agreed with that. But we never agreed with the expansion of NATO, all the more we never agreed that Ukraine would be in NATO. We did not agree that there would be NATO bases without any talk with us. We only begged for decades: do not do this, do not do that.\nAnd what served as a trigger in recent events? Firstly, today’s leadership of Ukraine said that they will not implement the Minsk agreements that were signed as You know, after the events of 2014 in Minsk, where a peace plan was outlined settlement in Donbass. No, the leadership of today’s Ukraine, Minister foreign affairs, all other officials, and then the President himself announced that they did not like anything in these Minsk agreements. In other words, they are not going to fulfill. And the former leaders of Germany, France directly said today – a year and a half ago, – they said bluntly to the whole world that yes, they signed these Minsk agreements, but they never intended to implement them. We were just taken by the nose.\nTUCKER CARLSON:\nHave you spoken to the Secretary of State, with the President? Maybe they were you afraid to talk to you? And you told them that if they continue pump up Ukraine with weapons, then you will act?\nVLADIMIR PUTIN:\nWe are constantly talking about it talked. We turned to the management United States, European countries to this process stopped immediately so that the Minsk agreements were implemented. Frankly saying, I did not know how we would do it, but I was ready to do it. They are difficult for Ukraine, there is very many elements of independence for Donbass, for these territories was provided, this truth. But I was absolutely sure, I will tell you now: I sincerely believed that if all the same will be able to persuade those people who are in Donbass live, – they still had to be persuaded to return to the framework of Ukrainian statehood, – then gradually, gradually the wounds will heal. Gradually when this part of the territory will return to the economic life, in the general social environment, when pensions will be paid, social benefits – all gradually, gradually will grow together. No,nobody wanted it, everyone they only wanted to resolve the issue with the help of military force. But we could not allow.\nAnd everything came to this situation when in Ukraine announced: no, we will not [execute]. We started preparing for the military actions. They started the war in 2014. Our goal is – to end this war. And we did not start it in 2022, this is an attempt to stop it.\nTUCKER CARLSON:\nDo you think you succeeded now to stop? Have you achieved your goals?\nVLADIMIR PUTIN:\nNo, we have not yet achieved our goals, because one of the goals of – is denazification. This is meant prohibition of all neo-Nazi movements. This is one of the problems that we discussed during the negotiation process, which ended in Istanbul at the beginning of last year, but not on our initiative ended because we – Europeans, in particular – said: it is necessary to create conditions for the final signing of documents. My colleagues in France and Germany said: « How do you imagine how they will sign the contract: with a gun attached to the temple? Needed withdraw troops from Kiev ». I say: OK. We took troops from Kiev.\nHow only we took troops from Kiev, immediately our Ukrainian negotiators threw into the trash all our agreements, achieved in Istanbul, and prepared for a long armed confrontation with the help of the United States and their satellites in Europe. This is how the situation developed. And the way she looks now.\nTUCKER CARLSON:\nWhat denazification? What does it mean?\nVLADIMIR PUTIN:\nI just want now to say about it. This is very important question.\nDenazification. After gaining independence, Ukraine began seek, as some analysts in the West say, their identity. And I didn’t come up with anything better, how to prioritize this identity false heroes who collaborated with Hitler.\nI AM already said that at the beginning of the 19th century, when theorists appeared independence and sovereignty of Ukraine, they assumed that independent Ukraine should have very good and good relations with Russia. But by virtue of historical development, by virtue of when these territories were part of the Commonwealth, Poland, Ukrainians were brutally persecuted, seized, tried to destroy this identity, behaved very cruelly, it everything remains in the memory of the people. When it started World War II, part of this is extremely the nationalist elite began to work with Hitler, believing, that Hitler will bring them freedom. German troops, even SS troops, they are the dirtiest work to destroy Polish the population, the Jewish population was given just to the collaborators who are with Hitler collaborated. Hence this brutal massacre Polish,Jewish population, Russian too. At the head were persons who are well known: Bandera, Shukhevich. Exactly these people were made national heroes. Here what is the problem. And they always tell us: nationalism and neo-Nazism are in others countries. Yes, there are sprouts, but we push them, and in other countries they are pressed. But in Ukraine – no, in Ukraine they made national heroes, they erect monuments, they are on flags, their names are screaming crowds that walk with torches, as in Nazi Germany. It people who destroyed the Poles, Jews and Russians. We must stop this practice and theory.and in other countries they are pressed. But in Ukraine – no, in Ukraine they made national heroes, they erect monuments, they are on flags, their names are screaming crowds that go with torches, as in Nazi Germany. It people who destroyed the Poles, Jews and Russians. We must stop this practice and theory.and in other countries they are pressed. But in Ukraine – no, in Ukraine they made national heroes, they erect monuments, they are on flags, their names are screaming crowds that go with torches, as in Nazi Germany. It people who destroyed the Poles, Jews and Russians. We must stop this practice and theory.\nOf course, any nation, it has grown, believes part there people … I say that this is part of the common Russian people, they say: no, we are a separate people. Okay, good. If someone considers himself an individual people, has the right to do so. But not based on Nazism, Nazi ideology.\nTUCKER CARLSON:\nYou will satisfied with the territory that you have now?\nVLADIMIR PUTIN:\nI’ll finish now. You are asked a question on neo-Nazism and denazification.\nHere Ukrainian President arrives in Canada – this well known, but hushed up in the West, – and represented in the Canadian parliament a man who, as the speaker of the parliament said, fought during World War II against the Russians. Well, who fought against the Russians during World War II? Hitler and his henchmen. It turned out that this man served in the SS troops, he personally killed both Russians and Poles, and Jews. SS troops formed from Ukrainian nationalists were engaged in this dirty work. President Ukraine stood up with the whole parliament of Canada and applauded to this person. How can you imagine this? Incidentally, the President of Ukraine – is a Jew by nationality.\nTUCKER CARLSON:\nAnd what will you be with this to do? Hitler has been alive for 80 years, Nazi Germany no longer exists, it’s true. You say that you want to put out this fire of Ukrainian nationalism. How do it?\nVLADIMIR PUTIN:\nListen to me. Your question is very subtle… And can I say how I think? Will you be offended?\nTUCKER CARLSON:\nOf course I won’t.\nVLADIMIR PUTIN:\nHe would seem, thin, he is very nasty, this question.\nYou say: Hitler has been gone for so many years, 80 years. But his business lives. People who destroyed Jews, Russians and Poles, alive. And the President, the current President of today Ukraine applauds him in the Canadian parliament, applauds standing! Can we say that we are entirely uprooted this ideology if that we see happening today? That’s what denazification in our understanding. We need to get rid of those people who leave this theory and practice in life and try to preserve it, – here what is denazification. That’s what we are under this understand.\nTUCKER CARLSON:\nGood. Of course I do not defend Nazism or neo-Nazism. But my question is practical: you do not control the whole country, and it seems to me that you want the whole control her. But how are you then you can uproot ideology, culture, some feelings, history in a country that you do not control? How to achieve this?\nVLADIMIR PUTIN:\nAnd you know, no matter how strange it seems to you, during negotiations in Istanbul we still agreed that – there is all this in writing – neo-Nazism will not be cultivated in Ukraine, including number and will be prohibited at the legislative level.\nMr. Carlson, we have agreed on this. This, it turns out, can be done during the negotiation process. And there is nothing humiliating for Ukraine as a modern civilized state. Is any state allowed to promote the Nazis? After all, no, right? That’s all.\nTUCKER CARLSON:\nWill there be negotiations? And why so far such negotiations – peace talks – regarding there was no settlement of the conflict in Ukraine?\nVLADIMIR PUTIN:\nThey were, they reached a very high stage of approval positions of a complex process, but still they were almost completed. But after, as we took the troops from Kiev, I already said, the other side, Ukraine, threw away all these agreements and accepted the instructions of Western countries – European under the visor, United States – to fight Russia to a victorious end.\nAnd more than that: the President of Ukraine is legislative banned from negotiating with Russia. He signed a decree prohibiting everyone from negotiating with Russia. But how will we negotiate if he himself banned himself and forbade everyone? We know that he puts forward some ideas about this settlement. But in order to agree on something, you need conduct a dialogue, right?\nTUCKER CARLSON:\nYes, but you will not speak with Ukrainian President, you will speak with the American President. When was the last time you talked to Joe Biden?\nVLADIMIR PUTIN:\nI don’t remember when I talked to him. I don’t remember, you can see.\nTUCKER CARLSON:\nYou do not remember?\nVLADIMIR PUTIN:\nNo, but what, should I remember everything or what? I have mine full of affairs. We have domestic political affairs.\nTUCKER CARLSON:\nBut he finances the war you are waging.\nVLADIMIR PUTIN:\nYes, he finances, but when I’m with him talked, it was before the start of a special military operation, of course, and by the way, I then said – I will not go into details, I never do this, – but I then told him: I believe that you are making a huge mistake of a historical scale, supporting everything that happens there in Ukraine, pushing Russia away. I told him about it – spoke repeatedly, by the way. I think, that it will be correct – here, on this I will limit myself.\nTUCKER CARLSON:\nWhat did he say?\nVLADIMIR PUTIN:\nYou ask him, you are welcome. It’s easy for you: you are a citizen United States, go and ask him. I’m wrong comment on our conversation.\nTUCKER CARLSON:\nBut since then you have not talked to him – after February 2022?\nVLADIMIR PUTIN:\nNo, we didn’t talk. But we have certain contacts. By the way, remember, I am for you talked about my offer together work on a missile defense system?\nTUCKER CARLSON:\nYes.\nVLADIMIR PUTIN:\nYou can ask everyone – they are all, thank God, alive and well. Both the former President and Condoleezza [Rice] alive and well, and, in my opinion, Mr. Gates, and today’s director of the Central Intelligence Agency Mr. Burns – he was then ambassador to Russia, in my opinion, a very successful ambassador. They are all witnesses to these conversations. Ask them.\nThe same thing here: if you are interested in what Mr. President Biden answered me, ask him. In any case, he and I spoke on this topic.\nTUCKER CARLSON:\nI understand this very well, but from the outside, for an external observer, it may seem like all this could result in in a situation where the whole world is on the edge wars, maybe even nuclear strikes will be inflicted. Why don’t you call You won’t say to Biden: let’s somehow decide this question.\nVLADIMIR PUTIN:\nWhat to decide? Everything is very simple. I repeat, we have contacts through various departments. I will tell you what we say about this and what we bring to the leadership of the United States: if you really want to stop fighting, you need to stop delivering weapons – everything will end within a few weeks, that’s all, and then you can agree on some conditions before you do – stop.\nWhat easier? Why should I call him? What to talk about or what to beg for? « Are you going to bet such and such weapons to Ukraine? Oh, I’m afraid, please do not supply ». About what to say something?\nTUCKER CARLSON:\nDo you think NATO is worried that it all can outgrow in a global war or even in a nuclear conflict?\nVLADIMIR PUTIN:\nAnyway, they talk about it and they try to intimidate their population with an imaginary Russian threat. It obvious fact. And thinking people – are not ordinary people, but thinking people, analysts, those who are engaged in real politics, just smart people – are well aware that this is a fake. The Russian threat is swelling.\nTUCKER CARLSON:\nYou mean threat of a Russian invasion, for example, to Poland or to Latvia? You can imagine the script, when will you send Russian troops to Poland?\nVLADIMIR PUTIN:\nOnly in one case: if there will be an attack on Russia from Poland. Why? Because we have no interests in Poland or Latvia – nowhere. Why do we need this? We just have no interests. Some threats.\nTUCKER CARLSON:\nArgument – I think you know well – this is what: yes, here he invaded Ukraine, he has territorial claims on the whole continent. You unequivocally say that you do not have such claims of territorial?\nVLADIMIR PUTIN:\nThis is absolutely excluded. No need to be any analyst: this is contrary to common sense – get involved in some kind of global war. And the global war will put on the brink of destruction all of humanity. It is obvious.\nThere is, of course, means of containment. We all the time everyone was scared: tomorrow Russia uses tactical nuclear weapons, tomorrow it uses – no, the day after tomorrow. So what? It just horror stories for the inhabitants, for that to knock out US taxpayers, knock out taxpayers Europe extra money in confrontation with Russia at the Ukrainian theater of operations. The goal of – to weaken Russia as much as possible.\nTUCKER CARLSON:\nOne of the senior senators of – Chuck Schumer seems to be yesterday said: we need to continue to finance Ukraine, or in the end, American soldiers will have to fight in Ukraine instead of Ukraine. How are you rate such a statement?\nVLADIMIR PUTIN:\nThis is a provocation, and a cheap provocation. I don’t understand why American soldiers should fight in Ukraine. There are mercenaries from the United States. Most of the mercenaries from Poland, in second place – mercenaries from the USA, on the third – from Georgia. If someone has a desire to send regular troops, this will certainly put humanity on the brink very serious, global conflict. It obviously.\nIt need the United States? What for? For thousands kilometers from national territory! Do you have anything to do? You have a lot of problems on the border, problems with migration, problems with state debt – more than 33 trillion dollars. Nothing to do – need to fight in Ukraine?\nIsn’t it better to agree with Russia? To agree, already understanding the situation, which develops today, realizing that Russia will fight for its interests to the end, and, realizing this, in fact, return to common sense, start respecting our country, its interests and seek some solutions? It seems to me that it is much smarter and more rational.\nTUCKER CARLSON:\nWho blew up « North stream »?\nVLADIMIR PUTIN:\nOf course you are.\n(Laughter.)\nTUCKER CARLSON:\nI was busy at that day. I did not blow up « Nord Stream ».\nVLADIMIR PUTIN:\nYou personally can be, have an alibi, but the CIA [CIA] there is no such alibi.\nTUCKER CARLSON:\nDo you have evidence that NATO or the CIA did it?\nVLADIMIR PUTIN:\nYou know I won’t go into details, but always in such cases they say: look for someone who is interested. But in this case it is necessary look not only for someone who is interested, but also for someone who can do this. Because there can be many interested, but climb to the bottom of the Baltic seas and not everyone can carry out this explosion. These two components must be connected: who is interested and who can.\nTUCKER CARLSON:\nBut I’m not quite I understand. This is the largest act of industrial terrorism in history and, more the largest CO emission\n2\ninto the atmosphere. But taking into account the fact that you have evidence from your special services, why you will not present such evidence and do not win this war propaganda?\nVLADIMIR PUTIN:\nIn war propaganda it’s very difficult to defeat the United States, therefore that the United States controls all world media and so many European ones. End Beneficiary the largest European media are American funds. Do you know this? Therefore, you can get involved in this work, but this, as they say, is more expensive for yourself. We can just we will not achieve our sources of information, but we will not achieve the result. To the whole world and so it’s clear what happened, and even American analysts are talking about it directly. Truth.\nTUCKER CARLSON:\nYes, but here is the question – you worked in Germany, it is well known, and the Germans clearly understand that their NATO partners are did, of course, it struck the economy of Germany, – why then the Germans are silent? This confuses me: why did the Germans say nothing on this issue?\nVLADIMIR PUTIN:\nIt surprises me too. But today’s German leadership is not guided national interests, and guided by interests of the collective West, otherwise difficult explain the logic of their actions or inaction. After all, it’s not only « North Stream – 1 », which blew up. « Nord Stream – 2 » damaged, but one pipe is alive and well, and gas can be supplied to Europe, but Germany does not open it. We are ready, please.\nThere are another route through Poland, Yamal – Europe called, too, a large flow can be carried out. Poland closed it, but Poland bites from the Germans, receives money from pan-European funds, and the main donor to these pan-European funds – Germany. Germany feeds Poland to a certain extent. And they took and closed the route to Germany. What for? I do not understand.\nUkraine, in which the Germans supply weapons and give money. The second sponsor after the United States in terms of financial assistance to Ukraine – this is Germany. Two gas routes pass through Ukraine. They took one route closed simply, Ukrainians. Open the second route and please get gas from Russia. They do not open.\nWhy Germans do not say: « Listen guys, we give you money and weapons. Unscrew the valve, please skip from Russia gas for us. We buy at a tripod liquefied gas in Europe, it drops the level our competitiveness, the economy as a whole to zero. Do you want us to give you money? Give us it’s normal to exist, to earn money from our economy, but we give ». No, they don’t do it. Why? Ask they have.\n(Knocking on the table.)\nWhat is it here that they have – the same thing in their head. There people are very incompetent.\nTUCKER CARLSON:\nMaybe the world is now divided into two hemispheres: one hemisphere with cheap energy, other – no.\nI AM I want to ask a question: now the multipolar world – You can describe alliances, blocks, who is on whose side, what do you think?\nVLADIMIR PUTIN:\nListen you said the world is divided into two hemisphere. The head is divided into two hemisphere: one is responsible for one area of activity, the other – is more creative and so on. But it’s still one head. It is necessary that the world be united, so that security is common, not designed for this « golden billion ». And then – only in this case – the world will be stable, sustainable and predictable. And as long as the head divided into two parts, this is a disease, severe disease. The world goes through this period of difficult diseases.\nBut it seems to me that thanks to honest journalism – they [journalists] how doctors work – can be, it will be possible to somehow combine it all.\nTUCKER CARLSON:\nI will give one example. The American dollar united the whole world in many ways. Do you think the dollar will disappear like a reserve currency? Which how did sanctions change the place of the dollar in the world?\nVLADIMIR PUTIN:\nYou know, this is one of the gross strategic mistakes of political United States Guides – Use dollars as an instrument of foreign policy struggle. The – dollar is the foundation of US power. I think that all this is perfectly understood: how much don’t print dollars, they fly around the world. US inflation is minimal: I think three percent, about 3.4, acceptable to the United States absolutely. And they print endlessly, of course. What is the debt of 33 trillion talking about? This is an emission.\nDark no less is the main weapon of conservation US power in the world. As soon as the political leadership decided to use the dollar as instrument of political struggle, they inflicted a blow to this American power. I don’t want to use any non-literature expressions, but this is stupidity and a huge mistake.\nHere see what happens in the world. Even among US allies are declining stocks in dollars now. Everyone is looking at the fact that happens and start looking for an opportunity protect yourself. But if in relation to some US countries restrictive measures such as limiting calculations, freezing holdings, and so on, this is a huge alarm and signal for the whole world.\nWhat happened to us? Until 2022, approximately 80 percent of external settlements Russian trade was in dollars and euros. At this dollar was about 50 percent in our settlements with third countries, and now, in my opinion, only 13 percent left. But we did not prohibit the use of the dollar, we did not strive for this. US decided to limit our calculations in dollars. I think that complete nonsense, you see, from the point of view of the interests of the United States itself, taxpayers of the United States. Because that it strikes the US economy, undermines the power of the United States in the world.\nBy the way, the calculations in the RMB were approximately three percent. Now 34 percent we pay in rubles and about the same amount, 34 percent with a small one, in RMB.\nWhy Did the United States do this? I can only explain this with arrogance. They probably thought that everything would collapse, but nothing collapsed. See more, other countries, including oil-producing countries, begin to speak and do already, they are counting on the sale of oil in the RMB. Do you understand what is happening or not? Someone understands this in the same United States? What are you doing? Cut yourself off … All experts ask any smart and thinking person in the States: what is a dollar for USA? You kill him yourself.\nTUCKER CARLSON:\nI think it’s really fair rating.\nThe next question. Maybe you exchanged one colonial power to another, but more so sparing? Maybe BRICS today is in danger that a better colonial power – China will dominate there? Is it good for sovereignty, what do you think? You are worried it?\nVLADIMIR PUTIN:\nThese horror stories are good for us known. This is a horror story. China and I are neighbors. Neighbors, as well as close relatives, do not choose. We have a common border with them of thousands of kilometers. This is the first.\nThe second – we have been used to living together for centuries.\nThe third – China’s foreign policy philosophy is non-aggressive, China’s foreign policy idea is always looking for a compromise, and we see it.\nNext such a point. We are always told, and now you tried to set out this horror story in a soft form, but nevertheless this is the same horror story: the volume cooperation with China is growing. Growth rate China’s cooperation with Europe is greater and higher than the pace increased cooperation with China of the Russian Federation. Ask the Europeans: are they not afraid? Maybe, and afraid, I don’t know, but to the Chinese market try to get into anything, especially when they are now colliding with problems in the economy. And Chinese enterprises master the European market.\nIs there little Chinese business in the USA? Yes, political decisions are such that they trying to limit cooperation with China. Mr Tucker, to your own detriment, you do it to your own detriment: limiting cooperation with China, you are damaging yourself. This is a delicate area, and there are no simple linear solutions here, just like with a dollar.\nTherefore, before introducing any illegitimate sanctions – illegitimate in terms of United Nations Charter, – how to think. In my opinion, those who make decisions have problems with this.\nTUCKER CARLSON:\nYou said a minute ago that today the world will be much better if there are no two competing alliances that compete with each other. Maybe today’s American administration as you say how you you think you are opposed to you, but maybe the next administration in the United States, the government after Joe Biden wants to establish contacts with you and you will want to establish contacts with them? Or it doesn’t play roles?\nVLADIMIR PUTIN:\nI’ll say it now.\nBut to finish the previous question. We have $ 200 billion, we set the task with my colleague, friend, with Chairman Xi Jinping, which is year should have reached 200 billion dollars of trade with China. And we exceeded this bar. According to our data, this is already 230 billion, according to Chinese statistics – 240 billion dollars, if we count everything in dollars, we have trade with China.\nAnd a very important thing: we have a balanced one, this trade turnover, and it complements each other both in the high-tech sphere, and in the energy sector, and in the field of scientific developments. He is very balanced.\nAs for BRICS as a whole – Russia has become the chairman of BRICS since this year, – then the BRICS countries are developing at a very fast pace.\nLook, God give me memory so as not to make a mistake, but in 1992, in my opinion, the share of countries « sevens » in the global economy was 47 percent, and in 2022 she fell somewhere, in my opinion, to 30 with a little. The share of BRICS countries in 1992 was total 16 percent, and now it exceeds level « sevens ». And this is not connected with any events in Ukraine. Trends the development of the world and the world economy are what they just said, and this is inevitable. This will continue to happen: as the sun rises – impossible to prevent, it is necessary to adapt to this.\nHow Are the United States adapting? With the help forces: sanctions, pressure, bombing, use of armed forces. This is due to arrogance. People do not understand in your political elite that the world is changing due to objective circumstances, and you need to correctly, on time, on time make the right decisions to keep your level, excuse me even if someone wants a level of dominance. Such rude actions, including in relation to Russia, say, other countries, lead to the opposite result. This is obvious fact, today it has become apparent.\nYou I was asked now: another leader will come and change something? It’s not about the leader, not in the personality of a particular person. I had a very good relationship, say, with Bush. I know he was represented in the States some village guy who thinks little. I assure you that this is not so. I think, that in relation to Russia, he also made many mistakes. I told you about 2008 and the decision in Bucharest to open doors to NATO to Ukraine and so on. It was the same with him, but he pressed the Europeans.\nBut in general, at the human level, I had very good and good with him relationship. He is not more bad than any other American or Russian, or European politics. I assure you, he understood what he was doing, as well as others. I and Trump had such a personal relationship.\nCase not in the personality of the leader – it is in the mood of elites. If in American society prevail the idea of dominance at all costs, and with the help of power actions, then nothing will change – will only be worse. And if in the end comes the realization that the world is changing due to objective circumstances, and you need to be able to adapt to them on time, using the advantages that the United States still retains today, then probably something can change.\nLook, China’s economy has become the first economy in the world according to purchasing power parity, in volume they overtook the United States for a long time. Then the USA, and then India – a half billion people, then Japan, in fifth place – Russia. Over the past year, Russia has become the first economy in Europe, despite all the sanctions and restrictions. This is normal from your point vision? Sanctions, restrictions, impossibility settlements in dollars, disconnection from SWIFT, sanctions against our ships carrying oil, aircraft sanctions – sanctions in everything, everywhere. The largest number of sanctions in the world apply, apply against Russia. And we became the first economy in Europe during this time.\nTools that the United States uses do not work. Well, you need to think what to do. If this awareness comes to the ruling elites, then yes, then the first person of the state will be act in anticipation of what is expected of him voters and people who make decisions at various levels. Then something may change.\nTUCKER CARLSON:\nYou describe two different systems, say that the leader acts in the interests of voters, but at the same time some decisions by the ruling classes are accepted. You head the country for many years, do you think, with your experience, who makes decisions in America?\nVLADIMIR PUTIN:\nI dont know. America – is a complex country, such, on the one hand, conservative, on the other hand, rapidly changing. It’s not easy for us to figure this out.\nWho makes decisions in the election? Is it possible to understand this when each state has its own legislation, each state regulates himself, someone can be removed from elections at the state level. This is two-stage electoral system, it’s very difficult for us to figure this out. Of course, there are two parties that are dominant: Republicans and Democrats. And within the framework of this party system – decision-making centers preparing solutions.\nThen, see why in relation to Russia after the collapse of the Soviet Union, in my opinion, such an erroneous, rude, completely unreasonable policy was carried out pressure? After all, this is a policy of pressure. NATO expansion, support for separatists in the Caucasus, creation of a missile defense system Defense – these are all elements of pressure. Pressure, pressure, pressure … Then dragging Ukraine into NATO. This is all pressure, pressure. Why?\nI AM I think, including because there were created, conditionally speaking, excess production capacities. There have been many the centers were also created by specialists in the Soviet Union, who did not know anything else. They thought they were convincing political leadership: we must continue to hammer Russia, try to spoil it, create several quasi-state entities on this territory and already subjugate in a divided form, use their combined potential for future struggle with China. This is a mistake, including that it is associated with the excessive potential of those who worked to confront the Soviet Union. Need to get rid of this – there must be new, fresh forces, people who look to the future and understand what is happening in the world.\nLook, how Indonesia is developing! 600 million person. Where to get from this? Nowhere. You just need to proceed from the fact that Indonesia will enter, it is already included, in the club of leading economies of the world, be that as it may – someone likes it or I do not like.\nYes, we understand and realize that in the United States, despite all the economic problems, nevertheless, the normal situation and decent economic growth – 2.5 percent GDP growth, in my opinion.\nBut if you ensure the future, then you need to change the approach to the fact that is changing. As I said, the world is everything will change equally, regardless of even how the events in Ukraine end. The world is changing. In the States themselves, experts write that gradually the States still their they change their position in the world, – your experts themselves write, I read them. The only question is how this will happen: painfully, quickly or softly, gradually? And they write it people who are not anti-American, – they just look at the development trends in the world. That’s all. For in order to evaluate them, change policies, need people who think, look forward, can analyze and recommend some solutions at the level of political leadership.\nTUCKER CARLSON:\nI have to ask. You clearly said that NATO expansion has become a violation of promises and is a threat your country. But before you sent troops to Ukraine, at a security conference, The US Vice President supported the desire of the President of Ukraine to join NATO. You think that including provoked military operations?\nVLADIMIR PUTIN:\nI repeat again: we repeatedly, repeatedly offered to seek a solution problems that arose in Ukraine after state coup 2014, by peaceful means. But no one listened to us. And more than that, the Ukrainian leadership, which was under the full control of the United States, suddenly stated that it would not comply with the Minsk agreements – they don’t like anything there, – and continued the military activity in this territory. And parallel the development of this territory by NATO military structures under the guise of various centers for training and retraining of personnel. Essentially started there create bases. That’s all.\nIn Ukraine announced that the Russians are – the law was adopted by the – non-titular nation, and at the same time adopted laws that restrict rights non-titular nations. In Ukraine. Ukraine, having received all these southeastern people as a gift from the Russian people territory, suddenly announced that the Russians on this territory – non-titular nation. Fine? This is all in the aggregate and caused a decision to end the war that neo-Nazis in Ukraine began in 2014, armed way.\nTUCKER CARLSON:\nYou think Zelensky has freedom, for that to negotiate a settlement this conflict?\nVLADIMIR PUTIN:\nI dont know. There details, of course, it’s hard for me to judge. But I think that is, in any case, it was. His father fought with the Nazis, with the Nazis during World War II, I once spoke to him about this. I said: « Volodya, what are you doing? Why are you supporting today neo-Nazis in Ukraine when your father fought with fascism? He is a front-line soldier ». I will not say that he answered, this is a separate topic, and I think it’s wrong.\nBut as for freedom of choice – why not? He came to power on expectations the Ukrainian population that it will lead Ukraine to peace. He talked about this – he is due to this and won the election with a huge advantage. But then, when he came to power, in my opinion, I understood two things. Firstly, better not to quarrel with neo-Nazis and nationalists, because they are aggressive and very active – anything can be expected from them. And secondly, the West is led by the United States support them and always will be support those fighting Russia, – it is profitable and safe. So he took an appropriate position, despite the promise to his people to end the war in Ukraine. He tricked his voters.\nTUCKER CARLSON:\nYou think that now, in February 2024, he has the freedom to speak with your Government, to try somehow with his help the country? Can he do it himself?\nVLADIMIR PUTIN:\nWhy not? He believes himself head of state, he won the election. Although we in Russia believe that everything that happened after 2014, the primary source of power is the coup, and in this I mean, even today’s power is flawed. But he considers himself president, and in this capacity he is recognized by the United States, and all of Europe, and almost the rest of the world. Why not? He can.\nWe were negotiating with Ukraine in Istanbul, agreed, he knew about it. Moreover, the leader of the negotiating group, Mr. Arachamiya, in my opinion, his last name, he still leads the ruling faction parties, presidential parties in Rada. He is still leads the presidential faction in Rada – in the country’s parliament, he still sits there. He even put his signature preliminary on this document, which I tell you about. But then he is publicly said to the whole world: « We were ready to sign this document, but Mr. Johnson arrived, then Prime Minister Great Britain, dissuaded us from this and said that it is better to fight with Russia. They are for us they will give everything so that we return lost during clashes with Russia. And we agreed with that offer ». Look published it statement. He said it publicly.\nCan will they come back to this or not? This is the question: do they want or not? And after that, Mr. President Ukraine issued a decree prohibiting negotiations with us. Let him cancel this decree, and that’s it. We never refused to negotiate. We all the time we hear: is Russia ready, ready? Yes, we did not refuse! They publicly refused. Well, let’s cancels his decree and enters into negotiations. We never refused.\nAnd the fact that they obeyed the demand or to the persuasion of the former Prime Minister of Great Britain, Mr. Johnson, it seems to me that this is ridiculous and very, as it were, sad. Because, as Mr. Arachamia said, « we still a year and a half ago they could stop these hostilities, end this war, but the British persuaded, and we refused this ». Where now Mr. Johnson? And the war continues.\nTUCKER CARLSON:\nThis is a good question. Why did he do this?\nVLADIMIR PUTIN:\nYes, hell knows, I don’t understand. The overall installation was. For some reason, everyone had the illusion that Russia could be defeated on the battlefield, – from arrogance, from a pure heart, but not from a big mind.\nTUCKER CARLSON:\nYou described the connection between Russia and Ukraine, described Russia that it is an Orthodox country, You talked about it. And what does it mean for You? You are the leader of a Christian country like you you describe yourself. What effect does this have on you?\nVLADIMIR PUTIN:\nYou know, as I said, in 988 Prince Vladimir baptized, he himself was baptized following the example of his grandmother – Princess Olga, and then baptized his squad, and then gradually, for several years, baptized and all of Russia. It was a long process – from pagans to Christians, for many years took. But ultimately this is Orthodoxy, Eastern Christianity, it is deeply rooted in the minds of the Russian people.\nWhen Russia expanded and absorbed other nations that profess Islam, Buddhism, Judaism, Russia has always been very loyal to those people who profess other religions. This is her strength. It is absolutely definitely.\nAnd the fact is that in all world religions, which I just spoke about and which are traditional religions of the Russian Federation, in fact, the main points and core values are very similar, if not to say, they are the same. And always Russian authorities were very careful about the culture and religion of those peoples who came into the Russian Empire. This, in my opinion, forms the basis of both security and the sustainability of Russian statehood. Because everything peoples living in Russia mainly consider her motherland.\nIf to you, say, from Latin America people relocate, or to Europe – even clearer and a clear example of – people come, but they came from their historical homeland to you or to European countries. And the people who profess different religions in Russia, they consider Russia their Motherland – they do not have another Motherland. We are together, this is one big family. And the values of traditional ones are very similar. When I said « this is one big family », but everyone has their own family, and this is the basis our society. And if we say that the Motherland and the family are specific to each other are very connected, then it is. Because you cannot provide a normal future for our children and for our family if we do not ensure a normal, sustainable future for the whole country, for the motherland. Here why patriotism is so developed in Russia.\nTUCKER CARLSON:\nIf you will allow, religions are different. The fact is that Christianity – non-violent religion, Christ says: « substitute the other cheek », « do not kill » and so on. And how can a leader be Christian, if you have to kill someone else? How can this be reconciled in yourself?\nVLADIMIR PUTIN:\nVery easy when it comes to goes about protecting himself and his family, his homeland. We are not attacking anyone. Where did it start events in Ukraine? From the coup and from the beginning of hostilities in the Donbass – that’s why. And we protect our people, ourselves, our Homeland and our future.\nWhat concerns religion as a whole, you know, because not in external manifestations, not in go to church every day or hit your head on the floor. She is in the heart. And we have a human-oriented culture. Dostoevsky, which is very known in the West as a genius of Russian culture, Russian literature, – spoke a lot about this about the Russian soul.\nStill, Western society is more pragmatic. Russian a person, a Russian person thinks more about the eternal, thinks more about the values of moral, moral. I don’t know, maybe you won’t agree with me, but still Western culture more pragmatic. I’m not saying this is bad, this enables today’s « gold the billion » to achieve good success in production, even in science and so on. There is nothing here bad – I’m just saying we’re kind of how we look the same, but consciousness is a little built differently.\nTUCKER CARLSON:\nThat is, you think, is there something supernatural acting? When you look at what is happening in the world, do you see the work of the Lord? Do you tell yourself that here I see actions some superhuman powers?\nVLADIMIR PUTIN:\nNo, I honestly don’t think so. I think that the world community develops according to its internal laws, and they are what they are. There is no escape from this, it has always been in the history of mankind. Some nations and countries rose, multiplied, strengthened, then they left the international arena in the quality to which they are used. I probably don’t need to give these examples: starting with the same Ordinary conquerors, from Genghis Khan, then from the Golden Horde, ending the great Roman empire. In history humanity, it seems, there was nothing more like the great Roman Empire.\nDark no less, the potential of the barbarians gradually accumulated, accumulated, and under their blows the Roman Empire fell apart, because that there were more barbarians, they started as a whole develop well, as we say now, economically, they began to strengthen. And that mode, which was imposed by the great Roman empire in the world, it fell apart. Truth, fell apart long – 500 years, this the process of decomposition of the great Roman Empire took 500 years. The difference with the current situation is that change processes today go much faster than during the great Roman Empire.\nTUCKER CARLSON:\nBut when then the empire of AI begins – artificial intelligence?\nVLADIMIR PUTIN:\nYou are me in more and more complex questions immerse yourself. In order to answer, you need be, of course, a specialist in the field of large numbers, in the field of this artificial intelligence.\nHumanity has many threats: research in the field of genetics, which can superhuman create, a special person – a warrior man, a human scientist, human athlete. Now they say that in the USA Ilon Musk has already introduced a chip into the brain of a person.\nTUCKER CARLSON:\nWhat do you think of this?\nVLADIMIR PUTIN:\nI think that The mask cannot be stopped – it will still do what it sees fit. But we need to somehow negotiate with him, we need to look for some ways to convince him. I think he’s smart man, that is, I am sure that he is a smart person. We must somehow agree with him that this process needs to be canonized, subjugated some rules.\nHumanity, of course, it should be thought about what will happen to him in connection with the development of these latest research and technology in genetics or in artificial intelligence. Prognose approximately what will happen. Therefore, when humanity felt a threat to its existence from nuclear weapons, everything nuclear weapons owners began among themselves to agree, because they understood that their sloppy use can lead to a complete, total destruction.\nWhen there will be an understanding that the infinite and uncontrolled development of artificial intelligence, either genetics or some other modern directions to stop which impossible, anyway, these studies will, just as it was impossible to hide what gunpowder is from humanity, and it is impossible to stop research in one or another area, these studies will still be, but when humanity feels a threat to itself, humanity as a whole, then, it seems to me, will come period to negotiate on the interstate level about how we will regulate it.\nTUCKER CARLSON:\nThank you very much for the time you are paid. I want to ask another question.\nEvan Gershkovich, he is 32 years old, American journalist, he is in custody already more years, this is a big story in the USA. I want to ask you: you are ready as a goodwill gesture to free him, so that we took him to the USA?\nVLADIMIR PUTIN:\nWe have done so many gestures of goodwill that it seems to me that we have exhausted everything limits. We are nobody on goodwill gestures never answered with similar gestures. But we, in principle, are ready to say that we do not exclude the possibility that we can do this in the oncoming movement on the part of our partners.\nAnd when I say « partners », I mean primarily representatives special services. They are in contact between by themselves, and they discuss this topic. We do not taboo on not solving this problem. We ready to solve it, but there are certain conditions that are discussed through partnership channels between special services. It seems to me that this is possible to agree.\nTUCKER CARLSON:\nOf course everything is happening for centuries – the country catches a spy, delays he and then exchanges for someone. Of course, this is not my business, but this situation is different in that this person is completely definitely not a spy – it’s just a child. And maybe he, of course, violated your legislation, but he is not a spy and certainly did not spy. Maybe he still in a different category? Maybe be it would be unfair to ask in exchange someone else on him?\nVLADIMIR PUTIN:\nYou know, you can say what it is spy that is not a spy, but there are certain things prescribed by law. If a person gets secret information does it on conspiratorial basis, then this is called espionage. He did just that: he received classified, secret information, and he did it conspiratorially. I do not know, maybe he was dragged in, someone could drag him into this business, maybe he did all by negligence, by own initiative. But in fact, this is called espionage. And everything is proven, because he was taken red-handed – upon receipt this information. If it were any far-fetched things invented, unproven, then that would be a different story. He was taken red-handed when he received secret information on conspiracy basis. Well what is it?\nTUCKER CARLSON:\nYou say that he worked for the American government, for NATO, or he is just a journalist who received information that should not have been in his hands? It seems to me that there is still a difference between these two categories.\nVLADIMIR PUTIN:\nI don’t know who he worked for. But I repeat again: obtaining secret information on a conspiratorial basis is called espionage, and he worked in the interests of American intelligence agencies, some other structures. I do not think that he worked for Monaco – it is hardly Monaco interested in receiving this information. These special services should agree among themselves, understand? There are some developments there, there are people who, in our opinion, are also not connected with special services.\nListen, here I will tell you: sitting in one country, country – United States ally, a person who, for patriotic reasons, eliminated a bandit in one of the European capitals. During events in the Caucasus, you know that he [bandit] did? I don’t want to talk, but nonetheless I will say: he laid out our soldiers captured on the road, and then drove through their heads with a car. What kind of person is this and is it human? But there was a patriot who eliminated it in one of the European capitals. He did it’s on your own initiative or not – it another question.\nTUCKER CARLSON:\nEvan Gershkovich nothing he didn’t do this, it’s a completely different story.\nVLADIMIR PUTIN:\nHe did something else.\nTUCKER CARLSON:\nHe is just a journalist.\nVLADIMIR PUTIN:\nHe is not easy journalist, I repeat again. This is a journalist who received a secret information on a conspiratorial basis. Well yes, this is a different story at all.\nI AM just talking about those people who are, essentially under the control of the US authorities, where they did not sit in prison, and there is a dialogue between special services. This should be decided quietly, calmly, at a professional level. There are contacts, let work.\nI do not exclude that the person you spoke of, Mr. Gershkovich, may be in his homeland. Why not? It makes no sense to keep him in prison in Russia more or less. But let the colleagues of our intelligence officers on the American side also think about how to solve the problems that our special services face. We are not closed to negotiations. Moreover, these negotiations are ongoing, and there have been many cases when we agreed. We can agree now, but we just need to agree.\nTUCKER CARLSON:\nI hope you him let out. Thank you very much, Mr. President.\nVLADIMIR PUTIN:\nI would also like to, so that he goes home after all. I speak sincerely absolutely. But, I repeat, the dialogue is going on. The more we make public things of this kind, the more difficult it is to solve them. All should be calm.\nTUCKER CARLSON:\nHonestly, with the war, I don’t know, it works it or not. If you will, I will ask another question.\nYou may not want to answer for strategic reasons, but are you not worried that what is happening in Ukraine may lead to to something much larger and much more terrible? And as far as you are ready, you are motivated to call, for example, to the States and say: let’s negotiate?\nVLADIMIR PUTIN:\nListen, I’m already said: we did not refuse to negotiate. We do not refuse – this is the western side, and Ukraine, of course, is a satellite of the United States today. This is obvious. True, I don’t want it to sound like some kind of curse or insult to someone, but we understand, yes, what is happening?\nFinancial support – 72 billion – gave, Germany is in second place, other European countries, tens of billions dollars go to Ukraine. A huge flow of weapons goes.\nTell me today’s leadership of Ukraine: listen, let’s sit down, negotiate, cancel your stupid decree or decree and sit down, talk. We are did not refuse.\nTUCKER CARLSON:\nYes, you already have it said. I understand perfectly, of course, that this is not a curse. And in fact, it was reported that Ukraine was not allowed to sign the world at the direction of the former Prime Minister Great Britain, which acted on orders from Washington. That’s why I ask why you do not directly solve these issues with the Biden administration, which controls the Zelensky administration in Ukraine?\nVLADIMIR PUTIN:\nIf the administration Zelensky in Ukraine refused to negotiate, I proceed from the fact that they did this on the instructions of Washington. Let now, if they see in Washington that this is the wrong decision, let them refuse it, find some kind of pretext subtle, not offensive to anyone, find this solution. We did not make these decisions – there we made a decision, even if they refuse it. That’s all.\nBut they made the wrong decision, now we have to look for a way out of this wrong decision, tails to record, correct their errors? They are done, let them correct. We are – for.\nTUCKER CARLSON:\nI want to make sure I’m right I understand. That is, you want to achieve in the way negotiations on the decision of what is happening now in Ukraine, right?\nVLADIMIR PUTIN:\nCorrectly. But we are achieved this, we created a large document in Istanbul, which was initialed by the head of the Ukrainian delegation. There is his signature, on excerpt from this contract – not on everything, but on aging. He put a signature mine, and then he said: « We were ready sign, and the war would have ended a long time ago, a year and a half ago. But Mr. Johnson came, dissuaded us from this, and we missed this chance ». Well missed, made a mistake – let them return to this, that’s all. But why should we fuss and correct someone’s mistakes?\nI understand, we can say that our mistake is that we intensified actions and with the help of weapons decided to end this war, as I said, started in 2014 in Donbass. But I will return you even deeper, I already talked about this, we are now discussing this. Then we will return in 1991, when we were promised NATO not to expand, we will return in 2008, when the gate to NATO opened, back to the Declaration of Independence of Ukraine, where it proclaimed itself a neutral state. Let’s get back to the fact that NATO bases and American bases, English began to arise in Ukraine, to create these threats for us. Let’s get back to the fact that the coup committed in Ukraine in 2014. Meaningless, right? You can roll this ball there and back endlessly. But they are stopped negotiations. Error? Yes. Correct it. We ready. What else?\nTUCKER CARLSON:\nDo you think that it would be too humiliating for NATO now to recognize Russia’s control that two years ago compiled Ukrainian territory?\nVLADIMIR PUTIN:\nBut I said: let them think how to do it with dignity. There are options, but if there is a desire.\nStill noisy, shouting: we need to achieve strategic defeat of Russia, defeat on the battlefield … But now, apparently, awareness comes that this not easy to do, if at all possible. In my opinion opinion, this is impossible by definition, this will never happen. It seems to me that now the realization of this has come to those who control power in the West. But if so and if this awareness has come, think now what to do next. We are ready for this dialogue.\nTUCKER CARLSON:\nAre you ready to say, for example, NATO: congratulations you won, let’s make a situation keep as it is now.\nVLADIMIR PUTIN:\nYou know, this is a subject negotiations that no one wants to conduct with us or, more precisely, they want, but they don’t know how. I know what they want, – I not only see it, but I know, what they want, but they can’t understand how to do it. They thought of it, brought it to the situation in which we are. We didn’t bring it, but our « partners », opponents brought it to this. Ok, let them think now, how to turn it the other way. We do not refuse.\nIt would be funny if it weren’t so sad. This endless mobilization in Ukraine, hysteria, internal problems, all this … Sooner or late anyway we will agree. And you know what? Maybe even strange in today’s situation will sound: everything equal relations between nations will recover. It will take a lot of time, but it will recover.\nAbsolutely I will give unusual examples. On the battlefield clash, a concrete example: Ukrainian soldiers were surrounded by – this is a concrete example from life, fighting – our soldiers shout to them: « Shans no, give up! Come out, be alive, give up! ». And suddenly from there in Russian, shout in good Russian: « Russians do not give up! » – and everyone died. They are still Russian feel.\nIn this sense, what is happening is, to a certain extent, an element of civil war. And everyone thinks in the West that fighting is forever pulled one part of the Russian people from another. No. Reunion will happen. It nowhere and never gone.\nWhy Ukrainian authorities pull out the Russian Orthodox Church? Because it does not unite the territory, but the soul, and no one will be able to divide it.\nFinish or something else?\nTUCKER CARLSON:\nI have everything then. Thank you big, Mr. President.\nDISCUSS ON SG",
  "tags": [
    "history",
    "interview",
    "media",
    "Russia"
  ],
  "categories": [],
  "sitemap_lastmod": "2024-02-09T16:30:10+00:00"
}