{
  "url": "https://voxday.net/2006/09/10/guano-logic-games/",
  "scraped_at": "2026-01-08T21:17:19.424971",
  "title": "Guano logic games",
  "date_display": "September 10, 2006",
  "date_iso": "2006-09-10T14:53:00+00:00",
  "date_from_url": "2006-09-10",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>Zuzu of Feminstasi angrily swings and somehow manages to entirely miss the point:</p><blockquote><p>Let’s think about this for a moment — this guy is actually arguing that women having sexual liberty and being able to control when they have children and how many is an abuse of freedom. And the same goes for support of gay marriage and no-fault divorce.</p></blockquote><p>What’s particulaly funny is that one of her readers actually thinks her meandering response “is a fantastic analyis of Dinesh’s batshit logic”.  But what is that logic?</p><p>1. <i>An abuse of freedom is possible.</i> To deny that it is possible to abuse freedom would be a logical and effective response, but Zuzu does not make it.</p><p>2. <i>It is an abuse of freedom to threaten a free society’s ability to survive.</i> This is also arguable, again, the argument is not made.  I’d consider making it, after all, I’m in favor of personal nukes.  Most people who claim to believe in freedom aren’t.</p><p>3. <i>A free society requires sustainable procreation in order to survive.</i> This was debatable thirty years ago, but considering how the recent experiments in mass immigration are going, few but the most willfully PC would argue the point.</p><p>4. <i>Women having insufficient children is therefore a threat to a free society.</i></p><p>5. <i>“women having sexual liberty and being able to control when they have children and how many” is the primary cause of their having insufficient children.  “gay marriage and no-fault divorce” are also contributing factors.</i> I’m dubious about the negative effect of gay marriage myself, I think monogamy is a greater birth rate negative, but otherwise the statistics are conclusive.</p><p>6. <i>Ergo, women having sexual liberty, etc, is an abuse of freedom.</i></p><p>Feel free to correct me if you believe I have summarized D’Souza’s logic incorrectly.  If the summary is accurate, then see if you can attack it better than its hapless critics; I have already suggested two reasonable ways, there are others.  Needless to say, Zuzu lights on precisely none of them.</p></div>",
  "content_text": "Zuzu of Feminstasi angrily swings and somehow manages to entirely miss the point:\nLet’s think about this for a moment — this guy is actually arguing that women having sexual liberty and being able to control when they have children and how many is an abuse of freedom. And the same goes for support of gay marriage and no-fault divorce.\nWhat’s particulaly funny is that one of her readers actually thinks her meandering response “is a fantastic analyis of Dinesh’s batshit logic”.  But what is that logic?\n1.\nAn abuse of freedom is possible.\nTo deny that it is possible to abuse freedom would be a logical and effective response, but Zuzu does not make it.\n2.\nIt is an abuse of freedom to threaten a free society’s ability to survive.\nThis is also arguable, again, the argument is not made.  I’d consider making it, after all, I’m in favor of personal nukes.  Most people who claim to believe in freedom aren’t.\n3.\nA free society requires sustainable procreation in order to survive.\nThis was debatable thirty years ago, but considering how the recent experiments in mass immigration are going, few but the most willfully PC would argue the point.\n4.\nWomen having insufficient children is therefore a threat to a free society.\n5.\n“women having sexual liberty and being able to control when they have children and how many” is the primary cause of their having insufficient children.  “gay marriage and no-fault divorce” are also contributing factors.\nI’m dubious about the negative effect of gay marriage myself, I think monogamy is a greater birth rate negative, but otherwise the statistics are conclusive.\n6.\nErgo, women having sexual liberty, etc, is an abuse of freedom.\nFeel free to correct me if you believe I have summarized D’Souza’s logic incorrectly.  If the summary is accurate, then see if you can attack it better than its hapless critics; I have already suggested two reasonable ways, there are others.  Needless to say, Zuzu lights on precisely none of them.",
  "tags": [],
  "categories": [],
  "sitemap_lastmod": "2006-09-10T13:53:00+00:00"
}