{
  "url": "https://voxday.net/2006/09/03/if-you-want-to-see-train-wreck/",
  "scraped_at": "2026-01-08T21:16:43.002306",
  "title": "If you want to see a train wreck",
  "date_display": "September 3, 2006",
  "date_iso": "2006-09-03T15:59:00+00:00",
  "date_from_url": "2006-09-03",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>The Physics Geek <a href=\"http://www.balloon-juice.com/?p=7275#comments\">makes a recommendation</a>:</p><blockquote><p>Over at Balloon Juice, liberal Tim F. opened a discussion thread. The topic?  Which current political party resembles the Nazi party.   Lots of entertaining non sequiturs. Add in the multitude of logical fallacies and you’ve got a surefire recipe for humor. Heck, I’ve been laughing my way through the thread for 10 minutes.</p><p>Just thought that you might be interested in the discussion, especially since you’ve provided some of the more cogent arguments as to why the current Democrat party is philosophically aligned with the old Nazi party.</p></blockquote><p>It’s hard to decide whether the two-digit IQs on display there make one want to laugh or begin building an underground bunker in despair.  One would presume that the most reasonable way to begin discussing the chosen issue <a href=\"http://www.voxday.net/cave/planks.html\">would be to examine the ideologies</a> of the current political parties and then to compare them with the ideology of the historical Nationalsozialistische Deutsche Arbeiterpartei.</p><p>Now, some might argue that a party’s place on the left-right spectrum should be determined by what it actually does when in power instead of its driving ideology.  That’s not an unreasonable position, but if utilized, it must be applied equally to all parties, not merely the defunct ones, which means that one must today describe the Republican party as the party of legal abortion, gun control, enthusiastic foreign interventionism and bigger, more intrusive government than the post-WWII Democratics ever sought.</p><p>Not that the mental midgets over at Balloon Juice managed even this, instead they almost immediately leaped the tracks with an irrelevant discussion about the Civil Rights Act and end in a deeply embarrassing display of historical ignorance with a heated debate over whether “liberals defended and excused Stalin” or not.  Apparently these quasi-illiterates believe the following left-liberals to be entirely imaginary:  Betty Friedan, Walter Duranty, Eric Hobsbawm, Alfred Sherman, Robert Conquest, Christopher Hill, Raphael Samuel, E.P. Thompson, Jack Foner, Walter Reuther, Beatrice and Sidney Webb, George Bernard Shaw, Jean-Paul Sartre, Sir Bernard Pares, Harold Laski, D. N. Pritt, Theodore Dreiser, Romain Rollandor, Neal Ascherson, John Cornford, Denis Healy, Philip Toynbee and Upton Sinclair, to say nothing of many, many others guilty of the same intellectual abomination.</p><p>One doesn’t have to be stupid to be a liberal in the modern American sense of the term, although it surely helps.  One does, however, have to be almost completely ignorant of history.</p></div>",
  "content_text": "The Physics Geek\nmakes a recommendation\n:\nOver at Balloon Juice, liberal Tim F. opened a discussion thread. The topic?  Which current political party resembles the Nazi party.   Lots of entertaining non sequiturs. Add in the multitude of logical fallacies and you’ve got a surefire recipe for humor. Heck, I’ve been laughing my way through the thread for 10 minutes.\nJust thought that you might be interested in the discussion, especially since you’ve provided some of the more cogent arguments as to why the current Democrat party is philosophically aligned with the old Nazi party.\nIt’s hard to decide whether the two-digit IQs on display there make one want to laugh or begin building an underground bunker in despair.  One would presume that the most reasonable way to begin discussing the chosen issue\nwould be to examine the ideologies\nof the current political parties and then to compare them with the ideology of the historical Nationalsozialistische Deutsche Arbeiterpartei.\nNow, some might argue that a party’s place on the left-right spectrum should be determined by what it actually does when in power instead of its driving ideology.  That’s not an unreasonable position, but if utilized, it must be applied equally to all parties, not merely the defunct ones, which means that one must today describe the Republican party as the party of legal abortion, gun control, enthusiastic foreign interventionism and bigger, more intrusive government than the post-WWII Democratics ever sought.\nNot that the mental midgets over at Balloon Juice managed even this, instead they almost immediately leaped the tracks with an irrelevant discussion about the Civil Rights Act and end in a deeply embarrassing display of historical ignorance with a heated debate over whether “liberals defended and excused Stalin” or not.  Apparently these quasi-illiterates believe the following left-liberals to be entirely imaginary:  Betty Friedan, Walter Duranty, Eric Hobsbawm, Alfred Sherman, Robert Conquest, Christopher Hill, Raphael Samuel, E.P. Thompson, Jack Foner, Walter Reuther, Beatrice and Sidney Webb, George Bernard Shaw, Jean-Paul Sartre, Sir Bernard Pares, Harold Laski, D. N. Pritt, Theodore Dreiser, Romain Rollandor, Neal Ascherson, John Cornford, Denis Healy, Philip Toynbee and Upton Sinclair, to say nothing of many, many others guilty of the same intellectual abomination.\nOne doesn’t have to be stupid to be a liberal in the modern American sense of the term, although it surely helps.  One does, however, have to be almost completely ignorant of history.",
  "tags": [],
  "categories": [],
  "sitemap_lastmod": "2006-09-03T14:59:00+00:00"
}