{
  "url": "https://voxday.net/2006/09/08/in-which-harmonic-convergence-is_08/",
  "scraped_at": "2026-01-08T21:17:12.089494",
  "title": "In which harmonic convergence is reached",
  "date_display": "September 8, 2006",
  "date_iso": "2006-09-08T12:23:00+00:00",
  "date_from_url": "2006-09-08",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>Between Mr. Adams and myself:</p><blockquote><p>Have you ever noticed that the heads of state that oppose the United States are always crazy?  Take the Iranian President Ahmadinejad for example. He believes 9/11 might have been orchestrated by the U.S. government. That makes him either certifiable crazy or possibly French….</p><p>Ahmadinajad questions whether the holocaust ever happened.  That would make him a person who trusts the education system in his own country, and we know how crazy that is, unless you live in America. Americans learn true history as opposed to the crap they learn “over there.” That’s how I know that Squanto the Native American taught the Pilgrims how to grow corn by putting a dead fish in the hole with every seed. I’ll bet the Iranian university system never even mentions that story….</p><p>I’m not pro-Iranian or anti-American. I’d pave the rest of the world to save my American cat. The only thing I oppose is muddy thinking. If we need to send Americans into harm’s way, I want reasons and I want a full discussion of the options. Excuuuse the fuck out of me for asking for them.</p></blockquote><p>I think it would be a fantastic thing for Ahmadinajad to come to the United States and debate President Bush, or even any of the major neocons.  It would be extremely educational in demonstrating to everyone that mere opposition to a particular evil does not make one inherently good.  Did the Soviet Union cease to be evil when Hitler launched Operation Barbarossa?  And, of course, it would also serve to let the Americna people understand that the Iranian people have a justifiable <em>casus belli</em> against the United States that has nothing to do with Islam.</p><p>America ceased to be a positive force for good in the world some time ago; while it is still much better than the People’s Republic of China or the Islamic Republic of Iran, that’s mere damning with faint praise.  Pointing back sixty years to WWII in order to claim innocence behind our current occupations of numerous European countries, African nations, Asian states, former Soviet Republic-stans and Middle Eastern emirates isn’t the reason that the violent Muslim expansionists hate us, but it is the reason that the peaceful atheist Swedes and the peaceful Catholic Italians are rightly suspicious of us and refuse to take our side.</p><p>Don’t forget that it was the USA which saddled the world with the United Nations either.</p><p>The United States is a schizophrenic empire in denial.  This is the result of a bipartisan poltical elite habitually deceiving the people about its actions at home and abroad.  It is remniscent of Rome without the national will to power or the British Empire without the techno-economical muscle.  It seems probable, therefore, that this Pax Americana which has lasted for sixty years will collapse in a shorter period of time than either the Pax Romana or Pax Brittania did.</p></div>",
  "content_text": "Between Mr. Adams and myself:\nHave you ever noticed that the heads of state that oppose the United States are always crazy?  Take the Iranian President Ahmadinejad for example. He believes 9/11 might have been orchestrated by the U.S. government. That makes him either certifiable crazy or possibly French….\nAhmadinajad questions whether the holocaust ever happened.  That would make him a person who trusts the education system in his own country, and we know how crazy that is, unless you live in America. Americans learn true history as opposed to the crap they learn “over there.” That’s how I know that Squanto the Native American taught the Pilgrims how to grow corn by putting a dead fish in the hole with every seed. I’ll bet the Iranian university system never even mentions that story….\nI’m not pro-Iranian or anti-American. I’d pave the rest of the world to save my American cat. The only thing I oppose is muddy thinking. If we need to send Americans into harm’s way, I want reasons and I want a full discussion of the options. Excuuuse the fuck out of me for asking for them.\nI think it would be a fantastic thing for Ahmadinajad to come to the United States and debate President Bush, or even any of the major neocons.  It would be extremely educational in demonstrating to everyone that mere opposition to a particular evil does not make one inherently good.  Did the Soviet Union cease to be evil when Hitler launched Operation Barbarossa?  And, of course, it would also serve to let the Americna people understand that the Iranian people have a justifiable\ncasus belli\nagainst the United States that has nothing to do with Islam.\nAmerica ceased to be a positive force for good in the world some time ago; while it is still much better than the People’s Republic of China or the Islamic Republic of Iran, that’s mere damning with faint praise.  Pointing back sixty years to WWII in order to claim innocence behind our current occupations of numerous European countries, African nations, Asian states, former Soviet Republic-stans and Middle Eastern emirates isn’t the reason that the violent Muslim expansionists hate us, but it is the reason that the peaceful atheist Swedes and the peaceful Catholic Italians are rightly suspicious of us and refuse to take our side.\nDon’t forget that it was the USA which saddled the world with the United Nations either.\nThe United States is a schizophrenic empire in denial.  This is the result of a bipartisan poltical elite habitually deceiving the people about its actions at home and abroad.  It is remniscent of Rome without the national will to power or the British Empire without the techno-economical muscle.  It seems probable, therefore, that this Pax Americana which has lasted for sixty years will collapse in a shorter period of time than either the Pax Romana or Pax Brittania did.",
  "tags": [],
  "categories": [],
  "sitemap_lastmod": "2006-09-08T11:23:00+00:00"
}