{
  "url": "https://voxday.net/2006/09/26/mailvox-typical-emails-on-torture/",
  "scraped_at": "2026-01-08T21:18:37.668918",
  "title": "Mailvox: typical emails on torture",
  "date_display": "September 26, 2006",
  "date_iso": "2006-09-26T11:02:00+00:00",
  "date_from_url": "2006-09-26",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>Here’s a selection of ones, you’ll probably note the general theme:</p><blockquote><p>I was simply shocked by your article, “The Shadow of the Torturer”.  You clearly have little or no idea as to what kind of world we are living in today—and even less knowledge about the nature of Islamic terror.  Your arguments sound strangely like those proffered by my liberal uncle a week ago….I will give you the same advice I gave my dear uncle: wake up.  Just because you are not paranoid does not mean your enemies are not out to get you.  Consider that before slurring those you regard as “fearful” or “foolish”.  Moreover, in thinking that you are wise (which you obviously do), you should be careful to avoid transforming yourself into the fool.<br>– KW</br></p><p>How do you define torture?  Is it anything which causes lasting physical or psychological damage to a normal human being?  Would it include being forced to listen to the Red Hot Chili Peppers at the volume teenagers normally employ?  It’s adolescent to accuse someone of torture and abuse if you’re unwilling to define what you mean.  John McCain seems to have had a similar problem recently.  He can’t rectify his because he is an unbounded hypocrite, but I expect that you can, so do it!<br>– MM</br></p><p>During my 92 years and 11 Months on this planet I have know fear from time to time. At my age I could have opted out of WW2 but volunteered anyway. Yes I experienced fear some of the time.  I FEAR FOR THE WELFARE  of my family and my country from those that want to kill us.  My greatest fear is from people like you, The Democrats, John McCain and his trio all of whom  seem to agree  that we should sacrifice the lives of American women and children in order to be kind to the likes of Khalid Sheik Mohammad.</p><p>In WW2 if an enemy had information, he gave it up.  Any one fighting on a battlefield without an identifiable uniform was left lying where he was shot.  I am shocked at the lily-livered people that love our enemies more than our country and our people.  Should we send flowers and social workers instead of Soldiers.??  There is no substitute for victory.<br>– DJ</br></p><p>I can’t believe you want to handle these heathen, Muslim thugs with kid gloves.  If one life can be saved by “water boarding” these bastards, I say, go for it!  I’m sure if any of your loved ones were involved, you would come down from your lofty perch!  Give me a break; come to your senses.<br>– JN</br></p><p>I am a firm believer in Do on to others as you would have them do unto you.maybe you should give some thought to what the followers of Jihad do on a daily basis to their countrymen,i have never got over the image of our military being drug behind cars,set on fire,etc.and surely you jest when you stated that jihads ability to kill large quantities of Americans is arguably lower then that possessed by any American enemy since the war of 1812.is there any doubt that Hitler or the Japanese would have used the Atomic Bomb if they had it before us? the same holds true today<br>with the followers of Jihads the only difference is that to day there are known enemies of this country that we know posses Atomic Weapons and would not hesitate to furnish them to those who follow Jihad.I’m not saying we should go to extreme torture<br>methods,however i am saying if every thing else has failed then do whatever it takes to insure the survival of America.<br>– CF</br></br></br></p></blockquote><p>While I was impressed by the ability of most critics to avoid the obvious and inaccurate accusations of treason, insufficient patriotism, liberalism and so forth, I did think it was a little ironic that so many people responded to my point that fear is a bad reason to abandon civilized behavior by telling me that I just didn’t understand how scary the terrorists are.</p><p>First, the embrace of torture is neither proof of national resolve nor is it a magical guarantee of ultimate victory.  Descending to the level of the barbarians actually makes defeat more likely; the Romans saw no need to paint their butts blue nor did the English start devouring Maoris in order to defeat the barbarians of their days.</p><p>Second, the slippery slopes towards a widening of the definition of the acceptably tortured and the acceptance of other uncivilized practices such as authority-approved rape and cannibalism are not logical fallacies, but reliable probabilities.   That the pro-torturists recognize this and are attempting to circumvent the logic is clear from this exchange between KW and I:</p><p>VOX:  Do you include child rape and cannibalism in your list of acceptable practices to defeat terrorism?</p><p>KW: <em>Of course not, but you knew that already before you asked the question.  You will have to do much better than that to put me on a slippery slope. </em></p><p>Actually, I don’t.  If the utility of torture in saving “just one American life” or “insuring the survival of America” is sufficient justification for it, one need merely point to a similar utility to be found in child rape or cannibalism.  After all, it’s impossible to argue that the jihadists at Guantanamo would pose any future danger to the Americans were they repeatedly raped by federal agents then served up raw to the U.S. Senate, and no doubt it would provide a very firm demonstration of the very unpleasant consequences of attacking America.</p><p>Third, I don’t know why people think that attempting to quibble about a well-defined term is an effective means of debate.  The fact that the word “torture” has been degraded in the popular sense to mean “anything I really don’t like” does not modify its historical meaning in the slightest, namely, to intentionally inflict pain on another individual for pleasure, punishment or the pursuit of information.</p><p>As usual, it is those who wish to avoid the obvious meaning of the term that engage in Clintonian contortions in their feigned failure to understand it.</p></div>",
  "content_text": "Here’s a selection of ones, you’ll probably note the general theme:\nI was simply shocked by your article, “The Shadow of the Torturer”.  You clearly have little or no idea as to what kind of world we are living in today—and even less knowledge about the nature of Islamic terror.  Your arguments sound strangely like those proffered by my liberal uncle a week ago….I will give you the same advice I gave my dear uncle: wake up.  Just because you are not paranoid does not mean your enemies are not out to get you.  Consider that before slurring those you regard as “fearful” or “foolish”.  Moreover, in thinking that you are wise (which you obviously do), you should be careful to avoid transforming yourself into the fool.\n– KW\nHow do you define torture?  Is it anything which causes lasting physical or psychological damage to a normal human being?  Would it include being forced to listen to the Red Hot Chili Peppers at the volume teenagers normally employ?  It’s adolescent to accuse someone of torture and abuse if you’re unwilling to define what you mean.  John McCain seems to have had a similar problem recently.  He can’t rectify his because he is an unbounded hypocrite, but I expect that you can, so do it!\n– MM\nDuring my 92 years and 11 Months on this planet I have know fear from time to time. At my age I could have opted out of WW2 but volunteered anyway. Yes I experienced fear some of the time.  I FEAR FOR THE WELFARE  of my family and my country from those that want to kill us.  My greatest fear is from people like you, The Democrats, John McCain and his trio all of whom  seem to agree  that we should sacrifice the lives of American women and children in order to be kind to the likes of Khalid Sheik Mohammad.\nIn WW2 if an enemy had information, he gave it up.  Any one fighting on a battlefield without an identifiable uniform was left lying where he was shot.  I am shocked at the lily-livered people that love our enemies more than our country and our people.  Should we send flowers and social workers instead of Soldiers.??  There is no substitute for victory.\n– DJ\nI can’t believe you want to handle these heathen, Muslim thugs with kid gloves.  If one life can be saved by “water boarding” these bastards, I say, go for it!  I’m sure if any of your loved ones were involved, you would come down from your lofty perch!  Give me a break; come to your senses.\n– JN\nI am a firm believer in Do on to others as you would have them do unto you.maybe you should give some thought to what the followers of Jihad do on a daily basis to their countrymen,i have never got over the image of our military being drug behind cars,set on fire,etc.and surely you jest when you stated that jihads ability to kill large quantities of Americans is arguably lower then that possessed by any American enemy since the war of 1812.is there any doubt that Hitler or the Japanese would have used the Atomic Bomb if they had it before us? the same holds true today\nwith the followers of Jihads the only difference is that to day there are known enemies of this country that we know posses Atomic Weapons and would not hesitate to furnish them to those who follow Jihad.I’m not saying we should go to extreme torture\nmethods,however i am saying if every thing else has failed then do whatever it takes to insure the survival of America.\n– CF\nWhile I was impressed by the ability of most critics to avoid the obvious and inaccurate accusations of treason, insufficient patriotism, liberalism and so forth, I did think it was a little ironic that so many people responded to my point that fear is a bad reason to abandon civilized behavior by telling me that I just didn’t understand how scary the terrorists are.\nFirst, the embrace of torture is neither proof of national resolve nor is it a magical guarantee of ultimate victory.  Descending to the level of the barbarians actually makes defeat more likely; the Romans saw no need to paint their butts blue nor did the English start devouring Maoris in order to defeat the barbarians of their days.\nSecond, the slippery slopes towards a widening of the definition of the acceptably tortured and the acceptance of other uncivilized practices such as authority-approved rape and cannibalism are not logical fallacies, but reliable probabilities.   That the pro-torturists recognize this and are attempting to circumvent the logic is clear from this exchange between KW and I:\nVOX:  Do you include child rape and cannibalism in your list of acceptable practices to defeat terrorism?\nKW:\nOf course not, but you knew that already before you asked the question.  You will have to do much better than that to put me on a slippery slope.\nActually, I don’t.  If the utility of torture in saving “just one American life” or “insuring the survival of America” is sufficient justification for it, one need merely point to a similar utility to be found in child rape or cannibalism.  After all, it’s impossible to argue that the jihadists at Guantanamo would pose any future danger to the Americans were they repeatedly raped by federal agents then served up raw to the U.S. Senate, and no doubt it would provide a very firm demonstration of the very unpleasant consequences of attacking America.\nThird, I don’t know why people think that attempting to quibble about a well-defined term is an effective means of debate.  The fact that the word “torture” has been degraded in the popular sense to mean “anything I really don’t like” does not modify its historical meaning in the slightest, namely, to intentionally inflict pain on another individual for pleasure, punishment or the pursuit of information.\nAs usual, it is those who wish to avoid the obvious meaning of the term that engage in Clintonian contortions in their feigned failure to understand it.",
  "tags": [],
  "categories": [],
  "sitemap_lastmod": "2006-09-26T10:02:00+00:00"
}