{
  "url": "https://voxday.net/2006/09/19/orange-and-blue-crack-tmq/",
  "scraped_at": "2026-01-08T21:18:11.085335",
  "title": "The Orange and the Blue crack TMQ",
  "date_display": "September 19, 2006",
  "date_iso": "2006-09-19T17:00:00+00:00",
  "date_from_url": "2006-09-19",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><blockquote><p>Obscure College Score of the Week: <a href=\"http://sports.espn.go.com/espn/page2/story?page=easterbrook/060919\">Bucknell 20, Cornell 5</a>. The Big Red faithful lament — if only we’d gotten eight more safeties! Located in Lewisburg, Pa., Bucknell is too renown to qualify as an obscure college. But the school has a little-known quality as regards modern sports: It both plays Division I and graduates its athletes. Bucknell sent its men’s basketball team to the NCAA tournament last March, where the Bison were the sole tourney college that had graduated all scholarship athletes in the most recent NCAA ranking. Bucknell won the clever athletics-and-academics bracket recently assembled by Inside Higher Education. Bucknell’s Sean Conover, a rookie defensive end on the Tennessee Titans’ practice squad, was busy last spring because before reporting to the Titans he put on a funny-looking gown and graduated. Bucknell often leads Division I schools in athletes’ graduation rates, and is fourth all time in total Academic All-American honors dispensed by ESPN The Magazine. Attention other universities — it is not impossible to have major sports programs that graduate their athletes, you just have to care about education.</p></blockquote><p>Their recent March Madness runs notwithstanding, I haven’t been this proud of my alma mater since Big Chilly called to tell me the town had to call in two busloads of riot police to deal with House Party.</p></div>",
  "content_text": "Obscure College Score of the Week:\nBucknell 20, Cornell 5\n. The Big Red faithful lament — if only we’d gotten eight more safeties! Located in Lewisburg, Pa., Bucknell is too renown to qualify as an obscure college. But the school has a little-known quality as regards modern sports: It both plays Division I and graduates its athletes. Bucknell sent its men’s basketball team to the NCAA tournament last March, where the Bison were the sole tourney college that had graduated all scholarship athletes in the most recent NCAA ranking. Bucknell won the clever athletics-and-academics bracket recently assembled by Inside Higher Education. Bucknell’s Sean Conover, a rookie defensive end on the Tennessee Titans’ practice squad, was busy last spring because before reporting to the Titans he put on a funny-looking gown and graduated. Bucknell often leads Division I schools in athletes’ graduation rates, and is fourth all time in total Academic All-American honors dispensed by ESPN The Magazine. Attention other universities — it is not impossible to have major sports programs that graduate their athletes, you just have to care about education.\nTheir recent March Madness runs notwithstanding, I haven’t been this proud of my alma mater since Big Chilly called to tell me the town had to call in two busloads of riot police to deal with House Party.",
  "tags": [],
  "categories": [],
  "sitemap_lastmod": "2006-09-19T16:00:00+00:00"
}