{
  "url": "https://voxday.net/2006/09/14/perhaps-shes-been-eating-saltpeter/",
  "scraped_at": "2026-01-08T21:17:47.955606",
  "title": "Perhaps she’s been eating saltpeter",
  "date_display": "September 14, 2006",
  "date_iso": "2006-09-14T12:10:00+00:00",
  "date_from_url": "2006-09-14",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>The Happy Feminist <a href=\"http://happyfeminist.typepad.com/happyfeminist/2006/09/so_vox_wants_to.html\">offers a correction</a>:</p><blockquote><p>First, he wants to quibble by stating that his suggestion of “throwing a punch” at a woman who touches him involves less force than shoving someone up against a wall.  Of course, his initial suggestion was to “punch out” such a woman.  I guess he is backing off his original point (the one I supposedly missed), which was clearly intended to suggest that a woman’s right to self-defense carries with it a corresponding right of men to use, in self-defense, their generally superior size and strength to inflict serious injury.  If not, if he’s just talking about a weak little punch (only a tap if you will), then his point is, well, rather pointless.</p></blockquote><p>And here I was under the impression that quibbling was one of the more salient aspects of the blogosphere.  Regardless, it takes far less effort to throw a punch than to physically move someone against their will, as anyone who has done both well knows.  (One of the sillier aspects of the throws in the latest Dead or Alive, I might add.)  A simple hip-snap is all the former entails versus lunging forward with most or all of your body weight.  For any man of above average strength, a single punch <em>is</em> sufficient to punch out a woman.  It is possible, of course, that HF and I are using the term “punch out” differently, I do not refer to a continued beating of indefinite length but rather the concept of throwing strikes until the opponent is incapacitated.  In my admittedly limited experience outside the ring and the dojo, one has hitherto proven to be enough.</p><p>On the other hand, HF’s criticism about her hypothetical “happening to touch” is pedantic, perhaps even quibbling, but nevertheless accurate.  I therefore revise my statement to say that men should be aware that should HF not merely happen to touch them, but instead grope or unlawfully touch them, she will not object to being thrown against a wall.  I thank her for the legal clarification.</p><p>And I shall endeavor to survive the disappointment of learning that HF harbors no illicit designs on my corpus and cling to the small comfort provided in her “approximately”.  Alas, unhappy man, that even your rampant sensuality could not inspire a spark of desire in that frigid feminist breast!</p></div>",
  "content_text": "The Happy Feminist\noffers a correction\n:\nFirst, he wants to quibble by stating that his suggestion of “throwing a punch” at a woman who touches him involves less force than shoving someone up against a wall.  Of course, his initial suggestion was to “punch out” such a woman.  I guess he is backing off his original point (the one I supposedly missed), which was clearly intended to suggest that a woman’s right to self-defense carries with it a corresponding right of men to use, in self-defense, their generally superior size and strength to inflict serious injury.  If not, if he’s just talking about a weak little punch (only a tap if you will), then his point is, well, rather pointless.\nAnd here I was under the impression that quibbling was one of the more salient aspects of the blogosphere.  Regardless, it takes far less effort to throw a punch than to physically move someone against their will, as anyone who has done both well knows.  (One of the sillier aspects of the throws in the latest Dead or Alive, I might add.)  A simple hip-snap is all the former entails versus lunging forward with most or all of your body weight.  For any man of above average strength, a single punch\nis\nsufficient to punch out a woman.  It is possible, of course, that HF and I are using the term “punch out” differently, I do not refer to a continued beating of indefinite length but rather the concept of throwing strikes until the opponent is incapacitated.  In my admittedly limited experience outside the ring and the dojo, one has hitherto proven to be enough.\nOn the other hand, HF’s criticism about her hypothetical “happening to touch” is pedantic, perhaps even quibbling, but nevertheless accurate.  I therefore revise my statement to say that men should be aware that should HF not merely happen to touch them, but instead grope or unlawfully touch them, she will not object to being thrown against a wall.  I thank her for the legal clarification.\nAnd I shall endeavor to survive the disappointment of learning that HF harbors no illicit designs on my corpus and cling to the small comfort provided in her “approximately”.  Alas, unhappy man, that even your rampant sensuality could not inspire a spark of desire in that frigid feminist breast!",
  "tags": [],
  "categories": [],
  "sitemap_lastmod": "2006-09-14T11:10:00+00:00"
}