{
  "url": "https://voxday.net/2006/09/10/shredding-scott-adams/",
  "scraped_at": "2026-01-08T21:17:17.563709",
  "title": "Shredding Scott Adams",
  "date_display": "September 10, 2006",
  "date_iso": "2006-09-10T08:31:00+00:00",
  "date_from_url": "2006-09-10",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>One of the cartoonist’s blog readers <a href=\"http://dilbertblog.typepad.com/the_dilbert_blog/2006/09/why_do_i_enjoy_.html#comments\">rightly impales him</a>:</p><blockquote><p>Every time you’ve voiced an opinion on this blog and had it shredded by people who understand the issue at hand, you’ve backpedaled into “I didn’t really mean anything I said. I was just testing you. I was just conducting an experiment. Revel in my brilliance.”</p><p>Your standard scheme is: opine, face disagreement, insult people, backpedal.  It’s lazy, and it’s cowardly. You’re obviously very impressed with yourself. You clearly want people to agree with you, and call you brilliant. You write books to “educate” people with your sage observations.</p><p>But as soon as you are in a feedback-capable forum, you cave. The internet is not a healthy forum for those craving approval. Post on any topic, and you will instantly get 50 people smarter than you rebutting your post. This is pretty much a worst-case environment for you.</p></blockquote><p>I enjoy both Dilbert and Mr. Adams’ blog, but this reader has all but vivisected his typical behavior on the blog.  Adams is the quintessential Gamma Male, a supremely skilled sniper who is afraid to directly confront so much as a Girl Scout in open debate.  Everything is always couched in a manner to allow him to attack others without being attacked himself.</p><p>While one must make allowances for Mr. Adams, whose gift for entertaining the employed masses is largely based on his weasely, passive-aggressive nature, one need not do so for the average Internet weasel.  It is my disdain for such creatures and their typical “gotcha” method of criticism that first led me to infuse my columns with the weasel-traps that are occasionally confused by the superficial for an Adamsian attempt to have things both ways.</p><p>For example, during a foolish attempt to have an straightforward discussion with some fellow SFWA writers who had taken offense at a side-comment about why women don’t write hard science fiction, I referred to what a spectacularly ugly woman Kim Stanley Robinson was.  (Robinson is a man who won the Nebula in 1993 for <em>Red Mars</em>.)  As I expected from the infantile SF writers who infest that particular site, this was immediately leaped upon to prove how stupid I was, thus absolving them from having to respond to any of the logical points I had made.</p><p>Of course, once I pointed out that I am perfectly aware that Kim Robinson is, in fact, Mr. Robinson, the embarrassed “gotcha critics” first attempted to claim that I was only trying to cover for my own blunder, then, when that didn’t fly, one or two tried to assert that setting such traps is somehow childish.  But that assertion is to miss the point entirely, because the purpose of such things is to separate the serious critics who are worth engaging from those who are only interested in manufacturing a  spurious excuse to quickly declare themselves the winner and run away.  For example, if a critic declares that a treatise on Muslim immigration in Europe is completely worthless because the author makes one reference to Swaziland instead of Switzerland and uses that as an excuse to avoid facing the main thrust of the piece, he is merely a drive-by commenter and is unworthy of notice.</p><p>I have learned over the course of this blog that engaging such intellectual tadpoles is a complete waste of time; one sure way to get yourself ignored here is to unsuccessfully argue a point and instead of conceding it, go silent or try to change the subject.  Another, of course, is to carelessly stick your foot in an obvious weasel trap.</p></div>",
  "content_text": "One of the cartoonist’s blog readers\nrightly impales him\n:\nEvery time you’ve voiced an opinion on this blog and had it shredded by people who understand the issue at hand, you’ve backpedaled into “I didn’t really mean anything I said. I was just testing you. I was just conducting an experiment. Revel in my brilliance.”\nYour standard scheme is: opine, face disagreement, insult people, backpedal.  It’s lazy, and it’s cowardly. You’re obviously very impressed with yourself. You clearly want people to agree with you, and call you brilliant. You write books to “educate” people with your sage observations.\nBut as soon as you are in a feedback-capable forum, you cave. The internet is not a healthy forum for those craving approval. Post on any topic, and you will instantly get 50 people smarter than you rebutting your post. This is pretty much a worst-case environment for you.\nI enjoy both Dilbert and Mr. Adams’ blog, but this reader has all but vivisected his typical behavior on the blog.  Adams is the quintessential Gamma Male, a supremely skilled sniper who is afraid to directly confront so much as a Girl Scout in open debate.  Everything is always couched in a manner to allow him to attack others without being attacked himself.\nWhile one must make allowances for Mr. Adams, whose gift for entertaining the employed masses is largely based on his weasely, passive-aggressive nature, one need not do so for the average Internet weasel.  It is my disdain for such creatures and their typical “gotcha” method of criticism that first led me to infuse my columns with the weasel-traps that are occasionally confused by the superficial for an Adamsian attempt to have things both ways.\nFor example, during a foolish attempt to have an straightforward discussion with some fellow SFWA writers who had taken offense at a side-comment about why women don’t write hard science fiction, I referred to what a spectacularly ugly woman Kim Stanley Robinson was.  (Robinson is a man who won the Nebula in 1993 for\nRed Mars\n.)  As I expected from the infantile SF writers who infest that particular site, this was immediately leaped upon to prove how stupid I was, thus absolving them from having to respond to any of the logical points I had made.\nOf course, once I pointed out that I am perfectly aware that Kim Robinson is, in fact, Mr. Robinson, the embarrassed “gotcha critics” first attempted to claim that I was only trying to cover for my own blunder, then, when that didn’t fly, one or two tried to assert that setting such traps is somehow childish.  But that assertion is to miss the point entirely, because the purpose of such things is to separate the serious critics who are worth engaging from those who are only interested in manufacturing a  spurious excuse to quickly declare themselves the winner and run away.  For example, if a critic declares that a treatise on Muslim immigration in Europe is completely worthless because the author makes one reference to Swaziland instead of Switzerland and uses that as an excuse to avoid facing the main thrust of the piece, he is merely a drive-by commenter and is unworthy of notice.\nI have learned over the course of this blog that engaging such intellectual tadpoles is a complete waste of time; one sure way to get yourself ignored here is to unsuccessfully argue a point and instead of conceding it, go silent or try to change the subject.  Another, of course, is to carelessly stick your foot in an obvious weasel trap.",
  "tags": [],
  "categories": [],
  "sitemap_lastmod": "2006-09-10T07:31:00+00:00"
}