{
  "url": "https://voxday.net/2006/09/04/spanking-zapata/",
  "scraped_at": "2026-01-08T21:16:54.092471",
  "title": "Spanking Zapata",
  "date_display": "September 4, 2006",
  "date_iso": "2006-09-04T20:57:00+00:00",
  "date_from_url": "2006-09-04",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>Unlike Zapata King, <a href=\"http://rawdc.blogspot.com/2006/09/fascism-of-vox-intelligent_115738832982407776.html\">I can not only read a dictionary</a>, but understand it:</p><blockquote><p>Let me tell you the way it is, Supposed Super Intelligence. Word usage is determined by anarchy, not by The Fascism of the Vox Intelligentsia of Word Usage. If a word gets polluted over time, and its meaning goes from the specific to the general, that’s just the way it is. And though I don’t have a solid grasp on the etymology of fascist, though I’m sure if I studied what you’ve written I could make some progress in that direction, I can read a dictionary.</p><p>fas·cism<br>n.</br></p><p> 1. often Fascism<br> 1. A system of government marked by centralization of authority under a dictator, stringent socioeconomic controls, suppression of the opposition through terror and censorship, and typically a policy of belligerent nationalism and racism.<br> 2. A political philosophy or movement based on or advocating such a system of government.<br> 2. Oppressive, dictatorial control.</br></br></br></p></blockquote><p>Okay, let’s see how these apply to the jihadists.  They don’t have a system of government, don’t have a dictator, don’t have stringent socioeconomc controls, do suppress opposition through terror, (though not censorship), and aren’t belligerent or racist except for their <em>Judenhassen</em>.  So (1.1) is out.  So, obviously, is (1.2).</p><p>And so is (2), since the jihad neither possesses nor seeks dictatorial control.  Terrorism is neither oppression nor control, indeed, it is generally considered a violent reaction to both, the weapon of those who lack the power for either.  Furthermore, the jihadist terrorists seek religious dominance in the form of a Caliphate which would likely apply lighter taxation than most Western countries currently endure, impose far fewer dictatorial business regulations than we now enjoy and require strictures on personal behavior that aren’t terribly dissimilar to the societal mores of 100 years ago in the West.</p><p>True, their punishments are brutal and they’re not so big on the concept of freedom of religion, but as long as one pays one’s<em>jizya</em>, abides by the public etiquette and acknowledges the supremacy of Sharia, one will pretty much be left alone.  I daresay OSHA and the IRS are more dictatorial and controlling, if less violent.</p><p>Ironically, Zapata King’s insistence on the nearly meaningless dictionary alternative fits the Saudi Arabian, Jordanian and Egyptian governments much better than it does their rivals in the jihad.  Somehow, I doubt that’s who President Bush and his pet neocons had in mind when they were talking about the mythical “Islamo-fascist”.</p><p>There two obvious responses.  The stupid one will be to state that if I like Islamic caliphates so much, why don’t I move there.  The really stupid one will be to insist that the meaning of “dictatorial” and “control” don’t mean anything either.  See the pattern?</p></div>",
  "content_text": "Unlike Zapata King,\nI can not only read a dictionary\n, but understand it:\nLet me tell you the way it is, Supposed Super Intelligence. Word usage is determined by anarchy, not by The Fascism of the Vox Intelligentsia of Word Usage. If a word gets polluted over time, and its meaning goes from the specific to the general, that’s just the way it is. And though I don’t have a solid grasp on the etymology of fascist, though I’m sure if I studied what you’ve written I could make some progress in that direction, I can read a dictionary.\nfas·cism\nn.\n1. often Fascism\n1. A system of government marked by centralization of authority under a dictator, stringent socioeconomic controls, suppression of the opposition through terror and censorship, and typically a policy of belligerent nationalism and racism.\n2. A political philosophy or movement based on or advocating such a system of government.\n2. Oppressive, dictatorial control.\nOkay, let’s see how these apply to the jihadists.  They don’t have a system of government, don’t have a dictator, don’t have stringent socioeconomc controls, do suppress opposition through terror, (though not censorship), and aren’t belligerent or racist except for their\nJudenhassen\n.  So (1.1) is out.  So, obviously, is (1.2).\nAnd so is (2), since the jihad neither possesses nor seeks dictatorial control.  Terrorism is neither oppression nor control, indeed, it is generally considered a violent reaction to both, the weapon of those who lack the power for either.  Furthermore, the jihadist terrorists seek religious dominance in the form of a Caliphate which would likely apply lighter taxation than most Western countries currently endure, impose far fewer dictatorial business regulations than we now enjoy and require strictures on personal behavior that aren’t terribly dissimilar to the societal mores of 100 years ago in the West.\nTrue, their punishments are brutal and they’re not so big on the concept of freedom of religion, but as long as one pays one’s\njizya\n, abides by the public etiquette and acknowledges the supremacy of Sharia, one will pretty much be left alone.  I daresay OSHA and the IRS are more dictatorial and controlling, if less violent.\nIronically, Zapata King’s insistence on the nearly meaningless dictionary alternative fits the Saudi Arabian, Jordanian and Egyptian governments much better than it does their rivals in the jihad.  Somehow, I doubt that’s who President Bush and his pet neocons had in mind when they were talking about the mythical “Islamo-fascist”.\nThere two obvious responses.  The stupid one will be to state that if I like Islamic caliphates so much, why don’t I move there.  The really stupid one will be to insist that the meaning of “dictatorial” and “control” don’t mean anything either.  See the pattern?",
  "tags": [],
  "categories": [],
  "sitemap_lastmod": "2006-09-04T19:57:00+00:00"
}