{
  "url": "https://voxday.net/2006/09/12/tale-of-two-women/",
  "scraped_at": "2026-01-08T21:17:34.937120",
  "title": "A tale of two women",
  "date_display": "September 12, 2006",
  "date_iso": "2006-09-12T14:19:00+00:00",
  "date_from_url": "2006-09-12",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>Like <a href=\"http://www.scalzi.com/whatever/004449.html\">John Scalzi’s wife</a>, Spacebunny was recently accosted in a bar by a drunken fool with inappropriately amorous attentions.  She, too, was grabbed.  Unlike Mrs. Scalzi, however, she did not feel the need to shove him up against a wall, jam her arm into his throat and give a little feminist speech: “I have had enough of you being rude and disrespectful toward women. The next time I see you, you will be polite and show respect.”</p><p>Instead, Spacebunny simply turned around and let loose with her trademark Storm Blue Icicle Stare, which was enough to inspire the same result achieved by Mrs. Scalzi’s physical attack. <a href=\"http://drhelen.blogspot.com/2006/09/bit-of-over-reaction.html\">Unlike Mrs. Instapundit</a>, I have no problem with the small amount of violence utilized by Mrs. Scalzi, nor do I harbor any desire to see Spacebunny match her ocular superpowers against the more pedestrian abilities of Mr. Scalzi’s wife, although I would put my money on the cold Nordic gaze of my pretty Valkyrie.</p><p>However, I do agree with Dr. Helen that the “you go, girl” cheerleading of various feminist commenters is more than a little repulsive, particularly in its vapid ignorance of the risks inherent in deciding to up the physical ante without benefit of 18-inch guns, martial training or weaponry.  I don’t say this in defense of uncouth cretins who consider groping to be a form of courtship – although I will point out that this justification of violent response to unwanted contact justifies much, if not most, gay-bashing – only to say that it is unwise to increase the amount of physical force in an exchange if you are not fully prepared for it to escalate dramatically.</p><p>As my sensei always taught, do not go until you are ready to go 100 percent.  Shoving someone against a wall is not sufficient as the opponent is not incapacitated and such an armbar leaves your stomach, groin and knees fully exposed.  It’s merely intimidation, which only the inexperienced could possibly confuse for genuine incapacitation.</p><p>Now, perhaps Mrs. Scalzi was fortunate or perhaps she is an astute judge of male character and correctly identified a physical coward who would permit her to humiliate him.  I don’t know, I was not there and I take no exception to her actions.  (The silly little speech is another matter, but whatever.)  I would not, however, recommend a similarly physical reaction to unwanted touching by the average woman unless the guy is in a wheelchair or something.  Even then it can be risky; one of my friends was once knocked out in a nightclub brawl when a crippled gangbanger threw a brick and hit him in the back of the head.</p><p>As for the Tuff Grrrl poster, the less said the better.  Someday, women will learn that you have to earn respect, you don’t simply get it for “being me”.  If a feminist doesn’t respect me, (and I assume many don’t), does that give me the right to beat her?  Still, while Dr. Helen is appalled, I’m mostly amused to see middle class white women adopting the “don’t diss me” attitude of the black underclass.  I mean, it’s worked so well for them, after all….</p><p>By the way, Scalzi’s SF is worth reading, particularly if you enjoy the early Heinlein.  Despite our numerous differences of opinion, I found I rather liked the guy when we were exchanging emails a while back.</p></div>",
  "content_text": "Like\nJohn Scalzi’s wife\n, Spacebunny was recently accosted in a bar by a drunken fool with inappropriately amorous attentions.  She, too, was grabbed.  Unlike Mrs. Scalzi, however, she did not feel the need to shove him up against a wall, jam her arm into his throat and give a little feminist speech: “I have had enough of you being rude and disrespectful toward women. The next time I see you, you will be polite and show respect.”\nInstead, Spacebunny simply turned around and let loose with her trademark Storm Blue Icicle Stare, which was enough to inspire the same result achieved by Mrs. Scalzi’s physical attack.\nUnlike Mrs. Instapundit\n, I have no problem with the small amount of violence utilized by Mrs. Scalzi, nor do I harbor any desire to see Spacebunny match her ocular superpowers against the more pedestrian abilities of Mr. Scalzi’s wife, although I would put my money on the cold Nordic gaze of my pretty Valkyrie.\nHowever, I do agree with Dr. Helen that the “you go, girl” cheerleading of various feminist commenters is more than a little repulsive, particularly in its vapid ignorance of the risks inherent in deciding to up the physical ante without benefit of 18-inch guns, martial training or weaponry.  I don’t say this in defense of uncouth cretins who consider groping to be a form of courtship – although I will point out that this justification of violent response to unwanted contact justifies much, if not most, gay-bashing – only to say that it is unwise to increase the amount of physical force in an exchange if you are not fully prepared for it to escalate dramatically.\nAs my sensei always taught, do not go until you are ready to go 100 percent.  Shoving someone against a wall is not sufficient as the opponent is not incapacitated and such an armbar leaves your stomach, groin and knees fully exposed.  It’s merely intimidation, which only the inexperienced could possibly confuse for genuine incapacitation.\nNow, perhaps Mrs. Scalzi was fortunate or perhaps she is an astute judge of male character and correctly identified a physical coward who would permit her to humiliate him.  I don’t know, I was not there and I take no exception to her actions.  (The silly little speech is another matter, but whatever.)  I would not, however, recommend a similarly physical reaction to unwanted touching by the average woman unless the guy is in a wheelchair or something.  Even then it can be risky; one of my friends was once knocked out in a nightclub brawl when a crippled gangbanger threw a brick and hit him in the back of the head.\nAs for the Tuff Grrrl poster, the less said the better.  Someday, women will learn that you have to earn respect, you don’t simply get it for “being me”.  If a feminist doesn’t respect me, (and I assume many don’t), does that give me the right to beat her?  Still, while Dr. Helen is appalled, I’m mostly amused to see middle class white women adopting the “don’t diss me” attitude of the black underclass.  I mean, it’s worked so well for them, after all….\nBy the way, Scalzi’s SF is worth reading, particularly if you enjoy the early Heinlein.  Despite our numerous differences of opinion, I found I rather liked the guy when we were exchanging emails a while back.",
  "tags": [],
  "categories": [],
  "sitemap_lastmod": "2006-09-12T13:19:00+00:00"
}