{
  "url": "https://voxday.net/2012/10/26/a-portrait-in-irony/",
  "scraped_at": "2025-12-14T05:06:21.993261",
  "title": "A portrait in irony",
  "date_display": "October 26, 2012",
  "date_iso": "2012-10-26T10:51:00+00:00",
  "date_from_url": "2012-10-26",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>Our favorite “Nobel Prize”-winning economist, Paul Krugman, laments Mitt Romney’s successful stealing <a href=\"http://www.nytimes.com/2012/10/26/opinion/krugman-pointing-toward-prosperity.html\">from the Democratic playbook</a>:</p><blockquote class=\"tr_bq\"><p> Mitt Romney has been barnstorming the country, telling voters that he<br> has a five-point plan to restore prosperity. And some voters, alas, seem<br> to believe what he’s saying. So President Obama has now responded with<br> his own plan, a little blue booklet containing 27 policy proposals. How<br> do these two plans stack up?</br></br></br></br></p><div itemprop=\"articleBody\"> Well, as I’ve said before, Mr. Romney’s “plan” is a sham. It’s a list of<br> things he claims will happen, with no description of the policies he<br> would follow to make those things happen. “We will cut the deficit and<br> put America on track to a balanced budget,” he declares, but he refuses<br> to specify which tax loopholes he would close to offset his $5 trillion<br> in tax cuts. </br></br></br></br></br></div><div itemprop=\"articleBody\"> Actually, if describing what you want to see happen without providing<br> any specific policies to get us there constitutes a “plan,” I can easily<br> come up with a one-point plan that trumps Mr. Romney any day. Here it<br> is: Every American will have a good job with good wages. Also, a<br> blissfully happy marriage. And a pony. </br></br></br></br></div><p>So Mr. Romney is faking it. His real plan seems to be to foster economic<br> recovery through magic, inspiring business confidence through his<br> personal awesomeness.</br></br></p></blockquote><p>Translation: Romney has no economic plan for economic recovery except for appealing to the pagan economic gods of the animal spirits.  Which, if you will recall from your reading of the <i>General Theory</i>, is pure Keynesian economics.  I find it absolutely hilarious that the great Keynesian champion is directly criticizing the very heart of the economic theory that forms the basis for his own Neo-Keynesian synthetic approach.</p><p>As an added bonus, he damns the man he is attempting to defend by faint praise.  He writes: “Mr. Obama’s booklet comes a lot closer to being an actual plan. Where<br> Mr. Romney says he’ll achieve energy independence, never mind how, Mr.<br> Obama calls for concrete steps like raising fuel efficiency standards.”</br></br></p><p>Translation: it’s not an actual plan, but it is “a lot closer” to being one.  But one either has a plan or one does not; how is “raising fuel efficiency standards” any less fake than “cutting the deficit”?  It’s not any more specific, it’s merely a smaller generality.</p><p>The reality is that neither presidential candidate has a plan that goes beyond “print and pray”.  Neither Romney or Obama can do anything to foster economic recovery, as they have outsourced that responsibility to Helicopter Ben Bernanke, who appears grimly determined to demonstrate that no matter how many times it is proven that one cannot inflate one’s way to prosperity, if one has a hammer, the problem MUST be a nail.</p></div>",
  "content_text": "Our favorite “Nobel Prize”-winning economist, Paul Krugman, laments Mitt Romney’s successful stealing\nfrom the Democratic playbook\n:\nMitt Romney has been barnstorming the country, telling voters that he\nhas a five-point plan to restore prosperity. And some voters, alas, seem\nto believe what he’s saying. So President Obama has now responded with\nhis own plan, a little blue booklet containing 27 policy proposals. How\ndo these two plans stack up?\nWell, as I’ve said before, Mr. Romney’s “plan” is a sham. It’s a list of\nthings he claims will happen, with no description of the policies he\nwould follow to make those things happen. “We will cut the deficit and\nput America on track to a balanced budget,” he declares, but he refuses\nto specify which tax loopholes he would close to offset his $5 trillion\nin tax cuts.\nActually, if describing what you want to see happen without providing\nany specific policies to get us there constitutes a “plan,” I can easily\ncome up with a one-point plan that trumps Mr. Romney any day. Here it\nis: Every American will have a good job with good wages. Also, a\nblissfully happy marriage. And a pony.\nSo Mr. Romney is faking it. His real plan seems to be to foster economic\nrecovery through magic, inspiring business confidence through his\npersonal awesomeness.\nTranslation: Romney has no economic plan for economic recovery except for appealing to the pagan economic gods of the animal spirits.  Which, if you will recall from your reading of the\nGeneral Theory\n, is pure Keynesian economics.  I find it absolutely hilarious that the great Keynesian champion is directly criticizing the very heart of the economic theory that forms the basis for his own Neo-Keynesian synthetic approach.\nAs an added bonus, he damns the man he is attempting to defend by faint praise.  He writes: “Mr. Obama’s booklet comes a lot closer to being an actual plan. Where\nMr. Romney says he’ll achieve energy independence, never mind how, Mr.\nObama calls for concrete steps like raising fuel efficiency standards.”\nTranslation: it’s not an actual plan, but it is “a lot closer” to being one.  But one either has a plan or one does not; how is “raising fuel efficiency standards” any less fake than “cutting the deficit”?  It’s not any more specific, it’s merely a smaller generality.\nThe reality is that neither presidential candidate has a plan that goes beyond “print and pray”.  Neither Romney or Obama can do anything to foster economic recovery, as they have outsourced that responsibility to Helicopter Ben Bernanke, who appears grimly determined to demonstrate that no matter how many times it is proven that one cannot inflate one’s way to prosperity, if one has a hammer, the problem MUST be a nail.",
  "tags": [
    "economics",
    "politics"
  ],
  "categories": [],
  "sitemap_lastmod": "2012-10-26T09:51:00+00:00"
}