{
  "url": "https://voxday.net/2012/10/30/conspiracy-theorists-you-disappoint-me/",
  "scraped_at": "2025-12-14T05:06:49.762301",
  "title": "Conspiracy theorists, you disappoint me",
  "date_display": "October 30, 2012",
  "date_iso": "2012-10-30T18:00:00+00:00",
  "date_from_url": "2012-10-30",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>For literally years, I’ve been hearing rumors concerning how Obama was going to cancel the presidential election and rule over the subdued nation as a CommunIslamic dictator with an iron fist.  And now, with this so-called “hurricane” meme being pushed on a credulous nation by Obama’s lapdogs in the mainstream, complete with photoshopped pictures of wind, rain, and eroded beaches and cheap Dan Rather-style videos of fake weather-buffeted reporters, <i>giving Obama the perfect excuse to cancel the election next week</i>, absolutely no one has managed to put two and two together?  No one thinks this is the perfectly-timed storm to put an end American democracy?  No one has even suggested that the man of mysterious birth who could make the oceans stop rising, <i>and has now reportedly summoned the ocean’s wrath in a suspiciously timely manner</i>, is not the bastard son of Poseidon?</p><p>Conspiracy theorists, you make me sad.  A very poor showing all around, I’m sorry to say.</p></div>",
  "content_text": "For literally years, I’ve been hearing rumors concerning how Obama was going to cancel the presidential election and rule over the subdued nation as a CommunIslamic dictator with an iron fist.  And now, with this so-called “hurricane” meme being pushed on a credulous nation by Obama’s lapdogs in the mainstream, complete with photoshopped pictures of wind, rain, and eroded beaches and cheap Dan Rather-style videos of fake weather-buffeted reporters,\ngiving Obama the perfect excuse to cancel the election next week\n, absolutely no one has managed to put two and two together?  No one thinks this is the perfectly-timed storm to put an end American democracy?  No one has even suggested that the man of mysterious birth who could make the oceans stop rising,\nand has now reportedly summoned the ocean’s wrath in a suspiciously timely manner\n, is not the bastard son of Poseidon?\nConspiracy theorists, you make me sad.  A very poor showing all around, I’m sorry to say.",
  "tags": [
    "conspiracy",
    "politics"
  ],
  "categories": [],
  "sitemap_lastmod": "2012-10-30T18:00:00+00:00"
}