{
  "url": "https://voxday.net/2012/10/05/corrupt-like-statistician/",
  "scraped_at": "2025-12-14T05:04:47.910796",
  "title": "Corrupt like a statistician",
  "date_display": "October 5, 2012",
  "date_iso": "2012-10-05T18:22:00+00:00",
  "date_from_url": "2012-10-05",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>I find it amusing that everyone is so skeptical of modern macroeconomic statistics that the Obama administration <a href=\"http://finance.yahoo.com/news/us-jobless-rate-falls-7-123110416.html\">is preemptively defending itself</a> against suspicions of statistical shenanigans:</p><blockquote class=\"tr_bq\"><p> The U.S. unemployment rate fell to 7.8 percent last month, dropping<br> below 8 percent for the first time in nearly four years and giving<br> President Barack Obama a potential boost with the election a month away.  The rate declined from 8.1 percent because the number of people who said<br> they were employed soared by 873,000 — an encouraging sign for an<br> economy that’s been struggling to create enough jobs.</br></br></br></br></p><p>Labor Secretary Hilda Solis was asked on CNBC about suspicions that<br> the Obama administration might have skewed the jobs numbers to aid<br> Obama’s re-election prospects. “I’m insulted when I hear that because we have a<br> very professional civil service,” Solis said. “I have the highest<br> regard for our professionals that do the calculations at the (Bureau of<br> Labor Statistics). They are trained economists.”</br></br></br></br></br></p></blockquote><p> Ms Soldis would have been more convincing had she feigned being insulted and insisted that the professional for whom she has the highest regard are trained circus clowns.  As I showed in RGD, the margin of reported error between one report and its subsequent revision is often larger than the difference between economic growth and contraction.  In the case of the BLS, the story being pushed is that the “number of unemployed Americans is now 12.1 million, the fewest since January 2009.”</p><p>What they’re leaving out is that “unemployed” is a technical term that does not mean “not working”, as the Employment-Population Ratio has declined from 60.6 to 58.7 during that time.  This means at least 5.9 million more Americans are not working than were not working in January 2009.</p></div>",
  "content_text": "I find it amusing that everyone is so skeptical of modern macroeconomic statistics that the Obama administration\nis preemptively defending itself\nagainst suspicions of statistical shenanigans:\nThe U.S. unemployment rate fell to 7.8 percent last month, dropping\nbelow 8 percent for the first time in nearly four years and giving\nPresident Barack Obama a potential boost with the election a month away.  The rate declined from 8.1 percent because the number of people who said\nthey were employed soared by 873,000 — an encouraging sign for an\neconomy that’s been struggling to create enough jobs.\nLabor Secretary Hilda Solis was asked on CNBC about suspicions that\nthe Obama administration might have skewed the jobs numbers to aid\nObama’s re-election prospects. “I’m insulted when I hear that because we have a\nvery professional civil service,” Solis said. “I have the highest\nregard for our professionals that do the calculations at the (Bureau of\nLabor Statistics). They are trained economists.”\nMs Soldis would have been more convincing had she feigned being insulted and insisted that the professional for whom she has the highest regard are trained circus clowns.  As I showed in RGD, the margin of reported error between one report and its subsequent revision is often larger than the difference between economic growth and contraction.  In the case of the BLS, the story being pushed is that the “number of unemployed Americans is now 12.1 million, the fewest since January 2009.”\nWhat they’re leaving out is that “unemployed” is a technical term that does not mean “not working”, as the Employment-Population Ratio has declined from 60.6 to 58.7 during that time.  This means at least 5.9 million more Americans are not working than were not working in January 2009.",
  "tags": [
    "economics"
  ],
  "categories": [],
  "sitemap_lastmod": "2012-10-05T17:22:00+00:00"
}