{
  "url": "https://voxday.net/2012/10/24/end-pretense/",
  "scraped_at": "2025-12-14T05:06:13.199817",
  "title": "End the pretense",
  "date_display": "October 24, 2012",
  "date_iso": "2012-10-24T19:33:00+00:00",
  "date_from_url": "2012-10-24",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>The UK’s central banker, Mervyn King, <a href=\"http://www.telegraph.co.uk/finance/newsbysector/banksandfinance/9628997/Sir-Mervyn-King-no-recovery-until-banks-recapitalise.html\">finally admits what was always apparent</a>.  One wonders how long it will take Helicopter Ben to do likewise:</p><div class=\"fourthPar\"><blockquote class=\"tr_bq\"><p> Warning that the next generation may have to live with the consequences of<br> past excesses “for a long time to come”, he said Britain’s banks needed to<br> drop the “pretence” that their debts will be repaid.</br></br></p><p>“I am not sure advanced economies in general will find it easy to get out of<br> their current predicament without creditors acknowledging further likely<br> losses, a significant writing down of asset values, and recapitalisation of<br> their financial systems,” he said.</br></br></br></p><p>“Only then will it be possible to return to a more normal provision of the<br> vital banking services so crucial to an economic recovery… Just as in<br> 2008, there is a deep reluctance to admit the extent of the<br> undercapitalisation of the banking system in parts of the industrialised<br> world.”</br></br></br></br></p><p>He compared the situation to the “pretence that debts could be repaid” in the<br> 1930s and added: “We must not repeat that mistake.”</br></p></blockquote></div><div class=\"fifthPar\"> They’ve already made the critical mistake, which was failing to shut down the UK’s zombie banks and attempting to prop them up with massive amounts of money printing, government-incentivized lending, and stock market pumping.  But further financial raping of the economy for the benefit of the banks isn’t going to restore them or the economy to health.</div></div>",
  "content_text": "The UK’s central banker, Mervyn King,\nfinally admits what was always apparent\n.  One wonders how long it will take Helicopter Ben to do likewise:\nWarning that the next generation may have to live with the consequences of\npast excesses “for a long time to come”, he said Britain’s banks needed to\ndrop the “pretence” that their debts will be repaid.\n“I am not sure advanced economies in general will find it easy to get out of\ntheir current predicament without creditors acknowledging further likely\nlosses, a significant writing down of asset values, and recapitalisation of\ntheir financial systems,” he said.\n“Only then will it be possible to return to a more normal provision of the\nvital banking services so crucial to an economic recovery… Just as in\n2008, there is a deep reluctance to admit the extent of the\nundercapitalisation of the banking system in parts of the industrialised\nworld.”\nHe compared the situation to the “pretence that debts could be repaid” in the\n1930s and added: “We must not repeat that mistake.”\nThey’ve already made the critical mistake, which was failing to shut down the UK’s zombie banks and attempting to prop them up with massive amounts of money printing, government-incentivized lending, and stock market pumping.  But further financial raping of the economy for the benefit of the banks isn’t going to restore them or the economy to health.",
  "tags": [
    "banks",
    "economics"
  ],
  "categories": [],
  "sitemap_lastmod": "2012-10-24T18:33:00+00:00"
}