{
  "url": "https://voxday.net/2012/10/31/endorsements/",
  "scraped_at": "2025-12-14T05:06:51.597728",
  "title": "Endorsements",
  "date_display": "October 31, 2012",
  "date_iso": "2012-10-31T10:32:00+00:00",
  "date_from_url": "2012-10-31",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>All right, now that we’ve seen <a href=\"http://www.milobookclub.com/2012/10/30/and-these-folks-are-encouraged-to-vote/\">the very entertaining justifications</a> presented by the cognitively challenged Obama voters, let’s see if the Dread Ilk can do any better.  For whom are you voting next week and why?  Alternatively, if you are not voting, what is your justification for your decision.</p><p>Stow the reactions to anyone else’s endorsement or reasoning, limit your comments to your own intended actions.  I’ll highlight what I consider to be some of the best and worst of them in a post tomorrow, and present my own endorsement for the presidential election.</p><p>On a tangential note, I found this to be easily the most interesting out of the 150+ endorsements there:</p><div class=\"comment-content\"><blockquote class=\"tr_bq\"><p> I have been undecided for a very, very long time. But I think this<br> thread is what finally made up my mind – after reading how many people<br> want Obama because they believe he won’t try to prevent Iran from going<br> nuclear. I’m endorsing Romney even though I’m angered by a lot of the<br> nonsense that comes out of the Republican Party, and even though I agree<br> with Obama on most things, especially health care and immigration<br> reform.</br></br></br></br></br></br></p><p>Why? Because my grandmother is a Holocaust survivor, and the<br> slaughter of her entire family was enabled, in part, by a policy of<br> wishful-thinking appeasement that thought any sacrifice was acceptable<br> to avoid war, and that the leader talking publicly about killing all the<br> Jews couldn’t possibly mean it seriously.</br></br></br></br></p><p>After World War II, as a 16-year-old without a single living person<br> in the world who knew her name, my grandmother moved to Israel, the only<br> country that would take her. Israel is where most of my relatives live<br> now. And much as I would love to, I can’t vote for the candidate who<br> seems likely to follow a policy of wishful-thinking appeasement while<br> Iran works on its nuclear arsenal and talks publicly about wiping<br> Israel’s six million Jews off the map.</br></br></br></br></br></br></p></blockquote><p>Translation: Obama has lost the Jews.  Their concern for Israel is trumping their domestic left-liberal concerns.  If those who “agree with Obama on most things” are now voting for Romney due to his tough talk on Iran, Obama is one and done.</p></div></div>",
  "content_text": "All right, now that we’ve seen\nthe very entertaining justifications\npresented by the cognitively challenged Obama voters, let’s see if the Dread Ilk can do any better.  For whom are you voting next week and why?  Alternatively, if you are not voting, what is your justification for your decision.\nStow the reactions to anyone else’s endorsement or reasoning, limit your comments to your own intended actions.  I’ll highlight what I consider to be some of the best and worst of them in a post tomorrow, and present my own endorsement for the presidential election.\nOn a tangential note, I found this to be easily the most interesting out of the 150+ endorsements there:\nI have been undecided for a very, very long time. But I think this\nthread is what finally made up my mind – after reading how many people\nwant Obama because they believe he won’t try to prevent Iran from going\nnuclear. I’m endorsing Romney even though I’m angered by a lot of the\nnonsense that comes out of the Republican Party, and even though I agree\nwith Obama on most things, especially health care and immigration\nreform.\nWhy? Because my grandmother is a Holocaust survivor, and the\nslaughter of her entire family was enabled, in part, by a policy of\nwishful-thinking appeasement that thought any sacrifice was acceptable\nto avoid war, and that the leader talking publicly about killing all the\nJews couldn’t possibly mean it seriously.\nAfter World War II, as a 16-year-old without a single living person\nin the world who knew her name, my grandmother moved to Israel, the only\ncountry that would take her. Israel is where most of my relatives live\nnow. And much as I would love to, I can’t vote for the candidate who\nseems likely to follow a policy of wishful-thinking appeasement while\nIran works on its nuclear arsenal and talks publicly about wiping\nIsrael’s six million Jews off the map.\nTranslation: Obama has lost the Jews.  Their concern for Israel is trumping their domestic left-liberal concerns.  If those who “agree with Obama on most things” are now voting for Romney due to his tough talk on Iran, Obama is one and done.",
  "tags": [
    "politics"
  ],
  "categories": [],
  "sitemap_lastmod": "2012-10-31T10:32:00+00:00"
}