{
  "url": "https://voxday.net/2012/10/12/europe-is-seriously-bankrup/",
  "scraped_at": "2025-12-14T05:05:15.080205",
  "title": "Europe is SERIOUSLY bankrupt",
  "date_display": "October 12, 2012",
  "date_iso": "2012-10-12T10:09:00+00:00",
  "date_from_url": "2012-10-12",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>This award <a href=\"http://www.bloomberg.com/news/2012-10-12/eu-wins-nobel-peace-prize-for-alliance-to-avoid-european-wars.html\">by the Nobel committee</a> strikes me as the equivalent of desperately rooting through the couch, searching for change to pay the repo man:</p><blockquote class=\"tr_bq\"><p> The European Union was awarded the Nobel Peace Prize, providing a feel-good moment for the economically distressed bloc at a time when its post-national vision is losing traction at home and abroad.  The accolade comes as the financial crisis threatens the EU’s signal achievement, the euro, and the rise of powers such as China, India and Brazil challenges the European model of rules-based cooperation with nation-states handing sovereign rights to a central authority.</p><p>“This is in a way a message to Europe that we should do everything we can to secure what has been achieved and move forward,” Thorbjoern Jagland, head of the Norwegian Nobel Committee, told reporters in Oslo after awarding the 8 million- krona ($1.2 million) prize. “We have to keep in mind what has been achieved on this continent and not let the continent go into disintegration again. We know what it means: the emergence of extremism and nationalism once again.”</p></blockquote><p>The Peace Prize has always been about mindless optimism.  But it used to concern itself with actual deeds and accomplishments.  Now, with the recent awards to President Barack “Seven Wars” Obama and the Euzis of the European Union, it looks more like the triumph of deranged wishful thinking than anything else.  And it does tend to confirm the opinion of long-time EU skeptics who always believed the purpose of the Union was to leash the German military rather than build a common market.</p><p>I found this to be <a href=\"http://blogs.telegraph.co.uk/news/iainmartin1/100184804/eu-winning-nobel-peace-prize-is-beyond-parody-like-knighting-fred-goodwin-in-the-middle-of-a-mad-boom/\">the most cogent take</a> on the absurdity:<i> </i></p><p><i>“Giving the EU a peace prize is at best premature, like knighting Sir<br> Fred Goodwin in the middle of the mad boom. We have no idea how the<br> experiment to create an anti-democratic federation will end. Hopefully<br> the answer is very peacefully, but when Greek protesters are wearing<br> Nazi uniforms, and Spanish youth unemployment is running at 50 per cent,<br> a look at history suggests there is always the possibility of a bumpy<br> landing.</br></br></br></br></br></br></i></p><p><i>Daftest of all is the notion that the EU itself has kept the peace.<br> It was the Allies led by the Americans, the Russians and the British who<br> defeated and disarmed the Germans in 1945. The German people then<br> underwent the most extraordinary reckoning, transforming their country<br> into an essentially pacifist society. The EU had very little to do with<br> it. Throughout that period it was Nato, led by the Americans and<br> British, which kept the peace in Western Europe.” </br></br></br></br></br></br></i></p></div>",
  "content_text": "This award\nby the Nobel committee\nstrikes me as the equivalent of desperately rooting through the couch, searching for change to pay the repo man:\nThe European Union was awarded the Nobel Peace Prize, providing a feel-good moment for the economically distressed bloc at a time when its post-national vision is losing traction at home and abroad.  The accolade comes as the financial crisis threatens the EU’s signal achievement, the euro, and the rise of powers such as China, India and Brazil challenges the European model of rules-based cooperation with nation-states handing sovereign rights to a central authority.\n“This is in a way a message to Europe that we should do everything we can to secure what has been achieved and move forward,” Thorbjoern Jagland, head of the Norwegian Nobel Committee, told reporters in Oslo after awarding the 8 million- krona ($1.2 million) prize. “We have to keep in mind what has been achieved on this continent and not let the continent go into disintegration again. We know what it means: the emergence of extremism and nationalism once again.”\nThe Peace Prize has always been about mindless optimism.  But it used to concern itself with actual deeds and accomplishments.  Now, with the recent awards to President Barack “Seven Wars” Obama and the Euzis of the European Union, it looks more like the triumph of deranged wishful thinking than anything else.  And it does tend to confirm the opinion of long-time EU skeptics who always believed the purpose of the Union was to leash the German military rather than build a common market.\nI found this to be\nthe most cogent take\non the absurdity:\n“Giving the EU a peace prize is at best premature, like knighting Sir\nFred Goodwin in the middle of the mad boom. We have no idea how the\nexperiment to create an anti-democratic federation will end. Hopefully\nthe answer is very peacefully, but when Greek protesters are wearing\nNazi uniforms, and Spanish youth unemployment is running at 50 per cent,\na look at history suggests there is always the possibility of a bumpy\nlanding.\nDaftest of all is the notion that the EU itself has kept the peace.\nIt was the Allies led by the Americans, the Russians and the British who\ndefeated and disarmed the Germans in 1945. The German people then\nunderwent the most extraordinary reckoning, transforming their country\ninto an essentially pacifist society. The EU had very little to do with\nit. Throughout that period it was Nato, led by the Americans and\nBritish, which kept the peace in Western Europe.”",
  "tags": [
    "EU",
    "trainwreck"
  ],
  "categories": [],
  "sitemap_lastmod": "2012-10-12T09:09:00+00:00"
}