{
  "url": "https://voxday.net/2012/10/11/evolution-and-potential-rabbi/",
  "scraped_at": "2025-12-14T05:05:09.609557",
  "title": "Evolution and a potential rabbit",
  "date_display": "October 11, 2012",
  "date_iso": "2012-10-11T10:54:00+00:00",
  "date_from_url": "2012-10-11",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>About five years ago, I publicly predicted that genetic science will eventually rule out the Neo-Darwinian Synthesis and the Theorum of Evolution by Natural Selection.  Now, it would appear that we have <a href=\"http://www.nature.com/news/dna-has-a-521-year-half-life-1.11555\">a potential mechanism</a> for doing precisely that without needing to discover J.S. Haldane’s hypothetical rabbits in the Precambrian:</p><blockquote class=\"tr_bq\"><p> Few researchers have given credence to claims that samples of<br> dinosaur DNA have survived to the present day, but no one knew just how<br> long it would take for genetic material to fall apart. Now, a study of<br> fossils found in New Zealand is laying the matter to rest — and putting<br> paid to hopes of cloning a <i>Tyrannosaurus rex</i>.</br></br></br></br></p><p>After cell death, enzymes start to break down the bonds<br> between the nucleotides that form the backbone of DNA, and<br> micro-organisms speed the decay. In the long run, however, reactions<br> with water are thought to be responsible for most bond degradation.<br> Groundwater is almost ubiquitous, so DNA in buried bone samples should,<br> in theory, degrade at a set rate.</br></br></br></br></br></p><p>By comparing the specimens’ ages and degrees of DNA degradation, the<br> researchers calculated that DNA has a half-life of 521 years. That means<br> that after 521 years, half of the bonds between nucleotides in the<br> backbone of a sample would have broken; after another 521 years half of<br> the remaining bonds would have gone; and so on.</br></br></br></br></p><p>The team predicts that even in a bone at an ideal<br> preservation temperature of −5 ºC, effectively every bond would be<br> destroyed after a maximum of 6.8 million years. The DNA would cease to<br> be readable much earlier — perhaps after roughly 1.5 million years, when<br> the remaining strands would be too short to give meaningful<br> information.</br></br></br></br></br></p></blockquote><p>Now, cloning a dinosaur or other ancient species from theoretically nonexistent DNA would not be a directly conclusive debunking of evolution, but would be a sufficiently devastating blow to the evolutionary timelines as to render it every bit as temporally dubious as it appeared when its earliest advocates were worrying about how the time-consuming process could have taken place in only 6,000 years.</p><p>I would be interested to hear from those who seriously subscribe to the theory of evolution and learn if, given this announcement of a 521-year DNA half-life, the successful cloning of a dinosaur known to be from a historical epoch well before the 2-million year readability limit would be enough to cause them to abandon their belief in the theory.  And if not, would the discovery of rabbit fossils in the Precambrian be enough to do it?</p></div>",
  "content_text": "About five years ago, I publicly predicted that genetic science will eventually rule out the Neo-Darwinian Synthesis and the Theorum of Evolution by Natural Selection.  Now, it would appear that we have\na potential mechanism\nfor doing precisely that without needing to discover J.S. Haldane’s hypothetical rabbits in the Precambrian:\nFew researchers have given credence to claims that samples of\ndinosaur DNA have survived to the present day, but no one knew just how\nlong it would take for genetic material to fall apart. Now, a study of\nfossils found in New Zealand is laying the matter to rest — and putting\npaid to hopes of cloning a\nTyrannosaurus rex\n.\nAfter cell death, enzymes start to break down the bonds\nbetween the nucleotides that form the backbone of DNA, and\nmicro-organisms speed the decay. In the long run, however, reactions\nwith water are thought to be responsible for most bond degradation.\nGroundwater is almost ubiquitous, so DNA in buried bone samples should,\nin theory, degrade at a set rate.\nBy comparing the specimens’ ages and degrees of DNA degradation, the\nresearchers calculated that DNA has a half-life of 521 years. That means\nthat after 521 years, half of the bonds between nucleotides in the\nbackbone of a sample would have broken; after another 521 years half of\nthe remaining bonds would have gone; and so on.\nThe team predicts that even in a bone at an ideal\npreservation temperature of −5 ºC, effectively every bond would be\ndestroyed after a maximum of 6.8 million years. The DNA would cease to\nbe readable much earlier — perhaps after roughly 1.5 million years, when\nthe remaining strands would be too short to give meaningful\ninformation.\nNow, cloning a dinosaur or other ancient species from theoretically nonexistent DNA would not be a directly conclusive debunking of evolution, but would be a sufficiently devastating blow to the evolutionary timelines as to render it every bit as temporally dubious as it appeared when its earliest advocates were worrying about how the time-consuming process could have taken place in only 6,000 years.\nI would be interested to hear from those who seriously subscribe to the theory of evolution and learn if, given this announcement of a 521-year DNA half-life, the successful cloning of a dinosaur known to be from a historical epoch well before the 2-million year readability limit would be enough to cause them to abandon their belief in the theory.  And if not, would the discovery of rabbit fossils in the Precambrian be enough to do it?",
  "tags": [
    "evolution"
  ],
  "categories": [],
  "sitemap_lastmod": "2012-10-11T09:54:00+00:00"
}