{
  "url": "https://voxday.net/2012/10/16/game-and-election/",
  "scraped_at": "2025-12-14T05:05:32.964976",
  "title": "Game and the election",
  "date_display": "October 16, 2012",
  "date_iso": "2012-10-16T12:55:00+00:00",
  "date_from_url": "2012-10-16",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>I try to keep the two blogs fairly separate these days, since a relatively small number of people are interested in both econ/religion/politics/literature on the one side and intersexual relations on the other.  Also, the intellectually ruthless approach utilized here tends to work better on matters more objective than the socio-sexual hierarchy.  However, there are times when the two perspectives come together as one, which was the case with a question from GK concerning why women have suddenly begun turning towards Mitt Romney in the presidential election.</p><p>My thought is based around one of the keys to understanding female behavior, which is that it is often<br> aversion-based.  Men find this difficult to understand because their<br> behavior tends to be positive, in the sense of “I want X, therefore I<br> will do Y.”  The aversion-based female pattern tends to be more oriented<br> towards “I don’t want X, therefore I will do Y”.  The increased female<br> support for Romney has little to do with Romney himself, much with less<br> his policies or Obama’s policies, but rather the collective socio-sexual<br> fury of a group of women duped.</br></br></br></br></br></br></br></p><p>Read the rest <a href=\"http://alphagameplan.blogspot.ch/2012/10/alpha-mail-game-and-election.html\">at Alpha Game</a>.</p></div>",
  "content_text": "I try to keep the two blogs fairly separate these days, since a relatively small number of people are interested in both econ/religion/politics/literature on the one side and intersexual relations on the other.  Also, the intellectually ruthless approach utilized here tends to work better on matters more objective than the socio-sexual hierarchy.  However, there are times when the two perspectives come together as one, which was the case with a question from GK concerning why women have suddenly begun turning towards Mitt Romney in the presidential election.\nMy thought is based around one of the keys to understanding female behavior, which is that it is often\naversion-based.  Men find this difficult to understand because their\nbehavior tends to be positive, in the sense of “I want X, therefore I\nwill do Y.”  The aversion-based female pattern tends to be more oriented\ntowards “I don’t want X, therefore I will do Y”.  The increased female\nsupport for Romney has little to do with Romney himself, much with less\nhis policies or Obama’s policies, but rather the collective socio-sexual\nfury of a group of women duped.\nRead the rest\nat Alpha Game\n.",
  "tags": [
    "Alpha Game",
    "politics"
  ],
  "categories": [],
  "sitemap_lastmod": "2012-10-16T11:55:00+00:00"
}