{
  "url": "https://voxday.net/2012/10/04/hence-lawyer-hate/",
  "scraped_at": "2025-12-14T05:04:43.886720",
  "title": "Hence the lawyer hate",
  "date_display": "October 4, 2012",
  "date_iso": "2012-10-04T16:02:00+00:00",
  "date_from_url": "2012-10-04",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>Susan Walsh asked me about <a href=\"http://www.hookingupsmart.com/2012/10/02/hookinguprealities/giving-hookup-culture-a-makeover/#comment-153842\">why I despise lawyers</a>:</p><blockquote class=\"tr_bq\"><p> Care to explain? I actually know a ton of married couples where both are lawyers, the dynamic is positive, the kids are high achieving, everyone seems to have good values. Lawyers marry and have families, and most of them do corporate law. Why the hate?</p></blockquote><p>Lawyers are among the most useless, parasitical, and unethical scum on the planet.  They are a shameless guild in the medieval sense that uses the government to erect artificial barriers to competition, they are fundamentally and intrinsically dishonest about what they do and for whom they work.  Talk to a lawyer sometime about what “the law” truly is… and if you can catch one being honest for a change, he’ll tell you “whatever a judge declares it to be”.</p><p>Nota bene: if one doesn’t know the difference between written law and case law, and understand how the latter trumps the former, it’s not even possible to have an informed opinion on the issue.</p><p>No one who works in an industry based on “billable hours” and charges<br> fees based on the time they’ve supposedly put in rather than concrete<br> results delivered can claim to be even remotely honest.  One thing I’ve<br> noticed in my dealings with lawyers in five countries is that if you<br> make the mistake of trying to hire a reputable, top-notch lawyer to<br> actually do something, the first thing he usually tries to do is <i>hire another lawyer to do the actual work for him</i>.</br></br></br></br></br></p><p>Now, the domesticated form of lawyer, the in-house counsel, can be all<br> right, mostly because they can’t pull all the usual stunts since<br> they’re on salary… even though they try to hire outside counsel every<br> time they’re not kept on a tight leash.</br></br></br></p><p>Finally, lawyers are the larval form of politicians.</p><p></p></div>",
  "content_text": "Susan Walsh asked me about\nwhy I despise lawyers\n:\nCare to explain? I actually know a ton of married couples where both are lawyers, the dynamic is positive, the kids are high achieving, everyone seems to have good values. Lawyers marry and have families, and most of them do corporate law. Why the hate?\nLawyers are among the most useless, parasitical, and unethical scum on the planet.  They are a shameless guild in the medieval sense that uses the government to erect artificial barriers to competition, they are fundamentally and intrinsically dishonest about what they do and for whom they work.  Talk to a lawyer sometime about what “the law” truly is… and if you can catch one being honest for a change, he’ll tell you “whatever a judge declares it to be”.\nNota bene: if one doesn’t know the difference between written law and case law, and understand how the latter trumps the former, it’s not even possible to have an informed opinion on the issue.\nNo one who works in an industry based on “billable hours” and charges\nfees based on the time they’ve supposedly put in rather than concrete\nresults delivered can claim to be even remotely honest.  One thing I’ve\nnoticed in my dealings with lawyers in five countries is that if you\nmake the mistake of trying to hire a reputable, top-notch lawyer to\nactually do something, the first thing he usually tries to do is\nhire another lawyer to do the actual work for him\n.\nNow, the domesticated form of lawyer, the in-house counsel, can be all\nright, mostly because they can’t pull all the usual stunts since\nthey’re on salary… even though they try to hire outside counsel every\ntime they’re not kept on a tight leash.\nFinally, lawyers are the larval form of politicians.",
  "tags": [
    "law"
  ],
  "categories": [],
  "sitemap_lastmod": "2012-10-04T15:02:00+00:00"
}