{
  "url": "https://voxday.net/2012/10/15/introducing-arts-of-dark-and-lig/",
  "scraped_at": "2025-12-14T05:05:27.496186",
  "title": "IntroducingArts of Dark and Light",
  "date_display": "October 15, 2012",
  "date_iso": "2012-10-15T13:00:00+00:00",
  "date_from_url": "2012-10-15",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p><a href=\"http://1.bp.blogspot.com/-2v-ARkk_BuE/UHvPPZ5dozI/AAAAAAAAAVI/mi_0u7IGXgo/s1600/AMB_480.jpg\" imageanchor=\"1\" style=\"clear: right; float: right; margin-bottom: 1em; margin-left: 1em;\"><img alt=\"the novella featuring Lodi\" border=\"0\" decoding=\"async\" fetchpriority=\"high\" height=\"320\" src=\"http://www.milobookclub.com/wp-content/uploads/2012/10/AMB_480.jpg\" title=\"A Magic Broken\" width=\"213\"/></a>It hasn’t exactly been any great mystery, but I am happy to finally be able to share exactly what I’ve been up to for the last year.  Last summer, after finishing <i>A Dance with Dragons</i>, I found myself deeply disappointed with what Mr. Martin, whose earlier work in the series I so enjoyed, had produced after making us all wait six years.  “Good Lord, even I could do better than that”, I thought, which may not, strictly speaking, actually be true, but regardless, that was the thought that struck me after slogging through 1,100 pages of tedious river journeys, Tyrion “humorously” falling off pigs, and being subjected to Important New Characters for approximately the 4,853rd time.  Being somewhat despondent about George Martin’s descent into Robert Jordan territory, I turned to other so-called epic writers, including Joe Abercrombie, R. Scott Bakker, Steve Erikson, Daniel Abraham, and Brandon Sanderson.  Some of their books were quite good, others somewhat less so, but in no case did any of them provide me with that same sense of EPIC and wanting to experience the depths of the world that Martin presented so effectively in the first three books of <i>A Song of Ice and Fire</i>.</p><p>So, I decided that I would write an epic novel and I would do it in one year.  It would be the same length as <i>A Game of Throne</i>s, it would be loosely based upon an interesting period in military history, (in case you didn’t realize it, the Wars of the Roses are the starting point for Martin’s series, Stark = York and Lannister = Lancaster), and its focus would be on story, world, and character.  Nothing else.  No cleverness, no preaching, no subtexts, no reinventing wheels, no larger lessons, no deep philosophical insights.  In reading all the various would-be epics, I realized that most of them suffered from trying to do more than simply tell a fascinating story, which was also a problem with most of my previously published fiction.  I assumed I would self-publish it, since obviously no one would want to publish such a monster, and I would set it in the world of <i>Summa Elvetica</i> since I rather liked that world, as did most of those who read that flawed, but interesting failure of an esoteric literary exercise.  However, to do so, I needed to get the permission of Marcher Lord Press, the publisher of <i>Summa</i>, and much to my surprise, Jeff not only loved the idea of an epic series set in Selenoth, he insisted that he would publish it, even if it turned out to be more than 1,000 pages.</p><p>Umberto Eco once said that he wrote <i>The Name of the Rose</i> because he wanted to murder a monk.  I decided to do him one better and begin by killing the Holy Father.  That sets the stage for a story that is large and sprawling and is inspired by the Roman Social War, which is a little known quasi-civil war that was arguably the most perilous situation the Roman Republic faced in between the Gauls laying siege to the Capitoline Hill in 390 BC and Caesar crossing the Rubicon.  Amorr isn’t Rome, of course, but the historical scenario provides the novel with a certain amount of structural verisimilitude that I have often found to be lacking in other books.</p><p><a href=\"http://4.bp.blogspot.com/-D5vUaBg7fFY/UHvVxc4PQNI/AAAAAAAAAVc/VprGTfLGmWY/s1600/ATOB_480.png\" imageanchor=\"1\" style=\"clear: left; float: left; margin-bottom: 1em; margin-right: 1em;\"><noscript><img border=\"0\" decoding=\"async\" height=\"320\" src=\"http://www.milobookclub.com/wp-content/uploads/2012/10/ATOB_480.png\" width=\"213\"/></noscript><img border=\"0\" class=\"lazyload\" data-src=\"http://www.milobookclub.com/wp-content/uploads/2012/10/ATOB_480.png\" decoding=\"async\" height=\"320\" src=\"data:image/svg+xml,%3Csvg%20xmlns=%22http://www.w3.org/2000/svg%22%20viewBox=%220%200%20213%20320%22%3E%3C/svg%3E\" width=\"213\"/></a>So, I’m very pleased to announce <i><b><a href=\"http://www.voxday.net/mart/ATOB_200.jpg\">A THRONE OF BONES</a></b></i>, the first novel in the series entitled <i>Arts of Dark and Light</i>, which will be published by Marcher Lord Press on December 1, 2012.  We’re not sure of the final page count yet, but at 295,000 words, I expect it to be well over 750 pages.  It will be available for $4.99 in ebook format and $34.99 in hardcover.  There will be no paperbacks, trade or mass-market.  Marcher Lord is accepting preorders for the hardcovers starting today; those who preorder will pay only $29.99 for the hardcover and they will also receive the ebook on December 1st.  (We can’t say precisely when the hardcovers will ship, except that it is expected to arrive with time to spare for Christmas.)  This preorder offer will be run from October 15th until November 30th.  Also, since I wanted to provide those who are potentially interested in the book a less esoteric introduction to the world of Selenoth than the one provided by <i>Summa Elvetica</i>, I am pleased to announce the publication today of <i><b><a href=\"http://www.amazon.com/A-Magic-Broken-ebook/dp/B009OP9G0C/ref=cm_cr_pr_product_top\">A MAGIC BROKEN</a></b></i>, which is a 50-page novella featuring two of the perspective characters from the novel.</p><p><i><a href=\"http://www.amazon.com/A-Magic-Broken-ebook/dp/B009OP9G0C/ref=cm_cr_pr_product_top\"><b>A MAGIC BROKEN</b></a></i> is available from Amazon for 99 cents and the reviews to date are mostly positive.  If you think you might be interested in <i>A Throne of Bones</i>, I would encourage giving the novella a whirl in the meantime.  Here are a few of the comments from the first reviewers:</p><ul><li>“a sword and sorcery tale with a cerebral bent”</li><li>“the two main characters are likable in their non-perfection”</li><li>“an entertaining, fast paced read”</li><li>“I found the story line to be unpredictable”</li><li>“The environment and characters are on par with the best of George R.R. Martin”</li><li>“Despite the number of twists it remains coherent and believable as they unfold”</li><li>“a masterful act of guile and misdirection reminiscent of the style of Umberto Eco” </li><li>“The world has a depth not found in much writing today.” </li><li>“the promise of it all leading somewhere grand and exciting is what interests me more than anything else”</li></ul><p>Also, and I would argue this is a strong point in its favor, there are no river journeys, no “amusing” porcine-related pratfalls, and no whining.  Actually, come to think of it, there is a little whining, but rest assured that the whiner speedily meets with a literary device that I devoutly wish Robert Jordan had utilized with regards to his character Rand al’Thor at an early stage in <i>The Wheel of Time</i>.  In my opinion, Chapter One would have been about right.</p><p>Thanks are in order to JartStar, who created the cover for <i>A Magic Broken</i> and may even do the map for <i>A Throne of Bones</i> if I ever get my act together and get him the information he needs, as well as Jamsco, whose determined interest in Lodi not only inspired the novella, but his inclusion in the larger work as well.  Thanks to Markku and the Original Cyberpunk, who between them made my foray into ebooks viable and without whom these books would never have been conceived.  I also appreciate the reviewers, <strike>15</strike> 20 of whom managed to read the novella and post their reviews over the weekend.  I’m very appreciative of Kirk DouPounce, who somehow managed to surpass the very high standard he’d set with <i>Summa </i>– <a href=\"http://www.blackgate.com/2012/10/15/art-and-argument-in-arts-of-dark-and-light/\">about which more later</a> – of Jeff Gerke of Marcher Lord, who was enthusiastic about taking on yet another ludicrous literary risk, and most of all, of Spacebunny and her encouragement of my efforts.</p></div>",
  "content_text": "It hasn’t exactly been any great mystery, but I am happy to finally be able to share exactly what I’ve been up to for the last year.  Last summer, after finishing\nA Dance with Dragons\n, I found myself deeply disappointed with what Mr. Martin, whose earlier work in the series I so enjoyed, had produced after making us all wait six years.  “Good Lord, even I could do better than that”, I thought, which may not, strictly speaking, actually be true, but regardless, that was the thought that struck me after slogging through 1,100 pages of tedious river journeys, Tyrion “humorously” falling off pigs, and being subjected to Important New Characters for approximately the 4,853rd time.  Being somewhat despondent about George Martin’s descent into Robert Jordan territory, I turned to other so-called epic writers, including Joe Abercrombie, R. Scott Bakker, Steve Erikson, Daniel Abraham, and Brandon Sanderson.  Some of their books were quite good, others somewhat less so, but in no case did any of them provide me with that same sense of EPIC and wanting to experience the depths of the world that Martin presented so effectively in the first three books of\nA Song of Ice and Fire\n.\nSo, I decided that I would write an epic novel and I would do it in one year.  It would be the same length as\nA Game of Throne\ns, it would be loosely based upon an interesting period in military history, (in case you didn’t realize it, the Wars of the Roses are the starting point for Martin’s series, Stark = York and Lannister = Lancaster), and its focus would be on story, world, and character.  Nothing else.  No cleverness, no preaching, no subtexts, no reinventing wheels, no larger lessons, no deep philosophical insights.  In reading all the various would-be epics, I realized that most of them suffered from trying to do more than simply tell a fascinating story, which was also a problem with most of my previously published fiction.  I assumed I would self-publish it, since obviously no one would want to publish such a monster, and I would set it in the world of\nSumma Elvetica\nsince I rather liked that world, as did most of those who read that flawed, but interesting failure of an esoteric literary exercise.  However, to do so, I needed to get the permission of Marcher Lord Press, the publisher of\nSumma\n, and much to my surprise, Jeff not only loved the idea of an epic series set in Selenoth, he insisted that he would publish it, even if it turned out to be more than 1,000 pages.\nUmberto Eco once said that he wrote\nThe Name of the Rose\nbecause he wanted to murder a monk.  I decided to do him one better and begin by killing the Holy Father.  That sets the stage for a story that is large and sprawling and is inspired by the Roman Social War, which is a little known quasi-civil war that was arguably the most perilous situation the Roman Republic faced in between the Gauls laying siege to the Capitoline Hill in 390 BC and Caesar crossing the Rubicon.  Amorr isn’t Rome, of course, but the historical scenario provides the novel with a certain amount of structural verisimilitude that I have often found to be lacking in other books.\nSo, I’m very pleased to announce\nA THRONE OF BONES\n, the first novel in the series entitled\nArts of Dark and Light\n, which will be published by Marcher Lord Press on December 1, 2012.  We’re not sure of the final page count yet, but at 295,000 words, I expect it to be well over 750 pages.  It will be available for $4.99 in ebook format and $34.99 in hardcover.  There will be no paperbacks, trade or mass-market.  Marcher Lord is accepting preorders for the hardcovers starting today; those who preorder will pay only $29.99 for the hardcover and they will also receive the ebook on December 1st.  (We can’t say precisely when the hardcovers will ship, except that it is expected to arrive with time to spare for Christmas.)  This preorder offer will be run from October 15th until November 30th.  Also, since I wanted to provide those who are potentially interested in the book a less esoteric introduction to the world of Selenoth than the one provided by\nSumma Elvetica\n, I am pleased to announce the publication today of\nA MAGIC BROKEN\n, which is a 50-page novella featuring two of the perspective characters from the novel.\nA MAGIC BROKEN\nis available from Amazon for 99 cents and the reviews to date are mostly positive.  If you think you might be interested in\nA Throne of Bones\n, I would encourage giving the novella a whirl in the meantime.  Here are a few of the comments from the first reviewers:\n“a sword and sorcery tale with a cerebral bent”\n“the two main characters are likable in their non-perfection”\n“an entertaining, fast paced read”\n“I found the story line to be unpredictable”\n“The environment and characters are on par with the best of George R.R. Martin”\n“Despite the number of twists it remains coherent and believable as they unfold”\n“a masterful act of guile and misdirection reminiscent of the style of Umberto Eco”\n“The world has a depth not found in much writing today.”\n“the promise of it all leading somewhere grand and exciting is what interests me more than anything else”\nAlso, and I would argue this is a strong point in its favor, there are no river journeys, no “amusing” porcine-related pratfalls, and no whining.  Actually, come to think of it, there is a little whining, but rest assured that the whiner speedily meets with a literary device that I devoutly wish Robert Jordan had utilized with regards to his character Rand al’Thor at an early stage in\nThe Wheel of Time\n.  In my opinion, Chapter One would have been about right.\nThanks are in order to JartStar, who created the cover for\nA Magic Broken\nand may even do the map for\nA Throne of Bones\nif I ever get my act together and get him the information he needs, as well as Jamsco, whose determined interest in Lodi not only inspired the novella, but his inclusion in the larger work as well.  Thanks to Markku and the Original Cyberpunk, who between them made my foray into ebooks viable and without whom these books would never have been conceived.  I also appreciate the reviewers,\n15\n20 of whom managed to read the novella and post their reviews over the weekend.  I’m very appreciative of Kirk DouPounce, who somehow managed to surpass the very high standard he’d set with\nSumma\n–\nabout which more later\n– of Jeff Gerke of Marcher Lord, who was enthusiastic about taking on yet another ludicrous literary risk, and most of all, of Spacebunny and her encouragement of my efforts.",
  "tags": [
    "books"
  ],
  "categories": [],
  "sitemap_lastmod": "2012-10-15T12:00:00+00:00"
}