{
  "url": "https://voxday.net/2012/10/17/iq-and-ivy-league/",
  "scraped_at": "2025-12-14T05:05:40.283742",
  "title": "IQ and the Ivy League",
  "date_display": "October 17, 2012",
  "date_iso": "2012-10-17T18:31:00+00:00",
  "date_from_url": "2012-10-17",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p> One of the interesting things about the self-identified intelligent individuals of the cognitive elite is how they commonly demonstrate that the failure to think results in much the same consequences as the inability to think correctly.</p><p>Now, most graduates of Ivy League universities genuinely believe that most highly intelligent people attend Ivy League schools.  But in much the same way that atheists confuse a higher average intelligence with a larger quantity of intelligent individuals, they are confusing a concentration of intelligent individuals with the overall quantity.</p><p>Let’s assume that every single individual at an Ivy League school is<br> Mensa-qualified.  That’s absurdly generous, of course, as anyone who has<br> ever been to an Ivy or conversed with more than a few Ivy League<br> graduates will know, but just to be conservative, we’ll assume that every single student enrolled at an Ivy posssses an IQ of 132+ and is therefore in the top 2 percent of intelligence. Now, note that the total Ivy<br> undergraduate enrollment is 59,561.</br></br></br></br></p><p>That is 0.32 percent of the 18,078,672<br> total U.S. undergraduate enrollment in 2010. That means, by even the most<br> generous and conservative estimate, (since not all Ivy undergrads are genuinely<br> Mensa-qualified and because the college-attending group has an average IQ a little above the 100 norm), there are at<br> least 5.25x MORE equally smart people, about 302,012, who are attending<br> state universities, community colleges, and other private colleges instead of Ivy League<br> universities.</br></br></br></br></br></br></p><p>I’d have to do a bit more research to come up with a more accurate number, but I would estimate that there are probably between 10x to 15x more smart people who did not attend an Ivy than did attend one.</p></div>",
  "content_text": "One of the interesting things about the self-identified intelligent individuals of the cognitive elite is how they commonly demonstrate that the failure to think results in much the same consequences as the inability to think correctly.\nNow, most graduates of Ivy League universities genuinely believe that most highly intelligent people attend Ivy League schools.  But in much the same way that atheists confuse a higher average intelligence with a larger quantity of intelligent individuals, they are confusing a concentration of intelligent individuals with the overall quantity.\nLet’s assume that every single individual at an Ivy League school is\nMensa-qualified.  That’s absurdly generous, of course, as anyone who has\never been to an Ivy or conversed with more than a few Ivy League\ngraduates will know, but just to be conservative, we’ll assume that every single student enrolled at an Ivy posssses an IQ of 132+ and is therefore in the top 2 percent of intelligence. Now, note that the total Ivy\nundergraduate enrollment is 59,561.\nThat is 0.32 percent of the 18,078,672\ntotal U.S. undergraduate enrollment in 2010. That means, by even the most\ngenerous and conservative estimate, (since not all Ivy undergrads are genuinely\nMensa-qualified and because the college-attending group has an average IQ a little above the 100 norm), there are at\nleast 5.25x MORE equally smart people, about 302,012, who are attending\nstate universities, community colleges, and other private colleges instead of Ivy League\nuniversities.\nI’d have to do a bit more research to come up with a more accurate number, but I would estimate that there are probably between 10x to 15x more smart people who did not attend an Ivy than did attend one.",
  "tags": [
    "education",
    "trainwreck"
  ],
  "categories": [],
  "sitemap_lastmod": "2012-10-17T17:31:00+00:00"
}