{
  "url": "https://voxday.net/2012/10/27/john-scalzi-is-rapis/",
  "scraped_at": "2025-12-14T05:06:31.270859",
  "title": "John Scalzi is a rapist",
  "date_display": "October 27, 2012",
  "date_iso": "2012-10-27T21:35:00+00:00",
  "date_from_url": "2012-10-27",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>Now, I was aware that the man had a twisted side to him, but it is really rather remarkable to see John Scalzi so openly admit on his blog that <a href=\"http://whatever.scalzi.com/2012/10/25/a-fan-letter-to-certain-conservative-politicians/\">he has raped women</a>:</p><blockquote class=\"tr_bq\"><p> “I’m a rapist. I’m one of those men who likes to force myself on women without their consent or desire and then batter them sexually. The details of how I do this are not particularly important at the moment — although I love when you try to make distinctions about “forcible rape” or “legitimate rape” because that gives me all sorts of wiggle room — but I will tell you one of the details about why I do it: I like to control women and, also and independently, I like to remind them how little control they have.” – John Scalzi, 25 October 2012</p></blockquote><p> I wonder if the SFWA will be concerned that their current president is an admitted rapist or if they’ll take the approach towards him that NOW and the other feminist groups did towards Bill Clinton.  Of course, unlike Scalzi, Clinton never admitted to being a rapist.</p><p>Wait, he claims his confession is <i>satire</i>?  Well, that might fool anyone unfamiliar with the concept of blown cover as cover.  But even if we were to take him at his word to not take him at his word, where is the satire?  Satire is supposed to be ironic, but where is the irony? What is being exaggerated?  Given that a) one-third of all forcible rapists are black, and, b) blacks heavily support the Democratic party while whites are fairly evenly split, the statistics indicate that it is very nearly twice as likely a rapist would be inclined to write a fan letter to a <i>Democratic </i>politician rather than to a conservative Republican politician.  This isn’t irony, this is pseudo-ironic left-liberal fantasy.</p><p>Perhaps the satire is to be found in Scalzi’s implication that living human beings created without consent of the mother do not merit any of the legal protections and rights afforded all other human beings.  That must be it!  After all, the assertion that certain classes of homo sapiens sapiens are defined as not human isn’t merely a scientifically absurd proposition, but one historically known to be lethally dangerous.</p></div>",
  "content_text": "Now, I was aware that the man had a twisted side to him, but it is really rather remarkable to see John Scalzi so openly admit on his blog that\nhe has raped women\n:\n“I’m a rapist. I’m one of those men who likes to force myself on women without their consent or desire and then batter them sexually. The details of how I do this are not particularly important at the moment — although I love when you try to make distinctions about “forcible rape” or “legitimate rape” because that gives me all sorts of wiggle room — but I will tell you one of the details about why I do it: I like to control women and, also and independently, I like to remind them how little control they have.” – John Scalzi, 25 October 2012\nI wonder if the SFWA will be concerned that their current president is an admitted rapist or if they’ll take the approach towards him that NOW and the other feminist groups did towards Bill Clinton.  Of course, unlike Scalzi, Clinton never admitted to being a rapist.\nWait, he claims his confession is\nsatire\n?  Well, that might fool anyone unfamiliar with the concept of blown cover as cover.  But even if we were to take him at his word to not take him at his word, where is the satire?  Satire is supposed to be ironic, but where is the irony? What is being exaggerated?  Given that a) one-third of all forcible rapists are black, and, b) blacks heavily support the Democratic party while whites are fairly evenly split, the statistics indicate that it is very nearly twice as likely a rapist would be inclined to write a fan letter to a\nDemocratic\npolitician rather than to a conservative Republican politician.  This isn’t irony, this is pseudo-ironic left-liberal fantasy.\nPerhaps the satire is to be found in Scalzi’s implication that living human beings created without consent of the mother do not merit any of the legal protections and rights afforded all other human beings.  That must be it!  After all, the assertion that certain classes of homo sapiens sapiens are defined as not human isn’t merely a scientifically absurd proposition, but one historically known to be lethally dangerous.",
  "tags": [
    "freakshow",
    "McRapey"
  ],
  "categories": [],
  "sitemap_lastmod": "2012-10-27T20:35:00+00:00"
}