{
  "url": "https://voxday.net/2012/10/22/la-responsabilita-della-scientista/",
  "scraped_at": "2025-12-14T05:05:58.536266",
  "title": "La responsabilità della scientista",
  "date_display": "October 22, 2012",
  "date_iso": "2012-10-22T19:51:00+00:00",
  "date_from_url": "2012-10-22",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>Avanti azzurri!  Much to the shock and horror of the world’s scientists, Italy holds seven “experts” accountable <a href=\"http://www.myfoxdc.com/story/19882019/italian-court-convicts-7-for-no-quake-warning\">for their criminal negligence</a>:</p><blockquote class=\"tr_bq\"><p> An Italian court convicted seven scientists and experts of manslaughter<br> on Monday for failing to adequately warn citizens before an earthquake<br> struck central Italy in 2009, killing more than 300 people.  The<br> court in L’Aquila also sentenced the defendants to six years in prison.<br> Each one is a member of the national Great Risks Commission.</br></br></br></br></p><p>Scientists worldwide had decried the trial as<br> ridiculous, contending that science has no reliable way of predicting<br> earthquakes.  Among those convicted were some of Italy’s most<br> prominent and internationally respected seismologists and geological<br> experts, including Enzo Boschi, former head of the national Institute of<br> Geophysics and Volcanology. </br></br></br></br></br></p></blockquote><p> It’s both fascinating and informative, isn’t it.  Scientists are absolutely certain that the science is settled and they are more than willing to declare what laws should be passed, what classes should be taught, and what massive economic interventions and intrusions on individual freedom should be suffered due to the absolute reliability of their scientific knowledge.</p><p>But hold them personally responsible for their predictions and declarations?  Well, that’s an outrage!  Science isn’t actually expected to be reliable, after all!  I look forward to seeing climate scientists being similarly prosecuted one day for the complete failure of their predictive models.  The evolutionary biologists should be safe, unfortunately, since they don’t even have any predictive models.</p></div>",
  "content_text": "Avanti azzurri!  Much to the shock and horror of the world’s scientists, Italy holds seven “experts” accountable\nfor their criminal negligence\n:\nAn Italian court convicted seven scientists and experts of manslaughter\non Monday for failing to adequately warn citizens before an earthquake\nstruck central Italy in 2009, killing more than 300 people.  The\ncourt in L’Aquila also sentenced the defendants to six years in prison.\nEach one is a member of the national Great Risks Commission.\nScientists worldwide had decried the trial as\nridiculous, contending that science has no reliable way of predicting\nearthquakes.  Among those convicted were some of Italy’s most\nprominent and internationally respected seismologists and geological\nexperts, including Enzo Boschi, former head of the national Institute of\nGeophysics and Volcanology.\nIt’s both fascinating and informative, isn’t it.  Scientists are absolutely certain that the science is settled and they are more than willing to declare what laws should be passed, what classes should be taught, and what massive economic interventions and intrusions on individual freedom should be suffered due to the absolute reliability of their scientific knowledge.\nBut hold them personally responsible for their predictions and declarations?  Well, that’s an outrage!  Science isn’t actually expected to be reliable, after all!  I look forward to seeing climate scientists being similarly prosecuted one day for the complete failure of their predictive models.  The evolutionary biologists should be safe, unfortunately, since they don’t even have any predictive models.",
  "tags": [
    "law",
    "science",
    "trainwreck"
  ],
  "categories": [],
  "sitemap_lastmod": "2012-10-22T18:51:00+00:00"
}