{
  "url": "https://voxday.net/2012/10/23/let-science-be-silen/",
  "scraped_at": "2025-12-14T05:06:02.205200",
  "title": "Let Science be silent",
  "date_display": "October 23, 2012",
  "date_iso": "2012-10-23T10:09:00+00:00",
  "date_from_url": "2012-10-23",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>There is an wise old saying that I very much attempt to apply to life, the universe, and everything.  <i>“Let Reason be silent when Experience gainsays it.”</i>  In this postmodern scientific age, we very much require a new aphorism.  <b> </b></p><p><i><b>Let Science be silent when it cannot predict future events.</b>  </i></p><p>The fear and outrage being expressed in light of the conviction of the Italian geologists who are guilty of manslaughter at L’Aquila are entirely misplaced, as it is not science that is being found guilty, but rather, the abuse of the common man’s faith in science by scientists.  Consider the facts of the case, <a href=\"http://www.nature.com/news/2011/110914/full/477264a.html\">as described by Nature</a>, a publication that can hardly be considered hostile to science:</p><blockquote class=\"tr_bq\"><p> The indictments have drawn global condemnation. The American<br> Geophysical Union and the American Association for the Advancement of<br> Science (AAAS), both in Washington DC, issued statements in support of<br> the Italian defendants. In an open letter to Napolitano, for example,<br> the AAAS said it was “unfair and naive” of local prosecutors to charge<br> the men for failing “to alert the population of L’Aquila of an impending<br> earthquake”. And last May, when Italian magistrate Giuseppe Gargarella<br> ruled at a preliminary hearing that the scientists would have to stand<br> trial this September, the Italian blogosphere lit up with lamentation<br> and defence lawyers greeted the decision with disbelief….</br></br></br></br></br></br></br></br></br></p><p>The view from L’Aquila, however, is quite different. Prosecutors and<br> the families of victims alike say that the trial has nothing to do with<br> the ability to predict earthquakes, and everything to do with the<br> failure of government-appointed scientists serving on an advisory panel<br> to adequately evaluate, and then communicate, the potential risk to the<br> local population. The charges, detailed in a 224-page document filed by<br> Picuti, allege that members of the National Commission for Forecasting<br> and Predicting Great Risks, who held a special meeting in L’Aquila the<br> week before the earthquake, provided “incomplete, imprecise, and<br> contradictory information” to a public that had been unnerved by months<br> of persistent, low-level tremors. Picuti says that the commission was<br> more interested in pacifying the local population than in giving clear<br> advice about earthquake preparedness.</br></br></br></br></br></br></br></br></br></br></br></br></p><p>“I’m not crazy,” Picuti says. “I know they can’t predict<br> earthquakes. The basis of the charges is not that they didn’t predict<br> the earthquake. As functionaries of the state, they had certain duties<br> imposed by law: to evaluate and characterize the risks that were present<br> in L’Aquila.” Part of that risk assessment, he says, should have<br> included the density of the urban population and the known fragility of<br> many ancient buildings in the city centre. “They were obligated to<br> evaluate the degree of risk given all these factors,” he says, “and they<br> did not.”</br></br></br></br></br></br></br></br></p><p>“This<br> isn’t a trial against science,” insists Vittorini, who is a civil party<br> to the suit. But he says that a persistent message from authorities of<br> “Be calm, don’t worry”, and a lack of specific advice, deprived him and<br> others of an opportunity to make an informed decision about what to do<br> on the night of the earthquake. “That’s why I feel betrayed by science,”<br> he says. “Either they didn’t know certain things, which is a problem,<br> or they didn’t know how to communicate what they did know, which is also<br> a problem.”</br></br></br></br></br></br></br></br></p></blockquote><p>The article and the account it provides of the fate of the Vittorini family is damning to guilty geologists.  It is clear that the Italian families resident there no longer abided by their traditional custom of clearing out of their houses when there were tremors, primarily due to the assurances they received from the National Commission, which is why the death toll was larger than it would have been if it hadn’t been for those assurances.  The defenders of the scientists around the world are observably bending the truth, even lying, for claiming that science is on trial or that the basis of the charges are that they failed to do the impossible by not “pinpointing the time, location and strength of a future earthquake in the short term”, as <i>Nature </i>puts it.</p><p>As the prosecutor points out, the basis of the charges is not that the scientists didn’t predict the earthquake, but rather that they did not fulfill their legal duties to perform a proper risk assessment.  Moreover, if it is impossible to predict an earthquake, then how could any honest geologist accept a paid position on a government body called the National Commission for Forecasting<br> and Predicting Great Risks?  If you know you can’t do the job required, then you had better not accept it in the first place.</br></p><p>I have to disagree with <a href=\"http://pjmedia.com/instapundit/155098/\">Instapundit’s take</a> on the matter.  He sees this Italian attempt to hold scientists accountable for engaging in unscientific activity that led directly to great loss of life as creating “incentives for scientists to leave Italy and<br> to avoid giving any sort of earthquake advice to the Italian government.<br> I predict a run of bad luck.”</br></br></p><p>First, I note the inapplicability of the quote to the situation.  Heinlein was talking about entrepreneurs and technological and conceptual innovators when he described his “extremely small minority, frequently despised, often condemned, and almost always opposed by all right-thinking people”.  He most certainly wasn’t describing publicly acclaimed, government-funded individuals hailed as the nation’s “most respected geophysicists”.</p><p>Second, I very much doubt Italy will have any trouble at all finding top-credentialed scientists to continue accepting government funding.  And to the extent that those scientists learn to keep their mouths shut about things they can neither predict with any reasonable accuracy nor support with credible scientific evidence, that would be an entirely desirable advancement from the current state of scientistry, which so often attempts to confuse credentialed democracy and amateur editing for genuine scientody.</p></div>",
  "content_text": "There is an wise old saying that I very much attempt to apply to life, the universe, and everything.\n“Let Reason be silent when Experience gainsays it.”\nIn this postmodern scientific age, we very much require a new aphorism.\nLet Science be silent when it cannot predict future events.\nThe fear and outrage being expressed in light of the conviction of the Italian geologists who are guilty of manslaughter at L’Aquila are entirely misplaced, as it is not science that is being found guilty, but rather, the abuse of the common man’s faith in science by scientists.  Consider the facts of the case,\nas described by Nature\n, a publication that can hardly be considered hostile to science:\nThe indictments have drawn global condemnation. The American\nGeophysical Union and the American Association for the Advancement of\nScience (AAAS), both in Washington DC, issued statements in support of\nthe Italian defendants. In an open letter to Napolitano, for example,\nthe AAAS said it was “unfair and naive” of local prosecutors to charge\nthe men for failing “to alert the population of L’Aquila of an impending\nearthquake”. And last May, when Italian magistrate Giuseppe Gargarella\nruled at a preliminary hearing that the scientists would have to stand\ntrial this September, the Italian blogosphere lit up with lamentation\nand defence lawyers greeted the decision with disbelief….\nThe view from L’Aquila, however, is quite different. Prosecutors and\nthe families of victims alike say that the trial has nothing to do with\nthe ability to predict earthquakes, and everything to do with the\nfailure of government-appointed scientists serving on an advisory panel\nto adequately evaluate, and then communicate, the potential risk to the\nlocal population. The charges, detailed in a 224-page document filed by\nPicuti, allege that members of the National Commission for Forecasting\nand Predicting Great Risks, who held a special meeting in L’Aquila the\nweek before the earthquake, provided “incomplete, imprecise, and\ncontradictory information” to a public that had been unnerved by months\nof persistent, low-level tremors. Picuti says that the commission was\nmore interested in pacifying the local population than in giving clear\nadvice about earthquake preparedness.\n“I’m not crazy,” Picuti says. “I know they can’t predict\nearthquakes. The basis of the charges is not that they didn’t predict\nthe earthquake. As functionaries of the state, they had certain duties\nimposed by law: to evaluate and characterize the risks that were present\nin L’Aquila.” Part of that risk assessment, he says, should have\nincluded the density of the urban population and the known fragility of\nmany ancient buildings in the city centre. “They were obligated to\nevaluate the degree of risk given all these factors,” he says, “and they\ndid not.”\n“This\nisn’t a trial against science,” insists Vittorini, who is a civil party\nto the suit. But he says that a persistent message from authorities of\n“Be calm, don’t worry”, and a lack of specific advice, deprived him and\nothers of an opportunity to make an informed decision about what to do\non the night of the earthquake. “That’s why I feel betrayed by science,”\nhe says. “Either they didn’t know certain things, which is a problem,\nor they didn’t know how to communicate what they did know, which is also\na problem.”\nThe article and the account it provides of the fate of the Vittorini family is damning to guilty geologists.  It is clear that the Italian families resident there no longer abided by their traditional custom of clearing out of their houses when there were tremors, primarily due to the assurances they received from the National Commission, which is why the death toll was larger than it would have been if it hadn’t been for those assurances.  The defenders of the scientists around the world are observably bending the truth, even lying, for claiming that science is on trial or that the basis of the charges are that they failed to do the impossible by not “pinpointing the time, location and strength of a future earthquake in the short term”, as\nNature\nputs it.\nAs the prosecutor points out, the basis of the charges is not that the scientists didn’t predict the earthquake, but rather that they did not fulfill their legal duties to perform a proper risk assessment.  Moreover, if it is impossible to predict an earthquake, then how could any honest geologist accept a paid position on a government body called the National Commission for Forecasting\nand Predicting Great Risks?  If you know you can’t do the job required, then you had better not accept it in the first place.\nI have to disagree with\nInstapundit’s take\non the matter.  He sees this Italian attempt to hold scientists accountable for engaging in unscientific activity that led directly to great loss of life as creating “incentives for scientists to leave Italy and\nto avoid giving any sort of earthquake advice to the Italian government.\nI predict a run of bad luck.”\nFirst, I note the inapplicability of the quote to the situation.  Heinlein was talking about entrepreneurs and technological and conceptual innovators when he described his “extremely small minority, frequently despised, often condemned, and almost always opposed by all right-thinking people”.  He most certainly wasn’t describing publicly acclaimed, government-funded individuals hailed as the nation’s “most respected geophysicists”.\nSecond, I very much doubt Italy will have any trouble at all finding top-credentialed scientists to continue accepting government funding.  And to the extent that those scientists learn to keep their mouths shut about things they can neither predict with any reasonable accuracy nor support with credible scientific evidence, that would be an entirely desirable advancement from the current state of scientistry, which so often attempts to confuse credentialed democracy and amateur editing for genuine scientody.",
  "tags": [
    "law",
    "science"
  ],
  "categories": [],
  "sitemap_lastmod": "2012-10-23T09:09:00+00:00"
}