{
  "url": "https://voxday.net/2012/10/14/mailvox-alternative-mechanis/",
  "scraped_at": "2025-12-14T05:05:22.002102",
  "title": "Mailvox: an alternative mechanism",
  "date_display": "October 14, 2012",
  "date_iso": "2012-10-14T12:27:00+00:00",
  "date_from_url": "2012-10-14",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>Stephen J. takes a logical approach in arguing for evolution by natural selection:</p><blockquote class=\"tr_bq\"><p> While this question is going to sound snarky, I can only ask our host to<br> believe it is meant as a genuine inquiry and hope it is answered.</br></p><p>1)  Let us take as evidentially established the fact that species which existed in the past now exist no longer and are extinct.</p><p>2)<br> Let us take as evidentially established the fact that not all species<br> now extant existed at all times throughout the history of organic life;<br> if nothing else, we know for a fact Homo sapiens did not.</br></br></br></p><p>3)<br> Therefore, it must be possible for species which did not exist to come<br> into existence by some mechanism, just as species which do exist can go<br> extinct by any variety of mechanisms.</br></br></br></p><p>4)  If it is a fact that<br> new species can come into existence while others go extinct, by what<br> mechanism other than evolution through natural selection are these<br> species proposed to arise, and does that proposed mechanism explain more<br> of the observed evidence than TeNS?</br></br></br></br></p></blockquote><p>I don’t think it sounds snarky at all.  In fact, this is one of the first rationally competent attempts to defend evolution that I’ve ever seen presented on this blog.  Let’s look at his postulates and his logic and see where it leads us.</p><p>1)  I concur.  We know from historical documentary evidence that there are species that previously existed and are now extinct.  We can also infer from fossil evidence that there were a number of other species that previously existed and went extinct prior to the historical record.</p><p>2) I tend to agree and am willing to concur here for the sake of argument and on the basis of Occam’s Razor.  We certainly believe that <i>homo sapiens sapiens</i> did not exist from the beginning of the history of organic life on the basis of our current understanding of the geological and fossil records, but we cannot say that with the same degree of confidence that it is a fact in the sense that we say the Dodo is now extinct.  The problem is that there appear to be an increasing number of indications that the current geological and biological timelines are not going to hold up to future evidence, the claimed 521-year half-life of DNA being one of them.</p><p>3)  I concur, assuming (2) holds true.</p><p>4) Intelligent Genetic Manipulation is the mechanism that I propose.  And yes, I believe that explains more of the observed evidence than TENS, since IGM is a scientific proposition, a readily observed action, and a successful predictive model, whereas TENS is a philosophical proposition, an unobserved process, and an unsuccessful predictive model.</p><p>Now, this does not provide any basis for assuming the existence of a Creator God, or even declaring that TENS did not actually take place.  The logical fact of the matter is that even if TENS can be conclusively demonstrated to have taken place in various species, which has not happened despite more than 150 years of trying, <i>that doesn’t necessarily mean the process was sufficient to produce Man</i>.  If one contemplates the biological differences between ape and man, the vast leap in cognitive capacity taking place in a relatively small sum of generational cycles from the proposed common ancestor in comparison with the timelines supposedly required for other, less complicated evolutionary changes, the logic suggests – though it does not prove – that some degree of purposeful genetic manipulation has likely taken place at various points in the origin of the species and the development of homo sapiens sapiens.</p><p>I’m not talking about Intelligent Design, but rather intelligent editing.  And the interesting thing is that IGM should be an increasingly falsifiable concept as genetic science continues to improve.  Only recently have we learned that junk DNA serves a purpose; even though we have sequenced various genomes, we haven’t yet understood how the code works or fully comprehended the various ways it can be manipulated.  As our understanding grows, we should be able to develop an ability to recognize patterns that indicate purposeful alterations in the code have been made.</p><p>Now, I realize how crazy this probably sounds, especially in light of my argument that Man cannot easily distinguish between God, god, demon, and alien.  But that is where Stephen’s reasonably sound logic takes us. </p></div>",
  "content_text": "Stephen J. takes a logical approach in arguing for evolution by natural selection:\nWhile this question is going to sound snarky, I can only ask our host to\nbelieve it is meant as a genuine inquiry and hope it is answered.\n1)  Let us take as evidentially established the fact that species which existed in the past now exist no longer and are extinct.\n2)\nLet us take as evidentially established the fact that not all species\nnow extant existed at all times throughout the history of organic life;\nif nothing else, we know for a fact Homo sapiens did not.\n3)\nTherefore, it must be possible for species which did not exist to come\ninto existence by some mechanism, just as species which do exist can go\nextinct by any variety of mechanisms.\n4)  If it is a fact that\nnew species can come into existence while others go extinct, by what\nmechanism other than evolution through natural selection are these\nspecies proposed to arise, and does that proposed mechanism explain more\nof the observed evidence than TeNS?\nI don’t think it sounds snarky at all.  In fact, this is one of the first rationally competent attempts to defend evolution that I’ve ever seen presented on this blog.  Let’s look at his postulates and his logic and see where it leads us.\n1)  I concur.  We know from historical documentary evidence that there are species that previously existed and are now extinct.  We can also infer from fossil evidence that there were a number of other species that previously existed and went extinct prior to the historical record.\n2) I tend to agree and am willing to concur here for the sake of argument and on the basis of Occam’s Razor.  We certainly believe that\nhomo sapiens sapiens\ndid not exist from the beginning of the history of organic life on the basis of our current understanding of the geological and fossil records, but we cannot say that with the same degree of confidence that it is a fact in the sense that we say the Dodo is now extinct.  The problem is that there appear to be an increasing number of indications that the current geological and biological timelines are not going to hold up to future evidence, the claimed 521-year half-life of DNA being one of them.\n3)  I concur, assuming (2) holds true.\n4) Intelligent Genetic Manipulation is the mechanism that I propose.  And yes, I believe that explains more of the observed evidence than TENS, since IGM is a scientific proposition, a readily observed action, and a successful predictive model, whereas TENS is a philosophical proposition, an unobserved process, and an unsuccessful predictive model.\nNow, this does not provide any basis for assuming the existence of a Creator God, or even declaring that TENS did not actually take place.  The logical fact of the matter is that even if TENS can be conclusively demonstrated to have taken place in various species, which has not happened despite more than 150 years of trying,\nthat doesn’t necessarily mean the process was sufficient to produce Man\n.  If one contemplates the biological differences between ape and man, the vast leap in cognitive capacity taking place in a relatively small sum of generational cycles from the proposed common ancestor in comparison with the timelines supposedly required for other, less complicated evolutionary changes, the logic suggests – though it does not prove – that some degree of purposeful genetic manipulation has likely taken place at various points in the origin of the species and the development of homo sapiens sapiens.\nI’m not talking about Intelligent Design, but rather intelligent editing.  And the interesting thing is that IGM should be an increasingly falsifiable concept as genetic science continues to improve.  Only recently have we learned that junk DNA serves a purpose; even though we have sequenced various genomes, we haven’t yet understood how the code works or fully comprehended the various ways it can be manipulated.  As our understanding grows, we should be able to develop an ability to recognize patterns that indicate purposeful alterations in the code have been made.\nNow, I realize how crazy this probably sounds, especially in light of my argument that Man cannot easily distinguish between God, god, demon, and alien.  But that is where Stephen’s reasonably sound logic takes us.",
  "tags": [
    "evolution",
    "mailvox"
  ],
  "categories": [],
  "sitemap_lastmod": "2012-10-14T11:27:00+00:00"
}