{
  "url": "https://voxday.net/2012/10/08/mailvox-continuing-education/",
  "scraped_at": "2025-12-14T05:05:00.409182",
  "title": "Mailvox: continuing education",
  "date_display": "October 8, 2012",
  "date_iso": "2012-10-08T17:00:00+00:00",
  "date_from_url": "2012-10-08",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>Robwbright, Esq. continues to discover that the lawyer’s approach of attempting to poison the well isn’t the wisest tactic when dealing with a superintelligence:</p><blockquote class=\"tr_bq\"><p>  Is human superintelligence armed with facts &amp; logic a legitimate source of authority?</p><p>Before<br> you answer, allow me to appeal to another authority – higher than<br> either of us…  Note that God answers the above question “No”:  He<br> catches the wise in their own craftiness”; and again, “The LORD knows<br> the thoughts of the wise, that they are futile.”  and “Therefore let no<br> one boast in men.”</br></br></br></br></br></p><p>A wise (and pretty intelligent) man once said:  “But<br> may I never boast about anything except the cross of our Lord Jesus,<br> the Messiah, by which the world has been crucified to me, and I to the<br> world!</br></br></br></p><p>It is interesting that you always call out someone when<br> they appeal to their own authority, but you CONSTANTLY appeal to and<br> boast about your own superintelligence and consider that acceptable<br> behavior.</br></br></br></p><p>Will you directly answer the question “Yes” or “No”.  It should be a simple question for a superintelligence to answer.</p></blockquote><p>It most certainly is a simple question.  Is “human superintelligence armed with facts and logic” a legitimate source of authority?  No, of course not.  Neither are royal bloodlines, academic credentials, or guild licenses.  None of these things are conclusively determinative of the truth.  But what robwbright quite amusingly reveals in his attempt to impugn my credibility here is that <i>he doesn’t even know what an appeal to authority is</i>.</p><p>This is readily apparent due to his claim that I “CONSTANTLY” appeal to the authority of my own superintelligence.  This is absolutely and totally false.  I will go so far as to assert that I have never once appealed to the authority of my intelligence in the 11-year history of my WND column or the 9-year history of this blog.  I should welcome the citation of any evidence that purports to prove otherwise.</p><p>Now, it is certainly true that I rub the oft-demonstrated fact of my superior intelligence in the face of my critics, for the reason I have often explained.  Both the political Left and the militant atheists regularly resort to the logical fallacy of appealing to the authority of intelligence; in fact, atheists even utilize it in a bizarre and illogical argument against the existence of God.  My overt assertion and subsequent demonstration of an even higher degree of intelligence than most of them can muster thereby removes one of their favorite intellectual weapons from their arsenal and tends to make them look foolish when they attempt to use it to dismiss me in the manner that they dismiss so many others they attack.</p><p>This is why you will often see them theorizing that I must be crazy, because they are so attached to their logical fallacy that they literally cannot grasp that someone can be more intelligent than they are and nevertheless reject their left-liberal ideology or their godless scientism… even though it has been statistically demonstrated that there are more high IQ theists than atheists.  IQ-flaunting is a useful rhetorical device that trumps a common rhetorical argument, nothing more.  And it is obviously an effective one, as most of my critics eventually get around to complaining about it sooner or later.</p><p>What robwbright tried to do here is the clever legal tactic known as “I know you are but what am I?”.  This is the second time he has unsuccessfully tried to attack my intellectual credibility in defending the legal system against my charges of corruption, while repeatedly engaging in the logical fallacy of appealing to his own experience.  Because lawyers are hierarchical credentialists prone to thinking they are more intelligent than everyone else, they are particularly susceptible to the same rhetorical baiting that so easily discombobulates the leftists and the atheists.</p><p>No one who is truly intelligent ever appeals to that intelligence because he knows that there is always someone smarter out there, and because he is confident that he can make his logical case based on the relevant facts.  I’ve already shown how  logic dictates robwbright’s claim that legislative law always trumps interpretive rulings MUST be incorrect, given that a) there is a long and sordid history of interpretive rulings trumping legislative law, and, b) the obvious distinction between “an interpretive ruling based on legislative law” and “an interpretive ruling that the judge pretends to have been based on legislative law”.</p><p>Finally, I have two return questions for robwbright.  First, are you an Officer of the Court?  Second, when you are in the courtroom, is the law what the presiding judge declares it to be?</p></div>",
  "content_text": "Robwbright, Esq. continues to discover that the lawyer’s approach of attempting to poison the well isn’t the wisest tactic when dealing with a superintelligence:\nIs human superintelligence armed with facts & logic a legitimate source of authority?\nBefore\nyou answer, allow me to appeal to another authority – higher than\neither of us…  Note that God answers the above question “No”:  He\ncatches the wise in their own craftiness”; and again, “The LORD knows\nthe thoughts of the wise, that they are futile.”  and “Therefore let no\none boast in men.”\nA wise (and pretty intelligent) man once said:  “But\nmay I never boast about anything except the cross of our Lord Jesus,\nthe Messiah, by which the world has been crucified to me, and I to the\nworld!\nIt is interesting that you always call out someone when\nthey appeal to their own authority, but you CONSTANTLY appeal to and\nboast about your own superintelligence and consider that acceptable\nbehavior.\nWill you directly answer the question “Yes” or “No”.  It should be a simple question for a superintelligence to answer.\nIt most certainly is a simple question.  Is “human superintelligence armed with facts and logic” a legitimate source of authority?  No, of course not.  Neither are royal bloodlines, academic credentials, or guild licenses.  None of these things are conclusively determinative of the truth.  But what robwbright quite amusingly reveals in his attempt to impugn my credibility here is that\nhe doesn’t even know what an appeal to authority is\n.\nThis is readily apparent due to his claim that I “CONSTANTLY” appeal to the authority of my own superintelligence.  This is absolutely and totally false.  I will go so far as to assert that I have never once appealed to the authority of my intelligence in the 11-year history of my WND column or the 9-year history of this blog.  I should welcome the citation of any evidence that purports to prove otherwise.\nNow, it is certainly true that I rub the oft-demonstrated fact of my superior intelligence in the face of my critics, for the reason I have often explained.  Both the political Left and the militant atheists regularly resort to the logical fallacy of appealing to the authority of intelligence; in fact, atheists even utilize it in a bizarre and illogical argument against the existence of God.  My overt assertion and subsequent demonstration of an even higher degree of intelligence than most of them can muster thereby removes one of their favorite intellectual weapons from their arsenal and tends to make them look foolish when they attempt to use it to dismiss me in the manner that they dismiss so many others they attack.\nThis is why you will often see them theorizing that I must be crazy, because they are so attached to their logical fallacy that they literally cannot grasp that someone can be more intelligent than they are and nevertheless reject their left-liberal ideology or their godless scientism… even though it has been statistically demonstrated that there are more high IQ theists than atheists.  IQ-flaunting is a useful rhetorical device that trumps a common rhetorical argument, nothing more.  And it is obviously an effective one, as most of my critics eventually get around to complaining about it sooner or later.\nWhat robwbright tried to do here is the clever legal tactic known as “I know you are but what am I?”.  This is the second time he has unsuccessfully tried to attack my intellectual credibility in defending the legal system against my charges of corruption, while repeatedly engaging in the logical fallacy of appealing to his own experience.  Because lawyers are hierarchical credentialists prone to thinking they are more intelligent than everyone else, they are particularly susceptible to the same rhetorical baiting that so easily discombobulates the leftists and the atheists.\nNo one who is truly intelligent ever appeals to that intelligence because he knows that there is always someone smarter out there, and because he is confident that he can make his logical case based on the relevant facts.  I’ve already shown how  logic dictates robwbright’s claim that legislative law always trumps interpretive rulings MUST be incorrect, given that a) there is a long and sordid history of interpretive rulings trumping legislative law, and, b) the obvious distinction between “an interpretive ruling based on legislative law” and “an interpretive ruling that the judge pretends to have been based on legislative law”.\nFinally, I have two return questions for robwbright.  First, are you an Officer of the Court?  Second, when you are in the courtroom, is the law what the presiding judge declares it to be?",
  "tags": [
    "law"
  ],
  "categories": [],
  "sitemap_lastmod": "2012-10-08T16:00:00+00:00"
}