{
  "url": "https://voxday.net/2012/10/29/mailvox-logic-of-god-ii/",
  "scraped_at": "2025-12-14T05:06:42.478477",
  "title": "Mailvox: the logic of God II",
  "date_display": "October 29, 2012",
  "date_iso": "2012-10-29T17:00:00+00:00",
  "date_from_url": "2012-10-29",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>In which Passerby attempts to poke holes in <a href=\"http://www.milobookclub.com/2012/10/28/mailvox-logic-of-god/\">the logical argument demonstrating the irrationality of his position</a> concerning the simultaneous existence of evil and the nonexistence of God.</p><blockquote class=\"tr_bq\"><p> Well!  I wasn’t expecting an entire fresh post devoted to my challenge<br> in that other thread.  I’m so honored.  Pardon my late arrival.  Okay,<br> first off, VD, looks like you threw a gutter ball from your second<br> premise, as Riki-Tiki-Tavi already sensed.  Let’s have a look at it:</br></br></br></p><p><i>2.<br> The existent fact of wrongdoing necessarily requires that there is a<br> material universal standard of right and wrong by which actions can be<br> classified. </br></br></br></i></p><p>Incorrect.  The existent fact of wrongdoing/evil<br> does not require a material universal standard of right and wrong.  The<br> existent fact of wrongdoing is self-evident because the alternative is…<br> the nonexistence of wrongdoing.  Good luck making a sound argument for<br> the nonexistence of wrongdoing.  Think anyone can do it passably?  I<br> don’t and I suspect you don’t either.  So we should agree there.  That’s<br> point number one.</br></br></br></br></br></br></p></blockquote><p>Point number one is incorrect.  Notice here that Passerby is not only taking exception to my point, but to entire philosophies such as nihilism, existentialism, and, ironically enough, rational materialism.  His argument is surprisingly weak, based as it is on the self-evidence of wrongdoing.  Is it self-evident that stealing is wrong?  That not voting is wrong? </p><p>Consider how little sense his argument makes if we substitute a non-existent fact for wrongdoing/evil.  <i>The existent fact of unicorns<br> does not require a material universal standard of unicorns and not-unicorns.  The<br> existent fact of unicorns is self-evident because the alternative is…<br> the nonexistence of unicorns. </br></br></br></i></p><p>If we cannot tell the difference between a unicorn and a not-unicorn, then we cannot possibly declare that unicorns do or do not exist.  But if we have established the fact that unicorns do exist, we have necessarily established a material and universal standard for what a unicorn is and what a unicorn is not.  Therefore, point number one fails and the second step in the logical argument remains standing.</p><blockquote class=\"tr_bq\"><p> Point number two.  Another thing wrong<br> with this “necessary universal standard” claim of yours (I noticed you<br> used that word “standard” seventeen times in your post, so to continue<br> the bowling metaphor, it’s like your very bowling ball to bowl with,<br> without which… well, game over — but I’ll give you a dollar so you can<br> go play some Ms. PacMan) is that six billion people in the world could<br> have six billion different standards of wrongdoing, but everyone would<br> nonetheless agree that wrongdoing does exist in the world.</br></br></br></br></br></br></br></p><p>So<br> let’s imagine those six billion individuals’ six billion different<br> standards of wrongdoing can be each given a numerical value.  I’m not<br> saying it can ever actually be done, but just go with me here.  After<br> they’ve all been given a numerical value, they’re arranged in order on a<br> vertical meter with a red zone on the bottom and a green zone on the<br> top.  Put the meter on the lowest setting of “1”.  That setting belongs<br> to a guy who disagrees with all 5,999,999,999 people above him whom he<br> considers to be an increasing bunch of prissy Miss Manners types who see<br> wrongdoing in all kinds of ways he doesn’t.  But he at least sees one<br> instance of wrongdoing in the world and everyone above him agrees that<br> he at least got one right.  So it seems to me (I’m just now coming up<br> with this, but I’ll try to land this thing in one piece) that this<br> minimum setting of “1” is the standard, if anything, for the existence<br> of wrongdoing.  Below that is “0” which represents nonexistence of<br> wrongdoing.</br></br></br></br></br></br></br></br></br></br></br></br></br></br></br></p><p>Point being, our subjectivity is flawed, but it’s far<br> from useless!  There is, after all, communication and agreement.  It’s<br> precisely because of our limitation as trapped individuals of<br> subjectivity that science is the best idea we’ve ever come up with (or<br> happened upon) to make gains on objectivity.  To paraphrase Steven<br> Pinker, science is  our highest, purest expression of reason.<br> Objectivity is perhaps an unattainable goal, but we’ve seemingly made<br> lots of progress toward it given our technological conquests, our<br> steadily decreasing rate of violence in ever larger, more complex<br> populations, etc.  I say seemingly because a cosmic rug pulling could be<br> in store for us a la The Matrix at any time, but that caveat aside,<br> it’s our processes of communication, cooperation, record keeping,<br> rhetorical persuasion, experimentation, reason, science, etc. that we<br> arrive at standards of right and wrong be they amoral (e.g., math,<br> chemistry, physics) or moral.  And we arrive at them, to the extent we<br> do, through our own shared reasoning, thank you very much.  No divinity<br> needed or even evident. </br></br></br></br></br></br></br></br></br></br></br></br></br></br></br></br></p></blockquote><p>Point number two is not so much incorrect as irrelevant, bordering on a category error. In this section, Passerby fails to grasp that an objective standard is more than the sum of six billion subjective opinions, and in fact, no number of subjective opinions can produce an objective standard, by definition.  The more the standard is “influenced by personal feelings, interpretations, or prejudice”, the less objective it can be, regardless of whether those competing feelings, interpretations, and prejudices are harmonious or not.  Existent evil/wrongdoing requires a material and universal standard, even if our subjective experience of the objective reality is different in six billion different ways.</p><p>If the readers don’t mind indulging me in following Passerby on one of his tangents, I will add that Stephen Pinker is wrong about science as he is wrong about so many things.  Science is most certainly not the highest and purest expression of reason.  Not only is it not reason at all, it was specifically conceived, developed, and utilized to replace pure reason.  This is why Science is so often at odds with Philosophy as well as Religion; Science is nothing more than the systematic codification of experience.</p></div>",
  "content_text": "In which Passerby attempts to poke holes in\nthe logical argument demonstrating the irrationality of his position\nconcerning the simultaneous existence of evil and the nonexistence of God.\nWell!  I wasn’t expecting an entire fresh post devoted to my challenge\nin that other thread.  I’m so honored.  Pardon my late arrival.  Okay,\nfirst off, VD, looks like you threw a gutter ball from your second\npremise, as Riki-Tiki-Tavi already sensed.  Let’s have a look at it:\n2.\nThe existent fact of wrongdoing necessarily requires that there is a\nmaterial universal standard of right and wrong by which actions can be\nclassified.\nIncorrect.  The existent fact of wrongdoing/evil\ndoes not require a material universal standard of right and wrong.  The\nexistent fact of wrongdoing is self-evident because the alternative is…\nthe nonexistence of wrongdoing.  Good luck making a sound argument for\nthe nonexistence of wrongdoing.  Think anyone can do it passably?  I\ndon’t and I suspect you don’t either.  So we should agree there.  That’s\npoint number one.\nPoint number one is incorrect.  Notice here that Passerby is not only taking exception to my point, but to entire philosophies such as nihilism, existentialism, and, ironically enough, rational materialism.  His argument is surprisingly weak, based as it is on the self-evidence of wrongdoing.  Is it self-evident that stealing is wrong?  That not voting is wrong?\nConsider how little sense his argument makes if we substitute a non-existent fact for wrongdoing/evil.\nThe existent fact of unicorns\ndoes not require a material universal standard of unicorns and not-unicorns.  The\nexistent fact of unicorns is self-evident because the alternative is…\nthe nonexistence of unicorns.\nIf we cannot tell the difference between a unicorn and a not-unicorn, then we cannot possibly declare that unicorns do or do not exist.  But if we have established the fact that unicorns do exist, we have necessarily established a material and universal standard for what a unicorn is and what a unicorn is not.  Therefore, point number one fails and the second step in the logical argument remains standing.\nPoint number two.  Another thing wrong\nwith this “necessary universal standard” claim of yours (I noticed you\nused that word “standard” seventeen times in your post, so to continue\nthe bowling metaphor, it’s like your very bowling ball to bowl with,\nwithout which… well, game over — but I’ll give you a dollar so you can\ngo play some Ms. PacMan) is that six billion people in the world could\nhave six billion different standards of wrongdoing, but everyone would\nnonetheless agree that wrongdoing does exist in the world.\nSo\nlet’s imagine those six billion individuals’ six billion different\nstandards of wrongdoing can be each given a numerical value.  I’m not\nsaying it can ever actually be done, but just go with me here.  After\nthey’ve all been given a numerical value, they’re arranged in order on a\nvertical meter with a red zone on the bottom and a green zone on the\ntop.  Put the meter on the lowest setting of “1”.  That setting belongs\nto a guy who disagrees with all 5,999,999,999 people above him whom he\nconsiders to be an increasing bunch of prissy Miss Manners types who see\nwrongdoing in all kinds of ways he doesn’t.  But he at least sees one\ninstance of wrongdoing in the world and everyone above him agrees that\nhe at least got one right.  So it seems to me (I’m just now coming up\nwith this, but I’ll try to land this thing in one piece) that this\nminimum setting of “1” is the standard, if anything, for the existence\nof wrongdoing.  Below that is “0” which represents nonexistence of\nwrongdoing.\nPoint being, our subjectivity is flawed, but it’s far\nfrom useless!  There is, after all, communication and agreement.  It’s\nprecisely because of our limitation as trapped individuals of\nsubjectivity that science is the best idea we’ve ever come up with (or\nhappened upon) to make gains on objectivity.  To paraphrase Steven\nPinker, science is  our highest, purest expression of reason.\nObjectivity is perhaps an unattainable goal, but we’ve seemingly made\nlots of progress toward it given our technological conquests, our\nsteadily decreasing rate of violence in ever larger, more complex\npopulations, etc.  I say seemingly because a cosmic rug pulling could be\nin store for us a la The Matrix at any time, but that caveat aside,\nit’s our processes of communication, cooperation, record keeping,\nrhetorical persuasion, experimentation, reason, science, etc. that we\narrive at standards of right and wrong be they amoral (e.g., math,\nchemistry, physics) or moral.  And we arrive at them, to the extent we\ndo, through our own shared reasoning, thank you very much.  No divinity\nneeded or even evident.\nPoint number two is not so much incorrect as irrelevant, bordering on a category error. In this section, Passerby fails to grasp that an objective standard is more than the sum of six billion subjective opinions, and in fact, no number of subjective opinions can produce an objective standard, by definition.  The more the standard is “influenced by personal feelings, interpretations, or prejudice”, the less objective it can be, regardless of whether those competing feelings, interpretations, and prejudices are harmonious or not.  Existent evil/wrongdoing requires a material and universal standard, even if our subjective experience of the objective reality is different in six billion different ways.\nIf the readers don’t mind indulging me in following Passerby on one of his tangents, I will add that Stephen Pinker is wrong about science as he is wrong about so many things.  Science is most certainly not the highest and purest expression of reason.  Not only is it not reason at all, it was specifically conceived, developed, and utilized to replace pure reason.  This is why Science is so often at odds with Philosophy as well as Religion; Science is nothing more than the systematic codification of experience.",
  "tags": [
    "mailvox",
    "philosophy",
    "religion",
    "science"
  ],
  "categories": [],
  "sitemap_lastmod": "2012-10-29T17:00:00+00:00"
}