{
  "url": "https://voxday.net/2012/10/05/mailvox-defenses-of-dishonesty/",
  "scraped_at": "2025-12-14T05:04:45.708967",
  "title": "Mailvox: defenses of dishonesty",
  "date_display": "October 5, 2012",
  "date_iso": "2012-10-05T11:37:00+00:00",
  "date_from_url": "2012-10-05",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>RobertT writes:</p><blockquote class=\"tr_bq\"><p> So anyone who has ever worked for wages at an hourly wage is inherently<br> dishonest? That makes sense. How else do people get paid, except for<br> their time? That concept is as old as time itself. Service businesses<br> aren’t selling a product, they’re selling their time. And they generally<br> get a contract before doing anything just to make sure there are no<br> misunderstandings. This is how I work and my clients worship the ground I<br> walk on.  I don’t think much of attorneys either as a group, but maybe this is a little bit over the top.</br></br></br></br></br></br></p></blockquote><p>No, there is nothing inherently dishonest about working for wages at an hourly wage.  But there is a fundamental distinction between ““billable hours” and fees charged “based on the time they’ve supposedly put in rather than concrete results” and working for hourly wages.  The distinction is based on the difference between wages, which are paid by an employer who has the power to provide oversight and manage performance, and fees, which are paid by a client who is completely at the mercy of the fee-charger.</p><p>Fees of this sort are deceptive because they are based on a fundamental falsehood, which is the labor theory of value.  They are primarily the result of government intervention in the economy, which creates artificial shortages that permit the government-protected fee charger to force the client to purchase the fee charger’s time rather than the service he actually wishes to charge.</p><p>Fee chargers often resort to a deceptive defense, by claiming that they must charge for their time because they don’t know exactly how long it will take to provide the service.  This defense is belied by the fact that products and services in markets permitted to be competitive are delivered despite the fact that their time-cost is unknown.  For example, when I sign a book contract, I don’t know how long it will take to write the book anymore than a lawyer knows how long it will take to resolve a legal case.  I therefore assume part of the risk; the longer I take to write the book, the more my compensation per hour will be reduced.</p><p>The fee charger, on the other hand, not only structures the arrangement so that his client assumes all of the risk, but also leaves the client at his mercy because the only hard limits on his time cost are his conscience and the client’s solvency.  Even if the fee charger has a conscience and bills the service in the actual amount of time required to perform it, this doesn’t change the fact that the nature of the structure is intrinsically corrupt.</p><p>Logos doesn’t even attempt a defense, but tends to concur:</p><blockquote class=\"tr_bq\"><p> I’m a lawyer, and I admit that I hate just about every lawyer I’ve come<br> into contact with.  I’m still naive enough to try to make good arguments<br> and win cases, but lawyers I work with abhor the possibility of closing<br> a matter early or letting me get credit for winning it (I even have to<br> fight to sign my name on my own work product, which is damn good).  It<br> makes me sad because we are supposed to be in a noble profession that<br> fights for the rule of law against all who would threaten it, especially<br> government.</br></br></br></br></br></br></br></p></blockquote><p>I actually have an amount of sympathy for those lawyers who entered the profession without understanding its corrupt and corrupting nature.  Neither pre-law nor law school really explicate the truth for them, but rather give it to them in small doses so that only the most perceptive law student could put into any kind of coherent perspective.  One of my best friends is a lawyer, he was fired from his first law firm due to his unwillingness to bill nonexistent hours, and he is generally a man of good conscience.  But even he sees the problematic aspects of the system.  Those individuals of good will who chose to become a lawyer may well be bothered by the genuine hatred and disdain which so many people feel for them, but then, no doubt there are nice, good, honest bankers too.  So long as he is an officer of the court, a lawyer is a sworn agent of the legal system and cannot credibly disassociate himself from it.</p><p>And finally, robwbright attempts to get lawyerly, which is always unwise when dealing with a superintelligence armed with facts and logic, at least outside the courtroom.</p><blockquote class=\"tr_bq\"><p> Now, Vox said something I find a bit ironic.  <i>“if one doesn’t know<br> the difference between written law and case law, and understand how the<br> latter trumps the former, it’s not even possible to have an informed<br> opinion on the issue.”</br></br></br></i></p><p>Vox, if you’re going to rant about<br> something, at least get the terminology right, or YOU risk appearing as<br> if it’s not even possible for you to have an informed opinion about it.</br></br></p><p>By<br> “written law”, I assume you mean statutory law.  However, that’s not a<br> normal/common way to say/describe it, because case law is also most<br> certainly written.  Perhaps I misunderstand your meaning of “written<br> law”, but that’s not my fault, as your term “written law” is not<br> precise.  Common law might be referred to as “unwritten law”, but that’s<br> not case law, either.</br></br></br></br></br></br></p><p>And no, case law most certainly does NOT<br> trump statutory law in any court in which I have practiced (2 states, 7<br> counties, District Court of Appeals, State Supreme Court, Federal<br> District Court and Court of Appeals).</br></br></br></p></blockquote><p>Given that robwbright quite clearly understood the precise distinction I was making between the two distinct types of law, a distinction that the average layman does not even know exists, this is nothing more than a shallow attempt at rhetorically undermining my point while appealing to his own authority.  I used the term “written law” because I am not addressing an audience of lawyers here, and there is absolutely no need to resort to legal jargon in order to make clear the difference between the statutory laws that are written and passed by the elected legislatures, (which is what most people understand the law to be), and the non-laws that are the set of existing rulings which made new interpretations of law and can be cited as precedent, and which the lawyers in the system agree to mutually pretend are “case laws” possessed of a standing intrinsically superior to the legislative laws.</p><p>The fact that robwbright’s objection is a trivial and deceptive one can be shown by the U.S. legal jargon “black letter law”, which means “well-established case law”.  After all, statutory law is printed in black letters too… so how can anyone possibly know what “black letter law” is?  It could be statutory law, it could be case law, it could be regulatory law, right?  If we are to accept his lawyerly logic, we must assume that any judge or lawyer who uses the term “black letter law” risks appearing as if it’s not even possible for them to have an informed opinion about it.  I trust this demonstrates how feigning ignorance and confusion is a counterproductive means of attempting to rhetorically undermine an opponent, particularly when one is attempting to establish oneself as a trustworthy authority.  Henceforth, I will use the terms “legislative law” for “written law” or “statutory law”, and “interpretive rulings” for “case law”, in the interest of precision and clarity.</p><p>He then appeals to the authority of his own experience in claiming that interpretive rulings do not trump legislative law in any court in which he has practiced.  However, I have personally witnessed interpretive rulings repeatedly trump legislative law in several Minnesota and Federal District Courts, and there are no shortage of similar examples I could cite.  But since I cannot expect to win competing appeals to personal experience with a lawyer on this subject, I will have to do better than that.  Which, as it happens, is simple enough, based on logic and legal history.</p><p>Being a lawyer, robwbright must know that interpretive rulings always trump legislative law <i>at the court’s discretion</i>, otherwise it would not be possible for “the set of existing rulings which made new interpretations of law and, therefore, can be cited as precedent” to be so often used by the Supreme Court and other courts for the purpose of overturning legislative laws.  If we are to accept his reasoning, it is impossible for a legislative ban on abortion to be overturned… except by a subsequent action on the part of the relevant legislature.</p></div>",
  "content_text": "RobertT writes:\nSo anyone who has ever worked for wages at an hourly wage is inherently\ndishonest? That makes sense. How else do people get paid, except for\ntheir time? That concept is as old as time itself. Service businesses\naren’t selling a product, they’re selling their time. And they generally\nget a contract before doing anything just to make sure there are no\nmisunderstandings. This is how I work and my clients worship the ground I\nwalk on.  I don’t think much of attorneys either as a group, but maybe this is a little bit over the top.\nNo, there is nothing inherently dishonest about working for wages at an hourly wage.  But there is a fundamental distinction between ““billable hours” and fees charged “based on the time they’ve supposedly put in rather than concrete results” and working for hourly wages.  The distinction is based on the difference between wages, which are paid by an employer who has the power to provide oversight and manage performance, and fees, which are paid by a client who is completely at the mercy of the fee-charger.\nFees of this sort are deceptive because they are based on a fundamental falsehood, which is the labor theory of value.  They are primarily the result of government intervention in the economy, which creates artificial shortages that permit the government-protected fee charger to force the client to purchase the fee charger’s time rather than the service he actually wishes to charge.\nFee chargers often resort to a deceptive defense, by claiming that they must charge for their time because they don’t know exactly how long it will take to provide the service.  This defense is belied by the fact that products and services in markets permitted to be competitive are delivered despite the fact that their time-cost is unknown.  For example, when I sign a book contract, I don’t know how long it will take to write the book anymore than a lawyer knows how long it will take to resolve a legal case.  I therefore assume part of the risk; the longer I take to write the book, the more my compensation per hour will be reduced.\nThe fee charger, on the other hand, not only structures the arrangement so that his client assumes all of the risk, but also leaves the client at his mercy because the only hard limits on his time cost are his conscience and the client’s solvency.  Even if the fee charger has a conscience and bills the service in the actual amount of time required to perform it, this doesn’t change the fact that the nature of the structure is intrinsically corrupt.\nLogos doesn’t even attempt a defense, but tends to concur:\nI’m a lawyer, and I admit that I hate just about every lawyer I’ve come\ninto contact with.  I’m still naive enough to try to make good arguments\nand win cases, but lawyers I work with abhor the possibility of closing\na matter early or letting me get credit for winning it (I even have to\nfight to sign my name on my own work product, which is damn good).  It\nmakes me sad because we are supposed to be in a noble profession that\nfights for the rule of law against all who would threaten it, especially\ngovernment.\nI actually have an amount of sympathy for those lawyers who entered the profession without understanding its corrupt and corrupting nature.  Neither pre-law nor law school really explicate the truth for them, but rather give it to them in small doses so that only the most perceptive law student could put into any kind of coherent perspective.  One of my best friends is a lawyer, he was fired from his first law firm due to his unwillingness to bill nonexistent hours, and he is generally a man of good conscience.  But even he sees the problematic aspects of the system.  Those individuals of good will who chose to become a lawyer may well be bothered by the genuine hatred and disdain which so many people feel for them, but then, no doubt there are nice, good, honest bankers too.  So long as he is an officer of the court, a lawyer is a sworn agent of the legal system and cannot credibly disassociate himself from it.\nAnd finally, robwbright attempts to get lawyerly, which is always unwise when dealing with a superintelligence armed with facts and logic, at least outside the courtroom.\nNow, Vox said something I find a bit ironic.\n“if one doesn’t know\nthe difference between written law and case law, and understand how the\nlatter trumps the former, it’s not even possible to have an informed\nopinion on the issue.”\nVox, if you’re going to rant about\nsomething, at least get the terminology right, or YOU risk appearing as\nif it’s not even possible for you to have an informed opinion about it.\nBy\n“written law”, I assume you mean statutory law.  However, that’s not a\nnormal/common way to say/describe it, because case law is also most\ncertainly written.  Perhaps I misunderstand your meaning of “written\nlaw”, but that’s not my fault, as your term “written law” is not\nprecise.  Common law might be referred to as “unwritten law”, but that’s\nnot case law, either.\nAnd no, case law most certainly does NOT\ntrump statutory law in any court in which I have practiced (2 states, 7\ncounties, District Court of Appeals, State Supreme Court, Federal\nDistrict Court and Court of Appeals).\nGiven that robwbright quite clearly understood the precise distinction I was making between the two distinct types of law, a distinction that the average layman does not even know exists, this is nothing more than a shallow attempt at rhetorically undermining my point while appealing to his own authority.  I used the term “written law” because I am not addressing an audience of lawyers here, and there is absolutely no need to resort to legal jargon in order to make clear the difference between the statutory laws that are written and passed by the elected legislatures, (which is what most people understand the law to be), and the non-laws that are the set of existing rulings which made new interpretations of law and can be cited as precedent, and which the lawyers in the system agree to mutually pretend are “case laws” possessed of a standing intrinsically superior to the legislative laws.\nThe fact that robwbright’s objection is a trivial and deceptive one can be shown by the U.S. legal jargon “black letter law”, which means “well-established case law”.  After all, statutory law is printed in black letters too… so how can anyone possibly know what “black letter law” is?  It could be statutory law, it could be case law, it could be regulatory law, right?  If we are to accept his lawyerly logic, we must assume that any judge or lawyer who uses the term “black letter law” risks appearing as if it’s not even possible for them to have an informed opinion about it.  I trust this demonstrates how feigning ignorance and confusion is a counterproductive means of attempting to rhetorically undermine an opponent, particularly when one is attempting to establish oneself as a trustworthy authority.  Henceforth, I will use the terms “legislative law” for “written law” or “statutory law”, and “interpretive rulings” for “case law”, in the interest of precision and clarity.\nHe then appeals to the authority of his own experience in claiming that interpretive rulings do not trump legislative law in any court in which he has practiced.  However, I have personally witnessed interpretive rulings repeatedly trump legislative law in several Minnesota and Federal District Courts, and there are no shortage of similar examples I could cite.  But since I cannot expect to win competing appeals to personal experience with a lawyer on this subject, I will have to do better than that.  Which, as it happens, is simple enough, based on logic and legal history.\nBeing a lawyer, robwbright must know that interpretive rulings always trump legislative law\nat the court’s discretion\n, otherwise it would not be possible for “the set of existing rulings which made new interpretations of law and, therefore, can be cited as precedent” to be so often used by the Supreme Court and other courts for the purpose of overturning legislative laws.  If we are to accept his reasoning, it is impossible for a legislative ban on abortion to be overturned… except by a subsequent action on the part of the relevant legislature.",
  "tags": [
    "law",
    "mailvox"
  ],
  "categories": [],
  "sitemap_lastmod": "2012-10-05T10:37:00+00:00"
}