{
  "url": "https://voxday.net/2012/10/13/mailvox-education-and-evolutionis/",
  "scraped_at": "2025-12-14T05:05:16.898967",
  "title": "Mailvox: education and the evolutionist",
  "date_display": "October 13, 2012",
  "date_iso": "2012-10-13T11:32:00+00:00",
  "date_from_url": "2012-10-13",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>MD regurgitates the common mantra of the evolutionary faithful:</p><blockquote class=\"tr_bq\"><div> You are an educated man and know as well as me that evolution has been verified in countless experiments.  I agree that the precise details of the mechanism are still open to debate.  Since you are essentially making money out of the poor uneducated civilians of your own deeply divided culture, I expect that this E-mail<br> may not make it to the multitude.  Until then, any<br> pretensions you have as a serious philosopher – until you spell out your<br> objections to the actual EVIDENCE of evolution, must be viewed<br> suspisciously.  Being an intelligent fellow, I know you know this already; hey ho.</br></br></br></br></div></blockquote><div> First, I note what appears to be a popular use of the adjective “countless”, which in its most common usage apparently means “zero”.  A few days ago, I noted how spin is the hallmark of the weak argument; when someone uses the word “countless” it is often a flashing sign of where a little research will probably prove fruitful.<p>Second, it is because I have educated myself on the subject over the years that I am aware that there is not a single experiment or study that verifies evolution by natural selection.  Richard Dawkins very nearly admits as much in his homage to the faux science, <i>The Greatest Show on Earth</i>.  Strictly speaking, evolution by natural selection is not even truly scientific, because it is first and foremost a logical argument, which necessarily renders it philosophy rather than science.  At this point, there is less actual scientific evidence for it than for my hypothesis concerning the neural atypicality of atheists.</p><p>This isn’t the first time such a claim has been made.  Last time, I even asked for any scientific papers that supposedly contained such evidence; after reading the first ten on the list provided, it was readily apparent that none of them contained any such thing and the individual who provided the list of papers had simply done a search for references to “natural selection”.  But, for example, showing that guppies become smaller under certain predatory pressures and that this result is “consistent with evolution by natural selection” is very, very, very far from evidence that the guppies have evolved into something other than a guppy.</p><p>As I mentioned over one year ago, “I have read seven of Richard Dawkins’s ten books, two of Stephen<br> Gould’s, a random assortment of books by other authors including Charles<br> Darwin, Marc Hauser and Daniel Dennett, around 50 published papers<br> which relate to natural selection in some way, and more than 20 years<br> worth of magazines such as <i>Natural History </i>and <i>New Scientist</i>.  This doesn’t make me any sort of expert on the subject.  But I should think it tends to indicate that I am not <i>completely</i><br> uninformed about it.  And it’s certainly ironic to be repeatedly<br> accused of ignorance when not having read any economists from Turgot to<br> Tobin or theologians from Tertullian to Craig ever seems to prevent<br> credentialed Cult of Darwin members from opining authoritatively on<br> economics or theology.” </br></br></br></br></br></br></br></br></br></p><p>How many of the champions of evolution who claim I don’t know what I’m taking about with regards to evolution can claim to have read as much on the subject?  How many have even read <i>On the Origin of Species by Means of Natural Selection, or the Preservation of Favoured Races in the Struggle for Life? </i>And how many of the biologists who don’t hesitate to spout off on economic matters can claim to have read even half as deeply in the field of economics?</p><p>I have repeatedly spelled out my objections to evolution and the actual evidence for it.  First, the evidence doesn’t exist.  Second, the historical timelines that purportedly support it are dynamic.  Third, evolution is a complete failure as a predictive model.  Fourth, it is scientifically and technologically irrelevant; where is the evolutionary engineering.  Fifth, theoretical epicycles are increasingly appearing.  Sixth, it is a repeated failure as an explanatory model.  Seventh, there is a long track record of scientific fraud attached to it.</p><p>I have no pretensions of being a serious philosopher.  Quite the contrary, I am merely an intellectual dilettante who takes even his most cherished beliefs with a grain of salt.  But even if I did have such pretensions, my skepticism concerning the Theorum of Evolution by (probably) Natural Selection, Biased Mutation, Genetic Drift, and Gene Flow would not be a strike against me, it would be a mark in my favor.  Regardless, I have no problem with my opinions and assertions being viewed suspiciously.  If you can find the flaw in the argument, that’s great.  Point it out to me, I won’t hesitate to agree and either revise or recant the argument, so long as the flaw is actually there.</p><p>That being said, if there is a book on the subject of evolution that an evolutionist feels is missing from my education on the subject, then by all means, I encourage them to send me an epub.  I will read it.  I may even review it.  Of course, there is always the possibility that in doing so, I will point out the obvious errors it contains.</p></div></div>",
  "content_text": "MD regurgitates the common mantra of the evolutionary faithful:\nYou are an educated man and know as well as me that evolution has been verified in countless experiments.  I agree that the precise details of the mechanism are still open to debate.  Since you are essentially making money out of the poor uneducated civilians of your own deeply divided culture, I expect that this E-mail\nmay not make it to the multitude.  Until then, any\npretensions you have as a serious philosopher – until you spell out your\nobjections to the actual EVIDENCE of evolution, must be viewed\nsuspisciously.  Being an intelligent fellow, I know you know this already; hey ho.\nFirst, I note what appears to be a popular use of the adjective “countless”, which in its most common usage apparently means “zero”.  A few days ago, I noted how spin is the hallmark of the weak argument; when someone uses the word “countless” it is often a flashing sign of where a little research will probably prove fruitful.\nSecond, it is because I have educated myself on the subject over the years that I am aware that there is not a single experiment or study that verifies evolution by natural selection.  Richard Dawkins very nearly admits as much in his homage to the faux science,\nThe Greatest Show on Earth\n.  Strictly speaking, evolution by natural selection is not even truly scientific, because it is first and foremost a logical argument, which necessarily renders it philosophy rather than science.  At this point, there is less actual scientific evidence for it than for my hypothesis concerning the neural atypicality of atheists.\nThis isn’t the first time such a claim has been made.  Last time, I even asked for any scientific papers that supposedly contained such evidence; after reading the first ten on the list provided, it was readily apparent that none of them contained any such thing and the individual who provided the list of papers had simply done a search for references to “natural selection”.  But, for example, showing that guppies become smaller under certain predatory pressures and that this result is “consistent with evolution by natural selection” is very, very, very far from evidence that the guppies have evolved into something other than a guppy.\nAs I mentioned over one year ago, “I have read seven of Richard Dawkins’s ten books, two of Stephen\nGould’s, a random assortment of books by other authors including Charles\nDarwin, Marc Hauser and Daniel Dennett, around 50 published papers\nwhich relate to natural selection in some way, and more than 20 years\nworth of magazines such as\nNatural History\nand\nNew Scientist\n.  This doesn’t make me any sort of expert on the subject.  But I should think it tends to indicate that I am not\ncompletely\nuninformed about it.  And it’s certainly ironic to be repeatedly\naccused of ignorance when not having read any economists from Turgot to\nTobin or theologians from Tertullian to Craig ever seems to prevent\ncredentialed Cult of Darwin members from opining authoritatively on\neconomics or theology.”\nHow many of the champions of evolution who claim I don’t know what I’m taking about with regards to evolution can claim to have read as much on the subject?  How many have even read\nOn the Origin of Species by Means of Natural Selection, or the Preservation of Favoured Races in the Struggle for Life?\nAnd how many of the biologists who don’t hesitate to spout off on economic matters can claim to have read even half as deeply in the field of economics?\nI have repeatedly spelled out my objections to evolution and the actual evidence for it.  First, the evidence doesn’t exist.  Second, the historical timelines that purportedly support it are dynamic.  Third, evolution is a complete failure as a predictive model.  Fourth, it is scientifically and technologically irrelevant; where is the evolutionary engineering.  Fifth, theoretical epicycles are increasingly appearing.  Sixth, it is a repeated failure as an explanatory model.  Seventh, there is a long track record of scientific fraud attached to it.\nI have no pretensions of being a serious philosopher.  Quite the contrary, I am merely an intellectual dilettante who takes even his most cherished beliefs with a grain of salt.  But even if I did have such pretensions, my skepticism concerning the Theorum of Evolution by (probably) Natural Selection, Biased Mutation, Genetic Drift, and Gene Flow would not be a strike against me, it would be a mark in my favor.  Regardless, I have no problem with my opinions and assertions being viewed suspiciously.  If you can find the flaw in the argument, that’s great.  Point it out to me, I won’t hesitate to agree and either revise or recant the argument, so long as the flaw is actually there.\nThat being said, if there is a book on the subject of evolution that an evolutionist feels is missing from my education on the subject, then by all means, I encourage them to send me an epub.  I will read it.  I may even review it.  Of course, there is always the possibility that in doing so, I will point out the obvious errors it contains.",
  "tags": [
    "evolution",
    "mailvox"
  ],
  "categories": [],
  "sitemap_lastmod": "2012-10-13T10:32:00+00:00"
}