{
  "url": "https://voxday.net/2012/10/19/mailvox-reason-to-not-vote/",
  "scraped_at": "2025-12-14T05:05:45.766271",
  "title": "Mailvox: a reason to not vote",
  "date_display": "October 19, 2012",
  "date_iso": "2012-10-19T08:58:00+00:00",
  "date_from_url": "2012-10-19",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>I think we can all agree that blame for the present parlous state of the nation clearly lies with JartStar:</p><blockquote class=\"tr_bq\"><p> I had some fun today with some of the guys at work about voting. They<br> asked me while we were on break who I was going to vote for and I<br> explained that I no longer vote. The looks on their faces were priceless<br> and when they inquired why I offhandedly explained that I had voted my<br> entire life and things have steadily gotten worse, I feel bad about<br> that, and my voting has made the country worse. I then apologized to<br> them all for what I had done and the three out of the four of them went<br> into near hysterics.</br></br></br></br></br></br></br></p><p>The Israeli Jew proclaimed it would be better for<br> me to show up and vote randomly than not vote, and one of the two Indian<br> immigrants tried to pull me aside to explain that I wasn’t really the<br> problem.</br></br></br></p><p>So this is my new reason for not voting when people ask: The state<br> of the country to a large degree my fault and I’m stopping now before I<br> make things really bad.</br></br></p></blockquote><p>It’s definitely a more entertaining excuse than relying on reason and being forced to endure a monologue on how Mitt Romney will preside in a TOTALLY AND COMPLETELY DIFFERENT MANNER than Barack Obama, even though the extent of their actual policy differences appears to be that Romney is slightly more enthusiastic about Israel, Wall Street, and gun control while Obama is slightly more enthusiastic about Saudi Arabia, immigration, and feminism.</p><p>Of course, as I have conclusively proven, there is absolutely no chance that your one presidential vote makes any difference at all.  None at all.  Either that one vote will not make a difference to the outcome, or in the extremely unlikely event that the outcome of the state vote rests upon your one vote, the courts will render it void by pronouncing their own verdict on who won the “election”.</p><p>The argument for random voting being better than not voting is informative, though. Such a position would indicate that to the person who holds it, the preservation of the illusion of democracy is more important than democracy itself.</p></div>",
  "content_text": "I think we can all agree that blame for the present parlous state of the nation clearly lies with JartStar:\nI had some fun today with some of the guys at work about voting. They\nasked me while we were on break who I was going to vote for and I\nexplained that I no longer vote. The looks on their faces were priceless\nand when they inquired why I offhandedly explained that I had voted my\nentire life and things have steadily gotten worse, I feel bad about\nthat, and my voting has made the country worse. I then apologized to\nthem all for what I had done and the three out of the four of them went\ninto near hysterics.\nThe Israeli Jew proclaimed it would be better for\nme to show up and vote randomly than not vote, and one of the two Indian\nimmigrants tried to pull me aside to explain that I wasn’t really the\nproblem.\nSo this is my new reason for not voting when people ask: The state\nof the country to a large degree my fault and I’m stopping now before I\nmake things really bad.\nIt’s definitely a more entertaining excuse than relying on reason and being forced to endure a monologue on how Mitt Romney will preside in a TOTALLY AND COMPLETELY DIFFERENT MANNER than Barack Obama, even though the extent of their actual policy differences appears to be that Romney is slightly more enthusiastic about Israel, Wall Street, and gun control while Obama is slightly more enthusiastic about Saudi Arabia, immigration, and feminism.\nOf course, as I have conclusively proven, there is absolutely no chance that your one presidential vote makes any difference at all.  None at all.  Either that one vote will not make a difference to the outcome, or in the extremely unlikely event that the outcome of the state vote rests upon your one vote, the courts will render it void by pronouncing their own verdict on who won the “election”.\nThe argument for random voting being better than not voting is informative, though. Such a position would indicate that to the person who holds it, the preservation of the illusion of democracy is more important than democracy itself.",
  "tags": [
    "mailvox",
    "politics"
  ],
  "categories": [],
  "sitemap_lastmod": "2012-10-19T07:58:00+00:00"
}