{
  "url": "https://voxday.net/2012/10/25/nwa-were-optimists/",
  "scraped_at": "2025-12-14T05:06:20.173279",
  "title": "NWA were optimists",
  "date_display": "October 25, 2012",
  "date_iso": "2012-10-25T19:10:00+00:00",
  "date_from_url": "2012-10-25",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>This police officer appears to have gotten confused with regards to his sworn duty <a href=\"http://www.foxnews.com/us/2012/10/25/nyc-police-officer-arrested-for-alleged-cannibal-plot/\">to serve the people of New York City</a>:</p><blockquote class=\"tr_bq\"><p> Six-year NYPD veteran Gilberto Valle, 28, who worked in Harlem, was<br> arrested Wednesday by federal officers on a conspiracy to kidnap charge<br> Wednesday. The U.S. Attorney’s office said Valle conspired with<br> multiple, unnamed people “to kidnap, rape, torture, kill, cook and<br> cannibalize a number of women.”</br></br></br></br></p><p>“Gilberto Valle’s alleged plans to kidnap women so that they could be<br> raped, tortured, killed, cooked and cannibalized shocks the<br> conscience,” Manhattan U.S. Attorney Preet Bharara said in a prepared<br> statement. “This case is all the more disturbing when you consider<br> Valle’s position as a New York City police officer and his sworn duty to<br> serve and protect.”</br></br></br></br></br></p></blockquote><p>I’ll save everyone time and list the usual protests now: “Only a few rotten apples on the force who are cannibals.”  “Most police have never raped, tortured, or eaten anyone.”  “Officers are trained not to eat anyone unnecessarily.”</p></div>",
  "content_text": "This police officer appears to have gotten confused with regards to his sworn duty\nto serve the people of New York City\n:\nSix-year NYPD veteran Gilberto Valle, 28, who worked in Harlem, was\narrested Wednesday by federal officers on a conspiracy to kidnap charge\nWednesday. The U.S. Attorney’s office said Valle conspired with\nmultiple, unnamed people “to kidnap, rape, torture, kill, cook and\ncannibalize a number of women.”\n“Gilberto Valle’s alleged plans to kidnap women so that they could be\nraped, tortured, killed, cooked and cannibalized shocks the\nconscience,” Manhattan U.S. Attorney Preet Bharara said in a prepared\nstatement. “This case is all the more disturbing when you consider\nValle’s position as a New York City police officer and his sworn duty to\nserve and protect.”\nI’ll save everyone time and list the usual protests now: “Only a few rotten apples on the force who are cannibals.”  “Most police have never raped, tortured, or eaten anyone.”  “Officers are trained not to eat anyone unnecessarily.”",
  "tags": [
    "NWA was right"
  ],
  "categories": [],
  "sitemap_lastmod": "2012-10-25T18:10:00+00:00"
}