{
  "url": "https://voxday.net/2012/10/25/obama-is-out-of-contro/",
  "scraped_at": "2025-12-14T05:06:18.351850",
  "title": "Obama is out of control",
  "date_display": "October 25, 2012",
  "date_iso": "2012-10-25T16:09:00+00:00",
  "date_from_url": "2012-10-25",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>In case you doubted that Obama is sabotaging his re-election campaign, Matt Drudge brings <a href=\"http://www.dailymail.co.uk/news/article-2223130/Keeping-classy-Mr-President-Obama-describes-Romney-bullshitter.html?ito=feeds-newsxml\">the following incident</a> to your attention:</p><blockquote class=\"tr_bq\"><p> When asked whether he had a message for a six-year-old supporter,<br> President Barack Obama took the opportunity to describe his opponent<br> Mitt Romney as ‘a bullshitter’.</br></br></p><p>The extraordinary comment – most<br> American newspapers decline even to print such a word – came at the end<br> of an interview with ‘Rolling Stone’ in which Obama was asked possibly<br> the softest softball question ever lobbed at him.  As he left the<br> Oval Office, Eric Bates, executive editor of ‘Rollin Stone’, told Obama<br> that he had asked his six-year-old if there was anything she<br> wanted him to say to the president and she had responded: ‘Tell him: You<br> can do it.’</br></br></br></br></br></br></br></p><p>According to Bates, Obama grinned and said: ‘You know, kids have good instincts. They<br> look at the other guy and say, “Well, that’s a bullshitter, I can<br> tell.”‘</br></br></p></blockquote><p>Now, he’s not wrong.  Mitt Romney is a bullshitter supreme.  The man is the flippiest of flip-floppers and naturally produces a prodigious quantity of the stuff.  As, of course, does Obama, athough he is not so much a bullshit artist as a mid-witted con man.  But there are certain things you simply do not say when you are, or are at least popularly supposed to be, the President of the United States.</p><p>At this point, it clearly isn’t enough to just keep the man away from the press corps, his handlers are going to have to gag him and hide him in a closet until November 2nd.  I mean, he can’t even talk to his most fervent supporters without committing silly gaffes.</p></div>",
  "content_text": "In case you doubted that Obama is sabotaging his re-election campaign, Matt Drudge brings\nthe following incident\nto your attention:\nWhen asked whether he had a message for a six-year-old supporter,\nPresident Barack Obama took the opportunity to describe his opponent\nMitt Romney as ‘a bullshitter’.\nThe extraordinary comment – most\nAmerican newspapers decline even to print such a word – came at the end\nof an interview with ‘Rolling Stone’ in which Obama was asked possibly\nthe softest softball question ever lobbed at him.  As he left the\nOval Office, Eric Bates, executive editor of ‘Rollin Stone’, told Obama\nthat he had asked his six-year-old if there was anything she\nwanted him to say to the president and she had responded: ‘Tell him: You\ncan do it.’\nAccording to Bates, Obama grinned and said: ‘You know, kids have good instincts. They\nlook at the other guy and say, “Well, that’s a bullshitter, I can\ntell.”‘\nNow, he’s not wrong.  Mitt Romney is a bullshitter supreme.  The man is the flippiest of flip-floppers and naturally produces a prodigious quantity of the stuff.  As, of course, does Obama, athough he is not so much a bullshit artist as a mid-witted con man.  But there are certain things you simply do not say when you are, or are at least popularly supposed to be, the President of the United States.\nAt this point, it clearly isn’t enough to just keep the man away from the press corps, his handlers are going to have to gag him and hide him in a closet until November 2nd.  I mean, he can’t even talk to his most fervent supporters without committing silly gaffes.",
  "tags": [
    "freakshow",
    "politics"
  ],
  "categories": [],
  "sitemap_lastmod": "2012-10-25T15:09:00+00:00"
}