{
  "url": "https://voxday.net/2012/10/18/seeds-of-societal-destruction/",
  "scraped_at": "2025-12-14T05:05:42.095600",
  "title": "Seeds of societal destruction",
  "date_display": "October 18, 2012",
  "date_iso": "2012-10-18T11:17:00+00:00",
  "date_from_url": "2012-10-18",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>Desiderius, a commenter at HUS, draws an interesting connection between Rome’s destructive foreign policy and the U.S. university system:</p><blockquote class=\"tr_bq\"><p> The empire/Unis identify the best and brightest of the<br> tribes/flyover communities. They wow the parents with the grandeur of<br> Rome/Uni-degree caché. Parents send promising youth off to Rome/Unis.<br> They are indoctrinated with values hostile to the communities that<br> raised them.* In the Roman case, the now-mature youth were then returned<br> back to the tribes to sow discord, which they did in spades due to the<br> contempt they’d been trained to feel for the communities that raised<br> them and the values those communities held dear.</br></br></br></br></br></br></br></p><p>In the present case, when the economy is good, they just stay in the<br> big cities and live the life of Roissy. Bad economy -&gt; the Roman case<br> becomes a more real possibility. I’ve seen some teachers like this,<br> although to be fair, also some teachers pushing back. We’ll see if the<br> result is just impotent discord. The alternatives range from Alaric to<br> Washington.</br></br></br></br></br></p><p>The irony is that the values of the tribes more closely approximated<br> the republican values that allowed Rome to rise in the first place than<br> the decadent ones that precipitated it’s fall. Likewise today. It is the<br> <i>liberal</i> values that have been corrupted.</br></br></br></p><p>*<i> I’d argue in both cases violently less egalitarian, but I’m a little<br> original that way – suffice it to say in the present case that Yale Sex<br> Week wasn’t what the parents signed up for, or if that feels too<br> judgie/SoCon for you, one can peruse the syllabi for rampant<br> illiberalism, anti-semitism, radfem, anti-western, you name it. It’s<br> bad. I call it anti-humanism.</br></br></br></br></br></i></p></blockquote><p>This is a cogent summary of one of the various downsides of the so-called meritocracy.  Another one is the way in which the destruction of the old WASP network on Wall Street and its strong sense of <i>noblesse oblige</i> led to the rapacious, mercenary culture that has devastated the American economy, created vast quantities of debt, and led to major malinvestment throughout the nation.</p></div>",
  "content_text": "Desiderius, a commenter at HUS, draws an interesting connection between Rome’s destructive foreign policy and the U.S. university system:\nThe empire/Unis identify the best and brightest of the\ntribes/flyover communities. They wow the parents with the grandeur of\nRome/Uni-degree caché. Parents send promising youth off to Rome/Unis.\nThey are indoctrinated with values hostile to the communities that\nraised them.* In the Roman case, the now-mature youth were then returned\nback to the tribes to sow discord, which they did in spades due to the\ncontempt they’d been trained to feel for the communities that raised\nthem and the values those communities held dear.\nIn the present case, when the economy is good, they just stay in the\nbig cities and live the life of Roissy. Bad economy -> the Roman case\nbecomes a more real possibility. I’ve seen some teachers like this,\nalthough to be fair, also some teachers pushing back. We’ll see if the\nresult is just impotent discord. The alternatives range from Alaric to\nWashington.\nThe irony is that the values of the tribes more closely approximated\nthe republican values that allowed Rome to rise in the first place than\nthe decadent ones that precipitated it’s fall. Likewise today. It is the\nliberal\nvalues that have been corrupted.\n*\nI’d argue in both cases violently less egalitarian, but I’m a little\noriginal that way – suffice it to say in the present case that Yale Sex\nWeek wasn’t what the parents signed up for, or if that feels too\njudgie/SoCon for you, one can peruse the syllabi for rampant\nilliberalism, anti-semitism, radfem, anti-western, you name it. It’s\nbad. I call it anti-humanism.\nThis is a cogent summary of one of the various downsides of the so-called meritocracy.  Another one is the way in which the destruction of the old WASP network on Wall Street and its strong sense of\nnoblesse oblige\nled to the rapacious, mercenary culture that has devastated the American economy, created vast quantities of debt, and led to major malinvestment throughout the nation.",
  "tags": [
    "education",
    "society"
  ],
  "categories": [],
  "sitemap_lastmod": "2012-10-18T10:17:00+00:00"
}