{
  "url": "https://voxday.net/2012/10/29/so-evacuate-already/",
  "scraped_at": "2025-12-14T05:06:40.465968",
  "title": "So evacuate already",
  "date_display": "October 29, 2012",
  "date_iso": "2012-10-29T13:00:00+00:00",
  "date_from_url": "2012-10-29",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>Yes, all the storm warnings about ex-Hurricane Sandy are probably overhyped.  Overhype is one of the chief attributes of our increasingly idiocratic society.  But, even so, what’s the point in taking the risk?  Spacebunny and I used to live in a coastal area, and we figured that if a hurricane ever came our way, we’d just take advantage of it to have a week’s vacation somewhere inland.  So, if you’re in the storm’s path, get out of Dodge and take it easy.</p><p>That being said, this warning from the National Weather Service is weirdly sentimental:</p><blockquote class=\"tr_bq\"><p> 1. IF YOU ARE BEING ASKED TO EVACUATE A COASTAL LOCATION BY STATE AND LOCAL OFFICIALS, PLEASE DO SO.<br> 2. IF YOU ARE RELUCTANT TO EVACUATE, AND YOU KNOW SOMEONE WHO RODE<br> OUT THE ’62 STORM ON THE BARRIER ISLANDS, ASK THEM IF THEY COULD DO IT<br> AGAIN.<br> 3. IF YOU ARE RELUCTANT, THINK ABOUT YOUR LOVED ONES, THINK ABOUT THE<br> EMERGENCY RESPONDERS WHO WILL BE UNABLE TO REACH YOU WHEN YOU MAKE THE<br> PANICKED PHONE CALL TO BE RESCUED, THINK ABOUT THE RESCUE/RECOVERY TEAMS<br> WHO WILL RESCUE YOU IF YOU ARE INJURED OR RECOVER YOUR REMAINS IF YOU<br> DO NOT SURVIVE.<br> 4. SANDY IS AN EXTREMELY DANGEROUS STORM. THERE WILL BE MAJOR<br> PROPERTY DAMAGE, INJURIES ARE PROBABLY UNAVOIDABLE, BUT THE GOAL IS ZERO<br> FATALITIES.<br> 5. IF YOU THINK THE STORM IS OVER-HYPED AND EXAGGERATED, PLEASE ERR<br> ON THE SIDE OF CAUTION. WE WISH EVERYONE IN HARMS WAY ALL THE BEST. STAY<br> SAFE!</br></br></br></br></br></br></br></br></br></br></br></br></br></br></p></blockquote><p>Think of the poor children!  Think of the poor banks!  Wait, never mind, that’s the Obama and Romney campaigns, not the Weather Service.  The point is, you’re not going to score any points for hunkering down when you could be at a cheerful bed and breakfast waiting out the storm while enjoying the guilty pleasures of eating homemade chocolate chip cookies and watching the Obama campaign continue to immolate itself.</p><p>I do find it interesting, however, that we haven’t heard much about the storm being caused by global warming.  That meme is really dying out fast, because even three years ago, there is no way the media would have missed the chance to bang that drum.  I’m a bit bitter about the storm myself, as it seems to have delayed Google’s announcement of the Nexus 10.  I understand they had to cancel the event, but I would still like to know when it will be available and what it will cost.</p><p>Anyhow, if you’re one of the Dread Ilk in the path of the storm, stay safe out there and let us know you’re all right.</p></div>",
  "content_text": "Yes, all the storm warnings about ex-Hurricane Sandy are probably overhyped.  Overhype is one of the chief attributes of our increasingly idiocratic society.  But, even so, what’s the point in taking the risk?  Spacebunny and I used to live in a coastal area, and we figured that if a hurricane ever came our way, we’d just take advantage of it to have a week’s vacation somewhere inland.  So, if you’re in the storm’s path, get out of Dodge and take it easy.\nThat being said, this warning from the National Weather Service is weirdly sentimental:\n1. IF YOU ARE BEING ASKED TO EVACUATE A COASTAL LOCATION BY STATE AND LOCAL OFFICIALS, PLEASE DO SO.\n2. IF YOU ARE RELUCTANT TO EVACUATE, AND YOU KNOW SOMEONE WHO RODE\nOUT THE ’62 STORM ON THE BARRIER ISLANDS, ASK THEM IF THEY COULD DO IT\nAGAIN.\n3. IF YOU ARE RELUCTANT, THINK ABOUT YOUR LOVED ONES, THINK ABOUT THE\nEMERGENCY RESPONDERS WHO WILL BE UNABLE TO REACH YOU WHEN YOU MAKE THE\nPANICKED PHONE CALL TO BE RESCUED, THINK ABOUT THE RESCUE/RECOVERY TEAMS\nWHO WILL RESCUE YOU IF YOU ARE INJURED OR RECOVER YOUR REMAINS IF YOU\nDO NOT SURVIVE.\n4. SANDY IS AN EXTREMELY DANGEROUS STORM. THERE WILL BE MAJOR\nPROPERTY DAMAGE, INJURIES ARE PROBABLY UNAVOIDABLE, BUT THE GOAL IS ZERO\nFATALITIES.\n5. IF YOU THINK THE STORM IS OVER-HYPED AND EXAGGERATED, PLEASE ERR\nON THE SIDE OF CAUTION. WE WISH EVERYONE IN HARMS WAY ALL THE BEST. STAY\nSAFE!\nThink of the poor children!  Think of the poor banks!  Wait, never mind, that’s the Obama and Romney campaigns, not the Weather Service.  The point is, you’re not going to score any points for hunkering down when you could be at a cheerful bed and breakfast waiting out the storm while enjoying the guilty pleasures of eating homemade chocolate chip cookies and watching the Obama campaign continue to immolate itself.\nI do find it interesting, however, that we haven’t heard much about the storm being caused by global warming.  That meme is really dying out fast, because even three years ago, there is no way the media would have missed the chance to bang that drum.  I’m a bit bitter about the storm myself, as it seems to have delayed Google’s announcement of the Nexus 10.  I understand they had to cancel the event, but I would still like to know when it will be available and what it will cost.\nAnyhow, if you’re one of the Dread Ilk in the path of the storm, stay safe out there and let us know you’re all right.",
  "tags": [
    "AGW/CC"
  ],
  "categories": [],
  "sitemap_lastmod": "2012-10-29T13:00:00+00:00"
}