{
  "url": "https://voxday.net/2012/10/31/star-wars-is-dead/",
  "scraped_at": "2025-12-14T05:06:53.446582",
  "title": "Star Wars is dead",
  "date_display": "October 31, 2012",
  "date_iso": "2012-10-31T14:00:00+00:00",
  "date_from_url": "2012-10-31",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>Not that George Lucas hasn’t methodically gone about ruining his creation for decades, beginning with <i>The Return of the Jedi</i> and those damned Ewoks, but the sale of Lucasfilm to Disney pretty much guarantees that the franchise will never, ever, return to its erstwhile glory.  This take on the acquisition by a Slashdot commenter named Doctor Jest <a href=\"http://slashdot.org/~Doctor_Jest\">summed it up</a> rather nicely:</p><blockquote class=\"tr_bq\"><p> Mark my words…. Episode 7 will be all goddamned Ewoks. And<br> Chewbacca will have a perm and PTSD from the final battle.  Then we have<br> to have the token black guy/chick… forget Billy Dee Williams. We’re<br> getting Will Smith or his bratty little kid. C3P0 will finally come out<br> of the closet and admit he’s been taking it up the exhaust pipe from<br> IG-88 for years. R2D2 will be turned into a karaoke machine…. Luke<br> will become a homeless religious nut while Han Solo and Leia will have six<br> kids on galactic welfare… and the evil Ritt Momney will threaten to<br> close the youth center Han and Leia run unless the duo can field a<br> tiddlywinks team in time for the big tournament on Yaavin IV. Meanwhile,<br> the Emperor’s clones will become the universe’s ugliest choir.</br></br></br></br></br></br></br></br></br></br></p><p>Now<br> I know the franchise is truly dead. Thank goodness I got it on Blu Ray<br> before Disney got their slimy dickskinners on the franchise.  Disney<br> fucked the Muppets… (I believe they killed Henson because he was<br> having second thoughts on the sale… ok, so I made that up… but<br> Disney’s fucking evil!)</br></br></br></br></br></p></blockquote><p>It’s sad, because Disney used to be a wonderful organization itself.  Now it is the evil vampire squid of the entertainment world, mindlessly devouring and excreting out the stinking remnants of one entertainment franchise after another.  It was never going to happen, but imagine how much creativity could have been unleashed if George Lucas had released Star Wars under the LGPL.  Instead, we’re going to get gay Ewoks singing musical numbers and Hispanic princesses wielding lightsabers and going on intergalactic voyages with sparkly alien vampires where they defeat the evil Ritt Momney and Pand Raul in the process of learning the important lesson that the ultimate truth in life is to be tolerant of others who are different… unless they are Republicans.</p></div>",
  "content_text": "Not that George Lucas hasn’t methodically gone about ruining his creation for decades, beginning with\nThe Return of the Jedi\nand those damned Ewoks, but the sale of Lucasfilm to Disney pretty much guarantees that the franchise will never, ever, return to its erstwhile glory.  This take on the acquisition by a Slashdot commenter named Doctor Jest\nsummed it up\nrather nicely:\nMark my words…. Episode 7 will be all goddamned Ewoks. And\nChewbacca will have a perm and PTSD from the final battle.  Then we have\nto have the token black guy/chick… forget Billy Dee Williams. We’re\ngetting Will Smith or his bratty little kid. C3P0 will finally come out\nof the closet and admit he’s been taking it up the exhaust pipe from\nIG-88 for years. R2D2 will be turned into a karaoke machine…. Luke\nwill become a homeless religious nut while Han Solo and Leia will have six\nkids on galactic welfare… and the evil Ritt Momney will threaten to\nclose the youth center Han and Leia run unless the duo can field a\ntiddlywinks team in time for the big tournament on Yaavin IV. Meanwhile,\nthe Emperor’s clones will become the universe’s ugliest choir.\nNow\nI know the franchise is truly dead. Thank goodness I got it on Blu Ray\nbefore Disney got their slimy dickskinners on the franchise.  Disney\nfucked the Muppets… (I believe they killed Henson because he was\nhaving second thoughts on the sale… ok, so I made that up… but\nDisney’s fucking evil!)\nIt’s sad, because Disney used to be a wonderful organization itself.  Now it is the evil vampire squid of the entertainment world, mindlessly devouring and excreting out the stinking remnants of one entertainment franchise after another.  It was never going to happen, but imagine how much creativity could have been unleashed if George Lucas had released Star Wars under the LGPL.  Instead, we’re going to get gay Ewoks singing musical numbers and Hispanic princesses wielding lightsabers and going on intergalactic voyages with sparkly alien vampires where they defeat the evil Ritt Momney and Pand Raul in the process of learning the important lesson that the ultimate truth in life is to be tolerant of others who are different… unless they are Republicans.",
  "tags": [
    "corpocracy",
    "movies"
  ],
  "categories": [],
  "sitemap_lastmod": "2012-10-31T14:00:00+00:00"
}