{
  "url": "https://voxday.net/2012/10/10/the-distaste-for-debate/",
  "scraped_at": "2025-12-14T05:05:05.924010",
  "title": "The distaste for debate",
  "date_display": "October 10, 2012",
  "date_iso": "2012-10-10T10:42:00+00:00",
  "date_from_url": "2012-10-10",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>It is interesting, is it not, how <a href=\"http://www.wnd.com/2012/10/why-the-lying-left-detests-debate/\">fear and loathing of debate</a> pervades the Left:</p><blockquote class=\"tr_bq\"><p> Not to put too fine a point on it, professor McKenzie looked<br> terrified. When this distinguished economics prof had invited me to give<br> a lecture entitled “Is CO2 Mitigation Cost-Effective?” at Southeastern<br> Louisiana University, the provost had called him in to ask why<br> professors worldwide had written demanding that I be disinvited.</br></br></br></br></p><div class=\"left_ad_160\"><div id=\"div-gpt-ad-story160LeftSide\"></div></div><p>Disinvitation is a favorite debate-stifling technique of the left. A<br> couple of years ago, when Prince Philip invited professor Ian Plimer to<br> give the annual Duke of Edinburgh’s Lecture at Buckingham Palace<br> explaining why global warming is a scam, the Children’s Coalition went<br> into conniptions. Within weeks and without explanation, Ian was rudely<br> disinvited.</br></br></br></br></br></p></blockquote><p>Regardless of whether it is Al Gore, Richard Dawkins, PZ Myers, or the vast and corpulent mass of feminists, the Left has an observable tendency to shun debate.  They assert many different reasons for doing so, but the truth is always revealed by their seemingly contradictory willingness to debate the incompetent and the overmatched.</p><p>Contrast with this the readiness of those on the right, even the most hapless, to publicly engage with those with whom they disagree.  I don’t think much of Gary North and his homoerotic arguments – no one actually wants to poke a “gun” in his rotund “belly” – but I do give him credit for being willing to at least attempt to engage my ideas concerning the intrinsically inimical nature of free trade.</p><p>One of the things that has been interesting to observe over time is the way that the heated attacks on me, both in public and via email, have all but disappeared even though my overall readership has never been larger.  Why is this?  My theory is this is because most of my critics, be they atheists, feminists, evolutionists, or free traders, have learned they simply cannot win in a direct confrontation.  They can’t openly criticize my ideas because they have learned, much to their surprise, that they cannot adequately defend their own.</p><p>As Aristotle pointed out more than two thousand years ago, even at the rhetorical level, the side more closely approximates the truth will tend to win out, because it is easier to argue when your arguments are based on truth rather than falsehood.  Events will always ultimately prove the arguments of the global warmers, the godless, the female supremacists, the socialists, the Keynesians, and the monetarists to be false because their ideas are false.  This is why a good memory is one of the most lethal weapons against them and why it is so easy to win debates against them, as given enough time, they are going to contradict themselves. </p><p>Why?  Because they have no choice.  Being false, their positions have to be dynamic, which means they can never hope for any significant degree of consistency.  This is why ex post facto revision and double-talk are the hallmarks of the Left, and is why the first thing Leftists do when they are in a position of power is to erase history and attempt to silence any voices capable of calling attention to their fictions and contradictions.</p><p>People have occasionally asked me how I so readily identify the weak points in an opponent’s arguments.  It’s actually very simple.  Look for the spin.  No matter what form it takes, the spin is only there to obfuscate the falsehood.  Expose that, and you not only expose the falsity of the argument, but also strike a blow against the credibility of the individual presenting it.  If longtime readers have learned anything here, I hope it is the ability to see through the incessant spin and strike to the heart of the deceit.</p></div>",
  "content_text": "It is interesting, is it not, how\nfear and loathing of debate\npervades the Left:\nNot to put too fine a point on it, professor McKenzie looked\nterrified. When this distinguished economics prof had invited me to give\na lecture entitled “Is CO2 Mitigation Cost-Effective?” at Southeastern\nLouisiana University, the provost had called him in to ask why\nprofessors worldwide had written demanding that I be disinvited.\nDisinvitation is a favorite debate-stifling technique of the left. A\ncouple of years ago, when Prince Philip invited professor Ian Plimer to\ngive the annual Duke of Edinburgh’s Lecture at Buckingham Palace\nexplaining why global warming is a scam, the Children’s Coalition went\ninto conniptions. Within weeks and without explanation, Ian was rudely\ndisinvited.\nRegardless of whether it is Al Gore, Richard Dawkins, PZ Myers, or the vast and corpulent mass of feminists, the Left has an observable tendency to shun debate.  They assert many different reasons for doing so, but the truth is always revealed by their seemingly contradictory willingness to debate the incompetent and the overmatched.\nContrast with this the readiness of those on the right, even the most hapless, to publicly engage with those with whom they disagree.  I don’t think much of Gary North and his homoerotic arguments – no one actually wants to poke a “gun” in his rotund “belly” – but I do give him credit for being willing to at least attempt to engage my ideas concerning the intrinsically inimical nature of free trade.\nOne of the things that has been interesting to observe over time is the way that the heated attacks on me, both in public and via email, have all but disappeared even though my overall readership has never been larger.  Why is this?  My theory is this is because most of my critics, be they atheists, feminists, evolutionists, or free traders, have learned they simply cannot win in a direct confrontation.  They can’t openly criticize my ideas because they have learned, much to their surprise, that they cannot adequately defend their own.\nAs Aristotle pointed out more than two thousand years ago, even at the rhetorical level, the side more closely approximates the truth will tend to win out, because it is easier to argue when your arguments are based on truth rather than falsehood.  Events will always ultimately prove the arguments of the global warmers, the godless, the female supremacists, the socialists, the Keynesians, and the monetarists to be false because their ideas are false.  This is why a good memory is one of the most lethal weapons against them and why it is so easy to win debates against them, as given enough time, they are going to contradict themselves.\nWhy?  Because they have no choice.  Being false, their positions have to be dynamic, which means they can never hope for any significant degree of consistency.  This is why ex post facto revision and double-talk are the hallmarks of the Left, and is why the first thing Leftists do when they are in a position of power is to erase history and attempt to silence any voices capable of calling attention to their fictions and contradictions.\nPeople have occasionally asked me how I so readily identify the weak points in an opponent’s arguments.  It’s actually very simple.  Look for the spin.  No matter what form it takes, the spin is only there to obfuscate the falsehood.  Expose that, and you not only expose the falsity of the argument, but also strike a blow against the credibility of the individual presenting it.  If longtime readers have learned anything here, I hope it is the ability to see through the incessant spin and strike to the heart of the deceit.",
  "tags": [
    "anklebiters",
    "debate"
  ],
  "categories": [],
  "sitemap_lastmod": "2012-10-10T09:42:00+00:00"
}