{
  "url": "https://voxday.net/2012/10/25/the-importance-of-iq/",
  "scraped_at": "2025-12-14T05:06:14.686718",
  "title": "The importance of IQ",
  "date_display": "October 25, 2012",
  "date_iso": "2012-10-25T09:35:00+00:00",
  "date_from_url": "2012-10-25",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>As much as people slaver to denigrate and discredit it, the statistical fact of the matter is that IQ is actually more important than most people believe when it comes to certain types of success.  While it’s not necessarily a surprise that college grades and years of education strongly correlate with IQ, (which may be the cause of the common confusion of academic credentials with intelligence), it may be a surprise to learn that <a href=\"http://takimag.com/article/its_tough_being_tough_steve_sailer#axzz2AAsNqC1O\">IQ is a better predictor of successful job performance</a> than openness, extraversion, agreeableness, confidence, or even conscientiousness.</p><blockquote class=\"tr_bq\"><p> IQ surpasses any single Big Five personality factor in the prediction<br> of the two academic outcomes, college grades (r = .45) and years of<br> education (r = .55). Big Five conscientiousness is by far the best<br> personality predictor of grades (r = .22).…Conscientiousness predicts<br> job performance (r = .13; corrected r = .22) better than does any other<br> Big Five factor, but not as well as IQ does (r = .21; corrected r =<br> .55). The importance of IQ increases with job complexity, defined as the<br> information processing requirements of the job: cognitive skills are<br> more important for professors, scientists, and senior managers than for<br> semiskilled or unskilled laborers.…In contrast, the importance of<br> conscientiousness does not vary much with job complexity….</br></br></br></br></br></br></br></br></br></br></p></blockquote><p>Now, we all know the brilliant guy who has wasted his 175 IQ by spending twenty years in search of the eternal buzz.  I do, anyhow, he used to live in my basement.  But such individuals are complete outliers, what matters more is the advantage that the moderately intelligent man with the 115 IQ has over the even more moderately intelligent 105 IQ guy.</p><p>For some reason, the discussion of IQ differences makes people uncomfortable; it doesn’t matter how obviously intelligent one is, people still find it offensive in a way that they never find a tall man being straightforward about his height is.  This is strange, because one can’t do much more about one’s intelligence than one can about one’s height.  One can, perhaps, attempt to make more efficient use of it, but then, a tall man can strive to avoid slouching as well.  Is it because we value IQ more than height, is it because it seems a more intrinsic element of ourselves, or is it merely that height is more readily observed by the average individual?</p><p>Regardless, the reality is that the more everyone realizes that intelligence, as measured by IQ, is merely a tool and a natural advantage little different than any other genetic gift, the better off everyone will be.  Being smart doesn’t make one any morally better or intrinsically wiser; the myopic foolishness of the cognitive elite is one of the greatest dangers that face humanity today.  But pretending that a potential danger does not exist is stupid and short-sighted, especially when one necessarily has to pretend that the antidote to that danger doesn’t exist as well.</p><p>If you don’t think it makes sense to treat a normal individual like a retard, then it should not be hard to understand that you cannot communicate with a brilliant individual as if he were a normal one.  And on the societal level, the goal should not be to try to make the retards normal or the normals brilliant, (such efforts are futile), but rather, to endeavor to teach each group of individuals wisdom and strong moral character to the best of their capacity to understand and apply it.  Even one conscientious and confident normal individual of good character can do wonders for correcting the ills caused by a gaggle of highly intelligent, evil-minded fools.</p></div>",
  "content_text": "As much as people slaver to denigrate and discredit it, the statistical fact of the matter is that IQ is actually more important than most people believe when it comes to certain types of success.  While it’s not necessarily a surprise that college grades and years of education strongly correlate with IQ, (which may be the cause of the common confusion of academic credentials with intelligence), it may be a surprise to learn that\nIQ is a better predictor of successful job performance\nthan openness, extraversion, agreeableness, confidence, or even conscientiousness.\nIQ surpasses any single Big Five personality factor in the prediction\nof the two academic outcomes, college grades (r = .45) and years of\neducation (r = .55). Big Five conscientiousness is by far the best\npersonality predictor of grades (r = .22).…Conscientiousness predicts\njob performance (r = .13; corrected r = .22) better than does any other\nBig Five factor, but not as well as IQ does (r = .21; corrected r =\n.55). The importance of IQ increases with job complexity, defined as the\ninformation processing requirements of the job: cognitive skills are\nmore important for professors, scientists, and senior managers than for\nsemiskilled or unskilled laborers.…In contrast, the importance of\nconscientiousness does not vary much with job complexity….\nNow, we all know the brilliant guy who has wasted his 175 IQ by spending twenty years in search of the eternal buzz.  I do, anyhow, he used to live in my basement.  But such individuals are complete outliers, what matters more is the advantage that the moderately intelligent man with the 115 IQ has over the even more moderately intelligent 105 IQ guy.\nFor some reason, the discussion of IQ differences makes people uncomfortable; it doesn’t matter how obviously intelligent one is, people still find it offensive in a way that they never find a tall man being straightforward about his height is.  This is strange, because one can’t do much more about one’s intelligence than one can about one’s height.  One can, perhaps, attempt to make more efficient use of it, but then, a tall man can strive to avoid slouching as well.  Is it because we value IQ more than height, is it because it seems a more intrinsic element of ourselves, or is it merely that height is more readily observed by the average individual?\nRegardless, the reality is that the more everyone realizes that intelligence, as measured by IQ, is merely a tool and a natural advantage little different than any other genetic gift, the better off everyone will be.  Being smart doesn’t make one any morally better or intrinsically wiser; the myopic foolishness of the cognitive elite is one of the greatest dangers that face humanity today.  But pretending that a potential danger does not exist is stupid and short-sighted, especially when one necessarily has to pretend that the antidote to that danger doesn’t exist as well.\nIf you don’t think it makes sense to treat a normal individual like a retard, then it should not be hard to understand that you cannot communicate with a brilliant individual as if he were a normal one.  And on the societal level, the goal should not be to try to make the retards normal or the normals brilliant, (such efforts are futile), but rather, to endeavor to teach each group of individuals wisdom and strong moral character to the best of their capacity to understand and apply it.  Even one conscientious and confident normal individual of good character can do wonders for correcting the ills caused by a gaggle of highly intelligent, evil-minded fools.",
  "tags": [
    "education",
    "science"
  ],
  "categories": [],
  "sitemap_lastmod": "2012-10-25T08:35:00+00:00"
}