{
  "url": "https://voxday.net/2012/10/24/the-forked-tongue-of-fetishis/",
  "scraped_at": "2025-12-14T05:06:09.513080",
  "title": "The forked tongue of the fetishist",
  "date_display": "October 24, 2012",
  "date_iso": "2012-10-24T10:12:00+00:00",
  "date_from_url": "2012-10-24",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>I thought <a href=\"http://science.slashdot.org/story/12/10/22/1634219/scientists-who-failed-to-warn-of-quake-found-guilty-of-manslaughter\">this exchange on Slashdot</a> between an engineer and a science champion concerning the recent Italian court verdicts was as illuminating as it was entertaining:</p><blockquote class=\"tr_bq\"><p>  E1: As a professional engineer, accountability starts the moment you have a license number in your state.  Any opinion you give on any project makes you liable.  The<br> problem is that too many people are giving opinions on subjects that<br> affect other people’s lives and have zero accountability.  this trial is<br> a precursor to what may eventually become the norm. Picture these<br> so-called experts on TV talking about this and that and if they are<br> found wrong and someone was affected by it, then they can be held<br> accountable. The same will be applied to lawyers and politicians<br> and before you know it, people will be better off if we hold people with<br> some sort of power (over other people) accountable.</br></br></br></br></br></br></br></br></p><p>S1: <i>You seem to be conflating science with engineering. Now I have news for<br> you: there’s a reason why we have two different words for these things<br> (and no, it’s not so that poets can have a richer vocabulary for writing<br> odes).</br></br></br></i></p><p>S2: <i>The difference is obvious.  An engineered system is just that — a<br> system that is fully understood and can have predictable outcomes from<br> known initial conditions.  So…it is reasonable to expect engineers to<br> be liable for their work.  Predicting earthquakes is not anywhere near<br> as simple.  To find criminal accountability from such failures is<br> preposterous. </br></br></br></br></br></i></p></blockquote><p>As a pro-scientody critic of scientistry, I am very much enjoying the flailing about of the professional scientific community and its cheerleaders in response to the L’Aquila verdicts.  Notice how these attempts to argue that scientists cannot be held liable for their false predictions completely flies in the face of the absurd, but common claim that science is the only possible means of genuinely knowing anything.  What we’re witnessing here in real time is the logical unraveling of the rational materialist’s science fetish; the next time you encounter an appeal to science, you now possess a powerful rhetorical weapon that will be much more effective than the logical arguments which the science fetishists ignore so readily.</p><p>If science is so obviously unreliable that scientists cannot reasonably be held responsible for the accuracy of their science-based predictions, then how can one rationally assert that it is always more reliable than documentary evidence, eyewitness testimony, or even haruspicy?  If evolution and global warming are scientific facts, then why can’t they be used predict any future events with a degree of accuracy that comes anywhere close to that of a street bookie?  Is there a single biologist on the planet who is willing to risk his job on the basis of a scientific prediction, the way that so many non-scientists do every single day?</p><p>The observable and provable fact is that most science that has not already been confirmed by its transformation into engineering is absolutely and utterly unreliable and most factual assertions by scientists are guaranteed to be false.  One need not know anything about science to correctly conclude this, one need only understand basic human behavior and witness the way in which scientists are highly accountability-avoidant.  Moreover, it is worth noting that the position taken by the science champions is a point I have previously articulated, which is that science can only be considered reliable to the extent that it has evolved into engineering.</p></div>",
  "content_text": "I thought\nthis exchange on Slashdot\nbetween an engineer and a science champion concerning the recent Italian court verdicts was as illuminating as it was entertaining:\nE1: As a professional engineer, accountability starts the moment you have a license number in your state.  Any opinion you give on any project makes you liable.  The\nproblem is that too many people are giving opinions on subjects that\naffect other people’s lives and have zero accountability.  this trial is\na precursor to what may eventually become the norm. Picture these\nso-called experts on TV talking about this and that and if they are\nfound wrong and someone was affected by it, then they can be held\naccountable. The same will be applied to lawyers and politicians\nand before you know it, people will be better off if we hold people with\nsome sort of power (over other people) accountable.\nS1:\nYou seem to be conflating science with engineering. Now I have news for\nyou: there’s a reason why we have two different words for these things\n(and no, it’s not so that poets can have a richer vocabulary for writing\nodes).\nS2:\nThe difference is obvious.  An engineered system is just that — a\nsystem that is fully understood and can have predictable outcomes from\nknown initial conditions.  So…it is reasonable to expect engineers to\nbe liable for their work.  Predicting earthquakes is not anywhere near\nas simple.  To find criminal accountability from such failures is\npreposterous.\nAs a pro-scientody critic of scientistry, I am very much enjoying the flailing about of the professional scientific community and its cheerleaders in response to the L’Aquila verdicts.  Notice how these attempts to argue that scientists cannot be held liable for their false predictions completely flies in the face of the absurd, but common claim that science is the only possible means of genuinely knowing anything.  What we’re witnessing here in real time is the logical unraveling of the rational materialist’s science fetish; the next time you encounter an appeal to science, you now possess a powerful rhetorical weapon that will be much more effective than the logical arguments which the science fetishists ignore so readily.\nIf science is so obviously unreliable that scientists cannot reasonably be held responsible for the accuracy of their science-based predictions, then how can one rationally assert that it is always more reliable than documentary evidence, eyewitness testimony, or even haruspicy?  If evolution and global warming are scientific facts, then why can’t they be used predict any future events with a degree of accuracy that comes anywhere close to that of a street bookie?  Is there a single biologist on the planet who is willing to risk his job on the basis of a scientific prediction, the way that so many non-scientists do every single day?\nThe observable and provable fact is that most science that has not already been confirmed by its transformation into engineering is absolutely and utterly unreliable and most factual assertions by scientists are guaranteed to be false.  One need not know anything about science to correctly conclude this, one need only understand basic human behavior and witness the way in which scientists are highly accountability-avoidant.  Moreover, it is worth noting that the position taken by the science champions is a point I have previously articulated, which is that science can only be considered reliable to the extent that it has evolved into engineering.",
  "tags": [
    "science"
  ],
  "categories": [],
  "sitemap_lastmod": "2012-10-24T09:12:00+00:00"
}