{
  "url": "https://voxday.net/2012/10/16/the-idiot-assimilators/",
  "scraped_at": "2025-12-14T05:05:31.149428",
  "title": "The idiot assimilators",
  "date_display": "October 16, 2012",
  "date_iso": "2012-10-16T08:18:00+00:00",
  "date_from_url": "2012-10-16",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>Sara Hoyt has a legitimate complaint about Facebook and the mindless Faceborg <a href=\"http://classicalvalues.com/2012/10/quitters-are-joiners-who-never-joined-while-joiners-are-quitters-who-never-quit/\">who successfully attempt to enlist unwitting others</a> in their cherished causes:</p><blockquote class=\"tr_bq\"><p> People with zero affiliations with — or even knowledge of — particular<br> groups are publicly made members of them without their consent. All it<br> takes is a friend putting you in a group, and then you are in it without<br> your consent….</br></br></br></p><p>There is something downright Orwellian about this, and if you don’t<br> think it can be used for Orwellian political purposes, imagine yourself<br> working in an office with Facebook friends who include supporters of a<br> presidential candidate for whom you don’t intend to vote. If that<br> “friend” puts you in, say, an “I’M VOTING FOR JILL STEIN!” Facebook group, then you are in it, and you have to un-join. Suppose<br> your supervisor or next door neighbor put you in it? The implications<br> are as obvious as they are odious; not all of us are political junkies<br> with the balls to issue public statements about whom we support or don’t<br> support, and not all of us are so public that we might find something<br> like this amusing enough to write a blog post about the experience.</br></br></br></br></br></br></br></br></br></p></blockquote><p>Now, I’m not active on Facebook.  While I do use Twitter, I only belong to most social media groups in order to prevent my more creative critics from attempting to pass themselves off as me.  But I am a registered user there, and so every day I am the recipient of spam from groups like Friends of Protection For Men.  Not only is the constant barrage of email annoying, but it has the counterproductive result of making me feel entirely unsympathetic to the Friends of Protection For Men.  Every time I see another stupid piece of mail from them it makes me want to kick the sender in the teeth.  Not that I often see one, of course, since my spam filter is cranked up to 11, which is why I occasionally fail to receive legitimate emails from readers attempting to contact me.  But I just looked in my Junk folder, and sure enough, there are a pair of emails from the wretched Friends that arrived this morning.</p><p>So, for the first time in ages, I logged onto Facebook and removed myself from the various groups into which others have conscripted me.  But, as Miss Hoyt points out, I shoudn’t have to do that.  Opt-out is reprehensible and opt-in should always be the standard.</p><p>I appreciate that Facebook and other social media can be a useful means of contacting individuals and organizing groups.  But don’t ever sign people up for causes that you believe to be worthy, even if you are 100 percent sure that they agree with the goals of that group.  It’s just obnoxious, and to be honest, Mark Zuckerberg should be repeatedly punched in that flat, stupid, thieving face of his for his refusal to prevent Faceborg from assimilating others.</p></div>",
  "content_text": "Sara Hoyt has a legitimate complaint about Facebook and the mindless Faceborg\nwho successfully attempt to enlist unwitting others\nin their cherished causes:\nPeople with zero affiliations with — or even knowledge of — particular\ngroups are publicly made members of them without their consent. All it\ntakes is a friend putting you in a group, and then you are in it without\nyour consent….\nThere is something downright Orwellian about this, and if you don’t\nthink it can be used for Orwellian political purposes, imagine yourself\nworking in an office with Facebook friends who include supporters of a\npresidential candidate for whom you don’t intend to vote. If that\n“friend” puts you in, say, an “I’M VOTING FOR JILL STEIN!” Facebook group, then you are in it, and you have to un-join. Suppose\nyour supervisor or next door neighbor put you in it? The implications\nare as obvious as they are odious; not all of us are political junkies\nwith the balls to issue public statements about whom we support or don’t\nsupport, and not all of us are so public that we might find something\nlike this amusing enough to write a blog post about the experience.\nNow, I’m not active on Facebook.  While I do use Twitter, I only belong to most social media groups in order to prevent my more creative critics from attempting to pass themselves off as me.  But I am a registered user there, and so every day I am the recipient of spam from groups like Friends of Protection For Men.  Not only is the constant barrage of email annoying, but it has the counterproductive result of making me feel entirely unsympathetic to the Friends of Protection For Men.  Every time I see another stupid piece of mail from them it makes me want to kick the sender in the teeth.  Not that I often see one, of course, since my spam filter is cranked up to 11, which is why I occasionally fail to receive legitimate emails from readers attempting to contact me.  But I just looked in my Junk folder, and sure enough, there are a pair of emails from the wretched Friends that arrived this morning.\nSo, for the first time in ages, I logged onto Facebook and removed myself from the various groups into which others have conscripted me.  But, as Miss Hoyt points out, I shoudn’t have to do that.  Opt-out is reprehensible and opt-in should always be the standard.\nI appreciate that Facebook and other social media can be a useful means of contacting individuals and organizing groups.  But don’t ever sign people up for causes that you believe to be worthy, even if you are 100 percent sure that they agree with the goals of that group.  It’s just obnoxious, and to be honest, Mark Zuckerberg should be repeatedly punched in that flat, stupid, thieving face of his for his refusal to prevent Faceborg from assimilating others.",
  "tags": [
    "technology"
  ],
  "categories": [],
  "sitemap_lastmod": "2012-10-16T07:18:00+00:00"
}