{
  "url": "https://voxday.net/2012/10/06/the-decline-of-human-capability/",
  "scraped_at": "2025-12-14T05:04:49.761092",
  "title": "The decline of human capability",
  "date_display": "October 6, 2012",
  "date_iso": "2012-10-06T11:00:00+00:00",
  "date_from_url": "2012-10-06",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>Bruce Charlton posits a dark possibility:</p><blockquote class=\"tr_bq\"><p> I suspect that human capability reached its peak or plateau around<br> 1965-75 – at the time of the Apollo moon landings – and has been<br> declining ever since.  This may sound bizarre or just plain false, but the argument is simple.<br> That landing of men on the moon and bringing them back alive was the<br> supreme achievement of human capability, the most difficult problem ever<br> solved by humans. 40 years ago we could do it – repeatedly – but since<br> then we have *not* been to the moon, and I suggest the real reason we<br> have not been to the moon since 1972 is that we cannot any longer do it.<br> Humans have lost the capability.</br></br></br></br></br></br></br></br></p><p>Of course, the standard line is that humans stopped going to the moon<br> only because we no longer *wanted* to go to the moon, or could not<br> afford to, or something…– but I am suggesting that all this is BS,<br> merely excuses for not doing something which we *cannot* do.</br></br></br></p><p>It is as if an eighty year old ex-professional-cyclist was to claim that<br> the reason he had stopped competing in the Tour de France was that he<br> had now had found better ways to spend his time and money. It may be<br> true; but does not disguise the fact that an 80 year old could not<br> compete in international cycling races even if he wanted to.</br></br></br></br></p></blockquote><p>As true as this rings, I think Charlton is mistaking the decline of the West for the decline of humanity in general.  While our generation is the first in many generations to be less wealthy than its predecessors, while I am without question less generally capable than my father, and while it is easy to imagine most of the idiocracy starving or descending into savagery about one month after the system breaks down, all of these things only apply to the West.</p><p>Unlike the West, the East has not lost its values.  Even the Middle East may hope to see an imperialist renaissance of sorts once the New Caliphate is constructed and it continues the expansionary phase that began back in the 1950s.  But as for the USA, it is important to keep in mind that Ancient Egypt, Greece, Rome, and the medieval caliphates all saw a significant decline from their technological heights.  It would not be surprising, therefore, if 1972 was one day seen as the peak of America. </p><p>Especially given that 1973 marked the point at which real wages began declining as the increase of women and immigrants into the workplace finally outpaced the exit of older white men from it.  There is no singular cause of societal decline, but it increasingly appears obvious that the secular equalitarian ethic that replaced the traditional Protestant one over the course of the 20th century was one of the more important factors.  Certainly, we have not seen the unleashing of human potential and capability that was repeatedly promised by its progressive advocates.</p></div>",
  "content_text": "Bruce Charlton posits a dark possibility:\nI suspect that human capability reached its peak or plateau around\n1965-75 – at the time of the Apollo moon landings – and has been\ndeclining ever since.  This may sound bizarre or just plain false, but the argument is simple.\nThat landing of men on the moon and bringing them back alive was the\nsupreme achievement of human capability, the most difficult problem ever\nsolved by humans. 40 years ago we could do it – repeatedly – but since\nthen we have *not* been to the moon, and I suggest the real reason we\nhave not been to the moon since 1972 is that we cannot any longer do it.\nHumans have lost the capability.\nOf course, the standard line is that humans stopped going to the moon\nonly because we no longer *wanted* to go to the moon, or could not\nafford to, or something…– but I am suggesting that all this is BS,\nmerely excuses for not doing something which we *cannot* do.\nIt is as if an eighty year old ex-professional-cyclist was to claim that\nthe reason he had stopped competing in the Tour de France was that he\nhad now had found better ways to spend his time and money. It may be\ntrue; but does not disguise the fact that an 80 year old could not\ncompete in international cycling races even if he wanted to.\nAs true as this rings, I think Charlton is mistaking the decline of the West for the decline of humanity in general.  While our generation is the first in many generations to be less wealthy than its predecessors, while I am without question less generally capable than my father, and while it is easy to imagine most of the idiocracy starving or descending into savagery about one month after the system breaks down, all of these things only apply to the West.\nUnlike the West, the East has not lost its values.  Even the Middle East may hope to see an imperialist renaissance of sorts once the New Caliphate is constructed and it continues the expansionary phase that began back in the 1950s.  But as for the USA, it is important to keep in mind that Ancient Egypt, Greece, Rome, and the medieval caliphates all saw a significant decline from their technological heights.  It would not be surprising, therefore, if 1972 was one day seen as the peak of America.\nEspecially given that 1973 marked the point at which real wages began declining as the increase of women and immigrants into the workplace finally outpaced the exit of older white men from it.  There is no singular cause of societal decline, but it increasingly appears obvious that the secular equalitarian ethic that replaced the traditional Protestant one over the course of the 20th century was one of the more important factors.  Certainly, we have not seen the unleashing of human potential and capability that was repeatedly promised by its progressive advocates.",
  "tags": [
    "decline and fall",
    "society"
  ],
  "categories": [],
  "sitemap_lastmod": "2012-10-06T10:00:00+00:00"
}