{
  "url": "https://voxday.net/2012/10/30/vdh-describes-krugman-and-his-kind/",
  "scraped_at": "2025-12-14T05:06:47.937424",
  "title": "VDH describes Krugman and his kind",
  "date_display": "October 30, 2012",
  "date_iso": "2012-10-30T14:44:00+00:00",
  "date_from_url": "2012-10-30",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>VDH on <a href=\"http://pjmedia.com/victordavishanson/why-liberals-think-what-they-do/3/\">the naive and ignorant mindset</a> of the left-liberal elite</p><blockquote class=\"tr_bq\"><p> In the elite liberal mind, there is instead a sort of progressive Big<br> Rock Candy Mountain. Gasoline comes right out of the ground through the<br> nozzle into the car. Redwood 2x4s sprout from the ground like trees.<br> Apples fall like hail from the sky; stainless steel refrigerator doors<br> are mined inches from the surface. Tap water comes from some enormous<br> cistern that traps rain water.  Finished granite counter tops<br> materialize on the show room floor. Why, then, would we need Neanderthal<br> things like federal gas and oil leases, icky dams and canals, yucky<br> power plants, and gross chain saws — and especially those who would dare<br> make and use them? </br></br></br></br></br></br></br></br></br></p><p>For some, especially those who are well-educated and well-spoken, a<br> sort of irrational furor at “the system” governs their political<br> make-up. Why don’t degrees and vocabulary always translate into big<br> money? Why does sophisticated pontification at Starbucks earn less than<br> mindlessly doing accounting behind a desk? We saw this tension with<br> Michelle Obama who, prior to 2009, did not quite have enough capital to<br> get to Aspen or Costa del Sol, and thereby, despite the huge<br> power-couple salaries, Chicago mansion, and career titles, felt that<br> others had far too much more than the Obamas. “Never been proud,”<br> “downright mean country,” “raise the bar,” etc., followed, as<br> expressions of yuppie angst. The more one gets, the more one believes he<br> should get even more, and the angrier he gets that another — less<br> charismatic, less well-read, less well-spoken — always seems to get<br> more. </br></br></br></br></br></br></br></br></br></br></br></br></br></p><p>So do not discount the envy of the sophisticated elite. The unread<br> coal plant manager, the crass car dealer, or the clueless mind who farms<br> 1000 acres of almonds should not make more than the sociology<br> professor, the kindergarten teacher, the writer, the artist, or the<br> foundation officer. What sort of system would allow the dense and easily<br> fooled to become better compensated (and all for what — for superfluous<br> jet skis and snowmobiles?) than the anguished musician or tortured-soul<br> artist, who gives so much to us and receives so much less in return?<br> What a sick country — when someone who brings chain saws into the Sierra<br> would make more than a UC Berkeley professor who would stop them.</br></br></br></br></br></br></br></br></br></p></blockquote><p>And lest you think he exaggerates about the inability of the left-liberal to understand concepts as basic as where things come from, <a href=\"http://krugman.blogs.nytimes.com/2012/10/27/the-new-physiocrats/\">consider this recent offering from Paul Krugman</a>, among the most elite members of the left-liberal community.</p><blockquote class=\"tr_bq\"><p> Both Dean Baker and Josh Bivens weigh in Robert Samuelson’s outburst at the New York Times for saying that the government can too create jobs. (He went so far as to call it “flat-earth” thinking). Sadly, Samuelson’s attitude is widely shared — even, at least rhetorically, by Barack Obama.</p><p>So let me not focus on Samuelson’s piece so much as on the general proposition. What can it possibly mean to say that only the private sector can create jobs?</p><p>It could mean that government jobs aren’t “real” jobs — presumably that they don’t supply something of value to society. Samuelson disavows that position, I think — and rightly so. After all, the bulk of government workers are in education, protective services, and health. Do you really want to say that schoolteachers, firefighters, and nurses provide nothing of value?</p></blockquote><p>What Samuelson is saying, what hundreds of economists have recognized for literally centuries, is that schoolteachers, firefighters and nurses PRODUCE nothing of value.  This should be obvious, because none of them PRODUCE anything at all.  Think about it.  Suppose that everyone was either a schoolteacher, a firefighter, or a nurse.  How much wealth would be collectively produced by them?  Absolutely nothing.</p><p>Schoolteachers, firefighters, and nurses are all societal luxury goods.  They are costs, at most they may allow for the leveraging and development of more efficient productive laborers, but in themselves, they produce absolutely nothing.  Their productive value is zero.  This is something that can be easily observed by anyone who has ever seen someone teaching, firefighting, or nursing.  And yet, the most elite of the elite left-liberals genuinely cannot grasp this.  Nor is he the only one, as Baker and Bivens demonstrate.  Samuelson is too kind when he mocks them as flat-earthers.  At least the flat earthers can reasonably observe that the earth looks flat from their vantage point.</p></div>",
  "content_text": "VDH on\nthe naive and ignorant mindset\nof the left-liberal elite\nIn the elite liberal mind, there is instead a sort of progressive Big\nRock Candy Mountain. Gasoline comes right out of the ground through the\nnozzle into the car. Redwood 2x4s sprout from the ground like trees.\nApples fall like hail from the sky; stainless steel refrigerator doors\nare mined inches from the surface. Tap water comes from some enormous\ncistern that traps rain water.  Finished granite counter tops\nmaterialize on the show room floor. Why, then, would we need Neanderthal\nthings like federal gas and oil leases, icky dams and canals, yucky\npower plants, and gross chain saws — and especially those who would dare\nmake and use them?\nFor some, especially those who are well-educated and well-spoken, a\nsort of irrational furor at “the system” governs their political\nmake-up. Why don’t degrees and vocabulary always translate into big\nmoney? Why does sophisticated pontification at Starbucks earn less than\nmindlessly doing accounting behind a desk? We saw this tension with\nMichelle Obama who, prior to 2009, did not quite have enough capital to\nget to Aspen or Costa del Sol, and thereby, despite the huge\npower-couple salaries, Chicago mansion, and career titles, felt that\nothers had far too much more than the Obamas. “Never been proud,”\n“downright mean country,” “raise the bar,” etc., followed, as\nexpressions of yuppie angst. The more one gets, the more one believes he\nshould get even more, and the angrier he gets that another — less\ncharismatic, less well-read, less well-spoken — always seems to get\nmore.\nSo do not discount the envy of the sophisticated elite. The unread\ncoal plant manager, the crass car dealer, or the clueless mind who farms\n1000 acres of almonds should not make more than the sociology\nprofessor, the kindergarten teacher, the writer, the artist, or the\nfoundation officer. What sort of system would allow the dense and easily\nfooled to become better compensated (and all for what — for superfluous\njet skis and snowmobiles?) than the anguished musician or tortured-soul\nartist, who gives so much to us and receives so much less in return?\nWhat a sick country — when someone who brings chain saws into the Sierra\nwould make more than a UC Berkeley professor who would stop them.\nAnd lest you think he exaggerates about the inability of the left-liberal to understand concepts as basic as where things come from,\nconsider this recent offering from Paul Krugman\n, among the most elite members of the left-liberal community.\nBoth Dean Baker and Josh Bivens weigh in Robert Samuelson’s outburst at the New York Times for saying that the government can too create jobs. (He went so far as to call it “flat-earth” thinking). Sadly, Samuelson’s attitude is widely shared — even, at least rhetorically, by Barack Obama.\nSo let me not focus on Samuelson’s piece so much as on the general proposition. What can it possibly mean to say that only the private sector can create jobs?\nIt could mean that government jobs aren’t “real” jobs — presumably that they don’t supply something of value to society. Samuelson disavows that position, I think — and rightly so. After all, the bulk of government workers are in education, protective services, and health. Do you really want to say that schoolteachers, firefighters, and nurses provide nothing of value?\nWhat Samuelson is saying, what hundreds of economists have recognized for literally centuries, is that schoolteachers, firefighters and nurses PRODUCE nothing of value.  This should be obvious, because none of them PRODUCE anything at all.  Think about it.  Suppose that everyone was either a schoolteacher, a firefighter, or a nurse.  How much wealth would be collectively produced by them?  Absolutely nothing.\nSchoolteachers, firefighters, and nurses are all societal luxury goods.  They are costs, at most they may allow for the leveraging and development of more efficient productive laborers, but in themselves, they produce absolutely nothing.  Their productive value is zero.  This is something that can be easily observed by anyone who has ever seen someone teaching, firefighting, or nursing.  And yet, the most elite of the elite left-liberals genuinely cannot grasp this.  Nor is he the only one, as Baker and Bivens demonstrate.  Samuelson is too kind when he mocks them as flat-earthers.  At least the flat earthers can reasonably observe that the earth looks flat from their vantage point.",
  "tags": [
    "economics",
    "trainwreck"
  ],
  "categories": [],
  "sitemap_lastmod": "2012-10-30T14:44:00+00:00"
}