{
  "url": "https://voxday.net/2012/10/23/watch-what-they-do/",
  "scraped_at": "2025-12-14T05:06:04.054488",
  "title": "Watch what they do",
  "date_display": "October 23, 2012",
  "date_iso": "2012-10-23T13:30:00+00:00",
  "date_from_url": "2012-10-23",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>And not what they tell you to do.  It’s intriguing to see that <a href=\"http://news.nationalpost.com/2012/10/22/personal-choice-b-c-nurses-balk-at-forced-flu-vaccination/\">most health-care workers refuse to get the vaccinations</a> they so religiously administer to everyone else.</p><blockquote class=\"tr_bq\"><p> In August, B.C. became the first jurisdiction in Canada to legislate<br> mandatory flu shots for doctors, nurses and any other healthcare worker<br> who may come into contact with patients. In previous years, the rate of<br> inoculation for the province’s health-care workers had been below 50%,<br> one of the lowest in Canada….</br></br></br></br></p><p>In a November op-ed, University of Toronto bioethics researcher Ross<br> Upshur maintained that eschewing a flu shot fundamentally violates the<br> credo of “do no harm.” If healthcare workers “are vectors of disease for<br> hospitalized patients, they are putting patients at risk for increased<br> harm,” he said.</br></br></br></br></p><p>It is “disheartening” to see how few Canadian professionals are<br> getting the flu shot, even if they work with children and the elderly,<br> said Maher El-Masri, a nursing professor at the University of Windsor.<br> “I think we have a responsibility to protect our patients.”</br></br></br></p></blockquote><p>It would be fascinating, and I suspect extremely informative, to know if health-care workers are similarly disinclined to vaccinate their own children according the current recommended vaccine schedule.</p></div>",
  "content_text": "And not what they tell you to do.  It’s intriguing to see that\nmost health-care workers refuse to get the vaccinations\nthey so religiously administer to everyone else.\nIn August, B.C. became the first jurisdiction in Canada to legislate\nmandatory flu shots for doctors, nurses and any other healthcare worker\nwho may come into contact with patients. In previous years, the rate of\ninoculation for the province’s health-care workers had been below 50%,\none of the lowest in Canada….\nIn a November op-ed, University of Toronto bioethics researcher Ross\nUpshur maintained that eschewing a flu shot fundamentally violates the\ncredo of “do no harm.” If healthcare workers “are vectors of disease for\nhospitalized patients, they are putting patients at risk for increased\nharm,” he said.\nIt is “disheartening” to see how few Canadian professionals are\ngetting the flu shot, even if they work with children and the elderly,\nsaid Maher El-Masri, a nursing professor at the University of Windsor.\n“I think we have a responsibility to protect our patients.”\nIt would be fascinating, and I suspect extremely informative, to know if health-care workers are similarly disinclined to vaccinate their own children according the current recommended vaccine schedule.",
  "tags": [
    "vaccines"
  ],
  "categories": [],
  "sitemap_lastmod": "2012-10-23T12:30:00+00:00"
}