{
  "url": "https://voxday.net/2012/10/01/wnd-column-3/",
  "scraped_at": "2025-12-14T05:04:34.682510",
  "title": "WND column",
  "date_display": "October 1, 2012",
  "date_iso": "2012-10-01T07:51:00+00:00",
  "date_from_url": "2012-10-01",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p><b><a href=\"http://www.wnd.com/2012/09/a-government-of-lies/\">A Government of Lies</a></b></p><p>For years, the media and all right-thinking individuals have<br> ridiculed the Americans who don’t believe the official story that Saudi<br> hijackers armed with box cutters brought down three buildings in New<br> York, deriding them as “truthers.” Since 2008, the media and all<br> right-thinking individuals have ridiculed the Americans who don’t<br> believe the official story that Barack Obama was born in Hawaii to<br> married parents, deriding them as “birthers.”</br></br></br></br></br></br></p><p>What, then, shall we call the Americans who don’t believe the<br> official story that the Libyan assault on the American consulate in<br> Benghazi, which killed four Americans, including the American ambassador<br> to Libya, was the direct consequence of a YouTube film produced by an<br> immigrant scam artist? Shall we call them “filmers”?</br></br></br></br></p></div>",
  "content_text": "A Government of Lies\nFor years, the media and all right-thinking individuals have\nridiculed the Americans who don’t believe the official story that Saudi\nhijackers armed with box cutters brought down three buildings in New\nYork, deriding them as “truthers.” Since 2008, the media and all\nright-thinking individuals have ridiculed the Americans who don’t\nbelieve the official story that Barack Obama was born in Hawaii to\nmarried parents, deriding them as “birthers.”\nWhat, then, shall we call the Americans who don’t believe the\nofficial story that the Libyan assault on the American consulate in\nBenghazi, which killed four Americans, including the American ambassador\nto Libya, was the direct consequence of a YouTube film produced by an\nimmigrant scam artist? Shall we call them “filmers”?",
  "tags": [
    "WND"
  ],
  "categories": [],
  "sitemap_lastmod": "2012-10-01T06:51:00+00:00"
}