{
  "url": "https://voxday.net/2012/10/08/wnd-column_8/",
  "scraped_at": "2025-12-14T05:04:56.782003",
  "title": "WND column",
  "date_display": "October 8, 2012",
  "date_iso": "2012-10-08T08:07:00+00:00",
  "date_from_url": "2012-10-08",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p><a href=\"http://www.wnd.com/2012/10/debased-money-debased-marriages/\"><b>Debased Money, Debased Marriages</b></a><br> <em><br/></em><br> <em>“When a government compulsorily overvalues one type of money and<br> undervalues another, the undervalued money will leave the country or<br> disappear from circulation into hoards, while the overvalued money will<br> flood into circulation.”</br></br></br></em><strong> </strong><br> <strong>– Gresham’s law, Sir Thomas Gresham</strong></br></br></br></p><p>When gasoline prices are rapidly approaching $5 per gallon, it is no<br> secret that U.S. money does not buy what it used to. Even if we use the<br> CPI-U, which significantly underestimates historical inflation, the<br> value of a dollar in 2012 is approximately one-twenty fifth of a dollar<br> in 1913, when the Federal Reserve was first given the responsibility of<br> ensuring stable prices. How a relentless increase in prices is somehow<br> equated with price stability remains a mystery to everyone not working<br> for the Federal Reserve or seated in Congress; if this performance is<br> considered successful, one can only wonder what would constitute<br> failure.</br></br></br></br></br></br></br></br></br></p></div>",
  "content_text": "Debased Money, Debased Marriages\n“When a government compulsorily overvalues one type of money and\nundervalues another, the undervalued money will leave the country or\ndisappear from circulation into hoards, while the overvalued money will\nflood into circulation.”\n– Gresham’s law, Sir Thomas Gresham\nWhen gasoline prices are rapidly approaching $5 per gallon, it is no\nsecret that U.S. money does not buy what it used to. Even if we use the\nCPI-U, which significantly underestimates historical inflation, the\nvalue of a dollar in 2012 is approximately one-twenty fifth of a dollar\nin 1913, when the Federal Reserve was first given the responsibility of\nensuring stable prices. How a relentless increase in prices is somehow\nequated with price stability remains a mystery to everyone not working\nfor the Federal Reserve or seated in Congress; if this performance is\nconsidered successful, one can only wonder what would constitute\nfailure.",
  "tags": [
    "society",
    "WND"
  ],
  "categories": [],
  "sitemap_lastmod": "2012-10-08T07:07:00+00:00"
}