{
  "url": "https://voxday.net/2012/10/29/wnd-column_29/",
  "scraped_at": "2025-12-14T05:06:38.647079",
  "title": "WND column",
  "date_display": "October 29, 2012",
  "date_iso": "2012-10-29T08:03:00+00:00",
  "date_from_url": "2012-10-29",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p><a href=\"http://www.wnd.com/2012/10/is-obama-unfit-for-command/\"><b>Is Obama unfit for command?</b></a></p><p>There were no American helicopters shot down at the CIA annex in<br> Benghazi. But those who have seen the movie, “Blackhawk Down,” will<br> surely recall the scene where the two Delta snipers, Randy Shugart and<br> Gary Gordon, are desperately fighting off the Somali attackers, who are<br> attempting to capture the crew of the downed Black Hawk. Shugart and<br> Gordon, valiant men who were both posthumously awarded the congressional<br> Medal of Honor, killed 25 Somalis while defending the crew before being<br> killed by the enemy militia.</br></br></br></br></br></br></br></p><p>As the details of the large-scale attacks on the American diplomatic<br> compound and the CIA annex gradually leak out into the press, it appears<br> that two of the four fallen Americans, former Navy SEALs Tyrone Woods<br> and Glen Doherty, died fighting in a manner no less valorous than Sgt.<br> 1st Class Shugart and Master Sgt. Gordon.</br></br></br></br></p></div>",
  "content_text": "Is Obama unfit for command?\nThere were no American helicopters shot down at the CIA annex in\nBenghazi. But those who have seen the movie, “Blackhawk Down,” will\nsurely recall the scene where the two Delta snipers, Randy Shugart and\nGary Gordon, are desperately fighting off the Somali attackers, who are\nattempting to capture the crew of the downed Black Hawk. Shugart and\nGordon, valiant men who were both posthumously awarded the congressional\nMedal of Honor, killed 25 Somalis while defending the crew before being\nkilled by the enemy militia.\nAs the details of the large-scale attacks on the American diplomatic\ncompound and the CIA annex gradually leak out into the press, it appears\nthat two of the four fallen Americans, former Navy SEALs Tyrone Woods\nand Glen Doherty, died fighting in a manner no less valorous than Sgt.\n1st Class Shugart and Master Sgt. Gordon.",
  "tags": [
    "politics",
    "war"
  ],
  "categories": [],
  "sitemap_lastmod": "2012-10-29T08:03:00+00:00"
}