{
  "url": "https://voxday.net/2024/07/28/birds-of-a-feather-2/",
  "scraped_at": "2026-01-08T14:39:14.385653",
  "title": "Birds of a Feather",
  "date_display": "July 28, 2024",
  "date_iso": "2024-07-28T16:16:20+00:00",
  "date_from_url": "2024-07-28",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>Wowzers, they made quite the creative pair… <a href=\"https://www.amazon.com/Sandman-Book-Dreams-Neil-Gaiman-ebook/dp/B09XMTN71L/\">the publisher disappeared Kramer’s name</a> at some point, just as SFWA tried to claim that the convicted pedophile wasn’t still an active member of the organization when he was still in their member’s address book, both print and online. Birds of a feather and all that…</p><div class=\"wp-block-image\"><figure class=\"aligncenter size-full\"><img alt=\"\" class=\"wp-image-63815\" decoding=\"async\" fetchpriority=\"high\" height=\"784\" sizes=\"(max-width: 512px) 100vw, 512px\" src=\"https://voxday.net/wp-content/uploads/2024/07/image-44.png\" srcset=\"https://voxday.net/wp-content/uploads/2024/07/image-44.png 512w, https://voxday.net/wp-content/uploads/2024/07/image-44-196x300.png 196w\" width=\"512\"/></figure></div><p class=\"has-text-align-justify\"><strong>EDITORS</strong></p><p><strong>Neil Gaiman</strong> has been awarded more Will Eisner Comic Industry Awards than any other creator, took the World Fantasy Award for <em>The Sandman</em> #19 (making it the first comic ever to win a prose literary award), and has awards for his comics from England, Finland, Canada, Austria, Spain, and Brazil. His miscellany, <em>Angels and Visitations</em>, was nominated for two World Fantasy Awards, and was awarded the International Horror Critics Guild for Best Collection. In addition to <em>The Sandman</em> he is the author of such graphic novels as <em>Signal to Noise, Mr. Punch</em>, and <em>Violent Cases</em>. He cowrote, with Terry Pratchett, <em>Good Omens</em>, a funny novel about how the world is going to end and we’re all going to die. He just made a six-part TV series for the BBC called <em>Neverwhere</em>, and is working on a <em>Neverwhere</em> novel. He has just finished his first book for children, <em>The Day I Swapped My Dad for Two Goldfish</em>, and was surprised to find himself acting in the BBC Radio adaptation of <em>Signal to Noise</em>. The <em>Sandman</em> collection <em>Dream Country</em> was picked by Waterstones and <em>The Observer</em> as one of the ten coolest books of the 1990s. He is 35 years old, and is intimately familiar with jet lag in all its forms.</p><p><em>On July 3, 2024, Neil Gaiman was accused of sexual assault by two women in a four-part podcast series by Tortoise Media. Neil Gaiman is reported to have denied the charges, but has yet to make any public statement about them.</em></p><p><strong>Edward E. Kramer</strong> is a writer and coeditor of <em>Grails</em> (nominated for the World Fantasy Award for Best Anthology of 1992), <em>Confederacy of the Dead, Phobias, Dark Destiny, Elric: Tales of the White Wolf, Excalibur, Tombs, Dark Love, Forbidden Acts</em>, and many additional works in progress. Ed’s original fiction appears in a number of anthologies as well; his first novel, <em>Killing Time</em>, is forthcoming from White Wolf. His credits also include over a decade of work as a music critic and photojournalist. A graduate of the Emory University School of Medicine, Ed is a clinical and educational consultant in Atlanta. He is fond of human skulls, exotic snakes, and underground caves.</p><p><em>Kramer was arrested on August 25, 2000 and charged with molesting three teenage boys. The ensuing investigation revealed that Kramer had previously been accused of molestation in 1997 before the alleged victim recanted.</em> <em>On December 2, 2013 Kramer pleaded guilty to one charge for each of the three victims. On February 27, 2019, Kramer was arrested by officers from the Lawrenceville Police Department for allegedly taking photos of a young boy at a doctor’s office. Kramer was later charged with possession of child pornography.</em></p><p><strong>UPDATE: </strong>Neil Gaiman has reportedly hired the same US lawyer who has represented Prince Andrew and Danny Masterson. The same Danny Masterson who got 30 years in prison. Since he’s not currently facing any charges this strongly suggests that he’s expecting to be arrested and charged for crimes committed in the USA.</p><p><strong>UPDATE: </strong>A third accuser <a href=\"https://open.spotify.com/episode/47enk8V96GGkJtXEgwpXbs?si=B4d_c_7cS7uuYSJMS9Jbmw\">has now come forward</a> about her experience with Gaiman after meeting him at a book signing in 2014.</p><p><em>Claire uses a pseudonym to share her story about being groomed and sexually coerced and manipulated by world-renowned author Neil Gaiman. We discuss the power of stories and fame, and she shares how journaling, therapy, and friendships have helped her find her center in her own story. We originally spoke in 2022, and at that time she decided she wasn’t ready, but said that if other survivors came forward, she would join them. Several weeks ago two women came forward and shared abuse stories about Neil Gaiman. Claire reached out to me to support herself and them and all survivors by sharing her story today.</em></p><p>There will be more. There will very likely be dozens more.</p><p><em><a href=\"https://social.infogalactic.com/micropost/aac0fffd-c8df-4ebb-b13c-35df24c34156\">DISCUSS ON SG</a></em></p></div>",
  "content_text": "Wowzers, they made quite the creative pair…\nthe publisher disappeared Kramer’s name\nat some point, just as SFWA tried to claim that the convicted pedophile wasn’t still an active member of the organization when he was still in their member’s address book, both print and online. Birds of a feather and all that…\nEDITORS\nNeil Gaiman\nhas been awarded more Will Eisner Comic Industry Awards than any other creator, took the World Fantasy Award for\nThe Sandman\n#19 (making it the first comic ever to win a prose literary award), and has awards for his comics from England, Finland, Canada, Austria, Spain, and Brazil. His miscellany,\nAngels and Visitations\n, was nominated for two World Fantasy Awards, and was awarded the International Horror Critics Guild for Best Collection. In addition to\nThe Sandman\nhe is the author of such graphic novels as\nSignal to Noise, Mr. Punch\n, and\nViolent Cases\n. He cowrote, with Terry Pratchett,\nGood Omens\n, a funny novel about how the world is going to end and we’re all going to die. He just made a six-part TV series for the BBC called\nNeverwhere\n, and is working on a\nNeverwhere\nnovel. He has just finished his first book for children,\nThe Day I Swapped My Dad for Two Goldfish\n, and was surprised to find himself acting in the BBC Radio adaptation of\nSignal to Noise\n. The\nSandman\ncollection\nDream Country\nwas picked by Waterstones and\nThe Observer\nas one of the ten coolest books of the 1990s. He is 35 years old, and is intimately familiar with jet lag in all its forms.\nOn July 3, 2024, Neil Gaiman was accused of sexual assault by two women in a four-part podcast series by Tortoise Media. Neil Gaiman is reported to have denied the charges, but has yet to make any public statement about them.\nEdward E. Kramer\nis a writer and coeditor of\nGrails\n(nominated for the World Fantasy Award for Best Anthology of 1992),\nConfederacy of the Dead, Phobias, Dark Destiny, Elric: Tales of the White Wolf, Excalibur, Tombs, Dark Love, Forbidden Acts\n, and many additional works in progress. Ed’s original fiction appears in a number of anthologies as well; his first novel,\nKilling Time\n, is forthcoming from White Wolf. His credits also include over a decade of work as a music critic and photojournalist. A graduate of the Emory University School of Medicine, Ed is a clinical and educational consultant in Atlanta. He is fond of human skulls, exotic snakes, and underground caves.\nKramer was arrested on August 25, 2000 and charged with molesting three teenage boys. The ensuing investigation revealed that Kramer had previously been accused of molestation in 1997 before the alleged victim recanted.\nOn December 2, 2013 Kramer pleaded guilty to one charge for each of the three victims. On February 27, 2019, Kramer was arrested by officers from the Lawrenceville Police Department for allegedly taking photos of a young boy at a doctor’s office. Kramer was later charged with possession of child pornography.\nUPDATE:\nNeil Gaiman has reportedly hired the same US lawyer who has represented Prince Andrew and Danny Masterson. The same Danny Masterson who got 30 years in prison. Since he’s not currently facing any charges this strongly suggests that he’s expecting to be arrested and charged for crimes committed in the USA.\nUPDATE:\nA third accuser\nhas now come forward\nabout her experience with Gaiman after meeting him at a book signing in 2014.\nClaire uses a pseudonym to share her story about being groomed and sexually coerced and manipulated by world-renowned author Neil Gaiman. We discuss the power of stories and fame, and she shares how journaling, therapy, and friendships have helped her find her center in her own story. We originally spoke in 2022, and at that time she decided she wasn’t ready, but said that if other survivors came forward, she would join them. Several weeks ago two women came forward and shared abuse stories about Neil Gaiman. Claire reached out to me to support herself and them and all survivors by sharing her story today.\nThere will be more. There will very likely be dozens more.\nDISCUSS ON SG",
  "tags": [
    "freakshow",
    "Pink SF",
    "SFWA",
    "SJW"
  ],
  "categories": [],
  "sitemap_lastmod": "2024-07-28T20:16:28+00:00"
}