{
  "url": "https://voxday.net/2024/07/13/do-not-talk-about-neil-gaiman/",
  "scraped_at": "2026-01-08T14:37:37.753380",
  "title": "Do NOT Talk About Neil Gaiman",
  "date_display": "July 13, 2024",
  "date_iso": "2024-07-13T14:01:32+00:00",
  "date_from_url": "2024-07-13",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>Especially not anywhere that is devoted to talking about him. The Reddit community devoted to discussing Neil Gaiman <a href=\"https://www.reddit.com/r/neilgaiman/comments/1e18201/update/\">has banned all discussion of his personal life</a>. Only discussion of his work will be permitted.</p><p><em>The first rule of Neil Gaiman club: don’t talk about Neil Gaiman.</em></p><blockquote class=\"wp-block-quote is-layout-flow wp-block-quote-is-layout-flow\"><p>I wanted to take this opportunity to provide some updates regarding the direction of our community. After carefully considering all the feedback received, I have decided to shift the focus of the sub from Neil and his personal life to solely his work. This decision was not made lightly, and I spent considerable time pondering this matter.</p><p>Consequently, you may have noticed some changes such as the removal of Neil’s face as the sub’s avatar, the retirement of the “Good Gaiman” flair, and some adjustments to the rules. I have also archived older posts and updated the automod. This also means the response thread will now be closed. It’s important to note that this change is not intended to discourage discussions about Neil’s life or the significance of biographical context in his work. Instead, it aims to foster meaningful analysis and critique of his work within those contexts along with other forms of literary criticism.</p><p>In arriving at this decision, I sought guidance from Reddit’s crisis management team and consulted with moderators from other subs focused on notable individuals. I also reviewed information from sexual assault support sites, as well as reports and papers from educational institutions and law firms. Additionally, I reflected on my own experiences with grooming and considered this matter from the perspectives of being a partner, a parent, a child, and a sibling. It is essential to approach this situation with integrity and empathy for all parties involved.</p><p>Our community is committed to upholding the principles of believing victims and recognizing the presumption of innocence until proven guilty. These are not conflicting ideas but fundamental principles that ensure fairness for all involved: we believe when someone says something happened to support a fair investigation while also believing the accused is innocent to ensure fair representation. We are not vigilantes.</p><p>Moving forward, the sub will enforce a zero-tolerance policy for defamation, including victim blaming and baseless accusations.</p></blockquote><p><strong>Translation: </strong>Even Mr. Tubcuddle’s biggest fans believe he’s probably guilty as charged, and that more is eventually going to come out, but they don’t want him to be cancelled, so they’re just going to pretend that his personal life has no connection to the dark fantasies that he expresses throughout his violent and sexually-deviant work.</p><p>It would appear that they’ve done this in order to justify eliminating the very detailed summaries of the accusations as well as the exposures of Gaiman’s inadequate and dishonest responses to those accusations that were being posted in the forum about him. That being said, the moderator hasn’t deleted any of the previous discussions yet, so it’s possible that they just want to prevent any further damage to their hero’s reputation.</p><p>The media is really doing a full-court press to try to protect Gaiman. This is the sum total of what presently appears on his Wikipedia page about the matter.</p><p><em><strong>Accusation of sexual assault</strong><br/>In July 2024, Tortoise Media reported that Gaiman was accused by two women of sexual assault, and that Gaiman had denied both of the accusations.</em></p><p>It’s rather amusing that there is far more critical content about me on Wikipedia than there is about Gaiman, despite his alleged sex crimes.</p><p>In any event, it’s pretty sure his ex-wife knows what’s happening. These are what would appear to be highly-prescient lyrics from her song <em>Whakanewha</em>, recorded in 2024.</p><p><em>Another clear-cut load of crap<br/>A few more corpses in the sack<br/>You’ll get away with it, it’s just the same old script<br/>This world is shaped to have your back<br/>You said, “I’m sorry,” then you ran<br/>And went and did it all again<br/>I’m such a fool, I know<br/>Street smart but gullible<br/>I see the good in everything<br/>A pound of flax, a pound of steel<br/>I may be dumb, but I can feel<br/>I wonder when you’ll realize what you had</em><br/><br/><em>A frightened bird, a crystal ball<br/>So sad, you could’ve had it all<br/>But you hate yourself too much to want all that<br/>I had so much hope for your broken heart<br/>But you’ve made your choice, and you chose the dark</em></p><p><em><a href=\"https://social.infogalactic.com/micropost/09261ee5-fd0e-4c74-ad03-b6e4f91e65b0\">DISCUSS ON SG</a></em></p></div>",
  "content_text": "Especially not anywhere that is devoted to talking about him. The Reddit community devoted to discussing Neil Gaiman\nhas banned all discussion of his personal life\n. Only discussion of his work will be permitted.\nThe first rule of Neil Gaiman club: don’t talk about Neil Gaiman.\nI wanted to take this opportunity to provide some updates regarding the direction of our community. After carefully considering all the feedback received, I have decided to shift the focus of the sub from Neil and his personal life to solely his work. This decision was not made lightly, and I spent considerable time pondering this matter.\nConsequently, you may have noticed some changes such as the removal of Neil’s face as the sub’s avatar, the retirement of the “Good Gaiman” flair, and some adjustments to the rules. I have also archived older posts and updated the automod. This also means the response thread will now be closed. It’s important to note that this change is not intended to discourage discussions about Neil’s life or the significance of biographical context in his work. Instead, it aims to foster meaningful analysis and critique of his work within those contexts along with other forms of literary criticism.\nIn arriving at this decision, I sought guidance from Reddit’s crisis management team and consulted with moderators from other subs focused on notable individuals. I also reviewed information from sexual assault support sites, as well as reports and papers from educational institutions and law firms. Additionally, I reflected on my own experiences with grooming and considered this matter from the perspectives of being a partner, a parent, a child, and a sibling. It is essential to approach this situation with integrity and empathy for all parties involved.\nOur community is committed to upholding the principles of believing victims and recognizing the presumption of innocence until proven guilty. These are not conflicting ideas but fundamental principles that ensure fairness for all involved: we believe when someone says something happened to support a fair investigation while also believing the accused is innocent to ensure fair representation. We are not vigilantes.\nMoving forward, the sub will enforce a zero-tolerance policy for defamation, including victim blaming and baseless accusations.\nTranslation:\nEven Mr. Tubcuddle’s biggest fans believe he’s probably guilty as charged, and that more is eventually going to come out, but they don’t want him to be cancelled, so they’re just going to pretend that his personal life has no connection to the dark fantasies that he expresses throughout his violent and sexually-deviant work.\nIt would appear that they’ve done this in order to justify eliminating the very detailed summaries of the accusations as well as the exposures of Gaiman’s inadequate and dishonest responses to those accusations that were being posted in the forum about him. That being said, the moderator hasn’t deleted any of the previous discussions yet, so it’s possible that they just want to prevent any further damage to their hero’s reputation.\nThe media is really doing a full-court press to try to protect Gaiman. This is the sum total of what presently appears on his Wikipedia page about the matter.\nAccusation of sexual assault\nIn July 2024, Tortoise Media reported that Gaiman was accused by two women of sexual assault, and that Gaiman had denied both of the accusations.\nIt’s rather amusing that there is far more critical content about me on Wikipedia than there is about Gaiman, despite his alleged sex crimes.\nIn any event, it’s pretty sure his ex-wife knows what’s happening. These are what would appear to be highly-prescient lyrics from her song\nWhakanewha\n, recorded in 2024.\nAnother clear-cut load of crap\nA few more corpses in the sack\nYou’ll get away with it, it’s just the same old script\nThis world is shaped to have your back\nYou said, “I’m sorry,” then you ran\nAnd went and did it all again\nI’m such a fool, I know\nStreet smart but gullible\nI see the good in everything\nA pound of flax, a pound of steel\nI may be dumb, but I can feel\nI wonder when you’ll realize what you had\nA frightened bird, a crystal ball\nSo sad, you could’ve had it all\nBut you hate yourself too much to want all that\nI had so much hope for your broken heart\nBut you’ve made your choice, and you chose the dark\nDISCUSS ON SG",
  "tags": [
    "freakshow",
    "media"
  ],
  "categories": [],
  "sitemap_lastmod": "2024-07-13T14:44:34+00:00"
}