{
  "url": "https://voxday.net/2024/07/13/evolutionists-are-retarded/",
  "scraped_at": "2026-01-08T14:37:35.883918",
  "title": "Evolutionists are Retarded",
  "date_display": "July 13, 2024",
  "date_iso": "2024-07-13T10:12:25+00:00",
  "date_from_url": "2024-07-13",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>It’s almost astonishing to read the papers and presentations of the 1966 Symposium and see how a) biologists simply do not understand the logical and mathematical criticisms of their vacuous tautologies, and b) how their futile defenses of evolution by natural selection haven’t substantively changed in nearly sixty years despite all of the advances in genetics. Consider the similarities between three following attempts, separated by 55 years, to address the obvious problem of probability and fixation when applied to mutations, by resorting to what the evolutionists call “cumulative selection” and “massively parallel fixation”.</p><ul class=\"wp-block-list\"><li><em>Natural selection may appear to be a vacuous and tautological principle if only a single step is considered, but considered over a long succession of little steps, it is the only guiding principle that has stood up under experiment. Eden refers to the 10<sup>350</sup> proteins, each consisting of 250 amino acids. He seems to imply that it would require something like this number of operations of natural selection to arrive at a particular useful one. On the principle of the children’s game of twenty questions in which it is possible to arrive at the correct one of about a million objects by a succession of 20 yes-or-no answers, it would require less than 1250 questions to arrive at a specified one of these proteins. While this is not a perfect analogy to natural selection, it is enormously more like natural selection than the typing at random of a library of 1,000 volumes with its infinitesimal chance of arriving at any sensible result.</em> – Dr. Sewall Wright, 1966</li><li><em>I don’t know who it was first pointed out that, given enough time, a monkey bashing away at random on a typewriter could produce all the works of Shakespeare. The operative phrase is, of course, given enough time. Let us limit the task facing our monkey somewhat. Suppose that he has to produce, not the complete works of Shakespeare but just the short sentence ‘Methinks it is like a weasel’, and we shall make it relatively easy by giving him a typewriter with a restricted keyboard, one with just the 26 (capital) letters, and a space bar. How long will he take to write this one little sentence? We again use our computer monkey, but with a crucial difference in its program. It again begins by choosing a random sequence of 28 letters, just as before, it duplicates it repeatedly, but with a certain chance of random error – ‘mutation’ – in the copying. The computer examines the mutant nonsense phrases, the ‘progeny’ of the original phrase, and chooses the one which, however slightly, most resembles the target phrase, METHINKS IT IS LIKE A WEASEL. </em>– Richard Dawkins, 1988.</li><li><em>Essentially the key of my program in comparison with your hypothesis which you laid out is that, when I have this letter of G trying to change to A, that doesn’t stop this other letter to be working toward modifying itself toward this. So essentially, the key to the difference between our two models, which differ by billions of years probably, if we were to ultimately make calculations with them, is that my model allows parallel evolution of different genes.</em> – JF Gariepy, 2021</li></ul><p>Now, there is no shame in their trying to address the criticism, but the retardery lies in the fact that they believe they have addressed it successfully when they haven’t even grasped the problem correctly. None of these explanatory models hold up. What we actually have here is nothing more than ontological appeals to their own imaginations, supported by simplistic and irrelevant metaphors.</p><p><em>Somnio ergo est</em> is their motto. <em>I dream, therefore it is.</em></p><p>In this vein, consider the sum total of one biologist’s response to the mathematical arguments of a professor of electrical engineering from MIT and a French mathematician:</p><p><em>I cannot accept the mathematical arguments of M. Eden and M. P. Schutzenberger that many of the statements of the principles of evolution are tautologous. Evolutionary theory, at least to me, is certainly not vacuous.</em></p><p>That’s it. Just an appeal to his own authority. That’s literally all they’ve got. As for the three models, there are a panoply of errors and false assumptions in them, but the most fundamental mistake the three model-makers are all making should be obvious to anyone who has ever played a game involving dice. The previous die has no effect on the subsequent one and there is no cumulative result. This is particularly true for Gariepy’s model, wherein he proposes rolling two or more dice at the same time.</p><p>But there is no model that will support evolution by natural selection, and there never will be, because models require math and math clearly and comprehensively disproves even the most remote possibility of sufficient genetic fixation required for speciation taking place as a result of evolution over time.</p><blockquote class=\"wp-block-quote is-layout-flow wp-block-quote-is-layout-flow\"><p>There exists no (computer) model successfully describing undirected Darwinian evolution. Period. By “model,” we mean definitive simulations or foundational mathematics required of a hard science. We show that no meaningful information can arise from an evolutionary process unless that process is guided. Even when guided, the degree of evolution’s accomplishment is limited by the expertise of the guiding information source — a limit we call Basener’s ceiling. An evolutionary program whose goal is to master chess will never evolve further and offer investment advice. There exists no model successfully describing undirected Darwinian evolution. Hard sciences are built on foundations of mathematics or definitive simulations. Examples include electromagnetics, Newtonian mechanics, geophysics, relativity, thermodynamics, quantum mechanics, optics, and many areas in biology. Those hoping to establish Darwinian evolution as a hard science with a model have either failed or inadvertently cheated.</p> <cite>Top Ten Questions and Objections to ‘Introduction to Evolutionary Informatics’ – Robert J. Marks II – June 12, 2017</cite></blockquote><p><em><a href=\"https://social.infogalactic.com/micropost/8cf11e4d-a590-47d6-afa3-0c9832f333e9\">DISCUSS ON SG</a></em></p></div>",
  "content_text": "It’s almost astonishing to read the papers and presentations of the 1966 Symposium and see how a) biologists simply do not understand the logical and mathematical criticisms of their vacuous tautologies, and b) how their futile defenses of evolution by natural selection haven’t substantively changed in nearly sixty years despite all of the advances in genetics. Consider the similarities between three following attempts, separated by 55 years, to address the obvious problem of probability and fixation when applied to mutations, by resorting to what the evolutionists call “cumulative selection” and “massively parallel fixation”.\nNatural selection may appear to be a vacuous and tautological principle if only a single step is considered, but considered over a long succession of little steps, it is the only guiding principle that has stood up under experiment. Eden refers to the 10\n350\nproteins, each consisting of 250 amino acids. He seems to imply that it would require something like this number of operations of natural selection to arrive at a particular useful one. On the principle of the children’s game of twenty questions in which it is possible to arrive at the correct one of about a million objects by a succession of 20 yes-or-no answers, it would require less than 1250 questions to arrive at a specified one of these proteins. While this is not a perfect analogy to natural selection, it is enormously more like natural selection than the typing at random of a library of 1,000 volumes with its infinitesimal chance of arriving at any sensible result.\n– Dr. Sewall Wright, 1966\nI don’t know who it was first pointed out that, given enough time, a monkey bashing away at random on a typewriter could produce all the works of Shakespeare. The operative phrase is, of course, given enough time. Let us limit the task facing our monkey somewhat. Suppose that he has to produce, not the complete works of Shakespeare but just the short sentence ‘Methinks it is like a weasel’, and we shall make it relatively easy by giving him a typewriter with a restricted keyboard, one with just the 26 (capital) letters, and a space bar. How long will he take to write this one little sentence? We again use our computer monkey, but with a crucial difference in its program. It again begins by choosing a random sequence of 28 letters, just as before, it duplicates it repeatedly, but with a certain chance of random error – ‘mutation’ – in the copying. The computer examines the mutant nonsense phrases, the ‘progeny’ of the original phrase, and chooses the one which, however slightly, most resembles the target phrase, METHINKS IT IS LIKE A WEASEL.\n– Richard Dawkins, 1988.\nEssentially the key of my program in comparison with your hypothesis which you laid out is that, when I have this letter of G trying to change to A, that doesn’t stop this other letter to be working toward modifying itself toward this. So essentially, the key to the difference between our two models, which differ by billions of years probably, if we were to ultimately make calculations with them, is that my model allows parallel evolution of different genes.\n– JF Gariepy, 2021\nNow, there is no shame in their trying to address the criticism, but the retardery lies in the fact that they believe they have addressed it successfully when they haven’t even grasped the problem correctly. None of these explanatory models hold up. What we actually have here is nothing more than ontological appeals to their own imaginations, supported by simplistic and irrelevant metaphors.\nSomnio ergo est\nis their motto.\nI dream, therefore it is.\nIn this vein, consider the sum total of one biologist’s response to the mathematical arguments of a professor of electrical engineering from MIT and a French mathematician:\nI cannot accept the mathematical arguments of M. Eden and M. P. Schutzenberger that many of the statements of the principles of evolution are tautologous. Evolutionary theory, at least to me, is certainly not vacuous.\nThat’s it. Just an appeal to his own authority. That’s literally all they’ve got. As for the three models, there are a panoply of errors and false assumptions in them, but the most fundamental mistake the three model-makers are all making should be obvious to anyone who has ever played a game involving dice. The previous die has no effect on the subsequent one and there is no cumulative result. This is particularly true for Gariepy’s model, wherein he proposes rolling two or more dice at the same time.\nBut there is no model that will support evolution by natural selection, and there never will be, because models require math and math clearly and comprehensively disproves even the most remote possibility of sufficient genetic fixation required for speciation taking place as a result of evolution over time.\nThere exists no (computer) model successfully describing undirected Darwinian evolution. Period. By “model,” we mean definitive simulations or foundational mathematics required of a hard science. We show that no meaningful information can arise from an evolutionary process unless that process is guided. Even when guided, the degree of evolution’s accomplishment is limited by the expertise of the guiding information source — a limit we call Basener’s ceiling. An evolutionary program whose goal is to master chess will never evolve further and offer investment advice. There exists no model successfully describing undirected Darwinian evolution. Hard sciences are built on foundations of mathematics or definitive simulations. Examples include electromagnetics, Newtonian mechanics, geophysics, relativity, thermodynamics, quantum mechanics, optics, and many areas in biology. Those hoping to establish Darwinian evolution as a hard science with a model have either failed or inadvertently cheated.\nTop Ten Questions and Objections to ‘Introduction to Evolutionary Informatics’ – Robert J. Marks II – June 12, 2017\nDISCUSS ON SG",
  "tags": [
    "evolution",
    "science"
  ],
  "categories": [],
  "sitemap_lastmod": "2024-07-13T10:32:26+00:00"
}