{
  "url": "https://voxday.net/2024/07/03/fake-democracy-in-france/",
  "scraped_at": "2026-01-08T14:36:35.813677",
  "title": "Fake Democracy in France",
  "date_display": "July 3, 2024",
  "date_iso": "2024-07-03T22:05:31+00:00",
  "date_from_url": "2024-07-03",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>When the parties change but the policies remain the same, what you have <a href=\"https://www.rt.com/news/600346-long-live-macronism/\">is neither a democracy nor a republic</a>. It’s just democracy theater, or as they say in France, <em>le théâtre de la démocratie factice</em>.</p><blockquote class=\"wp-block-quote is-layout-flow wp-block-quote-is-layout-flow\"><p>Today it is impossible to imagine any of the ultra-left repeating the words of Georges Marchais, the leader of the French Communist Party, in 1980: “It is necessary to stop both illegal and legal immigration. It is totally unacceptable to allow more and more migrant workers into France when our country already has 2 million unemployed French people and immigrants who have already settled here.”</p><p>Today, the number of unemployed has reached almost 5.5 million, the amount of legal and illegal immigrants has increased tenfold, but the left does not see this as a problem and devotes itself primarily to fighting ‘all discrimination’. The Socialists seriously discredited themselves during the government of François Hollande, who positioned himself as ‘the enemy of international finance’ but did very little to protect the poor, presenting the ‘marriage equality’ law as his main achievement…</p><p>Opponents can be as radical as they like in words, but when it comes to action they are unable to offer a real alternative to the policies of their predecessors. This can be seen in other European countries where ‘extremists’ have been in power. The French far-right and far-left have toned down their criticism of Brussels and, if they come to power, a relatively smooth integration into pan-European structures is more likely than an attempt by Paris at radical reform (as the representatives of the National Rally and the leaders of France Unbowed recently insisted). The statements and actions of the opposition may be vibrant and demonstrative, they may cause riots and protests, they may lead to internal chaos. But they are unlikely to be able to break the general development trend.</p><p>The economist Frederick Farah has pointed out that <em>“over the past few decades, we have seen that whatever majority is in power, it implements roughly the same policies, leading to the deterioration of working conditions and stable employment, the dismantling of public services, increased poverty, the reduction of the country’s industrial base, strategic vulnerability and the rise of populism.”</em></p></blockquote><p>This is why the sovereign nations are finally winning the rhetorical battle against Clown World and its fake democracies, false freedoms, and inverted rights. Seventy years of empty promises and false assurances have not brought about the shiny, sexy, seculartopia of the future that convinced the people of Christendom to abandon their traditions, their faith, and their cultures, but have instead delivered invasion, poverty, depravity, and soon, military defeat.</p><p>Reality always trumps rhetoric over time.</p><p><em><a href=\"https://social.infogalactic.com/micropost/c4b16181-6ff5-41d4-abd5-214032b45f30\">DISCUSS ON SG</a></em></p></div>",
  "content_text": "When the parties change but the policies remain the same, what you have\nis neither a democracy nor a republic\n. It’s just democracy theater, or as they say in France,\nle théâtre de la démocratie factice\n.\nToday it is impossible to imagine any of the ultra-left repeating the words of Georges Marchais, the leader of the French Communist Party, in 1980: “It is necessary to stop both illegal and legal immigration. It is totally unacceptable to allow more and more migrant workers into France when our country already has 2 million unemployed French people and immigrants who have already settled here.”\nToday, the number of unemployed has reached almost 5.5 million, the amount of legal and illegal immigrants has increased tenfold, but the left does not see this as a problem and devotes itself primarily to fighting ‘all discrimination’. The Socialists seriously discredited themselves during the government of François Hollande, who positioned himself as ‘the enemy of international finance’ but did very little to protect the poor, presenting the ‘marriage equality’ law as his main achievement…\nOpponents can be as radical as they like in words, but when it comes to action they are unable to offer a real alternative to the policies of their predecessors. This can be seen in other European countries where ‘extremists’ have been in power. The French far-right and far-left have toned down their criticism of Brussels and, if they come to power, a relatively smooth integration into pan-European structures is more likely than an attempt by Paris at radical reform (as the representatives of the National Rally and the leaders of France Unbowed recently insisted). The statements and actions of the opposition may be vibrant and demonstrative, they may cause riots and protests, they may lead to internal chaos. But they are unlikely to be able to break the general development trend.\nThe economist Frederick Farah has pointed out that\n“over the past few decades, we have seen that whatever majority is in power, it implements roughly the same policies, leading to the deterioration of working conditions and stable employment, the dismantling of public services, increased poverty, the reduction of the country’s industrial base, strategic vulnerability and the rise of populism.”\nThis is why the sovereign nations are finally winning the rhetorical battle against Clown World and its fake democracies, false freedoms, and inverted rights. Seventy years of empty promises and false assurances have not brought about the shiny, sexy, seculartopia of the future that convinced the people of Christendom to abandon their traditions, their faith, and their cultures, but have instead delivered invasion, poverty, depravity, and soon, military defeat.\nReality always trumps rhetoric over time.\nDISCUSS ON SG",
  "tags": [
    "decline and fall",
    "EU",
    "rhetoric"
  ],
  "categories": [],
  "sitemap_lastmod": "2024-07-03T22:05:32+00:00"
}