{
  "url": "https://voxday.net/2024/07/06/four-episodes-of-mr-tubcuddle-scientologist/",
  "scraped_at": "2026-01-08T14:36:54.158402",
  "title": "Four Episodes of Mr. Tubcuddle, Scientologist",
  "date_display": "July 6, 2024",
  "date_iso": "2024-07-06T08:58:38+00:00",
  "date_from_url": "2024-07-06",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>Even Neil Gaiman’s biggest fans think his self-defense <a href=\"https://old.reddit.com/r/neilgaiman/comments/1dvzt75/after_listening_to_all_four_episodes_the_facts/\">is inadequate and troublesome</a> after listening to all four episodes of the Tortoise revelations about him.</p><blockquote class=\"wp-block-quote is-layout-flow wp-block-quote-is-layout-flow\"><p>After Listening to all four episodes: the facts themselves are bad</p><p>Let’s take a step back and assume, for the sake of argument, that literally everything that the women are saying is false, and that Gaiman’s version of events is closer to the truth. It is as exonerating as it can possibly be.</p><p>Gaiman still has a history of exploiting younger, inexperienced women who are either starstruck by him, or dependent on him, causing an absolutely massive power imbalance. He does this despite being married in an open relationship, and seems unwilling to be clear that he cannot commit to them.</p><p>This is if he is being entirely honest. At one point in the podcast to exonerate himself, he sends an email of K saying that she can’t wait to visit, her “loins are desperate” (not exactly it, but close) that’s from 2017, way after their relationship ended. When the journalists dug deeper they found that it was part of an email chain where he told her he was working with David Tennant, who she had a crush on, and her jokey “horniness” is clearly in reaction to Tennant. This shows that he is absolutely willing to mislead or to misrepresent evidence when it comes to this.</p><p>While there is no direct evidence of assault in Scarlett’s story, there’s a lot of smoke. Gaiman being accused of assault by Scarlett’s friends is indisputably something that happened. As is her saying that what happened “pushed boundaries” at the time.</p><p>If you insist that the benchmark needs to be: overt rape or bust, then sure, the evidence is probably insufficient. Even the podcast seems to walk it back to “sexual abuse” the vast majority of the time. But…sexual abuse is pretty bad. There is a very wide spectrum of treating women in a shitty way before you get to outright sexual assault.</p><p>I say this as a Gaiman fanatic. As someone who is irrevocably influenced by his work. I listened to all four of these episodes because I care deeply, and what we know for certain really sucks.</p></blockquote><p>Here’s the main thing that the hapless defenders of the Scientologist Neil Gaiman are forgetting to take into account: where there’s an amount of smoke, there is usually fire.</p><p>There are two distinct accusers <em>now</em>. The a) combination of those accusations with b) Mr. Tubcuddle’s own body of work incorporating various forms of sexual abuse, sexual violence, and sexual assault, and c) Mr. Tubcuddle’s obviously suspect judgment, and d) the general degeneracy in the world of science fiction fandom, means that there will almost certainly be more accusers, more evidence, and more conclusively damning evidence forthcoming.</p><p>Here is one fan’s summary:</p><blockquote class=\"wp-block-quote is-layout-flow wp-block-quote-is-layout-flow\"><p>According to his recounting of events, in the early 2000s he met an 18 year old girl and was overly friendly to her. Then 2 years later he started dating her while married &amp; kept her existance secret, made her so upset she followed him onto an aeroplane and he had her forcibly removed. Then in response he tried to make it seem like she was thirsting after him years later when she was thirsting after David Tennant. (Aren’t we all.)</p><p>Then, in 2022, he met his son’s 21 year old Nanny who came to stay with them during a pandemic. The first time he ever met her, he got fully naked and asked to have a bath with her, then “kissed and cuddled.”</p><p>Then continued to have an ongoing BDSM &amp; sexual relationship with someone 1/3 of his age while he was her employer.</p><p>She spoke to her friends at the time and called it abuse, her friend confronted Neil’s wife Amanda Palmer, and then she responded by saying it’s a “very bad situation” (not defending him) and breaking up with him.</p><p>Then when Scarlett spoke out about what happened he said he was suicidal and manipulated her into comforting him, and in doing so got her to say it was “eventually” consensual. IN RESPONSE TO HIM SAYING HE WAS SUICIDAL.</p><p>And then he said she has a false memory disorder when she doesn’t.</p></blockquote><p>It’s readily observable from his version of events that Gaiman has been deeply and profoundly dishonest about both situations. He not only misrepresented the evidence of the context of the first woman’s emails after the fact, but sent the second woman “an NDA backdated to the day they met (when some very questionable behavior on his part occurred) as a condition for giving her six months rent money after the relationship had ended.” And he extorted a statement about consensuality from the latter with threats of suicide.</p><p>Furthermore, since Gaiman is a Scientologist, we know the Church of Scientology has a comprehensive record of his past misdeeds, at least up to the point that he claims to have left the organization, which may or may not be true. If it’s true that he was a level 8 auditor, then he wasn’t just another ignorant Hollywood celebrity recruit. Given the way Scientology operates, they quite likely have maintained an updated file on him that continues to the present. Which means the damning information is likely out there and available; don’t be too shocked if he unexpectedly rejoins Scientology in the aftermath of his public unmasking as, at the very least, a predatory, manipulative, and sexually-inappropriate creep.</p><p>It’s worth noting that he’s already threatened to kill himself over this. Which tends to indicate that there is considerably more that will come out over time, and explains why the science fiction community is being so quiet about this instead of engaging in their usual full-throated man-the-barricades approach.</p><p><strong>UPDATE: </strong>As usual, one can always trust the logic. His ex-wife, Amanda Palmer has reportedly been quoted as saying the second woman <em>“was the 14th who had come to her about what Neil did.”</em> I think we can officially put a fork in Neil Gaiman. Whether he goes to jail or not, he’s done.</p><p><strong>UPDATE: </strong>Gaiman’s father was the head of public relations for Scientology in the UK and Gaiman was actually kicked out of an Anglican school due to being a Scientologist. No wonder his work is so avowedly, and so nonsensically, anti-Christian.</p><p><em><a href=\"https://social.infogalactic.com/micropost/a8b17560-c909-4cda-937f-94c34340ee9e\">DISCUSS ON SG</a></em></p></div>",
  "content_text": "Even Neil Gaiman’s biggest fans think his self-defense\nis inadequate and troublesome\nafter listening to all four episodes of the Tortoise revelations about him.\nAfter Listening to all four episodes: the facts themselves are bad\nLet’s take a step back and assume, for the sake of argument, that literally everything that the women are saying is false, and that Gaiman’s version of events is closer to the truth. It is as exonerating as it can possibly be.\nGaiman still has a history of exploiting younger, inexperienced women who are either starstruck by him, or dependent on him, causing an absolutely massive power imbalance. He does this despite being married in an open relationship, and seems unwilling to be clear that he cannot commit to them.\nThis is if he is being entirely honest. At one point in the podcast to exonerate himself, he sends an email of K saying that she can’t wait to visit, her “loins are desperate” (not exactly it, but close) that’s from 2017, way after their relationship ended. When the journalists dug deeper they found that it was part of an email chain where he told her he was working with David Tennant, who she had a crush on, and her jokey “horniness” is clearly in reaction to Tennant. This shows that he is absolutely willing to mislead or to misrepresent evidence when it comes to this.\nWhile there is no direct evidence of assault in Scarlett’s story, there’s a lot of smoke. Gaiman being accused of assault by Scarlett’s friends is indisputably something that happened. As is her saying that what happened “pushed boundaries” at the time.\nIf you insist that the benchmark needs to be: overt rape or bust, then sure, the evidence is probably insufficient. Even the podcast seems to walk it back to “sexual abuse” the vast majority of the time. But…sexual abuse is pretty bad. There is a very wide spectrum of treating women in a shitty way before you get to outright sexual assault.\nI say this as a Gaiman fanatic. As someone who is irrevocably influenced by his work. I listened to all four of these episodes because I care deeply, and what we know for certain really sucks.\nHere’s the main thing that the hapless defenders of the Scientologist Neil Gaiman are forgetting to take into account: where there’s an amount of smoke, there is usually fire.\nThere are two distinct accusers\nnow\n. The a) combination of those accusations with b) Mr. Tubcuddle’s own body of work incorporating various forms of sexual abuse, sexual violence, and sexual assault, and c) Mr. Tubcuddle’s obviously suspect judgment, and d) the general degeneracy in the world of science fiction fandom, means that there will almost certainly be more accusers, more evidence, and more conclusively damning evidence forthcoming.\nHere is one fan’s summary:\nAccording to his recounting of events, in the early 2000s he met an 18 year old girl and was overly friendly to her. Then 2 years later he started dating her while married & kept her existance secret, made her so upset she followed him onto an aeroplane and he had her forcibly removed. Then in response he tried to make it seem like she was thirsting after him years later when she was thirsting after David Tennant. (Aren’t we all.)\nThen, in 2022, he met his son’s 21 year old Nanny who came to stay with them during a pandemic. The first time he ever met her, he got fully naked and asked to have a bath with her, then “kissed and cuddled.”\nThen continued to have an ongoing BDSM & sexual relationship with someone 1/3 of his age while he was her employer.\nShe spoke to her friends at the time and called it abuse, her friend confronted Neil’s wife Amanda Palmer, and then she responded by saying it’s a “very bad situation” (not defending him) and breaking up with him.\nThen when Scarlett spoke out about what happened he said he was suicidal and manipulated her into comforting him, and in doing so got her to say it was “eventually” consensual. IN RESPONSE TO HIM SAYING HE WAS SUICIDAL.\nAnd then he said she has a false memory disorder when she doesn’t.\nIt’s readily observable from his version of events that Gaiman has been deeply and profoundly dishonest about both situations. He not only misrepresented the evidence of the context of the first woman’s emails after the fact, but sent the second woman “an NDA backdated to the day they met (when some very questionable behavior on his part occurred) as a condition for giving her six months rent money after the relationship had ended.” And he extorted a statement about consensuality from the latter with threats of suicide.\nFurthermore, since Gaiman is a Scientologist, we know the Church of Scientology has a comprehensive record of his past misdeeds, at least up to the point that he claims to have left the organization, which may or may not be true. If it’s true that he was a level 8 auditor, then he wasn’t just another ignorant Hollywood celebrity recruit. Given the way Scientology operates, they quite likely have maintained an updated file on him that continues to the present. Which means the damning information is likely out there and available; don’t be too shocked if he unexpectedly rejoins Scientology in the aftermath of his public unmasking as, at the very least, a predatory, manipulative, and sexually-inappropriate creep.\nIt’s worth noting that he’s already threatened to kill himself over this. Which tends to indicate that there is considerably more that will come out over time, and explains why the science fiction community is being so quiet about this instead of engaging in their usual full-throated man-the-barricades approach.\nUPDATE:\nAs usual, one can always trust the logic. His ex-wife, Amanda Palmer has reportedly been quoted as saying the second woman\n“was the 14th who had come to her about what Neil did.”\nI think we can officially put a fork in Neil Gaiman. Whether he goes to jail or not, he’s done.\nUPDATE:\nGaiman’s father was the head of public relations for Scientology in the UK and Gaiman was actually kicked out of an Anglican school due to being a Scientologist. No wonder his work is so avowedly, and so nonsensically, anti-Christian.\nDISCUSS ON SG",
  "tags": [
    "freakshow",
    "Pink SF",
    "SJW"
  ],
  "categories": [],
  "sitemap_lastmod": "2024-07-06T09:41:50+00:00"
}