{
  "url": "https://voxday.net/2024/07/07/freakshow-cubed/",
  "scraped_at": "2026-01-08T14:37:01.122576",
  "title": "Freakshow Cubed",
  "date_display": "July 7, 2024",
  "date_iso": "2024-07-07T15:48:49+00:00",
  "date_from_url": "2024-07-07",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p><em>The Guardian</em> is desperately, and rather quixotically, attempting to maintain Mr. Tubcuddle’s public viability by putting him front and center of its praise for <a href=\"https://www.theguardian.com/books/article/2024/jul/06/an-explosion-of-talent-iain-bankss-the-wasp-factory-at-40?CMP=Share_iOSApp_Other\">the very worst book I have ever read in its entirety</a>. Because while I’m confident that Samuel L. Delaney’s <em>Hogg</em> and the Marquis de Sade’s <em>120 Days of Sodom</em> are even worse, I’ve declined the opportunity to wallow in the wicked filth of those literary abominations. I was not so fortunate with regards to <em>The Wasp Factory</em>, which was published 40 years ago, although the world would be a better, brighter, more beautiful place if it had not been.</p><blockquote class=\"wp-block-quote is-layout-flow wp-block-quote-is-layout-flow\"><p>It was 1984, and the publisher Macmillan was holding a small event for booksellers, and had invited a tiny handful of journalists along as well. They would be announcing upcoming titles, trying to get the booksellers excited about them. I was one of the journalists, but I only remember one author and one book from that afternoon. The author’s editor, James Hale, was thrilled about a first novel, which Macmillan would soon be publishing, and which James had discovered on the “slush pile” of unsolicited manuscripts. The author had been asked to say a few words to the assembled booksellers about himself and his book.</p><p>The author had dark, curly auburn hair and a ginger beard that was barely more than ambitious stubble. He was tall, and his accent was Scottish. He told us that he had really wanted to be a science fiction writer, that he had written several science fiction books and sent them out to publishers without attracting any interest. Then he had decided to “write what he knew”. He had taken his own obsessions as a young man, his delight in blowing things up and his fascination with homemade implements of destruction, and he had given them to Frank, a young man who also liked blowing things up but went much further than the author ever had. The author was <a href=\"https://www.theguardian.com/books/iainbanks\">Iain Banks</a>, of course, and the book was The Wasp Factory.</p><p>The story, he told us, began when Frank’s brother, Eric, escaped from a high-security psychiatric hospital, and let Frank know he was coming home. But, Iain warned us, that wasn’t what the story was about. </p></blockquote><p>What <em>The Wasp Factory</em> is about concerns an idiotic plot that wallows in nearly every form of depravity with a protagonist so retarded that he doesn’t realize he’s not a girl, he’s a boy who had his genitalia gnawed off by a dog. And this isn’t even the most disgusting aspect of the novel; the titular metaphor is even worse.</p><p>Because Iain Banks is not a terrible writer, the sheer awfulness of the book is even worse than it might otherwise have been. And it serves very well as a litmus test for the fundamental wrongness of those who admire it; besides Mr. Tubcuddle, the gentleman with whom I debated the merits and demerits of the book has now gone the way of the book’s protagonist, and, incidentally, deleted the transcript of our debate, which fortunately <a href=\"http://traffic.libsyn.com/pexlives/Pex_Lives_and_Eruditorum_Press_Present_the_Vox_Day_Interview.mp3\">can still be heard via MP3</a>.</p><p>An excerpt from the debate:</p><p><strong>Day: </strong>And this also touches on my third point, which is: this is an idiot plot. I mean, this is what Roger Ebert described as – you know, he said that “the idiot plot is any plot that would be resolved in five minutes if everyone in the story were not an idiot.” So, you’ve got somebody who literally has never looked in her pants to discover that she’s got a vagina, you’ve got the father who is beyond idiocy with the whole story about the dog and the creation of the fake genitals just in case she ever asks, and then of course you’ve got Eric, who apparently never figured out that his sister was actually his sister either. I mean, this is an idiot plot. There’s no way around that.</p><p>Sandifer: <em>This is grotesque, it’s a grotesquery. I think that the ludicrousness of it is a joke in the same spirit as “killing three people was just a phase I was going through.” I don’t think it’s an idiot plot so much as it is a parody of rural grotesquery that is deliberately at the absolute limits of what is even remotely plausible.</em></p><p>Day: I personally think it’s well beyond those limits, and, you know, I’m not saying that there’s no humor to it, but, you know, I didn’t find it funny, for the most part. The occasional one-offs, like you mention, you know, those were mildly amusing, but just to wallow in that depth of depravity and violence and murder, you know, it’s literally disgusting, and I didn’t find it funny, I didn’t find it edifying. Like I said, the plot is a literal idiot plot. Whether you want to say it’s because it was parody or not, it’s still an idiot plot. I’m not one of those people who finds… What’s that show, the guy from The Office…</p><p>Sandifer: <em>U.S. or U.K.?</em></p><p>Day: Ricky Gervais.</p><p>Sandifer: <em>Yes.</em></p><p>Day: He has that television show where he pretends to be retarded or something, and every ad he’s gurning, you know what I mean? It’s a relatively new show. I don’t find that funny either. And so, maybe the fact that it’s got an idiot plot but it’s a parody, therefore it’s supposed to make it intelligent, but to me, the plot is still what the plot is, and so I found it very, very disappointing, because the whole plot is totally dependent on the three major characters being and behaving like complete idiots.</p><p>And the problem I have when you talk about the whole psychosocial aspect of Frank is Banks, in my opinion, gets the characters completely wrong. Frank is not convincing in any way, shape, or form as a girl who believes she’s a boy, and that sort of thing. I’m pretty sure that Iain Banks never had any daughters, because if you’re a parent, and you’ve got both boys and girls, there is not a chance in hell that a little girl, even if you raise her as a boy, is going to behave like a boy.  This is where I think it goes beyond parody and is a level of absurd that is not credible. I would have found it much more credible if Frank had some female attributes and characteristics in his thinking that he couldn’t explain. But instead, like you said, he’s more of a parody of a hyper-male, and that to me makes no sense whatsoever.</p><p><strong>UPDATE: </strong>Its not your imagination. There is literally <a href=\"https://fandompulse.substack.com/p/why-is-mainstream-entertainment-media\">a media conspiracy of silence</a> regarding Neal Gaiman’s behavior toward women.</p><blockquote class=\"wp-block-quote is-layout-flow wp-block-quote-is-layout-flow\"><p>Speaking with our contacts in the comic industry, Fandom Pulse was told by an insider that there is a concerted media effort to squash this story. There are allegedly marching orders not to report on this, which makes the situation even more bizarre. Online comic forums and Facebook groups controlled by mainstream media forces shut down discussions to keep this story from getting out. If these orders are confirmed, the entertainment media corruption is on full display beyond anything we’ve ever seen. </p></blockquote><p><em><a href=\"https://social.infogalactic.com/micropost/541e5ca4-6081-4b6b-89f7-7e1069fbc53d\">DISCUSS ON SG</a></em></p></div>",
  "content_text": "The Guardian\nis desperately, and rather quixotically, attempting to maintain Mr. Tubcuddle’s public viability by putting him front and center of its praise for\nthe very worst book I have ever read in its entirety\n. Because while I’m confident that Samuel L. Delaney’s\nHogg\nand the Marquis de Sade’s\n120 Days of Sodom\nare even worse, I’ve declined the opportunity to wallow in the wicked filth of those literary abominations. I was not so fortunate with regards to\nThe Wasp Factory\n, which was published 40 years ago, although the world would be a better, brighter, more beautiful place if it had not been.\nIt was 1984, and the publisher Macmillan was holding a small event for booksellers, and had invited a tiny handful of journalists along as well. They would be announcing upcoming titles, trying to get the booksellers excited about them. I was one of the journalists, but I only remember one author and one book from that afternoon. The author’s editor, James Hale, was thrilled about a first novel, which Macmillan would soon be publishing, and which James had discovered on the “slush pile” of unsolicited manuscripts. The author had been asked to say a few words to the assembled booksellers about himself and his book.\nThe author had dark, curly auburn hair and a ginger beard that was barely more than ambitious stubble. He was tall, and his accent was Scottish. He told us that he had really wanted to be a science fiction writer, that he had written several science fiction books and sent them out to publishers without attracting any interest. Then he had decided to “write what he knew”. He had taken his own obsessions as a young man, his delight in blowing things up and his fascination with homemade implements of destruction, and he had given them to Frank, a young man who also liked blowing things up but went much further than the author ever had. The author was\nIain Banks\n, of course, and the book was The Wasp Factory.\nThe story, he told us, began when Frank’s brother, Eric, escaped from a high-security psychiatric hospital, and let Frank know he was coming home. But, Iain warned us, that wasn’t what the story was about.\nWhat\nThe Wasp Factory\nis about concerns an idiotic plot that wallows in nearly every form of depravity with a protagonist so retarded that he doesn’t realize he’s not a girl, he’s a boy who had his genitalia gnawed off by a dog. And this isn’t even the most disgusting aspect of the novel; the titular metaphor is even worse.\nBecause Iain Banks is not a terrible writer, the sheer awfulness of the book is even worse than it might otherwise have been. And it serves very well as a litmus test for the fundamental wrongness of those who admire it; besides Mr. Tubcuddle, the gentleman with whom I debated the merits and demerits of the book has now gone the way of the book’s protagonist, and, incidentally, deleted the transcript of our debate, which fortunately\ncan still be heard via MP3\n.\nAn excerpt from the debate:\nDay:\nAnd this also touches on my third point, which is: this is an idiot plot. I mean, this is what Roger Ebert described as – you know, he said that “the idiot plot is any plot that would be resolved in five minutes if everyone in the story were not an idiot.” So, you’ve got somebody who literally has never looked in her pants to discover that she’s got a vagina, you’ve got the father who is beyond idiocy with the whole story about the dog and the creation of the fake genitals just in case she ever asks, and then of course you’ve got Eric, who apparently never figured out that his sister was actually his sister either. I mean, this is an idiot plot. There’s no way around that.\nSandifer:\nThis is grotesque, it’s a grotesquery. I think that the ludicrousness of it is a joke in the same spirit as “killing three people was just a phase I was going through.” I don’t think it’s an idiot plot so much as it is a parody of rural grotesquery that is deliberately at the absolute limits of what is even remotely plausible.\nDay: I personally think it’s well beyond those limits, and, you know, I’m not saying that there’s no humor to it, but, you know, I didn’t find it funny, for the most part. The occasional one-offs, like you mention, you know, those were mildly amusing, but just to wallow in that depth of depravity and violence and murder, you know, it’s literally disgusting, and I didn’t find it funny, I didn’t find it edifying. Like I said, the plot is a literal idiot plot. Whether you want to say it’s because it was parody or not, it’s still an idiot plot. I’m not one of those people who finds… What’s that show, the guy from The Office…\nSandifer:\nU.S. or U.K.?\nDay: Ricky Gervais.\nSandifer:\nYes.\nDay: He has that television show where he pretends to be retarded or something, and every ad he’s gurning, you know what I mean? It’s a relatively new show. I don’t find that funny either. And so, maybe the fact that it’s got an idiot plot but it’s a parody, therefore it’s supposed to make it intelligent, but to me, the plot is still what the plot is, and so I found it very, very disappointing, because the whole plot is totally dependent on the three major characters being and behaving like complete idiots.\nAnd the problem I have when you talk about the whole psychosocial aspect of Frank is Banks, in my opinion, gets the characters completely wrong. Frank is not convincing in any way, shape, or form as a girl who believes she’s a boy, and that sort of thing. I’m pretty sure that Iain Banks never had any daughters, because if you’re a parent, and you’ve got both boys and girls, there is not a chance in hell that a little girl, even if you raise her as a boy, is going to behave like a boy.  This is where I think it goes beyond parody and is a level of absurd that is not credible. I would have found it much more credible if Frank had some female attributes and characteristics in his thinking that he couldn’t explain. But instead, like you said, he’s more of a parody of a hyper-male, and that to me makes no sense whatsoever.\nUPDATE:\nIts not your imagination. There is literally\na media conspiracy of silence\nregarding Neal Gaiman’s behavior toward women.\nSpeaking with our contacts in the comic industry, Fandom Pulse was told by an insider that there is a concerted media effort to squash this story. There are allegedly marching orders not to report on this, which makes the situation even more bizarre. Online comic forums and Facebook groups controlled by mainstream media forces shut down discussions to keep this story from getting out. If these orders are confirmed, the entertainment media corruption is on full display beyond anything we’ve ever seen.\nDISCUSS ON SG",
  "tags": [
    "books",
    "freakshow",
    "SJW"
  ],
  "categories": [],
  "sitemap_lastmod": "2024-07-07T23:59:11+00:00"
}