{
  "url": "https://voxday.net/2024/07/21/i-think-we-know-this-one/",
  "scraped_at": "2026-01-08T14:38:29.687466",
  "title": "I Think  We Know This One",
  "date_display": "July 21, 2024",
  "date_iso": "2024-07-21T08:09:30+00:00",
  "date_from_url": "2024-07-21",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p><strong><a href=\"https://www.crazydaysandnights.net/2024/07/blind-item-1_01285808719.html\">Blind Item #1</a></strong><br/><em>In this song released earlier in 2024, the sleep-inducing A+ comic writer’s wife appears to have confirmed everything he’s been accused of and more.</em><br/>– CDAN</p><p>The song is obviously <em>Whakanewha </em>by Amanda Palmer, which makes it pretty clear that she knew all about at least one of her ex-husband’s accusers, and lends credence to that accuser’s statement that Palmer was aware of at least 13 other similar situations. It also tends to suggest that there is a connection between the growing scandal and why she left him in the first place.</p><p>It’s actually <a href=\"https://www.youtube.com/watch?v=jgFA9ff9Ee0\">a pretty good song</a> from an otherwise mediocre artist, which is a reliable indicator that it’s coming from a place of genuine and powerful emotion. And it also appears that the media embargo on <a href=\"https://www.tortoisemedia.com/2024/07/03/exclusive-neil-gaiman-accused-of-sexual-assault/\">the Neil Gaiman sexual assault accusations</a> is beginning to crack.</p><p>Another forest metaphor<br/>You’ve heard a million before<br/>The trees know everything, I tried a wedding ring<br/>But you just cringed and said, “What for?”<br/>And now the whole thing’s turned to ash<br/>You try to cover it with cash<br/>Another falling tree no one can hear but me<br/>Another suicidal mass<br/>Landing on my doorstep, thanks a ton<br/>Oh, darling, how can I repay you for what you have done?</p><p>And then you lied to me at Whakanewha<br/>And you sealed it with a kiss<br/>I wanted to live with you, but, fuckin’-a, fuck you<br/>No one on Earth could live like this</p><p>Another clear-cut load of crap<br/>A few more corpses in the sack<br/>You’ll get away with it, it’s just the same old script<br/>This world is shaped to have your back<br/>You said, “I’m sorry,” then you ran<br/>And went and did it all again<br/>I’m such a fool, I know<br/>Street smart but gullible<br/>I see the good in everything<br/>A pound of flax, a pound of steel<br/>I may be dumb, but I can feel<br/>I wonder when you’ll realize what you had<br/><br/>A frightened bird, a crystal ball<br/>So sad, you could’ve had it all<br/>But you hate yourself too much to want all that<br/>I had so much hope for your broken heart<br/>But you’ve made your choice, and you chose the dark<br/>And so I’ll bury you at Whakanewha<br/>And have a party with my friends<br/>I’ll miss you terribly, but, fuckin’-a, fuck me<br/>It feels so good to love again</p><p><em><a href=\"https://social.infogalactic.com/micropost/da37179d-81bc-43d3-90f5-5026542336c9\">DISCUSS ON SG</a></em></p></div>",
  "content_text": "Blind Item #1\nIn this song released earlier in 2024, the sleep-inducing A+ comic writer’s wife appears to have confirmed everything he’s been accused of and more.\n– CDAN\nThe song is obviously\nWhakanewha\nby Amanda Palmer, which makes it pretty clear that she knew all about at least one of her ex-husband’s accusers, and lends credence to that accuser’s statement that Palmer was aware of at least 13 other similar situations. It also tends to suggest that there is a connection between the growing scandal and why she left him in the first place.\nIt’s actually\na pretty good song\nfrom an otherwise mediocre artist, which is a reliable indicator that it’s coming from a place of genuine and powerful emotion. And it also appears that the media embargo on\nthe Neil Gaiman sexual assault accusations\nis beginning to crack.\nAnother forest metaphor\nYou’ve heard a million before\nThe trees know everything, I tried a wedding ring\nBut you just cringed and said, “What for?”\nAnd now the whole thing’s turned to ash\nYou try to cover it with cash\nAnother falling tree no one can hear but me\nAnother suicidal mass\nLanding on my doorstep, thanks a ton\nOh, darling, how can I repay you for what you have done?\nAnd then you lied to me at Whakanewha\nAnd you sealed it with a kiss\nI wanted to live with you, but, fuckin’-a, fuck you\nNo one on Earth could live like this\nAnother clear-cut load of crap\nA few more corpses in the sack\nYou’ll get away with it, it’s just the same old script\nThis world is shaped to have your back\nYou said, “I’m sorry,” then you ran\nAnd went and did it all again\nI’m such a fool, I know\nStreet smart but gullible\nI see the good in everything\nA pound of flax, a pound of steel\nI may be dumb, but I can feel\nI wonder when you’ll realize what you had\nA frightened bird, a crystal ball\nSo sad, you could’ve had it all\nBut you hate yourself too much to want all that\nI had so much hope for your broken heart\nBut you’ve made your choice, and you chose the dark\nAnd so I’ll bury you at Whakanewha\nAnd have a party with my friends\nI’ll miss you terribly, but, fuckin’-a, fuck me\nIt feels so good to love again\nDISCUSS ON SG",
  "tags": [
    "music",
    "rumors"
  ],
  "categories": [],
  "sitemap_lastmod": "2024-07-21T08:09:32+00:00"
}