{
  "url": "https://voxday.net/2024/07/10/insanity-is-on-the-table/",
  "scraped_at": "2026-01-08T14:37:17.894954",
  "title": "Insanity is On the Table",
  "date_display": "July 10, 2024",
  "date_iso": "2024-07-10T22:14:04+00:00",
  "date_from_url": "2024-07-10",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>Just because it is evil, insane, <a href=\"https://x.com/DougAMacgregor/status/1810726900299616314\">and impossible</a> doesn’t mean they won’t try to do it. Col Douglas Macgregor points out that RFK Jr is absolutely correct about the clowns and neocons still trying to force Americans to go to war with Russia, Iran, and apparently China too:</p><blockquote class=\"wp-block-quote is-layout-flow wp-block-quote-is-layout-flow\"><p>RFK Jr: <em>This week the world beholds the sorry spectacle of a western imperium careening towards catastrophe as NATO descends on Washington. The DC press corps is rightfully concerned about the direction of travel: “Storm clouds gather as NATO leaders converge on Washington…” And well they should be, because NATO’s top priority right now is waging war, not maintaining peace. NATO has agreed with Zelensky to set up a command, under a three star general, with 700 soldiers in Germany and Eastern Europe. The headlines of press releases reveal a consistent pattern of dangerous escalation, as top NATO enforcers pressure individual countries to pay up and fight, exulting that: “for the first time, we have a NATO document agreed at the heads-of-state government level.” <strong>The pattern is exactly the same as in Vietnam</strong>, which started with the CIA running paramilitary operations in the conflict area. As the NY Times revealed months ago, the CIA has been operating twelve bases in Ukraine for ten years. According to Ukrainian General Serhii Dvoretskiy, they are financed “One hundred and ten percent,” by the CIA. Next in Vietnam came the “military advisers”. In Ukraine, these have taken the form of mercenaries and “retired” US military personnel. They are there on the ground, supervising the training of Ukrainian draftees. While the presence of official US and NATO military personnel in Ukraine is limited, the next step looms before us: 500,000 troops have been placed on “high readiness.”</em></p><p>RFK JR is spot on regarding Washington’s poorly disguised attempt to drag us into war with Russia, but the situation in Ukraine is very different and we have no ground troops to send. The European peoples don’t want a war and neither do Americans. In 1965 the mood in America was very supportive of intervention in SE Asia to fight communism. I know. I was there. It would take four years for American support to collapse.</p><p>In addition, for reasons of geography, Ukraine cannot become another Vietnam. In 1965 no one could or would interdict us on the way to Vietnam. Today, Russian subs would immediately shut down the Atlantic and all of our staging areas in Eastern Europe would utterly demolished in a hail of missiles. Worse, US-NATO air and missile defenses are only capable of defending 5% of NATO’s European territory. In the space of 5-7 daisy our missile supply would be exhausted. I could go on, but you get the point. It’s a dead end. Any attempt to mimic the approach to Vietnam will end abruptly and badly for the US and Europe. That was the point that Orban tried to make.</p></blockquote><p>Just because it will end abruptly and badly doesn’t mean they won’t do it. It’s not an accident that tens of millions of foreigners have been imported into the USA and Europe, even though that was obviously a terrible idea from the start. It’s not an accident that the entire US manufacturing base has been gutted, even though “free trade” is an obviously destructive lie. Clown World actively seeks the destruction of Christendom, which means eliminating both Christians and the European peoples of the world.</p><p>So, if they can force a war, even an incredibly pointless and unwinnable war that will involve massive fatalities and accomplish nothing, they will do it. Don’t imagine they won’t.</p><p><em><a href=\"https://social.infogalactic.com/micropost/796e13bc-2005-4bb2-b02b-df7408ec03de\">DISCUSS ON SG</a></em></p></div>",
  "content_text": "Just because it is evil, insane,\nand impossible\ndoesn’t mean they won’t try to do it. Col Douglas Macgregor points out that RFK Jr is absolutely correct about the clowns and neocons still trying to force Americans to go to war with Russia, Iran, and apparently China too:\nRFK Jr:\nThis week the world beholds the sorry spectacle of a western imperium careening towards catastrophe as NATO descends on Washington. The DC press corps is rightfully concerned about the direction of travel: “Storm clouds gather as NATO leaders converge on Washington…” And well they should be, because NATO’s top priority right now is waging war, not maintaining peace. NATO has agreed with Zelensky to set up a command, under a three star general, with 700 soldiers in Germany and Eastern Europe. The headlines of press releases reveal a consistent pattern of dangerous escalation, as top NATO enforcers pressure individual countries to pay up and fight, exulting that: “for the first time, we have a NATO document agreed at the heads-of-state government level.”\nThe pattern is exactly the same as in Vietnam\n, which started with the CIA running paramilitary operations in the conflict area. As the NY Times revealed months ago, the CIA has been operating twelve bases in Ukraine for ten years. According to Ukrainian General Serhii Dvoretskiy, they are financed “One hundred and ten percent,” by the CIA. Next in Vietnam came the “military advisers”. In Ukraine, these have taken the form of mercenaries and “retired” US military personnel. They are there on the ground, supervising the training of Ukrainian draftees. While the presence of official US and NATO military personnel in Ukraine is limited, the next step looms before us: 500,000 troops have been placed on “high readiness.”\nRFK JR is spot on regarding Washington’s poorly disguised attempt to drag us into war with Russia, but the situation in Ukraine is very different and we have no ground troops to send. The European peoples don’t want a war and neither do Americans. In 1965 the mood in America was very supportive of intervention in SE Asia to fight communism. I know. I was there. It would take four years for American support to collapse.\nIn addition, for reasons of geography, Ukraine cannot become another Vietnam. In 1965 no one could or would interdict us on the way to Vietnam. Today, Russian subs would immediately shut down the Atlantic and all of our staging areas in Eastern Europe would utterly demolished in a hail of missiles. Worse, US-NATO air and missile defenses are only capable of defending 5% of NATO’s European territory. In the space of 5-7 daisy our missile supply would be exhausted. I could go on, but you get the point. It’s a dead end. Any attempt to mimic the approach to Vietnam will end abruptly and badly for the US and Europe. That was the point that Orban tried to make.\nJust because it will end abruptly and badly doesn’t mean they won’t do it. It’s not an accident that tens of millions of foreigners have been imported into the USA and Europe, even though that was obviously a terrible idea from the start. It’s not an accident that the entire US manufacturing base has been gutted, even though “free trade” is an obviously destructive lie. Clown World actively seeks the destruction of Christendom, which means eliminating both Christians and the European peoples of the world.\nSo, if they can force a war, even an incredibly pointless and unwinnable war that will involve massive fatalities and accomplish nothing, they will do it. Don’t imagine they won’t.\nDISCUSS ON SG",
  "tags": [
    "Clown World",
    "war"
  ],
  "categories": [],
  "sitemap_lastmod": "2024-07-10T22:32:12+00:00"
}