{
  "url": "https://voxday.net/2024/07/01/macron-raus/",
  "scraped_at": "2026-01-08T14:36:23.613318",
  "title": "Macron Raus",
  "date_display": "July 1, 2024",
  "date_iso": "2024-07-01T10:35:41+00:00",
  "date_from_url": "2024-07-01",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>France is finally beginning to realize that <a href=\"https://www.rt.com/news/600237-french-election-macron-third/\">the mainstream political-media complex is far worse</a> for the French than the “extreme right” of which it is always warning, as the rest of the continent moves steadily toward a nationalist revival.</p><blockquote class=\"wp-block-quote is-layout-flow wp-block-quote-is-layout-flow\"><p>The French right-wing National Rally (RN) party and its allies have secured the lead in the first round of snap parliamentary elections, winning over 33% of the vote, according to final results published by the Interior Ministry on Monday.</p><p>President Emmanuel Macron called early parliamentary elections after the RN’s strong performance in last month’s vote for the European Parliament. The force formerly led by Marine Le Pen and now by Jordan Bardella won 30 of the 81 French seats in the EU legislature.</p><p>In the latest poll following the first round of voting in France on Sunday, the newly-created left-wing New Popular Front (NFP) finished second with 28%, while Macron’s centrist Ensemble bloc won 20% of the vote. The RN and NFP have secured 37 and 32 seats respectively in the 577-strong legislature, while Macron’s party has received just two. A candidate needs to receive over half of the vote to win in the first round. If none does, any candidate who reaches the 12.5% threshold enters a run-off which will be held on June 7.</p></blockquote><p>The next challenge for the French will be to prevent the RN from turning around and embracing more war and more immigration like Meloni did in Italy. But whether the RN embraces their duty or not, it is clear that the people of Europe are done with the decades of multiculti propaganda and the pendulum is beginning to swing back <a href=\"https://www.youtube.com/watch?v=_h-GsIdDaTQ\">with a vengeance</a>.</p><p><em><a href=\"https://social.infogalactic.com/micropost/b43de455-5e27-40fb-81c4-4bc6c1ed5506\">DISCUSS ON SG</a></em></p></div>",
  "content_text": "France is finally beginning to realize that\nthe mainstream political-media complex is far worse\nfor the French than the “extreme right” of which it is always warning, as the rest of the continent moves steadily toward a nationalist revival.\nThe French right-wing National Rally (RN) party and its allies have secured the lead in the first round of snap parliamentary elections, winning over 33% of the vote, according to final results published by the Interior Ministry on Monday.\nPresident Emmanuel Macron called early parliamentary elections after the RN’s strong performance in last month’s vote for the European Parliament. The force formerly led by Marine Le Pen and now by Jordan Bardella won 30 of the 81 French seats in the EU legislature.\nIn the latest poll following the first round of voting in France on Sunday, the newly-created left-wing New Popular Front (NFP) finished second with 28%, while Macron’s centrist Ensemble bloc won 20% of the vote. The RN and NFP have secured 37 and 32 seats respectively in the 577-strong legislature, while Macron’s party has received just two. A candidate needs to receive over half of the vote to win in the first round. If none does, any candidate who reaches the 12.5% threshold enters a run-off which will be held on June 7.\nThe next challenge for the French will be to prevent the RN from turning around and embracing more war and more immigration like Meloni did in Italy. But whether the RN embraces their duty or not, it is clear that the people of Europe are done with the decades of multiculti propaganda and the pendulum is beginning to swing back\nwith a vengeance\n.\nDISCUSS ON SG",
  "tags": [
    "EU",
    "politics"
  ],
  "categories": [],
  "sitemap_lastmod": "2024-07-01T13:10:54+00:00"
}