{
  "url": "https://voxday.net/2024/07/14/the-trump-rally-story/",
  "scraped_at": "2026-01-08T14:37:47.739728",
  "title": "The Trump Rally Story",
  "date_display": "July 14, 2024",
  "date_iso": "2024-07-14T09:54:24+00:00",
  "date_from_url": "2024-07-14",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>Simplicius notes that the Clown World media complex <a href=\"https://simplicius76.substack.com/p/special-bulletin-america-teeters\">is desperately attempting to avoid the term “assassination attempt”</a> despite using it to describe the January 6 honeytrap.</p><blockquote class=\"wp-block-quote is-layout-flow wp-block-quote-is-layout-flow\"><p>I have <em>never</em> witnessed such an openly diabolical psyop and mass gaslighting operation. We literally just watched the attempted assassination of an American president, and the media is treating it like a superfluous nonevent.</p><p>Later, Barrack Obama joined the coordinated coverup, playing dumb as per his handlers’ orders. And the final proof of the operation came as Biden gave an unplanned national address, half an hour past his newly-announced 8pm bedtime and looking all the worse for it. Watch the coordinated coverup, as Biden openly refuses to call it an assassination even when directly asked…</p><p>Now, the big thing to watch is how the regime media goes forward—particularly the middle tastemaker and gatekeeper rungs like your Rachel Maddows and ‘The View’ harridans. They will be desperate to keep Trump as far away from martyrdom as possible—that means obfuscation, obfuscation, obfuscation. They will likely continue via the old CIA playbook of tangling things up, pointlessly hyperfocusing on the procedural minutiae of the investigation into what kind of attack it was. They’ll likely drag it out for weeks, months, or however long it takes without definitively ascribing it to the verboten “A” word, falling back on the false high horse of their “journalistic due diligence” and nonexistent “thoroughness and integrity”.</p><p>Yet we know full well if this had happened to a Democrat candidate, all the regime media would be rising up in one voice calling for the total lockdown of the country and physical purge of all rightwing and ‘ideological opponents’.</p><p>Alarmingly, the chief of communications for the Secret Service, Anthony Guglielmi, has already posted their official stance on the event which likewise eschews any strongly deterministic language. Given Trump’s rebuffed attempts to beef up security, and given the eyewitness who spotted the shooter and claims to have been ignored by Secret Service agents, the above release looks highly troubling.</p></blockquote><p>It’s not just the Left who suspect that the assassination attempt was fake. And certainly, skepticism is valid considering how there have been no shortage of orchestrated events that were clearly staged over the last few decades.</p><p>That being said, we know Clown World is increasingly desperate. We know a number of world leaders have either been assassinated or been the target of attempted assassinations. And we also know that the Democrats have been very publicly utilizing the sort of heated rhetoric that they genuinely believe will cause people to commit political violence. Throw in the Secret Service phoning in their security, slow-rolling their response, and downplaying the assassination attempt after the fact, and I think the odds favor the attempt to kill Donald Trump – or, perhaps, his body double – being a real one.</p><p>But we can’t say anything with certainty now. If we’re fortunate, we’ll be able to figure it out one way or another soon enough. The one thing we do know is that Trump didn’t need any additional help to beat the decaying, dementia-addled Biden in November.</p><p>Razorfist has an unmissable rant on what he describes as <a href=\"https://www.youtube.com/watch?v=biiR8RfZcWA\">“the expected unaliving attempt”</a>. And Clown World color revolutionary Victoria Nuland <a href=\"https://files.catbox.moe/08v1fp.mp4\">quite vehemently predicted</a> that Donald Trump would not be elected President in a recent interview.</p><p><strong>UPDATE:</strong> If you want a conspiracy theory, here’s one for you. The dead guy in the crowd behind Trump who was shot in the head wasn’t an innocent victim. He was the Deep State’s second shooter who was supposed to deliver the kill shot while everyone was distracted by the windup toy with the rifle on the roof. And I don’t think it’s an accident that this happened less than two weeks after the intentional public exposure of the 5 Bidens as dementia-addled walking corpses.</p><p><strong>UPDATE: </strong>The Chinese don’t think it was staged. From <em>Global Times</em>:</p><p><em>“The gunman’s background has three possibilities,” Li Haidong, a professor from the China Foreign Affairs University, told the Global Times on Sunday. “First, it could be someone from the deep state, an elusive force within the government that does not want to see Trump win. Second, it could be from the far-left extremist forces, who do not want to see Trump, representing the far-right, win the election and thus have taken radical actions. Lastly, it could be an individual extremist without any organizational background, simply a person who is tired of Trump,” Li said.</em></p><p>Assuming the Chinese are correct, I think the obvious stand-down by the Secret Service and the police, the Z-team makeup of the security detail, and the headshot victim in the crowd, tend to suggest the first possibility.</p><p><em><a href=\"https://social.infogalactic.com/micropost/c2ef6274-a2dc-4a75-b213-73a9aed3c234\">DISCUSS ON SG</a></em></p></div>",
  "content_text": "Simplicius notes that the Clown World media complex\nis desperately attempting to avoid the term “assassination attempt”\ndespite using it to describe the January 6 honeytrap.\nI have\nnever\nwitnessed such an openly diabolical psyop and mass gaslighting operation. We literally just watched the attempted assassination of an American president, and the media is treating it like a superfluous nonevent.\nLater, Barrack Obama joined the coordinated coverup, playing dumb as per his handlers’ orders. And the final proof of the operation came as Biden gave an unplanned national address, half an hour past his newly-announced 8pm bedtime and looking all the worse for it. Watch the coordinated coverup, as Biden openly refuses to call it an assassination even when directly asked…\nNow, the big thing to watch is how the regime media goes forward—particularly the middle tastemaker and gatekeeper rungs like your Rachel Maddows and ‘The View’ harridans. They will be desperate to keep Trump as far away from martyrdom as possible—that means obfuscation, obfuscation, obfuscation. They will likely continue via the old CIA playbook of tangling things up, pointlessly hyperfocusing on the procedural minutiae of the investigation into what kind of attack it was. They’ll likely drag it out for weeks, months, or however long it takes without definitively ascribing it to the verboten “A” word, falling back on the false high horse of their “journalistic due diligence” and nonexistent “thoroughness and integrity”.\nYet we know full well if this had happened to a Democrat candidate, all the regime media would be rising up in one voice calling for the total lockdown of the country and physical purge of all rightwing and ‘ideological opponents’.\nAlarmingly, the chief of communications for the Secret Service, Anthony Guglielmi, has already posted their official stance on the event which likewise eschews any strongly deterministic language. Given Trump’s rebuffed attempts to beef up security, and given the eyewitness who spotted the shooter and claims to have been ignored by Secret Service agents, the above release looks highly troubling.\nIt’s not just the Left who suspect that the assassination attempt was fake. And certainly, skepticism is valid considering how there have been no shortage of orchestrated events that were clearly staged over the last few decades.\nThat being said, we know Clown World is increasingly desperate. We know a number of world leaders have either been assassinated or been the target of attempted assassinations. And we also know that the Democrats have been very publicly utilizing the sort of heated rhetoric that they genuinely believe will cause people to commit political violence. Throw in the Secret Service phoning in their security, slow-rolling their response, and downplaying the assassination attempt after the fact, and I think the odds favor the attempt to kill Donald Trump – or, perhaps, his body double – being a real one.\nBut we can’t say anything with certainty now. If we’re fortunate, we’ll be able to figure it out one way or another soon enough. The one thing we do know is that Trump didn’t need any additional help to beat the decaying, dementia-addled Biden in November.\nRazorfist has an unmissable rant on what he describes as\n“the expected unaliving attempt”\n. And Clown World color revolutionary Victoria Nuland\nquite vehemently predicted\nthat Donald Trump would not be elected President in a recent interview.\nUPDATE:\nIf you want a conspiracy theory, here’s one for you. The dead guy in the crowd behind Trump who was shot in the head wasn’t an innocent victim. He was the Deep State’s second shooter who was supposed to deliver the kill shot while everyone was distracted by the windup toy with the rifle on the roof. And I don’t think it’s an accident that this happened less than two weeks after the intentional public exposure of the 5 Bidens as dementia-addled walking corpses.\nUPDATE:\nThe Chinese don’t think it was staged. From\nGlobal Times\n:\n“The gunman’s background has three possibilities,” Li Haidong, a professor from the China Foreign Affairs University, told the Global Times on Sunday. “First, it could be someone from the deep state, an elusive force within the government that does not want to see Trump win. Second, it could be from the far-left extremist forces, who do not want to see Trump, representing the far-right, win the election and thus have taken radical actions. Lastly, it could be an individual extremist without any organizational background, simply a person who is tired of Trump,” Li said.\nAssuming the Chinese are correct, I think the obvious stand-down by the Secret Service and the police, the Z-team makeup of the security detail, and the headshot victim in the crowd, tend to suggest the first possibility.\nDISCUSS ON SG",
  "tags": [
    "media",
    "news",
    "politics"
  ],
  "categories": [],
  "sitemap_lastmod": "2024-07-14T13:15:17+00:00"
}