{
  "url": "https://voxday.net/2024/07/04/the-end-of-the-conservative-party-2/",
  "scraped_at": "2026-01-08T14:36:45.758704",
  "title": "The End of the Conservative Party",
  "date_display": "July 4, 2024",
  "date_iso": "2024-07-04T23:05:03+00:00",
  "date_from_url": "2024-07-04",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>The Tories may be going the way of the Whig Party soon, and they absolutely deserve suffering <a href=\"https://www.rt.com/news/600462-uk-elections-exit-polls/\">the worst electoral defeat in British history</a> by having thrown away 14 years of political power and accomplishing nothing more than to slavishly serve their masters in Clown World:</p><blockquote class=\"wp-block-quote is-layout-flow wp-block-quote-is-layout-flow\"><p>The UK Labour party is predicted to win a landslide victory in the British general election, according to a preliminary exit poll released as voting closed on Thursday evening.</p><p>According to the poll, Labour will win 410 out of the 650 seats, up from 205, in the House of Commons, while the previously governing Tories will secure 131 seats, down from 344.</p><p>The Liberal Democrats are predicted to win 61 seats, Nigel Farage’s Reform UK 13, and the Scottish National Party (SNP) ten. The Greens are slated to win two seats and the Welsh party Plaid Cymru four.</p><p>Sky News has described the Tories’ result as “the biggest electoral collapse in British electoral history.”</p></blockquote><p>All the Tories had to do to stay in power was three things: Brexit, Deportation, and Neutrality in Ukraine. Well, four things, as a genuinely English Prime Minister would have also gone a long way.</p><p>Instead, they went one-for-four and quite rightly paid the price. The pendulum is moving toward sovereign nationalism, and the sovereign nations are going to win their war against Clown World. And there is no need for a Conservative Party that couldn’t even conserve the nation.</p><p>Labour, of course, won’t be any better. But at least they are open enemies rather than false friends.</p><p><strong>UPDATE: </strong>It’s interesting to note that the Scottish National Party has been totally destroyed in Scotland. They had their chance, but they blew the independence referendum and thereby demonstrated that there was no need for the party to even exist. And all they had to do to win it was limit the vote to Scottish citizens actually resident in Scotland.</p><p><em><a href=\"https://social.infogalactic.com/micropost/7265e3c7-685c-4b58-8056-45d089c6abde\">DISCUSS ON SG</a></em></p></div>",
  "content_text": "The Tories may be going the way of the Whig Party soon, and they absolutely deserve suffering\nthe worst electoral defeat in British history\nby having thrown away 14 years of political power and accomplishing nothing more than to slavishly serve their masters in Clown World:\nThe UK Labour party is predicted to win a landslide victory in the British general election, according to a preliminary exit poll released as voting closed on Thursday evening.\nAccording to the poll, Labour will win 410 out of the 650 seats, up from 205, in the House of Commons, while the previously governing Tories will secure 131 seats, down from 344.\nThe Liberal Democrats are predicted to win 61 seats, Nigel Farage’s Reform UK 13, and the Scottish National Party (SNP) ten. The Greens are slated to win two seats and the Welsh party Plaid Cymru four.\nSky News has described the Tories’ result as “the biggest electoral collapse in British electoral history.”\nAll the Tories had to do to stay in power was three things: Brexit, Deportation, and Neutrality in Ukraine. Well, four things, as a genuinely English Prime Minister would have also gone a long way.\nInstead, they went one-for-four and quite rightly paid the price. The pendulum is moving toward sovereign nationalism, and the sovereign nations are going to win their war against Clown World. And there is no need for a Conservative Party that couldn’t even conserve the nation.\nLabour, of course, won’t be any better. But at least they are open enemies rather than false friends.\nUPDATE:\nIt’s interesting to note that the Scottish National Party has been totally destroyed in Scotland. They had their chance, but they blew the independence referendum and thereby demonstrated that there was no need for the party to even exist. And all they had to do to win it was limit the vote to Scottish citizens actually resident in Scotland.\nDISCUSS ON SG",
  "tags": [
    "history",
    "politics",
    "UK"
  ],
  "categories": [],
  "sitemap_lastmod": "2024-07-04T23:41:20+00:00"
}