{
  "url": "https://voxday.net/2024/07/10/those-who-wallow-in-evil/",
  "scraped_at": "2026-01-08T14:37:16.066151",
  "title": "Those Who Wallow in Evil",
  "date_display": "July 10, 2024",
  "date_iso": "2024-07-10T15:15:53+00:00",
  "date_from_url": "2024-07-10",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>Neil Gaiman isn’t the only wicked writer whose reputation and commercial viability are being frantically defended by the see-no-evil media this summer. The recently-deceased and much-lauded Canadian writer <a href=\"https://archive.is/YWgz8#selection-5449.60-5449.74\">Alice Munro has now been publicly exposed</a> as a pedophile-enabler by her own daughter. Notice how a similar pattern prevails:</p><p><em>Alice Munro’s work was often dark, even violent — but that’s what made her great</em><br/>— 29 May 2024<br/><em>My stepfather sexually abused me when I was a child. My mother, Alice Munro, chose to stay with him</em><br/>— 7 July 2024<br/><em>Academics grapple with how to teach Alice Munro’s work in wake of daughter’s sexual assault revelations</em><br/>— 10 July 2024</p><p>First, they praise the darkness and violence of the “great” and famous writer. Then, the accusations are revealed and the damning evidence is exposed, which is reliably just a prelude of the more awful revelations to come. After the storm passes, they attempt to finesse the matter and justify not cancelling the awful person for behavior that far exceeds that of virtually everyone who has ever been cancelled by them, even as they praise themselves for “grappling” with the issue.</p><p><em>Lorraine York, distinguished university professor at McMaster University and an expert in Canadian literature said in the coming days academics and others will be asking “how to account for the way in which both Munro and Canadian literature as a field allowed for this silencing. People in the industry knew and decisions were made that prolonged the silence and the harm that was done. That is what we need to reckon with,” Prof. York said.</em></p><p><em>Doug Gibson, the former president and publisher of McClelland &amp; Stewart, said “As Alice’s Canadian editor and publisher I was aware that Alice and Andrea were estranged for a number of years. In 2005 it became clear what the issue was, with Gerry Fremlin’s full shameful role revealed, but I have nothing to add to this tragic family story, and wish the family a continued recovery.”</em></p><p>In Munro’s case, as with Marion Zimmer Bradley’s, there isn’t even the possibility of giving them the benefit of any doubt. Munro’s husband, Gerald Fremlin, was charged with indecently assaulting her daughter and pled guilty in 2005. As with MZB, Munro was protected by the media and the relevant literary establishment until her death. But the clues about their evil predilections were always there, lurking in their work.</p><p><em>In “Floating Bridge,” Jinny, feeling a surprising loss of “low-grade freedom” at the news that her cancer is receding, slips away from her husband one evening and allows herself to be kissed by a mutual friend’s teenage son.</em></p><p>Neil Gaiman’s editors, publishers, collaborators, and producers <a href=\"https://fandompulse.substack.com/p/why-is-mainstream-entertainment-media\">are already actively engaged</a> in the same sort of conspiracy of silence that York describes in Canada. Which means we may be forced to witness the media, the publishing establishment, and Hollywood all quietly pretending not to know anything untoward until after Mr. Tubcuddle’s death.</p><p><em>Speaking with our contacts in the comic industry, Fandom Pulse was told by an insider that there is a concerted media effort to squash this story. There are allegedly marching orders not to report on this, which makes the situation even more bizarre. Online comic forums and Facebook groups controlled by mainstream media forces shut down discussions to keep this story from getting out. If these orders are confirmed, the entertainment media corruption is on full display beyond anything we’ve ever seen. </em></p><p>Ms Skinner’s parting words are bitter and haunting, with regards to both her own case and Moira Greyland’s case, as well as the cases of Scarlett and K:</p><p><em>My mother’s fame meant that the secrecy spread far beyond the family. Many influential people came to know something of my story yet continued to support, and add to, a narrative they knew was false.<br/>It seemed as if no one believed the truth should ever be told, that it never would be told, certainly not on a scale that matched the lie. Until now.</em></p><p><strong>UPDATE: </strong>If you ever seriously believed Neil Gaiman was a good writer, I suggest taking this 1985 book review into account.</p><p><em>“For value for money I have to recommend L. Ron Hubbard’s massive Battlefield Earth – over 1000 pages of thrills, spills, vicious aliens, noble humans. Is mankind an endangered species? Will handsome and heroic Jonny Goodboy Tyler win Earth back from the nine-foot-high Psychlos? A tribute to the days of pulp, I found it unputdownable. And all for 2.95.”</em></p><p>Mr. Tubcuddle found it “unputdownable”. I found it totally fucking unreadable.</p><p><em><a href=\"https://social.infogalactic.com/micropost/8b2966ad-1220-4ad2-a3bb-7abf9d9b039a\">DISCUSS ON SG</a></em></p></div>",
  "content_text": "Neil Gaiman isn’t the only wicked writer whose reputation and commercial viability are being frantically defended by the see-no-evil media this summer. The recently-deceased and much-lauded Canadian writer\nAlice Munro has now been publicly exposed\nas a pedophile-enabler by her own daughter. Notice how a similar pattern prevails:\nAlice Munro’s work was often dark, even violent — but that’s what made her great\n— 29 May 2024\nMy stepfather sexually abused me when I was a child. My mother, Alice Munro, chose to stay with him\n— 7 July 2024\nAcademics grapple with how to teach Alice Munro’s work in wake of daughter’s sexual assault revelations\n— 10 July 2024\nFirst, they praise the darkness and violence of the “great” and famous writer. Then, the accusations are revealed and the damning evidence is exposed, which is reliably just a prelude of the more awful revelations to come. After the storm passes, they attempt to finesse the matter and justify not cancelling the awful person for behavior that far exceeds that of virtually everyone who has ever been cancelled by them, even as they praise themselves for “grappling” with the issue.\nLorraine York, distinguished university professor at McMaster University and an expert in Canadian literature said in the coming days academics and others will be asking “how to account for the way in which both Munro and Canadian literature as a field allowed for this silencing. People in the industry knew and decisions were made that prolonged the silence and the harm that was done. That is what we need to reckon with,” Prof. York said.\nDoug Gibson, the former president and publisher of McClelland & Stewart, said “As Alice’s Canadian editor and publisher I was aware that Alice and Andrea were estranged for a number of years. In 2005 it became clear what the issue was, with Gerry Fremlin’s full shameful role revealed, but I have nothing to add to this tragic family story, and wish the family a continued recovery.”\nIn Munro’s case, as with Marion Zimmer Bradley’s, there isn’t even the possibility of giving them the benefit of any doubt. Munro’s husband, Gerald Fremlin, was charged with indecently assaulting her daughter and pled guilty in 2005. As with MZB, Munro was protected by the media and the relevant literary establishment until her death. But the clues about their evil predilections were always there, lurking in their work.\nIn “Floating Bridge,” Jinny, feeling a surprising loss of “low-grade freedom” at the news that her cancer is receding, slips away from her husband one evening and allows herself to be kissed by a mutual friend’s teenage son.\nNeil Gaiman’s editors, publishers, collaborators, and producers\nare already actively engaged\nin the same sort of conspiracy of silence that York describes in Canada. Which means we may be forced to witness the media, the publishing establishment, and Hollywood all quietly pretending not to know anything untoward until after Mr. Tubcuddle’s death.\nSpeaking with our contacts in the comic industry, Fandom Pulse was told by an insider that there is a concerted media effort to squash this story. There are allegedly marching orders not to report on this, which makes the situation even more bizarre. Online comic forums and Facebook groups controlled by mainstream media forces shut down discussions to keep this story from getting out. If these orders are confirmed, the entertainment media corruption is on full display beyond anything we’ve ever seen.\nMs Skinner’s parting words are bitter and haunting, with regards to both her own case and Moira Greyland’s case, as well as the cases of Scarlett and K:\nMy mother’s fame meant that the secrecy spread far beyond the family. Many influential people came to know something of my story yet continued to support, and add to, a narrative they knew was false.\nIt seemed as if no one believed the truth should ever be told, that it never would be told, certainly not on a scale that matched the lie. Until now.\nUPDATE:\nIf you ever seriously believed Neil Gaiman was a good writer, I suggest taking this 1985 book review into account.\n“For value for money I have to recommend L. Ron Hubbard’s massive Battlefield Earth – over 1000 pages of thrills, spills, vicious aliens, noble humans. Is mankind an endangered species? Will handsome and heroic Jonny Goodboy Tyler win Earth back from the nine-foot-high Psychlos? A tribute to the days of pulp, I found it unputdownable. And all for 2.95.”\nMr. Tubcuddle found it “unputdownable”. I found it totally fucking unreadable.\nDISCUSS ON SG",
  "tags": [
    "freakshow",
    "media"
  ],
  "categories": [],
  "sitemap_lastmod": "2024-07-10T18:33:36+00:00"
}