{
  "url": "https://voxday.net/2024/07/08/wallowing-in-pseudo-madness/",
  "scraped_at": "2026-01-08T14:37:07.545269",
  "title": "Wallowing in Pseudo-Madness",
  "date_display": "July 8, 2024",
  "date_iso": "2024-07-08T09:04:21+00:00",
  "date_from_url": "2024-07-08",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><h2 class=\"wp-block-heading\">The Wasp Factory vs One Bright Star to Guide Them</h2><p><em>Phil Sandifer debated Vox Day about two very different works of fiction by two very different authors on June 11, 2015</em>.<em> Since the interview is no longer available the now-defunct original site, I’ve posted <a href=\"https://archive.is/pGtLB\">the archived version</a> here.</em></p><hr class=\"wp-block-separator has-alpha-channel-opacity\"/><p>Below is a transcript of my interview with Vox Day, <a href=\"https://archive.is/o/pGtLB/pexlives.libsyn.com/pex-lives-and-eruditorum-press-presents-the-vox-day-interview\" rel=\"noreferrer noopener\" target=\"_blank\">which you can listen to over at Pex Lives.</a> I’ve lightly edited it to remove infelicities of language on both Day’s part and my own. I’ve also added a couple of footnotes clarifying aspects of the discussion. I am sure that Day would offer several clarifications of his own. Thanks again to Kevin and James for hosting this, and to Max Braden for preparing the transcript.</p><p><strong>Phil Sandifer</strong>: <em>Hi</em>, <em>I’m Phil Sandifer and I’ve got with me today the man at the center of the whole Hugo Awards controversy, Vox Day. Hello, Vox.</em></p><p><strong>Vox Day</strong>: Hey, Phil. How are you?</p><p><strong>Sandifer</strong>: <em>I’m doing all right. So, the idea behind this interview is that Vox and I mutually agreed upon two works, one that he thinks is a great story and that I think is terrible, and one vice versa. The first is going to be John C. Wright’s </em>One Bright Star to Guide Them, <em>which is one of Vox’s Rabid Puppies, it’s up for a best novella Hugo this year, and the other is going to be the late great Iain Banks’s 1984 debut novel </em>The Wasp Factory. <em>We’re going to start with </em>One Bright Star to Guide Them, <em>by John C. Wright, who you’ve called a contender for the greatest living science fiction writer. The book’s promotional text describes it like so:</em></p><p><em>As children, long ago, Tommy Robertson and his three friends, Penny, Sally, and Richard, passed through a secret gate in a ruined garden and found themselves in an elfin land, where they aided a brave prince against the evil forces of the Winter King. Decades later, successful, stout, and settled in his ways, Tommy is long parted from his childhood friends, and their magical adventures are but a half-buried memory.</em></p><p><em>But on the very eve of his promotion to London, a silver key and a coal-black cat appear from the past, and Tommy finds himself summoned to serve as England’s champion against the invincible Knight of Ghosts and Shadows. The terror and wonder of Faerie has broken into the Green and Pleasant Land, and he alone has been given the eyes to see it, to gather his companions and their relics is his quest. But age and time have changed them too. Like Tommy, they are more worldly-wise, and more fearful. And evil things from childhood stories grow older and darker and more frightening with the passing of the years.</em></p><p>One Bright Star to Guide Them<em> begins where other fairy tales end. Brilliant and bittersweet, the novella hearkens back to the greatest and best-loved classics of childhood fantasy. John C. Wright’s beautiful fairy tale is not a subversion of these classics, but a loving and nostalgic homage to them, and reminds the reader that although Ever After may not always be happy, the road of life goes ever on and evil must be defeated anew by each and every generation.”</em></p><p><em>Now, this is obviously the one of the two books that I think is awful, but I do want to say before we start, I really do love the premise. I really love the idea of going back to a sort of Narnia-esque children’s fiction world from the perspective of adulthood. There’s obviously a lot of stories in the “return to a children’s story in adulthood” style – I should point out for listeners who are coming to this through my work that the first two chapters are actually almost beat for beat the first two stories of Alan Moore’s </em>Marvelman<em> in terms of the plot – but I really can’t think of one in this sub-genre that’s played with Narnia in particular. There’s a very short story by Neil Gaiman called “The Problem of Susan,” but that’s about it. So I do want to admit up front, I do love the premise if nothing else. But you obviously love a lot more than just the premise here, so my first question is simple, Vox: why is this story great?</em></p><p><strong>Day</strong>: Well, before I explain why I think it’s a great story, I think that it’s probably important for the purpose of full disclosure to point out that, number one, I was the editor who was responsible for publishing this story, and also I wrote that particular description that you just read.</p><p><strong>Sandifer</strong>: <em>Okay.</em></p><p><strong>Day</strong>: So, it’s fair to point out that I am absolutely, utterly and completely biased in this regard, less because I have a pecuniary interest in the novella selling well – anyone who knows anything about publishing realizes that novellas are not the way that you make a lot of money in the publishing business – but I am very, very biased towards John Wright in particular as a writer, and <em>One Bright Star to Guide Them</em> is one of my three favorite things that he’s ever written. So I think very highly of him as a writer; the other writers that I think very highly of in the science fiction field are China Miéville and, until his most recent novel, Neal Stephenson.[1]</p><p>Now, what is particularly great about Wright, and something that a lot of people don’t necessarily realize, is that he’s not a writer who puts a lot of what I would call “craft” into it, by which I mean we’re not dealing with works that are written and re-written and re-written and re-written, for the most part. Now, in this particular case, he did write it as a short story, and then turned it into a novella later, but in general, what you see is what you get. It’s actually somewhat depressing to edit the man, because the stuff that he turns in just having dashed it off is much better than most of the stuff you see from other people.</p><p>Now, in the case of <em>One Bright Star</em>, like you said, the premise is fantastic. The idea that you’re beginning with these children who have been through this wonderful, incredible, fantastic experience, and then suddenly visiting, catching up with them thirty-some years later, is original in itself.</p><p><strong>Sandifer</strong>: <em>Right, I mean, there is, as I said, a large sub-genre of this. It’s hardly the only story, I think even from last year – I know a lot of people have compared it to Neil Gaiman’s </em>The Ocean at the End of the Lane<em>, which came out around the same time.</em> [2]</p><p><strong>Day</strong>: Sure, but there’s… You know, I’ve read <em>The Ocean at the End of the Lane</em>, it’s good, but what’s different about <em>One Bright Star to Guide Them</em> is that it is much more clearly written as an homage, not just to Narnia, but there’s actually elements of a great deal of other children’s fantasies that are much beloved.</p><p><strong>Sandifer</strong>: <em>Right, there’s a line that very closely hues to Susan Cooper’s </em>The Dark is Rising<em> that I noticed, for instance.</em></p><p><strong>Day</strong>: Right. There’s also a fair amount of <em>The Chronicles of Prydain</em>. A lot of the fictional events that are referred to are much more out of <em>Prydain</em> than out of either <em>The Dark is Rising</em> or Narnia. And then there’s also a couple other ones, references to less well-known works. There’s certainly a call-out to George McDonald in there, the original fantasy writer, and so there’s a fair amount of depth there for those of us who were into that type of literature.</p><p><strong>Sandifer</strong>: <em>I think one of the reasons, though, people go for Narnia in particular – because, I mean, if you look at the reviews on Amazon, Narnia does seem to be the one that everyone goes to first when talking about the sort of influences on this, and I’m going to hazard a guess, no small part of that is because both Narnia and this are pretty explicitly Christian allegories. Do you think that’s a fair statement to say about this book?</em></p><p><strong>Day</strong>: Absolutely, absolutely. And I think that that’s both part of why <em>One Bright Star to Guide Them</em> generates such powerful reactions in people who love it and in the much smaller number of people who dislike it, because I think in many cases, people’s reactions are being colored by their own personal feelings about Christianity, both for better and for worse.</p><p><em><a href=\"https://social.infogalactic.com/micropost/8944bc38-77e3-4742-aab6-8cdbaeca4198\">DISCUSS ON SG</a></em></p> <span id=\"more-63472\"></span><p><strong>Sandifer</strong>: <em>Sure. Now then, do you want to just explain quickly the broad strokes of the allegory? In particular, the talking cat character, Tybalt. Who does he represent, and in particular, there’s this climactic scene where Tommy has to kill this magical cat in order to lose his fear and become able to wield the magical sword that’s necessary to defeat the villain. So, can you just explain how that allegory works, quickly?</em></p><p><strong>Day</strong>: Well, Tybalt represents two things. Number one, he’s obviously the Jesus Christ figure, because he has to die in order for the sacred fire to be lit, and then of course he comes back after his death, so he’s the Aslan, he’s the Jesus Christ. He’s also, however – in that he’s a black cat who has to be killed – he’s also representational of the sin in Tommy’s life, and it’s the same reason that Mel Gibson, when he was filming…</p><p><strong>Sandifer</strong>: Passion of the Christ<em>, using his own hands to actually be the one to hammer the nails into Jesus’s hands, right?</em></p><p><strong>Day</strong>: Exactly, because the killing of Tybalt – If you don’t follow the theological implications, the need to kill Tybalt himself seems a little bit strange. But it’s actually relatively sophisticated, because, if you notice the killing [AUDIO CUTS OUT BRIEFLY] [3] fire, that turns into the weapon, and what that fire represents is of course the Holy Spirit – which, by the way, is the same fire that Tolkien refers to when Gandalf meets the Balrog and talks about being a servant of the secret fire. And so throughout the novella, there are these theological elements. Often Catholic, because of course, although I’m an Evangelical Christian, John happens to be a Catholic, like Tolkien, and so the theology of the story tends to be actually more Tolkienesque rather than C.S. Lewis, but, you know, that’s just details.</p><p>And so from a purely literary point of view, I can see where the Tybalt thing can be a little confusing, but again, if you’re aware of the theological elements, than you immediately recognize the sin aspect, the Jesus Christ aspect, and the Holy Spirit aspect as well, which, I think the third one is sometimes missed.</p><p><strong>Sandifer</strong>: <em>It’s not hard for me to imagine a similar story with the same basic plot, but where instead of being an overt Christian allegory, the forces of magic allude to, say, a pre-Christian Celtic mythology. You could do it with, obviously, any number of mythologies or religions. Do you think such a story could be as great as this one is, or is it very specifically, to your mind, the Christian nature of the allegory that makes this a great story?</em></p><p><strong>Day</strong>: Well, I think that because we are reading it in a Christian/post-Christian environment, it would be very, very difficult for any similar but differently-based story to resonate quite as strongly, either in a positive or a negative sense. If you react badly to Christianity, and I’ve certainly been someone who did in the past, you know, I can understand it getting your back up. And in the same way, it’s going to resonate powerfully with the same type of people who are emotionally affected by the Aslan death scene in Narnia. So I think that it’s theoretically possible, but I personally am not going to respond very strongly, emotionally, to something based on Shinto. I read Japanese fiction, I’m a huge fan of Murakami, and I have no doubt that there are definitely some Japanese spiritual aspects to some of his work that I miss, that don’t resonate with me because it’s foreign to me.</p><p><strong>Sandifer</strong>: <em>Alright. So just to clarify, when you say this story is “great,” are you saying this is one of your favorite stories – that’s sort of a personal claim – or are you making a more objective claim?</em></p><p><strong>Day</strong>: I’m making an objective claim, because although I appreciate the story, I like the story, and although the theological elements resonate with me, what makes a story great is the ending, and John Wright has a real gift for endings, which, as you know, many writers these days don’t. And what’s so brilliant about the ending of <em>One Bright Star to Guide Them</em> is the way that Wright takes the trope of the wise old man and he brings the intellectual development, the spiritual development, and the maturation of the child character of Tommy full circle, and Tommy becomes the wise old man to the next stage in the story, which of course we don’t see, but it ties the whole… You know, you mentioned <em>The Ocean at the End of the Lane</em>, and things like that. What separates <em>One Bright Star to Guide Them</em> from some of these other, similar stories is that Wright manages to plug his story into the circle of the wise old man, the children, and so forth; a cycle, rather than a simple, one-off story. [4] And so, that’s what I find so brilliant about it, is because it makes a statement that the story never ends. Not just the story, but the struggle never ends – the battle for good and evil, both in the individual soul, as well as in the worlds, the universes, etcetera, always continues, and to me, it’s well-executed, it’s original, and, you know, I frankly haven’t really seen anything that has done it in as such an adept manner in such a short literary work.</p><p><strong>Sandifer</strong>: <em>Okay. Well, I want to talk a little bit about the particular vision of Christianity that Wright’s expressing. You said that you think that a lot of the reaction to this story hinges on one’s investment in Christianity, but I think there’s some particular aspects of Wright’s Christianity and the vision of God that he expresses that some people would differ on. Certainly I think there’s…</em></p><p><strong>Day</strong>: I differ on it!</p><p><strong>Sandifer</strong>: <em>Right, because you take an evangelical tact as opposed to his Catholic tact, but I have, I think, perhaps what might be called a broader aesthetic objection. I want to look at that climactic scene where Tommy has to kill Tybalt, and Tommy is protesting to Tybalt that he doesn’t understand and “cannot simply do as you tell me, I am not a child anymore.” To which Tybalt says, “it is not the stalwart soldiers of the sons of light who question orders, little Tommy, but willful children. Are you not a man?” And then the narrator says that Tommy “realized the cat was not asking him if he were brave or grown up, but if he knew where he stood in the great hierarchy of all creation. Beasts, even small and gentle ones, were placed under the dominion of man because man had the duty to be wiser and greater than a beast, to act for reasons higher than instinct. But the reasons of man were not the highest.”</em></p><p><em>There’s a couple of things that really strike me here. There’s this very militarized language, talking about soldiers and orders. And there’s the way in which what’s being demanded is this completely unquestioning obedience to God’s will. And I think this is a vision of Christianity that might surprise some people, in a way that goes beyond even specific subsets – whether you’re an evangelical or a Catholic or whatever. Even within the evangelical tradition, or the Catholic tradition, I think there’s real differing angles on how authoritarian a relationship humanity has with God. So can you talk a bit about this notion of just this complete submission to God? Because I find it ethically troubling, I have to admit.</em></p><p><strong>Day</strong>: Well, first of all, this is not one of the differences that I would have with John.</p><p><strong>Sandifer</strong>: <em>I didn’t think it was.</em></p><p><strong>Day</strong>: Because what you’re really talking about there is faith. You know, there’s a – one of the favorite stories for me in the Bible is when Jesus is accosted by the Roman officer, the centurion. And he says, you know, my son, or whoever it was, is sick, will you please heal him? And Jesus basically says, “Sure, I’ll come along and we’ll do that.” And the centurion says,  “Sir, don’t bother. I know you can heal him. Just please do it now and I’ll just go home and see him.” And, of course, Jesus is very surprised, and he points out to his followers that he’s never encountered faith like this. And that’s what John Wright is referring to there: he’s referring to that perfect faith in one’s superior that is necessary in a military – I mean, it’s something that they drill into them. And for Christians, it is the ideal. It’s not an often-realized ideal, but it is the optimal form of perfect submission to God’s will, which is to not question. And, you know, C.S. Lewis also touches upon this, and it’s often summarized in the concept of “understanding is good, but obedience is better.”</p><p><strong>Sandifer</strong>: <em>Even beyond that, though, another word that jumps out in that whole explanation is the word “dominion.” Because it’s a word that carries some particular resonance within Christian discourse, and it does particularly evoke a movement I know you’ve identified with, the Christian Dominionist movement. And I also want to point out, the book more broadly does talk about these forces of evil and darkness infiltrating government. There is a focus on the political dimension of it. Does the vision of Christianity that </em>One Bright Star <em>is talking about – and is demanding obedience to – does that include a political and civic obedience as well?</em></p><p><strong>Day</strong>: No. I mean, given that John is a Catholic, there’s some implication of it there, but not really. And also, I should correct you, I’ve never identified as a Christian Dominionist…</p><p><strong>Sandifer</strong>: <em>Your called yourself a “small-d dominionist.”.</em></p><p><strong>Day</strong>: Yes. I don’t really even have much familiarity with the “capital-D Dominionist.” When people first started telling me that I was a Christian Dominionist, I had to look it up. I literally had no idea. I live in Europe. I don’t think a lot of people realize that I’m not part of this whole sort of…</p><p><strong>Sandifer</strong>: <em>And Dominionism is mainly an American movement.</em></p><p><strong>Day</strong>: Yeah.</p><p><strong>Sandifer</strong>: <em>Well, I’ll give you a quote that you said, I think, shortly after the “small-d dominionism”, though I don’t have it sourced in my notes here…</em></p><p><strong>Day</strong>: Well, actually, let’s not. We’re kind of digressing here.</p><p><strong>Sandifer</strong>: <em>Well, I’m not sure we are, though, because Wright does have this focus on the sons of light liberating the country from their control. It’s very specifically that the forces of evil have infiltrated the government.</em></p><p><strong>Day</strong>: Okay, fair enough. Go ahead.</p><p><strong>Sandifer</strong>: <em>So, the quote I have from you is, you believe that “any civilized western society will be a Christian one, or it will cease to be civilized, if it manages to survive at all.” So, can you explain what this means in practical terms, and what you think this liberating the government in a Christian way that Wright is talking about means?</em></p><p><strong>Day</strong>: Okay. Well, I think the first part of it is pretty self-explanatory. We only have to look at people being beheaded on the streets of London and some of the stuff that has been happening in the States. You know, post-Christianity is Pagan, and we know from history what Pagan cultures look like. The idea that things are going to continue and move forward into this sort of shiny, sexy secularism, that’s just not happening. It’s not in the cards.</p><p><strong>Sandifer</strong>: <em>I’m not sure, if you want to talk about the de-Christianization of London, beheadings are really the trend away from Christianity there, if you’re looking at British history. There’s certainly a fair amount of violence, unease, in Christian societies, and plenty of non-Christian societies that people would refer to as “civilization” and “civilized.” So I’m not sure that initial statement is quite as obvious as you want to make it out to be.</em></p><p><strong>Day</strong>: That may be, but, you know, I’ve been here in Europe for a long time and pretty much all of the Europeans that I know consider things to be a bit less civilized than they were twenty years ago, thirty years ago, and so, you know, we’ll see. I’m content to say, let’s just wait and see.</p><p><strong>Sandifer</strong>: <em>Okay. Yeah, and I don’t want to make this an argument about politics…</em></p><p><strong>Day</strong>: Prognosticating the future!</p><p><strong>Sandifer</strong>: <em>Right. I mean, probably, talking about a novella is a slightly easier task than prognosticating the future. I guess what’s striking me here, though, is… I remember reading Cicero in high school and noting him complaining how life was so much less civilized than it was thirty years ago. I think everyone says that life is less civilized than it was thirty years ago. I think that’s just called being forty.</em></p><p><strong>Day</strong>: But Cicero was right! I mean, the republic collapsed!</p><p><strong>Sandifer</strong>: <em>So does everything.</em></p><p><strong>Day</strong>: I understand, but these things go in cycles. I mean, we talk about the Ciceronian political cycle. Cicero was absolutely right. The republic collapsed! And then, eventually, the empire collapsed, and the same thing in Britain – the British Empire has collapsed. And what we understand as western civilization is not a given. It’s either going to sustain itself and survive, or it’s going to gradually collapse. I, personally – I may be wrong – but I personally think that Christianity is a pillar of western civilization and if it is weakened sufficiently, then western civilization will collapse with it. I’m not saying that we’re going to go back to outdoor plumbing and grass huts, but I think that it’s not an accident that we’ve reached the point that we have largely based on what was once known as Christendom. [5]</p><p><strong>Sandifer</strong>: <em>To take it back to Wright, it seems to me what’s notable is that Tommy’s quest  is to root all of these forces of darkness </em>out<em> of government. I mean, it seems like Tommy is on the side of bringing </em>down <em>the government, as opposed to sustaining this civilization. Isn’t he seemingly establishing a new…</em></p><p><strong>Day</strong>: I think that’s too strong. I mean, basically, what Tommy is doing is that the government is being infiltrated in – of course, what we’re seeing there is a direct reference to C.S. Lewis’s <em>That Hideous Strength</em>. We’re talking about the Space Trilogy there.</p><p><strong>Sandifer</strong>: <em>Right.</em></p><p><strong>Day</strong>: And so what Tommy is doing is, he is opposing this infiltration – this corruption – of the government. He’s not attempting to overthrow it on behalf of the Pope.</p><p><strong>Sandifer</strong>: <em>Okay. I also want to talk a bit about the details of this dark side. There’s this bit in chapter two where Richard, one of Tommy’s childhood companions, is revealed to have gone over to the dark side. There’s an extended section that runs for about 1000 words – it’s quite a sizable chunk of the story – where Tommy steadily uncovers the extent of his corruption. First Richard reveals that he sold their magic sword for “a fragment of an old book of John Dee and a plague doctor mask from Avignon.” Then Richard turns out to have engaged in this neo-Pagan sex ritual “to unify our consciousness with the beyond,” saying that there’s a “life force beyond all things, a power that binds the universe together. Man emerged from ape-man due to the ruthlessness of that life force. And if it were harnessed, channeled, focused, used as ruthlessly as it is meant to be used, then what might emerge from man?” And then it turns out that Richard aborted the child that resulted from this ritual, causing Richard to start going on about how “the vital energies only reach their peak with the culmination of the libido. The ancients knew it, the Aztecs and the magicians of Egypt knew it.” So there’s this thousand word section that’s just going on in, actually, it seems to my mind, more detail than it ever goes on about the beauty of Christianity, the beauty of this God. Why is this sort of slab of axe-grinding necessary and important to the story?</em></p><p><strong>Day</strong>: Because Christianity is first and foremost about something very, very dark. It’s a complete misconception to think of Christianity as “he’s got the whole world in his hands.” That’s literally Sunday school theology. And what Wright is doing is something actually fairly similar to a Christmas day service – if you can believe it – that a pastor that I thought very highly of once preached. And he began it with this montage of video of just war and suffering and famine, and it was all to the tune of “Welcome to the Jungle” by Guns ‘n Roses. You can imagine, it’s Christmas morning, Sunday! And everyone was looking at it, going “what the hell are you doing?” And then he says, “Remember: Jesus was born in a stable full of donkey shit.” The world is a dark, corrupt, and fallen place ruled by an immortal psychopath. [6] And so what Wright is doing is he is reminding people of what the alternative is, what is going to happen if there is no hope and if the whole Christian mythology is nothing but mythology.</p><p><strong>Sandifer</strong>: <em>Sure, and I agree, I think one of the most powerful aesthetic aspects to Christianity is – and I think it’s one of the better parts of that book too – is that title: </em>One Bright Star to Guide Them<em>. The idea of this sort of single, very distant hope in a very dark world is, I think, very powerful. But you talked about this sermon in terms of war, famine, and death. I feel like Wright’s not got the same litany here. I think his list… As a practicing, self-identified occultist, I can promise you I have never sacrificed a goat or raped a sixteen-year-old girl and then aborted the resulting child in order to contact the forces of the beyond, and, I mean, I did a quick Facebook poll of my similar social-justice-warrior Occultist friends, really none of us do this. And Wright is practically libeling poor John Dee, who was a committed Christian who invented the British Empire. Do you really think this list of evils is things that happen, that these are real threats to the world?</em></p><p><strong>Day</strong>: I think that they do happen. I don’t think that they happen at the level that someone – a PhD like you is likely to be at. I think that if you got into some of the darker rituals that take place in the halls of power, I think you’d be very, very surprised and disturbed to know what goes on, and I’m speaking as somebody who used to know the Lays of the Enron corporation.</p><p><strong>Sandifer</strong>: <em>So then going back to this idea of liberating the halls of power, you’re very literally talking about rooting out what you believe to be an Occult conspiracy at the heart of government? Is that what you’re saying here?</em></p><p><strong>Day</strong>: No. We’re talking about the Ephesians 6:12. We’re talking about – it specifically talks about the wars being… [7]</p><p><strong>Sandifer</strong>: <em>Wait a moment, I want to talk about this aborting a child to harness the vital energies that only reach their peak with the culmination of the libido.</em></p><p><strong>Day</strong>: Okay, that I will give you. I think that Wright was just combining – I think, I don’t know – I’ve never heard of any Occult rituals involving abortions, either, unless you look at it at on a societal level.</p><p><strong>Sandifer</strong>: <em>Sorry, I’m going to have to ask you to follow up on that frankly amazing sentence of “Occult rituals involving abortion on a societal level” and find out what you mean by that.</em></p><p><strong>Day</strong>: Oh no, that’s not an accusation. I have a short story, or some sort of novella, and it just basically postulates some of the great massacres of history as being rituals, and, obviously, if you wanted to have a ritual that requires millions and millions and millions of lives being taken, there’s only a few ways you can do it. And obviously if you look at the history of abortion in the U.S.A., that’s one of the few ways that you can get to fifty million lives. But, like I said, I’ve never heard of any… You know, Wright is not using actual occult practices in his book, in this story. I don’t even think that he would want to.</p><p><strong>Sandifer</strong>: <em>No, but all of that said, though, I mean, it does seem to me like he is describing a not-completely incoherent theology. I mean, again, speaking as someone who is familiar with occultism, there’s this sort of weird bleed from vaguely talking about something that is a plausible supervillain re-working of an occult theology. And when you talk about, you know, “unify our consciousness with the beyond,” okay, I can accept that there’s lots of occult and spiritual practice that talks about getting in contact with some distant, divine source. There’s plenty of Christian mysticism that talks about that. A life force…</em></p><p><strong>Day</strong>: But would you be more content if he had actually talked about real practices, such as the Blood Eagle of the Norse or the cutting out the hearts of the Aztecs? I mean, there’s literally dozens…</p><p><strong>Sandifer</strong>: <em>Yes. Yes, I would be. I mean, given that he’s advancing such a specific viewpoint, I would much prefer something that’s actually historically grounded to this sort of half-accurate, vague accusation…</em></p><p><strong>Day</strong>: But it’s not an accusation, it’s a mockery! Basically, if you read that stuff where Richard is going on about the – It’s a mockery of Richard’s position. He’s basically making Richard out to be an idiot and an ass. And so I don’t – I mean, I understand your perspective as – let’s face it, your perspective is likely very different from most people’s, given that you’re talking about being a practicing occultist who’s disputing the legitimacy of the practices described. I’m not going to argue with you on that one, I’ll give that one to you, but I don’t think that it has any negative effect on the literary value of the story.</p><p><strong>Sandifer</strong>: <em>I mean, I suppose my problem is… I’m thinking of, say, </em>Paradise Lost<em>, and how so much of the power there comes from the fact that Milton lets his devil be seductive and tempting. And it’s not as though that detracts from the power of Milton’s message. I mean, it’s abundantly clear, reading </em>Paradise Lost<em> that Milton is on the side of God and not of Satan.</em></p><p><strong>Day</strong>: Agreed.</p><p><strong>Sandifer</strong>: <em>And, I mean, Wright even has Tybalt talk at one point about how “we must grow before we can war against hidden evils – evils that hide as good, corrupt, and subtle evils.” I guess my question is more: why engage in this over the top caricature and mockery of the forces of darkness? Why not let Tommy triumph over an actually subtle evil instead of a cheap parody?</em></p><p><strong>Day</strong>: Because this is written in the style of a children’s fantasy, which is customarily done in a moderately florid manner. Also, because it’s Wright’s personality. If you’ve read any Wright, you know that he has – in a literary sense – a very large and rather florid personality. And, you know, those sort of things are going to come through from time to time. But there is no villain here. This is not a story about temptation. <em>Paradise Lost</em> is trying to explain Lucifer. Milton is trying to explain his pride and everything. So that’s a very different story than here. Tommy’s not tempted by power, Tommy is tempted by a promotion in London and sitting around and getting old and watching TV. That’s what’s tempting to him. And so, the stuff that you’re talking about is true, but it simply happens to be irrelevant to this particular story.</p><p><strong>Sandifer</strong>: <em>I guess my problem is the specific combination. The fact that the case in favor of the forces of good is this authoritarian argument of obedience, and then the case against is this cheap mocking parody. And I really find that confluence disturbing. Regardless of position, actually – we talked about the idea of the same book only based in pre-Celtic mythology, or some other one. I think that regardless of the ideology, I would be very wary of any book – of anything, really – of anyone who is simultaneously advocating authoritarianism, and mocking and cruelly mockingly misrepresenting their opponents. I think that that is a nasty, nasty combination.</em></p><p><strong>Day</strong>: But that’s you. You’re talking about…</p><p><strong>Sandifer</strong>: <em>It’s not you?</em></p><p><strong>Day</strong>: No! Not at all!</p><p><strong>Sandifer</strong>: <em>You are all in favor of arguing for the necessity of obedience while misrepresenting and mocking the people who you are arguing that people should obey your demands to attack?</em></p><p><strong>Day</strong>: No, I don’t confuse reading for entertainment with a political op-ed. I mean, this is not a political op-ed, this is a story. Now, it does have a message to it, and that sort of thing, and maybe you like the message, maybe you don’t, but you can appreciate it for what it is. I mean, you know, I read… I’m an Austrian economist, I think China Miéville is, economically speaking, an utter moron. [8] And yet, I have absolutely no problem reading his stories, understanding the message, appreciating what he’s saying, and knowing it’s a good story, even though I think that the message that he happens to be putting out there, which in the case of his best work is almost literally Satanic…</p><p><strong>Sandifer</strong>: <em>I agree.</em></p><p><strong>Day</strong>: It doesn’t change my opinion that the work is a really great work. Yes, I disagree with the message, but so what?</p><p><strong>Sandifer</strong>: <em>As I said though, I’m willing to make this judgment message-blind. The problem I’m having is this combination with a demand to unquestioning obedience – to anything, you know, regardless of what we’re unquestionably obeying – combining that demand with…</em></p><p><strong>Day</strong>: But, again, I said it’s not a demand, it is an ideal. Most of us can’t do that. Actually, that’s not true; none of us can do it. None of us are capable of reaching that point of perfect obedience, of perfect submission to God’s will. You can’t do it, I can’t do it, John Wright can’t do it, and that’s…</p><p><strong>Sandifer</strong>: <em>Right, but when we’re talking about a world where people are – where there are subtle evils and mocking misrepresentations, isn’t a degree of skepticism a good thing? Isn’t a resistance to anyone’s demand that you should obey them a good thing?</em></p><p><strong>Day</strong>: No! Not if what is being told is true! How is being skeptical about the truth a good thing? All that means is that you’re opening yourself up to something that is false. Are you skeptical about 2+2?</p><p><strong>Sandifer</strong>: <em>I am not skeptical about 2+2, but the question becomes…</em></p><p><strong>Day</strong>: Right, but would you consider it to be good for someone to be skeptical about 2+2?</p><p><strong>Sandifer</strong>: <em>But at least within this story, we’re not talking…</em></p><p><strong>Day</strong>: Then you agree with me.</p><p><strong>Sandifer</strong>: <em>No, I don’t, because we’re…</em></p><p><strong>Day</strong>: Because it’s not – you’ve already admitted it’s not always good to be skeptical about something.</p><p><strong>Sandifer</strong>: <em>It is, I think – but we’re talking about people who are telling you to do things. We’re talking about Tybalt…</em></p><p><strong>Day</strong>: But we’re not talking people, we’re talking about a talking cat that represents God. I mean, if a cat were to come up to you and tell you to kill him, and you cut his head off and the sword starts on fire, and then a giant winged lion appears and says well done…</p><p><strong>Sandifer</strong>: <em>That seems to me like an exceedingly good case for skepticism!</em></p><p><strong>Day</strong>: I think at that point you either need to get off the drugs, or you kind of assume that it’s okay not to be skeptical at that point.</p><p><strong>Sandifer</strong>: <em>I think that the point where cats start talking to you is a good point to be skeptical. Like, that’s definitely a point where skepticism should come into play, Vox!</em></p><p><strong>Day</strong>: But Tommy is initially skeptical of Tybalt talking. [9] At first he thinks, you know, “I’m drunk,” and then he’s only convinced because the cat is telling him things that the cat can’t know. And also, keep in mind, Tommy is skeptical. He’s not only skeptical, he’s downright resistant. He doesn’t want to cut off Tybalt’s head. He doesn’t want to do it. He doesn’t want to obey. So he is skeptical, he is those things you want him to be, and what’s bothering you is that John Wright’s saying, “You know what, yes you’re skeptical, yes you’ve got doubt, believe and obey anyhow.” That’s what’s troubling you.</p><p><strong>Sandifer</strong>: <em>No, what’s bothering me is that the only thing in this book that John Wright does where he’s representing the beauty of his God is the demand for obedience. This book feels more interested to me…</em></p><p><strong>Day</strong>: No, no, no, that’s not – you’re confusing things, because that’s not the part – the beauty comes after.</p><p><strong>Sandifer</strong>: <em>What is the part? Where is the beauty in the book?</em></p><p><strong>Day</strong>: The beauty in the books is at the very end, where he opens up the door, and he sees that there’s a whole new universe out there that he doesn’t know about, and he’s being sent out into it, and he accepts the responsibility that he’s been given. He’s gone from child to adult. He’s grown from the kid being helped, to the wise old man. And the most powerful part of the book – the reason that, if you look on the Amazon reviews, you can see a number of people saying that it brought them to tears – and the reason is because, when he goes out there and he suddenly realizes, “I’m the wise old man, and I don’t feel wise at all,” and that’s the beauty.</p><p><strong>Sandifer</strong>: <em>Sure. I want to look at that ending, though. Thomas is told, “You will have many roads to walk, and there will be many worlds under your care. There will come a child who leads a star by the hand, whose voice can still the lion’s rage. It is for you to carry the shards of Angurvadell, the great sword. It is a weapon none may use until he re-forges it and makes it anew himself, as with all such weapons of my father’s kingdom. Now come, you will find this child in a world beyond the Pleiades, considered young for his ancient and supernal race, but, compared to humans, old and wise beyond all reckoning.” I mean, my problem here is the beauty – that’s not a beauty of God, that’s a beauty of ripped-off bits of </em>Black Cauldron <em>and </em>Lord of the Rings. <em>At that point I feel like the elusiveness that you talked about as praise starts to work against the book. I mean, all that’s beautiful is just the stuff that Wright has harvested from other books.</em></p><p><strong>Day</strong>: No, but he doesn’t harvest from other books. Those books and Wright’s novella are all drawing it from the same place; they’re all drawing it from Christian theology. The reason that every weapon has to be broken, every weapon is broken – that’s a reference to the fallen state of man, and the need for repentance. And so, you know, what you’re… You’re blind to that aspect of the beauty, because you don’t see that, you’re not looking at that. And also, I want to go back for a second and point out, the evil of Richard is not the only evil. That’s just one of the evils. You know, the cowardice of Sally – or Sarah is her adult name – you know, in some ways, Sally/Sarah is the more contemptible figure than Richard. Richard is the traitor, but Sally’s the one who knows better, and yet she won’t lift her finger. That too is an evil that is every bit as great as Richard’s treachery. And then, you know, you go on to the one who’s died, and whether you realize it or not, that too is an evil. Death is an evil. And so what we’re talking about here is not just the one…</p><p><strong>Sandifer</strong>: <em>Tell me what you mean by “death is an evil.” Because I think that’s a tough claim. I mean, I have trouble ascribing any moral force to a seemingly inherent fact of existence.</em></p><p><strong>Day</strong>: But again, see, that again is your unfamiliarity with Christian theology. You know, “Death, where is thy victory, death, where is thy sting?” Jesus Christ came to conquer death. That was the whole… The resurrection was the breaking of Satan’s power, and so, the fact that Penny is a fallen warrior. [10] <br/><br/>All three of them, Richard, Sally, and Penny are all fallen warriors. Richard was defeated by his own greed for power, his own lust for power. Sally’s defeated by cowardice, and Penny is defeated by death. And so what the story is looking at is that it’s looking at the last warrior, the last hope, and his problem – he’s kind of…</p><p><strong>Sandifer</strong>: <em>He’s a literal doubting Thomas.</em></p><p><strong>Day</strong>: Yeah, he’s a literal – exactly, and that’s why he’s named Tommy. His potential failure is doubt. And he conquers the doubt – unlike the others, although it is hinted that Sally may eventually defeat her cowardice as well. But again, that’s a level of the story that you’re not necessarily going to be privy to. You know, you were thinking that Richard is the only representation of evil, but it’s not true. It’s just one form of it, the one obvious form of it. The others are just as real, and only one of them, only doubt, is conquered. Of course, doubt is conquered by what: by the very blind faith, the very obedience that you have trouble with.</p><p><strong>Sandifer</strong>: <em>I mean, I do want to point out… I recognize that Sally is depicted as evil. I don’t necessarily think that there’s a ton of subtlety there. She doesn’t really get much beyond a sort of “she’s fundamentally weak and unwilling to obey and therefore is a form of evil.” I think the problem with the lack of any subtlety in the evil does run throughout the book, I do want to be clear on that. I certainly picked on the easiest one for the purposes of the discussion, but it’s not a problem that I think is limited to just Richard.</em></p><p><strong>Day</strong>: Okay.</p><p><strong>Sandifer</strong>: <em>But we have reached about the halfway point of what the program should be, so why don’t we throw it to a brief mid-program break and come back and talk about </em>The Wasp Factory?</p><p><strong>Day</strong>: That sounds great.</p><p><strong>Sandifer: </strong><em>Once again, I’m just going to start with a description of the book. Here’s the back of the book text of the copy I have:</em></p><p><em>Enter, if you can bare it, the extraordinary private world of Frank, just sixteen, and unconventional to say the least.</em></p><p><em>That’s the only plot description it gives, and then it just gives a brief excerpt from a quarter of the way into the book or so:</em></p><p><em>Two years after I killed Blythe, I murdered my young brother Paul, for quite different and more fundamental reasons than I disposed to Blythe, and then a year after that, I did for my young cousin Esmeralda, more or less on a whim. That’s my score to date: three. I haven’t killed anybody for years, and I don’t intend to again. It was just a stage I was going through.</em></p><p><em>And I think that is a pretty good introduction to the tone of the book. It’s a very macabre comedy, and I think that one of Banks’s strengths as a writer in all of his books is his wonderfully macabre sense of humor. I remember also the fantastic opening sentence of his book </em>The Crow Road, <em>“it was the day my grandmother exploded,” which is just one of the great opening sentences of literature as far as I’m concerned, for its sheer macabre curiosity.</em></p><p><em>Beyond that, </em>The Wasp Factory<em>, is very much a psychological portrait of this character of Frank that Banks creates, and I feel like he manages this really interesting sort of Scottish variation on the great American tradition of the southern gothic. Obviously there’s this long British tradition of grotesques that’s a major part of British literature, and then you’ve got this sort of southern gothic feel of “the old family secrets that are going to come to light and reveal all of the odd, depraved nature of these rural folks” told in this sort of slightly-horror-novel feel, with this sort of Scottish rural twist on it, and the attendant macabre humor, as I mentioned. Also I thought a really interesting invocation of the specific landscape of rural northern Scotland. And I think that’s also a strong part of the southern gothic tradition – Faulkner and everyone are so rooted in this very strong tone of the south. Or Lovecraft’s New England gothic that’s really rooted in the tone and feel of old crumbling New England. I really love the sort of rural Scottish grotesque spin on that tradition, I thought that was very strong.</em></p><p><em>And I thought Frank’s approach to the world was wonderfully detailed. I love the work of psychogeographic writers, like Alan Moore and Iain Sinclair. I love how Frank’s weird sort of system of divination and magic that he creates out of his own environment is so rooted in the landscape and rooted in the peculiarities of this island and his body, and yet has this weird symbolic power that encompasses the entire book. One thing I know we’re going to get to is talking about whether or not this book is science fiction or fantasy, and I do want to advance the sort of willfully cheeky case that it is, because Frank’s magic works. The wasp factory predicts fire, and, sure enough, the book ends in a blaze of flaming sheep.</em></p><p><strong>Day</strong>: I wouldn’t argue with you on that point; in fact, I think you can make a stronger case for it. At the time when he attempts to contact and influence his brother Eric, the spell actually works, and then he’s thrown out, and he’s actually burned on his hand from the attempt to contact him.</p><p><strong>Sandifer</strong>: <em>Right. There’s this sense that there is a physical aspect.</em></p><p><strong>Day</strong>: And it also physically threw him back.</p><p><strong>Sandifer</strong>: <em>Right, and obviously the book is engaged in a very careful dance of making sure there’s nothing that is impossible within it. You certainly can account for everything as coincidence, and that’s just the point where Frank is holding his hand too close to the fire and starts to burn, but the book does create this…</em></p><p><strong>Day</strong>: No, but you can’t explain… I mean, you could explain it as he’s delusional, or imagining it, but the fact that he’s physically thrown out of the room after being thrown out of Eric’s mind, I think that that’s a physical… You know, maybe it’s Banks slipping up. I don’t think so, I think the magic actually works.</p><p><strong>Sandifer</strong>: <em>Alright. I would be perfectly willing, given how Frank is an unreliable narrator, [11] to take that as semi-delusional, but if you want to certainly argue that the magic actually works, I think that’s a more interesting book in a couple of ways, so I’ll certainly accept that. In which case, yeah, I like the way in which Banks creates a magical system as detailed and nuanced as any I’ve seen in any work of fantasy, incredibly symbolically rich. It feels like there’s this huge amount of symbolism and depth to this mythology, and it comes out of just this remote little Scottish island. I love that sense of depth in a small, mundane place like that.</em></p><p><strong>Day</strong>: Well, I have to say that I also appreciate the magic system. I’m not convinced that it is as meaningful in the symbological sense or in the semiotic sense as you’re suggesting. But that’s not a criticism, I’m just saying I don’t know – if there are semiotics there, if there are important symbols there, I don’t know what they are.</p><p><strong>Sandifer</strong>: <em>Well, I think they’re very animist semiotics. I don’t want to suggest that they’re semiotic in the sense of Wright’s mythology, where it’s this elaborate allegory for a pre-existing mythological system, but I think it’s intensely semiotic in terms of just the way that Frank is building it. The fact that it’s the skull of the dog he believed castrated him, it’s artifacts of each of his three murders. I’m talking about the semiotics within Frank’s grotesque life story.</em></p><p><strong>Day</strong>: No, I absolutely accept that, and I do think that that is without question, the strongest part of the book. I like Iain Banks as a writer quite a bit. I wouldn’t say he’s one of my top ten favorite authors, but I do think that he’s been one of the best writers in the science fiction genre over the past twenty years or so. And I also would say that the beginning, with the sacrifice poles, where he describes going around and checking on them, is a fantastic beginning. I thought I was going to like the book a lot after I read the first couple pages. And so despite the fact that I think that it’s an absolutely dreadful, terrible, and even ineptly written book, I think that it does show some of Banks’s strengths that later come out much more effectively in some of his later fiction.</p><p><strong>Sandifer</strong>: <em>You say ineptly written. So what do you mean, what do you think is inept about it? Because you mentioned in one of the e-mails we exchanged that you think there’s some problems with the plot, and I have to say, I don’t see any, and I looked over the plot again last night to make sure. So where do you think it goes wrong?</em></p><p><strong>Day</strong>: Okay. Well, when I… This is just my way of looking at a book, so I’m not making any grand statements that anyone else has to look at a book this way, but I generally divide a book into four categories…</p><p><strong>Sandifer</strong>: <em>Right, you posted about this on your blog a bit ago, prioritizing them as: character, plot, style, concept. [12]</em></p><p><strong>Day</strong>: Yes. And, now style, you know, Banks is a wonderful writer, you can’t complain about his style. Now¸ where things start to go wrong, is on the story. First of all, if we tie it back to <em>One Bright Star to Guide Them</em> a little bit, a lot of people have complained – and reasonably so – that in the story Wright is often telling more than showing. Well, in <em>The Wasp Factory</em>, telling is about all that happens. Almost all of the events, and almost all of the significant events, are in the past, and it’s just Frank telling us what happened then, what happened then, what happened then. And from a plot perspective, there’s three problems: number one, the plot is essentially alternating between Frank talking about something awful that he did, or something awful that happened to him when was younger, with telephone calls from Eric, his mad brother. And basically the entire structure of the book is switching back and forth between those two things and totally uneventful stuff like having dinner, or going out to a club and drinking and throwing up, right up until you hit the end. If you want to say something, go ahead and jump in, I’ve got two more points.</p><p><strong>Sandifer</strong>: <em>Yeah, I would characterize it slightly differently. I agree, there is this alternating structure, but I think what we actually have is something very similar to the plot structure of </em>Use of Weapons<em>, the third </em>Culture <em>novel, which is told in a set of alternating chapters. One set is numbered one to thirteen in text, and goes one, two, three, four, and then the other starts with XIII and regresses to I, numbered as Roman numerals, and telling the story of the same character: one set goes forward, the other set then works its way backwards.</em></p><p><strong>Day</strong>: But that’s fine, but the point is, regardless, it’s still a book where you’re basically switching between telling about the past, not very interesting dialogue, and literally nothing happening, and switching off between those three things.</p><p><strong>Sandifer</strong>: <em>I would say you have the simultaneous story of Frank erecting his defenses against Eric’s incoming attack on the island and the story in reverse gradually getting to the explanation of who Eric is, why he’s gone mad, and why the island is under attack on the first place, finally converging as we get both the original root cause: his father’s faked dog attack on him. Which became such a fundamental part of Eric’s madness, it’s why Eric is burning dogs – and Eric’s actual attempt to attack the island and blow it up. So finally you get the – much like in </em>Use of Weapons – <em>you build to the final effect and the reader’s understanding of the cause both happening together.</em></p><p><strong>Day</strong>: I will readily admit, there is an amount of tension that is created both in terms of trying to find out – you’re curious to find out what’s going to happen when Eric gets there, and you’re also curious to try to figure out how deeply the madness ran that caused him to get that way in the first place, because, you know, in the historical tales, Eric is always a good figure, a safe figure, which is very different than the very threatening, frightening sense that he creates in the current stuff. But that, to me, doesn’t excuse the boring, boring, boring parts about the meals with the housekeeper, the father doing his fatherly thing, the conversations with the dwarf – which, basically, you could completely cut that out of the book altogether and not even notice, and there’s a… For a book that is so short, at 163 pages, there’s a remarkable amount of stuff that’s just not even relevant to the plot and not needed. But let me get to the second two points, which are more significant.</p><p><strong>Sandifer</strong>: <em>Sure.</em></p><p><strong>Day</strong>: What I kind of realized with some astonishment is that <em>The Wasp Factory</em> is basically a grotesque version of a Disney movie. And it’s a cheap, cheap ending, too. I’m not talking about what you think I’m talking about, either. Basically, the entire book comes down to the Disney message of “accept yourself.” And it’s such a cheap sell-out, because the whole thing is built up… You know, some people unfairly criticize Banks and they say that he tacked on the shock ending, and that’s not true, because he methodically gives you hints that Frank is not what you think him to be throughout.</p><p><strong>Sandifer</strong>: <em>In fact, every transgender person I know who has read the novel figured out the shocking twist before the end, which is very telling.</em></p><p><strong>Day</strong>: Right. I’m not transgendered and I figured it out, as well.</p><p><strong>Sandifer</strong>: <em>I had it spoiled before I first read the book, so I can’t judge.</em></p><p><strong>Day</strong>: Well, but what I found really annoying about the way that it built up is that the appropriate ending should have been that Frank becomes Eric – he builds up, he stops Eric, but then he becomes Eric because he has this hatred for women, then he suddenly finds out he is a woman, he finds out what his dad has done to him, etcetera, and, you know, he should blow up the island. And that would have been a much better ending, and something that would actually be consistent with the characters and would make for a coherent end, whereas in the current case, the story doesn’t even end. It doesn’t have an ending. I mean, the ending is the revelation that Frank’s a woman, and then nothing happens. He goes out, he finds Eric, and decides that he accepts himself, and he doesn’t try to help Eric. I mean, it’s such a sell-out.</p><p><strong>Sandifer</strong>: <em>I don’t that that he accepts himself. I think he rejects the magical system that we’ve seen. And that also helps explain a lot of why those parts that you found boring – and certainly none of what you mentioned, the dwarf conversations and the like, were my favorite parts of the book, but I didn’t find them a particular chore to get though either – and I think that…</em></p><p><strong>Day</strong>: No, no, no, I’m not saying I did, I’m just looking at it from a critical point of view, that’s all.</p><p><strong>Sandifer</strong>: <em>Right. But I think they were important in giving a full enough context of who Frank is and what Frank is like. Because the final moment isn’t Frank accepting who he is. He has no idea who he is at that moment.</em></p><p><strong>Day</strong>: No, but he doesn’t react. The whole time, Banks has set it up for him to react with hatred and anger of what he is. And instead, he doesn’t. He doesn’t do anything. In fact, there is no ending, it just stops. Because the actual ending is, “oh guess what, Frank’s a girl.” And the Eric story doesn’t come to a climax, the showdown with the father doesn’t come to a climax, and Frank himself does nothing. You’re certainly entitled to say, “well, I think that he’s rejecting his magic,” but it doesn’t actually spell it out in the story.</p><p><strong>Sandifer</strong>: <em>Yes it does! “Perhaps it was because I thought I had had all that really mattered in the world, the whole reason and means for our continuance as a species, stolen from me before I even knew its value. Perhaps I murdered for revenge in each case, jealously exacting through the only potency it might command, a toll from those who passed within my range. My peers who each would otherwise have grown into the one thing I could never become: an adult. Lacking, as one might say, one will¸ I forged another. To lick my own wound, I cut them off, reciprocating in my angry innocence the emasculation I could not then fully appreciate, but somehow, through the attitudes of others, perhaps sense an unfair, irrecoverable loss. Having no purpose in life and procreation, I invested all my worth in that grim opposite, and so found a negative and negation of the fecundity only others could lay claim to.”</em></p><p><em>I mean, to a… If I wanted to be a little cheekier than I do – actually, apparently I’m just going to do it with a rhetorical trick like this, so I’ll just go ahead and be as cheeky – I think that why you’re reacting to this as strongly as you are, and sort of over-looking it is the same problem you accused people of having with John C. Wright’s invocation of Christianity. This is a mockery of pick-up artists. This is a mockery of all your neomasculinist friends. This is a mockery of your whole view that life and procreation is the only purpose to things. Because there’s another part towards the end…</em></p><p><strong>Day</strong>: How is that a mockery? I think you have it backwards. He’s saying that he doesn’t have to be that way anymore, because now he realizes that he’s not emasculated. It’s not impossible for him to be fecund, he’s actually a woman.</p><p><strong>Sandifer</strong>: <em>But she says she doesn’t even want that now. [13] There’s a part where she says she can’t even imagine wanting to give birth.</em></p><p><strong>Day</strong>: Oh, for crying out loud, what girl… I mean, practically every woman I know, every mother I know, back when she was eighteen years old, was saying she didn’t want kids. I mean, come on. She just found out she’s a woman. I think it’s a little bit much to expect her to have planned out her future the first day, especially with her psychopathic brother trying to blow up the place with explosives.</p><p><strong>Sandifer</strong>: <em>I think it’s equally believable that someone who was socialized as male for the first sixteen years of their life might decide that they’re actually not particularly interested in reproduction. It’s not as though…</em></p><p><strong>Day</strong>: I’m not saying she is, I’m saying…</p><p><strong>Sandifer</strong>: <em>But where she is…</em></p><p><strong>Day</strong>: But what you’re saying is factually wrong. What you’re saying is that… You were just saying that she doesn’t need her magic anymore, she doesn’t need to kill people anymore, blah, blah, blah. Why not? Because she’s not emasculated. Because she can do the things that she thought she couldn’t do before.</p><p><strong>Sandifer</strong>: <em>See, I think it’s very much…</em></p><p><strong>Day</strong>: It doesn’t matter whether she’s going to, she has the option now that she did not have before.</p><p><strong>Sandifer</strong>: <em>“I believed that I decided, if I could never become a man, I, the unmanned, would outman those around me.” Yeah, so he goes through that. “Now it all turns out to have been for nothing, there was no revenge that needed taking, only a lie, a trick that should have been exposed, a disguise which even from the inside I should have seen through but did not want to.”</em></p><p><strong>Day</strong>: Right, so that’s exactly what I’m saying. All the stuff that she did, all the anger, all the rejection and stuff, all of it was a lie, and she didn’t have to do any of that, because she’s really a woman.</p><p><strong>Sandifer</strong>: <em>“Inside this greater machine, things are not quite so cut and dried – or cut and pickled – as they appeared in my experience. Each of us, in our own personal factory, may believe we have stumbled down one corridor, and that our fate is sealed and certain, dream or nightmare, humdrum or bizarre, good or bad. But a word, a glance, a slip, anything can change that, alter it entirely, and our marble hall becomes a gutter or our rat maze a golden path. Our destination is the same in the end, but our journey – part chosen, part determined – is different for us all, and changes even as we live and grow. I thought one door had snipped shut behind me years ago. In fact I was still crawling about the face. Now the door closes and my journey begins.” I think that’s very, very focused on this notion of liberation. I think it’s not…</em></p><p><strong>Day</strong>: It is, but that’s my point! It is a liberation. She’s been liberated from the lie.</p><p><strong>Sandifer</strong>: <em>But Banks isn’t invested, doesn’t seem to have her invested in the specific lie she was liberated from. She seems to me in that moment to be liberated from the idea that her fate has to be determined in the first place. She’s liberated from the sort of ideology that says the only purpose is anything, procreation in particular.</em></p><p><strong>Day</strong>: I think that’s ridiculous, because she was limited by the belief that she had been mutilated and was unable to be a man, and now that she realizes she never was a man, she wasn’t mutilated, she’s freed.</p><p><strong>Sandifer</strong>: <em>But regardless, the point seems still to be a critique of the sort of toxicity of this vision of masculinity and this very masculine magic that she’s been enacting through the whole book. I mean, it does seem to me…</em></p><p><strong>Day</strong>: Yeah, because she’s a woman! Of course none of it is necessary. None of it is relevant to her anymore.</p><p><strong>Sandifer</strong>: <em>Do you think it was necessary otherwise?</em></p><p><strong>Day</strong>: And this also touches on my third part, which is: this is an idiot plot. I mean, this is what Roger Ebert described as – you know, he said that “the idiot plot is any plot that would be resolved in five minutes if everyone in the story were not an idiot.” So, you’ve got somebody who literally has never looked in her pants to discover that she’s got a vagina, [14] you’ve got the father who is beyond idiocy with the whole story about the dog and the creation of the fake genitals just in case she ever asks, and then of course you’ve got Eric, who apparently never figured out that his sister was actually his sister either. I mean, this is an idiot plot. There’s no way around that.</p><p><strong>Sandifer</strong>: <em>This is grotesque, it’s a grotesquery. I think that the ludicrousness of it is a joke in the same spirit as “killing three people was just a phase I was going through.” I don’t think it’s an idiot plot so much as it is a parody of rural grotesquery that is deliberately at the absolute limits of what is even remotely plausible.</em></p><p><strong>Day</strong>: I personally think it’s well beyond those limits, and, you know, I’m not saying that there’s no humor to it, but, you know, I didn’t find it funny, for the most part. The occasional one-offs, like you mention, you know, those were mildly amusing, but just to wallow in that depth of depravity and violence and murder, you know, it’s literally disgusting, and I didn’t find it funny, I didn’t find it edifying. Like I said, the plot is a literal idiot plot. Whether you want to say it’s because it was parody or not, it’s still an idiot plot. I’m not one of those people who finds… What’s that show, the guy from <em>The Office</em>…</p><p><strong>Sandifer</strong>: <em>U.S. or U.K.?</em></p><p><strong>Day</strong>: Ricky Gervais.</p><p><strong>Sandifer</strong>: <em>Yes.</em></p><p><strong>Day</strong>: He has that television show where he pretends to be retarded or something, and every ad he’s gurning, you know what I mean? It’s a relatively new show. I don’t find that funny either. And so, maybe the fact that it’s got an idiot plot but it’s a parody, therefore it’s supposed to make it intelligent, but to me, the plot is still what the plot is, and so I found it very, very disappointing, because the whole plot is totally dependent on the three major characters being and behaving like complete idiots.</p><p>And the problem I have when you talk about the whole psychosocial aspect of Frank is Banks, in my opinion, gets the characters completely wrong. Frank is not convincing in any way, shape, or form as a girl who believes she’s a boy, and that sort of thing. I’m pretty sure that Iain Banks never had any daughters, because if you’re a parent, and you’ve got both boys and girls, there is not a chance in hell that a little girl, even if you raise her as a boy, is going to behave like a boy. [15] This is where I think it goes beyond parody and is a level of absurd that is not credible. I would have found it much more credible if Frank had some female attributes and characteristics in his thinking that he couldn’t explain. But instead, like you said, he’s more of a parody of a hyper-male, and that to me makes no sense whatsoever.</p><p><strong>Sandifer</strong>: <em>I agree that there’s an element of extreme implausibility, obviously, to some of the plot elements. I do think, going through, I note that Banks takes care to find some explanation for pretty much all of the elements of it, so that he at least has a sort of nice Aristotelian unity, where everything is either made necessary or likely by some other event, even if the characters are certainly very extreme. But it seems to me like your objection is less that you don’t believe that Frank would have physically figured it out – because there is the explanation, for instance, of the male hormones enlarging the clitoris so that it looked like the stump of his penis.</em></p><p><strong>Day</strong>: Yeah, I get that, but where did the vagina come from?</p><p><strong>Sandifer</strong>: <em>I would assume that Frank just assumed it was the mutilated and tattered remnants of the wound.</em></p><p><strong>Day</strong>: Well, except for the fact that the urine is not coming from the stump of the clitoris. And the fact that it kind of goes pretty deep. I mean, we’re dealing with somebody who is literally retarded, which we know from his behavior he’s not. It’s just not…</p><p><strong>Sandifer</strong>: <em>But it seems to me that your bigger objection is the larger…</em></p><p><strong>Day</strong>: That’s not my major objection, I’m just pointing out that it’s not credible.</p><p><strong>Sandifer</strong>: <em>Right, it seems like your larger objection is simply a fundamental rejection that the gender roles could work that way, at all.</em></p><p><strong>Day</strong>: I think it is highly, highly improbable. I’m not saying it’s impossible. I mean, ironically enough, if Frank – in fact, Banks screws this up to, because if Frank at the end decides, you know what, I don’t care, I’m more of a man, doesn’t matter whether I have a penis or not, I’m more of a man and I’m sticking with it, that would actually be consistent with the gender interpretation that you’re putting on it. But he doesn’t do that. He actually rejects his male upbringing, his male persona, and embraces his femininity, which is biological, you’ll note, not construct, [16] and so…</p><p><strong>Sandifer</strong>: <em>I don’t think he embraces anything. I think he’s in a state of complete confusion there. I think that he is not going to keep trying to live…</em></p><p><strong>Day</strong>: But, you just said, he rejected…</p><p><strong>Sandifer</strong>: <em>I mean, he’s rejecting masculinity and seemingly accepted the female pronoun, and started calling herself Frances… I mean, do you know a lot of trans people, Vox?</em></p><p><strong>Day</strong>: Right, which means that the whole construct thing… I mean, the one little thread that I was willing to leave Banks is gone because Banks cut it. There’s no reason that Frank should not have female mental characteristics, and female behaviors.</p><p><strong>Sandifer</strong>: <em>I think that the whole point is that Frank isn’t in an either-or situation anymore. I mean, I’m speaking as someone who – I’m going to go out on a limb and guess I probably know more trans and genderqueer people than you do – but I really have no trouble believing that Frank, in that moment, is not seeing their life as an either-or choice between normatively male and normatively female.</em></p><p><strong>Day</strong>: I’m willing to give you that, but what I’m saying is, it doesn’t matter. Because if he’s not completely… I’m going to accept for the sake of argument the trans theory, and the idea of mental sex, you know, whatever…</p><p><strong>Sandifer</strong>: <em>To be clear, I don’t think Banks is going that way, necessarily</em><strong>.</strong></p><p><strong>Day</strong>: No, I’m not only saying that Banks is not going that way, I’m saying Banks screwed it up. Banks gets it hopelessly wrong, because if Frank is fully mentally male, then the revelation should not make a difference. Because he’s not, because he is willing to abandon his masculinity now that he knows the truth, then there should have been female mental indicators in his thinking and in his actions that do not exist. Banks fucked up the characteristics – he screwed up his characterization of Frank.</p><p><strong>Sandifer</strong>: <em>That’s only true, though… You’re still insisting on an absoluteness of… What you’re insisting…</em></p><p><strong>Day</strong>: No, I’m not! I’m saying that if you accept the non-absolute, if you accept the whole gender confusion blah blah blah, then Banks had to screw it up.</p><p><strong>Sandifer</strong>: <em>Possibly I’m just quibbling with your word choice here, but you say there should have had to be female characteristics. I don’t think there had to be anything as specific as that. I think there only has to be a sense of wrongness. I think there only has to be a sense of, to use the word that has come out of trans discourse on it – and I do think that Banks, you know, he’s writing in 1984…</em></p><p><strong>Day</strong>: No, because you’re dealing with a little girl here. You’re dealing with a literal little girl. [17]</p><p><strong>Sandifer</strong>: <em>I don’t think we’re dealing with a person whose gender is particularly clear. I believe, in the essay I wrote about it…</em></p><p><strong>Day</strong>: You’re dealing with someone who is completely, 100% genetically female. The only difference is that the father decided to raise her otherwise, and then pretended, once she reached a certain age, that she had been castrated. Now, there’s absolutely no reason to completely eliminate every single last vestige of femininity from her, other than, Banks didn’t get it right.</p><p><strong>Sandifer</strong>: <em>Well, no, because Banks goes into detail about how Frank’s father is constantly ranting about the evils of women, and indoctrinating Frank to a particular misogyny. I think that’s…</em></p><p><strong>Day</strong>: How is that going to… Phil, none of that stuff is relevant. I have children. [18] Their behaviors begin way before anyone starts ranting, before they even understand that anyone’s ranting something. You don’t get away from that, and that’s not sufficient to completely eliminate every last vestige of femininity from her. And I’m not saying that from the absolutist vision.</p><p><strong>Sandifer</strong>: <em>My point, though… You’re still talking about this final state as one in which the character’s only two options are masculinity and femininity.</em></p><p><strong>Day</strong>: I’m not! I’m saying that…</p><p><strong>Sandifer</strong>: <em>Then why does the absence of femininity matter? All there needs to be is a sense of wrongness.</em></p><p><strong>Day</strong>: No, because she was a little girl along. That’s the big reveal. That’s the big, stunning thing. And yet…</p><p><strong>Sandifer</strong>: <em>No! No! The reveal was that she was given male hormones all along, and has been raised for twelve years with male hormones and male socialization. There’s no revelation that she has this intrinsic “little girl” aspect to her.</em></p><p><strong>Day</strong>: Exactly, exactly. And that’s what is completely, hopelessly wrong about it. Because the moment that she finds out that she’s actually a girl, it suddenly changes all of these things for her. I’m not saying that she suddenly becomes completely female, or whatever. I’m saying that the fact that that one piece of knowledge suddenly changes everything for her demonstrates that Banks’s characterization of her, as a male who was damaged in an accident, is simply a very poor characterization, even if you’re looking at it from your trans-genderqueer-whatever perspective. In fact, from that perspective, it’s much more wrong than it is if you’re looking at it from a binary male/female perspective.</p><p><strong>Sandifer</strong>: <em>I still think that you’re overstating the degree to which she is identifying as a woman, but I think the shock is more her father has been lying to her for however many years. I mean, I think the shock is “my life is a lie and this event that I thought was completely formative to who I am, this event that was completely formative to my history, never actually happened.” I don’t think that needs to be about gender. I talked about this in the tradition of the gothic novel; that reveal of the big family lie is just as shocking in any other gothic novel.</em></p><p><strong>Day</strong>: I don’t disagree with that. What we were talking about was not the whole of the novel there, we were talking about the way in which Banks was portraying Frank. I was just saying that I think that it was either an inept or a dishonest portrayal, meant to enhance the reveal at the end, and that was one of the things I didn’t like about it. But the bigger problem, like I said, is: not much happens, the plot requires all three major characters to be idiots, the character portrayals themselves are pretty bad – except for Eric, I thought that the portrayal of Eric was actually quite good – and the biggest problem is that there’s no resolution at the end. There’s no end to the story. And I think that, like I said, I think that it would have been a lot better if it had actually ended in fire, the way that the wasp factory predicted.</p><p><strong>Sandifer</strong>: <em>Whereas, again, I think Frank’s characterization is fantastic. Though, I admit, I’m not sure how one can argue that his magical system is well worked out and his character isn’t. I think they’re far too intertwined for those two statements to not have to be true together. So, to my mind I think we have a pair of very good characters in Frank and Eric. I’ll agree, I think the father is less well-characterized. I also think he’s a more minor character. I think it’s mostly a two-hander of a book between Eric and Frank. I think the plot… Quite a lot happens, it seems to me, within Frank’s animist system. Inasmuch as that’s exposited and built up through the book, many of the minor events seem to me to have considerably more symbolic weight once one looks at them from the sense of his magical system, and I think that we build to a fiery and effective climax. I think that the last action sequence, I’ll admit, “Eric drops the torch and runs off” is a little lame. If I were shooting a movie version, I’d probably re-choreograph that. But, other than that, it seems to me that we have this great build of this increasingly weird and incredibly unsettling magical system, that it at once makes rational sense within Frank’s world and is, as you put it, tremendously disturbing and unsettling in places, and murderous, and that, you know, we finally get to this moment of liberation from it, where, I mean, I’m inclined to…</em></p><p><strong>Day</strong>: But again, it’s liberation from his own construct that’s based on a lie. And meanwhile, there’s no repentance for the murders. There’s no… I mean, there’s just… It’s the unyielding nihilism of it is just literally reprehensible. This is who so many people who read the book just absolutely hated it. [19] Even the people who like it, the people gave it five stars on Amazon, what they said is, “It’s uncomfortable to read, and that really is the charm of this book.” Well, I’m sorry, but anybody can write something that’s uncomfortable to read. It’s, to me, Banks’s constant fascination with farting, and shit, and things rotting and stuff… I mean, to me, that’s an indication of the guy’s psychological problems. It’s not an indication of his being a great writer.</p><p><strong>Sandifer</strong>: <em>To my mind, what’s important isn’t merely that it’s uncomfortable. I agree, anyone can be uncomfortable. Much like industrial music reaches its endpoint with noise music and with just sheer screeching noise [20] – yeah, you can only go so far with raw discomfort. But what strikes me as interesting about the discomfort in </em>The Wasp Factory <em>is that it’s so nuanced and detailed and thorough, that Banks has engineered a…</em></p><p><strong>Day</strong>: What is nuanced about it? He’s slaughtering kids left, right, and center in ridiculous ways. I mean, first of all, the adder thing, he gets it wrong, because an adder is not going to kill somebody. They’re not poisonous enough to. And secondly, they don’t live on islands.</p><p><strong>Sandifer</strong>: <em>I again want to point out, I don’t think that this book is going for highly plausible. So, you know, I’m not sure I buy critiquing the scientific accuracy of the adder as a particularly meaningful objection here.</em></p><p><strong>Day</strong>: Even less relevant would be the idea that the military is not going to notice this huge metal kite in an area where their jets fly. I mean, they’ve got really good radar systems. I’m pretty sure that someone would go check it out. But I’ll give you that one.</p><p><strong>Sandifer</strong>: <em>Finding plot holes in the British tradition of the grotesque is not the greatest challenge literature has ever thrown up, but I think that’s very much not the point. To me, the plausibility comes in terms of: Frank has a great degree of psychological believability to me. I can believe the construction of Frank’s magical system. The degree to which Frank’s religion simultaneously makes sense and is repulsive is very powerful to me. I had…</em></p><p><strong>Day</strong>: But this makes me want to know, are you O.C.D.? Because what really struck me when I was reading is, “wow, this kid’s got O.C.D.”</p><p><strong>Sandifer</strong>: <em>I am not O.C.D., actually. I am A.D.D.; quite the opposite. But, no, I do find something fascinating in understanding repulsive viewpoints that are nevertheless internally consistent. Hence, interviewing you.</em></p><p><strong>Day</strong>: I’ve got to give you that point.</p><p><strong>Sandifer</strong>: <em>You know, certainly from my perspective, I think that there is a value in understanding the alien and the strange, and so to my mind what’s valuable about this book, what’s compelling about </em>The Wasp Factory<em>, is… Again, it’s getting back to that, to </em>Paradise Lost<em>… if we make the sort of, you know, that’s the Miltonian angle… I feel like </em>The Wasp Factory<em> gets into an almost Blakean level of just the simultaneous understandable and alien nature of it – is a fascinating labyrinth to be lost in for 160 pages.</em></p><p><strong>Day:</strong> I agree, but the problem that I have is twofold. First of all, I think that the alien being created is complete bullshit, I don’t find it credible in the slightest, and secondly…</p><p><strong>Sandifer</strong>: <em>I don’t think it’s credible either, I’m just interested by it.</em></p><p><strong>Day</strong>: I find it very repulsive, disgusting, and evil. I think if you want to dive into an alien mindset, you know, read <em>The Divine Secrets of the Ya-Ya Sisterhood</em>. That to me was truly a diving into alien territory, and it was fascinating. Reading something like <em>The Tale of Genji</em>, which was written by Murasaki Shikibu 1300 years ago in Han Japan, that’s alien, you know, and it’s real. Whereas to me, <em>The Wasp Factory</em> is just basically largely pointless, largely plotless, largely purposeless wallowing in pseudo-madness. Now, I understand that you don’t feel that way, and  obviously I’m not – at no point am I questioning your right to your opinion about it, but I just think that it’s a terrible novel in every way except for Banks’s literary style.</p><p><strong>Sandifer</strong>: <em>I want to go further. I don’t think it’s wallowing in pseudo-madness, I think it’s wallowing in outright madness. I think that what’s fascinating here is the elucidation of the intelligibility of madness. I think that’s an almost inherently worthwhile thing to look at.</em></p><p><strong>Day</strong>: Right, it would be if it was credible, but there’s nothing credible about it, I don’t think Banks knows anything about it.</p><p><strong>Sandifer</strong>: <em>I don’t think it has to be credible, I think it has to be understandable. I think that if I can understand it within my own mind, if I can see, “okay, within the logic and aesthetic of this book and this character I can get to that point,” and, you know, accepting that we’re in a grotesque, southern gothic/British grotesque tradition where there’s going to be a lot of implausibility, where there’s going to be a lot of excess, and I think the macabre humor really does sort of build you and push you toward that. I can get to its rationality within the aesthetic of the book, and I can get to its madness within the aesthetic of the book.</em></p><p><strong>Day</strong>: But if you know that the madness is not real, if you know that the madness is not credible, why does it matter? I mean, why even call it madness?</p><p><strong>Sandifer</strong>: <em>The aesthetic is what’s not credible, the reality and plausibility of the aesthetic. I have no more trouble with Frank’s madness within the aesthetic here than I have with… I suddenly blanked on the main character of </em>The Stars My Destination<em> by Alfred Bester, to my shame… Gully Foyle. I have no more trouble with Gully Foyle’s madness in </em>The Stars My Destination<em>, which comes out of a complete impossibility. I mean, that’s obviously implausible. But that doesn’t seem to me difficult. That’s how fiction works: you come up with a set of rules for an aesthetic, you come up with a set of principles for an aesthetic, and then you build something out of that aesthetic. I can accept Banks’s aesthetic as completely coherently and understandably following from a literary tradition that leads up to it, and then within that, within that set of premises that are intelligible to me, he craft something that is weird and visionary and mad and on this level, much like…</em></p><p><strong>Day</strong>: But you say visionary, visionary of what? What is it pointing us to? What is it teaching us? What is it relevant to?</p><p><strong>Sandifer</strong>: <em>What might happen if a talking cat ever showed up and how to approach that situation. I mean, I think it’s a much better handbook on what to do if you start having actual, bizarre spiritual and magical experiences than “go with it and don’t question it.” I think that the sort of mad fraught ambiguity of it…</em></p><p><strong>Day</strong>: So you’re saying murdering children is preferable to obeying God? I mean, that’s insane. That’s more legitimately insanely than anything in <em>The Wasp Factory</em>.</p><p><strong>Sandifer</strong>: <em>I also don’t think </em>The Wasp Factory<em> ends up with a moral endorsement of that. I think that “murdering children” is what happens when Frank just listens to the talking cat. Murdering children is what happens when Frank just obeys the madness of his magical system. The endpoint of </em>The Wasp Factory<em> is understanding how Frank’s situation, Frank’s situation, Frank’s magic, even though it was a rational consequence of his aesthetic, is mad and dangerous.</em></p><p><strong>Day</strong>: But, yes, his madness is his own construction. There’s no talking cat. His madness and his moral code is driven by himself. It’s the exact opposite – literally the exact opposite – of the message of <em>One Bright Star to Guide Them</em>. I mean, both <em>One Bright Star to Guide Them</em> and <em>The Wasp Factory</em> are essentially children’s tales cloaked in adult trappings. The difference is…</p><p><strong>Sandifer</strong>: <em>But, wait a minute, let’s take </em>The Wasp Factory<em> as you presented it, as one where Frank’s magic system works. So we can look at both of these as, I agree, children’s tales in a very similar tradition of British children’s literature and sort of portals to faerie, where the main characters are having these magical experiences. And, in fact, both of them are having weird magical visionary experiences that are telling them to kill things. I think that </em>One Bright Star to Guide Them<em>…</em></p><p><strong>Day</strong>: But that’s not true. The wasp factory doesn’t tell him to kill his cousin.</p><p><strong>Sandifer</strong>: <em>I’m taking Frank’s magical system as extending beyond more than just the wasp factory. I’m taking it to extend to Frank’s entire – because Frank explains his murders in terms of…</em></p><p><strong>Day</strong>: He kills her on a whim! He says he kills her on a whim.</p><p><strong>Sandifer</strong>: <em>No, he kills her because he had already killed two men and he felt like he had to balance the scales, because there was a flaw in his magic, that he had been unfairly just targeting men and that there was an imbalance in the world. I think Esmeralda is the most magical of his killings. I think the first one, I think his cousin who he kills with an axe just because his cousin had been annoying, that one’s just killing on a whim. That one I agree is just children being murderous and evil.</em></p><p><strong>Day</strong>: I was just literally quoting the description you’d read.</p><p><strong>Sandifer</strong>: <em>Sure, he says he kills her on a whim but he then, he undermines that. Frank is very much being an unreliable narrator when he says he kills her on a whim, because he then goes on at great length about exactly how not a whim this was. And, likewise, his murder of his other brother is, again,  entirely explained in this sort of metaphysical sense of Frank as himself. That he has to kill his brother because…</em></p><p><strong>Day</strong>: Because it’s the spirit of Saul.</p><p><strong>Sandifer</strong>: <em>Right, and because it makes his position more secure in the world as a result, And then he has to kill Esmeralda, because having killed his brother and his cousin, the world is out of balance, and he has to kill Esmeralda. Sure, he says it’s on a whim, but we can’t believe him there.</em></p><p><strong>Day</strong>: Okay.</p><p><strong>Sandifer</strong>: <em>And so, you know, I think this has these murders come out of this magical system and then by the end condemns them. Then by the end says, “actually I was out of my skull there, I was mad, I wasn’t having any sort of legitimate spirituality, because all of this was based on a lie.”</em></p><p><strong>Day</strong>: Because I didn’t know I had a vagina, I thought I was emasculated.</p><p><strong>Sandifer</strong>: <em>No, because the trauma of what Saul did to me was untrue. Because Saul, you know, Saul’s attack on me, which was the core of my magical system, wasn’t what I thought it was. I don’t think you have to go into the gender essentialism of it. I mean, the core of his magical system, the most important thing, Saul and Saul’s attack on him, was a lie. That blows his magical system out of the water, with or without the gender issues.</em></p><p><strong>Day</strong>: Right, but my point is how ultimately trivial the whole thing is.</p><p><strong>Sandifer</strong>: <em>Well yes, that gets back to, again, what I love about doing this grandiose fantasy novel about this animist magical system and this madman visionary who has this functional magical system, and then discovers it’s all a lie, and having it take place in rural Scotland on the most remote island imaginable with people who are, yes, idiots, hillbilly idiots. I mean that’s the point, I think Banks is laughing at the idiocy of these characters. It’s a grotesque rural satire. I think, again, you have that lovely sense of perversity between the grandiose and the mad that’s going on in this, that the mundane trivialness of it is just another aspect of that sense of, you know, being skeptical of visions despite their utter clarity, despite the utter clarity of truth they bring to you. Despite the fact that Frank’s magical system worked and that he had these incredible, passionate, true visions of who he had to kill,  it was all madness based on a lie in rural Scotland and utterly pointless. I think that’s… And I say this as someone who adores Blake for his visionary madness; whose favorite writer is Alan Moore, who worships a snake god he admits is fictional; who self identifies as an occultist. I say this as someone with profound respect for the visionary. I find </em>The Wasp Factory<em>’s admission that the visionary is also mad and scary and terrifying and dangerous so much more compelling and so much more vibrant and important than Wright’s tired morality play that says “listen to your talking cat and kill who it tells you to.” I think that’s a dangerous, dangerous message about the magical.</em></p><p><strong>Day</strong>: See, I find it very amusing that you think wallowing in murder and madness and perversion is somehow less dangerous and less problematic than the tired old religious traditions that built the entirety of western civilization. I honestly, I think that you have – and I’m sure you feel the same, but – I think that you have the entire thing backwards, and that your enjoyment of the nihilism is simply a reflection of your own nihilism, in that sense. And that’s why you’re reacting negatively to the very strong, very Christian message that you see in Wright, which also echoes the same Christian message in Tolkien, Lewis, MacDonald, and all their forebears. And, again, I’m not criticizing your right to do so, I’m simply expressing my perspective.</p><p><strong>Sandifer</strong>: <em>I do think though, you’re being unfair in suggesting that </em>The Wasp Factory<em>’s dwelling on the unpleasant viscerality and the murder is endorsement. Yes, it spends a lot of time there, but it ends up saying, “you know, that was a bad place to be.” I think that it’s very much a walk through the valley of death.</em></p><p><strong>Day</strong>: Well, but “a bad place to be” is not repentance. “A bad place to be” is not rejection of the moral system. You know, Frank does not go and turn himself into the police, Frank does not confess his wrongdoing and his evil, he doesn’t admit it to anyone. In fact, he just basically says, “oh, it’s just a phase, and I’m over it now.”</p><p><strong>Sandifer</strong>: <em>You really think the book… You know, I don’t know that a lot of readers of </em>The Wasp Factory<em> came away from it thinking that its view on murdering children was unclear. I don’t think a lot of people think that book endorses murdering children in any sort of moral sense. I mean, yes, Frank could have turned himself into the police and repented, I don’t think we need Frank to be a good person at the end of the book for us to realize the extent of his damage.</em></p><p><strong>Day</strong>: I would agree, I don’t think that it is endorsing it. I think that it is saying that it’s irrelevant. I think it is saying that other people are irrelevant. I think it is a fundamentally solipsistic perspective, and again, that’s why I think that the fiery end where Frank becomes Eric, blows up the island, and whether it’s some sort of fiery repentant apotheosis or however, would have been a much more coherent – and made for a more coherent, better novel than this non-ending, this open-ended “we don’t even know whether he accepts himself as a woman or not.” I mean to me, it’s just, from a plot perspective, it’s just slapdash.</p><p><strong>Sandifer</strong>: <em>I feel like I much prefer that sense of ambivalence, I have to say. I feel like something that retains both the fascination and the repulsion. I don’t think that </em>The Wasp Factory<em> could completely turn its back on its own pleasures at the end, but I don’t think… I like its ambivalence. I think its ambivalence is complex enough for…</em></p><p><strong>Day</strong>: Well, that’s fine, if you like the ambivalence, but you can’t turn around and say it’s tightly plotted and has a bang-up ending.</p><p><strong>Sandifer</strong>: <em>I think you can tightly plot for ambivalence. I think you can have a nice Aristotelian unity that leads inexplorably to moral ambivalence. I think that’s called </em>Hamlet.</p><p><strong>Day</strong>: But something happened in <em>Hamlet</em>; you still have an ending. In <em>The Wasp Factory</em>, you don’t. What happens with Eric? We don’t know. What happens with Frank? We don’t know. What happens with the father? We don’t know. Nothing happens! There’s no resolution. I mean, all we really know is that…</p><p><strong>Sandifer</strong>: <em>There’s room for a sequel, and Banks considered writing </em>The Wasp Factory 2<em>, throughout his career. He ultimately never did it, or at least died before he would have gotten around to it, but he was well aware that it’s possible to write a second book about these characters. But I think that the story that The Wasp Factory tells, which is Eric’s return to the island and the exposure of the lie that is at the heart of their dynamic and Frank’s moral system, that happens. That story ends. Yes, there is another story you could tell with these characters, but that doesn’t mean that this story doesn’t have an ending.</em></p><p><strong>Day</strong>: On that note, we’re pushing near to the two-hour point…</p><p><strong>Sandifer</strong>: <em>We are. We’re near the two hour mark of this, so we should indeed wrap it up. I do want to thank again Kevin and James for hosting this, and thank Vox for sitting down with me. I think, as we did both predict at the start, it was interesting, if nothing else. So, yeah, thank you all very much.</em></p><p><strong>Day</strong>: Thanks a lot, Phil, I enjoyed it.</p><p><strong><em>Notes</em></strong></p><ol class=\"wp-block-list\"><li>On his blog, Day has said of <em>Seveneves</em>, “I started reading Neal Stephenson’s latest novel, <em>Seveneves</em>, and it is truly depressing. Less because nearly everyone on Earth dies than because he appears to have gone full SJW with a Gamma sauce. It’s the first time I’ve found it necessary to force myself to keep reading one of his books, and the first time one of his books has struck me as being proper Pink SF. Female presidents, token ethnic melanges, you name it, he’s got it to such an extent that were it not for Stephenson’s past gamma markers, I would almost suspect an epic, master-class trolling of the current genre.” Day’s concept of the gamma male is left as an exercise for the reader.</li><li>I am slightly off in saying “last year” – <em>The Ocean at the End of the Lane</em> came out in 2013.</li><li>Day is referring to the particular detail that Tommy kills Tybalt to get the sword to become a flaming sword of light.</li><li>The Ocean at the End of the Lane is of course a somewhat odd choice for this contrast, given how its frame story works…</li><li>There is a part of me that wishes I had pressed a bit further on this and pointed out that the eventual collapse of western civilization, and indeed of any given civilization, would seem to be a historical inevitability.</li><li>I assume the immortal psychopath is Satan, but I admit, the phrase did not jump out at me at the time, or else I’d have followed up on this.</li><li>My sincere apologies for interrupting here, and more to the point for not using my opportunity to ask Vox Day for the precise details of the occult rituals conducted by Enron executives.</li><li>Miéville is a Marxist.</li><li>I don’t pursue this, but given Day’s apparent belief in the immediate reality of Satan, it seems as though talking cats really would be a situation fraught with potential spiritual peril.</li><li>Video not available.</li><li>Remarkably, one of the commenters on Day’s blog, after listening to the interview, declared  that “In my experience, ‘unreliable narrator’ means ‘sloppy writing.’”</li><li>The post is <a href=\"https://archive.is/o/pGtLB/voxday.blogspot.com/2015/06/mailvox-bad-science-fiction.html\" rel=\"noreferrer noopener\" target=\"_blank\">here</a>. I would be more inclined towards a traditional Aristotlean analysis, but Day’s approach is close enough that I didn’t quibble.</li><li>When I wrote my Patreon-funded essay on <em>The Wasp Factory</em> I opted for the singular they as a pronoun for Frank, as the character’s gender identity changes in the last chapter. The question of what pronoun to use for the character and when, however, is vexed, and in the course of this conversation I end up switching among several, not entirely coherently, and not in keeping with what I consider best practices, for which I apologize.</li><li>As I remarked to a friend, I didn’t really feel like I was the person to press Day on the precise details of vaginas, but this did not strike me as being nearly so hard to believe as he suggests. (Indeed, one suspects that Banks is playing on the common comparison of the vagina to a “wound.”)</li><li>By all means, share counterexamples to this claim in comments.</li><li>As you might imagine, there’s a lot I didn’t press on here, but I think it’s important to point out that I neither believe gender to be purely biological or purely social.</li><li>I will admit, it’s interesting to me that this is the one place in the interview where Day just flat out refuses to let me finish a sentence or thought. The point I’m trying to make, in any case, is that I don’t think that <em>The Wasp Factory</em> is invested in the idea of “masculinity” and “femininity” as absolute categories.</li><li>Day’s tone of voice for this sentence is difficult to capture in text.</li><li>The book’s publishers have leaned into this, publishing copies of the books in which negative reviews calling the book filth are interspersed with praise in the blurbs.</li><li>This is, I will admit, an odd example; I had a question along this point in which I was going to ask how someone who recorded on the iconic industrial label Wax Trax! could have such strong views against aesthetic discomfort, and ended up using the example without the context.</li></ol><p><em><a href=\"https://social.infogalactic.com/micropost/8944bc38-77e3-4742-aab6-8cdbaeca4198\">DISCUSS ON SG</a></em></p></div>",
  "content_text": "The Wasp Factory vs One Bright Star to Guide Them\nPhil Sandifer debated Vox Day about two very different works of fiction by two very different authors on June 11, 2015\n.\nSince the interview is no longer available the now-defunct original site, I’ve posted\nthe archived version\nhere.\nBelow is a transcript of my interview with Vox Day,\nwhich you can listen to over at Pex Lives.\nI’ve lightly edited it to remove infelicities of language on both Day’s part and my own. I’ve also added a couple of footnotes clarifying aspects of the discussion. I am sure that Day would offer several clarifications of his own. Thanks again to Kevin and James for hosting this, and to Max Braden for preparing the transcript.\nPhil Sandifer\n:\nHi\n,\nI’m Phil Sandifer and I’ve got with me today the man at the center of the whole Hugo Awards controversy, Vox Day. Hello, Vox.\nVox Day\n: Hey, Phil. How are you?\nSandifer\n:\nI’m doing all right. So, the idea behind this interview is that Vox and I mutually agreed upon two works, one that he thinks is a great story and that I think is terrible, and one vice versa. The first is going to be John C. Wright’s\nOne Bright Star to Guide Them,\nwhich is one of Vox’s Rabid Puppies, it’s up for a best novella Hugo this year, and the other is going to be the late great Iain Banks’s 1984 debut novel\nThe Wasp Factory.\nWe’re going to start with\nOne Bright Star to Guide Them,\nby John C. Wright, who you’ve called a contender for the greatest living science fiction writer. The book’s promotional text describes it like so:\nAs children, long ago, Tommy Robertson and his three friends, Penny, Sally, and Richard, passed through a secret gate in a ruined garden and found themselves in an elfin land, where they aided a brave prince against the evil forces of the Winter King. Decades later, successful, stout, and settled in his ways, Tommy is long parted from his childhood friends, and their magical adventures are but a half-buried memory.\nBut on the very eve of his promotion to London, a silver key and a coal-black cat appear from the past, and Tommy finds himself summoned to serve as England’s champion against the invincible Knight of Ghosts and Shadows. The terror and wonder of Faerie has broken into the Green and Pleasant Land, and he alone has been given the eyes to see it, to gather his companions and their relics is his quest. But age and time have changed them too. Like Tommy, they are more worldly-wise, and more fearful. And evil things from childhood stories grow older and darker and more frightening with the passing of the years.\nOne Bright Star to Guide Them\nbegins where other fairy tales end. Brilliant and bittersweet, the novella hearkens back to the greatest and best-loved classics of childhood fantasy. John C. Wright’s beautiful fairy tale is not a subversion of these classics, but a loving and nostalgic homage to them, and reminds the reader that although Ever After may not always be happy, the road of life goes ever on and evil must be defeated anew by each and every generation.”\nNow, this is obviously the one of the two books that I think is awful, but I do want to say before we start, I really do love the premise. I really love the idea of going back to a sort of Narnia-esque children’s fiction world from the perspective of adulthood. There’s obviously a lot of stories in the “return to a children’s story in adulthood” style – I should point out for listeners who are coming to this through my work that the first two chapters are actually almost beat for beat the first two stories of Alan Moore’s\nMarvelman\nin terms of the plot – but I really can’t think of one in this sub-genre that’s played with Narnia in particular. There’s a very short story by Neil Gaiman called “The Problem of Susan,” but that’s about it. So I do want to admit up front, I do love the premise if nothing else. But you obviously love a lot more than just the premise here, so my first question is simple, Vox: why is this story great?\nDay\n: Well, before I explain why I think it’s a great story, I think that it’s probably important for the purpose of full disclosure to point out that, number one, I was the editor who was responsible for publishing this story, and also I wrote that particular description that you just read.\nSandifer\n:\nOkay.\nDay\n: So, it’s fair to point out that I am absolutely, utterly and completely biased in this regard, less because I have a pecuniary interest in the novella selling well – anyone who knows anything about publishing realizes that novellas are not the way that you make a lot of money in the publishing business – but I am very, very biased towards John Wright in particular as a writer, and\nOne Bright Star to Guide Them\nis one of my three favorite things that he’s ever written. So I think very highly of him as a writer; the other writers that I think very highly of in the science fiction field are China Miéville and, until his most recent novel, Neal Stephenson.[1]\nNow, what is particularly great about Wright, and something that a lot of people don’t necessarily realize, is that he’s not a writer who puts a lot of what I would call “craft” into it, by which I mean we’re not dealing with works that are written and re-written and re-written and re-written, for the most part. Now, in this particular case, he did write it as a short story, and then turned it into a novella later, but in general, what you see is what you get. It’s actually somewhat depressing to edit the man, because the stuff that he turns in just having dashed it off is much better than most of the stuff you see from other people.\nNow, in the case of\nOne Bright Star\n, like you said, the premise is fantastic. The idea that you’re beginning with these children who have been through this wonderful, incredible, fantastic experience, and then suddenly visiting, catching up with them thirty-some years later, is original in itself.\nSandifer\n:\nRight, I mean, there is, as I said, a large sub-genre of this. It’s hardly the only story, I think even from last year – I know a lot of people have compared it to Neil Gaiman’s\nThe Ocean at the End of the Lane\n, which came out around the same time.\n[2]\nDay\n: Sure, but there’s… You know, I’ve read\nThe Ocean at the End of the Lane\n, it’s good, but what’s different about\nOne Bright Star to Guide Them\nis that it is much more clearly written as an homage, not just to Narnia, but there’s actually elements of a great deal of other children’s fantasies that are much beloved.\nSandifer\n:\nRight, there’s a line that very closely hues to Susan Cooper’s\nThe Dark is Rising\nthat I noticed, for instance.\nDay\n: Right. There’s also a fair amount of\nThe Chronicles of Prydain\n. A lot of the fictional events that are referred to are much more out of\nPrydain\nthan out of either\nThe Dark is Rising\nor Narnia. And then there’s also a couple other ones, references to less well-known works. There’s certainly a call-out to George McDonald in there, the original fantasy writer, and so there’s a fair amount of depth there for those of us who were into that type of literature.\nSandifer\n:\nI think one of the reasons, though, people go for Narnia in particular – because, I mean, if you look at the reviews on Amazon, Narnia does seem to be the one that everyone goes to first when talking about the sort of influences on this, and I’m going to hazard a guess, no small part of that is because both Narnia and this are pretty explicitly Christian allegories. Do you think that’s a fair statement to say about this book?\nDay\n: Absolutely, absolutely. And I think that that’s both part of why\nOne Bright Star to Guide Them\ngenerates such powerful reactions in people who love it and in the much smaller number of people who dislike it, because I think in many cases, people’s reactions are being colored by their own personal feelings about Christianity, both for better and for worse.\nDISCUSS ON SG\nSandifer\n:\nSure. Now then, do you want to just explain quickly the broad strokes of the allegory? In particular, the talking cat character, Tybalt. Who does he represent, and in particular, there’s this climactic scene where Tommy has to kill this magical cat in order to lose his fear and become able to wield the magical sword that’s necessary to defeat the villain. So, can you just explain how that allegory works, quickly?\nDay\n: Well, Tybalt represents two things. Number one, he’s obviously the Jesus Christ figure, because he has to die in order for the sacred fire to be lit, and then of course he comes back after his death, so he’s the Aslan, he’s the Jesus Christ. He’s also, however – in that he’s a black cat who has to be killed – he’s also representational of the sin in Tommy’s life, and it’s the same reason that Mel Gibson, when he was filming…\nSandifer\n: Passion of the Christ\n, using his own hands to actually be the one to hammer the nails into Jesus’s hands, right?\nDay\n: Exactly, because the killing of Tybalt – If you don’t follow the theological implications, the need to kill Tybalt himself seems a little bit strange. But it’s actually relatively sophisticated, because, if you notice the killing [AUDIO CUTS OUT BRIEFLY] [3] fire, that turns into the weapon, and what that fire represents is of course the Holy Spirit – which, by the way, is the same fire that Tolkien refers to when Gandalf meets the Balrog and talks about being a servant of the secret fire. And so throughout the novella, there are these theological elements. Often Catholic, because of course, although I’m an Evangelical Christian, John happens to be a Catholic, like Tolkien, and so the theology of the story tends to be actually more Tolkienesque rather than C.S. Lewis, but, you know, that’s just details.\nAnd so from a purely literary point of view, I can see where the Tybalt thing can be a little confusing, but again, if you’re aware of the theological elements, than you immediately recognize the sin aspect, the Jesus Christ aspect, and the Holy Spirit aspect as well, which, I think the third one is sometimes missed.\nSandifer\n:\nIt’s not hard for me to imagine a similar story with the same basic plot, but where instead of being an overt Christian allegory, the forces of magic allude to, say, a pre-Christian Celtic mythology. You could do it with, obviously, any number of mythologies or religions. Do you think such a story could be as great as this one is, or is it very specifically, to your mind, the Christian nature of the allegory that makes this a great story?\nDay\n: Well, I think that because we are reading it in a Christian/post-Christian environment, it would be very, very difficult for any similar but differently-based story to resonate quite as strongly, either in a positive or a negative sense. If you react badly to Christianity, and I’ve certainly been someone who did in the past, you know, I can understand it getting your back up. And in the same way, it’s going to resonate powerfully with the same type of people who are emotionally affected by the Aslan death scene in Narnia. So I think that it’s theoretically possible, but I personally am not going to respond very strongly, emotionally, to something based on Shinto. I read Japanese fiction, I’m a huge fan of Murakami, and I have no doubt that there are definitely some Japanese spiritual aspects to some of his work that I miss, that don’t resonate with me because it’s foreign to me.\nSandifer\n:\nAlright. So just to clarify, when you say this story is “great,” are you saying this is one of your favorite stories – that’s sort of a personal claim – or are you making a more objective claim?\nDay\n: I’m making an objective claim, because although I appreciate the story, I like the story, and although the theological elements resonate with me, what makes a story great is the ending, and John Wright has a real gift for endings, which, as you know, many writers these days don’t. And what’s so brilliant about the ending of\nOne Bright Star to Guide Them\nis the way that Wright takes the trope of the wise old man and he brings the intellectual development, the spiritual development, and the maturation of the child character of Tommy full circle, and Tommy becomes the wise old man to the next stage in the story, which of course we don’t see, but it ties the whole… You know, you mentioned\nThe Ocean at the End of the Lane\n, and things like that. What separates\nOne Bright Star to Guide Them\nfrom some of these other, similar stories is that Wright manages to plug his story into the circle of the wise old man, the children, and so forth; a cycle, rather than a simple, one-off story. [4] And so, that’s what I find so brilliant about it, is because it makes a statement that the story never ends. Not just the story, but the struggle never ends – the battle for good and evil, both in the individual soul, as well as in the worlds, the universes, etcetera, always continues, and to me, it’s well-executed, it’s original, and, you know, I frankly haven’t really seen anything that has done it in as such an adept manner in such a short literary work.\nSandifer\n:\nOkay. Well, I want to talk a little bit about the particular vision of Christianity that Wright’s expressing. You said that you think that a lot of the reaction to this story hinges on one’s investment in Christianity, but I think there’s some particular aspects of Wright’s Christianity and the vision of God that he expresses that some people would differ on. Certainly I think there’s…\nDay\n: I differ on it!\nSandifer\n:\nRight, because you take an evangelical tact as opposed to his Catholic tact, but I have, I think, perhaps what might be called a broader aesthetic objection. I want to look at that climactic scene where Tommy has to kill Tybalt, and Tommy is protesting to Tybalt that he doesn’t understand and “cannot simply do as you tell me, I am not a child anymore.” To which Tybalt says, “it is not the stalwart soldiers of the sons of light who question orders, little Tommy, but willful children. Are you not a man?” And then the narrator says that Tommy “realized the cat was not asking him if he were brave or grown up, but if he knew where he stood in the great hierarchy of all creation. Beasts, even small and gentle ones, were placed under the dominion of man because man had the duty to be wiser and greater than a beast, to act for reasons higher than instinct. But the reasons of man were not the highest.”\nThere’s a couple of things that really strike me here. There’s this very militarized language, talking about soldiers and orders. And there’s the way in which what’s being demanded is this completely unquestioning obedience to God’s will. And I think this is a vision of Christianity that might surprise some people, in a way that goes beyond even specific subsets – whether you’re an evangelical or a Catholic or whatever. Even within the evangelical tradition, or the Catholic tradition, I think there’s real differing angles on how authoritarian a relationship humanity has with God. So can you talk a bit about this notion of just this complete submission to God? Because I find it ethically troubling, I have to admit.\nDay\n: Well, first of all, this is not one of the differences that I would have with John.\nSandifer\n:\nI didn’t think it was.\nDay\n: Because what you’re really talking about there is faith. You know, there’s a – one of the favorite stories for me in the Bible is when Jesus is accosted by the Roman officer, the centurion. And he says, you know, my son, or whoever it was, is sick, will you please heal him? And Jesus basically says, “Sure, I’ll come along and we’ll do that.” And the centurion says,  “Sir, don’t bother. I know you can heal him. Just please do it now and I’ll just go home and see him.” And, of course, Jesus is very surprised, and he points out to his followers that he’s never encountered faith like this. And that’s what John Wright is referring to there: he’s referring to that perfect faith in one’s superior that is necessary in a military – I mean, it’s something that they drill into them. And for Christians, it is the ideal. It’s not an often-realized ideal, but it is the optimal form of perfect submission to God’s will, which is to not question. And, you know, C.S. Lewis also touches upon this, and it’s often summarized in the concept of “understanding is good, but obedience is better.”\nSandifer\n:\nEven beyond that, though, another word that jumps out in that whole explanation is the word “dominion.” Because it’s a word that carries some particular resonance within Christian discourse, and it does particularly evoke a movement I know you’ve identified with, the Christian Dominionist movement. And I also want to point out, the book more broadly does talk about these forces of evil and darkness infiltrating government. There is a focus on the political dimension of it. Does the vision of Christianity that\nOne Bright Star\nis talking about – and is demanding obedience to – does that include a political and civic obedience as well?\nDay\n: No. I mean, given that John is a Catholic, there’s some implication of it there, but not really. And also, I should correct you, I’ve never identified as a Christian Dominionist…\nSandifer\n:\nYour called yourself a “small-d dominionist.”.\nDay\n: Yes. I don’t really even have much familiarity with the “capital-D Dominionist.” When people first started telling me that I was a Christian Dominionist, I had to look it up. I literally had no idea. I live in Europe. I don’t think a lot of people realize that I’m not part of this whole sort of…\nSandifer\n:\nAnd Dominionism is mainly an American movement.\nDay\n: Yeah.\nSandifer\n:\nWell, I’ll give you a quote that you said, I think, shortly after the “small-d dominionism”, though I don’t have it sourced in my notes here…\nDay\n: Well, actually, let’s not. We’re kind of digressing here.\nSandifer\n:\nWell, I’m not sure we are, though, because Wright does have this focus on the sons of light liberating the country from their control. It’s very specifically that the forces of evil have infiltrated the government.\nDay\n: Okay, fair enough. Go ahead.\nSandifer\n:\nSo, the quote I have from you is, you believe that “any civilized western society will be a Christian one, or it will cease to be civilized, if it manages to survive at all.” So, can you explain what this means in practical terms, and what you think this liberating the government in a Christian way that Wright is talking about means?\nDay\n: Okay. Well, I think the first part of it is pretty self-explanatory. We only have to look at people being beheaded on the streets of London and some of the stuff that has been happening in the States. You know, post-Christianity is Pagan, and we know from history what Pagan cultures look like. The idea that things are going to continue and move forward into this sort of shiny, sexy secularism, that’s just not happening. It’s not in the cards.\nSandifer\n:\nI’m not sure, if you want to talk about the de-Christianization of London, beheadings are really the trend away from Christianity there, if you’re looking at British history. There’s certainly a fair amount of violence, unease, in Christian societies, and plenty of non-Christian societies that people would refer to as “civilization” and “civilized.” So I’m not sure that initial statement is quite as obvious as you want to make it out to be.\nDay\n: That may be, but, you know, I’ve been here in Europe for a long time and pretty much all of the Europeans that I know consider things to be a bit less civilized than they were twenty years ago, thirty years ago, and so, you know, we’ll see. I’m content to say, let’s just wait and see.\nSandifer\n:\nOkay. Yeah, and I don’t want to make this an argument about politics…\nDay\n: Prognosticating the future!\nSandifer\n:\nRight. I mean, probably, talking about a novella is a slightly easier task than prognosticating the future. I guess what’s striking me here, though, is… I remember reading Cicero in high school and noting him complaining how life was so much less civilized than it was thirty years ago. I think everyone says that life is less civilized than it was thirty years ago. I think that’s just called being forty.\nDay\n: But Cicero was right! I mean, the republic collapsed!\nSandifer\n:\nSo does everything.\nDay\n: I understand, but these things go in cycles. I mean, we talk about the Ciceronian political cycle. Cicero was absolutely right. The republic collapsed! And then, eventually, the empire collapsed, and the same thing in Britain – the British Empire has collapsed. And what we understand as western civilization is not a given. It’s either going to sustain itself and survive, or it’s going to gradually collapse. I, personally – I may be wrong – but I personally think that Christianity is a pillar of western civilization and if it is weakened sufficiently, then western civilization will collapse with it. I’m not saying that we’re going to go back to outdoor plumbing and grass huts, but I think that it’s not an accident that we’ve reached the point that we have largely based on what was once known as Christendom. [5]\nSandifer\n:\nTo take it back to Wright, it seems to me what’s notable is that Tommy’s quest  is to root all of these forces of darkness\nout\nof government. I mean, it seems like Tommy is on the side of bringing\ndown\nthe government, as opposed to sustaining this civilization. Isn’t he seemingly establishing a new…\nDay\n: I think that’s too strong. I mean, basically, what Tommy is doing is that the government is being infiltrated in – of course, what we’re seeing there is a direct reference to C.S. Lewis’s\nThat Hideous Strength\n. We’re talking about the Space Trilogy there.\nSandifer\n:\nRight.\nDay\n: And so what Tommy is doing is, he is opposing this infiltration – this corruption – of the government. He’s not attempting to overthrow it on behalf of the Pope.\nSandifer\n:\nOkay. I also want to talk a bit about the details of this dark side. There’s this bit in chapter two where Richard, one of Tommy’s childhood companions, is revealed to have gone over to the dark side. There’s an extended section that runs for about 1000 words – it’s quite a sizable chunk of the story – where Tommy steadily uncovers the extent of his corruption. First Richard reveals that he sold their magic sword for “a fragment of an old book of John Dee and a plague doctor mask from Avignon.” Then Richard turns out to have engaged in this neo-Pagan sex ritual “to unify our consciousness with the beyond,” saying that there’s a “life force beyond all things, a power that binds the universe together. Man emerged from ape-man due to the ruthlessness of that life force. And if it were harnessed, channeled, focused, used as ruthlessly as it is meant to be used, then what might emerge from man?” And then it turns out that Richard aborted the child that resulted from this ritual, causing Richard to start going on about how “the vital energies only reach their peak with the culmination of the libido. The ancients knew it, the Aztecs and the magicians of Egypt knew it.” So there’s this thousand word section that’s just going on in, actually, it seems to my mind, more detail than it ever goes on about the beauty of Christianity, the beauty of this God. Why is this sort of slab of axe-grinding necessary and important to the story?\nDay\n: Because Christianity is first and foremost about something very, very dark. It’s a complete misconception to think of Christianity as “he’s got the whole world in his hands.” That’s literally Sunday school theology. And what Wright is doing is something actually fairly similar to a Christmas day service – if you can believe it – that a pastor that I thought very highly of once preached. And he began it with this montage of video of just war and suffering and famine, and it was all to the tune of “Welcome to the Jungle” by Guns ‘n Roses. You can imagine, it’s Christmas morning, Sunday! And everyone was looking at it, going “what the hell are you doing?” And then he says, “Remember: Jesus was born in a stable full of donkey shit.” The world is a dark, corrupt, and fallen place ruled by an immortal psychopath. [6] And so what Wright is doing is he is reminding people of what the alternative is, what is going to happen if there is no hope and if the whole Christian mythology is nothing but mythology.\nSandifer\n:\nSure, and I agree, I think one of the most powerful aesthetic aspects to Christianity is – and I think it’s one of the better parts of that book too – is that title:\nOne Bright Star to Guide Them\n. The idea of this sort of single, very distant hope in a very dark world is, I think, very powerful. But you talked about this sermon in terms of war, famine, and death. I feel like Wright’s not got the same litany here. I think his list… As a practicing, self-identified occultist, I can promise you I have never sacrificed a goat or raped a sixteen-year-old girl and then aborted the resulting child in order to contact the forces of the beyond, and, I mean, I did a quick Facebook poll of my similar social-justice-warrior Occultist friends, really none of us do this. And Wright is practically libeling poor John Dee, who was a committed Christian who invented the British Empire. Do you really think this list of evils is things that happen, that these are real threats to the world?\nDay\n: I think that they do happen. I don’t think that they happen at the level that someone – a PhD like you is likely to be at. I think that if you got into some of the darker rituals that take place in the halls of power, I think you’d be very, very surprised and disturbed to know what goes on, and I’m speaking as somebody who used to know the Lays of the Enron corporation.\nSandifer\n:\nSo then going back to this idea of liberating the halls of power, you’re very literally talking about rooting out what you believe to be an Occult conspiracy at the heart of government? Is that what you’re saying here?\nDay\n: No. We’re talking about the Ephesians 6:12. We’re talking about – it specifically talks about the wars being… [7]\nSandifer\n:\nWait a moment, I want to talk about this aborting a child to harness the vital energies that only reach their peak with the culmination of the libido.\nDay\n: Okay, that I will give you. I think that Wright was just combining – I think, I don’t know – I’ve never heard of any Occult rituals involving abortions, either, unless you look at it at on a societal level.\nSandifer\n:\nSorry, I’m going to have to ask you to follow up on that frankly amazing sentence of “Occult rituals involving abortion on a societal level” and find out what you mean by that.\nDay\n: Oh no, that’s not an accusation. I have a short story, or some sort of novella, and it just basically postulates some of the great massacres of history as being rituals, and, obviously, if you wanted to have a ritual that requires millions and millions and millions of lives being taken, there’s only a few ways you can do it. And obviously if you look at the history of abortion in the U.S.A., that’s one of the few ways that you can get to fifty million lives. But, like I said, I’ve never heard of any… You know, Wright is not using actual occult practices in his book, in this story. I don’t even think that he would want to.\nSandifer\n:\nNo, but all of that said, though, I mean, it does seem to me like he is describing a not-completely incoherent theology. I mean, again, speaking as someone who is familiar with occultism, there’s this sort of weird bleed from vaguely talking about something that is a plausible supervillain re-working of an occult theology. And when you talk about, you know, “unify our consciousness with the beyond,” okay, I can accept that there’s lots of occult and spiritual practice that talks about getting in contact with some distant, divine source. There’s plenty of Christian mysticism that talks about that. A life force…\nDay\n: But would you be more content if he had actually talked about real practices, such as the Blood Eagle of the Norse or the cutting out the hearts of the Aztecs? I mean, there’s literally dozens…\nSandifer\n:\nYes. Yes, I would be. I mean, given that he’s advancing such a specific viewpoint, I would much prefer something that’s actually historically grounded to this sort of half-accurate, vague accusation…\nDay\n: But it’s not an accusation, it’s a mockery! Basically, if you read that stuff where Richard is going on about the – It’s a mockery of Richard’s position. He’s basically making Richard out to be an idiot and an ass. And so I don’t – I mean, I understand your perspective as – let’s face it, your perspective is likely very different from most people’s, given that you’re talking about being a practicing occultist who’s disputing the legitimacy of the practices described. I’m not going to argue with you on that one, I’ll give that one to you, but I don’t think that it has any negative effect on the literary value of the story.\nSandifer\n:\nI mean, I suppose my problem is… I’m thinking of, say,\nParadise Lost\n, and how so much of the power there comes from the fact that Milton lets his devil be seductive and tempting. And it’s not as though that detracts from the power of Milton’s message. I mean, it’s abundantly clear, reading\nParadise Lost\nthat Milton is on the side of God and not of Satan.\nDay\n: Agreed.\nSandifer\n:\nAnd, I mean, Wright even has Tybalt talk at one point about how “we must grow before we can war against hidden evils – evils that hide as good, corrupt, and subtle evils.” I guess my question is more: why engage in this over the top caricature and mockery of the forces of darkness? Why not let Tommy triumph over an actually subtle evil instead of a cheap parody?\nDay\n: Because this is written in the style of a children’s fantasy, which is customarily done in a moderately florid manner. Also, because it’s Wright’s personality. If you’ve read any Wright, you know that he has – in a literary sense – a very large and rather florid personality. And, you know, those sort of things are going to come through from time to time. But there is no villain here. This is not a story about temptation.\nParadise Lost\nis trying to explain Lucifer. Milton is trying to explain his pride and everything. So that’s a very different story than here. Tommy’s not tempted by power, Tommy is tempted by a promotion in London and sitting around and getting old and watching TV. That’s what’s tempting to him. And so, the stuff that you’re talking about is true, but it simply happens to be irrelevant to this particular story.\nSandifer\n:\nI guess my problem is the specific combination. The fact that the case in favor of the forces of good is this authoritarian argument of obedience, and then the case against is this cheap mocking parody. And I really find that confluence disturbing. Regardless of position, actually – we talked about the idea of the same book only based in pre-Celtic mythology, or some other one. I think that regardless of the ideology, I would be very wary of any book – of anything, really – of anyone who is simultaneously advocating authoritarianism, and mocking and cruelly mockingly misrepresenting their opponents. I think that that is a nasty, nasty combination.\nDay\n: But that’s you. You’re talking about…\nSandifer\n:\nIt’s not you?\nDay\n: No! Not at all!\nSandifer\n:\nYou are all in favor of arguing for the necessity of obedience while misrepresenting and mocking the people who you are arguing that people should obey your demands to attack?\nDay\n: No, I don’t confuse reading for entertainment with a political op-ed. I mean, this is not a political op-ed, this is a story. Now, it does have a message to it, and that sort of thing, and maybe you like the message, maybe you don’t, but you can appreciate it for what it is. I mean, you know, I read… I’m an Austrian economist, I think China Miéville is, economically speaking, an utter moron. [8] And yet, I have absolutely no problem reading his stories, understanding the message, appreciating what he’s saying, and knowing it’s a good story, even though I think that the message that he happens to be putting out there, which in the case of his best work is almost literally Satanic…\nSandifer\n:\nI agree.\nDay\n: It doesn’t change my opinion that the work is a really great work. Yes, I disagree with the message, but so what?\nSandifer\n:\nAs I said though, I’m willing to make this judgment message-blind. The problem I’m having is this combination with a demand to unquestioning obedience – to anything, you know, regardless of what we’re unquestionably obeying – combining that demand with…\nDay\n: But, again, I said it’s not a demand, it is an ideal. Most of us can’t do that. Actually, that’s not true; none of us can do it. None of us are capable of reaching that point of perfect obedience, of perfect submission to God’s will. You can’t do it, I can’t do it, John Wright can’t do it, and that’s…\nSandifer\n:\nRight, but when we’re talking about a world where people are – where there are subtle evils and mocking misrepresentations, isn’t a degree of skepticism a good thing? Isn’t a resistance to anyone’s demand that you should obey them a good thing?\nDay\n: No! Not if what is being told is true! How is being skeptical about the truth a good thing? All that means is that you’re opening yourself up to something that is false. Are you skeptical about 2+2?\nSandifer\n:\nI am not skeptical about 2+2, but the question becomes…\nDay\n: Right, but would you consider it to be good for someone to be skeptical about 2+2?\nSandifer\n:\nBut at least within this story, we’re not talking…\nDay\n: Then you agree with me.\nSandifer\n:\nNo, I don’t, because we’re…\nDay\n: Because it’s not – you’ve already admitted it’s not always good to be skeptical about something.\nSandifer\n:\nIt is, I think – but we’re talking about people who are telling you to do things. We’re talking about Tybalt…\nDay\n: But we’re not talking people, we’re talking about a talking cat that represents God. I mean, if a cat were to come up to you and tell you to kill him, and you cut his head off and the sword starts on fire, and then a giant winged lion appears and says well done…\nSandifer\n:\nThat seems to me like an exceedingly good case for skepticism!\nDay\n: I think at that point you either need to get off the drugs, or you kind of assume that it’s okay not to be skeptical at that point.\nSandifer\n:\nI think that the point where cats start talking to you is a good point to be skeptical. Like, that’s definitely a point where skepticism should come into play, Vox!\nDay\n: But Tommy is initially skeptical of Tybalt talking. [9] At first he thinks, you know, “I’m drunk,” and then he’s only convinced because the cat is telling him things that the cat can’t know. And also, keep in mind, Tommy is skeptical. He’s not only skeptical, he’s downright resistant. He doesn’t want to cut off Tybalt’s head. He doesn’t want to do it. He doesn’t want to obey. So he is skeptical, he is those things you want him to be, and what’s bothering you is that John Wright’s saying, “You know what, yes you’re skeptical, yes you’ve got doubt, believe and obey anyhow.” That’s what’s troubling you.\nSandifer\n:\nNo, what’s bothering me is that the only thing in this book that John Wright does where he’s representing the beauty of his God is the demand for obedience. This book feels more interested to me…\nDay\n: No, no, no, that’s not – you’re confusing things, because that’s not the part – the beauty comes after.\nSandifer\n:\nWhat is the part? Where is the beauty in the book?\nDay\n: The beauty in the books is at the very end, where he opens up the door, and he sees that there’s a whole new universe out there that he doesn’t know about, and he’s being sent out into it, and he accepts the responsibility that he’s been given. He’s gone from child to adult. He’s grown from the kid being helped, to the wise old man. And the most powerful part of the book – the reason that, if you look on the Amazon reviews, you can see a number of people saying that it brought them to tears – and the reason is because, when he goes out there and he suddenly realizes, “I’m the wise old man, and I don’t feel wise at all,” and that’s the beauty.\nSandifer\n:\nSure. I want to look at that ending, though. Thomas is told, “You will have many roads to walk, and there will be many worlds under your care. There will come a child who leads a star by the hand, whose voice can still the lion’s rage. It is for you to carry the shards of Angurvadell, the great sword. It is a weapon none may use until he re-forges it and makes it anew himself, as with all such weapons of my father’s kingdom. Now come, you will find this child in a world beyond the Pleiades, considered young for his ancient and supernal race, but, compared to humans, old and wise beyond all reckoning.” I mean, my problem here is the beauty – that’s not a beauty of God, that’s a beauty of ripped-off bits of\nBlack Cauldron\nand\nLord of the Rings.\nAt that point I feel like the elusiveness that you talked about as praise starts to work against the book. I mean, all that’s beautiful is just the stuff that Wright has harvested from other books.\nDay\n: No, but he doesn’t harvest from other books. Those books and Wright’s novella are all drawing it from the same place; they’re all drawing it from Christian theology. The reason that every weapon has to be broken, every weapon is broken – that’s a reference to the fallen state of man, and the need for repentance. And so, you know, what you’re… You’re blind to that aspect of the beauty, because you don’t see that, you’re not looking at that. And also, I want to go back for a second and point out, the evil of Richard is not the only evil. That’s just one of the evils. You know, the cowardice of Sally – or Sarah is her adult name – you know, in some ways, Sally/Sarah is the more contemptible figure than Richard. Richard is the traitor, but Sally’s the one who knows better, and yet she won’t lift her finger. That too is an evil that is every bit as great as Richard’s treachery. And then, you know, you go on to the one who’s died, and whether you realize it or not, that too is an evil. Death is an evil. And so what we’re talking about here is not just the one…\nSandifer\n:\nTell me what you mean by “death is an evil.” Because I think that’s a tough claim. I mean, I have trouble ascribing any moral force to a seemingly inherent fact of existence.\nDay\n: But again, see, that again is your unfamiliarity with Christian theology. You know, “Death, where is thy victory, death, where is thy sting?” Jesus Christ came to conquer death. That was the whole… The resurrection was the breaking of Satan’s power, and so, the fact that Penny is a fallen warrior. [10]\nAll three of them, Richard, Sally, and Penny are all fallen warriors. Richard was defeated by his own greed for power, his own lust for power. Sally’s defeated by cowardice, and Penny is defeated by death. And so what the story is looking at is that it’s looking at the last warrior, the last hope, and his problem – he’s kind of…\nSandifer\n:\nHe’s a literal doubting Thomas.\nDay\n: Yeah, he’s a literal – exactly, and that’s why he’s named Tommy. His potential failure is doubt. And he conquers the doubt – unlike the others, although it is hinted that Sally may eventually defeat her cowardice as well. But again, that’s a level of the story that you’re not necessarily going to be privy to. You know, you were thinking that Richard is the only representation of evil, but it’s not true. It’s just one form of it, the one obvious form of it. The others are just as real, and only one of them, only doubt, is conquered. Of course, doubt is conquered by what: by the very blind faith, the very obedience that you have trouble with.\nSandifer\n:\nI mean, I do want to point out… I recognize that Sally is depicted as evil. I don’t necessarily think that there’s a ton of subtlety there. She doesn’t really get much beyond a sort of “she’s fundamentally weak and unwilling to obey and therefore is a form of evil.” I think the problem with the lack of any subtlety in the evil does run throughout the book, I do want to be clear on that. I certainly picked on the easiest one for the purposes of the discussion, but it’s not a problem that I think is limited to just Richard.\nDay\n: Okay.\nSandifer\n:\nBut we have reached about the halfway point of what the program should be, so why don’t we throw it to a brief mid-program break and come back and talk about\nThe Wasp Factory?\nDay\n: That sounds great.\nSandifer:\nOnce again, I’m just going to start with a description of the book. Here’s the back of the book text of the copy I have:\nEnter, if you can bare it, the extraordinary private world of Frank, just sixteen, and unconventional to say the least.\nThat’s the only plot description it gives, and then it just gives a brief excerpt from a quarter of the way into the book or so:\nTwo years after I killed Blythe, I murdered my young brother Paul, for quite different and more fundamental reasons than I disposed to Blythe, and then a year after that, I did for my young cousin Esmeralda, more or less on a whim. That’s my score to date: three. I haven’t killed anybody for years, and I don’t intend to again. It was just a stage I was going through.\nAnd I think that is a pretty good introduction to the tone of the book. It’s a very macabre comedy, and I think that one of Banks’s strengths as a writer in all of his books is his wonderfully macabre sense of humor. I remember also the fantastic opening sentence of his book\nThe Crow Road,\n“it was the day my grandmother exploded,” which is just one of the great opening sentences of literature as far as I’m concerned, for its sheer macabre curiosity.\nBeyond that,\nThe Wasp Factory\n, is very much a psychological portrait of this character of Frank that Banks creates, and I feel like he manages this really interesting sort of Scottish variation on the great American tradition of the southern gothic. Obviously there’s this long British tradition of grotesques that’s a major part of British literature, and then you’ve got this sort of southern gothic feel of “the old family secrets that are going to come to light and reveal all of the odd, depraved nature of these rural folks” told in this sort of slightly-horror-novel feel, with this sort of Scottish rural twist on it, and the attendant macabre humor, as I mentioned. Also I thought a really interesting invocation of the specific landscape of rural northern Scotland. And I think that’s also a strong part of the southern gothic tradition – Faulkner and everyone are so rooted in this very strong tone of the south. Or Lovecraft’s New England gothic that’s really rooted in the tone and feel of old crumbling New England. I really love the sort of rural Scottish grotesque spin on that tradition, I thought that was very strong.\nAnd I thought Frank’s approach to the world was wonderfully detailed. I love the work of psychogeographic writers, like Alan Moore and Iain Sinclair. I love how Frank’s weird sort of system of divination and magic that he creates out of his own environment is so rooted in the landscape and rooted in the peculiarities of this island and his body, and yet has this weird symbolic power that encompasses the entire book. One thing I know we’re going to get to is talking about whether or not this book is science fiction or fantasy, and I do want to advance the sort of willfully cheeky case that it is, because Frank’s magic works. The wasp factory predicts fire, and, sure enough, the book ends in a blaze of flaming sheep.\nDay\n: I wouldn’t argue with you on that point; in fact, I think you can make a stronger case for it. At the time when he attempts to contact and influence his brother Eric, the spell actually works, and then he’s thrown out, and he’s actually burned on his hand from the attempt to contact him.\nSandifer\n:\nRight. There’s this sense that there is a physical aspect.\nDay\n: And it also physically threw him back.\nSandifer\n:\nRight, and obviously the book is engaged in a very careful dance of making sure there’s nothing that is impossible within it. You certainly can account for everything as coincidence, and that’s just the point where Frank is holding his hand too close to the fire and starts to burn, but the book does create this…\nDay\n: No, but you can’t explain… I mean, you could explain it as he’s delusional, or imagining it, but the fact that he’s physically thrown out of the room after being thrown out of Eric’s mind, I think that that’s a physical… You know, maybe it’s Banks slipping up. I don’t think so, I think the magic actually works.\nSandifer\n:\nAlright. I would be perfectly willing, given how Frank is an unreliable narrator, [11] to take that as semi-delusional, but if you want to certainly argue that the magic actually works, I think that’s a more interesting book in a couple of ways, so I’ll certainly accept that. In which case, yeah, I like the way in which Banks creates a magical system as detailed and nuanced as any I’ve seen in any work of fantasy, incredibly symbolically rich. It feels like there’s this huge amount of symbolism and depth to this mythology, and it comes out of just this remote little Scottish island. I love that sense of depth in a small, mundane place like that.\nDay\n: Well, I have to say that I also appreciate the magic system. I’m not convinced that it is as meaningful in the symbological sense or in the semiotic sense as you’re suggesting. But that’s not a criticism, I’m just saying I don’t know – if there are semiotics there, if there are important symbols there, I don’t know what they are.\nSandifer\n:\nWell, I think they’re very animist semiotics. I don’t want to suggest that they’re semiotic in the sense of Wright’s mythology, where it’s this elaborate allegory for a pre-existing mythological system, but I think it’s intensely semiotic in terms of just the way that Frank is building it. The fact that it’s the skull of the dog he believed castrated him, it’s artifacts of each of his three murders. I’m talking about the semiotics within Frank’s grotesque life story.\nDay\n: No, I absolutely accept that, and I do think that that is without question, the strongest part of the book. I like Iain Banks as a writer quite a bit. I wouldn’t say he’s one of my top ten favorite authors, but I do think that he’s been one of the best writers in the science fiction genre over the past twenty years or so. And I also would say that the beginning, with the sacrifice poles, where he describes going around and checking on them, is a fantastic beginning. I thought I was going to like the book a lot after I read the first couple pages. And so despite the fact that I think that it’s an absolutely dreadful, terrible, and even ineptly written book, I think that it does show some of Banks’s strengths that later come out much more effectively in some of his later fiction.\nSandifer\n:\nYou say ineptly written. So what do you mean, what do you think is inept about it? Because you mentioned in one of the e-mails we exchanged that you think there’s some problems with the plot, and I have to say, I don’t see any, and I looked over the plot again last night to make sure. So where do you think it goes wrong?\nDay\n: Okay. Well, when I… This is just my way of looking at a book, so I’m not making any grand statements that anyone else has to look at a book this way, but I generally divide a book into four categories…\nSandifer\n:\nRight, you posted about this on your blog a bit ago, prioritizing them as: character, plot, style, concept. [12]\nDay\n: Yes. And, now style, you know, Banks is a wonderful writer, you can’t complain about his style. Now¸ where things start to go wrong, is on the story. First of all, if we tie it back to\nOne Bright Star to Guide Them\na little bit, a lot of people have complained – and reasonably so – that in the story Wright is often telling more than showing. Well, in\nThe Wasp Factory\n, telling is about all that happens. Almost all of the events, and almost all of the significant events, are in the past, and it’s just Frank telling us what happened then, what happened then, what happened then. And from a plot perspective, there’s three problems: number one, the plot is essentially alternating between Frank talking about something awful that he did, or something awful that happened to him when was younger, with telephone calls from Eric, his mad brother. And basically the entire structure of the book is switching back and forth between those two things and totally uneventful stuff like having dinner, or going out to a club and drinking and throwing up, right up until you hit the end. If you want to say something, go ahead and jump in, I’ve got two more points.\nSandifer\n:\nYeah, I would characterize it slightly differently. I agree, there is this alternating structure, but I think what we actually have is something very similar to the plot structure of\nUse of Weapons\n, the third\nCulture\nnovel, which is told in a set of alternating chapters. One set is numbered one to thirteen in text, and goes one, two, three, four, and then the other starts with XIII and regresses to I, numbered as Roman numerals, and telling the story of the same character: one set goes forward, the other set then works its way backwards.\nDay\n: But that’s fine, but the point is, regardless, it’s still a book where you’re basically switching between telling about the past, not very interesting dialogue, and literally nothing happening, and switching off between those three things.\nSandifer\n:\nI would say you have the simultaneous story of Frank erecting his defenses against Eric’s incoming attack on the island and the story in reverse gradually getting to the explanation of who Eric is, why he’s gone mad, and why the island is under attack on the first place, finally converging as we get both the original root cause: his father’s faked dog attack on him. Which became such a fundamental part of Eric’s madness, it’s why Eric is burning dogs – and Eric’s actual attempt to attack the island and blow it up. So finally you get the – much like in\nUse of Weapons –\nyou build to the final effect and the reader’s understanding of the cause both happening together.\nDay\n: I will readily admit, there is an amount of tension that is created both in terms of trying to find out – you’re curious to find out what’s going to happen when Eric gets there, and you’re also curious to try to figure out how deeply the madness ran that caused him to get that way in the first place, because, you know, in the historical tales, Eric is always a good figure, a safe figure, which is very different than the very threatening, frightening sense that he creates in the current stuff. But that, to me, doesn’t excuse the boring, boring, boring parts about the meals with the housekeeper, the father doing his fatherly thing, the conversations with the dwarf – which, basically, you could completely cut that out of the book altogether and not even notice, and there’s a… For a book that is so short, at 163 pages, there’s a remarkable amount of stuff that’s just not even relevant to the plot and not needed. But let me get to the second two points, which are more significant.\nSandifer\n:\nSure.\nDay\n: What I kind of realized with some astonishment is that\nThe Wasp Factory\nis basically a grotesque version of a Disney movie. And it’s a cheap, cheap ending, too. I’m not talking about what you think I’m talking about, either. Basically, the entire book comes down to the Disney message of “accept yourself.” And it’s such a cheap sell-out, because the whole thing is built up… You know, some people unfairly criticize Banks and they say that he tacked on the shock ending, and that’s not true, because he methodically gives you hints that Frank is not what you think him to be throughout.\nSandifer\n:\nIn fact, every transgender person I know who has read the novel figured out the shocking twist before the end, which is very telling.\nDay\n: Right. I’m not transgendered and I figured it out, as well.\nSandifer\n:\nI had it spoiled before I first read the book, so I can’t judge.\nDay\n: Well, but what I found really annoying about the way that it built up is that the appropriate ending should have been that Frank becomes Eric – he builds up, he stops Eric, but then he becomes Eric because he has this hatred for women, then he suddenly finds out he is a woman, he finds out what his dad has done to him, etcetera, and, you know, he should blow up the island. And that would have been a much better ending, and something that would actually be consistent with the characters and would make for a coherent end, whereas in the current case, the story doesn’t even end. It doesn’t have an ending. I mean, the ending is the revelation that Frank’s a woman, and then nothing happens. He goes out, he finds Eric, and decides that he accepts himself, and he doesn’t try to help Eric. I mean, it’s such a sell-out.\nSandifer\n:\nI don’t that that he accepts himself. I think he rejects the magical system that we’ve seen. And that also helps explain a lot of why those parts that you found boring – and certainly none of what you mentioned, the dwarf conversations and the like, were my favorite parts of the book, but I didn’t find them a particular chore to get though either – and I think that…\nDay\n: No, no, no, I’m not saying I did, I’m just looking at it from a critical point of view, that’s all.\nSandifer\n:\nRight. But I think they were important in giving a full enough context of who Frank is and what Frank is like. Because the final moment isn’t Frank accepting who he is. He has no idea who he is at that moment.\nDay\n: No, but he doesn’t react. The whole time, Banks has set it up for him to react with hatred and anger of what he is. And instead, he doesn’t. He doesn’t do anything. In fact, there is no ending, it just stops. Because the actual ending is, “oh guess what, Frank’s a girl.” And the Eric story doesn’t come to a climax, the showdown with the father doesn’t come to a climax, and Frank himself does nothing. You’re certainly entitled to say, “well, I think that he’s rejecting his magic,” but it doesn’t actually spell it out in the story.\nSandifer\n:\nYes it does! “Perhaps it was because I thought I had had all that really mattered in the world, the whole reason and means for our continuance as a species, stolen from me before I even knew its value. Perhaps I murdered for revenge in each case, jealously exacting through the only potency it might command, a toll from those who passed within my range. My peers who each would otherwise have grown into the one thing I could never become: an adult. Lacking, as one might say, one will¸ I forged another. To lick my own wound, I cut them off, reciprocating in my angry innocence the emasculation I could not then fully appreciate, but somehow, through the attitudes of others, perhaps sense an unfair, irrecoverable loss. Having no purpose in life and procreation, I invested all my worth in that grim opposite, and so found a negative and negation of the fecundity only others could lay claim to.”\nI mean, to a… If I wanted to be a little cheekier than I do – actually, apparently I’m just going to do it with a rhetorical trick like this, so I’ll just go ahead and be as cheeky – I think that why you’re reacting to this as strongly as you are, and sort of over-looking it is the same problem you accused people of having with John C. Wright’s invocation of Christianity. This is a mockery of pick-up artists. This is a mockery of all your neomasculinist friends. This is a mockery of your whole view that life and procreation is the only purpose to things. Because there’s another part towards the end…\nDay\n: How is that a mockery? I think you have it backwards. He’s saying that he doesn’t have to be that way anymore, because now he realizes that he’s not emasculated. It’s not impossible for him to be fecund, he’s actually a woman.\nSandifer\n:\nBut she says she doesn’t even want that now. [13] There’s a part where she says she can’t even imagine wanting to give birth.\nDay\n: Oh, for crying out loud, what girl… I mean, practically every woman I know, every mother I know, back when she was eighteen years old, was saying she didn’t want kids. I mean, come on. She just found out she’s a woman. I think it’s a little bit much to expect her to have planned out her future the first day, especially with her psychopathic brother trying to blow up the place with explosives.\nSandifer\n:\nI think it’s equally believable that someone who was socialized as male for the first sixteen years of their life might decide that they’re actually not particularly interested in reproduction. It’s not as though…\nDay\n: I’m not saying she is, I’m saying…\nSandifer\n:\nBut where she is…\nDay\n: But what you’re saying is factually wrong. What you’re saying is that… You were just saying that she doesn’t need her magic anymore, she doesn’t need to kill people anymore, blah, blah, blah. Why not? Because she’s not emasculated. Because she can do the things that she thought she couldn’t do before.\nSandifer\n:\nSee, I think it’s very much…\nDay\n: It doesn’t matter whether she’s going to, she has the option now that she did not have before.\nSandifer\n:\n“I believed that I decided, if I could never become a man, I, the unmanned, would outman those around me.” Yeah, so he goes through that. “Now it all turns out to have been for nothing, there was no revenge that needed taking, only a lie, a trick that should have been exposed, a disguise which even from the inside I should have seen through but did not want to.”\nDay\n: Right, so that’s exactly what I’m saying. All the stuff that she did, all the anger, all the rejection and stuff, all of it was a lie, and she didn’t have to do any of that, because she’s really a woman.\nSandifer\n:\n“Inside this greater machine, things are not quite so cut and dried – or cut and pickled – as they appeared in my experience. Each of us, in our own personal factory, may believe we have stumbled down one corridor, and that our fate is sealed and certain, dream or nightmare, humdrum or bizarre, good or bad. But a word, a glance, a slip, anything can change that, alter it entirely, and our marble hall becomes a gutter or our rat maze a golden path. Our destination is the same in the end, but our journey – part chosen, part determined – is different for us all, and changes even as we live and grow. I thought one door had snipped shut behind me years ago. In fact I was still crawling about the face. Now the door closes and my journey begins.” I think that’s very, very focused on this notion of liberation. I think it’s not…\nDay\n: It is, but that’s my point! It is a liberation. She’s been liberated from the lie.\nSandifer\n:\nBut Banks isn’t invested, doesn’t seem to have her invested in the specific lie she was liberated from. She seems to me in that moment to be liberated from the idea that her fate has to be determined in the first place. She’s liberated from the sort of ideology that says the only purpose is anything, procreation in particular.\nDay\n: I think that’s ridiculous, because she was limited by the belief that she had been mutilated and was unable to be a man, and now that she realizes she never was a man, she wasn’t mutilated, she’s freed.\nSandifer\n:\nBut regardless, the point seems still to be a critique of the sort of toxicity of this vision of masculinity and this very masculine magic that she’s been enacting through the whole book. I mean, it does seem to me…\nDay\n: Yeah, because she’s a woman! Of course none of it is necessary. None of it is relevant to her anymore.\nSandifer\n:\nDo you think it was necessary otherwise?\nDay\n: And this also touches on my third part, which is: this is an idiot plot. I mean, this is what Roger Ebert described as – you know, he said that “the idiot plot is any plot that would be resolved in five minutes if everyone in the story were not an idiot.” So, you’ve got somebody who literally has never looked in her pants to discover that she’s got a vagina, [14] you’ve got the father who is beyond idiocy with the whole story about the dog and the creation of the fake genitals just in case she ever asks, and then of course you’ve got Eric, who apparently never figured out that his sister was actually his sister either. I mean, this is an idiot plot. There’s no way around that.\nSandifer\n:\nThis is grotesque, it’s a grotesquery. I think that the ludicrousness of it is a joke in the same spirit as “killing three people was just a phase I was going through.” I don’t think it’s an idiot plot so much as it is a parody of rural grotesquery that is deliberately at the absolute limits of what is even remotely plausible.\nDay\n: I personally think it’s well beyond those limits, and, you know, I’m not saying that there’s no humor to it, but, you know, I didn’t find it funny, for the most part. The occasional one-offs, like you mention, you know, those were mildly amusing, but just to wallow in that depth of depravity and violence and murder, you know, it’s literally disgusting, and I didn’t find it funny, I didn’t find it edifying. Like I said, the plot is a literal idiot plot. Whether you want to say it’s because it was parody or not, it’s still an idiot plot. I’m not one of those people who finds… What’s that show, the guy from\nThe Office\n…\nSandifer\n:\nU.S. or U.K.?\nDay\n: Ricky Gervais.\nSandifer\n:\nYes.\nDay\n: He has that television show where he pretends to be retarded or something, and every ad he’s gurning, you know what I mean? It’s a relatively new show. I don’t find that funny either. And so, maybe the fact that it’s got an idiot plot but it’s a parody, therefore it’s supposed to make it intelligent, but to me, the plot is still what the plot is, and so I found it very, very disappointing, because the whole plot is totally dependent on the three major characters being and behaving like complete idiots.\nAnd the problem I have when you talk about the whole psychosocial aspect of Frank is Banks, in my opinion, gets the characters completely wrong. Frank is not convincing in any way, shape, or form as a girl who believes she’s a boy, and that sort of thing. I’m pretty sure that Iain Banks never had any daughters, because if you’re a parent, and you’ve got both boys and girls, there is not a chance in hell that a little girl, even if you raise her as a boy, is going to behave like a boy. [15] This is where I think it goes beyond parody and is a level of absurd that is not credible. I would have found it much more credible if Frank had some female attributes and characteristics in his thinking that he couldn’t explain. But instead, like you said, he’s more of a parody of a hyper-male, and that to me makes no sense whatsoever.\nSandifer\n:\nI agree that there’s an element of extreme implausibility, obviously, to some of the plot elements. I do think, going through, I note that Banks takes care to find some explanation for pretty much all of the elements of it, so that he at least has a sort of nice Aristotelian unity, where everything is either made necessary or likely by some other event, even if the characters are certainly very extreme. But it seems to me like your objection is less that you don’t believe that Frank would have physically figured it out – because there is the explanation, for instance, of the male hormones enlarging the clitoris so that it looked like the stump of his penis.\nDay\n: Yeah, I get that, but where did the vagina come from?\nSandifer\n:\nI would assume that Frank just assumed it was the mutilated and tattered remnants of the wound.\nDay\n: Well, except for the fact that the urine is not coming from the stump of the clitoris. And the fact that it kind of goes pretty deep. I mean, we’re dealing with somebody who is literally retarded, which we know from his behavior he’s not. It’s just not…\nSandifer\n:\nBut it seems to me that your bigger objection is the larger…\nDay\n: That’s not my major objection, I’m just pointing out that it’s not credible.\nSandifer\n:\nRight, it seems like your larger objection is simply a fundamental rejection that the gender roles could work that way, at all.\nDay\n: I think it is highly, highly improbable. I’m not saying it’s impossible. I mean, ironically enough, if Frank – in fact, Banks screws this up to, because if Frank at the end decides, you know what, I don’t care, I’m more of a man, doesn’t matter whether I have a penis or not, I’m more of a man and I’m sticking with it, that would actually be consistent with the gender interpretation that you’re putting on it. But he doesn’t do that. He actually rejects his male upbringing, his male persona, and embraces his femininity, which is biological, you’ll note, not construct, [16] and so…\nSandifer\n:\nI don’t think he embraces anything. I think he’s in a state of complete confusion there. I think that he is not going to keep trying to live…\nDay\n: But, you just said, he rejected…\nSandifer\n:\nI mean, he’s rejecting masculinity and seemingly accepted the female pronoun, and started calling herself Frances… I mean, do you know a lot of trans people, Vox?\nDay\n: Right, which means that the whole construct thing… I mean, the one little thread that I was willing to leave Banks is gone because Banks cut it. There’s no reason that Frank should not have female mental characteristics, and female behaviors.\nSandifer\n:\nI think that the whole point is that Frank isn’t in an either-or situation anymore. I mean, I’m speaking as someone who – I’m going to go out on a limb and guess I probably know more trans and genderqueer people than you do – but I really have no trouble believing that Frank, in that moment, is not seeing their life as an either-or choice between normatively male and normatively female.\nDay\n: I’m willing to give you that, but what I’m saying is, it doesn’t matter. Because if he’s not completely… I’m going to accept for the sake of argument the trans theory, and the idea of mental sex, you know, whatever…\nSandifer\n:\nTo be clear, I don’t think Banks is going that way, necessarily\n.\nDay\n: No, I’m not only saying that Banks is not going that way, I’m saying Banks screwed it up. Banks gets it hopelessly wrong, because if Frank is fully mentally male, then the revelation should not make a difference. Because he’s not, because he is willing to abandon his masculinity now that he knows the truth, then there should have been female mental indicators in his thinking and in his actions that do not exist. Banks fucked up the characteristics – he screwed up his characterization of Frank.\nSandifer\n:\nThat’s only true, though… You’re still insisting on an absoluteness of… What you’re insisting…\nDay\n: No, I’m not! I’m saying that if you accept the non-absolute, if you accept the whole gender confusion blah blah blah, then Banks had to screw it up.\nSandifer\n:\nPossibly I’m just quibbling with your word choice here, but you say there should have had to be female characteristics. I don’t think there had to be anything as specific as that. I think there only has to be a sense of wrongness. I think there only has to be a sense of, to use the word that has come out of trans discourse on it – and I do think that Banks, you know, he’s writing in 1984…\nDay\n: No, because you’re dealing with a little girl here. You’re dealing with a literal little girl. [17]\nSandifer\n:\nI don’t think we’re dealing with a person whose gender is particularly clear. I believe, in the essay I wrote about it…\nDay\n: You’re dealing with someone who is completely, 100% genetically female. The only difference is that the father decided to raise her otherwise, and then pretended, once she reached a certain age, that she had been castrated. Now, there’s absolutely no reason to completely eliminate every single last vestige of femininity from her, other than, Banks didn’t get it right.\nSandifer\n:\nWell, no, because Banks goes into detail about how Frank’s father is constantly ranting about the evils of women, and indoctrinating Frank to a particular misogyny. I think that’s…\nDay\n: How is that going to… Phil, none of that stuff is relevant. I have children. [18] Their behaviors begin way before anyone starts ranting, before they even understand that anyone’s ranting something. You don’t get away from that, and that’s not sufficient to completely eliminate every last vestige of femininity from her. And I’m not saying that from the absolutist vision.\nSandifer\n:\nMy point, though… You’re still talking about this final state as one in which the character’s only two options are masculinity and femininity.\nDay\n: I’m not! I’m saying that…\nSandifer\n:\nThen why does the absence of femininity matter? All there needs to be is a sense of wrongness.\nDay\n: No, because she was a little girl along. That’s the big reveal. That’s the big, stunning thing. And yet…\nSandifer\n:\nNo! No! The reveal was that she was given male hormones all along, and has been raised for twelve years with male hormones and male socialization. There’s no revelation that she has this intrinsic “little girl” aspect to her.\nDay\n: Exactly, exactly. And that’s what is completely, hopelessly wrong about it. Because the moment that she finds out that she’s actually a girl, it suddenly changes all of these things for her. I’m not saying that she suddenly becomes completely female, or whatever. I’m saying that the fact that that one piece of knowledge suddenly changes everything for her demonstrates that Banks’s characterization of her, as a male who was damaged in an accident, is simply a very poor characterization, even if you’re looking at it from your trans-genderqueer-whatever perspective. In fact, from that perspective, it’s much more wrong than it is if you’re looking at it from a binary male/female perspective.\nSandifer\n:\nI still think that you’re overstating the degree to which she is identifying as a woman, but I think the shock is more her father has been lying to her for however many years. I mean, I think the shock is “my life is a lie and this event that I thought was completely formative to who I am, this event that was completely formative to my history, never actually happened.” I don’t think that needs to be about gender. I talked about this in the tradition of the gothic novel; that reveal of the big family lie is just as shocking in any other gothic novel.\nDay\n: I don’t disagree with that. What we were talking about was not the whole of the novel there, we were talking about the way in which Banks was portraying Frank. I was just saying that I think that it was either an inept or a dishonest portrayal, meant to enhance the reveal at the end, and that was one of the things I didn’t like about it. But the bigger problem, like I said, is: not much happens, the plot requires all three major characters to be idiots, the character portrayals themselves are pretty bad – except for Eric, I thought that the portrayal of Eric was actually quite good – and the biggest problem is that there’s no resolution at the end. There’s no end to the story. And I think that, like I said, I think that it would have been a lot better if it had actually ended in fire, the way that the wasp factory predicted.\nSandifer\n:\nWhereas, again, I think Frank’s characterization is fantastic. Though, I admit, I’m not sure how one can argue that his magical system is well worked out and his character isn’t. I think they’re far too intertwined for those two statements to not have to be true together. So, to my mind I think we have a pair of very good characters in Frank and Eric. I’ll agree, I think the father is less well-characterized. I also think he’s a more minor character. I think it’s mostly a two-hander of a book between Eric and Frank. I think the plot… Quite a lot happens, it seems to me, within Frank’s animist system. Inasmuch as that’s exposited and built up through the book, many of the minor events seem to me to have considerably more symbolic weight once one looks at them from the sense of his magical system, and I think that we build to a fiery and effective climax. I think that the last action sequence, I’ll admit, “Eric drops the torch and runs off” is a little lame. If I were shooting a movie version, I’d probably re-choreograph that. But, other than that, it seems to me that we have this great build of this increasingly weird and incredibly unsettling magical system, that it at once makes rational sense within Frank’s world and is, as you put it, tremendously disturbing and unsettling in places, and murderous, and that, you know, we finally get to this moment of liberation from it, where, I mean, I’m inclined to…\nDay\n: But again, it’s liberation from his own construct that’s based on a lie. And meanwhile, there’s no repentance for the murders. There’s no… I mean, there’s just… It’s the unyielding nihilism of it is just literally reprehensible. This is who so many people who read the book just absolutely hated it. [19] Even the people who like it, the people gave it five stars on Amazon, what they said is, “It’s uncomfortable to read, and that really is the charm of this book.” Well, I’m sorry, but anybody can write something that’s uncomfortable to read. It’s, to me, Banks’s constant fascination with farting, and shit, and things rotting and stuff… I mean, to me, that’s an indication of the guy’s psychological problems. It’s not an indication of his being a great writer.\nSandifer\n:\nTo my mind, what’s important isn’t merely that it’s uncomfortable. I agree, anyone can be uncomfortable. Much like industrial music reaches its endpoint with noise music and with just sheer screeching noise [20] – yeah, you can only go so far with raw discomfort. But what strikes me as interesting about the discomfort in\nThe Wasp Factory\nis that it’s so nuanced and detailed and thorough, that Banks has engineered a…\nDay\n: What is nuanced about it? He’s slaughtering kids left, right, and center in ridiculous ways. I mean, first of all, the adder thing, he gets it wrong, because an adder is not going to kill somebody. They’re not poisonous enough to. And secondly, they don’t live on islands.\nSandifer\n:\nI again want to point out, I don’t think that this book is going for highly plausible. So, you know, I’m not sure I buy critiquing the scientific accuracy of the adder as a particularly meaningful objection here.\nDay\n: Even less relevant would be the idea that the military is not going to notice this huge metal kite in an area where their jets fly. I mean, they’ve got really good radar systems. I’m pretty sure that someone would go check it out. But I’ll give you that one.\nSandifer\n:\nFinding plot holes in the British tradition of the grotesque is not the greatest challenge literature has ever thrown up, but I think that’s very much not the point. To me, the plausibility comes in terms of: Frank has a great degree of psychological believability to me. I can believe the construction of Frank’s magical system. The degree to which Frank’s religion simultaneously makes sense and is repulsive is very powerful to me. I had…\nDay\n: But this makes me want to know, are you O.C.D.? Because what really struck me when I was reading is, “wow, this kid’s got O.C.D.”\nSandifer\n:\nI am not O.C.D., actually. I am A.D.D.; quite the opposite. But, no, I do find something fascinating in understanding repulsive viewpoints that are nevertheless internally consistent. Hence, interviewing you.\nDay\n: I’ve got to give you that point.\nSandifer\n:\nYou know, certainly from my perspective, I think that there is a value in understanding the alien and the strange, and so to my mind what’s valuable about this book, what’s compelling about\nThe Wasp Factory\n, is… Again, it’s getting back to that, to\nParadise Lost\n… if we make the sort of, you know, that’s the Miltonian angle… I feel like\nThe Wasp Factory\ngets into an almost Blakean level of just the simultaneous understandable and alien nature of it – is a fascinating labyrinth to be lost in for 160 pages.\nDay:\nI agree, but the problem that I have is twofold. First of all, I think that the alien being created is complete bullshit, I don’t find it credible in the slightest, and secondly…\nSandifer\n:\nI don’t think it’s credible either, I’m just interested by it.\nDay\n: I find it very repulsive, disgusting, and evil. I think if you want to dive into an alien mindset, you know, read\nThe Divine Secrets of the Ya-Ya Sisterhood\n. That to me was truly a diving into alien territory, and it was fascinating. Reading something like\nThe Tale of Genji\n, which was written by Murasaki Shikibu 1300 years ago in Han Japan, that’s alien, you know, and it’s real. Whereas to me,\nThe Wasp Factory\nis just basically largely pointless, largely plotless, largely purposeless wallowing in pseudo-madness. Now, I understand that you don’t feel that way, and  obviously I’m not – at no point am I questioning your right to your opinion about it, but I just think that it’s a terrible novel in every way except for Banks’s literary style.\nSandifer\n:\nI want to go further. I don’t think it’s wallowing in pseudo-madness, I think it’s wallowing in outright madness. I think that what’s fascinating here is the elucidation of the intelligibility of madness. I think that’s an almost inherently worthwhile thing to look at.\nDay\n: Right, it would be if it was credible, but there’s nothing credible about it, I don’t think Banks knows anything about it.\nSandifer\n:\nI don’t think it has to be credible, I think it has to be understandable. I think that if I can understand it within my own mind, if I can see, “okay, within the logic and aesthetic of this book and this character I can get to that point,” and, you know, accepting that we’re in a grotesque, southern gothic/British grotesque tradition where there’s going to be a lot of implausibility, where there’s going to be a lot of excess, and I think the macabre humor really does sort of build you and push you toward that. I can get to its rationality within the aesthetic of the book, and I can get to its madness within the aesthetic of the book.\nDay\n: But if you know that the madness is not real, if you know that the madness is not credible, why does it matter? I mean, why even call it madness?\nSandifer\n:\nThe aesthetic is what’s not credible, the reality and plausibility of the aesthetic. I have no more trouble with Frank’s madness within the aesthetic here than I have with… I suddenly blanked on the main character of\nThe Stars My Destination\nby Alfred Bester, to my shame… Gully Foyle. I have no more trouble with Gully Foyle’s madness in\nThe Stars My Destination\n, which comes out of a complete impossibility. I mean, that’s obviously implausible. But that doesn’t seem to me difficult. That’s how fiction works: you come up with a set of rules for an aesthetic, you come up with a set of principles for an aesthetic, and then you build something out of that aesthetic. I can accept Banks’s aesthetic as completely coherently and understandably following from a literary tradition that leads up to it, and then within that, within that set of premises that are intelligible to me, he craft something that is weird and visionary and mad and on this level, much like…\nDay\n: But you say visionary, visionary of what? What is it pointing us to? What is it teaching us? What is it relevant to?\nSandifer\n:\nWhat might happen if a talking cat ever showed up and how to approach that situation. I mean, I think it’s a much better handbook on what to do if you start having actual, bizarre spiritual and magical experiences than “go with it and don’t question it.” I think that the sort of mad fraught ambiguity of it…\nDay\n: So you’re saying murdering children is preferable to obeying God? I mean, that’s insane. That’s more legitimately insanely than anything in\nThe Wasp Factory\n.\nSandifer\n:\nI also don’t think\nThe Wasp Factory\nends up with a moral endorsement of that. I think that “murdering children” is what happens when Frank just listens to the talking cat. Murdering children is what happens when Frank just obeys the madness of his magical system. The endpoint of\nThe Wasp Factory\nis understanding how Frank’s situation, Frank’s situation, Frank’s magic, even though it was a rational consequence of his aesthetic, is mad and dangerous.\nDay\n: But, yes, his madness is his own construction. There’s no talking cat. His madness and his moral code is driven by himself. It’s the exact opposite – literally the exact opposite – of the message of\nOne Bright Star to Guide Them\n. I mean, both\nOne Bright Star to Guide Them\nand\nThe Wasp Factory\nare essentially children’s tales cloaked in adult trappings. The difference is…\nSandifer\n:\nBut, wait a minute, let’s take\nThe Wasp Factory\nas you presented it, as one where Frank’s magic system works. So we can look at both of these as, I agree, children’s tales in a very similar tradition of British children’s literature and sort of portals to faerie, where the main characters are having these magical experiences. And, in fact, both of them are having weird magical visionary experiences that are telling them to kill things. I think that\nOne Bright Star to Guide Them\n…\nDay\n: But that’s not true. The wasp factory doesn’t tell him to kill his cousin.\nSandifer\n:\nI’m taking Frank’s magical system as extending beyond more than just the wasp factory. I’m taking it to extend to Frank’s entire – because Frank explains his murders in terms of…\nDay\n: He kills her on a whim! He says he kills her on a whim.\nSandifer\n:\nNo, he kills her because he had already killed two men and he felt like he had to balance the scales, because there was a flaw in his magic, that he had been unfairly just targeting men and that there was an imbalance in the world. I think Esmeralda is the most magical of his killings. I think the first one, I think his cousin who he kills with an axe just because his cousin had been annoying, that one’s just killing on a whim. That one I agree is just children being murderous and evil.\nDay\n: I was just literally quoting the description you’d read.\nSandifer\n:\nSure, he says he kills her on a whim but he then, he undermines that. Frank is very much being an unreliable narrator when he says he kills her on a whim, because he then goes on at great length about exactly how not a whim this was. And, likewise, his murder of his other brother is, again,  entirely explained in this sort of metaphysical sense of Frank as himself. That he has to kill his brother because…\nDay\n: Because it’s the spirit of Saul.\nSandifer\n:\nRight, and because it makes his position more secure in the world as a result, And then he has to kill Esmeralda, because having killed his brother and his cousin, the world is out of balance, and he has to kill Esmeralda. Sure, he says it’s on a whim, but we can’t believe him there.\nDay\n: Okay.\nSandifer\n:\nAnd so, you know, I think this has these murders come out of this magical system and then by the end condemns them. Then by the end says, “actually I was out of my skull there, I was mad, I wasn’t having any sort of legitimate spirituality, because all of this was based on a lie.”\nDay\n: Because I didn’t know I had a vagina, I thought I was emasculated.\nSandifer\n:\nNo, because the trauma of what Saul did to me was untrue. Because Saul, you know, Saul’s attack on me, which was the core of my magical system, wasn’t what I thought it was. I don’t think you have to go into the gender essentialism of it. I mean, the core of his magical system, the most important thing, Saul and Saul’s attack on him, was a lie. That blows his magical system out of the water, with or without the gender issues.\nDay\n: Right, but my point is how ultimately trivial the whole thing is.\nSandifer\n:\nWell yes, that gets back to, again, what I love about doing this grandiose fantasy novel about this animist magical system and this madman visionary who has this functional magical system, and then discovers it’s all a lie, and having it take place in rural Scotland on the most remote island imaginable with people who are, yes, idiots, hillbilly idiots. I mean that’s the point, I think Banks is laughing at the idiocy of these characters. It’s a grotesque rural satire. I think, again, you have that lovely sense of perversity between the grandiose and the mad that’s going on in this, that the mundane trivialness of it is just another aspect of that sense of, you know, being skeptical of visions despite their utter clarity, despite the utter clarity of truth they bring to you. Despite the fact that Frank’s magical system worked and that he had these incredible, passionate, true visions of who he had to kill,  it was all madness based on a lie in rural Scotland and utterly pointless. I think that’s… And I say this as someone who adores Blake for his visionary madness; whose favorite writer is Alan Moore, who worships a snake god he admits is fictional; who self identifies as an occultist. I say this as someone with profound respect for the visionary. I find\nThe Wasp Factory\n’s admission that the visionary is also mad and scary and terrifying and dangerous so much more compelling and so much more vibrant and important than Wright’s tired morality play that says “listen to your talking cat and kill who it tells you to.” I think that’s a dangerous, dangerous message about the magical.\nDay\n: See, I find it very amusing that you think wallowing in murder and madness and perversion is somehow less dangerous and less problematic than the tired old religious traditions that built the entirety of western civilization. I honestly, I think that you have – and I’m sure you feel the same, but – I think that you have the entire thing backwards, and that your enjoyment of the nihilism is simply a reflection of your own nihilism, in that sense. And that’s why you’re reacting negatively to the very strong, very Christian message that you see in Wright, which also echoes the same Christian message in Tolkien, Lewis, MacDonald, and all their forebears. And, again, I’m not criticizing your right to do so, I’m simply expressing my perspective.\nSandifer\n:\nI do think though, you’re being unfair in suggesting that\nThe Wasp Factory\n’s dwelling on the unpleasant viscerality and the murder is endorsement. Yes, it spends a lot of time there, but it ends up saying, “you know, that was a bad place to be.” I think that it’s very much a walk through the valley of death.\nDay\n: Well, but “a bad place to be” is not repentance. “A bad place to be” is not rejection of the moral system. You know, Frank does not go and turn himself into the police, Frank does not confess his wrongdoing and his evil, he doesn’t admit it to anyone. In fact, he just basically says, “oh, it’s just a phase, and I’m over it now.”\nSandifer\n:\nYou really think the book… You know, I don’t know that a lot of readers of\nThe Wasp Factory\ncame away from it thinking that its view on murdering children was unclear. I don’t think a lot of people think that book endorses murdering children in any sort of moral sense. I mean, yes, Frank could have turned himself into the police and repented, I don’t think we need Frank to be a good person at the end of the book for us to realize the extent of his damage.\nDay\n: I would agree, I don’t think that it is endorsing it. I think that it is saying that it’s irrelevant. I think it is saying that other people are irrelevant. I think it is a fundamentally solipsistic perspective, and again, that’s why I think that the fiery end where Frank becomes Eric, blows up the island, and whether it’s some sort of fiery repentant apotheosis or however, would have been a much more coherent – and made for a more coherent, better novel than this non-ending, this open-ended “we don’t even know whether he accepts himself as a woman or not.” I mean to me, it’s just, from a plot perspective, it’s just slapdash.\nSandifer\n:\nI feel like I much prefer that sense of ambivalence, I have to say. I feel like something that retains both the fascination and the repulsion. I don’t think that\nThe Wasp Factory\ncould completely turn its back on its own pleasures at the end, but I don’t think… I like its ambivalence. I think its ambivalence is complex enough for…\nDay\n: Well, that’s fine, if you like the ambivalence, but you can’t turn around and say it’s tightly plotted and has a bang-up ending.\nSandifer\n:\nI think you can tightly plot for ambivalence. I think you can have a nice Aristotelian unity that leads inexplorably to moral ambivalence. I think that’s called\nHamlet.\nDay\n: But something happened in\nHamlet\n; you still have an ending. In\nThe Wasp Factory\n, you don’t. What happens with Eric? We don’t know. What happens with Frank? We don’t know. What happens with the father? We don’t know. Nothing happens! There’s no resolution. I mean, all we really know is that…\nSandifer\n:\nThere’s room for a sequel, and Banks considered writing\nThe Wasp Factory 2\n, throughout his career. He ultimately never did it, or at least died before he would have gotten around to it, but he was well aware that it’s possible to write a second book about these characters. But I think that the story that The Wasp Factory tells, which is Eric’s return to the island and the exposure of the lie that is at the heart of their dynamic and Frank’s moral system, that happens. That story ends. Yes, there is another story you could tell with these characters, but that doesn’t mean that this story doesn’t have an ending.\nDay\n: On that note, we’re pushing near to the two-hour point…\nSandifer\n:\nWe are. We’re near the two hour mark of this, so we should indeed wrap it up. I do want to thank again Kevin and James for hosting this, and thank Vox for sitting down with me. I think, as we did both predict at the start, it was interesting, if nothing else. So, yeah, thank you all very much.\nDay\n: Thanks a lot, Phil, I enjoyed it.\nNotes\nOn his blog, Day has said of\nSeveneves\n, “I started reading Neal Stephenson’s latest novel,\nSeveneves\n, and it is truly depressing. Less because nearly everyone on Earth dies than because he appears to have gone full SJW with a Gamma sauce. It’s the first time I’ve found it necessary to force myself to keep reading one of his books, and the first time one of his books has struck me as being proper Pink SF. Female presidents, token ethnic melanges, you name it, he’s got it to such an extent that were it not for Stephenson’s past gamma markers, I would almost suspect an epic, master-class trolling of the current genre.” Day’s concept of the gamma male is left as an exercise for the reader.\nI am slightly off in saying “last year” –\nThe Ocean at the End of the Lane\ncame out in 2013.\nDay is referring to the particular detail that Tommy kills Tybalt to get the sword to become a flaming sword of light.\nThe Ocean at the End of the Lane is of course a somewhat odd choice for this contrast, given how its frame story works…\nThere is a part of me that wishes I had pressed a bit further on this and pointed out that the eventual collapse of western civilization, and indeed of any given civilization, would seem to be a historical inevitability.\nI assume the immortal psychopath is Satan, but I admit, the phrase did not jump out at me at the time, or else I’d have followed up on this.\nMy sincere apologies for interrupting here, and more to the point for not using my opportunity to ask Vox Day for the precise details of the occult rituals conducted by Enron executives.\nMiéville is a Marxist.\nI don’t pursue this, but given Day’s apparent belief in the immediate reality of Satan, it seems as though talking cats really would be a situation fraught with potential spiritual peril.\nVideo not available.\nRemarkably, one of the commenters on Day’s blog, after listening to the interview, declared  that “In my experience, ‘unreliable narrator’ means ‘sloppy writing.’”\nThe post is\nhere\n. I would be more inclined towards a traditional Aristotlean analysis, but Day’s approach is close enough that I didn’t quibble.\nWhen I wrote my Patreon-funded essay on\nThe Wasp Factory\nI opted for the singular they as a pronoun for Frank, as the character’s gender identity changes in the last chapter. The question of what pronoun to use for the character and when, however, is vexed, and in the course of this conversation I end up switching among several, not entirely coherently, and not in keeping with what I consider best practices, for which I apologize.\nAs I remarked to a friend, I didn’t really feel like I was the person to press Day on the precise details of vaginas, but this did not strike me as being nearly so hard to believe as he suggests. (Indeed, one suspects that Banks is playing on the common comparison of the vagina to a “wound.”)\nBy all means, share counterexamples to this claim in comments.\nAs you might imagine, there’s a lot I didn’t press on here, but I think it’s important to point out that I neither believe gender to be purely biological or purely social.\nI will admit, it’s interesting to me that this is the one place in the interview where Day just flat out refuses to let me finish a sentence or thought. The point I’m trying to make, in any case, is that I don’t think that\nThe Wasp Factory\nis invested in the idea of “masculinity” and “femininity” as absolute categories.\nDay’s tone of voice for this sentence is difficult to capture in text.\nThe book’s publishers have leaned into this, publishing copies of the books in which negative reviews calling the book filth are interspersed with praise in the blurbs.\nThis is, I will admit, an odd example; I had a question along this point in which I was going to ask how someone who recorded on the iconic industrial label Wax Trax! could have such strong views against aesthetic discomfort, and ended up using the example without the context.\nDISCUSS ON SG",
  "tags": [
    "books",
    "debate",
    "interview"
  ],
  "categories": [],
  "sitemap_lastmod": "2024-07-09T09:20:44+00:00"
}