{
  "url": "https://voxday.net/2024/07/20/when-puppies-become-wolves/",
  "scraped_at": "2026-01-08T14:38:26.010773",
  "title": "When Puppies Become Wolves",
  "date_display": "July 20, 2024",
  "date_iso": "2024-07-20T15:18:07+00:00",
  "date_from_url": "2024-07-20",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>Larry Correia is unimpressed by charges of hypocrisy by those who are upset and frightened by the realization that the pendulum is swinging back in their faces.</p><p><em><strong>You’re the woke right cancel culture. You know, they guy you have pretended to hate this whole time. With a slice of hypocrisy and anger.</strong></em></p><p><em>Oh these fools really don’t get it. There is no hypocrisy here. But there is anger. And it ain’t no slice. I despise these assholes with a passion.</em></p><p><em>You don’t know what anger is until Caring Liberals decide to destroy your life for crimes that exist in their fevered imagination, to the point they they run organized slander campaigns against you so vile that it puts the lives of your children in danger. Gleefully they rooted for psychos to try and kill me, because I hurt their feelings once over a meaningless award.</em></p><p><em>For the last ten years at every turn, petty fucks tried to destroy my livelihood. For ten years they continued to spread nasty shit that they knew to be false, but they did it anyway, just out of spite because I believe wrong.</em></p><p><em>My continued success galled them. That’s not how this is supposed to work. I was supposed to roll over and cower and beg forgiveness for things I never did. But I refused.</em></p><p><em>Despite that, there is no doubt their cancel campaign has been effective in that it has cost me millions of dollars. There’s nothing quite like having thousands of total strangers reflexively hate you because everything they’ve ever been told about you is a lie. Super fun.</em></p><p><em>But my continued success pisses these assholes off, so it’s totally worth it.</em></p><p><em>For over ten years I tried to warn the few remaining honest people on the left where their reckless destruction of the social contract was going to lead us. Now, I simply no longer give a fuck if their hubris destroys them. I will toast marshmallows over your cremation fire.</em></p><p><em>I’m no hypocrite. Oh no. I’m far, far past that. I actively root for your utter destruction. I’ve moved into a zen state of watching you honorless dogs pave the road to hell. And I will sit back and gloat as you burn.</em></p><p><em>For you see, there is no hypocrisy, because I’m not canceling you. I’m merely watching and laughing and commenting upon the obvious, as the puppies you beat and abused until they turned into wolves inevitably devour you.</em></p><p>Larry knows, even if some of the garden-variety SJWs don’t, that the Rabid Puppies of yesterday are the wolves of today. We’re not just watching and laughing, we’re meticulously exercising our right to excise their kind from our personal lives, our families, our professional lives, and our social circles. SJWs are going to SJW, nothing is going to stop that, but they’re going to have to do it at a distance from now on. And it’s very far from hypocrisy to insist that they be held to their own standard: <em>No freedom of consequences.</em></p><p><em><a href=\"https://social.infogalactic.com/micropost/98085aa0-992f-4920-8c70-d431a8759a72\">DISCUSS ON SG<br/></a></em></p></div>",
  "content_text": "Larry Correia is unimpressed by charges of hypocrisy by those who are upset and frightened by the realization that the pendulum is swinging back in their faces.\nYou’re the woke right cancel culture. You know, they guy you have pretended to hate this whole time. With a slice of hypocrisy and anger.\nOh these fools really don’t get it. There is no hypocrisy here. But there is anger. And it ain’t no slice. I despise these assholes with a passion.\nYou don’t know what anger is until Caring Liberals decide to destroy your life for crimes that exist in their fevered imagination, to the point they they run organized slander campaigns against you so vile that it puts the lives of your children in danger. Gleefully they rooted for psychos to try and kill me, because I hurt their feelings once over a meaningless award.\nFor the last ten years at every turn, petty fucks tried to destroy my livelihood. For ten years they continued to spread nasty shit that they knew to be false, but they did it anyway, just out of spite because I believe wrong.\nMy continued success galled them. That’s not how this is supposed to work. I was supposed to roll over and cower and beg forgiveness for things I never did. But I refused.\nDespite that, there is no doubt their cancel campaign has been effective in that it has cost me millions of dollars. There’s nothing quite like having thousands of total strangers reflexively hate you because everything they’ve ever been told about you is a lie. Super fun.\nBut my continued success pisses these assholes off, so it’s totally worth it.\nFor over ten years I tried to warn the few remaining honest people on the left where their reckless destruction of the social contract was going to lead us. Now, I simply no longer give a fuck if their hubris destroys them. I will toast marshmallows over your cremation fire.\nI’m no hypocrite. Oh no. I’m far, far past that. I actively root for your utter destruction. I’ve moved into a zen state of watching you honorless dogs pave the road to hell. And I will sit back and gloat as you burn.\nFor you see, there is no hypocrisy, because I’m not canceling you. I’m merely watching and laughing and commenting upon the obvious, as the puppies you beat and abused until they turned into wolves inevitably devour you.\nLarry knows, even if some of the garden-variety SJWs don’t, that the Rabid Puppies of yesterday are the wolves of today. We’re not just watching and laughing, we’re meticulously exercising our right to excise their kind from our personal lives, our families, our professional lives, and our social circles. SJWs are going to SJW, nothing is going to stop that, but they’re going to have to do it at a distance from now on. And it’s very far from hypocrisy to insist that they be held to their own standard:\nNo freedom of consequences.\nDISCUSS ON SG",
  "tags": [
    "Puppies",
    "SJW"
  ],
  "categories": [],
  "sitemap_lastmod": "2024-07-20T15:18:08+00:00"
}