{
  "url": "https://voxday.net/2015/03/27/a-shot-across-bow/",
  "scraped_at": "2025-12-16T12:50:02.977444",
  "title": "A shot across the bow",
  "date_display": "March 27, 2015",
  "date_iso": "2015-03-27T15:00:00+00:00",
  "date_from_url": "2015-03-27",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>At this point, given recent steps like these, I think it is eminently clear that the US government has told the Israeli government to take a hike and <a href=\"http://www.israelnationalnews.com/News/News.aspx/193175#.VRVshzQmKJp\">is going to reach an agreement with Iran</a> that will permit it to become an acknowledged nuclear power:</p><blockquote class=\"tr_bq\"><p> In a development that has largely been missed by mainstream media, the Pentagon early last month quietly declassified a Department of Defense top-secret document detailing Israel’s nuclear program, a highly covert topic that Israel has never formally announced to avoid a regional nuclear arms race, and which the US until now has respected by remaining silent.</p><p>But by publishing the declassified document from 1987, the US reportedly breached the silent agreement to keep quiet on Israel’s nuclear powers for the first time ever, detailing the nuclear program in great depth.</p><p>The timing of the revelation is highly suspect, given that it came as tensions spiraled out of control between Prime Minister Binyamin Netanyahu and US President Barack Obama ahead of Netanyahu’s March 3 address in Congress, in which he warned against the dangers of Iran’s nuclear program and how the deal being formed on that program leaves the Islamic regime with nuclear breakout capabilities.</p><p>Another highly suspicious aspect of the document is that while the Pentagon saw fit to declassify sections on Israel’s sensitive nuclear program, it kept sections on Italy, France, West Germany and other NATO countries classified, with those sections blocked out in the document.</p><p>The 386-page report entitled “Critical Technological Assessment in Israel and NATO Nations” gives a detailed description of how Israel advanced its military technology and developed its nuclear infrastructure and research in the 1970s and 1980s…. Declassifying the report comes at a sensitive timing as noted above, and<br> given that the process to have it published was started three years<br> ago, that timing is seen as having been the choice of the American<br> government.</br></br></br></p></blockquote><p>This appears to be a clear message to the Israelis that since they have nukes themselves, they have absolutely no grounds to complain about anyone else obtaining them. I do find it somewhat amusing that the article claims the US has breached a nonexistent agreement.</p><p>If an agreement of the sort that appears to be in the works does in fact take place, it should be interesting to see how all the “Iran is the New Hitler”<br> neocons explain the complete failure of a nuclear Iran to immediately<br> launch the attack on Israel that they have been telling us is imminent for at least the last<br> decade.</br></br></br></p><p>Given what is presently taking place in Yemen and Iraq, I would think it is Saudi Arabia that has a lot more to be concerned than the Israelis.</p></div>",
  "content_text": "At this point, given recent steps like these, I think it is eminently clear that the US government has told the Israeli government to take a hike and\nis going to reach an agreement with Iran\nthat will permit it to become an acknowledged nuclear power:\nIn a development that has largely been missed by mainstream media, the Pentagon early last month quietly declassified a Department of Defense top-secret document detailing Israel’s nuclear program, a highly covert topic that Israel has never formally announced to avoid a regional nuclear arms race, and which the US until now has respected by remaining silent.\nBut by publishing the declassified document from 1987, the US reportedly breached the silent agreement to keep quiet on Israel’s nuclear powers for the first time ever, detailing the nuclear program in great depth.\nThe timing of the revelation is highly suspect, given that it came as tensions spiraled out of control between Prime Minister Binyamin Netanyahu and US President Barack Obama ahead of Netanyahu’s March 3 address in Congress, in which he warned against the dangers of Iran’s nuclear program and how the deal being formed on that program leaves the Islamic regime with nuclear breakout capabilities.\nAnother highly suspicious aspect of the document is that while the Pentagon saw fit to declassify sections on Israel’s sensitive nuclear program, it kept sections on Italy, France, West Germany and other NATO countries classified, with those sections blocked out in the document.\nThe 386-page report entitled “Critical Technological Assessment in Israel and NATO Nations” gives a detailed description of how Israel advanced its military technology and developed its nuclear infrastructure and research in the 1970s and 1980s…. Declassifying the report comes at a sensitive timing as noted above, and\ngiven that the process to have it published was started three years\nago, that timing is seen as having been the choice of the American\ngovernment.\nThis appears to be a clear message to the Israelis that since they have nukes themselves, they have absolutely no grounds to complain about anyone else obtaining them. I do find it somewhat amusing that the article claims the US has breached a nonexistent agreement.\nIf an agreement of the sort that appears to be in the works does in fact take place, it should be interesting to see how all the “Iran is the New Hitler”\nneocons explain the complete failure of a nuclear Iran to immediately\nlaunch the attack on Israel that they have been telling us is imminent for at least the last\ndecade.\nGiven what is presently taking place in Yemen and Iraq, I would think it is Saudi Arabia that has a lot more to be concerned than the Israelis.",
  "tags": [
    "war",
    "Zion"
  ],
  "categories": [],
  "sitemap_lastmod": "2015-03-27T15:00:00+00:00"
}