{
  "url": "https://voxday.net/2015/03/13/a-taste-of-things-to-come/",
  "scraped_at": "2025-12-16T12:48:31.743189",
  "title": "A taste of things to come",
  "date_display": "March 13, 2015",
  "date_iso": "2015-03-13T16:42:00+00:00",
  "date_from_url": "2015-03-13",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>John Wright is pleased with Jeremiah’s artwork for the first volume in his Unwithering Realm series, <a href=\"http://www.scifiwright.com/2015/03/a-taste-of-things-to-come-the-somewhither-cover-art/\">Somewhither</a>, which will be coming out in April. And if you’re interested in supporting an esoteric, but worthwhile project, Castalia House blogger Ken Burnside and Ad Astra game developer <a href=\"https://www.kickstarter.com/projects/1386934735/ad-astra-games-avid-assistant\">needs just $2k more</a> in order to fund his AVID Assistant via Kickstarter.</p><p><a href=\"http://www.milobookclub.com/wp-content/uploads/2015/03/equality_960-1.jpg\" imageanchor=\"1\" style=\"clear: left; float: left; margin-bottom: 1em; margin-right: 1em;\"><img border=\"0\" decoding=\"async\" fetchpriority=\"high\" height=\"320\" src=\"http://www.milobookclub.com/wp-content/uploads/2015/03/equality_960-1.jpg\" width=\"200\"/></a>Speaking of Castalia, we’ll have a new offer going out to the New Release Subscribers next week, but for various reasons I’m not going to bother going into, we will be releasing not just one, but TWO new books the week after that. I’d like to find 10 volunteers to review both of them, so if you’ve got the interest and the intellectual chops to handle either <i><strike>Equality: The Impossible Quest</strike> </i><strike>or <i>The Art of War: The History of Military Strategy</i></strike>, both by Israeli military historian Martin van Creveld, email me with <strike>EQUALITY or WAR</strike> in the subject. UPDATE: have all 10 for both books, thank you.</p><p>The former is conceived as the third in a conceptual trilogy with Plato’s work on Justice and J.S. Mill’s work on Liberty, whereas the latter features a foreword by none other than Dr. Jerry Pournelle himself, who describes van Creveld’s work as <i>“a necessary supplement to Clausewitz.”</i> It’s a short, but as you can probably imagine from that description, brilliant history, and anyone who has appreciated Mr. Lind’s work is going to find it fascinating and educational. Thanks to Chris Kallini, who did both of the van Creveld covers.</p></div>",
  "content_text": "John Wright is pleased with Jeremiah’s artwork for the first volume in his Unwithering Realm series,\nSomewhither\n, which will be coming out in April. And if you’re interested in supporting an esoteric, but worthwhile project, Castalia House blogger Ken Burnside and Ad Astra game developer\nneeds just $2k more\nin order to fund his AVID Assistant via Kickstarter.\nSpeaking of Castalia, we’ll have a new offer going out to the New Release Subscribers next week, but for various reasons I’m not going to bother going into, we will be releasing not just one, but TWO new books the week after that. I’d like to find 10 volunteers to review both of them, so if you’ve got the interest and the intellectual chops to handle either\nEquality: The Impossible Quest\nor\nThe Art of War: The History of Military Strategy\n, both by Israeli military historian Martin van Creveld, email me with\nEQUALITY or WAR\nin the subject. UPDATE: have all 10 for both books, thank you.\nThe former is conceived as the third in a conceptual trilogy with Plato’s work on Justice and J.S. Mill’s work on Liberty, whereas the latter features a foreword by none other than Dr. Jerry Pournelle himself, who describes van Creveld’s work as\n“a necessary supplement to Clausewitz.”\nIt’s a short, but as you can probably imagine from that description, brilliant history, and anyone who has appreciated Mr. Lind’s work is going to find it fascinating and educational. Thanks to Chris Kallini, who did both of the van Creveld covers.",
  "tags": [
    "books",
    "Castalia House",
    "games"
  ],
  "categories": [],
  "sitemap_lastmod": "2015-03-13T16:42:00+00:00"
}