{
  "url": "https://voxday.net/2015/03/01/christianitys-killers/",
  "scraped_at": "2025-12-16T12:47:04.173593",
  "title": "Christianity’s killers",
  "date_display": "March 1, 2015",
  "date_iso": "2015-03-01T13:00:00+00:00",
  "date_from_url": "2015-03-01",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>I was not surprised there has been an amount of pushback against the idea that a Christian should do anything except sit on his ass and prayerfully expect that God will take care of everything in due time. Now, this is not to denigrate the power of prayer, which is vital and can absolutely be efficacious, but rather the idea that it is God’s will for us to always refrain from any action of any kind that might bruise the feelings of anyone, especially an enemy.</p><p>There is an intrinsic conflict between the moderates and the extremists of any movement or organization. The moderates are inward-focused, conservative, defensive, and believe that public relations is the ultimate determinant of victory or defeat. The extremists are outward-focused, creative, offensive, and believe that material conditions are the ultimate determinant of victory or defeat. These two rival perspectives tend to hold true regardless of whatever the issue might be, from politics and cultural war to sports and business affairs.</p><p>Christianity merely compounds this intrinsic conflict, it does not create it. And it is not, as some might have it, a mere intellectual difference of opinion, which is why discussing the different perspectives and attempting to come to some compromise seldom works. Consider what Maj. Dick Winters, of Band of Brothers fame, wrote about Easy Company in <i>Beyond Band of Brothers</i>:</p><blockquote class=\"tr_bq\"><p> On reflection, we were highly charged; we knew what to do; and we conducted ourselves as part of a well-oiled machine. Because we were so intimate with each other, I knew the strengths of each of my troopers. It was not accidental that I had selected my best men, Compton, Guarnere, and Malarkey in one group, Lipton and Ranney in the other. These men comprised Easy Company’s “killers,” soldiers who instinctively understood the intricacies of battle. In both training and combat, a leader senses who his killers are. I merely put them in a position where I could utilize their talents most effectively. Many other soldiers thought they were killers and wanted to prove it.</p><p>In reality, however, your killers are few and far between. Nor is it always possible to determine who your killers are by the results of a single engagement. In combat, a commander hopes that nonkillers will learn by their association with those soldiers who instinctively wage war without restraint and without regard to their personal safety. The problem, of course, lies in the fact that casualties are highest among your killers, hence the need to return them to the front as soon as possible in the hope that other “killers” emerge.</p></blockquote><p>In other words, the dynamic between actors and non-actors is entirely normal and the latter always outnumber the former. Keep in mind that the men of Easy Company were aggressive, competitive, highly-trained young men who belonged to the absolute elite of the US military. And even there, the “killers are few and far between”. In war, physical or metaphorical, there are very few who are capable of instinctively waging it “without restraint and without regard to their personal safety”. And one important difference between actual war and cultural war is that in the case of the latter, many of the nonkillers spend a fair amount of their time sniping at the killers on their own side rather than at the other side.</p><p>Imagine how effective Easy Company would have been if instead of being expected to follow the killers’ example, its nonkillers dedicated themselves to explaining at length that instead of flanking the German gun position on D-Day and killing the German gunners, they should all prove themselves to be better than the Germans by being nice to them. And then, when the killers ignored them and began the flank attack, instead of laying down covering fire, the nonkillers started shooting at the killers. Does anyone seriously think this would be a successful way to wage war?</p><p>Why, then, does anyone imagine that the same tactical approach will succeed in cultural war? If the moderates will not at the very least provide covering fire for the extremists, they are useless. And to the extent that they open their cowardly mouths to criticize, correct, and concern-troll the only people on their side who are taking action, they are worse than useless.</p><p>As for the Christians, let us reflect upon the Biblical example that many “nonkillers” like to cite, Matthew 26:51</p><blockquote class=\"tr_bq\"><div class=\"reg\"> With<br> that, one of Jesus’ companions reached for his sword, drew it out and<br> struck the servant of the high priest, cutting off his ear.<b> </b>“Put your sword back in its place,” Jesus said to him, “for all who draw the sword will die by the sword.<br> Do you think I cannot call on my Father, and he will at once put at my disposal more than twelve legions of angels? But how then would the Scriptures be fulfilled that say it must happen in this way?”</br></br></br></div></blockquote><p>There is a great deal of significant information here, particularly the situation-specific aspects of the command, but with regards to the present subject, the most important point is this: Jesus knowingly chose a hot-tempered “killer” as one of his closest companions and the rock upon which he would build the Church. Like David, beloved of God, and Paul, the great evangelist, it is the “killers” whom God has historically preferred and chosen to utilize. I do not think the moderates and nonkillers who sit back and snipe in the comfortable confidence that they are doing God’s will by sitting on their plump posteriors and doing nothing that will offend anyone should be so confident that God’s Will is in line with their own.</p><p>Keep in mind that the incident is also recounted in John 18:10</p><blockquote class=\"tr_bq\"><p> Then Simon Peter, who had a sword, drew it and struck the high priest’s servant, cutting off his right ear. (The servant’s name was Malchus.) Jesus commanded Peter, “Put your sword away! Shall I not drink the cup the Father has given me?”</p></blockquote><p>Clearly the relevant point is not the non-use of swords, but the non-use of a particular sword in a particular situation. As to “dying by the sword”, what of it? That doesn’t mean that one’s actions that put one at risk of it are necessarily wrong. It’s merely a factual warning. Recall what Winters pointed out: <i>“The problem, of course, lies in the fact that casualties are highest among your killers.”</i> Winters also wrote about the guilt he sometimes felt at reunions, as he was reminded that there were about half as many survivors of 1st platoon as there were from Easy Company’s 2nd and 3rd platoons due to the heavier casualties they took. But consider why he leaned upon them so heavily:</p><blockquote class=\"tr_bq\"><p> With thirty-five men, a platoon of Easy Company had routed two German companies of about 300 men. American casualties (including those from Fox Company) were one dead, twenty-two wounded. German casualties were fifty killed, eleven captured, about 100 wounded.</p></blockquote><p>It should not be a surprise that looking into it reveals that the platoon responsible was Easy Company’s 1st platoon. Dying by the sword is not a sin. It is, in many cases, a sacrifice.</p><p>Most damning of all, I think, is the observable hypocrisy of many moderates, who flagrantly violate their own advice. They are very often more than happy to insult their nominal allies and attack their own side’s extremists with the very names they refuse to call the enemy.</p></div>",
  "content_text": "I was not surprised there has been an amount of pushback against the idea that a Christian should do anything except sit on his ass and prayerfully expect that God will take care of everything in due time. Now, this is not to denigrate the power of prayer, which is vital and can absolutely be efficacious, but rather the idea that it is God’s will for us to always refrain from any action of any kind that might bruise the feelings of anyone, especially an enemy.\nThere is an intrinsic conflict between the moderates and the extremists of any movement or organization. The moderates are inward-focused, conservative, defensive, and believe that public relations is the ultimate determinant of victory or defeat. The extremists are outward-focused, creative, offensive, and believe that material conditions are the ultimate determinant of victory or defeat. These two rival perspectives tend to hold true regardless of whatever the issue might be, from politics and cultural war to sports and business affairs.\nChristianity merely compounds this intrinsic conflict, it does not create it. And it is not, as some might have it, a mere intellectual difference of opinion, which is why discussing the different perspectives and attempting to come to some compromise seldom works. Consider what Maj. Dick Winters, of Band of Brothers fame, wrote about Easy Company in\nBeyond Band of Brothers\n:\nOn reflection, we were highly charged; we knew what to do; and we conducted ourselves as part of a well-oiled machine. Because we were so intimate with each other, I knew the strengths of each of my troopers. It was not accidental that I had selected my best men, Compton, Guarnere, and Malarkey in one group, Lipton and Ranney in the other. These men comprised Easy Company’s “killers,” soldiers who instinctively understood the intricacies of battle. In both training and combat, a leader senses who his killers are. I merely put them in a position where I could utilize their talents most effectively. Many other soldiers thought they were killers and wanted to prove it.\nIn reality, however, your killers are few and far between. Nor is it always possible to determine who your killers are by the results of a single engagement. In combat, a commander hopes that nonkillers will learn by their association with those soldiers who instinctively wage war without restraint and without regard to their personal safety. The problem, of course, lies in the fact that casualties are highest among your killers, hence the need to return them to the front as soon as possible in the hope that other “killers” emerge.\nIn other words, the dynamic between actors and non-actors is entirely normal and the latter always outnumber the former. Keep in mind that the men of Easy Company were aggressive, competitive, highly-trained young men who belonged to the absolute elite of the US military. And even there, the “killers are few and far between”. In war, physical or metaphorical, there are very few who are capable of instinctively waging it “without restraint and without regard to their personal safety”. And one important difference between actual war and cultural war is that in the case of the latter, many of the nonkillers spend a fair amount of their time sniping at the killers on their own side rather than at the other side.\nImagine how effective Easy Company would have been if instead of being expected to follow the killers’ example, its nonkillers dedicated themselves to explaining at length that instead of flanking the German gun position on D-Day and killing the German gunners, they should all prove themselves to be better than the Germans by being nice to them. And then, when the killers ignored them and began the flank attack, instead of laying down covering fire, the nonkillers started shooting at the killers. Does anyone seriously think this would be a successful way to wage war?\nWhy, then, does anyone imagine that the same tactical approach will succeed in cultural war? If the moderates will not at the very least provide covering fire for the extremists, they are useless. And to the extent that they open their cowardly mouths to criticize, correct, and concern-troll the only people on their side who are taking action, they are worse than useless.\nAs for the Christians, let us reflect upon the Biblical example that many “nonkillers” like to cite, Matthew 26:51\nWith\nthat, one of Jesus’ companions reached for his sword, drew it out and\nstruck the servant of the high priest, cutting off his ear.\n“Put your sword back in its place,” Jesus said to him, “for all who draw the sword will die by the sword.\nDo you think I cannot call on my Father, and he will at once put at my disposal more than twelve legions of angels? But how then would the Scriptures be fulfilled that say it must happen in this way?”\nThere is a great deal of significant information here, particularly the situation-specific aspects of the command, but with regards to the present subject, the most important point is this: Jesus knowingly chose a hot-tempered “killer” as one of his closest companions and the rock upon which he would build the Church. Like David, beloved of God, and Paul, the great evangelist, it is the “killers” whom God has historically preferred and chosen to utilize. I do not think the moderates and nonkillers who sit back and snipe in the comfortable confidence that they are doing God’s will by sitting on their plump posteriors and doing nothing that will offend anyone should be so confident that God’s Will is in line with their own.\nKeep in mind that the incident is also recounted in John 18:10\nThen Simon Peter, who had a sword, drew it and struck the high priest’s servant, cutting off his right ear. (The servant’s name was Malchus.) Jesus commanded Peter, “Put your sword away! Shall I not drink the cup the Father has given me?”\nClearly the relevant point is not the non-use of swords, but the non-use of a particular sword in a particular situation. As to “dying by the sword”, what of it? That doesn’t mean that one’s actions that put one at risk of it are necessarily wrong. It’s merely a factual warning. Recall what Winters pointed out:\n“The problem, of course, lies in the fact that casualties are highest among your killers.”\nWinters also wrote about the guilt he sometimes felt at reunions, as he was reminded that there were about half as many survivors of 1st platoon as there were from Easy Company’s 2nd and 3rd platoons due to the heavier casualties they took. But consider why he leaned upon them so heavily:\nWith thirty-five men, a platoon of Easy Company had routed two German companies of about 300 men. American casualties (including those from Fox Company) were one dead, twenty-two wounded. German casualties were fifty killed, eleven captured, about 100 wounded.\nIt should not be a surprise that looking into it reveals that the platoon responsible was Easy Company’s 1st platoon. Dying by the sword is not a sin. It is, in many cases, a sacrifice.\nMost damning of all, I think, is the observable hypocrisy of many moderates, who flagrantly violate their own advice. They are very often more than happy to insult their nominal allies and attack their own side’s extremists with the very names they refuse to call the enemy.",
  "tags": [
    "Christianity",
    "war"
  ],
  "categories": [],
  "sitemap_lastmod": "2015-03-01T13:00:00+00:00"
}