{
  "url": "https://voxday.net/2015/03/22/civil-disobedience/",
  "scraped_at": "2025-12-16T12:49:29.226480",
  "title": "Civil disobedience",
  "date_display": "March 22, 2015",
  "date_iso": "2015-03-22T20:36:00+00:00",
  "date_from_url": "2015-03-22",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>The Germans aren’t exactly known for it, but when they do it, <a href=\"http://www.wired.com/2015/03/geeks-guide-marc-goodman/\">they do it well</a>:</p><blockquote class=\"tr_bq\"><p> “A few years ago the German Minister of Justice—kind of like the<br> Attorney General here in the United States—he was pushing very hard for<br> Germans to have biometric data on their national ID cards, and he wanted<br> all Germans to be fingerprinted. And the Germans pushed back,<br> particularly privacy advocates and those in the <a href=\"http://en.wikipedia.org/wiki/Chaos_Computer_Club\" rel=\"noopener\" target=\"_blank\">Chaos Computer Club</a>.<br> And so what they did is when the German Minister of Justice was out at a<br> restaurant, they went ahead and after he left they got the glass that<br> he had left behind, and they were able to lift his fingerprint off of<br> the glass. They then took a photograph, brought it into Photoshop,<br> cleaned it up, and then were able to replicate it on 3D printers, in<br> latex. … [They] included it as a handout in their Chaos Computer Club<br> magazine that went out to 5,000 people, and they encouraged their<br> readers to leave the Justice Minister’s fingerprints at crime scenes all<br> over Germany, which they did.”</br></br></br></br></br></br></br></br></br></br></br></br></br></p></blockquote><p>This points out the only way one can reasonably expect to gain any privacy, which is by flooding the system. It is a known fact that figuring out what information is valuable is much harder than obtaining raw data in the first place, so rather than futile attempts to lock things down, one’s focus should be in flooding the data collectors with vast quantities of meaningless information.</p></div>",
  "content_text": "The Germans aren’t exactly known for it, but when they do it,\nthey do it well\n:\n“A few years ago the German Minister of Justice—kind of like the\nAttorney General here in the United States—he was pushing very hard for\nGermans to have biometric data on their national ID cards, and he wanted\nall Germans to be fingerprinted. And the Germans pushed back,\nparticularly privacy advocates and those in the\nChaos Computer Club\n.\nAnd so what they did is when the German Minister of Justice was out at a\nrestaurant, they went ahead and after he left they got the glass that\nhe had left behind, and they were able to lift his fingerprint off of\nthe glass. They then took a photograph, brought it into Photoshop,\ncleaned it up, and then were able to replicate it on 3D printers, in\nlatex. … [They] included it as a handout in their Chaos Computer Club\nmagazine that went out to 5,000 people, and they encouraged their\nreaders to leave the Justice Minister’s fingerprints at crime scenes all\nover Germany, which they did.”\nThis points out the only way one can reasonably expect to gain any privacy, which is by flooding the system. It is a known fact that figuring out what information is valuable is much harder than obtaining raw data in the first place, so rather than futile attempts to lock things down, one’s focus should be in flooding the data collectors with vast quantities of meaningless information.",
  "tags": [
    "technology"
  ],
  "categories": [],
  "sitemap_lastmod": "2015-03-22T20:36:00+00:00"
}