{
  "url": "https://voxday.net/2015/03/27/depression-or-sudden-jihad-syndrome/",
  "scraped_at": "2025-12-16T12:49:59.294457",
  "title": "Depression or Sudden Jihad Syndrome?",
  "date_display": "March 27, 2015",
  "date_iso": "2015-03-27T09:10:00+00:00",
  "date_from_url": "2015-03-27",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>Contradictory claims are being made about the murderous Germanwings pilot. The more explosive one is that the “significant item” that was found at his apartment was indicative of <a href=\"http://speisa.com/modules/articles/index.php/item.1086/the-co-pilot-of-the-germanwings-airbus-was-a-convert-to-islam.html\">a conversion to Islam</a>:</p><blockquote class=\"tr_bq\"><p> According to Michael Mannheimer, a writer for German PI-News, Germany now has its own 9/11, thanks to the convert to Islam, Andreas Lubitz. Translation from German:</p><p>All evidence indicates that the copilot of Airbus machine in his six-months break during his training as a pilot in Germanwings, converted to Islam and subsequently either by the order of “radical”, ie. devout Muslims , or received the order from the book of terror, the Quran, on his own accord decided to carry out this mass murder. As a radical mosque in Bremen is in the center of the investigation, in which the convert was staying often, it can be assumed that he – as Mohammed Atta, in the attack against New York – received his instructions directly from the immediate vicinity of the mosque.</p><p>Converts are the most important weapon of Islam. Because their resume do not suggests that they often are particularly violent Muslims. Thus Germany now has its own 9/11, but in a reduced form. And so it is clear that Islam is a terrorist organization that are in accordance with §129a of the Criminal Code to prohibit it and to investigate its followers. But nothing will happen. One can bet that the apologists (media, politics, “Islamic Scholars”) will agree to assign this an act of a “mentally unstable” man, and you can bet that now, once again the mantra of how supposedly peaceful Islam is will continue.</p></blockquote><p>Now this sounds a little far-fetched and breathless to me, especially since there were only reports of the pilot breathing, not of any prayers or the customary jihadist battle cry. I’d take it with a grain of salt at the moment. Then again, I’m not sure that any direct statements that the pilot said nothing of any kind have been made. And it is true that claims of his mental instability are already being reported, <a href=\"http://www.dailymail.co.uk/news/article-3013743/Germanwings-pilot-slipped-safety-net-devastating-consequences.html\">such as here</a>:</p><blockquote class=\"tr_bq\"><p> The Germanwings co-pilot who crashed his plane into a mountain killing himself and 149 people on board was receiving psychiatric counselling right up until the crash, it emerged today.</p><p>Andreas Lubitz locked the pilot out the of the Airbus A320’s cockpit before setting the plane’s controls to descend into a rocky valley, French prosecutors revealed yesterday.</p><p>As well as having been signed off from training with depression in 2008, it was reported this morning that Lubitz had continued to receive mental health support up until this week’s crash.</p><p>German newspaper Bild also reported that the 28-year-old was in the middle of the ‘relationship crisis’ with his girlfriend in the weeks before the crash and may have been struggling to cope with a break-up.</p><p>It was claimed this morning that the couple were engaged to be married next year.</p><p>New information about Lubitz’s life emerged just hours after police investigating the disaster began a four-hour search of his flat, which he is said to have shared with a girlfriend. Officers refused to reveal details of what they have found but have insisted no suicide note had been recovered.</p></blockquote><p>The two things that are slightly strange here are a) the refusal to reveal any details of what has been found, except the statement that something was “significant”. Of course, that could be anything from a Koran to the dead body of his ex-girlfriend. The other thing that is strange is that in all the previous reports, there was no indication of a girlfriend of any kind. For example, he was reported to have taken a trip to a resort with a male friend, the sort of trip I have never known any man to take except with a wife or girlfriend.</p><p>And, of course, given the growing strength of PEGIDA, we know the German authorities will be desperate to keep any indication of Lubitz being a Mahometan convert under wraps.</p></div>",
  "content_text": "Contradictory claims are being made about the murderous Germanwings pilot. The more explosive one is that the “significant item” that was found at his apartment was indicative of\na conversion to Islam\n:\nAccording to Michael Mannheimer, a writer for German PI-News, Germany now has its own 9/11, thanks to the convert to Islam, Andreas Lubitz. Translation from German:\nAll evidence indicates that the copilot of Airbus machine in his six-months break during his training as a pilot in Germanwings, converted to Islam and subsequently either by the order of “radical”, ie. devout Muslims , or received the order from the book of terror, the Quran, on his own accord decided to carry out this mass murder. As a radical mosque in Bremen is in the center of the investigation, in which the convert was staying often, it can be assumed that he – as Mohammed Atta, in the attack against New York – received his instructions directly from the immediate vicinity of the mosque.\nConverts are the most important weapon of Islam. Because their resume do not suggests that they often are particularly violent Muslims. Thus Germany now has its own 9/11, but in a reduced form. And so it is clear that Islam is a terrorist organization that are in accordance with §129a of the Criminal Code to prohibit it and to investigate its followers. But nothing will happen. One can bet that the apologists (media, politics, “Islamic Scholars”) will agree to assign this an act of a “mentally unstable” man, and you can bet that now, once again the mantra of how supposedly peaceful Islam is will continue.\nNow this sounds a little far-fetched and breathless to me, especially since there were only reports of the pilot breathing, not of any prayers or the customary jihadist battle cry. I’d take it with a grain of salt at the moment. Then again, I’m not sure that any direct statements that the pilot said nothing of any kind have been made. And it is true that claims of his mental instability are already being reported,\nsuch as here\n:\nThe Germanwings co-pilot who crashed his plane into a mountain killing himself and 149 people on board was receiving psychiatric counselling right up until the crash, it emerged today.\nAndreas Lubitz locked the pilot out the of the Airbus A320’s cockpit before setting the plane’s controls to descend into a rocky valley, French prosecutors revealed yesterday.\nAs well as having been signed off from training with depression in 2008, it was reported this morning that Lubitz had continued to receive mental health support up until this week’s crash.\nGerman newspaper Bild also reported that the 28-year-old was in the middle of the ‘relationship crisis’ with his girlfriend in the weeks before the crash and may have been struggling to cope with a break-up.\nIt was claimed this morning that the couple were engaged to be married next year.\nNew information about Lubitz’s life emerged just hours after police investigating the disaster began a four-hour search of his flat, which he is said to have shared with a girlfriend. Officers refused to reveal details of what they have found but have insisted no suicide note had been recovered.\nThe two things that are slightly strange here are a) the refusal to reveal any details of what has been found, except the statement that something was “significant”. Of course, that could be anything from a Koran to the dead body of his ex-girlfriend. The other thing that is strange is that in all the previous reports, there was no indication of a girlfriend of any kind. For example, he was reported to have taken a trip to a resort with a male friend, the sort of trip I have never known any man to take except with a wife or girlfriend.\nAnd, of course, given the growing strength of PEGIDA, we know the German authorities will be desperate to keep any indication of Lubitz being a Mahometan convert under wraps.",
  "tags": [
    "conspiracy",
    "media"
  ],
  "categories": [],
  "sitemap_lastmod": "2015-03-27T09:10:00+00:00"
}