{
  "url": "https://voxday.net/2015/03/17/do-what-thou-fee/",
  "scraped_at": "2025-12-16T12:48:50.829475",
  "title": "Do what thou feel",
  "date_display": "March 17, 2015",
  "date_iso": "2015-03-17T11:12:00+00:00",
  "date_from_url": "2015-03-17",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>That is not only the whole of the modern moral law, it is the whole of history as well. “Do what thou feel, with due regard for the shrieking of the herd around you, for the truth is nothing more than an opinion.”. A philosopher discovers that this is <a href=\"http://opinionator.blogs.nytimes.com/2015/03/02/why-our-children-dont-think-there-are-moral-facts/?_r=1\">a philosophy instilled at an early age</a>, in public school:</p><blockquote class=\"tr_bq\"><p> What would you say if you found out that our public schools were teaching children that it is not true that it’s wrong to kill people for fun or cheat on tests? Would you be surprised?</p><p>I was. As a philosopher, I already knew that many college-aged students don’t believe in moral facts. While there are no national surveys quantifying this phenomenon, philosophy professors with whom I have spoken suggest that the overwhelming majority of college freshmen in their classrooms view moral claims as mere opinions that are not true or are true only relative to a culture.</p><p>What I didn’t know was where this attitude came from. Given the presence of moral relativism in some academic circles, some people might naturally assume that philosophers themselves are to blame. But they aren’t. There are historical examples of philosophers who endorse a kind of moral relativism, dating back at least to Protagoras who declared that “man is the measure of all things,” and several who deny that there are any moral facts whatsoever. But such creatures are rare. Besides, if students are already showing up to college with this view of morality, it’s very unlikely that it’s the result of what professional philosophers are teaching. So where is the view coming from?</p><p>A few weeks ago, I learned that students are exposed to this sort of thinking well before crossing the threshold of higher education. A misleading distinction between fact and opinion is embedded in the Common Core.</p><p><i>Fact: Something that is true about a subject and can be tested or proven.</i></p><p>Opinion: What someone thinks, feels, or believes. </p></blockquote><p>No wonder so many millennials are clueless science fetishists who know nothing of what has gone before them. This definition of “Fact” has completely erased the very concept of history, and rendered the past nothing but mere opinion.</p><p>Public school is an unvarnished and unmitigated evil. If you are still foolish enough to be subjecting your children to it, think again. They are not only being intellectually lobotomized, they are being morally and temporally crippled as well.</p><p>There is no amount of Christian upbringing or Sunday School teaching that is capable of counteracting this philosophical programming. It will all be neatly slotted into the “opinion” category, which they are taught cannot overlap with the “fact” category. Consider the professor’s test of his own son.</p><blockquote class=\"tr_bq\"><p> Students are taught that claims are either facts or opinions. They are given quizzes in which they must sort claims into one camp or the other but not both. But if a fact is something that is true and an opinion is something that is believed, then many claims will obviously be both. For example, I asked my son about this distinction after his open house. He confidently explained that facts were things that were true whereas opinions are things that are believed. We then had this conversation:</p><p>Me: “I believe that George Washington was the first president. Is that a fact or an opinion?”</p><p>Him: “It’s a fact.”</p><p>Me: “But I believe it, and you said that what someone believes is an opinion.”</p><p>Him: “Yeah, but it’s true.”</p><p>Me: “So it’s both a fact and an opinion?”</p><p>The blank stare on his face said it all.</p></blockquote><p>The idea that children as young as five are going to be some sort of Christian missionary light unto the pagans in public school was always an abysmally stupid one, but the fact that even a philosopher’s son can be reprogrammed in such an insidious way should shake even the most foolish Christian parent’s blithe confidence in public school. And the idea that your local school is “really good” is far from a panacea, it merely means that it is better at instilling this pernicious anti-philosophy into its students’ heads.</p><p><i>In summary, our public schools teach students that all claims are either<br> facts or opinions and that all value and moral claims fall into the<br> latter camp. The punchline: there are no moral facts. And if there are<br> no moral facts, then there are no moral truths. </br></br></br></i></p></div>",
  "content_text": "That is not only the whole of the modern moral law, it is the whole of history as well. “Do what thou feel, with due regard for the shrieking of the herd around you, for the truth is nothing more than an opinion.”. A philosopher discovers that this is\na philosophy instilled at an early age\n, in public school:\nWhat would you say if you found out that our public schools were teaching children that it is not true that it’s wrong to kill people for fun or cheat on tests? Would you be surprised?\nI was. As a philosopher, I already knew that many college-aged students don’t believe in moral facts. While there are no national surveys quantifying this phenomenon, philosophy professors with whom I have spoken suggest that the overwhelming majority of college freshmen in their classrooms view moral claims as mere opinions that are not true or are true only relative to a culture.\nWhat I didn’t know was where this attitude came from. Given the presence of moral relativism in some academic circles, some people might naturally assume that philosophers themselves are to blame. But they aren’t. There are historical examples of philosophers who endorse a kind of moral relativism, dating back at least to Protagoras who declared that “man is the measure of all things,” and several who deny that there are any moral facts whatsoever. But such creatures are rare. Besides, if students are already showing up to college with this view of morality, it’s very unlikely that it’s the result of what professional philosophers are teaching. So where is the view coming from?\nA few weeks ago, I learned that students are exposed to this sort of thinking well before crossing the threshold of higher education. A misleading distinction between fact and opinion is embedded in the Common Core.\nFact: Something that is true about a subject and can be tested or proven.\nOpinion: What someone thinks, feels, or believes.\nNo wonder so many millennials are clueless science fetishists who know nothing of what has gone before them. This definition of “Fact” has completely erased the very concept of history, and rendered the past nothing but mere opinion.\nPublic school is an unvarnished and unmitigated evil. If you are still foolish enough to be subjecting your children to it, think again. They are not only being intellectually lobotomized, they are being morally and temporally crippled as well.\nThere is no amount of Christian upbringing or Sunday School teaching that is capable of counteracting this philosophical programming. It will all be neatly slotted into the “opinion” category, which they are taught cannot overlap with the “fact” category. Consider the professor’s test of his own son.\nStudents are taught that claims are either facts or opinions. They are given quizzes in which they must sort claims into one camp or the other but not both. But if a fact is something that is true and an opinion is something that is believed, then many claims will obviously be both. For example, I asked my son about this distinction after his open house. He confidently explained that facts were things that were true whereas opinions are things that are believed. We then had this conversation:\nMe: “I believe that George Washington was the first president. Is that a fact or an opinion?”\nHim: “It’s a fact.”\nMe: “But I believe it, and you said that what someone believes is an opinion.”\nHim: “Yeah, but it’s true.”\nMe: “So it’s both a fact and an opinion?”\nThe blank stare on his face said it all.\nThe idea that children as young as five are going to be some sort of Christian missionary light unto the pagans in public school was always an abysmally stupid one, but the fact that even a philosopher’s son can be reprogrammed in such an insidious way should shake even the most foolish Christian parent’s blithe confidence in public school. And the idea that your local school is “really good” is far from a panacea, it merely means that it is better at instilling this pernicious anti-philosophy into its students’ heads.\nIn summary, our public schools teach students that all claims are either\nfacts or opinions and that all value and moral claims fall into the\nlatter camp. The punchline: there are no moral facts. And if there are\nno moral facts, then there are no moral truths.",
  "tags": [
    "education",
    "philosophy"
  ],
  "categories": [],
  "sitemap_lastmod": "2015-03-17T11:12:00+00:00"
}