{
  "url": "https://voxday.net/2015/03/23/ed-brayton-wants-to-kill-nationalists/",
  "scraped_at": "2025-12-16T12:49:32.905990",
  "title": "Ed Brayton wants to kill nationalists",
  "date_display": "March 23, 2015",
  "date_iso": "2015-03-23T12:00:00+00:00",
  "date_from_url": "2015-03-23",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>Ed Brayton is one of those low midwits who stumbles through life thinking that he’s intelligent because he’s a little smarter than the average idiot. <a href=\"http://www.milobookclub.com/2009/01/02/dispatches-from-clueless-atheis/\">I’ve rubbed his nose in his own incompetence</a> several times in the past; believe it or not, he’s actually dumber than PZ Myers. But <a href=\"http://freethoughtblogs.com/dispatches/2015/03/22/xenophobes-suck-fuck-them-all/\">he’s really outdone himself</a> this time:</p><blockquote class=\"tr_bq\"><p> People often ask me how I manage to troll the right-wing fever swamps without becoming hopelessly misanthropic. Mostly I’m able to laugh rather than cry or explode in anger. But bullshit like this makes me want to climb a tower with a high-powered rifle and start picking people off.</p><p><i>When Andrew Zink passed the microphone over to his classmate and allowed her to recite the Pledge of Allegiance in Arabic, he said, he knew most students wouldn’t support his decision.</i></p><p>As president of the student senate at Pine Bush High School in New York, Zink leads the pledge every morning. But on Wednesday, a teacher asked him if he would mind if a classmate did it instead. It was National Foreign Language Week, and the students were encouraged to learn about different cultures.</p><p> “I wanted to say yes because I felt this is the right thing to do,” Zink, 18, said in an interview Thursday with the Los Angeles Times.</p><p>Outrage quickly flowed throughout the campus, about 75 miles north of New York City. The principal apologized to the school later that day, Zink said, for allowing the Pledge of Allegiance to be recited in a different language.</p><p>  But the apology did little to quell student and parent anger.</p><p> “The anti-Muslim sentiment started to build,” Zink said. “The poor girl who read it, she’s so sweet and when she finished reading it people called her a terrorist. They told her to go back to the Middle East. They mercilessly degraded her and I felt awful for her.”</p><p> Zink didn’t get by unscathed either. He said he was threatened over Twitter and received death threats.</p><p>Of course he did. Because xenophobes are fucking idiots and I really don’t want to share this planet with them anymore.</p></blockquote><p>I don’t wish to share the civilized West with fifth column-coddlers like Mr. Brayton myself. I suggest we send Mr. Brayton to live in the Dar al-Islam where he can discover what true xenophobia is, and why it exists in the first place. When the civil wars start across the West, don’t forget what side these treasonous idiots were on. And don’t offer them safe haven when they try to escape those whose invasion they supported either. When they cry and plead that they’ve seen the light, tell them “too late now.”</p><p>Speaking of Brayton’s reliable intellectual ineptitude, this is my favorite set of Braytonisms, from <a href=\"http://www.milobookclub.com/2010/02/27/question-for-ed-brayton/\">when he was running away</a> from a proposed 2010 debate with Ellis Washington:</p><blockquote class=\"tr_bq\"><p> “As for your challenge to debate, I will consider it – if you can give a coherent answer to the following question”<br> – Ed Brayton, February 26, 2010</br></p><p>“Ellis Washington did not challenge me to a debate.”<br> – Ed Brayton, March 1, 2010</br></p></blockquote></div>",
  "content_text": "Ed Brayton is one of those low midwits who stumbles through life thinking that he’s intelligent because he’s a little smarter than the average idiot.\nI’ve rubbed his nose in his own incompetence\nseveral times in the past; believe it or not, he’s actually dumber than PZ Myers. But\nhe’s really outdone himself\nthis time:\nPeople often ask me how I manage to troll the right-wing fever swamps without becoming hopelessly misanthropic. Mostly I’m able to laugh rather than cry or explode in anger. But bullshit like this makes me want to climb a tower with a high-powered rifle and start picking people off.\nWhen Andrew Zink passed the microphone over to his classmate and allowed her to recite the Pledge of Allegiance in Arabic, he said, he knew most students wouldn’t support his decision.\nAs president of the student senate at Pine Bush High School in New York, Zink leads the pledge every morning. But on Wednesday, a teacher asked him if he would mind if a classmate did it instead. It was National Foreign Language Week, and the students were encouraged to learn about different cultures.\n“I wanted to say yes because I felt this is the right thing to do,” Zink, 18, said in an interview Thursday with the Los Angeles Times.\nOutrage quickly flowed throughout the campus, about 75 miles north of New York City. The principal apologized to the school later that day, Zink said, for allowing the Pledge of Allegiance to be recited in a different language.\nBut the apology did little to quell student and parent anger.\n“The anti-Muslim sentiment started to build,” Zink said. “The poor girl who read it, she’s so sweet and when she finished reading it people called her a terrorist. They told her to go back to the Middle East. They mercilessly degraded her and I felt awful for her.”\nZink didn’t get by unscathed either. He said he was threatened over Twitter and received death threats.\nOf course he did. Because xenophobes are fucking idiots and I really don’t want to share this planet with them anymore.\nI don’t wish to share the civilized West with fifth column-coddlers like Mr. Brayton myself. I suggest we send Mr. Brayton to live in the Dar al-Islam where he can discover what true xenophobia is, and why it exists in the first place. When the civil wars start across the West, don’t forget what side these treasonous idiots were on. And don’t offer them safe haven when they try to escape those whose invasion they supported either. When they cry and plead that they’ve seen the light, tell them “too late now.”\nSpeaking of Brayton’s reliable intellectual ineptitude, this is my favorite set of Braytonisms, from\nwhen he was running away\nfrom a proposed 2010 debate with Ellis Washington:\n“As for your challenge to debate, I will consider it – if you can give a coherent answer to the following question”\n– Ed Brayton, February 26, 2010\n“Ellis Washington did not challenge me to a debate.”\n– Ed Brayton, March 1, 2010",
  "tags": [
    "Clash of Civilizations",
    "Vibrancy is our strength"
  ],
  "categories": [],
  "sitemap_lastmod": "2015-03-23T12:00:00+00:00"
}