{
  "url": "https://voxday.net/2015/03/26/equality-review/",
  "scraped_at": "2025-12-16T12:49:55.621000",
  "title": "Equality: a review",
  "date_display": "March 26, 2015",
  "date_iso": "2015-03-26T19:11:00+00:00",
  "date_from_url": "2015-03-26",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>Henry Dampier <a href=\"http://www.henrydampier.com/2015/03/book-review-equality-the-impossible-quest/\">reviews </a><i><a href=\"http://www.henrydampier.com/2015/03/book-review-equality-the-impossible-quest/\">Equality: The Impossible Quest</a> </i>by Martin van Creveld:</p><blockquote class=\"tr_bq\"><p> Throughout history, ‘equality’ has tended to mean different things, and it usually only pertained to certain situations or within certain groups. The most powerful argument that he makes is towards the end of the book, in which he points out that equality is an essential concept in military life, but that it isn’t generally sustainable outside that context. Members of a military unit of similar ranks must be somewhat equal — else the army loses coherence. It can’t hold a formation in reality, or be conceived of in a useful way by officers, if there is no attempt to make those men more equal.</p><p>van Creveld: <i>Without equality, cohesion is inconceivable. Cohesion, the ability to stick together and stay together through thick and thin, is the most important quality any military formation must have. Without it such a formation is but a loose gathering of men, incapable of coordinated action and easily scattered, and of little or no military use. In all well-organized armies at all times and places, the first step towards cohesion has always been to put everyone on an equal basis. Often the process starts when all new recruits are given the same haircut. Beards may have to be taken off, moustaches trimmed, piercings and jewelry discarded.</i></p><p>This is the proper understanding of equality: equality of rank within a hierarchy. It has a limited conceptual and practical utility that becomes wasted when thinkers apply the concept beyond its carrying capacity, so to speak.</p></blockquote><p>I thought this was a perceptive review. The important thing to remember when reading the book is that van Creveld is a scholar, not an ideologue or a polemicist. While he doesn’t hide his personal opinions, he also doesn’t place any particular weight on them in comparison with the historical facts and concepts that he delves into and describes.</p></div>",
  "content_text": "Henry Dampier\nreviews\nEquality: The Impossible Quest\nby Martin van Creveld:\nThroughout history, ‘equality’ has tended to mean different things, and it usually only pertained to certain situations or within certain groups. The most powerful argument that he makes is towards the end of the book, in which he points out that equality is an essential concept in military life, but that it isn’t generally sustainable outside that context. Members of a military unit of similar ranks must be somewhat equal — else the army loses coherence. It can’t hold a formation in reality, or be conceived of in a useful way by officers, if there is no attempt to make those men more equal.\nvan Creveld:\nWithout equality, cohesion is inconceivable. Cohesion, the ability to stick together and stay together through thick and thin, is the most important quality any military formation must have. Without it such a formation is but a loose gathering of men, incapable of coordinated action and easily scattered, and of little or no military use. In all well-organized armies at all times and places, the first step towards cohesion has always been to put everyone on an equal basis. Often the process starts when all new recruits are given the same haircut. Beards may have to be taken off, moustaches trimmed, piercings and jewelry discarded.\nThis is the proper understanding of equality: equality of rank within a hierarchy. It has a limited conceptual and practical utility that becomes wasted when thinkers apply the concept beyond its carrying capacity, so to speak.\nI thought this was a perceptive review. The important thing to remember when reading the book is that van Creveld is a scholar, not an ideologue or a polemicist. While he doesn’t hide his personal opinions, he also doesn’t place any particular weight on them in comparison with the historical facts and concepts that he delves into and describes.",
  "tags": [
    "Book Review",
    "Castalia House"
  ],
  "categories": [],
  "sitemap_lastmod": "2015-03-26T19:11:00+00:00"
}