{
  "url": "https://voxday.net/2015/03/20/equality-impossible-ques/",
  "scraped_at": "2025-12-16T12:49:12.241628",
  "title": "Equality: The Impossible Quest",
  "date_display": "March 20, 2015",
  "date_iso": "2015-03-20T10:39:00+00:00",
  "date_from_url": "2015-03-20",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p><a href=\"http://www.milobookclub.com/wp-content/uploads/2015/03/equality_960.jpg\" imageanchor=\"1\" style=\"clear: left; float: left; margin-bottom: 1em; margin-right: 1em;\"><img border=\"0\" decoding=\"async\" fetchpriority=\"high\" height=\"400\" src=\"http://www.milobookclub.com/wp-content/uploads/2015/03/equality_960.jpg\" width=\"250\"/></a>We are very pleased to be able to announce the publication of an intellectual tour de force by the world-renowned military historian Martin van Creveld, entitled <b><i><a href=\"http://www.amazon.com/Equality-Impossible-Martin-van-Creveld-ebook/dp/B00UVLE20W\">Equality: The Impossible Quest</a></i></b>. Although this is a serious, scholastic history, it is a fascinating read that delves deep into the history of an important, but almost completely unexamined philosophical concept. Featuring a cover designed by Christopher Kallini, it is 282 pages and is now <a href=\"http://www.amazon.com/Equality-Impossible-Martin-van-Creveld-ebook/dp/B00UVLE20W\">available at Amazon</a> as well as in both EPUB and MOBI formats <a href=\"http://www.castaliahouse.com/downloads/equality-the-impossible-quest/\">at Castalia House</a>.</p><p>Despite being one of the three most important political concepts of the<br> modern age, unlike Justice and Liberty, Equality has seldom been<br> examined from an intellectual perspective. What does it mean to be<br> equal? What is being specifically demanded when calls for equality are<br> made? Is inequality justified when the objective is to make up for past<br> inequalities? Which inequalities are unacceptable and require government<br> intervention, and which are acceptable and therefore do not merit any<br> action? Where did the idea that equality was a desirable state come from<br> in the first place? These, and other questions, are addressed in deeply<br> researched detail by Martin van Creveld, the well-known military<br> historian and theorist, in <i>Equality: The Impossible Quest</i>.</br></br></br></br></br></br></br></br></br></br></p><p>The book begins with a search for signs of equality throughout the animal kingdom as well as in the primitive historical societies that never heard of the concept. Next, van Creveld<br> traces the development of the idea and its implementation in various<br> societies throughout history. This include ancient Greek equality as<br> realized in Athens and Sparta, monastic equality in both East and<br> West, social revolts aimed at establishing equality, utopian<br> equality, liberal equality of the American and French Revolutionary<br> varieties, socialist, communist and kibbutz equalities, Nazi<br> equality, the equality of women and minorities, and biological<br> equality through medical and genetic science. The last chapter deals<br> with the greatest equalizer of all, death.</br></br></br></br></br></br></br></br></br></p><p>This<br> survey of the history of equality demonstrates that the vast<br> majority of human societies have not only survived, but thrived<br> without equality. And it appears that despite its popular appeal, if<br> carried too far, equality will present a threat to justice, liberty,<br> and even truth. More problematic still is the observable fact that<br> the various versions of equality tend to be contradictory. For every<br> form of equality achieved, another must often be sacrificed. That is<br> why the attempt to establish it on a lasting basis has, in every<br> previous instance, proven ephemeral.</br></br></br></br></br></br></br></br></br></p><p>Dr. Martin van Creveld, Professor Emeritus of the Hebrew<br> University, Jerusalem, is one of the world’s leading writers on military<br> history and strategy. He<br> is fluent in Hebrew, German, Dutch, and English, and has authored more<br> than twenty books, including <i>Fighting Power: German and U.S. Army Performance, 1939-1945</i> (1982), <i>The Transformation of War</i> (1991), and <i>Wargames: From Gladiators to Gigabytes</i><br> (2013). He is known for his development of the concept of<br> “nontrinitarian” warfare and two of his books are among the seven considered to make up the 4th Generation Warfare canon as defined by William S. Lind.</br></br></br></br></br></br></p></div>",
  "content_text": "We are very pleased to be able to announce the publication of an intellectual tour de force by the world-renowned military historian Martin van Creveld, entitled\nEquality: The Impossible Quest\n. Although this is a serious, scholastic history, it is a fascinating read that delves deep into the history of an important, but almost completely unexamined philosophical concept. Featuring a cover designed by Christopher Kallini, it is 282 pages and is now\navailable at Amazon\nas well as in both EPUB and MOBI formats\nat Castalia House\n.\nDespite being one of the three most important political concepts of the\nmodern age, unlike Justice and Liberty, Equality has seldom been\nexamined from an intellectual perspective. What does it mean to be\nequal? What is being specifically demanded when calls for equality are\nmade? Is inequality justified when the objective is to make up for past\ninequalities? Which inequalities are unacceptable and require government\nintervention, and which are acceptable and therefore do not merit any\naction? Where did the idea that equality was a desirable state come from\nin the first place? These, and other questions, are addressed in deeply\nresearched detail by Martin van Creveld, the well-known military\nhistorian and theorist, in\nEquality: The Impossible Quest\n.\nThe book begins with a search for signs of equality throughout the animal kingdom as well as in the primitive historical societies that never heard of the concept. Next, van Creveld\ntraces the development of the idea and its implementation in various\nsocieties throughout history. This include ancient Greek equality as\nrealized in Athens and Sparta, monastic equality in both East and\nWest, social revolts aimed at establishing equality, utopian\nequality, liberal equality of the American and French Revolutionary\nvarieties, socialist, communist and kibbutz equalities, Nazi\nequality, the equality of women and minorities, and biological\nequality through medical and genetic science. The last chapter deals\nwith the greatest equalizer of all, death.\nThis\nsurvey of the history of equality demonstrates that the vast\nmajority of human societies have not only survived, but thrived\nwithout equality. And it appears that despite its popular appeal, if\ncarried too far, equality will present a threat to justice, liberty,\nand even truth. More problematic still is the observable fact that\nthe various versions of equality tend to be contradictory. For every\nform of equality achieved, another must often be sacrificed. That is\nwhy the attempt to establish it on a lasting basis has, in every\nprevious instance, proven ephemeral.\nDr. Martin van Creveld, Professor Emeritus of the Hebrew\nUniversity, Jerusalem, is one of the world’s leading writers on military\nhistory and strategy. He\nis fluent in Hebrew, German, Dutch, and English, and has authored more\nthan twenty books, including\nFighting Power: German and U.S. Army Performance, 1939-1945\n(1982),\nThe Transformation of War\n(1991), and\nWargames: From Gladiators to Gigabytes\n(2013). He is known for his development of the concept of\n“nontrinitarian” warfare and two of his books are among the seven considered to make up the 4th Generation Warfare canon as defined by William S. Lind.",
  "tags": [
    "Castalia House"
  ],
  "categories": [],
  "sitemap_lastmod": "2015-03-20T10:39:00+00:00"
}