{
  "url": "https://voxday.net/2015/03/12/evolution-and-problem-of-time/",
  "scraped_at": "2025-12-16T12:48:26.590561",
  "title": "Evolution and the problem of time",
  "date_display": "March 12, 2015",
  "date_iso": "2015-03-12T17:58:00+00:00",
  "date_from_url": "2015-03-12",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>I always find it amusing when someone who has credentials in a subject, but is at a distinct disadvantage in IQ terms tries to tell me that I don’t know what I’m talking about. You may recall that over the years, I have repeatedly asked various evolutionary True Believers a very simple and straightforward time-based question, to which there absolutely <i>must </i>be an answer, and they not only have been unable to answer it, but frequently tried to deny it was either a) relevant or b) possible, thereby demonstrating that they don’t understand ANYTHING about their own faux-scientific faith. But <a href=\"http://www.nature.com/news/dna-mutation-clock-proves-tough-to-set-1.17079\">the speed of evolution, and of the underlying mutations, </a>is absolutely central to understanding the theory, as well as determining whether it is total nonsense or not:</p><blockquote class=\"tr_bq\"><p> Mathematicians keep refining π even though they know it to more than 12 trillion digits; physicists beat themselves up because they cannot pin down the gravitational constant beyond three significant figures. Geneticists, by contrast, are having trouble deciding between one measure of how fast human DNA mutates and another that is half that rate.</p><p>The rate is key to calibrating the ‘molecular clock’ that puts DNA-based dates on events in evolutionary history. So at an intimate meeting in Leipzig, Germany, on 25–27 February, a dozen speakers puzzled over why calculations of the rate at which sequence changes pop up in human DNA have been so much lower in recent years than previously. They also pondered why the rate seems to fluctuate over time. The meeting drew not only evolutionary geneticists, but also researchers with an interest in cancer and reproductive biology — fields in which mutations have a central role.</p><p>“Mutation is ultimately the source of all heritable diseases and all biological adaptations, so understanding the rate at which mutations evolve is a fundamental question,” says Molly Przeworski, a population geneticist at Columbia University in New York City who attended the Human Mutation Rate Meeting….</p><p>A slower molecular clock worked well to harmonize genetic and<br> archaeological estimates for dates of key events in human evolution,<br> such as migrations out of Africa and around the rest of the world.<br> But calculations using the slow clock gave nonsensical results when<br> extended further back in time — positing, for example, that the most<br> recent common ancestor of apes and monkeys could have encountered<br> dinosaurs. Reluctant to abandon the older numbers completely, many<br> researchers have started hedging their bets in papers, presenting<br> multiple dates for evolutionary events depending on whether mutation is<br> assumed to be fast, slow or somewhere in between.</br></br></br></br></br></br></br></br></br></p></blockquote><p>You know you’re dealing with QUALITY science when scientists start substituting variables for concrete numbers depending upon what they want the results to be. Here is the money quote: <i>“The fact that the clock is so uncertain is very problematic for us,” he<br> says. “It means that the dates we get out of genetics are really quite<br> embarrassingly bad and uncertain.”</br></br></i></p><p>As I have repeatedly predicted, genuine genetic science is eventually going to kill evolution by natural selection deader than phlogiston or the Flat Earth theory.<i> </i></p></div>",
  "content_text": "I always find it amusing when someone who has credentials in a subject, but is at a distinct disadvantage in IQ terms tries to tell me that I don’t know what I’m talking about. You may recall that over the years, I have repeatedly asked various evolutionary True Believers a very simple and straightforward time-based question, to which there absolutely\nmust\nbe an answer, and they not only have been unable to answer it, but frequently tried to deny it was either a) relevant or b) possible, thereby demonstrating that they don’t understand ANYTHING about their own faux-scientific faith. But\nthe speed of evolution, and of the underlying mutations,\nis absolutely central to understanding the theory, as well as determining whether it is total nonsense or not:\nMathematicians keep refining π even though they know it to more than 12 trillion digits; physicists beat themselves up because they cannot pin down the gravitational constant beyond three significant figures. Geneticists, by contrast, are having trouble deciding between one measure of how fast human DNA mutates and another that is half that rate.\nThe rate is key to calibrating the ‘molecular clock’ that puts DNA-based dates on events in evolutionary history. So at an intimate meeting in Leipzig, Germany, on 25–27 February, a dozen speakers puzzled over why calculations of the rate at which sequence changes pop up in human DNA have been so much lower in recent years than previously. They also pondered why the rate seems to fluctuate over time. The meeting drew not only evolutionary geneticists, but also researchers with an interest in cancer and reproductive biology — fields in which mutations have a central role.\n“Mutation is ultimately the source of all heritable diseases and all biological adaptations, so understanding the rate at which mutations evolve is a fundamental question,” says Molly Przeworski, a population geneticist at Columbia University in New York City who attended the Human Mutation Rate Meeting….\nA slower molecular clock worked well to harmonize genetic and\narchaeological estimates for dates of key events in human evolution,\nsuch as migrations out of Africa and around the rest of the world.\nBut calculations using the slow clock gave nonsensical results when\nextended further back in time — positing, for example, that the most\nrecent common ancestor of apes and monkeys could have encountered\ndinosaurs. Reluctant to abandon the older numbers completely, many\nresearchers have started hedging their bets in papers, presenting\nmultiple dates for evolutionary events depending on whether mutation is\nassumed to be fast, slow or somewhere in between.\nYou know you’re dealing with QUALITY science when scientists start substituting variables for concrete numbers depending upon what they want the results to be. Here is the money quote:\n“The fact that the clock is so uncertain is very problematic for us,” he\nsays. “It means that the dates we get out of genetics are really quite\nembarrassingly bad and uncertain.”\nAs I have repeatedly predicted, genuine genetic science is eventually going to kill evolution by natural selection deader than phlogiston or the Flat Earth theory.",
  "tags": [
    "evolution",
    "science"
  ],
  "categories": [],
  "sitemap_lastmod": "2015-03-12T17:58:00+00:00"
}