{
  "url": "https://voxday.net/2015/03/26/fingerprints-on-prize/",
  "scraped_at": "2025-12-16T12:49:50.044915",
  "title": "Fingerprints on the prize",
  "date_display": "March 26, 2015",
  "date_iso": "2015-03-26T10:25:00+00:00",
  "date_from_url": "2015-03-26",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>SciFi Pundit shows that once again, if John Scalzi says it, you can be pretty confident that <a href=\"http://www.scifipundit.com/home/john-scalzi-prognosticator\">it isn’t true</a>:</p><blockquote class=\"tr_bq\"><p> WHATEVER:   John Scalzi announced on his blog today that he had predicted white chocolate M&amp;M’s in his book <i>The Android’s Dream</i>. Unfortunately for Mr. Scalzi, white chocolate M&amp;M’s, called Pirate Pearls, were already on the market in 2006 when his novel about killing aliens by farting (yes, really) was published. Apparently, ripping off Robert A. Heinlein (or Philip K. Dick, or Joe Haldeman, or Gene Roddenberry) isn’t sufficient to give someone powers of prognostication.</p></blockquote><p>That’s actually a good heuristic for any SJW. Did they say it? Are they an SJW? Then it probably isn’t true.  Consider the following statements <a href=\"http://www.staffersbookreview.com/2014/08/breaking-down-the-hugos-careful-like.html\">from the now-defunct Staffer’s Book Review</a>:</p><blockquote class=\"tr_bq\"><p> “Opera Vita Aeterna” by Vox Day, the originator of the Sad Puppy Slate, received far fewer votes than No Award, which took fifth place. “Opera Vita Aeterna” did not place at all. In fact, 698 ballots refused to even recognize “Opera Vita Aeterna” existed.</p></blockquote><p>Actually, 698 ballots had no preference between “Opera Vita Aeterna” and No Award, which means virtually the opposite of what  Mr. Landon is suggesting. All that meant was that having voted for their preferred finalist(s), the voters didn’t bother ranking the rest of them. One could also say, with equal justification, that 234 ballots refused to even recognize that the winner, “Lady Astronaut of Mars”, existed.</p><p>But more importantly, <i>Vox Day was not the originator of the Sad Puppy Slate</i>. Vox Day was not involved in any way with the Sad Puppy Slate; he was not even registered to vote for it. Vox Day was also not the originator of the Sad Puppy 2 Slate last year. Vox Day was not involved in any way with the Sad Puppy 2 Slate, except in that one of his works appeared on it. That’s like saying Jim Butcher is the originator of the Rabid Puppy Slate. It is true, however, that Vox Day is involved with the Sad Puppy 3 Slate and is the originator of the Rabid Puppy Slate.</p><p>Mr. Landon, who now writes for Tor.com, might be forgiven for his ignorantly erroneous ways were it not for that it appears to be his obvious ideological bias that is leading him to assert things that simply are not true. Consider the fine line he tries to invent here:</p><blockquote class=\"tr_bq\"><p> Where Vox Day and Larry Correia intentionally sabotaged the process, authors like Seanan McGuire are finding themselves disproportionately represented due to a consistently adoring fan base. Without the Sad Puppy Slate, McGuire would have been nominated in Best Novel, Best Novella, and Best Novellete. She appears three times on the Best Novella longlist, three times on the Best Novelette long list, once on the Best Short Story longlist, once on the Best Related Work longlist, and once on the Best Fancast longlist. Many of these nominations totals are around 30 ballots. I do not believe McGuire has in any way intentionally manipulated the ballot, but the mere fact that she has fans willing to nominate everything she publishes in a given year, and the fact she’s rather prolific, has created a glaring issue. There simply aren’t enough ballots cast in the nominating process to weed out the obsessive fan. Whether it’s Vox Day and his crazy or Seanan McGuire and her charisma, the Hugo nomination process is flawed.</p></blockquote><p>So, we’re supposed to believe that Seanan McGuire putting herself on the Hugo  longlist nine times in one year is totally unintentional and indicative of nothing more than her charisma, but Larry Correia putting himself on the longlist once in a single category somehow means that Vox Day intentionally sabotaged the process? Now THAT is seriously crazy. It hurts the mind to even try to trace back how much doublethink is required to produce that conclusion.</p><p>But it does raise one question. Where did Seanan McGuire learn this little trick of charismatically inspiring such consistent adoration? Well, you’re not going to believe this, but it brings us right back to McRapey! Consider these nominations from the 2009 Hugo longlist:</p><blockquote class=\"tr_bq\"><p> 54 Best Novel, 09 Best Novella, 24 Short Story, 23 Fan Writer, 31 Related Work, 45 Drama Long</p></blockquote><p>We’re supposed to believe that this is all just the consequence of “a consistently adoring fan base”, right? Unfortunately, there is one little problem with that explanation. Those six appearances on the longlist occurred back when Scalzi had 308,745 pageviews per month. How very strange, then, that his appearances on the longlist abruptly dropped to the following in 2012 despite his site traffic more than tripling in the interval, even hitting its all-time monthly peak at 1,027,644 that year. From the 2012 Hugo longlist.</p><blockquote class=\"tr_bq\"><p> 79 Novella</p></blockquote><p>And keep in mind that we are supposed to believe that all of these Scalzi ballots from 2009 and 2012, none of which amounts to even half of the 183 nominating ballots cast for Larry Correia last year, are somehow more valid or more genuinely indicative of the former’s popularity than the latter’s. And yet, even the 69 ballots cast for me (which, by the way, shows far less SP2 voting in lockstep than the Scalzi-Stross alliance in 2008), were at least 15 more than were cast for Scalzi in any of the six categories in 2009.</p><p>The only conclusion we can reach from all this is that the SJWs don’t believe <i>your </i>votes are valid, simply because <i>you </i>are casting them for <i>the evil people</i>. Don’t ever forget that. But you need not fear, because you have a great defense attorney speaking out on your behalf, namely, Mr. John Scalzi, Esq.</p><blockquote class=\"tr_bq\"><p> I see that Seanan McGuire is getting a fair ration of crap from various quarters because she’s on the ballot a remarkable and record-setting five times, including in the Best Novel category, and twice in Novelette. What I’m seeing heavily implies that McGuire’s on the list because she has an apparently mystical ability to drive hordes of fans to nominate her for everything no matter what. Hey, I have an alternate theory, which goes a little something like this: Seanan McGuire is a very talented writer! Who writes things that people like! Including the people who nominate for the Hugos! Seems the simpler explanation, all things considered.</p><p>Let’s say it again: change the Hugos by nominating, voting and participating, or (much more slowly and far less reliably) actively making your case to the people who are nominating, voting and participating. As a pro tip, explicitly or implicitly disparaging their intelligence, taste or standing to make choices when you try to do that is unlikely to persuade them to decide anything other than that you’re probably an asshole. <br> – John Scalzi, April 5, 2013</br></p></blockquote><p>“Change the Hugos by nominating!” That is a proper battle cry. One can hardly fault Mr. Correia for taking to heart the advice of such a distinguished and oft-nominated science fiction luminary. Let’s say it again indeed.</p></div>",
  "content_text": "SciFi Pundit shows that once again, if John Scalzi says it, you can be pretty confident that\nit isn’t true\n:\nWHATEVER:   John Scalzi announced on his blog today that he had predicted white chocolate M&M’s in his book\nThe Android’s Dream\n. Unfortunately for Mr. Scalzi, white chocolate M&M’s, called Pirate Pearls, were already on the market in 2006 when his novel about killing aliens by farting (yes, really) was published. Apparently, ripping off Robert A. Heinlein (or Philip K. Dick, or Joe Haldeman, or Gene Roddenberry) isn’t sufficient to give someone powers of prognostication.\nThat’s actually a good heuristic for any SJW. Did they say it? Are they an SJW? Then it probably isn’t true.  Consider the following statements\nfrom the now-defunct Staffer’s Book Review\n:\n“Opera Vita Aeterna” by Vox Day, the originator of the Sad Puppy Slate, received far fewer votes than No Award, which took fifth place. “Opera Vita Aeterna” did not place at all. In fact, 698 ballots refused to even recognize “Opera Vita Aeterna” existed.\nActually, 698 ballots had no preference between “Opera Vita Aeterna” and No Award, which means virtually the opposite of what  Mr. Landon is suggesting. All that meant was that having voted for their preferred finalist(s), the voters didn’t bother ranking the rest of them. One could also say, with equal justification, that 234 ballots refused to even recognize that the winner, “Lady Astronaut of Mars”, existed.\nBut more importantly,\nVox Day was not the originator of the Sad Puppy Slate\n. Vox Day was not involved in any way with the Sad Puppy Slate; he was not even registered to vote for it. Vox Day was also not the originator of the Sad Puppy 2 Slate last year. Vox Day was not involved in any way with the Sad Puppy 2 Slate, except in that one of his works appeared on it. That’s like saying Jim Butcher is the originator of the Rabid Puppy Slate. It is true, however, that Vox Day is involved with the Sad Puppy 3 Slate and is the originator of the Rabid Puppy Slate.\nMr. Landon, who now writes for Tor.com, might be forgiven for his ignorantly erroneous ways were it not for that it appears to be his obvious ideological bias that is leading him to assert things that simply are not true. Consider the fine line he tries to invent here:\nWhere Vox Day and Larry Correia intentionally sabotaged the process, authors like Seanan McGuire are finding themselves disproportionately represented due to a consistently adoring fan base. Without the Sad Puppy Slate, McGuire would have been nominated in Best Novel, Best Novella, and Best Novellete. She appears three times on the Best Novella longlist, three times on the Best Novelette long list, once on the Best Short Story longlist, once on the Best Related Work longlist, and once on the Best Fancast longlist. Many of these nominations totals are around 30 ballots. I do not believe McGuire has in any way intentionally manipulated the ballot, but the mere fact that she has fans willing to nominate everything she publishes in a given year, and the fact she’s rather prolific, has created a glaring issue. There simply aren’t enough ballots cast in the nominating process to weed out the obsessive fan. Whether it’s Vox Day and his crazy or Seanan McGuire and her charisma, the Hugo nomination process is flawed.\nSo, we’re supposed to believe that Seanan McGuire putting herself on the Hugo  longlist nine times in one year is totally unintentional and indicative of nothing more than her charisma, but Larry Correia putting himself on the longlist once in a single category somehow means that Vox Day intentionally sabotaged the process? Now THAT is seriously crazy. It hurts the mind to even try to trace back how much doublethink is required to produce that conclusion.\nBut it does raise one question. Where did Seanan McGuire learn this little trick of charismatically inspiring such consistent adoration? Well, you’re not going to believe this, but it brings us right back to McRapey! Consider these nominations from the 2009 Hugo longlist:\n54 Best Novel, 09 Best Novella, 24 Short Story, 23 Fan Writer, 31 Related Work, 45 Drama Long\nWe’re supposed to believe that this is all just the consequence of “a consistently adoring fan base”, right? Unfortunately, there is one little problem with that explanation. Those six appearances on the longlist occurred back when Scalzi had 308,745 pageviews per month. How very strange, then, that his appearances on the longlist abruptly dropped to the following in 2012 despite his site traffic more than tripling in the interval, even hitting its all-time monthly peak at 1,027,644 that year. From the 2012 Hugo longlist.\n79 Novella\nAnd keep in mind that we are supposed to believe that all of these Scalzi ballots from 2009 and 2012, none of which amounts to even half of the 183 nominating ballots cast for Larry Correia last year, are somehow more valid or more genuinely indicative of the former’s popularity than the latter’s. And yet, even the 69 ballots cast for me (which, by the way, shows far less SP2 voting in lockstep than the Scalzi-Stross alliance in 2008), were at least 15 more than were cast for Scalzi in any of the six categories in 2009.\nThe only conclusion we can reach from all this is that the SJWs don’t believe\nyour\nvotes are valid, simply because\nyou\nare casting them for\nthe evil people\n. Don’t ever forget that. But you need not fear, because you have a great defense attorney speaking out on your behalf, namely, Mr. John Scalzi, Esq.\nI see that Seanan McGuire is getting a fair ration of crap from various quarters because she’s on the ballot a remarkable and record-setting five times, including in the Best Novel category, and twice in Novelette. What I’m seeing heavily implies that McGuire’s on the list because she has an apparently mystical ability to drive hordes of fans to nominate her for everything no matter what. Hey, I have an alternate theory, which goes a little something like this: Seanan McGuire is a very talented writer! Who writes things that people like! Including the people who nominate for the Hugos! Seems the simpler explanation, all things considered.\nLet’s say it again: change the Hugos by nominating, voting and participating, or (much more slowly and far less reliably) actively making your case to the people who are nominating, voting and participating. As a pro tip, explicitly or implicitly disparaging their intelligence, taste or standing to make choices when you try to do that is unlikely to persuade them to decide anything other than that you’re probably an asshole.\n– John Scalzi, April 5, 2013\n“Change the Hugos by nominating!” That is a proper battle cry. One can hardly fault Mr. Correia for taking to heart the advice of such a distinguished and oft-nominated science fiction luminary. Let’s say it again indeed.",
  "tags": [
    "Hugo Award",
    "McRapey"
  ],
  "categories": [],
  "sitemap_lastmod": "2015-03-26T10:25:00+00:00"
}