{
  "url": "https://voxday.net/2015/03/19/game-design-at-castalia/",
  "scraped_at": "2025-12-16T12:49:06.718784",
  "title": "Game design at Castalia",
  "date_display": "March 19, 2015",
  "date_iso": "2015-03-19T12:46:00+00:00",
  "date_from_url": "2015-03-19",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>Over the years, I’ve noticed that most of the readers here are not terribly interested in the nuts and bolts of game design. Which is fine, it’s a fairly esoteric topic that tends to require both extensive reading and extensive game-playing, which considerably limits the potential appeal of such discussions. However, those few who are interested in it tend to be very interested indeed.</p><p>So, I’m going to be doing the occasional post over at the Castalia House blog on some of my thoughts on a very particular game design for a tactical wargame on which I am working as part of the First Sword Kickstarter, about which you can read more in the Game Dev letter. And you can also read about <a href=\"http://www.castaliahouse.com/principles-of-tactical-design/\">my initial thoughts</a> on doing something new with the design, which I think could potentially be as significant for tactical wargaming in the long term as the ASL morale model has proven to be.</p><blockquote class=\"tr_bq\"><p> If you subscribe to the Game Dev newsletter, you’re aware that Alpenwolf has a new partner and I’m going to be writing the new rules for a certain SF infantry combat game. Without getting into any details concerning that, I want to discuss two of the primary principles I plan on utilizing as the basis for the core gameplay. I was recently editing a book by Martin van Creveld that we’ll be publishing in another week or so, <i>A History of Strategy</i>, and one thing that occurred to me while I was working on it and reading his <i>Technology and War</i>, was how the great stress that Clausewitz placed on friction, and in particular, on information in war, was seldom modeled at the tactical level in wargaming. Clausewitz wrote:<br> <i><br> A great part of the information in war is contradictory, a still greater part is false, and by far the greatest part is somewhat doubtful. This requires that an officer possess a certain power of discrimination, which only knowledge of men and things and good judgment can give. The law of probability must be his guide. This is difficult even in the pre-war plans, which are made in the study and outside the actual sphere of war. It is enormously more difficult when, in the turmoil of war, one report follows hard upon another. It is fortunate if these reports, in contradicting each other, produce a sort of balance and thus demand further examination. It is much worse for the inexperienced when chance does not render him this service, but one report supports another, confirms it, magnifies it, continually paints with new colors, until urgent necessity forces from him a decision which will soon be disclosed as folly, all these reports having been lies, exaggerations, and errors.</br></i></br></p></blockquote><p>Read more about my concept of a Tactical Uncertainty Principle over there, if it happens to <i>strike </i>you as interesting.</p></div>",
  "content_text": "Over the years, I’ve noticed that most of the readers here are not terribly interested in the nuts and bolts of game design. Which is fine, it’s a fairly esoteric topic that tends to require both extensive reading and extensive game-playing, which considerably limits the potential appeal of such discussions. However, those few who are interested in it tend to be very interested indeed.\nSo, I’m going to be doing the occasional post over at the Castalia House blog on some of my thoughts on a very particular game design for a tactical wargame on which I am working as part of the First Sword Kickstarter, about which you can read more in the Game Dev letter. And you can also read about\nmy initial thoughts\non doing something new with the design, which I think could potentially be as significant for tactical wargaming in the long term as the ASL morale model has proven to be.\nIf you subscribe to the Game Dev newsletter, you’re aware that Alpenwolf has a new partner and I’m going to be writing the new rules for a certain SF infantry combat game. Without getting into any details concerning that, I want to discuss two of the primary principles I plan on utilizing as the basis for the core gameplay. I was recently editing a book by Martin van Creveld that we’ll be publishing in another week or so,\nA History of Strategy\n, and one thing that occurred to me while I was working on it and reading his\nTechnology and War\n, was how the great stress that Clausewitz placed on friction, and in particular, on information in war, was seldom modeled at the tactical level in wargaming. Clausewitz wrote:\nA great part of the information in war is contradictory, a still greater part is false, and by far the greatest part is somewhat doubtful. This requires that an officer possess a certain power of discrimination, which only knowledge of men and things and good judgment can give. The law of probability must be his guide. This is difficult even in the pre-war plans, which are made in the study and outside the actual sphere of war. It is enormously more difficult when, in the turmoil of war, one report follows hard upon another. It is fortunate if these reports, in contradicting each other, produce a sort of balance and thus demand further examination. It is much worse for the inexperienced when chance does not render him this service, but one report supports another, confirms it, magnifies it, continually paints with new colors, until urgent necessity forces from him a decision which will soon be disclosed as folly, all these reports having been lies, exaggerations, and errors.\nRead more about my concept of a Tactical Uncertainty Principle over there, if it happens to\nstrike\nyou as interesting.",
  "tags": [
    "games"
  ],
  "categories": [],
  "sitemap_lastmod": "2015-03-19T12:46:00+00:00"
}