{
  "url": "https://voxday.net/2015/03/11/hes-on-manic-swing-again/",
  "scraped_at": "2025-12-16T12:48:13.718988",
  "title": "He’s on a manic swing again",
  "date_display": "March 11, 2015",
  "date_iso": "2015-03-11T09:15:00+00:00",
  "date_from_url": "2015-03-11",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>I always enjoy McRapey’s manic phases. That’s when he produces his most amusing quotes and you get a clear glimpse at how messed up and insecure he is. He’s apparently been feeling his oats lately, so he decided another shot at #GamerGate was in order, which promptly led to him feeling insecure after a number of #GamerGaters wondered who the hell he was:</p><blockquote class=\"tr_bq\"><p> 4 NYT Best sellers. 3 Hugos. 3 TV series currently in development. Books in 20 languages. CLEARLY, public opinions have hampered my career.</p><p>(I should note that two of those Hugos were awarded to me, essentially, FOR having opinions in public. So.)</p><p>GamerGater: YOU ARE TERRIBLE FOR TELLING ME NOT TO READ YOUR BOOKS AND I WILL NEVER READ THEM NOW Me: Ate a lot of lead paint as a kid, huh?</p><p>Lots of GGers smugly asking who I am because they’ve never heard of me. Of course not, you’d have to be literate for that, lads.</p></blockquote><p>It’s amusing how Johnny can’t open his mouth without trying to spin the narrative. I mean, full credit for admitting that two of the Hugos were political in nature, but we all know that all THREE of them actually were. There is not a single person on the planet who genuinely believes <i>Redshirts </i>was the best science fiction novel of 2013 in any sense of the term. Including McRapey himself.</p><p>And the idea that anyone who is literate has heard of John Scalzi is hilarious. I live in Europe. I know many highly literate people. Absolutely NONE of them have ever heard of him. We have over 100 players at the adult level. Ender has a game this weekend, so between that and practice next week, I should see everyone. I’ll report back on how many of these literate and multilingual Europeans have ever heard of “the science fiction writer John Scalzi”.</p><p>It’s also funny that Scalzi thinks he’s big time because he can sell up to 150k books per shot with Tor pushing him as hard as it can. He’s trying to break into the game industry, where games that have 17 million active players are still practically unknown to the game journalists as well as everyone who doesn’t play in that particular genre.</p><p>One more amusing note. Back in 2012, someone named CDaniell claimed I was jealous of Scalzi. His words are even funnier today, now that we know what we know about SF’s biggest con artist.</p><blockquote class=\"tr_bq\"><p> I did have a chance to read up a bit on Mr. Scalzi. So: The SFWA presidency, the Hugo nominations, the ascendancy to the the New York Times best seller list, the 50,000 visitors-a-day blog and a novel being adapted to film with Wolfgang Petersen attached to direct? Goodness. Talk about an Alpha who can seriously put the bread on the table. </p></blockquote><p>The film was canceled, the 50,000 visitors a day was proven to be a lie, the fan writer nominations are now an award and a Best Novel award that is a historic embarrassment, and the NYT bestsellers show every sign of being nothing more than his publisher gaming the list.</p></div>",
  "content_text": "I always enjoy McRapey’s manic phases. That’s when he produces his most amusing quotes and you get a clear glimpse at how messed up and insecure he is. He’s apparently been feeling his oats lately, so he decided another shot at #GamerGate was in order, which promptly led to him feeling insecure after a number of #GamerGaters wondered who the hell he was:\n4 NYT Best sellers. 3 Hugos. 3 TV series currently in development. Books in 20 languages. CLEARLY, public opinions have hampered my career.\n(I should note that two of those Hugos were awarded to me, essentially, FOR having opinions in public. So.)\nGamerGater: YOU ARE TERRIBLE FOR TELLING ME NOT TO READ YOUR BOOKS AND I WILL NEVER READ THEM NOW Me: Ate a lot of lead paint as a kid, huh?\nLots of GGers smugly asking who I am because they’ve never heard of me. Of course not, you’d have to be literate for that, lads.\nIt’s amusing how Johnny can’t open his mouth without trying to spin the narrative. I mean, full credit for admitting that two of the Hugos were political in nature, but we all know that all THREE of them actually were. There is not a single person on the planet who genuinely believes\nRedshirts\nwas the best science fiction novel of 2013 in any sense of the term. Including McRapey himself.\nAnd the idea that anyone who is literate has heard of John Scalzi is hilarious. I live in Europe. I know many highly literate people. Absolutely NONE of them have ever heard of him. We have over 100 players at the adult level. Ender has a game this weekend, so between that and practice next week, I should see everyone. I’ll report back on how many of these literate and multilingual Europeans have ever heard of “the science fiction writer John Scalzi”.\nIt’s also funny that Scalzi thinks he’s big time because he can sell up to 150k books per shot with Tor pushing him as hard as it can. He’s trying to break into the game industry, where games that have 17 million active players are still practically unknown to the game journalists as well as everyone who doesn’t play in that particular genre.\nOne more amusing note. Back in 2012, someone named CDaniell claimed I was jealous of Scalzi. His words are even funnier today, now that we know what we know about SF’s biggest con artist.\nI did have a chance to read up a bit on Mr. Scalzi. So: The SFWA presidency, the Hugo nominations, the ascendancy to the the New York Times best seller list, the 50,000 visitors-a-day blog and a novel being adapted to film with Wolfgang Petersen attached to direct? Goodness. Talk about an Alpha who can seriously put the bread on the table.\nThe film was canceled, the 50,000 visitors a day was proven to be a lie, the fan writer nominations are now an award and a Best Novel award that is a historic embarrassment, and the NYT bestsellers show every sign of being nothing more than his publisher gaming the list.",
  "tags": [
    "#GamerGate",
    "McRapey"
  ],
  "categories": [],
  "sitemap_lastmod": "2015-03-11T09:15:00+00:00"
}