{
  "url": "https://voxday.net/2015/03/24/interview-with-vox-day-2/",
  "scraped_at": "2025-12-16T12:49:38.814735",
  "title": "Interview with Vox Day",
  "date_display": "March 24, 2015",
  "date_iso": "2015-03-24T12:18:00+00:00",
  "date_from_url": "2015-03-24",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>Sam Roberts at <a href=\"http://www.reaxxion.com/6589/game-designer-vox-day-speaks-on-women-in-gaming-his-upcoming-game-and-more\">Reaxxion interviewed me</a> about the game industry, the SJW attack on it, and our upcoming plans for First Sword:</p><blockquote class=\"tr_bq\"><p> SR: Many commentators, at our site and elsewhere, have noticed the sudden outbreak of prudishness in the gaming industry. We saw this with PAX and its ban on booth babes, even to the point of specifying a minimum length for girl’s skirts. Even Mortal Kombat, the franchise that established itself in the 1990’s through its willingness to break all the rules, is moving to “more realistic” characters with smaller breasts and thicker waists. What do you think has changed in the gaming industry in the past 20 years that’s made it so much less able to resist moral scolds?</p><p>VD: The most important change is that game development no longer belongs to the mavericks. When we started Fenris Wolf in 1993, literally everyone thought we were crazy. We were throwing away good jobs and wasting our educations to do what people considered to be the equivalent of playing with digital Lincoln Logs. Now that games are widely understood to be big business, many of the jobs pay decent salaries, and you can get degrees in “game development” and “game design,” you have considerably more risk-intolerant, conflict-avoidant people entering the industry.</p><p>Twenty years ago, the average developer would have laughed his ass off at the idea that he should design or develop anything other than whatever the hell he wanted to do. These days, there are a fair number of bed-wetters in game development who are terrified at the idea that someone, somewhere, might take offense at something in one of their games. And then, of course, you’ve also got SJWs trying to stick their noses into the industry in order to change it, just as they did in comics and science fiction &amp; fantasy fiction.</p></blockquote><div class=\"separator\" style=\"clear: both; text-align: center;\"> <a href=\"http://www.reaxxion.com/wp-content/uploads/2015/03/shoot-300x532.jpg\" imageanchor=\"1\" style=\"clear: left; float: left; margin-bottom: 1em; margin-right: 1em;\"><img border=\"0\" decoding=\"async\" fetchpriority=\"high\" height=\"320\" src=\"http://www.reaxxion.com/wp-content/uploads/2015/03/shoot-300x532.jpg\" width=\"180\"/></a></div><p>You’ll definitely want to check out the screenshots of the 3DV engine in action. Be sure to click on the image of the High Elven archers. 3DV is visually spectacular and is intended to do for miniature gaming what VASSAL did for board-and-counter games. In addition to various other topics addressed, you can also see our response to the SJW demands for more women in games, beginning with the introduction to Morwyn Shadowsong, a female elf gladiator who is the face of <i>First Sword</i>, the fantasy gladiator miniatures game.</p><p>It probably won’t take a genius to put two and two together and realize that the Tactical Uncertainty model I’m developing, which has been <a href=\"http://www.castaliahouse.com/tactical-uncertainty-principle-step-one/\">discussed in some detail over at Castalia</a>, is intended for the third edition of <i>Striker</i> that Marc Miller has asked me to develop. The rules will be developed for use in 3DV and on the tabletop alike; the challenge is how to make something that works almost automatically in the former can be translated to the latter. With regards to some of the other games mentioned, we will have some exciting new announcements soon.</p></div>",
  "content_text": "Sam Roberts at\nReaxxion interviewed me\nabout the game industry, the SJW attack on it, and our upcoming plans for First Sword:\nSR: Many commentators, at our site and elsewhere, have noticed the sudden outbreak of prudishness in the gaming industry. We saw this with PAX and its ban on booth babes, even to the point of specifying a minimum length for girl’s skirts. Even Mortal Kombat, the franchise that established itself in the 1990’s through its willingness to break all the rules, is moving to “more realistic” characters with smaller breasts and thicker waists. What do you think has changed in the gaming industry in the past 20 years that’s made it so much less able to resist moral scolds?\nVD: The most important change is that game development no longer belongs to the mavericks. When we started Fenris Wolf in 1993, literally everyone thought we were crazy. We were throwing away good jobs and wasting our educations to do what people considered to be the equivalent of playing with digital Lincoln Logs. Now that games are widely understood to be big business, many of the jobs pay decent salaries, and you can get degrees in “game development” and “game design,” you have considerably more risk-intolerant, conflict-avoidant people entering the industry.\nTwenty years ago, the average developer would have laughed his ass off at the idea that he should design or develop anything other than whatever the hell he wanted to do. These days, there are a fair number of bed-wetters in game development who are terrified at the idea that someone, somewhere, might take offense at something in one of their games. And then, of course, you’ve also got SJWs trying to stick their noses into the industry in order to change it, just as they did in comics and science fiction & fantasy fiction.\nYou’ll definitely want to check out the screenshots of the 3DV engine in action. Be sure to click on the image of the High Elven archers. 3DV is visually spectacular and is intended to do for miniature gaming what VASSAL did for board-and-counter games. In addition to various other topics addressed, you can also see our response to the SJW demands for more women in games, beginning with the introduction to Morwyn Shadowsong, a female elf gladiator who is the face of\nFirst Sword\n, the fantasy gladiator miniatures game.\nIt probably won’t take a genius to put two and two together and realize that the Tactical Uncertainty model I’m developing, which has been\ndiscussed in some detail over at Castalia\n, is intended for the third edition of\nStriker\nthat Marc Miller has asked me to develop. The rules will be developed for use in 3DV and on the tabletop alike; the challenge is how to make something that works almost automatically in the former can be translated to the latter. With regards to some of the other games mentioned, we will have some exciting new announcements soon.",
  "tags": [
    "#GamerGate",
    "games",
    "media"
  ],
  "categories": [],
  "sitemap_lastmod": "2015-03-24T12:18:00+00:00"
}