{
  "url": "https://voxday.net/2015/03/30/irans-nukes-israeli-perspective/",
  "scraped_at": "2025-12-16T12:50:20.589190",
  "title": "Iran’s nukes: an Israeli perspective",
  "date_display": "March 30, 2015",
  "date_iso": "2015-03-30T09:11:00+00:00",
  "date_from_url": "2015-03-30",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>Last week, a number of people <a href=\"http://www.milobookclub.com/2015/03/27/a-shot-across-bow/\">were expressing their opinions</a> concerning the prospects that Iran would obtain nuclear weapons as a result of the Lausanne talks and what this meant for the USA, Israel, and the Middle East. Most of those opinions, including mine, were largely uninformed, but then it occurred to me that Castalia House’s newest author, Martin van Creveld, was someone who has spent a good deal of time thinking about this very subject, and as Israel’s leading military historian, he is in a position to know considerably more about the situation than anyone else here.</p><p>Later today we will be announcing a second Castalia House book by Dr. van Creveld that I cannot recommend highly enough. Perhaps reading this response to my question about his perspective on the likely consequences of the prospective Lausanne treaty will help you understand why.</p><blockquote class=\"tr_bq\"><p> “More may be better” was the title of an article published back in 1981 by the redoubtable political scientist Kenneth Waltz. Going against the prevailing wisdom, Waltz argued that nuclear proliferation might not be all bad. Nuclear weapons, he wrote, had prevented the US and the USSR from going to war against each other; as, by all historical logic since the days of Athens and Sparta in the fifth century B.C, they should have done. Instead they circled each other like dogs, occasionally barking and baring their teeth but never actually biting. Such was the fear the weapons inspired that other nuclear countries would probably follow suit.</p><p>To quote Winston Churchill, peace might be the sturdy child of terror.<br> Since then over thirty years have passed. Though Waltz himself died in 2013, his light goes marching on. At the time he published his article there were just five nuclear countries (the US, the USSR, Britain, France, and China) plus one, Israel, which had the bomb but put anybody who dared say so in prison. Since then three (India, Pakistan, North Korea) have been added, raising the total to nine. Yet on no occasion did any of these states fight a major war against any other major, read nuclear, power.</br></p><p>And how about Iran? First, note that no country has taken nearly as long as Iran did to develop its nuclear program. Started during the 1970s under the Shah, suspended during the 1980s as Iranians were fighting Saddam Hussein (who invaded Iran), and renewed in the early 1990s, that program has still not borne fruit. This suggests that, when the Iranians say, as they repeatedly have, that they do not want to build a bomb they are sincere, at least up to a point. All they want is the infrastructure that will enable them to build it quickly should the need arise—a desire they have in common with quite some other countries such as Sweden, Australia, and Japan.</p><p>Second, the real purpose of the Iranian program, and any eventual bomb that may result from it, is to deter a possible attack by the U.S. Look at the record; one never knows what America’s next president is going to do. With another Clinton, who attacked Serbia, and another Bush, who attacked Afghanistan and Iraq, in the White House a distinct possibility, caution is advised. The Mullahs have no desire to share the fate of Slobodan Milosevic, Saddam Hussein, and Muammar Khadafy.</p><p>The latter’s fate in particular gives reason for thought. In 2002-3, coming under Western pressure, Khadafy gave up his nuclear program.  As his reward, no sooner did the West see an opportunity in 2011 than it stabbed him in the back, waged war on him, overthrew him, and killed him. Leaving Libya in a mess from which it may never recover.</p><p>Third, Israel is in no danger. Alone among all the countries of the Middle East, Israel has what it takes to deter Iran and, if necessary, wage a nuclear war against it. What such a war might look like was described in some detail by Anthony Cordesman, an American political scientist a former member of the National Security Council. His conclusion? The difference in size notwithstanding, the outcome would be to wipe Iran, but not Israel, off the map.</p><p>Netanyahu has Iran in his head and effectively used it to win the elections. Yet truth to say, no Iranian leader has ever directly threatened Israel. To be sure, neither Iran’s presidents nor the Mullahs like the Zionist Entity. They do not stand to attention when Hatikvah is played. They have even had the chutzpah to deny the Holocaust. Yet all they have said is that, if Israel attacked them, they would respond in kind. Also that “rotten” Israel would end up by collapsing under its own weight. All this serves to divert attention away from their real purpose. That purpose, as I just said, is to deter the U.S. And to draw as much support in the Moslem world as verbal attacks on Israel always do.</p><p>Finally, morality. Are the Iranians really as bad as some people claim? Taking 1981 as our starting point, we find that in the three and a half decades since then the U.S has waged war first against (or in) Grenada; then Panama; then Iraq; then Serbia (in Bosnia); then Serbia again (in Kosovo); then Afghanistan; then Iraq again; then Libya. In some of these praiseworthy enterprises it was supported by its allies, the Netherlands included.</p><p>The Iranians are not angels—far from it. They have meddled in Iraq, Syria, Lebanon and Saudi Arabia, as they still do. They have also assisted terrorist organizations such as Hezbollah and Hamas. But everything is relative. They have not waged large-scale warfare against any other country. Let alone bombed it or invaded it.</p><p>And that, in the final analysis, is all that matters.</p></blockquote><p>Now, Martin van Creveld is the very opposite of an innocent on this subject. He knows more about war, the history of war, and the strategy and tactics of war than nearly anyone on the planet. And so when a world-famous military expert, who lives in the heart of the land that is most threatened by Iranian weapons, contradicts the neocons living in the USA who have been beating the war drum for a decade and claiming that the mad mullahs are simply slavering to hurl nuclear-tipped missiles at Israel the moment they have them, I suggest that it is wise to listen to the former, not the latter.</p></div>",
  "content_text": "Last week, a number of people\nwere expressing their opinions\nconcerning the prospects that Iran would obtain nuclear weapons as a result of the Lausanne talks and what this meant for the USA, Israel, and the Middle East. Most of those opinions, including mine, were largely uninformed, but then it occurred to me that Castalia House’s newest author, Martin van Creveld, was someone who has spent a good deal of time thinking about this very subject, and as Israel’s leading military historian, he is in a position to know considerably more about the situation than anyone else here.\nLater today we will be announcing a second Castalia House book by Dr. van Creveld that I cannot recommend highly enough. Perhaps reading this response to my question about his perspective on the likely consequences of the prospective Lausanne treaty will help you understand why.\n“More may be better” was the title of an article published back in 1981 by the redoubtable political scientist Kenneth Waltz. Going against the prevailing wisdom, Waltz argued that nuclear proliferation might not be all bad. Nuclear weapons, he wrote, had prevented the US and the USSR from going to war against each other; as, by all historical logic since the days of Athens and Sparta in the fifth century B.C, they should have done. Instead they circled each other like dogs, occasionally barking and baring their teeth but never actually biting. Such was the fear the weapons inspired that other nuclear countries would probably follow suit.\nTo quote Winston Churchill, peace might be the sturdy child of terror.\nSince then over thirty years have passed. Though Waltz himself died in 2013, his light goes marching on. At the time he published his article there were just five nuclear countries (the US, the USSR, Britain, France, and China) plus one, Israel, which had the bomb but put anybody who dared say so in prison. Since then three (India, Pakistan, North Korea) have been added, raising the total to nine. Yet on no occasion did any of these states fight a major war against any other major, read nuclear, power.\nAnd how about Iran? First, note that no country has taken nearly as long as Iran did to develop its nuclear program. Started during the 1970s under the Shah, suspended during the 1980s as Iranians were fighting Saddam Hussein (who invaded Iran), and renewed in the early 1990s, that program has still not borne fruit. This suggests that, when the Iranians say, as they repeatedly have, that they do not want to build a bomb they are sincere, at least up to a point. All they want is the infrastructure that will enable them to build it quickly should the need arise—a desire they have in common with quite some other countries such as Sweden, Australia, and Japan.\nSecond, the real purpose of the Iranian program, and any eventual bomb that may result from it, is to deter a possible attack by the U.S. Look at the record; one never knows what America’s next president is going to do. With another Clinton, who attacked Serbia, and another Bush, who attacked Afghanistan and Iraq, in the White House a distinct possibility, caution is advised. The Mullahs have no desire to share the fate of Slobodan Milosevic, Saddam Hussein, and Muammar Khadafy.\nThe latter’s fate in particular gives reason for thought. In 2002-3, coming under Western pressure, Khadafy gave up his nuclear program.  As his reward, no sooner did the West see an opportunity in 2011 than it stabbed him in the back, waged war on him, overthrew him, and killed him. Leaving Libya in a mess from which it may never recover.\nThird, Israel is in no danger. Alone among all the countries of the Middle East, Israel has what it takes to deter Iran and, if necessary, wage a nuclear war against it. What such a war might look like was described in some detail by Anthony Cordesman, an American political scientist a former member of the National Security Council. His conclusion? The difference in size notwithstanding, the outcome would be to wipe Iran, but not Israel, off the map.\nNetanyahu has Iran in his head and effectively used it to win the elections. Yet truth to say, no Iranian leader has ever directly threatened Israel. To be sure, neither Iran’s presidents nor the Mullahs like the Zionist Entity. They do not stand to attention when Hatikvah is played. They have even had the chutzpah to deny the Holocaust. Yet all they have said is that, if Israel attacked them, they would respond in kind. Also that “rotten” Israel would end up by collapsing under its own weight. All this serves to divert attention away from their real purpose. That purpose, as I just said, is to deter the U.S. And to draw as much support in the Moslem world as verbal attacks on Israel always do.\nFinally, morality. Are the Iranians really as bad as some people claim? Taking 1981 as our starting point, we find that in the three and a half decades since then the U.S has waged war first against (or in) Grenada; then Panama; then Iraq; then Serbia (in Bosnia); then Serbia again (in Kosovo); then Afghanistan; then Iraq again; then Libya. In some of these praiseworthy enterprises it was supported by its allies, the Netherlands included.\nThe Iranians are not angels—far from it. They have meddled in Iraq, Syria, Lebanon and Saudi Arabia, as they still do. They have also assisted terrorist organizations such as Hezbollah and Hamas. But everything is relative. They have not waged large-scale warfare against any other country. Let alone bombed it or invaded it.\nAnd that, in the final analysis, is all that matters.\nNow, Martin van Creveld is the very opposite of an innocent on this subject. He knows more about war, the history of war, and the strategy and tactics of war than nearly anyone on the planet. And so when a world-famous military expert, who lives in the heart of the land that is most threatened by Iranian weapons, contradicts the neocons living in the USA who have been beating the war drum for a decade and claiming that the mad mullahs are simply slavering to hurl nuclear-tipped missiles at Israel the moment they have them, I suggest that it is wise to listen to the former, not the latter.",
  "tags": [
    "war",
    "Zion"
  ],
  "categories": [],
  "sitemap_lastmod": "2015-03-30T08:11:00+00:00"
}