{
  "url": "https://voxday.net/2015/03/10/it-just-makes-sense/",
  "scraped_at": "2025-12-16T12:48:06.364071",
  "title": "“It just makes sense”",
  "date_display": "March 10, 2015",
  "date_iso": "2015-03-10T08:55:00+00:00",
  "date_from_url": "2015-03-10",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>Parody is the homage <a href=\"http://www.independent.co.uk/arts-entertainment/books/news/star-wars-gets-first-official-lesbian-character-10096296.html\">rhetoric pays to dialectic</a>:</p><blockquote class=\"tr_bq\"><p> Star Wars is getting its first lesbian character. Paul S Kemp has revealed that he is adding the mystery woman to his upcoming novel Lords of the Sith, the next instalment in the official sci-fi canon due out on 28 April.</p><p>Little is known about her, but “nerd news” blog Big Shiny Robot has dropped a few hints about what fans can expect.</p><p>“Moff Mors is an Imperial who has made some very serious mistakes, but she is an incredibly capable leader and spends much of the book working hard to prevent absolute failure,” a recent post reads. “She also happens to be a lesbian.”</p><p>Shelly Shapiro, editor of the Star Wars books, explaining that including a lesbian character “just makes sense”.</p><p>“There’s a lot of diversity…there should be diversity in Star Wars,” she said. “You have all these different species and it would be silly to not also recognise that there’s a lot of diversity in humans.</p></blockquote><p>And yet, we won’t find any Muslims in Star Wars despite there being a billion of them. We won’t find any Christians in Star Wars despite there being nearly two billion of them. How many Chinese, serial killers, and Green Bay Packers fans will we find? But More Muff (how very clever) just <i>happens </i>to be a lesbian.</p><p>It certainly didn’t take Disney long to gay it up. I’m very glad that I lost all interest in Star Wars about ten minutes into <i>The Phantom Menace</i>. If there is one thing you can count on, it is that once SJWs get involved in something, it’s just a matter of time before it is ruined. At this rate, they’ll have Han Solo transitioning in the second new film and we’ll learn that Luke and Leia got married despite knowing they were brother and sister.</p></div>",
  "content_text": "Parody is the homage\nrhetoric pays to dialectic\n:\nStar Wars is getting its first lesbian character. Paul S Kemp has revealed that he is adding the mystery woman to his upcoming novel Lords of the Sith, the next instalment in the official sci-fi canon due out on 28 April.\nLittle is known about her, but “nerd news” blog Big Shiny Robot has dropped a few hints about what fans can expect.\n“Moff Mors is an Imperial who has made some very serious mistakes, but she is an incredibly capable leader and spends much of the book working hard to prevent absolute failure,” a recent post reads. “She also happens to be a lesbian.”\nShelly Shapiro, editor of the Star Wars books, explaining that including a lesbian character “just makes sense”.\n“There’s a lot of diversity…there should be diversity in Star Wars,” she said. “You have all these different species and it would be silly to not also recognise that there’s a lot of diversity in humans.\nAnd yet, we won’t find any Muslims in Star Wars despite there being a billion of them. We won’t find any Christians in Star Wars despite there being nearly two billion of them. How many Chinese, serial killers, and Green Bay Packers fans will we find? But More Muff (how very clever) just\nhappens\nto be a lesbian.\nIt certainly didn’t take Disney long to gay it up. I’m very glad that I lost all interest in Star Wars about ten minutes into\nThe Phantom Menace\n. If there is one thing you can count on, it is that once SJWs get involved in something, it’s just a matter of time before it is ruined. At this rate, they’ll have Han Solo transitioning in the second new film and we’ll learn that Luke and Leia got married despite knowing they were brother and sister.",
  "tags": [
    "freakshow",
    "Pink SF"
  ],
  "categories": [],
  "sitemap_lastmod": "2015-03-10T08:55:00+00:00"
}