{
  "url": "https://voxday.net/2015/03/31/john-c-wright-contemplates-meltdown/",
  "scraped_at": "2025-12-16T12:50:33.460165",
  "title": "John C. Wright contemplates the meltdown",
  "date_display": "March 31, 2015",
  "date_iso": "2015-03-31T19:00:00+00:00",
  "date_from_url": "2015-03-31",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>Tor and Castalia House author John C. Wright calmly contemplates the Toad of Tor’s public meltdown, in which she insults literally dozens of excellent and well-regarded science fiction authors and <a href=\"http://www.scifiwright.com/2015/03/tor-editor-libels-tor-author/\">libels at least one notable Tor author</a>:</p><blockquote class=\"tr_bq\"><p> If my accustomed Vulcan calm could be perturbed, no doubt it would be by the allegations Teresa Nielsen-Hayden, late of Tor Books, is leveling against myself and the other members of the Evil Legion of Evil Authors. But since I am imperturbable, I merely raise one eyebrow and wonder on what evidence, or one what chain of reasoning, she makes her outrageous allegations.</p><p>I am motivated, she says, not by what I have publicly, notoriously<br> and repeatedly stated my motives are, but by some unworthy form of spite<br> or resentment. I see. Any protestation to the contrary is dismissed as<br> an unconvincing lie. Accusing me, of all people, of dishonesty certainly<br> has the advantage of being a novel and unexpected accusation.</br></br></br></br></p><p>But on what is it based? No written word of mine can lead an honest<br> onlooker to draw this conclusion. Did she speak to me and deduce this?<br> She did not. Does she have my strange Vulcan power of the <i>Mind Meld</i>, that she can read the secret workings of my green-blooded heart? She does not.<br> <a class=\"thickbox\" href=\"http://www.scifiwright.com/wp-content/uploads/2015/03/Vulcan-mind-meld.jpg\" rel=\"13635\"><br/></a><br> Is it her claim that I am some interloper, some newcomer, who has<br> been reading science fiction since the days when the moonlanding was<br> still science fiction, been a Tor author since before the turn of the<br> millennium, nominated for a Nebula for one of my Tor novels, been<br> insulted by Harlan Ellison like an old hand, been to mass with Gene<br> Wolfe, and wrote the authorized sequel to AE van Vogt’s work, the author<br> whose first story in 1939, back when ANALOG was still ASTOUNDING,<br> heralded the Golden Age of Campbell? It seems she does.</br></br></br></br></br></br></br></br></br></br></br></p></blockquote><p>Indeed, the fact that the estimable John C. Wright did not have so much as a single Hugo nomination for his excellent <i>The Golden Age</i> trilogy or his brilliant novellas collected in <i>Awake in the Night Land</i> is one of the most damning rebuttals to any anti-Sad Puppy complaints.</p><p>They put forward Scalzi and Swirsky. We put forward Wright and Butcher. And really, that’s all you need to know. Meanwhile, the Evil Legion of Evil’s International Lord of Hate, Larry Correia, also <a href=\"http://monsterhunternation.com/2015/03/31/sad-puppies-update-the-melt-down-continues/\">turns his baleful eye upon the Toad of Tor</a> and points out that in her remarkably stupid meltdown, she has revealed something the SJWs have denied for years.</p><blockquote class=\"tr_bq\"><p> A few years ago I told the truth in public, and said that SMOF insiders usually knew who all the award nominees were going to be for the year, based upon how popular the authors were to the tiny insular cliques, and they usually knew this before the books came out or had been read by anyone. (hell, that even wound up in <a href=\"https://www.youtube.com/watch?v=WzGKlOkQsxY\">our Sad Puppies video</a>!)</p><p>I was called a liar. There is no insider info like this! The Hugos are a sainted, pure process. They’re not predictable or manipulated by politics! There are no suggested slates or campaigns behind the scenes! How DARE you?!</p><p>Uh huh… So I did in public, in the open, with a bunch of outsiders, what they’ve been doing for years with insiders. Outrage ensues.</p><p>So here we are now, a few days away and Teresa is worried. Why? Because as an insider, the people she already knew were SUPPOSED to get Hugo nominations haven’t been contacted…</p><p>But if there wasn’t insider info and insider cliques, and most of the noms aren’t predestined forgone conclusions, how does she even know she’s supposed to be so worried and upset?</p></blockquote><p>He also adds an inspiring personal note that everyone who has supported Sad Puppies or Rabid Puppies, even if only in spirit, needs to remember:</p><blockquote class=\"tr_bq\"><p> Wrath is all you people have.</p><p>Well, Teresa, no matter what we do,  no matter what the results, we know we’re going to feel your wrath. Luckily, I’ve demonstrated to the world that your wrath is impotent. For years, authors have lived in fear of angering these Social Justice mobs. They’ve moderated their speech, self censored their art, and walked on eggshells to avoid getting burned at the stake… That’s why I hate you people, and that’s why I’ve loved exposing you for the petty, petulant, and ultimately powerless little bullies that you are.</p><p>Your angry mobs only have as much power as the person you’re attacking is willing to grant them. I stood up to you last year, and all it did was bring your antics to the attention of more, good, decent, regular fans. </p></blockquote><p>The wrath of the enemy is not to be feared. They hate us for simply existing and living as free men. And that gives any man, any woman, with the courage to stand up to them complete carte blanche.</p></div>",
  "content_text": "Tor and Castalia House author John C. Wright calmly contemplates the Toad of Tor’s public meltdown, in which she insults literally dozens of excellent and well-regarded science fiction authors and\nlibels at least one notable Tor author\n:\nIf my accustomed Vulcan calm could be perturbed, no doubt it would be by the allegations Teresa Nielsen-Hayden, late of Tor Books, is leveling against myself and the other members of the Evil Legion of Evil Authors. But since I am imperturbable, I merely raise one eyebrow and wonder on what evidence, or one what chain of reasoning, she makes her outrageous allegations.\nI am motivated, she says, not by what I have publicly, notoriously\nand repeatedly stated my motives are, but by some unworthy form of spite\nor resentment. I see. Any protestation to the contrary is dismissed as\nan unconvincing lie. Accusing me, of all people, of dishonesty certainly\nhas the advantage of being a novel and unexpected accusation.\nBut on what is it based? No written word of mine can lead an honest\nonlooker to draw this conclusion. Did she speak to me and deduce this?\nShe did not. Does she have my strange Vulcan power of the\nMind Meld\n, that she can read the secret workings of my green-blooded heart? She does not.\nIs it her claim that I am some interloper, some newcomer, who has\nbeen reading science fiction since the days when the moonlanding was\nstill science fiction, been a Tor author since before the turn of the\nmillennium, nominated for a Nebula for one of my Tor novels, been\ninsulted by Harlan Ellison like an old hand, been to mass with Gene\nWolfe, and wrote the authorized sequel to AE van Vogt’s work, the author\nwhose first story in 1939, back when ANALOG was still ASTOUNDING,\nheralded the Golden Age of Campbell? It seems she does.\nIndeed, the fact that the estimable John C. Wright did not have so much as a single Hugo nomination for his excellent\nThe Golden Age\ntrilogy or his brilliant novellas collected in\nAwake in the Night Land\nis one of the most damning rebuttals to any anti-Sad Puppy complaints.\nThey put forward Scalzi and Swirsky. We put forward Wright and Butcher. And really, that’s all you need to know. Meanwhile, the Evil Legion of Evil’s International Lord of Hate, Larry Correia, also\nturns his baleful eye upon the Toad of Tor\nand points out that in her remarkably stupid meltdown, she has revealed something the SJWs have denied for years.\nA few years ago I told the truth in public, and said that SMOF insiders usually knew who all the award nominees were going to be for the year, based upon how popular the authors were to the tiny insular cliques, and they usually knew this before the books came out or had been read by anyone. (hell, that even wound up in\nour Sad Puppies video\n!)\nI was called a liar. There is no insider info like this! The Hugos are a sainted, pure process. They’re not predictable or manipulated by politics! There are no suggested slates or campaigns behind the scenes! How DARE you?!\nUh huh… So I did in public, in the open, with a bunch of outsiders, what they’ve been doing for years with insiders. Outrage ensues.\nSo here we are now, a few days away and Teresa is worried. Why? Because as an insider, the people she already knew were SUPPOSED to get Hugo nominations haven’t been contacted…\nBut if there wasn’t insider info and insider cliques, and most of the noms aren’t predestined forgone conclusions, how does she even know she’s supposed to be so worried and upset?\nHe also adds an inspiring personal note that everyone who has supported Sad Puppies or Rabid Puppies, even if only in spirit, needs to remember:\nWrath is all you people have.\nWell, Teresa, no matter what we do,  no matter what the results, we know we’re going to feel your wrath. Luckily, I’ve demonstrated to the world that your wrath is impotent. For years, authors have lived in fear of angering these Social Justice mobs. They’ve moderated their speech, self censored their art, and walked on eggshells to avoid getting burned at the stake… That’s why I hate you people, and that’s why I’ve loved exposing you for the petty, petulant, and ultimately powerless little bullies that you are.\nYour angry mobs only have as much power as the person you’re attacking is willing to grant them. I stood up to you last year, and all it did was bring your antics to the attention of more, good, decent, regular fans.\nThe wrath of the enemy is not to be feared. They hate us for simply existing and living as free men. And that gives any man, any woman, with the courage to stand up to them complete carte blanche.",
  "tags": [
    "Hugo Award",
    "SJW"
  ],
  "categories": [],
  "sitemap_lastmod": "2015-03-31T18:00:00+00:00"
}