{
  "url": "https://voxday.net/2015/03/08/mailvox-math-is-evidence/",
  "scraped_at": "2025-12-16T12:47:50.447006",
  "title": "Mailvox: the math is the evidence",
  "date_display": "March 8, 2015",
  "date_iso": "2015-03-08T10:27:00+00:00",
  "date_from_url": "2015-03-08",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>Diogenes appears to have trouble with it:</p><blockquote class=\"tr_bq\"><p> The only thing missing from your post is any evidence supporting your assertion. Every stat I’ve seen has Firefox’s slide beginning at least two years before the Eich affair. Nor do the stats show any acceleration in decline at the time Eich was forced out.</p><p>What is your evidence — aside from wishful thinking — for laying the whole thing at the doorstep of SJWs rather than, say, the rise of Chrome? Note I dropped Firefox over the Eich affair myself. However, I don’t see any evidence that the boycott has had any impact whatsoever.</p></blockquote><p>No evidence? The evidence was literally placed right in front of his nose. No acceleration in decline? The evidence was literally placed right in front of his nose. The fact that the slide began two years – or actually, as the article says, four years – before the Eich affair is not the salient point, it is the annual rate at which users have been abandoning Firefox that tells the story. Let’s look at what the quoted article said:</p><p><i>In the last 12 months, Firefox’s user share — an estimate of the<br> portion of all those who reach the Internet via a desktop browser — has<br> plummeted by 34%. Since Firefox crested at 25.1% in April 2010, Firefox<br> has lost 13.5 percentage points, or 54% of its peak share.</br></br></br></i></p><p>Firefox’s user share was at 25.1 percent. It is now at 11.6 percent five years later. Those lost 13.5 percentage points are distributed as follows:</p><p>2010 to 2014 =  7.52 points (13.9 percent of total decline per year)<br> 2014 to 2015 =  5.98 points (44.3 percent of total decline per year)</br></p><p>Now, the fact that the increase in the decline of Firefox increased by a factor of three was coterminous with the boycott does not <i>prove </i>beyond any shadow of a doubt that the boycott was entirely responsible. But it is most certainly <i>evidence </i>that the boycott was at least partially responsible, especially in light of the fact that Mozilla employees clearly believe it has had a negative affect on their user numbers, hence their public pleas to Christians to overlook<i> l’affaire d’Eich</i> one of which was linked to in yesterday’s post.</p><p>In fact, based on the reported rate of decline, the evidence suggests that the Eich affair is having twice as negative an effect as Chrome, bloat, and every other negative factor <i>combined</i>. This was all immediately apparent in the post year yesterday; frankly, I find it a little shocking that it is necessary to spell it out to such a degree for people to be able to follow it. The same story also happens to be indicated in my own statistics, as Pale Moon alone now accounts for 4 percent of the current traffic here on VP, up from zero one year ago.</p><p>For those who need me to type even slower, the 5.98 points lost in 2014 is calculated by dividing 11.6 by 0.66. This provides 17.6 as the Firefox user share prior to the decline of the last 12 months. I hope that explaining the simple subtraction involved will not prove necessary.</p><p>And before anyone stupidly goes running to find a competing statistic, please note that the claim was that there was no evidence to be seen, despite the fact that said evidence was right there in the quoted article.</p></div>",
  "content_text": "Diogenes appears to have trouble with it:\nThe only thing missing from your post is any evidence supporting your assertion. Every stat I’ve seen has Firefox’s slide beginning at least two years before the Eich affair. Nor do the stats show any acceleration in decline at the time Eich was forced out.\nWhat is your evidence — aside from wishful thinking — for laying the whole thing at the doorstep of SJWs rather than, say, the rise of Chrome? Note I dropped Firefox over the Eich affair myself. However, I don’t see any evidence that the boycott has had any impact whatsoever.\nNo evidence? The evidence was literally placed right in front of his nose. No acceleration in decline? The evidence was literally placed right in front of his nose. The fact that the slide began two years – or actually, as the article says, four years – before the Eich affair is not the salient point, it is the annual rate at which users have been abandoning Firefox that tells the story. Let’s look at what the quoted article said:\nIn the last 12 months, Firefox’s user share — an estimate of the\nportion of all those who reach the Internet via a desktop browser — has\nplummeted by 34%. Since Firefox crested at 25.1% in April 2010, Firefox\nhas lost 13.5 percentage points, or 54% of its peak share.\nFirefox’s user share was at 25.1 percent. It is now at 11.6 percent five years later. Those lost 13.5 percentage points are distributed as follows:\n2010 to 2014 =  7.52 points (13.9 percent of total decline per year)\n2014 to 2015 =  5.98 points (44.3 percent of total decline per year)\nNow, the fact that the increase in the decline of Firefox increased by a factor of three was coterminous with the boycott does not\nprove\nbeyond any shadow of a doubt that the boycott was entirely responsible. But it is most certainly\nevidence\nthat the boycott was at least partially responsible, especially in light of the fact that Mozilla employees clearly believe it has had a negative affect on their user numbers, hence their public pleas to Christians to overlook\nl’affaire d’Eich\none of which was linked to in yesterday’s post.\nIn fact, based on the reported rate of decline, the evidence suggests that the Eich affair is having twice as negative an effect as Chrome, bloat, and every other negative factor\ncombined\n. This was all immediately apparent in the post year yesterday; frankly, I find it a little shocking that it is necessary to spell it out to such a degree for people to be able to follow it. The same story also happens to be indicated in my own statistics, as Pale Moon alone now accounts for 4 percent of the current traffic here on VP, up from zero one year ago.\nFor those who need me to type even slower, the 5.98 points lost in 2014 is calculated by dividing 11.6 by 0.66. This provides 17.6 as the Firefox user share prior to the decline of the last 12 months. I hope that explaining the simple subtraction involved will not prove necessary.\nAnd before anyone stupidly goes running to find a competing statistic, please note that the claim was that there was no evidence to be seen, despite the fact that said evidence was right there in the quoted article.",
  "tags": [
    "mailvox",
    "technology"
  ],
  "categories": [],
  "sitemap_lastmod": "2015-03-08T10:27:00+00:00"
}