{
  "url": "https://voxday.net/2015/03/13/mailvox-suicide-of-san-francisco-churc/",
  "scraped_at": "2025-12-16T12:48:33.565952",
  "title": "Mailvox: suicide of a San Francisco church",
  "date_display": "March 13, 2015",
  "date_iso": "2015-03-13T19:07:00+00:00",
  "date_from_url": "2015-03-13",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>A soon-to-be ex-member sends along his the decision of the church “elders” to knowingly embrace sin as church policy:</p><blockquote class=\"tr_bq\"><p> Dear Friends,</p><p>I want to speak with you on behalf of the Elder Board of our church about a pastoral conversation we have been having over the past 9 months. In May of 2014 the Board asked me for a book that was clearly grounded in Scripture that we might study on pastoring our brothers and sisters in Christ who are part of the LGBT community. We read Ken Wilson’s <i>A Letter to My Congregation</i>. The book is rare in that it shows great empathy and maturity to model unity and patience with those who are in different places on this conversation, all the while dealing honestly with Scripture. Since our church already lives in the reality of a multiplicity of viewpoints held with humility, this book seemed to us a good choice. I want you to hear where we have arrived as a Board and invite you into a conversation and healthy discussion about how we arrived there. </p><p><b>Our pastoral practice of demanding life-long “celibacy”, by which we meant that for the rest of your life you would not engage your sexual orientation in any way, was causing obvious harm and has not led to human flourishing.</b></p><p>(It’s unfortunate that we used the word “celibacy” to describe a demand placed on others, as in Scripture it is, according to both Jesus and Paul, a special gift or calling by God, not an option for everyone). In fact, over the years, the stories of harm caused by this pastoral practice began to accumulate. Our pastoral conversations and social science research indicate skyrocketing rates of depression, suicide, and addiction among those who identify as LGBT. The generally unintended consequence has been to leave many people feeling deeply damaged, distorted, unlovable, unacceptable, and perverted. Imagine feeling this from your family or religious community: “If you stay, you must accept celibacy with no hope that you too might one day enjoy the fullness of intellectual, spiritual, emotional, psychological and physical companionship. If you pursue a lifelong partnership, you are rejected.” This is simply not working and people are being hurt. We must listen and respond.</p></blockquote><p>Imagine the feeling! Someone, somewhere, has suffered FEELBAD! One guess what the response will be.</p><blockquote class=\"tr_bq\"><p> <b>Summary: What has actually changed here?</b></p><p>On one hand, nothing. This aligns with our existing core vision: the doors of this church are as wide as the arms of the Savior it proclaims. We remain passionate about having as many people hear the gospel as possible. City Church will continue to receive into membership all those with a credible profession of faith and expect the same commitments represented in their membership vows.</p><p>On the other hand, we want to be clear what this now means. We will no longer discriminate based on sexual orientation and demand lifelong celibacy as a precondition for joining. For all members, regardless of sexual orientation, we will continue to expect chastity in singleness until marriage. Please pray for our Board as we continue to discuss pastoral practices with our LGBT brothers and sisters in Christ. Pray for our denomination, the Reformed Church in America, as it does the same.</p><p>One sad piece of news: two of our Elders, Tyler Dann and Bruce Gregory, resigned from the board. We received these resignations with sadness and understanding. These are fine members of our church who love Jesus deeply.</p></blockquote><p>Well, I’m sure the City Church of Ken Wilson will flourish every bit as well as the Episcopalian and Anglican churches have since they embraced other forms of anti-Christian heresy. “By their fruits you will know them,” we are told.  And when the organizations wither and die, we’ll be assured that it had nothing whatsoever to do with their embrace of open and unrepentant sin.</p><p>I find it interesting that these progressive churches still insist on turning a cold shoulder to unrepentant murderers and child molesters. It’s really rather intolerant and unChristian of them, isn’t it?</p><p>Notice in particular the gentle and understanding tone in which the missive is written. That is the insidious whisper of Hell.</p></div>",
  "content_text": "A soon-to-be ex-member sends along his the decision of the church “elders” to knowingly embrace sin as church policy:\nDear Friends,\nI want to speak with you on behalf of the Elder Board of our church about a pastoral conversation we have been having over the past 9 months. In May of 2014 the Board asked me for a book that was clearly grounded in Scripture that we might study on pastoring our brothers and sisters in Christ who are part of the LGBT community. We read Ken Wilson’s\nA Letter to My Congregation\n. The book is rare in that it shows great empathy and maturity to model unity and patience with those who are in different places on this conversation, all the while dealing honestly with Scripture. Since our church already lives in the reality of a multiplicity of viewpoints held with humility, this book seemed to us a good choice. I want you to hear where we have arrived as a Board and invite you into a conversation and healthy discussion about how we arrived there.\nOur pastoral practice of demanding life-long “celibacy”, by which we meant that for the rest of your life you would not engage your sexual orientation in any way, was causing obvious harm and has not led to human flourishing.\n(It’s unfortunate that we used the word “celibacy” to describe a demand placed on others, as in Scripture it is, according to both Jesus and Paul, a special gift or calling by God, not an option for everyone). In fact, over the years, the stories of harm caused by this pastoral practice began to accumulate. Our pastoral conversations and social science research indicate skyrocketing rates of depression, suicide, and addiction among those who identify as LGBT. The generally unintended consequence has been to leave many people feeling deeply damaged, distorted, unlovable, unacceptable, and perverted. Imagine feeling this from your family or religious community: “If you stay, you must accept celibacy with no hope that you too might one day enjoy the fullness of intellectual, spiritual, emotional, psychological and physical companionship. If you pursue a lifelong partnership, you are rejected.” This is simply not working and people are being hurt. We must listen and respond.\nImagine the feeling! Someone, somewhere, has suffered FEELBAD! One guess what the response will be.\nSummary: What has actually changed here?\nOn one hand, nothing. This aligns with our existing core vision: the doors of this church are as wide as the arms of the Savior it proclaims. We remain passionate about having as many people hear the gospel as possible. City Church will continue to receive into membership all those with a credible profession of faith and expect the same commitments represented in their membership vows.\nOn the other hand, we want to be clear what this now means. We will no longer discriminate based on sexual orientation and demand lifelong celibacy as a precondition for joining. For all members, regardless of sexual orientation, we will continue to expect chastity in singleness until marriage. Please pray for our Board as we continue to discuss pastoral practices with our LGBT brothers and sisters in Christ. Pray for our denomination, the Reformed Church in America, as it does the same.\nOne sad piece of news: two of our Elders, Tyler Dann and Bruce Gregory, resigned from the board. We received these resignations with sadness and understanding. These are fine members of our church who love Jesus deeply.\nWell, I’m sure the City Church of Ken Wilson will flourish every bit as well as the Episcopalian and Anglican churches have since they embraced other forms of anti-Christian heresy. “By their fruits you will know them,” we are told.  And when the organizations wither and die, we’ll be assured that it had nothing whatsoever to do with their embrace of open and unrepentant sin.\nI find it interesting that these progressive churches still insist on turning a cold shoulder to unrepentant murderers and child molesters. It’s really rather intolerant and unChristian of them, isn’t it?\nNotice in particular the gentle and understanding tone in which the missive is written. That is the insidious whisper of Hell.",
  "tags": [
    "Christianity",
    "decline and fall"
  ],
  "categories": [],
  "sitemap_lastmod": "2015-03-13T19:07:00+00:00"
}