{
  "url": "https://voxday.net/2015/03/29/no-income-growth-in-two-decades/",
  "scraped_at": "2025-12-16T12:50:16.902487",
  "title": "No income growth in two decades",
  "date_display": "March 29, 2015",
  "date_iso": "2015-03-29T16:00:00+00:00",
  "date_from_url": "2015-03-29",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>Despite two stock market booms, there has been no real income growth <a href=\"http://guggenheimpartners.com/perspectives/media/the-monetary-illusion\">since 1994</a>:<br/></p><div class=\"perspectives__chart\"><div class=\"perspectives__chart__container\"><div class=\"perspectives__chart__content\"><h2 class=\"perspectives__chart__heading\"></h2><blockquote class=\"tr_bq\"><div class=\"perspectives__chart__paragraph\"> <a href=\"http://guggenheimpartners.com/GP/media/images/MarketPerspectives/MP-Chart-2-March-2015.gif\" imageanchor=\"1\" style=\"clear: left; float: left; margin-bottom: 1em; margin-right: 1em;\"><img alt=\"Real Median Household Income Has Been Flat for 20 Years\" border=\"0\" decoding=\"async\" fetchpriority=\"high\" height=\"196\" src=\"http://guggenheimpartners.com/GP/media/images/MarketPerspectives/MP-Chart-2-March-2015.gif\" width=\"400\"/></a>Despite ultra-loose monetary policies over the past several years,<br> incomes adjusted for inflation have fallen for the median U.S. family.<br> With the benefits of monetary expansion going to a small share of the<br> population and wage growth stagnating, incomes have been essentially<br> flat over the past 20 years. In the long run, however, classical economics would tell us that the<br> pricing distortions created by the current global regimes of QE will<br> lead to a suboptimal allocation of capital and investment, which will<br> result in lower output and lower standards of living over time. In fact,<br> although U.S. equity prices are setting record highs, real median<br> household incomes are 9 percent lower than 1999 highs. The report from<br> Bank of America Merrill Lynch plainly supports the conclusion that QE<br> and the associated currency depreciation is not leading to higher global<br> output. The cost of QE is greater than the income lost to savers and<br> investors. The long-term consequence of the new monetary orthodoxy is<br> likely to permanently impair living standards for generations to come<br> while creating a false illusion of reviving prosperity.</br></br></br></br></br></br></br></br></br></br></br></br></br></br></br></div></blockquote></div></div></div><p>Karl Denninger was among the first to point out that even if it worked, Quantitative Easing could not possibly do what was claimed of it. Thus demonstrating what I pointed out, which is that it was merely about buying more time for the bankers to make hay before the eventual crash of the global economy. We’re already seeing signs of the wars that conventionally accompany depressions, and depending upon your definition of depression, we’re only six years into this thing.</p></div>",
  "content_text": "Despite two stock market booms, there has been no real income growth\nsince 1994\n:\nDespite ultra-loose monetary policies over the past several years,\nincomes adjusted for inflation have fallen for the median U.S. family.\nWith the benefits of monetary expansion going to a small share of the\npopulation and wage growth stagnating, incomes have been essentially\nflat over the past 20 years. In the long run, however, classical economics would tell us that the\npricing distortions created by the current global regimes of QE will\nlead to a suboptimal allocation of capital and investment, which will\nresult in lower output and lower standards of living over time. In fact,\nalthough U.S. equity prices are setting record highs, real median\nhousehold incomes are 9 percent lower than 1999 highs. The report from\nBank of America Merrill Lynch plainly supports the conclusion that QE\nand the associated currency depreciation is not leading to higher global\noutput. The cost of QE is greater than the income lost to savers and\ninvestors. The long-term consequence of the new monetary orthodoxy is\nlikely to permanently impair living standards for generations to come\nwhile creating a false illusion of reviving prosperity.\nKarl Denninger was among the first to point out that even if it worked, Quantitative Easing could not possibly do what was claimed of it. Thus demonstrating what I pointed out, which is that it was merely about buying more time for the bankers to make hay before the eventual crash of the global economy. We’re already seeing signs of the wars that conventionally accompany depressions, and depending upon your definition of depression, we’re only six years into this thing.",
  "tags": [
    "economics"
  ],
  "categories": [],
  "sitemap_lastmod": "2015-03-29T15:00:00+00:00"
}