{
  "url": "https://voxday.net/2015/03/08/no-male-space-goes-unmolested/",
  "scraped_at": "2025-12-16T12:47:54.107564",
  "title": "No male space goes unmolested",
  "date_display": "March 8, 2015",
  "date_iso": "2015-03-08T18:05:00+00:00",
  "date_from_url": "2015-03-08",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>However, I suspect this is less about a commitment to women in technology than a cynical, Sarkeesian-style <a href=\"http://www.dailymail.co.uk/wires/afp/article-2984398/Job-opening-MacGyver-guys-need-not-apply.html\">opportunistic grab for cash</a>:</p><blockquote class=\"tr_bq\"><p> Talk about a cool dude: he once stopped a sulfuric acid leak with a piece of chocolate, and dismantled a missile using a paper clip. The 1980s US television character, secret agent Angus MacGyver, could do it all. And in 2016 his successor will be a woman, if a US engineering association has its way.</p><p>Late last month, the National Academy of Engineering launched what it called “The Next MacGyver Project,” aimed at coming up with ideas for a scripted TV series featuring a female engineer as the leading character.</p><p>Thirty years after that cult series riveted TV viewers, “the objective here is not a MacGyver reboot, but to inspire a new generation of young women interested in science and technology by creating a strong female role model,” said Lee Zlotoff, creator of MacGyver.</p><p>The project is joint initiative by Adam Smith, an engineering professor at the University of Southern California, and Randy Atkins, head of communications at the National Academy of Engineering.</p><p>“After an interview with Lee Zlotoff, Adam called me and proposed that we develop a TV show, and I immediately said yes,” said Atkins.</p><p>The name — “The Next MacGyver Project” — was suggested by Zlotoff, who has supported the project from the outset.</p><p>“I cannot say how many people told me they got interested in engineering after watching MacGyver,” said Atkins. “The idea to make a female lead character comes from Hollywood producers we met during the initial phase of the project,” Atkins said.</p></blockquote><p>Yes, I imagine the idea for branding it “MacGyver” would have come from Mr. Zlotoff. I’m certain his commitment to inspire a new generation of women interested in science and technology – all six of them – by creating a strong female role model has nothing to do with the fact that he hasn’t had a hit television show since MacGyver.</p><p>It’s not enough for The Next MacGyver to be a woman. She should be a<br> black Jewish bisexual with Down’s Syndrome in a wheelchair. Actually, that would probably be a hell of a lot more entertaining than the usual grrrl power nonsense. Done right, it would be downright hilarious. Especially if she couldn’t really talk, but sort of made these moaning Chewbacca sounds that everyone could understand perfectly.</br></p><p>That, I would watch. And as long as she saved the day by turning her wheelchair into a nuclear reactor or whatever, it would be perfectly inspirational and millions of young girls would be inspired to continue avoiding science and technology like the plague.</p></div>",
  "content_text": "However, I suspect this is less about a commitment to women in technology than a cynical, Sarkeesian-style\nopportunistic grab for cash\n:\nTalk about a cool dude: he once stopped a sulfuric acid leak with a piece of chocolate, and dismantled a missile using a paper clip. The 1980s US television character, secret agent Angus MacGyver, could do it all. And in 2016 his successor will be a woman, if a US engineering association has its way.\nLate last month, the National Academy of Engineering launched what it called “The Next MacGyver Project,” aimed at coming up with ideas for a scripted TV series featuring a female engineer as the leading character.\nThirty years after that cult series riveted TV viewers, “the objective here is not a MacGyver reboot, but to inspire a new generation of young women interested in science and technology by creating a strong female role model,” said Lee Zlotoff, creator of MacGyver.\nThe project is joint initiative by Adam Smith, an engineering professor at the University of Southern California, and Randy Atkins, head of communications at the National Academy of Engineering.\n“After an interview with Lee Zlotoff, Adam called me and proposed that we develop a TV show, and I immediately said yes,” said Atkins.\nThe name — “The Next MacGyver Project” — was suggested by Zlotoff, who has supported the project from the outset.\n“I cannot say how many people told me they got interested in engineering after watching MacGyver,” said Atkins. “The idea to make a female lead character comes from Hollywood producers we met during the initial phase of the project,” Atkins said.\nYes, I imagine the idea for branding it “MacGyver” would have come from Mr. Zlotoff. I’m certain his commitment to inspire a new generation of women interested in science and technology – all six of them – by creating a strong female role model has nothing to do with the fact that he hasn’t had a hit television show since MacGyver.\nIt’s not enough for The Next MacGyver to be a woman. She should be a\nblack Jewish bisexual with Down’s Syndrome in a wheelchair. Actually, that would probably be a hell of a lot more entertaining than the usual grrrl power nonsense. Done right, it would be downright hilarious. Especially if she couldn’t really talk, but sort of made these moaning Chewbacca sounds that everyone could understand perfectly.\nThat, I would watch. And as long as she saved the day by turning her wheelchair into a nuclear reactor or whatever, it would be perfectly inspirational and millions of young girls would be inspired to continue avoiding science and technology like the plague.",
  "tags": [
    "media"
  ],
  "categories": [],
  "sitemap_lastmod": "2015-03-08T18:05:00+00:00"
}