{
  "url": "https://voxday.net/2015/03/24/onward-and-upward/",
  "scraped_at": "2025-12-16T12:49:40.630185",
  "title": "Onward and upward",
  "date_display": "March 24, 2015",
  "date_iso": "2015-03-24T16:00:00+00:00",
  "date_from_url": "2015-03-24",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>An ex-Gamma writes <a href=\"http://alphagameplan.blogspot.com/2015/03/graduating-gamma-4.html\">the fourth, and probably the most important, section</a> in his Graduating Gamma series at Alpha Game:</p><blockquote class=\"tr_bq\"><p> There is no man on the planet more intellectually dishonest than a<br> Gamma, as even an Omega has enough self-awareness to avoid being a<br> buffoon at social event and will instead stay at home and play computer<br> games. Everything from a Gamma is a con or a presented image, because<br> behind that shell is a scared, miserable boy who uses whatever tools are<br> at his disposal to build the Gamma Delusion Bubble. The Gamma Delusion<br> Bubble shields the Gamma from somehow and some way ever being wrong<br> about anything, as there is no being wrong about “something”, there is<br> only being a wrong “person”. His identity is so tied up in his opinions<br> about everything, including himself, that any slip-up is a catastrophe<br> which must be avoided at all costs.</br></br></br></br></br></br></br></br></br></br></p></blockquote><p>I’ve learned a tremendous amount from this series, some of which I’ve even been able to apply here. The most important thing for me has been the explanation of a) why Gammas like Scalzi, Brayton, and Myers flee from public debate when they are so otherwise argumentative and contentious, and, b) why it is almost impossible to get a Gamma to admit that he is wrong without him going through every definition in the dictionary, every pedantic nitpick, and every contortion in the Kama Sutra in order to avoid it no matter how obvious it is to you and everyone else.</p><p>Some of you have noticed that I’ve gotten increasingly intolerant of rhetorical arguments, particularly pseudo-dialectical ones, of late. This is because I now understand that there is no real prospect of normal dialectical closure if the other party shows repeated signs of being a Gamma and is engaging in customary Gamma argumentation. Chief among these signs are false summaries, digressions into motivation and psychological diagnosis, appeals to emotion, the production of ad hoc definitions, and the targeting of strawmen rather than the actual statements made. If you happen to be aware that you are prone to utilizing any of those rhetorical tactics, I would strongly recommend that you read the linked article, because you’re not going to find much toleration for them here.</p></div>",
  "content_text": "An ex-Gamma writes\nthe fourth, and probably the most important, section\nin his Graduating Gamma series at Alpha Game:\nThere is no man on the planet more intellectually dishonest than a\nGamma, as even an Omega has enough self-awareness to avoid being a\nbuffoon at social event and will instead stay at home and play computer\ngames. Everything from a Gamma is a con or a presented image, because\nbehind that shell is a scared, miserable boy who uses whatever tools are\nat his disposal to build the Gamma Delusion Bubble. The Gamma Delusion\nBubble shields the Gamma from somehow and some way ever being wrong\nabout anything, as there is no being wrong about “something”, there is\nonly being a wrong “person”. His identity is so tied up in his opinions\nabout everything, including himself, that any slip-up is a catastrophe\nwhich must be avoided at all costs.\nI’ve learned a tremendous amount from this series, some of which I’ve even been able to apply here. The most important thing for me has been the explanation of a) why Gammas like Scalzi, Brayton, and Myers flee from public debate when they are so otherwise argumentative and contentious, and, b) why it is almost impossible to get a Gamma to admit that he is wrong without him going through every definition in the dictionary, every pedantic nitpick, and every contortion in the Kama Sutra in order to avoid it no matter how obvious it is to you and everyone else.\nSome of you have noticed that I’ve gotten increasingly intolerant of rhetorical arguments, particularly pseudo-dialectical ones, of late. This is because I now understand that there is no real prospect of normal dialectical closure if the other party shows repeated signs of being a Gamma and is engaging in customary Gamma argumentation. Chief among these signs are false summaries, digressions into motivation and psychological diagnosis, appeals to emotion, the production of ad hoc definitions, and the targeting of strawmen rather than the actual statements made. If you happen to be aware that you are prone to utilizing any of those rhetorical tactics, I would strongly recommend that you read the linked article, because you’re not going to find much toleration for them here.",
  "tags": [
    "Alpha Game"
  ],
  "categories": [],
  "sitemap_lastmod": "2015-03-24T16:00:00+00:00"
}