{
  "url": "https://voxday.net/2015/03/28/punch-harder/",
  "scraped_at": "2025-12-16T12:50:08.557050",
  "title": "Punch harder",
  "date_display": "March 28, 2015",
  "date_iso": "2015-03-28T17:49:00+00:00",
  "date_from_url": "2015-03-28",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>It’s amusing how many SJWs don’t understand <a href=\"http://www.huffingtonpost.com/laura-lifshitz/what-its-like-to-be-an-evil-jewish-divorcee_b_6916122.html\">how this “Internet” thing works</a>. A woman whines about <a href=\"https://dalrock.wordpress.com/2015/03/27/why-cant-i-write-without-being-written-about/\">being criticized by Dalrock</a>, among others.</p><blockquote class=\"tr_bq\"><p> A group of supposed “Christian” men bantered back and forth under a blog written with the sole intention of saying that women divorce so they can profit off of it by writing about it and I Laura Lifshitz, am one of the most evil women profiting off her dissolved marriage. Oh and by the way, the article is categorized under “ugly feminists.”</p><p>First, the comments focused on how terrible I was for writing about my divorce not only for The Huffington Post, but also for the New York Times because you know, the divorce must be my fault since I write about the experience, and I’m an evil Jewish feminist. And not only must the divorce be my fault but that I am a selfish mother who cares not for her own child and how she feels in the matter. In addition, let’s not forget to add that female writers writing about divorce are a bunch of leeches set to destroy our families all in the name of money.</p><p>Because, you know, I’m just filthy rich. It’s too bad my student loan lender doesn’t realize this.</p><p>Then, the commenters started to focus on my last name: Lifshitz.</p><p>“Ha, Ha, Ha! Is it even a real name?” joked one commenter.</p><p>Then the other commenters joined in to bash my last name, these anti-Semitic, vile, and immature babies (I mean men).</p></blockquote><p>Now why would anyone be moved to criticize a woman who calls them “anti-Semitic, vile, and immature babies”? What is the bright line that separates a woman calling men “vile and immature babies” and a man calling women “rancid cunts”? And for crying out loud, look at her name. “Is it a real name” is about the mildest possible sport anyone could make of it. As for people getting personal about Ms Lipshits, it’s not hard to see <a href=\"http://frommtvtomommy.com/2013/01/\">why they might feel justified in doing so</a>:</p><blockquote class=\"tr_bq\"><p> There is this one dude at the gym who is very buff. He’s not my bag of treats, but apparently he feels that any woman who looks in his direction must be interested. He has this stone face grimace. I see him at least three times a week. Smile you grouchy fuck! I am not interested in you, but I just hate looking at such a crabby face.</p></blockquote><p>Any woman who writes like this has made herself entirely fair game for any verbal abuse anyone wants to pour out upon her. Like the McRapeys and McRacists of the world, she wants to be able to dish out abuse without being subjecting to it in return. Women like this are in shock that men on the Internet aren’t treating them the way that men in their daily life do, and that they can’t get away with talking about others in public the way they do in private.</p><p>The thing is, if you’re going to be a public figure and express your opinion on the Internet, you are going to upset a subset of the people who encounter it. A subset of that subset are going to respond by attacking you using nothing but rhetoric. I’ve had people calling me nearly every name in the book on the Internet since 2001. So what? It clearly hasn’t harmed me in the slightest. I quite like that it also gives me complete carte blanche to call everyone else anything I please since it seems to bother most of them considerably more than it bothers me.</p><p>The first rule of dealing with SJWs is Andrew Breitbart’s: always punch back twice as hard. The second rule is this: keep punching. Women are particularly susceptible to attacks on their appearance and their sexual behavior, so those are the most effective subjects to target with rhetoric. Once it is clear that they’re not engaging in honest dialectic or rational discourse, your best bet is to either ignore them or nuke them rhetorically.</p><p>The third rule is this: quote them and quote them ruthlessly.<br> Patrick Nielsen Hayden is a self-admitted racist. John Scalzi is a<br> self-admitted rapist. NK Jemisin is a self-admitted savage… and proud<br> of it.</br></br></br></p><p>The SJWs have to choose. Either they can engage in rational discourse or they can accept being called sluts and savages and racists and evil, ugly feminists on a regular basis. What is not on the table is one-way communication where they attack and lecture us and we humbly accept it in dutiful silence.</p><blockquote class=\"tr_bq\"><p> There are some things I cannot understand — like internet trolls and<br> people who hate chocolate — but there is one thing that I do know is<br> that I will never stop writing. I don’t care if they come to my house<br> and call me the ugliest cunt on the planet. I will never stop writing my<br> story.</br></br></br></br></p></blockquote><p>Oh, I don’t think there was every any chance that Ms Lipshits was going to stop talking about herself. But she can be assured that as long as she subjects the public to her story, the public is going to talk back.</p></div>",
  "content_text": "It’s amusing how many SJWs don’t understand\nhow this “Internet” thing works\n. A woman whines about\nbeing criticized by Dalrock\n, among others.\nA group of supposed “Christian” men bantered back and forth under a blog written with the sole intention of saying that women divorce so they can profit off of it by writing about it and I Laura Lifshitz, am one of the most evil women profiting off her dissolved marriage. Oh and by the way, the article is categorized under “ugly feminists.”\nFirst, the comments focused on how terrible I was for writing about my divorce not only for The Huffington Post, but also for the New York Times because you know, the divorce must be my fault since I write about the experience, and I’m an evil Jewish feminist. And not only must the divorce be my fault but that I am a selfish mother who cares not for her own child and how she feels in the matter. In addition, let’s not forget to add that female writers writing about divorce are a bunch of leeches set to destroy our families all in the name of money.\nBecause, you know, I’m just filthy rich. It’s too bad my student loan lender doesn’t realize this.\nThen, the commenters started to focus on my last name: Lifshitz.\n“Ha, Ha, Ha! Is it even a real name?” joked one commenter.\nThen the other commenters joined in to bash my last name, these anti-Semitic, vile, and immature babies (I mean men).\nNow why would anyone be moved to criticize a woman who calls them “anti-Semitic, vile, and immature babies”? What is the bright line that separates a woman calling men “vile and immature babies” and a man calling women “rancid cunts”? And for crying out loud, look at her name. “Is it a real name” is about the mildest possible sport anyone could make of it. As for people getting personal about Ms Lipshits, it’s not hard to see\nwhy they might feel justified in doing so\n:\nThere is this one dude at the gym who is very buff. He’s not my bag of treats, but apparently he feels that any woman who looks in his direction must be interested. He has this stone face grimace. I see him at least three times a week. Smile you grouchy fuck! I am not interested in you, but I just hate looking at such a crabby face.\nAny woman who writes like this has made herself entirely fair game for any verbal abuse anyone wants to pour out upon her. Like the McRapeys and McRacists of the world, she wants to be able to dish out abuse without being subjecting to it in return. Women like this are in shock that men on the Internet aren’t treating them the way that men in their daily life do, and that they can’t get away with talking about others in public the way they do in private.\nThe thing is, if you’re going to be a public figure and express your opinion on the Internet, you are going to upset a subset of the people who encounter it. A subset of that subset are going to respond by attacking you using nothing but rhetoric. I’ve had people calling me nearly every name in the book on the Internet since 2001. So what? It clearly hasn’t harmed me in the slightest. I quite like that it also gives me complete carte blanche to call everyone else anything I please since it seems to bother most of them considerably more than it bothers me.\nThe first rule of dealing with SJWs is Andrew Breitbart’s: always punch back twice as hard. The second rule is this: keep punching. Women are particularly susceptible to attacks on their appearance and their sexual behavior, so those are the most effective subjects to target with rhetoric. Once it is clear that they’re not engaging in honest dialectic or rational discourse, your best bet is to either ignore them or nuke them rhetorically.\nThe third rule is this: quote them and quote them ruthlessly.\nPatrick Nielsen Hayden is a self-admitted racist. John Scalzi is a\nself-admitted rapist. NK Jemisin is a self-admitted savage… and proud\nof it.\nThe SJWs have to choose. Either they can engage in rational discourse or they can accept being called sluts and savages and racists and evil, ugly feminists on a regular basis. What is not on the table is one-way communication where they attack and lecture us and we humbly accept it in dutiful silence.\nThere are some things I cannot understand — like internet trolls and\npeople who hate chocolate — but there is one thing that I do know is\nthat I will never stop writing. I don’t care if they come to my house\nand call me the ugliest cunt on the planet. I will never stop writing my\nstory.\nOh, I don’t think there was every any chance that Ms Lipshits was going to stop talking about herself. But she can be assured that as long as she subjects the public to her story, the public is going to talk back.",
  "tags": [
    "media",
    "SJW"
  ],
  "categories": [],
  "sitemap_lastmod": "2015-03-28T17:49:00+00:00"
}