{
  "url": "https://voxday.net/2015/03/05/reaxxion-interview/",
  "scraped_at": "2025-12-16T12:47:35.803141",
  "title": "Reaxxion interview",
  "date_display": "March 5, 2015",
  "date_iso": "2015-03-05T21:27:00+00:00",
  "date_from_url": "2015-03-05",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>Reaxxion posted <a href=\"http://www.reaxxion.com/5962/game-designer-vox-day-takes-us-far-back-in-gaming-history\">the translation of a recent interview with me</a> by Werta Best of old-games.ru. Among other things it features the original CD sleeve cover of Rebel Moon that hasn’t been seen by anyone in decades.</p><blockquote class=\"tr_bq\"><p> <b>Who was the first member in your team who proposed the<br> revolutionary idea to use the beautiful color lighting in the developed<br> RM game engine? Attention please, it was before Unreal release! Did your<br> team perform an overview of the graphics capabilities for other first<br> person shooters published before RM?</br></br></br></br></b></p><p>That was my partner Andrew’s idea. We knew Marc Rein and the guys at<br> Unreal very well, in fact, our audio guy and housemate is now their<br> audio director. Because we came from a high-resolution graphics<br> background, we always looked to push the envelope in one way or another.<br> Expanding the color depth was something we wanted to do as soon as the<br> hardware could handle it. The problem was that you were still limited to<br> 256-color palettes in the textures due to memory limitations.</br></br></br></br></br></br></p><p><b>What’s in your opinion was the reason for poor commercial success of Rebel Moon Rising – is it because of previous game has low popularity (Rebel Moon, 1995) or due to low resolution of sprites used in both games?</b></p><p>One word. QUAKE. Rebel Moon Rising got pretty good reviews and was well-regarded by other designers, but once people had a taste of 3D, they didn’t want to go back to 2.5D. It’s not like that surprised us. After all, I was the one who originally trademarked “3D Blaster” years before and I’d spent a lot of time out in the Bay Area as a Transdimensional Evangelist trying to convince Creative, Hercules, and Diamond, among others, to adopt 3D acceleration long before Jensen Huang got Nvidea going. We knew 3D was going to be big for the shooter market, but we didn’t have time to write a 3D engine on Intel’s schedule. And more importantly, we discovered that the graphics bus was too slow to let the MMX properly support 3D at the higher resolutions we originally intended to support.</p><p>The original MMX was actually four times faster than it was able to deliver, but the limitation was the bus, not the chip’s performance. We were the ones who discovered the problem; Intel was absolutely horrified when we proved it to them by blitting a 2-bit black rectangle. Commercial success was always an afterthought, as our Intel relationship guided most of our decisions and generated most of our revenue.<br> <b><br>We were very pleased with effects for varying of gravity on some level’s maps – it was one of the most original gameplay ideas in both Rebel Moon games. Has anyone used same method for walkthrough of levels in other games published in 90-s? Who was the author of idea in your team?</br></b></br></p><p>I don’t know. I asked Andrew and he doesn’t recall either. Our culture at Fenris Wolf was always one of pushing things further. We created the first escort mission in a shooter, we were the first to support MMX, the first to implement speech recognition in a multiplayer game (you could switch weapons and send predetermined messages using your voice), and we also introduced a number of smaller innovations like in-level variable gravity. Given that the game was set in space, the idea of blowing up a gravity generator and then having it affect the gameplay would have seemed pretty obvious to all of us at the time.<br> <b><br>The net game levels walkthrough in RMR is more interesting than single player maps. It seems that RMR game originally was planned as a coop game only and single player levels are just the secondary product from net levels. Is it right?</br></b></br></p><p>No, it’s precisely backward. The problem with single player was that Intel’s testers simply weren’t gamers. We created the first two levels, which are borderline retarded and come complete with arrows on the floor pointing GO THIS WAY, rather late in the process because the testers couldn’t manage to complete levels that any competent gamer could play through in minutes. So we had to dumb everything down. We didn’t even do the multiplayer stuff until the retail release with GT, but because Intel wasn’t involved with those, we could design them for proper gamers. That’s probably why they are more interesting.</p><p><b>In our opinion, for Rebel Moon Rising game very effective way was used to a sharp change of the game environment – teleportation to another planet (in alien world). And it was made one year before popular Half-Life! (teleport to Xen…). This significant jump was originally planned in the RMR game scenario as well as concept art?</b></p><p>In light of the fact that we were using an expanded color depth for the first time, my decision to set the storyline in space, on the Moon, was a very, very bad one. I thought it would be visually impressive to have these rich jeweled tones of the lasers and lights contrasted against the grays of the environment, but the effect was just too subtle. And our artists, while smart and talented, were all very young and hired straight out of art school with no computer or 3D experience. We should have done something more wild and garish like Unreal.</p><p>The decision to shift the focus to the alien environments allowed us to bring in more color and interesting visuals than was permitted by an environment mostly filled with black space and Moon rocks. The jump was definitely planned in the design document and it was always part of the story, but we did end up putting more of the levels in the alien environments than originally planned due to the desire to incorporate more interesting graphical elements.</p></blockquote><p><a href=\"http://www.reaxxion.com/wp-content/uploads/2015/03/rm2.jpg\" imageanchor=\"1\" style=\"clear: left; float: left; margin-bottom: 1em; margin-right: 1em;\"><img border=\"0\" decoding=\"async\" fetchpriority=\"high\" height=\"320\" src=\"http://www.reaxxion.com/wp-content/uploads/2015/03/rm2.jpg\" width=\"230\"/></a> I’m always pleased to see that the old games aren’t forgotten, including my own. Werta and his team of programmers are amazing; they not only ported Rebel Moon Rising to the modern versions of Windows, but even ported the original Rebel Moon to it. And they managed to get the nine demo levels of the unfinished Rebel Moon Revolution working so you can see some of the still-advanced twin AI systems at work.</p><p>It’s good to see Reaxxion continuing to grow and providing more SJW-free game-related content.</p></div>",
  "content_text": "Reaxxion posted\nthe translation of a recent interview with me\nby Werta Best of old-games.ru. Among other things it features the original CD sleeve cover of Rebel Moon that hasn’t been seen by anyone in decades.\nWho was the first member in your team who proposed the\nrevolutionary idea to use the beautiful color lighting in the developed\nRM game engine? Attention please, it was before Unreal release! Did your\nteam perform an overview of the graphics capabilities for other first\nperson shooters published before RM?\nThat was my partner Andrew’s idea. We knew Marc Rein and the guys at\nUnreal very well, in fact, our audio guy and housemate is now their\naudio director. Because we came from a high-resolution graphics\nbackground, we always looked to push the envelope in one way or another.\nExpanding the color depth was something we wanted to do as soon as the\nhardware could handle it. The problem was that you were still limited to\n256-color palettes in the textures due to memory limitations.\nWhat’s in your opinion was the reason for poor commercial success of Rebel Moon Rising – is it because of previous game has low popularity (Rebel Moon, 1995) or due to low resolution of sprites used in both games?\nOne word. QUAKE. Rebel Moon Rising got pretty good reviews and was well-regarded by other designers, but once people had a taste of 3D, they didn’t want to go back to 2.5D. It’s not like that surprised us. After all, I was the one who originally trademarked “3D Blaster” years before and I’d spent a lot of time out in the Bay Area as a Transdimensional Evangelist trying to convince Creative, Hercules, and Diamond, among others, to adopt 3D acceleration long before Jensen Huang got Nvidea going. We knew 3D was going to be big for the shooter market, but we didn’t have time to write a 3D engine on Intel’s schedule. And more importantly, we discovered that the graphics bus was too slow to let the MMX properly support 3D at the higher resolutions we originally intended to support.\nThe original MMX was actually four times faster than it was able to deliver, but the limitation was the bus, not the chip’s performance. We were the ones who discovered the problem; Intel was absolutely horrified when we proved it to them by blitting a 2-bit black rectangle. Commercial success was always an afterthought, as our Intel relationship guided most of our decisions and generated most of our revenue.\nWe were very pleased with effects for varying of gravity on some level’s maps – it was one of the most original gameplay ideas in both Rebel Moon games. Has anyone used same method for walkthrough of levels in other games published in 90-s? Who was the author of idea in your team?\nI don’t know. I asked Andrew and he doesn’t recall either. Our culture at Fenris Wolf was always one of pushing things further. We created the first escort mission in a shooter, we were the first to support MMX, the first to implement speech recognition in a multiplayer game (you could switch weapons and send predetermined messages using your voice), and we also introduced a number of smaller innovations like in-level variable gravity. Given that the game was set in space, the idea of blowing up a gravity generator and then having it affect the gameplay would have seemed pretty obvious to all of us at the time.\nThe net game levels walkthrough in RMR is more interesting than single player maps. It seems that RMR game originally was planned as a coop game only and single player levels are just the secondary product from net levels. Is it right?\nNo, it’s precisely backward. The problem with single player was that Intel’s testers simply weren’t gamers. We created the first two levels, which are borderline retarded and come complete with arrows on the floor pointing GO THIS WAY, rather late in the process because the testers couldn’t manage to complete levels that any competent gamer could play through in minutes. So we had to dumb everything down. We didn’t even do the multiplayer stuff until the retail release with GT, but because Intel wasn’t involved with those, we could design them for proper gamers. That’s probably why they are more interesting.\nIn our opinion, for Rebel Moon Rising game very effective way was used to a sharp change of the game environment – teleportation to another planet (in alien world). And it was made one year before popular Half-Life! (teleport to Xen…). This significant jump was originally planned in the RMR game scenario as well as concept art?\nIn light of the fact that we were using an expanded color depth for the first time, my decision to set the storyline in space, on the Moon, was a very, very bad one. I thought it would be visually impressive to have these rich jeweled tones of the lasers and lights contrasted against the grays of the environment, but the effect was just too subtle. And our artists, while smart and talented, were all very young and hired straight out of art school with no computer or 3D experience. We should have done something more wild and garish like Unreal.\nThe decision to shift the focus to the alien environments allowed us to bring in more color and interesting visuals than was permitted by an environment mostly filled with black space and Moon rocks. The jump was definitely planned in the design document and it was always part of the story, but we did end up putting more of the levels in the alien environments than originally planned due to the desire to incorporate more interesting graphical elements.\nI’m always pleased to see that the old games aren’t forgotten, including my own. Werta and his team of programmers are amazing; they not only ported Rebel Moon Rising to the modern versions of Windows, but even ported the original Rebel Moon to it. And they managed to get the nine demo levels of the unfinished Rebel Moon Revolution working so you can see some of the still-advanced twin AI systems at work.\nIt’s good to see Reaxxion continuing to grow and providing more SJW-free game-related content.",
  "tags": [
    "games"
  ],
  "categories": [],
  "sitemap_lastmod": "2015-03-05T21:27:00+00:00"
}