{
  "url": "https://voxday.net/2015/03/14/the-left-devours-itself/",
  "scraped_at": "2025-12-16T12:48:35.396858",
  "title": "The Left devours itself",
  "date_display": "March 14, 2015",
  "date_iso": "2015-03-14T10:50:00+00:00",
  "date_from_url": "2015-03-14",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>The long-anticipated breakdown of the Rainbow Coalition <a href=\"http://www.theguardian.com/commentisfree/2015/mar/11/mainstream-left-silencing-sympathetic-voices\">has begun on both sides of the Atlantic</a>. Unfortunately, the White Minority has not really even begun to get into the game. But give them time.</p><blockquote class=\"tr_bq\"><p> I am a “lefty”. I have voted Labour all my life. I believe in the<br> abolition of public schools and the inviolability of the NHS, and that<br> the renewal of Trident is a vanity project. I believe the state must<br> work to ensure equality of opportunity for all: women, the LBGT<br> “community”, those with disabilities, those of minority cultures and<br> ethnicities, and the working class. The Guardian has been my newspaper<br> forever. I was glad to see the back of the Sun’s Page 3, and I believe<br> there should be more all-women shortlists for parliamentary seats. I<br> believe immigration is more of a positive force than a negative one.</br></br></br></br></br></br></br></br></p><p>However, you might be less certain about my status when I finish<br> laying out my stall. Because I find myself holding a “transgressive”<br> body of beliefs and doubts alongside my blue-chip leftwing ones that are<br> liable to get me branded a misogynist, an Islamophobe and a Little<br> Englander – at least by people on my Twitter feed, and others of my peer<br> group…. My stance on these issues makes some people in my “tribe” very angry. It is the anger of the pure believer towards the apostate….</br></br></br></br></br></p><p>One very key element of the liberal left has long been under threat: its liberalism – that is, its willingness to debate with anything outside a narrow range of opinions within its own walls. And the more scary and incomprehensible the world becomes, the more debate is replaced by edict and prejudice: literally pre-judging. Identity politics is one of the most significant developments of the last 50 years, but it has led to nerves being exposed in a way they rarely were by economic issues. Because identity is less about politics and more about that most sensitive of human constructions, the protection of the self – both group and individual.</p><p>And the more it becomes about the protection of self, the less it becomes about the back and forth of rational argument. All the beliefs, opinions and doubts I hold are just that: they are ideas, not ironclad convictions. I am not certain about any of them, and am quite willing to change my mind, as I have done many times in the past. But I will not alter them if I am faced with invective rather than debate; in fact, they will become more entrenched.</p></blockquote><p>Meanwhile, in America, <a href=\"http://www.foxnews.com/politics/2015/03/11/maryland-naacp-tries-to-block-two-public-schools-for-immigrants-calls-it/\">the low-intensity power struggle</a> between blacks and browns stretches from Compton, California to Baltimore, Maryland:</p><blockquote class=\"tr_bq\"><p> A plan that would dedicate two public high schools in suburban Washington to immigrants and students struggling with English is pitting black and Hispanic communities -– usually allies — against one another.</p><p>The Prince George’s County, Md., chapter of the NAACP is strongly opposing the plan — which would take effect next school year, and cover about 800 students having English language difficulties — claiming it will pull resources from other students and unfairly redistribute them to Hispanic students. Some critics go so far as to compare the plan to segregation.</p><p>“It’s a slap in the face,” Bob Ross, president of the Prince George’s County branch of the NAACP, told FoxNews.com.</p><p>Ross believes the proposal to open two new schools violates the landmark 1954 Brown v. Board of Education decision that ruled separate schools for black and white students violated the Fourteenth Amendment of the U.S. Constitution. </p><p>“It risks turning Prince George’s County into a segregated school system,” Ross said, adding that he realizes the need for better education in the county but believes it should not come at the cost of existing students.</p><p>Latino advocacy group CASA de Maryland sees it differently. The group, which has pushed for the schools, argues that it’s not a violation of the Constitution because the schools are not mandatory and are being built to provide options to immigrants.</p></blockquote><p>One thing that most white people have almost religiously failed to grasp is that Hispanics dislike blacks considerably more than whites do. They completely lack both white guilt and white paternalism, and they view blacks as their primary economic and political competition. As Hispanics begin to bring their numbers to bear on both fronts, they are going to ruthlessly crush the traditional sinecures that white liberals have carved out for their black supporters.</p></div>",
  "content_text": "The long-anticipated breakdown of the Rainbow Coalition\nhas begun on both sides of the Atlantic\n. Unfortunately, the White Minority has not really even begun to get into the game. But give them time.\nI am a “lefty”. I have voted Labour all my life. I believe in the\nabolition of public schools and the inviolability of the NHS, and that\nthe renewal of Trident is a vanity project. I believe the state must\nwork to ensure equality of opportunity for all: women, the LBGT\n“community”, those with disabilities, those of minority cultures and\nethnicities, and the working class. The Guardian has been my newspaper\nforever. I was glad to see the back of the Sun’s Page 3, and I believe\nthere should be more all-women shortlists for parliamentary seats. I\nbelieve immigration is more of a positive force than a negative one.\nHowever, you might be less certain about my status when I finish\nlaying out my stall. Because I find myself holding a “transgressive”\nbody of beliefs and doubts alongside my blue-chip leftwing ones that are\nliable to get me branded a misogynist, an Islamophobe and a Little\nEnglander – at least by people on my Twitter feed, and others of my peer\ngroup…. My stance on these issues makes some people in my “tribe” very angry. It is the anger of the pure believer towards the apostate….\nOne very key element of the liberal left has long been under threat: its liberalism – that is, its willingness to debate with anything outside a narrow range of opinions within its own walls. And the more scary and incomprehensible the world becomes, the more debate is replaced by edict and prejudice: literally pre-judging. Identity politics is one of the most significant developments of the last 50 years, but it has led to nerves being exposed in a way they rarely were by economic issues. Because identity is less about politics and more about that most sensitive of human constructions, the protection of the self – both group and individual.\nAnd the more it becomes about the protection of self, the less it becomes about the back and forth of rational argument. All the beliefs, opinions and doubts I hold are just that: they are ideas, not ironclad convictions. I am not certain about any of them, and am quite willing to change my mind, as I have done many times in the past. But I will not alter them if I am faced with invective rather than debate; in fact, they will become more entrenched.\nMeanwhile, in America,\nthe low-intensity power struggle\nbetween blacks and browns stretches from Compton, California to Baltimore, Maryland:\nA plan that would dedicate two public high schools in suburban Washington to immigrants and students struggling with English is pitting black and Hispanic communities -– usually allies — against one another.\nThe Prince George’s County, Md., chapter of the NAACP is strongly opposing the plan — which would take effect next school year, and cover about 800 students having English language difficulties — claiming it will pull resources from other students and unfairly redistribute them to Hispanic students. Some critics go so far as to compare the plan to segregation.\n“It’s a slap in the face,” Bob Ross, president of the Prince George’s County branch of the NAACP, told FoxNews.com.\nRoss believes the proposal to open two new schools violates the landmark 1954 Brown v. Board of Education decision that ruled separate schools for black and white students violated the Fourteenth Amendment of the U.S. Constitution.\n“It risks turning Prince George’s County into a segregated school system,” Ross said, adding that he realizes the need for better education in the county but believes it should not come at the cost of existing students.\nLatino advocacy group CASA de Maryland sees it differently. The group, which has pushed for the schools, argues that it’s not a violation of the Constitution because the schools are not mandatory and are being built to provide options to immigrants.\nOne thing that most white people have almost religiously failed to grasp is that Hispanics dislike blacks considerably more than whites do. They completely lack both white guilt and white paternalism, and they view blacks as their primary economic and political competition. As Hispanics begin to bring their numbers to bear on both fronts, they are going to ruthlessly crush the traditional sinecures that white liberals have carved out for their black supporters.",
  "tags": [
    "politics",
    "SJW",
    "Vibrancy is our strength"
  ],
  "categories": [],
  "sitemap_lastmod": "2015-03-14T10:50:00+00:00"
}