{
  "url": "https://voxday.net/2015/03/20/the-inequality-of-austerity/",
  "scraped_at": "2025-12-16T12:49:17.759058",
  "title": "The inequality of austerity",
  "date_display": "March 20, 2015",
  "date_iso": "2015-03-20T19:30:00+00:00",
  "date_from_url": "2015-03-20",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>For all the talk about the “idle poor” and lazy Greeks, let’s not forget that corporate welfare to the “idle rich” and politically connected Greeks is often rather substantial. That’s not just a left-wing talking point, in this age of banking bailouts, the subsidies to the very rich may actually exceed those to the overtly government dependent. It’s clear that the burden imposed by the IMF is not falling, like the rain, <a href=\"http://www.zerohedge.com/news/2015-03-20/shocking-austerity-greece%E2%80%99s-poor-lost-86-income-rich-only-17-20\">on the rich and poor alike</a>.</p><blockquote class=\"tr_bq\"><p> Greece’s unbalanced austerity and drastic increase of poverty. The poorest households in the debt-ridden country lost nearly 86% of their income, while the richest lost only 17-20%.  The tax burden on the poor increased by 337% while the burden on upper-income classes increased by only 9% !!! This is the result of a study that has analyzed 260.000 tax and income data from the years 2008 – 2012.</p><p>According to the study commissioned by the German Institute for Macroeconomic Research (IMK) affiliated with the Hans Böckler Foundation:</p><p>– The nominal gross income of Greek households decreased by almost a quarter in only four years.</p><p>– The wages cuts caused nearly half of the decline.</p><p>– The net income fell further by almost 9 percent, because the tax burden was significantly increased</p></blockquote><p>When you see statistics like that, you sort of assume that there will be some sort of revolution taking place, and frankly, it would be hard to blame them. Crony “capitalism” of the sort we’ve seen dominate the Western economies since 2008 is not something that any genuine capitalist should support.</p></div>",
  "content_text": "For all the talk about the “idle poor” and lazy Greeks, let’s not forget that corporate welfare to the “idle rich” and politically connected Greeks is often rather substantial. That’s not just a left-wing talking point, in this age of banking bailouts, the subsidies to the very rich may actually exceed those to the overtly government dependent. It’s clear that the burden imposed by the IMF is not falling, like the rain,\non the rich and poor alike\n.\nGreece’s unbalanced austerity and drastic increase of poverty. The poorest households in the debt-ridden country lost nearly 86% of their income, while the richest lost only 17-20%.  The tax burden on the poor increased by 337% while the burden on upper-income classes increased by only 9% !!! This is the result of a study that has analyzed 260.000 tax and income data from the years 2008 – 2012.\nAccording to the study commissioned by the German Institute for Macroeconomic Research (IMK) affiliated with the Hans Böckler Foundation:\n– The nominal gross income of Greek households decreased by almost a quarter in only four years.\n– The wages cuts caused nearly half of the decline.\n– The net income fell further by almost 9 percent, because the tax burden was significantly increased\nWhen you see statistics like that, you sort of assume that there will be some sort of revolution taking place, and frankly, it would be hard to blame them. Crony “capitalism” of the sort we’ve seen dominate the Western economies since 2008 is not something that any genuine capitalist should support.",
  "tags": [
    "economics"
  ],
  "categories": [],
  "sitemap_lastmod": "2015-03-20T19:30:00+00:00"
}