{
  "url": "https://voxday.net/2015/03/31/the-toad-tries-to-walk-one-back/",
  "scraped_at": "2025-12-16T12:50:30.146787",
  "title": "The Toad tries to walk one back",
  "date_display": "March 31, 2015",
  "date_iso": "2015-03-31T12:30:00+00:00",
  "date_from_url": "2015-03-31",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>The Toad of Tor, Teresa Nielsen Hayden, belatedly realized she’d shown the true face of SJW gatekeeper privilege to the world because she’s desperately trying to walk back her words. But it’s much too late; we’ve already impaled her upon them. She even alarmed her fellow SJWs.</p><p><i>“I will admit to having been in kind of an unsettled state since<br> Teresa’s “this is the Worldcon award, and others can go do their own<br> thing” post. But then I may well not be the only one in that state, too.”</br></br></i></p><p>Compare and contrast this statement:</p><blockquote class=\"tr_bq\"><p> “The Hugos don’t belong to the set of all people who read the genre; they belong to the worldcon, and the people who attend and/or support it. The set of all people who read SF can start their own award.”<br> – Teresa Nielsen Hayden, <a href=\"http://nielsenhayden.com/makinglight/archives/016177.html#4056439\">March 29, 2015, 03:43 PM</a> </br></p></blockquote><p> With this one:</p><blockquote class=\"tr_bq\"><p> “I should have been clearer. Those of us who love SF and love fandom know in our hearts that the Hugo is ours. One of the most upsetting things about the Sad Puppy campaigns is that they’re saying the Hugo shouldn’t belong to all of us, it should just belong to them.”<br> – Teresa Nielsen Hayden, <a href=\"http://nielsenhayden.com/makinglight/archives/016177.html#4059860\">March 30, 2015, 10:15 PM</a></br></p></blockquote><p>Like all SJWs, the Toad of Tor is a <i>shameless liar</i>. First, the Sad Puppies have NEVER said the Hugos should just belong to us. We haven’t said it, we haven’t implied it, and in fact, none of us have ever even <i>thought</i> it. It’s not even remotely credible to claim that a group of “outsiders”, of “thugs” and “reavers” and “nobodies” who aren’t “part of the community” have ever believed that something that has been under Tor’s control for 30 years just belongs to us. Teresa Nielsen Hayden is not only lying, she is insulting the intelligence of every single person who reads her words.</p><p>What we have said, what we continue to say, and what we will continue to <i>prove</i>, is that the Hugo Awards do NOT belong to the small group of SJWs led by Tor Books, who for the last 15 years have been handing awards to mediocre diversity lit written by SJWs and their pet minorities. In their eyes, it’s a good thing to be celebrated when minorities such as Saladin and Jeminsin are nominated for awards. It’s a bad thing to be decried when minorities such as Correia and Day are nominated for them.</p><p>The only people who have claimed ownership of the Hugos is Teresa Nielsen Hayden and the SJWs. They are already <a href=\"http://nielsenhayden.com/makinglight/archives/016177.html#4059254\">clamoring for rules changes</a> <i>before the nominations have even been announced</i>. The Toad is one of those affiliated with Tor who have, somewhat successfully, turned the Hugos (and the Nebulas, for that matter), into the Best SJW-Endorsed Writers of the Year award. The Toad obviously knows how badly she screwed up because she’s resorting to a ridiculous technicality in order to rewrite the narrative and deny that she said what she quite clearly said:</p><blockquote class=\"tr_bq\"><p> “When I say the Hugos belong to the worldcon, I’m talking about the literal legal status of the award. But I also know that one of the biggest reasons the rocket is magic is because it spiritually belongs to all of us who love SF.”<br> – Teresa Nielsen Hayden, March 30, 2015, 10:15 PM</br></p></blockquote><p>Sure you were. It “spiritually belongs” to everyone, so they can fuck off “and start their own award”. That makes sense. Sad Puppies 3 leader Brad Torgersen <a href=\"https://bradrtorgersen.wordpress.com/2015/03/30/former-tor-editor-still-longs-to-gatekeep-the-field/\">responds in his own inimitable fashion</a>:</p><blockquote class=\"tr_bq\"><p> We.  Matter.  In fact, we have always mattered.  Everyone who ever<br> came to love and cherish SF/F in ways not vetted and approved by you, by<br> TruFans, or by SMOFs.</br></br></p><p>And we’re not going away.  Not this year.  Not next year.  Not the year after that.</p><p>We’re not here to destroy the field, nor the Hugos.</p><p>We’re here to keep you from greedily clutching the award to your chest, while the field sinks beneath the waves.</p></blockquote><p>That is precisely what Sad Puppies is about. As for Rabid Puppies, we don’t want to destroy the field or the Hugos either. We want to destroy the SJWs. We want to crush them into dust. And we will.</p><p>If you’re not already marching with the Evil Legion of Evil under one Puppy banner or another, I encourage you to join us. We can always use the reinforcements, and as other Sad and Rabid Puppies can testify, it is invigorating to crush your enemies, see them driven before you, and hear the croaking lamentations of their women.</p><p>As Brad said, we’re not going away next year. And with Kate the Impaler holding the black standard, we’re not going to be inclined to show any mercy to the liars and the con artists. Nor, I suspect, will GamerGate.</p><blockquote class=\"tr_bq\"><p> I want the Justice Department to declare them a criminal organization and hit them with felony charges. It would not be an excessive response to their actions. <br> – Teresa Nielsen Hayden, <a href=\"http://nielsenhayden.com/makinglight/archives/016177.html#4059966\">March 30, 2015, 11:25 PM</a></br></p></blockquote><p>UPDATE: And here Larry and I were repeatedly accused of gaming the Hugos last year. I told them I didn’t, that I had nothing to do with it, but they didn’t believe me. <a href=\"http://www.jasonsanford.com/blog/2015/3/yes-the-sad-puppies-campaign-swept-the-hugo-awards\">If Jason Sanford is correct, perhaps they will now admit the accusation was false</a>.</p></div>",
  "content_text": "The Toad of Tor, Teresa Nielsen Hayden, belatedly realized she’d shown the true face of SJW gatekeeper privilege to the world because she’s desperately trying to walk back her words. But it’s much too late; we’ve already impaled her upon them. She even alarmed her fellow SJWs.\n“I will admit to having been in kind of an unsettled state since\nTeresa’s “this is the Worldcon award, and others can go do their own\nthing” post. But then I may well not be the only one in that state, too.”\nCompare and contrast this statement:\n“The Hugos don’t belong to the set of all people who read the genre; they belong to the worldcon, and the people who attend and/or support it. The set of all people who read SF can start their own award.”\n– Teresa Nielsen Hayden,\nMarch 29, 2015, 03:43 PM\nWith this one:\n“I should have been clearer. Those of us who love SF and love fandom know in our hearts that the Hugo is ours. One of the most upsetting things about the Sad Puppy campaigns is that they’re saying the Hugo shouldn’t belong to all of us, it should just belong to them.”\n– Teresa Nielsen Hayden,\nMarch 30, 2015, 10:15 PM\nLike all SJWs, the Toad of Tor is a\nshameless liar\n. First, the Sad Puppies have NEVER said the Hugos should just belong to us. We haven’t said it, we haven’t implied it, and in fact, none of us have ever even\nthought\nit. It’s not even remotely credible to claim that a group of “outsiders”, of “thugs” and “reavers” and “nobodies” who aren’t “part of the community” have ever believed that something that has been under Tor’s control for 30 years just belongs to us. Teresa Nielsen Hayden is not only lying, she is insulting the intelligence of every single person who reads her words.\nWhat we have said, what we continue to say, and what we will continue to\nprove\n, is that the Hugo Awards do NOT belong to the small group of SJWs led by Tor Books, who for the last 15 years have been handing awards to mediocre diversity lit written by SJWs and their pet minorities. In their eyes, it’s a good thing to be celebrated when minorities such as Saladin and Jeminsin are nominated for awards. It’s a bad thing to be decried when minorities such as Correia and Day are nominated for them.\nThe only people who have claimed ownership of the Hugos is Teresa Nielsen Hayden and the SJWs. They are already\nclamoring for rules changes\nbefore the nominations have even been announced\n. The Toad is one of those affiliated with Tor who have, somewhat successfully, turned the Hugos (and the Nebulas, for that matter), into the Best SJW-Endorsed Writers of the Year award. The Toad obviously knows how badly she screwed up because she’s resorting to a ridiculous technicality in order to rewrite the narrative and deny that she said what she quite clearly said:\n“When I say the Hugos belong to the worldcon, I’m talking about the literal legal status of the award. But I also know that one of the biggest reasons the rocket is magic is because it spiritually belongs to all of us who love SF.”\n– Teresa Nielsen Hayden, March 30, 2015, 10:15 PM\nSure you were. It “spiritually belongs” to everyone, so they can fuck off “and start their own award”. That makes sense. Sad Puppies 3 leader Brad Torgersen\nresponds in his own inimitable fashion\n:\nWe.  Matter.  In fact, we have always mattered.  Everyone who ever\ncame to love and cherish SF/F in ways not vetted and approved by you, by\nTruFans, or by SMOFs.\nAnd we’re not going away.  Not this year.  Not next year.  Not the year after that.\nWe’re not here to destroy the field, nor the Hugos.\nWe’re here to keep you from greedily clutching the award to your chest, while the field sinks beneath the waves.\nThat is precisely what Sad Puppies is about. As for Rabid Puppies, we don’t want to destroy the field or the Hugos either. We want to destroy the SJWs. We want to crush them into dust. And we will.\nIf you’re not already marching with the Evil Legion of Evil under one Puppy banner or another, I encourage you to join us. We can always use the reinforcements, and as other Sad and Rabid Puppies can testify, it is invigorating to crush your enemies, see them driven before you, and hear the croaking lamentations of their women.\nAs Brad said, we’re not going away next year. And with Kate the Impaler holding the black standard, we’re not going to be inclined to show any mercy to the liars and the con artists. Nor, I suspect, will GamerGate.\nI want the Justice Department to declare them a criminal organization and hit them with felony charges. It would not be an excessive response to their actions.\n– Teresa Nielsen Hayden,\nMarch 30, 2015, 11:25 PM\nUPDATE: And here Larry and I were repeatedly accused of gaming the Hugos last year. I told them I didn’t, that I had nothing to do with it, but they didn’t believe me.\nIf Jason Sanford is correct, perhaps they will now admit the accusation was false\n.",
  "tags": [
    "#GamerGate",
    "Hugo Award",
    "SJW"
  ],
  "categories": [],
  "sitemap_lastmod": "2015-03-31T11:30:00+00:00"
}