{
  "url": "https://voxday.net/2015/03/24/the-benefits-of-abolishing-high-schoo/",
  "scraped_at": "2025-12-16T12:49:37.328377",
  "title": "The benefits of abolishing high school",
  "date_display": "March 24, 2015",
  "date_iso": "2015-03-24T11:08:00+00:00",
  "date_from_url": "2015-03-24",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>It wouldn’t just help those on the bottom, but quite a few of <a href=\"http://althouse.blogspot.ch/2015/03/but-abolishing-high-school-would-not.html\">those on top as well</a>:</p><blockquote class=\"tr_bq\"><p> [A]bolishing high school would not just benefit those who are at the bottom of its hierarchies. Part of the shared legacy of high school is bemused stories about people who were treated as demigods at seventeen and never recovered. A doctor I hang out with tells me that former classmates who were more socially successful in high school than he was seem baffled that he, a quiet youth who made little impression, could be more professionally successful, as though the qualities that made them popular should have effortlessly floated them through life. It’s easy to laugh, but there is a real human cost.</p></blockquote><p>I think we see some of the human flotsam and jetsam that is the result of high school shipwrecks floating through here from time to time. From the overconfident midwit who has never recovered from the experience of being the smartest guy in a room with a 115 IQ to the deluded ex-cheerleader who is now fifty pounds overweight but still thinks she’s as attractive to men as she was when she could fit into her little skirts to the bitter omega who can’t accept a compliment at face value for fear that it is another cruel trick intended to humiliate him, the psychological scars of the high school experience are often visible to complete strangers on the Internet.</p><p>I tend to include myself in that mix, although perhaps wrongly since my psychological idiosyncracies tend to trace back deeper, which is to say, back to elementary school. My suspicion is that being constantly pushed around and marginalized by one’s intellectual and athletic inferiors, and thereby simultaneously finding oneself at the bottom of some social hierarchies and at the top of others at a very young age, tends to leave one permanently unable to take any of them very seriously or place much value upon them, for good or for ill. When one is both king and beggar, how can one find one’s identity in either state?</p><p>For a while, I thought it was strength of character or innate stoicism that enabled me to so easily walk away from various attachments and obligations without looking back. But eventually, it became clear that it was not a positive attribute, it was simply that I was lacking something normal, in much the same way sociopaths lack empathy, autistics lack social cognizance, and atheists <a href=\"http://blogs.discovermagazine.com/gnxp/2011/09/what-atheism-and-autism-may-have-in-common/\">lack an intuition of the supernatural</a>. Specifically what it is, I don’t know, but one might describe it as lack of set bonding.</p><p>So, I don’t think the abolition of high school would have made much difference to me, but I do think it would greatly benefit those who are either oppressed by the social hierarchy or crippled by too much success too soon in it. And, of course, ending the intellectual lobotomization of entire generations by maleducated, intellectually sub-standard propagandists of the State would be a desirable outcome too.</p></div>",
  "content_text": "It wouldn’t just help those on the bottom, but quite a few of\nthose on top as well\n:\n[A]bolishing high school would not just benefit those who are at the bottom of its hierarchies. Part of the shared legacy of high school is bemused stories about people who were treated as demigods at seventeen and never recovered. A doctor I hang out with tells me that former classmates who were more socially successful in high school than he was seem baffled that he, a quiet youth who made little impression, could be more professionally successful, as though the qualities that made them popular should have effortlessly floated them through life. It’s easy to laugh, but there is a real human cost.\nI think we see some of the human flotsam and jetsam that is the result of high school shipwrecks floating through here from time to time. From the overconfident midwit who has never recovered from the experience of being the smartest guy in a room with a 115 IQ to the deluded ex-cheerleader who is now fifty pounds overweight but still thinks she’s as attractive to men as she was when she could fit into her little skirts to the bitter omega who can’t accept a compliment at face value for fear that it is another cruel trick intended to humiliate him, the psychological scars of the high school experience are often visible to complete strangers on the Internet.\nI tend to include myself in that mix, although perhaps wrongly since my psychological idiosyncracies tend to trace back deeper, which is to say, back to elementary school. My suspicion is that being constantly pushed around and marginalized by one’s intellectual and athletic inferiors, and thereby simultaneously finding oneself at the bottom of some social hierarchies and at the top of others at a very young age, tends to leave one permanently unable to take any of them very seriously or place much value upon them, for good or for ill. When one is both king and beggar, how can one find one’s identity in either state?\nFor a while, I thought it was strength of character or innate stoicism that enabled me to so easily walk away from various attachments and obligations without looking back. But eventually, it became clear that it was not a positive attribute, it was simply that I was lacking something normal, in much the same way sociopaths lack empathy, autistics lack social cognizance, and atheists\nlack an intuition of the supernatural\n. Specifically what it is, I don’t know, but one might describe it as lack of set bonding.\nSo, I don’t think the abolition of high school would have made much difference to me, but I do think it would greatly benefit those who are either oppressed by the social hierarchy or crippled by too much success too soon in it. And, of course, ending the intellectual lobotomization of entire generations by maleducated, intellectually sub-standard propagandists of the State would be a desirable outcome too.",
  "tags": [
    "education",
    "society"
  ],
  "categories": [],
  "sitemap_lastmod": "2015-03-24T11:08:00+00:00"
}