{
  "url": "https://voxday.net/2015/03/05/the-banality-of-killing/",
  "scraped_at": "2025-12-16T12:47:32.501648",
  "title": "The banality of killing",
  "date_display": "March 5, 2015",
  "date_iso": "2015-03-05T14:04:00+00:00",
  "date_from_url": "2015-03-05",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>The higher up the chain of command you are, <a href=\"http://www.nytimes.com/2015/03/01/opinion/sunday/how-we-learned-to-kill.html?_r=0\">the easier it is</a>:</p><blockquote class=\"tr_bq\"><p> I spent every day of my seven-month deployment in Afghanistan trying to figure out how to kill the Taliban commander in my area. He lived and operated to our north and every day would send his soldiers down to plant bombs, terrorize the villages and wrestle with us for control of the area. Our mission was to secure the villages and provide economic and political development, but that was slow work with intangible results. Killing the Taliban commander would be an objective measure of success.</p><p>I never killed him. Instead, each day we would kill his soldiers or his soldiers would kill our Marines. The longer I lived among the Afghans, the more I realized that neither the Taliban nor we were fighting for the reasons I expected. Despite the rhetoric I internalized from the newspapers back home about why we were in Afghanistan, I ended up fighting for different reasons once I got on the ground — a mix of loyalty to my Marines, habit and the urge to survive.</p><p>The enemy fighters were often young men raised alongside poppy fields in small farms set up like latticework along the river. They must have been too young and too isolated to understand anything outside of their section of the valley, never mind something global like the 9/11 attacks. These villagers fought us because that’s what they always did when foreigners came to their village. Perhaps they just wanted to be left alone.</p><p>The more I thought about the enemy, the harder it was to view them as evil or subhuman. But killing requires a motivation, so the concept of self-defense becomes the defining principle of target attractiveness. If someone is shooting at me, I have a right to fire back. But this is a legal justification, not a moral one. The comic Louis C.K. brilliantly pointed out this absurdity: “Maybe if you pick up a gun and go to another country and you get shot, it’s not that weird. Maybe if you get shot by the dude you were just shooting at, it’s a tiny bit your fault.”</p><p>My worst fear before deploying was what, in training, we called “good shoot, bad result.” But there is no way in the chaos and uncertainty of war to make the right decision all the time. On one occasion, the Taliban had been shooting at us and we thought two men approaching in the distance were armed and intended to kill us. We warned them off, but it did no good. They continued to approach, and so my Marines fired. What possible reason could two men have to approach a squad of armed Marines in a firefight? When it was over and the two men lay dead we saw that they were unarmed, just two men trying to go home, who never made it.</p><p>On most occasions, when ordnance would destroy the enemy or a sniper would kill a Taliban fighter, we would engage in the professional congratulations of a job well done like businessmen after a successful client meeting. Nothing of the sort happened after killing a civilian. And in this absence of group absolution, I saw for the first time how critical it actually was for my soul and my sanity.</p><p>Nobody ever talked about the accidental killing. There was paperwork, a brief investigation and silence. You can’t tell someone who has killed an innocent person that he did the right thing even if he followed all the proper procedures before shooting.</p></blockquote><p>It is somewhat amusing that Americans are <i>still </i>insisting that the United States are “the good guys” in all of this long and sordid history of invading and occupying other countries. How many more countries do they have to occupy, how many more innocent civilians have to be killed by American soldiers, before Americans wake up to the fact that, just maybe, the country which has invaded and is currently occupying literally dozens of sovereign countries is not, in fact, “the good guys”.</p><p>The fact that there are bad guys out there does not automatically make those who oppose them good. When Hitler and Stalin went to war, who was the good guy?</p><p>Donald Rumsfeld once said that the USA could only win if it killed terrorists faster than it created new ones. Considering that we’re now 14 years into “the war on terror”, I think it should be obvious that the USA did not win on the basis of his metric. Forget peace, give isolation a chance.</p><p>I’m not a big fan of Louis CK, but in this case, he has a point. “Maybe if you pick up a gun and go to another country and you get shot,<br> it’s not that weird. Maybe if you get shot by the dude you were just<br> shooting at, it’s a tiny bit your fault.”</br></br></p><p>Afghanistan is not our business. Ukraine is not our business. Iraq is not our business. Syria is not our business. Iran is not our business. And while the neocons are off playing Risk in foreign lands, the homeland has been invaded by 50 million invaders. The only war genuinely worth fighting is the one being completely overlooked and ignored.</p><p>The author concludes:</p><blockquote class=\"tr_bq\"><p> Ensuring our own safety and the defense of a peaceful world may require<br> training boys and girls to kill, creating technology that allows us to<br> destroy anyone on the planet instantly, dehumanizing large segments of<br> the global population and then claiming there is a moral sanctity in<br> killing. To fathom this system and accept its use for the greater good<br> is to understand that we still live in a state of nature.</br></br></br></br></br></p></blockquote><p>Monsters so often tell themselves they are heroes.</p></div>",
  "content_text": "The higher up the chain of command you are,\nthe easier it is\n:\nI spent every day of my seven-month deployment in Afghanistan trying to figure out how to kill the Taliban commander in my area. He lived and operated to our north and every day would send his soldiers down to plant bombs, terrorize the villages and wrestle with us for control of the area. Our mission was to secure the villages and provide economic and political development, but that was slow work with intangible results. Killing the Taliban commander would be an objective measure of success.\nI never killed him. Instead, each day we would kill his soldiers or his soldiers would kill our Marines. The longer I lived among the Afghans, the more I realized that neither the Taliban nor we were fighting for the reasons I expected. Despite the rhetoric I internalized from the newspapers back home about why we were in Afghanistan, I ended up fighting for different reasons once I got on the ground — a mix of loyalty to my Marines, habit and the urge to survive.\nThe enemy fighters were often young men raised alongside poppy fields in small farms set up like latticework along the river. They must have been too young and too isolated to understand anything outside of their section of the valley, never mind something global like the 9/11 attacks. These villagers fought us because that’s what they always did when foreigners came to their village. Perhaps they just wanted to be left alone.\nThe more I thought about the enemy, the harder it was to view them as evil or subhuman. But killing requires a motivation, so the concept of self-defense becomes the defining principle of target attractiveness. If someone is shooting at me, I have a right to fire back. But this is a legal justification, not a moral one. The comic Louis C.K. brilliantly pointed out this absurdity: “Maybe if you pick up a gun and go to another country and you get shot, it’s not that weird. Maybe if you get shot by the dude you were just shooting at, it’s a tiny bit your fault.”\nMy worst fear before deploying was what, in training, we called “good shoot, bad result.” But there is no way in the chaos and uncertainty of war to make the right decision all the time. On one occasion, the Taliban had been shooting at us and we thought two men approaching in the distance were armed and intended to kill us. We warned them off, but it did no good. They continued to approach, and so my Marines fired. What possible reason could two men have to approach a squad of armed Marines in a firefight? When it was over and the two men lay dead we saw that they were unarmed, just two men trying to go home, who never made it.\nOn most occasions, when ordnance would destroy the enemy or a sniper would kill a Taliban fighter, we would engage in the professional congratulations of a job well done like businessmen after a successful client meeting. Nothing of the sort happened after killing a civilian. And in this absence of group absolution, I saw for the first time how critical it actually was for my soul and my sanity.\nNobody ever talked about the accidental killing. There was paperwork, a brief investigation and silence. You can’t tell someone who has killed an innocent person that he did the right thing even if he followed all the proper procedures before shooting.\nIt is somewhat amusing that Americans are\nstill\ninsisting that the United States are “the good guys” in all of this long and sordid history of invading and occupying other countries. How many more countries do they have to occupy, how many more innocent civilians have to be killed by American soldiers, before Americans wake up to the fact that, just maybe, the country which has invaded and is currently occupying literally dozens of sovereign countries is not, in fact, “the good guys”.\nThe fact that there are bad guys out there does not automatically make those who oppose them good. When Hitler and Stalin went to war, who was the good guy?\nDonald Rumsfeld once said that the USA could only win if it killed terrorists faster than it created new ones. Considering that we’re now 14 years into “the war on terror”, I think it should be obvious that the USA did not win on the basis of his metric. Forget peace, give isolation a chance.\nI’m not a big fan of Louis CK, but in this case, he has a point. “Maybe if you pick up a gun and go to another country and you get shot,\nit’s not that weird. Maybe if you get shot by the dude you were just\nshooting at, it’s a tiny bit your fault.”\nAfghanistan is not our business. Ukraine is not our business. Iraq is not our business. Syria is not our business. Iran is not our business. And while the neocons are off playing Risk in foreign lands, the homeland has been invaded by 50 million invaders. The only war genuinely worth fighting is the one being completely overlooked and ignored.\nThe author concludes:\nEnsuring our own safety and the defense of a peaceful world may require\ntraining boys and girls to kill, creating technology that allows us to\ndestroy anyone on the planet instantly, dehumanizing large segments of\nthe global population and then claiming there is a moral sanctity in\nkilling. To fathom this system and accept its use for the greater good\nis to understand that we still live in a state of nature.\nMonsters so often tell themselves they are heroes.",
  "tags": [
    "war"
  ],
  "categories": [],
  "sitemap_lastmod": "2015-03-05T14:04:00+00:00"
}