{
  "url": "https://voxday.net/2015/03/10/this-is-christian-leadership/",
  "scraped_at": "2025-12-16T12:48:10.003582",
  "title": "This is Christian leadership",
  "date_display": "March 10, 2015",
  "date_iso": "2015-03-10T16:00:00+00:00",
  "date_from_url": "2015-03-10",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>The nations of Europe are throwing off the poisoned dream of multiculturalism. And I don’t think it is an accident that it is those who successfully survived decades of socialism that are the first to clearly recognize the evils of diversity. From the Prime Minister of Hungary’s <a href=\"http://www.kormany.hu/en/the-prime-minister/the-prime-minister-s-speeches/the-next-years-will-be-about-hardworking-people\">State of the Nation address</a>:</p><blockquote class=\"tr_bq\"><p> The Honourable Chair has mentioned wiseacre analysts who take the view that the concept of a civic Hungary (i.e. one based on Christian-democratic, conservative principles) is merely a political product, and that this has somewhat shaken the faith of the members of our political community. I understand the concerns, but I hope for more self-confidence from Reformed Church pastors, let alone ministers. For our flag is flying high; everyone can see that. Everyone can see that we are a people’s party community, based on Christian-democratic foundations – the ideal, guiding star of which is a civic Hungary. I do not think that this would change in the next hundred years….</p><p>Hungary gave its own answers to the most important European questions in<br> 2010. Already since 2010, we have been living in the future which many<br> other countries are only just setting out towards or will attempt to<br> reach sooner or later. Europe today continues to huddle behind the moats<br> of political correctness, and has built a wall of taboos and dogmas<br> around itself. In contrast, we took the view that the old pre-crisis<br> world will not return. There are things from past periods which are<br> worth keeping, such as democracy – as far as possible in a form which<br> needs no modifying adjectives; but we must let go of everything that has<br> failed and has broken down. We must let go of these things before they<br> bury us beneath them. We have chosen the future. Those who do not make<br> choices find that instead circumstances will make the choices for them.<br> Those who do not actively decide will find that their lives will be<br> decided for them. We therefore let go of neo-liberal economic policy,<br> and perhaps we did so as late as we possibly could have; we let go of<br> the policy of austerity, just before we were about to share the fate of<br> Greece; we let go of the delusion of the multicultural society before it<br> turned Hungary into a refugee camp, and we let go of liberal social<br> policy which does not acknowledge the common good and denies Christian<br> culture as the natural foundation – and perhaps the only natural<br> foundation – for the organization of European societies. We decided to<br> face the barrage of unfair attacks and accusations, and also let go of<br> the dogma of political correctness.</br></br></br></br></br></br></br></br></br></br></br></br></br></br></br></br></br></br></br></br></br></br></p><p>And as far as I see it,<br> Hungarian people are by nature politically incorrect – in other words,<br> they have not yet lost their common sense.</br></br></p></blockquote><p>What a tragedy that the USA does not have such a leader. What a tragedy that we don’t even have a nation for such a leader to address.</p></div>",
  "content_text": "The nations of Europe are throwing off the poisoned dream of multiculturalism. And I don’t think it is an accident that it is those who successfully survived decades of socialism that are the first to clearly recognize the evils of diversity. From the Prime Minister of Hungary’s\nState of the Nation address\n:\nThe Honourable Chair has mentioned wiseacre analysts who take the view that the concept of a civic Hungary (i.e. one based on Christian-democratic, conservative principles) is merely a political product, and that this has somewhat shaken the faith of the members of our political community. I understand the concerns, but I hope for more self-confidence from Reformed Church pastors, let alone ministers. For our flag is flying high; everyone can see that. Everyone can see that we are a people’s party community, based on Christian-democratic foundations – the ideal, guiding star of which is a civic Hungary. I do not think that this would change in the next hundred years….\nHungary gave its own answers to the most important European questions in\n2010. Already since 2010, we have been living in the future which many\nother countries are only just setting out towards or will attempt to\nreach sooner or later. Europe today continues to huddle behind the moats\nof political correctness, and has built a wall of taboos and dogmas\naround itself. In contrast, we took the view that the old pre-crisis\nworld will not return. There are things from past periods which are\nworth keeping, such as democracy – as far as possible in a form which\nneeds no modifying adjectives; but we must let go of everything that has\nfailed and has broken down. We must let go of these things before they\nbury us beneath them. We have chosen the future. Those who do not make\nchoices find that instead circumstances will make the choices for them.\nThose who do not actively decide will find that their lives will be\ndecided for them. We therefore let go of neo-liberal economic policy,\nand perhaps we did so as late as we possibly could have; we let go of\nthe policy of austerity, just before we were about to share the fate of\nGreece; we let go of the delusion of the multicultural society before it\nturned Hungary into a refugee camp, and we let go of liberal social\npolicy which does not acknowledge the common good and denies Christian\nculture as the natural foundation – and perhaps the only natural\nfoundation – for the organization of European societies. We decided to\nface the barrage of unfair attacks and accusations, and also let go of\nthe dogma of political correctness.\nAnd as far as I see it,\nHungarian people are by nature politically incorrect – in other words,\nthey have not yet lost their common sense.\nWhat a tragedy that the USA does not have such a leader. What a tragedy that we don’t even have a nation for such a leader to address.",
  "tags": [
    "Christianity",
    "Clash of Civilizations"
  ],
  "categories": [],
  "sitemap_lastmod": "2015-03-10T16:00:00+00:00"
}