{
  "url": "https://voxday.net/2015/03/18/understanding-feminazis/",
  "scraped_at": "2025-12-16T12:49:01.162868",
  "title": "Understanding feminazis",
  "date_display": "March 18, 2015",
  "date_iso": "2015-03-18T16:00:00+00:00",
  "date_from_url": "2015-03-18",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>I’ve always said that calling a feminist a feminazi was an insult to the German National Socialist Workers Party. Now a Firefox plugin makes that clear by <a href=\"http://menkampf.com/\">translating feminist hate-speech into the original German</a>:</p><blockquote class=\"tr_bq\"><p> “Not a coincidence it’s always zionists and jews committing mass shootings. The pattern is connected to ideas of zionism in our culture.”<br> – Anita Sarkeesian.</br></p><p>“All mainstream press of Judaisms, no matter how fair-minded the<br> writers try to be, has ended up concluding that they are, in fact, a<br> bunch of smelly Jews who are delusional at best and manipulative abusers<br> at worst.”<br> – Amanda Marcotte</br></br></br></br></p><p>“A radical fix to the world’s wage gap: why not just pay Aryans more – and pay Jews less?”<br> – Jessica Valenti</br></p><p>“The saddest thing for an Aryan to do is to dumb themselves down for a Jew.”<br> – Emma Watson </br></p></blockquote><p>It’s always very important to understand what one’s enemies are really saying, after all.</p></div>",
  "content_text": "I’ve always said that calling a feminist a feminazi was an insult to the German National Socialist Workers Party. Now a Firefox plugin makes that clear by\ntranslating feminist hate-speech into the original German\n:\n“Not a coincidence it’s always zionists and jews committing mass shootings. The pattern is connected to ideas of zionism in our culture.”\n– Anita Sarkeesian.\n“All mainstream press of Judaisms, no matter how fair-minded the\nwriters try to be, has ended up concluding that they are, in fact, a\nbunch of smelly Jews who are delusional at best and manipulative abusers\nat worst.”\n– Amanda Marcotte\n“A radical fix to the world’s wage gap: why not just pay Aryans more – and pay Jews less?”\n– Jessica Valenti\n“The saddest thing for an Aryan to do is to dumb themselves down for a Jew.”\n– Emma Watson\nIt’s always very important to understand what one’s enemies are really saying, after all.",
  "tags": [
    "politics",
    "technology"
  ],
  "categories": [],
  "sitemap_lastmod": "2015-03-18T16:00:00+00:00"
}