{
  "url": "https://voxday.net/2015/03/18/wearing-murdochs-leas/",
  "scraped_at": "2025-12-16T12:48:57.837856",
  "title": "Wearing Murdoch’s leash",
  "date_display": "March 18, 2015",
  "date_iso": "2015-03-18T09:25:00+00:00",
  "date_from_url": "2015-03-18",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>Fox News may be better than the ABCNNBCBS cabal, but don’t ever mistake them for the good guys, or even being reliably pro-American. And <a href=\"http://www.politico.com/blogs/media/2015/03/mickey-kaus-quits-daily-caller-after-tucker-carlson-204135.html\">they do NOT like criticism</a> coming from the nationalist right:</p><blockquote class=\"tr_bq\"><p> The blogger Mickey Kaus has quit his job at The Daily Caller after the conservative site’s editor-in-chief, Tucker Carlson, pulled a critical column about Fox News from the site, Kaus told the On Media blog on Tuesday.</p><p>“It’s pretty simple,” Kaus said in an interview, “I wrote a piece attacking Fox for not being the opposition on immigration and amnesty — for filling up the airwaves with reports on ISIS and terrorism, and not fulfilling their responsibility of being the opposition on amnesty and immigration…. I posted it at 6:30 in the morning. When I got up, Tucker had taken it down. He said, ‘We can’t trash Fox on the site. I work there.'”</p><p>Carlson, who co-founded The Daily Caller in 2010, is a conservative contributor to Fox News and the host of its weekend edition of “Fox &amp; Friends.”</p><p>Kaus says when he told Carlson he needed to be able to write about Fox, Carlson told him it was a hard-and-fast rule, and non-negotiable.</p><p>“He said it was a rule, and he wouldn’t be able to change that rule. So I told him I quit,” Kaus explained. “I just don’t see how you can put out a publication with that kind of giant no-go area. It’s not like we’re owned by Joe’s Muffler Shop, so we just can’t write about Joe’s Muffler shop.”</p></blockquote><p>This is entirely par for the Fox News course. Ten years ago I was writing<i> </i>a book called <a href=\"http://www.milobookclub.com/2005/11/30/media-whores-chapter-two/\"><i>Media Whores</i></a> that was signed to Thomas Nelson. The executives were very upset when they discovered that it wasn’t only about the media whores of the Left, but contained chapters about Michelle Malkin and Bill O’Reilly as well.</p><p><a href=\"http://www.milobookclub.com/2005/02/02/no-more-media-whores/\">The official line</a> about the sudden cancellation was that the book wasn’t expected to sell well enough to justify the marketing. However, I was told by someone inside the organization, who was definitely in a position to know what really happened, that the outline and sample chapters I’d provided were shown to Fox, who indicated that they would prefer that it was not published. So, the book was duly canceled six weeks after the contract was signed, although I did get paid for it.</p><p>This was not my only experience of this variety. And perhaps you’ll understand that my disregard for mainstream publishers is not entirely rooted in my disdain for the SJW gatekeepers in SF/F.</p></div>",
  "content_text": "Fox News may be better than the ABCNNBCBS cabal, but don’t ever mistake them for the good guys, or even being reliably pro-American. And\nthey do NOT like criticism\ncoming from the nationalist right:\nThe blogger Mickey Kaus has quit his job at The Daily Caller after the conservative site’s editor-in-chief, Tucker Carlson, pulled a critical column about Fox News from the site, Kaus told the On Media blog on Tuesday.\n“It’s pretty simple,” Kaus said in an interview, “I wrote a piece attacking Fox for not being the opposition on immigration and amnesty — for filling up the airwaves with reports on ISIS and terrorism, and not fulfilling their responsibility of being the opposition on amnesty and immigration…. I posted it at 6:30 in the morning. When I got up, Tucker had taken it down. He said, ‘We can’t trash Fox on the site. I work there.'”\nCarlson, who co-founded The Daily Caller in 2010, is a conservative contributor to Fox News and the host of its weekend edition of “Fox & Friends.”\nKaus says when he told Carlson he needed to be able to write about Fox, Carlson told him it was a hard-and-fast rule, and non-negotiable.\n“He said it was a rule, and he wouldn’t be able to change that rule. So I told him I quit,” Kaus explained. “I just don’t see how you can put out a publication with that kind of giant no-go area. It’s not like we’re owned by Joe’s Muffler Shop, so we just can’t write about Joe’s Muffler shop.”\nThis is entirely par for the Fox News course. Ten years ago I was writing\na book called\nMedia Whores\nthat was signed to Thomas Nelson. The executives were very upset when they discovered that it wasn’t only about the media whores of the Left, but contained chapters about Michelle Malkin and Bill O’Reilly as well.\nThe official line\nabout the sudden cancellation was that the book wasn’t expected to sell well enough to justify the marketing. However, I was told by someone inside the organization, who was definitely in a position to know what really happened, that the outline and sample chapters I’d provided were shown to Fox, who indicated that they would prefer that it was not published. So, the book was duly canceled six weeks after the contract was signed, although I did get paid for it.\nThis was not my only experience of this variety. And perhaps you’ll understand that my disregard for mainstream publishers is not entirely rooted in my disdain for the SJW gatekeepers in SF/F.",
  "tags": [
    "media",
    "politics"
  ],
  "categories": [],
  "sitemap_lastmod": "2015-03-18T09:25:00+00:00"
}