{
  "url": "https://voxday.net/2015/03/31/why-western-troops-cant-win/",
  "scraped_at": "2025-12-16T12:50:28.315480",
  "title": "Why Western troops can’t win",
  "date_display": "March 31, 2015",
  "date_iso": "2015-03-31T09:23:00+00:00",
  "date_from_url": "2015-03-31",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>Martin van Creveld, the author of <i>The Transformation of War</i>, <i>Technology and War</i>, and the newly published Castalia House books <b><a href=\"http://www.amazon.com/History-Strategy-From-William-Lind-ebook/dp/B00V94520E\"><i>A History of Strategy: From Sun Tzu to William S. Lind</i></a></b> and <b><a href=\"http://www.amazon.com/Equality-Impossible-Martin-van-Creveld-ebook/dp/B00UVLE20W\"><i>Equality: The Impossible Quest</i></a></b>, explains how the technological transformation of war has ruined the effectiveness of modern Western militiaries despite their massive technological advantages over their opponents. From his essay entitled <a href=\"http://www.martin-van-creveld.com/?p=77\">“Pussycats”</a>:</p><blockquote class=\"tr_bq\"><p> For several decades now, Western armed forces—which keep preening themselves as the best-trained, best organized, best equipped best led, in history—have been turned into pussycats. Being pussycats, they went from one defeat to the next. True, in 1999 they did succeed in imposing their will on Serbia. But only because the opponent was a small, weak state (at the time, the Serb armed forces, exhausted by a prolonged civil war, were rated 35th in the world); and even then only because that state was practically defenseless in the air. The same applies to Libya in 2011. Over there, indigenous bands on the ground did most of the fighting and took all the casualties. In both cases, when it came to engaging in ground combat, man against man, the West, with the U.S at its head, simply did not have what it takes.</p><p>On other occasions things were worse still. Western armies tried to create order in Somalia and were kicked out by the “Skinnies,” as they called their lean but mean opponents. They tried to beat the Taliban in Afghanistan, and were kicked out. They tried to impose democracy (and get their hands on oil) in Iraq, and ended up leaving with their tails between their legs. The cost of these foolish adventures to the U.S alone is said to have been around 1 trillion—1,000,000,000,000—dollars. With one defeat following another, is it any wonder that, when those forces were called upon to put an end to the civil war in Syria, they and the societies they serve preferred to let the atrocities go on?</p><p>By far the most important single reason behind the repeated failures is the fact that, one and all, these were luxury wars. With nuclear weapons deterring large-scale attack, for seven decades now no Western country has waged anything like a serious, let alone existential, struggle against a more or less equal opponent. As the troops took on opponents much weaker than themselves—often in places they had never heard about, often for reasons nobody but a few politicians understood—they saw no reason why they should get themselves killed. Given the circumstances, indeed, doing so would have been the height of stupidity on their part. Yet from the time the Persians at Marathon in 490 B.C were defeated by the outnumbered Greeks right down to the present, troops whose primary concern is not to get themselves killed have never be able to fight, let alone win.</p></blockquote><p><a href=\"http://www.milobookclub.com/wp-content/uploads/2015/03/AHOS_960.jpg\" imageanchor=\"1\" style=\"clear: left; float: left; margin-bottom: 1em; margin-right: 1em;\"><img border=\"0\" decoding=\"async\" fetchpriority=\"high\" height=\"320\" src=\"http://www.milobookclub.com/wp-content/uploads/2015/03/AHOS_960.jpg\" width=\"200\"/></a> Thanks to many of you, <b><a href=\"http://www.amazon.com/History-Strategy-From-William-Lind-ebook/dp/B00V94520E\"><i>A History of Strategy: From Sun Tzu to William S. Lind</i></a></b> is the #1 bestseller in History&gt;Military&gt;Strategy. The reviews are excellent; even the single 3-star review concludes: “Belongs of the shelf of every person who is interested in the theory and practice of warfare.” </p><p>Another review says: “<i>A History of Strategy: From Sun Tzu to William S. Lind</i> earned five stars from me for being so readable and packed with content, despite being so brief. This is the first book of Martin van Creveld’s I have read and I look forward to delving into his catalog. In addition to being a good read, Martin van Creveld’s svelte <i>A History of Strategy: From Sun Tzu to William S. Lind </i>is a wonderful way for those not well read in military strategy to begin their self-directed study. Martin van Creveld discusses all the notable war theoretician authors more or less in accord with their significance as well as some of the war artisan authors. Creveld also provides a “Further Readings” section to aid those so inclined. Given the limitations imposed on him (low page count) Creveld does a fine job covering the material.”</p><p>I’m in the middle of reading van Creveld’s <i>Technology and War</i> myself, and I can say with confidence that the reviewer will find delving into that catalog more than worthwhile. As for the “Pussycats” essay, the observation by a military historian should cause some serious strategic rethinking on the part of those who insist on repeatedly sending unmotivated troops unsupported by popular enthusiasm into unwinnable military conflicts. It won’t, but it should.</p></div>",
  "content_text": "Martin van Creveld, the author of\nThe Transformation of War\n,\nTechnology and War\n, and the newly published Castalia House books\nA History of Strategy: From Sun Tzu to William S. Lind\nand\nEquality: The Impossible Quest\n, explains how the technological transformation of war has ruined the effectiveness of modern Western militiaries despite their massive technological advantages over their opponents. From his essay entitled\n“Pussycats”\n:\nFor several decades now, Western armed forces—which keep preening themselves as the best-trained, best organized, best equipped best led, in history—have been turned into pussycats. Being pussycats, they went from one defeat to the next. True, in 1999 they did succeed in imposing their will on Serbia. But only because the opponent was a small, weak state (at the time, the Serb armed forces, exhausted by a prolonged civil war, were rated 35th in the world); and even then only because that state was practically defenseless in the air. The same applies to Libya in 2011. Over there, indigenous bands on the ground did most of the fighting and took all the casualties. In both cases, when it came to engaging in ground combat, man against man, the West, with the U.S at its head, simply did not have what it takes.\nOn other occasions things were worse still. Western armies tried to create order in Somalia and were kicked out by the “Skinnies,” as they called their lean but mean opponents. They tried to beat the Taliban in Afghanistan, and were kicked out. They tried to impose democracy (and get their hands on oil) in Iraq, and ended up leaving with their tails between their legs. The cost of these foolish adventures to the U.S alone is said to have been around 1 trillion—1,000,000,000,000—dollars. With one defeat following another, is it any wonder that, when those forces were called upon to put an end to the civil war in Syria, they and the societies they serve preferred to let the atrocities go on?\nBy far the most important single reason behind the repeated failures is the fact that, one and all, these were luxury wars. With nuclear weapons deterring large-scale attack, for seven decades now no Western country has waged anything like a serious, let alone existential, struggle against a more or less equal opponent. As the troops took on opponents much weaker than themselves—often in places they had never heard about, often for reasons nobody but a few politicians understood—they saw no reason why they should get themselves killed. Given the circumstances, indeed, doing so would have been the height of stupidity on their part. Yet from the time the Persians at Marathon in 490 B.C were defeated by the outnumbered Greeks right down to the present, troops whose primary concern is not to get themselves killed have never be able to fight, let alone win.\nThanks to many of you,\nA History of Strategy: From Sun Tzu to William S. Lind\nis the #1 bestseller in History>Military>Strategy. The reviews are excellent; even the single 3-star review concludes: “Belongs of the shelf of every person who is interested in the theory and practice of warfare.”\nAnother review says: “\nA History of Strategy: From Sun Tzu to William S. Lind\nearned five stars from me for being so readable and packed with content, despite being so brief. This is the first book of Martin van Creveld’s I have read and I look forward to delving into his catalog. In addition to being a good read, Martin van Creveld’s svelte\nA History of Strategy: From Sun Tzu to William S. Lind\nis a wonderful way for those not well read in military strategy to begin their self-directed study. Martin van Creveld discusses all the notable war theoretician authors more or less in accord with their significance as well as some of the war artisan authors. Creveld also provides a “Further Readings” section to aid those so inclined. Given the limitations imposed on him (low page count) Creveld does a fine job covering the material.”\nI’m in the middle of reading van Creveld’s\nTechnology and War\nmyself, and I can say with confidence that the reviewer will find delving into that catalog more than worthwhile. As for the “Pussycats” essay, the observation by a military historian should cause some serious strategic rethinking on the part of those who insist on repeatedly sending unmotivated troops unsupported by popular enthusiasm into unwinnable military conflicts. It won’t, but it should.",
  "tags": [
    "Castalia House",
    "war"
  ],
  "categories": [],
  "sitemap_lastmod": "2015-03-31T08:23:00+00:00"
}