{
  "url": "https://voxday.net/2019/06/16/approved-opposition-and-the-fake-speech-platforms/",
  "scraped_at": "2025-12-21T02:46:59.769949",
  "title": "Approved opposition and the fake speech platforms",
  "date_display": "June 16, 2019",
  "date_iso": "2019-06-16T14:02:23+00:00",
  "date_from_url": "2019-06-16",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>An Idka commenter is dubious about the new “free speech” social media sites:</p><blockquote><p>Just saw a video with the Parler CEO. Only watched a few minutes because it feels off enough to be uncomfortable and the pattern is so clear. There is a lot of wizardry here – the weird hypnotic rhythm, the micro-expressions not really matching the surface conversation, the selective framing, Alex Jones going too far at times… This would be the Turning Point wing of the fake right – the prominence of Candace Owens isn’t subtle.</p><p>It looks targeted to whatever is left of “traditional” civnat conservatism. Mostly Boomers at this point, I’d assume. The fake framing is that “the system” is real, the base problem is “censorship”, “the left” has gone too far, and we need to get back to what America looked like on t.v. in the Reagan era. It’s basically discourse in the fake academic sense as fly paper. Incidentally, I’d never really noticed the crazy eyes/oversized mandible that is common on deranged globohomo women.</p><p>The most disappointing thing about it is how obviously inverted it is. Right down to the veiled decadence of the homosexual host. It’s like there was an Owen sketch called The Cuck and the Sodomite, only not funny.</p></blockquote><p>He’s right to be dubious. Parler and Thinkspot are <i>exactly </i>analogical to the Intellectual Dark Web. They are fake opposition to the mainstream, approved alternatives created to allow those who are shaky in their loyalties to the Narrative to feel as if they are standing against it without actually doing so.</p><p>Notice, in particular, the way these “upstart new platforms” <a href=\"https://www.breitbart.com/tech/2019/05/01/parler-ceo-john-matze-social-media-should-be-about-trust-not-creepy-internet-tracking/\">are being treated very, very differentl</a>y than the likes of genuine alternative platforms such as BitChute, Gab, Fediway, Mastodon, and Infogalactic.</p><blockquote class=\"tr_bq\"><p>Breitbart News recently spoke with the CEO of upstart social media platform Parler about the company’s plans and what makes Parler different from Big Tech’s social media platforms. Breitbart News will begin actively posting on its official Parler account in the near future.</p></blockquote></div>",
  "content_text": "An Idka commenter is dubious about the new “free speech” social media sites:\nJust saw a video with the Parler CEO. Only watched a few minutes because it feels off enough to be uncomfortable and the pattern is so clear. There is a lot of wizardry here – the weird hypnotic rhythm, the micro-expressions not really matching the surface conversation, the selective framing, Alex Jones going too far at times… This would be the Turning Point wing of the fake right – the prominence of Candace Owens isn’t subtle.\nIt looks targeted to whatever is left of “traditional” civnat conservatism. Mostly Boomers at this point, I’d assume. The fake framing is that “the system” is real, the base problem is “censorship”, “the left” has gone too far, and we need to get back to what America looked like on t.v. in the Reagan era. It’s basically discourse in the fake academic sense as fly paper. Incidentally, I’d never really noticed the crazy eyes/oversized mandible that is common on deranged globohomo women.\nThe most disappointing thing about it is how obviously inverted it is. Right down to the veiled decadence of the homosexual host. It’s like there was an Owen sketch called The Cuck and the Sodomite, only not funny.\nHe’s right to be dubious. Parler and Thinkspot are\nexactly\nanalogical to the Intellectual Dark Web. They are fake opposition to the mainstream, approved alternatives created to allow those who are shaky in their loyalties to the Narrative to feel as if they are standing against it without actually doing so.\nNotice, in particular, the way these “upstart new platforms”\nare being treated very, very differentl\ny than the likes of genuine alternative platforms such as BitChute, Gab, Fediway, Mastodon, and Infogalactic.\nBreitbart News recently spoke with the CEO of upstart social media platform Parler about the company’s plans and what makes Parler different from Big Tech’s social media platforms. Breitbart News will begin actively posting on its official Parler account in the near future.",
  "tags": [
    "#AltTech"
  ],
  "categories": [],
  "sitemap_lastmod": "2019-06-16T13:02:23+00:00"
}