{
  "url": "https://voxday.net/2019/06/08/chernobyl-corrected/",
  "scraped_at": "2025-12-20T05:43:38.754295",
  "title": "Chernobyl, corrected",
  "date_display": "June 8, 2019",
  "date_iso": "2019-06-08T10:54:30+00:00",
  "date_from_url": "2019-06-08",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>A Soviet general who was featured in the recent miniseries <i>Chernobyl</i>, Nikolai Tarakanov, <a href=\"https://www.rt.com/news/461348-chernobyl-disaster-tarakanov-hbo/\">corrects the liberties</a> taken by the creators of the docudrama in a fascinating interview with <i>Russia Today</i>.</p><blockquote><p>Tarakanov: It was a terrifying sight, really. What on Earth could demolish an entire structure of reinforced concrete? A nuclear bomb? Some massive accident? I couldn’t imagine what had happened there. As a result of the explosion, all the rubble and dust was sent into the air. 300,000 cubic meters of soil around the plant were extracted, put in trucks and taken to burial sites. The soil was replaced with 300,000 cubic meters of crushed stone, sealed with concrete and covered with heavy concrete plates. This led to radiation levels falling by hundreds of times around the site, which allowed us to deal with the plant itself and decontaminate the equipment. It’s a long story. But then again, it was the soldiers who did all that. That is why when they ask me about it I always say: yes, there were scientists. Of course there were scientists; I have a doctoral degree myself. But it was the soldiers who were the main heroes of this story. When you think about war history, you always remember the military leaders, great generals, like Zhukov and Voroshilov. But who did all the fighting? It was the soldiers.</p><p>Tarakanov: There’s this episode, it’s is an ugly one. They show this boy, a conscript arriving at the military compound. What comes next is just ridiculous. They give him a uniform and moments later they are teaching him how to shoot animals. I mean, that’s just silly. Nothing even close to that ever happened. This is one serious mistake.</p><p>RTD: <i>Are you saying they never executed animals, like they show in the episode?</i></p><p>Tarakanov: No, they did, but never in the residential area. In the residential parts, there were no cows, no dogs – not a single one. The shooting did take place, but it was in the forests, where wild animals still roamed, including deer, as well as cattle that wandered off after the evacuation. But to show this young boy, recently drafted, being given all this equipment straight away [is just absurd].</p><p>The way it actually happened was pretty simple. The government issued a decree announcing general mobilization. They were supposed to call in 20,000 reservists, as they were called, from, say, Moscow and elsewhere… Those were all men of conscription age, between 30 and 40, mostly. And, of course, they knew nothing about their pending deployment. Later, when they arrived at the base, they were assigned to different units, a platoon, company or battalion. Only then would they set off for Chernobyl. So, all the procedures followed the law. Yet, the time they had to serve there was way too long.</p><p>RTD: <i>This series portrays then-Soviet leader Mikhail Gorbachev as a confused man, who is doubting the reality and hesitating to take control. Is that true? Is that how it was and did he really fail to assume responsibility for the incident?</i></p><p>Tarakanov: What I can tell you is that if we speak about the man’s character, since I knew him quite well… he did lack that firm grip on things that, for example, Boris Yeltsin had, the kind that majors and generals have, who can take the lead; issue orders and know what to do, that kind of stuff.</p><p>So, when he got the news he didn’t even go there himself, he sent [Nikolai] Ryzhkov [chairman of the Council of Ministers] and Shcherbina to take care of things. And not knowing what’s happening on the ground; not having the slightest idea of what it’s like, he was trying to low-ball the whole thing about the danger to the population and the impact. He was hoping that the commission would report any day that it was all over and fine.</p></blockquote><p>It’s disappointing to hear that the pet shootings were invented, not because one wishes they were real, but because it casts a malevolent shadow on the makers of the docudrama. What is the point of inventing and then subjecting the viewer to such psychological horror, especially when it was not real? Given the way in which <i>Chernobyl </i>creator Craig Mazin claims “The lesson is that lying, arrogance, and suppression of criticism are dangerous”, what could possibly be the objective of lying about the mass slaughter of puppies and kittens by Russians…. oh.</p><p>It’s not “a serious mistake”, it’s malicious revisionist historical (((wizardry))). Every. Single. Time.</p></div>",
  "content_text": "A Soviet general who was featured in the recent miniseries\nChernobyl\n, Nikolai Tarakanov,\ncorrects the liberties\ntaken by the creators of the docudrama in a fascinating interview with\nRussia Today\n.\nTarakanov: It was a terrifying sight, really. What on Earth could demolish an entire structure of reinforced concrete? A nuclear bomb? Some massive accident? I couldn’t imagine what had happened there. As a result of the explosion, all the rubble and dust was sent into the air. 300,000 cubic meters of soil around the plant were extracted, put in trucks and taken to burial sites. The soil was replaced with 300,000 cubic meters of crushed stone, sealed with concrete and covered with heavy concrete plates. This led to radiation levels falling by hundreds of times around the site, which allowed us to deal with the plant itself and decontaminate the equipment. It’s a long story. But then again, it was the soldiers who did all that. That is why when they ask me about it I always say: yes, there were scientists. Of course there were scientists; I have a doctoral degree myself. But it was the soldiers who were the main heroes of this story. When you think about war history, you always remember the military leaders, great generals, like Zhukov and Voroshilov. But who did all the fighting? It was the soldiers.\nTarakanov: There’s this episode, it’s is an ugly one. They show this boy, a conscript arriving at the military compound. What comes next is just ridiculous. They give him a uniform and moments later they are teaching him how to shoot animals. I mean, that’s just silly. Nothing even close to that ever happened. This is one serious mistake.\nRTD:\nAre you saying they never executed animals, like they show in the episode?\nTarakanov: No, they did, but never in the residential area. In the residential parts, there were no cows, no dogs – not a single one. The shooting did take place, but it was in the forests, where wild animals still roamed, including deer, as well as cattle that wandered off after the evacuation. But to show this young boy, recently drafted, being given all this equipment straight away [is just absurd].\nThe way it actually happened was pretty simple. The government issued a decree announcing general mobilization. They were supposed to call in 20,000 reservists, as they were called, from, say, Moscow and elsewhere… Those were all men of conscription age, between 30 and 40, mostly. And, of course, they knew nothing about their pending deployment. Later, when they arrived at the base, they were assigned to different units, a platoon, company or battalion. Only then would they set off for Chernobyl. So, all the procedures followed the law. Yet, the time they had to serve there was way too long.\nRTD:\nThis series portrays then-Soviet leader Mikhail Gorbachev as a confused man, who is doubting the reality and hesitating to take control. Is that true? Is that how it was and did he really fail to assume responsibility for the incident?\nTarakanov: What I can tell you is that if we speak about the man’s character, since I knew him quite well… he did lack that firm grip on things that, for example, Boris Yeltsin had, the kind that majors and generals have, who can take the lead; issue orders and know what to do, that kind of stuff.\nSo, when he got the news he didn’t even go there himself, he sent [Nikolai] Ryzhkov [chairman of the Council of Ministers] and Shcherbina to take care of things. And not knowing what’s happening on the ground; not having the slightest idea of what it’s like, he was trying to low-ball the whole thing about the danger to the population and the impact. He was hoping that the commission would report any day that it was all over and fine.\nIt’s disappointing to hear that the pet shootings were invented, not because one wishes they were real, but because it casts a malevolent shadow on the makers of the docudrama. What is the point of inventing and then subjecting the viewer to such psychological horror, especially when it was not real? Given the way in which\nChernobyl\ncreator Craig Mazin claims “The lesson is that lying, arrogance, and suppression of criticism are dangerous”, what could possibly be the objective of lying about the mass slaughter of puppies and kittens by Russians…. oh.\nIt’s not “a serious mistake”, it’s malicious revisionist historical (((wizardry))). Every. Single. Time.",
  "tags": [
    "film"
  ],
  "categories": [],
  "sitemap_lastmod": "2019-06-08T09:54:30+00:00"
}