{
  "url": "https://voxday.net/2019/06/01/conservative-is-a-sensibility/",
  "scraped_at": "2025-12-20T05:42:50.460363",
  "title": "“Conservative” is a “sensibility”",
  "date_display": "June 1, 2019",
  "date_iso": "2019-06-01T11:17:07+00:00",
  "date_from_url": "2019-06-01",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>That’s literally the title of George Will’s new book, <i>The Conservative Sensibility</i>, which in the 2019 post-American, post-Christian USA is less relevant than a book about the Manchu invasion of China:</p><blockquote><p>Government needs to get back to basics. The political class, defined broadly to include persons actively engaged in electoral politics and policymaking along with those who report and comment on civic life, is more united by a class characteristic than it is divided by philosophic differences. The characteristic is a tendency to overestimate the importance of public policies, from which the political class derives its sense of importance. This is especially so regarding economic and social inequalities. These, the political class tends to believe, are largely the result of public policies and are therefore susceptible to decisive amelioration by better government actions. In the argument about which is primary, nature or nurture, the former receives an emphatic affirmation from the Founding Fathers’ philosophy. Beneath the myriad patinas of culture, there is a fixed human nature that neither improves nor regresses. What does change for the better is the capacity of certain portions of humanity to improve the legal, institutional and social structures for coping with the constants of human nature. And to do so without diluting America’s foundational commitment to take its bearings from the individual.</p></blockquote><p>I used to admire George Will. Now, I marvel at his utter and complete cluelessness in the face of the conquest of the Land of the Free and the fearful, submissive state of a people who once considered themselves to be the Brave.</p><p>In <i>Cuckservative</i>, I told you that conservatism is not an ideology or a political philosophy, it’s just an attitude and a pose. Perhaps those who could not accept that reality coming from me will accept it from this leading conservative figure.</p></div>",
  "content_text": "That’s literally the title of George Will’s new book,\nThe Conservative Sensibility\n, which in the 2019 post-American, post-Christian USA is less relevant than a book about the Manchu invasion of China:\nGovernment needs to get back to basics. The political class, defined broadly to include persons actively engaged in electoral politics and policymaking along with those who report and comment on civic life, is more united by a class characteristic than it is divided by philosophic differences. The characteristic is a tendency to overestimate the importance of public policies, from which the political class derives its sense of importance. This is especially so regarding economic and social inequalities. These, the political class tends to believe, are largely the result of public policies and are therefore susceptible to decisive amelioration by better government actions. In the argument about which is primary, nature or nurture, the former receives an emphatic affirmation from the Founding Fathers’ philosophy. Beneath the myriad patinas of culture, there is a fixed human nature that neither improves nor regresses. What does change for the better is the capacity of certain portions of humanity to improve the legal, institutional and social structures for coping with the constants of human nature. And to do so without diluting America’s foundational commitment to take its bearings from the individual.\nI used to admire George Will. Now, I marvel at his utter and complete cluelessness in the face of the conquest of the Land of the Free and the fearful, submissive state of a people who once considered themselves to be the Brave.\nIn\nCuckservative\n, I told you that conservatism is not an ideology or a political philosophy, it’s just an attitude and a pose. Perhaps those who could not accept that reality coming from me will accept it from this leading conservative figure.",
  "tags": [
    "cuckservative"
  ],
  "categories": [],
  "sitemap_lastmod": "2019-06-01T10:17:07+00:00"
}