{
  "url": "https://voxday.net/2019/06/04/gatekeeping-the-gatekeeper/",
  "scraped_at": "2025-12-20T05:43:15.616798",
  "title": "Gatekeeping the gatekeeper",
  "date_display": "June 4, 2019",
  "date_iso": "2019-06-04T12:08:15+00:00",
  "date_from_url": "2019-06-04",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>Eric Weinstein’s panic is palpable. Jordan Peterson <a href=\"https://www.youtube.com/watch?v=NTYbClYvVrg&amp;feature=youtu.be\">is off the reservation!</a> Doesn’t he know that Viktor Orban is an anti-semitic BADTHINKER!</p><blockquote><p><b>Hungary Journal@hungary_journal</b><br>#Hungary’s PM Viktor #Orban and @jordanbpeterson agree that illegal immigration is unnecessary and dangerous, and political correctness is an invention of a small group of ideologically motivated people.</br></p><p><b>Eric Weinstein@EricRWeinstein</b><br>I’m feeling like I missed a meeting. @jordanbpeterson, when your family situation permits it, I’d be happy to discuss or even debate the ethics here. Doc, you lost me on this one. Orban isn’t simple ethical restrictionism and doesn’t fit anything I know of your actual politics.</br></p><p><b>Eric Weinstein@EricRWeinstein</b><br>IDW is supposed to give people an option to avoid BOTH right &amp; left extremes. The purpose of fighting authoritarian PC is not to lurch to the Identitarian Right to avoid the Identitarian Left. It’s to avoid needs for any authoritarians. We‘re supposed to be giving alternatives.</br></p></blockquote><p>In case you didn’t realize it yet, the “Intellectual Dark Web” is nothing more than public JournoList in miniature where the narrative is set for the members and they are expected to go out and dutifully broadcast it. And speaking of gatekeeping, <a href=\"http://www.unz.com/pgiraldi/edmund-burke-rides-again/\">a new think tank has been set up</a> as a substitute for <i>National Review</i>, the American Enterprise Institute, and the neoconservatives in order to capture the nationalists who have escaped the prison of the modern conservative movement.</p><blockquote><p>A new pro-Israel group that is pretending to be a standard bearer for conservative opinion in the United States was founded in January, a fortuitous bit of timing as it will not have to reveal its sources of income until next year. The Edmund Burke Foundation describes itself as “a new public affairs institute” having “the aim of strengthening the principles of national conservatism in Western and other democratic countries. The Foundation will pursue research, educational and publishing ventures directed toward this end.”</p><p>The Foundation’s launch will be at an open-to-the-public conference that will be held at Washington’s Ritz-Carlton on July 14-16, 2019. So as not to confuse the possible audience unduly over who Edmund Burke was or what he stood for, the conference is being advertised somewhat lamely as “National Conservatism: A Conference in Washington D.C.” on its website nationalconservatism.org. Note that neither the name of the foundation nor the promotion of its stellar cast of speakers includes the word “Israel,” but the Jewish state is really what it is all about.</p></blockquote><p><i>Plus ca change, plus ca la meme chose. </i>It’s mostly a list of the usual suspects, but Tucker Carlson really should have done his homework on this “National Conservatism” scam before taking the bait.</p></div>",
  "content_text": "Eric Weinstein’s panic is palpable. Jordan Peterson\nis off the reservation!\nDoesn’t he know that Viktor Orban is an anti-semitic BADTHINKER!\nHungary Journal@hungary_journal\n#Hungary’s PM Viktor #Orban and @jordanbpeterson agree that illegal immigration is unnecessary and dangerous, and political correctness is an invention of a small group of ideologically motivated people.\nEric Weinstein@EricRWeinstein\nI’m feeling like I missed a meeting. @jordanbpeterson, when your family situation permits it, I’d be happy to discuss or even debate the ethics here. Doc, you lost me on this one. Orban isn’t simple ethical restrictionism and doesn’t fit anything I know of your actual politics.\nEric Weinstein@EricRWeinstein\nIDW is supposed to give people an option to avoid BOTH right & left extremes. The purpose of fighting authoritarian PC is not to lurch to the Identitarian Right to avoid the Identitarian Left. It’s to avoid needs for any authoritarians. We‘re supposed to be giving alternatives.\nIn case you didn’t realize it yet, the “Intellectual Dark Web” is nothing more than public JournoList in miniature where the narrative is set for the members and they are expected to go out and dutifully broadcast it. And speaking of gatekeeping,\na new think tank has been set up\nas a substitute for\nNational Review\n, the American Enterprise Institute, and the neoconservatives in order to capture the nationalists who have escaped the prison of the modern conservative movement.\nA new pro-Israel group that is pretending to be a standard bearer for conservative opinion in the United States was founded in January, a fortuitous bit of timing as it will not have to reveal its sources of income until next year. The Edmund Burke Foundation describes itself as “a new public affairs institute” having “the aim of strengthening the principles of national conservatism in Western and other democratic countries. The Foundation will pursue research, educational and publishing ventures directed toward this end.”\nThe Foundation’s launch will be at an open-to-the-public conference that will be held at Washington’s Ritz-Carlton on July 14-16, 2019. So as not to confuse the possible audience unduly over who Edmund Burke was or what he stood for, the conference is being advertised somewhat lamely as “National Conservatism: A Conference in Washington D.C.” on its website nationalconservatism.org. Note that neither the name of the foundation nor the promotion of its stellar cast of speakers includes the word “Israel,” but the Jewish state is really what it is all about.\nPlus ca change, plus ca la meme chose.\nIt’s mostly a list of the usual suspects, but Tucker Carlson really should have done his homework on this “National Conservatism” scam before taking the bait.",
  "tags": [
    "SJW"
  ],
  "categories": [],
  "sitemap_lastmod": "2019-06-04T11:08:15+00:00"
}