{
  "url": "https://voxday.net/2019/06/25/hazony-dons-the-nationalist-skinsuit/",
  "scraped_at": "2025-12-21T02:48:03.539848",
  "title": "Hazony dons the nationalist skinsuit",
  "date_display": "June 25, 2019",
  "date_iso": "2019-06-25T19:10:22+00:00",
  "date_from_url": "2019-06-25",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>It’s beyond obvious that Yoram Hazony is attempting to create a new gatekeeping outpost in between civic nationalism and genuine nationalism, but he’s not anywhere nearly smart enough to do so effectively. His posited distinction between “nationalism” and “racialism” is not only absurd, it is very, very easily exploded.</p><blockquote><p>Yoram Hazony<br>I think it’s as clear as daylight. I wrote a book drawing parallels between Jewish-Israeli nationalism and American, British, and other nationalisms, and arguing for their legitimacy. The book rejects racialism across the boards. All you need to do is to read it.</br></p><p>Yoram Hazony<br>But my opposition to mixing nationalism with race theories has been explicit every step of the way. It’s explicit in the conference announcement and on the website. You don’t have to agree with me. Still, it takes some nerve to pretend I’ve been anything but open about this.</br></p></blockquote><p>I read Hazony’s book. Unlike many on the nationalist Right, I saw through him immediately and pointed out that his “National Conservative” conference was an obvious attempt to set up yet another neoclown gatekeeping organization, this one focused on nationalists. Hazony’s further attempts to “defend his ideas” readily reveal him to be not only a gatekeeper, but a shameless liar of the Ben Shapiro variety for two very obvious reasons.</p><p>First, to the extent there is any distinction between two terms that have historically been used in a synonymous manner, nation is a <i>subset </i>of race. Necessarily. So to base an argument on the idea that nation is actually a broader category than race is worse than dishonest, it is deeply stupid. It’s a total nonstarter.</p><p>Second, the etymology of nation makes it obvious that racialism is, and always will be, an element of nationalism.</p><p><i>1250–1300; Middle English &lt; Latin nātiōn- (stem of nātiō) birth, tribe, equivalent to nāt(us) (past participle of nāscī to be born) + -iōn- -ion</i></p><p>One’s nationality derives from one’s birth, not one’s geographical location or paperwork. It is an identification based on DNA, blood, and family, not ideology, confession, documents, or current location in the space-time continuum. By appealing to the fact of adoption, Hazony is stupidly attempting to derive a rule from its occasional exception.</p><p>UPDATE: Hazony is also a true son of his father:</p><blockquote><p>Yoram Hazony@yhazony<br>Sorry, there is no such thing as “genetically Jewish.” Jews are a nation, not a race. Anyone on earth can join the Jewish people, as Ruth the Moabite did—by accepting our people as her people, and our God as her God.Yoram Hazony added,</br></p><p>owen cyclops@owenbroadcast<br>so atheist jews, who reject your god, arent jews then?</br></p><p>Yoram Hazony@yhazony<br>Atheist Jews remain Jews. We were talking about non-Jews who want to join the Jewish people and what’s involved.</br></p></blockquote></div>",
  "content_text": "It’s beyond obvious that Yoram Hazony is attempting to create a new gatekeeping outpost in between civic nationalism and genuine nationalism, but he’s not anywhere nearly smart enough to do so effectively. His posited distinction between “nationalism” and “racialism” is not only absurd, it is very, very easily exploded.\nYoram Hazony\nI think it’s as clear as daylight. I wrote a book drawing parallels between Jewish-Israeli nationalism and American, British, and other nationalisms, and arguing for their legitimacy. The book rejects racialism across the boards. All you need to do is to read it.\nYoram Hazony\nBut my opposition to mixing nationalism with race theories has been explicit every step of the way. It’s explicit in the conference announcement and on the website. You don’t have to agree with me. Still, it takes some nerve to pretend I’ve been anything but open about this.\nI read Hazony’s book. Unlike many on the nationalist Right, I saw through him immediately and pointed out that his “National Conservative” conference was an obvious attempt to set up yet another neoclown gatekeeping organization, this one focused on nationalists. Hazony’s further attempts to “defend his ideas” readily reveal him to be not only a gatekeeper, but a shameless liar of the Ben Shapiro variety for two very obvious reasons.\nFirst, to the extent there is any distinction between two terms that have historically been used in a synonymous manner, nation is a\nsubset\nof race. Necessarily. So to base an argument on the idea that nation is actually a broader category than race is worse than dishonest, it is deeply stupid. It’s a total nonstarter.\nSecond, the etymology of nation makes it obvious that racialism is, and always will be, an element of nationalism.\n1250–1300; Middle English < Latin nātiōn- (stem of nātiō) birth, tribe, equivalent to nāt(us) (past participle of nāscī to be born) + -iōn- -ion\nOne’s nationality derives from one’s birth, not one’s geographical location or paperwork. It is an identification based on DNA, blood, and family, not ideology, confession, documents, or current location in the space-time continuum. By appealing to the fact of adoption, Hazony is stupidly attempting to derive a rule from its occasional exception.\nUPDATE: Hazony is also a true son of his father:\nYoram Hazony@yhazony\nSorry, there is no such thing as “genetically Jewish.” Jews are a nation, not a race. Anyone on earth can join the Jewish people, as Ruth the Moabite did—by accepting our people as her people, and our God as her God.Yoram Hazony added,\nowen cyclops@owenbroadcast\nso atheist jews, who reject your god, arent jews then?\nYoram Hazony@yhazony\nAtheist Jews remain Jews. We were talking about non-Jews who want to join the Jewish people and what’s involved.",
  "tags": [
    "neoclowns"
  ],
  "categories": [],
  "sitemap_lastmod": "2019-06-25T18:10:22+00:00"
}