{
  "url": "https://voxday.net/2019/06/16/making-america-smarter/",
  "scraped_at": "2025-12-21T02:46:57.935971",
  "title": "Making America smarter",
  "date_display": "June 16, 2019",
  "date_iso": "2019-06-16T09:54:22+00:00",
  "date_from_url": "2019-06-16",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>There are some real rocket scientists <a href=\"https://www.washingtonexaminer.com/news/african-migrants-pass-through-san-antonio-and-swiftly-fan-out-across-the-country\">arriving from Africa</a>:</p><blockquote><p>Roughly 300 Congolese and Angolan citizens who arrived in San Antonio the first week of June after crossing the U.S.-Mexico border days earlier have all briskly departed the city for destinations across the country, some with fuzzy plans based partly on hope. While many Central American families who arrive have final destinations and family members in mind who could pay for their tickets and put them up, the African families did not always have quite as clearly defined plans.</p><p>“They come with a place in mind. ‘My friend told me to go to Portland, Maine, because there’s a lot of Congolese families that already live there and it’s welcoming,” said Nemeth. “And they have that plan in mind, right? But they don’t understand the geography — like where it is, how much it costs to get there. There’s a lot of misconceptions. They may think, ‘I have a friend there,’ but they don’t have a friend’s phone number … [We can look into] what is their last name, phone book, call shelter and ask about them, connect the dots. I wouldn’t say that we’re just putting them randomly. They have an idea.”</p><p>The African migrants are spending six to seven months traveling to Brazil then up to the U.S. Those entering the U.S. through this route did so because they “were scared the [refugee] process was not gonna work, or that it’s last a standstill,” said Christina Higgs, Catholic Charities spokeswoman for the San Antonio region. Some worried traveling to or through Europe was “getting really dangerous.”</p></blockquote><p>Europe is getting dangerous because the Europeans are actively embracing nationalism and aggressively opposing all immigration. Meanwhile, in the USA, more than half the so-called nationalists are still <i>civic</i> nationalists who don’t understand or accept that a nation is not an abstraction or an idea. Remember, it’s just the <i>illegal </i>immigration they oppose. Legality makes it all good, apparently because the Magic Dirt only works on <i>legal </i>immigrants. Also, huddled masses, melting pot, and judeo-christian ethics.</p><p>It doesn’t help that most Americans don’t know that African-Americans are nearly 20 percent European on average. The difference between an 85 IQ and a 70 IQ is very hard to imagine for the average 100 IQ individual, and the latter almost has to be witnessed to be believed.</p><p>As for those “welcoming” cities, send all the New Americans there, by all means. It will be informative to see how long it takes those welcoming people so happy to help poor refugees to flee their hometowns. There are only 81 million more hopeful Congolese who would love to make a better life for themselves and their families in the USA, after all.</p></div>",
  "content_text": "There are some real rocket scientists\narriving from Africa\n:\nRoughly 300 Congolese and Angolan citizens who arrived in San Antonio the first week of June after crossing the U.S.-Mexico border days earlier have all briskly departed the city for destinations across the country, some with fuzzy plans based partly on hope. While many Central American families who arrive have final destinations and family members in mind who could pay for their tickets and put them up, the African families did not always have quite as clearly defined plans.\n“They come with a place in mind. ‘My friend told me to go to Portland, Maine, because there’s a lot of Congolese families that already live there and it’s welcoming,” said Nemeth. “And they have that plan in mind, right? But they don’t understand the geography — like where it is, how much it costs to get there. There’s a lot of misconceptions. They may think, ‘I have a friend there,’ but they don’t have a friend’s phone number … [We can look into] what is their last name, phone book, call shelter and ask about them, connect the dots. I wouldn’t say that we’re just putting them randomly. They have an idea.”\nThe African migrants are spending six to seven months traveling to Brazil then up to the U.S. Those entering the U.S. through this route did so because they “were scared the [refugee] process was not gonna work, or that it’s last a standstill,” said Christina Higgs, Catholic Charities spokeswoman for the San Antonio region. Some worried traveling to or through Europe was “getting really dangerous.”\nEurope is getting dangerous because the Europeans are actively embracing nationalism and aggressively opposing all immigration. Meanwhile, in the USA, more than half the so-called nationalists are still\ncivic\nnationalists who don’t understand or accept that a nation is not an abstraction or an idea. Remember, it’s just the\nillegal\nimmigration they oppose. Legality makes it all good, apparently because the Magic Dirt only works on\nlegal\nimmigrants. Also, huddled masses, melting pot, and judeo-christian ethics.\nIt doesn’t help that most Americans don’t know that African-Americans are nearly 20 percent European on average. The difference between an 85 IQ and a 70 IQ is very hard to imagine for the average 100 IQ individual, and the latter almost has to be witnessed to be believed.\nAs for those “welcoming” cities, send all the New Americans there, by all means. It will be informative to see how long it takes those welcoming people so happy to help poor refugees to flee their hometowns. There are only 81 million more hopeful Congolese who would love to make a better life for themselves and their families in the USA, after all.",
  "tags": [
    "immigration"
  ],
  "categories": [],
  "sitemap_lastmod": "2019-06-16T08:54:22+00:00"
}