{
  "url": "https://voxday.net/2019/06/06/my-eyes-are-dry/",
  "scraped_at": "2025-12-20T05:43:29.621621",
  "title": "My eyes are dry",
  "date_display": "June 6, 2019",
  "date_iso": "2019-06-06T23:33:53+00:00",
  "date_from_url": "2019-06-06",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>Oh, the irony. The anklebiters who have been attacking Owen and I for creating Unauthorized have belatedly discovered <a href=\"https://www.youtube.com/watch?v=jZE2hn9saAU\">why we created it</a> in the first place.</p><p>Just to be clear, neither Owen nor I, nor any of our supporters, had anything whatsoever to do with their demonetization. We’ve just ignored them; the simple fact is that they fucked up, they trusted YouTube.</p><p>Build your own platforms.</p><p><b>UPDATE: </b>Apparently some people are under the mistaken impression that I reported the anklebiters. I did not do so, and in fact, I have never, ever, reported any YouTube channel to anyone for anything. If I had reported their numerous copyright violations, they would have received three strikes and their channel would be terminated, not simply demonetized. As it happens, I had three videos deleted myself in the most recent YouTube purge.</p></div>",
  "content_text": "Oh, the irony. The anklebiters who have been attacking Owen and I for creating Unauthorized have belatedly discovered\nwhy we created it\nin the first place.\nJust to be clear, neither Owen nor I, nor any of our supporters, had anything whatsoever to do with their demonetization. We’ve just ignored them; the simple fact is that they fucked up, they trusted YouTube.\nBuild your own platforms.\nUPDATE:\nApparently some people are under the mistaken impression that I reported the anklebiters. I did not do so, and in fact, I have never, ever, reported any YouTube channel to anyone for anything. If I had reported their numerous copyright violations, they would have received three strikes and their channel would be terminated, not simply demonetized. As it happens, I had three videos deleted myself in the most recent YouTube purge.",
  "tags": [
    "anklebiters"
  ],
  "categories": [],
  "sitemap_lastmod": "2019-06-06T22:33:53+00:00"
}