{
  "url": "https://voxday.net/2019/06/18/reprehensibly-stupid/",
  "scraped_at": "2025-12-21T02:47:12.690111",
  "title": "Reprehensibly stupid",
  "date_display": "June 18, 2019",
  "date_iso": "2019-06-18T12:00:02+00:00",
  "date_from_url": "2019-06-18",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>MGTOW are not only cowards and liars, they are reprehensibly stupid, as one Hop Light demonstrates on YouTube in response to <a href=\"https://www.unauthorized.tv/programs/darkstreams-3f4d75?cid=338624\">my Darkstream entitled Men Going Evil’s Way</a>:</p><blockquote><p>Absurd stream.</p><p>“Is the legal system stacked against men? Yes.”<br>“Are there really bad outcomes? Well, yes.”</br></p><p>But…uh statistics are just statistics.</p><p>Vox, you’re smarter than this. It is only a true gamma fool of a man who gets married in this day and age. Completely suicidal in some states. It’s not fear, it survival and adaptation. It’s what men do.</p></blockquote><p>I’m certainly considerably smarter than he is. My point was that the statistics <i>are not applicable</i>. What MGTOW do is attempt to apply GENERAL statistics derived from a population of millions to their own individual situation despite the fact that such statistics are totally meaningless when applied to ONE SPECIFIC individual.</p><p>What they’re doing is analogous to deciding one can afford to buy a $2 million house with a 7.84 percent mortgage interest rate because the average US housing price is $279,500 and the average mortgage interest rate is 4.39 percent.</p></div>",
  "content_text": "MGTOW are not only cowards and liars, they are reprehensibly stupid, as one Hop Light demonstrates on YouTube in response to\nmy Darkstream entitled Men Going Evil’s Way\n:\nAbsurd stream.\n“Is the legal system stacked against men? Yes.”\n“Are there really bad outcomes? Well, yes.”\nBut…uh statistics are just statistics.\nVox, you’re smarter than this. It is only a true gamma fool of a man who gets married in this day and age. Completely suicidal in some states. It’s not fear, it survival and adaptation. It’s what men do.\nI’m certainly considerably smarter than he is. My point was that the statistics\nare not applicable\n. What MGTOW do is attempt to apply GENERAL statistics derived from a population of millions to their own individual situation despite the fact that such statistics are totally meaningless when applied to ONE SPECIFIC individual.\nWhat they’re doing is analogous to deciding one can afford to buy a $2 million house with a 7.84 percent mortgage interest rate because the average US housing price is $279,500 and the average mortgage interest rate is 4.39 percent.",
  "tags": [
    "Gamma"
  ],
  "categories": [],
  "sitemap_lastmod": "2019-06-18T11:00:02+00:00"
}