{
  "url": "https://voxday.net/2019/06/02/the-us-media-discovers-chinese-ambitions/",
  "scraped_at": "2025-12-20T05:42:55.928468",
  "title": "The US media discovers Chinese ambitions",
  "date_display": "June 2, 2019",
  "date_iso": "2019-06-02T09:46:00+00:00",
  "date_from_url": "2019-06-02",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>It’s mildly amusing to see <a href=\"https://www.latimes.com/politics/la-na-pol-us-china-trade-stalemate-20190531-story.html\">the US media’s belated alarm</a> over China’s global ambitions, considering that the Chinese haven’t exactly been hiding them, what with their plans to send 100 million settlers to Africa and their growing number of acquisitions of US cultural high ground in entertainment and education:</p><blockquote><p>What started out two years ago as an effort by President Trump to wring better terms from China on the nuts and bolts of foreign trade now threatens to become a far wider and more ominous confrontation.</p><p>The conflict continues to be framed as a “trade war” between the world’s two biggest economies — as Washington and Beijing pursue an escalating series of tariff hikes and other retaliatory measures.</p><p>Even as Trump moved Thursday to open a new, potentially damaging trade war with Mexico, however, the conflict with China has widened beyond the original trade-based issues.</p><p>Beneath the surface, a new tone has begun to emerge since trade talks broke down in early May and Trump ratcheted up tariffs on imported goods from China, an action met with retaliatory duties from Beijing. Officials on both sides of the Pacific have begun to portray the U.S.-China relationship in nationalistic and emotion-charged terms that suggest a much deeper conflict.</p><p>Recently, for example, a private group of American economists and trade experts with long-standing experience in China traveled to Beijing, expecting their usual technical give-and-take with Chinese government officials.</p><p>Instead, a member of the Chinese Politburo harangued them for almost an hour, describing the U.S.-China relationship as a “clash of civilizations” and boasting that China’s government-controlled system was far superior to the “Mediterranean culture” of the West, with its internal divisions and aggressive foreign policy.</p></blockquote><p>Translation: the media Jews have finally begun to realize that the Chinese plan to replace them rather than accept them as a ruling elite or permit them to move on to China when the USA breaks up. I’ve been predicting this conflict for years; the Harvard lawsuit was the Fort Sumter of what promises to be an epic struggle for primacy and control over the next 30 years.</p><p>I rather doubt it is an accident that this piece was written by a Korean journalist. I wouldn’t be surprised if he’s been telling his editors at the <i>LA Times</i> about the situation for years, but been repeatedly told that there was no story there.</p></div>",
  "content_text": "It’s mildly amusing to see\nthe US media’s belated alarm\nover China’s global ambitions, considering that the Chinese haven’t exactly been hiding them, what with their plans to send 100 million settlers to Africa and their growing number of acquisitions of US cultural high ground in entertainment and education:\nWhat started out two years ago as an effort by President Trump to wring better terms from China on the nuts and bolts of foreign trade now threatens to become a far wider and more ominous confrontation.\nThe conflict continues to be framed as a “trade war” between the world’s two biggest economies — as Washington and Beijing pursue an escalating series of tariff hikes and other retaliatory measures.\nEven as Trump moved Thursday to open a new, potentially damaging trade war with Mexico, however, the conflict with China has widened beyond the original trade-based issues.\nBeneath the surface, a new tone has begun to emerge since trade talks broke down in early May and Trump ratcheted up tariffs on imported goods from China, an action met with retaliatory duties from Beijing. Officials on both sides of the Pacific have begun to portray the U.S.-China relationship in nationalistic and emotion-charged terms that suggest a much deeper conflict.\nRecently, for example, a private group of American economists and trade experts with long-standing experience in China traveled to Beijing, expecting their usual technical give-and-take with Chinese government officials.\nInstead, a member of the Chinese Politburo harangued them for almost an hour, describing the U.S.-China relationship as a “clash of civilizations” and boasting that China’s government-controlled system was far superior to the “Mediterranean culture” of the West, with its internal divisions and aggressive foreign policy.\nTranslation: the media Jews have finally begun to realize that the Chinese plan to replace them rather than accept them as a ruling elite or permit them to move on to China when the USA breaks up. I’ve been predicting this conflict for years; the Harvard lawsuit was the Fort Sumter of what promises to be an epic struggle for primacy and control over the next 30 years.\nI rather doubt it is an accident that this piece was written by a Korean journalist. I wouldn’t be surprised if he’s been telling his editors at the\nLA Times\nabout the situation for years, but been repeatedly told that there was no story there.",
  "tags": [
    "ClashofCivilizations"
  ],
  "categories": [],
  "sitemap_lastmod": "2019-06-02T08:46:00+00:00"
}