{
  "url": "https://voxday.net/2019/06/15/the-continuing-decline-of-empire/",
  "scraped_at": "2025-12-21T02:46:52.793297",
  "title": "The continuing decline of empire",
  "date_display": "June 15, 2019",
  "date_iso": "2019-06-15T09:47:07+00:00",
  "date_from_url": "2019-06-15",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>Whatever happened to the imperial policy of f<a href=\"https://www.rt.com/news/461917-us-india-s400-serious-implications/\">ree trade uber alles</a>?</p><blockquote><p>The US-India defense ties will be put at risk should New Delhi purchase Russian S-400 air defense systems, a senior American diplomat warned, noting that India should think very carefully about making such strategic choices.</p><p>“At a certain point, a strategic choice has to be made about partnerships and a strategic choice about what weapons systems and platforms a country is going to adopt,” Alice Wells, US principal deputy assistant secretary for South and Central Asia, said this week at the hearings on US interests in South Asia and the budget for the fiscal year 2020. India’s procurement of the S-400s “effectively could limit India’s ability to increase our own interoperability,” she said, explaining that Washington has “serious concerns” about the implications of the $5 billion deal signed with Russia in October on India-US defense ties.</p></blockquote><p>If it’s not my business that my neighbor hires a Nicaraguan gardiner, how is it a senior American diplomat’s business if India buys Russian air defense systems? If I were an Indian official, I would simply throw Washington’s idiotic free trade rhetoric right back in its face. As well as, of course, this amusingly ironic news concerning <a href=\"https://www.rt.com/news/461918-chinese-company-f35-parts/\">the manufacture of F-35s</a>.</p><blockquote class=\"tr_bq\"><p>Exception PCB, a Chinese-owned company based in Gloucestershire, England, manufactures the circuit boards that control the engines, lighting, fuel and navigation systems of the F-35 Joint Strike Fighter…. Exception PCB was bought by Shenzhen Fastprint in 2013, has never concealed its Chinese ownership and has also worked on the Eurofighter Typhoon fighter jet and the Apache attack helicopter, among other sensitive programs. A director from the company told SkyNews there are “clear firewalls in place” between the Exception and its Chinese owners, that the company only produces bare circuit boards, and that no additional electronic information is supplied. But Lockheed Martin didn’t seem so sure, informing Sky that “like all components of the F-35,” the circuit boards “are inspected repeatedly at each stage of manufacture.”</p></blockquote><p>What’s to worry about? Countries that trade don’t fight, right? Anyhow, the continuing decline of US influence is becoming more apparent every day. No wonder the neocons are desperate to trigger a war between the US and Iran while the US is still capable of fighting one.</p></div>",
  "content_text": "Whatever happened to the imperial policy of f\nree trade uber alles\n?\nThe US-India defense ties will be put at risk should New Delhi purchase Russian S-400 air defense systems, a senior American diplomat warned, noting that India should think very carefully about making such strategic choices.\n“At a certain point, a strategic choice has to be made about partnerships and a strategic choice about what weapons systems and platforms a country is going to adopt,” Alice Wells, US principal deputy assistant secretary for South and Central Asia, said this week at the hearings on US interests in South Asia and the budget for the fiscal year 2020. India’s procurement of the S-400s “effectively could limit India’s ability to increase our own interoperability,” she said, explaining that Washington has “serious concerns” about the implications of the $5 billion deal signed with Russia in October on India-US defense ties.\nIf it’s not my business that my neighbor hires a Nicaraguan gardiner, how is it a senior American diplomat’s business if India buys Russian air defense systems? If I were an Indian official, I would simply throw Washington’s idiotic free trade rhetoric right back in its face. As well as, of course, this amusingly ironic news concerning\nthe manufacture of F-35s\n.\nException PCB, a Chinese-owned company based in Gloucestershire, England, manufactures the circuit boards that control the engines, lighting, fuel and navigation systems of the F-35 Joint Strike Fighter…. Exception PCB was bought by Shenzhen Fastprint in 2013, has never concealed its Chinese ownership and has also worked on the Eurofighter Typhoon fighter jet and the Apache attack helicopter, among other sensitive programs. A director from the company told SkyNews there are “clear firewalls in place” between the Exception and its Chinese owners, that the company only produces bare circuit boards, and that no additional electronic information is supplied. But Lockheed Martin didn’t seem so sure, informing Sky that “like all components of the F-35,” the circuit boards “are inspected repeatedly at each stage of manufacture.”\nWhat’s to worry about? Countries that trade don’t fight, right? Anyhow, the continuing decline of US influence is becoming more apparent every day. No wonder the neocons are desperate to trigger a war between the US and Iran while the US is still capable of fighting one.",
  "tags": [
    "war"
  ],
  "categories": [],
  "sitemap_lastmod": "2019-06-15T08:47:07+00:00"
}