{
  "url": "https://voxday.net/2019/06/26/the-silence-of-the-losers/",
  "scraped_at": "2025-12-21T02:48:10.467621",
  "title": "The silence of the losers",
  "date_display": "June 26, 2019",
  "date_iso": "2019-06-26T12:00:04+00:00",
  "date_from_url": "2019-06-26",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>The media doesn’t want to talk about Google being busted for <a href=\"https://www.infowars.com/blacklist-msm-ignores-project-veritas-bombshell-google-expose/\">interfering illegally in the US presidential election</a>:</p><blockquote><p>The liberal corporate media has totally ignored the explosive Google exposé by Project Veritas revealing systemic efforts by the tech company to prevent President Trump from getting reelected in 2020.</p><p>CNN, WaPo, CNBC, HuffPost, The New York Times, Vox, Vice, Newsweek, Politico, and even The Daily Beast haven’t written a single piece on the devastating evidence presented by a Google whistleblower and undercover footage of a Google executive discussing how to algorithmically manipulate the 2020 presidential election.</p><p>Regardless of what one thinks of Project Veritas, the damning information they revealed is extremely relevant and newsworthy, and confirms numerous instances of anti-competitive censorship practices by Google. The media still remained silent even after a member of Congress, Rep. Louie Gohmert (R-Texas), addressed the bombshell Google exposé on Twitter.</p><p>“Google should not be deciding whether content is important or trivial and they most assuredly should not be meddling in our election process. They need their immunity stripped,” he wrote.</p></blockquote><p>My father was investigated for an extended period of time by the Federal Election Commission because he published an impartial and very well-regarded election guide for the 1990 Minnesota elections called <i>People &amp; Politics</i>. I still remember having to walk the gauntlet of the news cameras camping out at the company offices. He was finally cleared of any wrongdoing, but they harassed him for YEARS over that. What Project Veritas has revealed is evidence of a MAJOR series of crimes that have been committed by Google and its employees.</p></div>",
  "content_text": "The media doesn’t want to talk about Google being busted for\ninterfering illegally in the US presidential election\n:\nThe liberal corporate media has totally ignored the explosive Google exposé by Project Veritas revealing systemic efforts by the tech company to prevent President Trump from getting reelected in 2020.\nCNN, WaPo, CNBC, HuffPost, The New York Times, Vox, Vice, Newsweek, Politico, and even The Daily Beast haven’t written a single piece on the devastating evidence presented by a Google whistleblower and undercover footage of a Google executive discussing how to algorithmically manipulate the 2020 presidential election.\nRegardless of what one thinks of Project Veritas, the damning information they revealed is extremely relevant and newsworthy, and confirms numerous instances of anti-competitive censorship practices by Google. The media still remained silent even after a member of Congress, Rep. Louie Gohmert (R-Texas), addressed the bombshell Google exposé on Twitter.\n“Google should not be deciding whether content is important or trivial and they most assuredly should not be meddling in our election process. They need their immunity stripped,” he wrote.\nMy father was investigated for an extended period of time by the Federal Election Commission because he published an impartial and very well-regarded election guide for the 1990 Minnesota elections called\nPeople & Politics\n. I still remember having to walk the gauntlet of the news cameras camping out at the company offices. He was finally cleared of any wrongdoing, but they harassed him for YEARS over that. What Project Veritas has revealed is evidence of a MAJOR series of crimes that have been committed by Google and its employees.",
  "tags": [
    "politics"
  ],
  "categories": [],
  "sitemap_lastmod": "2019-06-26T11:00:04+00:00"
}