{
  "url": "https://voxday.net/2019/06/20/the-clash-of-low-trust-cultures/",
  "scraped_at": "2025-12-21T02:47:28.818512",
  "title": "The clash of low-trust cultures",
  "date_display": "June 20, 2019",
  "date_iso": "2019-06-20T15:00:02+00:00",
  "date_from_url": "2019-06-20",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>The more the East invades the West, the more it becomes apparent that my explanation for the historical success of some minorities is dependent upon their possession of a low-trust, high-performance monopoly in a high-trust environment <a href=\"http://www.unz.com/isteve/the-globalist-clannishness-of-indian-diamond-merchants/\">is the correct one</a>:</p><blockquote><p>As a commenter pointed out about my review of <i>This Land Is Our Land: An Immigrant’s Manifesto</i> by Suketu Mehta, the scion of an Indian diamond merchant clan, diamond merchants are about the last who ought to lecture white Americans on their failures of inclusion and diversity.</p><p>The diamond business is globalist yet intensely nepotistic. I knew an American woman who got a job in the Los Angeles diamond district but then went to work for an insurance company due to discrimination against women and non-Indians.</p><p>Indians have recently pushed Orthodox Jewish diamond businessmen largely out of their stronghold in Antwerp, Belgium, in part by being more clannish than the Orthodox Jews.</p></blockquote><p>Jews are being pushed out of their merchanting and intellectual strongholds by the Chinese, the Indians, and other Asian groups because after centuries of competing successfully with high-trust Europeans, they are in no shape to compete with similarly low-trust cultures with larger extended families.</p><p>Note that the Mehta book is perfectly straightforward about immigration being not merely invasion, but conquest.</p></div>",
  "content_text": "The more the East invades the West, the more it becomes apparent that my explanation for the historical success of some minorities is dependent upon their possession of a low-trust, high-performance monopoly in a high-trust environment\nis the correct one\n:\nAs a commenter pointed out about my review of\nThis Land Is Our Land: An Immigrant’s Manifesto\nby Suketu Mehta, the scion of an Indian diamond merchant clan, diamond merchants are about the last who ought to lecture white Americans on their failures of inclusion and diversity.\nThe diamond business is globalist yet intensely nepotistic. I knew an American woman who got a job in the Los Angeles diamond district but then went to work for an insurance company due to discrimination against women and non-Indians.\nIndians have recently pushed Orthodox Jewish diamond businessmen largely out of their stronghold in Antwerp, Belgium, in part by being more clannish than the Orthodox Jews.\nJews are being pushed out of their merchanting and intellectual strongholds by the Chinese, the Indians, and other Asian groups because after centuries of competing successfully with high-trust Europeans, they are in no shape to compete with similarly low-trust cultures with larger extended families.\nNote that the Mehta book is perfectly straightforward about immigration being not merely invasion, but conquest.",
  "tags": [
    "immigration"
  ],
  "categories": [],
  "sitemap_lastmod": "2019-06-20T14:00:02+00:00"
}