{
  "url": "https://voxday.net/2019/06/27/unauthorized-medieval-history/",
  "scraped_at": "2025-12-21T02:48:24.732035",
  "title": "Unauthorized medieval history",
  "date_display": "June 27, 2019",
  "date_iso": "2019-06-27T18:09:21+00:00",
  "date_from_url": "2019-06-27",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><div class=\"separator\" style=\"clear: both; text-align: center;\"><a href=\"https://www.unauthorized.tv/programs/medieval-history-ecffd1\" imageanchor=\"1\" style=\"margin-left: 1em; margin-right: 1em;\"><img border=\"0\" data-original-height=\"450\" data-original-width=\"800\" decoding=\"async\" fetchpriority=\"high\" height=\"225\" src=\"https://cdn.idka.com/32c73a86-9dd9-439e-9d09-7a910d5c041e\" width=\"400\"/></a></div><p>Unauthorized.tv is pleased to present <a href=\"https://www.unauthorized.tv/programs/medieval-history-ecffd1\">Episode I</a> in Prof. Rachel Fulton Brown’s Medieval History 101 series, entitled <i>Getting Medieval on Medieval History.</i> The history series is for subscribers, but the first episode is free for everyone. The course guide and a recommended reading list is <a href=\"https://fencingbearatprayer.blogspot.com/2019/06/unauthorized-study-guide.html\">available here</a>. This should further demonstrate Unauthorized’s commitment to continuously raising the intellectual bar in the service of the Good, the Beautiful, and the True. In my experience, one of the best ways to avoid being deceived is to know history. There is, as we are told, very little that is new under the sun, and the deceptions that are being put into practice today have often been utilized in the past.</p><p>And if you’re not a subscriber yet, but you want to support more of these video projects, <a href=\"https://www.uscreen.io/admin/subscriptions\">you can get on board here</a>.</p><p>UPDATE: The supporting <a href=\"https://unauthorizedmedievalhistory.blogspot.com/2019/06/episode-1-getting-medieval-on-medieval.html\">blog post</a>, with references.</p></div>",
  "content_text": "Unauthorized.tv is pleased to present\nEpisode I\nin Prof. Rachel Fulton Brown’s Medieval History 101 series, entitled\nGetting Medieval on Medieval History.\nThe history series is for subscribers, but the first episode is free for everyone. The course guide and a recommended reading list is\navailable here\n. This should further demonstrate Unauthorized’s commitment to continuously raising the intellectual bar in the service of the Good, the Beautiful, and the True. In my experience, one of the best ways to avoid being deceived is to know history. There is, as we are told, very little that is new under the sun, and the deceptions that are being put into practice today have often been utilized in the past.\nAnd if you’re not a subscriber yet, but you want to support more of these video projects,\nyou can get on board here\n.\nUPDATE: The supporting\nblog post\n, with references.",
  "tags": [
    "Unauthorized"
  ],
  "categories": [],
  "sitemap_lastmod": "2019-06-27T17:09:21+00:00"
}