{
  "url": "https://voxday.net/2004/07/21/be-good-little-serf/",
  "scraped_at": "2025-12-19T20:37:17.122799",
  "title": "Be a good little serf",
  "date_display": "July 21, 2004",
  "date_iso": "2004-07-21T06:46:00+00:00",
  "date_from_url": "2004-07-21",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><blockquote><p> <br>U.S. Citizen, <a href=\"http://www.geocities.com/themis1.geo/Sassower.htm\">Elena Sassower</a>, respectfully waited through two hours of speeches in favor of the nominee until Chairman Senator Saxby Chambliss adjourned the May 22, 2003 U.S. Senate Judiciary Committee’s  Judicial Confirmation, a Public Hearing without asking if anyone else present wished to be heard.</br></p><p>Elena Sassower, then said: “Mr. Chairman, there’s citizen opposition to Judge Wesley based on his documented  corruption as a New York Court of Appeals judge. May I testify?”</p><p>Elena Sassower, within seconds, was removed by the D.C. Capitol Police from the Senate Judiciary Committee Hearing Room, hands cuffed behind her back, arrested and incarcerated for 21 hours.</p><p>Elena Sassower, was prosecuted by the U.S. Attorneys’ Office and on April 20, 2004 was found ‘guilty of Disruption of Congress’ after a week-long trial before Superior Court Judge Brian F. Holeman at 500 Indiana Avenue, N.W., Washington, D.C.<br/></p></blockquote><p>I know nothing about the particulars of this case, but somehow, it doesn’t lead me to think that our elected officials are likely to pay much legitimate attention to <a href=\"http://www.givemeliberty.org/\">We The People’s</a> exercise of their Constitutional right to petition.  I suspect the only thing that keeps the Federal <em>staatspolizei</em> from locking them up is that the arrest of 14,592 people who’ve done nothing but sign a formal Petition of Redress would explode the matrix construct once and for all.</p><p>In tangential news, I doubt anyone will be surprised to hear this:<br/></p><blockquote><p> <br>After several hours of legal wrestling related to findings and recommendations included in [Dick] Simkanin’s pre-sentencing report, USDC Judge John McBryde imposed the sentence that is approximately double what was indicated by the “point system” criteria utilized in the federal sentencing guidelines.  During the day, McBryde also sentenced two other individuals on federal charges including a bank robber and a wife-beating firearms dealer. Their combined sentences were less than half that [84 months] received by Simkanin….</br></p><p>The most telling proofs of judicial manipulation were McBryde’s improper directed findings of critical facts to the jury, ruling that Simkanin could not enter a single piece of paper as defense evidence and McBryde’s repeated quashing of testimony when he (Simkanin) attempted to put on a defense by explaining the content of the Constitution’s taxing clauses and the content of federal tax law and how he relied on the words of the law to determine his actions.<br/></p></blockquote><p>Seven years.  I imagine that it won’t be long before businessmen who are interested in operating under a government that actually obeys its own laws will begin to want their businesses headquartered and staffed outside the United States.  Not all outsourcing and offshore moves are to countries with low-cost labor, after all.  Once a government ceases to respond to its citizens and begins to hold show trials meant to intimidate its productive classes, it’s all downhill from there.<br/></p></div>",
  "content_text": "U.S. Citizen,\nElena Sassower\n, respectfully waited through two hours of speeches in favor of the nominee until Chairman Senator Saxby Chambliss adjourned the May 22, 2003 U.S. Senate Judiciary Committee’s  Judicial Confirmation, a Public Hearing without asking if anyone else present wished to be heard.\nElena Sassower, then said: “Mr. Chairman, there’s citizen opposition to Judge Wesley based on his documented  corruption as a New York Court of Appeals judge. May I testify?”\nElena Sassower, within seconds, was removed by the D.C. Capitol Police from the Senate Judiciary Committee Hearing Room, hands cuffed behind her back, arrested and incarcerated for 21 hours.\nElena Sassower, was prosecuted by the U.S. Attorneys’ Office and on April 20, 2004 was found ‘guilty of Disruption of Congress’ after a week-long trial before Superior Court Judge Brian F. Holeman at 500 Indiana Avenue, N.W., Washington, D.C.\nI know nothing about the particulars of this case, but somehow, it doesn’t lead me to think that our elected officials are likely to pay much legitimate attention to\nWe The People’s\nexercise of their Constitutional right to petition.  I suspect the only thing that keeps the Federal\nstaatspolizei\nfrom locking them up is that the arrest of 14,592 people who’ve done nothing but sign a formal Petition of Redress would explode the matrix construct once and for all.\nIn tangential news, I doubt anyone will be surprised to hear this:\nAfter several hours of legal wrestling related to findings and recommendations included in [Dick] Simkanin’s pre-sentencing report, USDC Judge John McBryde imposed the sentence that is approximately double what was indicated by the “point system” criteria utilized in the federal sentencing guidelines.  During the day, McBryde also sentenced two other individuals on federal charges including a bank robber and a wife-beating firearms dealer. Their combined sentences were less than half that [84 months] received by Simkanin….\nThe most telling proofs of judicial manipulation were McBryde’s improper directed findings of critical facts to the jury, ruling that Simkanin could not enter a single piece of paper as defense evidence and McBryde’s repeated quashing of testimony when he (Simkanin) attempted to put on a defense by explaining the content of the Constitution’s taxing clauses and the content of federal tax law and how he relied on the words of the law to determine his actions.\nSeven years.  I imagine that it won’t be long before businessmen who are interested in operating under a government that actually obeys its own laws will begin to want their businesses headquartered and staffed outside the United States.  Not all outsourcing and offshore moves are to countries with low-cost labor, after all.  Once a government ceases to respond to its citizens and begins to hold show trials meant to intimidate its productive classes, it’s all downhill from there.",
  "tags": [],
  "categories": [],
  "sitemap_lastmod": "2004-07-21T05:46:00+00:00"
}