{
  "url": "https://voxday.net/2004/07/09/big-fat-slow-pitch-floating-over-home/",
  "scraped_at": "2025-12-19T20:35:16.819447",
  "title": "A big fat slow pitch floating over home plate",
  "date_display": "July 9, 2004",
  "date_iso": "2004-07-09T16:21:00+00:00",
  "date_from_url": "2004-07-09",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><blockquote><p> <br>“I’ve been covering Washington and politics for 30 years [said one wire-service photographer]. I can say <a href=\"http://www.washtimes.com/national/pruden.htm\">I’ve never seen this much touching between two men</a>, publicly.” Indeed, editors determined to preserve the appearance of a little presidential dignity and campaign decorum on “the trail” are frustrated in their search for photographs suitable for a respectable mainstream newspaper. The photographers, keen competitors for the most startling shot of the day, naturally love it.<br/></br></p></blockquote><p>Karl Rove was a fool not to take my advice to pin John Kerry’s ears to the wall over homogamy a few months ago.  Now that the sweet-lovin’ hugbuddies are getting so very personal in public, he’d have to be a complete idiot should he fail to take that ball, run with it up the field and spike the hootenanny out of that sucker under the goalposts.</p><p>I hope someone has the foresight to play “You’ve Lost That Loving Feeling” at their next joint press event, should they decide to get a little less frisky.<br/></p></div>",
  "content_text": "“I’ve been covering Washington and politics for 30 years [said one wire-service photographer]. I can say\nI’ve never seen this much touching between two men\n, publicly.” Indeed, editors determined to preserve the appearance of a little presidential dignity and campaign decorum on “the trail” are frustrated in their search for photographs suitable for a respectable mainstream newspaper. The photographers, keen competitors for the most startling shot of the day, naturally love it.\nKarl Rove was a fool not to take my advice to pin John Kerry’s ears to the wall over homogamy a few months ago.  Now that the sweet-lovin’ hugbuddies are getting so very personal in public, he’d have to be a complete idiot should he fail to take that ball, run with it up the field and spike the hootenanny out of that sucker under the goalposts.\nI hope someone has the foresight to play “You’ve Lost That Loving Feeling” at their next joint press event, should they decide to get a little less frisky.",
  "tags": [],
  "categories": [],
  "sitemap_lastmod": "2004-07-09T15:21:00+00:00"
}