{
  "url": "https://voxday.net/2004/07/14/bitten-in-buttocks/",
  "scraped_at": "2025-12-19T20:35:59.631546",
  "title": "Bitten in the buttocks",
  "date_display": "July 14, 2004",
  "date_iso": "2004-07-14T08:42:00+00:00",
  "date_from_url": "2004-07-14",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>People often ask me why I am a libertarian, not a conservative, and why I prefer the Libertarian Party, despite the one significant flaw in its platform, over the Constitution Party.  The answer is simple.  Government is a two-edged sword, and attempting to use it for good purpose always backfires in the end.  Only the Libertarian Party has the proper distrust and distaste for the dangerous and often deadly institution.</p><p>Conservatives are rightly alarmed about homogamy, or “gay marriage”.  But as they are stupidly wont to do, they have again turned to a government solution, which is ironic as it is <em>only government involvement</em> in marriage – often regarding things that conservatives laud as supporting marriage – that has allowed this situation to come about.  I don’t actually mind the concept of a Defense of Marriage Amendment, I simply consider it useless; since the courts freely ignore most of the other amendments there is no reason to believe they wouldn’t simply contort the language to ignore this proposed amendment too.</p><p>Now, James Dobson is without question a wise man when it comes to children and relationships, but he is a short-sighted and clueless observer of government.  For, as he states in support of the rapidly dissolving Amendment:<br/></p><blockquote><p> <br>Dobson says another “phony excuse” is that marriage is a state issue. “Every legislator must surely know, however, that it would create chaos to have 50 different definitions of marriage in the United States,” Dobson wrote in his letter.<br/></br></p></blockquote><p>Experienced observers of American politics will recognize this as the same argument that is used to justify <em>every</em> expansion of central state power.  It has been used to justify <em>every</em> intrusion on State sovereignty.  Indeed, it has been used to force most of the cultural policies that Dobson rightly deplores down American throats.</p><p>I like and respect James Dobson.  But as a wiser man than Dobson once said: “those who live by the sword will die by the sword.  If conservatives wish to preserve marriage, they will have to take a libertarian approach and remove government entirely from the sanctioning, licensing and recognizing of the institution.<br/></p></div>",
  "content_text": "People often ask me why I am a libertarian, not a conservative, and why I prefer the Libertarian Party, despite the one significant flaw in its platform, over the Constitution Party.  The answer is simple.  Government is a two-edged sword, and attempting to use it for good purpose always backfires in the end.  Only the Libertarian Party has the proper distrust and distaste for the dangerous and often deadly institution.\nConservatives are rightly alarmed about homogamy, or “gay marriage”.  But as they are stupidly wont to do, they have again turned to a government solution, which is ironic as it is\nonly government involvement\nin marriage – often regarding things that conservatives laud as supporting marriage – that has allowed this situation to come about.  I don’t actually mind the concept of a Defense of Marriage Amendment, I simply consider it useless; since the courts freely ignore most of the other amendments there is no reason to believe they wouldn’t simply contort the language to ignore this proposed amendment too.\nNow, James Dobson is without question a wise man when it comes to children and relationships, but he is a short-sighted and clueless observer of government.  For, as he states in support of the rapidly dissolving Amendment:\nDobson says another “phony excuse” is that marriage is a state issue. “Every legislator must surely know, however, that it would create chaos to have 50 different definitions of marriage in the United States,” Dobson wrote in his letter.\nExperienced observers of American politics will recognize this as the same argument that is used to justify\nevery\nexpansion of central state power.  It has been used to justify\nevery\nintrusion on State sovereignty.  Indeed, it has been used to force most of the cultural policies that Dobson rightly deplores down American throats.\nI like and respect James Dobson.  But as a wiser man than Dobson once said: “those who live by the sword will die by the sword.  If conservatives wish to preserve marriage, they will have to take a libertarian approach and remove government entirely from the sanctioning, licensing and recognizing of the institution.",
  "tags": [],
  "categories": [],
  "sitemap_lastmod": "2004-07-14T07:42:00+00:00"
}