{
  "url": "https://voxday.net/2004/07/02/business-as-usua/",
  "scraped_at": "2025-12-19T20:34:13.542520",
  "title": "Business as usual",
  "date_display": "July 2, 2004",
  "date_iso": "2004-07-02T10:30:00+00:00",
  "date_from_url": "2004-07-02",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><blockquote><p> <br>Did many mutual fund managers <a href=\"http://biz.yahoo.com/cbsm/040702/3d83befc3d1d4f75961533eb2b04fd38_1.html\">break the law again</a> Wednesday?  It sure looks as though they did. Just as they have at the end of countless previous calendar quarters, it appears as though a number of fund managers on Wednesday engaged in illegal activity right before the close of trading. This had the effect of boosting their standings in the quarterly mutual fund rankings. The fact that fund managers resorted to such desperate tactics should not come as a surprise. Several finance professors discovered the behavior several years ago, and I wrote a column in the New York Times about it at the time. In addition, over the past year have devoted two of my MarketWatch columns to the topic.</br></p><p>Yet funds show no sign of giving up their wicked ways. Maybe fund managers think that New York Attorney General Eliot Spitzer has bigger fish to fry. Or maybe those managers thought that, since all eyes Wednesday afternoon were focused on the Federal Reserve’s rate-hike decision, no one would notice. Regardless of their reasons, the consequences are clear: The mutual fund industry on June 30 achieved what would otherwise seem to be a mathematical impossibility. Like the children of Lake Woebegon, the bulk of them were above average.</p><p>Don’t believe it? Take a look at the chart below, which shows the performance on June 30th of the 13 Lipper mutual fund indexes that reflect the performance of different sectors of the U.S. equity market. Each of those indices reflects the average performance of the funds in its sector. Twelve of these indexes outperformed the S&amp;P 500 on that day. And the 13th lagged the S&amp;P 500 by just one basis point. This is a huge contrast to funds’ typical performance on all other days, of course. On average on those other days, around 80 percent of funds lag the market.<br/></p></blockquote><p>It’s just a coincidence, of course, not unlike the recent decision of the British bureaucrat responsible for the UK’s CPI equivalent to remove housing from the inflation equation.  (Housing is already removed from the US CPI, as, increasingly, is food and energy.)  This was necessary because the UK CPI was showing rampant inflation as housing prices increased 20 percent in the last year, and since the central banks have declared that no inflation exists, obviously the equation required changing.</p><p>You thought Enron, WorldCom and Arthur Anderson were bad?  Just wait.  The coming frauds, scams and bankruptcies coming to light in the next two years will make those disasters look like prudent financial management.  How am I so sure?  Because government-related fraud is always an order of magnitude worse, and we haven’t begun to see any exposure of them yet.  But we will.</p><p>The corruption isn’t capitalism.  It is the twisted mutation of semi-capitalist corporatism created by the constant and innumerable federal interventions in the free markets.<br/></p></div>",
  "content_text": "Did many mutual fund managers\nbreak the law again\nWednesday?  It sure looks as though they did. Just as they have at the end of countless previous calendar quarters, it appears as though a number of fund managers on Wednesday engaged in illegal activity right before the close of trading. This had the effect of boosting their standings in the quarterly mutual fund rankings. The fact that fund managers resorted to such desperate tactics should not come as a surprise. Several finance professors discovered the behavior several years ago, and I wrote a column in the New York Times about it at the time. In addition, over the past year have devoted two of my MarketWatch columns to the topic.\nYet funds show no sign of giving up their wicked ways. Maybe fund managers think that New York Attorney General Eliot Spitzer has bigger fish to fry. Or maybe those managers thought that, since all eyes Wednesday afternoon were focused on the Federal Reserve’s rate-hike decision, no one would notice. Regardless of their reasons, the consequences are clear: The mutual fund industry on June 30 achieved what would otherwise seem to be a mathematical impossibility. Like the children of Lake Woebegon, the bulk of them were above average.\nDon’t believe it? Take a look at the chart below, which shows the performance on June 30th of the 13 Lipper mutual fund indexes that reflect the performance of different sectors of the U.S. equity market. Each of those indices reflects the average performance of the funds in its sector. Twelve of these indexes outperformed the S&P 500 on that day. And the 13th lagged the S&P 500 by just one basis point. This is a huge contrast to funds’ typical performance on all other days, of course. On average on those other days, around 80 percent of funds lag the market.\nIt’s just a coincidence, of course, not unlike the recent decision of the British bureaucrat responsible for the UK’s CPI equivalent to remove housing from the inflation equation.  (Housing is already removed from the US CPI, as, increasingly, is food and energy.)  This was necessary because the UK CPI was showing rampant inflation as housing prices increased 20 percent in the last year, and since the central banks have declared that no inflation exists, obviously the equation required changing.\nYou thought Enron, WorldCom and Arthur Anderson were bad?  Just wait.  The coming frauds, scams and bankruptcies coming to light in the next two years will make those disasters look like prudent financial management.  How am I so sure?  Because government-related fraud is always an order of magnitude worse, and we haven’t begun to see any exposure of them yet.  But we will.\nThe corruption isn’t capitalism.  It is the twisted mutation of semi-capitalist corporatism created by the constant and innumerable federal interventions in the free markets.",
  "tags": [],
  "categories": [],
  "sitemap_lastmod": "2004-07-02T09:30:00+00:00"
}