{
  "url": "https://voxday.net/2004/07/30/clitorectomies-for-all-girls/",
  "scraped_at": "2025-12-19T20:38:44.589437",
  "title": "Clitorectomies for all the girls",
  "date_display": "July 30, 2004",
  "date_iso": "2004-07-30T11:45:00+00:00",
  "date_from_url": "2004-07-30",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>I happened to scan a few pages of a chick book the other day.  It’s called <em>Princess</em>, and it purports to be the true story of a Saudi Arabian princess.  I have to say, I was largely left cold by the plight of the poor oppressed rich girls, as with a few exceptions, the most horrific events of the book were the predictable and easily avoidable consequences of the young women’s actions.  And after the eponymous princess destroyed an Impressionist masterpiece in one of her childish tirades, I found myself rather hoping she’d meet with an end similar to those of her reality-challenged friends.</p><p>When in Rome, you don’t have to do as the Romans do, but it’s generally a good idea to obey Roman law if you aren’t prepared to experience the consequences.</p><p>But all of this is neither here nor there.  What actually caught my attention – and so we finally meander towards the purpose of this post – was the attitude of the Saudi women to what appear to not so much be clitorectomies as removal of the external labia.<br/></p><blockquote><p> <br>For more generations than Nura knew, a large number of the women of our family had been circumcised.  Our mother was one of these women.  She had been circumcised when she became a woman, a few weeks before she was wed.  At age fourteen, when Nura became a woman, Mother followed the only tradition she knew and arranged for Nura’s circumcision to be performed in a small village some miles from Riyadh….</br></p><p>To the doctor’s surprise, it was my mother who had insisted upono the circumcision of her daughters.  She herself had endured the rite… she could imagine no other path for her daughters than the one she herself had trod….<br/></p></blockquote><p>A disgusting practice, to be sure, and defended with an argument similar to that made by public school-educated parents who are planning to subject their children to the same education they experienced.  The fact that these parents are as intellectually dead as the Saudi women are sensually crippled means that they are making their decisions on the false grounds of incomplete experience.  In both cases, I think those who condemn their children to like fates have much for which to answer, as one’s own abuse, physical or intellectual, should inspire one to act to prevent the same from happening to the next generation instead of allowing the vicious cycle to be repeated.</p><p>When one understands that the teachers of the NEA are every bit as ignorant and prejudiced as the <em>mutawas</em> of Saudi Arabia, and that they serve much the same societal purpose, one soon discovers in oneself as little inclination to hand one’s children over to the former as to the latter.<br/></p></div>",
  "content_text": "I happened to scan a few pages of a chick book the other day.  It’s called\nPrincess\n, and it purports to be the true story of a Saudi Arabian princess.  I have to say, I was largely left cold by the plight of the poor oppressed rich girls, as with a few exceptions, the most horrific events of the book were the predictable and easily avoidable consequences of the young women’s actions.  And after the eponymous princess destroyed an Impressionist masterpiece in one of her childish tirades, I found myself rather hoping she’d meet with an end similar to those of her reality-challenged friends.\nWhen in Rome, you don’t have to do as the Romans do, but it’s generally a good idea to obey Roman law if you aren’t prepared to experience the consequences.\nBut all of this is neither here nor there.  What actually caught my attention – and so we finally meander towards the purpose of this post – was the attitude of the Saudi women to what appear to not so much be clitorectomies as removal of the external labia.\nFor more generations than Nura knew, a large number of the women of our family had been circumcised.  Our mother was one of these women.  She had been circumcised when she became a woman, a few weeks before she was wed.  At age fourteen, when Nura became a woman, Mother followed the only tradition she knew and arranged for Nura’s circumcision to be performed in a small village some miles from Riyadh….\nTo the doctor’s surprise, it was my mother who had insisted upono the circumcision of her daughters.  She herself had endured the rite… she could imagine no other path for her daughters than the one she herself had trod….\nA disgusting practice, to be sure, and defended with an argument similar to that made by public school-educated parents who are planning to subject their children to the same education they experienced.  The fact that these parents are as intellectually dead as the Saudi women are sensually crippled means that they are making their decisions on the false grounds of incomplete experience.  In both cases, I think those who condemn their children to like fates have much for which to answer, as one’s own abuse, physical or intellectual, should inspire one to act to prevent the same from happening to the next generation instead of allowing the vicious cycle to be repeated.\nWhen one understands that the teachers of the NEA are every bit as ignorant and prejudiced as the\nmutawas\nof Saudi Arabia, and that they serve much the same societal purpose, one soon discovers in oneself as little inclination to hand one’s children over to the former as to the latter.",
  "tags": [],
  "categories": [],
  "sitemap_lastmod": "2004-07-30T10:45:00+00:00"
}