{
  "url": "https://voxday.net/2004/07/27/closing-border/",
  "scraped_at": "2025-12-19T20:38:21.470899",
  "title": "Closing the border",
  "date_display": "July 27, 2004",
  "date_iso": "2004-07-27T20:16:00+00:00",
  "date_from_url": "2004-07-27",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><blockquote><p> <br>IMMIGRATION OFFICERS are <a href=\"http://www.canoe.ca/NewsStand/TorontoSun/News/2004/07/27/558388.html\">having to pore through naked pictures</a> of hundreds of exotic dancers to keep impostors out of Canada. Foreign strippers planning to table dance in clubs here must now provide photos of themselves with no clothes on to qualify for a visa for Canada, immigration officials say. “Stage photos during performances are required,” said Sergio Mercado, of the Canadian Embassy in Mexico.</br></p><p>MEMO TO VISA OFFICERS</p><p>In a memo to fellow visa officers around the world, Mercado said if a dancer passes the no-clothes test, they may then require a police certificate or medical examination.  The memo was obtained from access to information documents obtained by the Sun.</p><p>The potential dancers have to prove they can dance in the nude, immigration lawyer Mendel Green said yesterday. “They can’t be partially nude,” he said. “If they don’t have pictures in the nude, they are not going to wiggle their bottoms in Canada.”<br/></p></blockquote><p>Brilliant!  I imagine the next step will be to ensure that high-price Norwegian call girls are properly qualified to provide their services as well.  It’s good to know that Canada’s Finest are willing to put their eyes on the line for their country.  At least we know that they’re not wasting their time as jihadists pour across the borders into their country.<br/></p></div>",
  "content_text": "IMMIGRATION OFFICERS are\nhaving to pore through naked pictures\nof hundreds of exotic dancers to keep impostors out of Canada. Foreign strippers planning to table dance in clubs here must now provide photos of themselves with no clothes on to qualify for a visa for Canada, immigration officials say. “Stage photos during performances are required,” said Sergio Mercado, of the Canadian Embassy in Mexico.\nMEMO TO VISA OFFICERS\nIn a memo to fellow visa officers around the world, Mercado said if a dancer passes the no-clothes test, they may then require a police certificate or medical examination.  The memo was obtained from access to information documents obtained by the Sun.\nThe potential dancers have to prove they can dance in the nude, immigration lawyer Mendel Green said yesterday. “They can’t be partially nude,” he said. “If they don’t have pictures in the nude, they are not going to wiggle their bottoms in Canada.”\nBrilliant!  I imagine the next step will be to ensure that high-price Norwegian call girls are properly qualified to provide their services as well.  It’s good to know that Canada’s Finest are willing to put their eyes on the line for their country.  At least we know that they’re not wasting their time as jihadists pour across the borders into their country.",
  "tags": [],
  "categories": [],
  "sitemap_lastmod": "2004-07-27T19:16:00+00:00"
}