{
  "url": "https://voxday.net/2004/07/14/conspiracy-theory/",
  "scraped_at": "2025-12-19T20:36:05.190879",
  "title": "Conspiracy theory",
  "date_display": "July 14, 2004",
  "date_iso": "2004-07-14T09:37:00+00:00",
  "date_from_url": "2004-07-14",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><blockquote><p> <br>Could Microsoft be behind <a href=\"http://www.pcmag.com/article2/0,1759,1619714,00.asp\">a smear campaign</a> aimed at Linux? If not Microsoft, then who? Let’s look at the continued attacks against Linux. The media is peppered with them. When one starts to die down, another one crops up. While every single one of these assertions is laughable, the never-ending barrage of anti-Linux propaganda has got to take its toll on potential users. Here are a few of the accusations you might find in articles planted here and there in the media:</br></p><p>Linux is not at all secure and poses a major security risk.</p><p>Linux is not cheap. Despite being free, it actually costs more to implement and maintain.</p><p>Linux is prone to hackers and viruses, because the code is easily available.</p><p>Linus Torvalds didn’t write Linux; it is in fact a compendium of old code that was cobbled together.</p><p>Linux is next to impossible to support, because no one company is responsible for it.</p><p>As there are no profits to be made from distributing or supporting Linux, it must die from eventual neglect.</p><p>Much of Linux is stolen proprietary code, and you could be liable if you use it. Furthermore, SCO will sue you if you use it.<br/></p></blockquote><p>Clearly, Mr. Dvorak is a paranoid wearer of tinfoil hats.  I find it interesting that people are so willing to believe in the evil intent of Microsoft – not that I disagree, being a quasi-religious Fedora/Opera/OpenOffice non-user of Microsoft products – but are, on the other hand, always eager to absolve the Federal government of any like prediliction for the Dark Side of the Force.</p><p>This strikes me as being more than a bit backward.<br/></p></div>",
  "content_text": "Could Microsoft be behind\na smear campaign\naimed at Linux? If not Microsoft, then who? Let’s look at the continued attacks against Linux. The media is peppered with them. When one starts to die down, another one crops up. While every single one of these assertions is laughable, the never-ending barrage of anti-Linux propaganda has got to take its toll on potential users. Here are a few of the accusations you might find in articles planted here and there in the media:\nLinux is not at all secure and poses a major security risk.\nLinux is not cheap. Despite being free, it actually costs more to implement and maintain.\nLinux is prone to hackers and viruses, because the code is easily available.\nLinus Torvalds didn’t write Linux; it is in fact a compendium of old code that was cobbled together.\nLinux is next to impossible to support, because no one company is responsible for it.\nAs there are no profits to be made from distributing or supporting Linux, it must die from eventual neglect.\nMuch of Linux is stolen proprietary code, and you could be liable if you use it. Furthermore, SCO will sue you if you use it.\nClearly, Mr. Dvorak is a paranoid wearer of tinfoil hats.  I find it interesting that people are so willing to believe in the evil intent of Microsoft – not that I disagree, being a quasi-religious Fedora/Opera/OpenOffice non-user of Microsoft products – but are, on the other hand, always eager to absolve the Federal government of any like prediliction for the Dark Side of the Force.\nThis strikes me as being more than a bit backward.",
  "tags": [],
  "categories": [],
  "sitemap_lastmod": "2004-07-14T08:37:00+00:00"
}