{
  "url": "https://voxday.net/2004/07/15/convention-conspiracy/",
  "scraped_at": "2025-12-19T20:36:21.658411",
  "title": "Convention conspiracy",
  "date_display": "July 15, 2004",
  "date_iso": "2004-07-15T17:51:00+00:00",
  "date_from_url": "2004-07-15",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>NRO is madly buzzing about how Kerry’s apparent dismissal of the Lizard Queen is nothing but a stunt designed to create more excitement when she makes a “surprise” speech at the convention.  I’m hoping that she’ll tear off her human skin, hiss at the camera and strangle Kerry with her tri-forked tongue before devouring both him and John Edwards live in front of a horrified nation.</p><p>The terrified Republicans will have no choice but to send a delegation via submarine to a small island in the Antarctic, where they will perform a <em>shoggoth</em> designed to awake the Deep One who sleeps beneath the ice.  When Cthulhu rises, Dick Cheney will be sacrificed to appease the Great Tentacled One and New York City will be demolished by the subsequent epic battle between the demon lizard-bitch and the Elder God.</p><p>Why vote for the lesser of two evils?  Cthulhu 2004!<br/></p></div>",
  "content_text": "NRO is madly buzzing about how Kerry’s apparent dismissal of the Lizard Queen is nothing but a stunt designed to create more excitement when she makes a “surprise” speech at the convention.  I’m hoping that she’ll tear off her human skin, hiss at the camera and strangle Kerry with her tri-forked tongue before devouring both him and John Edwards live in front of a horrified nation.\nThe terrified Republicans will have no choice but to send a delegation via submarine to a small island in the Antarctic, where they will perform a\nshoggoth\ndesigned to awake the Deep One who sleeps beneath the ice.  When Cthulhu rises, Dick Cheney will be sacrificed to appease the Great Tentacled One and New York City will be demolished by the subsequent epic battle between the demon lizard-bitch and the Elder God.\nWhy vote for the lesser of two evils?  Cthulhu 2004!",
  "tags": [],
  "categories": [],
  "sitemap_lastmod": "2004-07-15T16:51:00+00:00"
}