{
  "url": "https://voxday.net/2004/07/25/copyright-run-amok/",
  "scraped_at": "2025-12-19T20:38:01.403118",
  "title": "Copyright run amok",
  "date_display": "July 25, 2004",
  "date_iso": "2004-07-25T11:43:00+00:00",
  "date_from_url": "2004-07-25",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><blockquote><p> <br>Mass-market publishers are not certain <a href=\"http://www.nytimes.com/2004/07/12/technology/12ecom.html?ex=1247284800&amp;en=3fc60b15bca48464&amp;ei=5090&amp;partner=rssuserland\">the used-book phenomenon</a> is a problem worth addressing, but others in the industry have already made up their minds. “We think it’s not good for the industry and it has an effect, but we can’t measure it,” said Paul Aiken, executive director of the Authors Guild, a trade group. “There has always been used-book sales, but it’s always been a background noise sort of thing. Now it’s right there next to the new book on Amazon.”</br></p><p>Lorraine Shanley, a principal at Market Partners International, a publishing consultant, said that the industry was just starting to appreciate the dimensions of the problem. “Used books are to consumer books as Napster was to the music industry,” she said. “The question becomes, ‘How does the book industry address its used-book problem?’ There aren’t any easy answers, especially as no one is breaking any laws here.”<br/></p></blockquote><p>Anyone else doubt that if someone invents a technology that will allow someone to read a book once before it sets itself on fire and burns to ashes, the publishers of the world will beat a path to their door?  William Gibson was just ahead of his time with Agrippa.</p><p>While I have a very amicable relationship with my publisher, in general I have little sympathy for them.  Copyright was originally conceived as a way to protect authors from publishers, now it’s devolved into de facto protection for the publishers.<br/></p></div>",
  "content_text": "Mass-market publishers are not certain\nthe used-book phenomenon\nis a problem worth addressing, but others in the industry have already made up their minds. “We think it’s not good for the industry and it has an effect, but we can’t measure it,” said Paul Aiken, executive director of the Authors Guild, a trade group. “There has always been used-book sales, but it’s always been a background noise sort of thing. Now it’s right there next to the new book on Amazon.”\nLorraine Shanley, a principal at Market Partners International, a publishing consultant, said that the industry was just starting to appreciate the dimensions of the problem. “Used books are to consumer books as Napster was to the music industry,” she said. “The question becomes, ‘How does the book industry address its used-book problem?’ There aren’t any easy answers, especially as no one is breaking any laws here.”\nAnyone else doubt that if someone invents a technology that will allow someone to read a book once before it sets itself on fire and burns to ashes, the publishers of the world will beat a path to their door?  William Gibson was just ahead of his time with Agrippa.\nWhile I have a very amicable relationship with my publisher, in general I have little sympathy for them.  Copyright was originally conceived as a way to protect authors from publishers, now it’s devolved into de facto protection for the publishers.",
  "tags": [],
  "categories": [],
  "sitemap_lastmod": "2004-07-25T10:43:00+00:00"
}