{
  "url": "https://voxday.net/2004/07/14/cordial-salute/",
  "scraped_at": "2025-12-19T20:36:07.013017",
  "title": "A cordial salute",
  "date_display": "July 14, 2004",
  "date_iso": "2004-07-14T09:48:00+00:00",
  "date_from_url": "2004-07-14",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>Okay, this made me laugh.  I came across it courtesy of le petit <a href=\"http://darkwindow.blogspot.com\">Dark Window</a>.  I’m not sure which I appreciated most, the innovative group protest – wouldn’t want to participate in that one myself – the president’s response, or the guy’s reaction to the response.  It’s all good, except for the reminder that free speech and protest are no longer legal in the USA.  And that goes doubly for the last sixty days before an election.<br/></p><blockquote><p> <br>At the front of this second bus was The W himself, waving cheerily at his supporters on the other side of the highway. Adam, Brendan, and I rose our banner (the More Trees, Less Bush one) and he turned to wave to our side of the road. His smile faded, and he raised his left arm in our direction. And then, George W. Bush, the 43rd president of the United States of America, extended his middle finger.</br></p><p>Read that last sentence again. <a href=\"http://www.livejournal.com/users/jiveturky/185733.html\">I got flipped off by George W. Bush</a>.</p><p>A ponytailed man standing next to us confirmed the event, saying, “I do believe the President of the U.S. just gave you boys the finger.” We laughed probably for the next half hour, and promptly told everyone we knew.<br/></p></blockquote><p>I love the American spirit, especially when it resides in those with acorn-sized intellects.<br/></p></div>",
  "content_text": "Okay, this made me laugh.  I came across it courtesy of le petit\nDark Window\n.  I’m not sure which I appreciated most, the innovative group protest – wouldn’t want to participate in that one myself – the president’s response, or the guy’s reaction to the response.  It’s all good, except for the reminder that free speech and protest are no longer legal in the USA.  And that goes doubly for the last sixty days before an election.\nAt the front of this second bus was The W himself, waving cheerily at his supporters on the other side of the highway. Adam, Brendan, and I rose our banner (the More Trees, Less Bush one) and he turned to wave to our side of the road. His smile faded, and he raised his left arm in our direction. And then, George W. Bush, the 43rd president of the United States of America, extended his middle finger.\nRead that last sentence again.\nI got flipped off by George W. Bush\n.\nA ponytailed man standing next to us confirmed the event, saying, “I do believe the President of the U.S. just gave you boys the finger.” We laughed probably for the next half hour, and promptly told everyone we knew.\nI love the American spirit, especially when it resides in those with acorn-sized intellects.",
  "tags": [],
  "categories": [],
  "sitemap_lastmod": "2004-07-14T08:48:00+00:00"
}