{
  "url": "https://voxday.net/2004/07/12/culture-and-hope/",
  "scraped_at": "2025-12-19T20:35:35.582136",
  "title": "Culture and hope",
  "date_display": "July 12, 2004",
  "date_iso": "2004-07-12T07:33:00+00:00",
  "date_from_url": "2004-07-12",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>Adam Gopnik writes in <em>Paris to the Moon</em><br/></p><blockquote><p> <br>The performance of <em>Les Trois Petits Cochons</em>, for instance, uses, with slight variations, many of the devices, not to mention the music of the Disney version of the story from the thirties.  There are French touches, though.  The <em>catastrophe</em>, or climax, comes when the wolf pretends to be a minor official comes to read the water meter.  The pigs have to let him into the one remaining house; the French little pigs <em>have</em> to open the door to administration, even when it has an immense jaw and sixty white paper-mache teeth.<br/></br></p></blockquote><p>This is why there will never be a European Waco or Ruby Ridge.  Perhaps in Switzerland, or New Europe, where decades of totalitarian rule have hardened the population’s attitudes about government.  But certainly not in France.</p><p>America is rather different.  We have no long tradition of obedience.  We are born rebellious, with the unruly expectation that individual liberty is our natural birthright.  We must be educated, confused, fooled and propagandized non-stop in order to even become manageable.  Rage Against the Machine is a good example of this significant cultural difference; despite being <em>left-wing</em> pop icons, ideologically pledged to the expansion of central government power, they once notably preached: “Fuck you, I won’t do what you tell me,” and, just in case one happened to somehow escape the message, repeated it 26 times before punctuating it with one last exclamatory “motherfucker!”</p><p>This is not exactly the ideal open-the-door-to-the-government-wolf spirit.</p><p>America the idea may be dead, for now.  But the recalcitrant individuality that gave her birth still lives, and we can hope that as long as this stubborn fire still burns in American hearts, we may find her again.<br/></p></div>",
  "content_text": "Adam Gopnik writes in\nParis to the Moon\nThe performance of\nLes Trois Petits Cochons\n, for instance, uses, with slight variations, many of the devices, not to mention the music of the Disney version of the story from the thirties.  There are French touches, though.  The\ncatastrophe\n, or climax, comes when the wolf pretends to be a minor official comes to read the water meter.  The pigs have to let him into the one remaining house; the French little pigs\nhave\nto open the door to administration, even when it has an immense jaw and sixty white paper-mache teeth.\nThis is why there will never be a European Waco or Ruby Ridge.  Perhaps in Switzerland, or New Europe, where decades of totalitarian rule have hardened the population’s attitudes about government.  But certainly not in France.\nAmerica is rather different.  We have no long tradition of obedience.  We are born rebellious, with the unruly expectation that individual liberty is our natural birthright.  We must be educated, confused, fooled and propagandized non-stop in order to even become manageable.  Rage Against the Machine is a good example of this significant cultural difference; despite being\nleft-wing\npop icons, ideologically pledged to the expansion of central government power, they once notably preached: “Fuck you, I won’t do what you tell me,” and, just in case one happened to somehow escape the message, repeated it 26 times before punctuating it with one last exclamatory “motherfucker!”\nThis is not exactly the ideal open-the-door-to-the-government-wolf spirit.\nAmerica the idea may be dead, for now.  But the recalcitrant individuality that gave her birth still lives, and we can hope that as long as this stubborn fire still burns in American hearts, we may find her again.",
  "tags": [],
  "categories": [],
  "sitemap_lastmod": "2004-07-12T06:33:00+00:00"
}