{
  "url": "https://voxday.net/2004/07/27/devils-own/",
  "scraped_at": "2025-12-19T20:38:23.301469",
  "title": "The Devil’s Own",
  "date_display": "July 27, 2004",
  "date_iso": "2004-07-27T21:44:00+00:00",
  "date_from_url": "2004-07-27",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>Some people have complained that the blogroll is pushed to the bottom of the screen.  Others have lamented that the text at voxday.net is too small, and still others are agog at the green-on-black text in the archives there.  I regret the unpleasantries.</p><p>But interestingly enough, only those running Microsoft Internet Explorer are experiencing these difficulties.  I run Opera on Fedora Linux, Space Bunny runs Opera on Windows, and I also check things out on Mozilla and Firebird.  Everything looks and runs fine, and not only that, but I have little control over how this blog relates to Inferior Explorer, since it’s all Blogger code and external Javascript.</p><p>The problem is that Microsoft pays no heed to the HTML standards.  There are two options.  One, we can kowtow to Microsoft’s arrogance, put up with their ridiculous refusal to block pop-up ads – and you don’t realize just how annoying they are until you never see them anymore – and change to suit them.  I prefer to make my quixotic stand on the HTML standards and politely suggest that those of you experiencing browser difficulties consider meandering over to <a href=\"http://www.opera.com\">opera.com</a> and downloading Opera 7.53 for Windows.</p><p>It’s not hard, honestly, it’s free, it has an imitation Explorer skin if you want familiarity and you can even import your old bookmarks with little difficulty.  There may be many things in this life that one must grin and bear, but a lousy browser isn’t one of them.<br/></p></div>",
  "content_text": "Some people have complained that the blogroll is pushed to the bottom of the screen.  Others have lamented that the text at voxday.net is too small, and still others are agog at the green-on-black text in the archives there.  I regret the unpleasantries.\nBut interestingly enough, only those running Microsoft Internet Explorer are experiencing these difficulties.  I run Opera on Fedora Linux, Space Bunny runs Opera on Windows, and I also check things out on Mozilla and Firebird.  Everything looks and runs fine, and not only that, but I have little control over how this blog relates to Inferior Explorer, since it’s all Blogger code and external Javascript.\nThe problem is that Microsoft pays no heed to the HTML standards.  There are two options.  One, we can kowtow to Microsoft’s arrogance, put up with their ridiculous refusal to block pop-up ads – and you don’t realize just how annoying they are until you never see them anymore – and change to suit them.  I prefer to make my quixotic stand on the HTML standards and politely suggest that those of you experiencing browser difficulties consider meandering over to\nopera.com\nand downloading Opera 7.53 for Windows.\nIt’s not hard, honestly, it’s free, it has an imitation Explorer skin if you want familiarity and you can even import your old bookmarks with little difficulty.  There may be many things in this life that one must grin and bear, but a lousy browser isn’t one of them.",
  "tags": [],
  "categories": [],
  "sitemap_lastmod": "2004-07-27T20:44:00+00:00"
}