{
  "url": "https://voxday.net/2004/07/10/election-is-moo/",
  "scraped_at": "2025-12-19T20:35:22.537880",
  "title": "The election is moot?",
  "date_display": "July 10, 2004",
  "date_iso": "2004-07-10T11:10:00+00:00",
  "date_from_url": "2004-07-10",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>We spend a lot of time discussing the merits of third party voting here, but as I’ve now run across a fourth distinct source that believes that the election will be canceled in between now and November, I thought that I’d at least bring <a href=\"http://www.prisonplanet.com/022904degrand.html\">one of the more interestingly paranoid theories</a> to your attention.  Is any of this real?  I couldn’t possibly say.  The only thing of which I am sure is that there are real unanswered questions about the events of 9/11, that there a number of what appear to be logical holes in the official story, and that history suggests that there is more of a power struggle going on beneath the surface than the average person following the national media would be likely to understand.</p><p>As a tangential example, I happen to know from a direct source that the story about smart missiles hitting Baghdad was false.  The missiles weren’t that smart, instead, there were spotters who had infiltrated into Baghdad who were using lasers to guide the missiles into their targets.  A minor inaccuracy, sure, but a blatant misrepresentation of the facts by the government nonetheless.  As to the assertion that Israel tested out some of its tactical – if tactical is the word for something that can strike from 600 miles away – nukes in Iraq, I can’t say except that the radiation reported does seem far too high for it to be nothing but expended rounds of depleted uranium.</p><p>Conspiracy theory is the most accurate theory of history, the problem with using it to understand what is happening is that one seldom has any idea of which conspiracy is real and likely to be successful until it is all over.  Lenin’s takeover of Russia was a conspiracy after all; how many attempts to take over the USA have been made, attempts of which we have never heard?  Given Roman history, it stands to reason that more than one individual would very much like to take control of the most powerful military and wealthiest economy in the world.<br/></p><blockquote><p> <br>AJ: Do you think the globalists are going to have the will to carry out another massive attack here in the U.S. to try to get control back over the population and get their agenda back on track? Or do you think they’ve calculated, computed as you said, that that will blow up in their face because so many people now know who the real terrorists are?</br></p><p>DGP: That’s a two-prong question, Alex. I think it deserves a studied answer. The only thing I can say is I’m not sure how it will turn out. But it is very dangerous.</p><p>AJ: From watching the globalists, I think they had a plan, they are still following a plan but I think they are shook-up. I think, from the evidence, in fact I know from the evidence, that a lot of things they planned haven’t gone according to schedule and so they don’t know what to do right now.</p><p>DGP: This is correct. I think it’s personified in the persona of the Deputy Secretary of Defense Paul Wolfowitz. They almost got him in Baghdad when they fired the salvo, one night, of weaponry and they scared Paul Wolfowitz off. He’s ready to resign or get the hell out.</p><p>AJ: You think that was U.S. forces doing that?</p><p>DGP: I believe it. It was very well planned again and ..</p><p>AJ: Yeah, only U.S. forces would know that he would be there. Yeah.</p><p>DGP: That is correct. And the precision of those weapons that came into the hotel. There were eleven rounds in all and I can speak from authenticity that they scared the hell out of Paul Wolfowitz.<br/></p></blockquote><p>I have to admit, I did wonder about that mysterious attempted hit on Wolfowitz, as the modus operandi was very distinct from the usual suicide vehicle, RPG ambush or gang of gunmen.  It may <em>a priori</em> be a frightening thing to think that there may be elements in the military now in the midst of planning a coupe-de-etat, but then, it’s not necessarily the case that they are the bad guys either.  Perhaps, if they are serious about their oaths to the Constitution, we might even see a return to Constitutional government.  In these profoundly interesting times, the only thing of which we can be certain is that we do not have it now.</p><p>Could this simply be Y2K-style fearmongering writ large?  Definitely.  But as with Y2K, we’ll find out soon enough.<br/></p></div>",
  "content_text": "We spend a lot of time discussing the merits of third party voting here, but as I’ve now run across a fourth distinct source that believes that the election will be canceled in between now and November, I thought that I’d at least bring\none of the more interestingly paranoid theories\nto your attention.  Is any of this real?  I couldn’t possibly say.  The only thing of which I am sure is that there are real unanswered questions about the events of 9/11, that there a number of what appear to be logical holes in the official story, and that history suggests that there is more of a power struggle going on beneath the surface than the average person following the national media would be likely to understand.\nAs a tangential example, I happen to know from a direct source that the story about smart missiles hitting Baghdad was false.  The missiles weren’t that smart, instead, there were spotters who had infiltrated into Baghdad who were using lasers to guide the missiles into their targets.  A minor inaccuracy, sure, but a blatant misrepresentation of the facts by the government nonetheless.  As to the assertion that Israel tested out some of its tactical – if tactical is the word for something that can strike from 600 miles away – nukes in Iraq, I can’t say except that the radiation reported does seem far too high for it to be nothing but expended rounds of depleted uranium.\nConspiracy theory is the most accurate theory of history, the problem with using it to understand what is happening is that one seldom has any idea of which conspiracy is real and likely to be successful until it is all over.  Lenin’s takeover of Russia was a conspiracy after all; how many attempts to take over the USA have been made, attempts of which we have never heard?  Given Roman history, it stands to reason that more than one individual would very much like to take control of the most powerful military and wealthiest economy in the world.\nAJ: Do you think the globalists are going to have the will to carry out another massive attack here in the U.S. to try to get control back over the population and get their agenda back on track? Or do you think they’ve calculated, computed as you said, that that will blow up in their face because so many people now know who the real terrorists are?\nDGP: That’s a two-prong question, Alex. I think it deserves a studied answer. The only thing I can say is I’m not sure how it will turn out. But it is very dangerous.\nAJ: From watching the globalists, I think they had a plan, they are still following a plan but I think they are shook-up. I think, from the evidence, in fact I know from the evidence, that a lot of things they planned haven’t gone according to schedule and so they don’t know what to do right now.\nDGP: This is correct. I think it’s personified in the persona of the Deputy Secretary of Defense Paul Wolfowitz. They almost got him in Baghdad when they fired the salvo, one night, of weaponry and they scared Paul Wolfowitz off. He’s ready to resign or get the hell out.\nAJ: You think that was U.S. forces doing that?\nDGP: I believe it. It was very well planned again and ..\nAJ: Yeah, only U.S. forces would know that he would be there. Yeah.\nDGP: That is correct. And the precision of those weapons that came into the hotel. There were eleven rounds in all and I can speak from authenticity that they scared the hell out of Paul Wolfowitz.\nI have to admit, I did wonder about that mysterious attempted hit on Wolfowitz, as the modus operandi was very distinct from the usual suicide vehicle, RPG ambush or gang of gunmen.  It may\na priori\nbe a frightening thing to think that there may be elements in the military now in the midst of planning a coupe-de-etat, but then, it’s not necessarily the case that they are the bad guys either.  Perhaps, if they are serious about their oaths to the Constitution, we might even see a return to Constitutional government.  In these profoundly interesting times, the only thing of which we can be certain is that we do not have it now.\nCould this simply be Y2K-style fearmongering writ large?  Definitely.  But as with Y2K, we’ll find out soon enough.",
  "tags": [],
  "categories": [],
  "sitemap_lastmod": "2004-07-10T10:10:00+00:00"
}