{
  "url": "https://voxday.net/2004/07/03/empty-doorway-empty-mind/",
  "scraped_at": "2025-12-19T20:34:31.898107",
  "title": "Empty Doorway, empty mind",
  "date_display": "July 3, 2004",
  "date_iso": "2004-07-03T19:44:00+00:00",
  "date_from_url": "2004-07-03",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>Empty Doorway <a href=\"http://schemata.typepad.com/doorway/2004/07/when_too_much_c.html\">blogs about a post</a>:<br/></p><blockquote><p> <br>For those of us who firmly believe that the direct influence of religion in politics is antithetical to genuine democracy, Bush’s highly public Christian invocations, the presence of religious advisers in his administration whose sole purpose is to ensure that U.S. policy conforms to Christian doctrine (in particular, apocolyptic prophecies related to the nation of Israel), and his direct appeals to Catholic, and now Protestant, clergy to aid him in his bid for reelection, are extremely worrisome. Yet this is apparently not enough for some on the Religious Right, who feel that Bush has done too little, too late, to court their vote. Of course, most of them will still vote for Bush, but that’s not the point. Bush hasn’t done what they apparently thought he would, or at least should do: solidify conservative Christianity’s central role in forming national policy.<br/></br></p></blockquote><p>What does this moron believe democracy is?  Apparently the 5.3 percent of the population that is Southern Baptist are supposed to keep their mouths shut and not participate in the process, along with all the Catholics, Baptists, Methodists and assorted non-denominational Evangelical Christians.  Even if he is using the term “genuine democracy” incorrectly to refer to the Constitutional American republic, it’s a weird argument to insist that the political system formed by Christian men to respect God-given rights should be sterilized of all religion.</p><p>He wants genuine democracy?  So be it.  The only reason that the insignificant secularist minority has any power at all is that it has been successful in using its sympathizers in the courts to use federal power to suppress the will of the majority. <em>Fiat democrasia</em>!  Of course, if the Athenian model is any example, we’ll also be voting to execute momentarily unpopular generals, but that’s a known hazard of rule by mob.</p><blockquote><p> <br>What is truly frightening is not the sentiment expressed in such passages (especially the second one), but that groups whose members share these pernicious opinions have such a strong voice. They know how to make themselves heard, despite composing a relatively small minority of the U.S. population. They have mastered the technique of using appeals to emotion through faith and fear, to manipulate politicians and larger segments of the population into adopting their stances. Yet, it’s not enough for them that our president’s ear is ever open to their hateful nonsense, or that in decision-making, they are always in his mind. Scary stuff.<br/></br></p></blockquote><p>The Empty Mind is unsurprisingly more than a little weak on his math.  The reason the Christian voices are so well-heard is that the Christian community is so large, a much larger “minority” than blacks, Jews or homosexuals.  That’s why the Left, for all its mantra of “democracy, democracy”, fears the Religious Right and needs combat it through the courts instead of the ballot box.  The secular Left is so unpopular and so numerically insignificant that it can’t even win in the strictly limited democracy of the American political system and so is forced to have its “democracy” at a third remove, by unelected judges.  I’d like to hear what this guy’s definition of “genuine democracy” is, because as is clearly the case here, the use of the adjective necessitates a modification of the following noun.  I suspect that in his usage, “democracy” has little to do with how historians and dictionaries have defined the term for centuries.</p><p>I’d be scared too, if I looked at the world with so little understanding of what was happening around me.  And now there’s more from the Vacuous One:<br/></p><blockquote><p> <br> If you read his comments, keep in mind that I never implied Christians shouldn’t vote based on their faith. Rather, I stated that religion should not have a direct influence on policy. Recognizing the difference is apparently beyond the author’s mental grasp. I also recommend that someone buy him a dictionary, so that he can see that “constitutional republic” is a form of democracy. Naturally, I did not mean a “pure democracy,” in which each person has one vote on every policy decision.<br/></br></p></blockquote><p>I’m curious to know how, in a democracy of any sort, religion can fail to have a direct influence on policy if 20 percent (Empty’s estimate) of the population votes based on their faith?  It’s also amusing that he should think I need a dictionary, as he specifically used the term “genuine democracy” which clearly implies some form of distinction from our constitutional republican form of limited democracy.  “Genuine” is not to be mistaken for “pure”, okay….  And Mr. Webster says: “<em>Gen”u*ine, a. [L. genuinus, fr. genere, gignere, to beget, in pass., to be born: cf. F. g[‘e]nuine. See Gender.] Belonging to, or proceeding from, the original stock; native; hence, not counterfeit, spurious, false, or adulterated; authentic; real; natural; true; <b>pure</b>; as, a genuine text; a genuine production; genuine materials.</em>.  I’m the one who needs the dictionary?  Look, it’s hardly my fault that he can’t write with precision.<br/></p><blockquote><p>In addition, the author would surely benefit if someone explained the difference between Christian (general) and conservative Christian or Religious Right, the latter being a fairly small group that, if we use abortion as a rough measure (the author states that outlawing abortion would appeal to this group), comprises less than 20% of the population (we’d also have to subtract most Catholics who are strictly “pro-life” from that number for it to be accurate). At least the author demonstrates the un-Christian-like anger and condescension that characterizes his minority.<br/></p></blockquote><p>I have no conception of the difference between the broader Christian populace and the Religious Right?  Oh, so that’s what Ralph Reed was trying to explain to me when we were talking twelve years ago – before I was a Christian, by the way!  Apparently in Empty’s mind, this passes for a difficult concept.  And if 20 percent is “fairly small” I wonder why we spend any attention whatsoever to those insignificant black, Jewish and homosexual minorities, which taken in their totality barely amount to 15 percent.  I’m not in the least bit angry, but how can I help but condescend to someone who is this ill-equipped to reason or debate?<br/></p></div>",
  "content_text": "Empty Doorway\nblogs about a post\n:\nFor those of us who firmly believe that the direct influence of religion in politics is antithetical to genuine democracy, Bush’s highly public Christian invocations, the presence of religious advisers in his administration whose sole purpose is to ensure that U.S. policy conforms to Christian doctrine (in particular, apocolyptic prophecies related to the nation of Israel), and his direct appeals to Catholic, and now Protestant, clergy to aid him in his bid for reelection, are extremely worrisome. Yet this is apparently not enough for some on the Religious Right, who feel that Bush has done too little, too late, to court their vote. Of course, most of them will still vote for Bush, but that’s not the point. Bush hasn’t done what they apparently thought he would, or at least should do: solidify conservative Christianity’s central role in forming national policy.\nWhat does this moron believe democracy is?  Apparently the 5.3 percent of the population that is Southern Baptist are supposed to keep their mouths shut and not participate in the process, along with all the Catholics, Baptists, Methodists and assorted non-denominational Evangelical Christians.  Even if he is using the term “genuine democracy” incorrectly to refer to the Constitutional American republic, it’s a weird argument to insist that the political system formed by Christian men to respect God-given rights should be sterilized of all religion.\nHe wants genuine democracy?  So be it.  The only reason that the insignificant secularist minority has any power at all is that it has been successful in using its sympathizers in the courts to use federal power to suppress the will of the majority.\nFiat democrasia\n!  Of course, if the Athenian model is any example, we’ll also be voting to execute momentarily unpopular generals, but that’s a known hazard of rule by mob.\nWhat is truly frightening is not the sentiment expressed in such passages (especially the second one), but that groups whose members share these pernicious opinions have such a strong voice. They know how to make themselves heard, despite composing a relatively small minority of the U.S. population. They have mastered the technique of using appeals to emotion through faith and fear, to manipulate politicians and larger segments of the population into adopting their stances. Yet, it’s not enough for them that our president’s ear is ever open to their hateful nonsense, or that in decision-making, they are always in his mind. Scary stuff.\nThe Empty Mind is unsurprisingly more than a little weak on his math.  The reason the Christian voices are so well-heard is that the Christian community is so large, a much larger “minority” than blacks, Jews or homosexuals.  That’s why the Left, for all its mantra of “democracy, democracy”, fears the Religious Right and needs combat it through the courts instead of the ballot box.  The secular Left is so unpopular and so numerically insignificant that it can’t even win in the strictly limited democracy of the American political system and so is forced to have its “democracy” at a third remove, by unelected judges.  I’d like to hear what this guy’s definition of “genuine democracy” is, because as is clearly the case here, the use of the adjective necessitates a modification of the following noun.  I suspect that in his usage, “democracy” has little to do with how historians and dictionaries have defined the term for centuries.\nI’d be scared too, if I looked at the world with so little understanding of what was happening around me.  And now there’s more from the Vacuous One:\nIf you read his comments, keep in mind that I never implied Christians shouldn’t vote based on their faith. Rather, I stated that religion should not have a direct influence on policy. Recognizing the difference is apparently beyond the author’s mental grasp. I also recommend that someone buy him a dictionary, so that he can see that “constitutional republic” is a form of democracy. Naturally, I did not mean a “pure democracy,” in which each person has one vote on every policy decision.\nI’m curious to know how, in a democracy of any sort, religion can fail to have a direct influence on policy if 20 percent (Empty’s estimate) of the population votes based on their faith?  It’s also amusing that he should think I need a dictionary, as he specifically used the term “genuine democracy” which clearly implies some form of distinction from our constitutional republican form of limited democracy.  “Genuine” is not to be mistaken for “pure”, okay….  And Mr. Webster says: “\nGen”u*ine, a. [L. genuinus, fr. genere, gignere, to beget, in pass., to be born: cf. F. g[‘e]nuine. See Gender.] Belonging to, or proceeding from, the original stock; native; hence, not counterfeit, spurious, false, or adulterated; authentic; real; natural; true;\npure\n; as, a genuine text; a genuine production; genuine materials.\n.  I’m the one who needs the dictionary?  Look, it’s hardly my fault that he can’t write with precision.\nIn addition, the author would surely benefit if someone explained the difference between Christian (general) and conservative Christian or Religious Right, the latter being a fairly small group that, if we use abortion as a rough measure (the author states that outlawing abortion would appeal to this group), comprises less than 20% of the population (we’d also have to subtract most Catholics who are strictly “pro-life” from that number for it to be accurate). At least the author demonstrates the un-Christian-like anger and condescension that characterizes his minority.\nI have no conception of the difference between the broader Christian populace and the Religious Right?  Oh, so that’s what Ralph Reed was trying to explain to me when we were talking twelve years ago – before I was a Christian, by the way!  Apparently in Empty’s mind, this passes for a difficult concept.  And if 20 percent is “fairly small” I wonder why we spend any attention whatsoever to those insignificant black, Jewish and homosexual minorities, which taken in their totality barely amount to 15 percent.  I’m not in the least bit angry, but how can I help but condescend to someone who is this ill-equipped to reason or debate?",
  "tags": [],
  "categories": [],
  "sitemap_lastmod": "2004-07-03T18:44:00+00:00"
}