{
  "url": "https://voxday.net/2004/07/07/false-assumptions/",
  "scraped_at": "2025-12-19T20:35:00.231817",
  "title": "False assumptions",
  "date_display": "July 7, 2004",
  "date_iso": "2004-07-07T11:00:00+00:00",
  "date_from_url": "2004-07-07",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>A former <a href=\"http://www.freedomfoundation.us/teaching_in_government_schools\">public school teacher writes</a>:<br/></p><blockquote><p> <br>Picture “advanced placement” 4th, 7th, or even 8th graders who do not know their addition tables, or the names (much less the sounds) of the vowels.</br></p><p>I not so long ago looked into some federal funds for pre-school reading programs under the No Child Left Behind (NCLB) Act. I was initially optimistic, as I had had excellent recent success getting three and four-year-olds reading fluidly (as high as the upper middle school level, in terms of proficiency). On inspection of the grant offer materials, I found I did not qualify – for the simple reason that the government “absolutely” did not encourage the teaching of actual reading to pre-schoolers. Recognition of the letters of the alphabet was the <b>maximum acceptable</b>.</p><p>If you are considering sending your kids to government schools (or have some there already), be advised that the above account accurately describes such schools. The only variance pertains to the “chatted, argued, screamed…” passage. That state of affairs, you see, exists only in those classrooms whose misguided adult patrons attempt to actually be teachers. Administrators take care of such infidels in short order – by making it crystal clear to these poor souls’ pupils that they (the administrators) do not support them (the poor souls). By now, most classroom managers are compliant in their expected roles as social directors, abdicating these roles just long enough to cover the pretentious, perfunctory pablum required on today’s standardized tests. Such classrooms are uniformly harmonious most of the time.</p><p>You do not have to accept that there is an organized conspiracy to keep our kids ignorant to get the picture. As long as you realize that things are exactly as they would be if there were such a conspiracy, that will suffice.<br/></p></blockquote><p>There are a number of assumptions that a parent foolish enough to put his child into the government schools must make in order to do so:</p><p>1) <em>I turned out okay, therefore my child will be fine.</em> This is based on the assumption that nothing in the school system has changed significantly in the quarter-century since you were in first grade.  This is false.</p><p>2) <em>The purpose of a school is to teach reading, writing and math.</em> This, too, is false.  Not only do the actions of most educational institutions belie this assumption, but often their charters, slogans and policies state outright that this is not the case.</p><p>3) <em>My child’s teachers care about my child’s education.</em> Of course they pretend to care, but does one really expect a teacher to publicly proclaim his true indifference?  The average teacher doesn’t care any more about how much the children in his class learn  than the average office worker cares about his job.  I don’t know about you, but based on my office experience, that’s a pretty high level of apathy.  The testimony of this teacher and other former teachers like John Gatto certainly appears to support this line of reasoning.<br/></p></div>",
  "content_text": "A former\npublic school teacher writes\n:\nPicture “advanced placement” 4th, 7th, or even 8th graders who do not know their addition tables, or the names (much less the sounds) of the vowels.\nI not so long ago looked into some federal funds for pre-school reading programs under the No Child Left Behind (NCLB) Act. I was initially optimistic, as I had had excellent recent success getting three and four-year-olds reading fluidly (as high as the upper middle school level, in terms of proficiency). On inspection of the grant offer materials, I found I did not qualify – for the simple reason that the government “absolutely” did not encourage the teaching of actual reading to pre-schoolers. Recognition of the letters of the alphabet was the\nmaximum acceptable\n.\nIf you are considering sending your kids to government schools (or have some there already), be advised that the above account accurately describes such schools. The only variance pertains to the “chatted, argued, screamed…” passage. That state of affairs, you see, exists only in those classrooms whose misguided adult patrons attempt to actually be teachers. Administrators take care of such infidels in short order – by making it crystal clear to these poor souls’ pupils that they (the administrators) do not support them (the poor souls). By now, most classroom managers are compliant in their expected roles as social directors, abdicating these roles just long enough to cover the pretentious, perfunctory pablum required on today’s standardized tests. Such classrooms are uniformly harmonious most of the time.\nYou do not have to accept that there is an organized conspiracy to keep our kids ignorant to get the picture. As long as you realize that things are exactly as they would be if there were such a conspiracy, that will suffice.\nThere are a number of assumptions that a parent foolish enough to put his child into the government schools must make in order to do so:\n1)\nI turned out okay, therefore my child will be fine.\nThis is based on the assumption that nothing in the school system has changed significantly in the quarter-century since you were in first grade.  This is false.\n2)\nThe purpose of a school is to teach reading, writing and math.\nThis, too, is false.  Not only do the actions of most educational institutions belie this assumption, but often their charters, slogans and policies state outright that this is not the case.\n3)\nMy child’s teachers care about my child’s education.\nOf course they pretend to care, but does one really expect a teacher to publicly proclaim his true indifference?  The average teacher doesn’t care any more about how much the children in his class learn  than the average office worker cares about his job.  I don’t know about you, but based on my office experience, that’s a pretty high level of apathy.  The testimony of this teacher and other former teachers like John Gatto certainly appears to support this line of reasoning.",
  "tags": [],
  "categories": [],
  "sitemap_lastmod": "2004-07-07T10:00:00+00:00"
}