{
  "url": "https://voxday.net/2004/07/06/fedora-fix/",
  "scraped_at": "2025-12-19T20:34:49.202504",
  "title": "Fedora Fix",
  "date_display": "July 6, 2004",
  "date_iso": "2004-07-06T15:32:00+00:00",
  "date_from_url": "2004-07-06",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>One of the biggest headaches with Fedora Core 1 and Fedora Core 2 is the cretinous way it handles PCMCIA wireless cards.  I managed to get this machine working somehow, but never quite got the other one going despite numerous attempts… until finally the thing died thanks to Dell’s quality motherboards.</p><p>So, I can’t test this fix out, at least not until I get my next machine, but based on the responses on the Fedora forum it appears to finally have done the trick.<br/></p><blockquote><p> <br>Open /etc/init.d/pcmcia<br> <br>Change the line</br></br></br></p><p>#  chkconfig:  2345  24  96</p><p>to</p><p>#  chkconfig:  2345  09  96</p><p>Yes, it’s in a comment, but it seems it has meaning to the chkconfig command (chkconfig  –level  2345  pcmcia  reset)<br/></p></blockquote><p>What the fix appears to do is to load PCMCIA <em>before</em> the network instead of after it, as Fedora stupidly insists on doing by default.  Obviously, the network cannot work if the drivers for the hardware upon which it rests is not yet loaded.  This would seem to indicate that no one on the development team has a laptop with wireless PCMCIA, or Fedora would never have shipped the first time with this problem, let alone the second.  Well, that’s the hazard of using an Open Source OS; the good news is that now that the problem has finally been identified, it will be addressed in the next OS release.<br/></p></div>",
  "content_text": "One of the biggest headaches with Fedora Core 1 and Fedora Core 2 is the cretinous way it handles PCMCIA wireless cards.  I managed to get this machine working somehow, but never quite got the other one going despite numerous attempts… until finally the thing died thanks to Dell’s quality motherboards.\nSo, I can’t test this fix out, at least not until I get my next machine, but based on the responses on the Fedora forum it appears to finally have done the trick.\nOpen /etc/init.d/pcmcia\nChange the line\n#  chkconfig:  2345  24  96\nto\n#  chkconfig:  2345  09  96\nYes, it’s in a comment, but it seems it has meaning to the chkconfig command (chkconfig  –level  2345  pcmcia  reset)\nWhat the fix appears to do is to load PCMCIA\nbefore\nthe network instead of after it, as Fedora stupidly insists on doing by default.  Obviously, the network cannot work if the drivers for the hardware upon which it rests is not yet loaded.  This would seem to indicate that no one on the development team has a laptop with wireless PCMCIA, or Fedora would never have shipped the first time with this problem, let alone the second.  Well, that’s the hazard of using an Open Source OS; the good news is that now that the problem has finally been identified, it will be addressed in the next OS release.",
  "tags": [],
  "categories": [],
  "sitemap_lastmod": "2004-07-06T14:32:00+00:00"
}