{
  "url": "https://voxday.net/2004/07/14/holy-religious-conservatives-batman/",
  "scraped_at": "2025-12-19T20:36:01.518843",
  "title": "Holy religious conservatives, Batman!",
  "date_display": "July 14, 2004",
  "date_iso": "2004-07-14T08:58:00+00:00",
  "date_from_url": "2004-07-14",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>You know George Bush is in serious trouble when lifetime Republican stalwarts are beginning to turn their back on him.  Joseph Farah is a genuine independent.  Ilana Mercer and I are outspoken libertarians.  We didn’t vote for Bush in 2000 or his father before him.  But Tom Ambrose, the Commentary Editor at WorldNetDaily, has always been a strong Republican.  That makes <a href=\"http://www.worldnetdaily.com/news/article.asp?ARTICLE_ID=39433\">these words</a> all the more incredible:<br/></p><blockquote><p> <br>Let’s be real: There is no longer any substantial difference between the Republican Party and the Democratic Party. The GOP now even actively supports pro-homosexual and pro-abortion politicians. Enough is enough!</br></p><p>Religious conservatives comprise some 30 to 40 percent of the Republican Party. Rather than supporting spineless, highly compromised GOP phonies, why not work for something worthwhile such as the Constitution Party’s political platform?</p><p>For me, the bottom line is this: I do not want to stand before God one day and tell Him I enabled evil to continue unchecked because I was afraid to do the right thing and, consequently, caved in to what was expedient. No matter what happens, God is still sovereign, but at least I can say I stood against the evil now engulfing the United States. Will you be able to say that?<br/></p></blockquote><p>Much respect, Tom, much respect.  I have a feeling that the Libertarian and Constitution Party’s vote totals are going to surprise everyone this fall.  This assumes, of course, that there IS going to be an election.<br/></p></div>",
  "content_text": "You know George Bush is in serious trouble when lifetime Republican stalwarts are beginning to turn their back on him.  Joseph Farah is a genuine independent.  Ilana Mercer and I are outspoken libertarians.  We didn’t vote for Bush in 2000 or his father before him.  But Tom Ambrose, the Commentary Editor at WorldNetDaily, has always been a strong Republican.  That makes\nthese words\nall the more incredible:\nLet’s be real: There is no longer any substantial difference between the Republican Party and the Democratic Party. The GOP now even actively supports pro-homosexual and pro-abortion politicians. Enough is enough!\nReligious conservatives comprise some 30 to 40 percent of the Republican Party. Rather than supporting spineless, highly compromised GOP phonies, why not work for something worthwhile such as the Constitution Party’s political platform?\nFor me, the bottom line is this: I do not want to stand before God one day and tell Him I enabled evil to continue unchecked because I was afraid to do the right thing and, consequently, caved in to what was expedient. No matter what happens, God is still sovereign, but at least I can say I stood against the evil now engulfing the United States. Will you be able to say that?\nMuch respect, Tom, much respect.  I have a feeling that the Libertarian and Constitution Party’s vote totals are going to surprise everyone this fall.  This assumes, of course, that there IS going to be an election.",
  "tags": [],
  "categories": [],
  "sitemap_lastmod": "2004-07-14T07:58:00+00:00"
}