{
  "url": "https://voxday.net/2004/07/02/its-little-late-george/",
  "scraped_at": "2025-12-19T20:34:19.028335",
  "title": "It’s a little late, George",
  "date_display": "July 2, 2004",
  "date_iso": "2004-07-02T14:11:00+00:00",
  "date_from_url": "2004-07-02",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><blockquote><p> <br>President Bush, <a href=\"http://news.myway.com/top/article/id/37773|top|07-01-2004::20:10|reuters.html\">seeking to mobilize religious conservatives</a> for his reelection campaign, has asked church-going volunteers to turn over church membership directories, campaign officials said on Thursday. In a move sharply criticized both by religious leaders and civil libertarians, the Bush-Cheney campaign has issued a guide listing about two-dozen “duties” and a series of deadlines for organizing support among conservative church congregations.</br></p><p>A copy of the guide obtained by Reuters directs religious volunteers to send church directories to state campaign committees, identify new churches that can be organized by the Bush campaign and talk to clergy about holding voter registration drives. The document, distributed to campaign coordinators across the country earlier this year, also recommends that volunteers distribute voter guides in church and use Sunday service programs for get-out-the-vote drives.</p><p>“We expect this election to be potentially as close as 2000, so every vote counts and it’s important to reach out to every single supporter of President Bush,” campaign spokesman Scott Stanzel said.<br/></p></blockquote><p>If the president had signed an executive order banning abortion, refused to sign the McCain-Feingold act gutting the First Amendment, declined to actively campaign for the liberal Republican who blocked Robert Bork from the Supreme Court, avoided publicly embracing Islam and openly declared his opposition to the fictional equation of any public mention of anything even remotely Christian with the written statement that “Congress shall make no law….”, he might have a shot with the Religious Right.  But he’s done nothing except make the occasional pious statement.  Bill Clinton did as much.</p><p>Perhaps, too, he should have <a href=\"http://www.washtimes.com/national/pruden.htm\">refrained from criticizing Americans</a> for speaking “<em>in an ill-informed and insulting manner about the Muslim faith.</em>”  This, after the beheadings of Nick Berg and Paul Johnson.  I can’t even think of a response to that that is either Christian or printable, so I shall say nothing except to say that I am very pleased to be voting for Michael Badnarik this fall.</p><p>I had thought Karl Rove was supposed to be some sort of political genius, instead, the president’s campaign lurches randomly about, devoid of principle and pinning its hopes on the self-destruction of its opposition.  The president is lucky he’s running against a candidate as incompetent as John Kerry, because Bill Clinton would be wiping up the floor with him by now.  When Massachusetts created homogamy, I wrongly assumed that Karl Rove and company would be all over the Democrats for pushing the homosexual agenda, but apparently they’d rather be PC than win.  You know Lee Atwater would have created an ad showing John Kerry in a dress getting married to Ted Kennedy and blown Kerry out of the water by August.<br/></p></div>",
  "content_text": "President Bush,\nseeking to mobilize religious conservatives\nfor his reelection campaign, has asked church-going volunteers to turn over church membership directories, campaign officials said on Thursday. In a move sharply criticized both by religious leaders and civil libertarians, the Bush-Cheney campaign has issued a guide listing about two-dozen “duties” and a series of deadlines for organizing support among conservative church congregations.\nA copy of the guide obtained by Reuters directs religious volunteers to send church directories to state campaign committees, identify new churches that can be organized by the Bush campaign and talk to clergy about holding voter registration drives. The document, distributed to campaign coordinators across the country earlier this year, also recommends that volunteers distribute voter guides in church and use Sunday service programs for get-out-the-vote drives.\n“We expect this election to be potentially as close as 2000, so every vote counts and it’s important to reach out to every single supporter of President Bush,” campaign spokesman Scott Stanzel said.\nIf the president had signed an executive order banning abortion, refused to sign the McCain-Feingold act gutting the First Amendment, declined to actively campaign for the liberal Republican who blocked Robert Bork from the Supreme Court, avoided publicly embracing Islam and openly declared his opposition to the fictional equation of any public mention of anything even remotely Christian with the written statement that “Congress shall make no law….”, he might have a shot with the Religious Right.  But he’s done nothing except make the occasional pious statement.  Bill Clinton did as much.\nPerhaps, too, he should have\nrefrained from criticizing Americans\nfor speaking “\nin an ill-informed and insulting manner about the Muslim faith.\n”  This, after the beheadings of Nick Berg and Paul Johnson.  I can’t even think of a response to that that is either Christian or printable, so I shall say nothing except to say that I am very pleased to be voting for Michael Badnarik this fall.\nI had thought Karl Rove was supposed to be some sort of political genius, instead, the president’s campaign lurches randomly about, devoid of principle and pinning its hopes on the self-destruction of its opposition.  The president is lucky he’s running against a candidate as incompetent as John Kerry, because Bill Clinton would be wiping up the floor with him by now.  When Massachusetts created homogamy, I wrongly assumed that Karl Rove and company would be all over the Democrats for pushing the homosexual agenda, but apparently they’d rather be PC than win.  You know Lee Atwater would have created an ad showing John Kerry in a dress getting married to Ted Kennedy and blown Kerry out of the water by August.",
  "tags": [],
  "categories": [],
  "sitemap_lastmod": "2004-07-02T13:11:00+00:00"
}