{
  "url": "https://voxday.net/2004/07/29/its-football-time-3/",
  "scraped_at": "2025-12-19T20:38:34.620593",
  "title": "It’s football time",
  "date_display": "July 29, 2004",
  "date_iso": "2004-07-29T10:29:00+00:00",
  "date_from_url": "2004-07-29",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>Madden 2004 probably has the best music of any video game ever.  Good rock, solid rap, and <a href=\"http://www.easports.com/downloads/sports_music/madden2004/bone_crusher.mp3\">the one track by Bone Crusher</a> gets you more fired up for an approaching NFL season than anything recorded since the Monday Night Football song.  I can’t even think about it without starting to tremble with anticipation like my dog when he sees me tearing a strip of fat off the ham while I’m making a sandwich.</p><p>Thank God for European soccer, because without it the spring/summer offseason would be unbearable.  I usually don’t let myself play Madden or think about football until August 1, but one of the guys in our fantasy league is getting married so we had to move our draft up.  Last year, after no less than four straight years of finishing first or second in the regular season then getting upset in the first round of the playoffs, the Choker King finally collected the championship that had so long eluded him.  The White Buffalo made the playoffs for the first time since his championship-winning year in 1996, so he’s hoping it won’t be another eight years between postseason appearances.  I bounced back from a bottom-dwelling 2002 but failed to make the playoffs for the third straight year myself.</p><p>As for the real league, I’ll confine myself to considering the NFC North today.  The Packers are, as always, dependent upon Brett Favre, who can beat anyone except the Vikings.  The Vikings have added some solid defensive players to go with the league’s  top offense, but as always, the question is if the coaching staff can get them to beat the weak sisters.  They would have won the division easily if not for choking against the Giants, Chargers, Raiders and -erk- Cardinals.  People are getting way too excited about the Lions – remember, Matt Millen is still running that ongoing train wreck from Pennsylvania – and if they improve by more than two games, I’ll be shocked.  The Bears won’t be as bad as last year now that Mr. Interception is history.  What they were thinking, I’ll never know.  As Big Chilly said: “when even your effeminate, got-to-be-gay waiter in San Francisco is wondering what the Hell is wrong with the Bears GM, you’ve got to figure it’s going to get ugly.”</p><p>Prediction for the NFC North: Vikings, Packers, Bears, Lions<br/></p></div>",
  "content_text": "Madden 2004 probably has the best music of any video game ever.  Good rock, solid rap, and\nthe one track by Bone Crusher\ngets you more fired up for an approaching NFL season than anything recorded since the Monday Night Football song.  I can’t even think about it without starting to tremble with anticipation like my dog when he sees me tearing a strip of fat off the ham while I’m making a sandwich.\nThank God for European soccer, because without it the spring/summer offseason would be unbearable.  I usually don’t let myself play Madden or think about football until August 1, but one of the guys in our fantasy league is getting married so we had to move our draft up.  Last year, after no less than four straight years of finishing first or second in the regular season then getting upset in the first round of the playoffs, the Choker King finally collected the championship that had so long eluded him.  The White Buffalo made the playoffs for the first time since his championship-winning year in 1996, so he’s hoping it won’t be another eight years between postseason appearances.  I bounced back from a bottom-dwelling 2002 but failed to make the playoffs for the third straight year myself.\nAs for the real league, I’ll confine myself to considering the NFC North today.  The Packers are, as always, dependent upon Brett Favre, who can beat anyone except the Vikings.  The Vikings have added some solid defensive players to go with the league’s  top offense, but as always, the question is if the coaching staff can get them to beat the weak sisters.  They would have won the division easily if not for choking against the Giants, Chargers, Raiders and -erk- Cardinals.  People are getting way too excited about the Lions – remember, Matt Millen is still running that ongoing train wreck from Pennsylvania – and if they improve by more than two games, I’ll be shocked.  The Bears won’t be as bad as last year now that Mr. Interception is history.  What they were thinking, I’ll never know.  As Big Chilly said: “when even your effeminate, got-to-be-gay waiter in San Francisco is wondering what the Hell is wrong with the Bears GM, you’ve got to figure it’s going to get ugly.”\nPrediction for the NFC North: Vikings, Packers, Bears, Lions",
  "tags": [],
  "categories": [],
  "sitemap_lastmod": "2004-07-29T09:29:00+00:00"
}