{
  "url": "https://voxday.net/2004/07/13/lenin-inflation-and-destruction-of/",
  "scraped_at": "2025-12-19T20:35:46.714364",
  "title": "Lenin, inflation and the destruction of capitalism",
  "date_display": "July 13, 2004",
  "date_iso": "2004-07-13T09:11:00+00:00",
  "date_from_url": "2004-07-13",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>John Maynard Keynes on Lenin and inflation:<br/></p><blockquote><p> <br>Lenin is said to have declared that the best way to destroy the Capitalist System was to debauch the currency. By a continuing process of inflation, Governments can confiscate, secretly and unobserved, an important part of the wealth of their citizens. By this method they not only confiscate, but they confiscate arbitrarily; and, while the process impoverishes many, it actually enriches some. The sight of this arbitrary rearrangement of riches strikes not only at security, but at confidence in the equity (or fairness) of the existing distribution of wealth.</br></p><p>As the inflation proceeds and the real value of the currency fluctuates wildly from month to month, all permanent relations between debtors and creditors, which form the ultimate foundation of capitalism, become so utterly disordered as to be almost meaningless; and the process of wealth-getting degenerates into a gamble and a lottery.</p><p>Lenin was certainly right. There is no subtler, no surer means of overturning the existing basis of Society than to debauch the currency. The process engages all the hidden forces of economic law on the side of destruction, and does it in a manner which not one man in a million is able to diagnose.<br/></p></blockquote><p>Bill Fleckenstein, the market analyst and hedge fund owner who continues to hammer away at the disaster that Alan Greenspan and the politicians of both parties are creating for us, quoted this in the context of the inflation that the CPI charade no longer hides.  He also adds that <a href=\"http://moneycentral.msn.com/content/p85428.asp\">he is concerned</a> about the likelihood of a medium-term market crash:<br/></p><blockquote><p> <br>My gut feeling — though there is no way for me to quantify it — is that probability of a crash at some point in the next six months to a year is far higher now than in 1987. One subjective reason is that I just don’t think it’s possible for all the thousands of hedge funds and hundreds of thousands or millions of people who think they’re talented enough to outwit the stock market — and who believe they can play this game of speculating in an overvalued, dangerous stock market — to get out whole….</br></p><p>Personally,  as I often note, I am short stocks (mostly tech stocks), own gold and silver (as well as gold and silver mining stocks) and foreign currencies.<br/></p></blockquote><p>I haven’t gone short yet – I’m waiting until the next mini-bounce plays out, but that otherwise describes my essential positions as well.  This is NOT the time to be long stocks, as it does not look as if the Fed can extend the Wave 2 countertrend any longer.  I learned my lesson from last time – don’t fight the Fed, but instead wait until they throw in the towel.  The Fed can’t defeat the market, but it can delay the inevitable for a while.<br/></p></div>",
  "content_text": "John Maynard Keynes on Lenin and inflation:\nLenin is said to have declared that the best way to destroy the Capitalist System was to debauch the currency. By a continuing process of inflation, Governments can confiscate, secretly and unobserved, an important part of the wealth of their citizens. By this method they not only confiscate, but they confiscate arbitrarily; and, while the process impoverishes many, it actually enriches some. The sight of this arbitrary rearrangement of riches strikes not only at security, but at confidence in the equity (or fairness) of the existing distribution of wealth.\nAs the inflation proceeds and the real value of the currency fluctuates wildly from month to month, all permanent relations between debtors and creditors, which form the ultimate foundation of capitalism, become so utterly disordered as to be almost meaningless; and the process of wealth-getting degenerates into a gamble and a lottery.\nLenin was certainly right. There is no subtler, no surer means of overturning the existing basis of Society than to debauch the currency. The process engages all the hidden forces of economic law on the side of destruction, and does it in a manner which not one man in a million is able to diagnose.\nBill Fleckenstein, the market analyst and hedge fund owner who continues to hammer away at the disaster that Alan Greenspan and the politicians of both parties are creating for us, quoted this in the context of the inflation that the CPI charade no longer hides.  He also adds that\nhe is concerned\nabout the likelihood of a medium-term market crash:\nMy gut feeling — though there is no way for me to quantify it — is that probability of a crash at some point in the next six months to a year is far higher now than in 1987. One subjective reason is that I just don’t think it’s possible for all the thousands of hedge funds and hundreds of thousands or millions of people who think they’re talented enough to outwit the stock market — and who believe they can play this game of speculating in an overvalued, dangerous stock market — to get out whole….\nPersonally,  as I often note, I am short stocks (mostly tech stocks), own gold and silver (as well as gold and silver mining stocks) and foreign currencies.\nI haven’t gone short yet – I’m waiting until the next mini-bounce plays out, but that otherwise describes my essential positions as well.  This is NOT the time to be long stocks, as it does not look as if the Fed can extend the Wave 2 countertrend any longer.  I learned my lesson from last time – don’t fight the Fed, but instead wait until they throw in the towel.  The Fed can’t defeat the market, but it can delay the inevitable for a while.",
  "tags": [],
  "categories": [],
  "sitemap_lastmod": "2004-07-13T08:11:00+00:00"
}