{
  "url": "https://voxday.net/2004/07/18/lesson-of-britney-spears/",
  "scraped_at": "2025-12-19T20:36:38.266211",
  "title": "The lesson of Britney Spears",
  "date_display": "July 18, 2004",
  "date_iso": "2004-07-18T13:09:00+00:00",
  "date_from_url": "2004-07-18",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>The depths of truth can be illustrated at times by the most unlikely sources.  Consider the case of the recently divorced and currently affianced Miss Spears.  Here is a young woman more attractive than the norm – not significantly so, but that is part of her appeal to the masses – who has amassed a remarkable amount of fame and fortune in her short time on the planet.  Even what would, to the casual observer such as myself, appear to be a complete lack of talent beyond the choreographed rump-shaking that your average pole dancer could approximate with ease, has not prevented her from becoming a top-tier star.</p><p> A few weeks ago, Matt Drudge brought our attention to the sad story of Miss Spears’ first husband, a childhood friend, who, despite being handicapped by an apparent intelligence barely on the north side of a rock, appears to be a genuinely decent human being.  According to his telling – and we have no reason to disbelieve him – it was not his wife who wished to end the marriage but her parents, advisors, employees and assorted hangers-on, all of whom are financially dependent upon the Britney Spears industry.  Obviously, they felt that at 22, the industry would be more profitable were it not distracted by the blessed state of matrimony.</p><p> There is a saying: be careful what you wish for, you just might get it.  The Spears’ profiteers succeeded in breaking up the marriage, as the humble Mr. Alexander was not about to stand in the way of his old friend’s business.  But Miss Spears has that sort of youthfully lush figure which not only indicates today a woman who will likely endure a long battle against caloric intake, but in days of yore was seen as a woman ready to breed.</p><p> As Miss Spears was no sooner wrested from the large, but harmless clutches of her ex-husband than she managed to fall “in love” with a useless male specimen of the sort known as a “dancer”, it would seem that the industry was indeed more interested in her natural instinct to find a mate and propagate the species than maximizing her future profit potential.  The biological imperative trumps the financial mandate, it seems.   One imagines that Britney Spears Incorporated is not only ruefully wishing that it had been wise enough to leave the industry to its own devices in matters romantic, but is collectively wincing as it calculates what it will eventually cost to remove this parasitical gigolo.  If the parasite is as ruthlessly self-seeking as it appears to be – it takes a stone cold squid to abandon not one, but two children, and their mother – it will require some expensive financial surgery indeed.</p><p> I found it amusing that on the very same day that Britney Spears Inc. was threatening to sue the New York Post for claiming that she had been drinking whiskey in a picture it published a few weeks ago, (for the same reason that CourtneyLove is not often used to endorse teen products), the U.K. Sun published several photos of her publicly groping the aforementioned useless specimen in an R-rated manner.  One wonders if B.S.I. will soon release a press release explaining that Miss Spears was only attempting to determine what brand of underwear her fiance was wearing, and that in her innocence of male intimates, she did not realize that the tag generally goes in the back.</p><p> Let me assure the gentle reader, there is indeed a point to this vaguely salacious pop cultural gossip.  For if a young woman cannot be controlled by her parents and those closest to her, even when her financial best interest manifestly depends on her accession to such control, no human can be reliably controlled by anyone, much less the decrees of a distant government. <em>Humans cannot be controlled!</em> Not in their best interest, not in their long-term interests, and certainly not in the interests of their self-anointed masters.  Not for long, anyhow.</p><p> This is the great tragedy of the Platonists.  Regardless of what current ideological excuse is currently justifying their mastery, the Platonist will always end up betraying it, as, in frustration, he turns lethal force on those he once thought only to guide and help.  For all the empty-eyed, gum-chewing, udder-engorged resemblance that the average teen mall rat bears to domesticated ungulates, she cannot be herded!  What God has given to even the least of those created in His image – free will – no mere mortal may hope to take away.<br/></p></div>",
  "content_text": "The depths of truth can be illustrated at times by the most unlikely sources.  Consider the case of the recently divorced and currently affianced Miss Spears.  Here is a young woman more attractive than the norm – not significantly so, but that is part of her appeal to the masses – who has amassed a remarkable amount of fame and fortune in her short time on the planet.  Even what would, to the casual observer such as myself, appear to be a complete lack of talent beyond the choreographed rump-shaking that your average pole dancer could approximate with ease, has not prevented her from becoming a top-tier star.\nA few weeks ago, Matt Drudge brought our attention to the sad story of Miss Spears’ first husband, a childhood friend, who, despite being handicapped by an apparent intelligence barely on the north side of a rock, appears to be a genuinely decent human being.  According to his telling – and we have no reason to disbelieve him – it was not his wife who wished to end the marriage but her parents, advisors, employees and assorted hangers-on, all of whom are financially dependent upon the Britney Spears industry.  Obviously, they felt that at 22, the industry would be more profitable were it not distracted by the blessed state of matrimony.\nThere is a saying: be careful what you wish for, you just might get it.  The Spears’ profiteers succeeded in breaking up the marriage, as the humble Mr. Alexander was not about to stand in the way of his old friend’s business.  But Miss Spears has that sort of youthfully lush figure which not only indicates today a woman who will likely endure a long battle against caloric intake, but in days of yore was seen as a woman ready to breed.\nAs Miss Spears was no sooner wrested from the large, but harmless clutches of her ex-husband than she managed to fall “in love” with a useless male specimen of the sort known as a “dancer”, it would seem that the industry was indeed more interested in her natural instinct to find a mate and propagate the species than maximizing her future profit potential.  The biological imperative trumps the financial mandate, it seems.   One imagines that Britney Spears Incorporated is not only ruefully wishing that it had been wise enough to leave the industry to its own devices in matters romantic, but is collectively wincing as it calculates what it will eventually cost to remove this parasitical gigolo.  If the parasite is as ruthlessly self-seeking as it appears to be – it takes a stone cold squid to abandon not one, but two children, and their mother – it will require some expensive financial surgery indeed.\nI found it amusing that on the very same day that Britney Spears Inc. was threatening to sue the New York Post for claiming that she had been drinking whiskey in a picture it published a few weeks ago, (for the same reason that CourtneyLove is not often used to endorse teen products), the U.K. Sun published several photos of her publicly groping the aforementioned useless specimen in an R-rated manner.  One wonders if B.S.I. will soon release a press release explaining that Miss Spears was only attempting to determine what brand of underwear her fiance was wearing, and that in her innocence of male intimates, she did not realize that the tag generally goes in the back.\nLet me assure the gentle reader, there is indeed a point to this vaguely salacious pop cultural gossip.  For if a young woman cannot be controlled by her parents and those closest to her, even when her financial best interest manifestly depends on her accession to such control, no human can be reliably controlled by anyone, much less the decrees of a distant government.\nHumans cannot be controlled!\nNot in their best interest, not in their long-term interests, and certainly not in the interests of their self-anointed masters.  Not for long, anyhow.\nThis is the great tragedy of the Platonists.  Regardless of what current ideological excuse is currently justifying their mastery, the Platonist will always end up betraying it, as, in frustration, he turns lethal force on those he once thought only to guide and help.  For all the empty-eyed, gum-chewing, udder-engorged resemblance that the average teen mall rat bears to domesticated ungulates, she cannot be herded!  What God has given to even the least of those created in His image – free will – no mere mortal may hope to take away.",
  "tags": [],
  "categories": [],
  "sitemap_lastmod": "2004-07-18T12:09:00+00:00"
}