{
  "url": "https://voxday.net/2004/07/04/mailvox-false-slam-on-libertarians/",
  "scraped_at": "2025-12-19T20:34:35.668036",
  "title": "Mailvox: a false slam on libertarians",
  "date_display": "July 4, 2004",
  "date_iso": "2004-07-04T12:24:00+00:00",
  "date_from_url": "2004-07-04",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>tz wrote:<br/></p><blockquote><p> <br>To the point that when nuremburg.org was fined over 100 million dollars for drawing an X through a dead abortionist, the LP saw not threat to free speech, no problem with web censorship, no problem with thought crime, nor any problem with excessive fines.</br></p><p>and</p><p>I note no one has challenged me on their tacit acceptance of the nuremburg.org decision though it was a greater threat to liberty than their contemporary alarmist press releases about bills to curb kiddie porn that would likely not pass or die in committee. If some LP official can explain to me why they were swallowing this particular camel while straining at gnats (And I did write and ask at the time) I would reconsider my position.<br/></p></blockquote><p>I hadn’t bothered earlier since it was such an absurd point, but since you bring it up again, I will certainly challenge you on the Libertarian Party’s “tacit acceptance” of the Nuremberg Files case.  There was never any acceptance, tacit or otherwise, and you have presented absolutely no evidence to suggest there was.  First, several leading libertarians wrote critically of the Oregon court decision, both <a href=\"http://www.juliansanchez.com/nurem.html\">Julian Sanchez</a>, a regular Reason magazine contributor, and <a href=\"http://www.tysknews.com/Depts/Free_Speech/menacing_speech.htm\">Eugene Volokh</a>, the UCLA professor of law and lead blogger at <a href=\"http://volokh.com/\">the Volokh Conspiracy</a>.</p><p>Second, you’ll note that the alarmist press releases refer to legislative matters.  Political parties pay far more attention to prospective bills than they do to court cases, since they can influence the former but have no ability to influence the latter.  There are a plethora of important court cases, even at the Supreme Court level, on which the Libertarian Party has failed to issue a press release, many of which were far more well-known than Planned Parenthood’s civil suit, which in any case was not even directly relevant to the principle of government censorship of free speech.  Are you seriously going to attempt to argue that the LP tacitly accepts the verdicts in all of these other court cases too?  And has the Libertarian Party ever issued a press release on a civil damages suit?</p><p>Since you have presented no grounds for indicating that the Libertarian Party favored, supported or otherwise accepted the Oregon decision or its subsequent upholding on appeal, I suggest that you either find some evidence or reconsider your position.<br/></p></div>",
  "content_text": "tz wrote:\nTo the point that when nuremburg.org was fined over 100 million dollars for drawing an X through a dead abortionist, the LP saw not threat to free speech, no problem with web censorship, no problem with thought crime, nor any problem with excessive fines.\nand\nI note no one has challenged me on their tacit acceptance of the nuremburg.org decision though it was a greater threat to liberty than their contemporary alarmist press releases about bills to curb kiddie porn that would likely not pass or die in committee. If some LP official can explain to me why they were swallowing this particular camel while straining at gnats (And I did write and ask at the time) I would reconsider my position.\nI hadn’t bothered earlier since it was such an absurd point, but since you bring it up again, I will certainly challenge you on the Libertarian Party’s “tacit acceptance” of the Nuremberg Files case.  There was never any acceptance, tacit or otherwise, and you have presented absolutely no evidence to suggest there was.  First, several leading libertarians wrote critically of the Oregon court decision, both\nJulian Sanchez\n, a regular Reason magazine contributor, and\nEugene Volokh\n, the UCLA professor of law and lead blogger at\nthe Volokh Conspiracy\n.\nSecond, you’ll note that the alarmist press releases refer to legislative matters.  Political parties pay far more attention to prospective bills than they do to court cases, since they can influence the former but have no ability to influence the latter.  There are a plethora of important court cases, even at the Supreme Court level, on which the Libertarian Party has failed to issue a press release, many of which were far more well-known than Planned Parenthood’s civil suit, which in any case was not even directly relevant to the principle of government censorship of free speech.  Are you seriously going to attempt to argue that the LP tacitly accepts the verdicts in all of these other court cases too?  And has the Libertarian Party ever issued a press release on a civil damages suit?\nSince you have presented no grounds for indicating that the Libertarian Party favored, supported or otherwise accepted the Oregon decision or its subsequent upholding on appeal, I suggest that you either find some evidence or reconsider your position.",
  "tags": [],
  "categories": [],
  "sitemap_lastmod": "2004-07-04T11:24:00+00:00"
}