{
  "url": "https://voxday.net/2004/07/30/mailvox-why-lp-over-cp/",
  "scraped_at": "2025-12-19T20:38:46.869709",
  "title": "Mailvox: why LP over CP",
  "date_display": "July 30, 2004",
  "date_iso": "2004-07-30T18:14:00+00:00",
  "date_from_url": "2004-07-30",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>RK has a familiar question:<br/></p><blockquote><p> <br>It’s refreshing to hear a Christian Libertarian’s viewpoints.  I did not previously think the two could overlap quite so well.You have mentioned your disagreements with the Libertarian Party’s stance on abortion and immigration. In past articles and blogs, you mentioned the Constitution Party as another valid alternative to the Republ-ocrat hegemony.  My question is: Why have you chosen Libertarian over Constitution (Party)?  It seems to me that your social views align more closely with the Constitution Party’s.  I must disclose that I am a Constitution Party member, but have strong LP leanings. I made my decision to leave the Republican Party around the time I found your articles on WND.<br/></br></p></blockquote><p>While I respect both parties and enthusiastically endorse both over either of the ruling party’s factions, the Libertarian Party is far more to my liking despite its two major flaws.  While I disagree with the reasoning that led to anti-libertarian positions on abortion and immigration, I understand it and consider the positions to be both reasonable and honest, if mistaken.</p><p>The Constitution Party’s position on the War on Drugs, on the other hand, is not only wrong-headed, but completely contradictory to its theoretical <em>raison d’etre</em>.  This is the result of an ideological approach based on making a fetish of the Constitution as opposed to an intellectual approach based on limiting the depradations of government.  In the long term, I expect the Constitution Party will likely be more amenable to the same compromises and rationalizations that have made a mockery of republican ideals in the Republican Party.</p><p>Ideally, I’d like to see a compromise wherein the Libertarians would abjure abortion and the Constitution Party would abandon the War on Drugs and seek a stronger intellectual basis for its constitutionalism.<br/></p></div>",
  "content_text": "RK has a familiar question:\nIt’s refreshing to hear a Christian Libertarian’s viewpoints.  I did not previously think the two could overlap quite so well.You have mentioned your disagreements with the Libertarian Party’s stance on abortion and immigration. In past articles and blogs, you mentioned the Constitution Party as another valid alternative to the Republ-ocrat hegemony.  My question is: Why have you chosen Libertarian over Constitution (Party)?  It seems to me that your social views align more closely with the Constitution Party’s.  I must disclose that I am a Constitution Party member, but have strong LP leanings. I made my decision to leave the Republican Party around the time I found your articles on WND.\nWhile I respect both parties and enthusiastically endorse both over either of the ruling party’s factions, the Libertarian Party is far more to my liking despite its two major flaws.  While I disagree with the reasoning that led to anti-libertarian positions on abortion and immigration, I understand it and consider the positions to be both reasonable and honest, if mistaken.\nThe Constitution Party’s position on the War on Drugs, on the other hand, is not only wrong-headed, but completely contradictory to its theoretical\nraison d’etre\n.  This is the result of an ideological approach based on making a fetish of the Constitution as opposed to an intellectual approach based on limiting the depradations of government.  In the long term, I expect the Constitution Party will likely be more amenable to the same compromises and rationalizations that have made a mockery of republican ideals in the Republican Party.\nIdeally, I’d like to see a compromise wherein the Libertarians would abjure abortion and the Constitution Party would abandon the War on Drugs and seek a stronger intellectual basis for its constitutionalism.",
  "tags": [],
  "categories": [],
  "sitemap_lastmod": "2004-07-30T17:14:00+00:00"
}