{
  "url": "https://voxday.net/2004/07/14/mailvox-pin-tail-on-libertarian/",
  "scraped_at": "2025-12-19T20:36:08.842729",
  "title": "Mailvox: pin the tail on the Libertarian",
  "date_display": "July 14, 2004",
  "date_iso": "2004-07-14T16:51:00+00:00",
  "date_from_url": "2004-07-14",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>Jayuf asks:<br/></p><blockquote><p> <br>What do you believe is the one significant flaw with the LP platform? Is it their stance on abortion or their stance on immigration?</br></p><p>The LP position on immigration will keep me from voting for Badnarik. It does not seem rational in this day and age to grant amnesty to illegals who have originated from states supporting militant Islam.<br/></p></blockquote><p>Good question.  I’d actually been giving this matter a little thought of late, and I believe that it is the abortion plank that is the significant flaw.  (I should mention that amnesty is a position of the Bush administration, not the Libertarian Party, wherein there is no such thing as an “illegal” immigrant.)  Immigration is problematic, but very few people will refuse to vote Libertarian on the issue, as neither the Democrats nor the Republicans are the least bit interested in closing the border either.</p><p>The Libertarian Party’s position on abortion is <em>a priori</em> reasonable.  An individual has a property right to their own body, ergo, the government has no ability to violate that property right.  This was a logically sound conclusion in 1971, when it was first articulated.  The problem is that it is now scientifically outdated.  The unborn child is now proven to have different DNA, therefore, it is a distinct individual with its own property right to its own body as well as a concomitant right to life.  The fact that it cannot survive on its own is irrelevant; neither can a newborn and as birthing technology improves, even the mother is becoming increasingly unnecessary as a host.</p><p>For example, when a woman has her eggs fertilized in-vitro and implanted in another woman, does the surrogate mother have a right to abort the unborn child?  It’s her body, after all.  The fundamental wrongness of the property right claim to the unborn child becomes all the more obvious when one considers the question of an artificial machine womb.  If the child is no longer even in the woman’s body, how can she possibly claim the right to kill it without consequence?</p><p>More on this and immigration later.<br/></p></div>",
  "content_text": "Jayuf asks:\nWhat do you believe is the one significant flaw with the LP platform? Is it their stance on abortion or their stance on immigration?\nThe LP position on immigration will keep me from voting for Badnarik. It does not seem rational in this day and age to grant amnesty to illegals who have originated from states supporting militant Islam.\nGood question.  I’d actually been giving this matter a little thought of late, and I believe that it is the abortion plank that is the significant flaw.  (I should mention that amnesty is a position of the Bush administration, not the Libertarian Party, wherein there is no such thing as an “illegal” immigrant.)  Immigration is problematic, but very few people will refuse to vote Libertarian on the issue, as neither the Democrats nor the Republicans are the least bit interested in closing the border either.\nThe Libertarian Party’s position on abortion is\na priori\nreasonable.  An individual has a property right to their own body, ergo, the government has no ability to violate that property right.  This was a logically sound conclusion in 1971, when it was first articulated.  The problem is that it is now scientifically outdated.  The unborn child is now proven to have different DNA, therefore, it is a distinct individual with its own property right to its own body as well as a concomitant right to life.  The fact that it cannot survive on its own is irrelevant; neither can a newborn and as birthing technology improves, even the mother is becoming increasingly unnecessary as a host.\nFor example, when a woman has her eggs fertilized in-vitro and implanted in another woman, does the surrogate mother have a right to abort the unborn child?  It’s her body, after all.  The fundamental wrongness of the property right claim to the unborn child becomes all the more obvious when one considers the question of an artificial machine womb.  If the child is no longer even in the woman’s body, how can she possibly claim the right to kill it without consequence?\nMore on this and immigration later.",
  "tags": [],
  "categories": [],
  "sitemap_lastmod": "2004-07-14T15:51:00+00:00"
}