{
  "url": "https://voxday.net/2004/07/22/mailvox-spinning-science/",
  "scraped_at": "2025-12-19T20:37:39.356643",
  "title": "Mailvox: Spinning science",
  "date_display": "July 22, 2004",
  "date_iso": "2004-07-22T19:40:00+00:00",
  "date_from_url": "2004-07-22",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>Ellis writes:<br/></p><blockquote><p> <br>“Besides, the many worlds interpretation of quantum mechanics completely negates the Anthropic Principle and is currently more accepted by physicists than the Copenhagen Interpretation.”<br/></br></p></blockquote><p>Ah yes, those many worlds, for which there is absolutely no scientific evidence.  I love how “scientists” so quickly resort to fantasy in order to escape the logical conclusions of science.  Oh, but it’s more accepted by physicists, is it?  I always understood science to be driven by replicable experiments, not opinion polls.</p><p>The significant word, of course, is “currently”.  The same was true of the once-current state of archeology, which “proved” the Bible wasn’t true thanks to the historical absence of the Hittites and Assyrians – both peoples have since been found – and with the advent of <a href=\"http://www.evangelicaloutpost.com/archives/000766.html#more\">Intelligent Design</a> the secular faithful are now desperately cooking up untested theories, (otherwise known as hypotheses, first steps not to be confused with the whole of the method), which are then, ironically, blindly cited by the ignorant as proof of their non-belief.  When a physicist demonstrates the existence of another world and his demonstration is replicated by others, I’ll take these arguments seriously.  Otherwise, it’s not science, it’s just science fiction.</p><p>And here I thought it was the religious nuts who were supposed to be into baseless superstition.  As of today, there is more evidence for God than there is for “many worlds”.  And as for me, I wouldn’t be surprised to learn that both exist outside our space-time continuum.</p><p>Remember how “scientists” such as Freud once convinced several generations that religion was unhealthy?  Decades later, actual scientific studies demonstrated that quite the opposite was true.  Christianity has nothing to fear from science, only those addicted to their dogma need worry.  And that holds true for the atheist as well the Christian.<br/></p></div>",
  "content_text": "Ellis writes:\n“Besides, the many worlds interpretation of quantum mechanics completely negates the Anthropic Principle and is currently more accepted by physicists than the Copenhagen Interpretation.”\nAh yes, those many worlds, for which there is absolutely no scientific evidence.  I love how “scientists” so quickly resort to fantasy in order to escape the logical conclusions of science.  Oh, but it’s more accepted by physicists, is it?  I always understood science to be driven by replicable experiments, not opinion polls.\nThe significant word, of course, is “currently”.  The same was true of the once-current state of archeology, which “proved” the Bible wasn’t true thanks to the historical absence of the Hittites and Assyrians – both peoples have since been found – and with the advent of\nIntelligent Design\nthe secular faithful are now desperately cooking up untested theories, (otherwise known as hypotheses, first steps not to be confused with the whole of the method), which are then, ironically, blindly cited by the ignorant as proof of their non-belief.  When a physicist demonstrates the existence of another world and his demonstration is replicated by others, I’ll take these arguments seriously.  Otherwise, it’s not science, it’s just science fiction.\nAnd here I thought it was the religious nuts who were supposed to be into baseless superstition.  As of today, there is more evidence for God than there is for “many worlds”.  And as for me, I wouldn’t be surprised to learn that both exist outside our space-time continuum.\nRemember how “scientists” such as Freud once convinced several generations that religion was unhealthy?  Decades later, actual scientific studies demonstrated that quite the opposite was true.  Christianity has nothing to fear from science, only those addicted to their dogma need worry.  And that holds true for the atheist as well the Christian.",
  "tags": [],
  "categories": [],
  "sitemap_lastmod": "2004-07-22T18:40:00+00:00"
}