{
  "url": "https://voxday.net/2004/07/19/mailvox-rip-away/",
  "scraped_at": "2025-12-19T20:36:58.440895",
  "title": "Mailvox: Rip away",
  "date_display": "July 19, 2004",
  "date_iso": "2004-07-19T18:38:00+00:00",
  "date_from_url": "2004-07-19",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><blockquote><p> <br>I wonder if anyone will review one of VD’s novels. I’m not certain if that would qualify as brave, or foolish.<br/></br></p></blockquote><p>I daresay that I am probably more inclined to rip apart my novels than the average fiction reader here.  Some writers are very defensive; I seem to be of the sort that loathes their past work and sees only its shortcomings.  To be honest, I’m of the opinion that my fiction has, to date, fallen markedly short of what the average person here probably believes my potential to be.  It certainly hasn’t lived up to my expectations thus far.  I’m not being humble – perish the thought – that’s just a fact.  The vision is there, but the articulation is not.  Not yet, anyhow.</p><p>Still, the last book was not embarrassing and the one I just turned in may be a little better, (certainly it is stranger), but I’m starting to feel somewhat handicapped by my subject matter and my protagonists.  On the one hand, I want to cut loose and reveal the depth of my vision, on the other hand, the <em>tamest</em> of my books has already proven to be “too intense” [their words, not mine] for at least one Christian chain.</p><p>Also, I’m not a natural writer; I don’t have that gift for beautiful words that some writers have by instinct.  Fortunately, I have enough firepower to fake it, to an extent, but compared to the real thing it always falls pathetically short.  In summary, I’m a Salieri who must envy the Mozarts and trod along the pedestrian paths as they effortlessly soar the heights.  Bastards.</p><p>My hope, and I’m perfectly aware that I may be kidding myself, is that I have sufficient upstairs wattage to create something great by sheer force, in which case it is only a matter of discipline which has hitherto been lacking.  But as I am told my books continue to improve – at least I know I’m no Johnny One-book, <em>or perhaps I should say, Jay</em>, I remain optimistic.<br/></p></div>",
  "content_text": "I wonder if anyone will review one of VD’s novels. I’m not certain if that would qualify as brave, or foolish.\nI daresay that I am probably more inclined to rip apart my novels than the average fiction reader here.  Some writers are very defensive; I seem to be of the sort that loathes their past work and sees only its shortcomings.  To be honest, I’m of the opinion that my fiction has, to date, fallen markedly short of what the average person here probably believes my potential to be.  It certainly hasn’t lived up to my expectations thus far.  I’m not being humble – perish the thought – that’s just a fact.  The vision is there, but the articulation is not.  Not yet, anyhow.\nStill, the last book was not embarrassing and the one I just turned in may be a little better, (certainly it is stranger), but I’m starting to feel somewhat handicapped by my subject matter and my protagonists.  On the one hand, I want to cut loose and reveal the depth of my vision, on the other hand, the\ntamest\nof my books has already proven to be “too intense” [their words, not mine] for at least one Christian chain.\nAlso, I’m not a natural writer; I don’t have that gift for beautiful words that some writers have by instinct.  Fortunately, I have enough firepower to fake it, to an extent, but compared to the real thing it always falls pathetically short.  In summary, I’m a Salieri who must envy the Mozarts and trod along the pedestrian paths as they effortlessly soar the heights.  Bastards.\nMy hope, and I’m perfectly aware that I may be kidding myself, is that I have sufficient upstairs wattage to create something great by sheer force, in which case it is only a matter of discipline which has hitherto been lacking.  But as I am told my books continue to improve – at least I know I’m no Johnny One-book,\nor perhaps I should say, Jay\n, I remain optimistic.",
  "tags": [],
  "categories": [],
  "sitemap_lastmod": "2004-07-19T17:38:00+00:00"
}