{
  "url": "https://voxday.net/2004/07/17/mailvox-in-defense-of-tribunals/",
  "scraped_at": "2025-12-19T20:36:32.647148",
  "title": "Mailvox: in defense of tribunals",
  "date_display": "July 17, 2004",
  "date_iso": "2004-07-17T08:06:00+00:00",
  "date_from_url": "2004-07-17",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>Bill defends the President:<br/></p><blockquote><p> <br> Vox, the military tribunal thing was and is tricky. The people we’re holding are not prisoners of war (no uniform, no command structure, and they target civilians) so according to the Geneva convention (which they didn’t sign) we could just shoot them after a proper military trial. However, Bush and co. realized that this would be a PR nightmare.</br></p><p> And after the Lynn Stewart incident (the mother of the Patriot Act), we realize we couldn’t give them a regular trial either.  So they came up with the military tribunal thing. What other option did Bush have, turn them over to the Syrians for a trial? This is pretty far outside regular jurisprudence.  Clintoons infamous Executive Orders were obviously self-serving, it wasn’t like he was simply trying to solve a problem and protect America’s interests.<br/></p></blockquote><p> This defense is illustrative.  Bill suggests that the administration had two legal choices.  Shoot them or turn them over to someone else.  First, handing them over to a third party can’t be equated to releasing them, as implied here. Neither the Northern Alliance nor the Iraqi allies are <a href=\"http://www.smh.com.au/text/articles/2004/07/16/1089694568757.html\">reported to be squeamish</a> about rough justice for their enemies.</p><p> Second, even this defense demonsrates that the president is more concerned about PR than he is about the law.  So, his advisors cook up a stupid and legally questionable scheme, then try to defend it as if their motives are not tawdry politics, but a matter of national defense.  Of course, if it was that serious, they’d have been executed in accordance with the Geneva Convention already; the real problem is that it’s difficult to take prisoners once no quarter has been declared.  And, it threatens to turn into a PR disaster anyhow.  You would think that some day, the Republicans will learn that since the press is not on their side anyhow, they might as well do the right thing and get roasted for it instead of doing the wrong and more dangeous thing and getting roasted for that.</p><p> Although others may have done so, I have never stated that Bush is worse than Clinton in his repeated attempts to abuse the legal system, only that his actions are opening the door for the next Clinton to be worse.  Bill sounds like a typical leftist here, arguing that it is the intentions behind the attempted abuse that are relevant, whereas it is truly only the precedents being set that matter.  The ignoble nature of the present administration was clear in its use of Guantanamo Bay, which, like <a href=\"http://archive.aclu.org/echelonwatch/faq.html\">Echelon</a>, is a shining example of how the Federal government always attempts to circumvent the laws designed expressly to hobble the exercise of its power.</p><p> Republican defenders of the president will no doubt continue to excuse his every action, however indefensible, under the guise of “we are at war”.  This is nothing new, it has been done on behalf of every wartime administration of either party.  But I will have little sympathy when those same Republicans shriek in outrage when the next Democratic president abuses these new techniques for circumventing the limits on executive branch power, conveniently forgetting their own role in creating the monster.</p></div>",
  "content_text": "Bill defends the President:\nVox, the military tribunal thing was and is tricky. The people we’re holding are not prisoners of war (no uniform, no command structure, and they target civilians) so according to the Geneva convention (which they didn’t sign) we could just shoot them after a proper military trial. However, Bush and co. realized that this would be a PR nightmare.\nAnd after the Lynn Stewart incident (the mother of the Patriot Act), we realize we couldn’t give them a regular trial either.  So they came up with the military tribunal thing. What other option did Bush have, turn them over to the Syrians for a trial? This is pretty far outside regular jurisprudence.  Clintoons infamous Executive Orders were obviously self-serving, it wasn’t like he was simply trying to solve a problem and protect America’s interests.\nThis defense is illustrative.  Bill suggests that the administration had two legal choices.  Shoot them or turn them over to someone else.  First, handing them over to a third party can’t be equated to releasing them, as implied here. Neither the Northern Alliance nor the Iraqi allies are\nreported to be squeamish\nabout rough justice for their enemies.\nSecond, even this defense demonsrates that the president is more concerned about PR than he is about the law.  So, his advisors cook up a stupid and legally questionable scheme, then try to defend it as if their motives are not tawdry politics, but a matter of national defense.  Of course, if it was that serious, they’d have been executed in accordance with the Geneva Convention already; the real problem is that it’s difficult to take prisoners once no quarter has been declared.  And, it threatens to turn into a PR disaster anyhow.  You would think that some day, the Republicans will learn that since the press is not on their side anyhow, they might as well do the right thing and get roasted for it instead of doing the wrong and more dangeous thing and getting roasted for that.\nAlthough others may have done so, I have never stated that Bush is worse than Clinton in his repeated attempts to abuse the legal system, only that his actions are opening the door for the next Clinton to be worse.  Bill sounds like a typical leftist here, arguing that it is the intentions behind the attempted abuse that are relevant, whereas it is truly only the precedents being set that matter.  The ignoble nature of the present administration was clear in its use of Guantanamo Bay, which, like\nEchelon\n, is a shining example of how the Federal government always attempts to circumvent the laws designed expressly to hobble the exercise of its power.\nRepublican defenders of the president will no doubt continue to excuse his every action, however indefensible, under the guise of “we are at war”.  This is nothing new, it has been done on behalf of every wartime administration of either party.  But I will have little sympathy when those same Republicans shriek in outrage when the next Democratic president abuses these new techniques for circumventing the limits on executive branch power, conveniently forgetting their own role in creating the monster.",
  "tags": [],
  "categories": [],
  "sitemap_lastmod": "2004-07-17T07:06:00+00:00"
}