{
  "url": "https://voxday.net/2004/07/07/my-favorite-gay-columnis/",
  "scraped_at": "2025-12-19T20:35:03.986380",
  "title": "My favorite gay columnist",
  "date_display": "July 7, 2004",
  "date_iso": "2004-07-07T21:58:00+00:00",
  "date_from_url": "2004-07-07",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>As you may know, I can’t stand Andrew Sullivan.  But while he doesn’t know jack about anything outside matters homosexual and political intrigue, I do like Michelangelo Signorile’s fearless approach to writing.  Sen. Barbara Mikulski is <a href=\"http://www.nypress.com/17/27/news&amp;columns/MichelangeloSignorile.cfm\">the first to be outed</a> in the approach to the Defense of Marriage Amendment showdown; it will be interesting to see how many others are booted out of the closet.<br/></p><blockquote><p> <br>As the July 12 date nears for a vote on the federal marriage amendment, an outing panic has gripped Washington’s political and media circles. Some gay activists have vowed to expose those closeted members of Congress who are supporting the amendment, as well as the closeted gay staffers of any member backing it. And it’s not only right-wing Republicans who should be on notice. After initially indicating that she would vote against the constitutional amendment that would make gays and lesbians into second-class citizens, Sen. Barbara Mikulski’s opposition to the amendment appears to have gone into the closet: Now that a vote is near, the Maryland Democrat—who is up for reelection in November—is suddenly not returning reporters’ phone calls seeking her intentions on the vote, nor is she issuing any statements on the matter.</br></p><p>Mikulski’s position on same-sex marriage isn’t the only thing in her closet: The sexual orientation of the forever-unmarried 67-year-old has been an open secret for many years. But Mikulski has apparently always worried about what her working-class Democratic base in Maryland might think of her sexual orientation, making her irrationally petrified of ever discussing it (except to make heterosexual allusions)<br/></p></blockquote><p></p></div>",
  "content_text": "As you may know, I can’t stand Andrew Sullivan.  But while he doesn’t know jack about anything outside matters homosexual and political intrigue, I do like Michelangelo Signorile’s fearless approach to writing.  Sen. Barbara Mikulski is\nthe first to be outed\nin the approach to the Defense of Marriage Amendment showdown; it will be interesting to see how many others are booted out of the closet.\nAs the July 12 date nears for a vote on the federal marriage amendment, an outing panic has gripped Washington’s political and media circles. Some gay activists have vowed to expose those closeted members of Congress who are supporting the amendment, as well as the closeted gay staffers of any member backing it. And it’s not only right-wing Republicans who should be on notice. After initially indicating that she would vote against the constitutional amendment that would make gays and lesbians into second-class citizens, Sen. Barbara Mikulski’s opposition to the amendment appears to have gone into the closet: Now that a vote is near, the Maryland Democrat—who is up for reelection in November—is suddenly not returning reporters’ phone calls seeking her intentions on the vote, nor is she issuing any statements on the matter.\nMikulski’s position on same-sex marriage isn’t the only thing in her closet: The sexual orientation of the forever-unmarried 67-year-old has been an open secret for many years. But Mikulski has apparently always worried about what her working-class Democratic base in Maryland might think of her sexual orientation, making her irrationally petrified of ever discussing it (except to make heterosexual allusions)",
  "tags": [],
  "categories": [],
  "sitemap_lastmod": "2004-07-07T20:58:00+00:00"
}