{
  "url": "https://voxday.net/2004/07/27/no-tears-for-ann/",
  "scraped_at": "2025-12-19T20:38:17.829957",
  "title": "No tears for Ann",
  "date_display": "July 27, 2004",
  "date_iso": "2004-07-27T14:11:00+00:00",
  "date_from_url": "2004-07-27",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>Some folks are attempting to summon outrage for Ann Coulter’s unceremonious dumping by USA Today.  I don’t see why, as our beloved Miss Coulter did take the opportunity to leap straight over the top in a rather unlikely forum.  Sure, <a href=\"http://www.humaneventsonline.com/article.php?print=yes&amp;id=4610\">the comments by the USA Today editor</a> were stupid – one hopes he was being disingenuous – but USA Today is for people who want happy silly news in info-nuggets, not snarling contempt, however deserved.</p><p>Jonah Goldberg, who is a little more ideologically squishy than Ann and has that safe hail-fellow-well-met sense of humor ala Tucker Carlson that allows liberals to pretend that maybe he’s just kidding about all that conservative nonsense, would have been a better choice from the start.  The mainstream media tilts heavily left, and the sooner one stops expecting it to be even-keeled, the better.  Ann is wonderful, but she is for the red-meat lovers, not vegetarians who might nibble at a little piece of tofu.</p><p>There’s a place for running roughshod over left-liberal idiocies, but one of the foremost left-liberal newspapers probably isn’t one of them.  And besides, who on Earth would want to go to the Democratic Convention anyhow?<br/></p></div>",
  "content_text": "Some folks are attempting to summon outrage for Ann Coulter’s unceremonious dumping by USA Today.  I don’t see why, as our beloved Miss Coulter did take the opportunity to leap straight over the top in a rather unlikely forum.  Sure,\nthe comments by the USA Today editor\nwere stupid – one hopes he was being disingenuous – but USA Today is for people who want happy silly news in info-nuggets, not snarling contempt, however deserved.\nJonah Goldberg, who is a little more ideologically squishy than Ann and has that safe hail-fellow-well-met sense of humor ala Tucker Carlson that allows liberals to pretend that maybe he’s just kidding about all that conservative nonsense, would have been a better choice from the start.  The mainstream media tilts heavily left, and the sooner one stops expecting it to be even-keeled, the better.  Ann is wonderful, but she is for the red-meat lovers, not vegetarians who might nibble at a little piece of tofu.\nThere’s a place for running roughshod over left-liberal idiocies, but one of the foremost left-liberal newspapers probably isn’t one of them.  And besides, who on Earth would want to go to the Democratic Convention anyhow?",
  "tags": [],
  "categories": [],
  "sitemap_lastmod": "2004-07-27T13:11:00+00:00"
}