{
  "url": "https://voxday.net/2004/07/07/occams-razor/",
  "scraped_at": "2025-12-19T20:35:02.096689",
  "title": "Occam’s Razor",
  "date_display": "July 7, 2004",
  "date_iso": "2004-07-07T13:28:00+00:00",
  "date_from_url": "2004-07-07",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><blockquote><p> <br><a href=\"http://www.nationalreview.com/kob/obeirne200407070839.asp\">The lineup of primetime speakers</a> at the Republican Convention predictably reflects its New York location by giving prominent spots to the hosts, Mayor Michael Bloomberg and Governor George Pataki. But those enjoying the coveted spotlight also pay tribute to New York’s former Governor Nelson Rockefeller. Joining the hosts will be other mavericks and dissidents who represent a minority in Ronald Reagan’s GOP. Former New York City Mayor Rudy Giuliani, Arizona’s Senator John McCain, and California’s Governor Arnold Schwarzenegger will all be at the primetime podium. The only announced speaker who actually agrees with President Bush on major issues is Democratic Senator Zell Miller of Georigia.</br></p><p>The decision to showcase rogue elephants as representatives of the modern Republican party is not the mark of a self-confident party establishment. If the lineup is intended to make an overwhelmingly conservative party attractive to swing voters, it does so by pretending to be something it’s not. The Republican party seems to habitually internalize the criticisms of its opponents. When the only Reagan Republican to enjoy a prominent supporting role at the party’s convention is a Democrat, the GOP has a serious identity problem. The Kerry-Edwards ticket is liberal. The Boston convention will not be featuring Louisiana senator John Breaux in an attempt to pretend otherwise.<br/></p></blockquote><p>Or perhaps they’re not so roguish after all.  Perhaps the party is electing to present itself as it truly is, the faction of strong interventionist government with a corporatist, nationalist edge.  I do not agree with those who constantly find innocence in incompetence and apparent stupidity.  Perhaps I’ve spent too much time around Italians, who are <em>molto furbo</em> in using one’s assumption of their incompetence in order to get away with doing exactly as they please.<br/></p></div>",
  "content_text": "The lineup of primetime speakers\nat the Republican Convention predictably reflects its New York location by giving prominent spots to the hosts, Mayor Michael Bloomberg and Governor George Pataki. But those enjoying the coveted spotlight also pay tribute to New York’s former Governor Nelson Rockefeller. Joining the hosts will be other mavericks and dissidents who represent a minority in Ronald Reagan’s GOP. Former New York City Mayor Rudy Giuliani, Arizona’s Senator John McCain, and California’s Governor Arnold Schwarzenegger will all be at the primetime podium. The only announced speaker who actually agrees with President Bush on major issues is Democratic Senator Zell Miller of Georigia.\nThe decision to showcase rogue elephants as representatives of the modern Republican party is not the mark of a self-confident party establishment. If the lineup is intended to make an overwhelmingly conservative party attractive to swing voters, it does so by pretending to be something it’s not. The Republican party seems to habitually internalize the criticisms of its opponents. When the only Reagan Republican to enjoy a prominent supporting role at the party’s convention is a Democrat, the GOP has a serious identity problem. The Kerry-Edwards ticket is liberal. The Boston convention will not be featuring Louisiana senator John Breaux in an attempt to pretend otherwise.\nOr perhaps they’re not so roguish after all.  Perhaps the party is electing to present itself as it truly is, the faction of strong interventionist government with a corporatist, nationalist edge.  I do not agree with those who constantly find innocence in incompetence and apparent stupidity.  Perhaps I’ve spent too much time around Italians, who are\nmolto furbo\nin using one’s assumption of their incompetence in order to get away with doing exactly as they please.",
  "tags": [],
  "categories": [],
  "sitemap_lastmod": "2004-07-07T12:28:00+00:00"
}