{
  "url": "https://voxday.net/2004/07/28/on-books/",
  "scraped_at": "2025-12-19T20:38:32.803945",
  "title": "On books",
  "date_display": "July 28, 2004",
  "date_iso": "2004-07-28T19:47:00+00:00",
  "date_from_url": "2004-07-28",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>I don’t usually make this sort of email public, but I’m doing so for three reasons.  First, MM is a semi-regular here, so I thought some of the regulars might be interested in his opinion and the topic wasn’t likely to come up for comments since I don’t often post on it.  Second, he’s not a Christian, and I am always interested in learning how non-Christians view the books.  And third, I’m ordering the books this week, so if you’d like to place an order with Digital Cowboy, please feel free to wander over to <a href=\"http://www.voxday.net\">voxday.net</a> and do so.<br/></p><blockquote><p> <br>I post semi-regularly on your blog.  But I just got done reading “The War In Heaven” and I want to congratulate and thank you for writing it.  I’m unsaved, but it touched me.  I like the warrior aspect of Jesus quite a bit.  Your portrayal reminded me of (I think) Jefferson’s quote “I tremble when I think the Lord is just.” Christopher came off as quite the bastard.  I’m looking forward to seeing how you deal with him in the later books….</br></p><p>I also think it’s a shame that your book was put only in the Christian section.  I love the integration of fantasy into a Christian novel and think it should be done more often.  I haven’t read any other Christian fiction, but I’m put off from reading it as I’m worried it may be too preachy and clean to be entertaining.  Like you said elsewhere, the events don’t have to be lily-white to be a Christian work, just written from the viewpoint that Christ is real and should be portrayed as the Savior.  I think Hollywood should exploit this.  They could do some great things with a screenwriter working with a POV similar to yours.  But I won’t hold my breath.</p><p>I will certainly recommend this novel to anyone that will listen and I wish you great success with the third installment.<br/></p></blockquote><p>I’ll be interested to see how the third one does too.  It’s definitely not like any other book of its type.<br/></p></div>",
  "content_text": "I don’t usually make this sort of email public, but I’m doing so for three reasons.  First, MM is a semi-regular here, so I thought some of the regulars might be interested in his opinion and the topic wasn’t likely to come up for comments since I don’t often post on it.  Second, he’s not a Christian, and I am always interested in learning how non-Christians view the books.  And third, I’m ordering the books this week, so if you’d like to place an order with Digital Cowboy, please feel free to wander over to\nvoxday.net\nand do so.\nI post semi-regularly on your blog.  But I just got done reading “The War In Heaven” and I want to congratulate and thank you for writing it.  I’m unsaved, but it touched me.  I like the warrior aspect of Jesus quite a bit.  Your portrayal reminded me of (I think) Jefferson’s quote “I tremble when I think the Lord is just.” Christopher came off as quite the bastard.  I’m looking forward to seeing how you deal with him in the later books….\nI also think it’s a shame that your book was put only in the Christian section.  I love the integration of fantasy into a Christian novel and think it should be done more often.  I haven’t read any other Christian fiction, but I’m put off from reading it as I’m worried it may be too preachy and clean to be entertaining.  Like you said elsewhere, the events don’t have to be lily-white to be a Christian work, just written from the viewpoint that Christ is real and should be portrayed as the Savior.  I think Hollywood should exploit this.  They could do some great things with a screenwriter working with a POV similar to yours.  But I won’t hold my breath.\nI will certainly recommend this novel to anyone that will listen and I wish you great success with the third installment.\nI’ll be interested to see how the third one does too.  It’s definitely not like any other book of its type.",
  "tags": [],
  "categories": [],
  "sitemap_lastmod": "2004-07-28T18:47:00+00:00"
}