{
  "url": "https://voxday.net/2004/07/10/review-atrocity-archives/",
  "scraped_at": "2025-12-19T20:35:26.276309",
  "title": "Review: The Atrocity Archives",
  "date_display": "July 10, 2004",
  "date_iso": "2004-07-10T15:50:00+00:00",
  "date_from_url": "2004-07-10",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p><b>The Atrocity Archives<br> <br>Charles Stross<br> <br><a href=\"http://www.goldengryphon.com/\">Golden Gryphon Press</a></br></br></br></br></b></p><p>Rating: 8 of 10</p><p>There are those books where the cleverness of the author is irksome, where one cannot escape the vague impression that the reader is expected to stop and applaud the literary gymnastics at the end of every chapter.  In <em>The Atrocity Archives</em>, Charles Stross does not engage in pyrotechnic wordsmithery, but his cleverness is unmistakable.</p><p>Stross, (we dearly hope), has conjured up The Laundry from the bowels of his imagination, an esoteric department devoted to cleaning up those nasty messes that result when dimensions collide.  The occultic Laundry is one part NSA, one part MI5 and two parts bureaucratic nightmare, as even the most awe-inspiring eldritch horrors are somehow reduced to matters of paperwork and departmental infighting.  It is as if 007 was fired for sexual harassment and replaced by 013, a Dilbert in uneasy possession of Lord Voldemort’s powers.  The complex synthesis is a most unlikely one, and yet Stross pulls it off with effortless expertise.</p><p>A longtime technology columnist for Computer Shopper, Stross presents a world in which modern science and mathematical theory have been used to harness occult power from… elsewhere.  The Cold War, it seems, was even more grim and cold than anyone imagined, as the arms race involved far more than the comparatively prosaic threat of nuclear weapons.  An insignificant pawn for a minor player in the Great Game, Bob Howard has recently traded the boredom of a desk job for what he hopes will prove a more exciting position in the field.  But in this environment, one can never tell when things squamous and rugose will unexpectedly liven up a tedious day at the office with a moment of sheer horror.</p><p><b>Story:</b> 4 of 5.  Surely one of the strangest thrillers ever written, the fantastic and science fiction elements only add to the tension.  Yes, there are girls that must be rescued and worlds that must be saved, but the unique nature of the threats involved, both wordly and otherwordly, keep the pages ever-turning.  There are actually several stories contained within one meta-story, as a related novella, <em>The Concrete Jungle</em>, follows the Archives proper.</p><p><b>Style:</b> 4 of 5.  The text is gripping and entertaining throughout, as the juxtaposition of everyman’s office life with the omnipresent possibility of sudden and horrible death is quite amusing.  Stross uses his jargon judiciously, piling it on for maximum effect at times, but never allowing it to slow the story down.  Like Umberto Eco and Dan Brown, he manages the neat trick of making the reader feel smarter for having immersed himself in his book.</p><p><b>Characters:</b> 3 of 5.  Stross’s Howard – an homage to a genre legend – is an amusing protagonist.  He is not at all the cliched reluctant hero, but his self-deprecating nature makes his occasional self-doubt all the more real.  Stross, for all that he is manifestly an vision writer, still manages to draw his characters with precision and more than a little wry humor.</p><p><b>Creativity:</b> 4.5 of 5.  Yes, this is a synthetic creation.  His influences – Lovecraft, Stephenson, Fleming, Adams – are obvious, and yet the wizard’s melting pot prduces something new, different and even stylish in a technocratic manner.  Stross is perhaps the best “new” writer the science fiction genre has produced since Neal Stephenson; he is certainly the most interesting.</p><p><b>Text Sample:</b><br/></p><blockquote><p> <br>The fact of the matter is that most traditional magic doesn’t work.  In fact, it would all be irrelevant, were it not for the Turing theorem – named after Alan Turing, who you’ll have heard of if you know anything about computers.</br></p><p>That kind of magic works.  Unfortunately….</p><p>The theorem is a hack on discrete number theory that simultaneously disproves the Church-Turing hypothesis (wave if you understand that) and worse, permits NP-complete problems to be converted into P-complete ones.  This has several consequences, starting with screwing over most cryptography algorithms – translation: <em>all your bank account are belong to us</em> – and ending with the ability to computationally generate a Dho-Nha geometry curve in real time.</p><p>This latter item is just slightly less dangerous than allowing nerds with laptops to wave a magic wand and turn them into hydrogen bombs at will.  Because, you see, everything you know about the way this universe works is correct – except for the little problem that this isn’t the only universe we have to worry about.  Information can leak between one universe and another.  And in a vanishingly small number of the other universes there are things that listen, and talk back – see Al-Hazred, Nietszche, Lovecraft, Poe, etcetera.  The many-angled ones, as they say, live at the bottom of the Mandlebrot mathematics, except when a suitable incantation in the platonic realm of mathematics – computerised or otherwise – draws them forth.</p><p>(And you thought running that fractal screensaver was good for your computer?)<br/></p></blockquote><p></p></div>",
  "content_text": "The Atrocity Archives\nCharles Stross\nGolden Gryphon Press\nRating:\n8 of 10\nThere are those books where the cleverness of the author is irksome, where one cannot escape the vague impression that the reader is expected to stop and applaud the literary gymnastics at the end of every chapter.  In\nThe Atrocity Archives\n, Charles Stross does not engage in pyrotechnic wordsmithery, but his cleverness is unmistakable.\nStross, (we dearly hope), has conjured up The Laundry from the bowels of his imagination, an esoteric department devoted to cleaning up those nasty messes that result when dimensions collide.  The occultic Laundry is one part NSA, one part MI5 and two parts bureaucratic nightmare, as even the most awe-inspiring eldritch horrors are somehow reduced to matters of paperwork and departmental infighting.  It is as if 007 was fired for sexual harassment and replaced by 013, a Dilbert in uneasy possession of Lord Voldemort’s powers.  The complex synthesis is a most unlikely one, and yet Stross pulls it off with effortless expertise.\nA longtime technology columnist for Computer Shopper, Stross presents a world in which modern science and mathematical theory have been used to harness occult power from… elsewhere.  The Cold War, it seems, was even more grim and cold than anyone imagined, as the arms race involved far more than the comparatively prosaic threat of nuclear weapons.  An insignificant pawn for a minor player in the Great Game, Bob Howard has recently traded the boredom of a desk job for what he hopes will prove a more exciting position in the field.  But in this environment, one can never tell when things squamous and rugose will unexpectedly liven up a tedious day at the office with a moment of sheer horror.\nStory:\n4 of 5.  Surely one of the strangest thrillers ever written, the fantastic and science fiction elements only add to the tension.  Yes, there are girls that must be rescued and worlds that must be saved, but the unique nature of the threats involved, both wordly and otherwordly, keep the pages ever-turning.  There are actually several stories contained within one meta-story, as a related novella,\nThe Concrete Jungle\n, follows the Archives proper.\nStyle:\n4 of 5.  The text is gripping and entertaining throughout, as the juxtaposition of everyman’s office life with the omnipresent possibility of sudden and horrible death is quite amusing.  Stross uses his jargon judiciously, piling it on for maximum effect at times, but never allowing it to slow the story down.  Like Umberto Eco and Dan Brown, he manages the neat trick of making the reader feel smarter for having immersed himself in his book.\nCharacters:\n3 of 5.  Stross’s Howard – an homage to a genre legend – is an amusing protagonist.  He is not at all the cliched reluctant hero, but his self-deprecating nature makes his occasional self-doubt all the more real.  Stross, for all that he is manifestly an vision writer, still manages to draw his characters with precision and more than a little wry humor.\nCreativity:\n4.5 of 5.  Yes, this is a synthetic creation.  His influences – Lovecraft, Stephenson, Fleming, Adams – are obvious, and yet the wizard’s melting pot prduces something new, different and even stylish in a technocratic manner.  Stross is perhaps the best “new” writer the science fiction genre has produced since Neal Stephenson; he is certainly the most interesting.\nText Sample:\nThe fact of the matter is that most traditional magic doesn’t work.  In fact, it would all be irrelevant, were it not for the Turing theorem – named after Alan Turing, who you’ll have heard of if you know anything about computers.\nThat kind of magic works.  Unfortunately….\nThe theorem is a hack on discrete number theory that simultaneously disproves the Church-Turing hypothesis (wave if you understand that) and worse, permits NP-complete problems to be converted into P-complete ones.  This has several consequences, starting with screwing over most cryptography algorithms – translation:\nall your bank account are belong to us\n– and ending with the ability to computationally generate a Dho-Nha geometry curve in real time.\nThis latter item is just slightly less dangerous than allowing nerds with laptops to wave a magic wand and turn them into hydrogen bombs at will.  Because, you see, everything you know about the way this universe works is correct – except for the little problem that this isn’t the only universe we have to worry about.  Information can leak between one universe and another.  And in a vanishingly small number of the other universes there are things that listen, and talk back – see Al-Hazred, Nietszche, Lovecraft, Poe, etcetera.  The many-angled ones, as they say, live at the bottom of the Mandlebrot mathematics, except when a suitable incantation in the platonic realm of mathematics – computerised or otherwise – draws them forth.\n(And you thought running that fractal screensaver was good for your computer?)",
  "tags": [],
  "categories": [],
  "sitemap_lastmod": "2004-07-10T14:50:00+00:00"
}