{
  "url": "https://voxday.net/2004/07/31/review-calculating-god/",
  "scraped_at": "2025-12-19T20:38:52.371709",
  "title": "Review: Calculating God",
  "date_display": "July 31, 2004",
  "date_iso": "2004-07-31T13:23:00+00:00",
  "date_from_url": "2004-07-31",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>I thought this review was particularly timely, coming as it does on top of the WND article discussing the intriguing possibility that <a href=\"http://www.worldnetdaily.com/news/article.asp?ARTICLE_ID=39733\">the speed of light is declining</a> and the recent discussion here on the Anthropic Principle, (which, as always, devolved into a discussion of evolution).  Then, too, the gratuitous slams on Canada bear mention.  Dave’s review strikes me as overgenerous on the points considering his description, as the characterizations sounded a lot more like a 2/5 instead of 4/5, but then, I haven’t read the book.</p><p>Keep in mind that it is better if one does not describe the plot in a review.  This review structure provides adequate information for someone to determine if they’re interested in the book or not without being walked through the events of the story.  I’m interested in reviews, not synopses.  There is a difference.</p><p><b>Calculating God<br> <br>Robert J. Sawyer<br> <br>Rating: 8.5 of 10<br> <br>Review by:</br></br></br></br></br></br></b> Dave Munger</p><p>The theological science fiction novel “Calculating God” could easily get lost in the recent bumper crop of grandiose eschatological epics with authors who have been compared to Arthur C. Clarke and protagonists dying of cancer. You know, that whole Greggory Benford, Steven Baxter sub-genre that one now finds filling the SF book racks in grocery stores, between authorized biographies of Chewbacca and “The Eco-Feminist Elves Of Shanana”. This would be a shame, since Robert J. Sawyer has written a book much more worthy of your time than most SF available at grocery stores (that’s where I bought it).</p><p>“Calculating God” has much to recommend it. I was personally charmed by an extraterrestrial character with religious views superficially similar to my own (God created the universe and life; People do not have immortal souls).  This alien, named Hollus, speaks something like the magnificent Dr. Hugh Ross, although the Bible is not taken at all seriously by anyone in this book. There are enough pop-culture references to thoroughly satisfy whatever perverse appetite it is that makes people find this enjoyable, without being gratuitous or grating. Each belongs where it is placed, and furthers the story. Although the phrase “a novel of ideas” is quickly becoming the SF version of the cinematic designation “psychological thriller”, here it is quite fitting.</p><p>There are problems though, oh are there problems. For one thing, “Calculating God” is unremittingly Canadian throughout, which lends a slightly queasy “For Better or Worse” quality to the whole, and leads to several particularly sickening scenes. The stomach-churningly Episcopalian ethics of our chicken-boiling brethren are trotted out once in awhile and called “morality” (I’m not accusing Canadians of being Episcopalian, it’s just that they both sicken me similarly). The hero’s physician is incredibly smug about the cheap drugs Canadians have access to as a result of attaching their system lamprey-like to ours and letting our terrible Capitalistic health-care machine absorb all the R&amp;D costs.</p><p>The worst flaw in the novel (if one does not consider the title and premise to be heinous blasphemies, that is), is a crappy, bigoted, unnecessary subplot. Ironically, it is the utter irrelevance of this part of the book that keeps it from ruining the whole. It is as if the main body of the story is an entirely separate book, like a beautiful young woman shacked up with a toothless, misogynistic, ass-fiend. You could edit it out yourself with a black magic marker, and significantly improve the storyline.</p><p>“Calculating God” has something in it for anyone who enjoyed “A Brief History Of Time” or any science fiction stories. In a period and a field in which Ambrose Bierce’s definition of a novel as a short story padded seems particularly apropos, Sawyer has written a novel that could only have been presented in this form. You are expected to purchase it, read it, and discuss it amongst yourselves.</p><p><b>Story:</b> 3.5 of 5. The rating in this category would be much closer to five if it weren’t for The Bad Part. The protagonist does make a fairly wild surmise about the nature of life in the universe, which turns out, incredibly, to be right. It’s quickly accepted as fact, without even being modified. This is probably necessary though, as the novel could have otherwise gone off on an overly realistic tangent, like the first five or so chapters of any novel written by an astronomer, and ended up a third longer. The story really delivers though, especially after the cardboard villains die, and all life in this part of the galaxy is nearly wiped out.</p><p><b>Style:</b> 4.5 of 5. Oddly realistic. Interstellar travel is subject to the constraints of General Relativity, and no laws of physics are bent beyond credulity. The fifth force introduced by the Forhilnors sounds a lot like Einstein’s cosmological constant, or for that matter, something I saw seriously postulated in a popular science magazine other than Popular Science a few months ago. This reader does not know his multiplication tables, and at no place did the science loose me. A much quicker read that the subject matter would seem to indicate.</p><p><b>Characters:</b> 4 of 5. If you like Spock you will like Hollus. If you do not like Spock, you are probably  way too picky about characterization of extraterrestrials. If you like any other Star Trek characters, you are obligated to like all fictional characters, period. If you can stand Canadians, you will be able to stand Tom Jericho. There is some question in my mind as to whether or not the most poorly written characters should even count, as they are confined to the part of the book that I have wished into the cornfield. Other than them, there was no one in this book that I wanted to see killed, even though many of them do belong to groups which I’m afraid I will have to have liquidated when I come to power. This indicates that this reader was reached on some real human level that most authors fail to reach me at.</p><p><b>Creativity:</b> 5 of 5. I was tempted to get cute here and give it seven out of five, or something like that. You will never forget this book. You will not ever confuse it with some other novel. You may very well find yourself paraphrasing it in philosophical discussions a decade after you read it. One could easily be moved to wax Levar Burton about how books like this are magical spaceships of imagination that transport you over astonishing rainbows of delight. I am totally unable to describe this book as a cross between two previous books. That’s becoming a rare distinction.</p><p><b>Text sample:</b><br/></p><blockquote><p>I shook my head in wonder. “I can’t think of any reason why evolutionary history should be similar on multiple worlds.”</p><p>“One reason is obvious,” said Hollus. He moved sideways a few steps; perhaps he was getting tired of supporting his own weight, although I couldn’t imagine what sort of chair he might use. “It could be that way because God wished it to be so.”</p><p>For some reason, I was surprised to hear the alien talking like that. Most of the scientists I know are either atheists or keep their religion to themselves — and Hollus had indeed said he was a scientist.</p><p>“That’s one explanation,” I said quietly.</p><p>“It is the most sensible. Do humans not subscribe to a principle that says the simplest explanation is the most preferable?”</p><p>I nodded. “We call it Occam’s razor.”</p><p>“The explanation that it was God’s will posits one cause for all the mass extinctions; that makes it preferable.”</p><p>“Well, I suppose, if . . .” — dammitall, I know I should have just been polite, just nodded and smiled, the way I do when the occasional religious nut accosts me in the Dinosaur Gallery and demands to know how Noah’s flood fits in, but I felt I had to speak up — “… if you believe in God.”</p><p>Hollus’s eyestalks moved to what seemed to be their maximal extent, as if he was regarding me from both sides simultaneously. “Are you the most senior paleontologist at this institution?” he asked.</p><p>“I’m the department head, yes.”</p><p>“There is no paleontologist with more experience?”</p><p>I frowned. “Well, there’s Jonesy, the senior invertebrate curator. He’s damn near as old as some of his specimens.”</p><p>“Perhaps I should speak with him.”</p><p>“If you like. But what’s wrong?”</p><p>“I know from your television that there is much ambivalence about God in this part of your planet, at least among the general public, but I am surprised to hear that someone in your position is not personally convinced of the existence of the creator.”</p><p>“Well, then, Jonesy’s not your man; he’s on the board of CSICOP.”</p><p>“Sky cop?”</p><p>“The Committee for Scientific Investigation of Claims of the Paranormal. He definitely doesn’t believe in God.”</p><p>“I am stunned,” said Hollus, and his eyes turned away from me, examining the posters on my office wall — a Gurche, a Czerkas, and two Kishes.</p><p>“We tend to consider religion a personal matter,” I said gently. “The very nature of faith is that one cannot be factually sure about it.”</p><p>“I do not speak of matters of faith,” said Hollus, turning his eyes back toward me. “Rather, I speak of verifiable scientific fact. That we live in a created universe is apparent to anyone with sufficient intelligence and information.”</p><p>I wasn’t really offended, but I was surprised; previously, I’d only heard similar comments from so-called creation scientists. “You’ll find many religious people here at the ROM,” I said. “Raghubir, whom you met down in the lobby, for instance. But even he wouldn’t say that the existence of God is a scientific fact.”</p><p>“Then it will fall to me to educate you in this,” said Hollus.</p><p>Oh, joy. “If you think it’s necessary.”</p><p>“It is if you are to help me in my work. My opinion is not a minority one; the existence of God is a fundamental part of the science of both Beta Hydri and Delta Pavonis.”</p><p>“Many humans believe that such questions are outside the scope of science.”</p><p>Hollus regarded me again, as if I were failing some test. “Nothing is outside the scope of science,” he said firmly — a position I did not, in fact, disagree with. But we rapidly parted company again: “The primary goal of modern science,” he continued, “is to discover why God has behaved as he has and to determine his methods. We do not believe — what is the term you use? — we do not believe that he simply waves his hands and wishes things into existence. We live in a universe of physics, and he must have used quantifiable physical processes to accomplish his ends. If he has indeed been guiding the broad strokes of evolution on at least three worlds, then we must ask how? And why? What is he trying to accomplish?”<br/></p></blockquote><p></p></div>",
  "content_text": "I thought this review was particularly timely, coming as it does on top of the WND article discussing the intriguing possibility that\nthe speed of light is declining\nand the recent discussion here on the Anthropic Principle, (which, as always, devolved into a discussion of evolution).  Then, too, the gratuitous slams on Canada bear mention.  Dave’s review strikes me as overgenerous on the points considering his description, as the characterizations sounded a lot more like a 2/5 instead of 4/5, but then, I haven’t read the book.\nKeep in mind that it is better if one does not describe the plot in a review.  This review structure provides adequate information for someone to determine if they’re interested in the book or not without being walked through the events of the story.  I’m interested in reviews, not synopses.  There is a difference.\nCalculating God\nRobert J. Sawyer\nRating: 8.5 of 10\nReview by:\nDave Munger\nThe theological science fiction novel “Calculating God” could easily get lost in the recent bumper crop of grandiose eschatological epics with authors who have been compared to Arthur C. Clarke and protagonists dying of cancer. You know, that whole Greggory Benford, Steven Baxter sub-genre that one now finds filling the SF book racks in grocery stores, between authorized biographies of Chewbacca and “The Eco-Feminist Elves Of Shanana”. This would be a shame, since Robert J. Sawyer has written a book much more worthy of your time than most SF available at grocery stores (that’s where I bought it).\n“Calculating God” has much to recommend it. I was personally charmed by an extraterrestrial character with religious views superficially similar to my own (God created the universe and life; People do not have immortal souls).  This alien, named Hollus, speaks something like the magnificent Dr. Hugh Ross, although the Bible is not taken at all seriously by anyone in this book. There are enough pop-culture references to thoroughly satisfy whatever perverse appetite it is that makes people find this enjoyable, without being gratuitous or grating. Each belongs where it is placed, and furthers the story. Although the phrase “a novel of ideas” is quickly becoming the SF version of the cinematic designation “psychological thriller”, here it is quite fitting.\nThere are problems though, oh are there problems. For one thing, “Calculating God” is unremittingly Canadian throughout, which lends a slightly queasy “For Better or Worse” quality to the whole, and leads to several particularly sickening scenes. The stomach-churningly Episcopalian ethics of our chicken-boiling brethren are trotted out once in awhile and called “morality” (I’m not accusing Canadians of being Episcopalian, it’s just that they both sicken me similarly). The hero’s physician is incredibly smug about the cheap drugs Canadians have access to as a result of attaching their system lamprey-like to ours and letting our terrible Capitalistic health-care machine absorb all the R&D costs.\nThe worst flaw in the novel (if one does not consider the title and premise to be heinous blasphemies, that is), is a crappy, bigoted, unnecessary subplot. Ironically, it is the utter irrelevance of this part of the book that keeps it from ruining the whole. It is as if the main body of the story is an entirely separate book, like a beautiful young woman shacked up with a toothless, misogynistic, ass-fiend. You could edit it out yourself with a black magic marker, and significantly improve the storyline.\n“Calculating God” has something in it for anyone who enjoyed “A Brief History Of Time” or any science fiction stories. In a period and a field in which Ambrose Bierce’s definition of a novel as a short story padded seems particularly apropos, Sawyer has written a novel that could only have been presented in this form. You are expected to purchase it, read it, and discuss it amongst yourselves.\nStory:\n3.5 of 5. The rating in this category would be much closer to five if it weren’t for The Bad Part. The protagonist does make a fairly wild surmise about the nature of life in the universe, which turns out, incredibly, to be right. It’s quickly accepted as fact, without even being modified. This is probably necessary though, as the novel could have otherwise gone off on an overly realistic tangent, like the first five or so chapters of any novel written by an astronomer, and ended up a third longer. The story really delivers though, especially after the cardboard villains die, and all life in this part of the galaxy is nearly wiped out.\nStyle:\n4.5 of 5. Oddly realistic. Interstellar travel is subject to the constraints of General Relativity, and no laws of physics are bent beyond credulity. The fifth force introduced by the Forhilnors sounds a lot like Einstein’s cosmological constant, or for that matter, something I saw seriously postulated in a popular science magazine other than Popular Science a few months ago. This reader does not know his multiplication tables, and at no place did the science loose me. A much quicker read that the subject matter would seem to indicate.\nCharacters:\n4 of 5. If you like Spock you will like Hollus. If you do not like Spock, you are probably  way too picky about characterization of extraterrestrials. If you like any other Star Trek characters, you are obligated to like all fictional characters, period. If you can stand Canadians, you will be able to stand Tom Jericho. There is some question in my mind as to whether or not the most poorly written characters should even count, as they are confined to the part of the book that I have wished into the cornfield. Other than them, there was no one in this book that I wanted to see killed, even though many of them do belong to groups which I’m afraid I will have to have liquidated when I come to power. This indicates that this reader was reached on some real human level that most authors fail to reach me at.\nCreativity:\n5 of 5. I was tempted to get cute here and give it seven out of five, or something like that. You will never forget this book. You will not ever confuse it with some other novel. You may very well find yourself paraphrasing it in philosophical discussions a decade after you read it. One could easily be moved to wax Levar Burton about how books like this are magical spaceships of imagination that transport you over astonishing rainbows of delight. I am totally unable to describe this book as a cross between two previous books. That’s becoming a rare distinction.\nText sample:\nI shook my head in wonder. “I can’t think of any reason why evolutionary history should be similar on multiple worlds.”\n“One reason is obvious,” said Hollus. He moved sideways a few steps; perhaps he was getting tired of supporting his own weight, although I couldn’t imagine what sort of chair he might use. “It could be that way because God wished it to be so.”\nFor some reason, I was surprised to hear the alien talking like that. Most of the scientists I know are either atheists or keep their religion to themselves — and Hollus had indeed said he was a scientist.\n“That’s one explanation,” I said quietly.\n“It is the most sensible. Do humans not subscribe to a principle that says the simplest explanation is the most preferable?”\nI nodded. “We call it Occam’s razor.”\n“The explanation that it was God’s will posits one cause for all the mass extinctions; that makes it preferable.”\n“Well, I suppose, if . . .” — dammitall, I know I should have just been polite, just nodded and smiled, the way I do when the occasional religious nut accosts me in the Dinosaur Gallery and demands to know how Noah’s flood fits in, but I felt I had to speak up — “… if you believe in God.”\nHollus’s eyestalks moved to what seemed to be their maximal extent, as if he was regarding me from both sides simultaneously. “Are you the most senior paleontologist at this institution?” he asked.\n“I’m the department head, yes.”\n“There is no paleontologist with more experience?”\nI frowned. “Well, there’s Jonesy, the senior invertebrate curator. He’s damn near as old as some of his specimens.”\n“Perhaps I should speak with him.”\n“If you like. But what’s wrong?”\n“I know from your television that there is much ambivalence about God in this part of your planet, at least among the general public, but I am surprised to hear that someone in your position is not personally convinced of the existence of the creator.”\n“Well, then, Jonesy’s not your man; he’s on the board of CSICOP.”\n“Sky cop?”\n“The Committee for Scientific Investigation of Claims of the Paranormal. He definitely doesn’t believe in God.”\n“I am stunned,” said Hollus, and his eyes turned away from me, examining the posters on my office wall — a Gurche, a Czerkas, and two Kishes.\n“We tend to consider religion a personal matter,” I said gently. “The very nature of faith is that one cannot be factually sure about it.”\n“I do not speak of matters of faith,” said Hollus, turning his eyes back toward me. “Rather, I speak of verifiable scientific fact. That we live in a created universe is apparent to anyone with sufficient intelligence and information.”\nI wasn’t really offended, but I was surprised; previously, I’d only heard similar comments from so-called creation scientists. “You’ll find many religious people here at the ROM,” I said. “Raghubir, whom you met down in the lobby, for instance. But even he wouldn’t say that the existence of God is a scientific fact.”\n“Then it will fall to me to educate you in this,” said Hollus.\nOh, joy. “If you think it’s necessary.”\n“It is if you are to help me in my work. My opinion is not a minority one; the existence of God is a fundamental part of the science of both Beta Hydri and Delta Pavonis.”\n“Many humans believe that such questions are outside the scope of science.”\nHollus regarded me again, as if I were failing some test. “Nothing is outside the scope of science,” he said firmly — a position I did not, in fact, disagree with. But we rapidly parted company again: “The primary goal of modern science,” he continued, “is to discover why God has behaved as he has and to determine his methods. We do not believe — what is the term you use? — we do not believe that he simply waves his hands and wishes things into existence. We live in a universe of physics, and he must have used quantifiable physical processes to accomplish his ends. If he has indeed been guiding the broad strokes of evolution on at least three worlds, then we must ask how? And why? What is he trying to accomplish?”",
  "tags": [],
  "categories": [],
  "sitemap_lastmod": "2004-07-31T12:23:00+00:00"
}