{
  "url": "https://voxday.net/2004/07/21/so-sprach-mogambo/",
  "scraped_at": "2025-12-19T20:37:22.666755",
  "title": "So sprach Mogambo",
  "date_display": "July 21, 2004",
  "date_iso": "2004-07-21T08:55:00+00:00",
  "date_from_url": "2004-07-21",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><blockquote><p> <br>So <a href=\"http://www.321gold.com/editorials/daughty/daughty072104.html\">how severe will the bust be</a>? Worse than anything you can imagine, as the degree of monetary laxity under the horrid Alan Greenspan is worse than anything anyone could possibly have imagined, sort of like when you were young and you were wondering what it will be like to be married, and never once did you interrupt the carnal daydreams and idyllic visions of staying up as late as you wanted and eating cake for dinner to consider that it would end up being an unending hell, where you spend your waking moments praying for death to deliver your from getting any more of what you so richly deserve for being such a moron and having such a loose grip on reality.</br></p><p>The Aden sisters, who have also been around this economic biz long enough to see the writing on the wall, write that “Inflation is headed higher,” although they qualify their assessment with the soothing qualifier, “It may not become as extreme as it did in the 1970s.” Well, they have their opinion and I have mine, which that it will be worse, much, much worse, than it was in the 1970’s, only because the outrageous level of money created and the sheer size and expense of the government makes the 1970’s look like a day at the beach in comparison.</p><p>They then give a little snapshot of how prices are acting lately. “Last month import prices soared at an annual rate of 19.2%. Consumer prices had their biggest jump in 14 years this year with the latest rise at 7.2% annualized. This included a 55% surge in energy prices and a nearly 11% gain in food prices (both annualized). Excluding these, the popular core rate was obviously less. But since we all eat and drive, the core rate is actually meaningless.”</p><p>“Producer prices reinforced the other inflation figures. They too have soared the most in 14 years over the past year with the latest up at an annual rate of nearly 10%. Energy and food prices surged over 19% and 18% annualized, respectively. So who says there’s no inflation? There is, and it’s soaring.”</p><p>Richard Russell “The fact (which few seem to realize) is that the Fed is still fighting the dragon of deflation. For the year-to-date (the last 25 weeks), M-3, the broad money supply, is up $430 billion or an annualized rate of 10.1%. This is double last year’s rate, so it seems clear that Alan Greenspan still believes it’s necessary to fight deflation.”</p><p>And what is this deflation that Greenspan is so worried about? <b>The prices of stocks and bonds and houses.</b><br/></p></blockquote><p>Austrian theory is calling it.  Elliott Wave is calling it.  The debt levels, trade deficits and conventional history is all ominous.  But Alan Greenspan says it’s okay, so I’m sure it’s fine.<br/></p></div>",
  "content_text": "So\nhow severe will the bust be\n? Worse than anything you can imagine, as the degree of monetary laxity under the horrid Alan Greenspan is worse than anything anyone could possibly have imagined, sort of like when you were young and you were wondering what it will be like to be married, and never once did you interrupt the carnal daydreams and idyllic visions of staying up as late as you wanted and eating cake for dinner to consider that it would end up being an unending hell, where you spend your waking moments praying for death to deliver your from getting any more of what you so richly deserve for being such a moron and having such a loose grip on reality.\nThe Aden sisters, who have also been around this economic biz long enough to see the writing on the wall, write that “Inflation is headed higher,” although they qualify their assessment with the soothing qualifier, “It may not become as extreme as it did in the 1970s.” Well, they have their opinion and I have mine, which that it will be worse, much, much worse, than it was in the 1970’s, only because the outrageous level of money created and the sheer size and expense of the government makes the 1970’s look like a day at the beach in comparison.\nThey then give a little snapshot of how prices are acting lately. “Last month import prices soared at an annual rate of 19.2%. Consumer prices had their biggest jump in 14 years this year with the latest rise at 7.2% annualized. This included a 55% surge in energy prices and a nearly 11% gain in food prices (both annualized). Excluding these, the popular core rate was obviously less. But since we all eat and drive, the core rate is actually meaningless.”\n“Producer prices reinforced the other inflation figures. They too have soared the most in 14 years over the past year with the latest up at an annual rate of nearly 10%. Energy and food prices surged over 19% and 18% annualized, respectively. So who says there’s no inflation? There is, and it’s soaring.”\nRichard Russell “The fact (which few seem to realize) is that the Fed is still fighting the dragon of deflation. For the year-to-date (the last 25 weeks), M-3, the broad money supply, is up $430 billion or an annualized rate of 10.1%. This is double last year’s rate, so it seems clear that Alan Greenspan still believes it’s necessary to fight deflation.”\nAnd what is this deflation that Greenspan is so worried about?\nThe prices of stocks and bonds and houses.\nAustrian theory is calling it.  Elliott Wave is calling it.  The debt levels, trade deficits and conventional history is all ominous.  But Alan Greenspan says it’s okay, so I’m sure it’s fine.",
  "tags": [],
  "categories": [],
  "sitemap_lastmod": "2004-07-21T07:55:00+00:00"
}