{
  "url": "https://voxday.net/2004/07/17/someone-skipped-logic-class/",
  "scraped_at": "2025-12-19T20:36:34.526006",
  "title": "Someone skipped logic class",
  "date_display": "July 17, 2004",
  "date_iso": "2004-07-17T09:50:00+00:00",
  "date_from_url": "2004-07-17",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>Kyle Williams writes on WND:<br/></p><blockquote><p> <br> Yet, for some conservatives, choosing a candidate isn’t limited to George W. Bush and John Kerry. Because President Bush has betrayed conservatives on various social and fiscal issues, the conservative base is divided and hasn’t rallied around Bush like it did four years ago. This leaves some conservatives wondering whether or not they should jump ship for a third-party candidate like Constitution Party nominee Michael Peroutka or even the Libertarian, Michael Badnarik. Meanwhile, the rest of the conservative/Republican camp is griping that a vote for a third-party candidate will do nothing but help John Kerry.</br></p><p> In reality, they’re right. A vote for a third-party candidate may be a stand for ideals, and it may send a message to the GOP, but it won’t do much good. There aren’t enough conservatives who will vote third party to scare GOP officials, but there are just enough third-party voters that it may help John Kerry. Yes, a vote for Michael Peroutka is a wasted vote. It’s hard to say whether a third-party candidate will ever be viable, but it’s obvious that no third-party nominee has a shot at the presidency in this election cycle.</p><p> Therefore, conservatives need to look at the priorities. What’s important? If we truly care about appointing conservative judges, then we can’t have John Kerry in office. If we truly care about the economy, then we can’t have Kerry in office. If we care about the War on Terrorism, then we can’t have Kerry in office. If we truly care about cutting taxes, then we can’t have Kerry in office.</p><p> The only viable alternative is President Bush. He’s not a conservative, true. He has betrayed conservative principles and has taken actions that would make a liberal proud, but he’s the man when it comes to the economy, taxes, war on terrorism and, most importantly, the judicial branch.<br/></p></blockquote><p> This column could be cited as a persuasive argument against homeschool, if only the public schools still taught logic.  But in an case, let’s follow young Mr. William’s advice to look at the priorities:</p><p> 1) “If we truly care about appointing conservative judges….” George Bush hasn’t managed to get any conservative judges through a Republican House and Senate. Perhaps if conservatives are satisfied with mere appointments, one could construct a case on this basis for Bush. But, as conservatives are more likely concerned with <em>seating</em> conservative judges, not merely seeing them appointed and rejected, Bush’s first term should suffice to demonstrate that this is not an adequate reason to vote for him. Whether he truly wishes to seat such judges or not is unimportant, the fact of the matter is that he hasn’t and he won’t.  Still, the president’s work to retain Arlen Spectre as the head of the Senate Judiciary Committee suggests that he does not truly wish to see conservative judges on the bench.</p><p> 2) “If we truly care about the economy….” George Bush has engaged in unrestrained Keynesian expansion, using tax cuts and increased government spending in combination with massively easy monetary policy in order to postpone the inevitable post-boom bust. This never works long and only exacerbates the eventual bust, the next (third) wave of which has already begun. It’s no secret that George Bush is an economic illiterate, but so are his economic advisors, who are using outdated economic models repeatedly proven to be disastrous failures.</p><p> 3) “If we care about the War on Terrorism….” Right, undeclared and extra-Constitutional war on method and a Commander-in-chief who’s afraid to name the enemy or attack his strongholds. No thanks.</p><p> 4) “If we truly care about cutting taxes….” This is the one viable point. If you’re a one-issue voter, by all means, vote for George Bush on this basis. But it may be wise to keep in mind, he’s not doing it on principle, he’s doing it because he’s desperately trying to increase liquidity and get you spending in order to bring up the C component of GDP… and his concomitant inflationary fiscal policy in collaboration with Greenspan’s inflationary monetary policy has the net result of lowering your discretionary buying power even as more money goes into your pocket. 2 percent more money doesn’t buy 18 percent more gold, or 40 percent more gasoline.</p><p> And then, there’s the open admission that George Bush is no conservative. So, why should conservatives support a non-conservative? Right, because he’s the lesser of two evils. I should point out that as a Christian libertarian, I believe in free will, so I fully expect people to decide to support evil on a regular basis, using a wide variety of rationalizations. All I ask is that conservatives remember that this is indeed a choice they are making, that no one is forcing them to knowingly support that which they believe to be wrong.<br/></p></div>",
  "content_text": "Kyle Williams writes on WND:\nYet, for some conservatives, choosing a candidate isn’t limited to George W. Bush and John Kerry. Because President Bush has betrayed conservatives on various social and fiscal issues, the conservative base is divided and hasn’t rallied around Bush like it did four years ago. This leaves some conservatives wondering whether or not they should jump ship for a third-party candidate like Constitution Party nominee Michael Peroutka or even the Libertarian, Michael Badnarik. Meanwhile, the rest of the conservative/Republican camp is griping that a vote for a third-party candidate will do nothing but help John Kerry.\nIn reality, they’re right. A vote for a third-party candidate may be a stand for ideals, and it may send a message to the GOP, but it won’t do much good. There aren’t enough conservatives who will vote third party to scare GOP officials, but there are just enough third-party voters that it may help John Kerry. Yes, a vote for Michael Peroutka is a wasted vote. It’s hard to say whether a third-party candidate will ever be viable, but it’s obvious that no third-party nominee has a shot at the presidency in this election cycle.\nTherefore, conservatives need to look at the priorities. What’s important? If we truly care about appointing conservative judges, then we can’t have John Kerry in office. If we truly care about the economy, then we can’t have Kerry in office. If we care about the War on Terrorism, then we can’t have Kerry in office. If we truly care about cutting taxes, then we can’t have Kerry in office.\nThe only viable alternative is President Bush. He’s not a conservative, true. He has betrayed conservative principles and has taken actions that would make a liberal proud, but he’s the man when it comes to the economy, taxes, war on terrorism and, most importantly, the judicial branch.\nThis column could be cited as a persuasive argument against homeschool, if only the public schools still taught logic.  But in an case, let’s follow young Mr. William’s advice to look at the priorities:\n1) “If we truly care about appointing conservative judges….” George Bush hasn’t managed to get any conservative judges through a Republican House and Senate. Perhaps if conservatives are satisfied with mere appointments, one could construct a case on this basis for Bush. But, as conservatives are more likely concerned with\nseating\nconservative judges, not merely seeing them appointed and rejected, Bush’s first term should suffice to demonstrate that this is not an adequate reason to vote for him. Whether he truly wishes to seat such judges or not is unimportant, the fact of the matter is that he hasn’t and he won’t.  Still, the president’s work to retain Arlen Spectre as the head of the Senate Judiciary Committee suggests that he does not truly wish to see conservative judges on the bench.\n2) “If we truly care about the economy….” George Bush has engaged in unrestrained Keynesian expansion, using tax cuts and increased government spending in combination with massively easy monetary policy in order to postpone the inevitable post-boom bust. This never works long and only exacerbates the eventual bust, the next (third) wave of which has already begun. It’s no secret that George Bush is an economic illiterate, but so are his economic advisors, who are using outdated economic models repeatedly proven to be disastrous failures.\n3) “If we care about the War on Terrorism….” Right, undeclared and extra-Constitutional war on method and a Commander-in-chief who’s afraid to name the enemy or attack his strongholds. No thanks.\n4) “If we truly care about cutting taxes….” This is the one viable point. If you’re a one-issue voter, by all means, vote for George Bush on this basis. But it may be wise to keep in mind, he’s not doing it on principle, he’s doing it because he’s desperately trying to increase liquidity and get you spending in order to bring up the C component of GDP… and his concomitant inflationary fiscal policy in collaboration with Greenspan’s inflationary monetary policy has the net result of lowering your discretionary buying power even as more money goes into your pocket. 2 percent more money doesn’t buy 18 percent more gold, or 40 percent more gasoline.\nAnd then, there’s the open admission that George Bush is no conservative. So, why should conservatives support a non-conservative? Right, because he’s the lesser of two evils. I should point out that as a Christian libertarian, I believe in free will, so I fully expect people to decide to support evil on a regular basis, using a wide variety of rationalizations. All I ask is that conservatives remember that this is indeed a choice they are making, that no one is forcing them to knowingly support that which they believe to be wrong.",
  "tags": [],
  "categories": [],
  "sitemap_lastmod": "2004-07-17T08:50:00+00:00"
}