{
  "url": "https://voxday.net/2004/07/06/spiderflaws/",
  "scraped_at": "2025-12-19T20:34:47.335566",
  "title": "Spiderflaws",
  "date_display": "July 6, 2004",
  "date_iso": "2004-07-06T12:51:00+00:00",
  "date_from_url": "2004-07-06",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><blockquote><p> <br><a href=\"http://www.moviemistakes.com/film3843\">Factual error</a>: When Spider-man is fighting with Doc Ock and Doc Ock throws Spider-man through the overhead pedestrian bridge, Doc Ock throws Spider-man in the direction of travel of the train, and when passing through the bridge, Spider-man doesn’t touch anything. When Spider-man comes out the other side, he is ‘behind’ Doc Ock (in terms of the direction of train travel). This implies that Spider-man has slowed down in the air – fair enough due to wind resistance – and so is traveling slower. However, Spider-man then hits Doc Ock, which implies he is now traveling faster. A physical impossibility (since the horizontal speed doesn’t increase and decrease when thrown, only the vertical speed).<br/></br></p></blockquote><p>I have to confess, I’m one of those people who gets extremely annoyed when there are obvious plot holes.  As one SF writer once said, any story that depends on someone being completely stupid shouldn’t even be considered a story.  This doesn’t apply to the new Spiderman movie, necessarily, but this particular error makes me wonder if minor physics errors are one of the reasons that CGI action scenes often look noticeably wrong, even to those of us who couldn’t work out the proper physics with a gun to our head.</p><p>Seeing <em>Enemy at the Gates</em> with a Force Recon sniper was a riot.  He was physically squirming in his chair with the effort to keep his mouth shut during the movie.  Afterwards, we went out for pizza and the girls did their best to ignore us while he went on a 30-minute rampage of the film’s collection of absurdities.  Good humor.<br/></p></div>",
  "content_text": "Factual error\n: When Spider-man is fighting with Doc Ock and Doc Ock throws Spider-man through the overhead pedestrian bridge, Doc Ock throws Spider-man in the direction of travel of the train, and when passing through the bridge, Spider-man doesn’t touch anything. When Spider-man comes out the other side, he is ‘behind’ Doc Ock (in terms of the direction of train travel). This implies that Spider-man has slowed down in the air – fair enough due to wind resistance – and so is traveling slower. However, Spider-man then hits Doc Ock, which implies he is now traveling faster. A physical impossibility (since the horizontal speed doesn’t increase and decrease when thrown, only the vertical speed).\nI have to confess, I’m one of those people who gets extremely annoyed when there are obvious plot holes.  As one SF writer once said, any story that depends on someone being completely stupid shouldn’t even be considered a story.  This doesn’t apply to the new Spiderman movie, necessarily, but this particular error makes me wonder if minor physics errors are one of the reasons that CGI action scenes often look noticeably wrong, even to those of us who couldn’t work out the proper physics with a gun to our head.\nSeeing\nEnemy at the Gates\nwith a Force Recon sniper was a riot.  He was physically squirming in his chair with the effort to keep his mouth shut during the movie.  Afterwards, we went out for pizza and the girls did their best to ignore us while he went on a 30-minute rampage of the film’s collection of absurdities.  Good humor.",
  "tags": [],
  "categories": [],
  "sitemap_lastmod": "2004-07-06T11:51:00+00:00"
}