{
  "url": "https://voxday.net/2004/07/15/sports-guy-on-shaq-trade/",
  "scraped_at": "2025-12-19T20:36:14.348372",
  "title": "Sports Guy on the Shaq trade",
  "date_display": "July 15, 2004",
  "date_iso": "2004-07-15T07:02:00+00:00",
  "date_from_url": "2004-07-15",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><blockquote><p><a href=\"http://sports.espn.go.com/espn/page2/story?page=simmons/take/040714\">And then there’s Angry Shaq</a>. He needed this to happen. Honestly, he hasn’t given a crap about basketball for four years, since they won that second title and crushed the Sixers. After that happened, Satiated Shaq stuck around and kept playing, knowing that he could accomplish more on cruise control than just about every other player in the league. I don’t think it was a malicious act on his part. It was his version of MJ scurrying off to hit baseballs for two years.</p><p>Maybe we were insulted as basketball fans, but this was also the one quality that made him stand out over everyone else: This is a good guy. He takes care of his family, looks out for his friends, never stops having fun. He dabbles in movies, music, TV, even comedy roasts. He figured out how to handle the media early in his career — mumble through your answers, use intimidation when necessary; and eventually, everyone will leave you alone. I think he’s one of the smartest athletes in any sport. Seriously. Who leads a better life than him? What team athlete makes more money than him? Who balanced the characters of Public Superstar and Private Superstar more brilliantly than him? We don’t know ANYTHING about him, yet we feel like we do. And he likes it that way.</p><p>Which made it especially ironic that, for years and years, Shaq wore the “black hat” and Kobe wore the “white hat” on the Lakers. To the general public, Shaq was just a big mumbling monster, a physical freak with no discernible basketball skills, someone who couldn’t even make a damn free throw. Casual fans (and Lakers fans, which is basically the same thing) gravitated towards Kobe, partly because he reminded them of a young MJ, partly because he seemed like such a decent guy. Nobody realized that Kobe was an impossible prima donna behind the scenes, a brooding loner consumed with basketball and nothing else, someone lacking the requisite social skills to get along with teammates on even a rudimentary level.<br/></p></blockquote><p>I’m no NBA fan, but I always enjoy the Sports Guy’s analyses, as he throws himself into them with complete abandon.  Unlike almost every other sportswriter in the business, he has no fear of stating his opinion, even when it leads an entire city to regard him with utter loathing.  But I didn’t like Houston either.</p><p>And besides, how can you not love a column called “More Cowbell”.  Because I got a fever, and the only thing that’s going to cure it is, more cow-bell.  It seems ESPN is more flexible than WND – I wanted to call my column “Defending the Mike” but that got ixnayed.  I suppose “More Cowbell” is marginally less obscure, but still….<br/></p></div>",
  "content_text": "And then there’s Angry Shaq\n. He needed this to happen. Honestly, he hasn’t given a crap about basketball for four years, since they won that second title and crushed the Sixers. After that happened, Satiated Shaq stuck around and kept playing, knowing that he could accomplish more on cruise control than just about every other player in the league. I don’t think it was a malicious act on his part. It was his version of MJ scurrying off to hit baseballs for two years.\nMaybe we were insulted as basketball fans, but this was also the one quality that made him stand out over everyone else: This is a good guy. He takes care of his family, looks out for his friends, never stops having fun. He dabbles in movies, music, TV, even comedy roasts. He figured out how to handle the media early in his career — mumble through your answers, use intimidation when necessary; and eventually, everyone will leave you alone. I think he’s one of the smartest athletes in any sport. Seriously. Who leads a better life than him? What team athlete makes more money than him? Who balanced the characters of Public Superstar and Private Superstar more brilliantly than him? We don’t know ANYTHING about him, yet we feel like we do. And he likes it that way.\nWhich made it especially ironic that, for years and years, Shaq wore the “black hat” and Kobe wore the “white hat” on the Lakers. To the general public, Shaq was just a big mumbling monster, a physical freak with no discernible basketball skills, someone who couldn’t even make a damn free throw. Casual fans (and Lakers fans, which is basically the same thing) gravitated towards Kobe, partly because he reminded them of a young MJ, partly because he seemed like such a decent guy. Nobody realized that Kobe was an impossible prima donna behind the scenes, a brooding loner consumed with basketball and nothing else, someone lacking the requisite social skills to get along with teammates on even a rudimentary level.\nI’m no NBA fan, but I always enjoy the Sports Guy’s analyses, as he throws himself into them with complete abandon.  Unlike almost every other sportswriter in the business, he has no fear of stating his opinion, even when it leads an entire city to regard him with utter loathing.  But I didn’t like Houston either.\nAnd besides, how can you not love a column called “More Cowbell”.  Because I got a fever, and the only thing that’s going to cure it is, more cow-bell.  It seems ESPN is more flexible than WND – I wanted to call my column “Defending the Mike” but that got ixnayed.  I suppose “More Cowbell” is marginally less obscure, but still….",
  "tags": [],
  "categories": [],
  "sitemap_lastmod": "2004-07-15T06:02:00+00:00"
}