{
  "url": "https://voxday.net/2004/07/05/there-is-no-law/",
  "scraped_at": "2025-12-19T20:34:43.659763",
  "title": "There is no law",
  "date_display": "July 5, 2004",
  "date_iso": "2004-07-05T11:59:00+00:00",
  "date_from_url": "2004-07-05",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>I’ve never paid much attention to the oft-cited “it’s the law” argument.  As the Gargler <a href=\"http://bloggerblaster.blogspot.com/2004_07_01_bloggerblaster_archive.html#108894738620673798\">pointed out recently</a>, that point is only raised when it’s deemed in the interest of the politicians and bureaucrats to do something that people don’t want them to do or when they wish to compel unthinking obedience.  Jaywalking is almost never prosecuted, although “it’s the law”, and businesses freely do business on Sundays in many states in open and accepted defiance the blue laws still on the books.</p><p>As the Constitution is now a dead letter in the eyes of the government and the law no longer stands as written but is superceded by judge-declared case law – otherwise known as the Rule of Man that the Rule of Law was supposed to supplant – it’s clear that there is no law.  Although few realize it yet, we now live in a Maughamite environment of “do what thou wilt with due regard for the policeman around the corner” and should expect the concomitant results in the near term.</p><p>People tend to forget that no one relies so heavily on “it’s the law” as a corrupt political leadership:<br/></p><blockquote><p> <br>China’s state-controlled media <a href=\"http://www.washingtonpost.com/ac2/wp-dyn/A28014-2004Jul4?language=printer\">have not reported Jiang’s detention</a>, which began June 1. In response to questions submitted by The Washington Post, the government said in a brief statement: “Jiang Yanyong, as a soldier, recently violated the relevant discipline of the military. Based on relevant regulations, the military has been helping and educating him.”  Though Chinese police routinely jail dissidents, the decision to detain Jiang appears to have been made by the Central Military Commission, the nation’s supreme military body, with the consent of the party’s most senior leaders, including President Hu Jintao and his influential predecessor, Jiang Zemin, according to a source familiar with the decision-making process.<br/></br></p></blockquote><p>Jiang Yanyong, a 72-year old doctor and “soldier” clearly broke the law in alerting the world to the Chinese cover-up of SARS.  Is it right or just for him to be locked away and re-educated?  After all, “it’s the law.”<br/></p></div>",
  "content_text": "I’ve never paid much attention to the oft-cited “it’s the law” argument.  As the Gargler\npointed out recently\n, that point is only raised when it’s deemed in the interest of the politicians and bureaucrats to do something that people don’t want them to do or when they wish to compel unthinking obedience.  Jaywalking is almost never prosecuted, although “it’s the law”, and businesses freely do business on Sundays in many states in open and accepted defiance the blue laws still on the books.\nAs the Constitution is now a dead letter in the eyes of the government and the law no longer stands as written but is superceded by judge-declared case law – otherwise known as the Rule of Man that the Rule of Law was supposed to supplant – it’s clear that there is no law.  Although few realize it yet, we now live in a Maughamite environment of “do what thou wilt with due regard for the policeman around the corner” and should expect the concomitant results in the near term.\nPeople tend to forget that no one relies so heavily on “it’s the law” as a corrupt political leadership:\nChina’s state-controlled media\nhave not reported Jiang’s detention\n, which began June 1. In response to questions submitted by The Washington Post, the government said in a brief statement: “Jiang Yanyong, as a soldier, recently violated the relevant discipline of the military. Based on relevant regulations, the military has been helping and educating him.”  Though Chinese police routinely jail dissidents, the decision to detain Jiang appears to have been made by the Central Military Commission, the nation’s supreme military body, with the consent of the party’s most senior leaders, including President Hu Jintao and his influential predecessor, Jiang Zemin, according to a source familiar with the decision-making process.\nJiang Yanyong, a 72-year old doctor and “soldier” clearly broke the law in alerting the world to the Chinese cover-up of SARS.  Is it right or just for him to be locked away and re-educated?  After all, “it’s the law.”",
  "tags": [],
  "categories": [],
  "sitemap_lastmod": "2004-07-05T10:59:00+00:00"
}