{
  "url": "https://voxday.net/2004/07/02/this-should-settle-i/",
  "scraped_at": "2025-12-19T20:34:17.186765",
  "title": "This should settle it",
  "date_display": "July 2, 2004",
  "date_iso": "2004-07-02T11:03:00+00:00",
  "date_from_url": "2004-07-02",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>As you may recall, I have insisted from the beginning that the current war is unconstitutional, that it has never been declared and that the Bush administration is operating outside the law in its use of military force around the world.  There are those who have argued the opposite, insisting that the Congressional authorizations of the use of force is a “virtual” declaration of war tantamount to the real thing.</p><p>Perhaps the Secretary of Defense can <a href=\"http://www.dod.mil/transcripts/2004/tr20040630-secdef0949.html\">settle the issue</a>:<br/></p><blockquote><p> <br>I think basically what we have is we’ve had over our history since World War II basically an idea that we were either in war or we were in peace and that we were in peacetime constraints.  And of course, <strong>since we don’t have a declaration of war</strong> and we’re not in World War III, all of those peacetime constraints and procedures and auditors and contract rules and competitive bidding, all of that pertains.  And the effect of it is that you end up in a war on terror, like we’re in, losing lives and yet you are still required to adhere to the rules of peacetime, because we don’t have gradations of between war and peace and therefore we need to find a way to live in this 21st century where threats can come at you from the shadows and from ungoverned areas in ways that are not predictable, as they were, for example, during World War II or during the Cold War, for that matter.<br/></br></p></blockquote><p>Or maybe, Donald, you might try actually paying attention to the Constitution and ask your boss to request a declaration of war from the Congress.  Remember that oath of office you took a few years ago?  By the way, this statement should also put to rest the notion that the administration is quietly implementing a secret strategy for waging war against expansionist Islam as well.<br/></p></div>",
  "content_text": "As you may recall, I have insisted from the beginning that the current war is unconstitutional, that it has never been declared and that the Bush administration is operating outside the law in its use of military force around the world.  There are those who have argued the opposite, insisting that the Congressional authorizations of the use of force is a “virtual” declaration of war tantamount to the real thing.\nPerhaps the Secretary of Defense can\nsettle the issue\n:\nI think basically what we have is we’ve had over our history since World War II basically an idea that we were either in war or we were in peace and that we were in peacetime constraints.  And of course,\nsince we don’t have a declaration of war\nand we’re not in World War III, all of those peacetime constraints and procedures and auditors and contract rules and competitive bidding, all of that pertains.  And the effect of it is that you end up in a war on terror, like we’re in, losing lives and yet you are still required to adhere to the rules of peacetime, because we don’t have gradations of between war and peace and therefore we need to find a way to live in this 21st century where threats can come at you from the shadows and from ungoverned areas in ways that are not predictable, as they were, for example, during World War II or during the Cold War, for that matter.\nOr maybe, Donald, you might try actually paying attention to the Constitution and ask your boss to request a declaration of war from the Congress.  Remember that oath of office you took a few years ago?  By the way, this statement should also put to rest the notion that the administration is quietly implementing a secret strategy for waging war against expansionist Islam as well.",
  "tags": [],
  "categories": [],
  "sitemap_lastmod": "2004-07-02T10:03:00+00:00"
}