{
  "url": "https://voxday.net/2004/07/08/unfaithful-women/",
  "scraped_at": "2025-12-19T20:35:07.671403",
  "title": "Unfaithful women",
  "date_display": "July 8, 2004",
  "date_iso": "2004-07-08T15:10:00+00:00",
  "date_from_url": "2004-07-08",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>Everyone knows men who refuse to grow up.  Most of them have the good sense to avoid marriage and children like the plague, knowing full well that they are unsuited for it.  But <a href=\"http://www.msnbc.msn.com/id/5359395/site/newsweek\">this Newsweek article </a>appears to demonstrate that some women, too, are developmentally challenged, and what is pehaps worse, are capable of becoming wives and mothers without either state propelling them beyond a child’s self-centered and superficial grasp of the world and how it operates.<br/></p><blockquote><p> <br>In retrospect, Nadine understands what pushed her mother to be unfaithful. Beautiful and intelligent, her mother was stifled by her life’s low horizons, and her father, a stand-up guy, was probably a little bit boring. The new man promised travel, wealth and adventure; her father was the kind of guy who’d say, “Why go around the world? You’ll get plane-sick.”<br/></br></p></blockquote><p>I find the notion that boredom is an understandable reason to be unfaithful to be somewhat strange, especially in light of the fact that women tend to marry “up” in terms of intelligence.  Who do you think is more likely to be bored with the other?  Furthermore, I know far more married couples wherein it is the woman, with her nesting instinct, who refuses to contemplate gallivanting around the world, and yet I’ve never heard  any of these men consider it a reasonable rationalization for unfaithfulness.</p><p>Strangest of all is the idea that “Sex in the City” should have any influence on one’s behavior.  If a man began acting like James Bond because he was a fan of the films, one would think he was insane.  Morality aside, any woman whose behavior and life philosophy is seriously affected by a television show should probably be committed to a mental institution on grounds of terminal shallowness.<br/></p></div>",
  "content_text": "Everyone knows men who refuse to grow up.  Most of them have the good sense to avoid marriage and children like the plague, knowing full well that they are unsuited for it.  But\nthis Newsweek article\nappears to demonstrate that some women, too, are developmentally challenged, and what is pehaps worse, are capable of becoming wives and mothers without either state propelling them beyond a child’s self-centered and superficial grasp of the world and how it operates.\nIn retrospect, Nadine understands what pushed her mother to be unfaithful. Beautiful and intelligent, her mother was stifled by her life’s low horizons, and her father, a stand-up guy, was probably a little bit boring. The new man promised travel, wealth and adventure; her father was the kind of guy who’d say, “Why go around the world? You’ll get plane-sick.”\nI find the notion that boredom is an understandable reason to be unfaithful to be somewhat strange, especially in light of the fact that women tend to marry “up” in terms of intelligence.  Who do you think is more likely to be bored with the other?  Furthermore, I know far more married couples wherein it is the woman, with her nesting instinct, who refuses to contemplate gallivanting around the world, and yet I’ve never heard  any of these men consider it a reasonable rationalization for unfaithfulness.\nStrangest of all is the idea that “Sex in the City” should have any influence on one’s behavior.  If a man began acting like James Bond because he was a fan of the films, one would think he was insane.  Morality aside, any woman whose behavior and life philosophy is seriously affected by a television show should probably be committed to a mental institution on grounds of terminal shallowness.",
  "tags": [],
  "categories": [],
  "sitemap_lastmod": "2004-07-08T14:10:00+00:00"
}