{
  "url": "https://voxday.net/2004/07/22/what-needs-to-be-done/",
  "scraped_at": "2025-12-19T20:37:33.787459",
  "title": "What needs to be done",
  "date_display": "July 22, 2004",
  "date_iso": "2004-07-22T14:35:00+00:00",
  "date_from_url": "2004-07-22",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><blockquote><p> <br>Flight crews and air marshals say Middle Eastern men are staking out airports, probing security measures and <a href=\"http://www.washtimes.com/national/20040721-101403-1508r.htm\">conducting test runs aboard airplanes</a> for a terrorist attack. At least two midflight incidents have involved numerous men of Middle Eastern descent behaving in what one pilot called “stereotypical” behavior of an organized attempt to attack a plane. “No doubt these are dry runs for a terrorist attack,” an air marshal said. Pilots and air marshals who asked to remain anonymous told The Washington Times that surveillance by terrorists is rampant, using different probing methods.</br></p><p>“It’s happening, and it’s a sad state of affairs,” a pilot said. A June 29 incident aboard Northwest Airlines Flight 327 from Detroit to Los Angeles is similar to a Feb. 15 incident on American Airlines Flight 1732 from San Juan, Puerto Rico, to New York’s John F. Kennedy Airport.<br/></p></blockquote><p>Not that I’ll be flying anytime soon, but here’s what I would recommend.  If a group of Middle Eastern men start playing the bathroom game, round up a few weightlifters, ex-jocks and any other guys who look as if they can handle themselves.  Then simply block off the bathrooms in precisely the same manner that the Arabs were.  If a flight attendant complains, tell her that you understand that she may not be able to discriminate, but not being an employee, you and the boys are not bound by airline policy, and since she’s already demonstrated that the crew obviously has no intention of enforcing a no-loitering rules, you’re not going to pay attention to it either.</p><p>Better to get a lecture at your destination than never make it there.  Is that discrimination?  Sure it is.  Deal with it.  When blue-eyed Swedish blondes start committing terrorist acts around the world, we’ll hassle them too.<br/></p></div>",
  "content_text": "Flight crews and air marshals say Middle Eastern men are staking out airports, probing security measures and\nconducting test runs aboard airplanes\nfor a terrorist attack. At least two midflight incidents have involved numerous men of Middle Eastern descent behaving in what one pilot called “stereotypical” behavior of an organized attempt to attack a plane. “No doubt these are dry runs for a terrorist attack,” an air marshal said. Pilots and air marshals who asked to remain anonymous told The Washington Times that surveillance by terrorists is rampant, using different probing methods.\n“It’s happening, and it’s a sad state of affairs,” a pilot said. A June 29 incident aboard Northwest Airlines Flight 327 from Detroit to Los Angeles is similar to a Feb. 15 incident on American Airlines Flight 1732 from San Juan, Puerto Rico, to New York’s John F. Kennedy Airport.\nNot that I’ll be flying anytime soon, but here’s what I would recommend.  If a group of Middle Eastern men start playing the bathroom game, round up a few weightlifters, ex-jocks and any other guys who look as if they can handle themselves.  Then simply block off the bathrooms in precisely the same manner that the Arabs were.  If a flight attendant complains, tell her that you understand that she may not be able to discriminate, but not being an employee, you and the boys are not bound by airline policy, and since she’s already demonstrated that the crew obviously has no intention of enforcing a no-loitering rules, you’re not going to pay attention to it either.\nBetter to get a lecture at your destination than never make it there.  Is that discrimination?  Sure it is.  Deal with it.  When blue-eyed Swedish blondes start committing terrorist acts around the world, we’ll hassle them too.",
  "tags": [],
  "categories": [],
  "sitemap_lastmod": "2004-07-22T13:35:00+00:00"
}