{
  "url": "https://voxday.net/2004/07/13/why-bush-is-poor-pro-life-vote/",
  "scraped_at": "2025-12-19T20:35:44.849744",
  "title": "Why Bush is a poor pro-life vote",
  "date_display": "July 13, 2004",
  "date_iso": "2004-07-13T07:23:00+00:00",
  "date_from_url": "2004-07-13",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><blockquote><p> <br>Many conservatives have tried to overlook President Bush’s liberal tendencies in hopes that at the least G. W. Bush will appoint a pro-lifer to the Supreme Court, and in so doing, help overturn Roe v. Wade. Their hope is not only without evidence, it is plainly contrary to evidence. In his prime-time television debates with Gore, George Bush flatly denied that he had a pro-life litmus test for Court appointees…. His record as Governor of Texas shows that he does indeed appoint pro-abortion judges, so we should not be surprised if President Bush were to appoint pro-abortion judges to the Supreme Court.</br></p><p>Frequently displayed as evidence of President Bush’s pro-life views is his signing of legislation when he was Texas’ Governor that forbade underage girls from getting abortions without parental consent. The pro-life community roared their approval: a 13-year-old girl can’t get an aspirin without parental consent, why should she be allowed to undergo a surgical or chemical abortion without parental consent?! That’s sound pro-life legislation, right? George Bush must be pro-life, huh? Wrong! Did you realize that this piece of legislation was nullified by a Texas Supreme Court decision that ruled 6-3 that an unexceptional 17-year-old could get an abortion without telling her parents?  The New York Times reported, “It was, after all, appointees of Gov. George W. Bush who took the lead on the issue…” You see, it was G.W. Bush who appointed or approved of four of the court’s nine justices and has been a political patron for a fifth, Harriet O’Neill, who wrote the majority opinion in the parental notification case. If this is what President Bush means by “strict constructionists,” then any hope that he will appoint a pro-lifer to the Federal bench is baseless.<br/></p></blockquote><p><a href=\"http://www.peroutka2004.com/schedule/index.php?action=itemview&amp;event_id=100\">This abundantly-footnoted article</a>, written by the founder of a pro-life physicians group, should suffice to explode the last principled reason to vote for the Republican candidate.  (Anyone who believes a Democrat won’t leap at the chance to use the war on method as an excuse to continue strengthening central state power is ignorant of both US military history and dialectic.)  Bush has already shown that he is unwilling to face down the Democrats despite having a majority in both House and Senate; if elected to a second term he will surely cave to the minority, as is his wont, and give us more Supreme Court judges in the mode of David Souter.</p><p>I assert that both Michael Peroutka of the Constitution Party and Michael Badnarik of the Libertarian Party are demonstrably better than Bush on abortion, despite the Libertarian Party platform’s pro-choice policy.  (Badnarik, by the way, is openly pro-life on the grounds that the unborn child has a same right to life as any other individual.)  Returning the question of abortion to the states, as the Libertarians demand, would end 1000x the abortions that the Partial-Birth Abortion ban has, and as the PBA ban is all that the Republican President, House, Senate and Supreme Court have been willing to do in four years of power, it is safe to assume that this is all that they will do.</p><p>If you’re not voting for Bush because you believe in him, but simply because “he can win”, then you might as well stop paying attention to the campaign and go cheer for the Yankees this summer.  This is not principle, it is simply bandwagon-hopping.  And, as I have previously demonstrated, political pragmatism is nothing more than long-term self-immolation.<br/></p></div>",
  "content_text": "Many conservatives have tried to overlook President Bush’s liberal tendencies in hopes that at the least G. W. Bush will appoint a pro-lifer to the Supreme Court, and in so doing, help overturn Roe v. Wade. Their hope is not only without evidence, it is plainly contrary to evidence. In his prime-time television debates with Gore, George Bush flatly denied that he had a pro-life litmus test for Court appointees…. His record as Governor of Texas shows that he does indeed appoint pro-abortion judges, so we should not be surprised if President Bush were to appoint pro-abortion judges to the Supreme Court.\nFrequently displayed as evidence of President Bush’s pro-life views is his signing of legislation when he was Texas’ Governor that forbade underage girls from getting abortions without parental consent. The pro-life community roared their approval: a 13-year-old girl can’t get an aspirin without parental consent, why should she be allowed to undergo a surgical or chemical abortion without parental consent?! That’s sound pro-life legislation, right? George Bush must be pro-life, huh? Wrong! Did you realize that this piece of legislation was nullified by a Texas Supreme Court decision that ruled 6-3 that an unexceptional 17-year-old could get an abortion without telling her parents?  The New York Times reported, “It was, after all, appointees of Gov. George W. Bush who took the lead on the issue…” You see, it was G.W. Bush who appointed or approved of four of the court’s nine justices and has been a political patron for a fifth, Harriet O’Neill, who wrote the majority opinion in the parental notification case. If this is what President Bush means by “strict constructionists,” then any hope that he will appoint a pro-lifer to the Federal bench is baseless.\nThis abundantly-footnoted article\n, written by the founder of a pro-life physicians group, should suffice to explode the last principled reason to vote for the Republican candidate.  (Anyone who believes a Democrat won’t leap at the chance to use the war on method as an excuse to continue strengthening central state power is ignorant of both US military history and dialectic.)  Bush has already shown that he is unwilling to face down the Democrats despite having a majority in both House and Senate; if elected to a second term he will surely cave to the minority, as is his wont, and give us more Supreme Court judges in the mode of David Souter.\nI assert that both Michael Peroutka of the Constitution Party and Michael Badnarik of the Libertarian Party are demonstrably better than Bush on abortion, despite the Libertarian Party platform’s pro-choice policy.  (Badnarik, by the way, is openly pro-life on the grounds that the unborn child has a same right to life as any other individual.)  Returning the question of abortion to the states, as the Libertarians demand, would end 1000x the abortions that the Partial-Birth Abortion ban has, and as the PBA ban is all that the Republican President, House, Senate and Supreme Court have been willing to do in four years of power, it is safe to assume that this is all that they will do.\nIf you’re not voting for Bush because you believe in him, but simply because “he can win”, then you might as well stop paying attention to the campaign and go cheer for the Yankees this summer.  This is not principle, it is simply bandwagon-hopping.  And, as I have previously demonstrated, political pragmatism is nothing more than long-term self-immolation.",
  "tags": [],
  "categories": [],
  "sitemap_lastmod": "2004-07-13T06:23:00+00:00"
}