{
  "url": "https://voxday.net/2004/07/09/you-get-what-you-deserve-2/",
  "scraped_at": "2025-12-19T20:35:14.973328",
  "title": "You get what you deserve",
  "date_display": "July 9, 2004",
  "date_iso": "2004-07-09T14:59:00+00:00",
  "date_from_url": "2004-07-09",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>Candie believes she can get what she wants:<br/></p><blockquote><p> <br>I think it’s time you jump into the time machine and return to 2004. I don’t think that just because I’m a woman I have to choose between a nice job or a nice husband. I’m not going to just lay down and play the ‘I’m a woman so I’m going to be submissive and silent’ game.  If I want a college education and a doctorate, I’ll get it. If I want a husband and a family, I’ll get that too. But I’m not going to sacrifice one or the other just because I don’t have the same equipment you do.<br/></br></p></blockquote><p>Candie’s comment immediately brought to mind <em>War and Peace</em>, in which Tolstoy mocked those who believe that basic human realities change over time: “- mentioning “our days” as people of limited intelligence are fond of doing, imagining that they have discovered and appraised the peculiarities of “our days” and that human characteristics change with the times -”</p><p>There’s a huge gap between “submissive and silent” and “tyrannical bitch that never shuts up and brooks no disagreement”; what is frightening about these so-called “strong” women who are so emotionally fragile that they can neither bear nor defend themselves against criticism is that they can’t see it.  They are so terrified of being viewed as outdated by those they’ve chosen as their peers – the Sisterhood – that they don’t even dare look at the situation with their eyes open and judge the facts for themselves.</p><p>It sounds to me as if Candie will likely not only get what she wants, she’ll get even more.  A degree, a career, a husband, a divorce.  Perhaps it she’ll marry a man who will one day realize that he doesn’t want to be married to a woman who is a bad wife and a worse mother, more likely, she’ll grow bored and discontent with the spineless jellyfish that is the sort of man these women tend to marry.</p><p>If you want to have it all, you’ll likely end up with far less than you could have had.<br/></p></div>",
  "content_text": "Candie believes she can get what she wants:\nI think it’s time you jump into the time machine and return to 2004. I don’t think that just because I’m a woman I have to choose between a nice job or a nice husband. I’m not going to just lay down and play the ‘I’m a woman so I’m going to be submissive and silent’ game.  If I want a college education and a doctorate, I’ll get it. If I want a husband and a family, I’ll get that too. But I’m not going to sacrifice one or the other just because I don’t have the same equipment you do.\nCandie’s comment immediately brought to mind\nWar and Peace\n, in which Tolstoy mocked those who believe that basic human realities change over time: “- mentioning “our days” as people of limited intelligence are fond of doing, imagining that they have discovered and appraised the peculiarities of “our days” and that human characteristics change with the times -”\nThere’s a huge gap between “submissive and silent” and “tyrannical bitch that never shuts up and brooks no disagreement”; what is frightening about these so-called “strong” women who are so emotionally fragile that they can neither bear nor defend themselves against criticism is that they can’t see it.  They are so terrified of being viewed as outdated by those they’ve chosen as their peers – the Sisterhood – that they don’t even dare look at the situation with their eyes open and judge the facts for themselves.\nIt sounds to me as if Candie will likely not only get what she wants, she’ll get even more.  A degree, a career, a husband, a divorce.  Perhaps it she’ll marry a man who will one day realize that he doesn’t want to be married to a woman who is a bad wife and a worse mother, more likely, she’ll grow bored and discontent with the spineless jellyfish that is the sort of man these women tend to marry.\nIf you want to have it all, you’ll likely end up with far less than you could have had.",
  "tags": [],
  "categories": [],
  "sitemap_lastmod": "2004-07-09T13:59:00+00:00"
}