{
  "url": "https://voxday.net/2005/01/10/another-vote-for-homeschooling/",
  "scraped_at": "2026-01-08T19:49:48.831847",
  "title": "Another vote for homeschooling",
  "date_display": "January 10, 2005",
  "date_iso": "2005-01-10T11:44:00+00:00",
  "date_from_url": "2005-01-10",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>Doug Giles surfs the trend:<br/></p><blockquote><p> <br>It’s been eleven months <a href=\"http://www.townhall.com/columnists/douggiles/dg20050108.shtml\">since we pulled our teenage daughters out of the public school system</a> and started to home school them, and I could kick myself for waiting so long. The educational, emotional, spiritual and physical progress they have made has been amazing.  Not that they were anti-intellectual psychologically teetering bloated decadent nut jobs before they started home schooling, it’s just that I’ve been ecstatically stunned at how they have aggressively embraced this new lease on their educational life….</br></p><p>My ClashPoint is this:  parent … home schooling isn’t as tough as you think it is.  With the advent of online virtual schools, plus the tens of thousands of people who have bailed out of the system, there are afforded to you, the home schooling parent and student, amazing resources, local networks of like-minded families and world-class curricula, to help you help yours be the leaders God intends for them to be.</p><p>Initially, I was a bit concerned about how home schooling was going to work within the insanity which is the Giles household, but it has been relatively painless.  The adjustments my wife and I have had to make to our routine to accommodate our daughters for greatness are far less painful than the worry and concern we had sending them off to the monkey jungle which is the Public School system.<br/></p></blockquote><p>Good on him and his girls.  It’s intriguing to see how conservatives are making a serious investment of time and effort in the future, while Republicans centralize, federalize and work towards ensuring that No Child is permitted to escape the educational gulag.</p><p>We’re not heading for a right-wing crackup per se, but it’s only a matter of time before people realize that the Republicans are actually 1960s Democrats.  This will be interesting.<br/></p></div>",
  "content_text": "Doug Giles surfs the trend:\nIt’s been eleven months\nsince we pulled our teenage daughters out of the public school system\nand started to home school them, and I could kick myself for waiting so long. The educational, emotional, spiritual and physical progress they have made has been amazing.  Not that they were anti-intellectual psychologically teetering bloated decadent nut jobs before they started home schooling, it’s just that I’ve been ecstatically stunned at how they have aggressively embraced this new lease on their educational life….\nMy ClashPoint is this:  parent … home schooling isn’t as tough as you think it is.  With the advent of online virtual schools, plus the tens of thousands of people who have bailed out of the system, there are afforded to you, the home schooling parent and student, amazing resources, local networks of like-minded families and world-class curricula, to help you help yours be the leaders God intends for them to be.\nInitially, I was a bit concerned about how home schooling was going to work within the insanity which is the Giles household, but it has been relatively painless.  The adjustments my wife and I have had to make to our routine to accommodate our daughters for greatness are far less painful than the worry and concern we had sending them off to the monkey jungle which is the Public School system.\nGood on him and his girls.  It’s intriguing to see how conservatives are making a serious investment of time and effort in the future, while Republicans centralize, federalize and work towards ensuring that No Child is permitted to escape the educational gulag.\nWe’re not heading for a right-wing crackup per se, but it’s only a matter of time before people realize that the Republicans are actually 1960s Democrats.  This will be interesting.",
  "tags": [],
  "categories": [],
  "sitemap_lastmod": "2005-01-10T11:44:00+00:00"
}