{
  "url": "https://voxday.net/2005/01/23/good-thing-hes-not-in-investments/",
  "scraped_at": "2026-01-08T19:51:09.670395",
  "title": "Good thing he’s not in investments",
  "date_display": "January 23, 2005",
  "date_iso": "2005-01-23T18:02:00+00:00",
  "date_from_url": "2005-01-23",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>I was poking around the blogroll and discovered this gem from <a href=\"http://baseballsavant.blogspot.com/\">the Baseball Savant</a>:<br/></p><blockquote><p> <br>My football predictions are: Colts over Pats; Jets over Steelers, Vikings over Eagles, and Rams over Falcons. Those seem farfetched, but I really think the Colts are due to beat New England and Big Ben has to lose at some point. Plus, I really like Herm Edwards and want him to do well against everyone he plays against except for the Colts. I have to admit some ulterior motives here in that if the Colts and Jets win, then the AFC Championship game would be in Indianapolis! Sweet! Without Terrell Owens, the Vikings have a very good chance at beating the Eagles. The Falcons just look to be a very average team despite their record.<br/></br></p></blockquote><p>Stick to baseball, my friend.  Stick to baseball.  I haven’t made any playoff picks, mostly because I’ve been busy and I hate to think about the end of the season, but I’d been expecting a Steelers-Eagles Super Bowl since the first Steeler-Patriot game this year.  The Eagles will shut down Mikey-Mike without too much trouble – they beat the Vikes while practically sleep-walking – so the only question is if Belicheck can come up with a plan to stop the Steelers running game.</p><p>Now, a week ago, I would have picked the Steelers, but last week was a powerful and timely reminder that Cowher is not a playoff coach, while Belicheck most certainly is.  Rothlisberger also came up small while Brady is easily the best big-game QB since Montana.</p><p>Patriots vs Eagles.</p><p>UPDATE – As I expected, no more, no less.  And on a related note, this tidbit from the Baseball Savant made me laugh: <em>Do I dare make more picks for this weekend? You betcha! I’ll go with the Steelers and Falcons! So I guess that means the Patriots and Eagles will face one another in the Super Bowl.</em> The Baseball Savant and his football picks remind me of my brother’s driving directions.  Ask him which way to go and do precisely the opposite.  You’ll get there every time.  He was rather bitter when I put this theory into practice once when we were lost, but he quit complaining when it became clear that it worked.</p><p>So, Savant, who do you like in the Super Bowl?<br/></p></div>",
  "content_text": "I was poking around the blogroll and discovered this gem from\nthe Baseball Savant\n:\nMy football predictions are: Colts over Pats; Jets over Steelers, Vikings over Eagles, and Rams over Falcons. Those seem farfetched, but I really think the Colts are due to beat New England and Big Ben has to lose at some point. Plus, I really like Herm Edwards and want him to do well against everyone he plays against except for the Colts. I have to admit some ulterior motives here in that if the Colts and Jets win, then the AFC Championship game would be in Indianapolis! Sweet! Without Terrell Owens, the Vikings have a very good chance at beating the Eagles. The Falcons just look to be a very average team despite their record.\nStick to baseball, my friend.  Stick to baseball.  I haven’t made any playoff picks, mostly because I’ve been busy and I hate to think about the end of the season, but I’d been expecting a Steelers-Eagles Super Bowl since the first Steeler-Patriot game this year.  The Eagles will shut down Mikey-Mike without too much trouble – they beat the Vikes while practically sleep-walking – so the only question is if Belicheck can come up with a plan to stop the Steelers running game.\nNow, a week ago, I would have picked the Steelers, but last week was a powerful and timely reminder that Cowher is not a playoff coach, while Belicheck most certainly is.  Rothlisberger also came up small while Brady is easily the best big-game QB since Montana.\nPatriots vs Eagles.\nUPDATE – As I expected, no more, no less.  And on a related note, this tidbit from the Baseball Savant made me laugh:\nDo I dare make more picks for this weekend? You betcha! I’ll go with the Steelers and Falcons! So I guess that means the Patriots and Eagles will face one another in the Super Bowl.\nThe Baseball Savant and his football picks remind me of my brother’s driving directions.  Ask him which way to go and do precisely the opposite.  You’ll get there every time.  He was rather bitter when I put this theory into practice once when we were lost, but he quit complaining when it became clear that it worked.\nSo, Savant, who do you like in the Super Bowl?",
  "tags": [],
  "categories": [],
  "sitemap_lastmod": "2005-01-23T18:02:00+00:00"
}