{
  "url": "https://voxday.net/2005/01/07/in-defense-of-mordor/",
  "scraped_at": "2026-01-08T19:49:29.439212",
  "title": "In defense of Mordor",
  "date_display": "January 7, 2005",
  "date_iso": "2005-01-07T19:10:00+00:00",
  "date_from_url": "2005-01-07",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><blockquote><p> <br>Zinn: I also think it is a spectacular display of bad manners to disappear at your own birthday party. And here, for the first time, Gandalf speaks to Bilbo about magic rings. Still, it is never clearly established why this one ring is so powerful. Everything used to justify that belief is legendary.</br></p><p>Chomsky: Gandalf is clearly wondering if it’s time to invoke his plan for the supposed revelation concerning the secret magic ring. <a href=\"http://www.frontpagemag.com/Articles/ReadArticle.asp?ID=16545\"> Why now?</a> Well, I think it’s because the people in Mordor — the Orcs, I’m speaking of — are starting to obtain some power, are starting to ask a little bit more from Middle Earth than Middle Earth has ever seen fit to give to them. And I don’t think it’s unreasonable for them to expect something back from Middle Earth. Of course, if that happened, the entire economy would be disrupted.</p><p>Zinn: The pipe-weed-based economy.</p><p>Chomsky: And, as you pointed out earlier, the military-industrial-complex that exists in Gondor. This constant state of alertness. This constant state of fear….<br/></p></blockquote><p>Good stuff.  Thanks, Michael.<br/></p></div>",
  "content_text": "Zinn: I also think it is a spectacular display of bad manners to disappear at your own birthday party. And here, for the first time, Gandalf speaks to Bilbo about magic rings. Still, it is never clearly established why this one ring is so powerful. Everything used to justify that belief is legendary.\nChomsky: Gandalf is clearly wondering if it’s time to invoke his plan for the supposed revelation concerning the secret magic ring.\nWhy now?\nWell, I think it’s because the people in Mordor — the Orcs, I’m speaking of — are starting to obtain some power, are starting to ask a little bit more from Middle Earth than Middle Earth has ever seen fit to give to them. And I don’t think it’s unreasonable for them to expect something back from Middle Earth. Of course, if that happened, the entire economy would be disrupted.\nZinn: The pipe-weed-based economy.\nChomsky: And, as you pointed out earlier, the military-industrial-complex that exists in Gondor. This constant state of alertness. This constant state of fear….\nGood stuff.  Thanks, Michael.",
  "tags": [],
  "categories": [],
  "sitemap_lastmod": "2005-01-07T19:10:00+00:00"
}