{
  "url": "https://voxday.net/2005/01/12/mailvox-jewish-hoo-ha/",
  "scraped_at": "2026-01-08T19:50:09.497725",
  "title": "Mailvox: Jewish hoo-ha",
  "date_display": "January 12, 2005",
  "date_iso": "2005-01-12T19:20:00+00:00",
  "date_from_url": "2005-01-12",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>One of the many folks with their panties in a bunch manages to stop foaming at the mouth long enough to try to make a case:<br/></p><blockquote><p> <br>1. Stating that Jews have self-destructive tendencies is expressing a negative opinion of Jews. It may be an opinion you feel is justified or unjustified, but it is a negative opinion about the population.<br/></br></p></blockquote><p>So, you are stating that no Jews have self-destructive tendencies?  That no Jewish leader has ever led his people into destruction?  A criticism of one Jew is a criticism of them all?  Those are interesting opinions.<br/></p><blockquote><p> <br>2. Expressing a negative opinion of Jews is being anti-Jew in every sense. Now, you may feel justified in being anti-Jew; this does not change the established truth that you are here being anti-Jew.<br/></br></p></blockquote><p>Ah, so can we likewise conclude that expressing a negative opinion of Christians is being anti-Christian? <a href=\"http://www.voxday.net/archive/2002/073002.html\">I am not anti-Jewish</a>, in fact, I am one of the few non-Jewish columnists to have been email-bombed by CAIR.  So it seems that the children of Jacob and the children of Ishmael may have something in common after all… an absolute inability to withstand even the slightest criticism.  Now, I am anti-ADL.  I am anti-Abe Foxman.  I am anti-Frank Rich.  I am anti-Eric Alterman.  But if you think I am a Jew hater, then you’d better flee America fast, because I am far more pro-Jew and pro-Israel than the normal non-Jewish American.<br/></p><blockquote><p> <br>3. The characteristics of the governing leadership of a given group of people is hardly ever a good indicator of the characteristics of the group.<br/></br></p></blockquote><p>If they claim to speak for the group and no other voices are heard, then what other conclusion can one reach?  Do any of you buy into the notion that it’s only the very small number of radical Muslim leaders who speak out that want to drive Israel into the sea and wipe out every Jew on the planet?  I don’t.<br/></p><blockquote><p> <br>3b. This is because even in a majority rules system, a given elected official usually has only about half the folks on their side, and usually those folks on their side have different reasons amongst themselves for having voted for the official.<br/></br></p></blockquote><p>Of course, not a single individual I’ve criticized recently or in the past is an elected official.  They are leaders of the community, some self-styled, no doubt, others with leadership roles embraced by the community.  I don’t know which is which, so feel free to educate me.  Of course, the fact that many of the outraged people posting below AGREE with Herr Spiegel’s unwarranted assertion that equating the millions of abortions with millions of murders in the Holocaust and the Stalin era is an insult to the Jewish victims of the Holocaust doesn’t exactly support your case here.  Is equating the Armenian genocide by Turks to the Holocaust also an insult?<br/></p><blockquote><p> <br>Both of us would be uncomfortable with assuming every American has the personality of George W. Bush (I’m supposing you’d hate to equate his style with the demeanor of all those frothing-at-the-mouth liberals.) This would be unfair to the parties being compared.<br/></br></p></blockquote><p>When did personality enter into it?  Self-destructive tendencies are inferred by actions, not ascribed to a personality.  And they belong to individuals, not groups.  I’m a von Mises guy, not a Marxist, which if you’re sufficiently educated should tell you all that you know about the likelihood of my focus being on a class of people.<br/></p><blockquote><p> <br>5. Since you assumed exactly that form of assumption with regard to the Jews, you have engaged in patent, by-the-books racism.<br/></br></p></blockquote><p>How so?  What racial stereotype did I perpetuate.  I can give you example after example of self-destructive behavior on the part of the Jewish minority.  I never said this has anything to do with racial tendencies, I specifically referred to poor leadership.  Bad generals get you killed, this is hardly a controversial idea.  Many Jews have died in Israel because of the foolish decision of every Israeli prime minister since the Olympic massacre to leave Arafat alone, just to give one example.<br/></p><blockquote><p> <br>6. Genocide targets an ethnicity. Abortion, even assuming your conceptualization of it, targets an age group, but not an ethnicity. Abortion is thus not genocide.<br/></br></p></blockquote><p>Fair enough.  Mass murder suffices in this case, then.  But the point remains, as you’d have a hard time explaining to the Bosnians or the Armenians that they weren’t victims of genocide.</p><p>If the behavior and attitude of these whacked-out commenters is the historical norm for Jews around the world, it’s not terribly hard to figure out why they have so few friends.  As I’ve written before, do the Jews have so few enemies that they need to create more?</p><p>Believe it or not, I’m truly not one of the people about whom you need to be concerned.  I even believe I have a religious obligation to defend the Jewish people from destruction.  But that does not mean that any one Jew, or any one Jewish group, is beyond criticism, quite the reverse.  Indeed, Jews would be wise to heed my words that <a href=\"http://www.voxday.net/archive/2004/010504.html\">attempts to control all aspects of the debate </a> concerning any issue that even potentially touches them is counterproductive.<br/></p></div>",
  "content_text": "One of the many folks with their panties in a bunch manages to stop foaming at the mouth long enough to try to make a case:\n1. Stating that Jews have self-destructive tendencies is expressing a negative opinion of Jews. It may be an opinion you feel is justified or unjustified, but it is a negative opinion about the population.\nSo, you are stating that no Jews have self-destructive tendencies?  That no Jewish leader has ever led his people into destruction?  A criticism of one Jew is a criticism of them all?  Those are interesting opinions.\n2. Expressing a negative opinion of Jews is being anti-Jew in every sense. Now, you may feel justified in being anti-Jew; this does not change the established truth that you are here being anti-Jew.\nAh, so can we likewise conclude that expressing a negative opinion of Christians is being anti-Christian?\nI am not anti-Jewish\n, in fact, I am one of the few non-Jewish columnists to have been email-bombed by CAIR.  So it seems that the children of Jacob and the children of Ishmael may have something in common after all… an absolute inability to withstand even the slightest criticism.  Now, I am anti-ADL.  I am anti-Abe Foxman.  I am anti-Frank Rich.  I am anti-Eric Alterman.  But if you think I am a Jew hater, then you’d better flee America fast, because I am far more pro-Jew and pro-Israel than the normal non-Jewish American.\n3. The characteristics of the governing leadership of a given group of people is hardly ever a good indicator of the characteristics of the group.\nIf they claim to speak for the group and no other voices are heard, then what other conclusion can one reach?  Do any of you buy into the notion that it’s only the very small number of radical Muslim leaders who speak out that want to drive Israel into the sea and wipe out every Jew on the planet?  I don’t.\n3b. This is because even in a majority rules system, a given elected official usually has only about half the folks on their side, and usually those folks on their side have different reasons amongst themselves for having voted for the official.\nOf course, not a single individual I’ve criticized recently or in the past is an elected official.  They are leaders of the community, some self-styled, no doubt, others with leadership roles embraced by the community.  I don’t know which is which, so feel free to educate me.  Of course, the fact that many of the outraged people posting below AGREE with Herr Spiegel’s unwarranted assertion that equating the millions of abortions with millions of murders in the Holocaust and the Stalin era is an insult to the Jewish victims of the Holocaust doesn’t exactly support your case here.  Is equating the Armenian genocide by Turks to the Holocaust also an insult?\nBoth of us would be uncomfortable with assuming every American has the personality of George W. Bush (I’m supposing you’d hate to equate his style with the demeanor of all those frothing-at-the-mouth liberals.) This would be unfair to the parties being compared.\nWhen did personality enter into it?  Self-destructive tendencies are inferred by actions, not ascribed to a personality.  And they belong to individuals, not groups.  I’m a von Mises guy, not a Marxist, which if you’re sufficiently educated should tell you all that you know about the likelihood of my focus being on a class of people.\n5. Since you assumed exactly that form of assumption with regard to the Jews, you have engaged in patent, by-the-books racism.\nHow so?  What racial stereotype did I perpetuate.  I can give you example after example of self-destructive behavior on the part of the Jewish minority.  I never said this has anything to do with racial tendencies, I specifically referred to poor leadership.  Bad generals get you killed, this is hardly a controversial idea.  Many Jews have died in Israel because of the foolish decision of every Israeli prime minister since the Olympic massacre to leave Arafat alone, just to give one example.\n6. Genocide targets an ethnicity. Abortion, even assuming your conceptualization of it, targets an age group, but not an ethnicity. Abortion is thus not genocide.\nFair enough.  Mass murder suffices in this case, then.  But the point remains, as you’d have a hard time explaining to the Bosnians or the Armenians that they weren’t victims of genocide.\nIf the behavior and attitude of these whacked-out commenters is the historical norm for Jews around the world, it’s not terribly hard to figure out why they have so few friends.  As I’ve written before, do the Jews have so few enemies that they need to create more?\nBelieve it or not, I’m truly not one of the people about whom you need to be concerned.  I even believe I have a religious obligation to defend the Jewish people from destruction.  But that does not mean that any one Jew, or any one Jewish group, is beyond criticism, quite the reverse.  Indeed, Jews would be wise to heed my words that\nattempts to control all aspects of the debate\nconcerning any issue that even potentially touches them is counterproductive.",
  "tags": [],
  "categories": [],
  "sitemap_lastmod": "2005-01-12T19:20:00+00:00"
}