{
  "url": "https://voxday.net/2005/01/04/mailvox-amusingly-dumb/",
  "scraped_at": "2026-01-08T19:49:14.768786",
  "title": "Mailvox: amusingly dumb",
  "date_display": "January 4, 2005",
  "date_iso": "2005-01-04T16:12:00+00:00",
  "date_from_url": "2005-01-04",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>Nils offers a sneering critique:<br/></p><blockquote><p> <br>An amusingly dumb posting. First off, it’s an example of the fallacy logicians call “petitio principi” — assuming what needs to be proven, namely that women have some distinct “nature” that makes them dislike work in a way different from men.</br></p><p>Secondly, let’s grant that this is true, then so what? The definition of civilization is the overcoming of nature? There’s nothing “natural” about clean running water, electricity, internal combustion engines, or any of the other appurtenances of civilization; that’s why we like these things. Overcoming nature is what civilized life is all about. A general word of caution: any time you hear someone invoke “human nature” as an argument for anything, you’re getting fed hogwash.<br/></p></blockquote><p>Right, there’s my traditional <em>petitio principi</em> opposed to the scientifically proven fact that women and men feel exactly the same way about everything and share all goals.  Speaking of amusingly dumb… anytime you hear human nature dismissed as irrelevant or nonexistent, be prepared to hear some glorious plan for the betterment of humanity that will a) involve centralized power, and, b) result in killing large quantities of people.  Human nature not only exists, it is more powerful than any ideology known to man.<br/></p><blockquote><p> <br>Third, empirically, does anyone know a single woman who actually provides nothing to her household but sex? No cooking, no cleaning, no changing of diapers? Or is changing diapers not work in Vox’s view? I’m sure he’ll be happy to do all these things<br/></br></p></blockquote><p>I’ve likely changed more diapers than almost any man here – including Nate – and more than most of the women as well.  It certainly isn’t work, anymore than cleaning up my office is work.  Raising children is the most important thing anyone can do, but it is extremely easy.  Most men, knowing nothing of it, are willing to buy into the myth of the belabored homemaker, those of us who actually have some experience of it know better.  The only difficult aspect is the stamina required, because there simply isn’t any time-off built into the equation.</p><p>That being said, the over-scheduling of children’s activities in modern America does tend to turn what should be a reasonable responsibility into a stress-filled nightmare of non-stop limousine service.<br/></p></div>",
  "content_text": "Nils offers a sneering critique:\nAn amusingly dumb posting. First off, it’s an example of the fallacy logicians call “petitio principi” — assuming what needs to be proven, namely that women have some distinct “nature” that makes them dislike work in a way different from men.\nSecondly, let’s grant that this is true, then so what? The definition of civilization is the overcoming of nature? There’s nothing “natural” about clean running water, electricity, internal combustion engines, or any of the other appurtenances of civilization; that’s why we like these things. Overcoming nature is what civilized life is all about. A general word of caution: any time you hear someone invoke “human nature” as an argument for anything, you’re getting fed hogwash.\nRight, there’s my traditional\npetitio principi\nopposed to the scientifically proven fact that women and men feel exactly the same way about everything and share all goals.  Speaking of amusingly dumb… anytime you hear human nature dismissed as irrelevant or nonexistent, be prepared to hear some glorious plan for the betterment of humanity that will a) involve centralized power, and, b) result in killing large quantities of people.  Human nature not only exists, it is more powerful than any ideology known to man.\nThird, empirically, does anyone know a single woman who actually provides nothing to her household but sex? No cooking, no cleaning, no changing of diapers? Or is changing diapers not work in Vox’s view? I’m sure he’ll be happy to do all these things\nI’ve likely changed more diapers than almost any man here – including Nate – and more than most of the women as well.  It certainly isn’t work, anymore than cleaning up my office is work.  Raising children is the most important thing anyone can do, but it is extremely easy.  Most men, knowing nothing of it, are willing to buy into the myth of the belabored homemaker, those of us who actually have some experience of it know better.  The only difficult aspect is the stamina required, because there simply isn’t any time-off built into the equation.\nThat being said, the over-scheduling of children’s activities in modern America does tend to turn what should be a reasonable responsibility into a stress-filled nightmare of non-stop limousine service.",
  "tags": [],
  "categories": [],
  "sitemap_lastmod": "2005-01-04T16:12:00+00:00"
}