{
  "url": "https://voxday.net/2009/07/05/and-this-is-case-for-defense/",
  "scraped_at": "2026-01-08T23:00:31.061362",
  "title": "And this is the case for the defense?",
  "date_display": "July 5, 2009",
  "date_iso": "2009-07-05T18:56:00+00:00",
  "date_from_url": "2009-07-05",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>The New York Times hosts an open debate on <a href=\"http://roomfordebate.blogs.nytimes.com/2009/07/04/my-ma-a-source-of-pride-and-regret/\">the value of a graduate degree</a>:</p><blockquote><p>“As an M.A. student in English, I don’t think I’ve met one person in my program, or one professor for that matter, who has expressed that he or she is “in it for the money.” In fact, most people, including myself, are there because they are genuinely interested in the subject matter, and in discourse with others who have similar interests…  For M.A. students like myself, the benefits have little to do with money.”</p><p>“What if knowledge itself is what you seek? Master’s of Arts and Liberal Arts degrees are not designed to get you a high paying career.”</p><p>“The reason I went for my MLA (graduated in June 1997) was because I was fascinated by the subject matter. Has it paid off for me financially? No. In fact, I am no longer even employed. I have never even paid off my student loans, nor do I believe that will ever happen. Do I regret earning that MLA? No….  Learning how to learn appears to be the single, greatest lesson one can learn in going for the advanced degree.”</p><p>“If you measure graduate degrees in dollars, mine Ph.D. is worthless. I earned less money with each graduate degree. If, however, you measure it in terms of quality of life, understanding of the world, personal satisfaction and the accomplishment of non-monetary goals, it is priceless.”</p></blockquote><p>One thing I’ve noticed is that no one contemplating spending thousands of dollars on a graduate degree ever admits that it’s of no probable monetary value BEFORE they make the decision to go to grad school.  Those who actually think the expense of a monetarily worthless graduate degree was worth it tend to fall into two categories.  The first are grad students still in school who are enjoying the process and have neither begun paying the costs nor genuinely understand the consequences of being deeper in debt with no marketable job skill.  I suppose that men utilizing the services of prostitutes also believe said services are worth the expense while in the midst of obtaining them.  But they may well think otherwise upon discovering that their wallet is missing, learning that the test results are positive, or being handcuffed and reminded of their rights.</p><p>The second type are the sort who believe that their personal enjoyment trumps all concerns about expense.  It should come as little surprise that these people usually also mention the importance of learning how to learn.  In other words, these are the individuals who are dumb enough to genuinely require at least 17 years in school in order to learn how to learn, so the value of their opinion is quite high if taken in the negative.</p><p>It’s fine if you genuinely enjoy taking classes so much that you’re willing to spend thousands of dollars on them.  But understand that doesn’t make you any different than someone who enjoys spending thousands of dollars on cars, drugs, or professional women.  The only significant difference is that the car, drug, or escort aficionado seldom believes he will become a better person through paying for his pleasures.</p><p>One of the saner, if sadder, perspectives on the matter was expressed by one recent purchaser of an advanced piece of paper from an advanced paper seller: <i>“As one of the many now-graduated, now-unemployed Masters of Fine Arts, I have felt that this great accomplishment is akin to opening up a nicely-wrapped gift box, only to discover that it was empty.”</i> Except, of course, it wasn’t exactly a gift….</p></div>",
  "content_text": "The New York Times hosts an open debate on\nthe value of a graduate degree\n:\n“As an M.A. student in English, I don’t think I’ve met one person in my program, or one professor for that matter, who has expressed that he or she is “in it for the money.” In fact, most people, including myself, are there because they are genuinely interested in the subject matter, and in discourse with others who have similar interests…  For M.A. students like myself, the benefits have little to do with money.”\n“What if knowledge itself is what you seek? Master’s of Arts and Liberal Arts degrees are not designed to get you a high paying career.”\n“The reason I went for my MLA (graduated in June 1997) was because I was fascinated by the subject matter. Has it paid off for me financially? No. In fact, I am no longer even employed. I have never even paid off my student loans, nor do I believe that will ever happen. Do I regret earning that MLA? No….  Learning how to learn appears to be the single, greatest lesson one can learn in going for the advanced degree.”\n“If you measure graduate degrees in dollars, mine Ph.D. is worthless. I earned less money with each graduate degree. If, however, you measure it in terms of quality of life, understanding of the world, personal satisfaction and the accomplishment of non-monetary goals, it is priceless.”\nOne thing I’ve noticed is that no one contemplating spending thousands of dollars on a graduate degree ever admits that it’s of no probable monetary value BEFORE they make the decision to go to grad school.  Those who actually think the expense of a monetarily worthless graduate degree was worth it tend to fall into two categories.  The first are grad students still in school who are enjoying the process and have neither begun paying the costs nor genuinely understand the consequences of being deeper in debt with no marketable job skill.  I suppose that men utilizing the services of prostitutes also believe said services are worth the expense while in the midst of obtaining them.  But they may well think otherwise upon discovering that their wallet is missing, learning that the test results are positive, or being handcuffed and reminded of their rights.\nThe second type are the sort who believe that their personal enjoyment trumps all concerns about expense.  It should come as little surprise that these people usually also mention the importance of learning how to learn.  In other words, these are the individuals who are dumb enough to genuinely require at least 17 years in school in order to learn how to learn, so the value of their opinion is quite high if taken in the negative.\nIt’s fine if you genuinely enjoy taking classes so much that you’re willing to spend thousands of dollars on them.  But understand that doesn’t make you any different than someone who enjoys spending thousands of dollars on cars, drugs, or professional women.  The only significant difference is that the car, drug, or escort aficionado seldom believes he will become a better person through paying for his pleasures.\nOne of the saner, if sadder, perspectives on the matter was expressed by one recent purchaser of an advanced piece of paper from an advanced paper seller:\n“As one of the many now-graduated, now-unemployed Masters of Fine Arts, I have felt that this great accomplishment is akin to opening up a nicely-wrapped gift box, only to discover that it was empty.”\nExcept, of course, it wasn’t exactly a gift….",
  "tags": [],
  "categories": [],
  "sitemap_lastmod": "2009-07-05T17:56:00+00:00"
}