{
  "url": "https://voxday.net/2009/07/10/assuming-alpha/",
  "scraped_at": "2026-01-08T23:00:54.055384",
  "title": "Assuming alpha",
  "date_display": "July 10, 2009",
  "date_iso": "2009-07-10T14:34:00+00:00",
  "date_from_url": "2009-07-10",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>It’s been said that every twenty years, civilization is invaded by a new set of barbarians that require taming.  Ironically, a day after posting about the attack of the mad teacher – he was provoked, as some commenters imagined, although hardly in a manner that could justify<a href=\"http://www.telegraph.co.uk/news/newstopics/politics/lawandorder/5788057/Teacher-questioned-on-suspicion-of-attempted-murder.html\"> bashing someone’s skull in</a> with a weight – I had my own run-in with a pack of six or seven little bastards at a water slide.</p><p>These boys were 13 or so and they were showing no respect for the civilized convention known as “waiting in line”.  They kept pushing past all the smaller kids and the one or two women in line; when anyone protested one would plaintively claim that they were merely going ahead in order to join his mama.  Ha very ha.  They did this repeatedly, going up the stone steps and down the slide, until finally they attempted to pass me.</p><p>When I told them that there was a line and they could wait like everyone else, the two leaders just smirked and pushed past on either side of me.  So, I reached out, grabbed each of them by the back of the neck,and physically placed them behind me on the step below, then turned around and repeated what I’d just said.  One of them whined that I should calm down, although I hadn’t raised my voice at all, but he ceased his whining when I calmly explained to him that I was perfectly calm and that if, in fact, I was not calm, I would have already thrown him over the nearby fence to the ground a few meters below.</p><p>Based on the widened eyes of the two boys, this appeared to have the desired effect.  I was just irritated enough with the little bastards that it’s possible they may have mistakenly perceived I was looking for an excuse to drop the hammer on them, which was not the case.  Interestingly enough, the little pack elected to make that their final trip down the slide and they went off to pursue other activities at the park instead.  A small victory for the forces of civilization, perhaps, but a victory nonetheless.</p></div>",
  "content_text": "It’s been said that every twenty years, civilization is invaded by a new set of barbarians that require taming.  Ironically, a day after posting about the attack of the mad teacher – he was provoked, as some commenters imagined, although hardly in a manner that could justify\nbashing someone’s skull in\nwith a weight – I had my own run-in with a pack of six or seven little bastards at a water slide.\nThese boys were 13 or so and they were showing no respect for the civilized convention known as “waiting in line”.  They kept pushing past all the smaller kids and the one or two women in line; when anyone protested one would plaintively claim that they were merely going ahead in order to join his mama.  Ha very ha.  They did this repeatedly, going up the stone steps and down the slide, until finally they attempted to pass me.\nWhen I told them that there was a line and they could wait like everyone else, the two leaders just smirked and pushed past on either side of me.  So, I reached out, grabbed each of them by the back of the neck,and physically placed them behind me on the step below, then turned around and repeated what I’d just said.  One of them whined that I should calm down, although I hadn’t raised my voice at all, but he ceased his whining when I calmly explained to him that I was perfectly calm and that if, in fact, I was not calm, I would have already thrown him over the nearby fence to the ground a few meters below.\nBased on the widened eyes of the two boys, this appeared to have the desired effect.  I was just irritated enough with the little bastards that it’s possible they may have mistakenly perceived I was looking for an excuse to drop the hammer on them, which was not the case.  Interestingly enough, the little pack elected to make that their final trip down the slide and they went off to pursue other activities at the park instead.  A small victory for the forces of civilization, perhaps, but a victory nonetheless.",
  "tags": [],
  "categories": [],
  "sitemap_lastmod": "2009-07-10T13:34:00+00:00"
}