{
  "url": "https://voxday.net/2009/07/27/atheism-and-aspergers-syndrome/",
  "scraped_at": "2026-01-08T23:02:24.723076",
  "title": "Atheism and Asperger’s syndrome",
  "date_display": "July 27, 2009",
  "date_iso": "2009-07-27T14:30:00+00:00",
  "date_from_url": "2009-07-27",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p><a href=\"http://timesonline.typepad.com/science/2009/07/aspergers-syndrome-the-eyes-have-it.html#c6a00d83451586c69e201157239a40d970b\">This English study</a> of people with Asperger’s syndrome practically describes Sam Harris’s Reason Project:</p><blockquote><p>The suggestion is that people with Asperger’s syndrome do have difficulties with theory of mind: unlike those of us with neurotypical brains, they lack the ability to jump straight to the right decision, almost as a matter of instinct. What they seem to do instead is <i>to work out other people’s beliefs and intentions by means of logical reasoning</i>. As Professor Frith told me, this could easily explain some of the social awkwardness of people with Asperger’s.</p></blockquote><p>Now, there’s nothing wrong with either logic or people with Asperger’s syndrome.  But this study does help explain the exasperating inability of atheists, particularly militant atheists such as the New Atheists, to understand the beliefs and intentions of the neurotypical religious majority of the people on the planet.</p><p>The fact that a scientific non-entity such as Harris <a href=\"http://www.nytimes.com/2009/07/27/opinion/27harris.html?_r=1&amp;pagewanted=all\">would think to publicly question the ability of a scientist</a>, whose scientific credentials are impeccable, to direct the National Institutes of Health on the sole basis of his unexceptional religious beliefs suggests the real possibility of a link between his atheism and a material brain handicap.  Ironically, the theory of atheism as the manifestation of a physical phenomenon fits very well with Harris’s own neuroscientific perspective.</p><p>It also helps explain the observable gap between the average atheist’s reliance on logic and his ability to make competent use of it.</p></div>",
  "content_text": "This English study\nof people with Asperger’s syndrome practically describes Sam Harris’s Reason Project:\nThe suggestion is that people with Asperger’s syndrome do have difficulties with theory of mind: unlike those of us with neurotypical brains, they lack the ability to jump straight to the right decision, almost as a matter of instinct. What they seem to do instead is\nto work out other people’s beliefs and intentions by means of logical reasoning\n. As Professor Frith told me, this could easily explain some of the social awkwardness of people with Asperger’s.\nNow, there’s nothing wrong with either logic or people with Asperger’s syndrome.  But this study does help explain the exasperating inability of atheists, particularly militant atheists such as the New Atheists, to understand the beliefs and intentions of the neurotypical religious majority of the people on the planet.\nThe fact that a scientific non-entity such as Harris\nwould think to publicly question the ability of a scientist\n, whose scientific credentials are impeccable, to direct the National Institutes of Health on the sole basis of his unexceptional religious beliefs suggests the real possibility of a link between his atheism and a material brain handicap.  Ironically, the theory of atheism as the manifestation of a physical phenomenon fits very well with Harris’s own neuroscientific perspective.\nIt also helps explain the observable gap between the average atheist’s reliance on logic and his ability to make competent use of it.",
  "tags": [],
  "categories": [],
  "sitemap_lastmod": "2009-07-27T13:30:00+00:00"
}