{
  "url": "https://voxday.net/2009/07/25/bank-failures-picking-up-pace/",
  "scraped_at": "2026-01-08T23:02:11.394671",
  "title": "Bank Failures: picking up the pace",
  "date_display": "July 25, 2009",
  "date_iso": "2009-07-25T07:57:00+00:00",
  "date_from_url": "2009-07-25",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>Only two weeks ago, I estimated that bank failures calculated <a href=\"http://www.wnd.com/index.php?pageId=103763\">as a percentage of total deposits</a> would be more than twice that of 1931.  My estimate of 0.77 percent was actually a slight exaggeration of that which would be a straightforward doubling of the January-June total, since it included bank failures 46 through 52 that were actually reported on July 2nd.  Therefore, from a strict calender perspective, they should not have been included in the failures of the first six months.</p><p>My reasons for stretching the period for two days to include those additional seven banks were twofold.  First, the FDIC always reports bank failures at the end of the day on Friday, so it’s probable that most of those seven banks actually filed their paperwork prior to the end of June.  Second, because the pace of the failures <a href=\"http://4.bp.blogspot.com/_pMscxxELHEg/Sk4YfCQnqGI/AAAAAAAAFvc/TmFxaeUXWQA/s1600-h/BankFailuresPerWeek.jpg\">appears to be increasing</a>, leaving them out would have led to an estimate that was likely to be too low.</p><p>This was almost certainly the right decision because with one Bank Failure Friday still left in July, one bank has failed for each of the twelve days since the column was published on July 13th.  These 64 failed banks held deposits sufficient to bring the running total to $34.9 billion for the year; when multiplied by 12/7, this indicates a 2009 deposit failure rate of 0.79 percent.  Furthermore, the shaky state of the $7.6 billion Corus Bank and <a href=\"http://www.dallasnews.com/sharedcontent/dws/bus/stories/072409dnbusguaranty.3bfc4f2.html\">the $14 billion Guaranty Financial Group</a> strongly suggests that failed deposits will exceed one percent of the $7.6 trillion in total bank deposits by the end of the year.  This would be more than THREE times the percentage of failed deposits in 1931.</p><p>I have to admit, I always find it to be a little ominous when my alarmingly bearish observations turn out to be <i>too optimistic</i>.</p></div>",
  "content_text": "Only two weeks ago, I estimated that bank failures calculated\nas a percentage of total deposits\nwould be more than twice that of 1931.  My estimate of 0.77 percent was actually a slight exaggeration of that which would be a straightforward doubling of the January-June total, since it included bank failures 46 through 52 that were actually reported on July 2nd.  Therefore, from a strict calender perspective, they should not have been included in the failures of the first six months.\nMy reasons for stretching the period for two days to include those additional seven banks were twofold.  First, the FDIC always reports bank failures at the end of the day on Friday, so it’s probable that most of those seven banks actually filed their paperwork prior to the end of June.  Second, because the pace of the failures\nappears to be increasing\n, leaving them out would have led to an estimate that was likely to be too low.\nThis was almost certainly the right decision because with one Bank Failure Friday still left in July, one bank has failed for each of the twelve days since the column was published on July 13th.  These 64 failed banks held deposits sufficient to bring the running total to $34.9 billion for the year; when multiplied by 12/7, this indicates a 2009 deposit failure rate of 0.79 percent.  Furthermore, the shaky state of the $7.6 billion Corus Bank and\nthe $14 billion Guaranty Financial Group\nstrongly suggests that failed deposits will exceed one percent of the $7.6 trillion in total bank deposits by the end of the year.  This would be more than THREE times the percentage of failed deposits in 1931.\nI have to admit, I always find it to be a little ominous when my alarmingly bearish observations turn out to be\ntoo optimistic\n.",
  "tags": [],
  "categories": [],
  "sitemap_lastmod": "2009-07-25T06:57:00+00:00"
}