{
  "url": "https://voxday.net/2009/07/03/but-its-investmen/",
  "scraped_at": "2026-01-08T23:00:20.026650",
  "title": "But it’s aninvestment!",
  "date_display": "July 3, 2009",
  "date_iso": "2009-07-03T10:24:00+00:00",
  "date_from_url": "2009-07-03",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>I believe most regular readers are familiar with my opinion that taking out student loans in order to obtain pieces of paper from paper-selling institutions is usually a remarkably stupid idea.  However, even those who think equate spending on education with investment must admit that the utility of the concept <a href=\"http://www.nytimes.com/2009/07/02/business/02lawyer.html?em\">has its limits</a>:</p><blockquote><p>Robert Bowman was refused entry to the New York bar because of $400,000 in student debt….  “The size of this account is extremely unusual, but not surprising given that the customer took out 32 loans to pursue undergraduate, law and masters of law studies and has not made a single monthly payment over his 26-year student loan history,” Ms. Holler said.</p></blockquote><p>Doesn’t the New York bar know that that studies show people with graduate degrees make loads more money over their lifetime?  With an investment of $400,000 in Mr. Bowman’s education, surely he’ll be worth hundreds of millions soon!</p><p>As if this story wasn’t amusing enough, one can only wonder what Mr. Bowman would have to do in order to sufficiently establish: “the character and general fitness requisite for an attorney and counselor-at-law”.  Murder his mother with an axe?  Rape a baby seal?  Run an underage gay prostitution ring?</p></div>",
  "content_text": "I believe most regular readers are familiar with my opinion that taking out student loans in order to obtain pieces of paper from paper-selling institutions is usually a remarkably stupid idea.  However, even those who think equate spending on education with investment must admit that the utility of the concept\nhas its limits\n:\nRobert Bowman was refused entry to the New York bar because of $400,000 in student debt….  “The size of this account is extremely unusual, but not surprising given that the customer took out 32 loans to pursue undergraduate, law and masters of law studies and has not made a single monthly payment over his 26-year student loan history,” Ms. Holler said.\nDoesn’t the New York bar know that that studies show people with graduate degrees make loads more money over their lifetime?  With an investment of $400,000 in Mr. Bowman’s education, surely he’ll be worth hundreds of millions soon!\nAs if this story wasn’t amusing enough, one can only wonder what Mr. Bowman would have to do in order to sufficiently establish: “the character and general fitness requisite for an attorney and counselor-at-law”.  Murder his mother with an axe?  Rape a baby seal?  Run an underage gay prostitution ring?",
  "tags": [],
  "categories": [],
  "sitemap_lastmod": "2009-07-03T09:24:00+00:00"
}