{
  "url": "https://voxday.net/2009/07/31/certificate-and-certification/",
  "scraped_at": "2026-01-08T23:02:46.115749",
  "title": "Certificate and Certification",
  "date_display": "July 31, 2009",
  "date_iso": "2009-07-31T08:30:00+00:00",
  "date_from_url": "2009-07-31",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>NRO Contributing Editor Andy McCarthy <a href=\"http://article.nationalreview.com/print/?q=ZmJhMzlmZWFhOTQ3YjUxMDE2YWY4ZDMzZjZlYTVmZmU=\">corrects National Review’s error</a> regarding the Obama birth certificate:</p><blockquote><p>The relevance of information related to the birth of our 44th president is not limited to his eligibility to be our 44th president. On this issue, NRO’s editorial has come in for some blistering criticism. The editorial argues:</p><p><i>The fundamental fiction is that Obama has refused to release his “real” birth certificate. This is untrue. The document that Obama has made available is the document that Hawaiian authorities issue when they are asked for a birth certificate. There is no secondary document cloaked in darkness, only the state records that are used to generate birth certificates when they are requested.</i></p><p>On reflection, I think this was an ill-considered assertion….  To summarize: What Obama has made available is a Hawaiian <i>“certification of live birth”</i> (emphasis added), not a birth certificate (or what the state calls a “certificate of live birth”). The certification form provides a short, very general attestation of a few facts about the person’s birth: name and sex of the newborn; date and time of birth; city or town of birth, along with the name of the Hawaiian island and the county; the mother’s maiden name and race; the father’s name and race; and the date the certification was filed. This certification is not the same thing as the certificate, which is what I believe we were referring to in the editorial as “the state records that are used to generate birth certificates [sic] when they are requested.”</p><p>To the contrary, “the state records” are the certificate. They are used to generate the more limited birth certifications on request. As the Jeffers post shows, these state records are far more detailed. They include, for example, the name of the hospital, institution, or street address where the birth occurred; the full name, age, birthplace, race, and occupation of each parent; the mother’s residential address (and whether that address is within the city or town of birth); the signature of at least one parent (or “informant”) attesting to the accuracy of the information provided; the identity and signature of an attending physician (or other “attendant”) who certifies the occurrence of a live birth at the time and place specified; and the identity and signature of the local registrar who filed the birth record.</p></blockquote><p>It’s good to see someone at NRO setting the matter straight.  As for Certifigate, it just keeps getting curiouser and curiouser….</p></div>",
  "content_text": "NRO Contributing Editor Andy McCarthy\ncorrects National Review’s error\nregarding the Obama birth certificate:\nThe relevance of information related to the birth of our 44th president is not limited to his eligibility to be our 44th president. On this issue, NRO’s editorial has come in for some blistering criticism. The editorial argues:\nThe fundamental fiction is that Obama has refused to release his “real” birth certificate. This is untrue. The document that Obama has made available is the document that Hawaiian authorities issue when they are asked for a birth certificate. There is no secondary document cloaked in darkness, only the state records that are used to generate birth certificates when they are requested.\nOn reflection, I think this was an ill-considered assertion….  To summarize: What Obama has made available is a Hawaiian\n“certification of live birth”\n(emphasis added), not a birth certificate (or what the state calls a “certificate of live birth”). The certification form provides a short, very general attestation of a few facts about the person’s birth: name and sex of the newborn; date and time of birth; city or town of birth, along with the name of the Hawaiian island and the county; the mother’s maiden name and race; the father’s name and race; and the date the certification was filed. This certification is not the same thing as the certificate, which is what I believe we were referring to in the editorial as “the state records that are used to generate birth certificates [sic] when they are requested.”\nTo the contrary, “the state records” are the certificate. They are used to generate the more limited birth certifications on request. As the Jeffers post shows, these state records are far more detailed. They include, for example, the name of the hospital, institution, or street address where the birth occurred; the full name, age, birthplace, race, and occupation of each parent; the mother’s residential address (and whether that address is within the city or town of birth); the signature of at least one parent (or “informant”) attesting to the accuracy of the information provided; the identity and signature of an attending physician (or other “attendant”) who certifies the occurrence of a live birth at the time and place specified; and the identity and signature of the local registrar who filed the birth record.\nIt’s good to see someone at NRO setting the matter straight.  As for Certifigate, it just keeps getting curiouser and curiouser….",
  "tags": [],
  "categories": [],
  "sitemap_lastmod": "2009-07-31T07:30:00+00:00"
}