{
  "url": "https://voxday.net/2009/07/29/conservatives-and-certifigate/",
  "scraped_at": "2026-01-08T23:02:35.442044",
  "title": "“Conservatives” and Certifigate",
  "date_display": "July 29, 2009",
  "date_iso": "2009-07-29T14:15:00+00:00",
  "date_from_url": "2009-07-29",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>It is truly amazing how many nominally “conservative” media figures are running interference for Barrack Obama, especially considering how many of them demonstrably don’t know what they’re talking about.  And Joseph Farah would surely have added National Review to the list had they published their editorial before he wrote <a href=\"http://www.wnd.com/index.php?fa=PAGE.view&amp;pageId=105259\">his column on the non-issue that everyone is talking about</a> today:</p><blockquote><p>Have you noticed the way the rest of the media discusses the Barack Obama eligibility story?  Everyone from Ann Coulter and Michael Medved and Neal Boortz on the right to Geraldo Rivera and Chris Matthews and CNN’s heretofore unknown president want you to know there’s nothing to talk about here.</p><p>But yet they keep on talking about it. And they never really explain why they are talking about it and why it’s not worth talking about – other than the fact that it’s all been researched before and Barack Obama really is a “natural born citizen.”</p></blockquote><p>This is why I love writing for WND.  They may be a little crazy at times, and their site isn’t exactly a paragon of beautiful design, but I very much admire the way they absolutely refuse to kiss the posteriors of those in power.  WND’s reporters continue to uncover more and more details that show the official Obama story to be increasingly improbable.</p><p>And much respect for Lou Dobbs, too, who told not only his fellow Democrats, but even his boss at CNN, that he has no intention of backing off until Obama shows his birth certificate, by which he means <a href=\"http://www.wnd.com/index.php?fa=PAGE.view&amp;pageId=105347\">the LONG-FORM CERTIFICATE</a> of live birth, complete with the name of the hospital, the name of the attending physician, name and address of the parents, the race of the parents and the race of the baby.  And speaking of which, yet another anomaly has surfaced, this time the fact that two children born at Kapi’olani after Obama was supposedly born have a lower number on their birth certificates from the state registrar than he does on his birth <i>certification</i>.  This proves nothing – yet – but raises further questions.</p><p>And how astonishingly stupid does CNN’s Jon Klein have to be to insist that all the original Hawaiian records were destroyed?  It probably took WND about two minutes to have a Hawaiian go and request their own documents from the state in order to prove him wrong.  Speaking of stupid, those media “conservatives” would do well to look at how Brave Sir Bill’s assertion that the birth certificate issue is “bogus” <a href=\"http://forums.wnd.com/index.php?pageId=500&amp;pollShowResults=1\">is going over</a> with readers from their primary market.</p><p>And for those moronic Democrats who feign to be happy that this “distraction” is somehow helping Mr. Soetoro, (seriously, when has that sad excuse for a tactic EVER worked), I would encourage you to look at the way his approval ratings have changed since WND kicked its “Where’s the Birth Certificate” campaign into high gear on June 12th.  If the campaign is really helping him, then you had better beg Mr. Farah to continue it, because at this precipitous decline, he’ll be driven from office if it stops.</p><p><a href=\"http://1.bp.blogspot.com/_3UXl0oMYPLs/SnAyY1yvcGI/AAAAAAAAAJk/8BlA8IvyC74/s1600-h/Obama7-26.jpg\" onblur=\"try {parent.deselectBloggerImageGracefully();} catch(e) {}\"><noscript><img alt=\"\" border=\"0\" decoding=\"async\" id=\"BLOGGER_PHOTO_ID_5363842558536413282\" src=\"http://www.milobookclub.com/wp-content/uploads/2009/07/Obama7-26.jpg\" style=\"display:block; margin:0px auto 10px; text-align:center;cursor:pointer; cursor:hand;width: 351px; height: 400px;\"/></noscript><img alt=\"\" border=\"0\" class=\"lazyload\" data-src=\"http://www.milobookclub.com/wp-content/uploads/2009/07/Obama7-26.jpg\" decoding=\"async\" id=\"BLOGGER_PHOTO_ID_5363842558536413282\" src=\"data:image/svg+xml,%3Csvg%20xmlns=%22http://www.w3.org/2000/svg%22%20viewBox=%220%200%20210%20140%22%3E%3C/svg%3E\" style=\"display:block; margin:0px auto 10px; text-align:center;cursor:pointer; cursor:hand;width: 351px; height: 400px;\"/></a></p></div>",
  "content_text": "It is truly amazing how many nominally “conservative” media figures are running interference for Barrack Obama, especially considering how many of them demonstrably don’t know what they’re talking about.  And Joseph Farah would surely have added National Review to the list had they published their editorial before he wrote\nhis column on the non-issue that everyone is talking about\ntoday:\nHave you noticed the way the rest of the media discusses the Barack Obama eligibility story?  Everyone from Ann Coulter and Michael Medved and Neal Boortz on the right to Geraldo Rivera and Chris Matthews and CNN’s heretofore unknown president want you to know there’s nothing to talk about here.\nBut yet they keep on talking about it. And they never really explain why they are talking about it and why it’s not worth talking about – other than the fact that it’s all been researched before and Barack Obama really is a “natural born citizen.”\nThis is why I love writing for WND.  They may be a little crazy at times, and their site isn’t exactly a paragon of beautiful design, but I very much admire the way they absolutely refuse to kiss the posteriors of those in power.  WND’s reporters continue to uncover more and more details that show the official Obama story to be increasingly improbable.\nAnd much respect for Lou Dobbs, too, who told not only his fellow Democrats, but even his boss at CNN, that he has no intention of backing off until Obama shows his birth certificate, by which he means\nthe LONG-FORM CERTIFICATE\nof live birth, complete with the name of the hospital, the name of the attending physician, name and address of the parents, the race of the parents and the race of the baby.  And speaking of which, yet another anomaly has surfaced, this time the fact that two children born at Kapi’olani after Obama was supposedly born have a lower number on their birth certificates from the state registrar than he does on his birth\ncertification\n.  This proves nothing – yet – but raises further questions.\nAnd how astonishingly stupid does CNN’s Jon Klein have to be to insist that all the original Hawaiian records were destroyed?  It probably took WND about two minutes to have a Hawaiian go and request their own documents from the state in order to prove him wrong.  Speaking of stupid, those media “conservatives” would do well to look at how Brave Sir Bill’s assertion that the birth certificate issue is “bogus”\nis going over\nwith readers from their primary market.\nAnd for those moronic Democrats who feign to be happy that this “distraction” is somehow helping Mr. Soetoro, (seriously, when has that sad excuse for a tactic EVER worked), I would encourage you to look at the way his approval ratings have changed since WND kicked its “Where’s the Birth Certificate” campaign into high gear on June 12th.  If the campaign is really helping him, then you had better beg Mr. Farah to continue it, because at this precipitous decline, he’ll be driven from office if it stops.",
  "tags": [],
  "categories": [],
  "sitemap_lastmod": "2009-07-29T13:15:00+00:00"
}