{
  "url": "https://voxday.net/2009/07/02/done-sort-of/",
  "scraped_at": "2026-01-08T23:00:14.299737",
  "title": "Done, sort of",
  "date_display": "July 2, 2009",
  "date_iso": "2009-07-02T00:34:00+00:00",
  "date_from_url": "2009-07-02",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>After what in retrospect looks like a ludicrously short period of time, the first draft of the new book is now in to the publisher.  I’ll be sending out chapters to proofreaders tomorrow, in case you volunteered and were wondering why I hadn’t sent you anything yet.  There’s still the whole editing process to go through yet, to say nothing of the various appendices, but it’s still nice to feel as if one of the major milestones is in the rear view mirror.</p><p>UPDATE – of course, this exchange of emails may not bode so well for its mass appeal:</p><blockquote><p><i>At the cajoling of DC, I’m writing to you about the post “laughing at myself.”  We were talking about it last night, and DC said that it went well above his understanding of economics.  I said, “Oh yeah.  I read the first sentence and looked at the chart and tried again… looked at the chart, decided math was hard and went to look at kittens.”  When DC started breathing again after laughing himself silly, he told me to email that you and that it was a new level of economic geekdom that we just didn’t get.</i></p><p>I have no idea who this broad is or what she’s talking about.  I’m assuming she’s some crazy woman with a bunch of cats.  I can tell you for certain that I often encourage people to do things.  Sometimes I even persuade.  But I have never, ever cajoled anyone.  (I’m not even sure what that means but it sounds dirty.)  Also, I find your boring, laborious, snooze-fest posts on economics down-right inspiring.  As a good sycophant, when I start to nod off while trying to finish one, I assume it must be because I’m stupid and my priorities are wrong.  It’s just a reminder that I’m not yet perfect and I need to work harder at being like you.</p></blockquote><p>Clearly I need some better sycophants.  Or at least some smarter ones.  And contra the notion that the new book will be a complete snoozefest, I think I can probably guarantee it will be the only one of its kind containing a quote about collecting morning dew in human skulls <a href=\"http://www.theonion.com/content/video/are_violent_video_games\">during the post-apocalypse</a>.</p></div>",
  "content_text": "After what in retrospect looks like a ludicrously short period of time, the first draft of the new book is now in to the publisher.  I’ll be sending out chapters to proofreaders tomorrow, in case you volunteered and were wondering why I hadn’t sent you anything yet.  There’s still the whole editing process to go through yet, to say nothing of the various appendices, but it’s still nice to feel as if one of the major milestones is in the rear view mirror.\nUPDATE – of course, this exchange of emails may not bode so well for its mass appeal:\nAt the cajoling of DC, I’m writing to you about the post “laughing at myself.”  We were talking about it last night, and DC said that it went well above his understanding of economics.  I said, “Oh yeah.  I read the first sentence and looked at the chart and tried again… looked at the chart, decided math was hard and went to look at kittens.”  When DC started breathing again after laughing himself silly, he told me to email that you and that it was a new level of economic geekdom that we just didn’t get.\nI have no idea who this broad is or what she’s talking about.  I’m assuming she’s some crazy woman with a bunch of cats.  I can tell you for certain that I often encourage people to do things.  Sometimes I even persuade.  But I have never, ever cajoled anyone.  (I’m not even sure what that means but it sounds dirty.)  Also, I find your boring, laborious, snooze-fest posts on economics down-right inspiring.  As a good sycophant, when I start to nod off while trying to finish one, I assume it must be because I’m stupid and my priorities are wrong.  It’s just a reminder that I’m not yet perfect and I need to work harder at being like you.\nClearly I need some better sycophants.  Or at least some smarter ones.  And contra the notion that the new book will be a complete snoozefest, I think I can probably guarantee it will be the only one of its kind containing a quote about collecting morning dew in human skulls\nduring the post-apocalypse\n.",
  "tags": [],
  "categories": [],
  "sitemap_lastmod": "2009-07-01T23:34:00+00:00"
}