{
  "url": "https://voxday.net/2009/07/01/education-bubble/",
  "scraped_at": "2026-01-08T23:00:10.602446",
  "title": "The education bubble",
  "date_display": "July 1, 2009",
  "date_iso": "2009-07-01T12:43:00+00:00",
  "date_from_url": "2009-07-01",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>A professor from Columbia and others warn of <a href=\"http://roomfordebate.blogs.nytimes.com/2009/06/30/what-is-a-masters-degree-worth/\">the financial danger of pursuing degrees</a>:</p><blockquote><p>The next bubble to burst will be the education bubble. Make no mistake about it, education is big business and, like other big businesses, it is in big trouble. What people outside the education bubble don’t realize and people inside won’t admit is that many colleges and universities are in the same position that major banks and financial institutions are: their assets (endowments down 30-40 percent this year) are plummeting, their liabilities (debts) are growing, most of their costs are fixed and rising, and their income (return on investments, support from government and private donations, etc.) is falling.  This is hardly a prescription for financial success….  And now the economy makes matters worse. Only 19 percent of the class of 2009 had jobs at graduation.</p></blockquote><p>The problem with most analysis of the value of a college or graduate degree is that the aggregate figures include the sharks graduating from the elite schools – many of whom would have been just as successful without their degrees – and then attempt to apply it to Jane Average who is planning to attend Podunk State.  Many years ago, I read a book called <i>Class</i>.  It was a pretty funny book, but one point that I remembered was the citation of a study which showed that unless you obtained it from a university that had been established prior to some date in the nineteenth century, your degree wouldn’t add anything to your expected lifetime income.  Perhaps the figures have changed in the intervening 25 years or so, but if more than 80 percent of the 2009 graduates are still unemployed, it’s pretty obvious that a degree is not the obvious choice it was once considered to be.</p><p>Which makes sense.  The <a href=\"http://upload.wikimedia.org/wikipedia/en/0/03/Educational_attainment.jpg\">supply of college graduates</a> has nearly quadrupled since 1950 and the limits of the demand for them has been exceeded.  Therefore their price is bound to decline.</p></div>",
  "content_text": "A professor from Columbia and others warn of\nthe financial danger of pursuing degrees\n:\nThe next bubble to burst will be the education bubble. Make no mistake about it, education is big business and, like other big businesses, it is in big trouble. What people outside the education bubble don’t realize and people inside won’t admit is that many colleges and universities are in the same position that major banks and financial institutions are: their assets (endowments down 30-40 percent this year) are plummeting, their liabilities (debts) are growing, most of their costs are fixed and rising, and their income (return on investments, support from government and private donations, etc.) is falling.  This is hardly a prescription for financial success….  And now the economy makes matters worse. Only 19 percent of the class of 2009 had jobs at graduation.\nThe problem with most analysis of the value of a college or graduate degree is that the aggregate figures include the sharks graduating from the elite schools – many of whom would have been just as successful without their degrees – and then attempt to apply it to Jane Average who is planning to attend Podunk State.  Many years ago, I read a book called\nClass\n.  It was a pretty funny book, but one point that I remembered was the citation of a study which showed that unless you obtained it from a university that had been established prior to some date in the nineteenth century, your degree wouldn’t add anything to your expected lifetime income.  Perhaps the figures have changed in the intervening 25 years or so, but if more than 80 percent of the 2009 graduates are still unemployed, it’s pretty obvious that a degree is not the obvious choice it was once considered to be.\nWhich makes sense.  The\nsupply of college graduates\nhas nearly quadrupled since 1950 and the limits of the demand for them has been exceeded.  Therefore their price is bound to decline.",
  "tags": [],
  "categories": [],
  "sitemap_lastmod": "2009-07-01T11:43:00+00:00"
}