{
  "url": "https://voxday.net/2009/07/17/everyone-hates-goldman/",
  "scraped_at": "2026-01-08T23:01:27.401483",
  "title": "Everyone hates Goldman",
  "date_display": "July 17, 2009",
  "date_iso": "2009-07-17T12:05:00+00:00",
  "date_from_url": "2009-07-17",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>And with very good reason.  Even Paul Krugman is <a href=\"http://www.nytimes.com/2009/07/17/opinion/17krugman.html\">beginning to see the downside</a> with “saving the financial system”:</p><blockquote><p>The huge bonuses Goldman will soon hand out show that financial-industry highfliers are still operating under a system of heads they win, tails other people lose. If you’re a banker, and you generate big short-term profits, you get lavishly rewarded — and you don’t have to give the money back if and when those profits turn out to have been a mirage. You have every reason, then, to steer investors into taking risks they don’t understand.  And the events of the past year have skewed those incentives even more, by putting taxpayers as well as investors on the hook if things go wrong….  What’s clear is that Wall Street in general, Goldman very much included, benefited hugely from the government’s provision of a financial backstop — an assurance that it will rescue major financial players whenever things go wrong.</p><p>You can argue that such rescues are necessary if we’re to avoid a replay of the Great Depression. In fact, I agree. But the result is that the financial system’s liabilities are now backed by an implicit government guarantee.</p></blockquote><p>No, the rescues were not necessary and Goldman Sachs should have been allowed to fail with all the other bankrupt banks.  Max Kreiser’s perspective is both more forthright and more accurate that Krugman’s: <i>“Goldman Sachs are scum.  That’s the bottom line.  They basically have coopted the U.S. government, they have coopted the Treasury Department, the Federal Reserve functionality.  They’ve coopted the Obama administration, Barack Obama dances to Goldman Sachs’s tune.”</i></p><p>What does Chairman Ben Bernanke of the Federal Reserve have to say about all this?</p><p><i>““The public in many countries is understandably concerned by the commitment of substantial government resources to aid the financial industry when other industries receive little or no assistance. This disparate treatment, unappealing as it is, appears unavoidable. Our economic system is critically dependent on the free flow of credit, and the consequences for the broader economy of financial instability are thus powerful and quickly felt.”</i></p><p>It’s time for the American public to tell both Bernanke and Goldman Sachs to go to Hell.  The idea that the economic system somehow depends upon Goldman Sachs employees receiving millions in bonuses has got to be one of the biggest lies ever told in the history of economics.  This is actually the last frantic looting of the pirates before the ship they attacked and boarded finally sinks beneath the waves.  And the way out is absolutely not to build a new global system, because all that amounts to is allowing the financial pirates to board a new and bigger ship.</p></div>",
  "content_text": "And with very good reason.  Even Paul Krugman is\nbeginning to see the downside\nwith “saving the financial system”:\nThe huge bonuses Goldman will soon hand out show that financial-industry highfliers are still operating under a system of heads they win, tails other people lose. If you’re a banker, and you generate big short-term profits, you get lavishly rewarded — and you don’t have to give the money back if and when those profits turn out to have been a mirage. You have every reason, then, to steer investors into taking risks they don’t understand.  And the events of the past year have skewed those incentives even more, by putting taxpayers as well as investors on the hook if things go wrong….  What’s clear is that Wall Street in general, Goldman very much included, benefited hugely from the government’s provision of a financial backstop — an assurance that it will rescue major financial players whenever things go wrong.\nYou can argue that such rescues are necessary if we’re to avoid a replay of the Great Depression. In fact, I agree. But the result is that the financial system’s liabilities are now backed by an implicit government guarantee.\nNo, the rescues were not necessary and Goldman Sachs should have been allowed to fail with all the other bankrupt banks.  Max Kreiser’s perspective is both more forthright and more accurate that Krugman’s:\n“Goldman Sachs are scum.  That’s the bottom line.  They basically have coopted the U.S. government, they have coopted the Treasury Department, the Federal Reserve functionality.  They’ve coopted the Obama administration, Barack Obama dances to Goldman Sachs’s tune.”\nWhat does Chairman Ben Bernanke of the Federal Reserve have to say about all this?\n““The public in many countries is understandably concerned by the commitment of substantial government resources to aid the financial industry when other industries receive little or no assistance. This disparate treatment, unappealing as it is, appears unavoidable. Our economic system is critically dependent on the free flow of credit, and the consequences for the broader economy of financial instability are thus powerful and quickly felt.”\nIt’s time for the American public to tell both Bernanke and Goldman Sachs to go to Hell.  The idea that the economic system somehow depends upon Goldman Sachs employees receiving millions in bonuses has got to be one of the biggest lies ever told in the history of economics.  This is actually the last frantic looting of the pirates before the ship they attacked and boarded finally sinks beneath the waves.  And the way out is absolutely not to build a new global system, because all that amounts to is allowing the financial pirates to board a new and bigger ship.",
  "tags": [],
  "categories": [],
  "sitemap_lastmod": "2009-07-17T11:05:00+00:00"
}