{
  "url": "https://voxday.net/2009/07/28/feynman-and-young-earth-evolutionis/",
  "scraped_at": "2026-01-08T23:02:28.423009",
  "title": "Feynman and the Young Earth Evolutionist",
  "date_display": "July 28, 2009",
  "date_iso": "2009-07-28T11:00:00+00:00",
  "date_from_url": "2009-07-28",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>Richard Feynman on why evolution by natural selection not only lacks scientific integrity, but in many cases, cannot even reasonably be considered science.  First, a quote from his <a href=\"http://www.lhup.edu/~DSIMANEK/cargocul.htm\">Cargo Cult Science speech at Caltech</a>:</p><blockquote><p>It’s a kind of scientific integrity, a principle of scientific thought that corresponds to a kind of utter honesty–a kind of leaning over backwards. For example, if you’re doing an experiment, you should report everything that you think might make it invalid–not only what you think is right about it: other causes that could possibly explain your results; and things you thought of that you’ve eliminated by some other experiment, and how they worked–to make sure the other fellow can tell they have been eliminated…</p></blockquote><p>One of the things I’ve found to be rather interesting in reading through various biology papers is the way the researchers often show what very much appears to be a lack of scientific integrity by doing precisely the opposite of what Feynman suggested.  In much the same way that Calvinists and atheists approach theology, they take one possible solution and insist that it is the ONLY possible one.  The phrase “this is consistent with evolution by natural selection”, or some variant thereof, appeared in the majority of papers I read, without any alternative explanations ever being mentioned.</p><p>I’m not sure where the other quote comes from, so I’ll simply provide the link to <a href=\"http://news.slashdot.org/comments.pl?sid=1315897&amp;cid=28835035\">the Slashdot comment</a> where it was posted:</p><blockquote><p>Remember: In science, we don’t prove things true, we show them to be not false. Same thing? Not hardly. For a complete discussion on the topic, read the Logic of Scientific Discovery by Karl Popper. However what it comes down to is you do not do a test, and then prove a theory true. That can’t be done. What you do is come up with a way to falsify your theory, that is to say you come up with a test that says “If things don’t come out this way, we know this theory is wrong.” You run the test, things come out that way. You have failed to falsify the theory, and we are now more certain it is true. The more than is done, the more certain we are a theory is correct. Each time we attempt to falsify the theory and fail, we are more sure it must be the truth.</p><p>If we do then falsify it, the theory has to be redone. That doesn’t mean you toss the whole thing out, it may just mean some refinement is needed. For example you have a theory that predicts when X happens Y will results. In 400 tests, this is the case, however 3 new tests show it isn’t. What you discover is that in all those tests, A was also present. You the refine your theory: Y will result from X, except in cases where A is present. Your theory is now a little more narrow in application, and fits with the evidence. Perhaps later you find out what A does, and incorporate that in to a more general theory.</p><p>The point of all this is that real science is all about trying to prove your theory wrong. You do everything you can to prove it wrong, then have other people do what they can to prove it wrong. When all of you fail at doing that, when the theory has been refined such that it fits all the evidence and you can’t figure out how else to test it, then it is most likely the truth. THAT is what scientific rigor is about. It isn’t about coming up with a theory, ignoring data you don’t like, showing it to a few people who agree with you, and saying “Ok, we proved this true and nobody else can look at it.”</p></blockquote><p>This, too, is very, very different from what we see in evolution-related “science”.  Now, I understand why no one has ever painted a group of polar bears brown in order to test one of the more famous examples of supposed natural selection.  That would not only be problematic, but excessively dangerous.  But, with the exception of rare individuals such as Jerry Fodor, who argues that the theory of evolution is not a legitimate theory of science because <a href=\"http://modernmaterialism.blogspot.com/2009/02/darwin-was-wrong.html\">it is either vacuously true or wrong</a>, few on the supposedly scientific side of the Natural Selection/Transnatural Creation divide have ever seriously examined the many substantive problems with natural selection from logical, statistical, and scientific perspectives.  And even fewer understand how the theory of evolution by natural selection rests almost entirely on the same sort of logical assumption that so much medieval religious philosophy does.  Yes, it certainly does make logical sense that organisms adapted to be more suitable to their environment are more likely to reproduce successfully, but can this in fact be reliably established to be the case?  There are certainly no shortage of logically valid alternatives that merit investigation under Feynman’s philosophy of science.</p><p>For example, it is known that the presence of heritable genetic variation that results in fitness differences is required for natural selection.  It is also known that individual sexual selection is an alternative to natural selection.  But most consideration of natural selection stops here, at the tautological level; an organism is fit because it has successfully reproduced and it successfully reproduces because it is fit.  QED….  What is often forgotten is that for fitness to have any significance from a natural selection perspective, it requires a dynamic environment that is capable of creating a meaningful distinction between the fit and the unfit.  And that’s just for starters….</p><p>Now, it is obvious that if no organism in a species successfully reproduces, no natural selection takes place.  It is slightly less obvious that if every organism in a species successfully reproduces, no natural selection takes place.  So, from a scientific perspective, it is important to determine what percentage of organisms in a given population are capable of successfully reproducing in a specific environment, and then to determine if there is any environmental pressure capable of creating a distinction between the fit and unfit portions of the population.  Only then is it meaningful to discuss whatever adaptations have taken place and to explore the possible alternatives.</p><p><a href=\"http://findarticles.com/p/articles/mi_pfsf/is_199703/ai_3617798732/\">This natural selection study</a> by a National Science Foundation-supported research team is the sort of study I think there needs to be more of if the theory of evolution by natural selection is ever going to actually merit being taken seriously as a genuinely scientific theory.  And I agree with the lead author of the study when he says: “Such studies are important because people tend to think of evolution as a historical process that is not subject to experiments. It is the scarcity of experiments that is the source of some of the criticism of the theory.”  It is certainly one of the sources of my criticism of it; I’m pleased to see that the suspicions of a dearth of such studies I’d previously expressed could be so easily confirmed.</p><p>Of course, those with a Discordian frame of mind may find it somewhat amusing to apply the reported 10,0000-10,000,000x increase in the observed rate of adaptation to the present estimate of a 4.54 billion year old earth… would there happen to be such a thing as a Young Earth Evolutionist?</p></div>",
  "content_text": "Richard Feynman on why evolution by natural selection not only lacks scientific integrity, but in many cases, cannot even reasonably be considered science.  First, a quote from his\nCargo Cult Science speech at Caltech\n:\nIt’s a kind of scientific integrity, a principle of scientific thought that corresponds to a kind of utter honesty–a kind of leaning over backwards. For example, if you’re doing an experiment, you should report everything that you think might make it invalid–not only what you think is right about it: other causes that could possibly explain your results; and things you thought of that you’ve eliminated by some other experiment, and how they worked–to make sure the other fellow can tell they have been eliminated…\nOne of the things I’ve found to be rather interesting in reading through various biology papers is the way the researchers often show what very much appears to be a lack of scientific integrity by doing precisely the opposite of what Feynman suggested.  In much the same way that Calvinists and atheists approach theology, they take one possible solution and insist that it is the ONLY possible one.  The phrase “this is consistent with evolution by natural selection”, or some variant thereof, appeared in the majority of papers I read, without any alternative explanations ever being mentioned.\nI’m not sure where the other quote comes from, so I’ll simply provide the link to\nthe Slashdot comment\nwhere it was posted:\nRemember: In science, we don’t prove things true, we show them to be not false. Same thing? Not hardly. For a complete discussion on the topic, read the Logic of Scientific Discovery by Karl Popper. However what it comes down to is you do not do a test, and then prove a theory true. That can’t be done. What you do is come up with a way to falsify your theory, that is to say you come up with a test that says “If things don’t come out this way, we know this theory is wrong.” You run the test, things come out that way. You have failed to falsify the theory, and we are now more certain it is true. The more than is done, the more certain we are a theory is correct. Each time we attempt to falsify the theory and fail, we are more sure it must be the truth.\nIf we do then falsify it, the theory has to be redone. That doesn’t mean you toss the whole thing out, it may just mean some refinement is needed. For example you have a theory that predicts when X happens Y will results. In 400 tests, this is the case, however 3 new tests show it isn’t. What you discover is that in all those tests, A was also present. You the refine your theory: Y will result from X, except in cases where A is present. Your theory is now a little more narrow in application, and fits with the evidence. Perhaps later you find out what A does, and incorporate that in to a more general theory.\nThe point of all this is that real science is all about trying to prove your theory wrong. You do everything you can to prove it wrong, then have other people do what they can to prove it wrong. When all of you fail at doing that, when the theory has been refined such that it fits all the evidence and you can’t figure out how else to test it, then it is most likely the truth. THAT is what scientific rigor is about. It isn’t about coming up with a theory, ignoring data you don’t like, showing it to a few people who agree with you, and saying “Ok, we proved this true and nobody else can look at it.”\nThis, too, is very, very different from what we see in evolution-related “science”.  Now, I understand why no one has ever painted a group of polar bears brown in order to test one of the more famous examples of supposed natural selection.  That would not only be problematic, but excessively dangerous.  But, with the exception of rare individuals such as Jerry Fodor, who argues that the theory of evolution is not a legitimate theory of science because\nit is either vacuously true or wrong\n, few on the supposedly scientific side of the Natural Selection/Transnatural Creation divide have ever seriously examined the many substantive problems with natural selection from logical, statistical, and scientific perspectives.  And even fewer understand how the theory of evolution by natural selection rests almost entirely on the same sort of logical assumption that so much medieval religious philosophy does.  Yes, it certainly does make logical sense that organisms adapted to be more suitable to their environment are more likely to reproduce successfully, but can this in fact be reliably established to be the case?  There are certainly no shortage of logically valid alternatives that merit investigation under Feynman’s philosophy of science.\nFor example, it is known that the presence of heritable genetic variation that results in fitness differences is required for natural selection.  It is also known that individual sexual selection is an alternative to natural selection.  But most consideration of natural selection stops here, at the tautological level; an organism is fit because it has successfully reproduced and it successfully reproduces because it is fit.  QED….  What is often forgotten is that for fitness to have any significance from a natural selection perspective, it requires a dynamic environment that is capable of creating a meaningful distinction between the fit and the unfit.  And that’s just for starters….\nNow, it is obvious that if no organism in a species successfully reproduces, no natural selection takes place.  It is slightly less obvious that if every organism in a species successfully reproduces, no natural selection takes place.  So, from a scientific perspective, it is important to determine what percentage of organisms in a given population are capable of successfully reproducing in a specific environment, and then to determine if there is any environmental pressure capable of creating a distinction between the fit and unfit portions of the population.  Only then is it meaningful to discuss whatever adaptations have taken place and to explore the possible alternatives.\nThis natural selection study\nby a National Science Foundation-supported research team is the sort of study I think there needs to be more of if the theory of evolution by natural selection is ever going to actually merit being taken seriously as a genuinely scientific theory.  And I agree with the lead author of the study when he says: “Such studies are important because people tend to think of evolution as a historical process that is not subject to experiments. It is the scarcity of experiments that is the source of some of the criticism of the theory.”  It is certainly one of the sources of my criticism of it; I’m pleased to see that the suspicions of a dearth of such studies I’d previously expressed could be so easily confirmed.\nOf course, those with a Discordian frame of mind may find it somewhat amusing to apply the reported 10,0000-10,000,000x increase in the observed rate of adaptation to the present estimate of a 4.54 billion year old earth… would there happen to be such a thing as a Young Earth Evolutionist?",
  "tags": [],
  "categories": [],
  "sitemap_lastmod": "2009-07-28T10:00:00+00:00"
}