{
  "url": "https://voxday.net/2009/07/15/first-newton-then-darwin/",
  "scraped_at": "2026-01-08T23:01:17.906716",
  "title": "First Newton, then Darwin",
  "date_display": "July 15, 2009",
  "date_iso": "2009-07-15T19:23:00+00:00",
  "date_from_url": "2009-07-15",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>Despite the usual scientific consensus, Dark Matter increasingly <a href=\"http://www.sciencedaily.com/releases/2009/05/090505061949.htm\">appears to be on its way out</a>.  (Dark Vapor, on the other hand, rests on the same secure foundation it always has.  I await my Nobel with placid confidence.)  And there’s no point whining that it’s scientists who are doing the demolition job; it’s scientists who will eventually demolish TENS and AGW/CC too once they manage to overcome the intellectual inertia imposed by the great scientific unwashed.</p><blockquote><p>More precisely, all classical satellites of the Milky Way – the eleven brightest dwarf galaxies – lie more or less in the same plane, they are forming some sort of a disc in the sky. The research team has also been able to show that most of these satellite galaxies rotate in the same direction around the Milky Way – like the planets revolve around the Sun.</p><p>The physicists do belief that this phenomenon can only be explained if the satellites were created a long time ago through collisions between younger galaxies. “The fragments produced by such an event can form rotating dwarf galaxies,” explains Dr. Metz. But there is an interesting catch to this crash theory, “theoretical calculations tell us that the satellites created cannot contain any dark matter.” This assumption, however, stands in contradiction to another observation. “The stars in the satellites we have observed are moving much faster than predicted by the Gravitational Law. If classical physics holds this can only be attributed to the presence of dark matter,” Manuel Metz states.</p><p>Or one must assume that some basic fundamental principles of physics have hitherto been incorrectly understood.</p></blockquote><p>I always enjoy the moment when scientists finally throw up their hands and quit trying to draw the elaborate epicycles that permit them to force the square data into the round theory.  Perhaps the astrophysicists have finally gotten around to reaching this point.  The biologists are rather less bright, so no doubt it will take them rather longer to face the scientific reality.</p><p>Of course, they can always take the Keynesian approach.  “Make it bigger, then it’ll work for sure!”  That will buy them a few decades before it all collapses.  But eventually every idea, every scientific concept, must stand or fall on its own merits.  Science is not democracy and scientific consensus has no more bearing on the evidence than the book-selling consensus has on literary quality.</p></div>",
  "content_text": "Despite the usual scientific consensus, Dark Matter increasingly\nappears to be on its way out\n.  (Dark Vapor, on the other hand, rests on the same secure foundation it always has.  I await my Nobel with placid confidence.)  And there’s no point whining that it’s scientists who are doing the demolition job; it’s scientists who will eventually demolish TENS and AGW/CC too once they manage to overcome the intellectual inertia imposed by the great scientific unwashed.\nMore precisely, all classical satellites of the Milky Way – the eleven brightest dwarf galaxies – lie more or less in the same plane, they are forming some sort of a disc in the sky. The research team has also been able to show that most of these satellite galaxies rotate in the same direction around the Milky Way – like the planets revolve around the Sun.\nThe physicists do belief that this phenomenon can only be explained if the satellites were created a long time ago through collisions between younger galaxies. “The fragments produced by such an event can form rotating dwarf galaxies,” explains Dr. Metz. But there is an interesting catch to this crash theory, “theoretical calculations tell us that the satellites created cannot contain any dark matter.” This assumption, however, stands in contradiction to another observation. “The stars in the satellites we have observed are moving much faster than predicted by the Gravitational Law. If classical physics holds this can only be attributed to the presence of dark matter,” Manuel Metz states.\nOr one must assume that some basic fundamental principles of physics have hitherto been incorrectly understood.\nI always enjoy the moment when scientists finally throw up their hands and quit trying to draw the elaborate epicycles that permit them to force the square data into the round theory.  Perhaps the astrophysicists have finally gotten around to reaching this point.  The biologists are rather less bright, so no doubt it will take them rather longer to face the scientific reality.\nOf course, they can always take the Keynesian approach.  “Make it bigger, then it’ll work for sure!”  That will buy them a few decades before it all collapses.  But eventually every idea, every scientific concept, must stand or fall on its own merits.  Science is not democracy and scientific consensus has no more bearing on the evidence than the book-selling consensus has on literary quality.",
  "tags": [],
  "categories": [],
  "sitemap_lastmod": "2009-07-15T18:23:00+00:00"
}