{
  "url": "https://voxday.net/2009/07/12/frankens-future/",
  "scraped_at": "2026-01-08T23:01:01.309909",
  "title": "Franken’s future",
  "date_display": "July 12, 2009",
  "date_iso": "2009-07-12T17:15:00+00:00",
  "date_from_url": "2009-07-12",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>The Fraters Libertas salute a past prediction and <a href=\"http://www.fraterslibertas.com/labels/Politics-Local%20(08-09).html\">request one for the future</a>:</p><blockquote><p>Finally, we should note that way back in May of 2004 one pundit read the tea leaves correctly by noting that the idea of Franken winning a Senate seat in Minnesota was not as far-fetched as it seemed at the time….  Congratulations to Vox Day for not underestimating the unpredictable nature of the Minnesota electorate. Perhaps he could gaze once again into his crystal ball and tell us what he thinks about Franken’s reelection chances in… 2014. Sigh. There aren’t going to be a lot of laughs over the next five-and-a-half years, are there?</p></blockquote><p>I can only thank the good Fraters, they are too kind.  It’s true, there won’t be many laughs over the course of Franken’s term, but it won’t be the new senator’s fault.  In fact, Senator Franken may well provide a small sense of comic relief in much the same way that a chimpanzee dressed in a business suit does.  The reality is that Coleman’s loss isn’t in the least bit harmful.  If Minnesota must bear the burden of seeing its interests “represented” in the Senate by a Jew born in New York City, an outright Democrat is to be much preferred to a pseudo-Republican like Coleman.</p><p>In any case, Franken will not be re-elected in 2014.  The Democratic Party is going to be blamed for the worsening economic contraction and the huge tailwinds that helped him win office will be transformed into even bigger headwinds.  To me, the question is not whether the country turns away from the Democratic Party after six years of their hapless rule, but whether a third party will finally begin to gain sufficient electoral strength to offer a convincing alternative Republican Party.</p><p>I doubt it.  It’s highly improbable given the complete failure of the American electorate to recognize the two-party shell game.  And yet, it’s still more likely than the probability of Obama and his legislative cohorts remaining popular after the failure of the eighth or ninth straight stimulus package.  Remember, we’re already hearing rumors of the <i>third</i> one now and few even recognize that we’re in a depression yet, much less the Great Depression 2.0.</p></div>",
  "content_text": "The Fraters Libertas salute a past prediction and\nrequest one for the future\n:\nFinally, we should note that way back in May of 2004 one pundit read the tea leaves correctly by noting that the idea of Franken winning a Senate seat in Minnesota was not as far-fetched as it seemed at the time….  Congratulations to Vox Day for not underestimating the unpredictable nature of the Minnesota electorate. Perhaps he could gaze once again into his crystal ball and tell us what he thinks about Franken’s reelection chances in… 2014. Sigh. There aren’t going to be a lot of laughs over the next five-and-a-half years, are there?\nI can only thank the good Fraters, they are too kind.  It’s true, there won’t be many laughs over the course of Franken’s term, but it won’t be the new senator’s fault.  In fact, Senator Franken may well provide a small sense of comic relief in much the same way that a chimpanzee dressed in a business suit does.  The reality is that Coleman’s loss isn’t in the least bit harmful.  If Minnesota must bear the burden of seeing its interests “represented” in the Senate by a Jew born in New York City, an outright Democrat is to be much preferred to a pseudo-Republican like Coleman.\nIn any case, Franken will not be re-elected in 2014.  The Democratic Party is going to be blamed for the worsening economic contraction and the huge tailwinds that helped him win office will be transformed into even bigger headwinds.  To me, the question is not whether the country turns away from the Democratic Party after six years of their hapless rule, but whether a third party will finally begin to gain sufficient electoral strength to offer a convincing alternative Republican Party.\nI doubt it.  It’s highly improbable given the complete failure of the American electorate to recognize the two-party shell game.  And yet, it’s still more likely than the probability of Obama and his legislative cohorts remaining popular after the failure of the eighth or ninth straight stimulus package.  Remember, we’re already hearing rumors of the\nthird\none now and few even recognize that we’re in a depression yet, much less the Great Depression 2.0.",
  "tags": [],
  "categories": [],
  "sitemap_lastmod": "2009-07-12T16:15:00+00:00"
}