{
  "url": "https://voxday.net/2009/07/15/get-out-of-war-free-card/",
  "scraped_at": "2026-01-08T23:01:16.058171",
  "title": "The Get-Out-Of-War Free card",
  "date_display": "July 15, 2009",
  "date_iso": "2009-07-15T16:00:00+00:00",
  "date_from_url": "2009-07-15",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>The Pentagon knows, or least suspects, that <a href=\"http://www.wnd.com/index.php?fa=PAGE.view&amp;pageId=104009\">Barack Obama/Soetoro is not eligible for the office</a> he presently purports to hold:</p><blockquote><p>A U.S. Army Reserve major from Florida scheduled to report for deployment to Afghanistan within days has had his military orders revoked after he argued that he should not be required to serve under a president who has not proven his legitimacy for office. His attorney, Orly Taitz, confirmed to WND the military has rescinded his impending deployment orders….</p><p>A hearing on the questions raised by Maj. Stefan Frederick Cook, an engineer who told WND he wants to serve his country in Afghanistan, was scheduled for July 16 at 9:30 a.m.  “As an officer in the armed forces of the United States, it is [my] duty to gain clarification on any order we may believe illegal. With that said, if President Obama is found not to be a ‘natural-born citizen,’ he is not eligible to be commander-in-chief,” he told WND only hours after the case was filed.</p></blockquote><p>This should get interesting.  The courts can’t pretend, as they have done numerous times in the recent past, that Major Cook has no standing.  Since the military either knows or suspects that its purported Commander-in-Chief can’t back up his birth claims, they don’t want to take the chance of the issue going to court where Obama/Soetoro will be forced to put up or give up.</p><p>Of course, this also means that every soldier who doesn’t wish to serve in Afghanistan or Iraq was just handed a get-out-of-war free card.  If Obama/Soetoro does not come clean and release his documentation now to settle the matter, this will be an implicit confession that he is not, in fact, eligible to be president.  How can he or his defenders possibly justify hiding all of the relevant documents when it means giving every soldier in the U.S. military a veto on accepting orders?</p><p>The <a href=\"http://www.wnd.com/index.php?fa=PAGE.view&amp;pageId=103942\">mutating stories and multiple hospitals</a> where Obama/Soetoro was supposedly born strongly suggest that America’s first Indonesian faux president is not going to be able to keep a lid on his election scandal much longer.</p><p>UPDATE – Major Cook <a href=\"http://www.wnd.com/index.php?fa=PAGE.view&amp;pageId=104044\">gets fired</a>:</p><blockquote><p>According to the CEO of Simtech Inc., a private company contracted by the Defense Security Services, an agency of the Department of Defense, the federal agency has compelled the termination of Maj. Stefan Frederick Cook.</p></blockquote><p>Well, I’m confident <i>firing the guy asking questions</i> will surely help convince the American people that the Pentagon has the utmost confidence in the provable legitimacy of their Commander-in-Chief.  Seriously, don’t they have anyone who understands the way propaganda is supposed to work there anymore?  If it were Putin, he would have brought the major to the White House for a very public meet-and-greet, privately shown him whatever real or faked documents would satisfy the man, then sent him off to Afghanistan to win an impressive and posthumously awarded medal.</p></div>",
  "content_text": "The Pentagon knows, or least suspects, that\nBarack Obama/Soetoro is not eligible for the office\nhe presently purports to hold:\nA U.S. Army Reserve major from Florida scheduled to report for deployment to Afghanistan within days has had his military orders revoked after he argued that he should not be required to serve under a president who has not proven his legitimacy for office. His attorney, Orly Taitz, confirmed to WND the military has rescinded his impending deployment orders….\nA hearing on the questions raised by Maj. Stefan Frederick Cook, an engineer who told WND he wants to serve his country in Afghanistan, was scheduled for July 16 at 9:30 a.m.  “As an officer in the armed forces of the United States, it is [my] duty to gain clarification on any order we may believe illegal. With that said, if President Obama is found not to be a ‘natural-born citizen,’ he is not eligible to be commander-in-chief,” he told WND only hours after the case was filed.\nThis should get interesting.  The courts can’t pretend, as they have done numerous times in the recent past, that Major Cook has no standing.  Since the military either knows or suspects that its purported Commander-in-Chief can’t back up his birth claims, they don’t want to take the chance of the issue going to court where Obama/Soetoro will be forced to put up or give up.\nOf course, this also means that every soldier who doesn’t wish to serve in Afghanistan or Iraq was just handed a get-out-of-war free card.  If Obama/Soetoro does not come clean and release his documentation now to settle the matter, this will be an implicit confession that he is not, in fact, eligible to be president.  How can he or his defenders possibly justify hiding all of the relevant documents when it means giving every soldier in the U.S. military a veto on accepting orders?\nThe\nmutating stories and multiple hospitals\nwhere Obama/Soetoro was supposedly born strongly suggest that America’s first Indonesian faux president is not going to be able to keep a lid on his election scandal much longer.\nUPDATE – Major Cook\ngets fired\n:\nAccording to the CEO of Simtech Inc., a private company contracted by the Defense Security Services, an agency of the Department of Defense, the federal agency has compelled the termination of Maj. Stefan Frederick Cook.\nWell, I’m confident\nfiring the guy asking questions\nwill surely help convince the American people that the Pentagon has the utmost confidence in the provable legitimacy of their Commander-in-Chief.  Seriously, don’t they have anyone who understands the way propaganda is supposed to work there anymore?  If it were Putin, he would have brought the major to the White House for a very public meet-and-greet, privately shown him whatever real or faked documents would satisfy the man, then sent him off to Afghanistan to win an impressive and posthumously awarded medal.",
  "tags": [],
  "categories": [],
  "sitemap_lastmod": "2009-07-15T15:00:00+00:00"
}