{
  "url": "https://voxday.net/2009/07/31/getting-it-so-wrong/",
  "scraped_at": "2026-01-08T23:02:49.768280",
  "title": "Getting it so wrong",
  "date_display": "July 31, 2009",
  "date_iso": "2009-07-31T16:44:00+00:00",
  "date_from_url": "2009-07-31",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>Paul Krugman <a href=\"http://www.nytimes.com/2009/07/31/opinion/31krugman.html?em\">continues his quixotic campaign</a> to be the first so-called economist to be stripped of a Nobel Prize:</p><blockquote><p>It’s not just that many Americans don’t understand what President Obama is proposing; many people don’t understand the way American health care works right now. They don’t understand, in particular, that getting the government involved in health care wouldn’t be a radical step: the government is already deeply involved, even in private insurance.</p><p>And that government involvement is the only reason our system works at all.</p></blockquote><p>Yes, that’s why it’s necessary for the federal and state governments to pass scads of laws granting various partial monopolies throughout every aspect of the system.  Because if they didn’t prevent the free market from operating, <i>everything would collapse overnight</i>.  Krugman not only doesn’t understand economics, he doesn’t even understand what “insurance” is; it’s not supposed to be a financial vehicle for having someone else pay for all of your medical care.</p><p>Krugman actually cites “satisfaction with Medicare” as if it is somehow relevant.  Wow, people enjoy receiving subsidized goods and services paid for by other people?  Do I detect a sign of Nobel Prize No. 2 on the horizon?</p></div>",
  "content_text": "Paul Krugman\ncontinues his quixotic campaign\nto be the first so-called economist to be stripped of a Nobel Prize:\nIt’s not just that many Americans don’t understand what President Obama is proposing; many people don’t understand the way American health care works right now. They don’t understand, in particular, that getting the government involved in health care wouldn’t be a radical step: the government is already deeply involved, even in private insurance.\nAnd that government involvement is the only reason our system works at all.\nYes, that’s why it’s necessary for the federal and state governments to pass scads of laws granting various partial monopolies throughout every aspect of the system.  Because if they didn’t prevent the free market from operating,\neverything would collapse overnight\n.  Krugman not only doesn’t understand economics, he doesn’t even understand what “insurance” is; it’s not supposed to be a financial vehicle for having someone else pay for all of your medical care.\nKrugman actually cites “satisfaction with Medicare” as if it is somehow relevant.  Wow, people enjoy receiving subsidized goods and services paid for by other people?  Do I detect a sign of Nobel Prize No. 2 on the horizon?",
  "tags": [],
  "categories": [],
  "sitemap_lastmod": "2009-07-31T15:44:00+00:00"
}