{
  "url": "https://voxday.net/2009/07/25/liberal-fascism-chapter-six/",
  "scraped_at": "2026-01-08T23:02:15.219092",
  "title": "Liberal Fascism – Chapter Six",
  "date_display": "July 25, 2009",
  "date_iso": "2009-07-25T13:35:00+00:00",
  "date_from_url": "2009-07-25",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p><iframe frameborder=\"0\" height=\"500\" id=\"proprofs\" marginheight=\"0\" marginwidth=\"0\" name=\"proprofs\" src=\"http://www.proprofs.com/quiz-school/widget/v2/?id=51517&amp;bgcolor=c1d4ee&amp;fcolor=2b405b&amp;tcolor=2b405b\" style=\"overflow-x: hidden;\" width=\"440\"></iframe></p><p>I found this chapter to be interesting, because it managed to be extremely informative without ever quite pulling a coherent case together.  In certain places, it’s more than a little apparent that <i>Liberal Fascism</i> is a debut and I thought that this chapter was one of them.  But the value of the historical material serves to redeem the structural flaws.  On a tangential note, one of my great-uncles, an accomplished artist, was a devoted Dewey enthusiast.  While I quite liked him, even as a child I could never quite lose the impression that there was something rather ominous about the philosophy.</p><p>Next week’s reading is Chapter Seven, “Liberal Racism: The Eugenic Ghost in the Fascist Machine”.  The quiz for it will be posted on Saturday, August 1st.</p></div>",
  "content_text": "I found this chapter to be interesting, because it managed to be extremely informative without ever quite pulling a coherent case together.  In certain places, it’s more than a little apparent that\nLiberal Fascism\nis a debut and I thought that this chapter was one of them.  But the value of the historical material serves to redeem the structural flaws.  On a tangential note, one of my great-uncles, an accomplished artist, was a devoted Dewey enthusiast.  While I quite liked him, even as a child I could never quite lose the impression that there was something rather ominous about the philosophy.\nNext week’s reading is Chapter Seven, “Liberal Racism: The Eugenic Ghost in the Fascist Machine”.  The quiz for it will be posted on Saturday, August 1st.",
  "tags": [],
  "categories": [],
  "sitemap_lastmod": "2009-07-25T12:35:00+00:00"
}