{
  "url": "https://voxday.net/2009/07/26/lunatic-zionazis/",
  "scraped_at": "2026-01-08T23:02:21.067733",
  "title": "Lunatic Zionazis",
  "date_display": "July 26, 2009",
  "date_iso": "2009-07-26T18:30:00+00:00",
  "date_from_url": "2009-07-26",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>A few American Israelis <a href=\"http://www.haaretz.com/hasen/spages/1101158.html\">appear to have gone off the deep end</a> ever since Obama chose Cairo over Tel Aviv:</p><blockquote><p>The Pope and the cardinals of the Vatican help organize tours of Auschwitz for Hezbollah members to teach them how to wipe out Jews, according to a booklet being distributed to Israel Defense Forces soldiers.  Officials encouraging the booklet’s distribution include senior officers, such as Lt. Col. Tamir Shalom, the commander of the Nahshon Battalion of the Kfir Brigade.</p></blockquote><p>I realize there is a German Pope these days, but I find it highly unlikely that he, and the College of Cardinals based in Rome, occupy themselves with providing guided tours to Lebanese terrorists in Poland.  As Justin Raimondo wryly notes: “The irony that one of Israel’s most ardent defenders is now using arguments <a href=\"http://original.antiwar.com/justin/2009/07/21/israel-and-the-nutbar-factor/\">based on theories of genetic superiority</a> may be lost on that country’s knee-jerk defenders at this point….”</p><p>It seems to have escaped the attention of nearly everyone, Christian, Jew, and atheist alike, that an America that is not a White European Christian nation is not an America that will lift a finger in order to preserve the only Jewish state.  I tend to doubt those Muslim Somalis in Minnesota lose much sleep over the prospective fate of Israel.</p><p>The Israelis have the same right to exist and defend themselves that any other nation does.  Their right of conquest is no less legitimate than that of dozens of other nations.  But I fail to see how actively attempting to create more enemies than they already have, or fostering even greater reliance on the USA, serves any rational Israeli interest.</p></div>",
  "content_text": "A few American Israelis\nappear to have gone off the deep end\never since Obama chose Cairo over Tel Aviv:\nThe Pope and the cardinals of the Vatican help organize tours of Auschwitz for Hezbollah members to teach them how to wipe out Jews, according to a booklet being distributed to Israel Defense Forces soldiers.  Officials encouraging the booklet’s distribution include senior officers, such as Lt. Col. Tamir Shalom, the commander of the Nahshon Battalion of the Kfir Brigade.\nI realize there is a German Pope these days, but I find it highly unlikely that he, and the College of Cardinals based in Rome, occupy themselves with providing guided tours to Lebanese terrorists in Poland.  As Justin Raimondo wryly notes: “The irony that one of Israel’s most ardent defenders is now using arguments\nbased on theories of genetic superiority\nmay be lost on that country’s knee-jerk defenders at this point….”\nIt seems to have escaped the attention of nearly everyone, Christian, Jew, and atheist alike, that an America that is not a White European Christian nation is not an America that will lift a finger in order to preserve the only Jewish state.  I tend to doubt those Muslim Somalis in Minnesota lose much sleep over the prospective fate of Israel.\nThe Israelis have the same right to exist and defend themselves that any other nation does.  Their right of conquest is no less legitimate than that of dozens of other nations.  But I fail to see how actively attempting to create more enemies than they already have, or fostering even greater reliance on the USA, serves any rational Israeli interest.",
  "tags": [],
  "categories": [],
  "sitemap_lastmod": "2009-07-26T17:30:00+00:00"
}