{
  "url": "https://voxday.net/2009/07/17/mailvox-attempt-to-prove-gods/",
  "scraped_at": "2026-01-08T23:01:29.220729",
  "title": "Mailvox: an attempt to prove God’s nonexistence",
  "date_display": "July 17, 2009",
  "date_iso": "2009-07-17T15:42:00+00:00",
  "date_from_url": "2009-07-17",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>JB is a fan on certain issues, but he appears to have neglected to read TIA before sending in this attempt to disprove God’s existence through logic:</p><blockquote><p>This applies to all gods, not only the Christian one. However, I will use the term “Christian” but that should not be taken to mean specifically Christians.</p><p>That which Christians call “God” must logically be one of the following two things:</p><p>1. The Totality, the sum total of the All, the Infinity of Existence, the totality of Nature.</p><p>or</p><p>2. Something less than the Totality.</p><p>There is logically no third alternative. It is one or the other. It is not possible to be more than the Totality, because the Totality, by definition, includes everything.</p><p>Now, the God that is identical with the Totality of all things may possibly be believed by some pantheists, but would not be believed in by many who would call themselves Christian. So, the God whose possible existence we need to examine is the second of the two alternatives – i.e., a God who is something less than the Totality.</p><p>Now is it possible for a “God” who is less than the Totality to be everything that Christians conceive him to be?</p><p>Christians conceive their God to be all-powerful – “omnipotent” – and all-knowing – “omniscient”. And Christians consider their God to be the creator of all things.</p><p>So is it possible for a being who is something less than the Totality of all things to be the creator of all things and have power over all things? No. It is not logically possible. A limited being cannot reach everything (by definition).</p><p>Is it possible for a being who is something less than the Totality of all things to be everywhere at once and to know all details about all things? No. It is not logically possible. A limited being cannot reach everything.</p><p>Thus the God of the common Christian is a logical impossibility and can never be more than a figment of the imagination. And just as a dream can be experienced, while having no logical coherence, and no reality beyond the imagination – so can the Christian experience his God.</p><p>I hope this leads you to re-consider your views on this issue.</p></blockquote><p>The first point is correct.  Either God is the Totality or God is something less than the Totality.  The second point is also correct from both the Christian and other non-pantheistic perspectives; God is less than the Totality.</p><p>The third point is incorrect on two levels.  1) There is the usual confusion between capability and action.  2) Christian doctrine, as defined by either the Bible or the various theological doctrines of the major Christian churches, does not consider God to be omniscient in the sense it is used here.  See TIA page 270 and “The Contradiction of Divine Characteristics”.</p><p>The fourth point – which is actually a series of related points – is incorrect.  Completely incorrect.  Not only can something which is less than the Totality be the Creator of all things, logic actually dictates that the Creator of all things MUST be less than the Totality for the obvious reason that <i>otherwise there would be nothing to create</i>.  JB has gotten the logic entirely backward here.  Furthermore, there is no intrinsic logical bar on a limited being reaching everywhere or knowing everything, as this entirely depends upon the way on the question of whether everything is finite or infinite, the nature of the being’s limits, and the ability of the limited being to extend its reach through other beings.</p><p>(I always find it amusing when omniderigistes or atheists insist that God must know and control absolutely everything at all times or He doesn’t exist.  I mean, how would a God who doesn’t know everything and control absolutely everything interact with His creation.  Most likely, one would imagine, through intermediaries He has also created.  What a pity there’s nothing that might fit that description in any theological system….)</p><p>As is far too often the case, JB has attacked a childish strawgod; he is attempting to prove the nonexistence of the omniderigent “He’s Got the Whole World in His Hands” god of the Christian Sunday School.  Let this be a lesson: if you are going to attempt a serious criticism, first master that which you intend to criticize.  It also helps to know your audience, since presenting an omniscience-based proof of God’s nonexistence to me is rather like presenting a critique impossibility of socialist calculation based on the labor theory of value to an Austrian economist.</p></div>",
  "content_text": "JB is a fan on certain issues, but he appears to have neglected to read TIA before sending in this attempt to disprove God’s existence through logic:\nThis applies to all gods, not only the Christian one. However, I will use the term “Christian” but that should not be taken to mean specifically Christians.\nThat which Christians call “God” must logically be one of the following two things:\n1. The Totality, the sum total of the All, the Infinity of Existence, the totality of Nature.\nor\n2. Something less than the Totality.\nThere is logically no third alternative. It is one or the other. It is not possible to be more than the Totality, because the Totality, by definition, includes everything.\nNow, the God that is identical with the Totality of all things may possibly be believed by some pantheists, but would not be believed in by many who would call themselves Christian. So, the God whose possible existence we need to examine is the second of the two alternatives – i.e., a God who is something less than the Totality.\nNow is it possible for a “God” who is less than the Totality to be everything that Christians conceive him to be?\nChristians conceive their God to be all-powerful – “omnipotent” – and all-knowing – “omniscient”. And Christians consider their God to be the creator of all things.\nSo is it possible for a being who is something less than the Totality of all things to be the creator of all things and have power over all things? No. It is not logically possible. A limited being cannot reach everything (by definition).\nIs it possible for a being who is something less than the Totality of all things to be everywhere at once and to know all details about all things? No. It is not logically possible. A limited being cannot reach everything.\nThus the God of the common Christian is a logical impossibility and can never be more than a figment of the imagination. And just as a dream can be experienced, while having no logical coherence, and no reality beyond the imagination – so can the Christian experience his God.\nI hope this leads you to re-consider your views on this issue.\nThe first point is correct.  Either God is the Totality or God is something less than the Totality.  The second point is also correct from both the Christian and other non-pantheistic perspectives; God is less than the Totality.\nThe third point is incorrect on two levels.  1) There is the usual confusion between capability and action.  2) Christian doctrine, as defined by either the Bible or the various theological doctrines of the major Christian churches, does not consider God to be omniscient in the sense it is used here.  See TIA page 270 and “The Contradiction of Divine Characteristics”.\nThe fourth point – which is actually a series of related points – is incorrect.  Completely incorrect.  Not only can something which is less than the Totality be the Creator of all things, logic actually dictates that the Creator of all things MUST be less than the Totality for the obvious reason that\notherwise there would be nothing to create\n.  JB has gotten the logic entirely backward here.  Furthermore, there is no intrinsic logical bar on a limited being reaching everywhere or knowing everything, as this entirely depends upon the way on the question of whether everything is finite or infinite, the nature of the being’s limits, and the ability of the limited being to extend its reach through other beings.\n(I always find it amusing when omniderigistes or atheists insist that God must know and control absolutely everything at all times or He doesn’t exist.  I mean, how would a God who doesn’t know everything and control absolutely everything interact with His creation.  Most likely, one would imagine, through intermediaries He has also created.  What a pity there’s nothing that might fit that description in any theological system….)\nAs is far too often the case, JB has attacked a childish strawgod; he is attempting to prove the nonexistence of the omniderigent “He’s Got the Whole World in His Hands” god of the Christian Sunday School.  Let this be a lesson: if you are going to attempt a serious criticism, first master that which you intend to criticize.  It also helps to know your audience, since presenting an omniscience-based proof of God’s nonexistence to me is rather like presenting a critique impossibility of socialist calculation based on the labor theory of value to an Austrian economist.",
  "tags": [],
  "categories": [],
  "sitemap_lastmod": "2009-07-17T14:42:00+00:00"
}