{
  "url": "https://voxday.net/2009/07/30/mailvox-jb-offers-second-defense/",
  "scraped_at": "2026-01-08T23:02:42.452788",
  "title": "Mailvox: JB offers a second defense",
  "date_display": "July 30, 2009",
  "date_iso": "2009-07-30T16:57:00+00:00",
  "date_from_url": "2009-07-30",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>Let me get this straight… I am arguing for the falsifiability of evolution?  Well, all right, then:</p><blockquote><p>Vox’s line of attack against evolution is to force it to demonstrate extant ecosystems actually exert DNSP (dynamic natural selection pressure). My model argues present day DNSP may fail to speciate due to late-stage competitive ossification. It avoids falsification even if EVERY extant ecosystem is now incapable of DNSP.</p><p>Vox claims my admission of rare DNSP predicts abundant proto forms. I reply that DNSP in proto environments isn’t as rare. Large environments can only become static and unselective after genetic ossification occurs, and improved organisms cease to upset the equilibrium. The remaining dead-end proto forms are then extinguished by more efficient late-stage organisms, sometimes by their own gradually refined descendants. “Living fossils”, so labeled because they are the last surviving examples of obsoleted morphologies, will nevertheless become ossified by minor intertwining adaptations. Thus we see my model predicts NO extant proto forms, because they are inherently inefficient, like unoptimized code.</p></blockquote><p>First, requiring scientific evidence that an ecosystem demonstrate DNSP isn’t so much my line of attack on evolution as it is an obvious requirement for the theory of evolution by natural selection, being only one of the various necessary components of TENS.  (We shall set aside, with some amusement, Renee’s insistence that a complete lack of change is evidence of natural selection; the amount of not only groundless assumptions, but <i>intrinsically conflicting</i> assumptions makes it one of my favorite assertions by an evolutionist I’ve heard to date.)</p><p>However, Richard Dawkins should find JB’s concept to be very exciting in one respect, as it offers an explanation for those vanished magic replicators for which there is no evidence, scientific, historical, archeological, or documentary, whatsoever, and of whom he speaks so highly.  The obvious flaw, however, is that the theory is still perfectly falsifiable.  One need only find a few extant DNSP environments to explode it at its weak point, which rests upon the presumed rarity of such non-beasts.  (Remember, the ability of an environment to exert pressure on fitness doesn’t mean that natural selection is actually taking place there, it’s merely a required factor.)</p><p>The arguably more serious flaw in JB’s argument is that he is conflating environments and organisms.  The fact that an organism could – theoretically – become resistant to natural selection is less radical than it sounds; man, extinct species, and domesticated animals are all at the very least resistant to it at this point in time.  But it would be very, very difficult to demonstrate that all modern species, including the supposedly ancient ones, have now reached evolutionary stasis.  Furthermore, this flies straight into the face of most evolutionist assumptions since it tends to imply an amount of “progress” which I understand to be considered rather gauche in certain circles.  If TENS enthusiasts are ever forced to fall back on trying to explain away the complete lack of demonstrable DNSP ecosystems, the theory will be dead and buried.</p></div>",
  "content_text": "Let me get this straight… I am arguing for the falsifiability of evolution?  Well, all right, then:\nVox’s line of attack against evolution is to force it to demonstrate extant ecosystems actually exert DNSP (dynamic natural selection pressure). My model argues present day DNSP may fail to speciate due to late-stage competitive ossification. It avoids falsification even if EVERY extant ecosystem is now incapable of DNSP.\nVox claims my admission of rare DNSP predicts abundant proto forms. I reply that DNSP in proto environments isn’t as rare. Large environments can only become static and unselective after genetic ossification occurs, and improved organisms cease to upset the equilibrium. The remaining dead-end proto forms are then extinguished by more efficient late-stage organisms, sometimes by their own gradually refined descendants. “Living fossils”, so labeled because they are the last surviving examples of obsoleted morphologies, will nevertheless become ossified by minor intertwining adaptations. Thus we see my model predicts NO extant proto forms, because they are inherently inefficient, like unoptimized code.\nFirst, requiring scientific evidence that an ecosystem demonstrate DNSP isn’t so much my line of attack on evolution as it is an obvious requirement for the theory of evolution by natural selection, being only one of the various necessary components of TENS.  (We shall set aside, with some amusement, Renee’s insistence that a complete lack of change is evidence of natural selection; the amount of not only groundless assumptions, but\nintrinsically conflicting\nassumptions makes it one of my favorite assertions by an evolutionist I’ve heard to date.)\nHowever, Richard Dawkins should find JB’s concept to be very exciting in one respect, as it offers an explanation for those vanished magic replicators for which there is no evidence, scientific, historical, archeological, or documentary, whatsoever, and of whom he speaks so highly.  The obvious flaw, however, is that the theory is still perfectly falsifiable.  One need only find a few extant DNSP environments to explode it at its weak point, which rests upon the presumed rarity of such non-beasts.  (Remember, the ability of an environment to exert pressure on fitness doesn’t mean that natural selection is actually taking place there, it’s merely a required factor.)\nThe arguably more serious flaw in JB’s argument is that he is conflating environments and organisms.  The fact that an organism could – theoretically – become resistant to natural selection is less radical than it sounds; man, extinct species, and domesticated animals are all at the very least resistant to it at this point in time.  But it would be very, very difficult to demonstrate that all modern species, including the supposedly ancient ones, have now reached evolutionary stasis.  Furthermore, this flies straight into the face of most evolutionist assumptions since it tends to imply an amount of “progress” which I understand to be considered rather gauche in certain circles.  If TENS enthusiasts are ever forced to fall back on trying to explain away the complete lack of demonstrable DNSP ecosystems, the theory will be dead and buried.",
  "tags": [],
  "categories": [],
  "sitemap_lastmod": "2009-07-30T15:57:00+00:00"
}