{
  "url": "https://voxday.net/2009/07/19/mailvox-further-explication/",
  "scraped_at": "2026-01-08T23:01:35.005689",
  "title": "Mailvox: a further explication",
  "date_display": "July 19, 2009",
  "date_iso": "2009-07-19T15:53:00+00:00",
  "date_from_url": "2009-07-19",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>Joseph attempts to summarize my points.  As is so often the case, this proves to be a disastrous endeavor since he is demonstrably incapable of grasping them, let alone responding effectively to them.  My own words are in italics:</p><blockquote><p>Vox: God is a limited being but can know everything. [This is a correct characterization. -VD]</p><p><i>“Furthermore, there is no intrinsic logical bar on a limited being reaching everywhere or knowing everything, as this entirely depends upon the way on the question of whether everything is finite or infinite, the nature of the being’s limits, and the ability of the limited being to extend its reach through other beings.”</i></p><p>Joe: A limited being cannot know everything because of relativistic limitations.</p><p>Actually, there is an intrinsic logical bar to a limited being knowing everything: the general theory of relativity. It is physically impossible for a limited being to know everything, since there are regions of the universe where information cannot be exchanged in any finite amount of time.</p><p>Vox: God is magic, so He doesn’t have to follow the rules. [This is not a correct characterization. -VD]</p><p><i>“Physical limits can’t logically apply to a being who is defined as being supramaterial.”</i></p><p>You claim not to believe in God’s omniscience, and yet here you are making arguments about that. I would have argued that your own “refutation” of Euthyphro [Joseph subsequently corrects himself and substitutes “problem of evil” for “‘refutation’ of Euthyphro” – VD] would have been exactly the type of logical bar to God’s omniscience that you claim does not exist, but I’ve been here long enough to know that day-to-day logical consistency is not your style. [This is downright stupid.  Here Joseph shows his ankle-biting nature by attempting to invent inconsistency on my part rather than recognizing the distinction between a personal belief and an admission of a logical possibility. – VD]</p><p>You wrote: <i>“Second, there is no reason to believe that relativistic limitations apply to the spiritual dimension.”</i></p><p>Relativity is humanity’s reasoning about the nature of space, time, matter and energy. You can claim that the spiritual world has nothing to do with our reasoning about space and time and matter and energy if you wish, but you can’t also claim that consciously departing from reason is itself reasonable.</p><p>You wrote: <i>“If there is one thing we have learned from the history of science, it is that almost everything we know about existence is guaranteed to be incorrect. The irrational and ahistorical position is to assume that science has finally gotten everything right, that the limits of knowledge have been reached, and therefore preclude the possibility of God’s existence.”</i></p><p>The issue of God’s existence is not, strictly speaking, a scientific problem but an epistemological problem: is it rational to believe in the existence of a being that is unlike everything that we rationally know about beings?</p></blockquote><p>Not only is Joseph’s characterization of my argument false, as the comparison between his statements and my words show, but he demonstrates a very limited ability to understand some fairly simple points.  The present understanding of the universe’s physical elements are not “rules”.  The effectiveness of my refutation of Euthyphro is not in question and has been successfully disputed by no one.  That which is presently beyond that understanding is not necessarily magic.  My belief in the Christian God’s Biblical lack of omniscience is totally distinct from my recognition of the logical possibility of a hypothetical creator god’s ability to reach everywhere or know everything.  And “relativity”, both special and general, are more than mere reason, while reason is not limited to consideration of material things.</p><p>Finally, once Joseph realizes that he’s entered untenable ground regarding the dynamic state of scientific knowledge, he hastily attempts an inappropriate retreat to epistemology.  But the answer to his question “is it rational to believe in the existence of a being that is unlike everything that we rationally know about beings?” can only be “it depends on what the evidence for the existence of that being is.”   The reason this retreat is inappropriate is because it transforms the discussion from a general one to a very specific one.</p><p>As most regular readers have already recognized, there is no logical inconsistency here on my part.  There is only the customary inability of a critic to construct a viable critique.</p></div>",
  "content_text": "Joseph attempts to summarize my points.  As is so often the case, this proves to be a disastrous endeavor since he is demonstrably incapable of grasping them, let alone responding effectively to them.  My own words are in italics:\nVox: God is a limited being but can know everything. [This is a correct characterization. -VD]\n“Furthermore, there is no intrinsic logical bar on a limited being reaching everywhere or knowing everything, as this entirely depends upon the way on the question of whether everything is finite or infinite, the nature of the being’s limits, and the ability of the limited being to extend its reach through other beings.”\nJoe: A limited being cannot know everything because of relativistic limitations.\nActually, there is an intrinsic logical bar to a limited being knowing everything: the general theory of relativity. It is physically impossible for a limited being to know everything, since there are regions of the universe where information cannot be exchanged in any finite amount of time.\nVox: God is magic, so He doesn’t have to follow the rules. [This is not a correct characterization. -VD]\n“Physical limits can’t logically apply to a being who is defined as being supramaterial.”\nYou claim not to believe in God’s omniscience, and yet here you are making arguments about that. I would have argued that your own “refutation” of Euthyphro [Joseph subsequently corrects himself and substitutes “problem of evil” for “‘refutation’ of Euthyphro” – VD] would have been exactly the type of logical bar to God’s omniscience that you claim does not exist, but I’ve been here long enough to know that day-to-day logical consistency is not your style. [This is downright stupid.  Here Joseph shows his ankle-biting nature by attempting to invent inconsistency on my part rather than recognizing the distinction between a personal belief and an admission of a logical possibility. – VD]\nYou wrote:\n“Second, there is no reason to believe that relativistic limitations apply to the spiritual dimension.”\nRelativity is humanity’s reasoning about the nature of space, time, matter and energy. You can claim that the spiritual world has nothing to do with our reasoning about space and time and matter and energy if you wish, but you can’t also claim that consciously departing from reason is itself reasonable.\nYou wrote:\n“If there is one thing we have learned from the history of science, it is that almost everything we know about existence is guaranteed to be incorrect. The irrational and ahistorical position is to assume that science has finally gotten everything right, that the limits of knowledge have been reached, and therefore preclude the possibility of God’s existence.”\nThe issue of God’s existence is not, strictly speaking, a scientific problem but an epistemological problem: is it rational to believe in the existence of a being that is unlike everything that we rationally know about beings?\nNot only is Joseph’s characterization of my argument false, as the comparison between his statements and my words show, but he demonstrates a very limited ability to understand some fairly simple points.  The present understanding of the universe’s physical elements are not “rules”.  The effectiveness of my refutation of Euthyphro is not in question and has been successfully disputed by no one.  That which is presently beyond that understanding is not necessarily magic.  My belief in the Christian God’s Biblical lack of omniscience is totally distinct from my recognition of the logical possibility of a hypothetical creator god’s ability to reach everywhere or know everything.  And “relativity”, both special and general, are more than mere reason, while reason is not limited to consideration of material things.\nFinally, once Joseph realizes that he’s entered untenable ground regarding the dynamic state of scientific knowledge, he hastily attempts an inappropriate retreat to epistemology.  But the answer to his question “is it rational to believe in the existence of a being that is unlike everything that we rationally know about beings?” can only be “it depends on what the evidence for the existence of that being is.”   The reason this retreat is inappropriate is because it transforms the discussion from a general one to a very specific one.\nAs most regular readers have already recognized, there is no logical inconsistency here on my part.  There is only the customary inability of a critic to construct a viable critique.",
  "tags": [],
  "categories": [],
  "sitemap_lastmod": "2009-07-19T14:53:00+00:00"
}