{
  "url": "https://voxday.net/2009/07/28/national-review-blows-i/",
  "scraped_at": "2026-01-08T23:02:32.105411",
  "title": "National Review blows it",
  "date_display": "July 28, 2009",
  "date_iso": "2009-07-28T17:15:00+00:00",
  "date_from_url": "2009-07-28",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>The NRO Editors make a factual error in addition to causing one to wonder why they are joining CNN in an attempt <a href=\"http://article.nationalreview.com/?q=ZTRjMTFhMzQxYmEzNjA2YWIwOTU4YWVjNzRmODE2NTI=\">to declare the Obama birth certificate controversy a non-story</a>:</p><blockquote><p>Pres. Barack Obama has a birthday coming up, a week from Tuesday. We hope he takes the day off—or even the whole week, the briefest of respites from his busy schedule of truncating our liberties while exhausting both the public coffers and our patience. The president’s birthday comes to mind because we recently spent some time looking at a photograph of his birth certificate, being held by Joe Miller of Factcheck.org, who took the time to examine it. President Obama was born on August 4, 1961, at 7:24 p.m, in Honolulu County, Hawaii, on the island of Oahu. The serial number on his birth certificate is 010641….  The Hawaiian birth certificate President Obama has produced—the document is formally known as a “certificate of live birth”—bears that information.</p></blockquote><p>The Editors at National Review are flat out wrong.  Demonstrably, provably, and verifiably wrong.  Like so many other Obama defenders, NRO is confusing the CERTIFICATION of live birth that Obama has produced with the original CERTIFICATE of live birth.  One is a green computerized record, the other is the document that records the doctor’s or midwife’s name, his signature, the hospital, and so forth.  The salient point is that Obama has refused to produce the latter and the ever-changing stories – <a href=\"http://www.wnd.com/index.php?fa=PAGE.view&amp;pageId=105233\">WND is now reporting that CNN’s report that Hawaii had destroyed the original documents is false</a> –  lend little confidence to the claim that he is not hiding anything.</p><p>No wonder conservatives have so little trust in the so-called conservative media these days.  Now they appear to be running interference for the Democratic White House in cooperation with CNN.</p></div>",
  "content_text": "The NRO Editors make a factual error in addition to causing one to wonder why they are joining CNN in an attempt\nto declare the Obama birth certificate controversy a non-story\n:\nPres. Barack Obama has a birthday coming up, a week from Tuesday. We hope he takes the day off—or even the whole week, the briefest of respites from his busy schedule of truncating our liberties while exhausting both the public coffers and our patience. The president’s birthday comes to mind because we recently spent some time looking at a photograph of his birth certificate, being held by Joe Miller of Factcheck.org, who took the time to examine it. President Obama was born on August 4, 1961, at 7:24 p.m, in Honolulu County, Hawaii, on the island of Oahu. The serial number on his birth certificate is 010641….  The Hawaiian birth certificate President Obama has produced—the document is formally known as a “certificate of live birth”—bears that information.\nThe Editors at National Review are flat out wrong.  Demonstrably, provably, and verifiably wrong.  Like so many other Obama defenders, NRO is confusing the CERTIFICATION of live birth that Obama has produced with the original CERTIFICATE of live birth.  One is a green computerized record, the other is the document that records the doctor’s or midwife’s name, his signature, the hospital, and so forth.  The salient point is that Obama has refused to produce the latter and the ever-changing stories –\nWND is now reporting that CNN’s report that Hawaii had destroyed the original documents is false\n–  lend little confidence to the claim that he is not hiding anything.\nNo wonder conservatives have so little trust in the so-called conservative media these days.  Now they appear to be running interference for the Democratic White House in cooperation with CNN.",
  "tags": [],
  "categories": [],
  "sitemap_lastmod": "2009-07-28T16:15:00+00:00"
}