{
  "url": "https://voxday.net/2009/07/29/obamacare-will-restrict-divorce/",
  "scraped_at": "2026-01-08T23:02:33.917948",
  "title": "Obamacare and divorce restrictions",
  "date_display": "July 29, 2009",
  "date_iso": "2009-07-29T08:48:00+00:00",
  "date_from_url": "2009-07-29",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>The idea that nationalized health care will lead to divorce restrictions sounds absurd.  Of course, less than 20 years ago, the idea that smoking might be banned in public sounded equally absurd.  Arguably more so, in fact, since there wasn’t a clear line of precedent for it, while there now appears to be <a href=\"http://www.newser.com/story/65448/divorce-may-permanently-damage-health.html\">a genuine scientific case</a> for restricting or banning divorce in the interest of reducing health care costs:</p><blockquote><p>The end of a marriage means the end of good health for many people, a new study finds. Researchers discovered that people who lost a spouse, whether through divorce or death, were roughly 20% more likely to suffer chronic health problems even if they later remarried, HealthDay reports. The scientists believe the stress of loss causes lasting physical and emotional damage.</p></blockquote><p>I’m assuming, of course, that the government health czars will be reasonable enough to permit marriages to end in the event of one party’s death.  I also find it amusing to read the quoted expert’s non sequitur in which it is declared that these results “certainly don’t mean people should stay in high-conflict or abusive marriages for the sake of their health” even though that’s EXACTLY the conclusion that logic dictates.</p><p>Interestingly, that 20 percent figure happens to be exactly the same risk that is reported to be the “statistically significant and consistent association between lung cancer risk in spouses of smokers and exposure to secondhand tobacco smoke from the spouse who smokes” for women.  One wonders if that same expert would so confidently declare that this certainly doesn’t mean women should object to their husbands smoking for the sake of their health.</p></div>",
  "content_text": "The idea that nationalized health care will lead to divorce restrictions sounds absurd.  Of course, less than 20 years ago, the idea that smoking might be banned in public sounded equally absurd.  Arguably more so, in fact, since there wasn’t a clear line of precedent for it, while there now appears to be\na genuine scientific case\nfor restricting or banning divorce in the interest of reducing health care costs:\nThe end of a marriage means the end of good health for many people, a new study finds. Researchers discovered that people who lost a spouse, whether through divorce or death, were roughly 20% more likely to suffer chronic health problems even if they later remarried, HealthDay reports. The scientists believe the stress of loss causes lasting physical and emotional damage.\nI’m assuming, of course, that the government health czars will be reasonable enough to permit marriages to end in the event of one party’s death.  I also find it amusing to read the quoted expert’s non sequitur in which it is declared that these results “certainly don’t mean people should stay in high-conflict or abusive marriages for the sake of their health” even though that’s EXACTLY the conclusion that logic dictates.\nInterestingly, that 20 percent figure happens to be exactly the same risk that is reported to be the “statistically significant and consistent association between lung cancer risk in spouses of smokers and exposure to secondhand tobacco smoke from the spouse who smokes” for women.  One wonders if that same expert would so confidently declare that this certainly doesn’t mean women should object to their husbands smoking for the sake of their health.",
  "tags": [],
  "categories": [],
  "sitemap_lastmod": "2009-07-29T07:48:00+00:00"
}