{
  "url": "https://voxday.net/2009/07/13/prechter-lecture/",
  "scraped_at": "2026-01-08T23:01:03.138231",
  "title": "Prechter lecture",
  "date_display": "July 13, 2009",
  "date_iso": "2009-07-13T11:45:00+00:00",
  "date_from_url": "2009-07-13",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>Bob Prechter began his lecture with an overview of basic Elliott Wave theory.  Five waves in impulse wave, odd waves trend, even waves corrective.  Three waves indicate countertrend.  He talked about long term trends being very difficult to reverse and noted that Random Walk theory has been completely exploded by pattern recognition and statistical improbability of traders being successful over the long term.  The question is no longer if there are patterns in the financial markets, but if the patterns can be described by Elliott Wave theory or not.  Deflation, not hyperinflation… <a href=\"http://www.elliottwave.com/s.asp?cn=mta509bp&amp;url=/DeflationEssays/deflation_full.pdf\">deflation essays available for free download</a>.  Inflationists don’t understand impact of debt imploding.  I’ve been agnostic, but it’s clear that nothing has played out the way the inflationists projected thus far.</p><p>Just to point out that he hasn’t always been bearish, Prechter showed long term history of oil prices from 1859 to 2009.  Very good forecasts by Elliott Wave International people from 1993 through 2009 contra those by mainstream forecasters who are obviously doing nothing more than projecting linear trends from the latest turn.  Explained why commodity 5th wave blowoffs tend to be bigger and spikier than equity 5th waves.  Commodity throwovers tend to cross the long-term channels on both sides.  Says we’re now facing the biggest bear market in oil since 1915, which is an extraordinarily contrarian position at the moment.  Comment – does this suggest we’re looking at a new energy source or complete economic collapse?  I’d hope the former.</p><p>Very interesting section on distinguishing finance from economics.  Financial charts show no equilibrium prices; sellers are not supply, not producers.  The law of supply and demand doesn’t apply.  Comment – so freaking obvious in retrospect, can’t believe I never saw this.  Just look at the damn charts, idiot!  Indicates ABC mechanism is irrelevant whether shifting goods dynamic or limits of demand.  Have to write footnote for new book, possibly appendix if time.  I ask Prechter when he started thinking down these lines as it’s not clearly articulated in the books or the EWT, he says around 2003-2004.  Paper published in academic journal: <a href=\"http://www.socionomics.net/pdf/JBF_Financial-Economic-Dichotomy.pdf\">The Financial/Economic Dichotomy in Social Behavioral Dynamics: The Socionomic Perspective</a>.</p><p>Another question about knowledge of Elliott Waves rendering them useless.  Prechter laughs.  No shortage of evidence that monetary and fiscal authorities not geniuses capable of ignoring political pressure, let alone mass emotion.  Scary symmetry between 1921-1929 and 1974-2000 DJIA charts; look almost identical except latter is 3:1 in time and percentage terms.  I was thinking 2x, maybe too conservative.  Other indicators include dividend yield, P/E, and bond yield/stock yield ratio.  All range 2x to 3x higher than 1929.  Could have thrown in relative stimulus packages, credit expansion, and bank failures as percent deposits too.</p><p>Seemingly off-base call of 2000 top actually looks quite good <a href=\"http://home.earthlink.net/~intelligentbear/com-dow-au.htm\">in terms of Dow/Gold</a>.  Dow/Gold went from 1 in 1980 to 42 (actually 43.7) in 2000.  Now down to around 10.  Nominal dollar Dow confuses things, surprise surprise, as corrected for inflation Dow would have topped at 847 in 2000, not 14k+.  Tends to show that appearance of massive modern wealth is mostly illusory, with the perception upheld by technological advances.</p><p>About 20 questions, most technical.  I only took notes on those I found interesting:</p><p>Q1- what would make him bullish?  New Dow high in gold terms to reverse Grand Supercycle call.  In other words, not bloody likely.<br>Q2- Best opportunity approaching appears to be SP500 hitting 1k to 1100.  V. nice to ride Wave 3 down, but watch counterparties.  One can still lose on a winning bet if the losing bank goes under.<br>Q3- USD strong when market weak.  Should continue to fall as rally continues, then strengthen.<br>Q4- Social mood is the engine of history.  Great book title there.  Prechter is clearly well-grounded: “Sometimes they say you’re a genius, sometimes they say you’re a complete idiot.  The truth is somewhere in between.”  Not interested in trader lifestyle, only did the 1984 trading championship to walk the talk.  440% in four months should more than suffice.<br>Q5- Tops are diffuse, bottoms tend to be simultaneous.  Don’t know if that applies to this depression since 1929 tops were simultaneous and bottoms 1931 Japan, 1932 Europe, and 1933 USA.<br>Q6- When will this rally end?  2nd wave retracements are strong, not enough bulls yet.  Should see 95+ before it’s over.<br>Q7- I ask about gold dollar price being less relevant since also insurance against dollar disappearing and value of X/0 being infinite.  Prechter answers math, not so much point.  (Yes, X/0=0, but analogy not equation.) Leaves impression that he’s dubious about dollar replacement, but admits store of value beyond market trading could apply since gold most likely replacement when fiat fails.  Doesn’t include Dow/Gold chart in monthly updates because traders don’t care, that’s why they’re in the EWT every four months or so.</br></br></br></br></br></br></p><p>Excellent lecture, one of the best I’ve seen.  Perhaps a bit more theoretical than some of the traders there were expecting, but Prechter’s not afraid to give specifics when asked.  Highly recommended, notes don’t do justice to the give-and-take during the last hour.</p></div>",
  "content_text": "Bob Prechter began his lecture with an overview of basic Elliott Wave theory.  Five waves in impulse wave, odd waves trend, even waves corrective.  Three waves indicate countertrend.  He talked about long term trends being very difficult to reverse and noted that Random Walk theory has been completely exploded by pattern recognition and statistical improbability of traders being successful over the long term.  The question is no longer if there are patterns in the financial markets, but if the patterns can be described by Elliott Wave theory or not.  Deflation, not hyperinflation…\ndeflation essays available for free download\n.  Inflationists don’t understand impact of debt imploding.  I’ve been agnostic, but it’s clear that nothing has played out the way the inflationists projected thus far.\nJust to point out that he hasn’t always been bearish, Prechter showed long term history of oil prices from 1859 to 2009.  Very good forecasts by Elliott Wave International people from 1993 through 2009 contra those by mainstream forecasters who are obviously doing nothing more than projecting linear trends from the latest turn.  Explained why commodity 5th wave blowoffs tend to be bigger and spikier than equity 5th waves.  Commodity throwovers tend to cross the long-term channels on both sides.  Says we’re now facing the biggest bear market in oil since 1915, which is an extraordinarily contrarian position at the moment.  Comment – does this suggest we’re looking at a new energy source or complete economic collapse?  I’d hope the former.\nVery interesting section on distinguishing finance from economics.  Financial charts show no equilibrium prices; sellers are not supply, not producers.  The law of supply and demand doesn’t apply.  Comment – so freaking obvious in retrospect, can’t believe I never saw this.  Just look at the damn charts, idiot!  Indicates ABC mechanism is irrelevant whether shifting goods dynamic or limits of demand.  Have to write footnote for new book, possibly appendix if time.  I ask Prechter when he started thinking down these lines as it’s not clearly articulated in the books or the EWT, he says around 2003-2004.  Paper published in academic journal:\nThe Financial/Economic Dichotomy in Social Behavioral Dynamics: The Socionomic Perspective\n.\nAnother question about knowledge of Elliott Waves rendering them useless.  Prechter laughs.  No shortage of evidence that monetary and fiscal authorities not geniuses capable of ignoring political pressure, let alone mass emotion.  Scary symmetry between 1921-1929 and 1974-2000 DJIA charts; look almost identical except latter is 3:1 in time and percentage terms.  I was thinking 2x, maybe too conservative.  Other indicators include dividend yield, P/E, and bond yield/stock yield ratio.  All range 2x to 3x higher than 1929.  Could have thrown in relative stimulus packages, credit expansion, and bank failures as percent deposits too.\nSeemingly off-base call of 2000 top actually looks quite good\nin terms of Dow/Gold\n.  Dow/Gold went from 1 in 1980 to 42 (actually 43.7) in 2000.  Now down to around 10.  Nominal dollar Dow confuses things, surprise surprise, as corrected for inflation Dow would have topped at 847 in 2000, not 14k+.  Tends to show that appearance of massive modern wealth is mostly illusory, with the perception upheld by technological advances.\nAbout 20 questions, most technical.  I only took notes on those I found interesting:\nQ1- what would make him bullish?  New Dow high in gold terms to reverse Grand Supercycle call.  In other words, not bloody likely.\nQ2- Best opportunity approaching appears to be SP500 hitting 1k to 1100.  V. nice to ride Wave 3 down, but watch counterparties.  One can still lose on a winning bet if the losing bank goes under.\nQ3- USD strong when market weak.  Should continue to fall as rally continues, then strengthen.\nQ4- Social mood is the engine of history.  Great book title there.  Prechter is clearly well-grounded: “Sometimes they say you’re a genius, sometimes they say you’re a complete idiot.  The truth is somewhere in between.”  Not interested in trader lifestyle, only did the 1984 trading championship to walk the talk.  440% in four months should more than suffice.\nQ5- Tops are diffuse, bottoms tend to be simultaneous.  Don’t know if that applies to this depression since 1929 tops were simultaneous and bottoms 1931 Japan, 1932 Europe, and 1933 USA.\nQ6- When will this rally end?  2nd wave retracements are strong, not enough bulls yet.  Should see 95+ before it’s over.\nQ7- I ask about gold dollar price being less relevant since also insurance against dollar disappearing and value of X/0 being infinite.  Prechter answers math, not so much point.  (Yes, X/0=0, but analogy not equation.) Leaves impression that he’s dubious about dollar replacement, but admits store of value beyond market trading could apply since gold most likely replacement when fiat fails.  Doesn’t include Dow/Gold chart in monthly updates because traders don’t care, that’s why they’re in the EWT every four months or so.\nExcellent lecture, one of the best I’ve seen.  Perhaps a bit more theoretical than some of the traders there were expecting, but Prechter’s not afraid to give specifics when asked.  Highly recommended, notes don’t do justice to the give-and-take during the last hour.",
  "tags": [],
  "categories": [],
  "sitemap_lastmod": "2009-07-13T10:45:00+00:00"
}