{
  "url": "https://voxday.net/2009/07/22/proof-of-evolution-disproved-as/",
  "scraped_at": "2026-01-08T23:01:55.192787",
  "title": "Proof of evolution disproved… as expected",
  "date_display": "July 22, 2009",
  "date_iso": "2009-07-22T09:54:00+00:00",
  "date_from_url": "2009-07-22",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>You may recall that I viewed the announcement of the landmark discovery of <i>Darwinius masillae</i> in May as <a href=\"http://www.milobookclub.com/2009/05/19/falsification-2/\">an ideal candidate for the falsification of Darwinism</a> as well as the Neo-Darwinian Theory of Evolution by Natural Selection.  Or, at least, in the scientific basis for many individuals belief in such things.  After all, “Ida” was described “in no uncertain terms as the missing link between us humans and our primate kin. In news reports, team members called her ‘the eighth wonder of the world,’ ‘the Holy Grail,’ and ‘a Rosetta Stone.'”  And who can forget how researchers said that “proof of this transitional species finally confirms Charles Darwin’s theory of evolution, and the then radical, outlandish ideas he came up with during his time aboard the Beagle.”</p><p>Of course, it didn’t take long for other scientific skeptics <a href=\"http://www.milobookclub.com/2009/05/22/interpretive-hoax/\">to cast doubt</a> on the significance of this supposed wonder of the scientific world.  And now, the ever-mutable scientific consensus appears to be in the process of concluding that <i>Darwinius masillae</i> is of <a href=\"http://www.scientificamerican.com/article.cfm?id=weak-link-fossil-darwinius\">little more significance to the theory of human evolution </a>than Piltdown Man or any other of the many scientific frauds and exaggerations of the past.</p><blockquote><p>Critics concur that Ida is an adapiform, but they dispute the alleged ties to anthropoids. Robert Martin of the Field Museum in Chicago charges that some of the traits used to align Ida with the anthropoids do not in fact support such a relationship. Fusion of the lower jaw, for instance, is not present in the earliest unequivocal anthropoids, suggesting that it was not an ancestral feature of this group. Moreover, the trait has arisen independently in several lineages of mammals—including some lemurs—through convergent evolution. Martin further notes that Ida also lacks a defining feature of the anthropoids: a bony wall at the back of the eye socket. “I am utterly convinced that Darwinius has nothing whatsoever to do with the origin of higher primates,” he declares.</p></blockquote><p>I will now await with interest for the various devotees of the cult of Darwin to admit one of the three logical possibilities that stem from this entirely predictable – and predicted – outcome:</p><p>1) The <i>Darwinius masillae</i> incident means that the theory of human evolution by natural selection remains unproved.</p><p>2) The <i>Darwinius masillae</i> incident proves that scientific assertions about the factual scientific basis for the theory of human evolution by natural selection are not intrinsically reliable.</p><p>3) The <i>Darwinius masillae</i> incident is irrelevant because your belief in the theory of human evolution by natural selection is not based on science.</p></div>",
  "content_text": "You may recall that I viewed the announcement of the landmark discovery of\nDarwinius masillae\nin May as\nan ideal candidate for the falsification of Darwinism\nas well as the Neo-Darwinian Theory of Evolution by Natural Selection.  Or, at least, in the scientific basis for many individuals belief in such things.  After all, “Ida” was described “in no uncertain terms as the missing link between us humans and our primate kin. In news reports, team members called her ‘the eighth wonder of the world,’ ‘the Holy Grail,’ and ‘a Rosetta Stone.'”  And who can forget how researchers said that “proof of this transitional species finally confirms Charles Darwin’s theory of evolution, and the then radical, outlandish ideas he came up with during his time aboard the Beagle.”\nOf course, it didn’t take long for other scientific skeptics\nto cast doubt\non the significance of this supposed wonder of the scientific world.  And now, the ever-mutable scientific consensus appears to be in the process of concluding that\nDarwinius masillae\nis of\nlittle more significance to the theory of human evolution\nthan Piltdown Man or any other of the many scientific frauds and exaggerations of the past.\nCritics concur that Ida is an adapiform, but they dispute the alleged ties to anthropoids. Robert Martin of the Field Museum in Chicago charges that some of the traits used to align Ida with the anthropoids do not in fact support such a relationship. Fusion of the lower jaw, for instance, is not present in the earliest unequivocal anthropoids, suggesting that it was not an ancestral feature of this group. Moreover, the trait has arisen independently in several lineages of mammals—including some lemurs—through convergent evolution. Martin further notes that Ida also lacks a defining feature of the anthropoids: a bony wall at the back of the eye socket. “I am utterly convinced that Darwinius has nothing whatsoever to do with the origin of higher primates,” he declares.\nI will now await with interest for the various devotees of the cult of Darwin to admit one of the three logical possibilities that stem from this entirely predictable – and predicted – outcome:\n1) The\nDarwinius masillae\nincident means that the theory of human evolution by natural selection remains unproved.\n2) The\nDarwinius masillae\nincident proves that scientific assertions about the factual scientific basis for the theory of human evolution by natural selection are not intrinsically reliable.\n3) The\nDarwinius masillae\nincident is irrelevant because your belief in the theory of human evolution by natural selection is not based on science.",
  "tags": [],
  "categories": [],
  "sitemap_lastmod": "2009-07-22T08:54:00+00:00"
}