{
  "url": "https://voxday.net/2009/07/21/reading-lis-3/",
  "scraped_at": "2026-01-08T23:01:49.600594",
  "title": "Reading List",
  "date_display": "July 21, 2009",
  "date_iso": "2009-07-21T14:01:00+00:00",
  "date_from_url": "2009-07-21",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>1. <i>Spook Country</i> by William Gibson</p><p>2. <i>The Cambridge Medieval History Series vol I: The Christian Era</i> edited by J.B. Bury</p><p>3. <i>The Age of Turbulence</i> by Alan Greenspan</p><p><i>The Dosadi Experiment</i> by Frank Herbert: 7/10.  I was surprised to learn that this novel was published 13 years after <i>Dune</i>, since the ideas it contains appear to be rather less well-formed and less interesting than those in the earlier book.</p><p><i>Manias, Panics and Crashes: A History of Financial Crises</i> by Charles Kindleberger: 6/10.  A detailed, but unsystematic chronicle of historical financial crises.  Kindleberger describes these events in an engaging manner, but is handicapped by having no coherent economic or socionomic philosophy through which he can explain why they took place.</p><p><i>The Darwath Trilogy</i> by Barbara Hambly: 8/10.  I read <i>The Time of the Dark</i> as a boy and was deeply impressed by the awesome horror of the Dark.  They must be one of the most inherently frightening monsters in the history of the fantasy genre.  But the books are even better when seen from the perspective of an adult writer, as the scope of the books and the way in which they draw on various scientific disciplines as an integral part of the plot is truly impressive.</p></div>",
  "content_text": "1.\nSpook Country\nby William Gibson\n2.\nThe Cambridge Medieval History Series vol I: The Christian Era\nedited by J.B. Bury\n3.\nThe Age of Turbulence\nby Alan Greenspan\nThe Dosadi Experiment\nby Frank Herbert: 7/10.  I was surprised to learn that this novel was published 13 years after\nDune\n, since the ideas it contains appear to be rather less well-formed and less interesting than those in the earlier book.\nManias, Panics and Crashes: A History of Financial Crises\nby Charles Kindleberger: 6/10.  A detailed, but unsystematic chronicle of historical financial crises.  Kindleberger describes these events in an engaging manner, but is handicapped by having no coherent economic or socionomic philosophy through which he can explain why they took place.\nThe Darwath Trilogy\nby Barbara Hambly: 8/10.  I read\nThe Time of the Dark\nas a boy and was deeply impressed by the awesome horror of the Dark.  They must be one of the most inherently frightening monsters in the history of the fantasy genre.  But the books are even better when seen from the perspective of an adult writer, as the scope of the books and the way in which they draw on various scientific disciplines as an integral part of the plot is truly impressive.",
  "tags": [],
  "categories": [],
  "sitemap_lastmod": "2009-07-21T13:01:00+00:00"
}