{
  "url": "https://voxday.net/2009/07/22/simulation-is-not-science/",
  "scraped_at": "2026-01-08T23:01:58.969948",
  "title": "Simulation is not science",
  "date_display": "July 22, 2009",
  "date_iso": "2009-07-22T17:15:00+00:00",
  "date_from_url": "2009-07-22",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>“Reliabilities of identifying positive selection by the branch-site and the site-prediction methods” is merely one piece of evidence indicating that <a href=\"http://live.psu.edu/story/38686\">TENS rests on much shakier empirical foundations</a> than most scientists realize:</p><blockquote><p>“Our finding means that hundreds of published studies on natural selection may have drawn incorrect conclusions,” said Masatoshi Nei, Penn State Evan Pugh Professor of Biology and the team’s leader….  To demonstrate the faultiness of the statistical methods, Nei’s team compiled data collected by their Emory University colleague, Shozo Yokoyama, on the genes that control the abilities of fish to see light at different water depths and on the genes that control color vision in a variety of animals. The team used these data to compare statistically predicted sites of natural selection with experimentally determined sites. They found that the statistical methods rarely predicted the actual sites of natural selection, which had been identified by Yokoyama through experiments.</p><p>“In some cases, statistical method completely failed to identify the true sites where natural selection occurred,” said Nei. “This particular exercise demonstrated the difficulty with which statistical methods are able to detect natural selection.”</p><p>To demonstrate how small sample sizes can lead to incorrect results, the team used computer simulations to examine the evolution of genes in three primates: humans, chimpanzees and macaques. The scientists mimicked the procedures used by the authors of a 2007 paper, which applied the branch-site method to 14,000 orthologous genes — genes that are genealogically identical among different species — and which found that the method predicted selection in 32 of the genes. Nei and his team also studied selection using Fisher’s exact test, but this test did not detect any selection.</p><p>“The results indicate that the number of nucleotide substitutions that occurred were too small to detect any selection; therefore, all of the 32 cases obtained by the branch-site method must be false positives,” said Nozawa.</p><p>“These statistical methods have led many scientists to believe that natural selection acted on many more genes in humans than it did in chimpanzees, and they conclude that this is the reason why humans have developed large brains and other morphological differences,” said Nei. “But I believe that these scientists are wrong. The number of genes that have undergone selection should be nearly the same in humans and chimps. The differences that make us human are more likely due to mutations that were favorable to us in the particular environment into which we moved, and these mutations then accumulated through time.”</p><p>Nei said that to obtain a more realistic picture of natural selection, biologists should pair experimental data with their statistical data whenever possible. <b>Scientists usually do not use experimental data because such experiments can be difficult to conduct and because they are very time-consuming.</b></p></blockquote><p>In other words, scientists usually do not bother to do science because it is difficult and it takes too long.  But, non-scientists should still trust their results because on those rare occasions that scientists actually do make use of the scientific method, it works rather well.  And, of course, one should trust biologists <a href=\"http://1.bp.blogspot.com/_3UXl0oMYPLs/SXZHIRt_oKI/AAAAAAAAAFw/j6kmhIdEQTI/s1600-h/ATHEIST+LOGIC.jpg\">because physicists get amazingly accurate results</a>.</p><p>Needless to say, the quality of their rationalizations tends to indicate that scientists don’t often make use of logic either.</p></div>",
  "content_text": "“Reliabilities of identifying positive selection by the branch-site and the site-prediction methods” is merely one piece of evidence indicating that\nTENS rests on much shakier empirical foundations\nthan most scientists realize:\n“Our finding means that hundreds of published studies on natural selection may have drawn incorrect conclusions,” said Masatoshi Nei, Penn State Evan Pugh Professor of Biology and the team’s leader….  To demonstrate the faultiness of the statistical methods, Nei’s team compiled data collected by their Emory University colleague, Shozo Yokoyama, on the genes that control the abilities of fish to see light at different water depths and on the genes that control color vision in a variety of animals. The team used these data to compare statistically predicted sites of natural selection with experimentally determined sites. They found that the statistical methods rarely predicted the actual sites of natural selection, which had been identified by Yokoyama through experiments.\n“In some cases, statistical method completely failed to identify the true sites where natural selection occurred,” said Nei. “This particular exercise demonstrated the difficulty with which statistical methods are able to detect natural selection.”\nTo demonstrate how small sample sizes can lead to incorrect results, the team used computer simulations to examine the evolution of genes in three primates: humans, chimpanzees and macaques. The scientists mimicked the procedures used by the authors of a 2007 paper, which applied the branch-site method to 14,000 orthologous genes — genes that are genealogically identical among different species — and which found that the method predicted selection in 32 of the genes. Nei and his team also studied selection using Fisher’s exact test, but this test did not detect any selection.\n“The results indicate that the number of nucleotide substitutions that occurred were too small to detect any selection; therefore, all of the 32 cases obtained by the branch-site method must be false positives,” said Nozawa.\n“These statistical methods have led many scientists to believe that natural selection acted on many more genes in humans than it did in chimpanzees, and they conclude that this is the reason why humans have developed large brains and other morphological differences,” said Nei. “But I believe that these scientists are wrong. The number of genes that have undergone selection should be nearly the same in humans and chimps. The differences that make us human are more likely due to mutations that were favorable to us in the particular environment into which we moved, and these mutations then accumulated through time.”\nNei said that to obtain a more realistic picture of natural selection, biologists should pair experimental data with their statistical data whenever possible.\nScientists usually do not use experimental data because such experiments can be difficult to conduct and because they are very time-consuming.\nIn other words, scientists usually do not bother to do science because it is difficult and it takes too long.  But, non-scientists should still trust their results because on those rare occasions that scientists actually do make use of the scientific method, it works rather well.  And, of course, one should trust biologists\nbecause physicists get amazingly accurate results\n.\nNeedless to say, the quality of their rationalizations tends to indicate that scientists don’t often make use of logic either.",
  "tags": [],
  "categories": [],
  "sitemap_lastmod": "2009-07-22T16:15:00+00:00"
}