{
  "url": "https://voxday.net/2009/07/08/when-women-suffer/",
  "scraped_at": "2026-01-08T23:00:46.694871",
  "title": "When women suffer",
  "date_display": "July 8, 2009",
  "date_iso": "2009-07-08T19:28:00+00:00",
  "date_from_url": "2009-07-08",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>Forget the poor guy who <a href=\"http://www.time.com/time/business/article/0,8599,1909025,00.html?xid=rss-topstories-cnnpartner?artId=1909025?contType=article?chn=bizTech\">just lost his job</a>.  The real problem is the terrible pressure to provide for the family this now puts on his working wife!</p><blockquote><p>When she first heard the news, “there was a sinking in the pit of my stomach — and tears,” she says. “It was just devastating. It’s completely outside your power, and now you’re responsible for the entire family,” says Janosek, who like many wives who work, brought in roughly one-third of the family’s income but is now the principal breadwinner. “You worry about losing everything. It’s just overwhelmingly scary — and there are no resources for spouses.” Janosek was able to increase her work hours, and her husband now has some contract work, which has helped — but it hardly solves the problem. “I am still angry about it,” she says.</p></blockquote><p>Stories like this demonstrate what a complete crock the whole equality charade is.  Why in the name of Betty Friedan should anyone feel any sympathy whatsoever for a married woman suddenly being handed the same responsibility borne <i>by most married men throughout the entire history of civilization?</i></p><p>It’s rather like the classic joke about The New York Times headline about the world ending: <i>Women and Minorities To Suffer Most.</i></p></div>",
  "content_text": "Forget the poor guy who\njust lost his job\n.  The real problem is the terrible pressure to provide for the family this now puts on his working wife!\nWhen she first heard the news, “there was a sinking in the pit of my stomach — and tears,” she says. “It was just devastating. It’s completely outside your power, and now you’re responsible for the entire family,” says Janosek, who like many wives who work, brought in roughly one-third of the family’s income but is now the principal breadwinner. “You worry about losing everything. It’s just overwhelmingly scary — and there are no resources for spouses.” Janosek was able to increase her work hours, and her husband now has some contract work, which has helped — but it hardly solves the problem. “I am still angry about it,” she says.\nStories like this demonstrate what a complete crock the whole equality charade is.  Why in the name of Betty Friedan should anyone feel any sympathy whatsoever for a married woman suddenly being handed the same responsibility borne\nby most married men throughout the entire history of civilization?\nIt’s rather like the classic joke about The New York Times headline about the world ending:\nWomen and Minorities To Suffer Most.",
  "tags": [],
  "categories": [],
  "sitemap_lastmod": "2009-07-08T18:28:00+00:00"
}