{
  "url": "https://voxday.net/2009/07/13/wnd-column_13-4/",
  "scraped_at": "2026-01-08T23:01:05.007460",
  "title": "WND column",
  "date_display": "July 13, 2009",
  "date_iso": "2009-07-13T11:55:00+00:00",
  "date_from_url": "2009-07-13",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p><b><a href=\"http://www.wnd.com/index.php?pageId=103763\">History’s engine and the great bear wave</a></b></p><p>I had the good fortune to attend a lecture given by Robert Prechter this weekend. Prechter is the originator of the fascinating neo-science of socionomics, about which I have previously written, and the purpose of his lecture was to update the Elliott Wave interpretations provided in his 2002 book entitled “Conquer the Crash.” His fundamental thesis is that the U.S. economy is now several years into a depression that will be an order of magnitude larger than the Great Depression of 1929.</p><p>On a related note, <a href=\"http://washington.bizjournals.com/washington/stories/2009/07/06/daily39.html\">a recent report from the Washington Business Journal</a> suggests that my estimate in the column of failed bank deposits running 0.77 percent of total bank deposits this year may be too conservative: <i>The Federal Deposit Insurance Corp. is gearing up to handle a large number of bank failures expected as a result of bad mortgages, both in residential and commercial real estate, an economist said Tuesday.  “They know they’re going to take down a large number of banks and they can’t do it until they’re staffed up,” said Mark Dotzour, chief economist and director of research for the Real Estate Center at Texas A&amp;M University.</i></p></div>",
  "content_text": "History’s engine and the great bear wave\nI had the good fortune to attend a lecture given by Robert Prechter this weekend. Prechter is the originator of the fascinating neo-science of socionomics, about which I have previously written, and the purpose of his lecture was to update the Elliott Wave interpretations provided in his 2002 book entitled “Conquer the Crash.” His fundamental thesis is that the U.S. economy is now several years into a depression that will be an order of magnitude larger than the Great Depression of 1929.\nOn a related note,\na recent report from the Washington Business Journal\nsuggests that my estimate in the column of failed bank deposits running 0.77 percent of total bank deposits this year may be too conservative:\nThe Federal Deposit Insurance Corp. is gearing up to handle a large number of bank failures expected as a result of bad mortgages, both in residential and commercial real estate, an economist said Tuesday.  “They know they’re going to take down a large number of banks and they can’t do it until they’re staffed up,” said Mark Dotzour, chief economist and director of research for the Real Estate Center at Texas A&M University.",
  "tags": [],
  "categories": [],
  "sitemap_lastmod": "2009-07-13T10:55:00+00:00"
}