{
  "url": "https://voxday.net/2005/06/11/blogstar/",
  "scraped_at": "2026-01-08T20:06:49.770302",
  "title": "Blogstar",
  "date_display": "June 11, 2005",
  "date_iso": "2005-06-11T16:03:00+00:00",
  "date_from_url": "2005-06-11",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p><a href=\"http://difster.blogspot.com/\">Difster</a> blogs on liberty:</p><blockquote><p>Over the years I have noticed that most people really don’t understand<br>the core principles of liberty. There is no higher ideal to aim for in<br>this life than to secure liberty for ourselves, and by extension our<br>countrymen.</br></br></br></p><p>There are three core principles of liberty:</p><p> 1. I belong to myself and everything that I own belongs to me. No<br>one has the right to deprive me of what I own without my consent.<br> 2. I can do as I please so long as it does not interfere with the<br>liberty of others.<br> 3. Anyone who deprives others of their liberty should be punished<br>in a manner worthy of the violation but with solemn respect for<br>justice and mercy.</br></br></br></br></br></br></p><p>If there could ever be such a thing as world peace, the principles<br>outlined above would usher it down aisle where it would be wed with<br>prosperity unlike the world has ever seen.</br></br></p><p>We do require some government and where none exists, it will spring<br>up. Government, wherever it exists should be heavily shackled and<br>released only to perform a very narrow function. When government is<br>out exercising its power, there should be men of honor and valor,<br>armed and waiting to subdue it at the slightest provocation.</br></br></br></br></p><p>The more government we have, the less freedom we have because<br>government always tends toward tyranny. The corollary to this is that<br>as the population to be governed grows larger, the opportunities to<br>oppress increase. China should serve as a sterling example of this.<br>Here in the United States, cities such as Los Angeles, New York and<br>Chicago are living laboratories of this principle.</br></br></br></br></br></p><p>I should not have liberty because the government grants me liberty. I<br>should have liberty in spite of the inevitable attempt of government<br>to deprive me of it because it is my due. With that in mind, I should<br>not willingly engage in activities that deprive others their liberty.</br></br></br></p><p>In his letter to the church at Galatia, the Apostle Paul exhorts them:<br>“It was for freedom that Christ set us free; therefore keep standing<br>firm and do not be subject again to a yoke of slavery.” (Galatians<br>5:1, NASB). In context, we must realize that this verse addresses the<br>slavery of sin and obligatory religion compared to having spiritual<br>freedom through Jesus. I would encourage you to read Galatians<br>chapters 4 &amp; 5 and think of it as a model for our civil liberties. Pay<br>close attention to Gal. 4:13-14: “For you were called to freedom,<br>brethren; only do not turn your freedom in to an opportunity for the<br>flesh, but through love, serve one another. For the whole law is<br>fulfilled in one word, in the statement ‘You shall love your neighbor<br>as yourself.'” These chapters should still be applied to their<br>intended use, I’m referring to them here as a type and shadow of our<br>mortal liberty.</br></br></br></br></br></br></br></br></br></br></br></br></br></p><p>It is apparent that our liberties are being eroded on a local, national and global level. We are well on our way toward global governance. The not-so-secret conspirators are claiming power over more and more aspects of our lives. Students of the Bible already know how bad it’s going to get before the end. What we don’t know is when it ends. In the mean time, we must educate those who are ignorant of the principles of liberty and be a shining example of it to our families, friends and communities. Taking up the cause of liberty is much like the work of preaching the Gospel; it requires personal sacrifice and the willingness to stand by your principles in the face of severe opposition. If you aren’t willing to do it, don’t expect anyone to do it for you.</p></blockquote></div>",
  "content_text": "Difster\nblogs on liberty:\nOver the years I have noticed that most people really don’t understand\nthe core principles of liberty. There is no higher ideal to aim for in\nthis life than to secure liberty for ourselves, and by extension our\ncountrymen.\nThere are three core principles of liberty:\n1. I belong to myself and everything that I own belongs to me. No\none has the right to deprive me of what I own without my consent.\n2. I can do as I please so long as it does not interfere with the\nliberty of others.\n3. Anyone who deprives others of their liberty should be punished\nin a manner worthy of the violation but with solemn respect for\njustice and mercy.\nIf there could ever be such a thing as world peace, the principles\noutlined above would usher it down aisle where it would be wed with\nprosperity unlike the world has ever seen.\nWe do require some government and where none exists, it will spring\nup. Government, wherever it exists should be heavily shackled and\nreleased only to perform a very narrow function. When government is\nout exercising its power, there should be men of honor and valor,\narmed and waiting to subdue it at the slightest provocation.\nThe more government we have, the less freedom we have because\ngovernment always tends toward tyranny. The corollary to this is that\nas the population to be governed grows larger, the opportunities to\noppress increase. China should serve as a sterling example of this.\nHere in the United States, cities such as Los Angeles, New York and\nChicago are living laboratories of this principle.\nI should not have liberty because the government grants me liberty. I\nshould have liberty in spite of the inevitable attempt of government\nto deprive me of it because it is my due. With that in mind, I should\nnot willingly engage in activities that deprive others their liberty.\nIn his letter to the church at Galatia, the Apostle Paul exhorts them:\n“It was for freedom that Christ set us free; therefore keep standing\nfirm and do not be subject again to a yoke of slavery.” (Galatians\n5:1, NASB). In context, we must realize that this verse addresses the\nslavery of sin and obligatory religion compared to having spiritual\nfreedom through Jesus. I would encourage you to read Galatians\nchapters 4 & 5 and think of it as a model for our civil liberties. Pay\nclose attention to Gal. 4:13-14: “For you were called to freedom,\nbrethren; only do not turn your freedom in to an opportunity for the\nflesh, but through love, serve one another. For the whole law is\nfulfilled in one word, in the statement ‘You shall love your neighbor\nas yourself.'” These chapters should still be applied to their\nintended use, I’m referring to them here as a type and shadow of our\nmortal liberty.\nIt is apparent that our liberties are being eroded on a local, national and global level. We are well on our way toward global governance. The not-so-secret conspirators are claiming power over more and more aspects of our lives. Students of the Bible already know how bad it’s going to get before the end. What we don’t know is when it ends. In the mean time, we must educate those who are ignorant of the principles of liberty and be a shining example of it to our families, friends and communities. Taking up the cause of liberty is much like the work of preaching the Gospel; it requires personal sacrifice and the willingness to stand by your principles in the face of severe opposition. If you aren’t willing to do it, don’t expect anyone to do it for you.",
  "tags": [],
  "categories": [],
  "sitemap_lastmod": "2005-06-11T15:03:00+00:00"
}