{
  "url": "https://voxday.net/2005/06/01/disrespecting-krugman/",
  "scraped_at": "2026-01-08T20:05:54.533680",
  "title": "Disrespecting Krugman",
  "date_display": "June 1, 2005",
  "date_iso": "2005-06-01T07:58:00+00:00",
  "date_from_url": "2005-06-01",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>Daniel Okrent <a href=\"http://forums.nytimes.com/top/opinion/readersopinions/forums/thepubliceditor/publiceditorswebjournal/index.html?offset=0\">writes in the NYT</a>:</p><blockquote><p>For a man who makes his living offering strong opinions, Paul Krugman seems peculiarly reluctant to grant the same privilege to others. And for a man who leads with his chin twice a week, he acts awfully surprised when someone takes a pop at it.</p><p>Because only a fool or a supply-sider would eagerly engage in a debate on economics with Prof. Krugman, I’ll try to eschew argument and stick to facts – or, at least, the sort of statements that he himself represents as purely factual:</p><p>1. I offered him only three examples of “shaping, slicing and selectively citing” (for some reason, he’s left one out of his rebuttal) because I was at home when he began bombarding me with outraged demands for retraction and apology; I’d completed my tenure as public editor the preceding week, and did not have any files with me. When I had the chance to consult some of my reader mail later in the week, some of his greatest mis-hits immediately came to the fore. I’ll get to a few of those in point No. 5, below.</p><p>2. This was the first he heard from me on these specific issues partly because I learned early on in this job that Prof. Krugman would likely be more willing to contribute to the Frist for President campaign than to acknowledge the possibility of error. When he says he agreed “reluctantly” to one correction, he gives new meaning to the word “reluctantly”; I can’t come up with an adverb sufficient to encompass his general attitude toward substantive criticism. But I laid off for so long because I also believe that columnists are entitled by their mandate to engage in the unfair use of statistics, the misleading representation of opposing positions, and the conscious withholding of contrary data. But because they’re entitled doesn’t mean I or you have to like it, or think it’s good for the newspaper.</p><p>3. The mixing of household and establishment numbers in his 5/25/04 column: Missing from the BLS chart he cites is any number that even resembles the 140,000 new jobs each month needed to keep up with the growing population a statistic he cites in the column, and upon which he seems to have based some of his computations. To my knowledge, that number only appeared in the household survey.</p><p>4. The Polivka-Miller paper: On the substance, readers can come to their own conclusions by examining the report themselves, particularly the chart and related narrative addressing “Duration of Unemployment” on page 23 (pdf). On Prof. Krugman’s defense of his unfamiliarity with it, he’s effectively saying, “If I didn’t know about it, it must not be important.” This is a polemicist’s dodge; no self-respecting journalist would ever make such an argument.</p><p>5. Some other examples of Krugmania that popped out of my copious files:</p><p>His 1/27/04 assertion that the cost of unemployment insurance “automatically” adds to the federal deficit. This two-fer misrepresents a pair of facts: that unemployment insurance is largely borne by the states, and that major federal contributions to the states come about only because of an act of Congress, which is hardly automatic. <br>His 2/3/04 assertion that tax proposals offered by Democrats would help the 77 pecent of taxpayers in the 15 percent bracket or less. The most recent generally accepted figures available at the time indicated that the number was actually 64 percent. <br>A very recent example that nonetheless escaped my memory until Prof. Krugman generously reminded me of it in his letter: His 5/9/05 column on progressive indexing. The column itself (without the ex post facto explanation) suggestively conflates “retirement income” and “social security benefits” without sufficient explanation, but with plenty of apparent point-making. <br>Believe me — I could go on, as could a number of readers more sophisticated about economic matters than I am. (Among these are several who, like me, generally align themselves politically with Prof. Krugman, but feel he does himself and his cause no good when he heeds the roaring approval of his acolytes and dismisses his critics as ideologically motivated.) But I don’t want to engage in an extended debate any more than Prof. Krugman says he does. If he replies to this statement, as I imagine he will, I’ll let him have what he always insists on keeping for himself: the last word.</br></br></br></p><p>I hate to do this to a decent man like my successor, Barney Calame, but I’m hereby turning the Krugman beat over to him.</p></blockquote><p>Whoo-pah!</p></div>",
  "content_text": "Daniel Okrent\nwrites in the NYT\n:\nFor a man who makes his living offering strong opinions, Paul Krugman seems peculiarly reluctant to grant the same privilege to others. And for a man who leads with his chin twice a week, he acts awfully surprised when someone takes a pop at it.\nBecause only a fool or a supply-sider would eagerly engage in a debate on economics with Prof. Krugman, I’ll try to eschew argument and stick to facts – or, at least, the sort of statements that he himself represents as purely factual:\n1. I offered him only three examples of “shaping, slicing and selectively citing” (for some reason, he’s left one out of his rebuttal) because I was at home when he began bombarding me with outraged demands for retraction and apology; I’d completed my tenure as public editor the preceding week, and did not have any files with me. When I had the chance to consult some of my reader mail later in the week, some of his greatest mis-hits immediately came to the fore. I’ll get to a few of those in point No. 5, below.\n2. This was the first he heard from me on these specific issues partly because I learned early on in this job that Prof. Krugman would likely be more willing to contribute to the Frist for President campaign than to acknowledge the possibility of error. When he says he agreed “reluctantly” to one correction, he gives new meaning to the word “reluctantly”; I can’t come up with an adverb sufficient to encompass his general attitude toward substantive criticism. But I laid off for so long because I also believe that columnists are entitled by their mandate to engage in the unfair use of statistics, the misleading representation of opposing positions, and the conscious withholding of contrary data. But because they’re entitled doesn’t mean I or you have to like it, or think it’s good for the newspaper.\n3. The mixing of household and establishment numbers in his 5/25/04 column: Missing from the BLS chart he cites is any number that even resembles the 140,000 new jobs each month needed to keep up with the growing population a statistic he cites in the column, and upon which he seems to have based some of his computations. To my knowledge, that number only appeared in the household survey.\n4. The Polivka-Miller paper: On the substance, readers can come to their own conclusions by examining the report themselves, particularly the chart and related narrative addressing “Duration of Unemployment” on page 23 (pdf). On Prof. Krugman’s defense of his unfamiliarity with it, he’s effectively saying, “If I didn’t know about it, it must not be important.” This is a polemicist’s dodge; no self-respecting journalist would ever make such an argument.\n5. Some other examples of Krugmania that popped out of my copious files:\nHis 1/27/04 assertion that the cost of unemployment insurance “automatically” adds to the federal deficit. This two-fer misrepresents a pair of facts: that unemployment insurance is largely borne by the states, and that major federal contributions to the states come about only because of an act of Congress, which is hardly automatic.\nHis 2/3/04 assertion that tax proposals offered by Democrats would help the 77 pecent of taxpayers in the 15 percent bracket or less. The most recent generally accepted figures available at the time indicated that the number was actually 64 percent.\nA very recent example that nonetheless escaped my memory until Prof. Krugman generously reminded me of it in his letter: His 5/9/05 column on progressive indexing. The column itself (without the ex post facto explanation) suggestively conflates “retirement income” and “social security benefits” without sufficient explanation, but with plenty of apparent point-making.\nBelieve me — I could go on, as could a number of readers more sophisticated about economic matters than I am. (Among these are several who, like me, generally align themselves politically with Prof. Krugman, but feel he does himself and his cause no good when he heeds the roaring approval of his acolytes and dismisses his critics as ideologically motivated.) But I don’t want to engage in an extended debate any more than Prof. Krugman says he does. If he replies to this statement, as I imagine he will, I’ll let him have what he always insists on keeping for himself: the last word.\nI hate to do this to a decent man like my successor, Barney Calame, but I’m hereby turning the Krugman beat over to him.\nWhoo-pah!",
  "tags": [],
  "categories": [],
  "sitemap_lastmod": "2005-06-01T06:58:00+00:00"
}