{
  "url": "https://voxday.net/2005/06/22/mailvox-in-defense-of-rots/",
  "scraped_at": "2026-01-08T20:07:27.633893",
  "title": "Mailvox: In defense of ROTS",
  "date_display": "June 22, 2005",
  "date_iso": "2005-06-22T18:31:00+00:00",
  "date_from_url": "2005-06-22",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>Jamsco argues eloquently:</p><blockquote><p>Three reasons why Vox should go see Episode III</p><p>1. It’s got Darth!</p><p>I know that you don’t think that even “Return” was as good as the first two and I would have to agree. The Ewoks were too cute and so forth. But wouldn’t you agree that you enjoyed every scene that Darth Vader was in? My thought is that the Darth Vader thread, throughout the first three, was always strong and enjoyable to watch. He is a bad guy that we like. (And I don’t mean “Like to Hate.” In Ep’s 5 and 6 we really want him to come around. He is a good guy on the wrong side) From the beginning, when he found the Death Star Builder’s lack of faith disturbing, we thought – this is a guy who would be good to have as a friend. And now Ep 3 shows his creation. Although I disagree with a few of the choices in how this was portrayed and the fact that his actor is still a pretty boy, the manner of Anakin’s fall makes us empathetic to Darth, just like we were empathetic to him in Return. It’s worth it just to see the mask being put on.</p><p>2. It’s got Light Sabers.</p><p>Again, I state that Star Wars is the best of the six. But having said this, my thought is that of all six, it has the worst light saber battle. I think these battles between 2,3, or 4 people, in sharp contrast to pretty much every other facet of the six movies, is something Lucas got better and better at developing. Ep 3 shows the battle that we have wondered about since 1977, the fight between Kenobi and Skywalker. And yet you say no. You have stated publicly your disdain for Ep 1, but didn’t the Jinn/Kenobi/Maul battle stir your heart a little? Personally, I think it was the best part of that movie.</p><p>3. What about your 1977 self?</p><p>Every time I’m at a hotel where there is a swimming pool and, as an adult, I choose not to use it, the eight year old Me yells at the adult Me, calling me a fool to not take the opportunity. Have you completely shut down, or blocked out the call of the ten year old, who saw it five times, who knew all of the trivia, and all of the names of the actors? (Not just Han Solo and Artoo, mind you, I’m talking about the Grand Moff Tarkin, The Head Sandperson and several Jawas now. (And I bet you get the reference in that last sentence.))  I can’t speak for that boy, but the ten year old<br>me would be saying “You are a big loser. Don’t give me that big talk about cinematic quality, it’s got Chewbacca in it! Let me see it!”</br></p><p>The bad news is that if you see Ep 3, you should probably rent Ep 2 first, which is, depending on your point of view, worse than the first. But it’s only two hours of your life. I’ll pay for the rental if you don’t want to give Lucas money for it.</p></blockquote><p>Big Chilly is lobbying me as well.  I’m wavering, but let’s face it, it’s always fun to have an excuse to say: “you’re dead to me”.</p><p>I remain dubious, although that third point is a compelling one.</p></div>",
  "content_text": "Jamsco argues eloquently:\nThree reasons why Vox should go see Episode III\n1. It’s got Darth!\nI know that you don’t think that even “Return” was as good as the first two and I would have to agree. The Ewoks were too cute and so forth. But wouldn’t you agree that you enjoyed every scene that Darth Vader was in? My thought is that the Darth Vader thread, throughout the first three, was always strong and enjoyable to watch. He is a bad guy that we like. (And I don’t mean “Like to Hate.” In Ep’s 5 and 6 we really want him to come around. He is a good guy on the wrong side) From the beginning, when he found the Death Star Builder’s lack of faith disturbing, we thought – this is a guy who would be good to have as a friend. And now Ep 3 shows his creation. Although I disagree with a few of the choices in how this was portrayed and the fact that his actor is still a pretty boy, the manner of Anakin’s fall makes us empathetic to Darth, just like we were empathetic to him in Return. It’s worth it just to see the mask being put on.\n2. It’s got Light Sabers.\nAgain, I state that Star Wars is the best of the six. But having said this, my thought is that of all six, it has the worst light saber battle. I think these battles between 2,3, or 4 people, in sharp contrast to pretty much every other facet of the six movies, is something Lucas got better and better at developing. Ep 3 shows the battle that we have wondered about since 1977, the fight between Kenobi and Skywalker. And yet you say no. You have stated publicly your disdain for Ep 1, but didn’t the Jinn/Kenobi/Maul battle stir your heart a little? Personally, I think it was the best part of that movie.\n3. What about your 1977 self?\nEvery time I’m at a hotel where there is a swimming pool and, as an adult, I choose not to use it, the eight year old Me yells at the adult Me, calling me a fool to not take the opportunity. Have you completely shut down, or blocked out the call of the ten year old, who saw it five times, who knew all of the trivia, and all of the names of the actors? (Not just Han Solo and Artoo, mind you, I’m talking about the Grand Moff Tarkin, The Head Sandperson and several Jawas now. (And I bet you get the reference in that last sentence.))  I can’t speak for that boy, but the ten year old\nme would be saying “You are a big loser. Don’t give me that big talk about cinematic quality, it’s got Chewbacca in it! Let me see it!”\nThe bad news is that if you see Ep 3, you should probably rent Ep 2 first, which is, depending on your point of view, worse than the first. But it’s only two hours of your life. I’ll pay for the rental if you don’t want to give Lucas money for it.\nBig Chilly is lobbying me as well.  I’m wavering, but let’s face it, it’s always fun to have an excuse to say: “you’re dead to me”.\nI remain dubious, although that third point is a compelling one.",
  "tags": [],
  "categories": [],
  "sitemap_lastmod": "2005-06-22T17:31:00+00:00"
}