{
  "url": "https://voxday.net/2005/06/12/next-book-you-buy/",
  "scraped_at": "2026-01-08T20:06:57.160595",
  "title": "The next book you buy",
  "date_display": "June 12, 2005",
  "date_iso": "2005-06-12T14:00:00+00:00",
  "date_from_url": "2005-06-12",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>Charles Stross explains the origins of <a href=\"http://www.accelerando.org\">Accelerando</a>:</p><blockquote><p>“Accelerando” is a creature of its time, and that time is the late 1990s. I spent most of the 90s on a kind of sabbatical from writing fiction (my first love), with my head stuck up the fundament of the software industry. In the early 90’s I worked for SCO (back when it was a UNIX company, rather than the unholy terror that came back from the dead to haunt the free software movement). Then I discovered the web, back around 1993. I remember a wee daily email bulletin titled “what’s new on the web” that came from an address at NCSA; I used to visit all the interesting new web sites every day, until the volume grew too great some time in late 1994. I was supposed to be writing UNIX manuals, but I distracted myself by learning Perl – and was inadvertently responsible for the development of the robot exclusion protocol (by writing a web spider that annoyed people who knew more about what they were doing than I did). I moved to Scotland to join a web startup that went bust, freelanced for a couple of years while writing a web architecture book, landed myself a magazine column about Linux, and joined another start-up that turned into a successful dot com, went public, and much to my surprise is still in business.</p><p>The last sentence covers a multitude of sins. I signed on with the company two weeks before its official formation, and left two months after the IPO – three and a half years later. Along the way I bolted together about thirty thousand lines of object oriented perl that swallowed credit card numbers at one end and talked to obscure British banking systems in strange protocols. And it had a psychotherapy bot wired into the middle just to help me de-stress when things got too heavy, which was almost every other day, because …</p><p>You’ve probably never had to work inside a business that’s growing of 30% per month. Take it from me, it’s an experience you don’t need. Especially when you’re not a brilliant programmer, you know damn well your code has bugs in it – it’s actually a prototype that they pressed into service six months too early – and it’s handling millions of pounds of other people’s money. If things go wrong they scream at you. And exponential growth means the workload is always growing faster than the budget for hiring minions to do the donkey-work. At first it’s fun, a buzz like a caffeine high: but it goes on too long and you get old and feel stupid, and at some point you find you can’t stop running because your feet are locked to the treadmill and there’s a wall of spikes right behind you.</p><p>The germ of “Accelerando” dates to that time. To be specific, it dates to a particularly bad month in early 1999, when I was trying to brainwash Datacash into talking to a French credit card system (and if you think obscure 1970’s-vintage British credit card protocols sound awful, you’ve never dealt with the French equivalent). I was under a lot of pressure, not aided by the French bank programmers not actually wanting to expose the guts of their communication protocol to, gasp, developers who were trying to communicate with their servers … things were not looking good. One Thursday when things had been not been going well in an especially emphatic manner, I wandered over to my boss the CTO’s desk and said, “I’m taking tomorrow off.”</p><p>“But what if we need you – ” he began.</p><p>“I’ll be in Amsterdam.”</p><p>He looked at me. Then he did a double-take: “Amsterdam. Okay.” I hadn’t taken any vacation time in the preceding year, my caffeine intake was measured in the direction of gallons of coffee per day, and I was developing an uncontrollable facial tic and a tendency to jump at loud noises. “Take tomorrow off.”</p><p>This was very sensible of him. Most directors of a company that’s going public in six months and has a server development team consisting of 1 (one) geek who is developing an incontrolable facial tic and demanding days off in Amsterdam might actually get a little bit nervous about the idea of said server development team fleeing the country on short notice. But my prepared fallback position to taking a long weekend somewhere with lots of beer and no French bank managers to scream at was to try to quit on the spot, and if that failed I was going to spring a full-scale nervous breakdown … and it probably showed.</p><p>“Just come back on Monday,” he said.</p><p>I think I nodded, but maybe it was just the caffeine pulling my strings.</p><p>Anyway, I was wandering around Amsterdam the next day – on a rainy Friday – trying not to fall apart at the seams. I’d spent the whole night lying awake, looping on re-drafting my resignation letter, and I had the shakes. Then my phone rang.</p><p>“What’s gone wrong?” I asked, my heart sinking.</p><p>It was my boss the CTO. “The French fuckwits,” he said.</p><p>I got that sinking feeling. “What have they sprung on us now?” I asked.</p><p>“Their parent institution is so unhappy with them that they’re being shut down! I thought you might like to know …” (In the background, I could hear the entire office cheering.)</p><p>I immediately headed for the nearest pub, and my girlfriend and I celebrated in time-honoured fashion. For a couple of bright hours in the middle of a rainy afternoon, the high pressure bubble in the core of the dot com boom actually looked like an optimistic, cheerful place to be. And something about the sudden release of stress took root, and began to germinate. I got far enough away from the coal seam to blink, look at it in amazement, and ask once more the classic science fictional question, what happens if this goes on? What happens if you keep piling on the changes? What kind of person can actually live on the edge of a singularity, keeping pace while all around them the world is melted down and re-forged monthly, daily, hourly?</p><p>I pulled out my Psion 5MX and scribbled a brief paragraphs about a very strange guy named Manfred. Then I proceeded to get side-tracked by beer for the next couple of days.</p><p>It has taken me nearly five years (until early 2004) to finish answer the question. The soil in which the seed sprouted had long since withered, the bust following the boom; the dot com IPO didn’t make my fortune, but it left me with “Accelerando” by way of payback And I’m not unhappy about that outcome.</p></blockquote><p>Nor am I.  I can state with unequivocal assurance that if there is one book you buy in the next year, it must be <em>Accelerando</em>.  I will not debate this.  And I say that despite being one who has what appears to be a pretty decent novel coming out myself during that time and the fact that Umberto Eco’s new novel has just been translated into English.  Stross, one of my favorite SF writers, is always good, but in <em>Accelerando</em>, he delivers an onslaught of visionary brilliance that blows you away, makes you question your assumptions and forces you to kick your overloaded synapses into a higher gear.</p><p>Don’t miss it.</p></div>",
  "content_text": "Charles Stross explains the origins of\nAccelerando\n:\n“Accelerando” is a creature of its time, and that time is the late 1990s. I spent most of the 90s on a kind of sabbatical from writing fiction (my first love), with my head stuck up the fundament of the software industry. In the early 90’s I worked for SCO (back when it was a UNIX company, rather than the unholy terror that came back from the dead to haunt the free software movement). Then I discovered the web, back around 1993. I remember a wee daily email bulletin titled “what’s new on the web” that came from an address at NCSA; I used to visit all the interesting new web sites every day, until the volume grew too great some time in late 1994. I was supposed to be writing UNIX manuals, but I distracted myself by learning Perl – and was inadvertently responsible for the development of the robot exclusion protocol (by writing a web spider that annoyed people who knew more about what they were doing than I did). I moved to Scotland to join a web startup that went bust, freelanced for a couple of years while writing a web architecture book, landed myself a magazine column about Linux, and joined another start-up that turned into a successful dot com, went public, and much to my surprise is still in business.\nThe last sentence covers a multitude of sins. I signed on with the company two weeks before its official formation, and left two months after the IPO – three and a half years later. Along the way I bolted together about thirty thousand lines of object oriented perl that swallowed credit card numbers at one end and talked to obscure British banking systems in strange protocols. And it had a psychotherapy bot wired into the middle just to help me de-stress when things got too heavy, which was almost every other day, because …\nYou’ve probably never had to work inside a business that’s growing of 30% per month. Take it from me, it’s an experience you don’t need. Especially when you’re not a brilliant programmer, you know damn well your code has bugs in it – it’s actually a prototype that they pressed into service six months too early – and it’s handling millions of pounds of other people’s money. If things go wrong they scream at you. And exponential growth means the workload is always growing faster than the budget for hiring minions to do the donkey-work. At first it’s fun, a buzz like a caffeine high: but it goes on too long and you get old and feel stupid, and at some point you find you can’t stop running because your feet are locked to the treadmill and there’s a wall of spikes right behind you.\nThe germ of “Accelerando” dates to that time. To be specific, it dates to a particularly bad month in early 1999, when I was trying to brainwash Datacash into talking to a French credit card system (and if you think obscure 1970’s-vintage British credit card protocols sound awful, you’ve never dealt with the French equivalent). I was under a lot of pressure, not aided by the French bank programmers not actually wanting to expose the guts of their communication protocol to, gasp, developers who were trying to communicate with their servers … things were not looking good. One Thursday when things had been not been going well in an especially emphatic manner, I wandered over to my boss the CTO’s desk and said, “I’m taking tomorrow off.”\n“But what if we need you – ” he began.\n“I’ll be in Amsterdam.”\nHe looked at me. Then he did a double-take: “Amsterdam. Okay.” I hadn’t taken any vacation time in the preceding year, my caffeine intake was measured in the direction of gallons of coffee per day, and I was developing an uncontrollable facial tic and a tendency to jump at loud noises. “Take tomorrow off.”\nThis was very sensible of him. Most directors of a company that’s going public in six months and has a server development team consisting of 1 (one) geek who is developing an incontrolable facial tic and demanding days off in Amsterdam might actually get a little bit nervous about the idea of said server development team fleeing the country on short notice. But my prepared fallback position to taking a long weekend somewhere with lots of beer and no French bank managers to scream at was to try to quit on the spot, and if that failed I was going to spring a full-scale nervous breakdown … and it probably showed.\n“Just come back on Monday,” he said.\nI think I nodded, but maybe it was just the caffeine pulling my strings.\nAnyway, I was wandering around Amsterdam the next day – on a rainy Friday – trying not to fall apart at the seams. I’d spent the whole night lying awake, looping on re-drafting my resignation letter, and I had the shakes. Then my phone rang.\n“What’s gone wrong?” I asked, my heart sinking.\nIt was my boss the CTO. “The French fuckwits,” he said.\nI got that sinking feeling. “What have they sprung on us now?” I asked.\n“Their parent institution is so unhappy with them that they’re being shut down! I thought you might like to know …” (In the background, I could hear the entire office cheering.)\nI immediately headed for the nearest pub, and my girlfriend and I celebrated in time-honoured fashion. For a couple of bright hours in the middle of a rainy afternoon, the high pressure bubble in the core of the dot com boom actually looked like an optimistic, cheerful place to be. And something about the sudden release of stress took root, and began to germinate. I got far enough away from the coal seam to blink, look at it in amazement, and ask once more the classic science fictional question, what happens if this goes on? What happens if you keep piling on the changes? What kind of person can actually live on the edge of a singularity, keeping pace while all around them the world is melted down and re-forged monthly, daily, hourly?\nI pulled out my Psion 5MX and scribbled a brief paragraphs about a very strange guy named Manfred. Then I proceeded to get side-tracked by beer for the next couple of days.\nIt has taken me nearly five years (until early 2004) to finish answer the question. The soil in which the seed sprouted had long since withered, the bust following the boom; the dot com IPO didn’t make my fortune, but it left me with “Accelerando” by way of payback And I’m not unhappy about that outcome.\nNor am I.  I can state with unequivocal assurance that if there is one book you buy in the next year, it must be\nAccelerando\n.  I will not debate this.  And I say that despite being one who has what appears to be a pretty decent novel coming out myself during that time and the fact that Umberto Eco’s new novel has just been translated into English.  Stross, one of my favorite SF writers, is always good, but in\nAccelerando\n, he delivers an onslaught of visionary brilliance that blows you away, makes you question your assumptions and forces you to kick your overloaded synapses into a higher gear.\nDon’t miss it.",
  "tags": [],
  "categories": [],
  "sitemap_lastmod": "2005-06-12T13:00:00+00:00"
}