{
  "url": "https://voxday.net/2005/06/03/speaking-of-reviews/",
  "scraped_at": "2026-01-08T20:06:07.320789",
  "title": "Speaking of reviews",
  "date_display": "June 3, 2005",
  "date_iso": "2005-06-03T10:44:00+00:00",
  "date_from_url": "2005-06-03",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>I was perusing the Original Cyberpunk’s Ranting Room – a must-follow blog for anyone interested in the fiction business – and <a href=\"http://rantingroom.blogspot.com/2005/05/are-reviews-worthwhile.html\">the discussion of reviews</a> came up.  Being a former video game reviewer, it should come as no surprise that I rather enjoy reading reviews and writing them.</p><p>That being said, there’s an awful lot of reviews that are simply terrible, barely worthy of the name.  In the game world, such reviews usually focus on whether the graphics are better than they were in last year’s games, which is why the magazine reviews are all too often a collection of superlatives.  In the book world, the lousy ones frequently focus on one minor aspect of the novel that the reviewer has somehow managed to get hopelessly wrong.</p><p>For example, when one of my books was reviewed by a sci-fi site, the reviewer concluded that demonic possession was tantamount to removing all responsibility from a character for his actions.  Never mind the small fact that the character actually suffered severe and lasting consequences, the reviewer decided that her self-manufactured divorce of action and responsibility was the central message of the book and spent half her review criticizing that.  For me, as a writer who has done more than his share of reviews, it was very strange and more than a little annoying.</p><p>As you’ve probably seen, I prefer a structure review format that specifically covers what I consider to be the four main elements of a novel: characters, creativity, story and style.  But every reviewer needs to develop his own style; here’s <a href=\"http://www.rightnation.us/blog/naron/index.php?id=P398\">a review of THE WAR IN HEAVEN</a> from writer and VP regular Cris Naron:</p><blockquote><p>Back in November, I wrote a piece about how conservatives and Christians need to take the creative professions more seriously, and the author responded, basically saying that he was doing exactly that. [X] is no conservative, mind you; he’s a raging libertarian. He is also a Christian and a writer who takes fiction seriously. That’s what sets him apart from most Christian writers. Most of the works of fiction you’ll find in Christian book stores are watered down, unrealistic visions of a world that the Christian religion itself strives to paint as hopelessly depraved and fallen. So my problem with “Christian Fiction” has always been with the Ned Flanders depictions of this fallen world. No one in “Christian Fiction” ever does or says anything that equates with the depravity the Bible describes. A glaring example would be Tim LaHaye’s and Jim Jenkins’ Anti-Christ, Nicolae Carpathia, in the Left Behind series. The book version of the character is slightly more evil than J.R. Ewing or C. Montgomery Burns. The movie version is less frightening than a Kennedy even after we learn he’s the devil.</p><p>[X]’s characters have dimension, and that means they’re dark, mean and ugly….</p></blockquote><p>Go there to read the rest of the review.  And by the way, Chris, where’s that SHADOW review?</p></div>",
  "content_text": "I was perusing the Original Cyberpunk’s Ranting Room – a must-follow blog for anyone interested in the fiction business – and\nthe discussion of reviews\ncame up.  Being a former video game reviewer, it should come as no surprise that I rather enjoy reading reviews and writing them.\nThat being said, there’s an awful lot of reviews that are simply terrible, barely worthy of the name.  In the game world, such reviews usually focus on whether the graphics are better than they were in last year’s games, which is why the magazine reviews are all too often a collection of superlatives.  In the book world, the lousy ones frequently focus on one minor aspect of the novel that the reviewer has somehow managed to get hopelessly wrong.\nFor example, when one of my books was reviewed by a sci-fi site, the reviewer concluded that demonic possession was tantamount to removing all responsibility from a character for his actions.  Never mind the small fact that the character actually suffered severe and lasting consequences, the reviewer decided that her self-manufactured divorce of action and responsibility was the central message of the book and spent half her review criticizing that.  For me, as a writer who has done more than his share of reviews, it was very strange and more than a little annoying.\nAs you’ve probably seen, I prefer a structure review format that specifically covers what I consider to be the four main elements of a novel: characters, creativity, story and style.  But every reviewer needs to develop his own style; here’s\na review of THE WAR IN HEAVEN\nfrom writer and VP regular Cris Naron:\nBack in November, I wrote a piece about how conservatives and Christians need to take the creative professions more seriously, and the author responded, basically saying that he was doing exactly that. [X] is no conservative, mind you; he’s a raging libertarian. He is also a Christian and a writer who takes fiction seriously. That’s what sets him apart from most Christian writers. Most of the works of fiction you’ll find in Christian book stores are watered down, unrealistic visions of a world that the Christian religion itself strives to paint as hopelessly depraved and fallen. So my problem with “Christian Fiction” has always been with the Ned Flanders depictions of this fallen world. No one in “Christian Fiction” ever does or says anything that equates with the depravity the Bible describes. A glaring example would be Tim LaHaye’s and Jim Jenkins’ Anti-Christ, Nicolae Carpathia, in the Left Behind series. The book version of the character is slightly more evil than J.R. Ewing or C. Montgomery Burns. The movie version is less frightening than a Kennedy even after we learn he’s the devil.\n[X]’s characters have dimension, and that means they’re dark, mean and ugly….\nGo there to read the rest of the review.  And by the way, Chris, where’s that SHADOW review?",
  "tags": [],
  "categories": [],
  "sitemap_lastmod": "2005-06-03T09:44:00+00:00"
}