{
  "url": "https://voxday.net/2011/04/11/amazon-and-some-publishing-decisions/",
  "scraped_at": "2025-12-13T23:07:53.876256",
  "title": "Amazon and some publishing decisions",
  "date_display": "April 11, 2011",
  "date_iso": "2011-04-11T17:00:00+00:00",
  "date_from_url": "2011-04-11",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>You’ve probably noticed that I’ve arranged to set up as an Amazon Associate, so if you order books from them in the future, doing it through here will contribute to the Publishing Fund.  This is intended to be a means of funding more self-publishing through Kindle and eventually other forms of ebooks and perhaps hardcovers as well.  So, if you’re thinking of ordering something through Amazon, consider doing it from here.</p><p>I’m still working on <i>Summa Elvetica II</i>, which will not be done for quite some time because I am attempting to make it a stronger and deeper book than its predecessor, which involves a good deal of research and world-building.  That isn’t really relevant to the self-publishing project, however, since Marcher Lord will likely publish it.  So, I’ve also been working on the non-fiction title <i>Alpha Game</i>, which I expect to finish and publish this summer; I’d proposed it to WND Books, but they found the subject to be out of their comfort zone and passed on it.</p><p>However, I’ve had a number of requests for publishing column collections, which never really struck me as being a proper book per se, but is apparently de rigueur among columnnists.  I noticed that three of my George Will “books” are actually just column collections accompanied by some introductory commentary.  So, I have two questions.  First, is there any interest in a book or three of column collections?  Second, would there be more interest in books that collect the columns by subject or by publication date?  Just to be clear, I’d probably do the columns in annotated format in order to update them with regards to the mistakes I’d made or to note how subsequent events rendered them relevant or irrelevant.  The ebooks would be sold for $2.99, as per Amazon’s new program.</p><p>I’m also going to be putting out Kindle versions of the three Eternal Warriors novels at the $2.99 price in case anyone is interested in them.</p></div>",
  "content_text": "You’ve probably noticed that I’ve arranged to set up as an Amazon Associate, so if you order books from them in the future, doing it through here will contribute to the Publishing Fund.  This is intended to be a means of funding more self-publishing through Kindle and eventually other forms of ebooks and perhaps hardcovers as well.  So, if you’re thinking of ordering something through Amazon, consider doing it from here.\nI’m still working on\nSumma Elvetica II\n, which will not be done for quite some time because I am attempting to make it a stronger and deeper book than its predecessor, which involves a good deal of research and world-building.  That isn’t really relevant to the self-publishing project, however, since Marcher Lord will likely publish it.  So, I’ve also been working on the non-fiction title\nAlpha Game\n, which I expect to finish and publish this summer; I’d proposed it to WND Books, but they found the subject to be out of their comfort zone and passed on it.\nHowever, I’ve had a number of requests for publishing column collections, which never really struck me as being a proper book per se, but is apparently de rigueur among columnnists.  I noticed that three of my George Will “books” are actually just column collections accompanied by some introductory commentary.  So, I have two questions.  First, is there any interest in a book or three of column collections?  Second, would there be more interest in books that collect the columns by subject or by publication date?  Just to be clear, I’d probably do the columns in annotated format in order to update them with regards to the mistakes I’d made or to note how subsequent events rendered them relevant or irrelevant.  The ebooks would be sold for $2.99, as per Amazon’s new program.\nI’m also going to be putting out Kindle versions of the three Eternal Warriors novels at the $2.99 price in case anyone is interested in them.",
  "tags": [
    "books"
  ],
  "categories": [],
  "sitemap_lastmod": "2011-04-11T16:00:00+00:00"
}