{
  "url": "https://voxday.net/2011/04/25/android-is-less-evil-than-apple/",
  "scraped_at": "2025-12-13T23:09:13.625867",
  "title": "Android is less evil than Apple",
  "date_display": "April 25, 2011",
  "date_iso": "2011-04-25T14:00:00+00:00",
  "date_from_url": "2011-04-25",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>Talk about damning with faint praise….  Anyhow, being an Android user myself, I was concerned about reports that Google was doing the same thing as Apple in collecting location data on Android users.  After looking into the matter, however, the behavior of the two companies appears to be rather different.  The reason for my concern was that I had always kept the two options for location tracking, wireless and GPS, turned off, and it seemed astonishing that Google would be so stupid as to attempt to give its users a false sense of location security while secretly tracking them against their clear wishes as determined by their chosen settings.  However, numerous people looking into the matter have determined that <a href=\"http://socialtimes.com/turn-off-location-services-on-android-phones_b59219\">off really is off</a>.</p><blockquote><p>If you want to find out whether your Android phone is collecting location information tap Menu, Location &amp; Security. You will see the screenshot shown above, which has two options for how your phone collects location information, either via wireless networks or by using GPS satellites. If you do not want your location information tracked, clear both check boxes.</p><p>Be aware that if you turn off location tracking, apps like Google Maps that show your location will not work. If you decide to turn location tracking back on, you will see the screen as shown below, telling you that you are allowing Google’s location service to collect anonymous location data, and that collection will occur even when no applications are running.</p></blockquote><p>In other words, the real “problem” with Android is that people who have either never looked at their location settings or ignored at least one, and usually two, pop-up warning that their location will be tracked, don’t realize that they have opted in to location tracking.  That’s not an actual problem; although it would be preferable if the default option was always set to off, the total cluelessness of many, if not most users, make it understandable why Google would have the default option set to on.  The point is that it’s not nefarious and unlike Apple, Google has provided a way to completely turn off location tracking.</p><p>That being said, it is obnoxious that Google ties Android to a Gmail account and it would be vastly preferable if it did not do so.  But it’s still to be preferred to the sheltered life in Apple’s technofascistic walled garden.</p></div>",
  "content_text": "Talk about damning with faint praise….  Anyhow, being an Android user myself, I was concerned about reports that Google was doing the same thing as Apple in collecting location data on Android users.  After looking into the matter, however, the behavior of the two companies appears to be rather different.  The reason for my concern was that I had always kept the two options for location tracking, wireless and GPS, turned off, and it seemed astonishing that Google would be so stupid as to attempt to give its users a false sense of location security while secretly tracking them against their clear wishes as determined by their chosen settings.  However, numerous people looking into the matter have determined that\noff really is off\n.\nIf you want to find out whether your Android phone is collecting location information tap Menu, Location & Security. You will see the screenshot shown above, which has two options for how your phone collects location information, either via wireless networks or by using GPS satellites. If you do not want your location information tracked, clear both check boxes.\nBe aware that if you turn off location tracking, apps like Google Maps that show your location will not work. If you decide to turn location tracking back on, you will see the screen as shown below, telling you that you are allowing Google’s location service to collect anonymous location data, and that collection will occur even when no applications are running.\nIn other words, the real “problem” with Android is that people who have either never looked at their location settings or ignored at least one, and usually two, pop-up warning that their location will be tracked, don’t realize that they have opted in to location tracking.  That’s not an actual problem; although it would be preferable if the default option was always set to off, the total cluelessness of many, if not most users, make it understandable why Google would have the default option set to on.  The point is that it’s not nefarious and unlike Apple, Google has provided a way to completely turn off location tracking.\nThat being said, it is obnoxious that Google ties Android to a Gmail account and it would be vastly preferable if it did not do so.  But it’s still to be preferred to the sheltered life in Apple’s technofascistic walled garden.",
  "tags": [
    "technology"
  ],
  "categories": [],
  "sitemap_lastmod": "2011-04-25T13:00:00+00:00"
}