{
  "url": "https://voxday.net/2011/04/22/belated-correction-of-tia/",
  "scraped_at": "2025-12-13T23:08:58.476381",
  "title": "A belated TIA correction",
  "date_display": "April 22, 2011",
  "date_iso": "2011-04-22T15:00:00+00:00",
  "date_from_url": "2011-04-22",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>In the chapter entitled “Sam Tzu and the Art of War”, I commented that the major military strategists were, with the sole exception of the incompetent Machiavelli, silent on the subject of religion in war.  As it happens, that is not entirely true.  Over the last two weeks I have been reading a history written by one of the foremost theoreticians of <i>naval</i> warfare, and in doing so came across the following passage in A.T. Mahan’s <i>The Influence of Sea Power Upon History, 1660-1783</i>.</p><blockquote><p>During the century before the Peace of Westphalia, the extension of family power, and the extension of the religion professed, were the two strongest motives of political action. This was the period of the great religious wars which arrayed nation against nation, principality against principality, and often, in the same nation, faction against faction. Religious persecution caused the revolt of the Protestant Dutch Provinces against Spain, which issued, after eighty years of more or less constant war, in the recognition of their independence. Religious discord, amounting to civil war at times, distracted France during the greater part of the same period, profoundly affecting not only her internal but her external policy. These were the days of St. Bartholomew, of the religious murder of Henry IV., of the siege of La Rochelle, of constant intriguing between Roman Catholic Spain and Roman Catholic Frenchmen. As the religious motive, acting in a sphere to which it did not naturally belong, and in which it had no rightful place, died away, the political necessities and interests of States began to have juster weight; not that they had been wholly lost sight of in the mean time, but the religious animosities had either blinded the eyes, or fettered the action, of statesmen. It was natural that in France, one of the greatest sufferers from religious passions, owing to the number and character of the Protestant minority, this reaction should first and most markedly be seen.</p></blockquote><p>It is hardly news that religion was one of the causes of the Thirty Years War, as it is one of the very small minority of religious wars registered in the historical record, and indeed, is generally the second piece of evidence provided in support of the atheist claim that religion causes war.  But while Mahan doesn’t contradict my argument that religion is of no significant strategic or tactical utility in warfare, he does make an interesting point about how religion neither naturally belongs nor has a rightful place in the area of foreign policy.</p><p>Now, I would argue that events have shown that Mahan is mistaken about religion not having any place in foreign policy considering the obvious inability to draw a bright line between Islamic religion and Islamic politics; the two are one and the same and as the West is once more learning, one ignores the theology of a religion of the sword at one’s distinct peril.  Even so, it is worth noting that on one of the very rare occasions when a military strategist has been moved to comment upon religion, he has done so in a manner that indicates religion is very seldom connected with warfare in any capacity, causal, strategic, or tactical.</p><p>Ironically, one of the two men he credits with bringing an end to this unusual period of religious warfare was not only a Christian, but a prince of the Church as well.  Mahan credits King Henry IV and Cardinal-Duc de Richelieu with creating a tradition of French statesmanship that reduced religious strife in the name of state unity.  Whether this was ultimately to the advantage of the French people or the continent of Europe that eventually lay prostrate under Napoleon’s legions is, of course, entirely debatable.</p></div>",
  "content_text": "In the chapter entitled “Sam Tzu and the Art of War”, I commented that the major military strategists were, with the sole exception of the incompetent Machiavelli, silent on the subject of religion in war.  As it happens, that is not entirely true.  Over the last two weeks I have been reading a history written by one of the foremost theoreticians of\nnaval\nwarfare, and in doing so came across the following passage in A.T. Mahan’s\nThe Influence of Sea Power Upon History, 1660-1783\n.\nDuring the century before the Peace of Westphalia, the extension of family power, and the extension of the religion professed, were the two strongest motives of political action. This was the period of the great religious wars which arrayed nation against nation, principality against principality, and often, in the same nation, faction against faction. Religious persecution caused the revolt of the Protestant Dutch Provinces against Spain, which issued, after eighty years of more or less constant war, in the recognition of their independence. Religious discord, amounting to civil war at times, distracted France during the greater part of the same period, profoundly affecting not only her internal but her external policy. These were the days of St. Bartholomew, of the religious murder of Henry IV., of the siege of La Rochelle, of constant intriguing between Roman Catholic Spain and Roman Catholic Frenchmen. As the religious motive, acting in a sphere to which it did not naturally belong, and in which it had no rightful place, died away, the political necessities and interests of States began to have juster weight; not that they had been wholly lost sight of in the mean time, but the religious animosities had either blinded the eyes, or fettered the action, of statesmen. It was natural that in France, one of the greatest sufferers from religious passions, owing to the number and character of the Protestant minority, this reaction should first and most markedly be seen.\nIt is hardly news that religion was one of the causes of the Thirty Years War, as it is one of the very small minority of religious wars registered in the historical record, and indeed, is generally the second piece of evidence provided in support of the atheist claim that religion causes war.  But while Mahan doesn’t contradict my argument that religion is of no significant strategic or tactical utility in warfare, he does make an interesting point about how religion neither naturally belongs nor has a rightful place in the area of foreign policy.\nNow, I would argue that events have shown that Mahan is mistaken about religion not having any place in foreign policy considering the obvious inability to draw a bright line between Islamic religion and Islamic politics; the two are one and the same and as the West is once more learning, one ignores the theology of a religion of the sword at one’s distinct peril.  Even so, it is worth noting that on one of the very rare occasions when a military strategist has been moved to comment upon religion, he has done so in a manner that indicates religion is very seldom connected with warfare in any capacity, causal, strategic, or tactical.\nIronically, one of the two men he credits with bringing an end to this unusual period of religious warfare was not only a Christian, but a prince of the Church as well.  Mahan credits King Henry IV and Cardinal-Duc de Richelieu with creating a tradition of French statesmanship that reduced religious strife in the name of state unity.  Whether this was ultimately to the advantage of the French people or the continent of Europe that eventually lay prostrate under Napoleon’s legions is, of course, entirely debatable.",
  "tags": [
    "religion",
    "war"
  ],
  "categories": [],
  "sitemap_lastmod": "2011-04-22T14:00:00+00:00"
}