{
  "url": "https://voxday.net/2011/04/22/book-review-married-man-sex-life-primer/",
  "scraped_at": "2025-12-13T23:08:56.621186",
  "title": "Book review: The Married Man Sex Life Primer",
  "date_display": "April 22, 2011",
  "date_iso": "2011-04-22T08:10:00+00:00",
  "date_from_url": "2011-04-22",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>I have posted <a href=\"http://alphagameplan.blogspot.com/2011/04/review-married-man-sex-life-primer.html\">a review of Athol Kay’s new book</a> at Alpha Game.  It’s well worth reading by men and women alike, regardless of whether one is actually married or not.  For a different perspective, albeit a similar conclusion, the Hawaiian Libertarian has also posted <a href=\"http://hawaiianlibertarian.blogspot.com/2011/04/young-men-dont-even-think-about-getting.html\">a review of the book</a>.</p><p>Those who have been following the saga of Alpha Game’s resident omega or simply doubt the efficacy of Game may also be interested to read the results of <a href=\"http://alphagameplan.blogspot.com/2011/04/tale-of-two-mints.html\">his first-ever successful date</a> at the age of 28.  And finally, <a href=\"http://alphagameplan.blogspot.com/2011/04/mommy-is-not-sexy.html\">I answer Susan Walsh’s questions</a> regarding whether gender equality in the bedroom inhibits arousal and explain why feminists are not merely anti-sex, but downright anti-sexy.</p></div>",
  "content_text": "I have posted\na review of Athol Kay’s new book\nat Alpha Game.  It’s well worth reading by men and women alike, regardless of whether one is actually married or not.  For a different perspective, albeit a similar conclusion, the Hawaiian Libertarian has also posted\na review of the book\n.\nThose who have been following the saga of Alpha Game’s resident omega or simply doubt the efficacy of Game may also be interested to read the results of\nhis first-ever successful date\nat the age of 28.  And finally,\nI answer Susan Walsh’s questions\nregarding whether gender equality in the bedroom inhibits arousal and explain why feminists are not merely anti-sex, but downright anti-sexy.",
  "tags": [
    "Alpha Game",
    "books"
  ],
  "categories": [],
  "sitemap_lastmod": "2011-04-22T07:10:00+00:00"
}