{
  "url": "https://voxday.net/2011/04/25/bring-noise/",
  "scraped_at": "2025-12-13T23:09:17.256974",
  "title": "Bring the noise",
  "date_display": "April 25, 2011",
  "date_iso": "2011-04-25T23:22:00+00:00",
  "date_from_url": "2011-04-25",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>Here <a href=\"http://www.nationaljournal.com/politics/ron-paul-launches-presidential-campaign-20110425\">we go again</a>:</p><blockquote><p>Rep. Ron Paul, R-Texas, whose outspoken libertarian views and folksy style made him a cult hero during two previous presidential campaigns, will announce on Tuesday that he’s going to try a third time.</p></blockquote><p>The fact that Ron Paul was absolutely right about everything he warned Republicans during the last primary should make him the automatic nominee.  Naturally, this means that the Republican leadership is going to do everything they can to stop him so that they can throw up a sacrificial RINO like Romney to secure a <s>second Obama</s>Hillary’s first term.</p><p>Anyhow, Rep. Paul just guaranteed that the Republican debates will be a lot more interesting.  I can’t wait to hear Romney stumbling over his defenses of invading Libya, raising the debt ceiling, and letting the banks off with foot massages since hand slaps would be too harsh.</p></div>",
  "content_text": "Here\nwe go again\n:\nRep. Ron Paul, R-Texas, whose outspoken libertarian views and folksy style made him a cult hero during two previous presidential campaigns, will announce on Tuesday that he’s going to try a third time.\nThe fact that Ron Paul was absolutely right about everything he warned Republicans during the last primary should make him the automatic nominee.  Naturally, this means that the Republican leadership is going to do everything they can to stop him so that they can throw up a sacrificial RINO like Romney to secure a\nsecond Obama\nHillary’s first term.\nAnyhow, Rep. Paul just guaranteed that the Republican debates will be a lot more interesting.  I can’t wait to hear Romney stumbling over his defenses of invading Libya, raising the debt ceiling, and letting the banks off with foot massages since hand slaps would be too harsh.",
  "tags": [
    "politics"
  ],
  "categories": [],
  "sitemap_lastmod": "2011-04-25T22:22:00+00:00"
}