{
  "url": "https://voxday.net/2011/04/24/considering-agot-cas/",
  "scraped_at": "2025-12-13T23:09:09.960536",
  "title": "Considering the AGOT Cast",
  "date_display": "April 24, 2011",
  "date_iso": "2011-04-24T13:30:00+00:00",
  "date_from_url": "2011-04-24",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>I very seldom approve of book-to-film translations.  I still absolutely refuse to watch the Disney destruction of Lloyd Alexander’s <i>The Black Cauldron</i> or the abomination that passes itself off as the cinematic version of Susan Cooper’s <i>The Dark is Rising</i>.  Despite my skepticism, I thought the first installation of <i>A Game of Thrones</i> was very good.  Apparently I was not the only one to think so, since HBO has already decided to renew AGOT for a second season thanks to the 4.2 million viewers who watched the premiere.  This is good news, as the series promises to be the most successful cinematic adaptation of a fantasy novel since Peter Jackson put <i>The Lord of the Rings</i> on film. It would have been hard for the producers to go seriously wrong, so long as they stayed faithful to the source material – one of these days Hollywood is going to figure out that having their cliche factories “improve” a much-loved literary tale actually harms their pocketbooks – but the casting is one crucial component that can ruin even a perfectly faithful adaptation. My take on the what has surprisingly turned out to be <a href=\"http://www.blackgate.com/2011/04/24/considering-the-agot-cast/\">a really good cast</a> is posted at the Black Gate. <i><b>WARNING: MAJOR SPOILERS AHEAD</b> Do not read further if you have not read or seen AGOT.</i></p></div>",
  "content_text": "I very seldom approve of book-to-film translations.  I still absolutely refuse to watch the Disney destruction of Lloyd Alexander’s\nThe Black Cauldron\nor the abomination that passes itself off as the cinematic version of Susan Cooper’s\nThe Dark is Rising\n.  Despite my skepticism, I thought the first installation of\nA Game of Thrones\nwas very good.  Apparently I was not the only one to think so, since HBO has already decided to renew AGOT for a second season thanks to the 4.2 million viewers who watched the premiere.  This is good news, as the series promises to be the most successful cinematic adaptation of a fantasy novel since Peter Jackson put\nThe Lord of the Rings\non film. It would have been hard for the producers to go seriously wrong, so long as they stayed faithful to the source material – one of these days Hollywood is going to figure out that having their cliche factories “improve” a much-loved literary tale actually harms their pocketbooks – but the casting is one crucial component that can ruin even a perfectly faithful adaptation. My take on the what has surprisingly turned out to be\na really good cast\nis posted at the Black Gate.\nWARNING: MAJOR SPOILERS AHEAD\nDo not read further if you have not read or seen AGOT.",
  "tags": [
    "Black Gate"
  ],
  "categories": [],
  "sitemap_lastmod": "2011-04-24T12:30:00+00:00"
}