{
  "url": "https://voxday.net/2011/04/26/education-vs-economics/",
  "scraped_at": "2025-12-13T23:09:20.925637",
  "title": "Education vs Economics",
  "date_display": "April 26, 2011",
  "date_iso": "2011-04-26T17:47:00+00:00",
  "date_from_url": "2011-04-26",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>Nature questions the assumed wisdom of <a href=\"http://arstechnica.com/science/news/2011/04/the-phd-problem-what-do-you-do-with-too-many-doctorates.ars\">churning out more PhDs</a>:</p><blockquote><p>In developed nations, the number of PhDs given in the sciences each year has grown by almost 40 percent since 1998, reaching about 34,000 doctorates in 2008. This type of expansion sounds great in theory: interest in the sciences is growing, and we now have a population that is more educated than ever. However, the effects of this worldwide trend are troubling. The workforce cannot absorb all these highly trained graduates, there is little money to support these expensive programs, and the quality of education is often low, among other problems. This week’s issue of Nature examines the problems with the expansive growth of the PhD.<br> A worldwide phenomenon</br></p><p>Worldwide, the plan is essentially the same: to stimulate the economy by educating the population. Increasing the number of students that pass through the higher education system isn’t necessarily a bad idea, but the resources must be there to make the system work. In much of the world, this just isn’t the case.</p></blockquote><p>I have three observations.  First, why are we supposed to respect scientists for their intelligence when they obviously can’t figure out simple concepts like “supply and demand” or bother to do enough research to see if there will be any jobs available in their field by the time they finish collecting degrees.</p><p>Second, the idea that education produces economic growth is one of the more obvious <i>post hoc ergo propter hoc</i> arguments I’ve ever seen.  Given that there is now sufficient empirical evidence gathered in numerous countries to prove this is untrue, how many decades will need to pass before it is abandoned as a political policy?  I would say the over/under must be at least two.</p><p>Third, I contend this supports my point that the advancement of science is a consequence of societal wealth, not a cause of it.</p></div>",
  "content_text": "Nature questions the assumed wisdom of\nchurning out more PhDs\n:\nIn developed nations, the number of PhDs given in the sciences each year has grown by almost 40 percent since 1998, reaching about 34,000 doctorates in 2008. This type of expansion sounds great in theory: interest in the sciences is growing, and we now have a population that is more educated than ever. However, the effects of this worldwide trend are troubling. The workforce cannot absorb all these highly trained graduates, there is little money to support these expensive programs, and the quality of education is often low, among other problems. This week’s issue of Nature examines the problems with the expansive growth of the PhD.\nA worldwide phenomenon\nWorldwide, the plan is essentially the same: to stimulate the economy by educating the population. Increasing the number of students that pass through the higher education system isn’t necessarily a bad idea, but the resources must be there to make the system work. In much of the world, this just isn’t the case.\nI have three observations.  First, why are we supposed to respect scientists for their intelligence when they obviously can’t figure out simple concepts like “supply and demand” or bother to do enough research to see if there will be any jobs available in their field by the time they finish collecting degrees.\nSecond, the idea that education produces economic growth is one of the more obvious\npost hoc ergo propter hoc\narguments I’ve ever seen.  Given that there is now sufficient empirical evidence gathered in numerous countries to prove this is untrue, how many decades will need to pass before it is abandoned as a political policy?  I would say the over/under must be at least two.\nThird, I contend this supports my point that the advancement of science is a consequence of societal wealth, not a cause of it.",
  "tags": [
    "science"
  ],
  "categories": [],
  "sitemap_lastmod": "2011-04-26T16:47:00+00:00"
}