{
  "url": "https://voxday.net/2011/04/09/fat-guy-refuses-last-bite/",
  "scraped_at": "2025-12-13T23:07:44.577640",
  "title": "The fat guy refuses the last bite",
  "date_display": "April 9, 2011",
  "date_iso": "2011-04-09T09:35:00+00:00",
  "date_from_url": "2011-04-09",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>He nobly turns it down, then wonders why he still hasn’t lost any weight.  Congress and the White House salute themselves for striking <a href=\"http://news.yahoo.com/s/ap/us_spending_showdown\">a “historic” spending cut</a>:</p><blockquote><p>Working late into the evening Friday, congressional and White House negotiators struck an agreement to pay for government operations through the end of September while trimming $38.5 billion in spending. Lawmakers then approved a days-long stopgap measure to keep the government running while the details of the new spending plan were written into legislation.</p></blockquote><p> Of course, since the federal government ran a $189 billion deficit in March alone, this means that in order to stop digging the debt hole deeper, they only have to cut $150 billion more… every month this year.</p><p>The OC summarized it thusly: <i>“Obama hailed the deal as “a ridiculously insignificant drop in the bucket.” House Speaker John Boehner said that over the next decade he would repeatedly ask the Tea Party faction to “kiss my hairy orange ass.”</i></p><p>“This is historic, what we’ve done,” agreed Senate Majority Leader Harry Reid, D-Nev., the third man involved in negotiations that ratified a new era of divided government. “The Republicans folded like cheap aluminum lawn chairs.”</p></div>",
  "content_text": "He nobly turns it down, then wonders why he still hasn’t lost any weight.  Congress and the White House salute themselves for striking\na “historic” spending cut\n:\nWorking late into the evening Friday, congressional and White House negotiators struck an agreement to pay for government operations through the end of September while trimming $38.5 billion in spending. Lawmakers then approved a days-long stopgap measure to keep the government running while the details of the new spending plan were written into legislation.\nOf course, since the federal government ran a $189 billion deficit in March alone, this means that in order to stop digging the debt hole deeper, they only have to cut $150 billion more… every month this year.\nThe OC summarized it thusly:\n“Obama hailed the deal as “a ridiculously insignificant drop in the bucket.” House Speaker John Boehner said that over the next decade he would repeatedly ask the Tea Party faction to “kiss my hairy orange ass.”\n“This is historic, what we’ve done,” agreed Senate Majority Leader Harry Reid, D-Nev., the third man involved in negotiations that ratified a new era of divided government. “The Republicans folded like cheap aluminum lawn chairs.”",
  "tags": [
    "politics"
  ],
  "categories": [],
  "sitemap_lastmod": "2011-04-09T08:35:00+00:00"
}