{
  "url": "https://voxday.net/2011/04/27/for-those-uninterested-in-omniderigence/",
  "scraped_at": "2025-12-13T23:09:24.825492",
  "title": "For those uninterested in the omniderigence debate",
  "date_display": "April 27, 2011",
  "date_iso": "2011-04-27T10:48:00+00:00",
  "date_from_url": "2011-04-27",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>It’s not as if there are a dearth of other matters to discuss, such as the potential consequences of <a href=\"http://www.nationalreview.com/articles/265567/debt-ceiling-strategies-andrew-stiles\">refusing to raise the debt ceiling</a>:</p><blockquote><p>Proponents of the “just say no” approach argue that refusing to raise the debt ceiling won’t automatically lead to a default. In the past, they point out, Congress has waited several months after the debt limit was reached before authorizing an increase, and the economy did not collapse. Sen. Pat Toomey (R., Pa.) has proposed legislation in the Senate designed specifically to prevent a default by directing the Treasury Department to prioritize interest payments on the national debt over all other forms of spending in the event that the debt ceiling is reached.</p><p>As Veronique de Rugy and Jason Fichtner write in The Washington Times, the United States is estimated to owe about $205 billion in interest this year, to be paid out of revenues totaling about $2.17 trillion. Under Toomey’s plan, after the interest was paid off Congress would be left with $1.97 trillion to spend on actual programs. That’s about $1.5 trillion less that what President Obama requested in his (first) 2012 budget, but enough to cover Social Security ($741 billion), Medicare ($488 billion), and Medicaid ($276 billion), with about $400 billion left for other programs, including national defense….<br> Such a strategy carries a number of self-evident risks, namely that the doomsayers are right and uncertainty over the debt limit would spark a run on Treasury bonds, sending interest rates soaring and plunging the United States (and the world) economy into a second Great Depression, at which point a political squabble over which side was to blame would be the last thing the American public wanted to hear.</br></p></blockquote><p>Here’s the problem.  America and the world economy <i>are already in the second Great Depression</i>, the fact is merely being papered over by the $5 trillion that has been pumped into the global financial system by the Federal Reserve, the European Central Bank, the Bank of Japan and the Bank of England since 2006.  The only thing providing the illusion of economic growth and recovery is a continued expansion of debt and spending.  Once it stops, the game is over.</p><p>So, the “risk” isn’t really a risk at all, since the worst outcome is guaranteed regardless of whether the ceiling is raised or not.  It would have been better to take the medicine back in 2008, but better 2011 than 2016, when the collapse might be to such an extent that it would take down multiple governments.</p><p>By the way, according to WND, Republicans are backing away from their commitments to keep the debt ceiling in place.  Only 102 of the 142 House Republicans previously on board with WND’s “No More Red Ink” campaign are still planning to vote against it.</p></div>",
  "content_text": "It’s not as if there are a dearth of other matters to discuss, such as the potential consequences of\nrefusing to raise the debt ceiling\n:\nProponents of the “just say no” approach argue that refusing to raise the debt ceiling won’t automatically lead to a default. In the past, they point out, Congress has waited several months after the debt limit was reached before authorizing an increase, and the economy did not collapse. Sen. Pat Toomey (R., Pa.) has proposed legislation in the Senate designed specifically to prevent a default by directing the Treasury Department to prioritize interest payments on the national debt over all other forms of spending in the event that the debt ceiling is reached.\nAs Veronique de Rugy and Jason Fichtner write in The Washington Times, the United States is estimated to owe about $205 billion in interest this year, to be paid out of revenues totaling about $2.17 trillion. Under Toomey’s plan, after the interest was paid off Congress would be left with $1.97 trillion to spend on actual programs. That’s about $1.5 trillion less that what President Obama requested in his (first) 2012 budget, but enough to cover Social Security ($741 billion), Medicare ($488 billion), and Medicaid ($276 billion), with about $400 billion left for other programs, including national defense….\nSuch a strategy carries a number of self-evident risks, namely that the doomsayers are right and uncertainty over the debt limit would spark a run on Treasury bonds, sending interest rates soaring and plunging the United States (and the world) economy into a second Great Depression, at which point a political squabble over which side was to blame would be the last thing the American public wanted to hear.\nHere’s the problem.  America and the world economy\nare already in the second Great Depression\n, the fact is merely being papered over by the $5 trillion that has been pumped into the global financial system by the Federal Reserve, the European Central Bank, the Bank of Japan and the Bank of England since 2006.  The only thing providing the illusion of economic growth and recovery is a continued expansion of debt and spending.  Once it stops, the game is over.\nSo, the “risk” isn’t really a risk at all, since the worst outcome is guaranteed regardless of whether the ceiling is raised or not.  It would have been better to take the medicine back in 2008, but better 2011 than 2016, when the collapse might be to such an extent that it would take down multiple governments.\nBy the way, according to WND, Republicans are backing away from their commitments to keep the debt ceiling in place.  Only 102 of the 142 House Republicans previously on board with WND’s “No More Red Ink” campaign are still planning to vote against it.",
  "tags": [
    "economics"
  ],
  "categories": [],
  "sitemap_lastmod": "2011-04-27T09:48:00+00:00"
}