{
  "url": "https://voxday.net/2011/04/28/hbo-is-on-ro/",
  "scraped_at": "2025-12-13T23:09:29.952152",
  "title": "HBO is on a roll",
  "date_display": "April 28, 2011",
  "date_iso": "2011-04-28T13:30:00+00:00",
  "date_from_url": "2011-04-28",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>It appears someone at HBO has concluded that perhaps they might do better producing shows and series <a href=\"http://www.blackgate.com/2011/04/24/goth-chick-crypt-notes-american-gods-come-to-hbo/\">that are based on good books</a> rather than repeatedly regurgitating the generic TV formula of cops and docs.</p><blockquote><p>[Neil] Gaiman followed [<i>Good Omens</i>] with another classic, <i>Neverwhere</i>, in 1996 and <i>Stardust </i>in 1997. I have since adored every tale he has turned out. So it was with great interest I learned that nearly simultaneously with the premier of its epic Game of Thrones, HBO has announced that <i>American Gods</i> will be adapted into a new mini-series, with Gaiman himself co-piloting the writing, along with Robert Richardson.</p></blockquote><p>I am no Gaiman fanboy, but I did rather like <i>American Gods</i>.  Given that <i>Stardust</i> translated very effectively to the screen, I have little doubt that HBO’s <i>American Gods</i> will be every bit as entertaining as the Harris and Martin adaptions that preceded it.</p><p>Some of the other SF/F books I’d like to see HBO eventually address are the Melanie Rawn <i>Dragon Prince</i> series, Ann McCaffrey’s <i>Harper Hall</i> series, (although <i>Dragonriders </i>would make for much more HBO-style material), and Lloyd Alexander’s <i>Chronicles of Prydain</i>.</p></div>",
  "content_text": "It appears someone at HBO has concluded that perhaps they might do better producing shows and series\nthat are based on good books\nrather than repeatedly regurgitating the generic TV formula of cops and docs.\n[Neil] Gaiman followed [\nGood Omens\n] with another classic,\nNeverwhere\n, in 1996 and\nStardust\nin 1997. I have since adored every tale he has turned out. So it was with great interest I learned that nearly simultaneously with the premier of its epic Game of Thrones, HBO has announced that\nAmerican Gods\nwill be adapted into a new mini-series, with Gaiman himself co-piloting the writing, along with Robert Richardson.\nI am no Gaiman fanboy, but I did rather like\nAmerican Gods\n.  Given that\nStardust\ntranslated very effectively to the screen, I have little doubt that HBO’s\nAmerican Gods\nwill be every bit as entertaining as the Harris and Martin adaptions that preceded it.\nSome of the other SF/F books I’d like to see HBO eventually address are the Melanie Rawn\nDragon Prince\nseries, Ann McCaffrey’s\nHarper Hall\nseries, (although\nDragonriders\nwould make for much more HBO-style material), and Lloyd Alexander’s\nChronicles of Prydain\n.",
  "tags": [
    "media"
  ],
  "categories": [],
  "sitemap_lastmod": "2011-04-28T12:30:00+00:00"
}