{
  "url": "https://voxday.net/2011/04/07/in-which-squirrel-meets-train/",
  "scraped_at": "2025-12-13T23:07:35.450168",
  "title": "In which the squirrel meets the train",
  "date_display": "April 7, 2011",
  "date_iso": "2011-04-07T19:00:00+00:00",
  "date_from_url": "2011-04-07",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>Sam Harris is <a href=\"http://www.nd.edu/~sbnd/debate_2011.php\">debating William Lane Craig tonight</a> at 7 PM EST.  Since Harris’s arguments are so inept and factually incorrect that I could beat him in a debate while simultaneously playing ASL <i>and</i> Ms Pac-man, I tend to doubt Craig will have much trouble with him.  It should be interesting to see if Craig elects to make his own positive arguments and challenge Harris to refute them or if he takes a cue from TIA and shreds the arguments that Harris puts forth.</p><p>Since the title of the debate makes it sound as if Harris is attempting to talk his book, <i>The Moral Landscape</i>, I suspect even many atheists will be underwhelmed by his futile attempt to use science as a basis for deriving ought from is.  Anyhow, I’m not staying up to watch it, so if anyone feels so inclined, please go ahead and provide color commentary or summarize it here.</p></div>",
  "content_text": "Sam Harris is\ndebating William Lane Craig tonight\nat 7 PM EST.  Since Harris’s arguments are so inept and factually incorrect that I could beat him in a debate while simultaneously playing ASL\nand\nMs Pac-man, I tend to doubt Craig will have much trouble with him.  It should be interesting to see if Craig elects to make his own positive arguments and challenge Harris to refute them or if he takes a cue from TIA and shreds the arguments that Harris puts forth.\nSince the title of the debate makes it sound as if Harris is attempting to talk his book,\nThe Moral Landscape\n, I suspect even many atheists will be underwhelmed by his futile attempt to use science as a basis for deriving ought from is.  Anyhow, I’m not staying up to watch it, so if anyone feels so inclined, please go ahead and provide color commentary or summarize it here.",
  "tags": [
    "atheism",
    "religion"
  ],
  "categories": [],
  "sitemap_lastmod": "2011-04-07T18:00:00+00:00"
}