{
  "url": "https://voxday.net/2011/04/26/mailvox-who-rules-world/",
  "scraped_at": "2025-12-13T23:09:19.086777",
  "title": "Mailvox: Who rules the world?",
  "date_display": "April 26, 2011",
  "date_iso": "2011-04-26T11:07:00+00:00",
  "date_from_url": "2011-04-26",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>AS took exception to my column yesterday:</p><blockquote><p>I’ve been a faithful follower of your commentaries at WND for many years now, and I do quite often side with you when you assert perspectives that make other conservative Christians squirm and squeal (though they should not). That being said, from one Christian to another, I cannot fathom how you can simultaneously make the emphasized statements in [three long quotes from the column] your April 25 editorial “The Problem with Evil” at WND.</p><p>In the first and third instances quoted, to imply or infer that Satan is (or ever has been) in control of this world to a greater degree than God and/or in a way independent of the sovereignty of God, is quite frankly not an orthodox Christian doctrine. Surely, Job 1-2 ought to be enough to put that idea to rest forever. I would much prefer to charitably credit what you said here to carelessness than to intention. The second instance quoted gives me hope for what you might mean given more articulation. You are quite right to say that the glorious redemptive events of Good Friday and Easter required a truly heinous context in which to occur, but to say that God was not in control of them is quite contrary to Scripture.</p><p><i>“Men of Israel, hear these words: Jesus of Nazareth, a man attested by God to you by miracles, wonders, and signs which God did through him in your midst, as you yourselves also know—him, being delivered by the determined purpose and foreknowledge of God, you have taken by lawless hands, have crucified, and put to death; whom God raised up, having loosed the pains of death, because it was not possible that he should be held by it.”</i><br> – Acts 2:22-24</br></p><p><i>“For truly against your holy servant Jesus, whom you anointed, both Herod and Pontius Pilate, with the Gentiles and the people of Israel, were gathered together to do whatever Your hand and your purpose determined before to be done.”</i><br> – Acts 4:27-28</br></p><p>The word for “determined purpose” and “determined before” in both of these passages is not a light or passive word. The root ‘orizo (from which we get the word horizon, i.e. boundary) and the compound proorizo indicate a very active demarcation of limits and actions. There is a great deal more that could be said.</p><p>As for the “prince of this world” still being the ruler, he most certainly is not still the ruler. Jesus was quite clear about that. Speaking of his impending crucifixion in John 12:31, Jesus said: “Now is the judgment of this world; now the prince of this world will be cast out.” And he elaborated on the ministry of the Helper (Spirit) to come in John 16:11 saying that he would “convict the world of sin, righteousness, and judgment … of judgment, because the prince of this world has been judged.” I don’t know what could be clearer about this than the Great Commission and the necessity of Christ’s present session and continuing conquest.</p><p><i>All authority in heaven and on earth has been given to me. Therefore, going, disciple the nations, baptizing [the nations] in the name of the Father and the Son and the Holy Spirit, teaching [the nations] to obey everything I have commanded you. Behold, I am with you, even to the consummation of the age.</i><br> – Matthew 28:18-20</br></p><p><i>He must reign until he has put all his enemies under his feet. The last enemy [not the first enemy] that will be destroyed is death.</i><br> – 1 Corinthians 15:25-26</br></p><p>It’s only fair that I lay all my cards on the table and say that I’m coming at this as a postmillennialist and Calvinist. And from what I’ve gathered over the years, you’re neither. But Scripture is Scripture, and you must be more careful, accurate, and honest about what the Word of God teaches.</p></blockquote><p>I replied thusly: <i>Look, if you want to believe that God and Jesus are homicidal maniacs and there is no difference in Satan ruling over the world prior to the Resurrection and Jesus ruling over it afterwards, that’s fine with me.  But if you genuinely believe that there has been no Satan in the world for 2,000 years, I suggest you are simply not paying attention.</i></p><p>As is so often the case in such matters, I think you are applying a POSSIBLE meaning which contradicts that which can be observed  and arguing that it is the ONLY meaning.  For example, you don’t appear to understand the concept of “sovereignty”.  Queen Elizabeth may be sovereign over her English subjects but she exercises virtually no control over them.  In fact, I would question if you have a reasonable understanding of the concept of control.  So, I will ask the obvious question: do you believe God micromanages and is personally responsible for every single human and demonic action in the world?</p><p>If your answer is yes, then we will simply agree to disagree.  If it is no, then we simply have different opinions regarding the degree to which human events are dictated by Divine will and which are the result of independently exercised free will.</p><p>AS replied:</p><blockquote><p>That was poorly reasoned response. But worse, it was not a Christ-like response but rather carnal response to give to anyone, especially a fellow Christian (who is usally quite agreeable to your views, who shares your views with others, and defends them when necessary). Such a response is quite unbefitting of you.</p><p>I neither said nor implied the following:</p><p><i>“Look, if you want to believe that God and Jesus are homicidal maniacs and there is no difference in Satan ruling over the world prior to the Resurrection and Jesus ruling over it afterwards, that’s fine with me.  But if you genuinely believe that there has been no Satan in the world for 2,000 years, I suggest you are simply not paying attention.”</i></p><p>This is belittling and inflammatory language, a red herring and an ad hominem attack. It’s a distorted, over-simplied, and caricatured version of what I said. I said nothing one way or the other about how the triune God’s rule and exhaustive providence (“micromangement” if you wish) relates to the willful actions of men. (I could give a rather long and qualified response to that issue.) It assumes that all death caused by God (if he does do that) must be homicidal mania and could not be justifiable or characterized in some other fashion. (I would support the latter.) I said nothing one way or the other about a difference in the oversight and character of human affairs and civilization before and after the Crucifixion and Resurrection. (I do think there are element of continuity and discontinuity in that regard.) And I said nothing one way or the other about Satan’s non-presence in the past 2000. (My understanding on the matter is that of a severe restriction, not a total expulsion.) At no point was Scripture itself engaged and exegeted (not that any burden on your time is required or obliged to me).</p><p>Yes, I grant you that my use (and generally the Reformed use) of “sovereignty” is unlike that of any earthly sovereign. I’ll find a better term for it if that helps; I’ll even accept the label of “micromanagement” despite its verbal baggage.</p><p><i>“So, I will ask the obvious question: do you believe God micromanages and is personally responsible for every single human and demonic action in the world? If your answer is yes, then we will simply agree to disagree.  If it is no, then we simply have different opinions regarding the degree to which human events are dictated by Divine will and which are the result of independently exercised free will.”</i></p><p>I think that’s a bit of a false dichotomy. As such I’m willing to say a bit of both your proffered answer. Yes, we will have to agree to disagree to an extent. Also, yes, we do have differing opinions about the degree to which divine will dictates human events. It’s certainly not a new argument in church history.</p><p>I can only ask that when you speak for Christianity as a whole, that you do so in a manner that is more mindful and reflective of the full range of doctrine which has defined the genuine Christian faith and the one holy catholic and apostolic church of Christ. You’re piece from last week regarding Rob Bell’s TIME magazine interview is a great example of that; I was very pleased and encouraged by it and shared it with others.</p></blockquote><p>First, I have to note that this is the third emailer in three days who does not know what <i>ad hominem</i> means to claim that I have made an <i>ad hominem</i> response to him.  It would appear general ignorance of logical terms spans a very wide breadth of creeds.  But <i>ad hominem</i> does not mean “a response that is less polite than I would like”.  It does not mean “a response that I find insulting” or even “a response that is unequivocally full of direct personal insults”.  It means “a criticism that attempts to rebut the argument by attacking the arguer instead of the argument.”</p><p>A failure to understand that is bad enough, if not unusual.  But what renders AS’s opinion completely invalid, from my perspective, is his attempt to dance around the Aristotelian logic which states that A cannot equal Not A.  How can it be a “false dichotomy” to force him to choose between “God micromanages and is personally responsible for every single human and demonic action in the world” and “God does not micromanage and is not personally responsible for every single human and demonic action in the world”?  Can God be both personally responsible and not personally responsible for a given act?  Can God act and not act in the very same action?  I don’t see how I can be expected to take seriously the criticism that my argument is “poorly reasoned” from anyone who hasn’t yet mastered A!=Not A.</p><p>I must also point out that it makes no sense to attempt to blindly apply the Bible without also paying attention to the world to which one is attempting to apply it.  If our sensory observations that tell us of of a world that is still fallen, that is still full of evil, cannot be trusted, then we cannot rely upon our reading of the Bible either, <i>since our reading of the Bible also depends upon our senses.</i></p><p>The unavoidable fact of the matter is that free will either exists or does not exist.  If I am correct, I am choosing to type these words of my own free will and God is not responsible for them, He is merely responsible for setting in motion the chain of events that eventually led to me typing them.  If I am incorrect, then I am simply a puppet and God is dictating these words to you, which would seem to imply that anything I write should be taken as the literal word of God.  So, even if I am incorrect, I must be correct – therein lies the real dichotomy.</p><p>It is important to understand that sovereignty neither implies nor requires action.  The confusion of sovereignty and action on the part of the Calvinist is remarkably similar to the common confusion between divine capability and divine action on the part of the atheist.  I don’t think this ironic similarity is purely coincidental, however, as both creeds tend to lead to similar conclusions.  For the atheist, do what thou wilt because thy will is the whole of the law.  For the Calvinist, do what thou wilt because thy will is intrinsically guided by the Will of God.</p><p>Now, I am entirely open to the possibility that we are all puppets in an extraordinarily complicated kabuki that an omniderigent God performs by Himself for His own amusement.  I simply don’t regard that to be either the most logically credible possibility nor do I consider it to be the one most strongly supported by Scripture.</p><p>When I look at the world, I see no shortage of evil.  I observe that while there are pockets of resistance to his rule, the present ruler of this world is the one to whom Paul referred, post-Resurrection, as “the god of this age”.  And finally, I must note that I do not speak for Christianity, either in whole or in part.  I speak only for myself, because I am the only person for whom I am authorized to speak.</p></div>",
  "content_text": "AS took exception to my column yesterday:\nI’ve been a faithful follower of your commentaries at WND for many years now, and I do quite often side with you when you assert perspectives that make other conservative Christians squirm and squeal (though they should not). That being said, from one Christian to another, I cannot fathom how you can simultaneously make the emphasized statements in [three long quotes from the column] your April 25 editorial “The Problem with Evil” at WND.\nIn the first and third instances quoted, to imply or infer that Satan is (or ever has been) in control of this world to a greater degree than God and/or in a way independent of the sovereignty of God, is quite frankly not an orthodox Christian doctrine. Surely, Job 1-2 ought to be enough to put that idea to rest forever. I would much prefer to charitably credit what you said here to carelessness than to intention. The second instance quoted gives me hope for what you might mean given more articulation. You are quite right to say that the glorious redemptive events of Good Friday and Easter required a truly heinous context in which to occur, but to say that God was not in control of them is quite contrary to Scripture.\n“Men of Israel, hear these words: Jesus of Nazareth, a man attested by God to you by miracles, wonders, and signs which God did through him in your midst, as you yourselves also know—him, being delivered by the determined purpose and foreknowledge of God, you have taken by lawless hands, have crucified, and put to death; whom God raised up, having loosed the pains of death, because it was not possible that he should be held by it.”\n– Acts 2:22-24\n“For truly against your holy servant Jesus, whom you anointed, both Herod and Pontius Pilate, with the Gentiles and the people of Israel, were gathered together to do whatever Your hand and your purpose determined before to be done.”\n– Acts 4:27-28\nThe word for “determined purpose” and “determined before” in both of these passages is not a light or passive word. The root ‘orizo (from which we get the word horizon, i.e. boundary) and the compound proorizo indicate a very active demarcation of limits and actions. There is a great deal more that could be said.\nAs for the “prince of this world” still being the ruler, he most certainly is not still the ruler. Jesus was quite clear about that. Speaking of his impending crucifixion in John 12:31, Jesus said: “Now is the judgment of this world; now the prince of this world will be cast out.” And he elaborated on the ministry of the Helper (Spirit) to come in John 16:11 saying that he would “convict the world of sin, righteousness, and judgment … of judgment, because the prince of this world has been judged.” I don’t know what could be clearer about this than the Great Commission and the necessity of Christ’s present session and continuing conquest.\nAll authority in heaven and on earth has been given to me. Therefore, going, disciple the nations, baptizing [the nations] in the name of the Father and the Son and the Holy Spirit, teaching [the nations] to obey everything I have commanded you. Behold, I am with you, even to the consummation of the age.\n– Matthew 28:18-20\nHe must reign until he has put all his enemies under his feet. The last enemy [not the first enemy] that will be destroyed is death.\n– 1 Corinthians 15:25-26\nIt’s only fair that I lay all my cards on the table and say that I’m coming at this as a postmillennialist and Calvinist. And from what I’ve gathered over the years, you’re neither. But Scripture is Scripture, and you must be more careful, accurate, and honest about what the Word of God teaches.\nI replied thusly:\nLook, if you want to believe that God and Jesus are homicidal maniacs and there is no difference in Satan ruling over the world prior to the Resurrection and Jesus ruling over it afterwards, that’s fine with me.  But if you genuinely believe that there has been no Satan in the world for 2,000 years, I suggest you are simply not paying attention.\nAs is so often the case in such matters, I think you are applying a POSSIBLE meaning which contradicts that which can be observed  and arguing that it is the ONLY meaning.  For example, you don’t appear to understand the concept of “sovereignty”.  Queen Elizabeth may be sovereign over her English subjects but she exercises virtually no control over them.  In fact, I would question if you have a reasonable understanding of the concept of control.  So, I will ask the obvious question: do you believe God micromanages and is personally responsible for every single human and demonic action in the world?\nIf your answer is yes, then we will simply agree to disagree.  If it is no, then we simply have different opinions regarding the degree to which human events are dictated by Divine will and which are the result of independently exercised free will.\nAS replied:\nThat was poorly reasoned response. But worse, it was not a Christ-like response but rather carnal response to give to anyone, especially a fellow Christian (who is usally quite agreeable to your views, who shares your views with others, and defends them when necessary). Such a response is quite unbefitting of you.\nI neither said nor implied the following:\n“Look, if you want to believe that God and Jesus are homicidal maniacs and there is no difference in Satan ruling over the world prior to the Resurrection and Jesus ruling over it afterwards, that’s fine with me.  But if you genuinely believe that there has been no Satan in the world for 2,000 years, I suggest you are simply not paying attention.”\nThis is belittling and inflammatory language, a red herring and an ad hominem attack. It’s a distorted, over-simplied, and caricatured version of what I said. I said nothing one way or the other about how the triune God’s rule and exhaustive providence (“micromangement” if you wish) relates to the willful actions of men. (I could give a rather long and qualified response to that issue.) It assumes that all death caused by God (if he does do that) must be homicidal mania and could not be justifiable or characterized in some other fashion. (I would support the latter.) I said nothing one way or the other about a difference in the oversight and character of human affairs and civilization before and after the Crucifixion and Resurrection. (I do think there are element of continuity and discontinuity in that regard.) And I said nothing one way or the other about Satan’s non-presence in the past 2000. (My understanding on the matter is that of a severe restriction, not a total expulsion.) At no point was Scripture itself engaged and exegeted (not that any burden on your time is required or obliged to me).\nYes, I grant you that my use (and generally the Reformed use) of “sovereignty” is unlike that of any earthly sovereign. I’ll find a better term for it if that helps; I’ll even accept the label of “micromanagement” despite its verbal baggage.\n“So, I will ask the obvious question: do you believe God micromanages and is personally responsible for every single human and demonic action in the world? If your answer is yes, then we will simply agree to disagree.  If it is no, then we simply have different opinions regarding the degree to which human events are dictated by Divine will and which are the result of independently exercised free will.”\nI think that’s a bit of a false dichotomy. As such I’m willing to say a bit of both your proffered answer. Yes, we will have to agree to disagree to an extent. Also, yes, we do have differing opinions about the degree to which divine will dictates human events. It’s certainly not a new argument in church history.\nI can only ask that when you speak for Christianity as a whole, that you do so in a manner that is more mindful and reflective of the full range of doctrine which has defined the genuine Christian faith and the one holy catholic and apostolic church of Christ. You’re piece from last week regarding Rob Bell’s TIME magazine interview is a great example of that; I was very pleased and encouraged by it and shared it with others.\nFirst, I have to note that this is the third emailer in three days who does not know what\nad hominem\nmeans to claim that I have made an\nad hominem\nresponse to him.  It would appear general ignorance of logical terms spans a very wide breadth of creeds.  But\nad hominem\ndoes not mean “a response that is less polite than I would like”.  It does not mean “a response that I find insulting” or even “a response that is unequivocally full of direct personal insults”.  It means “a criticism that attempts to rebut the argument by attacking the arguer instead of the argument.”\nA failure to understand that is bad enough, if not unusual.  But what renders AS’s opinion completely invalid, from my perspective, is his attempt to dance around the Aristotelian logic which states that A cannot equal Not A.  How can it be a “false dichotomy” to force him to choose between “God micromanages and is personally responsible for every single human and demonic action in the world” and “God does not micromanage and is not personally responsible for every single human and demonic action in the world”?  Can God be both personally responsible and not personally responsible for a given act?  Can God act and not act in the very same action?  I don’t see how I can be expected to take seriously the criticism that my argument is “poorly reasoned” from anyone who hasn’t yet mastered A!=Not A.\nI must also point out that it makes no sense to attempt to blindly apply the Bible without also paying attention to the world to which one is attempting to apply it.  If our sensory observations that tell us of of a world that is still fallen, that is still full of evil, cannot be trusted, then we cannot rely upon our reading of the Bible either,\nsince our reading of the Bible also depends upon our senses.\nThe unavoidable fact of the matter is that free will either exists or does not exist.  If I am correct, I am choosing to type these words of my own free will and God is not responsible for them, He is merely responsible for setting in motion the chain of events that eventually led to me typing them.  If I am incorrect, then I am simply a puppet and God is dictating these words to you, which would seem to imply that anything I write should be taken as the literal word of God.  So, even if I am incorrect, I must be correct – therein lies the real dichotomy.\nIt is important to understand that sovereignty neither implies nor requires action.  The confusion of sovereignty and action on the part of the Calvinist is remarkably similar to the common confusion between divine capability and divine action on the part of the atheist.  I don’t think this ironic similarity is purely coincidental, however, as both creeds tend to lead to similar conclusions.  For the atheist, do what thou wilt because thy will is the whole of the law.  For the Calvinist, do what thou wilt because thy will is intrinsically guided by the Will of God.\nNow, I am entirely open to the possibility that we are all puppets in an extraordinarily complicated kabuki that an omniderigent God performs by Himself for His own amusement.  I simply don’t regard that to be either the most logically credible possibility nor do I consider it to be the one most strongly supported by Scripture.\nWhen I look at the world, I see no shortage of evil.  I observe that while there are pockets of resistance to his rule, the present ruler of this world is the one to whom Paul referred, post-Resurrection, as “the god of this age”.  And finally, I must note that I do not speak for Christianity, either in whole or in part.  I speak only for myself, because I am the only person for whom I am authorized to speak.",
  "tags": [
    "Christianity"
  ],
  "categories": [],
  "sitemap_lastmod": "2011-04-26T10:07:00+00:00"
}