{
  "url": "https://voxday.net/2011/04/16/mailvox-no-true-atheist-defense/",
  "scraped_at": "2025-12-13T23:08:23.330595",
  "title": "Mailvox: the “No True Atheist” defense",
  "date_display": "April 16, 2011",
  "date_iso": "2011-04-16T09:52:00+00:00",
  "date_from_url": "2011-04-16",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>Cisbio is still trying to defend atheism by insisting that murderous atheists are not, in fact, atheists, while attacking Christianity for crimes that were committed by non-Christians.  Needless to say, it’s not the most effective of strategies.</p><blockquote><p>How is it dishonest to compared atheist to non-atheist crimes, if it is perfectly valid to attempt to heighten the enormity of atheist crimes by comparing them only with Christian crimes -exclusively from the middle ages?</p></blockquote><p>First, it is entirely typical that cisbio fails to understand both the context and the nature of the comparison.  TIA was not written ex nihilo, but in response to specific atheist charges made against religion in general and Christianity in particular.  The Christian crimes are not taken “exclusively from the middle ages”, as should be obvious since the period of Christendom I utilized for the purposes of comparison began prior to the Middle Ages with the accession of Theodosius I to the Western half of the Empire in combination with his decrees that re-established Christianity as the official religion of the Roman Empire.  Prior to that point, his decrees were simply not relevant to the older half of the empire.</p><p>While one could argue for starting with 363, when Jovian rescinded Julian the Apostate’s pagan revival, or possibly even 313, with Constantine the Great’s Edict of Milan, 392 marks the moment from which Christianity most clearly reigned politically supreme.  Before this date, Christian state crimes were not possible for the obvious reason that Christians did not possess sufficient political power.</p><p>Cisbio is mistaken when he thinks that I end the period of Christendom in 1453, which again should be obvious since the St. Bartholomew’s Day massacre took place in 1572.  1453 merely set the limit on the number of <i>Roman emperors</i>, 126 to be precise, to which I added every single Christian king from all the major European kingdoms down to the present day.  Again, cisbio should have known this due to the estimated number of kings utilized.  Thus, this extended period is not limited to the Middle Ages and it is not only a reasonable comparison to the two centuries in which atheism has been most influential, it is the only possible one.</p><p>And the fact that not a single one of those estimated 1,781 Christian rulers committed a single crime against his people that was one-half as bad as 52 of the 89 atheist rulers, (with the exception of King Leopold II of Belgium, who appears to have engaged in societal egg-breaking with all the vicious enthusiasm of an atheist) does tend to testify that there is something peculiarly lethal about the combination of atheists and political power.  While it is true that most of these atheist killers were Communists and the few that were not Communists were at least Socialists, it doesn’t change the fact that a) all of them were atheists, and b) most atheists are either Communists or socialists.</p><p>That may sound surprising, but recall that Bertrand Russell, Michel Onfray, and Christopher Hitchens are all socialists.  Richard Dawkins describes himself as having been a voter for the democratic socialist party in the 1970s.  Sam Harris is not a socialist, but he is an avowed globalist, which is the socialism of the 21st century.  Of the six foremost atheist intellectuals, only Dennett appears to be entirely free of a lethal form of atheism, but even that is unconfirmed.</p><p>Now, I think there is room for a reasonable discussion regarding what is more dangerous, the most lethal form of religion or the most lethal form of atheism, especially when the warlike aspect of the former is taken into account.  The important difference, however, is that whereas the most lethal form of religion is neither its largest nor its most influential form, the most lethal form of atheism is its dominant strain.  For example, I’m not at all concerned about the potential dangers posed by libertarian atheists or even Austrian School-influenced ones like Michael Shermer.  The world would be a better place if the countries where atheists now rule had leaderships consisting of libertarian atheists rather than socialist and communist ones.  But very, very few atheists are libertarians, (faux libertarians like Bill Maher notwithstanding), in fact, libertarianism is attacked by militant, left-leaning atheists like PZ Myers almost as energetically as religion.</p><p>It is true that state terror is terrible regardless of the religion of the perpetrator.  And it is also true that non-atheist perpetrators of state terror, like the pagan National Socialists, were of the political Left.  Still, while Leftism may well be the primary risk factor in the likelihood of mass slaughter, it must be taken into account that the religious Left has historically been far less violent than the atheist Left.  The Swedes may have finally gotten around to getting rid of their state church, but they haven’t killed anyone, at least not yet.</p><p>In summary, not only is the No True Atheist a logically invalid defense of historical atheist crimes, but it’s an haplessly ineffective one due to the characteristic preference of atheists for the very political ideology they are attempting to blame in order to exculpate their anti-religious creed.  But these days, Communism is all but a dead letter due to its economic failure, so the future danger from the irreligious now stems from atheist trans-nationalism of the sort advocated by Bertrand Russell and Sam Harris.</p></div>",
  "content_text": "Cisbio is still trying to defend atheism by insisting that murderous atheists are not, in fact, atheists, while attacking Christianity for crimes that were committed by non-Christians.  Needless to say, it’s not the most effective of strategies.\nHow is it dishonest to compared atheist to non-atheist crimes, if it is perfectly valid to attempt to heighten the enormity of atheist crimes by comparing them only with Christian crimes -exclusively from the middle ages?\nFirst, it is entirely typical that cisbio fails to understand both the context and the nature of the comparison.  TIA was not written ex nihilo, but in response to specific atheist charges made against religion in general and Christianity in particular.  The Christian crimes are not taken “exclusively from the middle ages”, as should be obvious since the period of Christendom I utilized for the purposes of comparison began prior to the Middle Ages with the accession of Theodosius I to the Western half of the Empire in combination with his decrees that re-established Christianity as the official religion of the Roman Empire.  Prior to that point, his decrees were simply not relevant to the older half of the empire.\nWhile one could argue for starting with 363, when Jovian rescinded Julian the Apostate’s pagan revival, or possibly even 313, with Constantine the Great’s Edict of Milan, 392 marks the moment from which Christianity most clearly reigned politically supreme.  Before this date, Christian state crimes were not possible for the obvious reason that Christians did not possess sufficient political power.\nCisbio is mistaken when he thinks that I end the period of Christendom in 1453, which again should be obvious since the St. Bartholomew’s Day massacre took place in 1572.  1453 merely set the limit on the number of\nRoman emperors\n, 126 to be precise, to which I added every single Christian king from all the major European kingdoms down to the present day.  Again, cisbio should have known this due to the estimated number of kings utilized.  Thus, this extended period is not limited to the Middle Ages and it is not only a reasonable comparison to the two centuries in which atheism has been most influential, it is the only possible one.\nAnd the fact that not a single one of those estimated 1,781 Christian rulers committed a single crime against his people that was one-half as bad as 52 of the 89 atheist rulers, (with the exception of King Leopold II of Belgium, who appears to have engaged in societal egg-breaking with all the vicious enthusiasm of an atheist) does tend to testify that there is something peculiarly lethal about the combination of atheists and political power.  While it is true that most of these atheist killers were Communists and the few that were not Communists were at least Socialists, it doesn’t change the fact that a) all of them were atheists, and b) most atheists are either Communists or socialists.\nThat may sound surprising, but recall that Bertrand Russell, Michel Onfray, and Christopher Hitchens are all socialists.  Richard Dawkins describes himself as having been a voter for the democratic socialist party in the 1970s.  Sam Harris is not a socialist, but he is an avowed globalist, which is the socialism of the 21st century.  Of the six foremost atheist intellectuals, only Dennett appears to be entirely free of a lethal form of atheism, but even that is unconfirmed.\nNow, I think there is room for a reasonable discussion regarding what is more dangerous, the most lethal form of religion or the most lethal form of atheism, especially when the warlike aspect of the former is taken into account.  The important difference, however, is that whereas the most lethal form of religion is neither its largest nor its most influential form, the most lethal form of atheism is its dominant strain.  For example, I’m not at all concerned about the potential dangers posed by libertarian atheists or even Austrian School-influenced ones like Michael Shermer.  The world would be a better place if the countries where atheists now rule had leaderships consisting of libertarian atheists rather than socialist and communist ones.  But very, very few atheists are libertarians, (faux libertarians like Bill Maher notwithstanding), in fact, libertarianism is attacked by militant, left-leaning atheists like PZ Myers almost as energetically as religion.\nIt is true that state terror is terrible regardless of the religion of the perpetrator.  And it is also true that non-atheist perpetrators of state terror, like the pagan National Socialists, were of the political Left.  Still, while Leftism may well be the primary risk factor in the likelihood of mass slaughter, it must be taken into account that the religious Left has historically been far less violent than the atheist Left.  The Swedes may have finally gotten around to getting rid of their state church, but they haven’t killed anyone, at least not yet.\nIn summary, not only is the No True Atheist a logically invalid defense of historical atheist crimes, but it’s an haplessly ineffective one due to the characteristic preference of atheists for the very political ideology they are attempting to blame in order to exculpate their anti-religious creed.  But these days, Communism is all but a dead letter due to its economic failure, so the future danger from the irreligious now stems from atheist trans-nationalism of the sort advocated by Bertrand Russell and Sam Harris.",
  "tags": [
    "atheism"
  ],
  "categories": [],
  "sitemap_lastmod": "2011-04-16T08:52:00+00:00"
}