{
  "url": "https://voxday.net/2011/04/01/marriage-and-state/",
  "scraped_at": "2025-12-13T23:06:55.195138",
  "title": "Marriage and the state",
  "date_display": "April 1, 2011",
  "date_iso": "2011-04-01T07:36:00+00:00",
  "date_from_url": "2011-04-01",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>Conservatives once welcomed the state getting involved with marriage, despite the fact that it had very little previous involvement with the institution.  The result?  Instead of strengthening marriage, in less than 150 years, we will have seen marriage devolve from a religious sacrament between a man and a woman to <a href=\"http://www.lasvegassun.com/news/2011/mar/28/aclu-sues-county-state-over-religious-test-conduct/\">a state contract of indefinite term that can be created by anyone between anyone</a>:</p><blockquote><p>The ACLU of Nevada is challenging Nevada law on who may perform marriages. Currently, the law allows clergy, judges, “commissioners of civil marriages,” and the deputy commissioner to perform marriages. This, it seems is not enough to satisfy the five individuals (shouldn’t that be an even number?) suing Clark County and the state. They would prefer the state allowed any person, regardless of religious affiliation, to be given the authority to solemnize a marriage. More exactly, they believe they have a constitutional right to this policy.</p></blockquote><p>It is long past time for religious individuals to begin pushing for the separation of marriage and state-marriage. I haven’t thought about this long enough to have a solution in mind, but the need is clearly there.  And it should be an object lesson to conservatives: Trust not in the State!</p></div>",
  "content_text": "Conservatives once welcomed the state getting involved with marriage, despite the fact that it had very little previous involvement with the institution.  The result?  Instead of strengthening marriage, in less than 150 years, we will have seen marriage devolve from a religious sacrament between a man and a woman to\na state contract of indefinite term that can be created by anyone between anyone\n:\nThe ACLU of Nevada is challenging Nevada law on who may perform marriages. Currently, the law allows clergy, judges, “commissioners of civil marriages,” and the deputy commissioner to perform marriages. This, it seems is not enough to satisfy the five individuals (shouldn’t that be an even number?) suing Clark County and the state. They would prefer the state allowed any person, regardless of religious affiliation, to be given the authority to solemnize a marriage. More exactly, they believe they have a constitutional right to this policy.\nIt is long past time for religious individuals to begin pushing for the separation of marriage and state-marriage. I haven’t thought about this long enough to have a solution in mind, but the need is clearly there.  And it should be an object lesson to conservatives: Trust not in the State!",
  "tags": [
    "law"
  ],
  "categories": [],
  "sitemap_lastmod": "2011-04-01T06:36:00+00:00"
}