{
  "url": "https://voxday.net/2011/04/14/new-wars-old-strategies/",
  "scraped_at": "2025-12-13T23:08:10.384831",
  "title": "New wars, old strategies",
  "date_display": "April 14, 2011",
  "date_iso": "2011-04-14T11:00:00+00:00",
  "date_from_url": "2011-04-14",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>Admiral Mahan on the best use of “the fleet in being”:</p><blockquote><p>For the reasons that have been given, the safest, though not the most effective, disposition of an inferior “fleet in being” is to lock it up in an impregnable port or ports, imposing upon the enemy the intense and continuous strain of watchfulness against escape. This it was that Torrington, the author of the phrase, proposed for the time to do. Thus it was that Napoleon, to some extent before Trafalgar, but afterward with set and exclusive purpose, used the French Navy, which he was continually augmenting, and yet never, to the end of his reign, permitted again to undertake any serious expedition. The mere maintenance of several formidable detachments, in apparent readiness, from the Scheldt round to Toulon, presented to the British so many possibilities of mischief that they were compelled to keep constantly before each of the French ports a force superior to that within, entailing an expense and an anxiety by which the Emperor hoped to exhaust their endurance. <br> – Mahan, <i>Lessons of the War with Spain</i></br></p></blockquote><p>This strategy of “the fleet in being” is very similar to the strategy that has been utilized by the global jihad for the last decade.  Since the danger posed by its “army in being” is most threatening so long as it remains largely hypothetical, there is little advantage for the jihad in directly engaging Western forces.  It’s far more effective to stretch out the Western militaries then bleed them in as many different locations as possible.  The Western divisions are like battleships, capable of crushing the mobile torpedo boats of the enemy any time they can bring them to bear, but seldom presented with the opportunity of doing so.  It is the most sophisticated expression yet of what VDH describes as the Eastern way of war.</p><p>Due to the geographical extent of the conflict and the extremely limited amount of information involved, the ongoing war between the Islamic jihad and the nations of the West is strategically more akin to naval war taking place in the Age of Sail or the Age of Steam than any ground war from any period in history.</p><p>Mahan notes <i>“it is evident that the active use of a “fleet in being,” however perplexing to the enemy, must be both anxious and precarious to its own commander. The contest is one of strategic wits”.</i> Therefore, to defeat the jihad, contain its expansion, and return the Dar al-Islam to its previously quiescent state, it will be necessary to force it to reveal its forces and put them in the field.  How this can best be done is a matter for strategic and tactical consideration, but it seems obvious that it cannot happen so long as an official policy of secular tolerance is in place throughout the West.  And, of course, one is hesitant to have much confidence in a contest of strategic wits with the likes of CINC Obama and General Petraeus providing what passes for the wits.</p><p>In other words, this means that widespread ethnic and religious violence is almost certainly inevitable in the intermediate future.  The recent ban of the burqah in France and the law against future minaret construction in Switzerland may be the first indications of an eventual European Reconquesta.  Unfortunately, at this point, the two most probable outcomes would appear to be either a) secular submission to Islam or b) ethnic cleansing on a scale dwarfing that of any previously known to history.  Both appear unthinkable now, and yet it is not difficult to see that the demographics dictate that one or the other will eventually come about.  Either way, the multiculturalists and immigrationists are almost certain to be burdened with a historical legacy so terrible as to make the likes of Viktor Quisling and Neville Chamberlain appear national heroes by comparison.</p></div>",
  "content_text": "Admiral Mahan on the best use of “the fleet in being”:\nFor the reasons that have been given, the safest, though not the most effective, disposition of an inferior “fleet in being” is to lock it up in an impregnable port or ports, imposing upon the enemy the intense and continuous strain of watchfulness against escape. This it was that Torrington, the author of the phrase, proposed for the time to do. Thus it was that Napoleon, to some extent before Trafalgar, but afterward with set and exclusive purpose, used the French Navy, which he was continually augmenting, and yet never, to the end of his reign, permitted again to undertake any serious expedition. The mere maintenance of several formidable detachments, in apparent readiness, from the Scheldt round to Toulon, presented to the British so many possibilities of mischief that they were compelled to keep constantly before each of the French ports a force superior to that within, entailing an expense and an anxiety by which the Emperor hoped to exhaust their endurance.\n– Mahan,\nLessons of the War with Spain\nThis strategy of “the fleet in being” is very similar to the strategy that has been utilized by the global jihad for the last decade.  Since the danger posed by its “army in being” is most threatening so long as it remains largely hypothetical, there is little advantage for the jihad in directly engaging Western forces.  It’s far more effective to stretch out the Western militaries then bleed them in as many different locations as possible.  The Western divisions are like battleships, capable of crushing the mobile torpedo boats of the enemy any time they can bring them to bear, but seldom presented with the opportunity of doing so.  It is the most sophisticated expression yet of what VDH describes as the Eastern way of war.\nDue to the geographical extent of the conflict and the extremely limited amount of information involved, the ongoing war between the Islamic jihad and the nations of the West is strategically more akin to naval war taking place in the Age of Sail or the Age of Steam than any ground war from any period in history.\nMahan notes\n“it is evident that the active use of a “fleet in being,” however perplexing to the enemy, must be both anxious and precarious to its own commander. The contest is one of strategic wits”.\nTherefore, to defeat the jihad, contain its expansion, and return the Dar al-Islam to its previously quiescent state, it will be necessary to force it to reveal its forces and put them in the field.  How this can best be done is a matter for strategic and tactical consideration, but it seems obvious that it cannot happen so long as an official policy of secular tolerance is in place throughout the West.  And, of course, one is hesitant to have much confidence in a contest of strategic wits with the likes of CINC Obama and General Petraeus providing what passes for the wits.\nIn other words, this means that widespread ethnic and religious violence is almost certainly inevitable in the intermediate future.  The recent ban of the burqah in France and the law against future minaret construction in Switzerland may be the first indications of an eventual European Reconquesta.  Unfortunately, at this point, the two most probable outcomes would appear to be either a) secular submission to Islam or b) ethnic cleansing on a scale dwarfing that of any previously known to history.  Both appear unthinkable now, and yet it is not difficult to see that the demographics dictate that one or the other will eventually come about.  Either way, the multiculturalists and immigrationists are almost certain to be burdened with a historical legacy so terrible as to make the likes of Viktor Quisling and Neville Chamberlain appear national heroes by comparison.",
  "tags": [
    "war"
  ],
  "categories": [],
  "sitemap_lastmod": "2011-04-14T10:00:00+00:00"
}