{
  "url": "https://voxday.net/2011/04/23/no-worries-he-wont-date-babykillers/",
  "scraped_at": "2025-12-13T23:09:03.954500",
  "title": "No worries, he won’t date babykillers",
  "date_display": "April 23, 2011",
  "date_iso": "2011-04-23T16:07:00+00:00",
  "date_from_url": "2011-04-23",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>It’s always somewhat amusing to see how some young women attempt to make the political personal, never realizing how it is guaranteed to come around and bite them in the behind.  And I tend to doubt that the national championship- and Heisman trophy-winning multimillionaire pro quarterback is going to be overly concerned about the threat that some would-be babykiller <a href=\"http://www.thefrisky.com/post/246-who-cares-if-hes-pro-life-when-hes-soooooo-totally-hot/\">would not date him</a> due to his willingness to speak out against the legal murder of unborn children:</p><blockquote><p>I realize I’m not the most reliable when it comes to dating guys who are totally on the up-and-up. But I draw the line at hardcore pro-lifers. I refuse to date a guy who doesn’t believe in a woman’s right to choose because I essentially view that as someone who believes women are too stupid to make decisions for themselves.</p></blockquote><p>This woman is certainly too stupid to understand that a pro-life position has nothing to do with a belief concerning women’s inability to make decisions, (that would be Game and “disinclination” would be the more appropriate term), but rather, revolves around a belief that she has no right to pay people to kill other individuals.  And while some pro-life men might be BETA enough to fall for this female posturing, the reality is that pro-choice women won’t think twice before dating pro-life men.</p><p>Even before I was a Christian, I was forthright about my anti-abortion position.  It spawned numerous arguments, as you might expect, but it never once caused a woman to lose any interest in me.  In fact, the fact that I was impervious to their waxing emotional tended to make me more attractive to them.  As with most things that women say they want, politics that are in sync with her own are one of the many things that would be required of a BETA but will be jettisoned on sight should a sufficiently attractive man enter the picture.</p></div>",
  "content_text": "It’s always somewhat amusing to see how some young women attempt to make the political personal, never realizing how it is guaranteed to come around and bite them in the behind.  And I tend to doubt that the national championship- and Heisman trophy-winning multimillionaire pro quarterback is going to be overly concerned about the threat that some would-be babykiller\nwould not date him\ndue to his willingness to speak out against the legal murder of unborn children:\nI realize I’m not the most reliable when it comes to dating guys who are totally on the up-and-up. But I draw the line at hardcore pro-lifers. I refuse to date a guy who doesn’t believe in a woman’s right to choose because I essentially view that as someone who believes women are too stupid to make decisions for themselves.\nThis woman is certainly too stupid to understand that a pro-life position has nothing to do with a belief concerning women’s inability to make decisions, (that would be Game and “disinclination” would be the more appropriate term), but rather, revolves around a belief that she has no right to pay people to kill other individuals.  And while some pro-life men might be BETA enough to fall for this female posturing, the reality is that pro-choice women won’t think twice before dating pro-life men.\nEven before I was a Christian, I was forthright about my anti-abortion position.  It spawned numerous arguments, as you might expect, but it never once caused a woman to lose any interest in me.  In fact, the fact that I was impervious to their waxing emotional tended to make me more attractive to them.  As with most things that women say they want, politics that are in sync with her own are one of the many things that would be required of a BETA but will be jettisoned on sight should a sufficiently attractive man enter the picture.",
  "tags": [
    "women"
  ],
  "categories": [],
  "sitemap_lastmod": "2011-04-23T15:07:00+00:00"
}