{
  "url": "https://voxday.net/2011/04/12/now-this-is-amusing/",
  "scraped_at": "2025-12-13T23:08:01.166502",
  "title": "Now this is amusing",
  "date_display": "April 12, 2011",
  "date_iso": "2011-04-12T20:00:00+00:00",
  "date_from_url": "2011-04-12",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>It will be interesting to see how the rabid neocons, who have never heard of a military intervention they didn’t see as an urgent matter of U.S. national security, react to <a href=\"http://www.france24.com/en/20110410-arab-league-amr-mussa-appeal-no-fly-zone-gaza-israel-air-strikes-libya-un-palestine\">this call for a no-fly zone</a>:</p><blockquote><p>Arab League chief Amr Mussa said on Sunday the organisation will ask the UN Security Council to impose a no-fly zone over Gaza, which Israel has pounded with air strikes in response to rocket fire.  Mussa told an emergency meeting of Arab League ambassadors that “the Arab bloc in the United Nations has been directed to ask for the convention of the Security Council to stop the Israeli aggression on Gaza and impose a no-fly zone.”</p></blockquote><p>I somehow suspect that those who have so vehemently demanded no-fly zones over Serbia, Iraq, and Libya will be a little less enthusiastic about shooting down Israeli planes.  But given the way they used the United Nations to justify the military interventions they supported in the past, they’ll have little grounds for arguing against this one now that the UN has declared that the Palestinian institutions <a href=\"http://ca.news.yahoo.com/palestinian-institutions-ready-statehood-u-n-20110412-070929-139.html\">are ready for statehood</a>.</p></div>",
  "content_text": "It will be interesting to see how the rabid neocons, who have never heard of a military intervention they didn’t see as an urgent matter of U.S. national security, react to\nthis call for a no-fly zone\n:\nArab League chief Amr Mussa said on Sunday the organisation will ask the UN Security Council to impose a no-fly zone over Gaza, which Israel has pounded with air strikes in response to rocket fire.  Mussa told an emergency meeting of Arab League ambassadors that “the Arab bloc in the United Nations has been directed to ask for the convention of the Security Council to stop the Israeli aggression on Gaza and impose a no-fly zone.”\nI somehow suspect that those who have so vehemently demanded no-fly zones over Serbia, Iraq, and Libya will be a little less enthusiastic about shooting down Israeli planes.  But given the way they used the United Nations to justify the military interventions they supported in the past, they’ll have little grounds for arguing against this one now that the UN has declared that the Palestinian institutions\nare ready for statehood\n.",
  "tags": [
    "war"
  ],
  "categories": [],
  "sitemap_lastmod": "2011-04-12T19:00:00+00:00"
}