{
  "url": "https://voxday.net/2011/04/27/obama-finally-releases-his-bir/",
  "scraped_at": "2025-12-13T23:09:26.286937",
  "title": "Obama finally releases his birth certificate",
  "date_display": "April 27, 2011",
  "date_iso": "2011-04-27T14:26:00+00:00",
  "date_from_url": "2011-04-27",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>And with no surprises, apparently. <a href=\"http://www.foxnews.com/projects/pdf/birth-certificate-long-form.pdf\">Here it is</a>.  No doubt it will be thoroughly checked out.  Now, if we are to credit the “cunning plan” theorists, we should see a massive uptick in Obama’s approval ratings.  I note that in addition to apparently exploding the conspiracy theories about his birth in Kenya, it also blows away the theories of those who claimed that it had already been released or could not be released.</p><p>While Donald Trump is taking credit for Obama’s 180 on the long form certificate release, I suspect that it has a little bit more to do with Jerome Corsi’s upcoming book.  I assume there must be some interesting stuff in there to have finally forced Obama’s hand.</p><p>UPDATE – Key word above being “apparently”.  The document released by the White House <a href=\"http://market-ticker.org/akcs-www?post=185094\">appears to be digitally altered</a>.  Here we go again…..</p></div>",
  "content_text": "And with no surprises, apparently.\nHere it is\n.  No doubt it will be thoroughly checked out.  Now, if we are to credit the “cunning plan” theorists, we should see a massive uptick in Obama’s approval ratings.  I note that in addition to apparently exploding the conspiracy theories about his birth in Kenya, it also blows away the theories of those who claimed that it had already been released or could not be released.\nWhile Donald Trump is taking credit for Obama’s 180 on the long form certificate release, I suspect that it has a little bit more to do with Jerome Corsi’s upcoming book.  I assume there must be some interesting stuff in there to have finally forced Obama’s hand.\nUPDATE – Key word above being “apparently”.  The document released by the White House\nappears to be digitally altered\n.  Here we go again…..",
  "tags": [
    "politics"
  ],
  "categories": [],
  "sitemap_lastmod": "2011-04-27T13:26:00+00:00"
}