{
  "url": "https://voxday.net/2011/04/30/of-course-white-house-is-lying/",
  "scraped_at": "2025-12-13T23:09:42.901514",
  "title": "Of course the White House is lying",
  "date_display": "April 30, 2011",
  "date_iso": "2011-04-30T09:06:00+00:00",
  "date_from_url": "2011-04-30",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>Given the Obama administration’s <a href=\"http://www.sfgate.com/cgi-bin/blogs/bronstein/detail?entry_id=87978&amp;tsp=1\">unique combination of shamelessness and incompetence</a>, I won’t be in the least bit surprised if we should eventually learn that the birth certificate that was finally released last week <a href=\"http://market-ticker.org/akcs-www?post=185202\">turns out to be a fake</a> too:</p><blockquote><p>In a pants-on-fire moment, the White House press office today denied anyone there had issued threats to remove Carla Marinucci and possibly other Hearst reporters from the press pool covering the President in the Bay Area.</p><p>Chronicle editor Ward Bushee called the press office on its fib: <i>“Sadly, we expected the White House to respond in this manner based on our experiences yesterday. It is not a truthful response. It follows a day of off-the-record exchanges with key people in the White House communications office who told us they would remove our reporter, then threatened retaliation to Chronicle and Hearst reporters if we reported on the ban, and then recanted to say our reporter might not be removed after all.</i></p><p>The Chronicle’s report is accurate.</p><p>If the White House has indeed decided not to ban our reporter, we would like an on-the-record notice that she will remain the San Francisco print pool reporter.”</p><p>I was on some of those calls and can confirm Ward’s statement.</p></blockquote><p>The contrast in administrations is easily apparent.  The Clinton White House used to assassinate its wayward members with impunity and successfully conceal its connection to the killings within minutes.  The Soebarkah/Soetoro White House, on the other hand, apparently can’t even forge a convincing government document when it has two years to get it right.</p></div>",
  "content_text": "Given the Obama administration’s\nunique combination of shamelessness and incompetence\n, I won’t be in the least bit surprised if we should eventually learn that the birth certificate that was finally released last week\nturns out to be a fake\ntoo:\nIn a pants-on-fire moment, the White House press office today denied anyone there had issued threats to remove Carla Marinucci and possibly other Hearst reporters from the press pool covering the President in the Bay Area.\nChronicle editor Ward Bushee called the press office on its fib:\n“Sadly, we expected the White House to respond in this manner based on our experiences yesterday. It is not a truthful response. It follows a day of off-the-record exchanges with key people in the White House communications office who told us they would remove our reporter, then threatened retaliation to Chronicle and Hearst reporters if we reported on the ban, and then recanted to say our reporter might not be removed after all.\nThe Chronicle’s report is accurate.\nIf the White House has indeed decided not to ban our reporter, we would like an on-the-record notice that she will remain the San Francisco print pool reporter.”\nI was on some of those calls and can confirm Ward’s statement.\nThe contrast in administrations is easily apparent.  The Clinton White House used to assassinate its wayward members with impunity and successfully conceal its connection to the killings within minutes.  The Soebarkah/Soetoro White House, on the other hand, apparently can’t even forge a convincing government document when it has two years to get it right.",
  "tags": [
    "politics",
    "trainwreck"
  ],
  "categories": [],
  "sitemap_lastmod": "2011-04-30T08:06:00+00:00"
}