{
  "url": "https://voxday.net/2011/04/10/overly-fantastic-military-history/",
  "scraped_at": "2025-12-13T23:07:48.203596",
  "title": "Overly fantastic military history",
  "date_display": "April 10, 2011",
  "date_iso": "2011-04-10T15:12:00+00:00",
  "date_from_url": "2011-04-10",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>Being a fan of Jim Butcher’s <em>The Dresden Files</em> and Roman history, I didn’t hesitate to read through his <em>Codex Alera</em> series as each book came out.  They are good, entertaining books, if not necessarily as absorbing as his demi-noire urban fantasy series.  But it is not my purpose to discuss the Alera books as to note a common error that is made in them as well as in many other fantasy novels.  By my admittedly inattentive count, the indomitable Aleran military lost no less than six complete legions in the span of 25 years.  And by complete, I mean absolutely complete, in one battle, the number of survivors can be counted on a single hand.  Contrast this with Roman history, in which only four Imperial legions were recorded to have lost their <em>aquila</em>, three of them in the same battle in the Teutoberg Forest under the command of Publius Quinctilius Varus.  Since Butcher’s Vord exterminate literally everything they encounter, there is perhaps sufficient room for literary license to permit this exaggeration for effect.  There is, however, little room to excuse similar exaggerations of martial lethality committed by other fantasy authors.</p><p>Read the rest of the article <a href=\"http://www.blackgate.com/2011/04/10/the-fantasy-of-military-history/\">at the Black Gate</a>.</p></div>",
  "content_text": "Being a fan of Jim Butcher’s\nThe Dresden Files\nand Roman history, I didn’t hesitate to read through his\nCodex Alera\nseries as each book came out.  They are good, entertaining books, if not necessarily as absorbing as his demi-noire urban fantasy series.  But it is not my purpose to discuss the Alera books as to note a common error that is made in them as well as in many other fantasy novels.  By my admittedly inattentive count, the indomitable Aleran military lost no less than six complete legions in the span of 25 years.  And by complete, I mean absolutely complete, in one battle, the number of survivors can be counted on a single hand.  Contrast this with Roman history, in which only four Imperial legions were recorded to have lost their\naquila\n, three of them in the same battle in the Teutoberg Forest under the command of Publius Quinctilius Varus.  Since Butcher’s Vord exterminate literally everything they encounter, there is perhaps sufficient room for literary license to permit this exaggeration for effect.  There is, however, little room to excuse similar exaggerations of martial lethality committed by other fantasy authors.\nRead the rest of the article\nat the Black Gate\n.",
  "tags": [
    "Black Gate"
  ],
  "categories": [],
  "sitemap_lastmod": "2011-04-10T14:12:00+00:00"
}