{
  "url": "https://voxday.net/2011/04/19/put-not-thy-trust-in-iq/",
  "scraped_at": "2025-12-13T23:08:43.792591",
  "title": "Put not thy trust in IQ",
  "date_display": "April 19, 2011",
  "date_iso": "2011-04-19T21:06:00+00:00",
  "date_from_url": "2011-04-19",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>Not that it is likely to, but the results of the IQ tests performed by an American Army psychologist at the Nuremberg Trials should put at least a slight damper on the often-heard atheist appeals to intelligence.  Especially since at 121.72, the average IQs of the National Socialist leadership was more than a standard deviation higher than the 103.09 mean IQ reported for atheists:</p><blockquote><p>IQ of Nazi leaders, cited from: Gilbert, G. M.: Nuremberg Diary. New York: Signet Book 1947, p. 34; Wechsler-Bellevue</p><p>Hjalmar Schacht, Reich Minister of Economics: IQ 143<br> Arthur Seyss-Inquart, Foreign Minister of Germany: IQ 141<br> Hermann Göring, President of the Reichstag and Reich Minister of Aviation: IQ 138<br> Karl Dönitz, Commander-in-Chief of the Kriegsmarine: IQ 138<br> Albert Speer, Minister of Armaments and War Production:  IQ 128<br> Alfred Jodl, Chief of the Operations Staff of the Oberkommando der Wehrmacht: IQ 127<br> Alfred Rosenberg, Commissar for Supervision of Intellectual and Ideological Education of the German National Socialist Workers Party: IQ 127<br> Rudolf Hess, Deputy Führer: IQ 120</br></br></br></br></br></br></br></p></blockquote><p>In other words, if we are to take seriously the idea that <a href=\"http://ibcsr.org/index.php?option=com_content&amp;view=article&amp;id=150:is-atheism-linked-to-intelligence&amp;catid=25:research-news&amp;Itemid=59\">the reported 5.95-point IQ advantage</a> enjoyed by the “not-at-all religious” over the “very religious” means that we should be inclined to reject the theistic perspective, then surely the 18.63 advantage of the National Socialists proves we should all convert to Nazi atheism.</p></div>",
  "content_text": "Not that it is likely to, but the results of the IQ tests performed by an American Army psychologist at the Nuremberg Trials should put at least a slight damper on the often-heard atheist appeals to intelligence.  Especially since at 121.72, the average IQs of the National Socialist leadership was more than a standard deviation higher than the 103.09 mean IQ reported for atheists:\nIQ of Nazi leaders, cited from: Gilbert, G. M.: Nuremberg Diary. New York: Signet Book 1947, p. 34; Wechsler-Bellevue\nHjalmar Schacht, Reich Minister of Economics: IQ 143\nArthur Seyss-Inquart, Foreign Minister of Germany: IQ 141\nHermann Göring, President of the Reichstag and Reich Minister of Aviation: IQ 138\nKarl Dönitz, Commander-in-Chief of the Kriegsmarine: IQ 138\nAlbert Speer, Minister of Armaments and War Production:  IQ 128\nAlfred Jodl, Chief of the Operations Staff of the Oberkommando der Wehrmacht: IQ 127\nAlfred Rosenberg, Commissar for Supervision of Intellectual and Ideological Education of the German National Socialist Workers Party: IQ 127\nRudolf Hess, Deputy Führer: IQ 120\nIn other words, if we are to take seriously the idea that\nthe reported 5.95-point IQ advantage\nenjoyed by the “not-at-all religious” over the “very religious” means that we should be inclined to reject the theistic perspective, then surely the 18.63 advantage of the National Socialists proves we should all convert to Nazi atheism.",
  "tags": [
    "atheism",
    "history"
  ],
  "categories": [],
  "sitemap_lastmod": "2011-04-19T20:06:00+00:00"
}