{
  "url": "https://voxday.net/2011/04/05/reason-without-knowledge/",
  "scraped_at": "2025-12-13T23:07:13.544970",
  "title": "Reason without knowledge",
  "date_display": "April 5, 2011",
  "date_iso": "2011-04-05T08:11:00+00:00",
  "date_from_url": "2011-04-05",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>It’s always informative to watch an atheist <a href=\"http://www.nytimes.com/2011/04/05/opinion/05iht-edcohen05.html?_r=1&amp;hp\">attempt to stumble his way to a conclusion</a> that justifies his incoherent beliefs about religion and humanity, most of which are formed in near-complete ignorance of the former.</p><blockquote><p>So Terry Jones, the Florida pastor who organized a Koran burning on March 20, wanted “to stir the pot.” Mission accomplished. Perhaps he’d care to explain himself to the family of Joakim Dungel, a 33-year-old Swede slaughtered at the U.N. mission in Mazar-i-Sharif by Afghans whipped into frenzy through Jones’s folly.</p><p>On reflection, no, there’s nothing Jones can explain to Dungel’s family, or the other U.N. staffers murdered. Jones is not in the explanation business. He’s a zealot. How else to describe a Christian who interprets his faith not as grounded in love and compassion but as a mission to incite hatred toward Islam?</p><p>There’s no discussion with a bigot like this: You can’t be argued out of something you haven’t been argued into in the first place.</p></blockquote><p>There are so many things wrong with Roger Cohen’s column that it’s hard to know where to start.  So, let’s begin with the aphorism, one that is popular among atheists, and like most popular atheist aphorisms, is easily shown to be both factually and logically incorrect.  Cohen presents a modified form of the usual saying, which is that one cannot be <i>reasoned</i> out of a position one has not reasoned oneself into.  But this is clearly false.  Most of us possess opinions that are based on assertions that were made to us as children by parents, teachers, and other children, in fact, that is how we obtain most of our opinions.</p><p>Therefore, when one changes one’s long-held opinion based on a consideration of the relevant facts and logic, either internal or external, one is usually reasoning one’s way/being reasoned out of something one has not reasoned oneself into.  As a child, I thought the crust was the healthiest part of the bread because my mother told me that when I was very young and I had never once stopped to think about the matter.  Years later, when Spacebunny asked me to consider it, I quickly reasoned myself out of the instilled belief.</p><p>Now, why would the Rev. Jones have any need to explain himself to the family of Joakim Dungel?  He didn’t put Dungel in harm’s way in Afghanistan.  The government of the United States, the government of Sweden, and the United Nations bureaucracy all bear some responsibility for Dungel’s presence in the war zone that is Afghanistan, as did Dungel himself.  Those <a href=\"http://www.dailymail.co.uk/news/article-1372827/Terry-Jones-Mohammed-trial-Koran-burning-sparks-2nd-day-violence.html\">who attacked the UN workers</a> were not forced to attack them, they made a conscious choice to do so.  And Korans are incinerated literally every day around the world, so the decision of Afghani Muslims to react with violence to a symbolic gesture is actually nothing more than scientific evidence in support of Jones’s hypothesis regarding Islam.  If Rev. Jones is to be held “responsible” for burning a Koran, then the likes of P.Z. Myers must be held equally responsible for desecrating a Communion wafer.</p><p>It is ironic that Cohen, whose name indicates Jewish heritage despite his professed status as a non-believer, should attempt to utilize the term “zealot” as being somehow incompatible with genuine religious principles.  To be zealous in one’s Christian faith is an excellent thing, as to whether that is true of Jones or not, neither I nor Cohen can possibly say with any degree of accuracy.  Where Cohen goes wrong, as do so many ignorant non-believers, is to state that Christianity is grounded in love and compassion or that it has no place for hatred.</p><p>It all depends what the object is.  Christians are told to love their neighbors and enemies alike, but also to hate evil and to shun the wicked.  Compassion and forgiveness for the repentant is required, but wickedness is not to be tolerated.  Jones did no harm to any individual man, woman, or child, he simply attacked what every Christian believes to be false.</p><p>Cohen goes on to write that believing Islam and the Koran serve violence, death, and terrorism is as dumb as equating Christianity with Psalm 137 that says the “little ones” of the enemy should be dashed against stones.  But it is Cohen’s comparison that is almost epically stupid, as Psalms predates Christianity and isn’t even part of the Mosaic Law anyhow, whereas the Koran is the core of Islam.  And it is a historical fact that Islam accounts for 50 percent of all the religious wars in history, which should come as no surprise given that it has always been a religion of the sword which has grown through military conquest rather than personal transformation.  It takes an atheist to conclude that the core tenets of Christianity should be represented by pre-Christian poems from a different religious tradition.</p><p>Cohen claims that religion has much to answer for, in Gainesville and Mazar and Omagh.  But atheism has even more for which to answer, in Pyongyang, Beijing, Colombo, Yangon, Hanoi, and Brussels.  In any event, Terry Jones does not represent the worst that religion can do, in fact, he is one of the brave few calling attention to the worst that religion actually does, considering the bloody centuries of rule by the mighty caliphates of the past that the modern jihad is actively seeking to restore.  Unlike Bush, Obama, Gen. Petraeus, and media figures like Cohen, Jones clearly recognizes for what the so-called Religion of Peace is and what it is not.</p><p>In conclusion, I note that like most non-believers, Cohen does not realize that it is not hatred and murder that are the antithesis of mercy and forgiveness, but rather self-assurance and pride.</p></div>",
  "content_text": "It’s always informative to watch an atheist\nattempt to stumble his way to a conclusion\nthat justifies his incoherent beliefs about religion and humanity, most of which are formed in near-complete ignorance of the former.\nSo Terry Jones, the Florida pastor who organized a Koran burning on March 20, wanted “to stir the pot.” Mission accomplished. Perhaps he’d care to explain himself to the family of Joakim Dungel, a 33-year-old Swede slaughtered at the U.N. mission in Mazar-i-Sharif by Afghans whipped into frenzy through Jones’s folly.\nOn reflection, no, there’s nothing Jones can explain to Dungel’s family, or the other U.N. staffers murdered. Jones is not in the explanation business. He’s a zealot. How else to describe a Christian who interprets his faith not as grounded in love and compassion but as a mission to incite hatred toward Islam?\nThere’s no discussion with a bigot like this: You can’t be argued out of something you haven’t been argued into in the first place.\nThere are so many things wrong with Roger Cohen’s column that it’s hard to know where to start.  So, let’s begin with the aphorism, one that is popular among atheists, and like most popular atheist aphorisms, is easily shown to be both factually and logically incorrect.  Cohen presents a modified form of the usual saying, which is that one cannot be\nreasoned\nout of a position one has not reasoned oneself into.  But this is clearly false.  Most of us possess opinions that are based on assertions that were made to us as children by parents, teachers, and other children, in fact, that is how we obtain most of our opinions.\nTherefore, when one changes one’s long-held opinion based on a consideration of the relevant facts and logic, either internal or external, one is usually reasoning one’s way/being reasoned out of something one has not reasoned oneself into.  As a child, I thought the crust was the healthiest part of the bread because my mother told me that when I was very young and I had never once stopped to think about the matter.  Years later, when Spacebunny asked me to consider it, I quickly reasoned myself out of the instilled belief.\nNow, why would the Rev. Jones have any need to explain himself to the family of Joakim Dungel?  He didn’t put Dungel in harm’s way in Afghanistan.  The government of the United States, the government of Sweden, and the United Nations bureaucracy all bear some responsibility for Dungel’s presence in the war zone that is Afghanistan, as did Dungel himself.  Those\nwho attacked the UN workers\nwere not forced to attack them, they made a conscious choice to do so.  And Korans are incinerated literally every day around the world, so the decision of Afghani Muslims to react with violence to a symbolic gesture is actually nothing more than scientific evidence in support of Jones’s hypothesis regarding Islam.  If Rev. Jones is to be held “responsible” for burning a Koran, then the likes of P.Z. Myers must be held equally responsible for desecrating a Communion wafer.\nIt is ironic that Cohen, whose name indicates Jewish heritage despite his professed status as a non-believer, should attempt to utilize the term “zealot” as being somehow incompatible with genuine religious principles.  To be zealous in one’s Christian faith is an excellent thing, as to whether that is true of Jones or not, neither I nor Cohen can possibly say with any degree of accuracy.  Where Cohen goes wrong, as do so many ignorant non-believers, is to state that Christianity is grounded in love and compassion or that it has no place for hatred.\nIt all depends what the object is.  Christians are told to love their neighbors and enemies alike, but also to hate evil and to shun the wicked.  Compassion and forgiveness for the repentant is required, but wickedness is not to be tolerated.  Jones did no harm to any individual man, woman, or child, he simply attacked what every Christian believes to be false.\nCohen goes on to write that believing Islam and the Koran serve violence, death, and terrorism is as dumb as equating Christianity with Psalm 137 that says the “little ones” of the enemy should be dashed against stones.  But it is Cohen’s comparison that is almost epically stupid, as Psalms predates Christianity and isn’t even part of the Mosaic Law anyhow, whereas the Koran is the core of Islam.  And it is a historical fact that Islam accounts for 50 percent of all the religious wars in history, which should come as no surprise given that it has always been a religion of the sword which has grown through military conquest rather than personal transformation.  It takes an atheist to conclude that the core tenets of Christianity should be represented by pre-Christian poems from a different religious tradition.\nCohen claims that religion has much to answer for, in Gainesville and Mazar and Omagh.  But atheism has even more for which to answer, in Pyongyang, Beijing, Colombo, Yangon, Hanoi, and Brussels.  In any event, Terry Jones does not represent the worst that religion can do, in fact, he is one of the brave few calling attention to the worst that religion actually does, considering the bloody centuries of rule by the mighty caliphates of the past that the modern jihad is actively seeking to restore.  Unlike Bush, Obama, Gen. Petraeus, and media figures like Cohen, Jones clearly recognizes for what the so-called Religion of Peace is and what it is not.\nIn conclusion, I note that like most non-believers, Cohen does not realize that it is not hatred and murder that are the antithesis of mercy and forgiveness, but rather self-assurance and pride.",
  "tags": [
    "religion"
  ],
  "categories": [],
  "sitemap_lastmod": "2011-04-05T07:11:00+00:00"
}