{
  "url": "https://voxday.net/2011/04/08/rush-makes-excuses/",
  "scraped_at": "2025-12-13T23:07:37.268906",
  "title": "Rush makes excuses",
  "date_display": "April 8, 2011",
  "date_iso": "2011-04-08T08:03:00+00:00",
  "date_from_url": "2011-04-08",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>Limbaugh appears to be surprised that <a href=\"http://www.wnd.com/index.php?fa=PAGE.view&amp;pageId=284621\">many Republicans blame him and other Republican leaders</a> for failing to investigate Obama’s birth certificate scandal.  But why shouldn’t they be blamed?  Not a single one of them had the balls to do what Joseph Farah and now Donald Trump have done in pointing out that the president has no birth certificate.</p><blockquote><p>Caller: “The fact of the matter is that his citizenship has been a suspicious issue from the very beginning, and not one high Republican or you has ever really tried to nail him on this issue, and if it does turn out that he is not a true citizen, then I think all of you should hang your heads in shame because of all the destruction our country has had to suffer ever since he was elected, in spite of being the fraud that we know he probably really is.”</p><p>Limbaugh: “So you’re mad at me?”</p><p>Caller: “I am furious. I wanted you and anybody else to go after him on this issue before he was elected. It would have been the easiest way to have stopped him. It would have been a no-brainer. But nobody would. And so he was elected and everything was just hidden under the rug. And now look what we have had ever since. … If it does turn out that he’s not a citizen, I think you should hang your head in shame, because our country has suffered so much….”</p><p>Rush: “OK, if you want to focus, Angela, on what should have happened before the election, we can do that, and I can focus on the stupidity of half the country that voted for the guy, and I can talk about all the stupid things the media said and all the tricks that were played to convince people that he’s not who he was. But today it’s 2011 and those days are over and we are living in the midst of this guy destroying the economy and going back and talking about a birth certificate right now is not the most effective way of stopping this guy. I would love nothing more than for this guy to be proven a fraud. I would love nothing more than for all of this to have been a giant trick. I would love nothing more than for him to get nabbed at this, but there isn’t any evidence of it yet. I would love nothing more to see what happens when it’s proven, if it could be, that he’s not a citizen. What happens with legislation when everything he’s done is unqualified, everything he’s done is illegal. Everything he’s done has gotta be wiped clean. Can you imagine that battle? I would love to see that.</p><p>You’ve got me pegged wrong here. But I deal with what is. I don’t deal with what-ifs. “If” is for children. And we’ve got certain things that are the reality of the day that have to be dealt with, pure and simple, and that’s where I am on this. No more and no less. There’s no magic wand that can get Obama unelected. You can hope and you can dream but you are locked in a fantasy if that’s what you’re waiting for. That isn’t gonna happen. The focus needs to be on making sure he’s not reelected. But there is no way to unelect the guy. It isn’t going to happen.”</p></blockquote><p>Limbaugh has somehow managed to miss the point in his attempt to defend his past and present failures to show up on the issue here.  No one is talking about getting Obama “unelected” by belatedly unearthing the facts about his probable ineligibility for the elected office he presently holds.  First and foremost, they just want the truth.  Everyone with even half a brain smells a rat, but smelling one is not tantamount to conclusively identifying one.  Perhaps it’s just a mouse, perhaps it’s nothing.  No one truly knows except Obama and possibly some of his innermost circle.  Second, it should be obvious that if Limbaugh is really serious about how the focus needs to be on making sure Obama is not reelected, then the most realistic and effective way to do that is for him to actively support the proposed presidential eligibility laws in the 13 states that are presently considering them.  The unexpected poll strength shown by Donald Trump proves that focusing on the birth certificate is not only an effective approach in legally cutting out the legs from under Obama, it may be a vote-winner as well because most Americans aren’t drinking the Hope and Change-flavored Kool-Aid anymore.</p><p>Rush and the conservative media were afraid to look out of the mainstream in 2008.  What they haven’t realized yet is that doubts about Obama’s legitimacy are now the mainstream position, which is why Jerome Corsi’s new book on the subject is all but guaranteed to become a #1 New York Times bestseller when it is released this month.</p><p>So, Limbaugh’s caller was correct to be furious with him.  Like McCain and Palin, Rush simply refused to do what many of his fans perceived to be his duty in 2008 and he’s not doing it now.  Instead, <a href=\"http://www.msnbc.msn.com/id/21134540/vp/42469716#42469716\">he’s left it to the likes of Trump to call Obama to account</a>, who despite being more of a reality TV candidate than a real one, would almost certainly make for a less disastrous Republican president than anyone but Ron Paul.</p></div>",
  "content_text": "Limbaugh appears to be surprised that\nmany Republicans blame him and other Republican leaders\nfor failing to investigate Obama’s birth certificate scandal.  But why shouldn’t they be blamed?  Not a single one of them had the balls to do what Joseph Farah and now Donald Trump have done in pointing out that the president has no birth certificate.\nCaller: “The fact of the matter is that his citizenship has been a suspicious issue from the very beginning, and not one high Republican or you has ever really tried to nail him on this issue, and if it does turn out that he is not a true citizen, then I think all of you should hang your heads in shame because of all the destruction our country has had to suffer ever since he was elected, in spite of being the fraud that we know he probably really is.”\nLimbaugh: “So you’re mad at me?”\nCaller: “I am furious. I wanted you and anybody else to go after him on this issue before he was elected. It would have been the easiest way to have stopped him. It would have been a no-brainer. But nobody would. And so he was elected and everything was just hidden under the rug. And now look what we have had ever since. … If it does turn out that he’s not a citizen, I think you should hang your head in shame, because our country has suffered so much….”\nRush: “OK, if you want to focus, Angela, on what should have happened before the election, we can do that, and I can focus on the stupidity of half the country that voted for the guy, and I can talk about all the stupid things the media said and all the tricks that were played to convince people that he’s not who he was. But today it’s 2011 and those days are over and we are living in the midst of this guy destroying the economy and going back and talking about a birth certificate right now is not the most effective way of stopping this guy. I would love nothing more than for this guy to be proven a fraud. I would love nothing more than for all of this to have been a giant trick. I would love nothing more than for him to get nabbed at this, but there isn’t any evidence of it yet. I would love nothing more to see what happens when it’s proven, if it could be, that he’s not a citizen. What happens with legislation when everything he’s done is unqualified, everything he’s done is illegal. Everything he’s done has gotta be wiped clean. Can you imagine that battle? I would love to see that.\nYou’ve got me pegged wrong here. But I deal with what is. I don’t deal with what-ifs. “If” is for children. And we’ve got certain things that are the reality of the day that have to be dealt with, pure and simple, and that’s where I am on this. No more and no less. There’s no magic wand that can get Obama unelected. You can hope and you can dream but you are locked in a fantasy if that’s what you’re waiting for. That isn’t gonna happen. The focus needs to be on making sure he’s not reelected. But there is no way to unelect the guy. It isn’t going to happen.”\nLimbaugh has somehow managed to miss the point in his attempt to defend his past and present failures to show up on the issue here.  No one is talking about getting Obama “unelected” by belatedly unearthing the facts about his probable ineligibility for the elected office he presently holds.  First and foremost, they just want the truth.  Everyone with even half a brain smells a rat, but smelling one is not tantamount to conclusively identifying one.  Perhaps it’s just a mouse, perhaps it’s nothing.  No one truly knows except Obama and possibly some of his innermost circle.  Second, it should be obvious that if Limbaugh is really serious about how the focus needs to be on making sure Obama is not reelected, then the most realistic and effective way to do that is for him to actively support the proposed presidential eligibility laws in the 13 states that are presently considering them.  The unexpected poll strength shown by Donald Trump proves that focusing on the birth certificate is not only an effective approach in legally cutting out the legs from under Obama, it may be a vote-winner as well because most Americans aren’t drinking the Hope and Change-flavored Kool-Aid anymore.\nRush and the conservative media were afraid to look out of the mainstream in 2008.  What they haven’t realized yet is that doubts about Obama’s legitimacy are now the mainstream position, which is why Jerome Corsi’s new book on the subject is all but guaranteed to become a #1 New York Times bestseller when it is released this month.\nSo, Limbaugh’s caller was correct to be furious with him.  Like McCain and Palin, Rush simply refused to do what many of his fans perceived to be his duty in 2008 and he’s not doing it now.  Instead,\nhe’s left it to the likes of Trump to call Obama to account\n, who despite being more of a reality TV candidate than a real one, would almost certainly make for a less disastrous Republican president than anyone but Ron Paul.",
  "tags": [
    "politics"
  ],
  "categories": [],
  "sitemap_lastmod": "2011-04-08T07:03:00+00:00"
}