{
  "url": "https://voxday.net/2011/04/27/schizophrenic-calvinist-god/",
  "scraped_at": "2025-12-13T23:09:22.797867",
  "title": "Piper and the schizo god",
  "date_display": "April 27, 2011",
  "date_iso": "2011-04-27T10:06:00+00:00",
  "date_from_url": "2011-04-27",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>A number of the omniderigistes here have spoken highly of John Piper.  Now, I haven’t paid any attention to the man in the past nor do I know much about him, only that I tended to disagree with his past statements about Greg Boyd and to agree with his more recent statements about Rob Bell.  So, I thought it might not be a bad idea to read through a few of his arguments in order to see what this reportedly formidable theologian had to offer.  I read a few of his articles and I downloaded a PDF of a book rather dramatically entitled <i>Beyond the Bounds: Open Theism and the Undermining of Biblical Christianity</i>.</p><p>When reading the book’s Forward, I was immediately unimpressed by the way Piper began by launching into numerous appeals to historical authority and emotion.  I have no doubt it goes over well among like minds in the pews but I am entirely unmoved by emotional posturing, particularly of the self-elevating variety.  Perhaps some will find my case less convincing for the admission, but I am not the least bit “broken-hearted” by what I consider to be the devious snake’s heart of Calvinism; I would be remiss if I failed to congratulate Piper for the invention of an exciting new logical fallacy, the Appeal to the Sad Puppy Face.  People get things wrong all the time for a near-infinite variety of reasons, many of them less than nefarious, but I suppose it’s much more satisfying to see the hand of Hell behind every insufficiently orthodox idea.  On my part, my sole interest in this, as in most things, is the purely Abelardian one of what is so and what is not so.  I’m not the least bit interested in the personal angle, so there is no need for anyone to get his panties in a bunch on Piper’s behalf.  Every argument must either either stand or fall on its own regardless of who first happened to formulate it.</p><p>After reading the forward, I then turned my attention to his article on the controversial repentance verse in 1 Samuel, and as I expected he would, Piper followed the conventional Calvinist pattern of interpreting the Biblical text naturally or unnaturally depending upon whether the verse fits his dogma or not.  It is very easy to spot when he is interpreting it unnaturally – by which I mean that he is straining to force-fit an improbable or invalid interpretation of a passage – because he resorts to one or more analogical explanations to justify the misreading.  And this is where his arguments are most vulnerable.  Because his unlikely interpretation is a force-fitted one, he is forced to rely upon flawed examples that do not actually support the point he is attempting to make.  This isn’t always immediately obvious to the casual reader, but to one who has a great deal of experience of picking out similar logical contortions and distortions in the arguments of the New Atheists, it is readily apparent.  And these exemplary flaws are further highlighted by the need to subsequently turn around and deny the more natural reading of the text.</p><p>This is what I have observed to be the characteristic structure of the Piperian critical argument:</p><p>1.  The Bible states A, which appears to prove B.<br> 2.  But A does not prove B because A is actually Not A.<br> 3.  A must be Not A because in a different verse, the Bible states C and C not only takes precedence over A in this particular application, but must be taken as universally applicable.<br> 4.  Provide an example substituting a for A.<br> 5.  Conclusion: because a is Not A, A fails to prove B and B is therefore incorrect.</br></br></br></br></p><p>Being aware of this fallacious structure, I spotted no less than six errors in Piper’s 1998 article entitled “<a href=\"http://www.desiringgod.org/resource-library/taste-see-articles/god-does-not-repent-like-a-man\">God Does Not Repent Like a Man”.</a> If one wishes to be truly pedantic, there are seven, but I see no reason that aprevistans need to resort to such dubious measures as would be required to assert the seventh flaw.  These errors are particularly problematic in light of Piper’s claim that Open Theism “dishonors God, distorts Scripture, damages faith, and would, if left unchecked, destroy churches and lives.”  But one must view Piper’s judgment with an extremely skeptical eye, given the way in which his own writings are quite literally error-filled; in the article criticized here he averages nearly an error per paragraph.</p><p>1.  Factual Error.  Piper says it is not true to human experience to say that God would not lament over a state of affairs he himself chose to bring about.  (Or to remove the double negative, it is true to human experience that God would lament over something that He intended to do and successfully did.)  But this not only substitutes the exception for the rule, it is an incorrect summary of the actual aprevistan argument.  God didn’t merely lament making Saul king, He regretted it and then acted to undo His previous act.  But since Piper is appealing to human experience, the observable fact is that most humans do not regret or attempt to undo things that work out exactly as they intended from the start.</p><p>2.  Logical Error.  Piper appeals to nothing more substantial than his own imagination when he claims, “more importantly”, that God “may well be capable of lamenting over something he chose to bring about”.  Or, on the other hand, he may well not be.  Piper would more reasonably have theorized that God may be schizophrenic on the basis of the apparent contradiction between repenting and not repenting, especially since the not-repenting aspect was actually given a different name.  The fact that Piper places more importance on this appeal to his own imagination than his appeal to human experience highlights the inherently insubstantial nature of his argument.</p><p>3.  Logical Error.  Piper provides an inappropriate example in an attempt to assert that God can simultaneously lament and affirm an act as being for the best.  In postulating a spanking of his son that leads to his son running away, Piper says that he “may feel some remorse over the spanking – not in the sense that I disapprove of what I did…. If I had it to do over again, I would still spank him.”  But this example is not relevant to the situation described in Samuel, where God not only laments having made Saul king, but also acts to undo Saul’s kingship.  It is clear that if God had to do it over again, He would not have made Saul king, otherwise He would not be stating His regrets as well as undoing the results of His previous action.  At no point does God affirm His selection of Saul as having been for the best, and His actions, as well as His earlier statements that Israel’s request for a king was evil, indicate that it was not.  Note that Piper concludes the flawed example with a second appeal to his own imagination.</p><p>4a.  If I wished to be stubbornly obtuse in the way some omniderigistes are when presented with a literal text, I would point out that “the Glory of Israel” is not necessarily God.  However, since I prefer to read a text in a straightforward manner without utilizing dogmatic lenses, I accept the assumption that “the Glory of Israel” is a reference to God.  But note that it is still an assumption, even if the assumption is a perfectly reasonable one.</p><p>4b.  Logical Error.  Piper claims that the difference between God’s regret of verses 11 and 34 and the Glory of Israel’s non-repentance in verse 29 “would naturally be that God’s repentance happens in spite of perfect foreknowledge, while most human repentance happens because we lack foreknowledge”.  This is complete nonsense.  It would most naturally be nothing of the kind.  Piper is making the customary Calvinist mistake of taking a singular action and transforming it into a general principle on the basis of nothing, and doing so in contradiction to other singular actions.</p><p>Piper has ignored that Samuel’s statement about God is made in the context of Samuel’s angry attempt to get the Lord to change His mind about taking Saul’s kingship away. <i>“Samuel was angry, and he cried out to the LORD all that night.”</i> Piper has also ignored that Samuel’s statement is in direct response to Saul’s plea for forgiveness and the removal of the punishment.  The natural explanation between two repents and one not-repent is not a bizarre change of subject to divine versus human foreknowledge, but the fact that God does not repent of His decision to take the kingdom away from Saul and is not lying when He says that He has already taken it away and given it to another when neither Saul nor Samuel nor anyone else can possibly see any sign of that having happened yet.</p><p>Piper would no doubt be confused should he read an Agatha Christie novel.  After all, since Poirot repeatedly says that he “knows everything” when confronting a culprit at the climax of the book, why would he have any need to gather clues and talk to people on his next case?  Since he knows everything, obviously he must know who all subsequent murderers are, correct?  This resort to a universal interpretation is no less absurd in the Biblical context than in the Christie novels.</p><p>The same contextual point holds true for the reference to Numbers 23:19.  Balaam is referring to God’s specific command to bless Israel instead of cursing it, the statement is no more intended to be universally applicable than the immediately subsequent statement that no misery is observed in Israel.  That Piper’s universal interpretation is incorrect should be obvious, given the subsequent curses God later metes out to Israel.</p><p>5.  Factual Error.  Piper substitutes “feel sorrow” for “regret”.  This substitution is not valid because it is not sufficient and Piper himself notes that “regret [= repent]”.  When Jesus Christ calls us to repent, he is not merely expecting us to feel sorry, but to take action as well.  Piper writes: “For God to say, ‘I feel sorrow that I made Saul king,’ is not the same as saying, ‘I would not make him king if I had it to do over.’  That is perfectly true, but it also doesn’t suffice to correctly describe the situation.  For God to say “I regret that I made Saul king” <i>and then to remove the kingship from him</i> most certainly amounts to saying “I would not make him king if I had it to do over.”  Piper focuses on the emotion and completely ignores the action: the fact that God undid His previous action at what appears to have been the second opportunity.</p><p>6.  Logical Error.  Piper asserts that “God’s commitment to his promises hangs on his not repenting like a man”.  But this, too, is an entirely spurious statement.  It is an observable fact that mere men can, and do, keep their commitments to their promises.  Therefore, God’s ability to do the same clearly cannot depend upon a total incapacity for changing His mind or regretting a past action.</p><p>Based on what I’ve seen thus far, Piper’s omniderigent theology rests upon a combination of willful obtuseness, a determined lack of reading comprehension, emotional appeals, and invalid logic.  It is primarily the result of confusing capability for action and mistaking singular statements for universally applicable ones.  In any event, I have pointed out six specific errors committed by Piper, four logical and two factual.  I shall be interested to know exactly how many of those six errors his fellow omniderigents and/or Calvinists are willing to assert are not, in fact, errors.</p></div>",
  "content_text": "A number of the omniderigistes here have spoken highly of John Piper.  Now, I haven’t paid any attention to the man in the past nor do I know much about him, only that I tended to disagree with his past statements about Greg Boyd and to agree with his more recent statements about Rob Bell.  So, I thought it might not be a bad idea to read through a few of his arguments in order to see what this reportedly formidable theologian had to offer.  I read a few of his articles and I downloaded a PDF of a book rather dramatically entitled\nBeyond the Bounds: Open Theism and the Undermining of Biblical Christianity\n.\nWhen reading the book’s Forward, I was immediately unimpressed by the way Piper began by launching into numerous appeals to historical authority and emotion.  I have no doubt it goes over well among like minds in the pews but I am entirely unmoved by emotional posturing, particularly of the self-elevating variety.  Perhaps some will find my case less convincing for the admission, but I am not the least bit “broken-hearted” by what I consider to be the devious snake’s heart of Calvinism; I would be remiss if I failed to congratulate Piper for the invention of an exciting new logical fallacy, the Appeal to the Sad Puppy Face.  People get things wrong all the time for a near-infinite variety of reasons, many of them less than nefarious, but I suppose it’s much more satisfying to see the hand of Hell behind every insufficiently orthodox idea.  On my part, my sole interest in this, as in most things, is the purely Abelardian one of what is so and what is not so.  I’m not the least bit interested in the personal angle, so there is no need for anyone to get his panties in a bunch on Piper’s behalf.  Every argument must either either stand or fall on its own regardless of who first happened to formulate it.\nAfter reading the forward, I then turned my attention to his article on the controversial repentance verse in 1 Samuel, and as I expected he would, Piper followed the conventional Calvinist pattern of interpreting the Biblical text naturally or unnaturally depending upon whether the verse fits his dogma or not.  It is very easy to spot when he is interpreting it unnaturally – by which I mean that he is straining to force-fit an improbable or invalid interpretation of a passage – because he resorts to one or more analogical explanations to justify the misreading.  And this is where his arguments are most vulnerable.  Because his unlikely interpretation is a force-fitted one, he is forced to rely upon flawed examples that do not actually support the point he is attempting to make.  This isn’t always immediately obvious to the casual reader, but to one who has a great deal of experience of picking out similar logical contortions and distortions in the arguments of the New Atheists, it is readily apparent.  And these exemplary flaws are further highlighted by the need to subsequently turn around and deny the more natural reading of the text.\nThis is what I have observed to be the characteristic structure of the Piperian critical argument:\n1.  The Bible states A, which appears to prove B.\n2.  But A does not prove B because A is actually Not A.\n3.  A must be Not A because in a different verse, the Bible states C and C not only takes precedence over A in this particular application, but must be taken as universally applicable.\n4.  Provide an example substituting a for A.\n5.  Conclusion: because a is Not A, A fails to prove B and B is therefore incorrect.\nBeing aware of this fallacious structure, I spotted no less than six errors in Piper’s 1998 article entitled “\nGod Does Not Repent Like a Man”.\nIf one wishes to be truly pedantic, there are seven, but I see no reason that aprevistans need to resort to such dubious measures as would be required to assert the seventh flaw.  These errors are particularly problematic in light of Piper’s claim that Open Theism “dishonors God, distorts Scripture, damages faith, and would, if left unchecked, destroy churches and lives.”  But one must view Piper’s judgment with an extremely skeptical eye, given the way in which his own writings are quite literally error-filled; in the article criticized here he averages nearly an error per paragraph.\n1.  Factual Error.  Piper says it is not true to human experience to say that God would not lament over a state of affairs he himself chose to bring about.  (Or to remove the double negative, it is true to human experience that God would lament over something that He intended to do and successfully did.)  But this not only substitutes the exception for the rule, it is an incorrect summary of the actual aprevistan argument.  God didn’t merely lament making Saul king, He regretted it and then acted to undo His previous act.  But since Piper is appealing to human experience, the observable fact is that most humans do not regret or attempt to undo things that work out exactly as they intended from the start.\n2.  Logical Error.  Piper appeals to nothing more substantial than his own imagination when he claims, “more importantly”, that God “may well be capable of lamenting over something he chose to bring about”.  Or, on the other hand, he may well not be.  Piper would more reasonably have theorized that God may be schizophrenic on the basis of the apparent contradiction between repenting and not repenting, especially since the not-repenting aspect was actually given a different name.  The fact that Piper places more importance on this appeal to his own imagination than his appeal to human experience highlights the inherently insubstantial nature of his argument.\n3.  Logical Error.  Piper provides an inappropriate example in an attempt to assert that God can simultaneously lament and affirm an act as being for the best.  In postulating a spanking of his son that leads to his son running away, Piper says that he “may feel some remorse over the spanking – not in the sense that I disapprove of what I did…. If I had it to do over again, I would still spank him.”  But this example is not relevant to the situation described in Samuel, where God not only laments having made Saul king, but also acts to undo Saul’s kingship.  It is clear that if God had to do it over again, He would not have made Saul king, otherwise He would not be stating His regrets as well as undoing the results of His previous action.  At no point does God affirm His selection of Saul as having been for the best, and His actions, as well as His earlier statements that Israel’s request for a king was evil, indicate that it was not.  Note that Piper concludes the flawed example with a second appeal to his own imagination.\n4a.  If I wished to be stubbornly obtuse in the way some omniderigistes are when presented with a literal text, I would point out that “the Glory of Israel” is not necessarily God.  However, since I prefer to read a text in a straightforward manner without utilizing dogmatic lenses, I accept the assumption that “the Glory of Israel” is a reference to God.  But note that it is still an assumption, even if the assumption is a perfectly reasonable one.\n4b.  Logical Error.  Piper claims that the difference between God’s regret of verses 11 and 34 and the Glory of Israel’s non-repentance in verse 29 “would naturally be that God’s repentance happens in spite of perfect foreknowledge, while most human repentance happens because we lack foreknowledge”.  This is complete nonsense.  It would most naturally be nothing of the kind.  Piper is making the customary Calvinist mistake of taking a singular action and transforming it into a general principle on the basis of nothing, and doing so in contradiction to other singular actions.\nPiper has ignored that Samuel’s statement about God is made in the context of Samuel’s angry attempt to get the Lord to change His mind about taking Saul’s kingship away.\n“Samuel was angry, and he cried out to the LORD all that night.”\nPiper has also ignored that Samuel’s statement is in direct response to Saul’s plea for forgiveness and the removal of the punishment.  The natural explanation between two repents and one not-repent is not a bizarre change of subject to divine versus human foreknowledge, but the fact that God does not repent of His decision to take the kingdom away from Saul and is not lying when He says that He has already taken it away and given it to another when neither Saul nor Samuel nor anyone else can possibly see any sign of that having happened yet.\nPiper would no doubt be confused should he read an Agatha Christie novel.  After all, since Poirot repeatedly says that he “knows everything” when confronting a culprit at the climax of the book, why would he have any need to gather clues and talk to people on his next case?  Since he knows everything, obviously he must know who all subsequent murderers are, correct?  This resort to a universal interpretation is no less absurd in the Biblical context than in the Christie novels.\nThe same contextual point holds true for the reference to Numbers 23:19.  Balaam is referring to God’s specific command to bless Israel instead of cursing it, the statement is no more intended to be universally applicable than the immediately subsequent statement that no misery is observed in Israel.  That Piper’s universal interpretation is incorrect should be obvious, given the subsequent curses God later metes out to Israel.\n5.  Factual Error.  Piper substitutes “feel sorrow” for “regret”.  This substitution is not valid because it is not sufficient and Piper himself notes that “regret [= repent]”.  When Jesus Christ calls us to repent, he is not merely expecting us to feel sorry, but to take action as well.  Piper writes: “For God to say, ‘I feel sorrow that I made Saul king,’ is not the same as saying, ‘I would not make him king if I had it to do over.’  That is perfectly true, but it also doesn’t suffice to correctly describe the situation.  For God to say “I regret that I made Saul king”\nand then to remove the kingship from him\nmost certainly amounts to saying “I would not make him king if I had it to do over.”  Piper focuses on the emotion and completely ignores the action: the fact that God undid His previous action at what appears to have been the second opportunity.\n6.  Logical Error.  Piper asserts that “God’s commitment to his promises hangs on his not repenting like a man”.  But this, too, is an entirely spurious statement.  It is an observable fact that mere men can, and do, keep their commitments to their promises.  Therefore, God’s ability to do the same clearly cannot depend upon a total incapacity for changing His mind or regretting a past action.\nBased on what I’ve seen thus far, Piper’s omniderigent theology rests upon a combination of willful obtuseness, a determined lack of reading comprehension, emotional appeals, and invalid logic.  It is primarily the result of confusing capability for action and mistaking singular statements for universally applicable ones.  In any event, I have pointed out six specific errors committed by Piper, four logical and two factual.  I shall be interested to know exactly how many of those six errors his fellow omniderigents and/or Calvinists are willing to assert are not, in fact, errors.",
  "tags": [
    "Christianity"
  ],
  "categories": [],
  "sitemap_lastmod": "2011-04-27T09:06:00+00:00"
}