{
  "url": "https://voxday.net/2011/04/06/solipsism-as-national-security/",
  "scraped_at": "2025-12-13T23:07:22.473199",
  "title": "Solipsism as national security",
  "date_display": "April 6, 2011",
  "date_iso": "2011-04-06T13:46:00+00:00",
  "date_from_url": "2011-04-06",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>Kathleen Parker <a href=\"http://www.washingtonpost.com/opinions/women-arent-pet-rocks/2011/04/01/AFTU4wJC_story.html\">offers further evidence</a> in support of the dire need to end women’s suffrage:</p><blockquote><p>Women, and by extension children, suffer what too many have come to accept as “collateral damage” in theaters of war. We hate it, of course, but what can one do? It isn’t in our strategic interest to save the women and children of the world. Or, as an anonymous senior White House official recently told The Post:</p><p>“Gender issues are going to have to take a back seat to other priorities. There’s no way we can be successful if we maintain every special interest and pet project. All those pet rocks in our rucksack were taking us down.”</p><p>Secretary of State Hillary Clinton, no stranger to the importance of advancing women’s rights, promptly repudiated the comment. Even so, the anonymous spokesman’s opinion, though inartfully expressed, is hardly isolated.</p><p>But what if this is a false premise? What if saving women from cultures that treat them as chattel was in our strategic and not just moral interest? What if helping women become equal members of a society was the most reliable route to our own security?</p></blockquote><p>The problem, of course, is that it is not.  Parker might as reasonably have asked what if buying women rainbow-striped unicorns was in our strategic interest or if buying vibrators for Libyan women was the most reliable route to American national security.  I would very much like to know who actually pays this woman for her opinion, as I’m quite confident that one could find a Labrador puppy whose columns would be a) more intelligent, b) more interesting, and c) less expensive than the gynocentric drivel Parker has on offer.</p><p>Granted, every column would concern how it is a vital national interest to feed Labradors more raw meat, or alternatively, how it is a national disgrace that Labradors are only fed 60 percent of the amount of raw meat given to Rottweilers, but how is that substantially different from what most female op/ed writers produce anyhow?</p><p>Does this moronic female seriously wish to argue that women and children suffer more than men do in times of war?  They may suffer more of the collateral damage, but only because the whole purpose of the <i>intentional</i> damage is <i>to kill the enemy men</i>.  How many women and children died at Salamanca or Gettysburg?  The last time I read something this stupidly myopic, it was an old joke about the New York Times: “Asteroid to end all life on Earth, women, blacks to suffer most.”</p><p>But even worse than the total ignorance of military history is the idea that equality, at home or abroad, is in the American national interest.  America has been lethally weakened by the equalitarian dogma; there would be no need for the 30 million immigrants that are presently dismantling the social fabric if 30 million American children murdered by their mothers had lived.  “Saving” women by enforcing Western equalitarian dogma is not only not in our strategic interest, it quite clearly isn’t in our moral interest either.</p><p>Women may not be pet rocks, but Kathleen Parker is clearly less intelligent than a box of them.</p></div>",
  "content_text": "Kathleen Parker\noffers further evidence\nin support of the dire need to end women’s suffrage:\nWomen, and by extension children, suffer what too many have come to accept as “collateral damage” in theaters of war. We hate it, of course, but what can one do? It isn’t in our strategic interest to save the women and children of the world. Or, as an anonymous senior White House official recently told The Post:\n“Gender issues are going to have to take a back seat to other priorities. There’s no way we can be successful if we maintain every special interest and pet project. All those pet rocks in our rucksack were taking us down.”\nSecretary of State Hillary Clinton, no stranger to the importance of advancing women’s rights, promptly repudiated the comment. Even so, the anonymous spokesman’s opinion, though inartfully expressed, is hardly isolated.\nBut what if this is a false premise? What if saving women from cultures that treat them as chattel was in our strategic and not just moral interest? What if helping women become equal members of a society was the most reliable route to our own security?\nThe problem, of course, is that it is not.  Parker might as reasonably have asked what if buying women rainbow-striped unicorns was in our strategic interest or if buying vibrators for Libyan women was the most reliable route to American national security.  I would very much like to know who actually pays this woman for her opinion, as I’m quite confident that one could find a Labrador puppy whose columns would be a) more intelligent, b) more interesting, and c) less expensive than the gynocentric drivel Parker has on offer.\nGranted, every column would concern how it is a vital national interest to feed Labradors more raw meat, or alternatively, how it is a national disgrace that Labradors are only fed 60 percent of the amount of raw meat given to Rottweilers, but how is that substantially different from what most female op/ed writers produce anyhow?\nDoes this moronic female seriously wish to argue that women and children suffer more than men do in times of war?  They may suffer more of the collateral damage, but only because the whole purpose of the\nintentional\ndamage is\nto kill the enemy men\n.  How many women and children died at Salamanca or Gettysburg?  The last time I read something this stupidly myopic, it was an old joke about the New York Times: “Asteroid to end all life on Earth, women, blacks to suffer most.”\nBut even worse than the total ignorance of military history is the idea that equality, at home or abroad, is in the American national interest.  America has been lethally weakened by the equalitarian dogma; there would be no need for the 30 million immigrants that are presently dismantling the social fabric if 30 million American children murdered by their mothers had lived.  “Saving” women by enforcing Western equalitarian dogma is not only not in our strategic interest, it quite clearly isn’t in our moral interest either.\nWomen may not be pet rocks, but Kathleen Parker is clearly less intelligent than a box of them.",
  "tags": [
    "war",
    "women"
  ],
  "categories": [],
  "sitemap_lastmod": "2011-04-06T12:46:00+00:00"
}