{
  "url": "https://voxday.net/2011/04/19/statistical-utility-of-suicide/",
  "scraped_at": "2025-12-13T23:08:41.895068",
  "title": "The statistical utility of suicide",
  "date_display": "April 19, 2011",
  "date_iso": "2011-04-19T14:30:00+00:00",
  "date_from_url": "2011-04-19",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p><a href=\"http://www.bloomberg.com/news/2011-04-14/suicide-rates-rise-in-u-s-as-economy-declines-cdc-study-finds.html\">This report</a> certainly won’t surprise the socionomists:</p><blockquote><p>Suicide rates in the U.S. tend to rise during recessions and fall amid economic booms, according to study from the Centers for Disease Control and Prevention.  Suicides reached a record high of 22 people per 100,000 in 1932 during the Great Depression, CDC officials said in a report published online today in the American Journal of Public Health. That was double the rates seen in 2000, when 10 people per 100,000 took their lives as the economy prospered, the study found.</p></blockquote><p>What I’m wondering is if this might make for an effective check on the, shall we say, heavily <i>massaged</i> government statistics.  If GDP is reportedly up in tandem with the suicide rate, then one would tend to suspect that the economy was not actually growing despite the statistically reported growth.  For example, it is interesting to note that the suicide rate has been on the rise since 2000.</p><p><i>The six-year analysis found that the U.S. suicide rate rose 5 percent, from 10.5 per 100,000 people in 1999 to 11 per 100,000 people in 2005.</i></p><p>This suggests that if the economy is still in a contraction, as I have been insisting, then the suicide rates should still be rising from 2008 through 2011.</p></div>",
  "content_text": "This report\ncertainly won’t surprise the socionomists:\nSuicide rates in the U.S. tend to rise during recessions and fall amid economic booms, according to study from the Centers for Disease Control and Prevention.  Suicides reached a record high of 22 people per 100,000 in 1932 during the Great Depression, CDC officials said in a report published online today in the American Journal of Public Health. That was double the rates seen in 2000, when 10 people per 100,000 took their lives as the economy prospered, the study found.\nWhat I’m wondering is if this might make for an effective check on the, shall we say, heavily\nmassaged\ngovernment statistics.  If GDP is reportedly up in tandem with the suicide rate, then one would tend to suspect that the economy was not actually growing despite the statistically reported growth.  For example, it is interesting to note that the suicide rate has been on the rise since 2000.\nThe six-year analysis found that the U.S. suicide rate rose 5 percent, from 10.5 per 100,000 people in 1999 to 11 per 100,000 people in 2005.\nThis suggests that if the economy is still in a contraction, as I have been insisting, then the suicide rates should still be rising from 2008 through 2011.",
  "tags": [
    "economics"
  ],
  "categories": [],
  "sitemap_lastmod": "2011-04-19T13:30:00+00:00"
}