{
  "url": "https://voxday.net/2011/04/04/two-birds-one-stone/",
  "scraped_at": "2025-12-13T23:07:09.845763",
  "title": "Two birds, one stone",
  "date_display": "April 4, 2011",
  "date_iso": "2011-04-04T13:30:00+00:00",
  "date_from_url": "2011-04-04",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>Frankly, I don’t see much downside to the equation that many in the media are suggesting.  If each religious book burned results in 20 dead United Nations bureaucrats, where exactly is the net loss to American interests?  And I’m not sure which is more amusing, the Democrats who are attempting to claim that it is a totally legal book burning that has a direct causal relationship to lethal Islamic riots a world away while the bombing of a Muslim country cannot possibly be to blame, or the Republicans who are loathe to actually come out directly against a man’s right to burn his own book while trying to make sure that everyone understands they think the book-burning is <a href=\"http://www.nationalreview.com/corner/263760/lindsey-graham-first-amendment-andrew-stuttaford\">“ill-judged” and “unhelpful”</a>.</p><p>Unhelpful to what?  Maintaining a pair of long, expensive, unconstitutional, and strategically stupid military occupations?  Continuing mass migration from third world hellholes?  And as for General Petraeus, his comments make it clear that <a href=\"http://online.wsj.com/article/SB10001424052748703806304576240643831942006.html?mod=WSJ_hp_MIDDLENexttoWhatsNewsSecond\">he is a politically correct coward</a> and a certain war loser.</p><p><i>Following Sunday’s meeting with Gen. Petraeus and the ambassadors, Mr. Karzai requested in a new statement that “the U.S. government, Senate and Congress clearly condemn [Rev. Jones’] dire action and avoid such incidents in the future.” Mr. Karzai issued this demand even though President Barack Obama has already described the Quran burning as “an act of extreme intolerance and bigotry”—adding that “to attack and kill innocent people in response is outrageous, and an affront to human decency and dignity.” </i></p><p>I’d have more confidence in the U.S. military effort if Rev. Jones was leading it.  Any statement that falls short of the following by any American leader is an indication that the speaker is completely unfit for office.</p><p>“Rev. Jones, like any American, is free to dispose of his own property in any manner that happens to please him.  This is not a matter of any concern whatsoever to the United States government.”</p></div>",
  "content_text": "Frankly, I don’t see much downside to the equation that many in the media are suggesting.  If each religious book burned results in 20 dead United Nations bureaucrats, where exactly is the net loss to American interests?  And I’m not sure which is more amusing, the Democrats who are attempting to claim that it is a totally legal book burning that has a direct causal relationship to lethal Islamic riots a world away while the bombing of a Muslim country cannot possibly be to blame, or the Republicans who are loathe to actually come out directly against a man’s right to burn his own book while trying to make sure that everyone understands they think the book-burning is\n“ill-judged” and “unhelpful”\n.\nUnhelpful to what?  Maintaining a pair of long, expensive, unconstitutional, and strategically stupid military occupations?  Continuing mass migration from third world hellholes?  And as for General Petraeus, his comments make it clear that\nhe is a politically correct coward\nand a certain war loser.\nFollowing Sunday’s meeting with Gen. Petraeus and the ambassadors, Mr. Karzai requested in a new statement that “the U.S. government, Senate and Congress clearly condemn [Rev. Jones’] dire action and avoid such incidents in the future.” Mr. Karzai issued this demand even though President Barack Obama has already described the Quran burning as “an act of extreme intolerance and bigotry”—adding that “to attack and kill innocent people in response is outrageous, and an affront to human decency and dignity.”\nI’d have more confidence in the U.S. military effort if Rev. Jones was leading it.  Any statement that falls short of the following by any American leader is an indication that the speaker is completely unfit for office.\n“Rev. Jones, like any American, is free to dispose of his own property in any manner that happens to please him.  This is not a matter of any concern whatsoever to the United States government.”",
  "tags": [
    "politics",
    "war"
  ],
  "categories": [],
  "sitemap_lastmod": "2011-04-04T12:30:00+00:00"
}