{
  "url": "https://voxday.net/2011/04/12/wealthy-are-not-exemp/",
  "scraped_at": "2025-12-13T23:07:59.337581",
  "title": "The wealthy are not exempt",
  "date_display": "April 12, 2011",
  "date_iso": "2011-04-12T16:00:00+00:00",
  "date_from_url": "2011-04-12",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>Overstuffed bank accounts and a broad panoply of investments are of little protection from those who have been screwed over and have nothing left to lose.  The banksters believe they are immune from the Great Depression 2.0 by virtue of their ability to pay off their losses with taxpayer money, but justice has a way of being served <a href=\"http://www.dailymail.co.uk/news/article-1375634/Somerset-shooting-Millionaire-businessman-Ray-Masters-shot-dead-farmhouse-doorstep.html\">one way or another</a>:</p><blockquote><p>A wealthy businessman was shot and killed on the doorstep of his country house by a gunman who was later found dead in a village churchyard.  Ray Masters, 58, bled to death in front of his horrified family after being shot in the chest at point blank range.</p><p>The gunman, Michael Harper – who was last night described as a disgruntled business associate – then fled before turning his weapon on himself. Sources claimed that Mr Harper, 46, had lost his wife and home as a result of a financial dispute with Mr Masters. The private contractor had apparently done work for which he was owed a six-figure sum….</p><p>A builder who claims to have done work for Mr Masters said he is owed close to £100,000 and is taking legal action to recover the debt. He said: ‘There’s a list of people as long as your arm of people who have had dealings with him and come out badly.’  Another man said: ‘I’m not surprised by this. He has conned a lot of people. I went into business with him and he duped me too. And there’s dozens more like me.’</p></blockquote><p>Wealthy individuals and corporations often think they can use the expense of the legal system to rip people off.  However, the reality is that when legal means of recourse are denied, it is assured that at least some of those being screwed over will quite understandably resort to illegal means.  How long will it be before a victim of the student loan scam seeks vengeance against a university president or a former homeowner was foreclosed by a bank that didn’t own the home metes out extra-legal justice to the CEO of a mortgage bank?</p><p>Unless I am wrong and the Federal Reserve can somehow pull an economic rabbit out of its hat, I suspect these sorts of vengeful acts will become alarmingly common in the near future.  This and other <a href=\"http://www.13wmaz.com/news/article/124191/175/Childrens-Lemonade-Stand-Robbed\">unusual criminal actions</a> are socionomic indicators that the so-called recovery is, in fact, nothing more than a statistical illusion.</p></div>",
  "content_text": "Overstuffed bank accounts and a broad panoply of investments are of little protection from those who have been screwed over and have nothing left to lose.  The banksters believe they are immune from the Great Depression 2.0 by virtue of their ability to pay off their losses with taxpayer money, but justice has a way of being served\none way or another\n:\nA wealthy businessman was shot and killed on the doorstep of his country house by a gunman who was later found dead in a village churchyard.  Ray Masters, 58, bled to death in front of his horrified family after being shot in the chest at point blank range.\nThe gunman, Michael Harper – who was last night described as a disgruntled business associate – then fled before turning his weapon on himself. Sources claimed that Mr Harper, 46, had lost his wife and home as a result of a financial dispute with Mr Masters. The private contractor had apparently done work for which he was owed a six-figure sum….\nA builder who claims to have done work for Mr Masters said he is owed close to £100,000 and is taking legal action to recover the debt. He said: ‘There’s a list of people as long as your arm of people who have had dealings with him and come out badly.’  Another man said: ‘I’m not surprised by this. He has conned a lot of people. I went into business with him and he duped me too. And there’s dozens more like me.’\nWealthy individuals and corporations often think they can use the expense of the legal system to rip people off.  However, the reality is that when legal means of recourse are denied, it is assured that at least some of those being screwed over will quite understandably resort to illegal means.  How long will it be before a victim of the student loan scam seeks vengeance against a university president or a former homeowner was foreclosed by a bank that didn’t own the home metes out extra-legal justice to the CEO of a mortgage bank?\nUnless I am wrong and the Federal Reserve can somehow pull an economic rabbit out of its hat, I suspect these sorts of vengeful acts will become alarmingly common in the near future.  This and other\nunusual criminal actions\nare socionomic indicators that the so-called recovery is, in fact, nothing more than a statistical illusion.",
  "tags": [
    "economics"
  ],
  "categories": [],
  "sitemap_lastmod": "2011-04-12T15:00:00+00:00"
}