{
  "url": "https://voxday.net/2011/04/15/why-do-atheists-love-killing-people/",
  "scraped_at": "2025-12-13T23:08:15.954720",
  "title": "Why do atheists love killing people?",
  "date_display": "April 15, 2011",
  "date_iso": "2011-04-15T10:31:00+00:00",
  "date_from_url": "2011-04-15",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>As I pointed out in TIA, it is not difficult to understand why extraordinarily ambitious atheists in positions of great political power show such a strong predilection for mass slaughter.  They are usually obsessed with forcibly modifying society on a large scale and it is impossible to do that without “breaking a few eggs”.  Contra Sam Harris, their bloody acts are perfectly rational; we can and should reject their justifications but we cannot fault their logic.  But how does one explain the likes of largely apolitical atheists like Terry Pratchett, whose early-onset Alzheimer’s has inspired him <a href=\"http://www.telegraph.co.uk/health/healthnews/8451897/Terry-Pratchett-film-to-show-an-assisted-death.html\">to produce a work of murder propaganda</a>?</p><blockquote><p>Viewers of the BBC2 show will see the writer, whose Discworld series of books have sold millions of copies worldwide, at the Dignitas clinic in Switzerland with the 71 year–old motor neurone disease sufferer, named only as Peter.  Sir Terry, who was diagnosed with Alzheimer’s disease in 2008, also reveals that he is “a believer in assisted death”.</p><p>In 2008, a documentary on Sky Television called Right To Die? showed 59–yearold Craig Ewert ending his life. He also suffered from motor neurone disease.  Dr Peter Saunders, director of the charity Care Not Killing, criticised the BBC’s decision to broadcast the programme, saying it was acting “like a cheerleader for legalising assisted suicide”.</p></blockquote><p>Despite the fervent assertions of atheists to the contrary, again and again we see that their political objectives revolve around two things, sex and death.  They can’t even hide behind the defense that “assisted death” is voluntary, because in the Netherlands, at least 20 percent of the legal euthanasia is performed without the patient’s consent.</p><p>1995: <i>The Dutch survey, reviewed in the Journal of Medical Ethics, looked at the figures for 1995 and found that as well as 3,600 authorized cases there were 900 others in which doctors had acted without explicit consent. A follow-up survey found that the main reason for not consulting patients was that they had dementia or were otherwise not competent.</i></p><p>2009: <i>The annual report of the regional commissions that oversee the Netherlands’ euthanasia law said there were 2,636 cases in 2009, the vast majority of them euthanasia, or “mercy killing“, as opposed to assisted suicide, or helping someone to die.  That represented about 2 per cent of all Dutch deaths last year, based on figures from Statistics Netherlands. Of the cases, slightly over 80 percent were cancer patients and more than 80 per cent of the deaths occurred in the patient’s home. The rise follows a 10.5 per cent rise in 2008….</i></p><p>What I find most reprehensible is that the same atheists who concoct a myriad of imaginary ways in which religious faith could be somehow considered dangerous, even though it hasn’t been for dozens of centuries, habitually feign an inability to imagine how legalizing “assisted death” could possibly go awry.  But what were the Mongols, the Nazis, the Soviets, and the Red Guards doing, if not energetically assisting death?</p><p>If Mr. Pratchett, whose books I quite enjoy, wishes to kill himself, that is between him and God.  But it is deeply immoral for him to seek to absolve himself of the responsibility for his death and place the burden on another individual, and it is horrifically irresponsible for him to lobby for the legalization of what will certainly turn into another form of state-sponsored murder of the innocent, the aged, the helpless, and the unconsenting.</p></div>",
  "content_text": "As I pointed out in TIA, it is not difficult to understand why extraordinarily ambitious atheists in positions of great political power show such a strong predilection for mass slaughter.  They are usually obsessed with forcibly modifying society on a large scale and it is impossible to do that without “breaking a few eggs”.  Contra Sam Harris, their bloody acts are perfectly rational; we can and should reject their justifications but we cannot fault their logic.  But how does one explain the likes of largely apolitical atheists like Terry Pratchett, whose early-onset Alzheimer’s has inspired him\nto produce a work of murder propaganda\n?\nViewers of the BBC2 show will see the writer, whose Discworld series of books have sold millions of copies worldwide, at the Dignitas clinic in Switzerland with the 71 year–old motor neurone disease sufferer, named only as Peter.  Sir Terry, who was diagnosed with Alzheimer’s disease in 2008, also reveals that he is “a believer in assisted death”.\nIn 2008, a documentary on Sky Television called Right To Die? showed 59–yearold Craig Ewert ending his life. He also suffered from motor neurone disease.  Dr Peter Saunders, director of the charity Care Not Killing, criticised the BBC’s decision to broadcast the programme, saying it was acting “like a cheerleader for legalising assisted suicide”.\nDespite the fervent assertions of atheists to the contrary, again and again we see that their political objectives revolve around two things, sex and death.  They can’t even hide behind the defense that “assisted death” is voluntary, because in the Netherlands, at least 20 percent of the legal euthanasia is performed without the patient’s consent.\n1995:\nThe Dutch survey, reviewed in the Journal of Medical Ethics, looked at the figures for 1995 and found that as well as 3,600 authorized cases there were 900 others in which doctors had acted without explicit consent. A follow-up survey found that the main reason for not consulting patients was that they had dementia or were otherwise not competent.\n2009:\nThe annual report of the regional commissions that oversee the Netherlands’ euthanasia law said there were 2,636 cases in 2009, the vast majority of them euthanasia, or “mercy killing“, as opposed to assisted suicide, or helping someone to die.  That represented about 2 per cent of all Dutch deaths last year, based on figures from Statistics Netherlands. Of the cases, slightly over 80 percent were cancer patients and more than 80 per cent of the deaths occurred in the patient’s home. The rise follows a 10.5 per cent rise in 2008….\nWhat I find most reprehensible is that the same atheists who concoct a myriad of imaginary ways in which religious faith could be somehow considered dangerous, even though it hasn’t been for dozens of centuries, habitually feign an inability to imagine how legalizing “assisted death” could possibly go awry.  But what were the Mongols, the Nazis, the Soviets, and the Red Guards doing, if not energetically assisting death?\nIf Mr. Pratchett, whose books I quite enjoy, wishes to kill himself, that is between him and God.  But it is deeply immoral for him to seek to absolve himself of the responsibility for his death and place the burden on another individual, and it is horrifically irresponsible for him to lobby for the legalization of what will certainly turn into another form of state-sponsored murder of the innocent, the aged, the helpless, and the unconsenting.",
  "tags": [
    "atheism"
  ],
  "categories": [],
  "sitemap_lastmod": "2011-04-15T09:31:00+00:00"
}