{
  "url": "https://voxday.net/2011/04/07/why-liberals-are-so-inept-at-debate/",
  "scraped_at": "2025-12-13T23:07:31.776813",
  "title": "Why liberals are so inept at debate",
  "date_display": "April 7, 2011",
  "date_iso": "2011-04-07T13:15:00+00:00",
  "date_from_url": "2011-04-07",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>A woman explains <a href=\"http://www.salon.com/life/feature/2011/04/05/my_best_friend_is_a_republican\">why liberals can’t defend their opinions</a> on Salon:</p><blockquote><p>When you live, say, on a coast or in a very blue state, you grow accustomed to being surrounded by people who believe like you do. You get to thinking that the only people who would dare contradict you are ignoramuses. Meanwhile, I began directing all my anger toward the Republican Party at Janet. On the day that Congress voted to defund Planned Parenthood, I found myself furious at Janet, just Janet, as the face of all that was bad in the world….</p><p>I don’t speak for Janet, but I think there’s something deeper at play. Janet’s willingness to associate with so many liberal friends — though I know she seeks refuge in chat rooms and magazines that share her beliefs — makes her a better and more interesting person. She has her beliefs challenged constantly. She is more well-read and educated in her politics than most of the liberals I know. Too many liberals I know are lazy, they have a belief system that consists of making fun of Glenn Beck and watching “The Daily Show.”</p></blockquote><p>It is a massive disadvantage to have no understanding of the other side’s reasoning – such as it is – or ideology.  Because it is, for the most part, avowedly anti-intellectual, the Left regularly puts itself at a complete disadvantage by refusing to pay attention to anything but its own dogma.  I have seen this again and again in both the journalistic and the academic world, which heavily relies on credentialism rather than knowledge.</p><p>It is not an accident that TIA unmasked the limited range of knowledge possessed by biology and philosophy PhDs and RGD exposed the strict limits of the mainstream economics PhDs.  I have long known that the petty intellectual emperors wear no clothes outside their own little disciplines, as autodidacts, dilettantes, and renaissance men seldom go in for academics these days.  The Dread Ilk will recall how a look at the curriculum for a biology major showed that the graduate would not possess a conventional broad-spectrum liberal arts education, which is why calling an academic on his assertions outside of his area of expertise will reliably expose him as an intellectual bluffer.</p><p>What is true of the liberal credentialentsia is doubly true of your average run of the mill liberal.  Whereas the liberal academic only possesses a narrow range of knowledge, the average liberal possesses virtually none at all.  His education consists of having been told <i>about</i> things, so he thinks in terms of reference points rather than actual facts.  And, because he willfully cringes away from any perspective that might challenge his opinions – or more accurately – expose his ignorance – his intellectual development is halted at the level of an elementary school child parroting back the assertions of his teacher.</p><p>But conservatives should not be too proud.  They are guilty of a similar, albeit lesser sin, as they tend to avoid studying the intellectual roots of their own ideology as well as those of competing ideologies.  One reason I respect conservatives like Jonah Goldberg and Glenn Beck even when I disagree with their advocated policies is that they make a point of encouraging conservatives to read more deeply in the conservative tradition.  When Hayek as at the top of the economic bestseller lists, this is strong testimony concerning the intellectual development among conservatives.  Needless to say, one never sees liberal media figures encouraging liberals to read Dewey, Sanger, or any of the historical progressives whose influence still dominates modern American liberalism.</p></div>",
  "content_text": "A woman explains\nwhy liberals can’t defend their opinions\non Salon:\nWhen you live, say, on a coast or in a very blue state, you grow accustomed to being surrounded by people who believe like you do. You get to thinking that the only people who would dare contradict you are ignoramuses. Meanwhile, I began directing all my anger toward the Republican Party at Janet. On the day that Congress voted to defund Planned Parenthood, I found myself furious at Janet, just Janet, as the face of all that was bad in the world….\nI don’t speak for Janet, but I think there’s something deeper at play. Janet’s willingness to associate with so many liberal friends — though I know she seeks refuge in chat rooms and magazines that share her beliefs — makes her a better and more interesting person. She has her beliefs challenged constantly. She is more well-read and educated in her politics than most of the liberals I know. Too many liberals I know are lazy, they have a belief system that consists of making fun of Glenn Beck and watching “The Daily Show.”\nIt is a massive disadvantage to have no understanding of the other side’s reasoning – such as it is – or ideology.  Because it is, for the most part, avowedly anti-intellectual, the Left regularly puts itself at a complete disadvantage by refusing to pay attention to anything but its own dogma.  I have seen this again and again in both the journalistic and the academic world, which heavily relies on credentialism rather than knowledge.\nIt is not an accident that TIA unmasked the limited range of knowledge possessed by biology and philosophy PhDs and RGD exposed the strict limits of the mainstream economics PhDs.  I have long known that the petty intellectual emperors wear no clothes outside their own little disciplines, as autodidacts, dilettantes, and renaissance men seldom go in for academics these days.  The Dread Ilk will recall how a look at the curriculum for a biology major showed that the graduate would not possess a conventional broad-spectrum liberal arts education, which is why calling an academic on his assertions outside of his area of expertise will reliably expose him as an intellectual bluffer.\nWhat is true of the liberal credentialentsia is doubly true of your average run of the mill liberal.  Whereas the liberal academic only possesses a narrow range of knowledge, the average liberal possesses virtually none at all.  His education consists of having been told\nabout\nthings, so he thinks in terms of reference points rather than actual facts.  And, because he willfully cringes away from any perspective that might challenge his opinions – or more accurately – expose his ignorance – his intellectual development is halted at the level of an elementary school child parroting back the assertions of his teacher.\nBut conservatives should not be too proud.  They are guilty of a similar, albeit lesser sin, as they tend to avoid studying the intellectual roots of their own ideology as well as those of competing ideologies.  One reason I respect conservatives like Jonah Goldberg and Glenn Beck even when I disagree with their advocated policies is that they make a point of encouraging conservatives to read more deeply in the conservative tradition.  When Hayek as at the top of the economic bestseller lists, this is strong testimony concerning the intellectual development among conservatives.  Needless to say, one never sees liberal media figures encouraging liberals to read Dewey, Sanger, or any of the historical progressives whose influence still dominates modern American liberalism.",
  "tags": [
    "politics"
  ],
  "categories": [],
  "sitemap_lastmod": "2011-04-07T12:15:00+00:00"
}