{
  "url": "https://voxday.net/2011/04/08/wl-craig-indulges-in-immorality/",
  "scraped_at": "2025-12-13T23:07:39.091015",
  "title": "WL Craig indulges in immorality",
  "date_display": "April 8, 2011",
  "date_iso": "2011-04-08T13:04:00+00:00",
  "date_from_url": "2011-04-08",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>For did he not purposefully injure Sam Harris’s sense of well-being last night at Notre Dame?  Based on the various summaries I’ve read, William Lane Craig had about as much trouble in his debate with Sam Harris as I thought he would, which is to say none at all. Unfortunately, as is all too often the case with Christian apologists, Craig didn’t go for the kill when Harris gave him the opening.  I think it’s a mistake to refrain from destroying the credibility of the opponent in these circumstances, because whenever the atheist debater is not completely humiliated in an outright and undeniable manner, all of his little fans who are incapable of following the debate will inevitably declare their hero has triumphed.</p><p>But for those who are cognitively capable of following and comprehending the discourse, it was apparent that the outcome of the debate was settled as soon as both men made their initial points.  As I expected on the basis of his most recent book, Harris lost the debate almost as soon as he opened his mouth.</p><p><i>Craig: If God exists, then we have a sound foundation for objective moral values and duties, if God does not exist, then we do not have a sound foundation for objective moral values and duties.</i></p><p>Harris:  Good means maximizing human well-being for the largest number of people.  Religion is not necessary for a “universal” morality.  Religion is a bad foundation for “universal” morality</p><p>As I pointed out <a href=\"http://www.wnd.com/index.php?fa=PAGE.view&amp;pageId=231089\">in my column last November</a> in which I reviewed <i>The Moral Landscape</i>, “Harris simply ignores the way in which his case falls completely apart when it is answered in the negative. No, we cannot simply accept that “moral” can reasonably be considered “well-being” because it is not true to say that which is “of, pertaining to, or concerned with the principles or rules of right conduct or the distinction between right and wrong” is more than remotely synonymous with “that which fosters well-being in one or more human beings.” One might as reasonably substitute “wealth” or “physical attractiveness” for “well-being”.</p><p>Desperate appeals to science won’t suffice to paper over the well-known holes in utilitarian philosophy.  Harris is so eminently predictable that he not only threw away the debate by basing his case upon his illegitimate redefinition of “good”, as expected, but he also twice engaged in his customary complaints about being misunderstood despite being directly quoted.  Possible Worlds took notes and <a href=\"http://randyeverist.blogspot.com/2011/04/review-of-craig-vs-harris-debate.html\">provided a summary of the debate</a>:</p><blockquote><p>Harris’ rebuttal was a strange, 12-minute diatribe where he offered literally zero arguments for his position. I do not mean he offered zero arguments which I found compelling or good. Just zero arguments altogether. He spent the time presenting the problem of evil and criticizing Christian particularism, both of which were irrelevant to the debate. Harris started to look angry during this portion of the debate. He also seemed to have given up the actual debate topic from here on out.</p><p>Craig pointed out that not only were no arguments offered for the naturalistic hypothesis, but that no criticisms of any of his arguments were offered as well! Craig did refer the audience to look into the critiques of Harris through Paul Copan’s book, <i>Is God a Moral Monster?</i>. Craig contended the point of Christianity was not eternal well-being, as Harris alleged earlier. Rather, the point is to worship God on account of who he is! Harris had mentioned in his diatribe that Christians are lunatics, and Craig dismissed this as “stupid and insulting.” I don’t know that I would have said it was “stupid,” but Craig did not come off very mean-spirited (but rather annoyed).</p><p>In Harris’ second rebuttal, he accused Craig of misrepresenting him, but did not offer any explanation. Harris defaulted to claiming that if you grant him certain axioms, then his account of morality is true, in much the same way as logic or math. The problem is that people generally don’t view morality to be transcendently true based on “nothing;” further note what this is asking the audience to do: just take his word for it. Take it on faith. He relies on objective morality’s being true, but then his argument just begs the question!</p></blockquote><p>However, I suspect the most succinct summary was provided by a commenter at <a href=\"http://winteryknight.wordpress.com/2011/04/07/audio-and-summary-of-the-william-lane-craig-vs-sam-harris-debate/\">Wintery Knight’s detailed account of the debate</a>: <i>Sam Harris has spent an hour and a half talking about everything except the topic at hand. I’m not sure I’ve heard such a mix of red herrings and ad hominems before.</i></p></div>",
  "content_text": "For did he not purposefully injure Sam Harris’s sense of well-being last night at Notre Dame?  Based on the various summaries I’ve read, William Lane Craig had about as much trouble in his debate with Sam Harris as I thought he would, which is to say none at all. Unfortunately, as is all too often the case with Christian apologists, Craig didn’t go for the kill when Harris gave him the opening.  I think it’s a mistake to refrain from destroying the credibility of the opponent in these circumstances, because whenever the atheist debater is not completely humiliated in an outright and undeniable manner, all of his little fans who are incapable of following the debate will inevitably declare their hero has triumphed.\nBut for those who are cognitively capable of following and comprehending the discourse, it was apparent that the outcome of the debate was settled as soon as both men made their initial points.  As I expected on the basis of his most recent book, Harris lost the debate almost as soon as he opened his mouth.\nCraig: If God exists, then we have a sound foundation for objective moral values and duties, if God does not exist, then we do not have a sound foundation for objective moral values and duties.\nHarris:  Good means maximizing human well-being for the largest number of people.  Religion is not necessary for a “universal” morality.  Religion is a bad foundation for “universal” morality\nAs I pointed out\nin my column last November\nin which I reviewed\nThe Moral Landscape\n, “Harris simply ignores the way in which his case falls completely apart when it is answered in the negative. No, we cannot simply accept that “moral” can reasonably be considered “well-being” because it is not true to say that which is “of, pertaining to, or concerned with the principles or rules of right conduct or the distinction between right and wrong” is more than remotely synonymous with “that which fosters well-being in one or more human beings.” One might as reasonably substitute “wealth” or “physical attractiveness” for “well-being”.\nDesperate appeals to science won’t suffice to paper over the well-known holes in utilitarian philosophy.  Harris is so eminently predictable that he not only threw away the debate by basing his case upon his illegitimate redefinition of “good”, as expected, but he also twice engaged in his customary complaints about being misunderstood despite being directly quoted.  Possible Worlds took notes and\nprovided a summary of the debate\n:\nHarris’ rebuttal was a strange, 12-minute diatribe where he offered literally zero arguments for his position. I do not mean he offered zero arguments which I found compelling or good. Just zero arguments altogether. He spent the time presenting the problem of evil and criticizing Christian particularism, both of which were irrelevant to the debate. Harris started to look angry during this portion of the debate. He also seemed to have given up the actual debate topic from here on out.\nCraig pointed out that not only were no arguments offered for the naturalistic hypothesis, but that no criticisms of any of his arguments were offered as well! Craig did refer the audience to look into the critiques of Harris through Paul Copan’s book,\nIs God a Moral Monster?\n. Craig contended the point of Christianity was not eternal well-being, as Harris alleged earlier. Rather, the point is to worship God on account of who he is! Harris had mentioned in his diatribe that Christians are lunatics, and Craig dismissed this as “stupid and insulting.” I don’t know that I would have said it was “stupid,” but Craig did not come off very mean-spirited (but rather annoyed).\nIn Harris’ second rebuttal, he accused Craig of misrepresenting him, but did not offer any explanation. Harris defaulted to claiming that if you grant him certain axioms, then his account of morality is true, in much the same way as logic or math. The problem is that people generally don’t view morality to be transcendently true based on “nothing;” further note what this is asking the audience to do: just take his word for it. Take it on faith. He relies on objective morality’s being true, but then his argument just begs the question!\nHowever, I suspect the most succinct summary was provided by a commenter at\nWintery Knight’s detailed account of the debate\n:\nSam Harris has spent an hour and a half talking about everything except the topic at hand. I’m not sure I’ve heard such a mix of red herrings and ad hominems before.",
  "tags": [
    "atheism",
    "religion"
  ],
  "categories": [],
  "sitemap_lastmod": "2011-04-08T12:04:00+00:00"
}