{
  "url": "https://voxday.net/2011/04/21/you-can-count-on-sa/",
  "scraped_at": "2025-12-13T23:08:49.258564",
  "title": "You can count on Sam",
  "date_display": "April 21, 2011",
  "date_iso": "2011-04-21T10:17:00+00:00",
  "date_from_url": "2011-04-21",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>You may recall that I stated in TIA that Sam Harris is intellectually irresponsible, and “fails to do even the most rudimentary research into his chosen subject”.  You can count on him to make fundamental factual and logical blunders that undermine his arguments or at least demonstrate his carelessness; when I read a Harris piece now I don’t even pay attention to his conclusions, I simply look for the incorrect assumption upon which he has based the argument.  I am seldom unable to find it right away.  Lest you think my observations are too harsh, note that is that the quote below was taken today, April 21, 2011, from Sam Harris’s <a href=\"http://www.samharris.org/site/full_text/10-myths-and-10-truths-about-atheism1\">amusingly inept attempt to “deflate the myths” about atheism on his own web site</a>, more than four years after the piece <a href=\"http://articles.latimes.com/2006/dec/24/opinion/op-harris24/2\">appeared in the L.A. Times</a>.  This tends to demonstrate that it is unwise to rely upon a notoriously sloppy historical illiterate to set the record straight.</p><blockquote><p>3) Atheism is dogmatic.</p><p>Jews, Christians and Muslims claim that their scriptures are so prescient of humanity’s needs that they could only have been written under the direction of an omniscient deity. An atheist is simply a person who has considered this claim, read the books and found the claim to be ridiculous. One doesn’t have to take anything on faith, or be otherwise dogmatic, to reject unjustified religious beliefs. As the historian Stephen Henry Roberts (1901-71) once said: “I contend that we are both atheists. I just believe in one fewer god than you do. When you understand why you dismiss all the other possible gods, you will understand why I dismiss yours.”</p></blockquote><p>What I find so tremendously amusing here is the fact that neither Sam Harris nor any of his godless coterie of intellectually challenged fans has realized at any point in the last five years that <a href=\"http://en.wikipedia.org/wiki/Stephen_Henry_Roberts\">Stephen Henry Roberts</a> never said anything of the sort.  In fact, there is no evidence that Stephen Henry Roberts was even an atheist; the only information from his biography concerning his religious faith suggests that he was an Anglican Christian at the time of his marriage.  But had Harris ever so much as scanned TIA, he would have known that the fallacious One Less God was constructed by one <b><a href=\"http://freelink.wildlink.com/quote_history.php\">Stephen F. Roberts</a></b>, not the deceased Australian historian.</p><p>“2) Logical error. In <i>Letter to a Christian Nation</i>, Sam Harris borrows from Stephen F. Roberts in challenging Christians with a variant of the One Less God argument. He informs Christians that they reject Islam in “precisely the way” that Muslims reject Christianity, which is also the same reason he rejects all religions. So, either Harris believes that the Christian God exists and is a powerful spirit of evil or he doesn’t know what is almost literally the first thing about Christian theology”<br> – The Irrational Atheist, p. 117.</br></p><p>Harris actually devotes the first seven pages – nearly 8 percent – of <i>Letter</i> to walking through the hapless One Less God argument without ever a) noticing that it is both logically and factually incorrect, or b) crediting it to its author.  Or even to the individual he incorrectly believes is its author.</p><p>And so we see once more that it doesn’t matter if one is discussing large historical matters or very small ones, it is easy to prove that the leading atheists can very seldom be trusted to have even the most basic facts correct.  In itself, the confusion of one Stephen Roberts with another isn’t a big deal.  But when such a mistake is combined with a large quantity of similarly careless mistakes that repeatedly lead to incorrect conclusions, it amounts to a serious pattern of unreliability that needs to be taken into account when considering the man’s arguments.</p></div>",
  "content_text": "You may recall that I stated in TIA that Sam Harris is intellectually irresponsible, and “fails to do even the most rudimentary research into his chosen subject”.  You can count on him to make fundamental factual and logical blunders that undermine his arguments or at least demonstrate his carelessness; when I read a Harris piece now I don’t even pay attention to his conclusions, I simply look for the incorrect assumption upon which he has based the argument.  I am seldom unable to find it right away.  Lest you think my observations are too harsh, note that is that the quote below was taken today, April 21, 2011, from Sam Harris’s\namusingly inept attempt to “deflate the myths” about atheism on his own web site\n, more than four years after the piece\nappeared in the L.A. Times\n.  This tends to demonstrate that it is unwise to rely upon a notoriously sloppy historical illiterate to set the record straight.\n3) Atheism is dogmatic.\nJews, Christians and Muslims claim that their scriptures are so prescient of humanity’s needs that they could only have been written under the direction of an omniscient deity. An atheist is simply a person who has considered this claim, read the books and found the claim to be ridiculous. One doesn’t have to take anything on faith, or be otherwise dogmatic, to reject unjustified religious beliefs. As the historian Stephen Henry Roberts (1901-71) once said: “I contend that we are both atheists. I just believe in one fewer god than you do. When you understand why you dismiss all the other possible gods, you will understand why I dismiss yours.”\nWhat I find so tremendously amusing here is the fact that neither Sam Harris nor any of his godless coterie of intellectually challenged fans has realized at any point in the last five years that\nStephen Henry Roberts\nnever said anything of the sort.  In fact, there is no evidence that Stephen Henry Roberts was even an atheist; the only information from his biography concerning his religious faith suggests that he was an Anglican Christian at the time of his marriage.  But had Harris ever so much as scanned TIA, he would have known that the fallacious One Less God was constructed by one\nStephen F. Roberts\n, not the deceased Australian historian.\n“2) Logical error. In\nLetter to a Christian Nation\n, Sam Harris borrows from Stephen F. Roberts in challenging Christians with a variant of the One Less God argument. He informs Christians that they reject Islam in “precisely the way” that Muslims reject Christianity, which is also the same reason he rejects all religions. So, either Harris believes that the Christian God exists and is a powerful spirit of evil or he doesn’t know what is almost literally the first thing about Christian theology”\n– The Irrational Atheist, p. 117.\nHarris actually devotes the first seven pages – nearly 8 percent – of\nLetter\nto walking through the hapless One Less God argument without ever a) noticing that it is both logically and factually incorrect, or b) crediting it to its author.  Or even to the individual he incorrectly believes is its author.\nAnd so we see once more that it doesn’t matter if one is discussing large historical matters or very small ones, it is easy to prove that the leading atheists can very seldom be trusted to have even the most basic facts correct.  In itself, the confusion of one Stephen Roberts with another isn’t a big deal.  But when such a mistake is combined with a large quantity of similarly careless mistakes that repeatedly lead to incorrect conclusions, it amounts to a serious pattern of unreliability that needs to be taken into account when considering the man’s arguments.",
  "tags": [
    "atheism",
    "trainwreck"
  ],
  "categories": [],
  "sitemap_lastmod": "2011-04-21T09:17:00+00:00"
}