{
  "url": "https://voxday.net/2012/03/12/50062/",
  "scraped_at": "2025-12-14T04:49:36.365392",
  "title": "50,062",
  "date_display": "March 12, 2012",
  "date_iso": "2012-03-12T17:00:00+00:00",
  "date_from_url": "2012-03-12",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>That’s how many words Word Dynamo <a href=\"http://dynamo.dictionary.com/placement/level\">estimates me to know</a>.  Now, I would argue that it’s an artificially low estimate, since it doesn’t include any Italian, German, French, or Japanese words.  But despite its limited word list, the test is rather well-designed, as it keeps getting harder as you progress up the difficulty ramp.</p><p>Check it out and see how you do.  And here is another benefit of homeschool.  One of our elementary school age kids took the test and scored 20,090.  Ender scored 43,814.</p><p>But speaking of homseschooled accomplishment, I would be badly remiss in failing to offer <a href=\"http://www.twincities.com/ci_20152882/home-schooled-girl-from-greenfield-wins-metro-spelling\">congratulations to the daughter of one of the original Ilk</a>:</p><blockquote><p>After correctly spelling “pickelhaube,” “idiopathic” and “pharmacology,” Elise Stahl of Greenfield won the seven-county metro-area regional spelling bee Saturday on the word “remand.”  In the 16th round, Elise, 12, outlasted Eva Beeman Trelstad, 10, of St. Paul and Benjamin Pults, 13, of Maplewood to represent Minnesota at the Scripps National Spelling Bee in Washington, D.C., in May.</p></blockquote><p>Chalk one up for the Grizzlies!  League sources were heard to say that Greenfield would be wise to consider turning the team’s drafting responsibilities over to the young Miss Stahl.</p></div>",
  "content_text": "That’s how many words Word Dynamo\nestimates me to know\n.  Now, I would argue that it’s an artificially low estimate, since it doesn’t include any Italian, German, French, or Japanese words.  But despite its limited word list, the test is rather well-designed, as it keeps getting harder as you progress up the difficulty ramp.\nCheck it out and see how you do.  And here is another benefit of homeschool.  One of our elementary school age kids took the test and scored 20,090.  Ender scored 43,814.\nBut speaking of homseschooled accomplishment, I would be badly remiss in failing to offer\ncongratulations to the daughter of one of the original Ilk\n:\nAfter correctly spelling “pickelhaube,” “idiopathic” and “pharmacology,” Elise Stahl of Greenfield won the seven-county metro-area regional spelling bee Saturday on the word “remand.”  In the 16th round, Elise, 12, outlasted Eva Beeman Trelstad, 10, of St. Paul and Benjamin Pults, 13, of Maplewood to represent Minnesota at the Scripps National Spelling Bee in Washington, D.C., in May.\nChalk one up for the Grizzlies!  League sources were heard to say that Greenfield would be wise to consider turning the team’s drafting responsibilities over to the young Miss Stahl.",
  "tags": [
    "education"
  ],
  "categories": [],
  "sitemap_lastmod": "2012-03-12T17:00:00+00:00"
}