{
  "url": "https://voxday.net/2012/03/08/alaric-inside-walls/",
  "scraped_at": "2025-12-14T04:49:14.227558",
  "title": "Alaric inside the walls",
  "date_display": "March 8, 2012",
  "date_iso": "2012-03-08T08:40:00+00:00",
  "date_from_url": "2012-03-08",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>The UK <a href=\"http://www.dailymail.co.uk/femail/article-2111729/Caught-gang-war-school-run.html\">anticipates the USA’s descent</a> into barbarism and the dawn of aristocracy:</p><blockquote><p>Walking home from school, my two eldest sons, then aged four and five, were chomping their way through Rice Krispie cakes bought at a school sale, while I pushed their baby brother in a pram beside them.  Typically for 3.30pm in the part of North-West London where we live, the pavements were awash with children and pushchairs. This area, with its wide tree-lined avenues, smart family homes and good schools, is hugely popular with young families….</p><p>We’d just left our local newsagent’s, magazine firmly in my little son’s hand, when we suddenly found ourselves in the middle of a 12-strong gang of hooded youths who were chasing a girl who looked no older than 14. One grabbed her and started battering her with an umbrella, but she managed to get away. Then the youths gave chase, throwing bottles and shouting obscenities. It looked as though they meant to kill her….</p><p>Grabbing my sons and frantically pushing the pram with one hand, I rushed to get them home as quickly as possible. Then to my horror, Zach broke free of my grip and blindly ran back into what was now a full-on turf war.  He’d dropped his magazine, which had been trampled underfoot, its pages scattered across the pavement. Oblivious to the mayhem, he attempted to gather it up as tears rolled down his cheeks. Terrified for him, I pulled the pram and my five-year-old back towards where Zach now stood rooted to the spot as more gang members came tearing up a side street.</p><p>I heard myself scream as a bottle skimmed Zach’s head, missing him by millimetres, glass smashing around his feet — later I found shards in his shoes. Then I did something I never thought I’d do: I ran, clutching my terrified children. In my panic, I lost control of the pram which swerved precariously and almost overturned twice.</p><p>Our cakes spilled out over the pavement. It was the wrong thing to do, of course. I’d drawn attention to my fleeing family, and a splinter group gave chase after us, calling out ‘get the whities’.  Seeing this terrifying drama unfold before them, passers-by and locals sped up steps, pounded on front doors or sought protection in porches.</p><p>We reached our home and I released my screaming baby from his pram, which I left abandoned with our bags outside, and practically threw my boys inside the front door, locking it behind us — my legs had turned to jelly and breathlessness and searing chest pain convinced me I was having a heart attack.</p></blockquote><p>Whether they like it or not, the white European people of the West are facing two ugly choices.  Either start deportating the barbarians now or fight a brutal war later.  Africans cannot be blamed for acting like Africans, Mexicans cannot be blamed for acting like Mexicans, and Arabs cannot be blamed for acting like Arabs.  One simply shouldn’t be surprised when people who are not white Europeans do not act like white Europeans tamed by more than one thousand years of Western civilization.  Why would they, and more importantly, <i>why should they?</i></p><p>For little more than the fear of being called racist and in a futile attempt assuage the guilt for past centuries of colonialism, the people of the West have permitted their countries to be invaded by barbarians.  Instead of civilizing the immigrants, as it was foolishly imagined, the immigrants have increasingly barbarized the nations they have invaded en masse.  This should not have been a surprise, as the attempts to civilize them in their native lands had failed for hundreds of years.</p><p>The problem isn’t that Africans or Central Americans cannot ever be civilized or that there is a civilization gene, the problem is that like domesticating an animal species, civilizing an entire culture is a process that takes hundreds of years.  Consider, for example, how long it took the barbarians of Britain and Germany to go from the naked pagan barbarism described by Julius Caesar to the heights of Christian civilization that produced Mozart and the chamber orchestras.  The nations of the West doesn’t have that much time, especially when they can no longer serve as a strong and stable models, having invited the enervating peoples into their civilizations.  Moreover, in addition to attempting to civilize the barbarians inside their borders rather than outside them, they are trying to do so without the benefit of Christianity, which historically played a powerful role in the civilization of the white European barbarians.</p><p>The woman in the article moved with her family out to the countryside to escape the hooded black barbarians of London.  But the retreat of civilization cannot continue forever, as history shows the barbarians will simply expand their dysfunctional and parasitical cultures until they are forcibly stopped and turned back.  Every civilization needs its Marius, its Qin Shi Huang, its Charles Martel, or will be overrun and die.</p><p>Feudalism and the age of aristocracy grew out of a need for protection.  It is now becoming increasingly clear why the age of democracy is over and how the coming aristocracy is going to take shape and come to power.</p></div>",
  "content_text": "The UK\nanticipates the USA’s descent\ninto barbarism and the dawn of aristocracy:\nWalking home from school, my two eldest sons, then aged four and five, were chomping their way through Rice Krispie cakes bought at a school sale, while I pushed their baby brother in a pram beside them.  Typically for 3.30pm in the part of North-West London where we live, the pavements were awash with children and pushchairs. This area, with its wide tree-lined avenues, smart family homes and good schools, is hugely popular with young families….\nWe’d just left our local newsagent’s, magazine firmly in my little son’s hand, when we suddenly found ourselves in the middle of a 12-strong gang of hooded youths who were chasing a girl who looked no older than 14. One grabbed her and started battering her with an umbrella, but she managed to get away. Then the youths gave chase, throwing bottles and shouting obscenities. It looked as though they meant to kill her….\nGrabbing my sons and frantically pushing the pram with one hand, I rushed to get them home as quickly as possible. Then to my horror, Zach broke free of my grip and blindly ran back into what was now a full-on turf war.  He’d dropped his magazine, which had been trampled underfoot, its pages scattered across the pavement. Oblivious to the mayhem, he attempted to gather it up as tears rolled down his cheeks. Terrified for him, I pulled the pram and my five-year-old back towards where Zach now stood rooted to the spot as more gang members came tearing up a side street.\nI heard myself scream as a bottle skimmed Zach’s head, missing him by millimetres, glass smashing around his feet — later I found shards in his shoes. Then I did something I never thought I’d do: I ran, clutching my terrified children. In my panic, I lost control of the pram which swerved precariously and almost overturned twice.\nOur cakes spilled out over the pavement. It was the wrong thing to do, of course. I’d drawn attention to my fleeing family, and a splinter group gave chase after us, calling out ‘get the whities’.  Seeing this terrifying drama unfold before them, passers-by and locals sped up steps, pounded on front doors or sought protection in porches.\nWe reached our home and I released my screaming baby from his pram, which I left abandoned with our bags outside, and practically threw my boys inside the front door, locking it behind us — my legs had turned to jelly and breathlessness and searing chest pain convinced me I was having a heart attack.\nWhether they like it or not, the white European people of the West are facing two ugly choices.  Either start deportating the barbarians now or fight a brutal war later.  Africans cannot be blamed for acting like Africans, Mexicans cannot be blamed for acting like Mexicans, and Arabs cannot be blamed for acting like Arabs.  One simply shouldn’t be surprised when people who are not white Europeans do not act like white Europeans tamed by more than one thousand years of Western civilization.  Why would they, and more importantly,\nwhy should they?\nFor little more than the fear of being called racist and in a futile attempt assuage the guilt for past centuries of colonialism, the people of the West have permitted their countries to be invaded by barbarians.  Instead of civilizing the immigrants, as it was foolishly imagined, the immigrants have increasingly barbarized the nations they have invaded en masse.  This should not have been a surprise, as the attempts to civilize them in their native lands had failed for hundreds of years.\nThe problem isn’t that Africans or Central Americans cannot ever be civilized or that there is a civilization gene, the problem is that like domesticating an animal species, civilizing an entire culture is a process that takes hundreds of years.  Consider, for example, how long it took the barbarians of Britain and Germany to go from the naked pagan barbarism described by Julius Caesar to the heights of Christian civilization that produced Mozart and the chamber orchestras.  The nations of the West doesn’t have that much time, especially when they can no longer serve as a strong and stable models, having invited the enervating peoples into their civilizations.  Moreover, in addition to attempting to civilize the barbarians inside their borders rather than outside them, they are trying to do so without the benefit of Christianity, which historically played a powerful role in the civilization of the white European barbarians.\nThe woman in the article moved with her family out to the countryside to escape the hooded black barbarians of London.  But the retreat of civilization cannot continue forever, as history shows the barbarians will simply expand their dysfunctional and parasitical cultures until they are forcibly stopped and turned back.  Every civilization needs its Marius, its Qin Shi Huang, its Charles Martel, or will be overrun and die.\nFeudalism and the age of aristocracy grew out of a need for protection.  It is now becoming increasingly clear why the age of democracy is over and how the coming aristocracy is going to take shape and come to power.",
  "tags": [
    "Vibrancy is our strength"
  ],
  "categories": [],
  "sitemap_lastmod": "2012-03-08T08:40:00+00:00"
}