{
  "url": "https://voxday.net/2012/03/21/ben-bernanke-evades-poin/",
  "scraped_at": "2025-12-14T04:50:20.134281",
  "title": "Ben Bernanke evades the point",
  "date_display": "March 21, 2012",
  "date_iso": "2012-03-21T07:01:00+00:00",
  "date_from_url": "2012-03-21",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>It’s not that <a href=\"http://www.reuters.com/article/2012/03/20/us-usa-fed-gold-idUSBRE82J17A20120320\">a gold standard</a> won’t help governments <i>address</i> problems, it’s that it won’t permit them <i>to create</i> a lot of them:</p><blockquote><p>Federal Reserve Chairman Ben Bernanke on Tuesday took aim at proponents of the gold standard, saying that such a system handicaps the government’s ability to address economic conditions.</p><p>Bernanke spoke in the first of a series of four public lectures at George Washington University that is the central bank’s latest effort to counter a raft of negative public sentiment that has arisen from its handling of the financial crisis. The former Princeton economics professor delivers a second lecture on Thursday and two more next week.</p><p>“Since the gold standard determines the money supply, there is not much scope for the central bank to use monetary policy to stabilize the economy,” Bernanke said. “Under a gold standard, typically the money supply goes up and interest rates go down in a period of strong economic activity – so that’s the reverse of what a central bank would normally do today.”</p></blockquote><p>It is the reverse of what central banks do today… and given the negative consequences of what the central banks have done, one would think that was a good thing.  The fact that Bernanke even feels the need to <s>create</s>address the subject is a strong indication that the solution of central bank-created money is failing.  Again.</p></div>",
  "content_text": "It’s not that\na gold standard\nwon’t help governments\naddress\nproblems, it’s that it won’t permit them\nto create\na lot of them:\nFederal Reserve Chairman Ben Bernanke on Tuesday took aim at proponents of the gold standard, saying that such a system handicaps the government’s ability to address economic conditions.\nBernanke spoke in the first of a series of four public lectures at George Washington University that is the central bank’s latest effort to counter a raft of negative public sentiment that has arisen from its handling of the financial crisis. The former Princeton economics professor delivers a second lecture on Thursday and two more next week.\n“Since the gold standard determines the money supply, there is not much scope for the central bank to use monetary policy to stabilize the economy,” Bernanke said. “Under a gold standard, typically the money supply goes up and interest rates go down in a period of strong economic activity – so that’s the reverse of what a central bank would normally do today.”\nIt is the reverse of what central banks do today… and given the negative consequences of what the central banks have done, one would think that was a good thing.  The fact that Bernanke even feels the need to\ncreate\naddress the subject is a strong indication that the solution of central bank-created money is failing.  Again.",
  "tags": [
    "economics"
  ],
  "categories": [],
  "sitemap_lastmod": "2012-03-21T07:01:00+00:00"
}