{
  "url": "https://voxday.net/2012/03/27/chains-of-stars-and-science/",
  "scraped_at": "2025-12-14T04:50:43.958607",
  "title": "Chains of stars and science",
  "date_display": "March 27, 2012",
  "date_iso": "2012-03-27T09:42:00+00:00",
  "date_from_url": "2012-03-27",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>Most humanists completely fail to understand that the current scientific hypotheses that free will does not exist are not a conceptual step forward, but rather a giant leap backward to the fifth century AD.  This can be seen in David Boorstin’s explanation of the importance of the Christian concept of free will in <i>The Discoverers</i>:</p><blockquote><p>The popular claims of pagan astrologers disturbed the early prophets of Christianity. Church Fathers who declared their own power to forecast everyman’s fate in the next world begrudged the powers of prophecy to those who pretended to know any man’s destiny on earth. If the astrologers’ horoscopes meant what they said, where was the room for free will, for freedom to choose good over evil, to forsake Mammon or Caesar for Jesus Christ?</p><p>The very struggle to become a Christian—to abandon pagan superstition for Christian free will—seemed to be a struggle against astrology. Saint Augustine (354–430) recalls in his Confessions: “Those impostors then, whom they style Mathematicians, I consulted without scruple; because they seemed to use no sacrifice, nor to pray to any spirit for their divinations. ‘ And he was tempted by the astrologers’ counsel: “The cause of thy sin is inevitably determined in heaven; this did Venus, or Saturn, or Mars: That man, forsooth, flesh and blood, and proud corruption, might be blameless; while the Creator and Ordainer of heaven and the stars is to bear the blame.”</p><p>Astrology remained the bête noire of the Christian Church Fathers. Faith in a star-written destiny had dissuaded Romans, such as Emperor Tiberius, from paying homage even to their pagan gods. Tertullian (c. 160–c. 230) warned against astrology because “men, presuming that we are disposed of by the immutable arbitrament of the stars, think on that account that God is not to be sought after.”<br> – <i>The Discoverers</i>, Chapter 3, “God and the Astrologers”</br></p></blockquote><p>Here we see the link between a variety of belief systems that are united in one object, in their opposition to free will.  Astrology, secular humanism, rational materialism, Islam, and even Calvinism are all opposed to what is ultimately the core basis of Christianity, which is the free and voluntary decision to submit to the lordship of Jesus Christ.</p><p>I find it both ironic and telling that Calvinists and a collection of cutting-edge atheist scientists are united in claiming that Man has no ability to choose to worship God.  For is it not the Adversary who claims that Man is a helpless prisoner of fate and Jesus Christ who declares that he came to set Man free?</p><p>The astrologers blamed the Creator instead of the individual.  The scientists blame – well, their theories aren’t formulated yet and are still self-contradictory and incoherent – a variety of things.  The Calvinists follow, to varying degrees depending upon the Calvinist, the astrological lead in assigning blame to the Ordainer of heaven and the stars rather than the individual.  It isn’t necessary to resort to the fallacy of guilt by association to question the way in which so much Calvinistic thinking tends to harmonize so comfortably with that of atheists and pagan astrologers.</p><p>I readily grant that St. Augustine is usually cited on the Calvinist side of the debate and that John Calvin derived many of his doctrinal positions from Augustine.  It is worth remembering, then, that Augustine had previously found the astrological arguments to be persuasive.</p></div>",
  "content_text": "Most humanists completely fail to understand that the current scientific hypotheses that free will does not exist are not a conceptual step forward, but rather a giant leap backward to the fifth century AD.  This can be seen in David Boorstin’s explanation of the importance of the Christian concept of free will in\nThe Discoverers\n:\nThe popular claims of pagan astrologers disturbed the early prophets of Christianity. Church Fathers who declared their own power to forecast everyman’s fate in the next world begrudged the powers of prophecy to those who pretended to know any man’s destiny on earth. If the astrologers’ horoscopes meant what they said, where was the room for free will, for freedom to choose good over evil, to forsake Mammon or Caesar for Jesus Christ?\nThe very struggle to become a Christian—to abandon pagan superstition for Christian free will—seemed to be a struggle against astrology. Saint Augustine (354–430) recalls in his Confessions: “Those impostors then, whom they style Mathematicians, I consulted without scruple; because they seemed to use no sacrifice, nor to pray to any spirit for their divinations. ‘ And he was tempted by the astrologers’ counsel: “The cause of thy sin is inevitably determined in heaven; this did Venus, or Saturn, or Mars: That man, forsooth, flesh and blood, and proud corruption, might be blameless; while the Creator and Ordainer of heaven and the stars is to bear the blame.”\nAstrology remained the bête noire of the Christian Church Fathers. Faith in a star-written destiny had dissuaded Romans, such as Emperor Tiberius, from paying homage even to their pagan gods. Tertullian (c. 160–c. 230) warned against astrology because “men, presuming that we are disposed of by the immutable arbitrament of the stars, think on that account that God is not to be sought after.”\n–\nThe Discoverers\n, Chapter 3, “God and the Astrologers”\nHere we see the link between a variety of belief systems that are united in one object, in their opposition to free will.  Astrology, secular humanism, rational materialism, Islam, and even Calvinism are all opposed to what is ultimately the core basis of Christianity, which is the free and voluntary decision to submit to the lordship of Jesus Christ.\nI find it both ironic and telling that Calvinists and a collection of cutting-edge atheist scientists are united in claiming that Man has no ability to choose to worship God.  For is it not the Adversary who claims that Man is a helpless prisoner of fate and Jesus Christ who declares that he came to set Man free?\nThe astrologers blamed the Creator instead of the individual.  The scientists blame – well, their theories aren’t formulated yet and are still self-contradictory and incoherent – a variety of things.  The Calvinists follow, to varying degrees depending upon the Calvinist, the astrological lead in assigning blame to the Ordainer of heaven and the stars rather than the individual.  It isn’t necessary to resort to the fallacy of guilt by association to question the way in which so much Calvinistic thinking tends to harmonize so comfortably with that of atheists and pagan astrologers.\nI readily grant that St. Augustine is usually cited on the Calvinist side of the debate and that John Calvin derived many of his doctrinal positions from Augustine.  It is worth remembering, then, that Augustine had previously found the astrological arguments to be persuasive.",
  "tags": [
    "Christianity"
  ],
  "categories": [],
  "sitemap_lastmod": "2012-03-27T08:42:00+00:00"
}