{
  "url": "https://voxday.net/2012/03/25/chess-mastery/",
  "scraped_at": "2025-12-14T04:50:34.788644",
  "title": "Chess mastery",
  "date_display": "March 25, 2012",
  "date_iso": "2012-03-25T14:00:00+00:00",
  "date_from_url": "2012-03-25",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>I’ve never been much of a chess player, which may seem strange considering that I’m a reasonably formidable ASL player.  I suspect it has to do with the spatial relations aspect of the game; the ability to quickly adapt and improvise is less important than the ability to accurately foresee the chain of consequences from each move.</p><p>Anyhow, Ender has a new Star Wars chess set that doubles as toy X-wing and TIE fighter squadrons and we’ve been playing a game every night.  He’s improving fast; last night he managed to take the offensive twice and stretched the game out twice as long as they’d previously been taking.  My guess is that within a month, he’ll be beating me on occasion and within a year, he’ll be expecting to win.  I taught him how to play several years ago, but he didn’t express any real interest in playing it until last week.</p><p>Anyhow, I’m curious to know if there is anyone here who plays in tournaments and has a legitimate Elo rating.  I’d be interested in determining what level I’m at for comparative purposes.  I tried <a href=\"http://www.chessmaniac.com/ELORating/ELO_Chess_Rating.shtml\">one of the online calculators</a>, but I’m extremely skeptical of the estimates produced.  I scored a 1380 when I put in my moves, but putting in complete nonsense moves produced an 1120.  If it’s correct, however, I expect to soon find myself outmatched, as Ender scored 1645, which considerably exceeds the 1,000 that Wikipedia claims is the level of a bright beginner.</p><p>Anyhow, for those who aren’t chess masters, it might be interesting to know how you scored on the ten-move online test.  And for anyone who is a master, I’d be interested in playing a game of chess by email in order to experience the difference between a proper chess player and a neophyte.</p></div>",
  "content_text": "I’ve never been much of a chess player, which may seem strange considering that I’m a reasonably formidable ASL player.  I suspect it has to do with the spatial relations aspect of the game; the ability to quickly adapt and improvise is less important than the ability to accurately foresee the chain of consequences from each move.\nAnyhow, Ender has a new Star Wars chess set that doubles as toy X-wing and TIE fighter squadrons and we’ve been playing a game every night.  He’s improving fast; last night he managed to take the offensive twice and stretched the game out twice as long as they’d previously been taking.  My guess is that within a month, he’ll be beating me on occasion and within a year, he’ll be expecting to win.  I taught him how to play several years ago, but he didn’t express any real interest in playing it until last week.\nAnyhow, I’m curious to know if there is anyone here who plays in tournaments and has a legitimate Elo rating.  I’d be interested in determining what level I’m at for comparative purposes.  I tried\none of the online calculators\n, but I’m extremely skeptical of the estimates produced.  I scored a 1380 when I put in my moves, but putting in complete nonsense moves produced an 1120.  If it’s correct, however, I expect to soon find myself outmatched, as Ender scored 1645, which considerably exceeds the 1,000 that Wikipedia claims is the level of a bright beginner.\nAnyhow, for those who aren’t chess masters, it might be interesting to know how you scored on the ten-move online test.  And for anyone who is a master, I’d be interested in playing a game of chess by email in order to experience the difference between a proper chess player and a neophyte.",
  "tags": [
    "games"
  ],
  "categories": [],
  "sitemap_lastmod": "2012-03-25T13:00:00+00:00"
}