{
  "url": "https://voxday.net/2012/03/03/dutch-einsatzgruppen/",
  "scraped_at": "2025-12-14T04:48:48.962430",
  "title": "DutchEinsatzgruppen",
  "date_display": "March 3, 2012",
  "date_iso": "2012-03-03T11:54:00+00:00",
  "date_from_url": "2012-03-03",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>Humanity <a href=\"http://www.guardian.co.uk/world/2012/mar/01/dutch-mobile-euthanasia-units\">continues to progress</a> towards Seculatopia:</p><blockquote><p>A controversial system of mobile euthanasia units that will travel around the country to respond to the wishes of sick people who wish to end their lives has been launched in the Netherlands.  The scheme, which started on Thursday , will send teams of specially trained doctors and nurses to the homes of people whose own doctors have refused to carry out patients’ requests to end their lives.  The launch of the so-called Levenseinde, or “Life End”, house-call units – whose services are being offered to Dutch citizens free of charge – coincides with the opening of a clinic of the same name in The Hague, which will take patients with incurable illnesses as well as others who do not want to die at home.”</p></blockquote><p><i>“In 30 years Holland has moved from assisted suicide to euthanasia, from euthanasia of people who are terminally ill to euthanasia of those who are chronically ill, from euthanasia for physical illness to euthanasia for mental illness, from euthanasia for mental illness to euthanasia for psychological distress or mental suffering, and from voluntary euthanasia to involuntary euthanasia or as the Dutch prefer to call it “termination of the patient without explicit request”.”</i></p><p>In related news, German officials recently announced that they are considering the establishment of a federal <i>Bundeslebensende</i> which would provide involuntary euthanasia services to individuals of Jewish descent regardless of age.  The amusing thing is that the Dutch actually profess to be upset by the fact that Rick Santorum is <a href=\"http://www.ibtimes.com/articles/301702/20120220/rick-santorum-euthanasia-netherlands-dutch-backlash.htm\">drawing American attention to their murderous practices</a>.  Santorum appears to have exaggerated, but is otherwise correct; the figures I have read show that involuntary euthanasia accounts does not account for one-half of all euthanasia cases, but only one-quarter.</p></div>",
  "content_text": "Humanity\ncontinues to progress\ntowards Seculatopia:\nA controversial system of mobile euthanasia units that will travel around the country to respond to the wishes of sick people who wish to end their lives has been launched in the Netherlands.  The scheme, which started on Thursday , will send teams of specially trained doctors and nurses to the homes of people whose own doctors have refused to carry out patients’ requests to end their lives.  The launch of the so-called Levenseinde, or “Life End”, house-call units – whose services are being offered to Dutch citizens free of charge – coincides with the opening of a clinic of the same name in The Hague, which will take patients with incurable illnesses as well as others who do not want to die at home.”\n“In 30 years Holland has moved from assisted suicide to euthanasia, from euthanasia of people who are terminally ill to euthanasia of those who are chronically ill, from euthanasia for physical illness to euthanasia for mental illness, from euthanasia for mental illness to euthanasia for psychological distress or mental suffering, and from voluntary euthanasia to involuntary euthanasia or as the Dutch prefer to call it “termination of the patient without explicit request”.”\nIn related news, German officials recently announced that they are considering the establishment of a federal\nBundeslebensende\nwhich would provide involuntary euthanasia services to individuals of Jewish descent regardless of age.  The amusing thing is that the Dutch actually profess to be upset by the fact that Rick Santorum is\ndrawing American attention to their murderous practices\n.  Santorum appears to have exaggerated, but is otherwise correct; the figures I have read show that involuntary euthanasia accounts does not account for one-half of all euthanasia cases, but only one-quarter.",
  "tags": [
    "decline and fall"
  ],
  "categories": [],
  "sitemap_lastmod": "2012-03-03T11:54:00+00:00"
}