{
  "url": "https://voxday.net/2012/03/16/mailvox-autoneurotic-atheis/",
  "scraped_at": "2025-12-14T04:49:58.376479",
  "title": "Mailvox: the autoneurotic atheist",
  "date_display": "March 16, 2012",
  "date_iso": "2012-03-16T09:19:00+00:00",
  "date_from_url": "2012-03-16",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>EC wonders who is reading whom:</p><blockquote><p>I love the blog and your book TIA; TIA is actually the best polemic I’ve ever read. Anyway, I saw that Edward Feser recently posted a blog article in which he says that the New Atheists engage in “mutual mental onanism”. That’s pretty close to your “atheist circle jerk”. So, who owes whom a royalty check here?</p></blockquote><p>I think it is readily apparent that the use of the similar phrase – and it says much about the difference between Mr. Feser and me, mostly to his advantage, that he prefers the relatively genteel description “mutual mental onanism” to “bukkakelypse” – is nothing more than straightforward observation.  It is simply an obvious metaphor for the autoneurotic activities of the leading New Atheists.  The only significant difference between <a href=\"http://edwardfeser.blogspot.com/2012/03/reason-rally-doubleplusgood-newspeak.html\">Mr. Feser’s independent observations</a> and my own is my preference for the vulgate.  It’s interesting to note that he also pins down the intrinsic anti-intellectualism of the Fowl Atheist’s misguided foray into philosophy.</p><p><i>“[T]hat Dawkins’ arguments are directed at ludicrous straw men has been demonstrated time and again (for example, here).  Yet he resolutely declines to answer those who have exposed the numerous errors and fallacies in his writings — dismissing them as “fleas,” without explaining how exactly they have got his arguments wrong — or, in general, to debate anyone with expertise in the philosophy of religion.  Meanwhile, the even more vitriolic P. Z. Myers’ main claim to New Atheist fame is his “Courtier’s reply” dodge, a shamelessly question-begging rationalization for remaining ignorant of what the other side actually says.  New Atheists will ridicule their opponents, but actually read only each others’ work.  Hence Christopher Hitchens derives his main arguments from Dawkins, Lawrence Krauss learns everything he needs to know from Hitchens, and Dawkins has his confidence in the atheist worldview bolstered from reading Krauss.  And now this mutual mental onanism will be expanded across the National Mall.  Somewhere Joycelyn Elders is smiling.”</i></p></div>",
  "content_text": "EC wonders who is reading whom:\nI love the blog and your book TIA; TIA is actually the best polemic I’ve ever read. Anyway, I saw that Edward Feser recently posted a blog article in which he says that the New Atheists engage in “mutual mental onanism”. That’s pretty close to your “atheist circle jerk”. So, who owes whom a royalty check here?\nI think it is readily apparent that the use of the similar phrase – and it says much about the difference between Mr. Feser and me, mostly to his advantage, that he prefers the relatively genteel description “mutual mental onanism” to “bukkakelypse” – is nothing more than straightforward observation.  It is simply an obvious metaphor for the autoneurotic activities of the leading New Atheists.  The only significant difference between\nMr. Feser’s independent observations\nand my own is my preference for the vulgate.  It’s interesting to note that he also pins down the intrinsic anti-intellectualism of the Fowl Atheist’s misguided foray into philosophy.\n“[T]hat Dawkins’ arguments are directed at ludicrous straw men has been demonstrated time and again (for example, here).  Yet he resolutely declines to answer those who have exposed the numerous errors and fallacies in his writings — dismissing them as “fleas,” without explaining how exactly they have got his arguments wrong — or, in general, to debate anyone with expertise in the philosophy of religion.  Meanwhile, the even more vitriolic P. Z. Myers’ main claim to New Atheist fame is his “Courtier’s reply” dodge, a shamelessly question-begging rationalization for remaining ignorant of what the other side actually says.  New Atheists will ridicule their opponents, but actually read only each others’ work.  Hence Christopher Hitchens derives his main arguments from Dawkins, Lawrence Krauss learns everything he needs to know from Hitchens, and Dawkins has his confidence in the atheist worldview bolstered from reading Krauss.  And now this mutual mental onanism will be expanded across the National Mall.  Somewhere Joycelyn Elders is smiling.”",
  "tags": [
    "atheism",
    "mailvox"
  ],
  "categories": [],
  "sitemap_lastmod": "2012-03-16T09:19:00+00:00"
}