{
  "url": "https://voxday.net/2012/03/02/mailvox-suffering-suffrage/",
  "scraped_at": "2025-12-14T04:48:42.327308",
  "title": "Mailvox: suffering suffrage",
  "date_display": "March 2, 2012",
  "date_iso": "2012-03-02T08:38:00+00:00",
  "date_from_url": "2012-03-02",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>YM is provided with a compelling argument against the wisdom of granting women the right to vote:</p><blockquote><p>I am a very big fan of your blog and your unique brand of Christian libertarianism.  I mentioned to my mother your position on women and the vote. She asked me what I thought and I said that you presented some compelling arguments and I was unsure of my position. She then grounded me and refuses to let me leave the house until I apologize to her and tell her that I believe that women should have the right to vote. I have tried having discussion with her, but she immediately starts comparing me to Hitler.</p></blockquote><p>The punchline?  He’s 37.  Actually, I have no idea how old he is, but at least he is being provided an informative lesson in female nature, female solipsism, and the authoritarian instincts of women.  The Hitler comparison is particularly ironic, given that both the National Socialists and the Fascists were staunch supporters of women’s suffrage and the German party was, in fact, dependent upon it for their 1933 rise to power.  It was literally the first plank in “The Manifesto of the Fascist Struggle”, published in <i>The People of Italy</i> on June 6, 1919 by Benito Mussolini.</p><p><i>“Italians! Here is the program of a genuinely Italian movement. It is revolutionary because it is anti-dogmatic, strongly innovative and against prejudice.</i></p><p>For the political problem: We demand:</p><p>a) Universal suffrage polled on a regional basis, with proportional representation and voting and electoral office eligibility for women.”</p><p>It’s worth noting that the Fascist demand for proportional political female representation is significantly more “progressive” than anything American feminists have ever demanded.  Anyhow, I would never recommend apologizing to anyone for accused thought-crimes or submitting to exercises in forced re-education.  One is required to honor one’s mother, not submit to her lunatic demands for pious expressions of political correctness.</p></div>",
  "content_text": "YM is provided with a compelling argument against the wisdom of granting women the right to vote:\nI am a very big fan of your blog and your unique brand of Christian libertarianism.  I mentioned to my mother your position on women and the vote. She asked me what I thought and I said that you presented some compelling arguments and I was unsure of my position. She then grounded me and refuses to let me leave the house until I apologize to her and tell her that I believe that women should have the right to vote. I have tried having discussion with her, but she immediately starts comparing me to Hitler.\nThe punchline?  He’s 37.  Actually, I have no idea how old he is, but at least he is being provided an informative lesson in female nature, female solipsism, and the authoritarian instincts of women.  The Hitler comparison is particularly ironic, given that both the National Socialists and the Fascists were staunch supporters of women’s suffrage and the German party was, in fact, dependent upon it for their 1933 rise to power.  It was literally the first plank in “The Manifesto of the Fascist Struggle”, published in\nThe People of Italy\non June 6, 1919 by Benito Mussolini.\n“Italians! Here is the program of a genuinely Italian movement. It is revolutionary because it is anti-dogmatic, strongly innovative and against prejudice.\nFor the political problem: We demand:\na) Universal suffrage polled on a regional basis, with proportional representation and voting and electoral office eligibility for women.”\nIt’s worth noting that the Fascist demand for proportional political female representation is significantly more “progressive” than anything American feminists have ever demanded.  Anyhow, I would never recommend apologizing to anyone for accused thought-crimes or submitting to exercises in forced re-education.  One is required to honor one’s mother, not submit to her lunatic demands for pious expressions of political correctness.",
  "tags": [
    "mailvox",
    "women"
  ],
  "categories": [],
  "sitemap_lastmod": "2012-03-02T08:38:00+00:00"
}