{
  "url": "https://voxday.net/2012/03/10/mailvox-why-they-hate/",
  "scraped_at": "2025-12-14T04:49:23.512140",
  "title": "Mailvox: Why they hate",
  "date_display": "March 10, 2012",
  "date_iso": "2012-03-10T09:07:00+00:00",
  "date_from_url": "2012-03-10",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>Feminists absolutely hate this blog, although not for the reasons they claim.  It’s not because I hate women, because I don’t, or because I openly display contempt for women, although I do.  It’s not because I’m afraid of strong independent women, because I don’t fear unicorns either, or because I don’t believe in sexual equality, even though I don’t.</p><p>The real reason they hate this blog, and fear it, is because they understand on some level that it is <i>convincing</i>.  A ruthless commitment to logic and truth tends to be persuasive over time because the human mind can only stand so much cognitive dissonance before it either begins to break down or accept the observable truth.  And there is nothing that feminists fear so much as women being exposed to the unvarnished truth and seeing through the vast accumulation of the Sisterhood’s many lies.</p><p>SarahsDaughter <a href=\"http://alphagameplan.blogspot.com/2012/03/of-sluts-and-sexual-insecurity.html\">comments</a>:</p><blockquote><p>The worst challenge to our marriage occurred three years ago. Looking back at it, I am so disappointed in myself that leaving him entered my mind. And again I was reminded that my replacement was out there. They (the replacements) are quite eager to proclaim their availability. In a desire to fix our problems, I went to a psychologist. He completely agreed with me, offered no valuable advice, and creeped me out. My husband suggested I start reading this crazy, misogynist (my words, at first) blog (VP). Really, I’d like to tell you that my faith, relationship with God, profound books, and wisdom made the difference in how I deal with conflict. I’d be lying. It was because of men and women on VP speaking of logic and shaming the irrational nature of women that I began a journey to root out feminism in my thoughts and truly understand and accept the vows I made before God.</p></blockquote><p>While I don’t write this blog for anyone but myself, I’m always pleased to hear that others consider it to be in some way beneficial to themselves as well, particularly when it helps them break out of the intellectual chains that have been holding them mentally captive.  We all have them.  We are unthinking Republicans who believe God blesses the USA despite its corporate abjuration of Him, we are equalitarians who believe in many equalities that have never been observed in the wild or in captivity.  We are science fetishists who have never noticed that there is no method in the peer reviewed madness.  We are progressives against progress, feminists without femininity and Christians who believe Christ sins for us.</p><p>But whatever the chains are, they can be broken.</p><p>I am under no illusion that I am always correct.  But the challenges that others offer, particularly the serious and intelligent challenges, help me continually refine and strengthen my positions, which is why I particularly appreciate those critics who are able to force me to rethink my assumptions as well as my conclusions.  And as for the anklebiters and those who harbor vehement hate for the blog, I would only be concerned if such intellectual cripples admired it.</p></div>",
  "content_text": "Feminists absolutely hate this blog, although not for the reasons they claim.  It’s not because I hate women, because I don’t, or because I openly display contempt for women, although I do.  It’s not because I’m afraid of strong independent women, because I don’t fear unicorns either, or because I don’t believe in sexual equality, even though I don’t.\nThe real reason they hate this blog, and fear it, is because they understand on some level that it is\nconvincing\n.  A ruthless commitment to logic and truth tends to be persuasive over time because the human mind can only stand so much cognitive dissonance before it either begins to break down or accept the observable truth.  And there is nothing that feminists fear so much as women being exposed to the unvarnished truth and seeing through the vast accumulation of the Sisterhood’s many lies.\nSarahsDaughter\ncomments\n:\nThe worst challenge to our marriage occurred three years ago. Looking back at it, I am so disappointed in myself that leaving him entered my mind. And again I was reminded that my replacement was out there. They (the replacements) are quite eager to proclaim their availability. In a desire to fix our problems, I went to a psychologist. He completely agreed with me, offered no valuable advice, and creeped me out. My husband suggested I start reading this crazy, misogynist (my words, at first) blog (VP). Really, I’d like to tell you that my faith, relationship with God, profound books, and wisdom made the difference in how I deal with conflict. I’d be lying. It was because of men and women on VP speaking of logic and shaming the irrational nature of women that I began a journey to root out feminism in my thoughts and truly understand and accept the vows I made before God.\nWhile I don’t write this blog for anyone but myself, I’m always pleased to hear that others consider it to be in some way beneficial to themselves as well, particularly when it helps them break out of the intellectual chains that have been holding them mentally captive.  We all have them.  We are unthinking Republicans who believe God blesses the USA despite its corporate abjuration of Him, we are equalitarians who believe in many equalities that have never been observed in the wild or in captivity.  We are science fetishists who have never noticed that there is no method in the peer reviewed madness.  We are progressives against progress, feminists without femininity and Christians who believe Christ sins for us.\nBut whatever the chains are, they can be broken.\nI am under no illusion that I am always correct.  But the challenges that others offer, particularly the serious and intelligent challenges, help me continually refine and strengthen my positions, which is why I particularly appreciate those critics who are able to force me to rethink my assumptions as well as my conclusions.  And as for the anklebiters and those who harbor vehement hate for the blog, I would only be concerned if such intellectual cripples admired it.",
  "tags": [
    "mailvox",
    "philosophy"
  ],
  "categories": [],
  "sitemap_lastmod": "2012-03-10T09:07:00+00:00"
}