{
  "url": "https://voxday.net/2012/03/29/mailvox-do-explain-freddy/",
  "scraped_at": "2025-12-14T04:50:53.873755",
  "title": "Mailvox: awaiting enlightenment",
  "date_display": "March 29, 2012",
  "date_iso": "2012-03-29T13:00:00+00:00",
  "date_from_url": "2012-03-29",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>I am sure we all await, with no little interest, the enlightenment that Freddy, the Calvinist, is sure to shed upon the arrogant, and yet somehow feeble little brains of the “Arminians” here at Vox Popoli:</p><blockquote><p>The Arminians here act just like Jehovah Witnesses. They deny Trinity and the Diety of Christ because they can’t wrap their feeble little brains around those concepts…just like what the fundy Arminians do with the Sovereignty of God.  The height of arrogance and intellectual pride.</p></blockquote><p>Well, Freddy, since you have apparently been able to wrap your powerful and enormous, yet humble and not-at-all intellectual brain around the Trinity, the Diety of Christ, and the Sovereignty of God, I can’t imagine that you will have any trouble whatsoever in explicating the true and correct theology of those three concepts, slowly and patiently, for the edification of the less capable minds here.</p><p>I certainly look forward to hearing your explanation of how a man can be held responsible for something he cannot do, for how God can simultaneously know and not know the hour, (still less forsake Himself), and to hear your opinion on whether it was God, in His Sovereignty, who personally contemplated the issue before finally deciding how many times your pair of anal sphincters would constrict in the process of your daily defecations over the previous 24 hours.  I am also curious to know if you believe a Calvinist, who by his own assertion cannot choose to worship God, will be damned or saved in the event that human action is required for salvation.  Perhaps we can call it Jamsco’s Wager, the idea that the Calvinist who claims he is incapable of making a choice has nevertheless made it in the event that he is wrong about his incapability.</p><p>We’ve long assumed that Calvinism isn’t a salvation issue, but I am not so sure in this one regard.  After all, how can someone claim to have done something they simultaneously claim cannot be done?  Perhaps it was this dichotomy, and not his panoply of evil actions, that explains why <a href=\"http://www.gospeltruth.net/heresy/heresy_chap2.htm\">the Robispierre of Geneva</a> went to his grave wondering if he was not one of God’s Elect after all.</p><p>The “Arminian”, after all, needs fear nothing.  What is it to him if God laughs at his illusion of ability and tells him, “you did not choose me, my friend, I chose you!”  The Calvinist, on the other hand, is once more in exactly the same position as the atheist, in attempting to explain to the Almighty why he did not choose to submit himself to the Lord Jesus Christ when he had the opportunity.</p><p>The atheist will say: “It’s not my fault!  I didn’t choose to worship you because I didn’t believe you existed!”  The Calvinist will say: “It’s not my fault!  I didn’t choose to worship you because John Calvin, and RC Sproul, and John Piper told me I couldn’t!”</p></div>",
  "content_text": "I am sure we all await, with no little interest, the enlightenment that Freddy, the Calvinist, is sure to shed upon the arrogant, and yet somehow feeble little brains of the “Arminians” here at Vox Popoli:\nThe Arminians here act just like Jehovah Witnesses. They deny Trinity and the Diety of Christ because they can’t wrap their feeble little brains around those concepts…just like what the fundy Arminians do with the Sovereignty of God.  The height of arrogance and intellectual pride.\nWell, Freddy, since you have apparently been able to wrap your powerful and enormous, yet humble and not-at-all intellectual brain around the Trinity, the Diety of Christ, and the Sovereignty of God, I can’t imagine that you will have any trouble whatsoever in explicating the true and correct theology of those three concepts, slowly and patiently, for the edification of the less capable minds here.\nI certainly look forward to hearing your explanation of how a man can be held responsible for something he cannot do, for how God can simultaneously know and not know the hour, (still less forsake Himself), and to hear your opinion on whether it was God, in His Sovereignty, who personally contemplated the issue before finally deciding how many times your pair of anal sphincters would constrict in the process of your daily defecations over the previous 24 hours.  I am also curious to know if you believe a Calvinist, who by his own assertion cannot choose to worship God, will be damned or saved in the event that human action is required for salvation.  Perhaps we can call it Jamsco’s Wager, the idea that the Calvinist who claims he is incapable of making a choice has nevertheless made it in the event that he is wrong about his incapability.\nWe’ve long assumed that Calvinism isn’t a salvation issue, but I am not so sure in this one regard.  After all, how can someone claim to have done something they simultaneously claim cannot be done?  Perhaps it was this dichotomy, and not his panoply of evil actions, that explains why\nthe Robispierre of Geneva\nwent to his grave wondering if he was not one of God’s Elect after all.\nThe “Arminian”, after all, needs fear nothing.  What is it to him if God laughs at his illusion of ability and tells him, “you did not choose me, my friend, I chose you!”  The Calvinist, on the other hand, is once more in exactly the same position as the atheist, in attempting to explain to the Almighty why he did not choose to submit himself to the Lord Jesus Christ when he had the opportunity.\nThe atheist will say: “It’s not my fault!  I didn’t choose to worship you because I didn’t believe you existed!”  The Calvinist will say: “It’s not my fault!  I didn’t choose to worship you because John Calvin, and RC Sproul, and John Piper told me I couldn’t!”",
  "tags": [
    "Christianity",
    "mailvox"
  ],
  "categories": [],
  "sitemap_lastmod": "2012-03-29T12:00:00+00:00"
}