{
  "url": "https://voxday.net/2012/03/07/mailvox-omniderigistes/",
  "scraped_at": "2025-12-14T04:49:12.370316",
  "title": "Mailvox: omniderigistes",
  "date_display": "March 7, 2012",
  "date_iso": "2012-03-07T18:00:00+00:00",
  "date_from_url": "2012-03-07",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>CM has two questions:</p><blockquote><p>I find your anti-omni* arguments very compelling.  It’s completely counter to everything I’ve been taught (Baptist upbringing, elder in the Reformed church, currently in Missouri-Synod Lutheran church).</p><p>Couple of simple questions for clarification:</p><p>1.  I believe that God created time, and therefore must exist apart from it.  So even if he’s _not_ omnipresent, he could insert himself into any location and any time whenever he wishes, making himself functionally omnipresent.  Do you hold that God is a slave to an “external force” of time?  If he is, wouldn’t that mean that he’s not the “ultimate force”?</p><p>2.  If God is not omniscient, how does prophecy enter into your world-view?  If you believe that it’s possible, how can God know what’s going to happen if he doesn’t “know all” at some level?</p></blockquote><p>CM is making the same mistake in confusing capacity with action that Richard Dawkins makes in <i>The God Delusion</i> and which we see with regularity from Team Calvin.  The fact that God “could insert himself into any location and any time whenever he wishes” doesn’t make him “functionally omnipresent”, but rather “potentially omnipresent”.  This is the same difference and distinction that I draw between omniscience and voliscience, between God knowing everything at all times and God knowing whatever He decides He wants to know.  As for the question, no, I don’t consider God to be a slave to the external force of time.  For more thoughts on this, see the chapter on God as Game Designer in <i>The Irrational Atheist</i>.</p><p>As for prophecy, this is pretty simple.  The fact that you don’t know everything doesn’t mean you don’t know something in advance, especially if you are the one who is arranging to make it happen.  There is absolutely no need for omniscience to support the concept of accurate Divinely-inspired prophecy.</p></div>",
  "content_text": "CM has two questions:\nI find your anti-omni* arguments very compelling.  It’s completely counter to everything I’ve been taught (Baptist upbringing, elder in the Reformed church, currently in Missouri-Synod Lutheran church).\nCouple of simple questions for clarification:\n1.  I believe that God created time, and therefore must exist apart from it.  So even if he’s _not_ omnipresent, he could insert himself into any location and any time whenever he wishes, making himself functionally omnipresent.  Do you hold that God is a slave to an “external force” of time?  If he is, wouldn’t that mean that he’s not the “ultimate force”?\n2.  If God is not omniscient, how does prophecy enter into your world-view?  If you believe that it’s possible, how can God know what’s going to happen if he doesn’t “know all” at some level?\nCM is making the same mistake in confusing capacity with action that Richard Dawkins makes in\nThe God Delusion\nand which we see with regularity from Team Calvin.  The fact that God “could insert himself into any location and any time whenever he wishes” doesn’t make him “functionally omnipresent”, but rather “potentially omnipresent”.  This is the same difference and distinction that I draw between omniscience and voliscience, between God knowing everything at all times and God knowing whatever He decides He wants to know.  As for the question, no, I don’t consider God to be a slave to the external force of time.  For more thoughts on this, see the chapter on God as Game Designer in\nThe Irrational Atheist\n.\nAs for prophecy, this is pretty simple.  The fact that you don’t know everything doesn’t mean you don’t know something in advance, especially if you are the one who is arranging to make it happen.  There is absolutely no need for omniscience to support the concept of accurate Divinely-inspired prophecy.",
  "tags": [
    "Christianity",
    "mailvox"
  ],
  "categories": [],
  "sitemap_lastmod": "2012-03-07T18:00:00+00:00"
}