{
  "url": "https://voxday.net/2012/03/18/myth-of-evolution-my/",
  "scraped_at": "2025-12-14T04:50:07.553664",
  "title": "The myth of the evolution myth",
  "date_display": "March 18, 2012",
  "date_iso": "2012-03-18T06:43:00+00:00",
  "date_from_url": "2012-03-18",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>The New Scientist doesn’t understand <a href=\"http://www.newscientist.com/article/dn13677-evolution-myths-evolution-is-not-predictive.html\">what “a prediction” is</a>, and in doing so, underlines the very point it is attempting to dismiss:</p><blockquote><p>Cosmologists make precise predictions about what will happen to the universe in 20 billion years’ time. Biologists struggle to predict how a few bacteria in a dish might evolve over 20 hours. Some claim that this lack of precise predictive power means evolution is not scientific.</p><p>However, what matters in science is not how much you can predict on the basis of a theory or how precise those predictions are, but whether the predictions you can make turn out to be right. Meteorologists don’t reject chaos theory because it tells them it is impossible to predict the weather 100% accurately – on the contrary, they accept it because weather follows the broad patterns predicted by chaos theory.</p></blockquote><p>The amusing thing is that in an effort to claim that evolution really is a predictive science despite the inability of scientists to use it to predict anything, the article then denies that the failure of any evolution-based predictions could falsify the theory.  And it is telling that the primary examples it cites cannot be reasonably described as predictions, which relate <i>to the future</i> and not to the past.</p><p><i>“Most predictions relate to very specific aspects of evolutionary theory. If a eusocial mammal like the naked mole-rat had not been found, for instance, it would have proved only that Alexander’s ideas about the evolution of eusocial behaviour were probably wrong, not that there is anything wrong with the wider theory.”</i></p><p>Right, just like the failure of Keynesian theory to predict the simultaneous rising inflation and unemployment of the 1970s only related to the very specific aspects of the historical American economy, not that there was anything wrong with the wider theory.  This article makes it very clear that evolution, or if one wishes to be more specific, the theory of evolution by (probably) natural selection is not a science when viewed from either a predictive or Popperian perspective.</p></div>",
  "content_text": "The New Scientist doesn’t understand\nwhat “a prediction” is\n, and in doing so, underlines the very point it is attempting to dismiss:\nCosmologists make precise predictions about what will happen to the universe in 20 billion years’ time. Biologists struggle to predict how a few bacteria in a dish might evolve over 20 hours. Some claim that this lack of precise predictive power means evolution is not scientific.\nHowever, what matters in science is not how much you can predict on the basis of a theory or how precise those predictions are, but whether the predictions you can make turn out to be right. Meteorologists don’t reject chaos theory because it tells them it is impossible to predict the weather 100% accurately – on the contrary, they accept it because weather follows the broad patterns predicted by chaos theory.\nThe amusing thing is that in an effort to claim that evolution really is a predictive science despite the inability of scientists to use it to predict anything, the article then denies that the failure of any evolution-based predictions could falsify the theory.  And it is telling that the primary examples it cites cannot be reasonably described as predictions, which relate\nto the future\nand not to the past.\n“Most predictions relate to very specific aspects of evolutionary theory. If a eusocial mammal like the naked mole-rat had not been found, for instance, it would have proved only that Alexander’s ideas about the evolution of eusocial behaviour were probably wrong, not that there is anything wrong with the wider theory.”\nRight, just like the failure of Keynesian theory to predict the simultaneous rising inflation and unemployment of the 1970s only related to the very specific aspects of the historical American economy, not that there was anything wrong with the wider theory.  This article makes it very clear that evolution, or if one wishes to be more specific, the theory of evolution by (probably) natural selection is not a science when viewed from either a predictive or Popperian perspective.",
  "tags": [
    "evolution"
  ],
  "categories": [],
  "sitemap_lastmod": "2012-03-18T06:43:00+00:00"
}