{
  "url": "https://voxday.net/2012/03/15/ominous-sign/",
  "scraped_at": "2025-12-14T04:49:51.048303",
  "title": "An ominous sign",
  "date_display": "March 15, 2012",
  "date_iso": "2012-03-15T11:35:00+00:00",
  "date_from_url": "2012-03-15",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>It’s readily apparent that the women calling for a sex strike haven’t actually thought through <a href=\"http://www.huffingtonpost.com/2012/03/13/sex-strike-contraception-_n_1342266.html\">the implications of their modern-day Lysistrata</a>:</p><blockquote><p>A group that supports health care coverage of contraception is calling for women to withhold sex from their partners between April 28 and May 5.</p><p>“This will help people understand that contraception is for women and men, because men enjoy the benefit of women making their own choices about when and if they want to get pregnant,” Liberal Ladies who Lunch says on its website. “Once congress and insurance agencies agree to cover contraception, we will then resume having sex. Until then men will have to be content with their left hand.”</p><p>On its Facebook page, the group charts a brief history of similar “strikes,” starting with Aristophanes’ ancient Greek play “Lysistrata,” where women refuse to have sex until the end of the Peloponnesian War.</p></blockquote><p>Settling aside this ridiculous and totally obnoxious attempt to exert political control over men – and I recommend that any man immediately rid himself of a woman who would ever attempt to run this sort of power move on him – the basic concept of a sex strike is palpably stupid.</p><p>Six years after Aristophanes produced <i>Lysistrata</i>, which of course was written as a <i>comedy</i>, the Athenian fleet was destroyed by the Spartan admiral, Lysander.  A year later, a starving and besieged Athens surrendered and lost its walls, its fleet, and its empire.  And were it not for the unexpected mercy of the Spartans, granted in gratitude for the Athenian resistance of the Persian invasions, the Athenian women would have been enslaved by the men of Corinth and Thebes.</p><p>The lesson is that the society whose women attempt to use the crudest form of what John Adams once describes as “the tyranny of the petticoat” is a society that is unlikely to survive for long.</p></div>",
  "content_text": "It’s readily apparent that the women calling for a sex strike haven’t actually thought through\nthe implications of their modern-day Lysistrata\n:\nA group that supports health care coverage of contraception is calling for women to withhold sex from their partners between April 28 and May 5.\n“This will help people understand that contraception is for women and men, because men enjoy the benefit of women making their own choices about when and if they want to get pregnant,” Liberal Ladies who Lunch says on its website. “Once congress and insurance agencies agree to cover contraception, we will then resume having sex. Until then men will have to be content with their left hand.”\nOn its Facebook page, the group charts a brief history of similar “strikes,” starting with Aristophanes’ ancient Greek play “Lysistrata,” where women refuse to have sex until the end of the Peloponnesian War.\nSettling aside this ridiculous and totally obnoxious attempt to exert political control over men – and I recommend that any man immediately rid himself of a woman who would ever attempt to run this sort of power move on him – the basic concept of a sex strike is palpably stupid.\nSix years after Aristophanes produced\nLysistrata\n, which of course was written as a\ncomedy\n, the Athenian fleet was destroyed by the Spartan admiral, Lysander.  A year later, a starving and besieged Athens surrendered and lost its walls, its fleet, and its empire.  And were it not for the unexpected mercy of the Spartans, granted in gratitude for the Athenian resistance of the Persian invasions, the Athenian women would have been enslaved by the men of Corinth and Thebes.\nThe lesson is that the society whose women attempt to use the crudest form of what John Adams once describes as “the tyranny of the petticoat” is a society that is unlikely to survive for long.",
  "tags": [
    "society"
  ],
  "categories": [],
  "sitemap_lastmod": "2012-03-15T11:35:00+00:00"
}