{
  "url": "https://voxday.net/2012/03/30/power-struggles-in-china/",
  "scraped_at": "2025-12-14T04:50:57.500511",
  "title": "Power struggles in China",
  "date_display": "March 30, 2012",
  "date_iso": "2012-03-30T11:17:00+00:00",
  "date_from_url": "2012-03-30",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>The fact that <a href=\"http://www.foreignpolicy.com/articles/2012/03/29/the_revenge_of_wen_jiabao?page=full\">the battle is taking place</a> behind the scenes and away from the news cameras  doesn’t mean that it won’t have a serious impact on the geopolitical situation:</p><blockquote><p>After three hours of eloquent and emotional answers in his final news conference at the National People’s Congress annual meeting this month, Wen uttered his public political masterstroke, reopening debate on one of the most tumultuous events in the Chinese Communist Party’s history and hammering the final nail in the coffin of his great rival, the now-deposed Chongqing Communist Party boss Bo Xilai. And in striking down Bo, Wen got his revenge on a family that had opposed him and his mentor countless times in the past.</p><p>Responding to a gently phrased question about Chongqing, Wen foreshadowed Bo’s political execution, a seismic leadership rupture announced the following day that continues to convulse China’s political landscape to an extent not seen since 1989. But the addendum that followed might be even more significant. Indirectly, but unmistakably, Wen defined Bo as man who wanted to repudiate China’s decades-long effort to reform its economy, open to the world, and allow its citizens to experience modernity. He framed the struggle over Bo’s legacy as a choice between urgent political reforms and “such historical tragedies as the Cultural Revolution,” culminating a 30-year battle for two radically different versions of China, of which Bo Xilai and Wen Jiabao are the ideological heirs. In Wen’s world, bringing down Bo is the first step in a battle between China’s Maoist past and a more democratic future as personified by his beloved mentor, 1980s Communist Party chief Hu Yaobang. His words blew open the facade of party unity that had held since the massacres of Tiananmen Square.</p><p>This October, the Communist Party will likely execute a once-in-a-decade leadership transition in which President Hu Jintao and Premier Wen hand over to a new team led by current Vice President Xi Jinping. The majority of leaders will retire from the elite Politburo Standing Committee, and the turnover will extend down through lower tiers of the Communist Party, the government, and the military. Wen hopes his words influence who gets key posts, what ideological course they will set, and how history records his own career.</p></blockquote><p>The vicissitudes of civil war amongst the Chinese nomenklatura aside, I thought this was a particularly illuminating, if ironic, comment. <i>“Hu taught his children to resist the idea, wired into the Communist Party psyche, that they had any particular hereditary right to high office.”</i></p><p>And thus we see the Ciceronian political cycle at work, as democracy, aristocracy, and tyranny all represent temporary phases rather than stases.</p></div>",
  "content_text": "The fact that\nthe battle is taking place\nbehind the scenes and away from the news cameras  doesn’t mean that it won’t have a serious impact on the geopolitical situation:\nAfter three hours of eloquent and emotional answers in his final news conference at the National People’s Congress annual meeting this month, Wen uttered his public political masterstroke, reopening debate on one of the most tumultuous events in the Chinese Communist Party’s history and hammering the final nail in the coffin of his great rival, the now-deposed Chongqing Communist Party boss Bo Xilai. And in striking down Bo, Wen got his revenge on a family that had opposed him and his mentor countless times in the past.\nResponding to a gently phrased question about Chongqing, Wen foreshadowed Bo’s political execution, a seismic leadership rupture announced the following day that continues to convulse China’s political landscape to an extent not seen since 1989. But the addendum that followed might be even more significant. Indirectly, but unmistakably, Wen defined Bo as man who wanted to repudiate China’s decades-long effort to reform its economy, open to the world, and allow its citizens to experience modernity. He framed the struggle over Bo’s legacy as a choice between urgent political reforms and “such historical tragedies as the Cultural Revolution,” culminating a 30-year battle for two radically different versions of China, of which Bo Xilai and Wen Jiabao are the ideological heirs. In Wen’s world, bringing down Bo is the first step in a battle between China’s Maoist past and a more democratic future as personified by his beloved mentor, 1980s Communist Party chief Hu Yaobang. His words blew open the facade of party unity that had held since the massacres of Tiananmen Square.\nThis October, the Communist Party will likely execute a once-in-a-decade leadership transition in which President Hu Jintao and Premier Wen hand over to a new team led by current Vice President Xi Jinping. The majority of leaders will retire from the elite Politburo Standing Committee, and the turnover will extend down through lower tiers of the Communist Party, the government, and the military. Wen hopes his words influence who gets key posts, what ideological course they will set, and how history records his own career.\nThe vicissitudes of civil war amongst the Chinese nomenklatura aside, I thought this was a particularly illuminating, if ironic, comment.\n“Hu taught his children to resist the idea, wired into the Communist Party psyche, that they had any particular hereditary right to high office.”\nAnd thus we see the Ciceronian political cycle at work, as democracy, aristocracy, and tyranny all represent temporary phases rather than stases.",
  "tags": [
    "politics"
  ],
  "categories": [],
  "sitemap_lastmod": "2012-03-30T10:17:00+00:00"
}