{
  "url": "https://voxday.net/2012/03/16/science-and-problem-of-hammer/",
  "scraped_at": "2025-12-14T04:50:02.075167",
  "title": "Science and the problem of the hammer",
  "date_display": "March 16, 2012",
  "date_iso": "2012-03-16T17:30:00+00:00",
  "date_from_url": "2012-03-16",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>Stephen Law not only points out that science is fundamentally incapable of answering many questions and solving many puzzles, but that <a href=\"http://stephenlaw.blogspot.com/2012/02/magadalen-college-last-night-think-week.html\">it wasn’t even involved</a> in one of its landmark “experiments”:</p><blockquote><p>KEY POINTS ARE:</p><p>(i) this is not a puzzle that can be solved by empirical research.<br> (ii) It’s a conceptual puzzle that requires a conceptual solution. It’s a puzzle that takes armchair reflection to solve.</br></p><p>So not every puzzle is a puzzle that is best solved by empirical investigation. Some of the deepest and most baffling puzzles can, in fact, only be solved by armchair reflection.</p><p>In fact, all sorts of interesting discoveries can be made from the armchair. Mathematical discoveries, for example, can be made from the armchair. They can be achieved by pure thought alone – without doing any data collection or laboratory experiments.</p><p>We can also RULE OUT certain hypothesis from the comfort of the armchair.</p><p>Suppose an explorer claims to have discovered a four-sided triangle on their travels. Should we mount an expedition to go and check whether this momentous claim is correct? Of course not. We can figure out, from the comfort of our armchairs, that no such triangle exists. Triangles, by definition, have three sides. So a four-sided triangle involves a contradiction. It cannot possibly exist.</p><p>This is a rather obvious example. It’s obvious that four-sided triangles are ruled out conceptually. They involve a logical contradiction. But sometimes what is ruled out conceptually is NOT so obvious.</p><p>Aristotle claimed that objects of different mass will fall at different speeds. A large, heavy metal ball will fall faster than a small, light metal ball.</p><p>Back in the late 16thC, Galileo proved that Aristotle was wrong. Some say he did this by dropping two balls off the top of the leaning tower of Pisa. The two balls landed at the same time. Neil Armstrong did the experiment with a feather and hammer on the Moon</p><p>But actually, Galileo probably didn’t perform that experiment. He actually performed a thought experiment – one that he describes in his book <i>On Motion</i>. And of course thought experiments can be run from the comfort of ones armchair.</p><p>Galileo reasoned like so…</p><p>Imagine two balls, one heavier than the other, connected by a string. Drop this system of objects from the top of a tower. If we assume heavier objects do indeed fall faster than lighter ones (and conversely, lighter objects fall slower), the string will soon pull taut as the lighter ball drags on and slows the fall of the heavier ball. But the system considered as a whole is heavier than the heavy ball alone, and therefore should fall faster than the heavy ball on its own. So Aristotle’s theory, just like the claim that there exists a four-sided triangle, generates a contradiction. Galileo could establish that it is false from the comfort of his armchair.</p><p>True, this is a scientist doing a scientific thought experiment, but it illustrates the point that highly significant discoveries can indeed be made from the armchair.</p><p>Of course, philosophers need to be scientifically literate. Scientific discoveries can be of philosophical relevance. But, at heart, philosophy IS an armchair discipline. And it is none the worse for that.</p><p>Philosophy is about conceptual investigation and clarification. Philosophers make conceptual discoveries. I have illustrated how they tackle conceptual puzzles – puzzles that the scientific method just isn’t equipped to solve.</p><p>They also probe what we take for granted, our common sense assumptions, sometimes with dramatic results. Philosophers may reveal that what we believe has quite shocking unacknowledged consequences, for example.</p><p>This can lead to important breakthroughs. Particularly in moral philosophy. Many of the most important developments over the last couple of hundreds years or so have come about because of philosophical reflection – questioning of, and thinking through the consequences of, some of our most basic moral assumptions and principles.</p><p>So philosophy, it seems to me, is not just fascinating, it is also hugely valuable. Blah blah…</p><p>Richard Dawkins thought the mirror puzzle and solution was science not philosophy (really? – the last two papers I read on it were in philosophy journals, and I cannot imagine they’d be published in a science journal as they were purely conceptual and involved no empirical claims). Richard wondered why what I do is labelled “philosophy” at all. It’s just thinking, he said.</p></blockquote><p>It’s been conclusively demonstrated that Richard Dawkins doesn’t know much about history, theology, or philosophy.  But I have to admit, I find it remarkable, bordering on astonishing, that he apparently doesn’t even know what philosophy is.  No wonder he doesn’t believe in God, he doesn’t even believe in philosophy when it is being performed right in front of his face.</p><p>It is also becoming increasingly clear that due to their enthusiasm for science, the scientific-secular faithful is like the proverbial man with the hammer, always searching for a nail.</p></div>",
  "content_text": "Stephen Law not only points out that science is fundamentally incapable of answering many questions and solving many puzzles, but that\nit wasn’t even involved\nin one of its landmark “experiments”:\nKEY POINTS ARE:\n(i) this is not a puzzle that can be solved by empirical research.\n(ii) It’s a conceptual puzzle that requires a conceptual solution. It’s a puzzle that takes armchair reflection to solve.\nSo not every puzzle is a puzzle that is best solved by empirical investigation. Some of the deepest and most baffling puzzles can, in fact, only be solved by armchair reflection.\nIn fact, all sorts of interesting discoveries can be made from the armchair. Mathematical discoveries, for example, can be made from the armchair. They can be achieved by pure thought alone – without doing any data collection or laboratory experiments.\nWe can also RULE OUT certain hypothesis from the comfort of the armchair.\nSuppose an explorer claims to have discovered a four-sided triangle on their travels. Should we mount an expedition to go and check whether this momentous claim is correct? Of course not. We can figure out, from the comfort of our armchairs, that no such triangle exists. Triangles, by definition, have three sides. So a four-sided triangle involves a contradiction. It cannot possibly exist.\nThis is a rather obvious example. It’s obvious that four-sided triangles are ruled out conceptually. They involve a logical contradiction. But sometimes what is ruled out conceptually is NOT so obvious.\nAristotle claimed that objects of different mass will fall at different speeds. A large, heavy metal ball will fall faster than a small, light metal ball.\nBack in the late 16thC, Galileo proved that Aristotle was wrong. Some say he did this by dropping two balls off the top of the leaning tower of Pisa. The two balls landed at the same time. Neil Armstrong did the experiment with a feather and hammer on the Moon\nBut actually, Galileo probably didn’t perform that experiment. He actually performed a thought experiment – one that he describes in his book\nOn Motion\n. And of course thought experiments can be run from the comfort of ones armchair.\nGalileo reasoned like so…\nImagine two balls, one heavier than the other, connected by a string. Drop this system of objects from the top of a tower. If we assume heavier objects do indeed fall faster than lighter ones (and conversely, lighter objects fall slower), the string will soon pull taut as the lighter ball drags on and slows the fall of the heavier ball. But the system considered as a whole is heavier than the heavy ball alone, and therefore should fall faster than the heavy ball on its own. So Aristotle’s theory, just like the claim that there exists a four-sided triangle, generates a contradiction. Galileo could establish that it is false from the comfort of his armchair.\nTrue, this is a scientist doing a scientific thought experiment, but it illustrates the point that highly significant discoveries can indeed be made from the armchair.\nOf course, philosophers need to be scientifically literate. Scientific discoveries can be of philosophical relevance. But, at heart, philosophy IS an armchair discipline. And it is none the worse for that.\nPhilosophy is about conceptual investigation and clarification. Philosophers make conceptual discoveries. I have illustrated how they tackle conceptual puzzles – puzzles that the scientific method just isn’t equipped to solve.\nThey also probe what we take for granted, our common sense assumptions, sometimes with dramatic results. Philosophers may reveal that what we believe has quite shocking unacknowledged consequences, for example.\nThis can lead to important breakthroughs. Particularly in moral philosophy. Many of the most important developments over the last couple of hundreds years or so have come about because of philosophical reflection – questioning of, and thinking through the consequences of, some of our most basic moral assumptions and principles.\nSo philosophy, it seems to me, is not just fascinating, it is also hugely valuable. Blah blah…\nRichard Dawkins thought the mirror puzzle and solution was science not philosophy (really? – the last two papers I read on it were in philosophy journals, and I cannot imagine they’d be published in a science journal as they were purely conceptual and involved no empirical claims). Richard wondered why what I do is labelled “philosophy” at all. It’s just thinking, he said.\nIt’s been conclusively demonstrated that Richard Dawkins doesn’t know much about history, theology, or philosophy.  But I have to admit, I find it remarkable, bordering on astonishing, that he apparently doesn’t even know what philosophy is.  No wonder he doesn’t believe in God, he doesn’t even believe in philosophy when it is being performed right in front of his face.\nIt is also becoming increasingly clear that due to their enthusiasm for science, the scientific-secular faithful is like the proverbial man with the hammer, always searching for a nail.",
  "tags": [
    "philosophy"
  ],
  "categories": [],
  "sitemap_lastmod": "2012-03-16T17:30:00+00:00"
}