{
  "url": "https://voxday.net/2012/03/15/she-sounds-lovely/",
  "scraped_at": "2025-12-14T04:49:56.557276",
  "title": "She sounds lovely!",
  "date_display": "March 15, 2012",
  "date_iso": "2012-03-15T20:30:00+00:00",
  "date_from_url": "2012-03-15",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>Roissy posted this, <a href=\"http://heartiste.wordpress.com/2012/03/15/the-sad-bitter-end-an-okcupid-catch/\">complete with some excellent commentary</a>, and as the guy who sent it to him suggested, it really merits going viral.  It should be subtitled “<a href=\"http://www.okcupid.com/profile/talia_07\">I’m throwing in the towel</a>“.</p><blockquote><p>So this is it–I’m not looking, I honestly don’t care if I meet anyone on here anymore–and this is what I’ve learned about the men that I have had interactions on here with a little parting advice.</p><p>If you are over 40 and you do not take care of yourself, unless you truly don’t care that a woman is dating you for your money, then maybe a better site for you is sugarbaby.com</p><p>Those of us that are of a certain age and reasonably successful on here are on here, want to meet someone reasonable–intelligent, successful, happy, that we’re attracted to physically and emotionally, not because we’re desperate, but usually because we’re too busy to date, or we do not wish to date through our work. We have businesses to run, we travel frequently, or we be on here because our friends and family are bugging us about being single and this is way to get them off our backs. What that means is–<br> 1. We are not desperate–we do not need you to have a fulfilling life.<br> 2. We are busy people–just like you–and we mean what we say, and say what we mean because we don’t have time to play silly word games or have drama like 20 somethings.<br> 3. The silly little texting games are the fastest way to blow it. If we give you permission to call–then call–don’t text to see if its ok to call–we have a life–random texts from people we don’t know don’t cut it if we haven’t met you.<br> 4. If we ask you not to contact us further–then don’t–unless you want to appear as a crazy person.<br> 5. If we call you on the above..we’re not crazy, or scary..we just don’t have time to waste on people who don’t get it. We deal enough with that in our work.<br> 6. Life gets shorter for us every day–we have no time or desire for drama, games or people who do not have their act together.<br> 7. If we reject you after you have done any of the above, put your big boy pants on and move on.<br> 8. We are not angry–we know what we want–we know what we’re willing to put up with. With age, the list of what we want gets a little longer, while the list of what we’re willing to put up with gets infinitely smaller because we have learned from our youth.</br></br></br></br></br></br></br></br></p></blockquote><p>I don’t think this woman understands that any man with half a brain not only prefers younger, hotter women to the likes of her, but she is such a nasty piece of work, rotting from the inside out from all of her bitterness and barren professional ambition, that only the most masochistic of gamma males would ever want anything to do with her.</p><p>Some women are astonished by the fact that I repeatedly assert that men actively dislike intelligent, successful, educated women.  What, I ask them, sounds even REMOTELY attractive about this woman and her poisonous attitude.  I wouldn’t want to spend five minutes with her, let alone an entire evening.</p><p>And here is a little nota bene for women.  “Busy” doesn’t impress men.  I don’t quite understand what women think they’re conveying by resorting to the term as they do – I suspect it’s supposed to be a display of high value – but when a woman says “busy”, men hear “bitch”.</p></div>",
  "content_text": "Roissy posted this,\ncomplete with some excellent commentary\n, and as the guy who sent it to him suggested, it really merits going viral.  It should be subtitled “\nI’m throwing in the towel\n“.\nSo this is it–I’m not looking, I honestly don’t care if I meet anyone on here anymore–and this is what I’ve learned about the men that I have had interactions on here with a little parting advice.\nIf you are over 40 and you do not take care of yourself, unless you truly don’t care that a woman is dating you for your money, then maybe a better site for you is sugarbaby.com\nThose of us that are of a certain age and reasonably successful on here are on here, want to meet someone reasonable–intelligent, successful, happy, that we’re attracted to physically and emotionally, not because we’re desperate, but usually because we’re too busy to date, or we do not wish to date through our work. We have businesses to run, we travel frequently, or we be on here because our friends and family are bugging us about being single and this is way to get them off our backs. What that means is–\n1. We are not desperate–we do not need you to have a fulfilling life.\n2. We are busy people–just like you–and we mean what we say, and say what we mean because we don’t have time to play silly word games or have drama like 20 somethings.\n3. The silly little texting games are the fastest way to blow it. If we give you permission to call–then call–don’t text to see if its ok to call–we have a life–random texts from people we don’t know don’t cut it if we haven’t met you.\n4. If we ask you not to contact us further–then don’t–unless you want to appear as a crazy person.\n5. If we call you on the above..we’re not crazy, or scary..we just don’t have time to waste on people who don’t get it. We deal enough with that in our work.\n6. Life gets shorter for us every day–we have no time or desire for drama, games or people who do not have their act together.\n7. If we reject you after you have done any of the above, put your big boy pants on and move on.\n8. We are not angry–we know what we want–we know what we’re willing to put up with. With age, the list of what we want gets a little longer, while the list of what we’re willing to put up with gets infinitely smaller because we have learned from our youth.\nI don’t think this woman understands that any man with half a brain not only prefers younger, hotter women to the likes of her, but she is such a nasty piece of work, rotting from the inside out from all of her bitterness and barren professional ambition, that only the most masochistic of gamma males would ever want anything to do with her.\nSome women are astonished by the fact that I repeatedly assert that men actively dislike intelligent, successful, educated women.  What, I ask them, sounds even REMOTELY attractive about this woman and her poisonous attitude.  I wouldn’t want to spend five minutes with her, let alone an entire evening.\nAnd here is a little nota bene for women.  “Busy” doesn’t impress men.  I don’t quite understand what women think they’re conveying by resorting to the term as they do – I suspect it’s supposed to be a display of high value – but when a woman says “busy”, men hear “bitch”.",
  "tags": [
    "women"
  ],
  "categories": [],
  "sitemap_lastmod": "2012-03-15T20:30:00+00:00"
}