{
  "url": "https://voxday.net/2012/03/07/team-calvin-question-3/",
  "scraped_at": "2025-12-14T04:49:08.747877",
  "title": "Team Calvin: Question 3",
  "date_display": "March 7, 2012",
  "date_iso": "2012-03-07T12:15:00+00:00",
  "date_from_url": "2012-03-07",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><blockquote><p>CC. John 6:37, 44 and 45</p><p><i>All that the Father gives me will come to me; and him who comes to me I will not cast out.(…) No one can come to me unless the Father who sent me draws him; and I will raise him up at the last day. It is written in the prophets, ‘And they shall all be taught by God.’ Every one who has heard and learned from the Father comes to me.</i></p><p>If there are those that get saved without God’s prior action (Pelagianism), or those that refuse the action (Arminianism), then where do they fit between the “no one” of the first verse and “every one” of the second? Please describe a possible chain of events for such a person so that it doesn’t conflict with any of the verses.</p></blockquote><p>First, it is necessary to correct the error in the question.  Pelagianism is “the belief that original sin did not taint human nature and that mortal will is still capable of choosing good or evil without special Divine aid.”  This does not mean that “there are those that get saved without God’s prior action”, but rather, that there are those who are not in need of salvation or God’s prior action since they do not merit condemnation.  The distinction is significant.</p><p>Now to address the direct question.  There is obviously no need to figure out where the Pelagian unfallen fit here, since they have no need to come to Jesus Christ for a salvation they do not require.  This, however, would appear to be a very small group of people; the Biblical record suggests a potential set of three: Enoch, Elijah, and Jesus Christ himself.  So, what remains is to determine where those who require God’s grace but nevertheless refuse it fit between the “no one” of the first verse and “every one” of the second.</p><p>And when we consider the verses, it is perfectly obvious where these Arminian refusers fit.  They a) have not been given to Jesus, b) have not come to him, and c) have not heard and learned from the Father.  But none of this indicates that God does not wish them to be saved, that they have not been drawn by the Father, or that they have not heard the Father.</p><p>As is so often the case, Team Calvin’s position is based on a serious failure of reading comprehension.  Their concept of election and irresistible grace, as it corresponds with these selected verses, is dependent upon assuming that “draws” is equivalent to “gives” and that “no one can come unless” is equivalent to “everyone must come if”.  Not only are these two assumptions not necessarily true, they are quite obviously false on their faces as well in the context of the totality of Scripture.</p><p>As for the chain of events:</p><p>1.  The Father draws everyone, since as per 1 Timothy 4, He “wants all people to be saved.  He speaks to them through Creation and through His Spirit.  All are taught.<br> 2.  Some hear, learn and permit themselves to be drawn.  Some hear, do not learn, and do not permit themselves to be drawn.  Some do not hear, do not learn, and do not permit themselves to be drawn.  See <a href=\"http://www.biblegateway.com/passage/?search=Mark+4&amp;version=NIV\">The Parable of the Sower</a> in Mark 4.  All are taught, but not everyone learns.<br> 3.  Those who permit themselves to be drawn to the Father are given to His Son, Jesus Christ.<br> 4.  Those who are given to Jesus Christ go to him.<br> 5.  Jesus Christ does not cast out any who come to him, but raises them up on the last day.</br></br></br></br></p><p>I should perhaps mention that based on the various definitions, it is incorrect to describe me as a Arminian since my theological stance is more accurately described as Pelagian.  I agree wholeheartedly with Tertullian when he writes: <i>“I find, then, that man was constituted free by God. He was master of his own will and power…. For a law would not be imposed upon one who did not have it in his power to render that obedience which is due to law. Nor again, would the penalty of death be threatened against sin, if a contempt of the law were impossible to man in the liberty of his will…. Man is free, with a will either for obedience or resistance.</i></p><p> Team Calvin: <a href=\"http://www.milobookclub.com/2012/02/27/team-calvin-question-one/\">Question 1</a><br> Team Calvin: <a href=\"http://www.milobookclub.com/2012/02/28/team-calvin-question-two/\">Question 2</a></br></p></div>",
  "content_text": "CC. John 6:37, 44 and 45\nAll that the Father gives me will come to me; and him who comes to me I will not cast out.(…) No one can come to me unless the Father who sent me draws him; and I will raise him up at the last day. It is written in the prophets, ‘And they shall all be taught by God.’ Every one who has heard and learned from the Father comes to me.\nIf there are those that get saved without God’s prior action (Pelagianism), or those that refuse the action (Arminianism), then where do they fit between the “no one” of the first verse and “every one” of the second? Please describe a possible chain of events for such a person so that it doesn’t conflict with any of the verses.\nFirst, it is necessary to correct the error in the question.  Pelagianism is “the belief that original sin did not taint human nature and that mortal will is still capable of choosing good or evil without special Divine aid.”  This does not mean that “there are those that get saved without God’s prior action”, but rather, that there are those who are not in need of salvation or God’s prior action since they do not merit condemnation.  The distinction is significant.\nNow to address the direct question.  There is obviously no need to figure out where the Pelagian unfallen fit here, since they have no need to come to Jesus Christ for a salvation they do not require.  This, however, would appear to be a very small group of people; the Biblical record suggests a potential set of three: Enoch, Elijah, and Jesus Christ himself.  So, what remains is to determine where those who require God’s grace but nevertheless refuse it fit between the “no one” of the first verse and “every one” of the second.\nAnd when we consider the verses, it is perfectly obvious where these Arminian refusers fit.  They a) have not been given to Jesus, b) have not come to him, and c) have not heard and learned from the Father.  But none of this indicates that God does not wish them to be saved, that they have not been drawn by the Father, or that they have not heard the Father.\nAs is so often the case, Team Calvin’s position is based on a serious failure of reading comprehension.  Their concept of election and irresistible grace, as it corresponds with these selected verses, is dependent upon assuming that “draws” is equivalent to “gives” and that “no one can come unless” is equivalent to “everyone must come if”.  Not only are these two assumptions not necessarily true, they are quite obviously false on their faces as well in the context of the totality of Scripture.\nAs for the chain of events:\n1.  The Father draws everyone, since as per 1 Timothy 4, He “wants all people to be saved.  He speaks to them through Creation and through His Spirit.  All are taught.\n2.  Some hear, learn and permit themselves to be drawn.  Some hear, do not learn, and do not permit themselves to be drawn.  Some do not hear, do not learn, and do not permit themselves to be drawn.  See\nThe Parable of the Sower\nin Mark 4.  All are taught, but not everyone learns.\n3.  Those who permit themselves to be drawn to the Father are given to His Son, Jesus Christ.\n4.  Those who are given to Jesus Christ go to him.\n5.  Jesus Christ does not cast out any who come to him, but raises them up on the last day.\nI should perhaps mention that based on the various definitions, it is incorrect to describe me as a Arminian since my theological stance is more accurately described as Pelagian.  I agree wholeheartedly with Tertullian when he writes:\n“I find, then, that man was constituted free by God. He was master of his own will and power…. For a law would not be imposed upon one who did not have it in his power to render that obedience which is due to law. Nor again, would the penalty of death be threatened against sin, if a contempt of the law were impossible to man in the liberty of his will…. Man is free, with a will either for obedience or resistance.\nTeam Calvin:\nQuestion 1\nTeam Calvin:\nQuestion 2",
  "tags": [
    "Christianity"
  ],
  "categories": [],
  "sitemap_lastmod": "2012-03-07T12:15:00+00:00"
}