{
  "url": "https://voxday.net/2012/03/14/to-hell-with-secular-society/",
  "scraped_at": "2025-12-14T04:49:49.190538",
  "title": "To Hell with secular society",
  "date_display": "March 14, 2012",
  "date_iso": "2012-03-14T17:00:00+00:00",
  "date_from_url": "2012-03-14",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>I no longer have any use for it.  None whatsoever.  I was raised and indoctrinated in the ideal of the “separation of church and state” and genuinely believed that it was best if religion was not permitted to dictate societal rules or even unduly influence society.  But this has finally convinced me that the Muslims have the right idea and <a href=\"http://www.telegraph.co.uk/culture/culturenews/9140869/Dantes-Divine-Comedy-offensive-and-should-be-banned.html\">secularism merits nothing more than being stamped out</a>, ruthlessly and without remorse:</p><blockquote><p>It is a world-renowned work of literature and one of the foundation stones of the Italian language, but Dante’s Divine Comedy has been condemned as racist, homophobic, anti-Islamist and anti-Semitic. The classic work should be removed from school curricula, according to Gherush 92, a human rights organisation which acts as a consultant to UN bodies on racism and discrimination.</p><p>Dante’s epic is “offensive and discriminatory” and has no place in a modern classroom, said Valentina Sereni, the group’s president….</p><p>Schoolchildren and university students who studied the work lacked “the filters” to appreciate its historical context and were being fed a poisonous diet of anti-Semitism and racism, the group said.  It called for the Divine Comedy to be removed from schools and universities or at least have its more offensive sections fully explained.</p></blockquote><p>Consider this.  The Papal States produced <i>La Commedia Divina</i>, Catholic Italy produced Vivaldi, Anglican England produced Shakespeare, Christian Austria produced Mozart and Haydn.  What have two generations of modern secularism produced despite its lofty claims concerning the female liberation and the unchaining of the human spirit? <i>Avatar</i>, <i>Twilight</i>, and <i>The Vagina Monologues</i>.</p><p>Camille Paglia was right. <i>“Great art can be made out of love for religion as well as rebellion against it. But a totally secularized society with contempt for religion sinks into materialism and self-absorption and gradually goes slack, without leaving an artistic legacy.”</i></p><p>Secular progressives are totalitarians and book-burners every bit as fanatical as religious extremists they decry.  They always have been, they just build their cultural walls one stealthy and dishonest brick at a time.</p></div>",
  "content_text": "I no longer have any use for it.  None whatsoever.  I was raised and indoctrinated in the ideal of the “separation of church and state” and genuinely believed that it was best if religion was not permitted to dictate societal rules or even unduly influence society.  But this has finally convinced me that the Muslims have the right idea and\nsecularism merits nothing more than being stamped out\n, ruthlessly and without remorse:\nIt is a world-renowned work of literature and one of the foundation stones of the Italian language, but Dante’s Divine Comedy has been condemned as racist, homophobic, anti-Islamist and anti-Semitic. The classic work should be removed from school curricula, according to Gherush 92, a human rights organisation which acts as a consultant to UN bodies on racism and discrimination.\nDante’s epic is “offensive and discriminatory” and has no place in a modern classroom, said Valentina Sereni, the group’s president….\nSchoolchildren and university students who studied the work lacked “the filters” to appreciate its historical context and were being fed a poisonous diet of anti-Semitism and racism, the group said.  It called for the Divine Comedy to be removed from schools and universities or at least have its more offensive sections fully explained.\nConsider this.  The Papal States produced\nLa Commedia Divina\n, Catholic Italy produced Vivaldi, Anglican England produced Shakespeare, Christian Austria produced Mozart and Haydn.  What have two generations of modern secularism produced despite its lofty claims concerning the female liberation and the unchaining of the human spirit?\nAvatar\n,\nTwilight\n, and\nThe Vagina Monologues\n.\nCamille Paglia was right.\n“Great art can be made out of love for religion as well as rebellion against it. But a totally secularized society with contempt for religion sinks into materialism and self-absorption and gradually goes slack, without leaving an artistic legacy.”\nSecular progressives are totalitarians and book-burners every bit as fanatical as religious extremists they decry.  They always have been, they just build their cultural walls one stealthy and dishonest brick at a time.",
  "tags": [
    "decline and fall"
  ],
  "categories": [],
  "sitemap_lastmod": "2012-03-14T17:00:00+00:00"
}