{
  "url": "https://voxday.net/2025/06/25/a-failed-modus-operandi/",
  "scraped_at": "2026-01-08T20:23:14.500222",
  "title": "A Failed Modus Operandi",
  "date_display": "June 25, 2025",
  "date_iso": "2025-06-25T10:43:21+00:00",
  "date_from_url": "2025-06-25",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>Simplicius believes the recent conflict suddenly ended by the US-imposed ceasefire reflects a third, and more serious, <a href=\"https://simplicius76.substack.com/p/humiliation-israel-tucks-tail-after\">failure by the Israeli military</a>:</p><blockquote class=\"wp-block-quote is-layout-flow wp-block-quote-is-layout-flow\"><p>It is now clear that Israel relied on a favored go-to modus operandi in its past three conflicts. Israel has now lost against Hamas, lost against Hezbollah, and lost to Iran. Each time, its face-saving strategy was to “decapitate the leadership”, particularly the well-known personalities like Nasrallah, Haniyeh, etc., and pretend this is somehow a war winning stroke.</p><p>In reality, it did nothing each time. Israel still lost the fight on the ground—or in the air, as it were, against Iran. Israel’s putrid army proved incapable of winning real conflicts and had to rely entirely on PR victories and America’s bank to fund various sabotage and extortion schemes against enemy political and military figures.</p><p>Think about it this way: in ten or twenty years, what will be remembered about today, the names of a few random “Iranian generals” that Israel “masterfully killed” via cowardly sneak attacks, or the fact that Israeli cities burned for the first time, Israel failed to defang Iran’s nuclear program, and flopped at every other major objective it had, including regime change?</p><p>The fact is, Israel suffered an historic humiliation that has destroyed its mystique and reputation as some kind of ‘military juggernaut’ forever. Iran can now learn from its mistakes, rebuild the few launchers and AD systems it lost, and potentially sign new pacts with Russia-China that can expand its defense capabilities.</p><p>It is interesting, however, that Iran’s airforce did not seem to participate at all—some experts suggest Iran likely relocated it entirely to the far east of the country and simply kept it out of harm’s way for the duration. Given that Israel’s air-farce was also a no-show over the country, one supposes it wasn’t an altogether bad idea.</p><p>In fact, Iran masterfully conserved its limitations and <em>leveraged </em>its greatest advantages during this conflict, thus limiting the damage it suffered. Too bad we’ll never know the full extent of Iran’s missile capabilities given how desperately Israel guarded any ‘sensitive’ damage leaks about the strikes on its territory. But due to how uncharacteristically quickly Israel leaped at the ceasefire offer, logic dictates that the damage Iran meted was significant and <em>unsustainable</em>.</p></blockquote><p>In the aftermath of a narrowly-avoided disaster, we should keep in mind the Israeli triumphalism from less than two weeks ago:</p><ul class=\"wp-block-list\"><li><em>The decision to start a war was all Netanyahu’s. And here he is, deciding and responsible: all the credit is his. Trump gave Israel the green light to start a war, provided that it does not present America as a partner and responsible.</em> – Nahum Barnea (<em>Yedioth Ahoronot</em>)</li><li><em>The need for the series of assassinations last week first emerged as a thought last September, among senior officials in Unit 8200, the research division in the Intelligence Directorate, the Mossad, and other parts of the system. The trigger was the defeat inflicted by the IDF on Hezbollah, followed by the successful attack on Iran and the destruction of its air defence system in October, followed in December by the collapse of the Assad regime in Damascus and the destruction of its air defence system by the IDF. The sequence of events led many senior Israeli officials to believe that an unprecedented opportunity had arisen, a window of a lifetime, to attack Iran. </em> – Ronan Bergman (<em>Yedioth Ahoronot</em>)</li><li><em>Ten days ago, on the eve of Israel’s historic action, I stood here and placed a note that read: ‘Behold, a nation shall rise like a lion’. Now, ten days later, I return to the same place and leave a note that reads: ‘Behold, a nation has risen like a lion – the Nation of Israel lives!’</em> – Benjamin Netanyahu</li></ul><p></p><p></p><p>And just like that, in less than two weeks, the window of a lifetime is closed. The thinking of the senior Israeli officials appears to have been very much as an Israeli who knows his country’s elite and is well-versed in their thinking once described it to me: tactical cleverness with neither interest in nor aptitude for strategy.</p><p></p><p></p><p>The fundamental problem that Israel, as a country, and AIPAC as a political control device, have is that rhetoric, subversion, and clever tactical maneuvers only work so long as you’re not actually responsible for making things work, feeding everyone, keeping the lights on, and actually winning wars rather than a skirmish here and there. The reason Israel – and the Israel-influenced USA – always rely on regime change instead of military victory as the primary objective is because they are locked into a subversive and short-term mindset.</p><p></p><p></p><p>But sooner or later, when those who are influenced over inevitably comprehend that your grand plans for the future requires not only their suppression, but elimination, they’re not going to respond favorably to all the subversion anymore. Which is why Clown World lost Russia, why it lost China, and why it will lose America as soon as the indoctrinated Boomers lose their political and societal influence. No amount of belief in one’s intrinsic superiority or sociopathic indifference to everyone else, however genuine, are ever going to compensate for a complete inability to run a stand-alone society, let alone a regional empire. But no failing empire, however small, ever fades away gently into the historical night.</p><p></p><p></p><p>Translation: false flags are coming. The assumption is New York City, given the growing hysteria over <a href=\"https://www.msn.com/en-us/news/politics/in-shock-to-democratic-politics-zohran-mamdani-wins-nyc-primary-for-mayor/ar-AA1HmS4Y\">Zohran Mamdani’s apparent victory</a> in the Democratic primary for the Mayor’s office, and the sinking of the USS Nimitz, but they could take place in anywhere, in any form.</p><p></p><p></p><p><em><a href=\"https://socialgalactic.com/micropost/28a3f3b5-d938-47d9-98f9-e9482bdd10f5\">DISCUSS ON SG</a></em></p><p></p></div>",
  "content_text": "Simplicius believes the recent conflict suddenly ended by the US-imposed ceasefire reflects a third, and more serious,\nfailure by the Israeli military\n:\nIt is now clear that Israel relied on a favored go-to modus operandi in its past three conflicts. Israel has now lost against Hamas, lost against Hezbollah, and lost to Iran. Each time, its face-saving strategy was to “decapitate the leadership”, particularly the well-known personalities like Nasrallah, Haniyeh, etc., and pretend this is somehow a war winning stroke.\nIn reality, it did nothing each time. Israel still lost the fight on the ground—or in the air, as it were, against Iran. Israel’s putrid army proved incapable of winning real conflicts and had to rely entirely on PR victories and America’s bank to fund various sabotage and extortion schemes against enemy political and military figures.\nThink about it this way: in ten or twenty years, what will be remembered about today, the names of a few random “Iranian generals” that Israel “masterfully killed” via cowardly sneak attacks, or the fact that Israeli cities burned for the first time, Israel failed to defang Iran’s nuclear program, and flopped at every other major objective it had, including regime change?\nThe fact is, Israel suffered an historic humiliation that has destroyed its mystique and reputation as some kind of ‘military juggernaut’ forever. Iran can now learn from its mistakes, rebuild the few launchers and AD systems it lost, and potentially sign new pacts with Russia-China that can expand its defense capabilities.\nIt is interesting, however, that Iran’s airforce did not seem to participate at all—some experts suggest Iran likely relocated it entirely to the far east of the country and simply kept it out of harm’s way for the duration. Given that Israel’s air-farce was also a no-show over the country, one supposes it wasn’t an altogether bad idea.\nIn fact, Iran masterfully conserved its limitations and\nleveraged\nits greatest advantages during this conflict, thus limiting the damage it suffered. Too bad we’ll never know the full extent of Iran’s missile capabilities given how desperately Israel guarded any ‘sensitive’ damage leaks about the strikes on its territory. But due to how uncharacteristically quickly Israel leaped at the ceasefire offer, logic dictates that the damage Iran meted was significant and\nunsustainable\n.\nIn the aftermath of a narrowly-avoided disaster, we should keep in mind the Israeli triumphalism from less than two weeks ago:\nThe decision to start a war was all Netanyahu’s. And here he is, deciding and responsible: all the credit is his. Trump gave Israel the green light to start a war, provided that it does not present America as a partner and responsible.\n– Nahum Barnea (\nYedioth Ahoronot\n)\nThe need for the series of assassinations last week first emerged as a thought last September, among senior officials in Unit 8200, the research division in the Intelligence Directorate, the Mossad, and other parts of the system. The trigger was the defeat inflicted by the IDF on Hezbollah, followed by the successful attack on Iran and the destruction of its air defence system in October, followed in December by the collapse of the Assad regime in Damascus and the destruction of its air defence system by the IDF. The sequence of events led many senior Israeli officials to believe that an unprecedented opportunity had arisen, a window of a lifetime, to attack Iran.\n– Ronan Bergman (\nYedioth Ahoronot\n)\nTen days ago, on the eve of Israel’s historic action, I stood here and placed a note that read: ‘Behold, a nation shall rise like a lion’. Now, ten days later, I return to the same place and leave a note that reads: ‘Behold, a nation has risen like a lion – the Nation of Israel lives!’\n– Benjamin Netanyahu\nAnd just like that, in less than two weeks, the window of a lifetime is closed. The thinking of the senior Israeli officials appears to have been very much as an Israeli who knows his country’s elite and is well-versed in their thinking once described it to me: tactical cleverness with neither interest in nor aptitude for strategy.\nThe fundamental problem that Israel, as a country, and AIPAC as a political control device, have is that rhetoric, subversion, and clever tactical maneuvers only work so long as you’re not actually responsible for making things work, feeding everyone, keeping the lights on, and actually winning wars rather than a skirmish here and there. The reason Israel – and the Israel-influenced USA – always rely on regime change instead of military victory as the primary objective is because they are locked into a subversive and short-term mindset.\nBut sooner or later, when those who are influenced over inevitably comprehend that your grand plans for the future requires not only their suppression, but elimination, they’re not going to respond favorably to all the subversion anymore. Which is why Clown World lost Russia, why it lost China, and why it will lose America as soon as the indoctrinated Boomers lose their political and societal influence. No amount of belief in one’s intrinsic superiority or sociopathic indifference to everyone else, however genuine, are ever going to compensate for a complete inability to run a stand-alone society, let alone a regional empire. But no failing empire, however small, ever fades away gently into the historical night.\nTranslation: false flags are coming. The assumption is New York City, given the growing hysteria over\nZohran Mamdani’s apparent victory\nin the Democratic primary for the Mayor’s office, and the sinking of the USS Nimitz, but they could take place in anywhere, in any form.\nDISCUSS ON SG",
  "tags": [
    "Clown World",
    "Middle East",
    "war"
  ],
  "categories": [],
  "sitemap_lastmod": "2025-06-25T11:41:04+00:00"
}