{
  "url": "https://voxday.net/2025/06/01/five-down-six-to-go/",
  "scraped_at": "2026-01-08T20:20:54.094925",
  "title": "Five Down, Six to Go",
  "date_display": "June 1, 2025",
  "date_iso": "2025-06-01T10:34:15+00:00",
  "date_from_url": "2025-06-01",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>Russia makes it clear that <a href=\"https://simplicius76.substack.com/p/sitrep-53125-russian-breakthrough\">it’s moving on</a> to the third phase of territorial acquisition by taking 200 km2, including a lot on the new Sumy front, in the last week.</p><p><em>The Russian army took 18 settlements, almost 200 km², in 7 days. Russian troops are demonstrating the most active advancement in the DPR, Kharkov and Sumy regions. According to the publication’s experts, the Ukrainian Armed Forces are unable to stop the offensive due to an acute shortage of personnel, which cannot be eliminated in the near future. </em>— Bild</p><p>As I and many others have predicted, the failure of the Kiev regime to surrender when it is observably defeated means that the Russians now intend to take on the battlefield what they obviously desired from the beginning.</p><p><em>State Duma Defense Committee Chairman Kartapolov issued an even more pronounced statement—that Ukraine would lose Sumy, Zaporozhye, Dnipropetrovsk, Kharkov, Nikolayev, and Odessa if it continues to resist.</em></p><p>There is absolutely nothing the USA, NATO, or anyone else can do to stop Russia from taking the entirety of those six additional provinces except try to negotiate a conditional surrender that confirms Russia’s control of all the territory up to the Dnieper and turns over Odessa to the Russians. I expect control of Odessa is a non-negotiable at this point and that we are likely less than one year from Russia being in a position to demand an unconditional surrender by Kiev. Russia now has the full and open support of China; the clumsy attempts of the USA to pivot from Ukraine to Taiwan, the trade war, and the US support for the Gazacaust have only increased China’s appreciation for the importance of its alliance with Russia.</p><p>Since 2022, the Chinese have resolutely refused to blame Russia for the war in Ukraine despite US demands to do so, and now, to the contrary, they have very publicly, and correctly, laid “a major responsibility” for the war on the USA.</p><p><em>The United States bears a major responsibility for the outbreak of the war and the continuation of the war. But, of course, the United States has a responsibility to work its efforts and play its part for an early ending of the conflict. We urge the United States to concentrate on the ongoing diplomatic effort and stop this rather boring blaming game. </em>— Deputy UN Representative Geng Shuang</p><p>All of this highlights the intrinsic danger of allowing men and women who believe in subversion and word magic to hold power at the national level. They will cling to their belief in their fantasies even when objective reality conclusively disproves them.</p><p><em><a href=\"https://socialgalactic.com/micropost/847521d0-4232-458b-b368-87f1d10bdfad\">DISCUSS ON SG</a></em></p></div>",
  "content_text": "Russia makes it clear that\nit’s moving on\nto the third phase of territorial acquisition by taking 200 km2, including a lot on the new Sumy front, in the last week.\nThe Russian army took 18 settlements, almost 200 km², in 7 days. Russian troops are demonstrating the most active advancement in the DPR, Kharkov and Sumy regions. According to the publication’s experts, the Ukrainian Armed Forces are unable to stop the offensive due to an acute shortage of personnel, which cannot be eliminated in the near future.\n— Bild\nAs I and many others have predicted, the failure of the Kiev regime to surrender when it is observably defeated means that the Russians now intend to take on the battlefield what they obviously desired from the beginning.\nState Duma Defense Committee Chairman Kartapolov issued an even more pronounced statement—that Ukraine would lose Sumy, Zaporozhye, Dnipropetrovsk, Kharkov, Nikolayev, and Odessa if it continues to resist.\nThere is absolutely nothing the USA, NATO, or anyone else can do to stop Russia from taking the entirety of those six additional provinces except try to negotiate a conditional surrender that confirms Russia’s control of all the territory up to the Dnieper and turns over Odessa to the Russians. I expect control of Odessa is a non-negotiable at this point and that we are likely less than one year from Russia being in a position to demand an unconditional surrender by Kiev. Russia now has the full and open support of China; the clumsy attempts of the USA to pivot from Ukraine to Taiwan, the trade war, and the US support for the Gazacaust have only increased China’s appreciation for the importance of its alliance with Russia.\nSince 2022, the Chinese have resolutely refused to blame Russia for the war in Ukraine despite US demands to do so, and now, to the contrary, they have very publicly, and correctly, laid “a major responsibility” for the war on the USA.\nThe United States bears a major responsibility for the outbreak of the war and the continuation of the war. But, of course, the United States has a responsibility to work its efforts and play its part for an early ending of the conflict. We urge the United States to concentrate on the ongoing diplomatic effort and stop this rather boring blaming game.\n— Deputy UN Representative Geng Shuang\nAll of this highlights the intrinsic danger of allowing men and women who believe in subversion and word magic to hold power at the national level. They will cling to their belief in their fantasies even when objective reality conclusively disproves them.\nDISCUSS ON SG",
  "tags": [
    "China",
    "Russia",
    "war"
  ],
  "categories": [],
  "sitemap_lastmod": "2025-06-01T10:34:18+00:00"
}