{
  "url": "https://voxday.net/2025/06/13/israels-satanic-elite-revealed/",
  "scraped_at": "2026-01-08T20:22:02.472755",
  "title": "Israel’s Satanic Elite Revealed",
  "date_display": "June 13, 2025",
  "date_iso": "2025-06-13T10:00:38+00:00",
  "date_from_url": "2025-06-13",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>Christian Zionists have been greatly deceived, if the reports coming out of the Israeli media about <a href=\"https://www.rt.com/news/619022-israel-satanic-child-abuse/\">at least an influential subset</a> of the Israeli elite are true.</p><blockquote class=\"wp-block-quote is-layout-flow wp-block-quote-is-layout-flow\"><p>The story broke with <a href=\"https://www.israelhayom.com/2025/04/23/bottom-of-darkness-children-raped-in-ritual-ceremonies-expose-the-horrors/https://www.israelhayom.com/2025/04/23/bottom-of-darkness-children-raped-in-ritual-ceremonies-expose-the-horrors/\">an investigative report published by Israel Hayom</a>, which unearthed a long-standing pattern of ritual sexual abuse, psychological manipulation, and spiritual desecration occurring not on the margins of society but from within its most sacred institutions. Survivors speak of torment that begins in early childhood and lasts decades, often committed under the guise of religious observance.</p><p>Israeli children, some as young as infants, were subjected to methodical abuse masked in religious ritual. Survivors describe ceremonies invoking biblically-vilified deities, conducted by members of observant Jewish communities. As a survivor named Noga recalled: “The gods I remember are Baal Peor and Ashtoreth… our lord Peor and our lady Ashtoreth.”</p><p><em> More than ten women between the ages of 20-45 with whom we spoke describe a severe phenomenon raising serious concern that in Israel, like many countries worldwide, organized sexual abuse of children is occurring right under everyone’s nose.</em></p><p>The culprits are not fringe radicals. These are individuals who keep kosher, celebrate the Sabbath, and adhere to the minutiae of Jewish law even as they engage in acts so depraved that they defy comprehension. Some of these perpetrators are qualified to blow the shofar on Rosh Hashanah — a high privilege among observant Jews. Family members, most of whom may have once been victims themselves, are often the ones who hand over their little ones to these monsters.</p><p>Several rabbis’ names appeared repeatedly in survivor testimonies. Multiple complaints filed at different police stations across Israel were quickly nipped in the bud. <a href=\"https://www.jpost.com/israel-news/article-856407\">According to the Jerusalem Post</a>, which followed up on the Hayom report, “doctors, educators, police officers, and past and present members of the Knesset were involved in these abuses.”</p><p>The police have known about this for a year, but they don’t have the tools to deal with it. The people who will fall are very, very senior figures. These people run communities and government agencies. They threaten us. </p></blockquote><p>Sounds familiar, doesn’t it. And these are also the same people who are pulling the strings in the Kiev regime, the European Commission, the US Congress, and apparently, the Trump administration right now. Because the Kiev elite, the EU elite, the UK elite, the US elite, and the Israeli elite are one and the same. They all worship the same satanic gods in the same abhorrent way as their predecessors in Technochtitlan and other historical centers of horror.</p><p>It’s the group that George Bush named “the New World Order”, Vladimir Putin described as “the Empire of Lies”, and Philip K. Dick called “The Empire That Never Ended”. We call it Clown World. And it is these elites, not the people of the nations over which they rule, who are the genuine bad guys. Pretty much every other major conflict, including both Ukraine and Iran, is a distraction that Clown World utilizes to weaken their enemies and protect themselves from being targeted.</p><p>I wonder if it might be these recent revelations, and not the Iranian nuclear program, that is behind the timing of yesterday’s Israeli attack on Iran. Because it was going to be very difficult to hide behind the usual shields of antisemitism and Holocaustianity when it is the Israeli media reporting on the crimes and all of the victims are Jews.</p><p><em><a href=\"https://socialgalactic.com/micropost/f81575a3-bf0a-4350-addd-a41731554967\">DISCUSS ON SG</a></em></p></div>",
  "content_text": "Christian Zionists have been greatly deceived, if the reports coming out of the Israeli media about\nat least an influential subset\nof the Israeli elite are true.\nThe story broke with\nan investigative report published by Israel Hayom\n, which unearthed a long-standing pattern of ritual sexual abuse, psychological manipulation, and spiritual desecration occurring not on the margins of society but from within its most sacred institutions. Survivors speak of torment that begins in early childhood and lasts decades, often committed under the guise of religious observance.\nIsraeli children, some as young as infants, were subjected to methodical abuse masked in religious ritual. Survivors describe ceremonies invoking biblically-vilified deities, conducted by members of observant Jewish communities. As a survivor named Noga recalled: “The gods I remember are Baal Peor and Ashtoreth… our lord Peor and our lady Ashtoreth.”\nMore than ten women between the ages of 20-45 with whom we spoke describe a severe phenomenon raising serious concern that in Israel, like many countries worldwide, organized sexual abuse of children is occurring right under everyone’s nose.\nThe culprits are not fringe radicals. These are individuals who keep kosher, celebrate the Sabbath, and adhere to the minutiae of Jewish law even as they engage in acts so depraved that they defy comprehension. Some of these perpetrators are qualified to blow the shofar on Rosh Hashanah — a high privilege among observant Jews. Family members, most of whom may have once been victims themselves, are often the ones who hand over their little ones to these monsters.\nSeveral rabbis’ names appeared repeatedly in survivor testimonies. Multiple complaints filed at different police stations across Israel were quickly nipped in the bud.\nAccording to the Jerusalem Post\n, which followed up on the Hayom report, “doctors, educators, police officers, and past and present members of the Knesset were involved in these abuses.”\nThe police have known about this for a year, but they don’t have the tools to deal with it. The people who will fall are very, very senior figures. These people run communities and government agencies. They threaten us.\nSounds familiar, doesn’t it. And these are also the same people who are pulling the strings in the Kiev regime, the European Commission, the US Congress, and apparently, the Trump administration right now. Because the Kiev elite, the EU elite, the UK elite, the US elite, and the Israeli elite are one and the same. They all worship the same satanic gods in the same abhorrent way as their predecessors in Technochtitlan and other historical centers of horror.\nIt’s the group that George Bush named “the New World Order”, Vladimir Putin described as “the Empire of Lies”, and Philip K. Dick called “The Empire That Never Ended”. We call it Clown World. And it is these elites, not the people of the nations over which they rule, who are the genuine bad guys. Pretty much every other major conflict, including both Ukraine and Iran, is a distraction that Clown World utilizes to weaken their enemies and protect themselves from being targeted.\nI wonder if it might be these recent revelations, and not the Iranian nuclear program, that is behind the timing of yesterday’s Israeli attack on Iran. Because it was going to be very difficult to hide behind the usual shields of antisemitism and Holocaustianity when it is the Israeli media reporting on the crimes and all of the victims are Jews.\nDISCUSS ON SG",
  "tags": [
    "Clown World",
    "globalism",
    "Judeochristianity",
    "news"
  ],
  "categories": [],
  "sitemap_lastmod": "2025-06-13T10:05:28+00:00"
}