{
  "url": "https://voxday.net/2025/06/16/remember-who-owns-the-media/",
  "scraped_at": "2026-01-08T20:22:24.658756",
  "title": "Remember Who Owns the Media",
  "date_display": "June 16, 2025",
  "date_iso": "2025-06-16T11:48:43+00:00",
  "date_from_url": "2025-06-16",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>It’s important to keep in mind that <a href=\"https://sonar21.com/the-zionists-are-crying-uncle-sam/\">the US media is relentlessly pro-Israel</a> when you’re reading about how Israel has total air supremacy over Tehran and only two cats and an abandoned hut were destroyed by what few Iranian missiles managed to get through the impenetrable Iron Dome air defense system. I’m not saying that Israel is any more likely to wave the white flag than Iran is, only pointing out that while the recent exchanges have been more serious than the last round, in military terms, we’re still talking about what is little more than handbags at twenty paces.</p><blockquote class=\"wp-block-quote is-layout-flow wp-block-quote-is-layout-flow\"><p>Israel’s initial euphoria over its Friday morning strikes on Iranian targets is fading as Israeli inhabitants get a taste of their own medicine. Israel’s much touted <em>Iron Dome</em> is a total bust. I have posted a couple of videos below that show the Iranian missiles arriving unimpeded. In his latest video, <em>BORZZIKMAN</em> reports that the Iranian strike yesterday on the IDF version of the Pentagon destroyed a THAAD air defense system that was deployed to “protect” the building.</p><p>Pepe Escobar was interviewed earlier today by Nima and provided some important news from his impeccable Russian sources. Israel, with help from the West, hit Iran with a cyberattack early Friday morning Tehran time that disabled Iran’s air-defense system. Israel and the West anticipated this would disable Iran’s ability to track and attack inbound missiles for several days. According to Pepe, Iranian technicians got the system up and running in 10 hours.</p><p>The <em>Potemkin Village</em> propaganda generated by Israel and spread by Western media is coming apart at the seams. While many in the West still believe that Israel has struck a fatal blow on Iran and that Iran is just days away from a collapse, the Iranian missile force is alive and well and bombing the shit out of Israel. I suspect that Iran is employing Houthi tactics with their ballistic missiles that are fired from mobile launchers — i.e., instead of relying on fixed sites, Iran is deploying its missiles around the country on mobile launchers, which are virtually impossible to detect and destroy in a timely manner. As I write this, Iran reportedly has launched an eighth-wave of missiles. Iran is going to engage Israel in a tit-for-tat battle until Israel ceases its attacks on Iran.</p></blockquote><p>That little tidbit about the cyberattack disabling Iran’s air defense makes sense, as I was wondering what Netanyahu meant when he was initially talking about the attacks going on for days. His statements make more sense in light of the expectation that Iran wouldn’t have any air defenses active for an extended period of time, and also explain how the initial attacks worked better than expected before petering out. It also explains why the Israelis have run so quickly to the US government in asking to be bailed out of a situation that pretty much every neutral analyst anticipated they would find themselves.</p><p>The whole concept of “inflict a few casualties and use them as a lever to effect regime change” is just prodigiously stupid. It’s the same strategy every single time, and while it used to work occasionally, it’s simply not a smart basis for going to war with a more powerful country. 200 fatalities is less than nothing to the Iranians, who lost more than one million dead in winning their war with Saddam Hussein’s Iraq.</p><p>If this is genuinely the best the IDF can do, and I find it difficult to believe it is, then Israel is in more desperate straits than I’d imagined.</p><p><em><a href=\"https://socialgalactic.com/micropost/e0a983e8-c969-4244-baa6-106df0c7e216\">DISCUSS ON SG</a></em></p></div>",
  "content_text": "It’s important to keep in mind that\nthe US media is relentlessly pro-Israel\nwhen you’re reading about how Israel has total air supremacy over Tehran and only two cats and an abandoned hut were destroyed by what few Iranian missiles managed to get through the impenetrable Iron Dome air defense system. I’m not saying that Israel is any more likely to wave the white flag than Iran is, only pointing out that while the recent exchanges have been more serious than the last round, in military terms, we’re still talking about what is little more than handbags at twenty paces.\nIsrael’s initial euphoria over its Friday morning strikes on Iranian targets is fading as Israeli inhabitants get a taste of their own medicine. Israel’s much touted\nIron Dome\nis a total bust. I have posted a couple of videos below that show the Iranian missiles arriving unimpeded. In his latest video,\nBORZZIKMAN\nreports that the Iranian strike yesterday on the IDF version of the Pentagon destroyed a THAAD air defense system that was deployed to “protect” the building.\nPepe Escobar was interviewed earlier today by Nima and provided some important news from his impeccable Russian sources. Israel, with help from the West, hit Iran with a cyberattack early Friday morning Tehran time that disabled Iran’s air-defense system. Israel and the West anticipated this would disable Iran’s ability to track and attack inbound missiles for several days. According to Pepe, Iranian technicians got the system up and running in 10 hours.\nThe\nPotemkin Village\npropaganda generated by Israel and spread by Western media is coming apart at the seams. While many in the West still believe that Israel has struck a fatal blow on Iran and that Iran is just days away from a collapse, the Iranian missile force is alive and well and bombing the shit out of Israel. I suspect that Iran is employing Houthi tactics with their ballistic missiles that are fired from mobile launchers — i.e., instead of relying on fixed sites, Iran is deploying its missiles around the country on mobile launchers, which are virtually impossible to detect and destroy in a timely manner. As I write this, Iran reportedly has launched an eighth-wave of missiles. Iran is going to engage Israel in a tit-for-tat battle until Israel ceases its attacks on Iran.\nThat little tidbit about the cyberattack disabling Iran’s air defense makes sense, as I was wondering what Netanyahu meant when he was initially talking about the attacks going on for days. His statements make more sense in light of the expectation that Iran wouldn’t have any air defenses active for an extended period of time, and also explain how the initial attacks worked better than expected before petering out. It also explains why the Israelis have run so quickly to the US government in asking to be bailed out of a situation that pretty much every neutral analyst anticipated they would find themselves.\nThe whole concept of “inflict a few casualties and use them as a lever to effect regime change” is just prodigiously stupid. It’s the same strategy every single time, and while it used to work occasionally, it’s simply not a smart basis for going to war with a more powerful country. 200 fatalities is less than nothing to the Iranians, who lost more than one million dead in winning their war with Saddam Hussein’s Iraq.\nIf this is genuinely the best the IDF can do, and I find it difficult to believe it is, then Israel is in more desperate straits than I’d imagined.\nDISCUSS ON SG",
  "tags": [
    "war"
  ],
  "categories": [],
  "sitemap_lastmod": "2025-06-16T11:49:21+00:00"
}