{
  "url": "https://voxday.net/2025/06/22/team-trump-and-bibi/",
  "scraped_at": "2026-01-08T20:22:57.908202",
  "title": "Team Trump and Bibi",
  "date_display": "June 22, 2025",
  "date_iso": "2025-06-22T09:15:35+00:00",
  "date_from_url": "2025-06-22",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>That’s the word right from the short, fat Trump’s mouth:</p><p><em>President Donald Trump addressed the nation on Saturday night after announcing strikes on three Iranian nuclear sites via Truth Social. Speaking from the Oval Office accompanied by Vice President J.D. Vance, Secretary of State Marco Rubio, and Secretary of Defense Pete Hegseth, the President said, “Tonight, I can report to the world that the strikes were a spectacular military success. Iran’s nuclear enrichment facilities have been completely and totally obliterated. Iran, the bully of the Middle East, must now make peace. If they do not, future attacks would be far greater and a lot easier.” He also reached out to Israeli leadership, saying, “I want to thank and congratulate Prime Minister Bibi Netanyahu. We worked as a team. Like perhaps no team has ever worked before, and we’ve gone a long way to erasing this horrible threat to Israel.”</em></p><p>Meanwhile:</p><ul class=\"wp-block-list\"><li>Iranian state radio: <em>the Fordow nuclear facility sustained no significant damage in the US strike.</em></li><li>IDF officials: <em>there is a slim possibility the Fordow facility was not destroyed.</em></li><li>Iran’s Center for the National Nuclear Safety System: <em>confirmed the attack, but said that emergency inspections at the affected facilities have found no signs of radioactive contamination or leaks.</em></li><li>The International Atomic Energy Agency: <em>no increase in radiation levels has been reported at Fordow, Natanz, and Esfahan.</em></li></ul><p>Remember, the one thing the media never, ever, reports is the real story and the actual truth. And everything about Clown World is fake and gay.</p><p>The one thing that we can be sure of is that if a) nukes are real and b) the Iranian capacity for building them remains sufficiently intact, the Iranians are going to acquire some nukes in short order. I’d be shocked if they didn’t already acquire some from North Korea or Pakistan.</p><p><em><a href=\"https://socialgalactic.com/micropost/cf74567c-54d0-4d25-a67e-acbea78a1332\">DISCUSS ON SG</a></em></p></div>",
  "content_text": "That’s the word right from the short, fat Trump’s mouth:\nPresident Donald Trump addressed the nation on Saturday night after announcing strikes on three Iranian nuclear sites via Truth Social. Speaking from the Oval Office accompanied by Vice President J.D. Vance, Secretary of State Marco Rubio, and Secretary of Defense Pete Hegseth, the President said, “Tonight, I can report to the world that the strikes were a spectacular military success. Iran’s nuclear enrichment facilities have been completely and totally obliterated. Iran, the bully of the Middle East, must now make peace. If they do not, future attacks would be far greater and a lot easier.” He also reached out to Israeli leadership, saying, “I want to thank and congratulate Prime Minister Bibi Netanyahu. We worked as a team. Like perhaps no team has ever worked before, and we’ve gone a long way to erasing this horrible threat to Israel.”\nMeanwhile:\nIranian state radio:\nthe Fordow nuclear facility sustained no significant damage in the US strike.\nIDF officials:\nthere is a slim possibility the Fordow facility was not destroyed.\nIran’s Center for the National Nuclear Safety System:\nconfirmed the attack, but said that emergency inspections at the affected facilities have found no signs of radioactive contamination or leaks.\nThe International Atomic Energy Agency:\nno increase in radiation levels has been reported at Fordow, Natanz, and Esfahan.\nRemember, the one thing the media never, ever, reports is the real story and the actual truth. And everything about Clown World is fake and gay.\nThe one thing that we can be sure of is that if a) nukes are real and b) the Iranian capacity for building them remains sufficiently intact, the Iranians are going to acquire some nukes in short order. I’d be shocked if they didn’t already acquire some from North Korea or Pakistan.\nDISCUSS ON SG",
  "tags": [
    "Middle East",
    "war"
  ],
  "categories": [],
  "sitemap_lastmod": "2025-06-22T11:09:09+00:00"
}