{
  "url": "https://voxday.net/2025/06/06/trump-always-chickens-out/",
  "scraped_at": "2026-01-08T20:21:22.323953",
  "title": "Trump Always Chickens Out",
  "date_display": "June 6, 2025",
  "date_iso": "2025-06-06T12:07:11+00:00",
  "date_from_url": "2025-06-06",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>Neon Revolt observes that the reason the TACO acronym <a href=\"https://gab.com/NeonRevolt/posts/114631916195309661\">has landed so powerfully</a> is because President Trump has an observable pattern of reliably chickening out and failing to implement both his literal and implied promises:</p><blockquote class=\"wp-block-quote is-layout-flow wp-block-quote-is-layout-flow\"><p>Sorry <a href=\"https://gab.com/realdonaldtrump\">@realdonaldtrump</a>, but it’s true. We voted for DOGE changes, because all you have been offering of late is tired old platitudes and slavish devotion to Zionists and Zionist causes (because you likely feel you couldn’t have won without Adelson money). You don’t even measure up to your old tweets, which used to inspire. Instead, we get stump speeches for the likes of Lindsey Graham.</p><p>There’s a reason “TACO” exists as an acronym now, and I was trading successfully with it long before the media pointed it out. You TACO’d during Covid, you TACO’d on J6, and you’re TACO’ing all the way through your second term thus far, as far as I can see right now.</p><p>It’s why you literally want to create a digital database of every American now, using a the technology developed by a company that was literally funded by Jeffrey Epstein – and let me guess, it will be used to root out “aNtIsEmiTiSm.”</p></blockquote><p>The most effective rhetoric is always based in the truth. It only burns because it’s true. I have increasingly little sympathy for President Trump, even though he is a) the greatest US president since Andrew Jackson and b) he faces a degree of difficulty much greater than anyone, including myself, is capable of understanding.</p><p>But it’s one thing to fail to end the Federal Reserve or deport 50 million foreigners, both of which would obviously be monumental tasks that would be difficult to accomplish. It’s another to fail to prosecute anyone, from Joe Biden and Hillary Clinton on down for their many crimes against the American people, to refuse to step forward and simply tell the American people the whole truth about everything from JFK to Jeffrey Epstein, and to refuse to shut down the Kiev regime’s ability to prolong its unwinnable war against Russia.</p><p>There would be nothing easier than for Trump to force Kiev to surrender. He could have ended the war in 24 hours by announcing an end to all arms sales to any country that supplied Kiev with support, accompanied by 100 percent tariffs, US withdrawal from the NATO treaty, and the immediate removal of all US troops from Europe. Kiev and the EU would have been begging Putin to give them decent terms for surrender within 12 hours, and Putin would have given them a much better settlement than they’re going to end up with in 2026 after Russia takes the entire Black Sea coast and all the land east of the Dnieper.</p><p>But Trump chickened out.</p><p>If the President doesn’t want TACO to be his legacy, there is an easy solution. Do what you said you would do. Stop chickening out because some clown on your staff tells you it’s a bad idea. This isn’t that hard; the American people elected you, not anyone on your staff, or in the US military, or in an executive-branch agency, or at some conservative think tank.</p><p>And remember, it’s your legacy that will suffer, not theirs, when you take their bad advice.</p><p><em><a href=\"https://socialgalactic.com/micropost/671da15c-3c44-4b73-b72c-17851a6f7341\">DISCUSS ON SG</a></em></p></div>",
  "content_text": "Neon Revolt observes that the reason the TACO acronym\nhas landed so powerfully\nis because President Trump has an observable pattern of reliably chickening out and failing to implement both his literal and implied promises:\nSorry\n@realdonaldtrump\n, but it’s true. We voted for DOGE changes, because all you have been offering of late is tired old platitudes and slavish devotion to Zionists and Zionist causes (because you likely feel you couldn’t have won without Adelson money). You don’t even measure up to your old tweets, which used to inspire. Instead, we get stump speeches for the likes of Lindsey Graham.\nThere’s a reason “TACO” exists as an acronym now, and I was trading successfully with it long before the media pointed it out. You TACO’d during Covid, you TACO’d on J6, and you’re TACO’ing all the way through your second term thus far, as far as I can see right now.\nIt’s why you literally want to create a digital database of every American now, using a the technology developed by a company that was literally funded by Jeffrey Epstein – and let me guess, it will be used to root out “aNtIsEmiTiSm.”\nThe most effective rhetoric is always based in the truth. It only burns because it’s true. I have increasingly little sympathy for President Trump, even though he is a) the greatest US president since Andrew Jackson and b) he faces a degree of difficulty much greater than anyone, including myself, is capable of understanding.\nBut it’s one thing to fail to end the Federal Reserve or deport 50 million foreigners, both of which would obviously be monumental tasks that would be difficult to accomplish. It’s another to fail to prosecute anyone, from Joe Biden and Hillary Clinton on down for their many crimes against the American people, to refuse to step forward and simply tell the American people the whole truth about everything from JFK to Jeffrey Epstein, and to refuse to shut down the Kiev regime’s ability to prolong its unwinnable war against Russia.\nThere would be nothing easier than for Trump to force Kiev to surrender. He could have ended the war in 24 hours by announcing an end to all arms sales to any country that supplied Kiev with support, accompanied by 100 percent tariffs, US withdrawal from the NATO treaty, and the immediate removal of all US troops from Europe. Kiev and the EU would have been begging Putin to give them decent terms for surrender within 12 hours, and Putin would have given them a much better settlement than they’re going to end up with in 2026 after Russia takes the entire Black Sea coast and all the land east of the Dnieper.\nBut Trump chickened out.\nIf the President doesn’t want TACO to be his legacy, there is an easy solution. Do what you said you would do. Stop chickening out because some clown on your staff tells you it’s a bad idea. This isn’t that hard; the American people elected you, not anyone on your staff, or in the US military, or in an executive-branch agency, or at some conservative think tank.\nAnd remember, it’s your legacy that will suffer, not theirs, when you take their bad advice.\nDISCUSS ON SG",
  "tags": [
    "politics",
    "rhetoric"
  ],
  "categories": [],
  "sitemap_lastmod": "2025-06-06T12:07:15+00:00"
}