{
  "url": "https://voxday.net/2025/06/23/us-begs-china-for-help/",
  "scraped_at": "2026-01-08T20:23:07.075279",
  "title": "US Begs China for Help",
  "date_display": "June 23, 2025",
  "date_iso": "2025-06-23T15:17:42+00:00",
  "date_from_url": "2025-06-23",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>Are we seriously supposed to believe that no one in the Trump administration took the probability of <a href=\"https://www.bbc.com/news/articles/c056pyv723vo\">Iran restricting global oil supplies</a> into account?</p><blockquote class=\"wp-block-quote is-layout-flow wp-block-quote-is-layout-flow\"><p>US Secretary of State Marco Rubio has called on China to prevent Iran from closing the Strait of Hormuz, one of the world’s most important shipping routes. His comments came after Iran’s state-run Press TV reported that parliament had approved a plan to close the Strait but added that the final decision lies with the Supreme National Security Council.</p><p>Any disruption to the supply of oil would have profound consequences for the economy. China in particular is the world’s largest buyer of Iranian oil and has a close relationship with Tehran.</p><p>Oil prices rose following the US attack on Iranian nuclear sites, with the price of the benchmark Brent crude reaching its highest level in five months.</p><p>“I encourage the Chinese government in Beijing to call them [Iran] about that, because they heavily depend on the Straits of Hormuz for their oil,” Rubio had said in an interview with Fox News on Sunday. “If they [close the Straits]… it will be economic suicide for them. And we retain options to deal with that, but other countries should be looking at that as well. It would hurt other countries’ economies a lot worse than ours.”</p></blockquote><p>I would be too sure about that, given the way China obviously foresaw the need to avoid utilizing the more traditional sea routes.</p><p><em>On May 25, 2025, the first freight train from Xi’an, China, arrived at the Aprin dry port, Iran, marking the official launch of a direct rail link between the two countries. This new logistical artery significantly reduces transit times (from 30–40 days by sea to roughly 15 days by land) yielding a direct impact on transportation costs. This railway is part of a much larger and broader East-West Corridor that is designed to link China, physically, with a trade route directly to Africa, and to Europe, without having to use the more traditional sea trade routes.</em></p><p>An oil tanker carries between 500k and 2 million barrels of oil. 18.5 million barrels transit the Straits of Hormuz every day, which means about 18 tankers per day. China utilizes 16 million barrels per day, although obviously not all of it comes through the Straits.</p><p>A rail tanker car carries 700 barrels and Canada ships 150,000 barrels by rail every day from the Albert oil sands. Taking the faster rail delivery time into account, it would require 9,150 rail cars to replace those 16 daily tankers, and a total of 274,500 rail cars to meet the daily oil requirements without a hitch. That sounds like a lot, until you observe that the China Railway Rolling Stock Corp. is the world’s leading manufacturer of rolling stock, with the capacity to manufacture over 500 high-speed train sets, 12,000 subway cars <em>and 50,000 freight cars per year</em>.</p><p>I think it is safe to assume that China has already built the 300k or so freight cars required to replace the 1,120 sea tankers that historically supplied it, given that they didn’t just start building the Aprin-Xi’an link in 2024 and the two countries signed an economic cooperation pact in 2021.</p><p>However, China doesn’t transport all its oil through the Strait of Hormuz. It only obtains about one-third of it that way, 5.1 million barrels per day. So it only needs a total of 87,500 freight cars to substitute for that particular source. Which, one notes, the Chinese could have completed before the launch of the railroad if they started manufacturing them as recently as August 2023.</p><p><em><a href=\"https://socialgalactic.com/micropost/1a154481-9d6d-4dbc-86ca-9d4a4129a84f\">DISCUSS ON SG</a></em></p></div>",
  "content_text": "Are we seriously supposed to believe that no one in the Trump administration took the probability of\nIran restricting global oil supplies\ninto account?\nUS Secretary of State Marco Rubio has called on China to prevent Iran from closing the Strait of Hormuz, one of the world’s most important shipping routes. His comments came after Iran’s state-run Press TV reported that parliament had approved a plan to close the Strait but added that the final decision lies with the Supreme National Security Council.\nAny disruption to the supply of oil would have profound consequences for the economy. China in particular is the world’s largest buyer of Iranian oil and has a close relationship with Tehran.\nOil prices rose following the US attack on Iranian nuclear sites, with the price of the benchmark Brent crude reaching its highest level in five months.\n“I encourage the Chinese government in Beijing to call them [Iran] about that, because they heavily depend on the Straits of Hormuz for their oil,” Rubio had said in an interview with Fox News on Sunday. “If they [close the Straits]… it will be economic suicide for them. And we retain options to deal with that, but other countries should be looking at that as well. It would hurt other countries’ economies a lot worse than ours.”\nI would be too sure about that, given the way China obviously foresaw the need to avoid utilizing the more traditional sea routes.\nOn May 25, 2025, the first freight train from Xi’an, China, arrived at the Aprin dry port, Iran, marking the official launch of a direct rail link between the two countries. This new logistical artery significantly reduces transit times (from 30–40 days by sea to roughly 15 days by land) yielding a direct impact on transportation costs. This railway is part of a much larger and broader East-West Corridor that is designed to link China, physically, with a trade route directly to Africa, and to Europe, without having to use the more traditional sea trade routes.\nAn oil tanker carries between 500k and 2 million barrels of oil. 18.5 million barrels transit the Straits of Hormuz every day, which means about 18 tankers per day. China utilizes 16 million barrels per day, although obviously not all of it comes through the Straits.\nA rail tanker car carries 700 barrels and Canada ships 150,000 barrels by rail every day from the Albert oil sands. Taking the faster rail delivery time into account, it would require 9,150 rail cars to replace those 16 daily tankers, and a total of 274,500 rail cars to meet the daily oil requirements without a hitch. That sounds like a lot, until you observe that the China Railway Rolling Stock Corp. is the world’s leading manufacturer of rolling stock, with the capacity to manufacture over 500 high-speed train sets, 12,000 subway cars\nand 50,000 freight cars per year\n.\nI think it is safe to assume that China has already built the 300k or so freight cars required to replace the 1,120 sea tankers that historically supplied it, given that they didn’t just start building the Aprin-Xi’an link in 2024 and the two countries signed an economic cooperation pact in 2021.\nHowever, China doesn’t transport all its oil through the Strait of Hormuz. It only obtains about one-third of it that way, 5.1 million barrels per day. So it only needs a total of 87,500 freight cars to substitute for that particular source. Which, one notes, the Chinese could have completed before the launch of the railroad if they started manufacturing them as recently as August 2023.\nDISCUSS ON SG",
  "tags": [
    "China",
    "economics",
    "Middle East",
    "war"
  ],
  "categories": [],
  "sitemap_lastmod": "2025-06-23T16:19:17+00:00"
}