{
  "url": "https://voxday.net/2016/06/30/a-game-of-thrones-rounding-curve/",
  "scraped_at": "2025-12-17T18:03:43.113782",
  "title": "A Game of Thrones: rounding the curve",
  "date_display": "June 30, 2016",
  "date_iso": "2016-06-30T12:00:00+00:00",
  "date_from_url": "2016-06-30",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>With the end of season six, A Game of Thrones is now approaching the final stretch, and indeed, it does appear to be increasing its pace now that the finish line is in sight. Since those who haven’t seen the most recent season will probably prefer we avoid any spoilers at the top, I shall begin by linking to a self-described demographics nerd’s article on <a href=\"https://medium.com/migration-issues/westeros-is-poorly-designed-3b01cf5cdcaf#.15vfzx3e2\">the intrinsic absurdity of Westeros</a>:</p><blockquote class=\"tr_bq\"><p> Westeros is an interesting setting for lots of reasons: characters, plot, writing, the fact that there’s a high-production-value HBO series, take your pick. There are lots of reasons for it to be popular or to capture interest. But what bothers me, as a really picky nerd, is when people think that it’s a particularly well-crafted setting. It is not. Westeros is shoddily assembled as far as political, cultural, or demographic realism goes. There is too much dynastic stability, too little cultural, linguistic, and ethnic diversity, the basic size of the world seems to change to fit the immediate exigencies of the plot, the cities and armies are implausibly large in many cases, and even careful analysis makes it hard to determine even a wide ballpark for population. None of these criticisms matter in a setting not trading on its claims to a kind of “realism.” But for a setting whose market value in some sense depends on its “realism,” yeah, it’s an issue.</p></blockquote><p>Don’t continue past the jump if you don’t wish to encounter spoilers.</p><p><a name=\"more\"></a><br> The interesting thing about the most recent season, of course, is the fact that it had to venture completely beyond the territory of the published books in Martin’s epic series. This was both good and bad, in that at times the producers seemed to have freed themselves from some of Martin’s idiosyncracies, while at others, they did so only to resort to clumsy Hollywood cliches that were even worse.</br></p><p>For example, the second-to-last episode was a painful exercise in grrl power combined with multiple stupidities so epic that I almost concluded the only reasonable way to bring the series to a just end was to go full SJW and full meta, have Danerys marry Yara under canopy of rainbow banners, then have Tyrion mount the stage and break the fourth wall to declare “love wins!” If nothing else, it would have made me laugh to see the show end with a bang by not merely jumping the shark, but going into orbit over it.</p><p>And then, somehow, the season was salvaged by the last episode, with Cersei wreaking astonishing havoc on her domestic enemies, only to fail in her goals yet again due to her total failure to understand anything about other people, even the people she loves most. Cersei is a truly great character, a genuinely great villainess, whose ruthlessness is consistently undermined by her pride and her narcissism.</p><p>(Sure, the unnecessary drama was ridiculous, with the Sparrow being stabbed, but left to live, so that he could crawl close to the candles, but not soon enough to extinguish them. One thing I increasingly dislike about the producers is their addiction to cheap and unconvincing drama. Trust the story, gentlemen, trust the story!)</p><p>King Tomlin’s suicide was even more shocking than the wildfire bombing, but it was entirely in character, as his despair at losing his wife was magnified by his knowledge that he would never escape the control of his ruthless mother, and by his guilt at the murder of the High Sparrow and the religious hierarchy. It will be interesting to see if the people will revolt; I doubt it, but historically, that would be the most probable outcome. The analogy is flawed, but it reminded me a little of the St. Bartholomew’s Day massacre, which was, at least traditionally, also believed to have been instigated by a queen.</p><p>Only the scene between Danerys and her lover, Daario Naharis, was on the lame side; let’s face it, he’s coming out of it rather well for a mercenary captain, seeing as Mereen is being turned over to him for an indefinite period. Whether he loves her or not, the man is a mercenary, and frankly, it would have been more in character for him to fake dismay at being left behind, then cheerfully return to a chamber full of Mereen beauties. Regardless, the invasion fleet with the dragons flying over them was an awesome sight.</p><p>It was also interesting to note that Sansa came out and admitted what had only been conjectured after last week’s lunacy; she had known all along that the Knights of the Vale were on their way. Yes, Sansa, you really <i>should</i> have told your brother and his commanders that while they were planning their little battle. It was, to put it mildly, <i>pertinent</i>. The entire setup was, as I and many others correctly surmised, an idiot plot to set up some artificial drama to cap off the equally idiotic battle between Stark and Bolton.</p><p>The Arya plot, too, was overwrought, but at least its excessive drama was a nod to classical mythology, specifically, King Tantalus of Phrygia being served his son Pelops in a pie.</p><p>Now it looks as if everything is being set up for Danerys to defeat Cersei, join Jon in fighting the White Walkers, and just when defeat appears imminent, the Three-Eyed Raven figures out how to break the spell and magically destroy them all in the nick of time. If the story was left up to the producers, that would be a safe assumption, which would presumably end with the marriage of Jon to Daneyris. But given Rape Rape’s continued involvement, I wouldn’t entirely count out the possibility that winter triumphs over all.</p><p>That, I have to say, would make for a much more interesting end to the saga.</p></div>",
  "content_text": "With the end of season six, A Game of Thrones is now approaching the final stretch, and indeed, it does appear to be increasing its pace now that the finish line is in sight. Since those who haven’t seen the most recent season will probably prefer we avoid any spoilers at the top, I shall begin by linking to a self-described demographics nerd’s article on\nthe intrinsic absurdity of Westeros\n:\nWesteros is an interesting setting for lots of reasons: characters, plot, writing, the fact that there’s a high-production-value HBO series, take your pick. There are lots of reasons for it to be popular or to capture interest. But what bothers me, as a really picky nerd, is when people think that it’s a particularly well-crafted setting. It is not. Westeros is shoddily assembled as far as political, cultural, or demographic realism goes. There is too much dynastic stability, too little cultural, linguistic, and ethnic diversity, the basic size of the world seems to change to fit the immediate exigencies of the plot, the cities and armies are implausibly large in many cases, and even careful analysis makes it hard to determine even a wide ballpark for population. None of these criticisms matter in a setting not trading on its claims to a kind of “realism.” But for a setting whose market value in some sense depends on its “realism,” yeah, it’s an issue.\nDon’t continue past the jump if you don’t wish to encounter spoilers.\nThe interesting thing about the most recent season, of course, is the fact that it had to venture completely beyond the territory of the published books in Martin’s epic series. This was both good and bad, in that at times the producers seemed to have freed themselves from some of Martin’s idiosyncracies, while at others, they did so only to resort to clumsy Hollywood cliches that were even worse.\nFor example, the second-to-last episode was a painful exercise in grrl power combined with multiple stupidities so epic that I almost concluded the only reasonable way to bring the series to a just end was to go full SJW and full meta, have Danerys marry Yara under canopy of rainbow banners, then have Tyrion mount the stage and break the fourth wall to declare “love wins!” If nothing else, it would have made me laugh to see the show end with a bang by not merely jumping the shark, but going into orbit over it.\nAnd then, somehow, the season was salvaged by the last episode, with Cersei wreaking astonishing havoc on her domestic enemies, only to fail in her goals yet again due to her total failure to understand anything about other people, even the people she loves most. Cersei is a truly great character, a genuinely great villainess, whose ruthlessness is consistently undermined by her pride and her narcissism.\n(Sure, the unnecessary drama was ridiculous, with the Sparrow being stabbed, but left to live, so that he could crawl close to the candles, but not soon enough to extinguish them. One thing I increasingly dislike about the producers is their addiction to cheap and unconvincing drama. Trust the story, gentlemen, trust the story!)\nKing Tomlin’s suicide was even more shocking than the wildfire bombing, but it was entirely in character, as his despair at losing his wife was magnified by his knowledge that he would never escape the control of his ruthless mother, and by his guilt at the murder of the High Sparrow and the religious hierarchy. It will be interesting to see if the people will revolt; I doubt it, but historically, that would be the most probable outcome. The analogy is flawed, but it reminded me a little of the St. Bartholomew’s Day massacre, which was, at least traditionally, also believed to have been instigated by a queen.\nOnly the scene between Danerys and her lover, Daario Naharis, was on the lame side; let’s face it, he’s coming out of it rather well for a mercenary captain, seeing as Mereen is being turned over to him for an indefinite period. Whether he loves her or not, the man is a mercenary, and frankly, it would have been more in character for him to fake dismay at being left behind, then cheerfully return to a chamber full of Mereen beauties. Regardless, the invasion fleet with the dragons flying over them was an awesome sight.\nIt was also interesting to note that Sansa came out and admitted what had only been conjectured after last week’s lunacy; she had known all along that the Knights of the Vale were on their way. Yes, Sansa, you really\nshould\nhave told your brother and his commanders that while they were planning their little battle. It was, to put it mildly,\npertinent\n. The entire setup was, as I and many others correctly surmised, an idiot plot to set up some artificial drama to cap off the equally idiotic battle between Stark and Bolton.\nThe Arya plot, too, was overwrought, but at least its excessive drama was a nod to classical mythology, specifically, King Tantalus of Phrygia being served his son Pelops in a pie.\nNow it looks as if everything is being set up for Danerys to defeat Cersei, join Jon in fighting the White Walkers, and just when defeat appears imminent, the Three-Eyed Raven figures out how to break the spell and magically destroy them all in the nick of time. If the story was left up to the producers, that would be a safe assumption, which would presumably end with the marriage of Jon to Daneyris. But given Rape Rape’s continued involvement, I wouldn’t entirely count out the possibility that winter triumphs over all.\nThat, I have to say, would make for a much more interesting end to the saga.",
  "tags": [
    "books",
    "movies"
  ],
  "categories": [],
  "sitemap_lastmod": "2016-06-30T11:00:00+00:00"
}