{
  "url": "https://voxday.net/2016/06/04/an-interesting-theory/",
  "scraped_at": "2025-12-17T18:00:19.776336",
  "title": "An interesting theory",
  "date_display": "June 4, 2016",
  "date_iso": "2016-06-04T12:00:00+00:00",
  "date_from_url": "2016-06-04",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>Kit Marlowe’s murder may have been <a href=\"https://www.prlog.org/12561790-film-producer-reveals-truth-about-christopher-marlowes-death.html\">a royal hit</a>:</p><blockquote class=\"tr_bq\"><p> After years of intensive research Francis Hamit is satisfied that he<br> knows exactly how and why the Elizabethan poet and playwright<br> Christopher Marlowe died on May 30th, 1593.</br></br></p><p>“It was a hit,” Hamit<br> said, “A political assassination for reasons of state, ordered by Queen<br> Elizabeth herself. Marlowe professed atheism, which would have been no<br> big deal if he had not been the most famous and popular playwright of<br> the Elizabethan stage. His fame meant that the deed had to be done<br> secretly. Marlowe was also one of her spies and worked for the Secret<br> Service under Sir Francis Walsingham and Sir Robert Cecil. The other men<br> in the room with Marlowe at the time of his death were all friends of<br> his and long-time agents for the Crown.”</br></br></br></br></br></br></br></br></p><p>“Marlowe infiltrated the<br> Jesuit Seminary at Rhiems as a spy in 1585, and probably did other<br> missions. He was part of Sir Walter Raleigh’s group of freethinkers, the<br> so-called ‘School of the Night,’ and gave a lecture about atheism. His<br> former chambermate and lover Thomas Kyd was arrested for having<br> atheistic literature and revealed under torture that the documents were<br> Marlowe’s. Additional accusations from informers got Marlowe arrested by<br> the Privy Council and he was under investigation and restrictions when<br> he died.”</br></br></br></br></br></br></br></br></p></blockquote><p>I have no idea if it is true or not, but I suspect there is a pretty good novel to be found in the notion.</p></div>",
  "content_text": "Kit Marlowe’s murder may have been\na royal hit\n:\nAfter years of intensive research Francis Hamit is satisfied that he\nknows exactly how and why the Elizabethan poet and playwright\nChristopher Marlowe died on May 30th, 1593.\n“It was a hit,” Hamit\nsaid, “A political assassination for reasons of state, ordered by Queen\nElizabeth herself. Marlowe professed atheism, which would have been no\nbig deal if he had not been the most famous and popular playwright of\nthe Elizabethan stage. His fame meant that the deed had to be done\nsecretly. Marlowe was also one of her spies and worked for the Secret\nService under Sir Francis Walsingham and Sir Robert Cecil. The other men\nin the room with Marlowe at the time of his death were all friends of\nhis and long-time agents for the Crown.”\n“Marlowe infiltrated the\nJesuit Seminary at Rhiems as a spy in 1585, and probably did other\nmissions. He was part of Sir Walter Raleigh’s group of freethinkers, the\nso-called ‘School of the Night,’ and gave a lecture about atheism. His\nformer chambermate and lover Thomas Kyd was arrested for having\natheistic literature and revealed under torture that the documents were\nMarlowe’s. Additional accusations from informers got Marlowe arrested by\nthe Privy Council and he was under investigation and restrictions when\nhe died.”\nI have no idea if it is true or not, but I suspect there is a pretty good novel to be found in the notion.",
  "tags": [
    "history"
  ],
  "categories": [],
  "sitemap_lastmod": "2016-06-04T11:00:00+00:00"
}