{
  "url": "https://voxday.net/2016/06/19/another-free-trade-debate/",
  "scraped_at": "2025-12-17T18:02:17.209492",
  "title": "Another free trade debate",
  "date_display": "June 19, 2016",
  "date_iso": "2016-06-19T15:30:00+00:00",
  "date_from_url": "2016-06-19",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>This exchange with Louise Mensch on Twitter vastly amused me. In my book, it is right up there with the digression into sexbots in the James Miller debate:</p><blockquote class=\"tr_bq\"><p> Louise Mensch ‏@LouiseMensch<br> The idea you need free movement of people for a free market is a lie. We have free trade with USA without free movement</br></p><p>Supreme Dark Lord ‏@voxday<br> It’s not a lie. Read Mises: the same arguments apply. For full benefits of free trade, free labor mobility is required.</br></p><p>Louise Mensch ‏@LouiseMensch<br> no; we presently enjoy free trade with America no free movement between us either way</br></p><p>Supreme Dark Lord ‏@voxday<br> You can see exactly how NOT free UK trade with USA is here. Complete with tariff codes and rates.</br></p><p>Louise Mensch ‏@LouiseMensch<br> live animals?</br></p><p>Supreme Dark Lord ‏@voxday<br> 3.8 percent on the sale of domestic rabbits, to be precise. Just one of thousands of examples. Demonstrably unfree trade.</br></p><p>Louise Mensch ‏@LouiseMensch<br> er… I honestly don’t think most people are going to count bees and rabbits Vox</br></p><p>Supreme Dark Lord ‏@voxday<br> It’s 5.7% on nuclear reactors. Would most people count them?</br></p></blockquote><p>In fact, the USA and UK have neither free trade nor free labor mobility.</p></div>",
  "content_text": "This exchange with Louise Mensch on Twitter vastly amused me. In my book, it is right up there with the digression into sexbots in the James Miller debate:\nLouise Mensch ‏@LouiseMensch\nThe idea you need free movement of people for a free market is a lie. We have free trade with USA without free movement\nSupreme Dark Lord ‏@voxday\nIt’s not a lie. Read Mises: the same arguments apply. For full benefits of free trade, free labor mobility is required.\nLouise Mensch ‏@LouiseMensch\nno; we presently enjoy free trade with America no free movement between us either way\nSupreme Dark Lord ‏@voxday\nYou can see exactly how NOT free UK trade with USA is here. Complete with tariff codes and rates.\nLouise Mensch ‏@LouiseMensch\nlive animals?\nSupreme Dark Lord ‏@voxday\n3.8 percent on the sale of domestic rabbits, to be precise. Just one of thousands of examples. Demonstrably unfree trade.\nLouise Mensch ‏@LouiseMensch\ner… I honestly don’t think most people are going to count bees and rabbits Vox\nSupreme Dark Lord ‏@voxday\nIt’s 5.7% on nuclear reactors. Would most people count them?\nIn fact, the USA and UK have neither free trade nor free labor mobility.",
  "tags": [
    "debate",
    "free trade"
  ],
  "categories": [],
  "sitemap_lastmod": "2016-06-19T14:30:00+00:00"
}