{
  "url": "https://voxday.net/2016/06/16/dont-talk-to-media-3/",
  "scraped_at": "2025-12-17T18:01:47.846355",
  "title": "Don’t talk to the media!",
  "date_display": "June 16, 2016",
  "date_iso": "2016-06-16T12:00:00+00:00",
  "date_from_url": "2016-06-16",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>In light of my ridiculous experience with <i>Wired</i> and after seeing how multiple media outlets turned to George RR Martin and John Scalzi to ask them to interpret my actions, I now turn down most media requests. I do so literally every week; I just turned down two yesterday alone. The media is not in the business of reporting the news, they are in the business of selling their masters’ Narrative.</p><p>In <a href=\"http://amzn.to/1YqHxLE\"><b><i>Free Speech Isn’t Free</i></b></a>, Roosh explains that he learned the same lesson from the Canadian media.</p><blockquote class=\"tr_bq\"><p> I began to understand that the purpose of the mainstream media is to push a specific agenda while concealing the strength or victories of anyone who fights against that agenda. Montreal showed me how deliberate and pre-meditated it all was. There was little use talking to the media further when I already had my own effective media channels, so in Toronto I would refuse nearly all of the two dozen interview requests I received.</p><p>The mainstream media, especially the biggest outlets, are crypto-activist organizations that share nearly complete ideological overlap with mega-rich globalists and the most degenerate members of society, who help those globalists keep power and wealth by destroying tradition, the family unit, and nationalism. Social justice warriors are little Frankenstein creations of billionaires. That was hard for me to believe at first, but to see the machine whirl to action and be turned against me offered a confirmation that will stay with me for the rest of my life. The enemy is clear to me now. </p></blockquote><p>The key phrase there is “concealing the strength or victories of anyone who fights against that agenda”. That’s why the media comes running as soon as anyone starts to look like a threat, to shape the Narrative about them and minimize them. The media is not a microphone, it is a combination muzzle and fun house mirror. One gun shop owner <a href=\"http://bayourenaissanceman.blogspot.ch/2016/06/another-lying-journalist-is-exposed.html\">learned why you don’t talk to them</a> the hard way:</p><blockquote class=\"tr_bq\"><p> Yesterday the man in this video from the NY Daily News called and asked if he could come and interview us about the basic principles of how an AR-15 works. We acknowledged his offer so that we could prove that an AR-15 is indeed a great and safe weapon as stated in the video. After the video was filmed there was another Q&amp;A type conversation on how things work in other countries, what are some of the things others believe would be a step into the right direction of gun control. To our knowledge we did not know that Mr. Kuntzman would completely turn things around and make our establishment look like one of anti-gun advocates.</p><p>We have received dozens of phone from all over the country in regards to the article. Many of these callers expressed disgust with the article and told us to stay away from the media. I can assure everyone that we do not support mental health screenings like they do in Europe and we don’t think that government officials should take away guns from people as it was portrayed in the article. Currently we are doing everything we can to take this article down because after reading it we are just as disgusted about it as all of you are. Our team here at Double Tap would like to sincerely apologize for the misunderstanding and report that we are doing everything in our power to get this article removed.</p><p>I implore all of our supporters to share our apology with everyone in order to help defend ourselves from the media who is doing anything in their power to blemish the face of all gun owners and attempting to add more rule to the fire of the attempt of the liberal gun-grabbing agenda.To those that are writing negative reviews about us, please understand we had no intentions of having this article cause such an issue, nor intentions of us looking like anti gun advocates but, to educate which in turn did the complete opposite due to Mr. Kuntzman. If anyone has anymore questions or concerns please feel free to come in or call us we will gladly discuss this issue with you.</p></blockquote><p>Now, I do make occasional exceptions depending upon the journalist, the publication, and the specific situation. But in general, I now reject phone interview requests out of hand. If I agree to answer questions, I do it in writing and I keep the answers short enough that they cannot usefully edit them.  I do not ever do television; even if I was a major media figure I would not do any television that was not live, as the TV editing is particularly deceptive and dishonest.</p></div>",
  "content_text": "In light of my ridiculous experience with\nWired\nand after seeing how multiple media outlets turned to George RR Martin and John Scalzi to ask them to interpret my actions, I now turn down most media requests. I do so literally every week; I just turned down two yesterday alone. The media is not in the business of reporting the news, they are in the business of selling their masters’ Narrative.\nIn\nFree Speech Isn’t Free\n, Roosh explains that he learned the same lesson from the Canadian media.\nI began to understand that the purpose of the mainstream media is to push a specific agenda while concealing the strength or victories of anyone who fights against that agenda. Montreal showed me how deliberate and pre-meditated it all was. There was little use talking to the media further when I already had my own effective media channels, so in Toronto I would refuse nearly all of the two dozen interview requests I received.\nThe mainstream media, especially the biggest outlets, are crypto-activist organizations that share nearly complete ideological overlap with mega-rich globalists and the most degenerate members of society, who help those globalists keep power and wealth by destroying tradition, the family unit, and nationalism. Social justice warriors are little Frankenstein creations of billionaires. That was hard for me to believe at first, but to see the machine whirl to action and be turned against me offered a confirmation that will stay with me for the rest of my life. The enemy is clear to me now.\nThe key phrase there is “concealing the strength or victories of anyone who fights against that agenda”. That’s why the media comes running as soon as anyone starts to look like a threat, to shape the Narrative about them and minimize them. The media is not a microphone, it is a combination muzzle and fun house mirror. One gun shop owner\nlearned why you don’t talk to them\nthe hard way:\nYesterday the man in this video from the NY Daily News called and asked if he could come and interview us about the basic principles of how an AR-15 works. We acknowledged his offer so that we could prove that an AR-15 is indeed a great and safe weapon as stated in the video. After the video was filmed there was another Q&A type conversation on how things work in other countries, what are some of the things others believe would be a step into the right direction of gun control. To our knowledge we did not know that Mr. Kuntzman would completely turn things around and make our establishment look like one of anti-gun advocates.\nWe have received dozens of phone from all over the country in regards to the article. Many of these callers expressed disgust with the article and told us to stay away from the media. I can assure everyone that we do not support mental health screenings like they do in Europe and we don’t think that government officials should take away guns from people as it was portrayed in the article. Currently we are doing everything we can to take this article down because after reading it we are just as disgusted about it as all of you are. Our team here at Double Tap would like to sincerely apologize for the misunderstanding and report that we are doing everything in our power to get this article removed.\nI implore all of our supporters to share our apology with everyone in order to help defend ourselves from the media who is doing anything in their power to blemish the face of all gun owners and attempting to add more rule to the fire of the attempt of the liberal gun-grabbing agenda.To those that are writing negative reviews about us, please understand we had no intentions of having this article cause such an issue, nor intentions of us looking like anti gun advocates but, to educate which in turn did the complete opposite due to Mr. Kuntzman. If anyone has anymore questions or concerns please feel free to come in or call us we will gladly discuss this issue with you.\nNow, I do make occasional exceptions depending upon the journalist, the publication, and the specific situation. But in general, I now reject phone interview requests out of hand. If I agree to answer questions, I do it in writing and I keep the answers short enough that they cannot usefully edit them.  I do not ever do television; even if I was a major media figure I would not do any television that was not live, as the TV editing is particularly deceptive and dishonest.",
  "tags": [
    "media"
  ],
  "categories": [],
  "sitemap_lastmod": "2016-06-16T11:00:00+00:00"
}