{
  "url": "https://voxday.net/2016/06/30/dunning-kruger-gamma-aaron/",
  "scraped_at": "2025-12-17T18:03:46.407349",
  "title": "Dunning-Kruger + Gamma = Aaron",
  "date_display": "June 30, 2016",
  "date_iso": "2016-06-30T17:30:00+00:00",
  "date_from_url": "2016-06-30",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>The most intellectually challenged gamma at File 770, much to <i>everyone’s</i> surprise, doubles down.</p><blockquote class=\"tr_bq\"><p> I disagree. I think I’m very smart. And you’re dumb. I’m easily smarter than most people on this blog, including Vox. Vox said something pretty stupid, and instead of having the balls to man up, he doubled down. I’m not impressed. At all.</p></blockquote><p><i>Easily</i> smarter… than people with confirmed +3SD and +4SD IQs. I have no doubt whatsoever that he believes that, as he’s an example of both Dunning-Kruger Syndrome and Vox’s First Law in action.</p><p>What’s particularly funny about this is that he’s referring to <a href=\"http://www.milobookclub.com/2016/06/26/the-decline-of-entrepreneurship-in/\">this post</a>. Notice how much of it is devoted to intelligence and immigration. Aaron, as wounded Gammas are wont to do, leaped to attack one minor point that he interpreted to be in error, then attempted to build an entire edifice of discredit and disqualify upon it, even going so far as to claim, on that basis, that “You always double down. I’ve never seen you concede any point at any time anywhere.”</p><p>No doubt this would confuse James Miller, Robert Murphy, and Thomas Woods, to say nothing of Ian Fletcher, to whom I have conceded considerably more than just a single point. Some other readers attempted to explain to Aaron that he’d missed the salient point, which he not only ended up rejecting but also claims I did not mean despite the readily available evidence to the contrary.</p><blockquote class=\"tr_bq\"><p> So, the immigration of stupid people has created conditions that make the super smart innovators have less babies, and that many of the super smart who have babies do so with Mexican fruit pickers and Somali gangsters and such like.</p><p>THAT’S what Vox meant when he said the immigration of stupid people has led to a lower average national IQ, and thus fewer smart people to be entrepreneurs.</p><p>If you SERIOUSLY think this is what Vox meant, then that’s a perfectly coherent position, although to my mind, not plausible.</p><p>But I for one, don’t think that’s what vox meant.</p></blockquote><p><i>Of course</i> it is <i>part</i> of what Vox meant, though only part, as should be obvious to anyone who is familiar with my writing about feminism’s effect on declining Western intelligence. One wonders what else I could have possibly meant, considering the following:<br> <i><br/></i><br> <i>As the average IQ of the population declines, the number of members of the cognitive elite being born similarly decline. If the smart population mixes with the less intelligent immigrants, or even fails to breed at replacement levels, the ABSOLUTE number of smart people will decline. Do either of those scenarios happen to apply here?</i></br></br></p><p>Of course, both scenarios do. Aaron’s assertion of my “error” relied upon no native-immigrant intermixing and non-declining birthrates among the native cognitive elite, both false assumptions. What Aaron is exhibiting, in addition to the usual gamma “You are wrong and stupid due to incorrect assumptions on my part”, is typical SJW reasoning in action.They are binary thinkers, which renders complexity a complete mystery to them. That’s why they think that “well, it’s more complex than that” is a sufficient rebuttal, because the possibility of unraveling the complexities and successfully accounting for more than one influential factor is not only beyond their capabilities, but beyond their actions.</p><p>Notice how the SJW ends up relying upon his interpretation of what he imagines the other person to be thinking so that he can himself the victor, regardless of what every other observer concludes. The Secret King triumphs again, if only in his own head. But usually, the gamma doesn’t pay enough attention to what others are saying <a href=\"https://voxday.blogspot.com/2016/06/the-mask-comes-off.html#c7151652088599308686\">to even understand them correctly</a>.</p><blockquote class=\"tr_bq\"><p> But isn’t that exactly the point? They’re in a position of weakness, so they’re using bluster and bravado to regain momentum. Thats what I said. File this under “making my point for me again” dpt. You’re good at that, vox.</p></blockquote><p>No, it’s not exactly the point. Aaron failed to understand that I was correcting his statement that <i>“pushing through their agenda in an even more ruthless and uncompromising way <b>is the best tactic </b>they have to deal with a moment of weakness”</i>.  Yes, we both agree that the EU elite is in a position of weakness, which is precisely why bluster and bravado is not their best tactic if they wish the EU to survive. To the contrary, it’s a very risky bluff, which the Euroskeptics should call and exploit to the full, in order to destroy the entire edifice.</p><p>The sad thing about the gamma is that he neither knows himself nor his enemies. That is why he is, per Sun Tzu, destined for repeated failure:</p><blockquote class=\"tr_bq\"><p> YOU’RE answering ME, but it is *I* who engage in the detestable gamma behavior of never letting things go or lashing back – and since when are you known for letting go or refraining from lashing back? I get it. When you do it, it’s super duper genius rhetoric alpha Aristotle stuff, when anyone else, why, it’s a gamma. </p></blockquote><p>Yes, you are indeed a gamma male. No, you clearly don’t get it. Let’s consider the facts.</p><ul><li>I very seldom write about Aaron or pay any attention to his activities. Even when I did, recently, he was not the topic at hand. The battle on<i> A Game of Thrones</i> was.</li><li>Aaron frequently opines about me and my various activities, as a search of File 770’s comments will demonstrate.</li><li>Aaron is here commenting repeatedly on my blog. That’s fine, but the point is, he came here to do it because he is still feeling butthurt about his risible defense of the LEEEROY JENKINS strategy in the Stark-Bolton battle. His response was so predictable that another game-savvy reader even predicted it.</li><li>I often respond to critics who comment on this blog. That was not a unique event.</li><li>I let go of most attacks directed at me. As numerous critics who comment here can testify, I don’t even reply to most of them, let alone lash back at all of them. Moreover, I am quite willing to let bygones be bygones, as numerous commenters with whom I have had differences in the past can also testify.</li></ul><p>Unlike the gamma, I don’t dwell upon past injuries and insults, licking my wounds and biding my time until an opportunity to lash back presents itself. Nor do I feel any need to reinterpret past defeats as victories, or pretend to myself and others that my failures are successes. I don’t pretend to understand why gammas behave in this way, but I have observed the pattern of behavior often enough to be able to reliably predict it. Since most male SF-SJWs are gammas, it’s not hard to anticipate their reactions to any given stimulus.</p><p>UPDATE: Oh dear. Timing, it seems, is everything.</p><blockquote class=\"tr_bq\"><p> Aaron: <i>It is masculine to admit when you’re wrong. Just very few people do it, and certainly not vox.</i></p><p>Two hours ago on Twitter:</p><p>Supreme Dark Lord ‏@voxday<br>Daikatana was, like my Rebel Moon designs, too ambitious for its own good.</br></p><p>John Romero ‏@romero<br>it wasn’t an ambitious design that was Daikatana’s problem</br></p><p>Supreme Dark Lord ‏@voxday<br>I stand corrected.</br></p></blockquote></div>",
  "content_text": "The most intellectually challenged gamma at File 770, much to\neveryone’s\nsurprise, doubles down.\nI disagree. I think I’m very smart. And you’re dumb. I’m easily smarter than most people on this blog, including Vox. Vox said something pretty stupid, and instead of having the balls to man up, he doubled down. I’m not impressed. At all.\nEasily\nsmarter… than people with confirmed +3SD and +4SD IQs. I have no doubt whatsoever that he believes that, as he’s an example of both Dunning-Kruger Syndrome and Vox’s First Law in action.\nWhat’s particularly funny about this is that he’s referring to\nthis post\n. Notice how much of it is devoted to intelligence and immigration. Aaron, as wounded Gammas are wont to do, leaped to attack one minor point that he interpreted to be in error, then attempted to build an entire edifice of discredit and disqualify upon it, even going so far as to claim, on that basis, that “You always double down. I’ve never seen you concede any point at any time anywhere.”\nNo doubt this would confuse James Miller, Robert Murphy, and Thomas Woods, to say nothing of Ian Fletcher, to whom I have conceded considerably more than just a single point. Some other readers attempted to explain to Aaron that he’d missed the salient point, which he not only ended up rejecting but also claims I did not mean despite the readily available evidence to the contrary.\nSo, the immigration of stupid people has created conditions that make the super smart innovators have less babies, and that many of the super smart who have babies do so with Mexican fruit pickers and Somali gangsters and such like.\nTHAT’S what Vox meant when he said the immigration of stupid people has led to a lower average national IQ, and thus fewer smart people to be entrepreneurs.\nIf you SERIOUSLY think this is what Vox meant, then that’s a perfectly coherent position, although to my mind, not plausible.\nBut I for one, don’t think that’s what vox meant.\nOf course\nit is\npart\nof what Vox meant, though only part, as should be obvious to anyone who is familiar with my writing about feminism’s effect on declining Western intelligence. One wonders what else I could have possibly meant, considering the following:\nAs the average IQ of the population declines, the number of members of the cognitive elite being born similarly decline. If the smart population mixes with the less intelligent immigrants, or even fails to breed at replacement levels, the ABSOLUTE number of smart people will decline. Do either of those scenarios happen to apply here?\nOf course, both scenarios do. Aaron’s assertion of my “error” relied upon no native-immigrant intermixing and non-declining birthrates among the native cognitive elite, both false assumptions. What Aaron is exhibiting, in addition to the usual gamma “You are wrong and stupid due to incorrect assumptions on my part”, is typical SJW reasoning in action.They are binary thinkers, which renders complexity a complete mystery to them. That’s why they think that “well, it’s more complex than that” is a sufficient rebuttal, because the possibility of unraveling the complexities and successfully accounting for more than one influential factor is not only beyond their capabilities, but beyond their actions.\nNotice how the SJW ends up relying upon his interpretation of what he imagines the other person to be thinking so that he can himself the victor, regardless of what every other observer concludes. The Secret King triumphs again, if only in his own head. But usually, the gamma doesn’t pay enough attention to what others are saying\nto even understand them correctly\n.\nBut isn’t that exactly the point? They’re in a position of weakness, so they’re using bluster and bravado to regain momentum. Thats what I said. File this under “making my point for me again” dpt. You’re good at that, vox.\nNo, it’s not exactly the point. Aaron failed to understand that I was correcting his statement that\n“pushing through their agenda in an even more ruthless and uncompromising way\nis the best tactic\nthey have to deal with a moment of weakness”\n.  Yes, we both agree that the EU elite is in a position of weakness, which is precisely why bluster and bravado is not their best tactic if they wish the EU to survive. To the contrary, it’s a very risky bluff, which the Euroskeptics should call and exploit to the full, in order to destroy the entire edifice.\nThe sad thing about the gamma is that he neither knows himself nor his enemies. That is why he is, per Sun Tzu, destined for repeated failure:\nYOU’RE answering ME, but it is *I* who engage in the detestable gamma behavior of never letting things go or lashing back – and since when are you known for letting go or refraining from lashing back? I get it. When you do it, it’s super duper genius rhetoric alpha Aristotle stuff, when anyone else, why, it’s a gamma.\nYes, you are indeed a gamma male. No, you clearly don’t get it. Let’s consider the facts.\nI very seldom write about Aaron or pay any attention to his activities. Even when I did, recently, he was not the topic at hand. The battle on\nA Game of Thrones\nwas.\nAaron frequently opines about me and my various activities, as a search of File 770’s comments will demonstrate.\nAaron is here commenting repeatedly on my blog. That’s fine, but the point is, he came here to do it because he is still feeling butthurt about his risible defense of the LEEEROY JENKINS strategy in the Stark-Bolton battle. His response was so predictable that another game-savvy reader even predicted it.\nI often respond to critics who comment on this blog. That was not a unique event.\nI let go of most attacks directed at me. As numerous critics who comment here can testify, I don’t even reply to most of them, let alone lash back at all of them. Moreover, I am quite willing to let bygones be bygones, as numerous commenters with whom I have had differences in the past can also testify.\nUnlike the gamma, I don’t dwell upon past injuries and insults, licking my wounds and biding my time until an opportunity to lash back presents itself. Nor do I feel any need to reinterpret past defeats as victories, or pretend to myself and others that my failures are successes. I don’t pretend to understand why gammas behave in this way, but I have observed the pattern of behavior often enough to be able to reliably predict it. Since most male SF-SJWs are gammas, it’s not hard to anticipate their reactions to any given stimulus.\nUPDATE: Oh dear. Timing, it seems, is everything.\nAaron:\nIt is masculine to admit when you’re wrong. Just very few people do it, and certainly not vox.\nTwo hours ago on Twitter:\nSupreme Dark Lord ‏@voxday\nDaikatana was, like my Rebel Moon designs, too ambitious for its own good.\nJohn Romero ‏@romero\nit wasn’t an ambitious design that was Daikatana’s problem\nSupreme Dark Lord ‏@voxday\nI stand corrected.",
  "tags": [
    "immigration",
    "SJW",
    "trainwreck"
  ],
  "categories": [],
  "sitemap_lastmod": "2016-06-30T16:30:00+00:00"
}