{
  "url": "https://voxday.net/2016/06/15/forget-tolerance/",
  "scraped_at": "2025-12-17T18:01:44.196549",
  "title": "Forget tolerance",
  "date_display": "June 15, 2016",
  "date_iso": "2016-06-15T18:30:00+00:00",
  "date_from_url": "2016-06-15",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>Steve Sailer observes the media handwringing about the fact that Donald Trump <a href=\"http://takimag.com/article/anarchy_in_the_usa_steve_sailer/print#axzz4BdsWtWAe\">keeps being proved correct</a> by events:</p><blockquote class=\"tr_bq\"><p> Trump’s pragmatism was also calibrated to drive mad with rage the bipartisan Washington establishment that has grown rich off the conventional wisdom of Invade the World/Invite the World. The New York Times, for example, threw aside all pretense of objectivity, “reporting”:</p><p>Mr. Trump’s speech…represented an extraordinary break from the longstanding rhetorical norms of American presidential nominees. But if his language more closely resembled a European nationalist’s than a mainstream Republican’s, he was wagering that voters are stirred more by their fears of Islamic terrorism than any concerns they may have about his flouting traditions of tolerance and respect for religious diversity.</p></blockquote><p>The #AltRight doesn’t give a quantum of a damn about “traditions of tolerance and respect for religious diversity”. We’ll do more than “flout” those traditions, we’ll fillet them before we incinerate the remains. We respect one religion, Christianity, even if we do not subscribe to it, because it is the basis of the Western Civilization formerly known as Christendom.</p><p>We’ve been told for decades that the Constitution is either a) a living document, or b) a meaningless piece of paper. Fine. We accept that. And now we will interpret every word however it happens to suit us at the moment, and we will consider ourselves as bound by it as we would by any other piece of paper used by the American Left in the toilets.</p><p>The old rules are dead. We’ll write the new ones.</p><p>On a personal note, I found it more than a little amusing to see Sailer take a perfectly justified shot at the Proposition Nation idiocy inherent in the concept of poetry as the legal basis for government policy.</p><blockquote class=\"tr_bq\"><p> After all, the fact that everybody in the world has the civil right to immigrate to America is written into the Zeroth Amendment to the Constitution. Granted, it’s not actually a law that any American ever voted on, it’s just an 1883 poem by Zionist Emma Lazarus. But how dare any candidate for president not treat it like holy writ just because it’s all bogus retconning by the New York media?</p></blockquote><p>Don’t feel bad if you fell for it without ever thinking the matter through, as it is admittedly powerful rhetoric to which you were subjected as a child. The emotions, are they not moved? <i>But there is no meaningful information content in rhetoric.</i> And if you still buy into the Proposition Nation concept after its historical basis in retroactive rhyming rhetoric was pointed out to you, well, I’m sorry, but you’re observably an idiot.</p><p>It’s also nice to see the Magic Dirt term being adopted and utilized more widely. After all, as we know, rhetoric matters.</p></div>",
  "content_text": "Steve Sailer observes the media handwringing about the fact that Donald Trump\nkeeps being proved correct\nby events:\nTrump’s pragmatism was also calibrated to drive mad with rage the bipartisan Washington establishment that has grown rich off the conventional wisdom of Invade the World/Invite the World. The New York Times, for example, threw aside all pretense of objectivity, “reporting”:\nMr. Trump’s speech…represented an extraordinary break from the longstanding rhetorical norms of American presidential nominees. But if his language more closely resembled a European nationalist’s than a mainstream Republican’s, he was wagering that voters are stirred more by their fears of Islamic terrorism than any concerns they may have about his flouting traditions of tolerance and respect for religious diversity.\nThe #AltRight doesn’t give a quantum of a damn about “traditions of tolerance and respect for religious diversity”. We’ll do more than “flout” those traditions, we’ll fillet them before we incinerate the remains. We respect one religion, Christianity, even if we do not subscribe to it, because it is the basis of the Western Civilization formerly known as Christendom.\nWe’ve been told for decades that the Constitution is either a) a living document, or b) a meaningless piece of paper. Fine. We accept that. And now we will interpret every word however it happens to suit us at the moment, and we will consider ourselves as bound by it as we would by any other piece of paper used by the American Left in the toilets.\nThe old rules are dead. We’ll write the new ones.\nOn a personal note, I found it more than a little amusing to see Sailer take a perfectly justified shot at the Proposition Nation idiocy inherent in the concept of poetry as the legal basis for government policy.\nAfter all, the fact that everybody in the world has the civil right to immigrate to America is written into the Zeroth Amendment to the Constitution. Granted, it’s not actually a law that any American ever voted on, it’s just an 1883 poem by Zionist Emma Lazarus. But how dare any candidate for president not treat it like holy writ just because it’s all bogus retconning by the New York media?\nDon’t feel bad if you fell for it without ever thinking the matter through, as it is admittedly powerful rhetoric to which you were subjected as a child. The emotions, are they not moved?\nBut there is no meaningful information content in rhetoric.\nAnd if you still buy into the Proposition Nation concept after its historical basis in retroactive rhyming rhetoric was pointed out to you, well, I’m sorry, but you’re observably an idiot.\nIt’s also nice to see the Magic Dirt term being adopted and utilized more widely. After all, as we know, rhetoric matters.",
  "tags": [
    "#AltRight",
    "immigration",
    "media"
  ],
  "categories": [],
  "sitemap_lastmod": "2016-06-15T17:30:00+00:00"
}