{
  "url": "https://voxday.net/2016/06/21/free-trade-debate-podcas/",
  "scraped_at": "2025-12-17T18:02:29.020675",
  "title": "Free Trade debate podcast",
  "date_display": "June 21, 2016",
  "date_iso": "2016-06-21T07:45:00+00:00",
  "date_from_url": "2016-06-21",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p><i>Tom Woods has posted <a href=\"http://tomwoods.com/podcast/ep-684-debate-on-free-trade-with-bob-murphy-and-vox-day/\">Episode 684 Debate on Free Trade</a>, with Bob Murphy and Vox Day, on his site. Below is part of my 10-minute presentation opposing the resolution, which stated: </i></p><p><b><i>Free trade is always economically beneficial in the long term,<br> and the more free trade is practiced by a country, the higher the<br> standard of living of its inhabitants will be.</br></br></i></b></p><p>The Japanese novelist Natsume Soseki once wrote: “The memory of having sat at someone’s feet will later make you want to trample him underfoot.” While I have been seated, metaphorically, at the feet of the great Austrian economists for most of my life, I harbor no desire to trample them. I retain genuine affection and respect for the Austrian School of economics.</p><p>However, just as the classical economists eventually gave way to the superior understanding of the Austrians, so Ludwig von Mises and Murray Rothbard will one day be surpassed by the post-Austrian economists of the future. Is that day here yet? I will argue that it is, at least with regards to the doctrine of free trade.</p><p>The world has changed in many ways in the 240 years since Adam Smith triumphed over the mercantilists. The most significant changes, with regard to the topic at hand, concern the mobility of capital, a factor which was not accounted for by either Smith or Ricardo, and the mobility of labor, a factor which was never taken into consideration by Mises or Rothbard.</p><p>Let me first state that I accept Bob’s general terms with regards to both free trade meaning unlimited transactions between domestic and foreign parties, and national wealth being measured on average. I am presenting five arguments against free trade tonight: they are empirical, mathematical, existential, practical, and logical. Given the time constraints, it is not possible to go very deep into any of them, but each of the five represents a very serious and substantial challenge to the claim that free trade makes a nation wealthier in the long term.</p><p>My first argument is empirical. The conventional argument in favor of free trade has changed very little over the centuries, and was repeated this very week in a major essay by Francis Fukuyama in <i>Foreign Affairs</i>. It states:</p><ol><li>International trade has become increasingly free over time.</li><li>Wealth has increased during the same period.</li><li>Therefore, free trade produces wealth.</li></ol><p>Or to put it another way, as Bob did in his excellent textbook, <i>Lessons for a Young Economist</i>, “If we imagine an initial situation of worldwide free trade, and then further imagine that an individual country decided to “protect” its domestic industries and “save jobs” by preventing foreign goods from crossing its borders, its residents would become much poorer.”</p><p>But this is not true. We have considerable evidence that freer global trade does not necessarily make an individual country wealthier. For example, although the free trade in goods has considerably increased over the last 50 years, real wages are lower in the USA than they were 43 years ago. So is the country wealthier? Proponents of free trade often cite growing GDP per capita, and it is true that since 1964, US GDP per capita has risen from $3.5 thousand to $54.6 thousand, a 15-times increase.</p><p>That means the USA is wealthier, right? No, because over the same 50-year period, total US debt per capita has risen 34 times. If your income doubles, but your personal debt goes up by a factor of 4.5, are you wealthier? No, of course not. Your perceived increase in wealth is a mirage.</p><p>Freer trade has clearly not produced greater wealth for America or Americans, but rather, greater indebtedness. This is not to say free trade can never benefit a national economy, but we have clear empirical evidence that in the case of the United States, it has not. Therefore, the resolution is false.</p><p>My second argument against free trade is mathematical. Free trade theory relies, at its core, upon the Law of Supply and Demand. But in <i>Debunking Economics</i>, Steve Keen cites the work of William Gorman, who in 1953 utilized mathematical logic to prove that the Law of Demand does not apply to a market demand curve. It only applies to single individuals, and it is not possible to derive a market demand curve by simply adding together the quantities demanded by all individuals at each price. In other words, the combination of all rational consumer preferences results in an irrational market where lower prices may or may not increase demand.</p><p>This proof has many implications for economics that have not yet been explored, and among the obvious casualties is David Ricardo’s theory of Comparative Advantage. The math literally does not add up. Therefore, the resolution is false.<br> <i><br/></i><br> <i><a href=\"http://tomwoods.com/podcast/ep-684-debate-on-free-trade-with-bob-murphy-and-vox-day/\">Listen to the rest of it there</a>. Brainstorm members will receive a full transcript once it is complete.</i> <i>I should note that Steve Keen informed me that there is a more substantial mathematical case to be made against free trade than the one I presented, but as it was his point and not mine – and frankly, I don’t fully understand it yet – I did not utilize it in the debate. I will devote a separate post to it later.</i></br></br></p></div>",
  "content_text": "Tom Woods has posted\nEpisode 684 Debate on Free Trade\n, with Bob Murphy and Vox Day, on his site. Below is part of my 10-minute presentation opposing the resolution, which stated:\nFree trade is always economically beneficial in the long term,\nand the more free trade is practiced by a country, the higher the\nstandard of living of its inhabitants will be.\nThe Japanese novelist Natsume Soseki once wrote: “The memory of having sat at someone’s feet will later make you want to trample him underfoot.” While I have been seated, metaphorically, at the feet of the great Austrian economists for most of my life, I harbor no desire to trample them. I retain genuine affection and respect for the Austrian School of economics.\nHowever, just as the classical economists eventually gave way to the superior understanding of the Austrians, so Ludwig von Mises and Murray Rothbard will one day be surpassed by the post-Austrian economists of the future. Is that day here yet? I will argue that it is, at least with regards to the doctrine of free trade.\nThe world has changed in many ways in the 240 years since Adam Smith triumphed over the mercantilists. The most significant changes, with regard to the topic at hand, concern the mobility of capital, a factor which was not accounted for by either Smith or Ricardo, and the mobility of labor, a factor which was never taken into consideration by Mises or Rothbard.\nLet me first state that I accept Bob’s general terms with regards to both free trade meaning unlimited transactions between domestic and foreign parties, and national wealth being measured on average. I am presenting five arguments against free trade tonight: they are empirical, mathematical, existential, practical, and logical. Given the time constraints, it is not possible to go very deep into any of them, but each of the five represents a very serious and substantial challenge to the claim that free trade makes a nation wealthier in the long term.\nMy first argument is empirical. The conventional argument in favor of free trade has changed very little over the centuries, and was repeated this very week in a major essay by Francis Fukuyama in\nForeign Affairs\n. It states:\nInternational trade has become increasingly free over time.\nWealth has increased during the same period.\nTherefore, free trade produces wealth.\nOr to put it another way, as Bob did in his excellent textbook,\nLessons for a Young Economist\n, “If we imagine an initial situation of worldwide free trade, and then further imagine that an individual country decided to “protect” its domestic industries and “save jobs” by preventing foreign goods from crossing its borders, its residents would become much poorer.”\nBut this is not true. We have considerable evidence that freer global trade does not necessarily make an individual country wealthier. For example, although the free trade in goods has considerably increased over the last 50 years, real wages are lower in the USA than they were 43 years ago. So is the country wealthier? Proponents of free trade often cite growing GDP per capita, and it is true that since 1964, US GDP per capita has risen from $3.5 thousand to $54.6 thousand, a 15-times increase.\nThat means the USA is wealthier, right? No, because over the same 50-year period, total US debt per capita has risen 34 times. If your income doubles, but your personal debt goes up by a factor of 4.5, are you wealthier? No, of course not. Your perceived increase in wealth is a mirage.\nFreer trade has clearly not produced greater wealth for America or Americans, but rather, greater indebtedness. This is not to say free trade can never benefit a national economy, but we have clear empirical evidence that in the case of the United States, it has not. Therefore, the resolution is false.\nMy second argument against free trade is mathematical. Free trade theory relies, at its core, upon the Law of Supply and Demand. But in\nDebunking Economics\n, Steve Keen cites the work of William Gorman, who in 1953 utilized mathematical logic to prove that the Law of Demand does not apply to a market demand curve. It only applies to single individuals, and it is not possible to derive a market demand curve by simply adding together the quantities demanded by all individuals at each price. In other words, the combination of all rational consumer preferences results in an irrational market where lower prices may or may not increase demand.\nThis proof has many implications for economics that have not yet been explored, and among the obvious casualties is David Ricardo’s theory of Comparative Advantage. The math literally does not add up. Therefore, the resolution is false.\nListen to the rest of it there\n. Brainstorm members will receive a full transcript once it is complete.\nI should note that Steve Keen informed me that there is a more substantial mathematical case to be made against free trade than the one I presented, but as it was his point and not mine – and frankly, I don’t fully understand it yet – I did not utilize it in the debate. I will devote a separate post to it later.",
  "tags": [
    "debate",
    "economics",
    "free trade"
  ],
  "categories": [],
  "sitemap_lastmod": "2016-06-21T06:45:00+00:00"
}