{
  "url": "https://voxday.net/2016/06/28/fun-with-atheists/",
  "scraped_at": "2025-12-17T18:03:23.815986",
  "title": "Fun with atheists",
  "date_display": "June 28, 2016",
  "date_iso": "2016-06-28T12:00:00+00:00",
  "date_from_url": "2016-06-28",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>It’s really remarkable to see how many atheists fail to understand what their “assume the other person is lying if he does not immediately present documentary evidence upon demand, which will of course be immediately dismissed for failing to meet the unexpressed demand for peer-reviewed and published scientific evidence” says about their personal integrity, or as is more precisely the case, their lack of it:</p><blockquote class=\"tr_bq\"><p> Supreme Dark Lord ‏@voxday<br> The reason most atheists trust fellow atheists less than anyone else is because they recognize their own lack of integrity and morality.</br></p><p>Paul D ‏@Lost_in_Formosa<br> Any evidence for that?</br></p><p>Supreme Dark Lord ‏@voxday<br> Yes. Look it up.</br></p><p>Paul D ‏@Lost_in_Formosa<br> in other words, you just made it up, right?</br></p><p>Supreme Dark Lord ‏@voxday<br> No. You guys are so predictable. You assume lies. Why? Because you are an atheist and you readily lie.</br></p><p>Paul D ‏@Lost_in_Formosa<br> Why are you slandering a huge group of your fellow human beings?</br></p><p>Supreme Dark Lord ‏@voxday<br> You are lying. Truth cannot be slander by definition. You’re really not helping the case for atheist integrity here.</br></p><p>Supreme Dark Lord ‏@voxday <br> Vox: Atheists don’t trust other atheists because projection.</br></p><p>Atheist: Show me the evidence!</p><p>Vox: No.</p><p>Atheist: You lie!</p><p>Vox: Voila….</p></blockquote><p>The amusing thing is that they still absolutely believe that they are the smart ones, the “bright” ones, because godless. It’s now gotten to the point that when I hear someone is an atheist, rather than an agnostic, I now assume aggressive midwittery.</p><p>Absence of evidence is not evidence of absence. And a refusal to provide freely available, readily accessible evidence on demand is not a reliable indication that the other party is lying. It could mean that, or it could simply indicate that the other party is aware that you are an intellectually overmatched and lazy little bastard who is going to quibble in a dishonest and self-serving manner about any evidence that is provided to you, no matter how reliable the sources.</p><p>UPDATE: Someone else linked <a href=\"http://www.scientificamerican.com/article/in-atheists-we-distrust/\">the article to which I was referring</a>. The good faith atheist’s response to incontrovertible proof that I was not, as he claimed, lying, slandering, and making things up?</p><blockquote class=\"tr_bq\"><p> Paul D ‏@Lost_in_Formosa<br> Read the comments to see how stupid the “research”. There are more believers in jail than atheists! How come?</br></p></blockquote><p>Seriously, at this point, how do you still manage to doubt me? He didn’t even hesitate before trying to move the goal posts!</p></div>",
  "content_text": "It’s really remarkable to see how many atheists fail to understand what their “assume the other person is lying if he does not immediately present documentary evidence upon demand, which will of course be immediately dismissed for failing to meet the unexpressed demand for peer-reviewed and published scientific evidence” says about their personal integrity, or as is more precisely the case, their lack of it:\nSupreme Dark Lord ‏@voxday\nThe reason most atheists trust fellow atheists less than anyone else is because they recognize their own lack of integrity and morality.\nPaul D ‏@Lost_in_Formosa\nAny evidence for that?\nSupreme Dark Lord ‏@voxday\nYes. Look it up.\nPaul D ‏@Lost_in_Formosa\nin other words, you just made it up, right?\nSupreme Dark Lord ‏@voxday\nNo. You guys are so predictable. You assume lies. Why? Because you are an atheist and you readily lie.\nPaul D ‏@Lost_in_Formosa\nWhy are you slandering a huge group of your fellow human beings?\nSupreme Dark Lord ‏@voxday\nYou are lying. Truth cannot be slander by definition. You’re really not helping the case for atheist integrity here.\nSupreme Dark Lord ‏@voxday\nVox: Atheists don’t trust other atheists because projection.\nAtheist: Show me the evidence!\nVox: No.\nAtheist: You lie!\nVox: Voila….\nThe amusing thing is that they still absolutely believe that they are the smart ones, the “bright” ones, because godless. It’s now gotten to the point that when I hear someone is an atheist, rather than an agnostic, I now assume aggressive midwittery.\nAbsence of evidence is not evidence of absence. And a refusal to provide freely available, readily accessible evidence on demand is not a reliable indication that the other party is lying. It could mean that, or it could simply indicate that the other party is aware that you are an intellectually overmatched and lazy little bastard who is going to quibble in a dishonest and self-serving manner about any evidence that is provided to you, no matter how reliable the sources.\nUPDATE: Someone else linked\nthe article to which I was referring\n. The good faith atheist’s response to incontrovertible proof that I was not, as he claimed, lying, slandering, and making things up?\nPaul D ‏@Lost_in_Formosa\nRead the comments to see how stupid the “research”. There are more believers in jail than atheists! How come?\nSeriously, at this point, how do you still manage to doubt me? He didn’t even hesitate before trying to move the goal posts!",
  "tags": [
    "atheism"
  ],
  "categories": [],
  "sitemap_lastmod": "2016-06-28T11:00:00+00:00"
}