{
  "url": "https://voxday.net/2016/06/26/gamma-stalker-fai/",
  "scraped_at": "2025-12-17T18:03:09.457561",
  "title": "Gamma stalker fail",
  "date_display": "June 26, 2016",
  "date_iso": "2016-06-26T15:30:00+00:00",
  "date_from_url": "2016-06-26",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>Camestros Fellatrix is still butthurt over <a href=\"http://www.milobookclub.com/2016/05/01/of-enthymemes-and-false-erudition/\">being depantsed in the midst of his attempt</a> to pose as a master of Aristotelian rhetoric that he’s been commenting almost nonstop about me ever since. (shakes head) Gammas are nothing if not predictable. Anyhow, it’s more than a little amusing to see him try to figure out how he can try to figure out <a href=\"https://camestrosfelapton.wordpress.com/2016/06/24/weird-internet-ideas-how-smart-is-vox-day/\">how to produce a justification for calling me stup</a>id while simultaneously undermining the significance of IQ:</p><blockquote><p> In Vox Day’s case, his claim is this: the difference in IQ score between man-who-made-Vox-grumpy (MWMVG) and Vox is &gt;50 IQ score points. If we assume the MWMVG is at least in the average range (90-109) Vox is claiming an IQ score of &gt;140 and possibly &gt;159. Note that the upper end of just ‘average’ IQ has Vox claiming to be pretty much at the limit of meaningful IQ scores on the most generous reading of IQ and even at the lower end well above the boundary which most reputable IQ test stop bothering to classify (around 130 IQ points). An informed (and presumably smart) person shouldn’t make a claim any more precise than ‘greater than 130’ – beyond that the figure as some sort of intrinsic property of a person that would be consistent across multiple methods of quantification doesn’t make sense EVEN ASSUMING IQ MAKES MUCH SENSE ANYWAY.</p><p>Put let’s take that figure of 130. Let’s say Vox is taking a more grounded view of his own IQ and is seeing himself as 130. A 50 point difference would put the MWMVG at an IQ of below 80. For comparison, an IQ of below 70 is used diagnostically as evidence of intellectual disability. An IQ of 80 to 70 is likely to represent somebody who would struggle with school and many cognitive tasks (assuming the score was representative). Which would be an odd thing for Vox to claim – after he is attempting to write a point-by-point rebuttal of what the MWMVG and struggling to do so, claiming that he is struggling to counter an argument from a person with an IQ lower than 80 would be tantamount to claiming he really doesn’t know what he is talking about.</p></blockquote><p>Aaron doesn’t make me grumpy in the slightest. I find his determination, shared by a few similarly stupid File 770 headcases, to stake his reputation on my being wrong every single time in all circumstances, to be downright funny. It is always a pleasure to see one’s expectations met so reliably.</p><p>Especially considering how his fixation led him to publicly conclude that LEEEROY JENKINS was the greatest battlefield commander in military history.</p><p>Anyhow, Cammy has unnecessarily occupied himself with trying to assess “a more grounded view” of my IQ, in that its lower limit is a matter of public record. I was a member of Mensa, so obviously my IQ is above 132. More importantly, I was also a National Merit Finalist prior to the 1993 renorming of the PSAT, so it is equally apparent that my IQ must also be above 140. Therefore, the minimum estimated IQ for Aaron is 90, which is in the average range, and may actually be considered a little generous in light of the obvious silliness of his expressed position on tactical matters.</p><p>And then, of course, there is the perhaps-not-entirely-irrelevant fact that <a href=\"http://www.milobookclub.com/2014/08/07/the-definitive-iq-lis/\">I already posted it</a>.</p><p>We have now reached the point at which you should feel free to:</p><ul><li>Explain why you reject IQ as a metric for intelligence. Preferably at length and with personal anecdotes.</li><li>Lecture us on the 34 different types of intelligence, as well as which ones are best.</li><li>Tell us how you were out partying the night before the SAT and you were totally hungover when you took it and besides you don’t care.</li><li>Brag about your 800 IQ.</li><li>Inform us of your Bachelor’s Degree in Philosophy of Language from the University of Chicago. <i>The University of Chicago!</i></li></ul><div> It’s totally going to fool everyone. I guarantee it. No one will ever be able to ascertain your true motivations. We’ve never seen or heard anyone do anything like it before.</div><div></div><div> Anyhow, this is nothing more than Vox’s First Law in action: <i>Any sufficiently advanced intelligence is indistinguishable from insanity.</i></div></div>",
  "content_text": "Camestros Fellatrix is still butthurt over\nbeing depantsed in the midst of his attempt\nto pose as a master of Aristotelian rhetoric that he’s been commenting almost nonstop about me ever since. (shakes head) Gammas are nothing if not predictable. Anyhow, it’s more than a little amusing to see him try to figure out how he can try to figure out\nhow to produce a justification for calling me stup\nid while simultaneously undermining the significance of IQ:\nIn Vox Day’s case, his claim is this: the difference in IQ score between man-who-made-Vox-grumpy (MWMVG) and Vox is >50 IQ score points. If we assume the MWMVG is at least in the average range (90-109) Vox is claiming an IQ score of >140 and possibly >159. Note that the upper end of just ‘average’ IQ has Vox claiming to be pretty much at the limit of meaningful IQ scores on the most generous reading of IQ and even at the lower end well above the boundary which most reputable IQ test stop bothering to classify (around 130 IQ points). An informed (and presumably smart) person shouldn’t make a claim any more precise than ‘greater than 130’ – beyond that the figure as some sort of intrinsic property of a person that would be consistent across multiple methods of quantification doesn’t make sense EVEN ASSUMING IQ MAKES MUCH SENSE ANYWAY.\nPut let’s take that figure of 130. Let’s say Vox is taking a more grounded view of his own IQ and is seeing himself as 130. A 50 point difference would put the MWMVG at an IQ of below 80. For comparison, an IQ of below 70 is used diagnostically as evidence of intellectual disability. An IQ of 80 to 70 is likely to represent somebody who would struggle with school and many cognitive tasks (assuming the score was representative). Which would be an odd thing for Vox to claim – after he is attempting to write a point-by-point rebuttal of what the MWMVG and struggling to do so, claiming that he is struggling to counter an argument from a person with an IQ lower than 80 would be tantamount to claiming he really doesn’t know what he is talking about.\nAaron doesn’t make me grumpy in the slightest. I find his determination, shared by a few similarly stupid File 770 headcases, to stake his reputation on my being wrong every single time in all circumstances, to be downright funny. It is always a pleasure to see one’s expectations met so reliably.\nEspecially considering how his fixation led him to publicly conclude that LEEEROY JENKINS was the greatest battlefield commander in military history.\nAnyhow, Cammy has unnecessarily occupied himself with trying to assess “a more grounded view” of my IQ, in that its lower limit is a matter of public record. I was a member of Mensa, so obviously my IQ is above 132. More importantly, I was also a National Merit Finalist prior to the 1993 renorming of the PSAT, so it is equally apparent that my IQ must also be above 140. Therefore, the minimum estimated IQ for Aaron is 90, which is in the average range, and may actually be considered a little generous in light of the obvious silliness of his expressed position on tactical matters.\nAnd then, of course, there is the perhaps-not-entirely-irrelevant fact that\nI already posted it\n.\nWe have now reached the point at which you should feel free to:\nExplain why you reject IQ as a metric for intelligence. Preferably at length and with personal anecdotes.\nLecture us on the 34 different types of intelligence, as well as which ones are best.\nTell us how you were out partying the night before the SAT and you were totally hungover when you took it and besides you don’t care.\nBrag about your 800 IQ.\nInform us of your Bachelor’s Degree in Philosophy of Language from the University of Chicago.\nThe University of Chicago!\nIt’s totally going to fool everyone. I guarantee it. No one will ever be able to ascertain your true motivations. We’ve never seen or heard anyone do anything like it before.\nAnyhow, this is nothing more than Vox’s First Law in action:\nAny sufficiently advanced intelligence is indistinguishable from insanity.",
  "tags": [
    "Alpha Game",
    "anklebiters",
    "SJW"
  ],
  "categories": [],
  "sitemap_lastmod": "2016-06-26T14:30:00+00:00"
}