{
  "url": "https://voxday.net/2016/06/05/mailvox-forgetting-2008/",
  "scraped_at": "2025-12-17T18:00:25.035729",
  "title": "Mailvox: forgetting 2008",
  "date_display": "June 5, 2016",
  "date_iso": "2016-06-05T09:24:00+00:00",
  "date_from_url": "2016-06-05",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>Nathan thinks the general election is already over:</p><blockquote class=\"tr_bq\"><p> The game hasn’t changed one bit. When the Gen Election hits Clinton will<br> know exactly the states where she has to win and she’ll secure them<br> pretty easily. The game is called Electoral Collage Math. She starts<br> with NY, CA, IL, NJ, MA and who bunch of others. My bet is that Trump<br> will find a way to convince himself that he SHOULD win NY and will spend<br> time there. Meanwhile, Clinton will camp out in places like Michigan,<br> Ohio, Virginia, NC, AZ, NV and WA.</br></br></br></br></br></br></p><p>The poor guy doesn’t get it. He was overmatched the minute he secured the nomination.</p></blockquote><p>Nathan appears to have forgotten that Hillary Clinton was the candidate who failed to understand the rules of the Democratic nomination in formulating her strategy and named a wannabe lawyer with a poli-sci degree from Middlebury and no absolutely experience in the real world her top economic adviser.</p><p>Perhaps she’s learned from her past failures, but until we see some evidence, I wouldn’t put too much stock in the competence of the Hillary campaign, much less her overmatching anyone. Especially when one considers how much trouble she is having putting away an ancient Vermont socialist who isn’t even a Democrat, despite having the DNC, the superdelegates, and the media in her pocket. She is an exceptionally bad candidate who has never beaten anyone who didn’t take a fall.</p><p>The state-by-state demographics are the sole reason for concern, but as others have pointed out, the conventional electoral math no longer applies once whites unite behind a political identity. Will that happen soon enough to elect Donald Trump?</p><p>Therein lies the question.</p></div>",
  "content_text": "Nathan thinks the general election is already over:\nThe game hasn’t changed one bit. When the Gen Election hits Clinton will\nknow exactly the states where she has to win and she’ll secure them\npretty easily. The game is called Electoral Collage Math. She starts\nwith NY, CA, IL, NJ, MA and who bunch of others. My bet is that Trump\nwill find a way to convince himself that he SHOULD win NY and will spend\ntime there. Meanwhile, Clinton will camp out in places like Michigan,\nOhio, Virginia, NC, AZ, NV and WA.\nThe poor guy doesn’t get it. He was overmatched the minute he secured the nomination.\nNathan appears to have forgotten that Hillary Clinton was the candidate who failed to understand the rules of the Democratic nomination in formulating her strategy and named a wannabe lawyer with a poli-sci degree from Middlebury and no absolutely experience in the real world her top economic adviser.\nPerhaps she’s learned from her past failures, but until we see some evidence, I wouldn’t put too much stock in the competence of the Hillary campaign, much less her overmatching anyone. Especially when one considers how much trouble she is having putting away an ancient Vermont socialist who isn’t even a Democrat, despite having the DNC, the superdelegates, and the media in her pocket. She is an exceptionally bad candidate who has never beaten anyone who didn’t take a fall.\nThe state-by-state demographics are the sole reason for concern, but as others have pointed out, the conventional electoral math no longer applies once whites unite behind a political identity. Will that happen soon enough to elect Donald Trump?\nTherein lies the question.",
  "tags": [
    "mailvox",
    "politics"
  ],
  "categories": [],
  "sitemap_lastmod": "2016-06-05T08:24:00+00:00"
}