{
  "url": "https://voxday.net/2016/06/14/mcrapey-is-lying-again/",
  "scraped_at": "2025-12-17T18:01:35.088700",
  "title": "McRapey is lying AGAIN",
  "date_display": "June 14, 2016",
  "date_iso": "2016-06-14T16:03:00+00:00",
  "date_from_url": "2016-06-14",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>McRapey is obviously having difficulties accepting the fact that in traffic terms, I passed him by like a Porsche blowing the doors off a Yugo on the Autobahn.</p><blockquote class=\"tr_bq\"><p>  John Scalzi ‏@scalzi<br> (A minor footnote to my bio will be how some jackasses said I lied about my site traffic because they didn’t understand the phrase “up to.”)</br></p><p>John Scalzi ‏@scalzi<br> My Web site’s having one of those high-volume traffic days certain detractors of mine loudly say I never have, because they’re always wrong.</br></p></blockquote><p>Being both an SJW and a Gamma male, you know John Scalzi is always going to lie. He did say “up to” in an attempt to deceive the <i>New York Times</i> reporter about his traffic in an interview, but he straight up lied to <i>Lightspeed</i> and on Twitter, when he did not.</p><p><b>EXHIBIT ONE</b></p><p><i>“For one thing, his blog gets an extraordinary amount of traffic for a writer’s website–Scalzi himself quotes it at over 45,000 unique visitors daily and more than two million page views monthly.”</i><br> <i>– Lightspeed Magazine, <a href=\"http://www.lightspeedmagazine.com/nonfiction/interview-john-scalzi/\">September 2010 interview</a> </i></br></p><p>I note that the word “over” is not the phrase “up to”. At the time, in August 2010, he didn’t have “more than two million page views monthly”, he had 409,745.</p><p><b>EXHIBIT TWO</b></p><p><i>John Scalzi @scalzi 6:20 AM – 4 Dec 12<br>Hey, authors of non-traditionally published books! Promote your book to my 50K daily blog readers TODAY</br></i></p><p>“Up to” 50k daily blog readers? No. Do you spot the phrase? I don’t.</p><p><b>EXHIBIT THREE</b></p><p><i>John Scalzi ‏@scalzi 3:33 PM – 10 Aug 13<br>@gregpak I think if people like the content they will keep coming in regardless. I mean, my site gets 50K readers a day </br></i></p><p>“Up to” 50K readers a day? No. Do you spot the phrase? I don’t.</p><p>So, as usual, McRapey is lying about his site traffic. Second, he is <i>also</i> lying about what I have said about it. I have never said that <i>Whatever</i> never gets the occasional spike, usually as a result of external links to it. I know exactly when, and how big, those historical spikes were, going back to 2008.</p><p>What McRapey does is talk very loudly about those spikes when they occur in order to try to deceive people into believing they are generally indicative of his overall level of traffic, which is simply not the case. Unlike me, he never mentions his <i>average</i> daily traffic, because it is much lower than he wants everyone to believe. He doesn’t even report his <i>annual</i> traffic anymore, because it is now so embarrassingly low in comparison with mine. The most traffic he has ever had was just over 8 million pageviews back in 2012; in 2016 Whatever is unlikely to reach even one-quarter the traffic here, which is on track to be in excess of 25 million pageviews.</p><p>I’m not surprised he had a short-term spike in traffic; they often occur in the aftermath of an event like the Orlando shooting. My traffic also increased, from a daily average of 76,166 pageviews in June to 91,796 yesterday. But unlike McRapey, you’ll never see me claiming “up to 119,699 daily blog readers”, as I could, because I feel absolutely no need to deceive or mislead people about my site traffic.</p></div>",
  "content_text": "McRapey is obviously having difficulties accepting the fact that in traffic terms, I passed him by like a Porsche blowing the doors off a Yugo on the Autobahn.\nJohn Scalzi ‏@scalzi\n(A minor footnote to my bio will be how some jackasses said I lied about my site traffic because they didn’t understand the phrase “up to.”)\nJohn Scalzi ‏@scalzi\nMy Web site’s having one of those high-volume traffic days certain detractors of mine loudly say I never have, because they’re always wrong.\nBeing both an SJW and a Gamma male, you know John Scalzi is always going to lie. He did say “up to” in an attempt to deceive the\nNew York Times\nreporter about his traffic in an interview, but he straight up lied to\nLightspeed\nand on Twitter, when he did not.\nEXHIBIT ONE\n“For one thing, his blog gets an extraordinary amount of traffic for a writer’s website–Scalzi himself quotes it at over 45,000 unique visitors daily and more than two million page views monthly.”\n– Lightspeed Magazine,\nSeptember 2010 interview\nI note that the word “over” is not the phrase “up to”. At the time, in August 2010, he didn’t have “more than two million page views monthly”, he had 409,745.\nEXHIBIT TWO\nJohn Scalzi @scalzi 6:20 AM – 4 Dec 12\nHey, authors of non-traditionally published books! Promote your book to my 50K daily blog readers TODAY\n“Up to” 50k daily blog readers? No. Do you spot the phrase? I don’t.\nEXHIBIT THREE\nJohn Scalzi ‏@scalzi 3:33 PM – 10 Aug 13\n@gregpak I think if people like the content they will keep coming in regardless. I mean, my site gets 50K readers a day\n“Up to” 50K readers a day? No. Do you spot the phrase? I don’t.\nSo, as usual, McRapey is lying about his site traffic. Second, he is\nalso\nlying about what I have said about it. I have never said that\nWhatever\nnever gets the occasional spike, usually as a result of external links to it. I know exactly when, and how big, those historical spikes were, going back to 2008.\nWhat McRapey does is talk very loudly about those spikes when they occur in order to try to deceive people into believing they are generally indicative of his overall level of traffic, which is simply not the case. Unlike me, he never mentions his\naverage\ndaily traffic, because it is much lower than he wants everyone to believe. He doesn’t even report his\nannual\ntraffic anymore, because it is now so embarrassingly low in comparison with mine. The most traffic he has ever had was just over 8 million pageviews back in 2012; in 2016 Whatever is unlikely to reach even one-quarter the traffic here, which is on track to be in excess of 25 million pageviews.\nI’m not surprised he had a short-term spike in traffic; they often occur in the aftermath of an event like the Orlando shooting. My traffic also increased, from a daily average of 76,166 pageviews in June to 91,796 yesterday. But unlike McRapey, you’ll never see me claiming “up to 119,699 daily blog readers”, as I could, because I feel absolutely no need to deceive or mislead people about my site traffic.",
  "tags": [
    "McRapey"
  ],
  "categories": [],
  "sitemap_lastmod": "2016-06-14T15:03:00+00:00"
}