{
  "url": "https://voxday.net/2016/06/25/quintessential-cuckservatis/",
  "scraped_at": "2025-12-17T18:03:02.847914",
  "title": "Quintessential cuckservatism",
  "date_display": "June 25, 2016",
  "date_iso": "2016-06-25T12:00:00+00:00",
  "date_from_url": "2016-06-25",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>Rod Dreher demonstrates the effete and useless nature <a href=\"http://www.theamericanconservative.com/dreher/campus-comes-to-congress/\">of modern conservatism</a>:</p><blockquote><p> The Speaker of the House of Representatives was shouted down by Democratic Congressman as he attempted to regain control of the House of Representatives. Actual US Congressmen behaving like a bunch of giddy Oberlin undergraduates.</p><p>They had better not give in. Look, on gun control matters, I am generally — generally — more sympathetic to Democrats than to Republicans. But this mob insurrection on the House floor is profoundly unsettling. I have not looked closely at the legislation, so it is entirely possible that I might support the Democratic proposal. But to attempt to get one’s way by showing utter contempt for rules of the House? No. No, no, no. Their passion does not justify their behavior.</p><p>This country is in trouble.</p></blockquote><p>You know he’s serious when he resorts to no less than FOUR (4) nos. This useless, limp-wristed excuse for a purported conservative “opinion leader”, this hapless, low-testosterone shadow of a man, is more concerned about fucking <i>etiquette</i>, than he is about the single most important right in the Bill of Rights.</p><p>“Dear God, they’re<i> sitting on the floor</i>! Heavens to Betsy, whatever shall we do?”</p><p>If you want to understand the key difference between the Alt Right and the Conservative movement, all you need to do is look at Rod Dreher. If he strikes you as a strong and principled Christian man standing up for what is right and true and important, then you are most definitely a Conservative.</p><p>If he strikes you as missing the point so badly that he would have done far better to put on a dress, smear some lipstick on his face, and record a video reading from Amy Vanderbilt’s <i>Complete Book of Etiquette</i>, you just might be Alt Right.</p></div>",
  "content_text": "Rod Dreher demonstrates the effete and useless nature\nof modern conservatism\n:\nThe Speaker of the House of Representatives was shouted down by Democratic Congressman as he attempted to regain control of the House of Representatives. Actual US Congressmen behaving like a bunch of giddy Oberlin undergraduates.\nThey had better not give in. Look, on gun control matters, I am generally — generally — more sympathetic to Democrats than to Republicans. But this mob insurrection on the House floor is profoundly unsettling. I have not looked closely at the legislation, so it is entirely possible that I might support the Democratic proposal. But to attempt to get one’s way by showing utter contempt for rules of the House? No. No, no, no. Their passion does not justify their behavior.\nThis country is in trouble.\nYou know he’s serious when he resorts to no less than FOUR (4) nos. This useless, limp-wristed excuse for a purported conservative “opinion leader”, this hapless, low-testosterone shadow of a man, is more concerned about fucking\netiquette\n, than he is about the single most important right in the Bill of Rights.\n“Dear God, they’re\nsitting on the floor\n! Heavens to Betsy, whatever shall we do?”\nIf you want to understand the key difference between the Alt Right and the Conservative movement, all you need to do is look at Rod Dreher. If he strikes you as a strong and principled Christian man standing up for what is right and true and important, then you are most definitely a Conservative.\nIf he strikes you as missing the point so badly that he would have done far better to put on a dress, smear some lipstick on his face, and record a video reading from Amy Vanderbilt’s\nComplete Book of Etiquette\n, you just might be Alt Right.",
  "tags": [
    "#AltRight",
    "gun control"
  ],
  "categories": [],
  "sitemap_lastmod": "2016-06-25T11:00:00+00:00"
}