{
  "url": "https://voxday.net/2016/06/16/self-destructive-ideologies/",
  "scraped_at": "2025-12-17T18:01:46.038557",
  "title": "Self-destructive ideologies",
  "date_display": "June 16, 2016",
  "date_iso": "2016-06-16T08:25:00+00:00",
  "date_from_url": "2016-06-16",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>Most people understand that communism contains within itself the seeds of its own destruction. The same is now obviously true of feminism. What is remarkable is that Steve Sailer grasped that <a href=\"http://www.unz.com/isteve/why-northern-california-beat-southern-california/\">this was also true of American conservatism</a> as long as 12 years ago:</p><blockquote class=\"tr_bq\"><p> As a native Los Angeleno, Northern Californian snobbishness has always gotten on my nerves. Nonetheless, the payoff has become undeniable. Rather than being inundated with unskilled immigrants from one country, Northern California mainly attracts skilled immigrants from a wide diversity of countries.</p><p>The lesson for the GOP is sobering. If it won’t fight to enforce immigration laws on the national level, citizens will try to parry the effects at the local level.</p><p>And the socially acceptable way to keep out swarms of poor immigrants is the Northern Californian liberal way: environmentalism, unionism, historical preservationism, NIMBYism—indeed, the whole panoply of Democratic Party policies at the state and local level.</p></blockquote><p>There are a number of structural flaws in conservatism, but the fatal one has proved to be the embrace of the Proposition Nation mythology. In the same way that communism destroys personal initiative and feminism destroys reproductive rates, conservatism destroys the ability of a nation or even a community to sustain and preserve itself.</p><p>The #AltRight may or may not replace conservatism as the primary challenge to the Left in America, but we already know that conservatism was destined to fail. It doomed itself to failure as soon as it embraced the “equality of opportunity” concept, which inevitably led to the doctrine of accepting “hard-working immigrants”.</p><p>Those who argue that because DNA is not 100 percent determinative, it is irrelevant, are failing to grasp that in this regard DNA is a <i>necessary</i> factor, though it is not, in itself, a <i>sufficient</i> one. And while I welcome disagreement, do try to avoid putting on a clownish demonstration of how you are limited to binary thinking. That’s not criticism, that’s just embarrassing.</p><p>UPDATE: WF has an intriguing thought:</p><blockquote class=\"tr_bq\"><p> Evil is always ultimately self-destructive, suggesting the latter, when found in a system, likely indicates the former. In other words, if a system  (ideology, structure, philosophy, individual, or thought) contains within it the seeds of contradiction, be it internal or external, or systemic collapse, it’s a good bet it is against God and therefore evil. This is just as true for individuals with unresolved or incorrectly resolved cognitive dissonance, for example.</p><p>This is because God is both real and Creator of reality, and all that is in conflict with reality is necessarily in conflict with Him, too.</p></blockquote></div>",
  "content_text": "Most people understand that communism contains within itself the seeds of its own destruction. The same is now obviously true of feminism. What is remarkable is that Steve Sailer grasped that\nthis was also true of American conservatism\nas long as 12 years ago:\nAs a native Los Angeleno, Northern Californian snobbishness has always gotten on my nerves. Nonetheless, the payoff has become undeniable. Rather than being inundated with unskilled immigrants from one country, Northern California mainly attracts skilled immigrants from a wide diversity of countries.\nThe lesson for the GOP is sobering. If it won’t fight to enforce immigration laws on the national level, citizens will try to parry the effects at the local level.\nAnd the socially acceptable way to keep out swarms of poor immigrants is the Northern Californian liberal way: environmentalism, unionism, historical preservationism, NIMBYism—indeed, the whole panoply of Democratic Party policies at the state and local level.\nThere are a number of structural flaws in conservatism, but the fatal one has proved to be the embrace of the Proposition Nation mythology. In the same way that communism destroys personal initiative and feminism destroys reproductive rates, conservatism destroys the ability of a nation or even a community to sustain and preserve itself.\nThe #AltRight may or may not replace conservatism as the primary challenge to the Left in America, but we already know that conservatism was destined to fail. It doomed itself to failure as soon as it embraced the “equality of opportunity” concept, which inevitably led to the doctrine of accepting “hard-working immigrants”.\nThose who argue that because DNA is not 100 percent determinative, it is irrelevant, are failing to grasp that in this regard DNA is a\nnecessary\nfactor, though it is not, in itself, a\nsufficient\none. And while I welcome disagreement, do try to avoid putting on a clownish demonstration of how you are limited to binary thinking. That’s not criticism, that’s just embarrassing.\nUPDATE: WF has an intriguing thought:\nEvil is always ultimately self-destructive, suggesting the latter, when found in a system, likely indicates the former. In other words, if a system  (ideology, structure, philosophy, individual, or thought) contains within it the seeds of contradiction, be it internal or external, or systemic collapse, it’s a good bet it is against God and therefore evil. This is just as true for individuals with unresolved or incorrectly resolved cognitive dissonance, for example.\nThis is because God is both real and Creator of reality, and all that is in conflict with reality is necessarily in conflict with Him, too.",
  "tags": [
    "#AltRight",
    "cuckservative",
    "immigration"
  ],
  "categories": [],
  "sitemap_lastmod": "2016-06-16T07:25:00+00:00"
}