{
  "url": "https://voxday.net/2016/06/08/sjws-attack-warhammer/",
  "scraped_at": "2025-12-17T18:00:44.906330",
  "title": "SJWs attack Warhammer",
  "date_display": "June 8, 2016",
  "date_iso": "2016-06-08T09:35:00+00:00",
  "date_from_url": "2016-06-08",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>Social Justice Warriors <a href=\"http://www.belloflostsouls.net/2016/06/on-maturity-40k-and-slaanesh.html\">declare war on Chaos</a>:</p><blockquote class=\"tr_bq\"><p> Maturity is the ability to respond to the environment in an appropriate manner. This response is generally learned rather than instinctive. The outdated ideas about sex and sexuality – and they are outdated – that Slaanesh represents are simply not appropriate for the game any more. They’re not appropriate for younger gamers; they’re insulting to women, to trans and intersex people, as well as to any man whose sexuality extends beyond five quick pumps whilst thinking of England. The mature response would be to acknowledge this, and avoid the instinct to avoid change. Change terrifies people, especially members of the geek community, who loathe retcons with a passion that could eclipse suns.</p><p>But, in my opinion, Slaanesh shouldn’t be part of things as they are. So how could we deal with this?</p><p>Well, contrary to what you might think, I don’t actually believe we should Squat it. For better or worse, Slaanesh is a longstanding part of things, and it’s would be simply unfair to those gamers who’ve got Slaanesh armies. As well as this, 40K isn’t just a wargame any more; Fantasy Flight Games’ excellent lines of tabletop RPGs enable the discussion of some very mature themes, especially in more investigation-based games like ‘Dark Heresy’. A Slaanesh cult could be an intriguing way for an appropriately mature group of gamers to look at all kinds of ideas to do with the aforementioned sex, sexuality and other adult issues.</p><p>So what to do? Well, in my opinion, the best solution would be to ‘retire’ Slaanesh as a GW-produced faction and make the army Forge World’s property. If you’ve not read any of FW’s books, I can attest that they have demonstrated time and again that they can do nuance. Not to mention, FW’s models are NOT targeted at children, but explicitly as adult collectors, meaning it’s possible to completely ignore that issue of inappropriateness. GW as a company can completely take advantage of this, having its cake and eating it, and they should. Obviously, this does nothing to overcome the inherent problems of sexist models, or the deeply embedded homophobic and transphobic imagery, but that’s something which can be looked at over time in Black Library books, Forge World supplements, and FFG RPG supplements.</p><p>Slaanesh has already been replaced by the Horned Rat in AoS, which clearly shows it can be done in 40K too. To be honest, this is the ideal opportunity to do something exciting and new for Chaos players, giving them a whole new Chaos power to deal with. They could bring back Malal, or they could choose something else to fill the gap more naturally. Either way, it would be a step towards turning 40K into an actual, truly mature environment, and that can only be a good thing.</p></blockquote><p>But it isn’t going over as well as earlier incursions in other areas, since the at least part of the Warhammer community is apparently aware of the driving force behind these demands for change.</p><ul><li>You want to rewrite 40k (or something else) to evolve it into something more than caricatured meatheads in power armor and one-dimensional demons, that’s great, more power to you. You want to rewrite it because someone somewhere might use it as an excuse to glorify their imagined victimhood, hell no, f*** you. We have, as a society, been walking on eggshells for years, cringing in fear every time the Manufactured Grievance Industry opens its maw, and shamed into reflexive self-censorship. That’s not a path to maturity, that’s perpetual infantilization.</li><li>The longest article bols has ever produced and its basically puritan garbage.</li><li>Screw this politically correct noise, I  don’t play warhammer to<br> facilitate a discussion about sexuality and politics. I got enough of<br> that in my sociology degree. I don’t really care if the aesthetic of<br> Warhammer and Slaanesh is “immature” because maturity is not a virtue I<br> associate with playing with plastkc soldiers with a heavy metal<br> aesthetic.  </br></br></br></br></br></li><li>Social justice gaming. </li><li>Usually the “Sexist” Complaint Mob are the most racist/sexist/Immature.<br> And they are never happy with any response to an issue they have raise.<br> They could Retcon the Emperor into a Asexual Gender queer Arrow and They<br> would take issue with Emperors armor being “Male armor” Or The fact he<br> has 20 sons Or The he a colonizer. The best Way to Be Mature Is to Say.<br> There are Slaanesh Models If you don’t like them Then Don’t Buy them for<br> your Children. Your “Moral” views should Have Zero on what I use my<br> Money to purchase</br></br></br></br></br></br></br></li><li>Today’s achingly sensitive souls are like the high-minded moralists of<br> the Victorian era; always taking offensive just for the joy of being<br> offended. ‘Look what a kind, intelligent, sensitive person I must be,<br> I’ve opened your eyes to a load of crap that yesterday no-one with more<br> than two brain cells had ever taken remotely seriously anyway.’  The article has nothing to do with morality and everything to do with the author’s own ego and sense of himself.</br></br></br></br></li><li> Don’t like it? Don’t buy it. Don’t watch it. Don’t listen to it.<br>SJWs often forget, that we’re kinda living in a free world, where everyone have a choice of what they want to do/see/feel. Oh, wait, I forgot – SJWs are the ones who try to use theme of “protecting someone’s rights” to simply stomp other’s freedom.</br></li></ul><p>By this point, it should be obvious that #GamerGate was never just about video games, it was merely the first battleground. As explained in <a href=\"http://amzn.to/1sBYA10\"><i><b>SJWs Always Lie: Taking Down the Thought Police</b></i></a>, SJWs will NEVER stop until society is fully converged. No organization, no interest, no activity, and no individual is safe from their thought-policing. Neutrality is not possible because they do not recognize it. Submission or resistance are the two available options.</p><ul></ul></div>",
  "content_text": "Social Justice Warriors\ndeclare war on Chaos\n:\nMaturity is the ability to respond to the environment in an appropriate manner. This response is generally learned rather than instinctive. The outdated ideas about sex and sexuality – and they are outdated – that Slaanesh represents are simply not appropriate for the game any more. They’re not appropriate for younger gamers; they’re insulting to women, to trans and intersex people, as well as to any man whose sexuality extends beyond five quick pumps whilst thinking of England. The mature response would be to acknowledge this, and avoid the instinct to avoid change. Change terrifies people, especially members of the geek community, who loathe retcons with a passion that could eclipse suns.\nBut, in my opinion, Slaanesh shouldn’t be part of things as they are. So how could we deal with this?\nWell, contrary to what you might think, I don’t actually believe we should Squat it. For better or worse, Slaanesh is a longstanding part of things, and it’s would be simply unfair to those gamers who’ve got Slaanesh armies. As well as this, 40K isn’t just a wargame any more; Fantasy Flight Games’ excellent lines of tabletop RPGs enable the discussion of some very mature themes, especially in more investigation-based games like ‘Dark Heresy’. A Slaanesh cult could be an intriguing way for an appropriately mature group of gamers to look at all kinds of ideas to do with the aforementioned sex, sexuality and other adult issues.\nSo what to do? Well, in my opinion, the best solution would be to ‘retire’ Slaanesh as a GW-produced faction and make the army Forge World’s property. If you’ve not read any of FW’s books, I can attest that they have demonstrated time and again that they can do nuance. Not to mention, FW’s models are NOT targeted at children, but explicitly as adult collectors, meaning it’s possible to completely ignore that issue of inappropriateness. GW as a company can completely take advantage of this, having its cake and eating it, and they should. Obviously, this does nothing to overcome the inherent problems of sexist models, or the deeply embedded homophobic and transphobic imagery, but that’s something which can be looked at over time in Black Library books, Forge World supplements, and FFG RPG supplements.\nSlaanesh has already been replaced by the Horned Rat in AoS, which clearly shows it can be done in 40K too. To be honest, this is the ideal opportunity to do something exciting and new for Chaos players, giving them a whole new Chaos power to deal with. They could bring back Malal, or they could choose something else to fill the gap more naturally. Either way, it would be a step towards turning 40K into an actual, truly mature environment, and that can only be a good thing.\nBut it isn’t going over as well as earlier incursions in other areas, since the at least part of the Warhammer community is apparently aware of the driving force behind these demands for change.\nYou want to rewrite 40k (or something else) to evolve it into something more than caricatured meatheads in power armor and one-dimensional demons, that’s great, more power to you. You want to rewrite it because someone somewhere might use it as an excuse to glorify their imagined victimhood, hell no, f*** you. We have, as a society, been walking on eggshells for years, cringing in fear every time the Manufactured Grievance Industry opens its maw, and shamed into reflexive self-censorship. That’s not a path to maturity, that’s perpetual infantilization.\nThe longest article bols has ever produced and its basically puritan garbage.\nScrew this politically correct noise, I  don’t play warhammer to\nfacilitate a discussion about sexuality and politics. I got enough of\nthat in my sociology degree. I don’t really care if the aesthetic of\nWarhammer and Slaanesh is “immature” because maturity is not a virtue I\nassociate with playing with plastkc soldiers with a heavy metal\naesthetic.\nSocial justice gaming.\nUsually the “Sexist” Complaint Mob are the most racist/sexist/Immature.\nAnd they are never happy with any response to an issue they have raise.\nThey could Retcon the Emperor into a Asexual Gender queer Arrow and They\nwould take issue with Emperors armor being “Male armor” Or The fact he\nhas 20 sons Or The he a colonizer. The best Way to Be Mature Is to Say.\nThere are Slaanesh Models If you don’t like them Then Don’t Buy them for\nyour Children. Your “Moral” views should Have Zero on what I use my\nMoney to purchase\nToday’s achingly sensitive souls are like the high-minded moralists of\nthe Victorian era; always taking offensive just for the joy of being\noffended. ‘Look what a kind, intelligent, sensitive person I must be,\nI’ve opened your eyes to a load of crap that yesterday no-one with more\nthan two brain cells had ever taken remotely seriously anyway.’  The article has nothing to do with morality and everything to do with the author’s own ego and sense of himself.\nDon’t like it? Don’t buy it. Don’t watch it. Don’t listen to it.\nSJWs often forget, that we’re kinda living in a free world, where everyone have a choice of what they want to do/see/feel. Oh, wait, I forgot – SJWs are the ones who try to use theme of “protecting someone’s rights” to simply stomp other’s freedom.\nBy this point, it should be obvious that #GamerGate was never just about video games, it was merely the first battleground. As explained in\nSJWs Always Lie: Taking Down the Thought Police\n, SJWs will NEVER stop until society is fully converged. No organization, no interest, no activity, and no individual is safe from their thought-policing. Neutrality is not possible because they do not recognize it. Submission or resistance are the two available options.",
  "tags": [
    "games",
    "SJW"
  ],
  "categories": [],
  "sitemap_lastmod": "2016-06-08T08:35:00+00:00"
}