{
  "url": "https://voxday.net/2016/06/21/the-inanity-of-pink-sff/",
  "scraped_at": "2025-12-17T18:02:34.468614",
  "title": "The inanity of Pink SF/F",
  "date_display": "June 21, 2016",
  "date_iso": "2016-06-21T18:19:00+00:00",
  "date_from_url": "2016-06-21",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>It goes well beyond that, of course, but it serves as a useful example. John Wright explains how what he calls “the Twenty Firsters”<a href=\"http://www.scifiwright.com/2016/06/heroic-tales-in-the-twenty-first-century/#more-16129\"> cripple their own entertainment</a>:</p><blockquote class=\"tr_bq\"><p> These are basic rule of psychology that everyone knows, or should know, if his brain is not gummed up with political correctness.</p><p>Basic rules of storytelling 101: the tale cannot violate the basic rules of psychology 101. (See Mark Twain’s description of Leatherstocking Tales for details.)</p><p>The writer can have the characters in odd situations, and, in a superhero yarn, the oddness can involve countless impossible absurdities of time travel, cloning, robots, talking apes, necromancers, mind readers, secret societies, immortals, revenants from the dead, parallel dimensions, millionaire playboys dressed like Robin Hood, and anything else you like: BUT the character’s reaction to these impossible things, no matter how absurdly impossible, must not only be possible, but likely and reasonable for a real human being in the unreal situation, or otherwise the writer shatters the suspension of disbelief.</p><p>A man can be a superman with ninescore ninety and nine impossible super powers plus one, but he has to act like a man, and not like a cardboard clockwork robot or a sockpuppet yanked out of his established character to go through a jerky, awkward pantomime to make today’s public service announcement on behalf of politically correct obsessions about problems solved before I was born.</p><p>If eccentric billionaire wants to build a supersuit out of dwarf star matter so he can shrink down to atom-size and fight very small crimes, I will buy that and come back for more, bringing my friends with me, and throw money at the writer. But if smoking hot computer genius girl kisses the first kiss, that breaks me out of the spell of the story, and I sit glowering at how unbelievable the writing is.</p><p>Women make all the first moves in Twenty Firster mythology, because the simple truth that weak men drive women insane, and insane women make men weak, has simply been ignored.</p></blockquote><p>First, the notion of female pursuit is directly related to the socio-sexual rank of the male writers. To the Gamma, women are inexplicable. They have no idea why the woman abruptly decides to take her clothes off, so anytime you read of an attractive woman, who has hitherto exhibited absolutely no interest in the intelligent protagonist who has been intensely respecting her by showing absolutely no interest in her, suddenly crawling into the sleeping bag of said protagonist, you can be 100 percent certain that the author is a Gamma.</p><p>Second, most writers of Pink SF/F, in any format, are not only ignorant, but proudly so. The battle scenes in the most recent episode of <i>A Game of Thrones</i> were so shockingly inept and historically ignorant that I found myself wondering if Kameron Hurley had been hired as the historical consultant.</p><p>As one wag put it on Twitter: <i>A cavalry charge? I’d better put my pikes in reserve!</i></p><p>And while I’m at it, I’ll refrain from ordering my archers to fire at them as they approach. Then I’ll send my infantry in to surround the survivors, so they can’t break and run, thereby preventing my cavalry from riding them down and slaughtering them from behind. And when the totally predictable enemy reinforcements arrive just in the nick of time, because I’ve been busy posturing rather than simply destroying the surrounded enemy, instead of withdrawing my army and retreating to my fortress, I’ll just stand around and watch them get entirely wiped out before fleeing by myself.</p><p>It was the second-most retarded battle scene I’ve ever seen, topped only by Faramir leading Gondor’s cavalry against a fortified position manned by archers in <i>The Return of the King</i>. I was always curious about what the cavalry was intended to do if they somehow managed to survive the hail of arrows and reach the walls that no horse could possibly climb.</p><p>Anyhow, the Twenty Firster inanity goes well beyond psychology, because both logic and history are mysteries to them as well.</p></div>",
  "content_text": "It goes well beyond that, of course, but it serves as a useful example. John Wright explains how what he calls “the Twenty Firsters”\ncripple their own entertainment\n:\nThese are basic rule of psychology that everyone knows, or should know, if his brain is not gummed up with political correctness.\nBasic rules of storytelling 101: the tale cannot violate the basic rules of psychology 101. (See Mark Twain’s description of Leatherstocking Tales for details.)\nThe writer can have the characters in odd situations, and, in a superhero yarn, the oddness can involve countless impossible absurdities of time travel, cloning, robots, talking apes, necromancers, mind readers, secret societies, immortals, revenants from the dead, parallel dimensions, millionaire playboys dressed like Robin Hood, and anything else you like: BUT the character’s reaction to these impossible things, no matter how absurdly impossible, must not only be possible, but likely and reasonable for a real human being in the unreal situation, or otherwise the writer shatters the suspension of disbelief.\nA man can be a superman with ninescore ninety and nine impossible super powers plus one, but he has to act like a man, and not like a cardboard clockwork robot or a sockpuppet yanked out of his established character to go through a jerky, awkward pantomime to make today’s public service announcement on behalf of politically correct obsessions about problems solved before I was born.\nIf eccentric billionaire wants to build a supersuit out of dwarf star matter so he can shrink down to atom-size and fight very small crimes, I will buy that and come back for more, bringing my friends with me, and throw money at the writer. But if smoking hot computer genius girl kisses the first kiss, that breaks me out of the spell of the story, and I sit glowering at how unbelievable the writing is.\nWomen make all the first moves in Twenty Firster mythology, because the simple truth that weak men drive women insane, and insane women make men weak, has simply been ignored.\nFirst, the notion of female pursuit is directly related to the socio-sexual rank of the male writers. To the Gamma, women are inexplicable. They have no idea why the woman abruptly decides to take her clothes off, so anytime you read of an attractive woman, who has hitherto exhibited absolutely no interest in the intelligent protagonist who has been intensely respecting her by showing absolutely no interest in her, suddenly crawling into the sleeping bag of said protagonist, you can be 100 percent certain that the author is a Gamma.\nSecond, most writers of Pink SF/F, in any format, are not only ignorant, but proudly so. The battle scenes in the most recent episode of\nA Game of Thrones\nwere so shockingly inept and historically ignorant that I found myself wondering if Kameron Hurley had been hired as the historical consultant.\nAs one wag put it on Twitter:\nA cavalry charge? I’d better put my pikes in reserve!\nAnd while I’m at it, I’ll refrain from ordering my archers to fire at them as they approach. Then I’ll send my infantry in to surround the survivors, so they can’t break and run, thereby preventing my cavalry from riding them down and slaughtering them from behind. And when the totally predictable enemy reinforcements arrive just in the nick of time, because I’ve been busy posturing rather than simply destroying the surrounded enemy, instead of withdrawing my army and retreating to my fortress, I’ll just stand around and watch them get entirely wiped out before fleeing by myself.\nIt was the second-most retarded battle scene I’ve ever seen, topped only by Faramir leading Gondor’s cavalry against a fortified position manned by archers in\nThe Return of the King\n. I was always curious about what the cavalry was intended to do if they somehow managed to survive the hail of arrows and reach the walls that no horse could possibly climb.\nAnyhow, the Twenty Firster inanity goes well beyond psychology, because both logic and history are mysteries to them as well.",
  "tags": [
    "Pink SF",
    "Rules of Writing"
  ],
  "categories": [],
  "sitemap_lastmod": "2016-06-21T17:19:00+00:00"
}