{
  "url": "https://voxday.net/2016/06/08/the-myth-of-female-achievemen/",
  "scraped_at": "2025-12-17T18:00:46.747434",
  "title": "The myth of female achievement",
  "date_display": "June 8, 2016",
  "date_iso": "2016-06-08T12:03:00+00:00",
  "date_from_url": "2016-06-08",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>It’s a little embarrassing when one’s knowledge doesn’t even rise to the level of Wikipedia. While I knew she had a male “co-pilot”, (and assumed that he’d done the takeoff and landing), I had no idea that <a href=\"https://dalrock.wordpress.com/2016/06/07/it-would-be-petty-to-point-out-how-petty-it-is/\">Amelia Earheart didn’t actually do any flying</a> in her trip across the Atlantic in her landmark “flight”.</p><blockquote class=\"tr_bq\"><p> After Lindbergh’s amazing feat he was an instant hero.  What he attempted was so astounding that before he even landed there were huge crowds gathered at the intended landing field outside Paris, waiting to see if this unknown airmail pilot from America could pull it off:</p><p> <i>   The airfield was not marked on his map and Lindbergh knew only that it was some seven miles northeast of the city. He initially mistook the airfield for some large industrial complex with bright lights spreading out in all directions. The lights were, in fact, the headlights of tens of thousands of cars all driven by eager spectators now caught in “the largest traffic jam in Parisian history.”[55]</i></p><p>    A crowd estimated at 150,000 spectators stormed the field, dragged Lindbergh out of the cockpit, and literally carried him around above their heads for “nearly half an hour”.</p><p>This was just the crowd that gathered to see if he could pull it off.  Lindbergh had no radio on board so all the crowd knew was that he had taken off 33 hours prior and was intending to land at that airfield.  After he landed he was an instant worldwide sensation.</p><p><i>    The adulation and celebration of Lindbergh that emerged after the solo Atlantic flight were unprecedented. People were “behaving as though Lindbergh had walked on water, not flown over it.”[64]:17…</i></p><p>    Within a year of his flight, a quarter of Americans (an estimated 30 million) personally saw Lindbergh and the Spirit of St. Louis.[76]</p><p>For feminists the idea of a man receiving this much praise and attention was unbearable.  All of the attention given to “Lucky Lindy” created a frantic search for a woman who could be named “Lady Lindy”. This was not a race to see which woman would be the first to prove her mettle, it was a race to change the subject and mark aviation as a feminine space.  This is why all that mattered was that a woman ride in an airplane across the Atlantic, so long as she looked the part.</p></blockquote><p>It is rather remarkable how long women’s “achievements” have been little more than the equivalent of little sister attempting to keep up with big brother. I mean, one would think that at least <i>occasionally</i> a woman would come up with the idea of trying to do something that no one has done before, but apparently imitating men – or even pretending to imitate men – is more important to these Hultgreen-Curie candidates than actually doing anything new.</p><p>I’m no Freudian and I think most of his theories are obvious nonsense, but the Hultgreen-Curie types do lend a modicum of credibility to his penis envy hypothesis.</p></div>",
  "content_text": "It’s a little embarrassing when one’s knowledge doesn’t even rise to the level of Wikipedia. While I knew she had a male “co-pilot”, (and assumed that he’d done the takeoff and landing), I had no idea that\nAmelia Earheart didn’t actually do any flying\nin her trip across the Atlantic in her landmark “flight”.\nAfter Lindbergh’s amazing feat he was an instant hero.  What he attempted was so astounding that before he even landed there were huge crowds gathered at the intended landing field outside Paris, waiting to see if this unknown airmail pilot from America could pull it off:\nThe airfield was not marked on his map and Lindbergh knew only that it was some seven miles northeast of the city. He initially mistook the airfield for some large industrial complex with bright lights spreading out in all directions. The lights were, in fact, the headlights of tens of thousands of cars all driven by eager spectators now caught in “the largest traffic jam in Parisian history.”[55]\nA crowd estimated at 150,000 spectators stormed the field, dragged Lindbergh out of the cockpit, and literally carried him around above their heads for “nearly half an hour”.\nThis was just the crowd that gathered to see if he could pull it off.  Lindbergh had no radio on board so all the crowd knew was that he had taken off 33 hours prior and was intending to land at that airfield.  After he landed he was an instant worldwide sensation.\nThe adulation and celebration of Lindbergh that emerged after the solo Atlantic flight were unprecedented. People were “behaving as though Lindbergh had walked on water, not flown over it.”[64]:17…\nWithin a year of his flight, a quarter of Americans (an estimated 30 million) personally saw Lindbergh and the Spirit of St. Louis.[76]\nFor feminists the idea of a man receiving this much praise and attention was unbearable.  All of the attention given to “Lucky Lindy” created a frantic search for a woman who could be named “Lady Lindy”. This was not a race to see which woman would be the first to prove her mettle, it was a race to change the subject and mark aviation as a feminine space.  This is why all that mattered was that a woman ride in an airplane across the Atlantic, so long as she looked the part.\nIt is rather remarkable how long women’s “achievements” have been little more than the equivalent of little sister attempting to keep up with big brother. I mean, one would think that at least\noccasionally\na woman would come up with the idea of trying to do something that no one has done before, but apparently imitating men – or even pretending to imitate men – is more important to these Hultgreen-Curie candidates than actually doing anything new.\nI’m no Freudian and I think most of his theories are obvious nonsense, but the Hultgreen-Curie types do lend a modicum of credibility to his penis envy hypothesis.",
  "tags": [
    "women"
  ],
  "categories": [],
  "sitemap_lastmod": "2016-06-08T11:03:00+00:00"
}