{
  "url": "https://voxday.net/2016/06/29/the-insanity-of-pink-sf/",
  "scraped_at": "2025-12-17T18:03:34.916237",
  "title": "The insanity of Pink SF",
  "date_display": "June 29, 2016",
  "date_iso": "2016-06-29T12:00:00+00:00",
  "date_from_url": "2016-06-29",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>Imagine, if you will, the idea of “species-neutral” fiction. And in that school of writing, it was decided by those who adhere to it that true literary quality was determined by how closely the author managed to eliminate all signs of what species an animal belonged to. The more difficult it was to determine whether an animal was a cat or a dog, the harder it was to distinguish between a horse and a cow, or a rabbit and fox, the better the writing was considered to be.</p><p>Do you think that this new school of writing might have an effect if books like <i>Watership Down</i> or <i>Misty of Chincoteague</i> or even <i>Mr. Popper’s Penguins</i> were rewritten? Do you think this species-neutrality would it change them for the better or for the worse?</p><p>Because, you see, that is much the same effect that the race-neutrality and sex-neutrality have on Pink SF books and short stories. And yet, that is precisely their objective! McCreepy, otherwise known as Tor Books author Jim C. Hines, explains the ideal way for a Pink SF writer duly devoted to race- and sex-neutrality to improve her writing.</p><p>I would, of course, have written “his writing” according to the rules of English grammar, but I am interested in improving my literary style and I am reliably informed that “gender-swapping” is the way to do it.<br/></p><blockquote><p> Jim C. Hines<br> Years ago, I went back and rewrote a story, changing from a male PoV protagonist to female. It was educational and eye-opening, and made me see a lot of unconscious and ingrained assumptions I’d been carrying.</br></p><p>Samizdat<br> I did that with my WIP, swapped the male lead to female, then had the same people read what I had so far. The women loved it, the men hated it, whereas before the men loved it, and the women were just sorta meh about it. Made me decide to leave it as a female lead. I figured, if it was making the men so uncomfortable, then I was doing something right.</br></p><p>John L. Payton<br> You’ve demonstrated an excellent exercise here, one that any writers’ group would do well to adopt. If the piece sounds unrealistic when gender-swapped, then it needs more work. I intend to keep this in mind. Thank you.</br></p><p>Jim C. Hines<br> Masculinity can be toxic as hell. We could do whole books about the physical and emotional rigidity, the brutal punishment for men who stray too far from the narrowly-defined idea of what a man “should” be, the obsession with power and control and the damage that does to men and the people around them, and so much more. Getting rid of sexism and creating a more aware and accepting culture when it comes to gender would benefit everyone involved, not just women.</br></p></blockquote><p>What is astonishing, and all too telling, is Samizdat’s reaction to the men hating her protagonist. Instead of deciding that it is a terrible idea to intentionally pursue a strategy that her readers hate, she decides that cramming it down their throats is “doing something right”. And then these people are surprised and dismayed when they discover that no one is interested in buying or reading their books.</p><p>Just remember, if there are any observable differences in the behavior of male and female characters in your writing, they must be eradicated. Also, please try to avoid using the terms “cat” and “dog”, as they, too, are offensive. The preferred term is “companion animal of indeterminate species”.</p><p>They really believe this nonsense. Sarah Hoyt’s term, “grey goo”, is apt indeed. I’ve written before about how their moralblindness <a href=\"http://www.milobookclub.com/2011/02/23/bakker-on-triumph-of-modern-fantasy/\">renders their works devoid of color</a> to <a href=\"http://www.milobookclub.com/2011/02/24/lets-try-this-one-more-time/\">their artistic detriment</a>, but now they have thrown out perspective and are intentionally blurring the monochromatic lines as well. They are intentionally doing their best to render their works flat, unrealistic, and devoid of life, so it should come as no surprise that they have succeeded so well in doing so.</p></div>",
  "content_text": "Imagine, if you will, the idea of “species-neutral” fiction. And in that school of writing, it was decided by those who adhere to it that true literary quality was determined by how closely the author managed to eliminate all signs of what species an animal belonged to. The more difficult it was to determine whether an animal was a cat or a dog, the harder it was to distinguish between a horse and a cow, or a rabbit and fox, the better the writing was considered to be.\nDo you think that this new school of writing might have an effect if books like\nWatership Down\nor\nMisty of Chincoteague\nor even\nMr. Popper’s Penguins\nwere rewritten? Do you think this species-neutrality would it change them for the better or for the worse?\nBecause, you see, that is much the same effect that the race-neutrality and sex-neutrality have on Pink SF books and short stories. And yet, that is precisely their objective! McCreepy, otherwise known as Tor Books author Jim C. Hines, explains the ideal way for a Pink SF writer duly devoted to race- and sex-neutrality to improve her writing.\nI would, of course, have written “his writing” according to the rules of English grammar, but I am interested in improving my literary style and I am reliably informed that “gender-swapping” is the way to do it.\nJim C. Hines\nYears ago, I went back and rewrote a story, changing from a male PoV protagonist to female. It was educational and eye-opening, and made me see a lot of unconscious and ingrained assumptions I’d been carrying.\nSamizdat\nI did that with my WIP, swapped the male lead to female, then had the same people read what I had so far. The women loved it, the men hated it, whereas before the men loved it, and the women were just sorta meh about it. Made me decide to leave it as a female lead. I figured, if it was making the men so uncomfortable, then I was doing something right.\nJohn L. Payton\nYou’ve demonstrated an excellent exercise here, one that any writers’ group would do well to adopt. If the piece sounds unrealistic when gender-swapped, then it needs more work. I intend to keep this in mind. Thank you.\nJim C. Hines\nMasculinity can be toxic as hell. We could do whole books about the physical and emotional rigidity, the brutal punishment for men who stray too far from the narrowly-defined idea of what a man “should” be, the obsession with power and control and the damage that does to men and the people around them, and so much more. Getting rid of sexism and creating a more aware and accepting culture when it comes to gender would benefit everyone involved, not just women.\nWhat is astonishing, and all too telling, is Samizdat’s reaction to the men hating her protagonist. Instead of deciding that it is a terrible idea to intentionally pursue a strategy that her readers hate, she decides that cramming it down their throats is “doing something right”. And then these people are surprised and dismayed when they discover that no one is interested in buying or reading their books.\nJust remember, if there are any observable differences in the behavior of male and female characters in your writing, they must be eradicated. Also, please try to avoid using the terms “cat” and “dog”, as they, too, are offensive. The preferred term is “companion animal of indeterminate species”.\nThey really believe this nonsense. Sarah Hoyt’s term, “grey goo”, is apt indeed. I’ve written before about how their moralblindness\nrenders their works devoid of color\nto\ntheir artistic detriment\n, but now they have thrown out perspective and are intentionally blurring the monochromatic lines as well. They are intentionally doing their best to render their works flat, unrealistic, and devoid of life, so it should come as no surprise that they have succeeded so well in doing so.",
  "tags": [
    "Rules of Writing"
  ],
  "categories": [],
  "sitemap_lastmod": "2016-06-29T11:00:00+00:00"
}