{
  "url": "https://voxday.net/2016/06/24/the-brighter-side-of-pink-sf/",
  "scraped_at": "2025-12-17T18:02:57.731175",
  "title": "The brighter side of Pink SF",
  "date_display": "June 24, 2016",
  "date_iso": "2016-06-24T17:55:00+00:00",
  "date_from_url": "2016-06-24",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><div class=\"separator\" style=\"clear: both; text-align: center;\"> <a href=\"http://s3-ec.buzzfed.com/static/enhanced/webdr01/2013/5/15/13/enhanced-buzz-wide-25236-1368639743-30.jpg\" imageanchor=\"1\" style=\"margin-left: 1em; margin-right: 1em;\"><img border=\"0\" decoding=\"async\" fetchpriority=\"high\" height=\"287\" src=\"http://s3-ec.buzzfed.com/static/enhanced/webdr01/2013/5/15/13/enhanced-buzz-wide-25236-1368639743-30.jpg\" width=\"400\"/></a></div><p>Of course, these are Democrats in general, once we limit the discussion to the SJW subset you can be certain that far more than a paltry 34.4 percent of them are suffering from depression or some other mental health issue. These people are not sane or healthy, they are quite literally sick in mind, body, and soul. Case in point: our friends at File 770.</p><blockquote class=\"tr_bq\"><p> Tasha Turner:</p><p>Any trigger warnings for <i>Seveneves</i>? One of the few things I still need to read to finish off my Hugo voting. I’ve had a couple things trigger my PTSD over the last couple weeks and am trying to avoiding books with of my major issues: abuse, suicide, torture, fridging, loads of graphic violence…</p><p>Paul Weimer:</p><p>RE: <i>Fifth Season</i>. I concur with many above. Not a happy book, and if I was in one of my down depressive cycles, definitely not the book I should be personally reading. Fortunately I read it when I was on an even keel and so was able to absorb the book’s bleak tone (Starting WITH the apocalypse, and not getting happier from there) with equanimity.</p></blockquote><p>Sounds like a fun, upbeat, and <i>totally</i> stable group of people, doesn’t it? I may have to rethink my Hugo voting order; if N.K. Jeminsin’s Hugo-nominated <i>The Fifth Season</i> is inspiring SJWs to off themselves, maybe there is something to this award-winning Pink SF sewage after all!</p></div>",
  "content_text": "Of course, these are Democrats in general, once we limit the discussion to the SJW subset you can be certain that far more than a paltry 34.4 percent of them are suffering from depression or some other mental health issue. These people are not sane or healthy, they are quite literally sick in mind, body, and soul. Case in point: our friends at File 770.\nTasha Turner:\nAny trigger warnings for\nSeveneves\n? One of the few things I still need to read to finish off my Hugo voting. I’ve had a couple things trigger my PTSD over the last couple weeks and am trying to avoiding books with of my major issues: abuse, suicide, torture, fridging, loads of graphic violence…\nPaul Weimer:\nRE:\nFifth Season\n. I concur with many above. Not a happy book, and if I was in one of my down depressive cycles, definitely not the book I should be personally reading. Fortunately I read it when I was on an even keel and so was able to absorb the book’s bleak tone (Starting WITH the apocalypse, and not getting happier from there) with equanimity.\nSounds like a fun, upbeat, and\ntotally\nstable group of people, doesn’t it? I may have to rethink my Hugo voting order; if N.K. Jeminsin’s Hugo-nominated\nThe Fifth Season\nis inspiring SJWs to off themselves, maybe there is something to this award-winning Pink SF sewage after all!",
  "tags": [
    "Pink SF",
    "SJW"
  ],
  "categories": [],
  "sitemap_lastmod": "2016-06-24T16:55:00+00:00"
}