{
  "url": "https://voxday.net/2016/06/22/the-military-geniuses-at-file-770/",
  "scraped_at": "2025-12-17T18:02:38.736058",
  "title": "The military geniuses at File 770",
  "date_display": "June 22, 2016",
  "date_iso": "2016-06-22T12:00:00+00:00",
  "date_from_url": "2016-06-22",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>I never stop finding it amusing how the File 770 idiots will defend literally ANY position rather than accept the fact that I am correct about anything, no matter how obvious. Aaron is reliably the least intelligent commenter there, <a href=\"http://file770.com/?p=29637#comment-448689\">as he demonstrates</a> with this comment in defense of the tactical incompetence demonstrated by military commanders Jon Snow and Ramsay Bolton on <i>A Game of Thrones</i>:</p><blockquote class=\"tr_bq\"><p> I wonder if Beale actually watched the show, or if he just had it badly recounted to him. Bolton sent his cavalry first after goading Snow into the open, clearly hoping to kill Snow before help could arrive. It was only because the Stark cavalry counter charged that there was a cavalry battle. There was never an option for Bolton to receive the Stark cavalry with pikemen, because the Stark cavalry weren’t going to charge them but for Snow being exposed. For their part, the Starks had no pikemen to deploy against the Bolton cavalry.</p><p>All of Beale’s complaints about the battle that follow assume that Bolton could have simply waited for the Stark forces to launch their cavalry at the Bolton line and stop them with pikes, which would have required abject stupidity on the part of Snow. The complaint about not being prepared for the Knights of the Vale to arrive assume that Bolton could see the future and predict the arrival of reinforcements that even Snow didn’t know were coming. To be fair, Bolton should have had scouts out to look for additional forces, but he thought he knew the entire disposition of the Stark forces already.</p><p>In short, it seems that Beale didn’t pay attention to what was shown on screen, and didn’t understand what was happening.</p></blockquote><p>That conclusion seems entirely credible, as anyone who has ever read <i>A Throne of Bones</i>, read any of the books by Lind or van Creveld published by Castalia, or played ASL will no doubt agree.</p><ol><li>Aaron is defending how Ramsay sent out his ENTIRE cavalry to ride down a single man on foot instead simply killing Snow with a single arrow himself, or having his entire archery contingent turn him into a pincushion with dozens of arrows. Bolton had absolutely no need to put his cavalry at risk, or even to issue an order to anyone at all, to kill the enemy general.</li><li>What competent general would fail to understand that the enemy cavalry might ride out if he was dumb enough to give up his tactical and numerical advantages advancing it while leaving his infantry behind? At least the British tank commander who drove past his American infantry screen into the sights of the German tank destroyer in <i>Band of Brothers</i> was obeying what he knew to be suicidally stupid orders.</li><li>There was an option for Bolton to receive the Stark cavalry with pikemen; all he had to do was order his cavalry to disengage and circle back as soon as the Stark cavalry charged while advancing his pikemen. Ancient and medieval armies did this sort of thing all the time, particularly experienced, well-equipped, well-trained armies of the sort Bolton was commanding. That would have actually been a barely credible ruse that would depend upon the Stark cavalry being dumb enough to a) believe Bolton was launching a cavalry-first attack and b) respond to it with their own charge.</li><li>First, Bolton could have simply waited for Stark to launch their cavalry, or their infantry, for that matter, at them. Stark was attacking, after all, and Bolton had the leisure to choose to engage or not, as he saw fit. Second, the statement that it was implausible because it would have required “abject stupidity on the part of Snow” is laughable, considering that Snow is observably dumb enough to single-handedly charge the entire enemy army by himself.</li><li>Bolton didn’t need to see the future to know the Knights of the Vale were on their way to the battlefield. As a West Pointer noted yesterday, this marks the fourth time on the show that reinforcements have unexpectedly arrived and saved the day, because apparently no one in Westeros has ever heard of pickets, patrols, or even establishing a command post on a hillside that provides good visibility of the surroundings in all four directions. And it’s not as if Bolton was unaware of the relationship between Littlefinger and his wife or should have failed to at least anticipate <i>the possibility</i> of the Vale’s intervention. Remember, Ramsay Bolton was the commander who beat the man lauded as the best general in Westeros.</li><li>And there it is. The Gamma tell: “it seems….”</li></ol><p>It’s clear that neither the producers of the episode, nor Aaron, has any idea how cavalry was, and is, used on the battlefield. It is a secondary arm; it is the infantry that is “the queen of the battlefield”. Hollywood likes horses because they are exciting and dramatic, but one should never allow oneself to be misguided into thinking that the tactics one is seeing on the screen are even remotely reasonable, let alone realistic or historically plausible.</p><p>It’s too bad, because during the planning session, it sounded as if they were setting up for a recreation of the Battle of Cannae and its famous double-envelopment. I wasn’t surprised when they didn’t, though, as soon as I saw the cavalry being prominently featured. Contra Hollywood, cavalry is primarily used to launch flanking and rear attacks, to strike the killing blow, and to exploit the victory that the infantry has already won, not to play the primary role in the outcome of the battle.</p></div>",
  "content_text": "I never stop finding it amusing how the File 770 idiots will defend literally ANY position rather than accept the fact that I am correct about anything, no matter how obvious. Aaron is reliably the least intelligent commenter there,\nas he demonstrates\nwith this comment in defense of the tactical incompetence demonstrated by military commanders Jon Snow and Ramsay Bolton on\nA Game of Thrones\n:\nI wonder if Beale actually watched the show, or if he just had it badly recounted to him. Bolton sent his cavalry first after goading Snow into the open, clearly hoping to kill Snow before help could arrive. It was only because the Stark cavalry counter charged that there was a cavalry battle. There was never an option for Bolton to receive the Stark cavalry with pikemen, because the Stark cavalry weren’t going to charge them but for Snow being exposed. For their part, the Starks had no pikemen to deploy against the Bolton cavalry.\nAll of Beale’s complaints about the battle that follow assume that Bolton could have simply waited for the Stark forces to launch their cavalry at the Bolton line and stop them with pikes, which would have required abject stupidity on the part of Snow. The complaint about not being prepared for the Knights of the Vale to arrive assume that Bolton could see the future and predict the arrival of reinforcements that even Snow didn’t know were coming. To be fair, Bolton should have had scouts out to look for additional forces, but he thought he knew the entire disposition of the Stark forces already.\nIn short, it seems that Beale didn’t pay attention to what was shown on screen, and didn’t understand what was happening.\nThat conclusion seems entirely credible, as anyone who has ever read\nA Throne of Bones\n, read any of the books by Lind or van Creveld published by Castalia, or played ASL will no doubt agree.\nAaron is defending how Ramsay sent out his ENTIRE cavalry to ride down a single man on foot instead simply killing Snow with a single arrow himself, or having his entire archery contingent turn him into a pincushion with dozens of arrows. Bolton had absolutely no need to put his cavalry at risk, or even to issue an order to anyone at all, to kill the enemy general.\nWhat competent general would fail to understand that the enemy cavalry might ride out if he was dumb enough to give up his tactical and numerical advantages advancing it while leaving his infantry behind? At least the British tank commander who drove past his American infantry screen into the sights of the German tank destroyer in\nBand of Brothers\nwas obeying what he knew to be suicidally stupid orders.\nThere was an option for Bolton to receive the Stark cavalry with pikemen; all he had to do was order his cavalry to disengage and circle back as soon as the Stark cavalry charged while advancing his pikemen. Ancient and medieval armies did this sort of thing all the time, particularly experienced, well-equipped, well-trained armies of the sort Bolton was commanding. That would have actually been a barely credible ruse that would depend upon the Stark cavalry being dumb enough to a) believe Bolton was launching a cavalry-first attack and b) respond to it with their own charge.\nFirst, Bolton could have simply waited for Stark to launch their cavalry, or their infantry, for that matter, at them. Stark was attacking, after all, and Bolton had the leisure to choose to engage or not, as he saw fit. Second, the statement that it was implausible because it would have required “abject stupidity on the part of Snow” is laughable, considering that Snow is observably dumb enough to single-handedly charge the entire enemy army by himself.\nBolton didn’t need to see the future to know the Knights of the Vale were on their way to the battlefield. As a West Pointer noted yesterday, this marks the fourth time on the show that reinforcements have unexpectedly arrived and saved the day, because apparently no one in Westeros has ever heard of pickets, patrols, or even establishing a command post on a hillside that provides good visibility of the surroundings in all four directions. And it’s not as if Bolton was unaware of the relationship between Littlefinger and his wife or should have failed to at least anticipate\nthe possibility\nof the Vale’s intervention. Remember, Ramsay Bolton was the commander who beat the man lauded as the best general in Westeros.\nAnd there it is. The Gamma tell: “it seems….”\nIt’s clear that neither the producers of the episode, nor Aaron, has any idea how cavalry was, and is, used on the battlefield. It is a secondary arm; it is the infantry that is “the queen of the battlefield”. Hollywood likes horses because they are exciting and dramatic, but one should never allow oneself to be misguided into thinking that the tactics one is seeing on the screen are even remotely reasonable, let alone realistic or historically plausible.\nIt’s too bad, because during the planning session, it sounded as if they were setting up for a recreation of the Battle of Cannae and its famous double-envelopment. I wasn’t surprised when they didn’t, though, as soon as I saw the cavalry being prominently featured. Contra Hollywood, cavalry is primarily used to launch flanking and rear attacks, to strike the killing blow, and to exploit the victory that the infantry has already won, not to play the primary role in the outcome of the battle.",
  "tags": [
    "trainwreck",
    "war"
  ],
  "categories": [],
  "sitemap_lastmod": "2016-06-22T11:00:00+00:00"
}