{
  "url": "https://voxday.net/2016/06/30/the-mask-comes-off/",
  "scraped_at": "2025-12-17T18:03:41.289221",
  "title": "The mask comes off",
  "date_display": "June 30, 2016",
  "date_iso": "2016-06-30T10:15:00+00:00",
  "date_from_url": "2016-06-30",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>Remember, the EU proponents always swore up and down that it was not a political project. Of course, as some of us always knew, they lied. Now they’re not even bothering to pretend otherwise anymore, as in reaction to Brexit, two foreign ministers <a href=\"http://www.express.co.uk/news/politics/683739/EU-referendum-German-French-European-superstate-Brexit\">propose eliminating all the other national member-states</a> before any other nations are able to escape globalist rule.</p><blockquote class=\"tr_bq\"><p> The foreign ministers of France and Germany are due to reveal a blueprint to effectively do away with individual member states in what is being described as an “ultimatum”. Under the radical proposals EU countries will lose the right to have their own army, criminal law, taxation system or central bank, with all those powers being transferred to Brussels.</p><p>Controversially member states would also lose what few controls they have left over their own borders, including the procedure for admitting and relocating refugees.  The plot has sparked fury and panic in Poland – a traditional ally of Britain in the fight against federalism – after being leaked to Polish news channel TVP Info.</p><p>The public broadcaster reported the bombshell proposal would be presented to a meeting of the Visegrad group of countries – made up of Poland, the Czech Republic, Hungary and Slovakia – by German Foreign Minister Frank-Walter Steinmeier.</p><p>In the preamble to the text the two ministers write: <i>“Our countries share a common destiny and a common set of values that give rise to an even closer union between our citizens. We will therefore strive for a political union in Europe and invite the next Europeans to participate in this venture.”</i></p><p>The revelations come just days after Britain shook the Brussels establishment by voting to leave the European Union in a move some have predicted could leave to the break-up of the EU.</p><p>A number of member states are deeply unhappy about the creeping federalism of the European project with anti-EU sentiments running high in eastern Europe, Scandinavia and France.</p></blockquote><p>I can’t think of anything that will bring about Fixit and Frexit and Nexit, and any number of additional exits faster, than the EU doubling down on political integration. It’s prodigiously stupid in any event; it could not be more obvious that economic integration has completely failed. But, as we know, SJWs always double down, and apparently there is no amount of failure and democratic rejection that will even slow down the globalists in their mad grasp for international power.</p><p>I have never been more certain that the EU will collapse, hopefully sooner rather than later. Socionomics always predicted the EU’s failure to be inevitable, but now we’re actually beginning to see it happen.</p></div>",
  "content_text": "Remember, the EU proponents always swore up and down that it was not a political project. Of course, as some of us always knew, they lied. Now they’re not even bothering to pretend otherwise anymore, as in reaction to Brexit, two foreign ministers\npropose eliminating all the other national member-states\nbefore any other nations are able to escape globalist rule.\nThe foreign ministers of France and Germany are due to reveal a blueprint to effectively do away with individual member states in what is being described as an “ultimatum”. Under the radical proposals EU countries will lose the right to have their own army, criminal law, taxation system or central bank, with all those powers being transferred to Brussels.\nControversially member states would also lose what few controls they have left over their own borders, including the procedure for admitting and relocating refugees.  The plot has sparked fury and panic in Poland – a traditional ally of Britain in the fight against federalism – after being leaked to Polish news channel TVP Info.\nThe public broadcaster reported the bombshell proposal would be presented to a meeting of the Visegrad group of countries – made up of Poland, the Czech Republic, Hungary and Slovakia – by German Foreign Minister Frank-Walter Steinmeier.\nIn the preamble to the text the two ministers write:\n“Our countries share a common destiny and a common set of values that give rise to an even closer union between our citizens. We will therefore strive for a political union in Europe and invite the next Europeans to participate in this venture.”\nThe revelations come just days after Britain shook the Brussels establishment by voting to leave the European Union in a move some have predicted could leave to the break-up of the EU.\nA number of member states are deeply unhappy about the creeping federalism of the European project with anti-EU sentiments running high in eastern Europe, Scandinavia and France.\nI can’t think of anything that will bring about Fixit and Frexit and Nexit, and any number of additional exits faster, than the EU doubling down on political integration. It’s prodigiously stupid in any event; it could not be more obvious that economic integration has completely failed. But, as we know, SJWs always double down, and apparently there is no amount of failure and democratic rejection that will even slow down the globalists in their mad grasp for international power.\nI have never been more certain that the EU will collapse, hopefully sooner rather than later. Socionomics always predicted the EU’s failure to be inevitable, but now we’re actually beginning to see it happen.",
  "tags": [
    "decline and fall",
    "EU"
  ],
  "categories": [],
  "sitemap_lastmod": "2016-06-30T09:15:00+00:00"
}