{
  "url": "https://voxday.net/2016/06/03/trump-as-tribal-leader/",
  "scraped_at": "2025-12-17T18:00:09.087590",
  "title": "Trump as tribal leader",
  "date_display": "June 3, 2016",
  "date_iso": "2016-06-03T12:00:00+00:00",
  "date_from_url": "2016-06-03",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>Rod Dreher notes with alarm and chagrin <a href=\"http://www.theamericanconservative.com/dreher/trump-tribal-leader/\">the rise of a white tribal identity</a>:</p><blockquote class=\"tr_bq\"><p> Yes, Trump’s rise, and his rise as a white identity candidate, is frightening. But he didn’t come from nowhere, nor is he solely the creation of conservatism (indeed, he’s barely a conservative at all). I expect Hillary Clinton to use a lot of unity rhetoric this fall. But here’s the thing: if she wins, I fully expect her to govern as someone who treats my own tribe — conservative Christians — as the enemy. That does not mean I will vote for Trump, or will vote at all. I know conservative Christians who fear and loathe Trump so much that they’re going to vote for Hillary, a candidate they believe despises their kind, for the sake of the common good. I know Christians who despise Trump but who are voting for him, or withholding their vote, because they cannot cast a ballot for a candidate (Hillary) they are certain will name Supreme Court justices who will roll back religious liberty.</p><p>The point is that the nation is fractured and fracturing. Both political parties have benefited from the ideological divide they have created, and that historical circumstances have created. What’s new about Trump is that for the first time, many whites are seeing themselves the way Democrats and the liberal media have encouraged blacks, Hispanics, and gays to see themselves: as a tribe.</p></blockquote><p>This is significant, because it means the cuckservatives are beginning to figure out that their position is not merely a losing one, it is <i>entirely untenable</i>. We’ll know that full-blown tribal politics have become the new normal once even white SJWs like John Scalzi suddenly begin claiming that they were white nationalists all along.</p><p>Many of them already are, of course, there is a reason why Scalzi chooses to live in a lily-white Ohio town rather than among the various ethnics he professes to love so much. But for now, they still realize some value from pretending otherwise.</p><p>This is a very positive development for America, because America is, and always has been, a white Anglo nation. The fact that the political entity has been invaded and that political citizenship has been granted to anyone and everyone with a pulse merely means that the nation has submitted and been oppressed, it doesn’t mean that the nation has been changed in any material manner. Playing word games with definitions is the hallmark of those who stand irretrievably opposed to history, science, and reality, and they always wind up losing in the end.</p><p>Those who decry “Trumpism” have it entirely backwards. Trump is merely riding the wave of the rise of the birth of a generic white American identity, which like all such identities, is the result of external pressure rather than internal conviction. And that is why it does not matter what he says or does, because unlike so many of his predecessors on both sides of the political aisle, Donald Trump has aligned himself with the white American tribe.</p><p>It is long past time for white Americans to follow the lead of the blacks, the Jews, and the Asians, and allow themselves to be guided solely by the principle: <i>is it good for the whites?</i> Serve the nation, not the empire.</p><p>As for those who cry for the empire and fear it will be destroyed, yes, that is <i>exactly</i> what will happen. It is not longer fit for purpose. But it is a little late for tears, as its fate was settled in 1965.</p></div>",
  "content_text": "Rod Dreher notes with alarm and chagrin\nthe rise of a white tribal identity\n:\nYes, Trump’s rise, and his rise as a white identity candidate, is frightening. But he didn’t come from nowhere, nor is he solely the creation of conservatism (indeed, he’s barely a conservative at all). I expect Hillary Clinton to use a lot of unity rhetoric this fall. But here’s the thing: if she wins, I fully expect her to govern as someone who treats my own tribe — conservative Christians — as the enemy. That does not mean I will vote for Trump, or will vote at all. I know conservative Christians who fear and loathe Trump so much that they’re going to vote for Hillary, a candidate they believe despises their kind, for the sake of the common good. I know Christians who despise Trump but who are voting for him, or withholding their vote, because they cannot cast a ballot for a candidate (Hillary) they are certain will name Supreme Court justices who will roll back religious liberty.\nThe point is that the nation is fractured and fracturing. Both political parties have benefited from the ideological divide they have created, and that historical circumstances have created. What’s new about Trump is that for the first time, many whites are seeing themselves the way Democrats and the liberal media have encouraged blacks, Hispanics, and gays to see themselves: as a tribe.\nThis is significant, because it means the cuckservatives are beginning to figure out that their position is not merely a losing one, it is\nentirely untenable\n. We’ll know that full-blown tribal politics have become the new normal once even white SJWs like John Scalzi suddenly begin claiming that they were white nationalists all along.\nMany of them already are, of course, there is a reason why Scalzi chooses to live in a lily-white Ohio town rather than among the various ethnics he professes to love so much. But for now, they still realize some value from pretending otherwise.\nThis is a very positive development for America, because America is, and always has been, a white Anglo nation. The fact that the political entity has been invaded and that political citizenship has been granted to anyone and everyone with a pulse merely means that the nation has submitted and been oppressed, it doesn’t mean that the nation has been changed in any material manner. Playing word games with definitions is the hallmark of those who stand irretrievably opposed to history, science, and reality, and they always wind up losing in the end.\nThose who decry “Trumpism” have it entirely backwards. Trump is merely riding the wave of the rise of the birth of a generic white American identity, which like all such identities, is the result of external pressure rather than internal conviction. And that is why it does not matter what he says or does, because unlike so many of his predecessors on both sides of the political aisle, Donald Trump has aligned himself with the white American tribe.\nIt is long past time for white Americans to follow the lead of the blacks, the Jews, and the Asians, and allow themselves to be guided solely by the principle:\nis it good for the whites?\nServe the nation, not the empire.\nAs for those who cry for the empire and fear it will be destroyed, yes, that is\nexactly\nwhat will happen. It is not longer fit for purpose. But it is a little late for tears, as its fate was settled in 1965.",
  "tags": [
    "Americana",
    "politics"
  ],
  "categories": [],
  "sitemap_lastmod": "2016-06-03T11:00:00+00:00"
}