{
  "url": "https://voxday.net/2016/06/12/up-to-37500-views/",
  "scraped_at": "2025-12-17T18:01:16.818152",
  "title": "Up to 37,500 views!",
  "date_display": "June 12, 2016",
  "date_iso": "2016-06-12T15:30:00+00:00",
  "date_from_url": "2016-06-12",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>I expect you will understand why this announcement by McRapey made me laugh:</p><blockquote class=\"tr_bq\"><p> My piece earlier this week on Clinton and Sanders blew up a bit, with roughly 75,000 views over two days.</p></blockquote><p>Ah, how the most popular blog in science fiction has fallen. Sad! As one might expect, McRapey concludes that his declining site traffic must mean that blogs, while not quite dead yet, are less important than Facebook and Twitter.</p><p>What’s amusing is how McRapey considers <i>roughly</i> 37,500 daily views to be blowing up, whereas the traffic here averaged 67,955 daily views in May and is currently running at a rate of 76,166 views per day in June. Whatever’s traffic is now between one-fourth and one-fifth that of VP, and the ratio is steadily falling. I will not surprised if by this time next year, it is one-tenth.</p><p>While he’s correct to echo <a href=\"http://www.dangerandplay.com/2015/11/05/a-quick-note-on-drama/\">Mike Cernovich’s observations</a> in stating that Facebook and Twitter tend to be more reliable drivers of short-term link traffic these days, what McRapey fails to understand is that blogs have become online community centers that are capable <a href=\"http://www.dangerandplay.com/2016/01/11/mike-cernovich-banned-from-twitter/\">of supporting a broad range of activities</a>.</p><p>Such as, for example, this Jobs Wanted notification, before I forget and it disappears too far down the email list.</p><ul><li>Hiring: Intermediate/Senior Ruby on Rails developer in the Southeast USA. If you have experience working with clients, APIs and know your way around the rails framework and TDD, contact Vox who will forward me your emails. I’ll respond at which point we can talk specifics. Relocation necessary.</li></ul><p>Also, if you are a New Release subscriber, you’ll want to check your email tomorrow. Castalia has two new ebooks launching this month, which does not count the new print and audio editions being released. And as both the Production Editor and I have concluded, one of them is right up there with <i>Awake in the Night Land</i>; it’s definitely one of the best books we have published, and possibly even the best to date.</p></div>",
  "content_text": "I expect you will understand why this announcement by McRapey made me laugh:\nMy piece earlier this week on Clinton and Sanders blew up a bit, with roughly 75,000 views over two days.\nAh, how the most popular blog in science fiction has fallen. Sad! As one might expect, McRapey concludes that his declining site traffic must mean that blogs, while not quite dead yet, are less important than Facebook and Twitter.\nWhat’s amusing is how McRapey considers\nroughly\n37,500 daily views to be blowing up, whereas the traffic here averaged 67,955 daily views in May and is currently running at a rate of 76,166 views per day in June. Whatever’s traffic is now between one-fourth and one-fifth that of VP, and the ratio is steadily falling. I will not surprised if by this time next year, it is one-tenth.\nWhile he’s correct to echo\nMike Cernovich’s observations\nin stating that Facebook and Twitter tend to be more reliable drivers of short-term link traffic these days, what McRapey fails to understand is that blogs have become online community centers that are capable\nof supporting a broad range of activities\n.\nSuch as, for example, this Jobs Wanted notification, before I forget and it disappears too far down the email list.\nHiring: Intermediate/Senior Ruby on Rails developer in the Southeast USA. If you have experience working with clients, APIs and know your way around the rails framework and TDD, contact Vox who will forward me your emails. I’ll respond at which point we can talk specifics. Relocation necessary.\nAlso, if you are a New Release subscriber, you’ll want to check your email tomorrow. Castalia has two new ebooks launching this month, which does not count the new print and audio editions being released. And as both the Production Editor and I have concluded, one of them is right up there with\nAwake in the Night Land\n; it’s definitely one of the best books we have published, and possibly even the best to date.",
  "tags": [
    "decline and fall",
    "McRapey"
  ],
  "categories": [],
  "sitemap_lastmod": "2016-06-12T14:30:00+00:00"
}