{
  "url": "https://voxday.net/2016/06/09/who-killed-conservatis/",
  "scraped_at": "2025-12-17T18:00:52.338385",
  "title": "Who killed conservatism",
  "date_display": "June 9, 2016",
  "date_iso": "2016-06-09T08:06:00+00:00",
  "date_from_url": "2016-06-09",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>I am not a conservative and I have long had to correct those who mistakenly believed I was. Nevertheless, I promised John C. Wright that I would address his question concerning when and how “conservative” became a label to avoid, and who was responsible for the destruction of the ideological brand.</p><blockquote class=\"tr_bq\"><p> I am a conservative. Four months ago on this blog, if I had said that, everyone here would assume I mean conservative as opposed to ‘establishment republican’ meaning small-gov, separation-of-powers, gun-toting, Christ-loving, pro-family, strong-military, mistrustful of big government and big business.</p><p>Now, everyone here uses it as a term of abuse, to refer to the exact same thing, four months ago, you all were using the term ‘neocon’ or ‘GOP establishment’ to refer to: globalist, pro-crony-capitalism, Wall-Street-Incest-with-DC, pro-abortion, fuck-the-bible-thumpers, rule-of-man-not-rule-of-law.</p><p>Why did you switch the label? Why are you calling the name I call myself to refer, for example, not to what Ted Cruz and Donald Trump have in common (and they have more in common than what separates them) but to what Jeb Bush and Barack Obama have in common (and they agree with each other on all points where I disagree.)</p><p>Who or what marred the brand name? When Derbyshire and Anne Coulter was booted out of the good graces of National Review, I assumed National Review had lost it right to call itself conservative, not that Coulter and Derb (and I) were now a part of some new faction with a new name.</p><p>If y’all here are using the word conservative to refer to people who don’t favor the original intent of the US constitution and don’t know jack about history, this word simply does not describe me.</p><p>What is the word you use for someone who believes 1. reality is real 2. truth is when thoughts and statements reflect reality 3. beauty is when art reflects natural or divine glory 4. life is sacred 5. family life is sacred 6. the Rights of Man (life, liberty, property) ergo liberty and equality are sacred. God is sacred.</p><p>Add to this a love of one’s flag and ancestors, a loyal to one’s posterity, and a distrust of sudden or violent social change, and you have a crisp and clear picture of what it means to be a conservative.</p><p>But you gentlemen neither use the word to mean this, no provide me with any other word to use to describe myself.</p><p>I have never had this problem on the Right before, only on the Left. They go through backflips of misdirection and bad definitions to prevent me from having a word to use to refer to myself and those of my camp.</p></blockquote><p>Who or what marred the brand name? Three men, William F. Buckley, (((Norman Podhoretz))), and (((Irving Kristol))). Buckley began the <i>National Review</i> tradition of reading out various members of the Right from “the conservative movement”, a tradition which began with Buckley’s demonization of the John Birch Society and was subsequently continued by (((David Frum))) and Rich Lowry.</p><p>Those read out of conservatism include: Samuel Francis, Paul Craig Roberts, Joe Sobran, Jerry Pournelle, John Derbyshire, Ann Coulter, Pat Buchanan, and Mark Steyn, among many others. Earlier this year, <i>Commentary</i> lamented Buckley’s absence and warned of <a href=\"https://www.commentarymagazine.com/articles/coming-conservative-dark-age/\">“The Coming Conservative Dark Age”</a> due to his successors’ inability to exercise the same authority when playing conservative thought-police.</p><p><i>“When William F. Buckley Jr. died in 2008 at age 82, conservatives were deprived of his wit, his intelligence, his charisma, and his panache. But they also lost something more important than their leader’s charms. They lost his authority. And they need it now more than ever. It was Buckley who for decades determined the boundaries of American conservatism…. National Review is a great example of media gatekeeping theory: By exiling anti-Semites, Birchers, and anti-American reactionaries from its pages, the magazine and its editor determined which conservative arguments were legitimate and which were not.”</i></p><p>Podhoretz, the father of (((John Podhoretz))), was the liberal Democrat who edited <i>Commentary</i> and helped it “transform the Jewish left into the neoconservative right”. Irving Kristol, the father of would-be third-party founder (((Bill Kristol))), is the founder of neonconservatism.</p><p><i>“One can say that the historical task and political purpose of neoconservatism would seem to be this: to convert the Republican party, and American conservatism in general, against their respective wills, into a new kind of conservative politics suitable to governing a modern democracy…. Neoconservatism is the first variant of American conservatism in the past century that is in the “American grain.” It is hopeful, not lugubrious; forward-looking, not nostalgic; and its general tone is cheerful, not grim or dyspeptic. Its 20th-century heroes tend to be TR, FDR, and Ronald Reagan. Such Republican and conservative worthies as Calvin Coolidge, Herbert Hoover, Dwight Eisenhower, and Barry Goldwater are politely overlooked.”</i><br> – Irving Kristol, <a href=\"http://www.weeklystandard.com/the-neoconservative-persuasion/article/4246\">“The Neoconservative Persuasion”</a></br></p><p>While the Bush family, and its two presidents, also bear a fair amount of blame for the damage to the conservative brand, no one considered Bush the Elder a conservative and even Bush the Younger had to style himself a “compassionate conservative”. The failure of the Republican-controlled White House, House, and Senate to accomplish any of the conservative movement’s declared goals also played a role. But it was not until globalists such as John McCain, Mitt Romney, and Jeb Bush were anointed as true and proper conservatives, while avowed American nationalists like Donald Trump and all of his supporters were declared by the mainstream and conservative presses alike to be “not conservative”, that the brand was fatally tarnished. The conservative brand is now rightly rejected by the #AltRight and by every American nationalist.</p><p>To be a conservative now means to deny that an American national interest exists. It means to be opposed to the very idea that an American nation even <i>exists</i> except as “a proposition” to which one may assent. It means to be a nominal international equalitarian while at the same time putting Israel first. It means to regard GDP as the one true metric of national well-being. It means to advocate a strong US military in order to permit the USA to continue to police the world. It means to believe that the Holocaust is the worst thing ever to happen in human history, except for four score and seven years of slavery in America.</p><p>To be conservative means to conserve <i>nothing</i>, not even the posterity of the Founding Fathers, for whom the Constitution was written and whose unalienable rights the Bill of Rights was supposed to secure.</p><p>I think the old conservatives would do well to call themselves Constitutionalists, because it is obvious that the current batch don’t give a damn about it. And neither do we of the #AltRight, because it is obvious that the Constitution has not only failed, completely, by its own stated purpose, but is today being used as a means of hand-cuffing the Right. The #AltRight believes in three things:</p><ol><li>Nationalism.</li><li>Western civilization.</li><li>Winning.</li></ol><p>Everything else is negotiable or a means to one of those three ends. We aren’t conservatives. We aren’t philosophers. And we don’t care about the Constitution, the Rights of Man, the Enlightenment, the Holocaust, or anything else with capital letters that is likely to get in the way.</p><p>A Constitutionalist can be our ally. A Zionist can be our ally. A National Socialist can be our ally. A Pan-Arabist can be our ally. We don’t care who you are or what you believe, as long as you’re aiming in the direction of the enemies of nationalism and Western civilization.</p><p>Such as, for example, the self-styled conservatives who have turned their backs on America and proved themselves to be the Judases of the West, very nearly as dyscivic and dyscivilizational as the Left they nominally oppose. It is perhaps useful, therefore, to understand that conservatism was <i>never</i> what many of today’s conservatives erroneously believe it to be. From <a href=\"http://amzn.to/1Wnka63\"><i><b>Cuckservative: How “Conservatives” Betrayed America</b></i></a> by John Red Eagle and me:</p><blockquote class=\"tr_bq\"><p> In the early 1950s, the dominant political ideology in the United States was center-left liberalism, itself a reaction to the excesses of the socialist, totalitarian, eugenics-loving progressive movement. That today’s SJWs have re-embraced the progressive label is no accident and would be material enough for an entire book of its own. We have no plans to write such a book, though, since Jonah Goldberg’s <i>Liberal Fascism</i> provides a reasonable description of both the historical antecedent as well as the modern neoprogressive. With the onset of the Cold War, and the embarrassing revelations of the real conditions of life under socialist rule, the American left found itself going through one of its inevitable crises of confidence.</p><p>Into that void stepped a small group of intellectuals who set out to remake the even more shattered and demoralized American right. The older right, though sometimes referred to as paleoconservative by modern writers, actually had no such singular identity at the time. Unlike the United Kingdom, in the United States the word “conservative” had not been regularly applied to any particular political party or tradition. At most, it could be said that the older strains of thought shared a common Anglo-Saxon skepticism of centralized power, and a particularly American suspicion of elites, both foreign and domestic. But none of these intellectual strains were of any serious political influence in mid-20th-century America.</p><p>The early new rightists were interested in discerning the deeper roots of historical American political thought, and in turning its various strains into a viable, coherent political tradition. Some of them looked so deeply that they found inspiration from decidedly non-American sources, such as British conservative political thought. The latter was a generally elitist tradition, openly contemptuous of American-style independent citizenry and the freewheeling style of American political discourse. Among the leaders of this Anglophile camp was Russell Kirk, who is generally credited with coining the American use of the term conservative as a distinct political label. His most famous work, <i>The Conservative Mind</i>, proved to be quickly and profoundly influential soon after its publication in 1953. Kirk’s book synthesized various ideas from diverse 18th- and 19th-century thinkers, most prominently Edmund Burke, into six canons, or principles, of this new conservatism:</p><ol><li>Belief in a transcendent order, or body, of natural law, which rules society as well as conscience.</li><li>Affection for the proliferating variety and mystery of human existence, as opposed to the narrowing uniformity, egalitarianism, and utilitarian aims of most radical systems.</li><li>Conviction that civilized society requires orders and classes, as against the notion of a “classless society.”</li><li>Persuasion that freedom and property are closely linked.</li><li>Custom, convention, and old prescription are checks both upon man’s anarchic impulse and upon the innovator’s lust for power.</li><li>Recognition that change may not be salutory reform: hasty innovation may be a devouring conflagration, rather than a torch of progress. Society must alter, for prudent change is the means of social preservation; but a statesman must take Providence into his calculations.</li></ol><p>The astute reader will surely notice that cuckservatism, especially with regards to immigration, directly violates no less than one-third of Kirk’s conservative principles, namely, the last two. Cuckservatism fails to respect tradition, as it manifestly does not distrust those who would reconstruct all of society, and it refuses to recognize the possibility that change of the magnitude necessitated by the size of the 50-year mass migration will destroy, rather than improve, the nation.</p><p>Whatever the left may say about them, Kirk’s principles are hardly the stuff of SS rallies. As a set of ideas, they’re not particularly systematic, particularly when compared with more radical philosophies like Marxism and its innumerable offshoots, or at the other extreme, the Objectivism of Ayn Rand. They are arguably more a set of generalized assertions and attitudes rather than principles per se. Even so, they do represent a particular worldview, though it is not the worldview of the Founding Fathers or of the early American political generations.</p><p>Notice as well that several of these principles are primarily defined by that which they opposed: the dominant left-liberal worldview of the mid-20th century. From their very beginning the principles of conservatism were subordinate and defensive in nature, or less charitably, they were submissive and passive-aggressive in their relation to the left.</p></blockquote><p>Speak of the devil. As it happens, as of this morning, <i>Cuckservative</i> is now <a href=\"http://amzn.to/1U8yImL\">available in paperback on Amazon</a>. It is 236 pages and $12.99.</p></div>",
  "content_text": "I am not a conservative and I have long had to correct those who mistakenly believed I was. Nevertheless, I promised John C. Wright that I would address his question concerning when and how “conservative” became a label to avoid, and who was responsible for the destruction of the ideological brand.\nI am a conservative. Four months ago on this blog, if I had said that, everyone here would assume I mean conservative as opposed to ‘establishment republican’ meaning small-gov, separation-of-powers, gun-toting, Christ-loving, pro-family, strong-military, mistrustful of big government and big business.\nNow, everyone here uses it as a term of abuse, to refer to the exact same thing, four months ago, you all were using the term ‘neocon’ or ‘GOP establishment’ to refer to: globalist, pro-crony-capitalism, Wall-Street-Incest-with-DC, pro-abortion, fuck-the-bible-thumpers, rule-of-man-not-rule-of-law.\nWhy did you switch the label? Why are you calling the name I call myself to refer, for example, not to what Ted Cruz and Donald Trump have in common (and they have more in common than what separates them) but to what Jeb Bush and Barack Obama have in common (and they agree with each other on all points where I disagree.)\nWho or what marred the brand name? When Derbyshire and Anne Coulter was booted out of the good graces of National Review, I assumed National Review had lost it right to call itself conservative, not that Coulter and Derb (and I) were now a part of some new faction with a new name.\nIf y’all here are using the word conservative to refer to people who don’t favor the original intent of the US constitution and don’t know jack about history, this word simply does not describe me.\nWhat is the word you use for someone who believes 1. reality is real 2. truth is when thoughts and statements reflect reality 3. beauty is when art reflects natural or divine glory 4. life is sacred 5. family life is sacred 6. the Rights of Man (life, liberty, property) ergo liberty and equality are sacred. God is sacred.\nAdd to this a love of one’s flag and ancestors, a loyal to one’s posterity, and a distrust of sudden or violent social change, and you have a crisp and clear picture of what it means to be a conservative.\nBut you gentlemen neither use the word to mean this, no provide me with any other word to use to describe myself.\nI have never had this problem on the Right before, only on the Left. They go through backflips of misdirection and bad definitions to prevent me from having a word to use to refer to myself and those of my camp.\nWho or what marred the brand name? Three men, William F. Buckley, (((Norman Podhoretz))), and (((Irving Kristol))). Buckley began the\nNational Review\ntradition of reading out various members of the Right from “the conservative movement”, a tradition which began with Buckley’s demonization of the John Birch Society and was subsequently continued by (((David Frum))) and Rich Lowry.\nThose read out of conservatism include: Samuel Francis, Paul Craig Roberts, Joe Sobran, Jerry Pournelle, John Derbyshire, Ann Coulter, Pat Buchanan, and Mark Steyn, among many others. Earlier this year,\nCommentary\nlamented Buckley’s absence and warned of\n“The Coming Conservative Dark Age”\ndue to his successors’ inability to exercise the same authority when playing conservative thought-police.\n“When William F. Buckley Jr. died in 2008 at age 82, conservatives were deprived of his wit, his intelligence, his charisma, and his panache. But they also lost something more important than their leader’s charms. They lost his authority. And they need it now more than ever. It was Buckley who for decades determined the boundaries of American conservatism…. National Review is a great example of media gatekeeping theory: By exiling anti-Semites, Birchers, and anti-American reactionaries from its pages, the magazine and its editor determined which conservative arguments were legitimate and which were not.”\nPodhoretz, the father of (((John Podhoretz))), was the liberal Democrat who edited\nCommentary\nand helped it “transform the Jewish left into the neoconservative right”. Irving Kristol, the father of would-be third-party founder (((Bill Kristol))), is the founder of neonconservatism.\n“One can say that the historical task and political purpose of neoconservatism would seem to be this: to convert the Republican party, and American conservatism in general, against their respective wills, into a new kind of conservative politics suitable to governing a modern democracy…. Neoconservatism is the first variant of American conservatism in the past century that is in the “American grain.” It is hopeful, not lugubrious; forward-looking, not nostalgic; and its general tone is cheerful, not grim or dyspeptic. Its 20th-century heroes tend to be TR, FDR, and Ronald Reagan. Such Republican and conservative worthies as Calvin Coolidge, Herbert Hoover, Dwight Eisenhower, and Barry Goldwater are politely overlooked.”\n– Irving Kristol,\n“The Neoconservative Persuasion”\nWhile the Bush family, and its two presidents, also bear a fair amount of blame for the damage to the conservative brand, no one considered Bush the Elder a conservative and even Bush the Younger had to style himself a “compassionate conservative”. The failure of the Republican-controlled White House, House, and Senate to accomplish any of the conservative movement’s declared goals also played a role. But it was not until globalists such as John McCain, Mitt Romney, and Jeb Bush were anointed as true and proper conservatives, while avowed American nationalists like Donald Trump and all of his supporters were declared by the mainstream and conservative presses alike to be “not conservative”, that the brand was fatally tarnished. The conservative brand is now rightly rejected by the #AltRight and by every American nationalist.\nTo be a conservative now means to deny that an American national interest exists. It means to be opposed to the very idea that an American nation even\nexists\nexcept as “a proposition” to which one may assent. It means to be a nominal international equalitarian while at the same time putting Israel first. It means to regard GDP as the one true metric of national well-being. It means to advocate a strong US military in order to permit the USA to continue to police the world. It means to believe that the Holocaust is the worst thing ever to happen in human history, except for four score and seven years of slavery in America.\nTo be conservative means to conserve\nnothing\n, not even the posterity of the Founding Fathers, for whom the Constitution was written and whose unalienable rights the Bill of Rights was supposed to secure.\nI think the old conservatives would do well to call themselves Constitutionalists, because it is obvious that the current batch don’t give a damn about it. And neither do we of the #AltRight, because it is obvious that the Constitution has not only failed, completely, by its own stated purpose, but is today being used as a means of hand-cuffing the Right. The #AltRight believes in three things:\nNationalism.\nWestern civilization.\nWinning.\nEverything else is negotiable or a means to one of those three ends. We aren’t conservatives. We aren’t philosophers. And we don’t care about the Constitution, the Rights of Man, the Enlightenment, the Holocaust, or anything else with capital letters that is likely to get in the way.\nA Constitutionalist can be our ally. A Zionist can be our ally. A National Socialist can be our ally. A Pan-Arabist can be our ally. We don’t care who you are or what you believe, as long as you’re aiming in the direction of the enemies of nationalism and Western civilization.\nSuch as, for example, the self-styled conservatives who have turned their backs on America and proved themselves to be the Judases of the West, very nearly as dyscivic and dyscivilizational as the Left they nominally oppose. It is perhaps useful, therefore, to understand that conservatism was\nnever\nwhat many of today’s conservatives erroneously believe it to be. From\nCuckservative: How “Conservatives” Betrayed America\nby John Red Eagle and me:\nIn the early 1950s, the dominant political ideology in the United States was center-left liberalism, itself a reaction to the excesses of the socialist, totalitarian, eugenics-loving progressive movement. That today’s SJWs have re-embraced the progressive label is no accident and would be material enough for an entire book of its own. We have no plans to write such a book, though, since Jonah Goldberg’s\nLiberal Fascism\nprovides a reasonable description of both the historical antecedent as well as the modern neoprogressive. With the onset of the Cold War, and the embarrassing revelations of the real conditions of life under socialist rule, the American left found itself going through one of its inevitable crises of confidence.\nInto that void stepped a small group of intellectuals who set out to remake the even more shattered and demoralized American right. The older right, though sometimes referred to as paleoconservative by modern writers, actually had no such singular identity at the time. Unlike the United Kingdom, in the United States the word “conservative” had not been regularly applied to any particular political party or tradition. At most, it could be said that the older strains of thought shared a common Anglo-Saxon skepticism of centralized power, and a particularly American suspicion of elites, both foreign and domestic. But none of these intellectual strains were of any serious political influence in mid-20th-century America.\nThe early new rightists were interested in discerning the deeper roots of historical American political thought, and in turning its various strains into a viable, coherent political tradition. Some of them looked so deeply that they found inspiration from decidedly non-American sources, such as British conservative political thought. The latter was a generally elitist tradition, openly contemptuous of American-style independent citizenry and the freewheeling style of American political discourse. Among the leaders of this Anglophile camp was Russell Kirk, who is generally credited with coining the American use of the term conservative as a distinct political label. His most famous work,\nThe Conservative Mind\n, proved to be quickly and profoundly influential soon after its publication in 1953. Kirk’s book synthesized various ideas from diverse 18th- and 19th-century thinkers, most prominently Edmund Burke, into six canons, or principles, of this new conservatism:\nBelief in a transcendent order, or body, of natural law, which rules society as well as conscience.\nAffection for the proliferating variety and mystery of human existence, as opposed to the narrowing uniformity, egalitarianism, and utilitarian aims of most radical systems.\nConviction that civilized society requires orders and classes, as against the notion of a “classless society.”\nPersuasion that freedom and property are closely linked.\nCustom, convention, and old prescription are checks both upon man’s anarchic impulse and upon the innovator’s lust for power.\nRecognition that change may not be salutory reform: hasty innovation may be a devouring conflagration, rather than a torch of progress. Society must alter, for prudent change is the means of social preservation; but a statesman must take Providence into his calculations.\nThe astute reader will surely notice that cuckservatism, especially with regards to immigration, directly violates no less than one-third of Kirk’s conservative principles, namely, the last two. Cuckservatism fails to respect tradition, as it manifestly does not distrust those who would reconstruct all of society, and it refuses to recognize the possibility that change of the magnitude necessitated by the size of the 50-year mass migration will destroy, rather than improve, the nation.\nWhatever the left may say about them, Kirk’s principles are hardly the stuff of SS rallies. As a set of ideas, they’re not particularly systematic, particularly when compared with more radical philosophies like Marxism and its innumerable offshoots, or at the other extreme, the Objectivism of Ayn Rand. They are arguably more a set of generalized assertions and attitudes rather than principles per se. Even so, they do represent a particular worldview, though it is not the worldview of the Founding Fathers or of the early American political generations.\nNotice as well that several of these principles are primarily defined by that which they opposed: the dominant left-liberal worldview of the mid-20th century. From their very beginning the principles of conservatism were subordinate and defensive in nature, or less charitably, they were submissive and passive-aggressive in their relation to the left.\nSpeak of the devil. As it happens, as of this morning,\nCuckservative\nis now\navailable in paperback on Amazon\n. It is 236 pages and $12.99.",
  "tags": [
    "#AltRight",
    "philosophy",
    "politics"
  ],
  "categories": [],
  "sitemap_lastmod": "2016-06-09T07:06:00+00:00"
}