{
  "url": "https://voxday.net/2016/06/16/why-she-doesnt-read-women-writers/",
  "scraped_at": "2025-12-17T18:01:54.427310",
  "title": "Why she doesn’t read women writers",
  "date_display": "June 16, 2016",
  "date_iso": "2016-06-16T18:36:00+00:00",
  "date_from_url": "2016-06-16",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>For a different reason than I don’t, <a href=\"https://accordingtohoyt.com/2016/06/14/on-reading-women/\">as it happens</a>:</p><blockquote class=\"tr_bq\"><p> So, what is this all about?</p><p>It is about the fact I’m tired of getting fan letters saying “I<br> finally read your books, having hesitated long and hard to start.<br>  Forgive me, but the fact that you’re female made me doubtful.”</br></br></p><p>Ah, yeah, that.  And then I became conscious of an hesitation to pick up female-written books, myself.</p><p>I, who am a female writing books, and who have been formed as a<br> reader by a veritable battalion of writing females, suddenly subjecting<br> to greater scrutiny books by females, and asking friends “is she okay?”<br> before starting a new female author.</br></br></br></p><p>Why?  Oh, not because of what is between the author’s legs.  No, that<br> never interested me, before or since.  What makes me hesitate is the<br> mush that younger females have had their heads filled with, often from<br> primary education.</br></br></br></p><p>One of the first warnings of this was when a young college student<br> joined our writers’ group.  (She is now a bestselling author.)  Her<br> education had been exquisite and expensive, and yet… And yet she believed things like that there had been great women<br> fighters in the middle ages, and the men had suppressed all memory of<br> them.  Or that my best friend and I didn’t have college degrees (both of<br> us had Masters) because we were stay at home moms.</br></br></br></br></br></p><p>I don’t judge her too harshly on these beliefs.  It’s really hard to<br> examine the things that adults told us when we were very young.  Note<br> how until recently I believed my cousin Dulce had died because I refused<br> to share my bread and butter with her.  (I suspect being rebuked, then<br> hearing she’d died got conflated in my mind.)  And that wasn’t even an<br> intentional guilt trip.</br></br></br></br></br></p><p>But I find myself reading about women as they never were, women<br> without agency oppressed by a far  more coordinated patriarchy than any<br> male I know could manage, let alone a group of males.  I find myself<br> reading about men as they never were, too, men who are all plotting and<br> evil and powerful or else cringing ball-less cowards.  And then there is<br> the Marxism that afflicts the younger, “well educated” ones.  And the<br> preaching.  Oh, my LORD, I never took well to preaching, even in<br> religious books.</br></br></br></br></br></br></br></p><p>So, I hesitate before picking up new women writers.  Though I do pick<br> them up.  I even tolerate a fair amount of feminism and left wing<br> ideology if it’s so well wrapped in the story it doesn’t pop me out of<br> it.  Most of the women and some of the men above are/were definitely on<br> the left, but they can tell a story, and that’s all I care about.</br></br></br></br></p></blockquote><p>Looking at my reading lists for the past few years, it is readily apparent that although women are some of my favorite authors – Tanith Lee, Ellis Peters, Agatha Christie, Susan Cooper, Murasaki Shikibu – I very seldom read women who write today. If it weren’t for the Hugo Awards, I wouldn’t have read any at all this year.</p><p>Why? Because, for the most part, they bore me. Women write best when they write about what truly interests them, which is interpersonal relationships. But shoe-horning a woman’s novel into a science fiction, or fantasy, or worse, military science fiction skin is not only uninteresting, it’s quite often downright cringe-worthy.</p><p>The problem, as I see it, is that most female writers are too solipsistic to be interested in ideas beyond pushing the current Narrative. It’s too bad, because they are vastly superior in their understanding of socio-sexual relations than are their gamma male counterparts in the SF/F genre. At the very least, women writers understand that men pursue women and that women are attracted to men for reasons that have nothing to do with how assiduously he respects her and avoids expressing any undue interest in her. (I can reliably ID a male writer’s socio-sexual status by how he describes male-female relations, and most male writers in SF/F are gammas.)</p><p>But at the end of the day, I don’t give a damn about whether the author’s Mary Sue protagonist goes for Alpha Male 1 or Alpha Male 2, which is the central question around which most female-written fiction revolves. This may explain why, when I look at the female authors I like reading, I notice that they almost uniformly utilize <i>male</i> protagonists.</p><p>Ellis Peters – Brother Cadfael. Agatha Christie – Hercule Poirot and the famously celibate Miss Marple. Susan Cooper – Will Stanton. Tanith Lee utilizes a broad range of protagonists, but most of them are male. Even Lady Murasaki’s classic novel revolved around Hikaru Genji, the shining prince.</p><p>Now, there are no doubt exceptions to be found, but as a general rule, name a woman author with a female protagonist and you can be fairly certain that regardless of what else might be going on in the book,  a significant percentage of the text will be devoted to answering one of two questions: a) will she or won’t she? and b) Alpha Male 1 or Alpha Male 2?</p><p>If that interests you, fine. There is nothing wrong with that. But I, for one, am not very likely to read it. A great book is a great book, and it doesn’t matter who writes it, but women writers should keep in mind that many readers have been burned many times by other women writers who have attempted to sell them a romance in non-romance wrapping.</p><p>Play the reader dishonestly that way and he – or she –  will never give you another chance.</p></div>",
  "content_text": "For a different reason than I don’t,\nas it happens\n:\nSo, what is this all about?\nIt is about the fact I’m tired of getting fan letters saying “I\nfinally read your books, having hesitated long and hard to start.\nForgive me, but the fact that you’re female made me doubtful.”\nAh, yeah, that.  And then I became conscious of an hesitation to pick up female-written books, myself.\nI, who am a female writing books, and who have been formed as a\nreader by a veritable battalion of writing females, suddenly subjecting\nto greater scrutiny books by females, and asking friends “is she okay?”\nbefore starting a new female author.\nWhy?  Oh, not because of what is between the author’s legs.  No, that\nnever interested me, before or since.  What makes me hesitate is the\nmush that younger females have had their heads filled with, often from\nprimary education.\nOne of the first warnings of this was when a young college student\njoined our writers’ group.  (She is now a bestselling author.)  Her\neducation had been exquisite and expensive, and yet… And yet she believed things like that there had been great women\nfighters in the middle ages, and the men had suppressed all memory of\nthem.  Or that my best friend and I didn’t have college degrees (both of\nus had Masters) because we were stay at home moms.\nI don’t judge her too harshly on these beliefs.  It’s really hard to\nexamine the things that adults told us when we were very young.  Note\nhow until recently I believed my cousin Dulce had died because I refused\nto share my bread and butter with her.  (I suspect being rebuked, then\nhearing she’d died got conflated in my mind.)  And that wasn’t even an\nintentional guilt trip.\nBut I find myself reading about women as they never were, women\nwithout agency oppressed by a far  more coordinated patriarchy than any\nmale I know could manage, let alone a group of males.  I find myself\nreading about men as they never were, too, men who are all plotting and\nevil and powerful or else cringing ball-less cowards.  And then there is\nthe Marxism that afflicts the younger, “well educated” ones.  And the\npreaching.  Oh, my LORD, I never took well to preaching, even in\nreligious books.\nSo, I hesitate before picking up new women writers.  Though I do pick\nthem up.  I even tolerate a fair amount of feminism and left wing\nideology if it’s so well wrapped in the story it doesn’t pop me out of\nit.  Most of the women and some of the men above are/were definitely on\nthe left, but they can tell a story, and that’s all I care about.\nLooking at my reading lists for the past few years, it is readily apparent that although women are some of my favorite authors – Tanith Lee, Ellis Peters, Agatha Christie, Susan Cooper, Murasaki Shikibu – I very seldom read women who write today. If it weren’t for the Hugo Awards, I wouldn’t have read any at all this year.\nWhy? Because, for the most part, they bore me. Women write best when they write about what truly interests them, which is interpersonal relationships. But shoe-horning a woman’s novel into a science fiction, or fantasy, or worse, military science fiction skin is not only uninteresting, it’s quite often downright cringe-worthy.\nThe problem, as I see it, is that most female writers are too solipsistic to be interested in ideas beyond pushing the current Narrative. It’s too bad, because they are vastly superior in their understanding of socio-sexual relations than are their gamma male counterparts in the SF/F genre. At the very least, women writers understand that men pursue women and that women are attracted to men for reasons that have nothing to do with how assiduously he respects her and avoids expressing any undue interest in her. (I can reliably ID a male writer’s socio-sexual status by how he describes male-female relations, and most male writers in SF/F are gammas.)\nBut at the end of the day, I don’t give a damn about whether the author’s Mary Sue protagonist goes for Alpha Male 1 or Alpha Male 2, which is the central question around which most female-written fiction revolves. This may explain why, when I look at the female authors I like reading, I notice that they almost uniformly utilize\nmale\nprotagonists.\nEllis Peters – Brother Cadfael. Agatha Christie – Hercule Poirot and the famously celibate Miss Marple. Susan Cooper – Will Stanton. Tanith Lee utilizes a broad range of protagonists, but most of them are male. Even Lady Murasaki’s classic novel revolved around Hikaru Genji, the shining prince.\nNow, there are no doubt exceptions to be found, but as a general rule, name a woman author with a female protagonist and you can be fairly certain that regardless of what else might be going on in the book,  a significant percentage of the text will be devoted to answering one of two questions: a) will she or won’t she? and b) Alpha Male 1 or Alpha Male 2?\nIf that interests you, fine. There is nothing wrong with that. But I, for one, am not very likely to read it. A great book is a great book, and it doesn’t matter who writes it, but women writers should keep in mind that many readers have been burned many times by other women writers who have attempted to sell them a romance in non-romance wrapping.\nPlay the reader dishonestly that way and he – or she –  will never give you another chance.",
  "tags": [
    "writing"
  ],
  "categories": [],
  "sitemap_lastmod": "2016-06-16T17:36:00+00:00"
}