{
  "url": "https://voxday.net/2007/10/19/answering-their-own-question/",
  "scraped_at": "2026-01-08T21:57:31.126327",
  "title": "The dogma of science",
  "date_display": "October 19, 2007",
  "date_iso": "2007-10-19T11:45:00+00:00",
  "date_from_url": "2007-10-19",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p><a href=\"http://www.timesonline.co.uk/tol/comment/columnists/anjana_ahuja/article2689740.ece\">Apparently not</a>:</p><blockquote><p>The Science Museum in London has cancelled Professor Watson’s sell-out speaking engagement tonight, on the ground that his views have gone “beyond the point of acceptable debate”. A spokesman also claimed that “the Science Museum does not shy away from debating controversial topics”….</p><p>As well as intellectual cowardice, the Science Museum is guilty of hypocrisy. On October 30, it will hold an event called Is Science Colour-Blind? “Might race have a useful role to play in contemporary science? Talk about the legacies of scientific racism today . . .” runs the blurb.</p></blockquote><p>This whole controversy demonstrates the hypocrisy and fundamentally false pretensions of the scientific community and its worshipful followers.  (You know, those who claim that the scientific racism of eugenics never existed because it was “bad science”, apparently as opposed to today’s “good science”.)  It isn’t anywhere nearly as impartial and empirical as scientists would have us believe, all too often, it is the very con game that science fetishists claim religion to be.</p><p>UPDATE: Can you even imagine the outrage in the scientific community if a Nobel Prize winner was suspended for questioning the existence of God or arguing that Man was descended from animals?  But I have no doubt that we’ll see their dedication to unscientific equalitarian ideological dogma trumps their nominal dedication to the spirit of free scientific inquiry.</p><blockquote><p>James Watson, the co-discoverer of DNA’s molecular structure, was suspended at the Cold Spring Harbor Laboratory in New York after his comments questioning the intelligence of Africans were reported in a U.K. newspaper.</p></blockquote><p>This proves the claims about the fundamental impartiality of science <a href=\"http://www.bloomberg.com/apps/news?pid=20601102&amp;sid=aMKzOJoxaomc&amp;refer=uk\">to be a complete joke</a>.  Science is arguably MORE dogmatic than religion; one can never be sure whether one is violating the tenets of the scientific faith or not since those tenets are subjective, prone to mutation and are never articulated in an explicit, codified form.</p><p>UPDATE II: To my surprise, and <a href=\"http://scienceblogs.com/pharyngula/2007/10/cshl_acts_against_watson.php\">to PZ Myer’s credit</a>, he has openly criticized CSHL’s action despite his quixotic position on the complete non-existence of scientific evidence on intelligence.  Of course, given the low level of discourse at Pharyngula, I suppose that’s not terribly difficult to understand.</p></div>",
  "content_text": "Apparently not\n:\nThe Science Museum in London has cancelled Professor Watson’s sell-out speaking engagement tonight, on the ground that his views have gone “beyond the point of acceptable debate”. A spokesman also claimed that “the Science Museum does not shy away from debating controversial topics”….\nAs well as intellectual cowardice, the Science Museum is guilty of hypocrisy. On October 30, it will hold an event called Is Science Colour-Blind? “Might race have a useful role to play in contemporary science? Talk about the legacies of scientific racism today . . .” runs the blurb.\nThis whole controversy demonstrates the hypocrisy and fundamentally false pretensions of the scientific community and its worshipful followers.  (You know, those who claim that the scientific racism of eugenics never existed because it was “bad science”, apparently as opposed to today’s “good science”.)  It isn’t anywhere nearly as impartial and empirical as scientists would have us believe, all too often, it is the very con game that science fetishists claim religion to be.\nUPDATE: Can you even imagine the outrage in the scientific community if a Nobel Prize winner was suspended for questioning the existence of God or arguing that Man was descended from animals?  But I have no doubt that we’ll see their dedication to unscientific equalitarian ideological dogma trumps their nominal dedication to the spirit of free scientific inquiry.\nJames Watson, the co-discoverer of DNA’s molecular structure, was suspended at the Cold Spring Harbor Laboratory in New York after his comments questioning the intelligence of Africans were reported in a U.K. newspaper.\nThis proves the claims about the fundamental impartiality of science\nto be a complete joke\n.  Science is arguably MORE dogmatic than religion; one can never be sure whether one is violating the tenets of the scientific faith or not since those tenets are subjective, prone to mutation and are never articulated in an explicit, codified form.\nUPDATE II: To my surprise, and\nto PZ Myer’s credit\n, he has openly criticized CSHL’s action despite his quixotic position on the complete non-existence of scientific evidence on intelligence.  Of course, given the low level of discourse at Pharyngula, I suppose that’s not terribly difficult to understand.",
  "tags": [],
  "categories": [],
  "sitemap_lastmod": "2007-10-19T10:45:00+00:00"
}