{
  "url": "https://voxday.net/2007/10/04/aye-warned-ye/",
  "scraped_at": "2026-01-08T21:56:15.292703",
  "title": "Aye warned ye in 2003",
  "date_display": "October 4, 2007",
  "date_iso": "2007-10-04T19:20:00+00:00",
  "date_from_url": "2007-10-04",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p><em>More than one sage has expressed an opinion that Hillary is only lying in wait, not unlike a crocodile lurking at a waterhole, before announcing an unexpected bid for the presidency. I disagree. In my humble opinion, there are a number of reasons why the Lizard Queen will choose to sit on the sidelines in 2004….  So, the Lizard Queen will continue to lurk quietly in the gaseous morass of the Senate, biding her time, waiting for the right moment to strike an unsuspecting America and drag it beneath the dark waters of her totalitarian vision.</em><br>– Vox Day, <a href=\"http://voxday.net/archive/2005/053005.html\">November 24, 2003</a></br></p><p><em>The chief reason, however, for the likelihood of her ascendancy in 2008 is that the omens point to it being her time….  These are early days, of course, but look for the Republicans to nominate an unelectable candidate in the Dole mode to serve as a sacrificial lamb. Jeb Bush would be ideal, although Rudy Giuliani might be even better as a candidate who looks credible on the surface, but who will suppress the turnout of the Republican base.</em><br>– Vox Day, <a href=\"http://www.voxday.net/archive/2003/112403.html\">May 30, 2005</a></br></p><p>The charade <a href=\"http://www.nypost.com/seven/10042007/news/nationalnews/clinton_has_33_point_lead.htm\">comes to an end</a>:</p><blockquote><p>Hillary Rodham Clinton has jumped to an astounding 33-point lead over Barack Obama, topping her main rival among every major slice of the electorate and widening a dominating advantage she has held all summer. Clinton got support from a full majority for the first time in any national survey about the Democratic presidential field. She is backed by 53 percent in the latest Washington Post/ABC News poll.</p></blockquote><p>Unless the Republicans run Ron Paul against her, she wins the presidency in a walk.  Anti-war and anti-immigration is the only way to beat her.</p><p>UPDATE – of course, since the Republican leadership is taking a fall, they’re trying to nominate the guy who more than a fourth of the party will not support in any thircumsthantheth:</p><blockquote><p>If Rudy Giuliani wins the Republican nomination and a third party campaign is backed by Christian conservative leaders, <a href=\"http://www.rasmussenreports.com/public_content/politics/27_of_republicans_would_vote_for_pro_life_third_party_instead_of_giuliani\">27% of Republican voters</a> say they’d vote for the third party option rather than Giuliani.</p></blockquote><p>The thing is, Democratic tailwinds are so strong that they don’t even need to play the third-party card this time around.  But it’s good to know that there are still some Republicans with principles left. <a href=\"http://www.realclearpolitics.com/articles/2007/10/the_gop_needs_a_survival_insti.html\">Tony Blankley</a> and <a href=\"http://theanchoressonline.com/2007/10/01/clintons-and-the-christians-third-party-gambit/\">The Anchoress</a> can blather about why principled individuals should cast their principles to the wind in favor of inept political pragmatism, but it’s not going to work.  It’s time for pragmatic Republicans to face the facts and accept that Giuliani, Thompson, McCain and Romney are all losers, so they might as well line up behind Ron Paul.</p></div>",
  "content_text": "More than one sage has expressed an opinion that Hillary is only lying in wait, not unlike a crocodile lurking at a waterhole, before announcing an unexpected bid for the presidency. I disagree. In my humble opinion, there are a number of reasons why the Lizard Queen will choose to sit on the sidelines in 2004….  So, the Lizard Queen will continue to lurk quietly in the gaseous morass of the Senate, biding her time, waiting for the right moment to strike an unsuspecting America and drag it beneath the dark waters of her totalitarian vision.\n– Vox Day,\nNovember 24, 2003\nThe chief reason, however, for the likelihood of her ascendancy in 2008 is that the omens point to it being her time….  These are early days, of course, but look for the Republicans to nominate an unelectable candidate in the Dole mode to serve as a sacrificial lamb. Jeb Bush would be ideal, although Rudy Giuliani might be even better as a candidate who looks credible on the surface, but who will suppress the turnout of the Republican base.\n– Vox Day,\nMay 30, 2005\nThe charade\ncomes to an end\n:\nHillary Rodham Clinton has jumped to an astounding 33-point lead over Barack Obama, topping her main rival among every major slice of the electorate and widening a dominating advantage she has held all summer. Clinton got support from a full majority for the first time in any national survey about the Democratic presidential field. She is backed by 53 percent in the latest Washington Post/ABC News poll.\nUnless the Republicans run Ron Paul against her, she wins the presidency in a walk.  Anti-war and anti-immigration is the only way to beat her.\nUPDATE – of course, since the Republican leadership is taking a fall, they’re trying to nominate the guy who more than a fourth of the party will not support in any thircumsthantheth:\nIf Rudy Giuliani wins the Republican nomination and a third party campaign is backed by Christian conservative leaders,\n27% of Republican voters\nsay they’d vote for the third party option rather than Giuliani.\nThe thing is, Democratic tailwinds are so strong that they don’t even need to play the third-party card this time around.  But it’s good to know that there are still some Republicans with principles left.\nTony Blankley\nand\nThe Anchoress\ncan blather about why principled individuals should cast their principles to the wind in favor of inept political pragmatism, but it’s not going to work.  It’s time for pragmatic Republicans to face the facts and accept that Giuliani, Thompson, McCain and Romney are all losers, so they might as well line up behind Ron Paul.",
  "tags": [],
  "categories": [],
  "sitemap_lastmod": "2007-10-04T18:20:00+00:00"
}