{
  "url": "https://voxday.net/2007/10/05/dawkins-on-jews/",
  "scraped_at": "2026-01-08T21:56:23.416620",
  "title": "Dawkins on Jews",
  "date_display": "October 5, 2007",
  "date_iso": "2007-10-05T23:51:00+00:00",
  "date_from_url": "2007-10-05",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><blockquote><p>“When you think about how fantastically successful the Jewish lobby has been, though, in fact, they are less numerous I am told – religious Jews anyway – than atheists and more or less monopolise American foreign policy as far as many people can see.”<br>– Richard Dawkins</br></p></blockquote><p>Everyone knows that Christopher Hitchens is anti-semitic.  But Daniel Finklestein, a left-wing editor at The Times, is appalled <a href=\"http://timesonline.typepad.com/comment/2007/10/dawkins-on-the-.html\">to discover that Richard Dawkins appears to be as well</a>.</p><p><em>“So Dawkins, a liberal hero, believes, er, that Jews control world power. And, judging from <a href=\"http://books.guardian.co.uk/news/articles/0,,2180660,00.html\">the Guardian</a>, it is now a part of mainstream debate to say so. Perhaps you think I am over-reacting, but I am a little bit frightened.”</em></p><p>While there would be a good deal of amusement to be engendered by watching liberal atheists’ heads explode from the overload of cognitive dissonance, I think Dawkins must be excused from the charge of anti-semitism by virtue of his near-complete ignorance of world history and foreign policy.  He’s merely repeating an opinion that held by many Englishmen and other Europeans.</p><p>This should be obvious, as Dawkins clearly has no idea that it’s primarily non-practicing Jews who are the politically influential individuals, both in Israel and the United States.</p></div>",
  "content_text": "“When you think about how fantastically successful the Jewish lobby has been, though, in fact, they are less numerous I am told – religious Jews anyway – than atheists and more or less monopolise American foreign policy as far as many people can see.”\n– Richard Dawkins\nEveryone knows that Christopher Hitchens is anti-semitic.  But Daniel Finklestein, a left-wing editor at The Times, is appalled\nto discover that Richard Dawkins appears to be as well\n.\n“So Dawkins, a liberal hero, believes, er, that Jews control world power. And, judging from\nthe Guardian\n, it is now a part of mainstream debate to say so. Perhaps you think I am over-reacting, but I am a little bit frightened.”\nWhile there would be a good deal of amusement to be engendered by watching liberal atheists’ heads explode from the overload of cognitive dissonance, I think Dawkins must be excused from the charge of anti-semitism by virtue of his near-complete ignorance of world history and foreign policy.  He’s merely repeating an opinion that held by many Englishmen and other Europeans.\nThis should be obvious, as Dawkins clearly has no idea that it’s primarily non-practicing Jews who are the politically influential individuals, both in Israel and the United States.",
  "tags": [],
  "categories": [],
  "sitemap_lastmod": "2007-10-05T22:51:00+00:00"
}