{
  "url": "https://voxday.net/2007/10/01/deport-them-a/",
  "scraped_at": "2026-01-08T21:55:50.081460",
  "title": "Deport them all",
  "date_display": "October 1, 2007",
  "date_iso": "2007-10-01T18:06:00+00:00",
  "date_from_url": "2007-10-01",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>The elite are never going to convince Americans that <a href=\"http://www.dallasnews.com/sharedcontent/dws/dn/latestnews/stories/092807dnmetrallyfolo.2be87b3.html\">transforming themselves into North Mexicans is desirable</a>.  The more non-Americans that are forced on the citizenry, the more likely it is that extreme measures will eventually be adopted.  History suggests that the choices are to either a) deport them now, or, b) do very bad things to them later.</p><blockquote><p>Mayor Herbert Gears estimates that about 300 people in Irving are being turned over each month – more than in any other city in the nation. He said city officials are obligated to uphold the law and will continue to use the program, which is available to any city that wishes to participate.</p><p>“Of the 200 e-mails I’ve read so far, one is negative and all the rest are positive,” Mr. Gears said Thursday afternoon. “People are very overwhelmingly supporting what we are doing.”</p></blockquote><p>The problem, of course, is that our fascist elites love violence , since conflict gives them the opportunity to create profit as well as the excuse to enact radical societal change.  (It’s no accident that such changes in peacetime are typically categorizes as “the war on X”).  So, from their point of view, immigration is a win-win, as it will either lead to a subjected third-world people or the chaos of widespread violence.</p><p>To avoid those probable outcomes, civilized and peaceful deportations are the only solution.</p></div>",
  "content_text": "The elite are never going to convince Americans that\ntransforming themselves into North Mexicans is desirable\n.  The more non-Americans that are forced on the citizenry, the more likely it is that extreme measures will eventually be adopted.  History suggests that the choices are to either a) deport them now, or, b) do very bad things to them later.\nMayor Herbert Gears estimates that about 300 people in Irving are being turned over each month – more than in any other city in the nation. He said city officials are obligated to uphold the law and will continue to use the program, which is available to any city that wishes to participate.\n“Of the 200 e-mails I’ve read so far, one is negative and all the rest are positive,” Mr. Gears said Thursday afternoon. “People are very overwhelmingly supporting what we are doing.”\nThe problem, of course, is that our fascist elites love violence , since conflict gives them the opportunity to create profit as well as the excuse to enact radical societal change.  (It’s no accident that such changes in peacetime are typically categorizes as “the war on X”).  So, from their point of view, immigration is a win-win, as it will either lead to a subjected third-world people or the chaos of widespread violence.\nTo avoid those probable outcomes, civilized and peaceful deportations are the only solution.",
  "tags": [],
  "categories": [],
  "sitemap_lastmod": "2007-10-01T17:06:00+00:00"
}