{
  "url": "https://voxday.net/2007/10/29/dinesh-dsouza-interview/",
  "scraped_at": "2026-01-08T21:58:35.613056",
  "title": "Interview with Dinesh D’souza",
  "date_display": "October 29, 2007",
  "date_iso": "2007-10-29T08:00:00+00:00",
  "date_from_url": "2007-10-29",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p><em>Vox Day interviewed Dinesh D’Souza, author of </em>What’s So Great About Christianity<em> on October 24.</em></p><p><b><a href=\"http://www.dineshdsouza.com/books/christianity-jacket.html\">What’s So Great About Christianity</a> isn’t merely a response to the various atheist books, it’s also a positive case for Christianity.  What do you consider to be the three most important aspects of that case?</b></p><p>The first is a case that I try to make that Christianity is responsible for the core institutions and values that secular people and even atheists cherish.  If you look at books by leading atheists and you make a list of the values that they care about, things like the right to individual dissent, the notion of personal dignity, equality and respect for women, opposition to social hierarchy and slavery, compassion as a social value, the idea of self-government and representative government, and so forth, you’ll see that many of these things came into the world because of Christianity.  My point is that even if an atheist is an unbeliever, he should at least acknowledge and respect that Christianity has done a great deal to make our civilization what it is, and is even responsible for many of the values that he cares about.</p><p>The second theme of the book is that there is nothing inconsistent or contradictory between theism in general or Christianity in particular on the one hand, and modern science on the other.  Many Christians become very defensive when confronted by science, they’re very nervous about evolution and I think they’re getting too frazzled here.  If you look at modern science as a whole, you will see over the past hundred years that there have been spectacular developments that vindicate Christianity.  The idea that the universe had a beginning, the notion that not only matter but space and time themselves had a beginning, the implications of the big bang that prior to the universe there were no laws of physics, the notion that the universe is fine-tuned for life, these are all thrilling developments.  The atheists have little or no explanation for them, so they are doing acrobatics and backward somersaults to account for them.  This should all give heart and intellectual confidence to the believer.</p><p>My final theme is to rebut the idea that religion in general or Christianity in particular are responsible for the crimes of history.  I show, on the contrary, that the crimes of Christianity have been wildly exaggerated while the crimes of atheism, committed not 500 or 1,000 years ago, but in the last century, are far, far worse.  Again, this is a point that atheists are trying hard to weave and duck and avoid, but they can’t do it.   They have to come up with foolish rationalizations and double-standards to try to escape what the atheist regimes have done in the name of atheism.</p><p><b>Of the current collection of atheist champions, who do you take most seriously?</b></p><p>There’s now a cottage industry of atheist books and they’re of uneven quality.  I have a lot of respect for Richard Dawkins, more for his earlier works, in particular <i>The Selfish Gene</i> and what may be his best book, <i>The Blind Watchmaker</i>.  I think <i>The God Delusion</i> is so suffused with animus and prejudice that it can’t be counted as one of his better books.  A lot of the leading atheists seem to derive their atheism from Darwinism and they march behind the banner of modern science but I would put Christopher Hitchens in a different category, he’s more of a literary atheist.  I’d even call him a moral atheist.  He calls himself an anti-theist rather than an atheist and I think what he means by that is it’s not so important that he doesn’t believe in God, but that he hates God.  He certainly hates Christianity and he’s no fan of Jesus.  He attacks Christianity for being immoral.  It’s a very different kind of attack than you get from the other atheists and in my opinion, Hitchens’s attack strikes more deeply at Christianity than that of a Dawkins or a Dennett or a Stephen Pinker.  So, I would regard Hitchens as the most formidable of the atheists.</p><p><b>Who do you consider to be the least formidable?</b></p><p>I can’t take Sam Harris too seriously.  I see him as the goofball in the group.  Sam was lucky to be the first atheist horse out of the gate with <i>The End of Faith</i>.</p><p><b>Speaking of Christopher Hitchens, you recently debated him at King’s College and the New York Observer reported you as the winner.  How do you think it went?</b></p><p>It was a very lively debate, there was a big crowd there .  A thousand people showed up and we had to turn about a hundred away.  Hitchens had just come off a tour in which he debated a bunch of pastors and the typical pastor is not used to a spear-chucker like Hitchens so he’s been doing very well.  He had a debate with Alister McGrath in D.C. three weeks ago and absolutely destroyed McGrath; it was just painful to watch.  So, I was eager for it.  I’d debated him twice before, but on other topics.</p><p>I think I gave as well, if not better, than I got.  There were a lot of atheists in the audience and the applause was initially strong for his side, but as the debate went on it shifted.  Towards the end, I think I can say in fairness that most of the applause was for me.   It was a debate that shifted a little bit back and forth, but I think if it was scored on points I would have come out ahead.  But that’s me talking, people should <a href=\"http://www.tkc.edu/debate/\">watch the debate</a> for themselves and decide.</p><p><b>I watched it online and you did well.  It usually drives me nuts how many factual and historical errors the atheists are allowed to get away with.</b></p><p>They’ve been getting getting a free ride.  Not only are they getting adoring media coverage, but they’ve been picking weak opponents to whip on.</p><p><b>After <a href=\"http://www.christianitytoday.com/ct/2007/mayweb-only/119-12.0.html\">Douglas Wilson handed Hitchens his head</a> in that email exchange about four months ago, there’s no reason anyone should have any problem taking him down.</b></p><p>I agree, I totally agree.</p><p><b>I thought one of the more interesting points made in <i>What’s So Great About Christianity</i> was the observation that atheism is itself dualist, being simultaneously pro-and anti-Darwinian.  How do atheists justify this secular dualism?</b></p><p>Atheists frame the argument as something they’re against so they don’t feel they need to present a coherent alternative.  They’re there to knock down the theist position and they don’t mind making contradictory arguments to do that.  To take one case involving Hitchens himself, he attacked Mother Theresa in his book <i>The Missionary Position</i> in which he said that the thing about Mother Theresa was that she’s so self-satisfied, she thinks she knows everything and she’s the kind of person who could never change her mind no matter what evidence is.  Later, it came out that Mother Theresa had been wracked with doubts and full of uncertainty,  but when Hitchens was asked about this, he simply says that all this just shows what a liar she was and how insincere she was.  First he attacks her for being too sure of herself, then he attacks her for being uncertain… the poor woman can’t win!</p><p><b>You devote an entire chapter to demonstrating in some detail how the persecution of Galileo is essentially a romantic secular myth.  Given that all of the historical facts of the matter are readily available, why has this myth persisted?</b></p><p>The reason the myth persists is because it fits into what can be called the secular narrative.  This narrative is much bigger than Galileo, just look at the way we view popular history.  The Christian Era – the Dark Ages.  The Scientific Era – the Enlightenment.  So right away, in just two words, you see the story of progress as it is implanted in young people’s minds.  Galileo fits into this, the idea is that he is a secular saint, the St. Sebastian of moder<br> n science.  The idea is that the Church hounded and persecuted him for no reason, some books even say he was tortured, and yet when you look into it you discover that nearly every “fact” supposedly known about Galileo is false.  What I try to do in <i>What’s So Great About Christianity</i> is to retell the Galileo story, correcting these myths and showing people that it doesn’t have the meaning that is often ascribed to it.  It’s a very interesting story that points in a very different direction than one would think.</br></p><p><b>It seems that you find an amount of amusement in the atheist embrace of the various Multiple Universe theories.  Do you find this to be ironic?</b></p><p>I think it is ironic because the atheist is faced with a piece of data that would appear to have a very plausible explanation.  The piece of data is a universe apparently fine-tuned for life.  The plausible inference, then, is that the reason the universe appears to be fine-tuned is because there is a fine-tuner.  The reason it appears designed is because it has a designer.  Remember, this is an argument completely immune to Darwinian attack, not even in a dream can the atheist give a Darwinian explanation for why the universe is fine-tuned this way.  So, the atheist has got to come up with something different, which is, well, maybe there are millions of universes, or an infinite number of universes, in which case it would not be surprising that one of them has these particular characteristics.</p><p>This would be like me flipping a coin and it comes up heads 100 times in a row.  The obvious explanation is that somebody fixed the coin, it’s a weighted coin.  But along comes the atheist who goes, well, maybe there are an infinite number of coins and given an infinite number of tossings it’s not surprising that this particular outcome would occur.  Most people would regard this as a little preposterous.  The fact that even serious and thoughtful atheists find themselves forced to adopt this explanation tells me that me that the intellectual superstructure of atheism is starting to crumble.  Even its best advocates are reduced to, if not complete incoherence, at least implausibility.</p><p><b>It’s always a bad sign when you’re turning to science fiction to come up with your answers.</b></p><p>Right.  Exactly.</p><p><b>When you point out that atheist leaders have killed several orders of magnitude more human beings than Christian leaders, the usual rebuttal is that the atheists didn’t commit their murders “in the name of atheism”.  What is your response to that? </b></p><p>This is Richard Dawkins and it clearly shows what happens when you let a biologist out of the lab.  It shows a gross ignorance of history.  Communism was an explicitly atheist ideology.  Marx was very eager to establish a new Man and a new society liberated from the shackles of traditional religion and traditional morality.  Marx called religion “the opiate of the people” and he very much wanted to see religion removed from the face of the Earth, and he predicted it would be in the Communist utopia.  Every Communist regime targeted religion, closed the churches, persecuted the priests, harassed the believers.  This was no accident.  So, for Dawkins to say that this wasn’t being done in the name of atheism just defies rational belief.  It’s hard for me to believe an intelligent individual would even try to say that.</p><p><b>What is the difference between procedural atheism and philosophical atheism, and how does this relate to science?</b></p><p>Procedural atheism simply means that science looks for natural explanations.  In this sense science is procedurally closed to God.  Philosophical atheism holds that since science cannot find God, therefore God does not exist.  Philosophical atheism is in my view a metaphysical position.  Atheist writers often muddle procedural atheism and philosophical atheism in order to imply that one leads to the other.  In fact, the transition is a non-sequitur.</p><p><b>You obviously accept the theory of evolution, but you also point out that its explanatory power has limits that are ignored by Dawkins and company.  What is the significance of those limits.</b></p><p>Evolution doesn’t explain the origin of life, it doesn’t explain consciousness and, despite some heroic efforts, it doesn’t explain morality.  I’m not making a God-of-the-gaps argument arguing that because evolution can’t account for it, therefore God did it.  But neither should we submit to the Atheism-of-the-gaps, that holds since science explains some things, it can surely explain everything.</p></div>",
  "content_text": "Vox Day interviewed Dinesh D’Souza, author of\nWhat’s So Great About Christianity\non October 24.\nWhat’s So Great About Christianity\nisn’t merely a response to the various atheist books, it’s also a positive case for Christianity.  What do you consider to be the three most important aspects of that case?\nThe first is a case that I try to make that Christianity is responsible for the core institutions and values that secular people and even atheists cherish.  If you look at books by leading atheists and you make a list of the values that they care about, things like the right to individual dissent, the notion of personal dignity, equality and respect for women, opposition to social hierarchy and slavery, compassion as a social value, the idea of self-government and representative government, and so forth, you’ll see that many of these things came into the world because of Christianity.  My point is that even if an atheist is an unbeliever, he should at least acknowledge and respect that Christianity has done a great deal to make our civilization what it is, and is even responsible for many of the values that he cares about.\nThe second theme of the book is that there is nothing inconsistent or contradictory between theism in general or Christianity in particular on the one hand, and modern science on the other.  Many Christians become very defensive when confronted by science, they’re very nervous about evolution and I think they’re getting too frazzled here.  If you look at modern science as a whole, you will see over the past hundred years that there have been spectacular developments that vindicate Christianity.  The idea that the universe had a beginning, the notion that not only matter but space and time themselves had a beginning, the implications of the big bang that prior to the universe there were no laws of physics, the notion that the universe is fine-tuned for life, these are all thrilling developments.  The atheists have little or no explanation for them, so they are doing acrobatics and backward somersaults to account for them.  This should all give heart and intellectual confidence to the believer.\nMy final theme is to rebut the idea that religion in general or Christianity in particular are responsible for the crimes of history.  I show, on the contrary, that the crimes of Christianity have been wildly exaggerated while the crimes of atheism, committed not 500 or 1,000 years ago, but in the last century, are far, far worse.  Again, this is a point that atheists are trying hard to weave and duck and avoid, but they can’t do it.   They have to come up with foolish rationalizations and double-standards to try to escape what the atheist regimes have done in the name of atheism.\nOf the current collection of atheist champions, who do you take most seriously?\nThere’s now a cottage industry of atheist books and they’re of uneven quality.  I have a lot of respect for Richard Dawkins, more for his earlier works, in particular\nThe Selfish Gene\nand what may be his best book,\nThe Blind Watchmaker\n.  I think\nThe God Delusion\nis so suffused with animus and prejudice that it can’t be counted as one of his better books.  A lot of the leading atheists seem to derive their atheism from Darwinism and they march behind the banner of modern science but I would put Christopher Hitchens in a different category, he’s more of a literary atheist.  I’d even call him a moral atheist.  He calls himself an anti-theist rather than an atheist and I think what he means by that is it’s not so important that he doesn’t believe in God, but that he hates God.  He certainly hates Christianity and he’s no fan of Jesus.  He attacks Christianity for being immoral.  It’s a very different kind of attack than you get from the other atheists and in my opinion, Hitchens’s attack strikes more deeply at Christianity than that of a Dawkins or a Dennett or a Stephen Pinker.  So, I would regard Hitchens as the most formidable of the atheists.\nWho do you consider to be the least formidable?\nI can’t take Sam Harris too seriously.  I see him as the goofball in the group.  Sam was lucky to be the first atheist horse out of the gate with\nThe End of Faith\n.\nSpeaking of Christopher Hitchens, you recently debated him at King’s College and the New York Observer reported you as the winner.  How do you think it went?\nIt was a very lively debate, there was a big crowd there .  A thousand people showed up and we had to turn about a hundred away.  Hitchens had just come off a tour in which he debated a bunch of pastors and the typical pastor is not used to a spear-chucker like Hitchens so he’s been doing very well.  He had a debate with Alister McGrath in D.C. three weeks ago and absolutely destroyed McGrath; it was just painful to watch.  So, I was eager for it.  I’d debated him twice before, but on other topics.\nI think I gave as well, if not better, than I got.  There were a lot of atheists in the audience and the applause was initially strong for his side, but as the debate went on it shifted.  Towards the end, I think I can say in fairness that most of the applause was for me.   It was a debate that shifted a little bit back and forth, but I think if it was scored on points I would have come out ahead.  But that’s me talking, people should\nwatch the debate\nfor themselves and decide.\nI watched it online and you did well.  It usually drives me nuts how many factual and historical errors the atheists are allowed to get away with.\nThey’ve been getting getting a free ride.  Not only are they getting adoring media coverage, but they’ve been picking weak opponents to whip on.\nAfter\nDouglas Wilson handed Hitchens his head\nin that email exchange about four months ago, there’s no reason anyone should have any problem taking him down.\nI agree, I totally agree.\nI thought one of the more interesting points made in\nWhat’s So Great About Christianity\nwas the observation that atheism is itself dualist, being simultaneously pro-and anti-Darwinian.  How do atheists justify this secular dualism?\nAtheists frame the argument as something they’re against so they don’t feel they need to present a coherent alternative.  They’re there to knock down the theist position and they don’t mind making contradictory arguments to do that.  To take one case involving Hitchens himself, he attacked Mother Theresa in his book\nThe Missionary Position\nin which he said that the thing about Mother Theresa was that she’s so self-satisfied, she thinks she knows everything and she’s the kind of person who could never change her mind no matter what evidence is.  Later, it came out that Mother Theresa had been wracked with doubts and full of uncertainty,  but when Hitchens was asked about this, he simply says that all this just shows what a liar she was and how insincere she was.  First he attacks her for being too sure of herself, then he attacks her for being uncertain… the poor woman can’t win!\nYou devote an entire chapter to demonstrating in some detail how the persecution of Galileo is essentially a romantic secular myth.  Given that all of the historical facts of the matter are readily available, why has this myth persisted?\nThe reason the myth persists is because it fits into what can be called the secular narrative.  This narrative is much bigger than Galileo, just look at the way we view popular history.  The Christian Era – the Dark Ages.  The Scientific Era – the Enlightenment.  So right away, in just two words, you see the story of progress as it is implanted in young people’s minds.  Galileo fits into this, the idea is that he is a secular saint, the St. Sebastian of moder\nn science.  The idea is that the Church hounded and persecuted him for no reason, some books even say he was tortured, and yet when you look into it you discover that nearly every “fact” supposedly known about Galileo is false.  What I try to do in\nWhat’s So Great About Christianity\nis to retell the Galileo story, correcting these myths and showing people that it doesn’t have the meaning that is often ascribed to it.  It’s a very interesting story that points in a very different direction than one would think.\nIt seems that you find an amount of amusement in the atheist embrace of the various Multiple Universe theories.  Do you find this to be ironic?\nI think it is ironic because the atheist is faced with a piece of data that would appear to have a very plausible explanation.  The piece of data is a universe apparently fine-tuned for life.  The plausible inference, then, is that the reason the universe appears to be fine-tuned is because there is a fine-tuner.  The reason it appears designed is because it has a designer.  Remember, this is an argument completely immune to Darwinian attack, not even in a dream can the atheist give a Darwinian explanation for why the universe is fine-tuned this way.  So, the atheist has got to come up with something different, which is, well, maybe there are millions of universes, or an infinite number of universes, in which case it would not be surprising that one of them has these particular characteristics.\nThis would be like me flipping a coin and it comes up heads 100 times in a row.  The obvious explanation is that somebody fixed the coin, it’s a weighted coin.  But along comes the atheist who goes, well, maybe there are an infinite number of coins and given an infinite number of tossings it’s not surprising that this particular outcome would occur.  Most people would regard this as a little preposterous.  The fact that even serious and thoughtful atheists find themselves forced to adopt this explanation tells me that me that the intellectual superstructure of atheism is starting to crumble.  Even its best advocates are reduced to, if not complete incoherence, at least implausibility.\nIt’s always a bad sign when you’re turning to science fiction to come up with your answers.\nRight.  Exactly.\nWhen you point out that atheist leaders have killed several orders of magnitude more human beings than Christian leaders, the usual rebuttal is that the atheists didn’t commit their murders “in the name of atheism”.  What is your response to that?\nThis is Richard Dawkins and it clearly shows what happens when you let a biologist out of the lab.  It shows a gross ignorance of history.  Communism was an explicitly atheist ideology.  Marx was very eager to establish a new Man and a new society liberated from the shackles of traditional religion and traditional morality.  Marx called religion “the opiate of the people” and he very much wanted to see religion removed from the face of the Earth, and he predicted it would be in the Communist utopia.  Every Communist regime targeted religion, closed the churches, persecuted the priests, harassed the believers.  This was no accident.  So, for Dawkins to say that this wasn’t being done in the name of atheism just defies rational belief.  It’s hard for me to believe an intelligent individual would even try to say that.\nWhat is the difference between procedural atheism and philosophical atheism, and how does this relate to science?\nProcedural atheism simply means that science looks for natural explanations.  In this sense science is procedurally closed to God.  Philosophical atheism holds that since science cannot find God, therefore God does not exist.  Philosophical atheism is in my view a metaphysical position.  Atheist writers often muddle procedural atheism and philosophical atheism in order to imply that one leads to the other.  In fact, the transition is a non-sequitur.\nYou obviously accept the theory of evolution, but you also point out that its explanatory power has limits that are ignored by Dawkins and company.  What is the significance of those limits.\nEvolution doesn’t explain the origin of life, it doesn’t explain consciousness and, despite some heroic efforts, it doesn’t explain morality.  I’m not making a God-of-the-gaps argument arguing that because evolution can’t account for it, therefore God did it.  But neither should we submit to the Atheism-of-the-gaps, that holds since science explains some things, it can surely explain everything.",
  "tags": [],
  "categories": [],
  "sitemap_lastmod": "2007-10-29T08:00:00+00:00"
}