{
  "url": "https://voxday.net/2007/10/24/expressions/",
  "scraped_at": "2026-01-08T21:58:00.507445",
  "title": "Expressions",
  "date_display": "October 24, 2007",
  "date_iso": "2007-10-24T10:26:00+00:00",
  "date_from_url": "2007-10-24",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>I always find colloquial expressions to be interesting because of what they reveal about a culture.  Italian expressions can be particularly fascinating as they show a connection to both the primitive agricultural past as well as to intellectual aspects of the Renaissance.</p><p>It was very confusing the first time I heard someone say “<em>boca lupo</em>“, “mouth of the wolf”, in the context of a thesis presentation.  Whose mouth?  What wolf?  Weren’t we talking about his thesis?  But it simply means “good luck”, as in, “I hope you come out of this problematic situation all right”.  I would have been even more confused the other night at practice did I not have a history habit, as one of our strikers was complaining vociferously about how a midfielder had passed the ball to the left just as he broke on goal to the right during scrimmage.</p><p>“<em>Eppure si muove</em>“, the midfielder replied sarcastically.  “And yet, it moves”.  That didn’t make any literal sense but it cracked me up all the same.  The midfielder’s reply was a quote of what Galileo is supposed to have said after being forced to publicly recant his belief in the Copernican system.</p></div>",
  "content_text": "I always find colloquial expressions to be interesting because of what they reveal about a culture.  Italian expressions can be particularly fascinating as they show a connection to both the primitive agricultural past as well as to intellectual aspects of the Renaissance.\nIt was very confusing the first time I heard someone say “\nboca lupo\n“, “mouth of the wolf”, in the context of a thesis presentation.  Whose mouth?  What wolf?  Weren’t we talking about his thesis?  But it simply means “good luck”, as in, “I hope you come out of this problematic situation all right”.  I would have been even more confused the other night at practice did I not have a history habit, as one of our strikers was complaining vociferously about how a midfielder had passed the ball to the left just as he broke on goal to the right during scrimmage.\n“\nEppure si muove\n“, the midfielder replied sarcastically.  “And yet, it moves”.  That didn’t make any literal sense but it cracked me up all the same.  The midfielder’s reply was a quote of what Galileo is supposed to have said after being forced to publicly recant his belief in the Copernican system.",
  "tags": [],
  "categories": [],
  "sitemap_lastmod": "2007-10-24T09:26:00+00:00"
}