{
  "url": "https://voxday.net/2007/10/23/irrational-and-ahistorical-atheis/",
  "scraped_at": "2026-01-08T21:57:56.806117",
  "title": "An irrational and ahistorical atheist",
  "date_display": "October 23, 2007",
  "date_iso": "2007-10-23T13:05:00+00:00",
  "date_from_url": "2007-10-23",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>Christopher Hitchens offers <a href=\"http://www.slate.com/id/2176389/\">a fittingly ridiculous defense</a> of the ridiculous term “islamo-fascism”:</p><blockquote><p>Does Bin Ladenism or Salafism or whatever we agree to call it have anything in common with fascism?  I think yes. The most obvious points of comparison would be these: Both movements are based on a cult of murderous violence that exalts death and destruction and despises the life of the mind. (“Death to the intellect! Long live death!” as Gen. Francisco Franco’s sidekick Gonzalo Queipo de Llano so pithily phrased it.) Both are hostile to modernity (except when it comes to the pursuit of weapons), and both are bitterly nostalgic for past empires and lost glories. Both are obsessed with real and imagined “humiliations” and thirsty for revenge. Both are chronically infected with the toxin of anti-Jewish paranoia (interestingly, also, with its milder cousin, anti-Freemason paranoia).</p></blockquote><p>I could make a better case for calling atheism “atheo-fascism”.  After all, atheist governments have historically been far more lethal than ANY fascist government – although the original Fascist government was, itself, atheistic – and atheists are equally “obsessed with real and imagined persecutions and thirsty for revenge”.  And atheists are far more anti-Jewish than most theists today.</p><p>But it would be stupid, just as Hitchens’s defense of the term is abysmally stupid.</p><p>There is virtually NO similarity between the historical Fascist program and the Islamic Jihad.  One is nationalistic, the other international in scope.  One is utterly indifferent to questions of morality, the other is obsessed with it.  One is heavily based on economics and politics, the other is almost entirely concerned with religion.</p><p>Read <a href=\"http://voxday.net/archive/2004/062804.html\">Benito Mussolini’s Fascist Manifesto</a>.  There is not a SINGLE ONE of the seventeen policies that would apply to radical Islam.  Not one!  I highly doubt any radical Muslim wants the secular state to seize all the possessions of the Islamic clergy or to grant women’s suffrage; radical Islam is closer to the complete opposite of fascism than it is to being a form of it.</p><p>And given his past ideological identity and his recent and all too predictable call for the mass-murder of Muslims, it is amazing that the ex-Marxist and current atheist Hitchens should have the nerve to call anything “a cult of murderous violence”.</p></div>",
  "content_text": "Christopher Hitchens offers\na fittingly ridiculous defense\nof the ridiculous term “islamo-fascism”:\nDoes Bin Ladenism or Salafism or whatever we agree to call it have anything in common with fascism?  I think yes. The most obvious points of comparison would be these: Both movements are based on a cult of murderous violence that exalts death and destruction and despises the life of the mind. (“Death to the intellect! Long live death!” as Gen. Francisco Franco’s sidekick Gonzalo Queipo de Llano so pithily phrased it.) Both are hostile to modernity (except when it comes to the pursuit of weapons), and both are bitterly nostalgic for past empires and lost glories. Both are obsessed with real and imagined “humiliations” and thirsty for revenge. Both are chronically infected with the toxin of anti-Jewish paranoia (interestingly, also, with its milder cousin, anti-Freemason paranoia).\nI could make a better case for calling atheism “atheo-fascism”.  After all, atheist governments have historically been far more lethal than ANY fascist government – although the original Fascist government was, itself, atheistic – and atheists are equally “obsessed with real and imagined persecutions and thirsty for revenge”.  And atheists are far more anti-Jewish than most theists today.\nBut it would be stupid, just as Hitchens’s defense of the term is abysmally stupid.\nThere is virtually NO similarity between the historical Fascist program and the Islamic Jihad.  One is nationalistic, the other international in scope.  One is utterly indifferent to questions of morality, the other is obsessed with it.  One is heavily based on economics and politics, the other is almost entirely concerned with religion.\nRead\nBenito Mussolini’s Fascist Manifesto\n.  There is not a SINGLE ONE of the seventeen policies that would apply to radical Islam.  Not one!  I highly doubt any radical Muslim wants the secular state to seize all the possessions of the Islamic clergy or to grant women’s suffrage; radical Islam is closer to the complete opposite of fascism than it is to being a form of it.\nAnd given his past ideological identity and his recent and all too predictable call for the mass-murder of Muslims, it is amazing that the ex-Marxist and current atheist Hitchens should have the nerve to call anything “a cult of murderous violence”.",
  "tags": [],
  "categories": [],
  "sitemap_lastmod": "2007-10-23T12:05:00+00:00"
}