{
  "url": "https://voxday.net/2007/10/25/lessons-for-next-time/",
  "scraped_at": "2026-01-08T21:58:08.058388",
  "title": "Lessons for the next time",
  "date_display": "October 25, 2007",
  "date_iso": "2007-10-25T11:25:00+00:00",
  "date_from_url": "2007-10-25",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>Our <a href=\"http://monkeytrials.blogspot.com/2007/10/exposing-voxs-inner-rat_09.html\">evolution debate has finally petered out</a> on somewhat of an amusing note, with Scott repeating my initial assertion that I am not proposing an alternative to TENS, but am merely an evolutionary skeptic.  (I’m also a string theory skeptic, but I don’t propose an alternative to that theory either.) It’s been interesting, as I’ve definitely learned a lot about the current state of genetic science, but I simply haven’t seen any reason to modify my skepticism about evolution in any way.</p><p>Scott is correct, my position is largely intuitive, but it is an educated intuition.  The nature of the gaps in the theory are such that I suspect a complete overhaul of the theory is more likely than the gradual filling-in of the missing data that evolution supporters expect.  These gaps are certainly more obvious than were those in the Ptolemic system at the time that Copernicus developed his alternative to it, the fact that no one else had come up with anything during the centuries preceding Copernicus didn’t make Ptolemy correct.  And I hope that Scott will agree that I have made a solid case against the abuse of TENS, which damages both the public regard for science as well as TENS itself by dragging it into intellectual fields where it simply has no legitimate application.</p><p>Scott is a good teacher, but I don’t think he fully grasped the extent to which the issues I raised are serious and fundamental problems with the current TENS model.  He never addressed a number of them directly, but rhetorically punted instead.  This was completely understandable, as some of the questions were difficult and to his credit he didn’t claim to have answered them, but one cannot reasonably expect a skeptic to be convinced by an admitted non-answer.  Questions regarding margin of error, temporal dichotomies, the percentage of correct predictions and the average rate of evolution may be problematic but they are not spurious and even a cursory investigation into the literature shows that most of these questions are taken very seriously by scientists in the field.</p><p>Ironically, it was the scientist who was more impressed by unscientific anecdotes such as the naked mole rat “prediction”, which could have been far more easily faked than, for example, the Fatima miracle witnessed by 70,000 people.  I find this selective suspension of disbelief to be all too typical; it is a human tendency to demand more rigorous data from our opponents than from our allies.</p><p>I enjoyed the debate, although I think it would be more effective if there were a moderator involved next time to help keep track of things and keep them on target.  In any case, Scott is a good man and I’d happily debate him again on this or any other subject.</p></div>",
  "content_text": "Our\nevolution debate has finally petered out\non somewhat of an amusing note, with Scott repeating my initial assertion that I am not proposing an alternative to TENS, but am merely an evolutionary skeptic.  (I’m also a string theory skeptic, but I don’t propose an alternative to that theory either.) It’s been interesting, as I’ve definitely learned a lot about the current state of genetic science, but I simply haven’t seen any reason to modify my skepticism about evolution in any way.\nScott is correct, my position is largely intuitive, but it is an educated intuition.  The nature of the gaps in the theory are such that I suspect a complete overhaul of the theory is more likely than the gradual filling-in of the missing data that evolution supporters expect.  These gaps are certainly more obvious than were those in the Ptolemic system at the time that Copernicus developed his alternative to it, the fact that no one else had come up with anything during the centuries preceding Copernicus didn’t make Ptolemy correct.  And I hope that Scott will agree that I have made a solid case against the abuse of TENS, which damages both the public regard for science as well as TENS itself by dragging it into intellectual fields where it simply has no legitimate application.\nScott is a good teacher, but I don’t think he fully grasped the extent to which the issues I raised are serious and fundamental problems with the current TENS model.  He never addressed a number of them directly, but rhetorically punted instead.  This was completely understandable, as some of the questions were difficult and to his credit he didn’t claim to have answered them, but one cannot reasonably expect a skeptic to be convinced by an admitted non-answer.  Questions regarding margin of error, temporal dichotomies, the percentage of correct predictions and the average rate of evolution may be problematic but they are not spurious and even a cursory investigation into the literature shows that most of these questions are taken very seriously by scientists in the field.\nIronically, it was the scientist who was more impressed by unscientific anecdotes such as the naked mole rat “prediction”, which could have been far more easily faked than, for example, the Fatima miracle witnessed by 70,000 people.  I find this selective suspension of disbelief to be all too typical; it is a human tendency to demand more rigorous data from our opponents than from our allies.\nI enjoyed the debate, although I think it would be more effective if there were a moderator involved next time to help keep track of things and keep them on target.  In any case, Scott is a good man and I’d happily debate him again on this or any other subject.",
  "tags": [],
  "categories": [],
  "sitemap_lastmod": "2007-10-25T10:25:00+00:00"
}