{
  "url": "https://voxday.net/2007/10/16/minor-misrepresentation/",
  "scraped_at": "2026-01-08T21:57:12.405254",
  "title": "That minor misrepresentation",
  "date_display": "October 16, 2007",
  "date_iso": "2007-10-16T18:44:00+00:00",
  "date_from_url": "2007-10-16",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>I always know that my critics are hard up for material when they have to <a href=\"http://conwebwatch.tripod.com/blog/index.blog?entry_id=1754152\">blatantly misrepresent something I’ve written</a> in order to criticize it:</p><blockquote><p>In his Oct. 15 WorldNetDaily column defending Ann Coutler’s remarks that Jews should become Christian, Vox Day gets disturbingly anti-Jewish.</p><p>Day writes that the apology sought from Coulter by “left-wing Jewish interest groups” “would appear to be an extraordinarily silly demand, except for the fact that Vanity Fair has recently announced that a remarkable 51 percent of the Vanity Fair 100 Power List are Jewish in a country in which Jews make up approximately two percent of the population.</p></blockquote><p>Quoting Vanity Fair?  How very disturbing!  Actually, it kind of is, but not for the reasons ConWebWatch gave.  The little problem here is that I never once mentioned an apology of any kind, nor did I write anything about a demand for one.  What I did reference was Ira Forman’s demand that media outlets not permit Ann Coulter to talk about politics, in fact, I <a href=\"http://www.worldnetdaily.com/news/article.asp?ARTICLE_ID=58139\">quoted him directly in my column yesterday</a>:</p><p><em>Scenting a fundraising issue, left-wing Jewish interest groups demonstrated their commitment to human liberty and free intellectual discourse by demanding that the mainstream media stop talking to the best-selling author who also happens to be one of the most popular right-wing commentators in the country. The executive director of the National Jewish Democratic Council, Ira N. Forman, reluctantly admitted that while Ann Coulter has freedom of speech, he would very much like to see her forced to exercise it in private.</em></p><p>“Just as media outlets don’t invite those who believe that Martians walk the earth to frequently comment on science stories, it’s time they stop inviting Ann Coulter to comment on politics,” he said. </p><p>There’s a big difference between seeking an apology – however unnecessary – and demanding the media shunning of one of the most popular political figures in the nation.  Now, I don’t believe Miss Coulter should apologize as she said nothing for which to apologize, and if any apologies are due, it is from Mr. Deutsch, whose persistent questions about Ann Coulter’s religion and subsequent feigned outrage were clearly not within the context of a book tour interview.  But regardless, I didn’t write about an apology, I wrote about a specific and very silly demand made by a specific, very silly left-wing Jew.</p><p>Christopher Hitchens has publicly articulated far more outrageous and offensive things in the last week than Ann Coulter, (he even managed to upset a sizeable number of his fellow atheists, amusingly enough), but should a right-wing Christian demand that media outlets across the country stop inviting him to comment on political issues, I would consider that to be every bit as silly.</p><p>As I informed Terry K in an email alerting her to the errant nature of her post, I am generally pro-Jew and pro-Israel.  However, I also believe that the Israel Lobby is a negative thing for both Jewish and non-Jewish Americans, as well as for Israel.  Their thinking, in my opinion, is short-sighted, bellicose, strategically dubious and likely to harm Jewish-Christian relations as well as fostering a dangerous Israeli dependency on the USA.</p></div>",
  "content_text": "I always know that my critics are hard up for material when they have to\nblatantly misrepresent something I’ve written\nin order to criticize it:\nIn his Oct. 15 WorldNetDaily column defending Ann Coutler’s remarks that Jews should become Christian, Vox Day gets disturbingly anti-Jewish.\nDay writes that the apology sought from Coulter by “left-wing Jewish interest groups” “would appear to be an extraordinarily silly demand, except for the fact that Vanity Fair has recently announced that a remarkable 51 percent of the Vanity Fair 100 Power List are Jewish in a country in which Jews make up approximately two percent of the population.\nQuoting Vanity Fair?  How very disturbing!  Actually, it kind of is, but not for the reasons ConWebWatch gave.  The little problem here is that I never once mentioned an apology of any kind, nor did I write anything about a demand for one.  What I did reference was Ira Forman’s demand that media outlets not permit Ann Coulter to talk about politics, in fact, I\nquoted him directly in my column yesterday\n:\nScenting a fundraising issue, left-wing Jewish interest groups demonstrated their commitment to human liberty and free intellectual discourse by demanding that the mainstream media stop talking to the best-selling author who also happens to be one of the most popular right-wing commentators in the country. The executive director of the National Jewish Democratic Council, Ira N. Forman, reluctantly admitted that while Ann Coulter has freedom of speech, he would very much like to see her forced to exercise it in private.\n“Just as media outlets don’t invite those who believe that Martians walk the earth to frequently comment on science stories, it’s time they stop inviting Ann Coulter to comment on politics,” he said.\nThere’s a big difference between seeking an apology – however unnecessary – and demanding the media shunning of one of the most popular political figures in the nation.  Now, I don’t believe Miss Coulter should apologize as she said nothing for which to apologize, and if any apologies are due, it is from Mr. Deutsch, whose persistent questions about Ann Coulter’s religion and subsequent feigned outrage were clearly not within the context of a book tour interview.  But regardless, I didn’t write about an apology, I wrote about a specific and very silly demand made by a specific, very silly left-wing Jew.\nChristopher Hitchens has publicly articulated far more outrageous and offensive things in the last week than Ann Coulter, (he even managed to upset a sizeable number of his fellow atheists, amusingly enough), but should a right-wing Christian demand that media outlets across the country stop inviting him to comment on political issues, I would consider that to be every bit as silly.\nAs I informed Terry K in an email alerting her to the errant nature of her post, I am generally pro-Jew and pro-Israel.  However, I also believe that the Israel Lobby is a negative thing for both Jewish and non-Jewish Americans, as well as for Israel.  Their thinking, in my opinion, is short-sighted, bellicose, strategically dubious and likely to harm Jewish-Christian relations as well as fostering a dangerous Israeli dependency on the USA.",
  "tags": [],
  "categories": [],
  "sitemap_lastmod": "2007-10-16T17:44:00+00:00"
}