{
  "url": "https://voxday.net/2007/10/20/mvp-2/",
  "scraped_at": "2026-01-08T21:57:34.772975",
  "title": "MVP",
  "date_display": "October 20, 2007",
  "date_iso": "2007-10-20T09:42:00+00:00",
  "date_from_url": "2007-10-20",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>To fully appreciate the irony of this post, you have to understand two things.  First, I play soccer with a pretty good Italian veterans team, (our next regional cup game is postponed because our opponent is a team of former professionals that is playing in the national cup), second, Italians don’t believe that Americans are capable of either understanding or playing the sport.</p><p>I’m not the very worst player on the team, but my technical skills are definitely rock-bottom so I’ve started only two games in three years, both times because the only other option was playing with ten men.  And while we’ve done very well the two previous seasons, winning promotion two years ago and nearly winning it again, to the highest level, last year – we collapsed in the last two games and finished third – this year we’ve gotten off to a horrific start in the <em>campionato</em>.  Six games, eight goals, one win.</p><p>Part of the problem is that we have only one new midfielder while losing three defensive starters.  Another part of it is that we’ve gotten older and our midfielders on the wings can’t run well enough to support our 4-4-2 tactics.  And, at the risk of sounding self-serving, our manager doesn’t make much use of his substitutes; I might have played a total of one game’s worth in those first six games.</p><p>Last night, we were facing the top-ranked team, we were missing two starters and our manager, in a half-hearted pep talk, made the case that if we played hard and with discipline, we’d be able to manage a tie.  He then promptly cut out the legs from his own argument and alarmed most of the squad, including me, by handing me the number 11 jersey, which meant that I was starting at striker.  He also changed the formation to a 3-5-2.  You know it’s bad when everyone is patting you on the back in warmups and insisting that everything is going to be okay, except, of course, for two of the better players who are so disgusted with the manager’s decision that they can’t even look at you.</p><p>We actually started off okay, putting their defense under some mild pressure and winning a corner kick or two.  Then the guy who by rights should have been starting at striker but was playing right wing instead was taken down hard and sprained his ankle badly.  He came out for the night, which left us with three subs, two of whom are worse than me and one guy who has a cannon for a shot and passes well but can’t really run.  Had anyone cared enough about the game to bet on it, the odds against us would have lengthened again.</p><p>In the meantime, I was under instructions to not worry about scoring or get overly involved in the action, but to focus on disrupting the defenders when they were building their attack, so a few minutes later I was chasing the ball from defender to defender, blocking the angle that would let them pass the ball up the field.  Basically, they play keepaway and you burn yourself out with little hope of even touching the ball, but at least it keeps the pressure off your defense.  After three passes, the last defender passed it back to the keeper, who tried to boot the ball downfield but shanked it instead.  Fortunately, I’d continued with the suddenly-not-so-futile chase, which gave me the chance to beat him to the ball and put it in the net.  1-0.</p><p>This seemed to inspire my fellow striker – one of the guys who couldn’t even bear to look at me before – to actually start passing the ball to me once in a while.  I returned the favor and we managed to keep the pressure up and put a few shots on goal before he beat two defenders and put the ball in the net himself.  2-0.</p><p>I was about to collapse at that point, so I took myself out of the game, which led to an amusing exchange wherein the other striker actually ran by the bench and screamed at the manager to get me back in the game.  This NEVER happens, believe me.  Even the manager cracked up.  After ten minutes, I’d recovered enough to go back in and we closed out the half up 2-0.</p><p>They had the wind in the second half and put us under some pressure, but didn’t create any serious chances while we came pretty close on one or two of our counterattacks.  Finally, one of our subs put a nice ball past the defense when they were up at midfield, I ran onto it, limited myself to two touches, and then took an early shot from about 25 meters out.  It was, as one of them said later, “un gol di Madonna”, sailing over the onrushing goalie’s arms before dipping into the corner of the net.  3-0 and the game was iced.  It all occasioned much amusement at the subsequent team dinner, as the guys all raised their glasses, shouted MVP, and nearly collapsed laughing at the sheer absurdity of upsetting the best team in the league thanks to the least skilled player on the squad.</p><p>It’s not my first goal this season and I scored three times that many goals in one game in the long-distant past, but I don’t know if I’ve ever played a better game.  And considering that there was a time last winter when I thought I might never be able to play again, I’m very thankful to have had the opportunity.  I’m not likely to start again this season, although I’ve probably earned a little more playing time, but it’s really nice to be confident that I’m not bound to let the team down if I do.</p></div>",
  "content_text": "To fully appreciate the irony of this post, you have to understand two things.  First, I play soccer with a pretty good Italian veterans team, (our next regional cup game is postponed because our opponent is a team of former professionals that is playing in the national cup), second, Italians don’t believe that Americans are capable of either understanding or playing the sport.\nI’m not the very worst player on the team, but my technical skills are definitely rock-bottom so I’ve started only two games in three years, both times because the only other option was playing with ten men.  And while we’ve done very well the two previous seasons, winning promotion two years ago and nearly winning it again, to the highest level, last year – we collapsed in the last two games and finished third – this year we’ve gotten off to a horrific start in the\ncampionato\n.  Six games, eight goals, one win.\nPart of the problem is that we have only one new midfielder while losing three defensive starters.  Another part of it is that we’ve gotten older and our midfielders on the wings can’t run well enough to support our 4-4-2 tactics.  And, at the risk of sounding self-serving, our manager doesn’t make much use of his substitutes; I might have played a total of one game’s worth in those first six games.\nLast night, we were facing the top-ranked team, we were missing two starters and our manager, in a half-hearted pep talk, made the case that if we played hard and with discipline, we’d be able to manage a tie.  He then promptly cut out the legs from his own argument and alarmed most of the squad, including me, by handing me the number 11 jersey, which meant that I was starting at striker.  He also changed the formation to a 3-5-2.  You know it’s bad when everyone is patting you on the back in warmups and insisting that everything is going to be okay, except, of course, for two of the better players who are so disgusted with the manager’s decision that they can’t even look at you.\nWe actually started off okay, putting their defense under some mild pressure and winning a corner kick or two.  Then the guy who by rights should have been starting at striker but was playing right wing instead was taken down hard and sprained his ankle badly.  He came out for the night, which left us with three subs, two of whom are worse than me and one guy who has a cannon for a shot and passes well but can’t really run.  Had anyone cared enough about the game to bet on it, the odds against us would have lengthened again.\nIn the meantime, I was under instructions to not worry about scoring or get overly involved in the action, but to focus on disrupting the defenders when they were building their attack, so a few minutes later I was chasing the ball from defender to defender, blocking the angle that would let them pass the ball up the field.  Basically, they play keepaway and you burn yourself out with little hope of even touching the ball, but at least it keeps the pressure off your defense.  After three passes, the last defender passed it back to the keeper, who tried to boot the ball downfield but shanked it instead.  Fortunately, I’d continued with the suddenly-not-so-futile chase, which gave me the chance to beat him to the ball and put it in the net.  1-0.\nThis seemed to inspire my fellow striker – one of the guys who couldn’t even bear to look at me before – to actually start passing the ball to me once in a while.  I returned the favor and we managed to keep the pressure up and put a few shots on goal before he beat two defenders and put the ball in the net himself.  2-0.\nI was about to collapse at that point, so I took myself out of the game, which led to an amusing exchange wherein the other striker actually ran by the bench and screamed at the manager to get me back in the game.  This NEVER happens, believe me.  Even the manager cracked up.  After ten minutes, I’d recovered enough to go back in and we closed out the half up 2-0.\nThey had the wind in the second half and put us under some pressure, but didn’t create any serious chances while we came pretty close on one or two of our counterattacks.  Finally, one of our subs put a nice ball past the defense when they were up at midfield, I ran onto it, limited myself to two touches, and then took an early shot from about 25 meters out.  It was, as one of them said later, “un gol di Madonna”, sailing over the onrushing goalie’s arms before dipping into the corner of the net.  3-0 and the game was iced.  It all occasioned much amusement at the subsequent team dinner, as the guys all raised their glasses, shouted MVP, and nearly collapsed laughing at the sheer absurdity of upsetting the best team in the league thanks to the least skilled player on the squad.\nIt’s not my first goal this season and I scored three times that many goals in one game in the long-distant past, but I don’t know if I’ve ever played a better game.  And considering that there was a time last winter when I thought I might never be able to play again, I’m very thankful to have had the opportunity.  I’m not likely to start again this season, although I’ve probably earned a little more playing time, but it’s really nice to be confident that I’m not bound to let the team down if I do.",
  "tags": [],
  "categories": [],
  "sitemap_lastmod": "2007-10-20T08:42:00+00:00"
}