{
  "url": "https://voxday.net/2007/10/22/oh-dear/",
  "scraped_at": "2026-01-08T21:57:43.947532",
  "title": "Oh dear",
  "date_display": "October 22, 2007",
  "date_iso": "2007-10-22T07:39:00+00:00",
  "date_from_url": "2007-10-22",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>I, too, like and admire Joseph Farah.  But like many, he doesn’t always quite <a href=\"http://www.worldnetdaily.com/news/article.asp?ARTICLE_ID=58269\">understand my somewhat dry sense of humor</a>:</p><blockquote><p>In his enthusiasm, he goes astray here, contending, “Vanity Fair has recently announced that a remarkable 51 percent of the Vanity Fair 100 Power List are Jewish in a country in which Jews make up approximately 2 percent of the population. Jews also make up 7 percent of the current House of Representatives, 13 percent of the Senate, and, according to John Mearsheimer and Stephen Walt, authors of ‘The Israel Lobby,’ roughly 100 percent of George W. Bush’s foreign policy advisers.”</p><p>But does Vox Day really believe roughly 100 percent of George W. Bush’s foreign policy advisers are Jewish?</p></blockquote><p>Well, no, he doesn’t.  I wasn’t under the impression that Condoleeza Rice was related to Sammy Davis Jr. or anything like that.  While the rest of the statistics are accurate as cited, the last one was a joke, which escaped more than a few people despite its obvious absurdity.  That’s fine, it happens all the time because I find few things more amusing than talking over people’s heads right to their face.  Farah, meanwhile, showed his own dry sense of humor in lauding my “selfless act of chivalry”.  That was funny.</p><p>As for the Israel Lobby, Mr. Farah and I shall simply have to agree to disagree, as there are many people insisting that the USA fight Israel’s battles against Iran and other enemies.  Israel’s wars, it is often asserted, are the USA’s wars, even though there is no formal military alliance between the two countries.  Regarding history and the fact that Jews were welcomed in a number of places prior to not being welcome, I am, of course, <a href=\"http://www.pbs.org/wnet/heritage/episode4/documents/documents_3.html\">verifiably correct</a>.</p><p><em>When I wished to make a city out of the village of Speyer, I Rüdiger, surnamed Huotzmann, bishop of Speyer, thought that the glory of our town would be augmented a thousandfold if I were to bring in Jews.</em></p><p>Still, I quite like Joseph’s open way of handling these disagreements, as you’ll note that despite his labling my “nonsense” as “Buchananesque”, he doesn’t hesitate to publish Mr. Patrick J. Buchanan either.  This is one of the many reasons I enjoy writing for WND instead of for other, more conventional publications.</p></div>",
  "content_text": "I, too, like and admire Joseph Farah.  But like many, he doesn’t always quite\nunderstand my somewhat dry sense of humor\n:\nIn his enthusiasm, he goes astray here, contending, “Vanity Fair has recently announced that a remarkable 51 percent of the Vanity Fair 100 Power List are Jewish in a country in which Jews make up approximately 2 percent of the population. Jews also make up 7 percent of the current House of Representatives, 13 percent of the Senate, and, according to John Mearsheimer and Stephen Walt, authors of ‘The Israel Lobby,’ roughly 100 percent of George W. Bush’s foreign policy advisers.”\nBut does Vox Day really believe roughly 100 percent of George W. Bush’s foreign policy advisers are Jewish?\nWell, no, he doesn’t.  I wasn’t under the impression that Condoleeza Rice was related to Sammy Davis Jr. or anything like that.  While the rest of the statistics are accurate as cited, the last one was a joke, which escaped more than a few people despite its obvious absurdity.  That’s fine, it happens all the time because I find few things more amusing than talking over people’s heads right to their face.  Farah, meanwhile, showed his own dry sense of humor in lauding my “selfless act of chivalry”.  That was funny.\nAs for the Israel Lobby, Mr. Farah and I shall simply have to agree to disagree, as there are many people insisting that the USA fight Israel’s battles against Iran and other enemies.  Israel’s wars, it is often asserted, are the USA’s wars, even though there is no formal military alliance between the two countries.  Regarding history and the fact that Jews were welcomed in a number of places prior to not being welcome, I am, of course,\nverifiably correct\n.\nWhen I wished to make a city out of the village of Speyer, I Rüdiger, surnamed Huotzmann, bishop of Speyer, thought that the glory of our town would be augmented a thousandfold if I were to bring in Jews.\nStill, I quite like Joseph’s open way of handling these disagreements, as you’ll note that despite his labling my “nonsense” as “Buchananesque”, he doesn’t hesitate to publish Mr. Patrick J. Buchanan either.  This is one of the many reasons I enjoy writing for WND instead of for other, more conventional publications.",
  "tags": [],
  "categories": [],
  "sitemap_lastmod": "2007-10-22T06:39:00+00:00"
}