{
  "url": "https://voxday.net/2007/10/20/post-pc-media/",
  "scraped_at": "2026-01-08T21:57:36.628721",
  "title": "The post-PC media",
  "date_display": "October 20, 2007",
  "date_iso": "2007-10-20T14:18:00+00:00",
  "date_from_url": "2007-10-20",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>Jason Whitlock <a href=\"http://msn.foxsports.com/nfl/story/7343980\"></a> about hip-hopping blacks in a team game:</p><blockquote><p>You get one NFL Truth today. Watching Chad Johnson and Larry Johnson undermine their respective head coaches, Marvin Lewis and Herm Edwards, on Sunday gave me a singular focus, forced me to contemplate an uncomfortable truth.</p><p>African-American football players caught up in the rebellion and buffoonery of hip hop culture have given NFL owners and coaches a justifiable reason to whiten their rosters. That will be the legacy left by Chad, Larry and Tank Johnson, Pacman Jones, Terrell Owens, Michael Vick and all the other football bojanglers.</p><p>It’s already starting to happen. A little-publicized fact is that the Colts and the Patriots — the league’s model franchises — are two of the whitest teams in the NFL.</p></blockquote><p>Wait, you mean that a gang-banging, look-at-me, self-centered individual isn’t conducive to team success?  Really?  The thing that’s funny about Whitlock’s recognition of the obvious is that it’s not actually about the hip hop, the race or the culture, it’s simply about the willingness and the ability of an individual to fit the role his team needs him to play.</p><p>(Yes, the Ray Lewis-led Ravens were an obvious exception, but then, they were also an exception to the rule that you need your offense to be able to score more than one touchdown a month in order to be compete in the NFL.)</p><p>Real Madrid’s famous <em>galacticos</em> strategy was a complete failure, not because the players were self-centered would-be rappers, but because the team composed entirely of world-class stars had no one to do the dirty work for them.  Starting both Zizou and Figo in the midfield was rather like trying to play Peyton Manning and Tom Brady at the same time.  The legendary club didn’t win a single championship or cup until after they gave up on the superlative skill uber alles strategy and let a few of the galactics go in favor of some (relatively) blue collar players.</p></div>",
  "content_text": "Jason Whitlock\nabout hip-hopping blacks in a team game:\nYou get one NFL Truth today. Watching Chad Johnson and Larry Johnson undermine their respective head coaches, Marvin Lewis and Herm Edwards, on Sunday gave me a singular focus, forced me to contemplate an uncomfortable truth.\nAfrican-American football players caught up in the rebellion and buffoonery of hip hop culture have given NFL owners and coaches a justifiable reason to whiten their rosters. That will be the legacy left by Chad, Larry and Tank Johnson, Pacman Jones, Terrell Owens, Michael Vick and all the other football bojanglers.\nIt’s already starting to happen. A little-publicized fact is that the Colts and the Patriots — the league’s model franchises — are two of the whitest teams in the NFL.\nWait, you mean that a gang-banging, look-at-me, self-centered individual isn’t conducive to team success?  Really?  The thing that’s funny about Whitlock’s recognition of the obvious is that it’s not actually about the hip hop, the race or the culture, it’s simply about the willingness and the ability of an individual to fit the role his team needs him to play.\n(Yes, the Ray Lewis-led Ravens were an obvious exception, but then, they were also an exception to the rule that you need your offense to be able to score more than one touchdown a month in order to be compete in the NFL.)\nReal Madrid’s famous\ngalacticos\nstrategy was a complete failure, not because the players were self-centered would-be rappers, but because the team composed entirely of world-class stars had no one to do the dirty work for them.  Starting both Zizou and Figo in the midfield was rather like trying to play Peyton Manning and Tom Brady at the same time.  The legendary club didn’t win a single championship or cup until after they gave up on the superlative skill uber alles strategy and let a few of the galactics go in favor of some (relatively) blue collar players.",
  "tags": [],
  "categories": [],
  "sitemap_lastmod": "2007-10-20T13:18:00+00:00"
}