{
  "url": "https://voxday.net/2007/10/13/prizewinner-on-pc/",
  "scraped_at": "2026-01-08T21:56:55.028245",
  "title": "A prizewinner on PC",
  "date_display": "October 13, 2007",
  "date_iso": "2007-10-13T14:24:00+00:00",
  "date_from_url": "2007-10-13",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>I’m no fan of Doris Lessing, and I have little doubt that Harold Bloom was wrong when he dismissed her Nobel Prize for literature as “pure political correctness.  However, she did, some years ago, express <a href=\"http://www.nytimes.com/2007/10/13/opinion/13lessing.html\">a few cogent thoughts on the concept</a>:</p><blockquote><p>WHILE we have seen the apparent death of Communism, ways of thinking that were either born under Communism or strengthened by Communism still govern our lives. Not all of them are as immediately evident as a legacy of Communism as political correctness….</p><p>I know the obfuscations of academia did not begin with Communism — as Swift, for one, tells us — but the pedantries and verbosity of Communism had their roots in German academia. And now that has become a kind of mildew blighting the whole world.</p></blockquote><p>This is one of the many reasons I harbor such disdain for academia and why I have such confidence in taking on some of its supposedly brighter lights.  Academics tend to be more intelligent than the average, but they are far from the only cognitive elite; moreover, the academics are intellectually enervated by their safe, mono-ideological, politically correct environment.</p><p>It’s interesting to note Richard Dawkins’s recent commitment to raising atheist consciousness in light of Lessing’s thoughts on the subject: <em>““Raising consciousness,” like “commitment,” like “political correctness,” is a continuation of that old bully, the party line.”</em></p></div>",
  "content_text": "I’m no fan of Doris Lessing, and I have little doubt that Harold Bloom was wrong when he dismissed her Nobel Prize for literature as “pure political correctness.  However, she did, some years ago, express\na few cogent thoughts on the concept\n:\nWHILE we have seen the apparent death of Communism, ways of thinking that were either born under Communism or strengthened by Communism still govern our lives. Not all of them are as immediately evident as a legacy of Communism as political correctness….\nI know the obfuscations of academia did not begin with Communism — as Swift, for one, tells us — but the pedantries and verbosity of Communism had their roots in German academia. And now that has become a kind of mildew blighting the whole world.\nThis is one of the many reasons I harbor such disdain for academia and why I have such confidence in taking on some of its supposedly brighter lights.  Academics tend to be more intelligent than the average, but they are far from the only cognitive elite; moreover, the academics are intellectually enervated by their safe, mono-ideological, politically correct environment.\nIt’s interesting to note Richard Dawkins’s recent commitment to raising atheist consciousness in light of Lessing’s thoughts on the subject:\n““Raising consciousness,” like “commitment,” like “political correctness,” is a continuation of that old bully, the party line.”",
  "tags": [],
  "categories": [],
  "sitemap_lastmod": "2007-10-13T13:24:00+00:00"
}