{
  "url": "https://voxday.net/2007/10/11/religion-and-war/",
  "scraped_at": "2026-01-08T21:56:39.487166",
  "title": "Religion and war",
  "date_display": "October 11, 2007",
  "date_iso": "2007-10-11T11:28:00+00:00",
  "date_from_url": "2007-10-11",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>I was reading Alexandre Dumas’s pop history of the Borgia family while travelling yesterday and ran across an interesting letter that helps demonstrate how religion is not and has never been a significant cause of war.  Now, the history of war between the Muslim Ottoman Empire and Christendom is a long and famous one, and yet even during that intractable struggle, there were numerous examples of other, more fundamental causes of division than the religious differences, as can be seen in this polite, but deadly request from the Sultan of the Turkish Empire to the Holy Father in Rome.</p><blockquote><p>“Bajazet the Sultan, son of the Sultan Mahomet II, by the grace of God Emperor of Asia and Europe, to the Father and Lord of all the Christians, Alexander VI, Roman pontiff and pope by the will of heavenly Providence, first, greetings that we owe him and bestow with all our heart.  We make known to your Highness, by the envoy of your Mightiness, Giorgio Bucciarda, that we have been apprised of your convalescence, and received the news thereof with great joy and comfort.  Among other matters, the said Bucciarda has brought us word that the King of France, now marching against your Highness, has shown a desire to take under his protection our brother D’jem, who is now under yours–a thing which is not only against our will, but which would also be the cause of great injury to your Highness and to all Christendom.</p><p>In turning the matter over with your envoy Giorgio we have devised a scheme most conducive to peace and most advantageous and honourable for your Highness; at the same time satisfactory to ourselves personally; it would be well if our aforesaid brother D’jem, who being a man is liable to death, and who is now in the hands of your Highness, should quit this world as soon as possible, seeing that his departure, a real good to him in his position, would be of great use to your Highness, and very conducive to your peace, while at the same time it would be very agreeable to us, your friend.  If this proposition is favourably received, as we hope, by your Highness, in your desire to be friendly towards us, it would be advisable both in the interests of your Highness and for our own satisfaction that it should occur rather sooner than later, and by the surest means you might be pleased to employ; so that our said brother D’jem might pass from the pains of this world into a better and more peaceful life, where at last he may find repose.  If your Highness should adapt this plan and send us the body of our brother, We, the above-named Sultan Bajazet, pledge<br>ourselves to send to your Highness, wheresoever and by whatsoever hands you please, the sum of 300,000 ducats, With which sum you could purchase some fair domain for your children.  In order to facilitate this purchase, we would be willing, while awaiting the issue, to place the 300,000 ducats in the hands of a third party, so that your Highness might be quite certain of receiving the money on an appointed day, in return for the despatch of our brother’s body.  Moreover, we promise your Highness herewith, for your greater satisfaction, that never, so long as you shall remain on the pontifical throne, shall there be any hurt done to the Christians, neither by us, nor by our servants, nor by any of our compatriots, of whatsoever kind or condition they may be, neither on sea nor on land.</br></p><p>And for the still further satisfaction of your Highness, and in order that no doubt whatever may remain concerning the fulfilment of our promises, we have sworn and affirmed in the presence of Bucciarda, your envoy, by the true God whom we adore and by our holy Gospels, that they shall be faithfully kept from the first point unto the last.  And now for the final and complete assurance of your Highness, in order that no doubt may still remain in your heart, and that you may be once again and profoundly convinced of our good faith, we the aforesaid Sultan Bajazet do swear by the true God, who has created the heavens and the earth and all that therein is, that we will religiously observe all that has been above said and declared, and in the future will do nothing and undertake nothing that may be contrary to the interests of your Highness.</p><p>“Given at Constantinople, in our palace, on the 12th of September A.D. 1494.”</p></blockquote><p>It should surprise no one that Alexander VI, being the second and more notorious of the Borgia Popes, did not shirk from poisoning D’Jem, but not before selling him to Charles VIII of France, thus arranging to profit not once, not twice, but thrice from the one-time claimant to the Turkish throne.  And, of course, Charles VIII’s invasion of Italy led at least one Christian prince to forge an alliance with the Muslim Sultan against his co-religionist.</p><p>I haven’t worked out one side of the equation yet, but I daresay that intra-family rivalries have been the cause of at least twice as many wars as religion.  Notice how Bajazet is putting out the contract on his brother in the interest of peace; that’s clearly pre-modern as these days the correct appeal would be “for the children”.</p></div>",
  "content_text": "I was reading Alexandre Dumas’s pop history of the Borgia family while travelling yesterday and ran across an interesting letter that helps demonstrate how religion is not and has never been a significant cause of war.  Now, the history of war between the Muslim Ottoman Empire and Christendom is a long and famous one, and yet even during that intractable struggle, there were numerous examples of other, more fundamental causes of division than the religious differences, as can be seen in this polite, but deadly request from the Sultan of the Turkish Empire to the Holy Father in Rome.\n“Bajazet the Sultan, son of the Sultan Mahomet II, by the grace of God Emperor of Asia and Europe, to the Father and Lord of all the Christians, Alexander VI, Roman pontiff and pope by the will of heavenly Providence, first, greetings that we owe him and bestow with all our heart.  We make known to your Highness, by the envoy of your Mightiness, Giorgio Bucciarda, that we have been apprised of your convalescence, and received the news thereof with great joy and comfort.  Among other matters, the said Bucciarda has brought us word that the King of France, now marching against your Highness, has shown a desire to take under his protection our brother D’jem, who is now under yours–a thing which is not only against our will, but which would also be the cause of great injury to your Highness and to all Christendom.\nIn turning the matter over with your envoy Giorgio we have devised a scheme most conducive to peace and most advantageous and honourable for your Highness; at the same time satisfactory to ourselves personally; it would be well if our aforesaid brother D’jem, who being a man is liable to death, and who is now in the hands of your Highness, should quit this world as soon as possible, seeing that his departure, a real good to him in his position, would be of great use to your Highness, and very conducive to your peace, while at the same time it would be very agreeable to us, your friend.  If this proposition is favourably received, as we hope, by your Highness, in your desire to be friendly towards us, it would be advisable both in the interests of your Highness and for our own satisfaction that it should occur rather sooner than later, and by the surest means you might be pleased to employ; so that our said brother D’jem might pass from the pains of this world into a better and more peaceful life, where at last he may find repose.  If your Highness should adapt this plan and send us the body of our brother, We, the above-named Sultan Bajazet, pledge\nourselves to send to your Highness, wheresoever and by whatsoever hands you please, the sum of 300,000 ducats, With which sum you could purchase some fair domain for your children.  In order to facilitate this purchase, we would be willing, while awaiting the issue, to place the 300,000 ducats in the hands of a third party, so that your Highness might be quite certain of receiving the money on an appointed day, in return for the despatch of our brother’s body.  Moreover, we promise your Highness herewith, for your greater satisfaction, that never, so long as you shall remain on the pontifical throne, shall there be any hurt done to the Christians, neither by us, nor by our servants, nor by any of our compatriots, of whatsoever kind or condition they may be, neither on sea nor on land.\nAnd for the still further satisfaction of your Highness, and in order that no doubt whatever may remain concerning the fulfilment of our promises, we have sworn and affirmed in the presence of Bucciarda, your envoy, by the true God whom we adore and by our holy Gospels, that they shall be faithfully kept from the first point unto the last.  And now for the final and complete assurance of your Highness, in order that no doubt may still remain in your heart, and that you may be once again and profoundly convinced of our good faith, we the aforesaid Sultan Bajazet do swear by the true God, who has created the heavens and the earth and all that therein is, that we will religiously observe all that has been above said and declared, and in the future will do nothing and undertake nothing that may be contrary to the interests of your Highness.\n“Given at Constantinople, in our palace, on the 12th of September A.D. 1494.”\nIt should surprise no one that Alexander VI, being the second and more notorious of the Borgia Popes, did not shirk from poisoning D’Jem, but not before selling him to Charles VIII of France, thus arranging to profit not once, not twice, but thrice from the one-time claimant to the Turkish throne.  And, of course, Charles VIII’s invasion of Italy led at least one Christian prince to forge an alliance with the Muslim Sultan against his co-religionist.\nI haven’t worked out one side of the equation yet, but I daresay that intra-family rivalries have been the cause of at least twice as many wars as religion.  Notice how Bajazet is putting out the contract on his brother in the interest of peace; that’s clearly pre-modern as these days the correct appeal would be “for the children”.",
  "tags": [],
  "categories": [],
  "sitemap_lastmod": "2007-10-11T10:28:00+00:00"
}