{
  "url": "https://voxday.net/2007/10/11/supporting-evidence/",
  "scraped_at": "2026-01-08T21:56:37.609196",
  "title": "Supporting evidence",
  "date_display": "October 11, 2007",
  "date_iso": "2007-10-11T09:29:00+00:00",
  "date_from_url": "2007-10-11",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>You may recall that <a href=\"http://www.milobookclub.com/2007/09/13/religion-and-mortality-rates/\">I cited the fact</a> that American hospitals count live births differently than do those of other countries due to the superior American health prenatal care to disprove Sam Harris’s attempt to blame the USA’s rate of infant mortality on its highly religious population in <i>Letter to a Christian Nation</i>.  It turns out that it’s not only technology that makes the USA’s prenatal care superior, but also the fact that it is less centralized, thereby avoiding <a href=\"http://www.foxnews.com/story/0,2933,300939,00.html\">the ever-present rationing</a> of the socialist systems:</p><blockquote><p>Carri Ash is one of at least 40 mothers or their babies who’ve been airlifted from British Columbia to the U.S. this year because Canadian hospitals didn’t have room for the preemies in their neonatal units.</p><p>“It’s a big number and bigger than the previous capacity of the system to deal with it,” said Adrian Dix, a British Columbia legislator, told FOXNews.com. “So when that happens, you can’t have a waiting list for a mother having the baby. She just has the baby.”</p><p>The mothers have been flown to hospitals in Seattle, Everett, Wash., and Spokane, Wash., to receive treatment, as well as hospitals in the neighboring province of Alberta, Dix said. Three mothers were airlifted in the first weekend of October alone, including Carri Ash.</p></blockquote><p>Clearly, the proper irreligious thing to do would be to deny these Canadian infants care and let them die uncounted like a good, post-Christian European country would.  Can you believe the outrageously primitive those Bible-thumping, predominantly Christian, science-challenged Americans are?</p></div>",
  "content_text": "You may recall that\nI cited the fact\nthat American hospitals count live births differently than do those of other countries due to the superior American health prenatal care to disprove Sam Harris’s attempt to blame the USA’s rate of infant mortality on its highly religious population in\nLetter to a Christian Nation\n.  It turns out that it’s not only technology that makes the USA’s prenatal care superior, but also the fact that it is less centralized, thereby avoiding\nthe ever-present rationing\nof the socialist systems:\nCarri Ash is one of at least 40 mothers or their babies who’ve been airlifted from British Columbia to the U.S. this year because Canadian hospitals didn’t have room for the preemies in their neonatal units.\n“It’s a big number and bigger than the previous capacity of the system to deal with it,” said Adrian Dix, a British Columbia legislator, told FOXNews.com. “So when that happens, you can’t have a waiting list for a mother having the baby. She just has the baby.”\nThe mothers have been flown to hospitals in Seattle, Everett, Wash., and Spokane, Wash., to receive treatment, as well as hospitals in the neighboring province of Alberta, Dix said. Three mothers were airlifted in the first weekend of October alone, including Carri Ash.\nClearly, the proper irreligious thing to do would be to deny these Canadian infants care and let them die uncounted like a good, post-Christian European country would.  Can you believe the outrageously primitive those Bible-thumping, predominantly Christian, science-challenged Americans are?",
  "tags": [],
  "categories": [],
  "sitemap_lastmod": "2007-10-11T08:29:00+00:00"
}