{
  "url": "https://voxday.net/2007/10/31/too-close-for-comfor/",
  "scraped_at": "2026-01-08T21:58:49.973071",
  "title": "Too close for comfort",
  "date_display": "October 31, 2007",
  "date_iso": "2007-10-31T11:35:00+00:00",
  "date_from_url": "2007-10-31",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>I finally got around to taking <a href=\"http://www.humanmetrics.com/cgi-win/JTypes1.htm\">a Jung-based personality profile test</a>.  I’d been told in that past that I fit one of them rather well, but I didn’t remember which one it was.  After reading the results for the INTJ, it was a little surprising to see how specific some of the descriptions were and how well they fit, especially given my skeptical attitude towards all things even remotely related to Freudian fraudulence.</p><blockquote><p><a href=\"http://typelogic.com/intj.html\">INTJs are perfectionists</a>, with a seemingly endless capacity for improving upon anything that takes their interest. What prevents them from becoming chronically bogged down in this pursuit of perfection is the pragmatism so characteristic of the type: INTJs apply (often ruthlessly) the criterion “Does it work?” to everything from their own research efforts to the prevailing social norms. This in turn produces an unusual independence of mind, freeing the INTJ from the constraints of authority, convention, or sentiment for its own sake.</p><p>INTJs are known as the “Systems Builders” of the types, perhaps in part because they possess the unusual trait combination of imagination and reliability. Whatever system an INTJ happens to be working on is for them the equivalent of a moral cause to an INFJ; both perfectionism and disregard for authority may come into play, as INTJs can be unsparing of both themselves and the others on the project.</p></blockquote><p>This is, of course, somewhat amusing in light of my longtime occupation as a game and technology designer.  Even as a novelist, it is the world-building aspects that interest me most.  And I suppose I have been accused of demonstrating a certain amount of disregard for authority from time to time.</p><p>The INTJ profile is also labled <a href=\"http://keirsey.com/handler.aspx?s=keirsey&amp;f=fourtemps&amp;tab=5&amp;c=mastermind\">the Rationalist Mastermind</a>, a description which no doubt will tend to make my rational materialist critics want to gag, although it probably goes a long way towards explaining the substantive difference between my response to the New Atheist canon and that of other theists such as D’Souza, McGrath and Wilson.</p><blockquote><p>It is in their abilities that Masterminds differ from the other Rationals, while in most of their attitudes they are just like the others. However there is one attitude that sets them apart from other Rationals: they tend to be much more self-confident than the rest, having, for obscure reasons, developed a very strong will. They are rather rare, comprising no more than, say, one percent of the population….</p><p>Masterminds are not at all eager to take command of projects or groups, preferring to stay in the background until others demonstrate their inability to lead. Once in charge, however, Masterminds are the supreme pragmatists, seeing reality as a crucible for refining their strategies for goal-directed action. In a sense, Masterminds approach reality as they would a giant chess board, always seeking strategies that have a high payoff, and always devising contingency plans in case of error or adversity. To the Mastermind, organizational structure and operational procedures are never arbitrary, never set in concrete, but are quite malleable and can be changed, improved, streamlined. In their drive for efficient action, Masterminds are the most open-minded of all the types. No idea is too far-fetched to be entertained-if it is useful. Masterminds are natural brainstormers, always open to new concepts and, in fact, aggressively seeking them.</p></blockquote><p>This is also somewhat amusing, as I am positively allergic to taking on the responsibility of leadership, but frequently find myself being nominated for patrol leader, team captain, editor or CEO.  I’ve seldom regretted it after the fact, but the way those responsibilities always end up interfering with what I’d rather be doing tends to keep my resistance levels strong.</p><p>Anyhow, I’ll be curious to see what the most common profile here turns out to be in case any of you are inclined to take the test.</p></div>",
  "content_text": "I finally got around to taking\na Jung-based personality profile test\n.  I’d been told in that past that I fit one of them rather well, but I didn’t remember which one it was.  After reading the results for the INTJ, it was a little surprising to see how specific some of the descriptions were and how well they fit, especially given my skeptical attitude towards all things even remotely related to Freudian fraudulence.\nINTJs are perfectionists\n, with a seemingly endless capacity for improving upon anything that takes their interest. What prevents them from becoming chronically bogged down in this pursuit of perfection is the pragmatism so characteristic of the type: INTJs apply (often ruthlessly) the criterion “Does it work?” to everything from their own research efforts to the prevailing social norms. This in turn produces an unusual independence of mind, freeing the INTJ from the constraints of authority, convention, or sentiment for its own sake.\nINTJs are known as the “Systems Builders” of the types, perhaps in part because they possess the unusual trait combination of imagination and reliability. Whatever system an INTJ happens to be working on is for them the equivalent of a moral cause to an INFJ; both perfectionism and disregard for authority may come into play, as INTJs can be unsparing of both themselves and the others on the project.\nThis is, of course, somewhat amusing in light of my longtime occupation as a game and technology designer.  Even as a novelist, it is the world-building aspects that interest me most.  And I suppose I have been accused of demonstrating a certain amount of disregard for authority from time to time.\nThe INTJ profile is also labled\nthe Rationalist Mastermind\n, a description which no doubt will tend to make my rational materialist critics want to gag, although it probably goes a long way towards explaining the substantive difference between my response to the New Atheist canon and that of other theists such as D’Souza, McGrath and Wilson.\nIt is in their abilities that Masterminds differ from the other Rationals, while in most of their attitudes they are just like the others. However there is one attitude that sets them apart from other Rationals: they tend to be much more self-confident than the rest, having, for obscure reasons, developed a very strong will. They are rather rare, comprising no more than, say, one percent of the population….\nMasterminds are not at all eager to take command of projects or groups, preferring to stay in the background until others demonstrate their inability to lead. Once in charge, however, Masterminds are the supreme pragmatists, seeing reality as a crucible for refining their strategies for goal-directed action. In a sense, Masterminds approach reality as they would a giant chess board, always seeking strategies that have a high payoff, and always devising contingency plans in case of error or adversity. To the Mastermind, organizational structure and operational procedures are never arbitrary, never set in concrete, but are quite malleable and can be changed, improved, streamlined. In their drive for efficient action, Masterminds are the most open-minded of all the types. No idea is too far-fetched to be entertained-if it is useful. Masterminds are natural brainstormers, always open to new concepts and, in fact, aggressively seeking them.\nThis is also somewhat amusing, as I am positively allergic to taking on the responsibility of leadership, but frequently find myself being nominated for patrol leader, team captain, editor or CEO.  I’ve seldom regretted it after the fact, but the way those responsibilities always end up interfering with what I’d rather be doing tends to keep my resistance levels strong.\nAnyhow, I’ll be curious to see what the most common profile here turns out to be in case any of you are inclined to take the test.",
  "tags": [],
  "categories": [],
  "sitemap_lastmod": "2007-10-31T11:35:00+00:00"
}