{
  "url": "https://voxday.net/2008/08/28/alert-blackskirts/",
  "scraped_at": "2026-01-08T22:34:04.602604",
  "title": "Alert the Blackskirts!",
  "date_display": "August 28, 2008",
  "date_iso": "2008-08-28T09:02:00+00:00",
  "date_from_url": "2008-08-28",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>Stefanie Marsh commits the crime of puncturing <a href=\"http://women.timesonline.co.uk/tol/life_and_style/women/relationships/article4415617.ece\">the Myth of the Happy Single</a>:</p><blockquote><p>That’s the truth about being single; it can be horrendous, only I’m not allowed to admit it. For a few months I have been leading what most anthropologists would describe as a highly unusual existence in my one-person flat, and yet prevailing 21st-century thought – the publishing industry, marketing bods keen to get their grubby paws on what’s left of my disposable income – are trying to convince me that being single is the best thing in the world that can happen to a person…  [T]here’s a myth being perpetuated that being single is great!</p><p>You’re not bored, you just think you’re bored because being single is fabulous! There are more than 3 million single people living in Britain today – everyone’s at it, why not join in the fun? You can drink cocktails like they did in Sex and the City! You can play Nintendo into the dead of night! Absolutely nobody in the world gives a toss about you, but, never mind, you’ve won the lottery of life.</p></blockquote><p>There’s always something very brittle about the thirty-something single woman.  She’s often attractive and well-dressed with a smile that’s just a little too broad, and she’s just a little bit to ready to inform you that she’s really, really great and things are going really, really well and her life has never been better.  Okay, perhaps more than just a little bit ready… I’m always taken aback when a pretty thirty-something single woman launches into a flawless, apparently well-rehearsed monologue about how fabulous her life is, and how happy she is to be single, and how she’s finally gotten over the need to feel that she needs to be dating someone in order to feel complete, and how she’s really okay with it if the right man doesn’t happen to come along after all because she’s got so many really great friends that care so much about her.  Meanwhile, I am creating the errrant impression that I am an excellent listener, mostly because I am occupied with thinking: “who is this person and am I actually supposed to know her name or not?”  Most of the time, she turns out to be yet another PR rep, marketeer or headhunter.  Desperate, but harmless, and you can safely exchange cards without having to do any more than decline the <i>Linked In</i> invitation that will inevitably show up in your email two weeks later.</p><p>Now, obviously some people are happiest alone.  There’s nothing wrong with that, and if it weren’t for Spacebunny, who requires an unusual amount of solitude for a woman, then I’d almost surely prefer being alone too.  But they’re the statistical outliers, as few people can handle even a single year of working from home without it having a negative effect on them.</p><p>The thing is, we’re all on a timer.  Not just for marriage and children, but for everything that we hope to accomplish or experience in this lifetime.  This is true whether one is cognizant of it or not, and the sooner one realizes the truth, the better.  It’s unfortunate, though, that so many women have bought into the Happy Single myth they were sold; it’s even more unfortunate that they have been rendered more or less unmarriageable by the equalitarian propaganda factory and the public-private partnership that is the divorce industry.</p></div>",
  "content_text": "Stefanie Marsh commits the crime of puncturing\nthe Myth of the Happy Single\n:\nThat’s the truth about being single; it can be horrendous, only I’m not allowed to admit it. For a few months I have been leading what most anthropologists would describe as a highly unusual existence in my one-person flat, and yet prevailing 21st-century thought – the publishing industry, marketing bods keen to get their grubby paws on what’s left of my disposable income – are trying to convince me that being single is the best thing in the world that can happen to a person…  [T]here’s a myth being perpetuated that being single is great!\nYou’re not bored, you just think you’re bored because being single is fabulous! There are more than 3 million single people living in Britain today – everyone’s at it, why not join in the fun? You can drink cocktails like they did in Sex and the City! You can play Nintendo into the dead of night! Absolutely nobody in the world gives a toss about you, but, never mind, you’ve won the lottery of life.\nThere’s always something very brittle about the thirty-something single woman.  She’s often attractive and well-dressed with a smile that’s just a little too broad, and she’s just a little bit to ready to inform you that she’s really, really great and things are going really, really well and her life has never been better.  Okay, perhaps more than just a little bit ready… I’m always taken aback when a pretty thirty-something single woman launches into a flawless, apparently well-rehearsed monologue about how fabulous her life is, and how happy she is to be single, and how she’s finally gotten over the need to feel that she needs to be dating someone in order to feel complete, and how she’s really okay with it if the right man doesn’t happen to come along after all because she’s got so many really great friends that care so much about her.  Meanwhile, I am creating the errrant impression that I am an excellent listener, mostly because I am occupied with thinking: “who is this person and am I actually supposed to know her name or not?”  Most of the time, she turns out to be yet another PR rep, marketeer or headhunter.  Desperate, but harmless, and you can safely exchange cards without having to do any more than decline the\nLinked In\ninvitation that will inevitably show up in your email two weeks later.\nNow, obviously some people are happiest alone.  There’s nothing wrong with that, and if it weren’t for Spacebunny, who requires an unusual amount of solitude for a woman, then I’d almost surely prefer being alone too.  But they’re the statistical outliers, as few people can handle even a single year of working from home without it having a negative effect on them.\nThe thing is, we’re all on a timer.  Not just for marriage and children, but for everything that we hope to accomplish or experience in this lifetime.  This is true whether one is cognizant of it or not, and the sooner one realizes the truth, the better.  It’s unfortunate, though, that so many women have bought into the Happy Single myth they were sold; it’s even more unfortunate that they have been rendered more or less unmarriageable by the equalitarian propaganda factory and the public-private partnership that is the divorce industry.",
  "tags": [],
  "categories": [],
  "sitemap_lastmod": "2008-08-28T08:02:00+00:00"
}