{
  "url": "https://voxday.net/2008/08/11/blackfive-thinks-too-logistically/",
  "scraped_at": "2026-01-08T22:32:50.883762",
  "title": "Blackfive thinks too logistically",
  "date_display": "August 11, 2008",
  "date_iso": "2008-08-11T14:23:00+00:00",
  "date_from_url": "2008-08-11",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>And <a href=\"http://www.blackfive.net/main/2008/08/the-devil-went.html\">misses the entire point</a> of the South Ossetian situation:</p><blockquote><p>For those that are still fixated on the idea that Georgia started this and Russia simply responded, answer me how what appears to be multiple combined-arms groups just happened to be able to respond so quickly, including the sortie of parts of the Black Sea fleet? It takes a lot of time, planning, and even movement and stockpiling of logistics to make that happen. The troubling question raised is how was it missed by — apparently — so many? It’s not like it’s easy to hide and that was part of what I will call the Fulda Tripwire: the movement and stockpiling takes time, for a combined arms force on the Soviet model chews through supplies in a way that makes a high school football team at an all-you-can-eat buffet seem like pikers. One example is in the shelling done and still ongoing — think about the rate of supply and resupply and then think about being surprised…</p></blockquote><p>This battle for Georgia – not South Ossetia – is a long time in coming.  Bill Clinton laid the groundwork for it by altering the rules of the game in Serbia, in which it was made clear that a major power had the right to intervene on behalf of a breakaway republic if it cried “help, help, I’m being repressed” by the sovereign territory owner.  The Russians rightly feel that they’re playing by our rules and they have every reason to believe they’re going to get away with it since there is zero sympathy for the anti-Russian US position in Europe.  The European position, quite reasonably, is to shrug and assume that it’s just like Kosovo, except that they also don’t want to upset their Russian fuel supplies.</p><p>At this point, the Georgian attack on South Ossetia appears to have been a terrible miscalculation by the Georgians and their US and Israeli advisors, who have been trying to solidify control over the oil pipeline in recent months.  As some observers have noted, there’s even some reason to believe that the foreign advisors may have been in the forefront of the attack, based on the appearance of the troops and their gear in pictures of the earliest action.  (I don’t have an opinion on this; I didn’t see the pictures myself.)  In overreacting to the obvious provocations from the Russian-backed South Ossetians, the Georgians handed Russia the excuse it was quite obviously waiting for.  I doubt Russia wants to annex Georgia, they are seeking a regime change, preferably to one that is pro-Russian.</p><p>Georgia did start this.  That the Russians anticipated such a blunder and are taking full advantage of it doesn’t change the central fact of the situation.  The truly worrisome possibility is not Russian expansion in the Soviet model, but rather, the idea that the attack on South Ossetia was not a blunder, but rather an intentional provocation by the USA designed to trigger a wider war in the area that will allow for a strike on Iran before the end of the Bush administration.  Time will tell.</p><p>Michael Ledeen, weighs in with some neoconnery in the place of his usual thoughtful consideration:</p><blockquote><p>When you’re doing reading it, ask yourself what’s the difference between this and the annexation of the Sudetenland?</p></blockquote><p>Oh, not much.  Other than the fact that the Czechs didn’t attack the Sudentenland and that the Russians are demanding recognition for <a href=\"http://www.regnum.ru/english/737823.html\">South Ossetian independence</a>, not its annexation.  The Georgian situation has far more in common with Serbia and Kosovo, but you’d never know that to listen to the neocons.  I wonder how long will it be until the first “Putin is the new Hitler” column is written?</p><p>Ledeen’s fellow Cornerite, Andrew Sullivan, notes the correct analogy with a prophetic quote from Lech Walesa:</p><blockquote><p>“Recognizing Kosovo will bring nothing but trouble. No one can be denied the right to self-determination, but only within the bounds of common sense…with its irresponsible behaviour, [Kosovo is] causing new divisions in Europe and globally and undermining international relations.”</p></blockquote><p>To say nothing of handing <s>NATO</s>Russia an excuse for nobly defending the right to self-determination of the oppressed <s>Kosovars</s>South Ossetians, who are suffering at the genocidal hands of <s>Serbia</s>Georgia.</p></div>",
  "content_text": "And\nmisses the entire point\nof the South Ossetian situation:\nFor those that are still fixated on the idea that Georgia started this and Russia simply responded, answer me how what appears to be multiple combined-arms groups just happened to be able to respond so quickly, including the sortie of parts of the Black Sea fleet? It takes a lot of time, planning, and even movement and stockpiling of logistics to make that happen. The troubling question raised is how was it missed by — apparently — so many? It’s not like it’s easy to hide and that was part of what I will call the Fulda Tripwire: the movement and stockpiling takes time, for a combined arms force on the Soviet model chews through supplies in a way that makes a high school football team at an all-you-can-eat buffet seem like pikers. One example is in the shelling done and still ongoing — think about the rate of supply and resupply and then think about being surprised…\nThis battle for Georgia – not South Ossetia – is a long time in coming.  Bill Clinton laid the groundwork for it by altering the rules of the game in Serbia, in which it was made clear that a major power had the right to intervene on behalf of a breakaway republic if it cried “help, help, I’m being repressed” by the sovereign territory owner.  The Russians rightly feel that they’re playing by our rules and they have every reason to believe they’re going to get away with it since there is zero sympathy for the anti-Russian US position in Europe.  The European position, quite reasonably, is to shrug and assume that it’s just like Kosovo, except that they also don’t want to upset their Russian fuel supplies.\nAt this point, the Georgian attack on South Ossetia appears to have been a terrible miscalculation by the Georgians and their US and Israeli advisors, who have been trying to solidify control over the oil pipeline in recent months.  As some observers have noted, there’s even some reason to believe that the foreign advisors may have been in the forefront of the attack, based on the appearance of the troops and their gear in pictures of the earliest action.  (I don’t have an opinion on this; I didn’t see the pictures myself.)  In overreacting to the obvious provocations from the Russian-backed South Ossetians, the Georgians handed Russia the excuse it was quite obviously waiting for.  I doubt Russia wants to annex Georgia, they are seeking a regime change, preferably to one that is pro-Russian.\nGeorgia did start this.  That the Russians anticipated such a blunder and are taking full advantage of it doesn’t change the central fact of the situation.  The truly worrisome possibility is not Russian expansion in the Soviet model, but rather, the idea that the attack on South Ossetia was not a blunder, but rather an intentional provocation by the USA designed to trigger a wider war in the area that will allow for a strike on Iran before the end of the Bush administration.  Time will tell.\nMichael Ledeen, weighs in with some neoconnery in the place of his usual thoughtful consideration:\nWhen you’re doing reading it, ask yourself what’s the difference between this and the annexation of the Sudetenland?\nOh, not much.  Other than the fact that the Czechs didn’t attack the Sudentenland and that the Russians are demanding recognition for\nSouth Ossetian independence\n, not its annexation.  The Georgian situation has far more in common with Serbia and Kosovo, but you’d never know that to listen to the neocons.  I wonder how long will it be until the first “Putin is the new Hitler” column is written?\nLedeen’s fellow Cornerite, Andrew Sullivan, notes the correct analogy with a prophetic quote from Lech Walesa:\n“Recognizing Kosovo will bring nothing but trouble. No one can be denied the right to self-determination, but only within the bounds of common sense…with its irresponsible behaviour, [Kosovo is] causing new divisions in Europe and globally and undermining international relations.”\nTo say nothing of handing\nNATO\nRussia an excuse for nobly defending the right to self-determination of the oppressed\nKosovars\nSouth Ossetians, who are suffering at the genocidal hands of\nSerbia\nGeorgia.",
  "tags": [],
  "categories": [],
  "sitemap_lastmod": "2008-08-11T13:23:00+00:00"
}