{
  "url": "https://voxday.net/2008/08/21/blithering-ignorance/",
  "scraped_at": "2026-01-08T22:33:30.711128",
  "title": "Blithering ignorance",
  "date_display": "August 21, 2008",
  "date_iso": "2008-08-21T09:40:00+00:00",
  "date_from_url": "2008-08-21",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>There are few things more ludicrous, or more unintentionally funny, than journalists attempting to write about economics.  The ink-stained wretches may be many things, but intelligent and well-educated are not two of them.  Read this paragraph and see if you can spot the glaring logical train wreck that David Leonhardt makes of <a href=\"http://www.nytimes.com/2008/08/24/magazine/24Obamanomics-t.html?em\">what appears to be his first foray into macroeconomics</a>:</p><blockquote><p>For three decades now, the American economy has been in what the historian Sean Wilentz calls the Age of Reagan. The government has deregulated industries, opened the economy more to market forces and, above all, cut income taxes. Much good has come of this — the end of 1970s stagflation, infrequent and relatively mild recessions, faster growth than that of the more regulated economies of Europe. Yet laissez-faire capitalism hasn’t delivered nearly what its proponents promised. It has created big budget deficits, the most pronounced income inequality since the 1920s and the current financial crisis. As Lawrence Summers, the former Treasury secretary and Rubin ally from the Clinton administration, says: “We’ve probably done a better job of the last 20 years on the problems the market can solve than the problems the market can’t solve. We’re doing pretty well on the size of people’s houses and televisions and the like. We’re not looking so good on infrastructure and education.”</p></blockquote><p>1.  How in the name of Adam Smith does laissez-faire capitalism create a budget deficit of any kind?  What is the precise mechanism by which a genuinely free market determines the tax inflows and spending outflows of a national government?</p><p>2.  Given that income inequality is far worse in the tightly controlled economies of Latin America and the many severe restrictions on the not-very-free market’s operation in the USA, it is clearly incorrect, if not downright bizarre, to attempt to blame the undeniable fact of American income inequality on something that does not actually exist in America.</p><p>3.  The current financial crisis is a direct result of interest rates being set at artificially low levels by the Federal Reserve.  Given that the U.S. currency is a government-established monopoly protected with the full force of law, how can this possibly be interpreted as an indictment of a free market in operation?</p><p>4.  What percentage of “infrastructure and education” are provided by the free market and what percentage are provided by government?  To the extent that the latter is more than zero, there is obviously a limited amount of laissez-faire capitalism involved.</p><p>Regarding the article itself, it shows Obama to be the same sort of left-wing statist that we’ve seen a hundred times before.  While he has some accurate perceptions on the smaller issues, he subscribes to the greatest economic foolishness of all; the idea that the national economy is a singular entity capable of being somehow improved through government management.  Obama’s concept of a theme to compete with “lower taxes, smaller government” is downright hilarious:</p><p><i>“So what we need to bring about is the end of the era of unresponsive and inefficient government and short-term thinking in government, so that the government is laying the groundwork, the framework, the foundation for the market to operate effectively and for every single individual to be able to be connected with that market and to succeed in that market.”</i></p><p>Government-managed markets where no one is a loser.  Yeah, that’s a theme no one’s ever tried before… and this is supposed to be HopeChange?  The ending is the perfect punchline to what one finally begins to suspect was intended as a surreptitious piece of guerilla comedy all along, as Leonhardt cites global warming in <i>contrast</i> to all the previous environmental crises that turned out to be overheated figments of scientific imaginations.</p></div>",
  "content_text": "There are few things more ludicrous, or more unintentionally funny, than journalists attempting to write about economics.  The ink-stained wretches may be many things, but intelligent and well-educated are not two of them.  Read this paragraph and see if you can spot the glaring logical train wreck that David Leonhardt makes of\nwhat appears to be his first foray into macroeconomics\n:\nFor three decades now, the American economy has been in what the historian Sean Wilentz calls the Age of Reagan. The government has deregulated industries, opened the economy more to market forces and, above all, cut income taxes. Much good has come of this — the end of 1970s stagflation, infrequent and relatively mild recessions, faster growth than that of the more regulated economies of Europe. Yet laissez-faire capitalism hasn’t delivered nearly what its proponents promised. It has created big budget deficits, the most pronounced income inequality since the 1920s and the current financial crisis. As Lawrence Summers, the former Treasury secretary and Rubin ally from the Clinton administration, says: “We’ve probably done a better job of the last 20 years on the problems the market can solve than the problems the market can’t solve. We’re doing pretty well on the size of people’s houses and televisions and the like. We’re not looking so good on infrastructure and education.”\n1.  How in the name of Adam Smith does laissez-faire capitalism create a budget deficit of any kind?  What is the precise mechanism by which a genuinely free market determines the tax inflows and spending outflows of a national government?\n2.  Given that income inequality is far worse in the tightly controlled economies of Latin America and the many severe restrictions on the not-very-free market’s operation in the USA, it is clearly incorrect, if not downright bizarre, to attempt to blame the undeniable fact of American income inequality on something that does not actually exist in America.\n3.  The current financial crisis is a direct result of interest rates being set at artificially low levels by the Federal Reserve.  Given that the U.S. currency is a government-established monopoly protected with the full force of law, how can this possibly be interpreted as an indictment of a free market in operation?\n4.  What percentage of “infrastructure and education” are provided by the free market and what percentage are provided by government?  To the extent that the latter is more than zero, there is obviously a limited amount of laissez-faire capitalism involved.\nRegarding the article itself, it shows Obama to be the same sort of left-wing statist that we’ve seen a hundred times before.  While he has some accurate perceptions on the smaller issues, he subscribes to the greatest economic foolishness of all; the idea that the national economy is a singular entity capable of being somehow improved through government management.  Obama’s concept of a theme to compete with “lower taxes, smaller government” is downright hilarious:\n“So what we need to bring about is the end of the era of unresponsive and inefficient government and short-term thinking in government, so that the government is laying the groundwork, the framework, the foundation for the market to operate effectively and for every single individual to be able to be connected with that market and to succeed in that market.”\nGovernment-managed markets where no one is a loser.  Yeah, that’s a theme no one’s ever tried before… and this is supposed to be HopeChange?  The ending is the perfect punchline to what one finally begins to suspect was intended as a surreptitious piece of guerilla comedy all along, as Leonhardt cites global warming in\ncontrast\nto all the previous environmental crises that turned out to be overheated figments of scientific imaginations.",
  "tags": [],
  "categories": [],
  "sitemap_lastmod": "2008-08-21T08:40:00+00:00"
}