{
  "url": "https://voxday.net/2008/08/08/breaking-pseudos/",
  "scraped_at": "2026-01-08T22:32:30.585115",
  "title": "Of pseudos and the Peloponnesus",
  "date_display": "August 8, 2008",
  "date_iso": "2008-08-08T07:51:00+00:00",
  "date_from_url": "2008-08-08",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>David Brooks writes <a href=\"http://www.nytimes.com/2008/08/08/opinion/08brooks.html?_r=1&amp;hp&amp;oref=slogin\">an uncharacteristically funny column</a> in the New York Times:</p><blockquote><p>All my life I’ve been a successful pseudo-intellectual, sprinkling quotations from Kafka, Epictetus and Derrida into my conversations, impressing dates and making my friends feel mentally inferior. But over the last few years, it’s stopped working. People just look at me blankly. My artificially inflated self-esteem is on the wane. What happened?</p></blockquote><p>It’s quite amusing; I particularly liked his concept of the early discarder.  I have to confess that I’ve always been somewhat mystified by the concept of an intellectual vogue since I like what I like and it doesn’t trouble me at all that some of my favorite writers, formerly names often heard dropped by the sort of meme lords Brooks mocks, are now passe.  There are few things I despise more than a pretense that one has experience of things that one actually has not; it’s amazing how much posery one inadvertantly uncovers merely by happening to live in Europe.</p><p>Do tell me again how very European it is to live in Quebec, mon ami….</p><p>Spacebunny is always amused when women of a certain age and income level are so good as to tell her what Italy is like, based on the two weeks they spent three summers ago traversing Florence, Venice, and the Cinque Terre.  I once nearly had to kick a guest out of our house when he furiously insisted that as an experienced international businessman, he did too know how to make European phone calls, the fact that every time he tried to dial a hotel in Venice he reached someone who spoke only German notwithstanding.</p><p>It’s certainly pleasant to know things, but knowledge doesn’t actually make you a better person.  Everyone is ignorant of many things, since it’s not possible to be a true polymath in the Age of Information.  For all my extensive knowledge of World of Warcraft and Age of Conan, I don’t know much about Vanguard – which is fine – or Everquest – which is not – or Ultima Online – which is really reprehensible.  I’m also shockingly ignorant of American Idol and a whole host of pop cultural items, but to be honest, with regards to this sort of thing there’s a good case to be made that ignorance is bliss.  I certainly wouldn’t sneer at those who don’t keep up on the state of NFL salary caps, unless, of course, they’re trying to tell me that <a href=\"http://sportsillustrated.cnn.com/2008/football/nfl/specials/preview/2008/08/07/pennington.ap/index.html\">the Jets are going to keep Chad Pennington</a> and Brett Favre.  And I don’t care if Hesse has been out of fashion since the ’70s, I love his novels anyways.</p><p>But if it’s pleasurable to be a quote-spewing pseudo-intellectual, it’s even more pleasurable to puncture their pretensions of knowing that which they pretend to know.  For example, I would guess that for every 20 people who bring up <i>Euthyphro</i> in a discussion about morality, only one has actually read it… and only one in one hundred of those who have read it understood it well enough to recognize what a dishonest sham it is.  That being said, my experience in the response to my last novel has taught me that from the writer’s perspective, it’s more important to create the illusion of brilliance than to create something genuinely brilliant* on a wavelength that no reader can reasonably be expected to detect.  I expect the more alert regulars will understand the implications of this lesson….</p><p>Speaking of non-pseudos, it is my pleasure to declare that the following individuals have demonstrated that they do actually know their Thucydides and may henceforth feel free to drop quotes from <i>The History of the Peloponnesian War</i> in very good conscience.  The three individuals named in bold merit particular distinction as Grand Thucydideans, as they tied for the high score on the final at 96 percent.  DocBrown also merits GT status as the Most Valuable Commenter throughout the course of our collaborative reading.</p><p><b>zeno <br>jSinSaTx<br>John</br></br></b>**<br>repomanuel<br>SGTGideonsDad<br>Ian.yclept<br>Scott<br>Art<br>WLindsayWheeler<br>Wendy<br>Galactus<br>Connor<br>DocBrown<br>Jack<br>rdkraus<br>Giraffe<br>Rusty<br>SandmansView<br>MikeLaRoche<br>AWiserManThanI<br>Somboed<br>JK<br>Nate</br></br></br></br></br></br></br></br></br></br></br></br></br></br></br></br></br></br></br></br></p><p><i>*I’m not claiming to have written anything brilliant; it’s not for me to judge.  But no one can have judged that aspect of <i>Wrath</i> at all, as said wavelength has remained undetected to this point.</i></p><p>**John scored 23/25 but was awarded an extra point for catching my error in conflating Demosthenes and Nicias in the question about “the brilliant Athenian general” on the final.</p></div>",
  "content_text": "David Brooks writes\nan uncharacteristically funny column\nin the New York Times:\nAll my life I’ve been a successful pseudo-intellectual, sprinkling quotations from Kafka, Epictetus and Derrida into my conversations, impressing dates and making my friends feel mentally inferior. But over the last few years, it’s stopped working. People just look at me blankly. My artificially inflated self-esteem is on the wane. What happened?\nIt’s quite amusing; I particularly liked his concept of the early discarder.  I have to confess that I’ve always been somewhat mystified by the concept of an intellectual vogue since I like what I like and it doesn’t trouble me at all that some of my favorite writers, formerly names often heard dropped by the sort of meme lords Brooks mocks, are now passe.  There are few things I despise more than a pretense that one has experience of things that one actually has not; it’s amazing how much posery one inadvertantly uncovers merely by happening to live in Europe.\nDo tell me again how very European it is to live in Quebec, mon ami….\nSpacebunny is always amused when women of a certain age and income level are so good as to tell her what Italy is like, based on the two weeks they spent three summers ago traversing Florence, Venice, and the Cinque Terre.  I once nearly had to kick a guest out of our house when he furiously insisted that as an experienced international businessman, he did too know how to make European phone calls, the fact that every time he tried to dial a hotel in Venice he reached someone who spoke only German notwithstanding.\nIt’s certainly pleasant to know things, but knowledge doesn’t actually make you a better person.  Everyone is ignorant of many things, since it’s not possible to be a true polymath in the Age of Information.  For all my extensive knowledge of World of Warcraft and Age of Conan, I don’t know much about Vanguard – which is fine – or Everquest – which is not – or Ultima Online – which is really reprehensible.  I’m also shockingly ignorant of American Idol and a whole host of pop cultural items, but to be honest, with regards to this sort of thing there’s a good case to be made that ignorance is bliss.  I certainly wouldn’t sneer at those who don’t keep up on the state of NFL salary caps, unless, of course, they’re trying to tell me that\nthe Jets are going to keep Chad Pennington\nand Brett Favre.  And I don’t care if Hesse has been out of fashion since the ’70s, I love his novels anyways.\nBut if it’s pleasurable to be a quote-spewing pseudo-intellectual, it’s even more pleasurable to puncture their pretensions of knowing that which they pretend to know.  For example, I would guess that for every 20 people who bring up\nEuthyphro\nin a discussion about morality, only one has actually read it… and only one in one hundred of those who have read it understood it well enough to recognize what a dishonest sham it is.  That being said, my experience in the response to my last novel has taught me that from the writer’s perspective, it’s more important to create the illusion of brilliance than to create something genuinely brilliant* on a wavelength that no reader can reasonably be expected to detect.  I expect the more alert regulars will understand the implications of this lesson….\nSpeaking of non-pseudos, it is my pleasure to declare that the following individuals have demonstrated that they do actually know their Thucydides and may henceforth feel free to drop quotes from\nThe History of the Peloponnesian War\nin very good conscience.  The three individuals named in bold merit particular distinction as Grand Thucydideans, as they tied for the high score on the final at 96 percent.  DocBrown also merits GT status as the Most Valuable Commenter throughout the course of our collaborative reading.\nzeno\njSinSaTx\nJohn\n**\nrepomanuel\nSGTGideonsDad\nIan.yclept\nScott\nArt\nWLindsayWheeler\nWendy\nGalactus\nConnor\nDocBrown\nJack\nrdkraus\nGiraffe\nRusty\nSandmansView\nMikeLaRoche\nAWiserManThanI\nSomboed\nJK\nNate\n*I’m not claiming to have written anything brilliant; it’s not for me to judge.  But no one can have judged that aspect of\nWrath\nat all, as said wavelength has remained undetected to this point.\n**John scored 23/25 but was awarded an extra point for catching my error in conflating Demosthenes and Nicias in the question about “the brilliant Athenian general” on the final.",
  "tags": [],
  "categories": [],
  "sitemap_lastmod": "2008-08-08T06:51:00+00:00"
}