{
  "url": "https://voxday.net/2008/08/15/children-of-cyberpunk/",
  "scraped_at": "2026-01-08T22:33:03.829538",
  "title": "The children of Cyberpunk",
  "date_display": "August 15, 2008",
  "date_iso": "2008-08-15T09:13:00+00:00",
  "date_from_url": "2008-08-15",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>The Original Cyberpunk’s Friday Challenges keep getting better and better.  I tend to think the half-jokingly suggested anthology entitled <i> Cyberpunk: The Next Generation</i> is actually a very good idea for Rampant Loon.  Below is an entirely outdated story of mine written on a similar theme, albeit focused on the marketing department rather than tech support and rather more remniscent of Anthony than Bethke.  However, I have to disagree with <a href=\"http://rantingroom.blogspot.com/2008/08/and-winner-is.html\">the OC’s adjudication</a>, because in my opinion, despite the generally high level of quality <a href=\"http://rantingroom.blogspot.com/2008/08/whats-going-on-with-friday-challenge.html\">in the submissions</a>, it was <a href=\"http://leatherwing.blogspot.com/2008/07/friday-challenge-tech-support.html\">Leatherwing’s take on tech support</a> that was the clear winner.  Although, I have to admit that Waterboy did crack me up with this line: <i>“it sure-as-hell wasn’t his fault that they mistranslated his design for the new “Psychotropic Homosexual Cannabis” entertainment trip as “Psychotic Homicidal Cannibal!”</i></p><p>If you’re not following the Friday Challenges, you’re really missing out.  Some of the best short fiction I’ve read of late have been entries in the FC Octagon.  Anyhow, the speed references should serve to correctly date this story for those who can remember when Zeos was a PC player.</p><p><b><i>Demons in the Disk Drive</i></b></p><p>“Welcome, Ladies and Gentlemen, to the Fall Codex show, back again in Las Vegas, the desert city of silicon sorcery and sin!”</p><p>The smiling speaker beamed at the masses of people crowding his forty-by-forty trade show booth. Like them, he appeared to be wholly caught up in the furious technoglitz of the giant annual industry gathering. His teeth gleamed white, his dark Italian suit was expensively impeccable, and his coiffed hair fairly screamed out his total ignorance of his subject matter. He had Sales/Marketing Guy written all over him.</p><p>“Xaos Computer is proud to participate in the thirteenth annual Computer Demonology Exposition!” the Salesman announced, winking at a pretty young technical analyst who was examining one of the colorful product specification guides. Her eyes lit up eagerly as he gestured broadly and raised his voice.</p><p>“At last the moment you’ve all been waiting for has arrived, a first look at Xaos Computer’s newest product line, the long-awaited, non-equated Legion of Doom!”</p><p>The Salesman flung arms wide to scattered applause as the scarlet satin curtains on either side of him drew smoothly back to reveal four jet-black computer systems, each resting suggestively atop Grecian marble columns. The fevered applause grew louder as the four dark crystal screens flashed simultaneously to life, spelling out X-A-O-S in letters of brilliant red-and-gold flames that leaped and twisted as if they were possessed.</p><p>“First, the Xaos Doom Thirteen, perfect for the casual home and small-business user. It’s powered by three minor demons bound by a guaranteed Intel Guild enchantment burning at twenty-five megahells! And every Doom Thirteen ships standard with MicroSpell’s Word of Power, the most-popular spell-processing package for the last four years straight!</p><p>“And over here you can see the Xaos Doom Sixty-Nine, the ideal solution for Guilds and Merchant Houses requiring the ultimate in connectivity and trans-planar communications. The Doom Sixty-Nine is ensorcelled with the same three-demon hellpower as the model Thirteen, but burns at a faster thirty-three megahells, and is specially optimized for networking. Deadspeakers will be pleased to hear that included with every Doom Sixty-Nine is a pre-installed version of Oracle’s latest necrommunications spellware.”</p><p>The Salesman grinned knowingly at three network consultants clad in tasteful navy-blue suits who were nodding their approval of the new Xaos machine. Their eyes were bright with lust at the thought of a Doom Sixty-Nine coupled to their main unit. The salesman smiled inside. He knew a sure sale when he saw it. He could smell it.</p><p>“And for spell engineers, alchemists, and other Power users Xaos is proud to announce the Doom One Sixty-Nine! Four minor demons are bound by puissant spells guaranteed unequivocally by the Intel Guild, and burn at sixty-six megahells, providing performance prophesied centuries ago by Nostradamus! The Doom One Sixty-Nine is specifically designed for use with AutoMage, leader in the spell-generation industry for almost a decade, and can even be used for some minor elemental summonings!”</p><p>The hoary white eyebrows of one aged sorceror rose as he noted the last comment and the Salesman of Xaos mentally notched another soon-to-be customer with satisfaction. Then the lights dimmed, the fiery letters dancing on the crystal screens disappeared, and hidden speakers emitted an ominous low-frequency hum as a darkling air filled the booth. The Salesman lowered his voice as he invited the audience to share his awe at the unveiling of the ultimate machine.</p><p>“And last, but never, ever, least, Xaos Computer presents the DoomBeast Six Sixty-Six!”</p><p>The crowd murmured and buzzed with excitement. The hidden loudspeakers growled, and moaned, diving deep into the most sinister ultrafrequencies as the Salesman’s voice was electronically modulated to a dark, mystical pitch.</p><p>“You are witnessing the dawn of a new generation of technology! The DoomBeast Six Sixty-Six is powered by a brand-new, secret-until-now Chaos Processing Unit known as Pentagram, developed by the Intel Guild. This new CPU has the power to bind major demons, summoning them directly from the bowels of the Fifth Nether Plane and harnessing their energies within. The hellpower derived from only a single major demon is equivalent to that of five minor demons and burns at an incindiary one hundred megahells! And Xaos Computer is proud to be the first to announce a product designed for this awesome new technology.”</p><p>The Salesman raised a cautioning hand.</p><p>“Now as we begin the demonstration, please keep in mind that the DoomBeast 666 is a prototype model, so you must not be alarmed if there are some minor design inadequacies which happen to appear in the course of the demonstration….</p><p>“You will notice the chalked circles that are conveniently provided on the floor in front of you. Please make sure that you are standing completely within a circle at all times, and no matter what happens, do not leave it! Do not be distressed at any shrieking or howling noises you might hear.</p><p>“It is also possible that you may notice the sensation of a hand resting on your shoulder at some point during the demonstration. A very large, very clawed hand. Do not, under any circumstances, turn around, or attempt to remove the hand! Also, if you happen to hear a familiar voice crying for your help, we very strongly encourage you to ignore it. Even if it sounds like your mother. Especially if it sounds like your mother!”</p><p>“So what happens if we turn around?”, a disheveled man with long hair sneered skeptically. He was obviously a spell sourcer. “We turn to stone or something like that?”</p><p>“Something like that”, the Salesman agreed solemnly. “Depending on the aspect of the particular demon in question, one’s heart might stop, one’s brain might shatter, or in the most unlikely scenario, one’s soul could, possibly, be inadvertently devoured.”</p><p>The Salesman grinned, attempting to allay the crowd’s obvious distress.</p><p>“Ladies and gentlemen, please, there’s no need to be afraid! The DoomBeast 666 has been tested and retested under the most strenuous of circumstances, and has passed the Federal Communication Cabal’s most stringent tests with flying colors. So if you’ll bear with me a moment, I’ll just call up the incantation and we’ll be off! … see kolonbaks lash beastbaks lash demonsix dotexe!”</p><p>He intoned the incantati<br> on in his deepest, most impressive voice.</br></p><p>The crowd screamed in fear as a thunderclap boomed and a huge six-armed firedemon unexpectedly appeared in their midst, howling like a lost soul and lashing out at them with lightning-tipped claws. Sparks slavered from its lava-like tongue as the New Products editor from Bite Magazine panicked and backed out of her chalk circle. She was devoured in a flash. The terrible sight sent two nearby reporters into hysterics; attempting to flee, they too disappeared into the fiery maw of the hell beast.</p><p>“Begone, spirit of evil”, shouted a Xaos technician, leaping out from behind a scarlet curtain to wave a dead chicken over the DoomBeast’s keyboard. “By the F10 and the Three-Finger Salute, I banish and bind thee!”</p><p>There was a hiss, and an unearthly roar erupted from below as the demon imploded in a flash of sulfuric purple smoke. Hysterical shrieks and moans came from the shocked audience as they stared at the DoomBeast, terrified, but afraid to abandon the safety of their shielded circles.</p><p>“Sorry about that folks”, apologized the Salesman as he crawled out from under a display counter, his glamorous hair now unfashionably unkempt. “Apparently I called up the wrong program! Let’s try this again, shall we?”</p><p>The Salesman ignored the frightened wails of the crowd and gestured towards his assistant. The young man cleared his throat, and nervously began to call out the arcane words. “…see kolonbaks lash beastbaks lash demonsev dotexe!”</p><p>In a matter of seconds, the Salesman’s visibly relieved audience was watching, enraptured, as a beautiful female face began to take form within the purple smoke that still lingered in front of them.</p><p>Ten minutes later, twelve dancing dervishes dissolved to the ringing of tinkerbells and the thunderous applause of the ensorceled crowd. The Salesman wiped his sweaty brow with the tailored cuff of his silk shirt, and sighed with relief. With only a few minor hitches, the grand kickoff had succeeded! He looked up to see a multitude of hands waving, reporters, techies, sourcers, magicians, all clamouring for his attention.</p><p>“How soon is the model 666 available?” “When can we get an evalation unit?” “What’s the retail?” “Who’s distributing?” Inquiring minds wanted to know.</p><p>“Shipping will begin in less than two months, but we’d encourage you to place your orders immediately. That’s all I can tell you for now.” The Salesman of Xaos smiled cryptically and shrugged his shoulders.</p><p>“Wait a minute,” the scruffy sourcer who’d spoken up before called out. “With Compact and Devil locked in a price war, and since Zeus, Gatekeeper, and you guys are all scrambling to undercut them, prices just keep dropping. It seems the longer you wait, the less you pay, and the more you get. What do you say about that?”</p><p>“Well, yes, that’s true,” the Salesman admitted. “But you can’t pursue an ever-receding horizon forever; at some point, you have to make your choice and live with it. Otherwise, you’ll never buy anything!”</p><p>For just a moment, the slick sales veneer vanished from his face and revealed the world-weary eyes of a philosopher.</p><p>“It’s just like anything else in this cursed industry. You’re damned if you do, and damned if you don’t!”</p></div>",
  "content_text": "The Original Cyberpunk’s Friday Challenges keep getting better and better.  I tend to think the half-jokingly suggested anthology entitled\nCyberpunk: The Next Generation\nis actually a very good idea for Rampant Loon.  Below is an entirely outdated story of mine written on a similar theme, albeit focused on the marketing department rather than tech support and rather more remniscent of Anthony than Bethke.  However, I have to disagree with\nthe OC’s adjudication\n, because in my opinion, despite the generally high level of quality\nin the submissions\n, it was\nLeatherwing’s take on tech support\nthat was the clear winner.  Although, I have to admit that Waterboy did crack me up with this line:\n“it sure-as-hell wasn’t his fault that they mistranslated his design for the new “Psychotropic Homosexual Cannabis” entertainment trip as “Psychotic Homicidal Cannibal!”\nIf you’re not following the Friday Challenges, you’re really missing out.  Some of the best short fiction I’ve read of late have been entries in the FC Octagon.  Anyhow, the speed references should serve to correctly date this story for those who can remember when Zeos was a PC player.\nDemons in the Disk Drive\n“Welcome, Ladies and Gentlemen, to the Fall Codex show, back again in Las Vegas, the desert city of silicon sorcery and sin!”\nThe smiling speaker beamed at the masses of people crowding his forty-by-forty trade show booth. Like them, he appeared to be wholly caught up in the furious technoglitz of the giant annual industry gathering. His teeth gleamed white, his dark Italian suit was expensively impeccable, and his coiffed hair fairly screamed out his total ignorance of his subject matter. He had Sales/Marketing Guy written all over him.\n“Xaos Computer is proud to participate in the thirteenth annual Computer Demonology Exposition!” the Salesman announced, winking at a pretty young technical analyst who was examining one of the colorful product specification guides. Her eyes lit up eagerly as he gestured broadly and raised his voice.\n“At last the moment you’ve all been waiting for has arrived, a first look at Xaos Computer’s newest product line, the long-awaited, non-equated Legion of Doom!”\nThe Salesman flung arms wide to scattered applause as the scarlet satin curtains on either side of him drew smoothly back to reveal four jet-black computer systems, each resting suggestively atop Grecian marble columns. The fevered applause grew louder as the four dark crystal screens flashed simultaneously to life, spelling out X-A-O-S in letters of brilliant red-and-gold flames that leaped and twisted as if they were possessed.\n“First, the Xaos Doom Thirteen, perfect for the casual home and small-business user. It’s powered by three minor demons bound by a guaranteed Intel Guild enchantment burning at twenty-five megahells! And every Doom Thirteen ships standard with MicroSpell’s Word of Power, the most-popular spell-processing package for the last four years straight!\n“And over here you can see the Xaos Doom Sixty-Nine, the ideal solution for Guilds and Merchant Houses requiring the ultimate in connectivity and trans-planar communications. The Doom Sixty-Nine is ensorcelled with the same three-demon hellpower as the model Thirteen, but burns at a faster thirty-three megahells, and is specially optimized for networking. Deadspeakers will be pleased to hear that included with every Doom Sixty-Nine is a pre-installed version of Oracle’s latest necrommunications spellware.”\nThe Salesman grinned knowingly at three network consultants clad in tasteful navy-blue suits who were nodding their approval of the new Xaos machine. Their eyes were bright with lust at the thought of a Doom Sixty-Nine coupled to their main unit. The salesman smiled inside. He knew a sure sale when he saw it. He could smell it.\n“And for spell engineers, alchemists, and other Power users Xaos is proud to announce the Doom One Sixty-Nine! Four minor demons are bound by puissant spells guaranteed unequivocally by the Intel Guild, and burn at sixty-six megahells, providing performance prophesied centuries ago by Nostradamus! The Doom One Sixty-Nine is specifically designed for use with AutoMage, leader in the spell-generation industry for almost a decade, and can even be used for some minor elemental summonings!”\nThe hoary white eyebrows of one aged sorceror rose as he noted the last comment and the Salesman of Xaos mentally notched another soon-to-be customer with satisfaction. Then the lights dimmed, the fiery letters dancing on the crystal screens disappeared, and hidden speakers emitted an ominous low-frequency hum as a darkling air filled the booth. The Salesman lowered his voice as he invited the audience to share his awe at the unveiling of the ultimate machine.\n“And last, but never, ever, least, Xaos Computer presents the DoomBeast Six Sixty-Six!”\nThe crowd murmured and buzzed with excitement. The hidden loudspeakers growled, and moaned, diving deep into the most sinister ultrafrequencies as the Salesman’s voice was electronically modulated to a dark, mystical pitch.\n“You are witnessing the dawn of a new generation of technology! The DoomBeast Six Sixty-Six is powered by a brand-new, secret-until-now Chaos Processing Unit known as Pentagram, developed by the Intel Guild. This new CPU has the power to bind major demons, summoning them directly from the bowels of the Fifth Nether Plane and harnessing their energies within. The hellpower derived from only a single major demon is equivalent to that of five minor demons and burns at an incindiary one hundred megahells! And Xaos Computer is proud to be the first to announce a product designed for this awesome new technology.”\nThe Salesman raised a cautioning hand.\n“Now as we begin the demonstration, please keep in mind that the DoomBeast 666 is a prototype model, so you must not be alarmed if there are some minor design inadequacies which happen to appear in the course of the demonstration….\n“You will notice the chalked circles that are conveniently provided on the floor in front of you. Please make sure that you are standing completely within a circle at all times, and no matter what happens, do not leave it! Do not be distressed at any shrieking or howling noises you might hear.\n“It is also possible that you may notice the sensation of a hand resting on your shoulder at some point during the demonstration. A very large, very clawed hand. Do not, under any circumstances, turn around, or attempt to remove the hand! Also, if you happen to hear a familiar voice crying for your help, we very strongly encourage you to ignore it. Even if it sounds like your mother. Especially if it sounds like your mother!”\n“So what happens if we turn around?”, a disheveled man with long hair sneered skeptically. He was obviously a spell sourcer. “We turn to stone or something like that?”\n“Something like that”, the Salesman agreed solemnly. “Depending on the aspect of the particular demon in question, one’s heart might stop, one’s brain might shatter, or in the most unlikely scenario, one’s soul could, possibly, be inadvertently devoured.”\nThe Salesman grinned, attempting to allay the crowd’s obvious distress.\n“Ladies and gentlemen, please, there’s no need to be afraid! The DoomBeast 666 has been tested and retested under the most strenuous of circumstances, and has passed the Federal Communication Cabal’s most stringent tests with flying colors. So if you’ll bear with me a moment, I’ll just call up the incantation and we’ll be off! … see kolonbaks lash beastbaks lash demonsix dotexe!”\nHe intoned the incantati\non in his deepest, most impressive voice.\nThe crowd screamed in fear as a thunderclap boomed and a huge six-armed firedemon unexpectedly appeared in their midst, howling like a lost soul and lashing out at them with lightning-tipped claws. Sparks slavered from its lava-like tongue as the New Products editor from Bite Magazine panicked and backed out of her chalk circle. She was devoured in a flash. The terrible sight sent two nearby reporters into hysterics; attempting to flee, they too disappeared into the fiery maw of the hell beast.\n“Begone, spirit of evil”, shouted a Xaos technician, leaping out from behind a scarlet curtain to wave a dead chicken over the DoomBeast’s keyboard. “By the F10 and the Three-Finger Salute, I banish and bind thee!”\nThere was a hiss, and an unearthly roar erupted from below as the demon imploded in a flash of sulfuric purple smoke. Hysterical shrieks and moans came from the shocked audience as they stared at the DoomBeast, terrified, but afraid to abandon the safety of their shielded circles.\n“Sorry about that folks”, apologized the Salesman as he crawled out from under a display counter, his glamorous hair now unfashionably unkempt. “Apparently I called up the wrong program! Let’s try this again, shall we?”\nThe Salesman ignored the frightened wails of the crowd and gestured towards his assistant. The young man cleared his throat, and nervously began to call out the arcane words. “…see kolonbaks lash beastbaks lash demonsev dotexe!”\nIn a matter of seconds, the Salesman’s visibly relieved audience was watching, enraptured, as a beautiful female face began to take form within the purple smoke that still lingered in front of them.\nTen minutes later, twelve dancing dervishes dissolved to the ringing of tinkerbells and the thunderous applause of the ensorceled crowd. The Salesman wiped his sweaty brow with the tailored cuff of his silk shirt, and sighed with relief. With only a few minor hitches, the grand kickoff had succeeded! He looked up to see a multitude of hands waving, reporters, techies, sourcers, magicians, all clamouring for his attention.\n“How soon is the model 666 available?” “When can we get an evalation unit?” “What’s the retail?” “Who’s distributing?” Inquiring minds wanted to know.\n“Shipping will begin in less than two months, but we’d encourage you to place your orders immediately. That’s all I can tell you for now.” The Salesman of Xaos smiled cryptically and shrugged his shoulders.\n“Wait a minute,” the scruffy sourcer who’d spoken up before called out. “With Compact and Devil locked in a price war, and since Zeus, Gatekeeper, and you guys are all scrambling to undercut them, prices just keep dropping. It seems the longer you wait, the less you pay, and the more you get. What do you say about that?”\n“Well, yes, that’s true,” the Salesman admitted. “But you can’t pursue an ever-receding horizon forever; at some point, you have to make your choice and live with it. Otherwise, you’ll never buy anything!”\nFor just a moment, the slick sales veneer vanished from his face and revealed the world-weary eyes of a philosopher.\n“It’s just like anything else in this cursed industry. You’re damned if you do, and damned if you don’t!”",
  "tags": [],
  "categories": [],
  "sitemap_lastmod": "2008-08-15T08:13:00+00:00"
}