{
  "url": "https://voxday.net/2008/08/11/denying-while-admitting/",
  "scraped_at": "2026-01-08T22:32:52.723483",
  "title": "Denying while admitting",
  "date_display": "August 11, 2008",
  "date_iso": "2008-08-11T14:27:00+00:00",
  "date_from_url": "2008-08-11",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>Howard Kurtz <a href=\"http://www.washingtonpost.com/wp-dyn/content/linkset/2005/04/11/LI2005041100587.html\">can’t get his story any straighter</a> than John Edwards could:</p><blockquote><p>The whispered allegations about John Edwards were an open secret that was debated in every newsroom and reported by almost none….Bill O’Reilly, while skeptical of the story, told his Fox News viewers last Monday: “I do know that if it were Mitt Romney instead of John Edwards, this would be on the front page of the New York Times.”</p><p>I don’t think the party favoritism charge holds up. Yes, the media went hard after two Republican senators, Larry Craig (who pleaded guilty in that bathroom incident) and David Vitter (who admitted calling an escort service). But they also pounced on New York’s Democratic then-governor, Eliot Spitzer (whose taste in prostitutes was revealed by the New York Times), and, famously, Bill Clinton (whose Monica Lewinsky mess was disclosed by The Post and hotly pursued by Newsweek).</p></blockquote><p>No wonder the newspapers and mainstream media are dying off… and deservedly so.  They’re not interested in doing the very thing for which they’re trying to get people to pay them.  The Lewinsky story only came out thanks to Drudge, while Craig, Vitter and Spitzer were all matters of public record and didn’t require any reporting or editorial thumbs-up. <i>“Hey, it turns out the governor of New York is being investigated by the IRS and the FBI, and he’s going to have to resign.  Do you think maybe we should find some space for that?”</i></p><p>The more relevant comparison is the big story about McCain’s non-affair with Vicki Iseman that was <a href=\"http://www.nytimes.com/2008/02/21/us/politics/21mccain.html?_r=2&amp;oref=slogin&amp;oref=slogin\">published by the New York Times</a> in February.  How can that possibly be news when John Edwards’s actual affair isn’t?</p><p>Watching the mainstream media fade away is like watching a cancer patient die without going through the five stages of grief; they’re stuck firmly in denial.  Now, it’s true that Fox News is the house organ of the Republican Party, but in like manner, the ABCNNBCBS cabal, the AP, and the major newspapers are the propaganda arm of the Democratic Party.  In times of increasing technological pressure, purposely cutting off your appeal to half your potential market isn’t stupid, its simply suicidal.</p></div>",
  "content_text": "Howard Kurtz\ncan’t get his story any straighter\nthan John Edwards could:\nThe whispered allegations about John Edwards were an open secret that was debated in every newsroom and reported by almost none….Bill O’Reilly, while skeptical of the story, told his Fox News viewers last Monday: “I do know that if it were Mitt Romney instead of John Edwards, this would be on the front page of the New York Times.”\nI don’t think the party favoritism charge holds up. Yes, the media went hard after two Republican senators, Larry Craig (who pleaded guilty in that bathroom incident) and David Vitter (who admitted calling an escort service). But they also pounced on New York’s Democratic then-governor, Eliot Spitzer (whose taste in prostitutes was revealed by the New York Times), and, famously, Bill Clinton (whose Monica Lewinsky mess was disclosed by The Post and hotly pursued by Newsweek).\nNo wonder the newspapers and mainstream media are dying off… and deservedly so.  They’re not interested in doing the very thing for which they’re trying to get people to pay them.  The Lewinsky story only came out thanks to Drudge, while Craig, Vitter and Spitzer were all matters of public record and didn’t require any reporting or editorial thumbs-up.\n“Hey, it turns out the governor of New York is being investigated by the IRS and the FBI, and he’s going to have to resign.  Do you think maybe we should find some space for that?”\nThe more relevant comparison is the big story about McCain’s non-affair with Vicki Iseman that was\npublished by the New York Times\nin February.  How can that possibly be news when John Edwards’s actual affair isn’t?\nWatching the mainstream media fade away is like watching a cancer patient die without going through the five stages of grief; they’re stuck firmly in denial.  Now, it’s true that Fox News is the house organ of the Republican Party, but in like manner, the ABCNNBCBS cabal, the AP, and the major newspapers are the propaganda arm of the Democratic Party.  In times of increasing technological pressure, purposely cutting off your appeal to half your potential market isn’t stupid, its simply suicidal.",
  "tags": [],
  "categories": [],
  "sitemap_lastmod": "2008-08-11T13:27:00+00:00"
}