{
  "url": "https://voxday.net/2008/08/30/dreams-of-technocracy/",
  "scraped_at": "2026-01-08T22:34:15.689250",
  "title": "Dreams of technocracy",
  "date_display": "August 30, 2008",
  "date_iso": "2008-08-30T11:11:00+00:00",
  "date_from_url": "2008-08-30",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>The commenters at John Scalzi’s place are hardly the first science fetishists to fantasize about a scientific government.  That such a thing would be a violently authoritarian nightmare never seems to occur to them, however, which is interesting given the track record of the last government to claim its foundation in science, namely, scientific socialism.</p><p>A few of these would-be technocrats assert that Sarah Palin’s belief in creationism should somehow disqualify her from holding office.  But this is a wildly stupid position. Everyone is ignorant of something – as the Congress and the executive branch demonstrate almost every day – and the USA is not a technocratic oligarchy, it is a quasi-democratic republic. Whether you like it or not, the vast majority of Americans don’t give a damn about science and would rather kill every single scientist in the country than hand their government over to them.  And they would be absolutely right to do so; it seems that the inheritors of natural philosophy are still dreaming of totalitarian philosopher-kings two millenia after <i>The Republic</i>.</p><p>To claim that a man or a woman should be disqualified from political participation for failing to genuflect before the current state of science – an intrinsically moving target – is anti-democratic, fascistic, and historically ignorant.  One can make a much better case for limiting government by sex, height, or even hair color, things that are far less subjective and less given to abuse by an authoritarian oligarchy.  And given the fact that scientage is a dynamic entity, the abjuring of the admittedly bad science of yesterday is no guarantee that today’s scientific consensus is not tomorrow’s bad science.</p><p>Science has been a two-edged sword throughout its history. It has undeniably made many people’s lives better and it has just as undeniably caused many people’s deaths.  Vaccines and antibiotics are no more created “in the name of science” than are atomic bombs and biological weapons; both are created by scientists through scientody.  Science is simply not a legitimate arbiter for political leadership and it would be interesting to know who would agree that everyone who still believes in Anthropogenic Global Warming is similarly unsuited for political office now that actual science has demonstrated that the AGW theory is little more than bad data combined with poor computer modeling?</p><p>Moreover, the New York Times reported in 2004 that 65 percent of all Americans favor teaching creationism and evolution in schools. While I will not vote for the McCain-Palin ticket, Palin’s perspective is far more democratically legitimate than than that of those who think her views on the origins of Man should somehow disqualify her. If Americans are going to disqualify politicians for their ignorance, it would be much more effective to disqualify those who demonstrably fail to understand the supply-demand curve or the concept of marginal utility.</p></div>",
  "content_text": "The commenters at John Scalzi’s place are hardly the first science fetishists to fantasize about a scientific government.  That such a thing would be a violently authoritarian nightmare never seems to occur to them, however, which is interesting given the track record of the last government to claim its foundation in science, namely, scientific socialism.\nA few of these would-be technocrats assert that Sarah Palin’s belief in creationism should somehow disqualify her from holding office.  But this is a wildly stupid position. Everyone is ignorant of something – as the Congress and the executive branch demonstrate almost every day – and the USA is not a technocratic oligarchy, it is a quasi-democratic republic. Whether you like it or not, the vast majority of Americans don’t give a damn about science and would rather kill every single scientist in the country than hand their government over to them.  And they would be absolutely right to do so; it seems that the inheritors of natural philosophy are still dreaming of totalitarian philosopher-kings two millenia after\nThe Republic\n.\nTo claim that a man or a woman should be disqualified from political participation for failing to genuflect before the current state of science – an intrinsically moving target – is anti-democratic, fascistic, and historically ignorant.  One can make a much better case for limiting government by sex, height, or even hair color, things that are far less subjective and less given to abuse by an authoritarian oligarchy.  And given the fact that scientage is a dynamic entity, the abjuring of the admittedly bad science of yesterday is no guarantee that today’s scientific consensus is not tomorrow’s bad science.\nScience has been a two-edged sword throughout its history. It has undeniably made many people’s lives better and it has just as undeniably caused many people’s deaths.  Vaccines and antibiotics are no more created “in the name of science” than are atomic bombs and biological weapons; both are created by scientists through scientody.  Science is simply not a legitimate arbiter for political leadership and it would be interesting to know who would agree that everyone who still believes in Anthropogenic Global Warming is similarly unsuited for political office now that actual science has demonstrated that the AGW theory is little more than bad data combined with poor computer modeling?\nMoreover, the New York Times reported in 2004 that 65 percent of all Americans favor teaching creationism and evolution in schools. While I will not vote for the McCain-Palin ticket, Palin’s perspective is far more democratically legitimate than than that of those who think her views on the origins of Man should somehow disqualify her. If Americans are going to disqualify politicians for their ignorance, it would be much more effective to disqualify those who demonstrably fail to understand the supply-demand curve or the concept of marginal utility.",
  "tags": [],
  "categories": [],
  "sitemap_lastmod": "2008-08-30T10:11:00+00:00"
}