{
  "url": "https://voxday.net/2008/08/08/equality-day-conspiracy-theories/",
  "scraped_at": "2026-01-08T22:32:32.397698",
  "title": "Equality Day conspiracy theories",
  "date_display": "August 8, 2008",
  "date_iso": "2008-08-08T13:29:00+00:00",
  "date_from_url": "2008-08-08",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>Byron York <a href=\"http://corner.nationalreview.com/post/?q=YzY5OTQzMmJmZWQ4YTg4OThjMmY5NDFjMzRkNGQwMmU=\">postulates a scenario</a>:</p><blockquote><p>[L]ook at it this way: Hillary Clinton speaks to the convention on Women’s Equality Day, amid a big celebration of the role of women in the Democratic Party, and everyone is feeling good about how inclusive they are — and then, just hours after celebrating the right of women to vote, the convention denies a vote to the millions of women who supported Hillary Clinton?  How’s that gonna work?  Might it be that the fortuitous occasion of Women’s Equality Day will actually create pressure for a floor vote?</p></blockquote><p>I had no idea there was a Women’s Equality Day, my impression was that every day was supposed to be Women’s Equality Day.  Of course, one wonders what the purpose is, now that women have achieved the equality of a) being able to have a man stripped of his possessions and kicked out of his house on the mere basis of her accusation of domestic violence, and, b) being permitted to shoot dead a sleeping man without lasting legal consequences.</p><p>But this makes Hillary’s path to the Presidency clear.  She can pull this thing out even more easily than York suggests by arranging for a private conference with Obama at his house, then calling the police, telling them that she’s his wife and accusing him of hitting her.  Obama gets hauled off to jail in handcuffs before the real story gets straightened out, the flash bulbs go off and his race is ended before reaching Denver.  How could America possibly vote for the man who hit Hillary?</p><p>Alternatively, she can just wait until it’s confirmed that he’s not eligible for the presidency due to his fake Certificate of a Consular Birth Abroad.  That would work too.</p><p>Krauthammer sums it up very well indeed: <i>“The Italian Communist party could win this election. The American Democratic party is trying its best to lose it.</i>“</p><p>If I were a Democratic strategist, I’d be thinking very, very hard about out how to get Obama off the ballot at or before the convention.  If he’s this close to McCain in the polls after 18 months of nothing but favorable press, I think he’s in very serious trouble.  Remember, at this point, <i>Michael Dukakis</i> was 16 points ahead.  Moreover, the idea that Obama would crush McCain in the debates has pretty much vanished thanks to more idiotic off-the-cuff remarks in the last six weeks than Dan Quayle made in his entire political career.</p></div>",
  "content_text": "Byron York\npostulates a scenario\n:\n[L]ook at it this way: Hillary Clinton speaks to the convention on Women’s Equality Day, amid a big celebration of the role of women in the Democratic Party, and everyone is feeling good about how inclusive they are — and then, just hours after celebrating the right of women to vote, the convention denies a vote to the millions of women who supported Hillary Clinton?  How’s that gonna work?  Might it be that the fortuitous occasion of Women’s Equality Day will actually create pressure for a floor vote?\nI had no idea there was a Women’s Equality Day, my impression was that every day was supposed to be Women’s Equality Day.  Of course, one wonders what the purpose is, now that women have achieved the equality of a) being able to have a man stripped of his possessions and kicked out of his house on the mere basis of her accusation of domestic violence, and, b) being permitted to shoot dead a sleeping man without lasting legal consequences.\nBut this makes Hillary’s path to the Presidency clear.  She can pull this thing out even more easily than York suggests by arranging for a private conference with Obama at his house, then calling the police, telling them that she’s his wife and accusing him of hitting her.  Obama gets hauled off to jail in handcuffs before the real story gets straightened out, the flash bulbs go off and his race is ended before reaching Denver.  How could America possibly vote for the man who hit Hillary?\nAlternatively, she can just wait until it’s confirmed that he’s not eligible for the presidency due to his fake Certificate of a Consular Birth Abroad.  That would work too.\nKrauthammer sums it up very well indeed:\n“The Italian Communist party could win this election. The American Democratic party is trying its best to lose it.\n“\nIf I were a Democratic strategist, I’d be thinking very, very hard about out how to get Obama off the ballot at or before the convention.  If he’s this close to McCain in the polls after 18 months of nothing but favorable press, I think he’s in very serious trouble.  Remember, at this point,\nMichael Dukakis\nwas 16 points ahead.  Moreover, the idea that Obama would crush McCain in the debates has pretty much vanished thanks to more idiotic off-the-cuff remarks in the last six weeks than Dan Quayle made in his entire political career.",
  "tags": [],
  "categories": [],
  "sitemap_lastmod": "2008-08-08T12:29:00+00:00"
}