{
  "url": "https://voxday.net/2008/08/04/fight-club-anthology/",
  "scraped_at": "2026-01-08T22:32:07.343161",
  "title": "Breaking the First Rule ofFight Club",
  "date_display": "August 4, 2008",
  "date_iso": "2008-08-04T09:44:00+00:00",
  "date_from_url": "2008-08-04",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p><a href=\"http://66.84.52.211/plugins/MivaMerchants/graphics/00000001/FightClub_3inch.jpg\" onblur=\"try {parent.deselectBloggerImageGracefully();} catch(e) {}\"><noscript><img alt=\"\" border=\"0\" decoding=\"async\" src=\"http://66.84.52.211/plugins/MivaMerchants/graphics/00000001/FightClub_3inch.jpg\" style=\"float:left; margin:0 10px 10px 0;cursor:pointer; cursor:hand;width: 200px;\"/></noscript><img alt=\"\" border=\"0\" class=\"lazyload\" data-src=\"http://66.84.52.211/plugins/MivaMerchants/graphics/00000001/FightClub_3inch.jpg\" decoding=\"async\" src=\"data:image/svg+xml,%3Csvg%20xmlns=%22http://www.w3.org/2000/svg%22%20viewBox=%220%200%20210%20140%22%3E%3C/svg%3E\" style=\"float:left; margin:0 10px 10px 0;cursor:pointer; cursor:hand;width: 200px;\"/></a> <b><i>THE CLUB THAT DARE NOT SPEAK ITS NAME</i></b><br>by Vox Day</br></p><p>This is an essay that appears in the new and wide-ranging SmartPop anthology, entitled <i><a href=\"http://www.amazon.com/You-Talk-About-Fight-Club/dp/1933771526/ref=sr_1_4?ie=UTF8&amp;s=books&amp;qid=1217843079&amp;sr=8-4\">You Do Not Talk About Fight Club</a>: I Am Jack’s Completely Unauthorized Essay Collection</i>.  The anthology was edited by the brilliant media ecologist Read Mercer Schuchardt and features a forward by Chuck Palahniuk himself.</p><p> <b>The Physics of Fight Club</b></p><p>There is a savage joy in violence. The secret of the success of <i>Fight Club</i> is its acceptance of that basic and uncomfortable truth, which is as well-known to every martial artist, gang member, and football hooligan as it is completely alien to the sedentary sort of middle-aged individuals favored by those who publish novels. For as men have known since long before the Colosseum’s sands were first soaked with blood, there is no adrenaline rush so great as the moment when two men put one another to the physical test.</p><p><i>Fight Club</i> is a fascinating little book which not only embraced that truth, but in doing so, translated surprisingly well to the cinematic medium. This should probably not have been surprising, given that the author’s witch’s brew of male fury and raw but stylized violence is almost perfectly suited for that male audience which so enjoys the cinematic adventures of Bruce Lee, Jean-Claude van Damme, Jackie Chan, and a host of other aggressively oriented male leads. The combination of that visceral appeal with the brilliant casting of a ripped and shirtless Brad Pitt for the ladies all but assured Hollywood hit status.</p><p>When viewed from a technical perspective, <i>Fight Club</i> is nearly as absurd as any <i>wuxia</i> extravaganza featuring aerial acrobatics and mad dashes through the treetops, whereas from a psychological perspective, it is impressively accurate. To the combat-aware reader, the book raises the interesting question of how the author could have gotten the latter so right and the former so wrong.</p><p><i>Fight Club</i> subscribes to the common conventional fiction that it is not the size of the dog in the fight that matters, but rather the size of the fight in the dog. Although in <i>Fight Club</i> terms, this might be better described as the size of the proverbial canine’s violent sociopathy. As with most aphorisms, there is an element of truth to this; all things being equal, the tougher individual will usually prevail. But outside of the formalized structure of the boxing ring, all things are very seldom equal.</p><p>The most basic truth of unarmed combat is that F = M x A: Force equals Mass times Acceleration. Since Force is the measurement of what is smashing into your face and is the primary variable determining exactly what the effect of that blow will be, it is very important to understand the significance of this equation. Since Mass is a function of size, this means that a larger individual will usually pack a more powerful punch than a smaller one. Usually, but not always.</p><p>Because Acceleration is just as important as Mass. Acceleration comes in two forms, the first being the speed with which the individual can deliver the blow. This can come from natural speed (given a choice, always elect to get punched by a marathon runner, not a sprinter), or from the perfected technique which is a product of training. The second form of Acceleration is the relative motion of two bodies, which is to say, if you are moving towards the puncher at the moment the punch arrives, it will hurt significantly more than if you are moving away from him.</p><p>When these elements all come together, they result in the perfect storm that is the instantaneous knockout. I once made the mistake of getting overconfident and attempted to go inside on a 6’5″, 260-pound fighter who was slow, inflexible, and therefore almost helpless at kicking range. His Mass was obviously superlative, however, and I unwisely granted him the benefit of Acceleration by moving straight in towards him at full speed. The multiplication of the two forces was such that a simple defensive jab on his part left me waking up on the concrete floor, wondering what had happened and where I was.</p><p>The second fundamental truth of unarmed combat is that evasion is everything. This is why blocks are given the same importance as strikes; indeed, the famous “wax-on, wax-off” from <i>The Karate Kid</i> is not only better known than any exotic attacking technique, but is genuinely part of the basic repertoire of any traditionally trained martial artist.</p><p>At the basic level, evasive options are limited. But for the trained fighter, there are a whole host of techniques at one’s disposal, including oblique movement, gap management, arrhythmic timing, destructive blocks, and simultaneous offense-defense. All of these tactics and more have been developed to allow the fighter to avoid the direct application of Force to his body; indeed, the martial arts are customarily divided into the hard style, wherein the opponent’s Force is met with Force, and the soft style, wherein one seeks to use the opponent’s Force against him.</p><p>Kali, for example, is a Philippino hard style. Its brutal destructive blocks make heavy use of the knees and elbows, so that in the place of a traditional “wax-off” block designed to deflect a blow with the forearm, the arm is flexed and the point of the elbow is used to block the incoming strike instead. The ease with which the elbow can break an ankle or a wrist makes delivering a blow nearly as dangerous as receiving a direct one; even a partial block will sting an opponent and make him very wary of attempting another attack.</p><p>Kung fu, on the other hand, is the classic soft style. By redirecting the incoming Force and allowing it to flow past him, a soft response allows the martial artist to do things he could not hope to do using only his own Force. Soft styles are particularly effective in dealing with the conventional brute force attacks of the sort seen in the <i>Fight Club</i> film, for while it is extremely difficult to put an opponent in a neck-breaking lock by taking the offensive, it is very easy indeed if the attacker is so obliging as to dive forward and attempt to tackle one at the waist.1</p><p><i>Fight Club</i> fighting was mostly hard style, albeit of the untrained variety, which prides itself on winning through attrition and outlasting the other guy. This brings up what may be the most intriguing and dichotomous aspect of <i>Fight Club</i>, for while both the literary and cinematic depictions of the actual fighting were absurd in regards to the length—twenty minutes!—and nature of the fights, the author did an excellent job of describing the psychological effects of fighting on the fighter.</p><p>But first, the absurdities. Without artificial restraints, when there are no rules, most fights are concluded in a matter of seconds rather than minutes once the action begins. This is especially true when the fighters are trained, as the human body’s ability to deal out damage tends to exceed its capacity to withstand it. The image of the bloody warriors fighting to the point of exhaustion and beyond is a Hollywood cliché; in reality, the fight is usually settled as soon as one fighter’s defenses are penetrated and matters speed quickly to an end.</p><p>The popular cinematic vision of a back-and-forth battle, wherein one fighter has the advantage first, then loses it as the other fighter valiantly demonstrates his toughness by battling back, owes rather more to spo<br> rts such as boxing and even basketball than it does to the martial arts. Fighting is a surprisingly hierarchical endeavor, as one fighter who can beat another fighter will almost always beat that other fighter, even if they are relatively evenly matched. The balance of a fight is rather like that of a snowball perched precariously on the top of a hill. It may wobble back and forth initially, but once it begins rolling downhill, it seldom stops and reverses course uphill in order to go down the other side.2</br></p><p>If the fights in <i>Fight Club</i> themselves are somewhat fantastic, the portrayal of the mental state behind them is not. The scene in the bathroom at the office was what arrested my attention and made me realize that <i>Fight Club</i> was truly something unusual, as it perfectly captured the alienation of the fighter from a society that thoroughly disapproves of physical violence. As for the constant measuring of every man who passes by as a potential opponent, the mental matchup that takes place every time a man crosses another man’s path is an instinctual habit in which every fighter automatically engages.</p><p>There is a silent arrogance inside every fighter, a quiet contempt for those who are afraid to do what he does and yet still dare to judge him for his blackened eyes, his bandaged hands, and the marks that remind them that not all the world is soft and fat and weak. While physics makes the fighter, what makes <i>Fight Club</i> fascinating is the glimpse it gives us of what lies beneath the civilized mask.</p><p><b>The Flamers of Fight Club</b></p><p>At the time that I read <i>Fight Club</i>, I had not heard of its author. But before I finished the first chapter, I was entirely convinced that whoever he might be, he wasn’t particularly interested in women, sexually or otherwise. And between the first page and the last, I read nothing that caused me to change my mind—rather the opposite, actually.</p><p>One cannot really say that <i>Fight Club</i> has a homosexual subtext, because the concept of a literary subtext generally implies some degree of subtlety, and at the very least demands an absence of screaming obviousness flaunting itself in the reader’s face with all the discretion of a Sydney pride parade. Consider the very first scene of the book, wherein one man is thrusting a hard cylindrical object into another man’s mouth:</p><p><i>“That old saying, how you always kill the one you love, well, look, it works both ways. With a gun stuck in your mouth and the barrel of the gun between your teeth, you can only talk in vowels. . . . Tyler and me at the edge of the roof, the gun in my mouth, I’m wondering how clean this gun is.”</i></p><p>No sooner does this oral performance come to an end than the second chapter begins with the reader discovering the protagonist in the massive arms of Big Bob, in which he has apparently been finding weekly release for two years. In only a few sparse pages, by sharing the loving relationships between two different pairs of men with the reader, the author manages to introduce him to two of the classic fascinations of the homosexual community, Death and the unending Search for the Father.</p><p>Big Bob also introduces the theme of gender confusion, what with his missing testicles and bitch tits. More importantly, the basement of the support group meeting in the Trinity Episcopal church foreshadows the coming activities of the club that dare not speak its name, as pairs of men cling together “the way wrestlers stand, locked” and exchange bodily fluids. In this early case the fluid is tears, later it will be blood and sweat, and in both cases they metaphorically represent an altogether different substance.</p><p>There are other semiotic clues lurking amidst the gatherings of dying men, but perhaps the most telling symbol that can be found in the support group scene is the protagonist’s inability to perform and find the release he is seeking in the presence of a woman. Her sex defiles “the one real thing” in his life, the thing he needs, and his immediate reaction to her very being is a combination of hatred, disgust and fear. It just doesn’t get much more gay than that.</p><p>Unless of course you count  the subsequent description of a slippery red penis, towering four stories over the unsuspecting heads of a movie audience.  It serves as a markedly apt metaphor, both for the way in which many fans of Fight Club remain oblivious to the fact that it is a screaming, panting, writhing ode to the custom of men having sex with other men and the way in which an attachment to this custom tends to supercede all other aspects of individual self-identification.</p><p><i>“You Aren’t Your Name. You Aren’t Your Family.”</i></p><p>In <i>Among the Thugs</i>, Bill Buford’s 1990 book chronicling his eight years dabbling in European football hooliganism, Buford describes a bizarre scene in an English nightclub wherein the drunken ruffians ripped their shirts off and jumped madly up and down to heavy industrial music while packed in tight against one another. He found this activity to be weirdly homoerotic, considering the overwhelmingly straight tendencies of the soccer thugs.</p><p>But the hooligans’ activities were always out in the open; indeed, they were often police-escorted and televised. The secretive nature of <i>Fight Club</i>, on the other hand, especially its First Rule, is rather more reminiscent of the notorious decree of the U.S. military: “Don’t ask, don’t tell.” Moreover, it would take a truly superficial reader indeed to fail to note the glaring similarities between the fight clubs gathering anonymously in dark places while trying to stay out of trouble with the police and the shady, quasi-illegal bathhouses where gay men have trolled for sex for decades.</p><p><i>“Because I’m Tyler Durden and you can kiss my ass, I register to fight every guy in the club that night. Fifty fights. One fight at a time. No shoes. No shirts”</i></p><p>But no shortage of “service.” Given that Tyler is one of the least risk-averse characters ever to inhabit a novel, one can safely conclude that there will be no condoms either in this climactic gang-bang. In a world without metaphor, surely this book would have been published as <i>Fuck Club</i>.</p><p>Although the motif of violence is enthralling, it is the homosexual themes that provide <i>Fight Club</i> with the haunting quality that truly sets it apart. Without them, and without what they appear to reveal about the author’s own sense of being an outcast from mundane straight civilization, neither the book nor the film would be as emotionally powerful as they are.</p><p>The disturbing note on which the book ends is altogether fitting, combining as it does the contempt of the fighter with the alienation of the flamer. And yet, notwithstanding the way in which these two diverse elements worked surprisingly well in producing an intriguing novel, one remains rather skeptical that this is an alchemic formula that can be expected to make something better out of the world.</p><p>To paraphrase the great English philosophers, gay men lurking in cellars distributing fluids is no basis for a civilization.</p></div>",
  "content_text": "THE CLUB THAT DARE NOT SPEAK ITS NAME\nby Vox Day\nThis is an essay that appears in the new and wide-ranging SmartPop anthology, entitled\nYou Do Not Talk About Fight Club\n: I Am Jack’s Completely Unauthorized Essay Collection\n.  The anthology was edited by the brilliant media ecologist Read Mercer Schuchardt and features a forward by Chuck Palahniuk himself.\nThe Physics of Fight Club\nThere is a savage joy in violence. The secret of the success of\nFight Club\nis its acceptance of that basic and uncomfortable truth, which is as well-known to every martial artist, gang member, and football hooligan as it is completely alien to the sedentary sort of middle-aged individuals favored by those who publish novels. For as men have known since long before the Colosseum’s sands were first soaked with blood, there is no adrenaline rush so great as the moment when two men put one another to the physical test.\nFight Club\nis a fascinating little book which not only embraced that truth, but in doing so, translated surprisingly well to the cinematic medium. This should probably not have been surprising, given that the author’s witch’s brew of male fury and raw but stylized violence is almost perfectly suited for that male audience which so enjoys the cinematic adventures of Bruce Lee, Jean-Claude van Damme, Jackie Chan, and a host of other aggressively oriented male leads. The combination of that visceral appeal with the brilliant casting of a ripped and shirtless Brad Pitt for the ladies all but assured Hollywood hit status.\nWhen viewed from a technical perspective,\nFight Club\nis nearly as absurd as any\nwuxia\nextravaganza featuring aerial acrobatics and mad dashes through the treetops, whereas from a psychological perspective, it is impressively accurate. To the combat-aware reader, the book raises the interesting question of how the author could have gotten the latter so right and the former so wrong.\nFight Club\nsubscribes to the common conventional fiction that it is not the size of the dog in the fight that matters, but rather the size of the fight in the dog. Although in\nFight Club\nterms, this might be better described as the size of the proverbial canine’s violent sociopathy. As with most aphorisms, there is an element of truth to this; all things being equal, the tougher individual will usually prevail. But outside of the formalized structure of the boxing ring, all things are very seldom equal.\nThe most basic truth of unarmed combat is that F = M x A: Force equals Mass times Acceleration. Since Force is the measurement of what is smashing into your face and is the primary variable determining exactly what the effect of that blow will be, it is very important to understand the significance of this equation. Since Mass is a function of size, this means that a larger individual will usually pack a more powerful punch than a smaller one. Usually, but not always.\nBecause Acceleration is just as important as Mass. Acceleration comes in two forms, the first being the speed with which the individual can deliver the blow. This can come from natural speed (given a choice, always elect to get punched by a marathon runner, not a sprinter), or from the perfected technique which is a product of training. The second form of Acceleration is the relative motion of two bodies, which is to say, if you are moving towards the puncher at the moment the punch arrives, it will hurt significantly more than if you are moving away from him.\nWhen these elements all come together, they result in the perfect storm that is the instantaneous knockout. I once made the mistake of getting overconfident and attempted to go inside on a 6’5″, 260-pound fighter who was slow, inflexible, and therefore almost helpless at kicking range. His Mass was obviously superlative, however, and I unwisely granted him the benefit of Acceleration by moving straight in towards him at full speed. The multiplication of the two forces was such that a simple defensive jab on his part left me waking up on the concrete floor, wondering what had happened and where I was.\nThe second fundamental truth of unarmed combat is that evasion is everything. This is why blocks are given the same importance as strikes; indeed, the famous “wax-on, wax-off” from\nThe Karate Kid\nis not only better known than any exotic attacking technique, but is genuinely part of the basic repertoire of any traditionally trained martial artist.\nAt the basic level, evasive options are limited. But for the trained fighter, there are a whole host of techniques at one’s disposal, including oblique movement, gap management, arrhythmic timing, destructive blocks, and simultaneous offense-defense. All of these tactics and more have been developed to allow the fighter to avoid the direct application of Force to his body; indeed, the martial arts are customarily divided into the hard style, wherein the opponent’s Force is met with Force, and the soft style, wherein one seeks to use the opponent’s Force against him.\nKali, for example, is a Philippino hard style. Its brutal destructive blocks make heavy use of the knees and elbows, so that in the place of a traditional “wax-off” block designed to deflect a blow with the forearm, the arm is flexed and the point of the elbow is used to block the incoming strike instead. The ease with which the elbow can break an ankle or a wrist makes delivering a blow nearly as dangerous as receiving a direct one; even a partial block will sting an opponent and make him very wary of attempting another attack.\nKung fu, on the other hand, is the classic soft style. By redirecting the incoming Force and allowing it to flow past him, a soft response allows the martial artist to do things he could not hope to do using only his own Force. Soft styles are particularly effective in dealing with the conventional brute force attacks of the sort seen in the\nFight Club\nfilm, for while it is extremely difficult to put an opponent in a neck-breaking lock by taking the offensive, it is very easy indeed if the attacker is so obliging as to dive forward and attempt to tackle one at the waist.1\nFight Club\nfighting was mostly hard style, albeit of the untrained variety, which prides itself on winning through attrition and outlasting the other guy. This brings up what may be the most intriguing and dichotomous aspect of\nFight Club\n, for while both the literary and cinematic depictions of the actual fighting were absurd in regards to the length—twenty minutes!—and nature of the fights, the author did an excellent job of describing the psychological effects of fighting on the fighter.\nBut first, the absurdities. Without artificial restraints, when there are no rules, most fights are concluded in a matter of seconds rather than minutes once the action begins. This is especially true when the fighters are trained, as the human body’s ability to deal out damage tends to exceed its capacity to withstand it. The image of the bloody warriors fighting to the point of exhaustion and beyond is a Hollywood cliché; in reality, the fight is usually settled as soon as one fighter’s defenses are penetrated and matters speed quickly to an end.\nThe popular cinematic vision of a back-and-forth battle, wherein one fighter has the advantage first, then loses it as the other fighter valiantly demonstrates his toughness by battling back, owes rather more to spo\nrts such as boxing and even basketball than it does to the martial arts. Fighting is a surprisingly hierarchical endeavor, as one fighter who can beat another fighter will almost always beat that other fighter, even if they are relatively evenly matched. The balance of a fight is rather like that of a snowball perched precariously on the top of a hill. It may wobble back and forth initially, but once it begins rolling downhill, it seldom stops and reverses course uphill in order to go down the other side.2\nIf the fights in\nFight Club\nthemselves are somewhat fantastic, the portrayal of the mental state behind them is not. The scene in the bathroom at the office was what arrested my attention and made me realize that\nFight Club\nwas truly something unusual, as it perfectly captured the alienation of the fighter from a society that thoroughly disapproves of physical violence. As for the constant measuring of every man who passes by as a potential opponent, the mental matchup that takes place every time a man crosses another man’s path is an instinctual habit in which every fighter automatically engages.\nThere is a silent arrogance inside every fighter, a quiet contempt for those who are afraid to do what he does and yet still dare to judge him for his blackened eyes, his bandaged hands, and the marks that remind them that not all the world is soft and fat and weak. While physics makes the fighter, what makes\nFight Club\nfascinating is the glimpse it gives us of what lies beneath the civilized mask.\nThe Flamers of Fight Club\nAt the time that I read\nFight Club\n, I had not heard of its author. But before I finished the first chapter, I was entirely convinced that whoever he might be, he wasn’t particularly interested in women, sexually or otherwise. And between the first page and the last, I read nothing that caused me to change my mind—rather the opposite, actually.\nOne cannot really say that\nFight Club\nhas a homosexual subtext, because the concept of a literary subtext generally implies some degree of subtlety, and at the very least demands an absence of screaming obviousness flaunting itself in the reader’s face with all the discretion of a Sydney pride parade. Consider the very first scene of the book, wherein one man is thrusting a hard cylindrical object into another man’s mouth:\n“That old saying, how you always kill the one you love, well, look, it works both ways. With a gun stuck in your mouth and the barrel of the gun between your teeth, you can only talk in vowels. . . . Tyler and me at the edge of the roof, the gun in my mouth, I’m wondering how clean this gun is.”\nNo sooner does this oral performance come to an end than the second chapter begins with the reader discovering the protagonist in the massive arms of Big Bob, in which he has apparently been finding weekly release for two years. In only a few sparse pages, by sharing the loving relationships between two different pairs of men with the reader, the author manages to introduce him to two of the classic fascinations of the homosexual community, Death and the unending Search for the Father.\nBig Bob also introduces the theme of gender confusion, what with his missing testicles and bitch tits. More importantly, the basement of the support group meeting in the Trinity Episcopal church foreshadows the coming activities of the club that dare not speak its name, as pairs of men cling together “the way wrestlers stand, locked” and exchange bodily fluids. In this early case the fluid is tears, later it will be blood and sweat, and in both cases they metaphorically represent an altogether different substance.\nThere are other semiotic clues lurking amidst the gatherings of dying men, but perhaps the most telling symbol that can be found in the support group scene is the protagonist’s inability to perform and find the release he is seeking in the presence of a woman. Her sex defiles “the one real thing” in his life, the thing he needs, and his immediate reaction to her very being is a combination of hatred, disgust and fear. It just doesn’t get much more gay than that.\nUnless of course you count  the subsequent description of a slippery red penis, towering four stories over the unsuspecting heads of a movie audience.  It serves as a markedly apt metaphor, both for the way in which many fans of Fight Club remain oblivious to the fact that it is a screaming, panting, writhing ode to the custom of men having sex with other men and the way in which an attachment to this custom tends to supercede all other aspects of individual self-identification.\n“You Aren’t Your Name. You Aren’t Your Family.”\nIn\nAmong the Thugs\n, Bill Buford’s 1990 book chronicling his eight years dabbling in European football hooliganism, Buford describes a bizarre scene in an English nightclub wherein the drunken ruffians ripped their shirts off and jumped madly up and down to heavy industrial music while packed in tight against one another. He found this activity to be weirdly homoerotic, considering the overwhelmingly straight tendencies of the soccer thugs.\nBut the hooligans’ activities were always out in the open; indeed, they were often police-escorted and televised. The secretive nature of\nFight Club\n, on the other hand, especially its First Rule, is rather more reminiscent of the notorious decree of the U.S. military: “Don’t ask, don’t tell.” Moreover, it would take a truly superficial reader indeed to fail to note the glaring similarities between the fight clubs gathering anonymously in dark places while trying to stay out of trouble with the police and the shady, quasi-illegal bathhouses where gay men have trolled for sex for decades.\n“Because I’m Tyler Durden and you can kiss my ass, I register to fight every guy in the club that night. Fifty fights. One fight at a time. No shoes. No shirts”\nBut no shortage of “service.” Given that Tyler is one of the least risk-averse characters ever to inhabit a novel, one can safely conclude that there will be no condoms either in this climactic gang-bang. In a world without metaphor, surely this book would have been published as\nFuck Club\n.\nAlthough the motif of violence is enthralling, it is the homosexual themes that provide\nFight Club\nwith the haunting quality that truly sets it apart. Without them, and without what they appear to reveal about the author’s own sense of being an outcast from mundane straight civilization, neither the book nor the film would be as emotionally powerful as they are.\nThe disturbing note on which the book ends is altogether fitting, combining as it does the contempt of the fighter with the alienation of the flamer. And yet, notwithstanding the way in which these two diverse elements worked surprisingly well in producing an intriguing novel, one remains rather skeptical that this is an alchemic formula that can be expected to make something better out of the world.\nTo paraphrase the great English philosophers, gay men lurking in cellars distributing fluids is no basis for a civilization.",
  "tags": [],
  "categories": [],
  "sitemap_lastmod": "2008-08-04T08:44:00+00:00"
}