{
  "url": "https://voxday.net/2008/08/29/finally-got-one-rig/",
  "scraped_at": "2026-01-08T22:34:10.066249",
  "title": "Finally got one right",
  "date_display": "August 29, 2008",
  "date_iso": "2008-08-29T14:10:00+00:00",
  "date_from_url": "2008-08-29",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>Or <a href=\"http://www.cnbc.com/id/26454655\">so it appears</a>:</p><blockquote><p>Alaska Gov. Sarah Palin, a self-styled “hockey mom” who has only been governor for a little over a year, is GOP Presidential candidate John McCain’s choice for Vice President, CNBC has learned.  According to a Republican strategist, Palin is the nominee, though McCain’s campaign has not comfirmed this.</p></blockquote><p>It looks like McCain thinks he can win this now, as Palin is the choice of someone who is actually trying to win.  It will help nicely in defanging the “historic” nature of the Obama campaign; among other things, she’s actually 100 percent woman.  And just to show how bad political bloggers are at predicting these things, I was one of just four of the 65 bloggers surveyed by Right Wing News who correctly anticipated the Palin selection… and this is the first thing I’ve gotten right this presidential election cycle.  (I had Hillary as the Dem nominee and George Pataki as the Republican… however, I did make my picks long before the cycle got rolling.)</p><p>UPDATE – it’s quite humorous to read the innocently optimistic reactions of devoted Democrats, such as <a href=\"http://scalzi.com/whatever/?p=1528#comment-52835\">those that inhabit Whatever</a>.  They apparently believe that John McCain has no experience outside of the Senate – what is this <i>Vietnam</i> of which you speak so strangely? – they assert that the totality of Hillary’s electoral appeal lies in her stance on the issues, and they genuinely think that Palin’s selection will somehow prevent McCain from hammering Obama on his near-complete lack of experience.</p><p>Worst of all, they fail to realize that attempting to belittle Palin by pointing out that Alaska is not a large state and Wasilla is not a big city is not exactly the most tenable position for a candidate who is already perceived as a too-effete elitist by the residents of many small states and cities across America.</p><p>UPDATE II – <a href=\"http://althouse.blogspot.com/2008/08/live-blogging-mccain-vp-announcement.html\">This is why Palin was a brilliant choice</a> for McCain and why Biden was such a stupid choice for Obama: <i>“Ah so, it’s going to be a woman. I’m hearing this for the first time at 8:37 Central Time. I will reveal that, instantly, a chill ran through my body when I heard that, and I have broken a sob or two as I write this.”</i></p><p>Yes, Virginia, a significant percentage of the female electorate really is so shallow and stupid that they will vote for a woman simply because she is a woman.  It’s the same reason that more than 90 percent of the black electorate is going to vote for Obama.  This isn’t rocket science.</p></div>",
  "content_text": "Or\nso it appears\n:\nAlaska Gov. Sarah Palin, a self-styled “hockey mom” who has only been governor for a little over a year, is GOP Presidential candidate John McCain’s choice for Vice President, CNBC has learned.  According to a Republican strategist, Palin is the nominee, though McCain’s campaign has not comfirmed this.\nIt looks like McCain thinks he can win this now, as Palin is the choice of someone who is actually trying to win.  It will help nicely in defanging the “historic” nature of the Obama campaign; among other things, she’s actually 100 percent woman.  And just to show how bad political bloggers are at predicting these things, I was one of just four of the 65 bloggers surveyed by Right Wing News who correctly anticipated the Palin selection… and this is the first thing I’ve gotten right this presidential election cycle.  (I had Hillary as the Dem nominee and George Pataki as the Republican… however, I did make my picks long before the cycle got rolling.)\nUPDATE – it’s quite humorous to read the innocently optimistic reactions of devoted Democrats, such as\nthose that inhabit Whatever\n.  They apparently believe that John McCain has no experience outside of the Senate – what is this\nVietnam\nof which you speak so strangely? – they assert that the totality of Hillary’s electoral appeal lies in her stance on the issues, and they genuinely think that Palin’s selection will somehow prevent McCain from hammering Obama on his near-complete lack of experience.\nWorst of all, they fail to realize that attempting to belittle Palin by pointing out that Alaska is not a large state and Wasilla is not a big city is not exactly the most tenable position for a candidate who is already perceived as a too-effete elitist by the residents of many small states and cities across America.\nUPDATE II –\nThis is why Palin was a brilliant choice\nfor McCain and why Biden was such a stupid choice for Obama:\n“Ah so, it’s going to be a woman. I’m hearing this for the first time at 8:37 Central Time. I will reveal that, instantly, a chill ran through my body when I heard that, and I have broken a sob or two as I write this.”\nYes, Virginia, a significant percentage of the female electorate really is so shallow and stupid that they will vote for a woman simply because she is a woman.  It’s the same reason that more than 90 percent of the black electorate is going to vote for Obama.  This isn’t rocket science.",
  "tags": [],
  "categories": [],
  "sitemap_lastmod": "2008-08-29T13:10:00+00:00"
}