{
  "url": "https://voxday.net/2008/08/19/is-mccain-in-it-to-win-i/",
  "scraped_at": "2026-01-08T22:33:19.731515",
  "title": "Is McCain in it to win it?",
  "date_display": "August 19, 2008",
  "date_iso": "2008-08-19T14:25:00+00:00",
  "date_from_url": "2008-08-19",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>His VP selection <a href=\"http://townhall.com/columnists/DavidLimbaugh/2008/08/19/pro-choice_mccain_veep_equals_political_suicide?page=2\">will tell the story</a>:</p><blockquote><p>McCain has a golden opportunity to expose both Obama’s dark-heartedness and his lack of integrity by zeroing in on his abortion and infanticide record. But if McCain picks a pro-abortionist, he will forfeit his moral authority and political advantage on the issue and might very well be conceding the election to Obama.</p></blockquote><p>Normally, you’d be sure that no Republican candidate for president would ever be crazy enough to select a pro-<s>abortion</s>choice running mate.  But now that Obama’s tendency towards auto-asphyxiation has been revealed, McCain may need to work harder if he’s going to tank the election.  The worst possible choice of the names that have been floated, I think, would be Joe Lieberman, although the beetle-browed Tom Ridge would certainly be a close runner-up.</p></div>",
  "content_text": "His VP selection\nwill tell the story\n:\nMcCain has a golden opportunity to expose both Obama’s dark-heartedness and his lack of integrity by zeroing in on his abortion and infanticide record. But if McCain picks a pro-abortionist, he will forfeit his moral authority and political advantage on the issue and might very well be conceding the election to Obama.\nNormally, you’d be sure that no Republican candidate for president would ever be crazy enough to select a pro-\nabortion\nchoice running mate.  But now that Obama’s tendency towards auto-asphyxiation has been revealed, McCain may need to work harder if he’s going to tank the election.  The worst possible choice of the names that have been floated, I think, would be Joe Lieberman, although the beetle-browed Tom Ridge would certainly be a close runner-up.",
  "tags": [],
  "categories": [],
  "sitemap_lastmod": "2008-08-19T13:25:00+00:00"
}