{
  "url": "https://voxday.net/2008/08/31/journalists-are-idiots/",
  "scraped_at": "2026-01-08T22:34:19.385589",
  "title": "Journalists are idiots",
  "date_display": "August 31, 2008",
  "date_iso": "2008-08-31T21:37:00+00:00",
  "date_from_url": "2008-08-31",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>In case you needed <a href=\"http://newsbusters.org/blogs/brent-baker/2008/08/31/clift-reveals-many-newsrooms-palin-greeted-laughter\">further proof</a>:</p><blockquote><p>ELEANOR CLIFT: This is not a serious choice. It makes it look like a made for TV movie. If the media reaction is anything, it’s been literally laughter in many places across news-</p><p>JOHN McLAUGHLIN, TALKING OVER CLIFT: Where is that? See that?</p><p>CLIFT: In very, very many newsrooms.</p></blockquote><p>They didn’t see the Palin selection coming.  I did.  They think it’s a joke and will turn out poorly for McCain.  I think it’s an excellent choice that will help him trounce Obama.  We’ll see who is correct….</p><p>One has to wonder if the effete media types dissing Palin would be quite so keen to <a href=\"http://www.dailykos.com/story/2008/8/29/17933/7330/417/579267\">get nasty about her and her youngest child</a> if they knew <a href=\"http://www.juneauempire.com/stories/021808/sta_248201772.shtml\">what sort of man her husband is</a>.  They’d probably do very well to keep their criticism substantive and polite, although it would be absolutely hysterical to see someone like Colmes or Olberman get punched out by a hard-bitten snowmobile racer.</p><p>UPDATE – As I pointed out, it wasn’t exactly hard for Republicans to find recent pictures of Palin that <a href=\"http://i131.photobucket.com/albums/p312/CO757300/Other/Sarah%20Palin/SarahPalin-13.jpg\">show her pregnancy</a>.  It seems the beauty of being a Democrat is that one never has to let even the most momentary thought get in the way of opening one’s mouth.</p></div>",
  "content_text": "In case you needed\nfurther proof\n:\nELEANOR CLIFT: This is not a serious choice. It makes it look like a made for TV movie. If the media reaction is anything, it’s been literally laughter in many places across news-\nJOHN McLAUGHLIN, TALKING OVER CLIFT: Where is that? See that?\nCLIFT: In very, very many newsrooms.\nThey didn’t see the Palin selection coming.  I did.  They think it’s a joke and will turn out poorly for McCain.  I think it’s an excellent choice that will help him trounce Obama.  We’ll see who is correct….\nOne has to wonder if the effete media types dissing Palin would be quite so keen to\nget nasty about her and her youngest child\nif they knew\nwhat sort of man her husband is\n.  They’d probably do very well to keep their criticism substantive and polite, although it would be absolutely hysterical to see someone like Colmes or Olberman get punched out by a hard-bitten snowmobile racer.\nUPDATE – As I pointed out, it wasn’t exactly hard for Republicans to find recent pictures of Palin that\nshow her pregnancy\n.  It seems the beauty of being a Democrat is that one never has to let even the most momentary thought get in the way of opening one’s mouth.",
  "tags": [],
  "categories": [],
  "sitemap_lastmod": "2008-08-31T20:37:00+00:00"
}