{
  "url": "https://voxday.net/2008/08/29/less-than-zero-2/",
  "scraped_at": "2026-01-08T22:34:11.909181",
  "title": "Less than zero",
  "date_display": "August 29, 2008",
  "date_iso": "2008-08-29T20:44:00+00:00",
  "date_from_url": "2008-08-29",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>Fresh from their unsuccessful attempt to enforce a radio speech doctrine, a spokesman from Obama campaign <a href=\"http://www.breitbart.com/article.php?id=080829171140.5123i228&amp;show_article=1\">manages to insert his foot in his mouth</a> so deep that he bloodied his nose with his knee:</p><blockquote><p>“Today, John McCain put the former mayor of a town of 9,000 with zero foreign policy experience a heartbeat away from the presidency,” Obama spokesman Bill Burton said in a statement.</p></blockquote><p>“The Obama campaign, on the other hand, offers the opportunity to put a man with no experience of any kind outside of law school and the legislative branch <i>even closer</i>!”</p><p>I find it hard to imagine that Sarah Palin will hesitate to remind people that Alaska borders Russia either.  I don’t know what sort of border issues they’ve had there lately, but I’d be very surprised if there hadn’t been a few.  And I cannot believe that this marketroid was dumb enough to openly diss small Alaskan towns in the name of the guy who is still trying to recover from doing the same thing to rural Pennsylvanians and West Virginians.</p><p>I expect the Obama campaign will drop this theme very quickly indeed.</p></div>",
  "content_text": "Fresh from their unsuccessful attempt to enforce a radio speech doctrine, a spokesman from Obama campaign\nmanages to insert his foot in his mouth\nso deep that he bloodied his nose with his knee:\n“Today, John McCain put the former mayor of a town of 9,000 with zero foreign policy experience a heartbeat away from the presidency,” Obama spokesman Bill Burton said in a statement.\n“The Obama campaign, on the other hand, offers the opportunity to put a man with no experience of any kind outside of law school and the legislative branch\neven closer\n!”\nI find it hard to imagine that Sarah Palin will hesitate to remind people that Alaska borders Russia either.  I don’t know what sort of border issues they’ve had there lately, but I’d be very surprised if there hadn’t been a few.  And I cannot believe that this marketroid was dumb enough to openly diss small Alaskan towns in the name of the guy who is still trying to recover from doing the same thing to rural Pennsylvanians and West Virginians.\nI expect the Obama campaign will drop this theme very quickly indeed.",
  "tags": [],
  "categories": [],
  "sitemap_lastmod": "2008-08-29T19:44:00+00:00"
}