{
  "url": "https://voxday.net/2008/08/12/mailvox-in-defense-of-fairy-club/",
  "scraped_at": "2026-01-08T22:32:54.640147",
  "title": "Mailvox: in defense of Fairy Club",
  "date_display": "August 12, 2008",
  "date_iso": "2008-08-12T21:23:00+00:00",
  "date_from_url": "2008-08-12",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>JB feels as if his innocence has been violated:</p><blockquote><p>At first I admit to great dismay when your wedgie on Fight Club exposed its frilly lace. The book you’ve made sound so horribly gay that I’d sooner read Whitman. But you have tilted at the wrong windmill in your attempt to impute homosexual undertones to the movie’s phallic symbolism, and quite missed your overstretched mark. And let me head you off from any outing of my prose with the impenetrable defense that even my metaphors are heterogeneous.</p><p>Marla. In the movie, she was banged, a lot, very hotly. Even the weak avatar hit on her, “let me get your phone number.” Nobody gets the homosexuality of Fight Club because the theme isn’t there. Fighting = manhood = get hot girl. Doesn’t get more heterosexual than that.  The cock scene in the theater. Cut to little girl crying. Now that’s good heterosexual humor… she’ll like it plenty later.</p><p>The psychology of fighting vs. reality. The book’s famed 50 fuck-fights, one man at a time, doesn’t happen. The fights aren’t realistic because real fights aren’t psychologically realistic. That’s why wisdom is necessary, to understand the idiocy of natural emotion. The movie, whatever its faggy authorial inspiration, is a story about the immanentization of Valhalla. End the office. End Apollonian order. Revive the territorial, the brotherhood and discipline and respect of the religious tribe, the violence and joy of the single combat gloriously extending and cycling anew each weekend, the resultant damage cartoonish and dismissable. It is the ultimate possible expression of the psychology of the fighter, to live on Earth and yet in Valhalla, to walk among sheep as a god.</p><p>Sure the psychological weakness of the beta Edward Norton hints at gayness in his dependent relationship on Tyler, but that ends when Edward becomes a man himself, and every beta is kind of faggy, so in that sense the whole world is flaming. And since Edward WAS Tyler, he was beating the shit out of himself in the parking lot and was the badass all along… and even the Catholics most disapproving of “self-abuse” admit it’s not a Levitically executable offence.</p><p>Unlike many books that lose their souls on the silver screen, Fight Club was merely deboned. Q.E.D.</p></blockquote><p>Deboned is a good description.  Degayed would be a more acccurate one, were it not for the essential point of the appeal provided by  a bare-chested Brad Pitt.  It’s quite clear that JB has not read the book <i>Fight Club</i>, but merely seen the movie.  I’m not imputing anything to the movie; while I do mention it, I’m primarily writing about the book, which is more shriekingly homosexual than the average pride parade.  I’ll readily grant JB that the movie is rather less gay than the book, but then, how does the relative non-gayness of the movie make the book flame any less?  I futher note that opposition to Apollonian order is a veritable gay theme in and of itself, as per Camille Paglia’s <i>Sexual Personae</i>.</p><p>But the primary error that JB makes is that the homosexual theme of <i>Fight Club</i> makes the book not worth reading.  To the contrary, it is precisely that theme and the subsequent alienation of the characters that make the book stand out.  Unless you read only to have your feelings, opinions, and prejudices confirmed, <i>Fight Club</i> is as deeply interesting for the glimpse it provides into an alien perspective as is <i>The Divine Secrets of the Ya-Ya Sisterhood</i>.</p></div>",
  "content_text": "JB feels as if his innocence has been violated:\nAt first I admit to great dismay when your wedgie on Fight Club exposed its frilly lace. The book you’ve made sound so horribly gay that I’d sooner read Whitman. But you have tilted at the wrong windmill in your attempt to impute homosexual undertones to the movie’s phallic symbolism, and quite missed your overstretched mark. And let me head you off from any outing of my prose with the impenetrable defense that even my metaphors are heterogeneous.\nMarla. In the movie, she was banged, a lot, very hotly. Even the weak avatar hit on her, “let me get your phone number.” Nobody gets the homosexuality of Fight Club because the theme isn’t there. Fighting = manhood = get hot girl. Doesn’t get more heterosexual than that.  The cock scene in the theater. Cut to little girl crying. Now that’s good heterosexual humor… she’ll like it plenty later.\nThe psychology of fighting vs. reality. The book’s famed 50 fuck-fights, one man at a time, doesn’t happen. The fights aren’t realistic because real fights aren’t psychologically realistic. That’s why wisdom is necessary, to understand the idiocy of natural emotion. The movie, whatever its faggy authorial inspiration, is a story about the immanentization of Valhalla. End the office. End Apollonian order. Revive the territorial, the brotherhood and discipline and respect of the religious tribe, the violence and joy of the single combat gloriously extending and cycling anew each weekend, the resultant damage cartoonish and dismissable. It is the ultimate possible expression of the psychology of the fighter, to live on Earth and yet in Valhalla, to walk among sheep as a god.\nSure the psychological weakness of the beta Edward Norton hints at gayness in his dependent relationship on Tyler, but that ends when Edward becomes a man himself, and every beta is kind of faggy, so in that sense the whole world is flaming. And since Edward WAS Tyler, he was beating the shit out of himself in the parking lot and was the badass all along… and even the Catholics most disapproving of “self-abuse” admit it’s not a Levitically executable offence.\nUnlike many books that lose their souls on the silver screen, Fight Club was merely deboned. Q.E.D.\nDeboned is a good description.  Degayed would be a more acccurate one, were it not for the essential point of the appeal provided by  a bare-chested Brad Pitt.  It’s quite clear that JB has not read the book\nFight Club\n, but merely seen the movie.  I’m not imputing anything to the movie; while I do mention it, I’m primarily writing about the book, which is more shriekingly homosexual than the average pride parade.  I’ll readily grant JB that the movie is rather less gay than the book, but then, how does the relative non-gayness of the movie make the book flame any less?  I futher note that opposition to Apollonian order is a veritable gay theme in and of itself, as per Camille Paglia’s\nSexual Personae\n.\nBut the primary error that JB makes is that the homosexual theme of\nFight Club\nmakes the book not worth reading.  To the contrary, it is precisely that theme and the subsequent alienation of the characters that make the book stand out.  Unless you read only to have your feelings, opinions, and prejudices confirmed,\nFight Club\nis as deeply interesting for the glimpse it provides into an alien perspective as is\nThe Divine Secrets of the Ya-Ya Sisterhood\n.",
  "tags": [],
  "categories": [],
  "sitemap_lastmod": "2008-08-12T20:23:00+00:00"
}