{
  "url": "https://voxday.net/2008/08/01/mailvox-read-more-carefully-before-you/",
  "scraped_at": "2026-01-08T22:31:54.626807",
  "title": "Mailvox: read more carefully before you rip",
  "date_display": "August 1, 2008",
  "date_iso": "2008-08-01T08:24:00+00:00",
  "date_from_url": "2008-08-01",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>Dana of Mamalogues demonstrates both her amazing class and astounding reading comprehension in the following email.  Please note that I am posting this with permission:</p><blockquote><p>1. I don’t allow anonymous comments on my blog simply because I don’t dig cowards. You’re welcome to whatever two cents, or sense, in this matter, you want so long as you own it. I always practice the same courtesy on another’s website.</p><p>2. I don’t appreciate the blatant lie that I vandalized your little Wikipedia page. I believe you tried to condescend to me about not being familiar with you, yes? Here you are actually committing your own sin. There are no “women” who  write on my website, just me, and I had bigger things to handle this evening than to do whatever you are accusing me of. I won’t hold my breath waiting for an apology.</p><p>Not that any of us are perfect Christians, but you still prioritize your ego over Christ. At least when I screw up and do the same, I admit it.</p><p>Feel free to post this or not. If you’re going to play though; cut with the lies. It’s a lame way to try and win some BS argument.</p></blockquote><p>This is quite funny coming from a woman who, as I noted previously, wrote several easily verified lies in her post and also tried to “out” my identity.  Now, I don’t believe for a second that Dana vandalized the “little Wikipedia page”.  It was, as I suggested in my post yesterday, almost certainly one of her regular readers or commenters.  More than one, actually, as it appears that <a href=\"http://en.wikipedia.org/w/index.php?title=Theodore_Beale&amp;action=history\">three separate attempts have been made</a> since I responded to her yesterday.  I have to admit, I find the fact that Christian mommybloggers and their readers behave almost exactly like Dawkinsian atheists when confronted with evidence of their own irrationality to be more than a little amusing.</p><p>Dana shows herself to be a cretin in accusing me of “a blatant lie”, as the reference to “those fine, upstanding women at Mamalogue” obviously encompasses Dana, her commenters and her readers.  I didn’t say anything about writing, and anyways, if there are no women who write at Mamalogues except Dana, then how does she explain the various comments by the likes of Amy, Belinda, Kelli, and, of course, Karen Sugarpants.  It probably escapes Dana, that she is not permitted to interpret the word “at” in an extremely narrow manner in order to accuse me of lying.  It’s also a peculiar definition of anonymous that permits “MMP” but not “W”.  I don’t allow anonymous comments either, as one can easily verify, but a single letter still serves successfully as an identifier.</p><p>There is no argument to win here.  I don’t respect her friend and I reject her friend’s ludicrous demand for recognition and respect.  Dana has not only admirably supported my case regarding both the lack of respect and the rejection, she has offered a copious amount of evidence that mommyblogging is precisely the narcissistic, brain-dead navel-gazing that those of us previously unfamiliar with it suspected it to be.</p></div>",
  "content_text": "Dana of Mamalogues demonstrates both her amazing class and astounding reading comprehension in the following email.  Please note that I am posting this with permission:\n1. I don’t allow anonymous comments on my blog simply because I don’t dig cowards. You’re welcome to whatever two cents, or sense, in this matter, you want so long as you own it. I always practice the same courtesy on another’s website.\n2. I don’t appreciate the blatant lie that I vandalized your little Wikipedia page. I believe you tried to condescend to me about not being familiar with you, yes? Here you are actually committing your own sin. There are no “women” who  write on my website, just me, and I had bigger things to handle this evening than to do whatever you are accusing me of. I won’t hold my breath waiting for an apology.\nNot that any of us are perfect Christians, but you still prioritize your ego over Christ. At least when I screw up and do the same, I admit it.\nFeel free to post this or not. If you’re going to play though; cut with the lies. It’s a lame way to try and win some BS argument.\nThis is quite funny coming from a woman who, as I noted previously, wrote several easily verified lies in her post and also tried to “out” my identity.  Now, I don’t believe for a second that Dana vandalized the “little Wikipedia page”.  It was, as I suggested in my post yesterday, almost certainly one of her regular readers or commenters.  More than one, actually, as it appears that\nthree separate attempts have been made\nsince I responded to her yesterday.  I have to admit, I find the fact that Christian mommybloggers and their readers behave almost exactly like Dawkinsian atheists when confronted with evidence of their own irrationality to be more than a little amusing.\nDana shows herself to be a cretin in accusing me of “a blatant lie”, as the reference to “those fine, upstanding women at Mamalogue” obviously encompasses Dana, her commenters and her readers.  I didn’t say anything about writing, and anyways, if there are no women who write at Mamalogues except Dana, then how does she explain the various comments by the likes of Amy, Belinda, Kelli, and, of course, Karen Sugarpants.  It probably escapes Dana, that she is not permitted to interpret the word “at” in an extremely narrow manner in order to accuse me of lying.  It’s also a peculiar definition of anonymous that permits “MMP” but not “W”.  I don’t allow anonymous comments either, as one can easily verify, but a single letter still serves successfully as an identifier.\nThere is no argument to win here.  I don’t respect her friend and I reject her friend’s ludicrous demand for recognition and respect.  Dana has not only admirably supported my case regarding both the lack of respect and the rejection, she has offered a copious amount of evidence that mommyblogging is precisely the narcissistic, brain-dead navel-gazing that those of us previously unfamiliar with it suspected it to be.",
  "tags": [],
  "categories": [],
  "sitemap_lastmod": "2008-08-01T07:24:00+00:00"
}