{
  "url": "https://voxday.net/2008/08/05/mailvox-three-emails/",
  "scraped_at": "2026-01-08T22:32:12.472228",
  "title": "Mailvox: three emails",
  "date_display": "August 5, 2008",
  "date_iso": "2008-08-05T13:34:00+00:00",
  "date_from_url": "2008-08-05",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>FH points out an insufficiency in the physics of Fight Club:</p><blockquote><p>I loved your fight club blog, just want to point out a minor science issue as I guess you probably talk about fighting a lot.  F=MA  tells us the force needed to achieve a given acceleration at any point in time.    It doesn’t apply to the impact of a blow.  The general equation that most closely applies to that is  E =MV2 /2    That would say V squared if I could email in superscript.</p><p>So velocity is much more important than mass in determining the kinetic energy of a punch.  Even the mass behind a blow is only partly dependent on the weight of the puncher – technique like hip and torso rotation is important to ensure a decent proportion of your body weight is behind the blow.   On the other hand body weight also helps the fighter passively in absorbing energy that could otherwise result in greater pain, loss of consciousness and injury.</p></blockquote><p>This makes sense, although I wouldn’t go so far as to say that it renders F=MA totally inapplicable.  Halving the speed of a strike does reduce the impact far more than halving the effective mass of the striker.  It’s vastly preferable to get tapped by a big guy than take a full-force punch from a small guy.  FH is also correct about the way in which body weight helps absorb energy; some time ago I wrote about the insalubrious result of trying to go toe-to-toe with a fighter of equal strength who outweighed me by 60 pounds.</p><p>MC wants to know who would win in a battle of the WND warriors:</p><blockquote><p>I notice that you and Chuck Norris have articles on World Net Daily every Monday.  This got me to thinking.  Since I enjoy reading both, and since you guys are both martial artists, and since you broke the rule and talked about Fight Club, who do you honestly, think would win in the octagon?</p></blockquote><p>It’s funny that you should ask that; it’s a little known fact that while WorldNetDaily columns are much sought after by television talking heads, laid-off print journalists, and D-List celebrities, to actually earn a headline spot on the center strip of the home page, you have to fight for it.  I earned my Monday headline spot back in 2001 with a below-the-belt crane strike that jammed Bill O’Reilly’s testicles so far up his rectum that it took five blonde Fox News reporters equipped with loofahs were to extricate them; the shame of it was such that he fled WND entirely.  So, you can probably imagine how intimidated I was last year when I heard a helicopter landing outside and opened the door to see the invincible Chuck Norris his own bad self standing next to Mr. Joseph Farah, wearing the same outfit he’d worn in <i>Enter the Dragon</i> and making a Neo-esque “come and fight” gesture.</p><p>Chuck’s Chun Kuk Do was unbelievably strong, but his flexibility has waned with the years and so the lightning-fast sokuto intended for my solar plexus only grazed my left shin.  Even so, the speed of it forced me to switch from an aggressive Tiger stance to a more defensive Nekko-achi, from which I snapped a front kick that would have crushed his jaw had he not slashed down with a patented Shigawire Mustache block that severed two of my toes.  Screaming in pain and fury, I leaped backward while throwing a defensive maegeri that didn’t make contact, but blinded him with a spray of blood.  While Chuck rubbed at his face to clear his vision, I took advantage of his momentary blindness to attack again and broke several of his ribs with a skipping left sokuto that left a bloody footprint on his white gi.</p><p>Chuck doubled over and I stepped forward to throw a right-left combination to his head that would have finished him, but the movement turned out to be a ruse.  Just as I threw the right hook, he caught my wrist, twisted his body and threw me over his shoulder, slamming me into the pavement in front of my garage.  I was stunned, naturally, and my shoulder was dislocated, but I managed to roll away before he drove his heel down into my throat.  Still, I was in a very precarious position and had all but given up hope of keeping the hawk on Monday’s front page.  Fortunately for me, the disturbance of the air caused by my violent passage through it had slightly ruffled Joseph Farah’s exquisitely coiffed mane, so Mr. Farah immediately called time, declared the match a draw, and told us to sort it out amongst ourselves while he flipped open his solid gold satellite phone and arranged for an emergency styling right there in the driveway.</p><p>His personal hair stylist arrived in minutes, but of course it takes time and care to retouch such a detailed work of art, so after Chuck finished bandaging his ribs and Spacebunny reattached my toes with a stapler, Chuck and I realized there was only one reasonable solution for two mighty martial artists like ourselves.  We borrowed Mr. Farah’s copter, flew to Ellen Ratner’s house and beat the hell out of her and her two cats.</p><p><i>With apologies to Neal Stephenson, <a href=\"http://interviews.slashdot.org/article.pl?sid=04/10/20/1518217\">who did it first</a> and did it better.</i></p><p>Res pops up long enough to fire off a question:</p><blockquote><p>I noticed your post about the new book. Congratulations! I hope it does well.  I was just wondering, what criteria, if any do you use when deciding to use your real name on a book or other publication?</p></blockquote><p>If it’s fiction, I usually use my given name.  If it’s non-fiction, I usually use my pen name.  This tends to keep things more or less in order.</p></div>",
  "content_text": "FH points out an insufficiency in the physics of Fight Club:\nI loved your fight club blog, just want to point out a minor science issue as I guess you probably talk about fighting a lot.  F=MA  tells us the force needed to achieve a given acceleration at any point in time.    It doesn’t apply to the impact of a blow.  The general equation that most closely applies to that is  E =MV2 /2    That would say V squared if I could email in superscript.\nSo velocity is much more important than mass in determining the kinetic energy of a punch.  Even the mass behind a blow is only partly dependent on the weight of the puncher – technique like hip and torso rotation is important to ensure a decent proportion of your body weight is behind the blow.   On the other hand body weight also helps the fighter passively in absorbing energy that could otherwise result in greater pain, loss of consciousness and injury.\nThis makes sense, although I wouldn’t go so far as to say that it renders F=MA totally inapplicable.  Halving the speed of a strike does reduce the impact far more than halving the effective mass of the striker.  It’s vastly preferable to get tapped by a big guy than take a full-force punch from a small guy.  FH is also correct about the way in which body weight helps absorb energy; some time ago I wrote about the insalubrious result of trying to go toe-to-toe with a fighter of equal strength who outweighed me by 60 pounds.\nMC wants to know who would win in a battle of the WND warriors:\nI notice that you and Chuck Norris have articles on World Net Daily every Monday.  This got me to thinking.  Since I enjoy reading both, and since you guys are both martial artists, and since you broke the rule and talked about Fight Club, who do you honestly, think would win in the octagon?\nIt’s funny that you should ask that; it’s a little known fact that while WorldNetDaily columns are much sought after by television talking heads, laid-off print journalists, and D-List celebrities, to actually earn a headline spot on the center strip of the home page, you have to fight for it.  I earned my Monday headline spot back in 2001 with a below-the-belt crane strike that jammed Bill O’Reilly’s testicles so far up his rectum that it took five blonde Fox News reporters equipped with loofahs were to extricate them; the shame of it was such that he fled WND entirely.  So, you can probably imagine how intimidated I was last year when I heard a helicopter landing outside and opened the door to see the invincible Chuck Norris his own bad self standing next to Mr. Joseph Farah, wearing the same outfit he’d worn in\nEnter the Dragon\nand making a Neo-esque “come and fight” gesture.\nChuck’s Chun Kuk Do was unbelievably strong, but his flexibility has waned with the years and so the lightning-fast sokuto intended for my solar plexus only grazed my left shin.  Even so, the speed of it forced me to switch from an aggressive Tiger stance to a more defensive Nekko-achi, from which I snapped a front kick that would have crushed his jaw had he not slashed down with a patented Shigawire Mustache block that severed two of my toes.  Screaming in pain and fury, I leaped backward while throwing a defensive maegeri that didn’t make contact, but blinded him with a spray of blood.  While Chuck rubbed at his face to clear his vision, I took advantage of his momentary blindness to attack again and broke several of his ribs with a skipping left sokuto that left a bloody footprint on his white gi.\nChuck doubled over and I stepped forward to throw a right-left combination to his head that would have finished him, but the movement turned out to be a ruse.  Just as I threw the right hook, he caught my wrist, twisted his body and threw me over his shoulder, slamming me into the pavement in front of my garage.  I was stunned, naturally, and my shoulder was dislocated, but I managed to roll away before he drove his heel down into my throat.  Still, I was in a very precarious position and had all but given up hope of keeping the hawk on Monday’s front page.  Fortunately for me, the disturbance of the air caused by my violent passage through it had slightly ruffled Joseph Farah’s exquisitely coiffed mane, so Mr. Farah immediately called time, declared the match a draw, and told us to sort it out amongst ourselves while he flipped open his solid gold satellite phone and arranged for an emergency styling right there in the driveway.\nHis personal hair stylist arrived in minutes, but of course it takes time and care to retouch such a detailed work of art, so after Chuck finished bandaging his ribs and Spacebunny reattached my toes with a stapler, Chuck and I realized there was only one reasonable solution for two mighty martial artists like ourselves.  We borrowed Mr. Farah’s copter, flew to Ellen Ratner’s house and beat the hell out of her and her two cats.\nWith apologies to Neal Stephenson,\nwho did it first\nand did it better.\nRes pops up long enough to fire off a question:\nI noticed your post about the new book. Congratulations! I hope it does well.  I was just wondering, what criteria, if any do you use when deciding to use your real name on a book or other publication?\nIf it’s fiction, I usually use my given name.  If it’s non-fiction, I usually use my pen name.  This tends to keep things more or less in order.",
  "tags": [],
  "categories": [],
  "sitemap_lastmod": "2008-08-05T12:34:00+00:00"
}