{
  "url": "https://voxday.net/2008/08/21/now-this-is-just-delicious/",
  "scraped_at": "2026-01-08T22:33:34.425394",
  "title": "Now this is just delicious",
  "date_display": "August 21, 2008",
  "date_iso": "2008-08-21T18:39:00+00:00",
  "date_from_url": "2008-08-21",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>Russia takes <a href=\"http://www.russiatoday.com/news/news/29005\">a page from NATO</a>:</p><blockquote><p>Russian investigators have launched a criminal case on charges of genocide in connection with the events in South Ossetia. Russia’s Interfax news agency reports that the Russian General Prosecutor’s Office has said Georgian President Mikhail Saakashvili may also be put on trial.  Igor Komissarov, deputy chairman of the Prosecutor’s Investigation Committee, said it had “initiated a genocide probe based on reports of actions committed by Georgian troops aimed at murdering Russian citizens, ethnic Ossetians, living in South Ossetia.”</p></blockquote><p>This naturally provides a perfectly reasonable justification for keeping Russian troops in Georgia.  After all, such a notorious war criminal can’t be permitted to hide behind his political office, as precedent established in the case of Serbia’s Slobodan Milosevic.  I wonder how long it will be before some nation or collection of nations put George Bush and the neocons on trial for their undeniable war crimes in Afghanistan and Iraq?  That would be as amusing as it would be fitting.</p><p>The thing is, Putin is not exactly a good guy.  Not even close.  But the outrageously hypocritical actions of the Clinton and Bush adminstrations – don’t forget, Kosovo began as a Clinton initiative – allow him to credibly position himself as one.  Believe me, he’s much better regarded by the average European than Bush is these days.  The thing that too many myopic Americans can’t seem to grasp is that <i>everybody hates #1!</i> no matter who they are.  This was true in the days of Athens and it is true now.</p><p>By the way, <a href=\"http://www.stratfor.com/weekly/kosovar_independence_and_russian_reaction\">Stratfor saw this coming</a> back in February in a piece entitled “Kosovar Independence and the Russian Reaction” <i>“What is the hardest to believe — but is, of course, possible — is that Putin simply will allow the Kosovo issue to pass. He clearly knew this was coming. He maintained vocal opposition to it beforehand and reiterated his opposition afterward. The more he talks and the less he does, the weaker he appears to be. He personally can’t afford that, and neither can Russia. He had opportunities to cut his losses before Kosovo’s independence was declared. He didn’t. That means either he has blundered badly or he has something on his mind. Our experience with Putin is that the latter is more likely….”</i></p></div>",
  "content_text": "Russia takes\na page from NATO\n:\nRussian investigators have launched a criminal case on charges of genocide in connection with the events in South Ossetia. Russia’s Interfax news agency reports that the Russian General Prosecutor’s Office has said Georgian President Mikhail Saakashvili may also be put on trial.  Igor Komissarov, deputy chairman of the Prosecutor’s Investigation Committee, said it had “initiated a genocide probe based on reports of actions committed by Georgian troops aimed at murdering Russian citizens, ethnic Ossetians, living in South Ossetia.”\nThis naturally provides a perfectly reasonable justification for keeping Russian troops in Georgia.  After all, such a notorious war criminal can’t be permitted to hide behind his political office, as precedent established in the case of Serbia’s Slobodan Milosevic.  I wonder how long it will be before some nation or collection of nations put George Bush and the neocons on trial for their undeniable war crimes in Afghanistan and Iraq?  That would be as amusing as it would be fitting.\nThe thing is, Putin is not exactly a good guy.  Not even close.  But the outrageously hypocritical actions of the Clinton and Bush adminstrations – don’t forget, Kosovo began as a Clinton initiative – allow him to credibly position himself as one.  Believe me, he’s much better regarded by the average European than Bush is these days.  The thing that too many myopic Americans can’t seem to grasp is that\neverybody hates #1!\nno matter who they are.  This was true in the days of Athens and it is true now.\nBy the way,\nStratfor saw this coming\nback in February in a piece entitled “Kosovar Independence and the Russian Reaction”\n“What is the hardest to believe — but is, of course, possible — is that Putin simply will allow the Kosovo issue to pass. He clearly knew this was coming. He maintained vocal opposition to it beforehand and reiterated his opposition afterward. The more he talks and the less he does, the weaker he appears to be. He personally can’t afford that, and neither can Russia. He had opportunities to cut his losses before Kosovo’s independence was declared. He didn’t. That means either he has blundered badly or he has something on his mind. Our experience with Putin is that the latter is more likely….”",
  "tags": [],
  "categories": [],
  "sitemap_lastmod": "2008-08-21T17:39:00+00:00"
}