{
  "url": "https://voxday.net/2008/08/13/that-elusive-global-warming/",
  "scraped_at": "2026-01-08T22:32:58.321945",
  "title": "That elusive global “warming”",
  "date_display": "August 13, 2008",
  "date_iso": "2008-08-13T18:44:00+00:00",
  "date_from_url": "2008-08-13",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>I’m just curious <a href=\"http://www.chicagotribune.com/news/local/chi-tom-skilling-explainer-13aug13,0,918946.story\">how cold it’s going to have to get</a> before the global warming crowd finally begins to admit that not only are their Steamed Planet scenarios far from inevitable, but confess how they were completely wrong on the entire issue from the start.  That should take place right about the time that glaciers cover Minnesota and start threatening New York City, I assume:</p><blockquote><p>[S]ummer heat continues in short supply, continuing a trend that has dominated much of the 21st Century’s opening decade. There have been only 162 days 90 degrees or warmer at Midway Airport over the period from 2000 to 2008. That’s by far the fewest 90-degree temperatures in the opening nine years of any decade on record here since 1930.</p></blockquote><p>Perhaps it’s time we take a page from their stupid playbook and begin referring to them as global warming Insisters.  Because, as they will be more than happy to tell you, the planet IS getting warmer, except, of course, when it isn’t.</p></div>",
  "content_text": "I’m just curious\nhow cold it’s going to have to get\nbefore the global warming crowd finally begins to admit that not only are their Steamed Planet scenarios far from inevitable, but confess how they were completely wrong on the entire issue from the start.  That should take place right about the time that glaciers cover Minnesota and start threatening New York City, I assume:\n[S]ummer heat continues in short supply, continuing a trend that has dominated much of the 21st Century’s opening decade. There have been only 162 days 90 degrees or warmer at Midway Airport over the period from 2000 to 2008. That’s by far the fewest 90-degree temperatures in the opening nine years of any decade on record here since 1930.\nPerhaps it’s time we take a page from their stupid playbook and begin referring to them as global warming Insisters.  Because, as they will be more than happy to tell you, the planet IS getting warmer, except, of course, when it isn’t.",
  "tags": [],
  "categories": [],
  "sitemap_lastmod": "2008-08-13T17:44:00+00:00"
}