{
  "url": "https://voxday.net/2008/08/09/vpfl-aler/",
  "scraped_at": "2026-01-08T22:32:41.664370",
  "title": "VPFL alert",
  "date_display": "August 9, 2008",
  "date_iso": "2008-08-09T21:09:00+00:00",
  "date_from_url": "2008-08-09",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>This is the annual VPFL call for fantasy football league coaches.  Each player will inherit a team from last year except the returning stalwarts, namely myself aka Mounds View Meerkats aka <i>the Piranha of the Serengeti</i>, the White Buffalo aka Greenfield Grizzlies, the returning champion Masonville Marauders, and, of course, because every team needs a gimme, Nate aka Burns ICU.</p><p>The sole caveat is that if you’re not going to actively manage your team, don’t join.  Last year, we had a few teams that were a bit shaky; if you suspect you might have issues then I’d encourage you to solicit an assistant manager from the blog.  Preference will be given to those who wanted to play last year but couldn’t.</p><p>For those who have managed a VPFL team in the past, Huck and Sean have started a VPFL alumni team.  If you’re interested, note it here.  I’ll post the results for both teams every week so long as Sean keeps me updated on the results of the VP-AFL.</p></div>",
  "content_text": "This is the annual VPFL call for fantasy football league coaches.  Each player will inherit a team from last year except the returning stalwarts, namely myself aka Mounds View Meerkats aka\nthe Piranha of the Serengeti\n, the White Buffalo aka Greenfield Grizzlies, the returning champion Masonville Marauders, and, of course, because every team needs a gimme, Nate aka Burns ICU.\nThe sole caveat is that if you’re not going to actively manage your team, don’t join.  Last year, we had a few teams that were a bit shaky; if you suspect you might have issues then I’d encourage you to solicit an assistant manager from the blog.  Preference will be given to those who wanted to play last year but couldn’t.\nFor those who have managed a VPFL team in the past, Huck and Sean have started a VPFL alumni team.  If you’re interested, note it here.  I’ll post the results for both teams every week so long as Sean keeps me updated on the results of the VP-AFL.",
  "tags": [],
  "categories": [],
  "sitemap_lastmod": "2008-08-09T20:09:00+00:00"
}