{
  "url": "https://voxday.net/2008/08/09/what-women-wan/",
  "scraped_at": "2026-01-08T22:32:37.980469",
  "title": "What women want",
  "date_display": "August 9, 2008",
  "date_iso": "2008-08-09T13:41:00+00:00",
  "date_from_url": "2008-08-09",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>I woudn’t pretend to know.  I tend to suspect they don’t either.  But shockingly, it has been discovered that normal women <a href=\"http://drhelen.blogspot.com/2008/08/where-have-all-vikings-gone.html\">really don’t want men to be women</a>:</p><blockquote><p>I will tell you about the main article that caught my eye–the one on men acting like women in Scandinavia. The author, Elizabeth Debold, sets out to Scandinavia to find out how “gender equality” is playing itself out in that culture….  A guy named Bo states, “We end up relating to women in a way that is more like woman to woman, not man to woman. We are feminized in our relationships, and they don’t last.”</p></blockquote><p>Before you begin relating to women like her girlfriend, it may serve you well to stop and consider the fate of her historical friendships.  In general, most women tend to place their romantic relationships well ahead of their friendships, regardless of the message the Spice Girls and <i>Sex in the City</i> tried to portray.  In real life, Samantha would have seduced Mr. Big, thus ending her relationship with Carrie, Charlotte would have disappeared for weeks at a time whenever she began dating someone regularly, and Miranda would have been acting distant and weird for months before showing up one day with a female life partner who resembled Pete Rose and vanishing, never to be seen again.  Within seven years, Carrie would be completely out of contact with all three of them except for the annual Christmas card from Charlotte.</p><p>The problem is that very few individuals of either sex truly know what they want; if they say they do, they’re probably wrong.  Women in particular will swear up and down that they want X, but what that actually means is that right at that particular moment, they THINK they want X.  Chasing X is a fool’s game; no man can MAKE a woman happy.  A woman can only choose to be happy or unhappy on her own and trying to make her happy by rushing to comply with her every demand and quaking with fear over her least displeasure is one sure way to drive her away, full of contempt for you.</p><p>I don’t pretend to know what women want.  I truly don’t care.  It’s simply irrelevant to me, as completely and utterly irrelevant as what I want is to women.  This is why it’s important for a man’s inclinations to be in some sort of natural and general alignment with his wife’s, so that neither one of them have to spend much time thinking about the matter.  Now, this doesn’t mean that one can’t bestir oneself from one’s general indifference to help one’s wife achieve what she wants just as one would help out a good friend, but seriously, how many guys sit around and worry about whether their best friend is happy or not 24 hours a day?</p><p>If somebody’s willing to kill for you, die for you, and help you bury a dead body without asking questions first, that’s all you can possibly hope to find in a friend or a spouse.  No rational creature can possibly demand slavish devotion to anticipating its momentary whims; stay very far away from any man or woman who does.</p></div>",
  "content_text": "I woudn’t pretend to know.  I tend to suspect they don’t either.  But shockingly, it has been discovered that normal women\nreally don’t want men to be women\n:\nI will tell you about the main article that caught my eye–the one on men acting like women in Scandinavia. The author, Elizabeth Debold, sets out to Scandinavia to find out how “gender equality” is playing itself out in that culture….  A guy named Bo states, “We end up relating to women in a way that is more like woman to woman, not man to woman. We are feminized in our relationships, and they don’t last.”\nBefore you begin relating to women like her girlfriend, it may serve you well to stop and consider the fate of her historical friendships.  In general, most women tend to place their romantic relationships well ahead of their friendships, regardless of the message the Spice Girls and\nSex in the City\ntried to portray.  In real life, Samantha would have seduced Mr. Big, thus ending her relationship with Carrie, Charlotte would have disappeared for weeks at a time whenever she began dating someone regularly, and Miranda would have been acting distant and weird for months before showing up one day with a female life partner who resembled Pete Rose and vanishing, never to be seen again.  Within seven years, Carrie would be completely out of contact with all three of them except for the annual Christmas card from Charlotte.\nThe problem is that very few individuals of either sex truly know what they want; if they say they do, they’re probably wrong.  Women in particular will swear up and down that they want X, but what that actually means is that right at that particular moment, they THINK they want X.  Chasing X is a fool’s game; no man can MAKE a woman happy.  A woman can only choose to be happy or unhappy on her own and trying to make her happy by rushing to comply with her every demand and quaking with fear over her least displeasure is one sure way to drive her away, full of contempt for you.\nI don’t pretend to know what women want.  I truly don’t care.  It’s simply irrelevant to me, as completely and utterly irrelevant as what I want is to women.  This is why it’s important for a man’s inclinations to be in some sort of natural and general alignment with his wife’s, so that neither one of them have to spend much time thinking about the matter.  Now, this doesn’t mean that one can’t bestir oneself from one’s general indifference to help one’s wife achieve what she wants just as one would help out a good friend, but seriously, how many guys sit around and worry about whether their best friend is happy or not 24 hours a day?\nIf somebody’s willing to kill for you, die for you, and help you bury a dead body without asking questions first, that’s all you can possibly hope to find in a friend or a spouse.  No rational creature can possibly demand slavish devotion to anticipating its momentary whims; stay very far away from any man or woman who does.",
  "tags": [],
  "categories": [],
  "sitemap_lastmod": "2008-08-09T12:41:00+00:00"
}