{
  "url": "https://voxday.net/2018/11/29/a-stake-to-the-heart/",
  "scraped_at": "2025-12-20T05:18:40.194784",
  "title": "“A stake to the heart”",
  "date_display": "November 29, 2018",
  "date_iso": "2018-11-29T16:00:11+00:00",
  "date_from_url": "2018-11-29",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>A <a href=\"https://batfort.com/2018/11/25/review-vox-day-jordanetics-a-journey-into-the-mind-of-humanitys-greatest-thinker/\">very personal review of <i>Jordanetics</i></a>:</p><blockquote><p>When I opened Vox Day’s <i>Jordanetics </i>last week, I was expecting something similar to what Vox has posted in his blog and uploaded in his YouTube livestreams: a fairly straightforward takedown of Jordan B Peterson and his views. The takedown would go a little bit too far (it’s a bit much for me to fathom going that hard at someone with an admitted mental illness, but then again I’m a girl and I don’t go hard at anyone), would probably make a few wisecracks about the all-meat diet, and would pull apart JPB’s books in a way that people couldn’t ignore.</p><p>What I did not expect was the stake to the heart….</p><p><i>For, <b>as long as Satan is not integrated, the world is not healed and man is not saved.</b> But Satan represents evil, and how can evil be integrated? There is only one possibility: to assimilate it, that is to say, raise it to the level of consciousness. This is done by means of a very complicated symbolic process which is more or less identical with the psychological process of individuation. In alchemy this is called the conjunction of two principles.</i><br>—Carl Jung, <i>Memories, Dreams, Reflections</i> (as quoted in Jordanetics)</br></p><p>I had a physical reaction to reading this. I am not kidding when I describe it as a punch in the face or a stake to the heart. Remember what I said about not actually having read Carl Jung’s works? This is why that’s a problem.</p><p>You see, the way to salvation is not through “integrating” evil through a “very complicated symbolic process.” The way to salvation is through Jesus Christ, and Him only. The narrow path.</p><p>To follow Christ, one must reject evil—not integrate it.</p></blockquote><p>This is precisely why I reject those who try to flail their hands impotently and claim that Peterson “is doing good work” or that he “means well” or is “helping so many people”. The man is evil. His gnostic philosophy is evil. His manufactured post-Christian religion is evil. And one of the reasons why so many of his fans and followers don’t recognize this is because none of them read his works or the works of those who have influenced him.</p><p>If you are a Christian, you can no more profitably dabble in Jordanetics than in cannibalism, gang rape, or human sacrifice to Quetzalcoatl. Jordanetics requires integrating Satan in order to heal the world and save Mankind. It is just another Middle Way to Hell. It is literally antithetical to Christianity.</p><p>Now do you understand why Jordan Peterson is being elevated as the great post-Christian prophet of the post-nationalist West?</p></div>",
  "content_text": "A\nvery personal review of\nJordanetics\n:\nWhen I opened Vox Day’s\nJordanetics\nlast week, I was expecting something similar to what Vox has posted in his blog and uploaded in his YouTube livestreams: a fairly straightforward takedown of Jordan B Peterson and his views. The takedown would go a little bit too far (it’s a bit much for me to fathom going that hard at someone with an admitted mental illness, but then again I’m a girl and I don’t go hard at anyone), would probably make a few wisecracks about the all-meat diet, and would pull apart JPB’s books in a way that people couldn’t ignore.\nWhat I did not expect was the stake to the heart….\nFor,\nas long as Satan is not integrated, the world is not healed and man is not saved.\nBut Satan represents evil, and how can evil be integrated? There is only one possibility: to assimilate it, that is to say, raise it to the level of consciousness. This is done by means of a very complicated symbolic process which is more or less identical with the psychological process of individuation. In alchemy this is called the conjunction of two principles.\n—Carl Jung,\nMemories, Dreams, Reflections\n(as quoted in Jordanetics)\nI had a physical reaction to reading this. I am not kidding when I describe it as a punch in the face or a stake to the heart. Remember what I said about not actually having read Carl Jung’s works? This is why that’s a problem.\nYou see, the way to salvation is not through “integrating” evil through a “very complicated symbolic process.” The way to salvation is through Jesus Christ, and Him only. The narrow path.\nTo follow Christ, one must reject evil—not integrate it.\nThis is precisely why I reject those who try to flail their hands impotently and claim that Peterson “is doing good work” or that he “means well” or is “helping so many people”. The man is evil. His gnostic philosophy is evil. His manufactured post-Christian religion is evil. And one of the reasons why so many of his fans and followers don’t recognize this is because none of them read his works or the works of those who have influenced him.\nIf you are a Christian, you can no more profitably dabble in Jordanetics than in cannibalism, gang rape, or human sacrifice to Quetzalcoatl. Jordanetics requires integrating Satan in order to heal the world and save Mankind. It is just another Middle Way to Hell. It is literally antithetical to Christianity.\nNow do you understand why Jordan Peterson is being elevated as the great post-Christian prophet of the post-nationalist West?",
  "tags": [
    "BookReview"
  ],
  "categories": [],
  "sitemap_lastmod": "2018-11-29T16:00:11+00:00"
}