{
  "url": "https://voxday.net/2018/11/07/a-wealth-of-wargaming-knowledge/",
  "scraped_at": "2025-12-20T05:15:52.590785",
  "title": "A wealth of wargaming knowledge",
  "date_display": "November 7, 2018",
  "date_iso": "2018-11-07T13:25:38+00:00",
  "date_from_url": "2018-11-07",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>Scott Cole conducts <a href=\"http://www.castaliahouse.com/wargame-wednesday-the-nafziger-collection/\">a fascinating interview with wargaming historian George Nafziger</a> at Castalia House for Wargaming Wednesday:</p><blockquote><p><b>SC: </b>David Hamilton-Williams’ <i>Waterloo New Perspectives</i> argues that one of the main influences for the modern understanding of the Battle of Waterloo is Captain William Siborne and his research conducted while building a topographical model of the battle field, all heavily influenced by interviews with British veterans while neglecting the role of minor Allies and, of course, the Prussians.</p><p><b>GN: </b>One thing about published authors – Just because you find it in print doesn’t mean it’s correct. I found a book on Leipzig where the author gave an OB for Leipzig that had the 1st &amp; 2nd Westphalian Hussars present at Leipzig, but both had deserted the French army in late August or early September 1813. This author simply assumed. He also listed Vandamme’s I Corps as still existing, but it was destroyed after the battle of Dresden at Teblitze</p><p>When I said that I found English literature on the Napoleonic wars unsatisfying, it was because English speakers are notoriously monoglots – reading only English and only repeat the mantra of “The English won the Napoleonic Wars because they were wonderful.” Let me ask you a rhetorical question: “How many English works go into any detail on Austrian, Russian, or Prussian actions on the battlefield?” I knew of very few.</p><p>Anyway, I’ve digressed. English-reading authors cite only English sources and you get the same stuff over and over again. When I buy a book on the Napoleonic era I look at the bibliography. If 50 percent or more is English, I figure the non-English citations are purely filler to flesh out the bibliography and it is purely a rehash of the same old Anglo-myopic stuff.</p><p>As for Siborne, he was an Englishman whose natural pro-English biases were accentuated by his desire to get subscriptions for his model, so he amplified the actions of those rich nobles he was soliciting for money. That said, he provides valuable information concerning the British (which must be evaluated for overstatement) and scanty details on the French. As for the Allies, they weren’t making donations to his model project, so they got left out.</p><p><b> SC: </b>Do you have examples of common misconceptions amongst the English reading public?</p><p><b>GN: </b>Yes, the idea that Wellington invented the two rank line. In fact, in the Dundas infantry regulation you will find it mandated WHEN the battalion did not have sufficient men to fill out the three rank formation. I did an analysis, which can be found in Imperial Bayonets, where the British Army in the peninsula was so under strength that it had no choice, but to be in two ranks as prescribed by the Dundas regulation.</p><p><b>SC: </b>You were a professional wargamer playing OPFOR at the Battle Command Training Center in Fort Leavenworth. Could you describe the similarities and the differences between the war games employed in the Battle Command Training Program (BTCP) and any commercial wargames you have played?</p><p><b>GN: </b>Dissimilarity – the Army actually knew something about war, where I have often found that wargamers frequently have no practical or personal experience in it. Though I was never in the Army, 25 years commissioned service in the Navy counts for something. In addition, I have experience in naval gunfire support off the coast of Vietnam. I also wear the combat action ribbon, for having been in combat, i.e. exchanging fire with the enemy.</p><p>Similarities – the generals frequently have ideas, and facts can be an annoyance to those fixed ideas. By this I do not intend to sound like I’m a know-it-all, and some of what I know is classified so I cannot discuss it, but let me relate one story. After the invasion of Iraq, I was writing scenarios for brigade-level exercises. I wrote one where I had the terrorists seize a water works and release the chlorine gas. The generals threw my scenario out saying that the terrorists would never do that. Within a year the terrorists were putting cylinders of chlorine with their IEDs. I rest my case.</p><p>There is one major difference between the BCTP games and any type of hobbyist wargame, and that is that the BCTP game had no “eye candy.” Visually it was very sterile. Commercial games have a necessity to make their games visually appealing.</p></blockquote><p>I don’t often post links to them here, but rest assured that I never miss reading a Wargaming Wednesday post. They are reliably an excellent and informative read.</p></div>",
  "content_text": "Scott Cole conducts\na fascinating interview with wargaming historian George Nafziger\nat Castalia House for Wargaming Wednesday:\nSC:\nDavid Hamilton-Williams’\nWaterloo New Perspectives\nargues that one of the main influences for the modern understanding of the Battle of Waterloo is Captain William Siborne and his research conducted while building a topographical model of the battle field, all heavily influenced by interviews with British veterans while neglecting the role of minor Allies and, of course, the Prussians.\nGN:\nOne thing about published authors – Just because you find it in print doesn’t mean it’s correct. I found a book on Leipzig where the author gave an OB for Leipzig that had the 1st & 2nd Westphalian Hussars present at Leipzig, but both had deserted the French army in late August or early September 1813. This author simply assumed. He also listed Vandamme’s I Corps as still existing, but it was destroyed after the battle of Dresden at Teblitze\nWhen I said that I found English literature on the Napoleonic wars unsatisfying, it was because English speakers are notoriously monoglots – reading only English and only repeat the mantra of “The English won the Napoleonic Wars because they were wonderful.” Let me ask you a rhetorical question: “How many English works go into any detail on Austrian, Russian, or Prussian actions on the battlefield?” I knew of very few.\nAnyway, I’ve digressed. English-reading authors cite only English sources and you get the same stuff over and over again. When I buy a book on the Napoleonic era I look at the bibliography. If 50 percent or more is English, I figure the non-English citations are purely filler to flesh out the bibliography and it is purely a rehash of the same old Anglo-myopic stuff.\nAs for Siborne, he was an Englishman whose natural pro-English biases were accentuated by his desire to get subscriptions for his model, so he amplified the actions of those rich nobles he was soliciting for money. That said, he provides valuable information concerning the British (which must be evaluated for overstatement) and scanty details on the French. As for the Allies, they weren’t making donations to his model project, so they got left out.\nSC:\nDo you have examples of common misconceptions amongst the English reading public?\nGN:\nYes, the idea that Wellington invented the two rank line. In fact, in the Dundas infantry regulation you will find it mandated WHEN the battalion did not have sufficient men to fill out the three rank formation. I did an analysis, which can be found in Imperial Bayonets, where the British Army in the peninsula was so under strength that it had no choice, but to be in two ranks as prescribed by the Dundas regulation.\nSC:\nYou were a professional wargamer playing OPFOR at the Battle Command Training Center in Fort Leavenworth. Could you describe the similarities and the differences between the war games employed in the Battle Command Training Program (BTCP) and any commercial wargames you have played?\nGN:\nDissimilarity – the Army actually knew something about war, where I have often found that wargamers frequently have no practical or personal experience in it. Though I was never in the Army, 25 years commissioned service in the Navy counts for something. In addition, I have experience in naval gunfire support off the coast of Vietnam. I also wear the combat action ribbon, for having been in combat, i.e. exchanging fire with the enemy.\nSimilarities – the generals frequently have ideas, and facts can be an annoyance to those fixed ideas. By this I do not intend to sound like I’m a know-it-all, and some of what I know is classified so I cannot discuss it, but let me relate one story. After the invasion of Iraq, I was writing scenarios for brigade-level exercises. I wrote one where I had the terrorists seize a water works and release the chlorine gas. The generals threw my scenario out saying that the terrorists would never do that. Within a year the terrorists were putting cylinders of chlorine with their IEDs. I rest my case.\nThere is one major difference between the BCTP games and any type of hobbyist wargame, and that is that the BCTP game had no “eye candy.” Visually it was very sterile. Commercial games have a necessity to make their games visually appealing.\nI don’t often post links to them here, but rest assured that I never miss reading a Wargaming Wednesday post. They are reliably an excellent and informative read.",
  "tags": [
    "war"
  ],
  "categories": [],
  "sitemap_lastmod": "2018-11-07T13:25:38+00:00"
}