{
  "url": "https://voxday.net/2018/11/22/almost-everything-i-said-was-untrue/",
  "scraped_at": "2025-12-20T05:17:49.638047",
  "title": "“Almost everything I said was untrue”",
  "date_display": "November 22, 2018",
  "date_iso": "2018-11-22T23:00:11+00:00",
  "date_from_url": "2018-11-22",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>Jordan Peterson deceives his deluded followers even when there is no real reason to do so:</p><blockquote class=\"tr_bq\"><p>Jordan B Peterson<br>I spoke a few days ago in Ljubjana, Slovenia, at the behest of my publisher, Družina,  there, to an audience of about 2000. </br></p></blockquote><p>Sure, that’s why you were in Slovenia. Because your publisher wanted you there. Just a simple book tour, that’s all. Hey, wait a minute… are you <i>sure </i>your little trip to a rather out-of-the-way destination didn’t have <i>anything </i>to do with the 42nd European Meeting of the Trilateral Commission?</p><blockquote class=\"tr_bq\"><p>From February to Sunday more than 200 most influential individuals will be literally from all over the world in Ljubljana. Ten years after the collapse of Lehman Brother’s, which was the beginning of the global economic crisis, one of the worst in the last hundred years, the economic future of Europe will be discussed in Ljubljana. Former President of the European Commission Jose Manuel Barroso, former President of the European Council Herman Van Rompuy, three former heads of state, and six former presidents of the government come from many distinguished thinkers and businessmen from all over the world, including Nigel Higgins of the Rothschild &amp; Co of London, Jacob Frenkel, JPMorgan Chase International, head of Munich Security Conference Wolfgang Ischinger, former Secretary General of NATO Jaap de Hoop Scheffer, <b>star globally-sold psychologist Jordan Peterson</b>, Internet startup from Israel Yossi Vardi, former Italian Prime Minister Mario Monti, KBC Bank Group Thomas Leysen, former head of EBRD Jean Lemierre , Franz Fischler, Forum Alpbach, Lionel Barber of The Financial Times, President of the Atlantic Grupa Group of Companies Emil Tedeschi, Stanford’s Jure Leskovec and so on and so on. Vice-President of the European Commission, Frans Timmermans, the last moment of cancellation of the arrival due to urgent obligations in Brussels, is one of the candidates for the future President of the European Commission. </p></blockquote><p>One can’t help but wonder for what influential position Jordan B. Peterson is a candidate. Prime Minister of Canada? Witch-King of the Third Theosophic Temple? In the meantime, former Peterson fan Buck Daniels <a href=\"https://www.counter-currents.com/2018/11/the-enemy-of-my-enemy-vox-days-jordanetics/\">reviews <i>Jordanetics</i></a>. I think it’s a particularly valuable review precisely because it is presented from a perspective that does not view me favorably:</p><blockquote><p>With most intellectuals, it is possible to summarize their arguments in a way that conveys their essence to ordinary people who have not read their work. For example, one could summarize Nietzsche’s “slave morality” argument by saying something like: “Nietzsche believed that ancient ‘morality’ was based around the polarities of ‘good’ and ‘bad.’ He believed the good was aligned with the nobility; it is described by things like power, pride, and happiness. The slave-class were resentful of the nobility’s power and happiness, and so they used words to create a new system of values, in which up was down and down was up. They defined noble ‘bad’ (the slaves) as the new ‘good,’ and the noble ‘good’ (the aristocracy) as ‘evil.’ Nietzsche believed that because the noble ‘good’ are the most procreative and pro-life values, the reversal of values and invention of modern morality, and its institution in Christianity in particular, creates a culture that is, in its moral values, hostile to life itself.” Different people may phrase it differently, but I would wager that basically everyone who has read Nietzsche would agree that this is, in essence, his argument.</p><p>With Peterson, such a distilled summary is not possible. Ask five Peterson fans what his philosophy is, or what he means when he talks about “truth,” you will likely get three different and mutually exclusive answers. Does he subscribe to a pragmatic definition? A coherence theory? A strange variant of an identity theory? Based on his conversation with Sam Harris, it isn’t a theory that is easily understood or believed even by experts who are nominally on his side, politically.</p><p>In philosophy, adversaries are expected to respect the methodological principle of charity which requires interlocutors to interpret each other’s argument in a manner that is the most coherent and rational, if multiple interpretations are possible. If someone says, for example, that it is 11 AM and the sun isn’t up, we could easily conclude that they are delusional—of course the sun would be up at 11 AM. But it is possible that their language loosely meant that the weather was overcast; this interpretation would make more rational and coherent sense of their two statements than simply accepting them on their face.</p><p>So would it be possible to apply the principle of charity to Dr. Jordan B. Peterson? Might we be able to stitch together his seemingly disconnected and incoherent philosophy? And if so, what would it look like?</p><p>Vox Day’s book—<i>Jordanetics: A Journey into the Mind of Humanity’s Greatest Thinker</i>—is that charitable book. But it is only charitable in the philosophical sense of the term. The worldview that emerges is coherent, but it is not pretty.</p></blockquote><p>It’s really not. That’s why it’s a very good idea to understand what the evil love-child of Tony Robbins and L. Ron Hubbard <a href=\"https://www.amazon.com/dp/B07JY9XV38/\">is actually teaching the unsuspecting</a>.</p></div>",
  "content_text": "Jordan Peterson deceives his deluded followers even when there is no real reason to do so:\nJordan B Peterson\nI spoke a few days ago in Ljubjana, Slovenia, at the behest of my publisher, Družina,  there, to an audience of about 2000.\nSure, that’s why you were in Slovenia. Because your publisher wanted you there. Just a simple book tour, that’s all. Hey, wait a minute… are you\nsure\nyour little trip to a rather out-of-the-way destination didn’t have\nanything\nto do with the 42nd European Meeting of the Trilateral Commission?\nFrom February to Sunday more than 200 most influential individuals will be literally from all over the world in Ljubljana. Ten years after the collapse of Lehman Brother’s, which was the beginning of the global economic crisis, one of the worst in the last hundred years, the economic future of Europe will be discussed in Ljubljana. Former President of the European Commission Jose Manuel Barroso, former President of the European Council Herman Van Rompuy, three former heads of state, and six former presidents of the government come from many distinguished thinkers and businessmen from all over the world, including Nigel Higgins of the Rothschild & Co of London, Jacob Frenkel, JPMorgan Chase International, head of Munich Security Conference Wolfgang Ischinger, former Secretary General of NATO Jaap de Hoop Scheffer,\nstar globally-sold psychologist Jordan Peterson\n, Internet startup from Israel Yossi Vardi, former Italian Prime Minister Mario Monti, KBC Bank Group Thomas Leysen, former head of EBRD Jean Lemierre , Franz Fischler, Forum Alpbach, Lionel Barber of The Financial Times, President of the Atlantic Grupa Group of Companies Emil Tedeschi, Stanford’s Jure Leskovec and so on and so on. Vice-President of the European Commission, Frans Timmermans, the last moment of cancellation of the arrival due to urgent obligations in Brussels, is one of the candidates for the future President of the European Commission.\nOne can’t help but wonder for what influential position Jordan B. Peterson is a candidate. Prime Minister of Canada? Witch-King of the Third Theosophic Temple? In the meantime, former Peterson fan Buck Daniels\nreviews\nJordanetics\n. I think it’s a particularly valuable review precisely because it is presented from a perspective that does not view me favorably:\nWith most intellectuals, it is possible to summarize their arguments in a way that conveys their essence to ordinary people who have not read their work. For example, one could summarize Nietzsche’s “slave morality” argument by saying something like: “Nietzsche believed that ancient ‘morality’ was based around the polarities of ‘good’ and ‘bad.’ He believed the good was aligned with the nobility; it is described by things like power, pride, and happiness. The slave-class were resentful of the nobility’s power and happiness, and so they used words to create a new system of values, in which up was down and down was up. They defined noble ‘bad’ (the slaves) as the new ‘good,’ and the noble ‘good’ (the aristocracy) as ‘evil.’ Nietzsche believed that because the noble ‘good’ are the most procreative and pro-life values, the reversal of values and invention of modern morality, and its institution in Christianity in particular, creates a culture that is, in its moral values, hostile to life itself.” Different people may phrase it differently, but I would wager that basically everyone who has read Nietzsche would agree that this is, in essence, his argument.\nWith Peterson, such a distilled summary is not possible. Ask five Peterson fans what his philosophy is, or what he means when he talks about “truth,” you will likely get three different and mutually exclusive answers. Does he subscribe to a pragmatic definition? A coherence theory? A strange variant of an identity theory? Based on his conversation with Sam Harris, it isn’t a theory that is easily understood or believed even by experts who are nominally on his side, politically.\nIn philosophy, adversaries are expected to respect the methodological principle of charity which requires interlocutors to interpret each other’s argument in a manner that is the most coherent and rational, if multiple interpretations are possible. If someone says, for example, that it is 11 AM and the sun isn’t up, we could easily conclude that they are delusional—of course the sun would be up at 11 AM. But it is possible that their language loosely meant that the weather was overcast; this interpretation would make more rational and coherent sense of their two statements than simply accepting them on their face.\nSo would it be possible to apply the principle of charity to Dr. Jordan B. Peterson? Might we be able to stitch together his seemingly disconnected and incoherent philosophy? And if so, what would it look like?\nVox Day’s book—\nJordanetics: A Journey into the Mind of Humanity’s Greatest Thinker\n—is that charitable book. But it is only charitable in the philosophical sense of the term. The worldview that emerges is coherent, but it is not pretty.\nIt’s really not. That’s why it’s a very good idea to understand what the evil love-child of Tony Robbins and L. Ron Hubbard\nis actually teaching the unsuspecting\n.",
  "tags": [
    "Jordanetics"
  ],
  "categories": [],
  "sitemap_lastmod": "2018-11-22T23:00:11+00:00"
}