{
  "url": "https://voxday.net/2018/11/25/appendix-c/",
  "scraped_at": "2025-12-20T05:18:07.899642",
  "title": "Appendix C",
  "date_display": "November 25, 2018",
  "date_iso": "2018-11-25T16:30:57+00:00",
  "date_from_url": "2018-11-25",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>In response to a number of requests from readers, I am adding a third appendix to <i><a href=\"https://www.amazon.com/Jordanetics-Journey-Humanitys-Greatest-Thinker-ebook/dp/B07JY9XV38/\">Jordanetics: A Journey Into the Mind of Humanity’s Greatest Thinker</a></i>. It consists of 12 rules for life that I consider to be superior to the rules of the 12-Rule Path, on both levels. Here are five of them.</p><ol><li><b>Embrace the iron.</b> Lifting weights will not only help you stand up straight, it will make you stronger, healthier, and more confident. The iron teaches the weak to be strong and it teaches the strong to be humble.</li><li><b>Take the wheel. </b>You are the ultimate architect of your own decisions and actions. Even if you were dealt a bad card by life, even if your genetics are inferior, your upbringing was terrible, and your instincts are suboptimal, you are the only one who can improve yourself. You are driving and only you can determine the destination.</li><li><b>Be the friend that you want to have.</b> Smiles are contagious. Loyalty inspires loyalty. Stand by those who stand by you. Give every friend who fails you a second chance. Only abandon those who have repeatedly proven they cannot be trusted and do not wish you well.</li><li><b>Envision perfection and pursue excellence.</b> You will never achieve perfection. But if you envision it and you strive for it, you may well achieve success, and perhaps even excellence.</li><li><b>Put a ring on it.</b> Marriage is the manifestation of love. Children are the manifestation of hope. Raising a family to serve as the foundation of future generations is how Man rebels against an uncaring universe, a fallen world, and the spirits of despair and destruction. Yes, there are real risks, especially in the current social and legal environment. But they are well worth taking nevertheless.</li></ol><div>The forthcoming paperback will contain Appendix C. The digital edition will be updated with it as well as the various corrections that went into the paperback, as usual. The response to the book continues to be polarized, as evidenced by a pair of recent reviews:<blockquote><p><b><a href=\"https://www.amazon.com/gp/customer-reviews/R1N2TYHDX1UFP5/ref=cm_cr_getr_d_rvw_ttl?ie=UTF8&amp;ASIN=B07JY9XV38\">Waste of money</a></b><br>Mostly YouTube comments, childish name calling, full blown narcissism and declaring Tammy ugly. It takes a small, vindictive personality and truckload of resentment to like this.</br></p><p><b><a href=\"https://www.amazon.com/gp/customer-reviews/R30R2BTPAUX14M/ref=cm_cr_arp_d_rvw_ttl?ie=UTF8&amp;ASIN=B07JY9XV38\">The Truth about Jordan Peterson</a></b><br>A lot of Jordan Peterson fans are seriously triggered by this book. They insist that Vox Day is jealous. They insist that Vox Day and Milo are “smearing” Jordan Peterson. The problem is that Vox Day has a solid argument and vast amounts of evidence to support it.</br></p><p>The argument, as laid out by Milo is a great introduction, is that Jordan Peterson is not what he seems. He is a chameleon of the worst type. Someone who deceitfully lies all the time.</p><p>If you aren’t satisfied with the examples Milo provides, Vox Day takes over and provides all the evidence you will ever need. One example after the next of Jordan Peterson saying one thing to one audience and then something completely contradictory somewhere else.</p><p>Which leads to the question of whether Jordan Peterson is a pathological liar. Is Jordan Peterson mentally stable? Could he be the Jim Jones of 2018? Vox Day admits that he doesn’t know himself. It is very brave of Vox Day to write this book. He and Milo have been viciously attacked by Peterson’s rabid followers. But the truth needs to be known.</p></blockquote></div></div>",
  "content_text": "In response to a number of requests from readers, I am adding a third appendix to\nJordanetics: A Journey Into the Mind of Humanity’s Greatest Thinker\n. It consists of 12 rules for life that I consider to be superior to the rules of the 12-Rule Path, on both levels. Here are five of them.\nEmbrace the iron.\nLifting weights will not only help you stand up straight, it will make you stronger, healthier, and more confident. The iron teaches the weak to be strong and it teaches the strong to be humble.\nTake the wheel.\nYou are the ultimate architect of your own decisions and actions. Even if you were dealt a bad card by life, even if your genetics are inferior, your upbringing was terrible, and your instincts are suboptimal, you are the only one who can improve yourself. You are driving and only you can determine the destination.\nBe the friend that you want to have.\nSmiles are contagious. Loyalty inspires loyalty. Stand by those who stand by you. Give every friend who fails you a second chance. Only abandon those who have repeatedly proven they cannot be trusted and do not wish you well.\nEnvision perfection and pursue excellence.\nYou will never achieve perfection. But if you envision it and you strive for it, you may well achieve success, and perhaps even excellence.\nPut a ring on it.\nMarriage is the manifestation of love. Children are the manifestation of hope. Raising a family to serve as the foundation of future generations is how Man rebels against an uncaring universe, a fallen world, and the spirits of despair and destruction. Yes, there are real risks, especially in the current social and legal environment. But they are well worth taking nevertheless.\nThe forthcoming paperback will contain Appendix C. The digital edition will be updated with it as well as the various corrections that went into the paperback, as usual. The response to the book continues to be polarized, as evidenced by a pair of recent reviews:\nWaste of money\nMostly YouTube comments, childish name calling, full blown narcissism and declaring Tammy ugly. It takes a small, vindictive personality and truckload of resentment to like this.\nThe Truth about Jordan Peterson\nA lot of Jordan Peterson fans are seriously triggered by this book. They insist that Vox Day is jealous. They insist that Vox Day and Milo are “smearing” Jordan Peterson. The problem is that Vox Day has a solid argument and vast amounts of evidence to support it.\nThe argument, as laid out by Milo is a great introduction, is that Jordan Peterson is not what he seems. He is a chameleon of the worst type. Someone who deceitfully lies all the time.\nIf you aren’t satisfied with the examples Milo provides, Vox Day takes over and provides all the evidence you will ever need. One example after the next of Jordan Peterson saying one thing to one audience and then something completely contradictory somewhere else.\nWhich leads to the question of whether Jordan Peterson is a pathological liar. Is Jordan Peterson mentally stable? Could he be the Jim Jones of 2018? Vox Day admits that he doesn’t know himself. It is very brave of Vox Day to write this book. He and Milo have been viciously attacked by Peterson’s rabid followers. But the truth needs to be known.",
  "tags": [
    "Jordanetics"
  ],
  "categories": [],
  "sitemap_lastmod": "2018-11-25T16:30:57+00:00"
}