{
  "url": "https://voxday.net/2018/11/24/building-the-infrastructure/",
  "scraped_at": "2025-12-20T05:18:02.428158",
  "title": "Building the infrastructure",
  "date_display": "November 24, 2018",
  "date_iso": "2018-11-24T19:18:31+00:00",
  "date_from_url": "2018-11-24",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>The new <a href=\"https://arkhavencomics.com/\">Arkhaven Comics site</a> is essentially in Beta mode, but it is now operational, complete with a modestly stocked online <a href=\"https://arkhavencomics.com/shop/\">Shop</a> and an active comics-focused <a href=\"https://arkhavencomics.com/blog/\">Blog</a>, to which a number of comics pros will be contributing on a regular basis, including The Legend Chuck Dixon. Right now, all we’re offering is about 50 Castalia ebooks in EPUB and Kindle formats, plus a pair of Arkhaven comics in CBZ and Kindle formats, since we’re still in the process of extricating most of our various books and comics from Kindle Select. This process will take until mid-February, although we will continue to keep a few books in KU, as well as selected new releases.</p><p>However, we are in the process of listing ALL of our books and comics there, since each product listing provides links to where you can obtain the print editions, audiobooks, and Kindle editions that we can’t offer for sale there yet. They should all be up by the end of the weekend. We hope to eventually integrate the Castalia and Arkhaven Direct stores into the site, so you will be able to purchase both digital and print editions there. And yes, we do have crowdfunding capability built into the site, and we expect to open up the AH:Q campaign again for 28 more days next week.</p><p>Check it out if you’re an Arkhaven fan or backer; we’ve put up the illustrations for a pair of new Alt-Hero Premium covers you won’t have seen before. If you have any suggestions, please feel free to make them. This is very early days, so don’t be surprised if there are a few glitches we’ll have to sort out.</p><p>UPDATE: We took it down for a while to get the spam filters installed. It’s back up now.</p></div>",
  "content_text": "The new\nArkhaven Comics site\nis essentially in Beta mode, but it is now operational, complete with a modestly stocked online\nShop\nand an active comics-focused\nBlog\n, to which a number of comics pros will be contributing on a regular basis, including The Legend Chuck Dixon. Right now, all we’re offering is about 50 Castalia ebooks in EPUB and Kindle formats, plus a pair of Arkhaven comics in CBZ and Kindle formats, since we’re still in the process of extricating most of our various books and comics from Kindle Select. This process will take until mid-February, although we will continue to keep a few books in KU, as well as selected new releases.\nHowever, we are in the process of listing ALL of our books and comics there, since each product listing provides links to where you can obtain the print editions, audiobooks, and Kindle editions that we can’t offer for sale there yet. They should all be up by the end of the weekend. We hope to eventually integrate the Castalia and Arkhaven Direct stores into the site, so you will be able to purchase both digital and print editions there. And yes, we do have crowdfunding capability built into the site, and we expect to open up the AH:Q campaign again for 28 more days next week.\nCheck it out if you’re an Arkhaven fan or backer; we’ve put up the illustrations for a pair of new Alt-Hero Premium covers you won’t have seen before. If you have any suggestions, please feel free to make them. This is very early days, so don’t be surprised if there are a few glitches we’ll have to sort out.\nUPDATE: We took it down for a while to get the spam filters installed. It’s back up now.",
  "tags": [
    "CastaliaHouse"
  ],
  "categories": [],
  "sitemap_lastmod": "2018-11-24T19:18:31+00:00"
}