{
  "url": "https://voxday.net/2018/11/02/darkstream-blue-wave-or-pollster-fiction/",
  "scraped_at": "2025-12-20T05:15:21.092761",
  "title": "Darkstream: Blue Wave or Pollster Fiction?",
  "date_display": "November 2, 2018",
  "date_iso": "2018-11-02T19:30:08+00:00",
  "date_from_url": "2018-11-02",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><div style=\"text-align: center;\"><iframe allow=\"accelerometer; autoplay; encrypted-media; gyroscope; picture-in-picture\" allowfullscreen=\"\" frameborder=\"0\" height=\"284\" src=\"https://www.youtube.com/embed/sg5GhUTTMgM\" width=\"512\"></iframe></div><div style=\"text-align: center;\"></div><div style=\"text-align: left;\">From the transcript of <a href=\"https://youtu.be/sg5GhUTTMgM\">the Darkstream</a>, which I’m glad to report is no longer being linked to strange, creepy kid videos on YouTube.</div><p>A lot  of people who support Trump, a lot of  people who are going to vote Republican, are not going to tell people that. You  know, people are beginning to become more  comfortable and confident about  supporting the God-Emperor because he’s  been so successful – he has been  perfect,  he hasn’t built the wall, yet he hasn’t drained the swamp yet – but the  economy is doing extremely well, he is at  least <i>saying </i>a lot of the right things  in public. When when  people are talking about how, “oh well he  hasn’t done the necessary, hasn’t done this or that,” can you imagine George Bush or George W. Bush actually threatening to  open fire on immigrants? I mean, he has  pushed the Overton Window so far to the  right in with just his rhetoric that a  lot of us don’t even realize this.</p><p>If you look at how much he has  pushed back against the Obama and  liberal Republican alliance it’s really  incredible. In that interview  that I did with Bleeding Cool that was  retroactively vanished, one of the  things the interviewer noted  in an aside that he thought was  interesting was that I was no longer  saying that Donald Trump is the  greatest US president since Calvin  Coolidge, that I was saying that he is the greatest president since Andrew  Jackson. And he is already though there’s  a lot that still needs to be done. There’s no question there is a lot that  needs to be done, but this is a president  who has declared himself to be a  nationalist, this is a president who has  openly declared and correctly declared  that the media is the enemy of the  people, this is a president who has  stated his intention of ending  birthright citizenship, these are all  major major accomplishments in the Presidential sense. He is using what  Teddy Roosevelt called the bully pulpit  with a great degree of effectiveness.</p><p>You  need to keep in mind he doesn’t have a  cooperative House or Senate. Despite the fact that they are  Republican that does not mean that they  are on board with the Trump nationalist  agenda and so you know, it’s really remarkable.</p><p>Someone says “a Native  American that believes Andrew Jackson  was a great president?” He was a great  president. He wasn’t good for the  Cherokees, but you know what, the  Cherokees weren’t his people. I don’t  think that that was the right thing to  do. I certainly don’t think that it was a  good thing to do, but when you put  against that the fact that he eliminated  the first Central Bank of the United  States, there is no  comparison. What he did  for his people was phenomenal. You need  to look at and judge leaders by the correct  criteria, okay? What Winston Churchill did  for the people of Germany was very, very  bad, no question, but we don’t judge  Winston Churchill by what he did for the  people of Germany, we judge him by what  he did for  the people of the United Kingdom of  which he was the prime minister at the  time. Andrew Jackson should not be judged  by what he did to the Cherokee or the  other American Indian tribes, he should  be judged by what he did for his people,  and I think that I think that Donald  Trump is going to be lauded and revered  for what he’s accomplished already, much  less what we hope he will accomplish in  the future.</p></div>",
  "content_text": "From the transcript of\nthe Darkstream\n, which I’m glad to report is no longer being linked to strange, creepy kid videos on YouTube.\nA lot  of people who support Trump, a lot of  people who are going to vote Republican, are not going to tell people that. You  know, people are beginning to become more  comfortable and confident about  supporting the God-Emperor because he’s  been so successful – he has been  perfect,  he hasn’t built the wall, yet he hasn’t drained the swamp yet – but the  economy is doing extremely well, he is at  least\nsaying\na lot of the right things  in public. When when  people are talking about how, “oh well he  hasn’t done the necessary, hasn’t done this or that,” can you imagine George Bush or George W. Bush actually threatening to  open fire on immigrants? I mean, he has  pushed the Overton Window so far to the  right in with just his rhetoric that a  lot of us don’t even realize this.\nIf you look at how much he has  pushed back against the Obama and  liberal Republican alliance it’s really  incredible. In that interview  that I did with Bleeding Cool that was  retroactively vanished, one of the  things the interviewer noted  in an aside that he thought was  interesting was that I was no longer  saying that Donald Trump is the  greatest US president since Calvin  Coolidge, that I was saying that he is the greatest president since Andrew  Jackson. And he is already though there’s  a lot that still needs to be done. There’s no question there is a lot that  needs to be done, but this is a president  who has declared himself to be a  nationalist, this is a president who has  openly declared and correctly declared  that the media is the enemy of the  people, this is a president who has  stated his intention of ending  birthright citizenship, these are all  major major accomplishments in the Presidential sense. He is using what  Teddy Roosevelt called the bully pulpit  with a great degree of effectiveness.\nYou  need to keep in mind he doesn’t have a  cooperative House or Senate. Despite the fact that they are  Republican that does not mean that they  are on board with the Trump nationalist  agenda and so you know, it’s really remarkable.\nSomeone says “a Native  American that believes Andrew Jackson  was a great president?” He was a great  president. He wasn’t good for the  Cherokees, but you know what, the  Cherokees weren’t his people. I don’t  think that that was the right thing to  do. I certainly don’t think that it was a  good thing to do, but when you put  against that the fact that he eliminated  the first Central Bank of the United  States, there is no  comparison. What he did  for his people was phenomenal. You need  to look at and judge leaders by the correct  criteria, okay? What Winston Churchill did  for the people of Germany was very, very  bad, no question, but we don’t judge  Winston Churchill by what he did for the  people of Germany, we judge him by what  he did for  the people of the United Kingdom of  which he was the prime minister at the  time. Andrew Jackson should not be judged  by what he did to the Cherokee or the  other American Indian tribes, he should  be judged by what he did for his people,  and I think that I think that Donald  Trump is going to be lauded and revered  for what he’s accomplished already, much  less what we hope he will accomplish in  the future.",
  "tags": [
    "Darkstream"
  ],
  "categories": [],
  "sitemap_lastmod": "2018-11-02T19:30:08+00:00"
}