{
  "url": "https://voxday.net/2018/11/22/darkstream-the-mirror-con/",
  "scraped_at": "2025-12-20T05:17:45.956972",
  "title": "Darkstream: The Mirror Con",
  "date_display": "November 22, 2018",
  "date_iso": "2018-11-22T16:00:09+00:00",
  "date_from_url": "2018-11-22",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><div style=\"text-align: center;\"><iframe allow=\"accelerometer; autoplay; encrypted-media; gyroscope; picture-in-picture\" allowfullscreen=\"\" frameborder=\"0\" height=\"284\" src=\"https://www.youtube.com/embed/wHK4LZvjvuw\" width=\"512\"></iframe></div><p>From the transcript of <a href=\"https://youtu.be/wHK4LZvjvuw\">the Darkstream</a>.</p><p>What Peterson is doing when he’s talking to Rogan, and I suspect that what he does on a regular basis, is what a lot of fake psychics do. He’s doing a cold reading, he is utilizing the clues that he’s picking up in order to make you think that he knows more than he does.</p><p>It is a guess that is posing as  knowledge and you can get away with it, if you’re someone like Jordan Peterson  you can get away with it a lot. One of the ways that you can  tell that someone is doing this is that  they’re very intent, they’re <i>very </i>intent on the other person. They’re listening very hard to the other  person, but they’re not actually  listening in order to understand what  the person is saying, they’re listening  for key words that they can target off and use. They’re looking for anchor points that they can  take from the other person and use to  launch to launch their own  statement and use it in order to  convince the other person of whatever it  is they want to convince him.</p><p>So listen  to this and keep in mind  Jordan Peterson has a reason for this  whole cockamamie story. You know, people got carried away, they got  they got focused on the whole Cider of Doom thing, right, because this was  such an epic disaster that it actually did manage to  kind of conceal what Peterson was hoping  to conceal. See, what he was hoping to  achieve when he went on and talked to  Joe Rogan about his  terrible experience with cider was that he was  trying to produce an excuse to cover up  his disastrous performance with Sam  Harris because that was one of the first times  that he was unmasked.</p><p>You need to  understand Jordan Peterson is <i>exceptionally </i>dishonest. Jordan Peterson  is one of the most dishonest people in  the public eye other than Hillary  Clinton. His level of dishonesty can only  be described as Clintonian.</p></div>",
  "content_text": "From the transcript of\nthe Darkstream\n.\nWhat Peterson is doing when he’s talking to Rogan, and I suspect that what he does on a regular basis, is what a lot of fake psychics do. He’s doing a cold reading, he is utilizing the clues that he’s picking up in order to make you think that he knows more than he does.\nIt is a guess that is posing as  knowledge and you can get away with it, if you’re someone like Jordan Peterson  you can get away with it a lot. One of the ways that you can  tell that someone is doing this is that  they’re very intent, they’re\nvery\nintent on the other person. They’re listening very hard to the other  person, but they’re not actually  listening in order to understand what  the person is saying, they’re listening  for key words that they can target off and use. They’re looking for anchor points that they can  take from the other person and use to  launch to launch their own  statement and use it in order to  convince the other person of whatever it  is they want to convince him.\nSo listen  to this and keep in mind  Jordan Peterson has a reason for this  whole cockamamie story. You know, people got carried away, they got  they got focused on the whole Cider of Doom thing, right, because this was  such an epic disaster that it actually did manage to  kind of conceal what Peterson was hoping  to conceal. See, what he was hoping to  achieve when he went on and talked to  Joe Rogan about his  terrible experience with cider was that he was  trying to produce an excuse to cover up  his disastrous performance with Sam  Harris because that was one of the first times  that he was unmasked.\nYou need to  understand Jordan Peterson is\nexceptionally\ndishonest. Jordan Peterson  is one of the most dishonest people in  the public eye other than Hillary  Clinton. His level of dishonesty can only  be described as Clintonian.",
  "tags": [
    "rhetoric"
  ],
  "categories": [],
  "sitemap_lastmod": "2018-11-22T16:00:09+00:00"
}