{
  "url": "https://voxday.net/2018/11/07/darkstream-2018-midterms-live/",
  "scraped_at": "2025-12-20T05:15:54.418156",
  "title": "Darkstream: 2018 midterms live",
  "date_display": "November 7, 2018",
  "date_iso": "2018-11-07T15:13:06+00:00",
  "date_from_url": "2018-11-07",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><div style=\"text-align: center;\"><iframe allow=\"accelerometer; autoplay; encrypted-media; gyroscope; picture-in-picture\" allowfullscreen=\"\" frameborder=\"0\" height=\"284\" src=\"https://www.youtube.com/embed/L69NZ7CB0LI\" width=\"512\"></iframe></div><p><i>Last night’s <a href=\"https://youtu.be/L69NZ7CB0LI\">extended Darkstream on the 2018 midterms</a>, complete with my failed call about the Republicans successfully holding the House. Everyone enjoyed the livestream at the time, although there is apparently an amount of subsequent irritation about my having been proved incorrect. All I can say is that I legitimately did think at that time that Republicans had done what they needed to do in the early key races, and that their success in the East would carry over to the Midwest and the West. Obviously that did not happen. </i></p><p>Lucius Cincinnatus asks why won’t Republicans go after the white vote? Because there are way too many civic nationalists in the Republican Party. They pride themselves on considering themselves color-blind, it’s integral to how they see themselves, and so it’s very, very difficult for them to separate the macro from the micro. It’s very difficult for them to think about the long-term implications of their position. Essentially you’re trying to force people to think about the future of their children rather than how they feel about themselves.</p><p>It’s very, very difficult for a civic nationalist to accept the reality of identity politics, especially when they have been taught for generations that such things are bad, and so you have to be very patient with civic nationalists and understand that it’s usually not coming from a place of hypocrisy, it’s not<br>usually coming from a place of malice or anything, it’s coming from their good intentions and their<br>preference for thinking highly of themselves for assuming the best of others.</br></br></p><p>People have a problem  differentiating between individuals and  groups? Well, some people do. The  Chinese do not have that problem. The  Jews do not have that problem. Most  people don’t have that problem. Europeans have that problem because they  tend to be the most individualistic  people on the planet, and that was a big  benefit 200 or 300 years ago, but  now that travel is so much easier it is no longer a benefit of any kind. That’s where you see the the  problem that  Europeans have in competing with other  peoples. You see this on the Right as well. Look at all the people on the Right  who simply refuse to cooperate.</p><p>Look  who came on the Darkstream the day  that IndieGoGo cancelled Alt-Hero. You know who suddenly showed up, and was  suddenly, “hey, we all have to stick  together.” It was 2VS, old Two-Face Van Sciver, but look at what  happened the moment that he called IndieGoGo and talked to them, and they  reassured him that they weren’t  going to treat him the way that they  treated us. Now,  I personally wouldn’t put any faith  in people who behaved like that, but he’s  dumb enough to do so. So people only join forces, you know individualistic people only  join forces so long as they feel an  active and imminent sense of threat.</p><p>Until  most people of European descent feel  that way, they will not change their  behavior.</p></div>",
  "content_text": "Last night’s\nextended Darkstream on the 2018 midterms\n, complete with my failed call about the Republicans successfully holding the House. Everyone enjoyed the livestream at the time, although there is apparently an amount of subsequent irritation about my having been proved incorrect. All I can say is that I legitimately did think at that time that Republicans had done what they needed to do in the early key races, and that their success in the East would carry over to the Midwest and the West. Obviously that did not happen.\nLucius Cincinnatus asks why won’t Republicans go after the white vote? Because there are way too many civic nationalists in the Republican Party. They pride themselves on considering themselves color-blind, it’s integral to how they see themselves, and so it’s very, very difficult for them to separate the macro from the micro. It’s very difficult for them to think about the long-term implications of their position. Essentially you’re trying to force people to think about the future of their children rather than how they feel about themselves.\nIt’s very, very difficult for a civic nationalist to accept the reality of identity politics, especially when they have been taught for generations that such things are bad, and so you have to be very patient with civic nationalists and understand that it’s usually not coming from a place of hypocrisy, it’s not\nusually coming from a place of malice or anything, it’s coming from their good intentions and their\npreference for thinking highly of themselves for assuming the best of others.\nPeople have a problem  differentiating between individuals and  groups? Well, some people do. The  Chinese do not have that problem. The  Jews do not have that problem. Most  people don’t have that problem. Europeans have that problem because they  tend to be the most individualistic  people on the planet, and that was a big  benefit 200 or 300 years ago, but  now that travel is so much easier it is no longer a benefit of any kind. That’s where you see the the  problem that  Europeans have in competing with other  peoples. You see this on the Right as well. Look at all the people on the Right  who simply refuse to cooperate.\nLook  who came on the Darkstream the day  that IndieGoGo cancelled Alt-Hero. You know who suddenly showed up, and was  suddenly, “hey, we all have to stick  together.” It was 2VS, old Two-Face Van Sciver, but look at what  happened the moment that he called IndieGoGo and talked to them, and they  reassured him that they weren’t  going to treat him the way that they  treated us. Now,  I personally wouldn’t put any faith  in people who behaved like that, but he’s  dumb enough to do so. So people only join forces, you know individualistic people only  join forces so long as they feel an  active and imminent sense of threat.\nUntil  most people of European descent feel  that way, they will not change their  behavior.",
  "tags": [
    "Darkstream"
  ],
  "categories": [],
  "sitemap_lastmod": "2018-11-07T15:13:06+00:00"
}