{
  "url": "https://voxday.net/2018/11/13/darkstream-2vs-betrays-comicsgate/",
  "scraped_at": "2025-12-20T05:16:37.428590",
  "title": "Darkstream: 2VS betrays ComicsGate",
  "date_display": "November 13, 2018",
  "date_iso": "2018-11-13T15:42:08+00:00",
  "date_from_url": "2018-11-13",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><div style=\"text-align: center;\"><iframe allow=\"accelerometer; autoplay; encrypted-media; gyroscope; picture-in-picture\" allowfullscreen=\"\" frameborder=\"0\" height=\"284\" src=\"https://www.youtube.com/embed/PzQOQJxkNnM\" width=\"512\"></iframe></div><div style=\"text-align: center;\"></div><div style=\"text-align: left;\"><a href=\"https://youtu.be/PzQOQJxkNnM\">This Darkstream</a> is already demonstrating the accuracy of the “2VS” appellation on the meta level. It seems Ethan van Sciver can’t even maintain a consistent position for 48 hours.</div><p><b>Unranked Chevron: </b>Apparently he’s taken the hashtag back up.﻿</p><p><b>Vox Day: </b>And they wonder why we call him Two-Face….﻿</p><p><b>crazy chameleon:</b> Does he multiple personality disorder?  This is too absurd to believe﻿.</p><p>Another comment by Unranked Chevron tends to indicate that despite my repeated explanations, some ComicsGaters still don’t entirely grasp what was going on with the entire affair or why it happened. So, I will again attempt to clarify the matter.</p><blockquote><p><b>Unranked Chevron: </b>It’s not too much of an assumption to say that someone who makes a logo called ‘comicsgate comics’ wants to take over comicsgate. Everybody in the industry was going to know that ‘comicsgate comics’ was owned by Vox Day, and that was likely going to limit their future prospects. Just calling it Dark Legion or something from the start and being very sly what it was actually used for would have avoided that whole fiasco.﻿</p><p><b>Vox Day:</b> I don’t think you understood the sequence of events. Our imprint for other creators <i>was </i>called Dark Legion from the start. Our imprint is Arkhaven. We had already published 5 comics under the Dark Legion imprint: Chicago Typewriter and the Rebel Dead Revenge series.We continue to publish comics under that imprint.</p><p>The whole point of creating a ComicsGate imprint, complete with logo, was to permit ComicsGate creators to use our publishing infrastructure without forcing them to publicly accept our brand. It was about THEM publishing comics with the ComicsGate brand, not us doing so. Now, if you want to use our infrastructure, you will either accept our brand or you won’t get access to it.</p><p>All anyone ever had to do to know my intentions was ask me. “Vox, do you want to take over ComicsGate?” To which my answer has always been: “No, I neither want it nor need it.”</p><p>Instead, many ComicsGaters chose to believe 2VS’s lies, sperged out, and torched their chance to have a public brand that many of them are now saying would be desirable.﻿</p></blockquote><p>By the end of the year, Arkhaven will have at least begun addressing every aspect of the modern comics business, from a crowdfunding engine to film and television production to merchandise to a comics-focused blog and forums to retail sales of our own comics and others. And, of course, game development. As I pointed out last night, <a href=\"https://www.aerbook.com/store/castalia/Bestselling_Graphic_Novels/175210\">we already have the ability</a> to deliver comics readers in the USA all of the graphics novels from Marvel, DC, Image, and anyone else they want, and we will provide the same to readers in Europe, the UK, and Australia next year. Just tell us which ones you want to be able to buy at discounts that range from 15-25 percent.</p><p>ComicsGate can work with and support Arkhaven, they can ignore us, or they can follow the SJW-lite lead of 2VS and continue to publicly attack us. While I would prefer for ComicsGate and other independents to work with us, to utilize the infrastructure we are building, and to support our efforts, it really makes very little difference to me or to the long-term success of our plans. Because, as it presently stands, we are already well ahead of the rosiest scenario I had ever envisioned at the start. Arkhaven is already selling <i>tens of thousands</i> of comics – unit sales, not dollars – and that is not counting our record-setting crowdfunding campaigns. And we have published more comics, and more pages of comics, than all of ComicsGate and ex-ComicsGate combined.</p><p>Now, I will admit that ComicsGate never asked for my assistance in any way. That was my mistake. That was my error. And I have learned my lesson. In the future I will refrain from offering unrequested support for anyone in the comics industry, and even if requested I will not call upon the Arkhaven community or allow the Arkhaven infrastructure to be utilized to support anyone who is not already a part of the Arkhaven team. We have more than enough to do without getting entangled in the affairs of others. As for those who believe that working with me is “likely going to limit their future prospects,” perhaps they should consider the possibility that they have it entirely backwards.</p><p>UPDATE: On the subject of Arkhaven comics, <i>Bounding Into Comics</i> has <a href=\"https://boundingintocomics.com/2018/11/13/exclusive-right-ho-jeeves-6-preview/\">a preview of some of the pretty art</a> from <i>Right Ho, Jeeves #6</i>.</p><blockquote class=\"tr_bq\"><p>Chuck Dixon and Gary Kwapisz’s <i>Right Ho, Jeeves</i> comic book adaptation of P.G. Wodehouse’s novel will be wrapping up with <i>Right Ho, Jeeves #6</i>…. Following the release of the digital edition of <i>Right Ho, Jeeves #6</i> there will be a 10×7 omnibus edition that will collect all six issues of the series.</p></blockquote></div>",
  "content_text": "This Darkstream\nis already demonstrating the accuracy of the “2VS” appellation on the meta level. It seems Ethan van Sciver can’t even maintain a consistent position for 48 hours.\nUnranked Chevron:\nApparently he’s taken the hashtag back up.﻿\nVox Day:\nAnd they wonder why we call him Two-Face….﻿\ncrazy chameleon:\nDoes he multiple personality disorder?  This is too absurd to believe﻿.\nAnother comment by Unranked Chevron tends to indicate that despite my repeated explanations, some ComicsGaters still don’t entirely grasp what was going on with the entire affair or why it happened. So, I will again attempt to clarify the matter.\nUnranked Chevron:\nIt’s not too much of an assumption to say that someone who makes a logo called ‘comicsgate comics’ wants to take over comicsgate. Everybody in the industry was going to know that ‘comicsgate comics’ was owned by Vox Day, and that was likely going to limit their future prospects. Just calling it Dark Legion or something from the start and being very sly what it was actually used for would have avoided that whole fiasco.﻿\nVox Day:\nI don’t think you understood the sequence of events. Our imprint for other creators\nwas\ncalled Dark Legion from the start. Our imprint is Arkhaven. We had already published 5 comics under the Dark Legion imprint: Chicago Typewriter and the Rebel Dead Revenge series.We continue to publish comics under that imprint.\nThe whole point of creating a ComicsGate imprint, complete with logo, was to permit ComicsGate creators to use our publishing infrastructure without forcing them to publicly accept our brand. It was about THEM publishing comics with the ComicsGate brand, not us doing so. Now, if you want to use our infrastructure, you will either accept our brand or you won’t get access to it.\nAll anyone ever had to do to know my intentions was ask me. “Vox, do you want to take over ComicsGate?” To which my answer has always been: “No, I neither want it nor need it.”\nInstead, many ComicsGaters chose to believe 2VS’s lies, sperged out, and torched their chance to have a public brand that many of them are now saying would be desirable.﻿\nBy the end of the year, Arkhaven will have at least begun addressing every aspect of the modern comics business, from a crowdfunding engine to film and television production to merchandise to a comics-focused blog and forums to retail sales of our own comics and others. And, of course, game development. As I pointed out last night,\nwe already have the ability\nto deliver comics readers in the USA all of the graphics novels from Marvel, DC, Image, and anyone else they want, and we will provide the same to readers in Europe, the UK, and Australia next year. Just tell us which ones you want to be able to buy at discounts that range from 15-25 percent.\nComicsGate can work with and support Arkhaven, they can ignore us, or they can follow the SJW-lite lead of 2VS and continue to publicly attack us. While I would prefer for ComicsGate and other independents to work with us, to utilize the infrastructure we are building, and to support our efforts, it really makes very little difference to me or to the long-term success of our plans. Because, as it presently stands, we are already well ahead of the rosiest scenario I had ever envisioned at the start. Arkhaven is already selling\ntens of thousands\nof comics – unit sales, not dollars – and that is not counting our record-setting crowdfunding campaigns. And we have published more comics, and more pages of comics, than all of ComicsGate and ex-ComicsGate combined.\nNow, I will admit that ComicsGate never asked for my assistance in any way. That was my mistake. That was my error. And I have learned my lesson. In the future I will refrain from offering unrequested support for anyone in the comics industry, and even if requested I will not call upon the Arkhaven community or allow the Arkhaven infrastructure to be utilized to support anyone who is not already a part of the Arkhaven team. We have more than enough to do without getting entangled in the affairs of others. As for those who believe that working with me is “likely going to limit their future prospects,” perhaps they should consider the possibility that they have it entirely backwards.\nUPDATE: On the subject of Arkhaven comics,\nBounding Into Comics\nhas\na preview of some of the pretty art\nfrom\nRight Ho, Jeeves #6\n.\nChuck Dixon and Gary Kwapisz’s\nRight Ho, Jeeves\ncomic book adaptation of P.G. Wodehouse’s novel will be wrapping up with\nRight Ho, Jeeves #6\n…. Following the release of the digital edition of\nRight Ho, Jeeves #6\nthere will be a 10×7 omnibus edition that will collect all six issues of the series.",
  "tags": [
    "Darkstream"
  ],
  "categories": [],
  "sitemap_lastmod": "2018-11-13T15:42:08+00:00"
}