{
  "url": "https://voxday.net/2018/11/04/free-speech-fail/",
  "scraped_at": "2025-12-20T05:15:28.100150",
  "title": "Free speech fail",
  "date_display": "November 4, 2018",
  "date_iso": "2018-11-04T12:51:08+00:00",
  "date_from_url": "2018-11-04",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>What we have here is a complete failure to anticipate:</p><blockquote class=\"tr_bq\"><p>When Gab.com goes back online this weekend there will inevitably be a flood of psyop accounts created to drive division and break our guidelines. We will need your help more than ever to spot them and take action.</p></blockquote><p>It only took Andrew Torba 14 months to come around to the very position for which he attempted to publicly mock me and for which he completely sold out Spacebunny, to whom he had appealed in the first place in order to obtain my help. Why do you think I subsequently concluded he was not ready for prime time and refused to have anything to do with him or his site? I’m not pretending that I don’t despise the guy, of course I do, but when have my analyses of people or situations <i>ever </i>been based on my feelings about them?</p><p>There are few things I find more stupidly tedious than clueless people babbling about “not punching right” or “we’re all on the same side”. No. We’re not. There are more than two sides. That’s binary thinking. And believing and supporting everyone who says they are opposed to the most extreme Left or are capable of mouthing the right words at the right time in a public situation is exactly how the Right wound up following opinion leaders such as William F. Buckley, Bill Kristol, Glenn Beck, and Ben Shapiro, and enriching shameless grifters like Jordan Peterson and Candace Owens. It’s how the Right always end up with sell-outs, surrender monkeys, cucks, cons, and outright liberals running the Conservative Establishment.</p><p>Character matters. Integrity matters. A willingness to speak the truth matters. Consistency matters. Loyalty matters. A devotion to a consciously anti-Christian tactic as a principle, especially a false devotion to a fake principle one is not even willing to stand by under pressure, is simply no basis for trusting someone, following someone, or even deeming someone to be on our side.</p><p>In other platform-related news, if you subscribe to the Darkstream, I would encourage you to follow <a href=\"https://www.stream.me/voxday\">my new account on Stream.me</a> for a livestreaming alternative to YouTube. There are some minor issues to resolve; my new router appears to be causing occasional interruptions in the simulstreams and I can’t see the Stream.me comments yet, but we’ll work them out.</p></div>",
  "content_text": "What we have here is a complete failure to anticipate:\nWhen Gab.com goes back online this weekend there will inevitably be a flood of psyop accounts created to drive division and break our guidelines. We will need your help more than ever to spot them and take action.\nIt only took Andrew Torba 14 months to come around to the very position for which he attempted to publicly mock me and for which he completely sold out Spacebunny, to whom he had appealed in the first place in order to obtain my help. Why do you think I subsequently concluded he was not ready for prime time and refused to have anything to do with him or his site? I’m not pretending that I don’t despise the guy, of course I do, but when have my analyses of people or situations\never\nbeen based on my feelings about them?\nThere are few things I find more stupidly tedious than clueless people babbling about “not punching right” or “we’re all on the same side”. No. We’re not. There are more than two sides. That’s binary thinking. And believing and supporting everyone who says they are opposed to the most extreme Left or are capable of mouthing the right words at the right time in a public situation is exactly how the Right wound up following opinion leaders such as William F. Buckley, Bill Kristol, Glenn Beck, and Ben Shapiro, and enriching shameless grifters like Jordan Peterson and Candace Owens. It’s how the Right always end up with sell-outs, surrender monkeys, cucks, cons, and outright liberals running the Conservative Establishment.\nCharacter matters. Integrity matters. A willingness to speak the truth matters. Consistency matters. Loyalty matters. A devotion to a consciously anti-Christian tactic as a principle, especially a false devotion to a fake principle one is not even willing to stand by under pressure, is simply no basis for trusting someone, following someone, or even deeming someone to be on our side.\nIn other platform-related news, if you subscribe to the Darkstream, I would encourage you to follow\nmy new account on Stream.me\nfor a livestreaming alternative to YouTube. There are some minor issues to resolve; my new router appears to be causing occasional interruptions in the simulstreams and I can’t see the Stream.me comments yet, but we’ll work them out.",
  "tags": [
    "technology"
  ],
  "categories": [],
  "sitemap_lastmod": "2018-11-04T12:51:08+00:00"
}