{
  "url": "https://voxday.net/2018/11/05/gauging-interest/",
  "scraped_at": "2025-12-20T05:15:34.326809",
  "title": "Gauging interest",
  "date_display": "November 5, 2018",
  "date_iso": "2018-11-05T02:13:19+00:00",
  "date_from_url": "2018-11-05",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>So, a number of you have asked about subscriptions and so forth. We’re giving some serious thought to creating a Castalia/Arkhaven/Dark Legion Unlimited program that would provide complete access to all our combined digital editions for one year.</p><p>That means you would get all the new digital releases to come out that year, plus the ability to download whatever you wanted from the back catalog. The price would be $120/year, but we’d offer a discount to $99 for the first two weeks that we introduced it. All of the digital editions would still be available on Amazon and elsewhere, but none of it would be available on KU anymore.</p><p>If you’re an author, please don’t ask me how it would work on that end yet because we don’t know if there is even sufficient demand to justify any such program. Rest assured that we’ll take care of you fairly, and we definitely have <u>not</u> made any decision about doing this yet. Anyhow, if you are a regular Castalia or Arkhaven buyer, please share your thoughts, pro or con.</p><p>We realize this would probably cannibalize our digital edition backers for future crowdfunding campaigns, so there has to be enough interest to justify losing that. It’s always easier not to do anything, but we think this may be the right way to go in the future, if not necessarily now.</p></div>",
  "content_text": "So, a number of you have asked about subscriptions and so forth. We’re giving some serious thought to creating a Castalia/Arkhaven/Dark Legion Unlimited program that would provide complete access to all our combined digital editions for one year.\nThat means you would get all the new digital releases to come out that year, plus the ability to download whatever you wanted from the back catalog. The price would be $120/year, but we’d offer a discount to $99 for the first two weeks that we introduced it. All of the digital editions would still be available on Amazon and elsewhere, but none of it would be available on KU anymore.\nIf you’re an author, please don’t ask me how it would work on that end yet because we don’t know if there is even sufficient demand to justify any such program. Rest assured that we’ll take care of you fairly, and we definitely have\nnot\nmade any decision about doing this yet. Anyhow, if you are a regular Castalia or Arkhaven buyer, please share your thoughts, pro or con.\nWe realize this would probably cannibalize our digital edition backers for future crowdfunding campaigns, so there has to be enough interest to justify losing that. It’s always easier not to do anything, but we think this may be the right way to go in the future, if not necessarily now.",
  "tags": [
    "CastaliaHouse"
  ],
  "categories": [],
  "sitemap_lastmod": "2018-11-05T02:13:19+00:00"
}