{
  "url": "https://voxday.net/2018/11/19/jordanetics-the-1-bestseller-in-political-philosophy/",
  "scraped_at": "2025-12-20T05:17:26.013167",
  "title": "JORDANETICS: the #1 bestseller in Political Philosophy",
  "date_display": "November 19, 2018",
  "date_iso": "2018-11-19T20:28:53+00:00",
  "date_from_url": "2018-11-19",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p><a href=\"https://www.amazon.com/dp/B07JY9XV38/ref=as_li_ss_il?keywords=B07JY9XV38&amp;qid=1540655613&amp;s=Kindle+Store&amp;sr=1-1&amp;ref=sr_1_1&amp;linkCode=li3&amp;tag=voxpop06-20&amp;linkId=c452f21918d68c57bf20cbaa97a8340d\" rel=\"noopener\" style=\"clear: left; float: left; margin-bottom: 1em; margin-right: 1em;\" target=\"_blank\"><noscript><img border=\"0\" decoding=\"async\" src=\"//ws-na.amazon-adsystem.com/widgets/q?_encoding=UTF8&amp;ASIN=B07JY9XV38&amp;Format=_SL250_&amp;ID=AsinImage&amp;MarketPlace=US&amp;ServiceVersion=20070822&amp;WS=1&amp;tag=voxpop06-20\"/></noscript><img border=\"0\" class=\"lazyload\" data-src=\"//ws-na.amazon-adsystem.com/widgets/q?_encoding=UTF8&amp;ASIN=B07JY9XV38&amp;Format=_SL250_&amp;ID=AsinImage&amp;MarketPlace=US&amp;ServiceVersion=20070822&amp;WS=1&amp;tag=voxpop06-20\" decoding=\"async\" src=\"data:image/svg+xml,%3Csvg%20xmlns=%22http://www.w3.org/2000/svg%22%20viewBox=%220%200%20210%20140%22%3E%3C/svg%3E\"/></a><br><b><i><a href=\"https://amzn.to/2O8hirX\">JORDANETICS: A Journey Into the Mind of Humanity’s Greatest Thinker</a></i> is now available for Kindle and Kindle Unlimited.</b></br></p><p>Jordan Peterson is believed by many to be the greatest thinker that humanity has ever known. He is Father Figure, Philosopher-King, and Prophet to the millions of young men who are his most fervent fans. He is the central figure of the Intellectual Dark Web, an academic superstar, and an unparalleled media phenomenon who has shattered all conceptions of what it means to be modern celebrity in the Internet Age.</p><p>He has, by his own admission, thought thoughts that no one has ever thought before. He has dreamed dreams that no one has ever dared to dream before.</p><p>But Jordan Peterson is also a narcissist, a charlatan, and an intellectual con man who doesn’t even bother to learn much about the subjects upon which he lectures. He is a defender of free speech who silences other speakers, a fearless free-thinker who runs away from debate, difficult questions, and controversial issues, a philosopher who rejects the conventional definition of truth, and a learned professor who has failed to read most of the great classics of the Western canon. He is, in short, a shameless and unrepentant fraud.</p><p>But is Jordan Peterson more than a mere fraud? Is he something more sinister, more unbalanced, and even more dangerous? In <i><b><a href=\"https://amzn.to/2O8hirX\">JORDANETICS: A Journey Into the Mind of Humanity’s Greatest Thinker</a></b></i>, political philosopher Vox Day delves deeply into the core philosophy that Jordan Peterson advocates in both his written works and his video lectures. In doing so, Day methodically builds a shocking case that will convince even the most skeptical Jordan Peterson supporter to reconsider both the man and his teachings.</p><p>For a video preview, <a href=\"https://www.youtube.com/watch?v=vvPYd-jrhuM\">watch the Darkstream</a>.</p><p><b>From the Introduction:</b></p><p><a name=\"more\"></a>There are no shortage of intellectual con men out there and I don’t consider myself to be the Truth Police. Having confirmed for myself that Jordan Peterson was little more than a Canadian version of Deepak Chopra or L. Ron Hubbard, I was perfectly ready to return to completely ignoring him, but I was unable to do so thanks to his fans. Instead accepting my critique, or even going over the various points in detail and attempting to rebut them, they attacked my intellect, my integrity, and my motivations. They accused me of jealousy, they accused me of envy, and they accused me of dishonesty, all in defense of a man who was observably lacking in any intellectual integrity at all! It was exceedingly bizarre, especially when I had done nothing more than point out a few of the obvious mistakes the man had made.</p><p>So, I decided to begin looking more deeply into this popular professor who was being so widely hailed as a formidable thinker, a thoughtful philosopher, a courageous defender of free speech, and a champion of young men. But almost immediately, I discovered that his reputation was at variance with his actions, as in the case of his deeply ironic decision to ban investigative journalist Faith Goldy from participating in an August 2017 event at Ryerson University called “The Stifling of Free Speech on University Campuses”. The event was cancelled, and with Peterson’s approval, Goldy was barred from participating in the rescheduled event.</p><p>When he was subsequently asked about his decision in public, Peterson responded with what I eventually came to recognize was his characteristic bafflegarble, the word-smog he habitually utilizes to conceal his actual meaning.</p><blockquote><p>QUESTION: I understand that Faith Goldy was removed from the original August panel because of her podcast with the controversial Daily Stormer after Charlottesville…. This strategy appears to parallel the SJWs, who wish to deny platforms to conservative speakers. I want to understand why Faithy Goldy was removed from the event simply for associating with identitarians, and if each of the panelists agree with that decision.</p><p>JORDAN PETERSON: That’s an excellent question. So, the first thing I should say is that it’s not like we’re unaware of the irony. Number one. Ryerson cancelled a panel about the cancellation of panels about free speech. That’s irony number one. And then irony number two was the panelists removed a speaker for arguably engaging in the act of free speech. Okay, we got that, believe me.</p><p>All right, so why did we come to this decision? I sat down personally—the other people can say what they have to say—I sat down with my son and we went through Faith’s interview. I know Faith, I don’t believe that she is a reprehensible person. I think that Charlottesville was very shocking to her and I think that she put herself in a very difficult position. And I think some of that was brave, that she went down there to cover it.</p><p>However, I listened very carefully to her podcast, the one that got her in trouble. And my sense was that she wasn’t, she didn’t, she was associating with people whose views she should have questioned. It was her journalistic, um, responsibility to question them. She had to ask at least one hard question. At least one. Three would have been better. You know, and I understand she had to toe a careful line. She was on the podcast, they had invited her on, it’s much more difficult than you might think when you’re facing people, even when you don’t believe them, to be rude enough to challenge them, right? That’s not so easy, especially if you’re an agreeable person and she is a rather agreeable person.</p><p>But I believe she, she failed in her journalistic responsibility. And as a consequence of that, she became too hot a property for us. And not just for us. And, well, that was, that was the reason for the decision. That was, that was my reasoning.</p></blockquote><p>Now, this was manifestly not the correct behavior of a highly principled man or even a reasonably honest one. Jordan Peterson did something he clearly knew to be wrong, he did something he clearly knew to be hypocritical, but instead of simply owning up to his obvious failure when called on it in public, he attempted to concoct a ridiculous ex post facto excuse to justify it. Again.</p><p>He had to know that he was going to have to face the question sooner or later. He even appears to have prepared for it, and yet this response was the best that he could manage. If you watch the video, you can even see that Jordan Peterson <i>has, he has</i>, a reliable tell that warns the viewer when he’s about to say something that he knows is not true. He also betrays another tell that indicates when he is going to <i>very carefully</i> attempt to conceal the weakness of one of his assertions or conclusions.</p><p>Just watch for the repetitions and the adverbs. Once you learn to recognize them, you can identify when Jordan Peterson is trying to pull a fast one on his audience even when you don’t know what he’s talking about.</p><p>And the obvious question Peterson’s response raises is this: according to what theory of human rights or journalism does one’s own right to free speech rely upon one’s correct performance of nonexistent journalistic responsibilities?</p><p>There is no such theory. It’s a nonsensical assertion. It’s classic Petersonian bafflegarble. But it requires a high level of mental focus to penetrate the fog of Peterson’s word-salad and see what he is literally saying.</p><p>After twice seeing Peterson’s shameless dishonesty in action, I decided that it was time to delve deeper into the man’s actual work. Being a writer myself, I was aware that men express themselves differently in different media. Many eloquent speakers reveal themselves to be superficial thinkers in writing, and no few writers—myself included—are unable to express their genuinely profound thoughts in a facile manner in front of a microphone or a camera. Perhaps Peterson was much better in print than he was on video or on the Internet; after all, he was the bestselling author on the planet at the time.</p><p>So, I read his bestseller, <i>12 Rules for Life: An Antidote to Chaos</i>. I read his would-be magnum opus, <i>Maps of Meaning: The Architecture of Belief</i>. I even read his contribution to the UN Secretary General’s High Level Panel on Sustainable Development of which he was a member, <i>Resilient People, Resilient Planet: A future worth choosing</i>.</p><p>And this book is the result of what I learned from reading the three published works of Jordan Peterson.</p><p>A word of warning. This book is necessarily more than a little esoteric. It references a number of works with which you may be unfamiliar, and draws obscure connections you may not immediately recognize or that you may be initially reluctant to acknowledge, especially if you are a Jordan Peterson fan.</p><p>But you can be sure of one thing. Unlike Jordan Peterson, I am not attempting to deceive, confuse, dazzle, or baffle you. Unlike Jordan Peterson, I am not attempting to change your perspective or your philosophy. Unlike Jordan Peterson, the logic I present is clear and straightforward. And unlike Jordan Peterson, I do not owe my allegiance to anything but the objective truth, as that concept has been defined in the dictionary and understood by Man since the beginning of time.</p><p>You need not take my word for any of this. Everything I am writing here is based on material evidence that you can obtain, examine, and analyze for yourself. So clear your mind, set aside your assumptions and preconceptions, and prepare yourself for a journey into the mind of one of the most shameless intellectual charlatans in the history of Man.</p><p>UPDATE: Also #1 in Kindle Store  &gt; Nonfiction &gt; Self-Help &gt; Spiritual</p></div>",
  "content_text": "JORDANETICS: A Journey Into the Mind of Humanity’s Greatest Thinker\nis now available for Kindle and Kindle Unlimited.\nJordan Peterson is believed by many to be the greatest thinker that humanity has ever known. He is Father Figure, Philosopher-King, and Prophet to the millions of young men who are his most fervent fans. He is the central figure of the Intellectual Dark Web, an academic superstar, and an unparalleled media phenomenon who has shattered all conceptions of what it means to be modern celebrity in the Internet Age.\nHe has, by his own admission, thought thoughts that no one has ever thought before. He has dreamed dreams that no one has ever dared to dream before.\nBut Jordan Peterson is also a narcissist, a charlatan, and an intellectual con man who doesn’t even bother to learn much about the subjects upon which he lectures. He is a defender of free speech who silences other speakers, a fearless free-thinker who runs away from debate, difficult questions, and controversial issues, a philosopher who rejects the conventional definition of truth, and a learned professor who has failed to read most of the great classics of the Western canon. He is, in short, a shameless and unrepentant fraud.\nBut is Jordan Peterson more than a mere fraud? Is he something more sinister, more unbalanced, and even more dangerous? In\nJORDANETICS: A Journey Into the Mind of Humanity’s Greatest Thinker\n, political philosopher Vox Day delves deeply into the core philosophy that Jordan Peterson advocates in both his written works and his video lectures. In doing so, Day methodically builds a shocking case that will convince even the most skeptical Jordan Peterson supporter to reconsider both the man and his teachings.\nFor a video preview,\nwatch the Darkstream\n.\nFrom the Introduction:\nThere are no shortage of intellectual con men out there and I don’t consider myself to be the Truth Police. Having confirmed for myself that Jordan Peterson was little more than a Canadian version of Deepak Chopra or L. Ron Hubbard, I was perfectly ready to return to completely ignoring him, but I was unable to do so thanks to his fans. Instead accepting my critique, or even going over the various points in detail and attempting to rebut them, they attacked my intellect, my integrity, and my motivations. They accused me of jealousy, they accused me of envy, and they accused me of dishonesty, all in defense of a man who was observably lacking in any intellectual integrity at all! It was exceedingly bizarre, especially when I had done nothing more than point out a few of the obvious mistakes the man had made.\nSo, I decided to begin looking more deeply into this popular professor who was being so widely hailed as a formidable thinker, a thoughtful philosopher, a courageous defender of free speech, and a champion of young men. But almost immediately, I discovered that his reputation was at variance with his actions, as in the case of his deeply ironic decision to ban investigative journalist Faith Goldy from participating in an August 2017 event at Ryerson University called “The Stifling of Free Speech on University Campuses”. The event was cancelled, and with Peterson’s approval, Goldy was barred from participating in the rescheduled event.\nWhen he was subsequently asked about his decision in public, Peterson responded with what I eventually came to recognize was his characteristic bafflegarble, the word-smog he habitually utilizes to conceal his actual meaning.\nQUESTION: I understand that Faith Goldy was removed from the original August panel because of her podcast with the controversial Daily Stormer after Charlottesville…. This strategy appears to parallel the SJWs, who wish to deny platforms to conservative speakers. I want to understand why Faithy Goldy was removed from the event simply for associating with identitarians, and if each of the panelists agree with that decision.\nJORDAN PETERSON: That’s an excellent question. So, the first thing I should say is that it’s not like we’re unaware of the irony. Number one. Ryerson cancelled a panel about the cancellation of panels about free speech. That’s irony number one. And then irony number two was the panelists removed a speaker for arguably engaging in the act of free speech. Okay, we got that, believe me.\nAll right, so why did we come to this decision? I sat down personally—the other people can say what they have to say—I sat down with my son and we went through Faith’s interview. I know Faith, I don’t believe that she is a reprehensible person. I think that Charlottesville was very shocking to her and I think that she put herself in a very difficult position. And I think some of that was brave, that she went down there to cover it.\nHowever, I listened very carefully to her podcast, the one that got her in trouble. And my sense was that she wasn’t, she didn’t, she was associating with people whose views she should have questioned. It was her journalistic, um, responsibility to question them. She had to ask at least one hard question. At least one. Three would have been better. You know, and I understand she had to toe a careful line. She was on the podcast, they had invited her on, it’s much more difficult than you might think when you’re facing people, even when you don’t believe them, to be rude enough to challenge them, right? That’s not so easy, especially if you’re an agreeable person and she is a rather agreeable person.\nBut I believe she, she failed in her journalistic responsibility. And as a consequence of that, she became too hot a property for us. And not just for us. And, well, that was, that was the reason for the decision. That was, that was my reasoning.\nNow, this was manifestly not the correct behavior of a highly principled man or even a reasonably honest one. Jordan Peterson did something he clearly knew to be wrong, he did something he clearly knew to be hypocritical, but instead of simply owning up to his obvious failure when called on it in public, he attempted to concoct a ridiculous ex post facto excuse to justify it. Again.\nHe had to know that he was going to have to face the question sooner or later. He even appears to have prepared for it, and yet this response was the best that he could manage. If you watch the video, you can even see that Jordan Peterson\nhas, he has\n, a reliable tell that warns the viewer when he’s about to say something that he knows is not true. He also betrays another tell that indicates when he is going to\nvery carefully\nattempt to conceal the weakness of one of his assertions or conclusions.\nJust watch for the repetitions and the adverbs. Once you learn to recognize them, you can identify when Jordan Peterson is trying to pull a fast one on his audience even when you don’t know what he’s talking about.\nAnd the obvious question Peterson’s response raises is this: according to what theory of human rights or journalism does one’s own right to free speech rely upon one’s correct performance of nonexistent journalistic responsibilities?\nThere is no such theory. It’s a nonsensical assertion. It’s classic Petersonian bafflegarble. But it requires a high level of mental focus to penetrate the fog of Peterson’s word-salad and see what he is literally saying.\nAfter twice seeing Peterson’s shameless dishonesty in action, I decided that it was time to delve deeper into the man’s actual work. Being a writer myself, I was aware that men express themselves differently in different media. Many eloquent speakers reveal themselves to be superficial thinkers in writing, and no few writers—myself included—are unable to express their genuinely profound thoughts in a facile manner in front of a microphone or a camera. Perhaps Peterson was much better in print than he was on video or on the Internet; after all, he was the bestselling author on the planet at the time.\nSo, I read his bestseller,\n12 Rules for Life: An Antidote to Chaos\n. I read his would-be magnum opus,\nMaps of Meaning: The Architecture of Belief\n. I even read his contribution to the UN Secretary General’s High Level Panel on Sustainable Development of which he was a member,\nResilient People, Resilient Planet: A future worth choosing\n.\nAnd this book is the result of what I learned from reading the three published works of Jordan Peterson.\nA word of warning. This book is necessarily more than a little esoteric. It references a number of works with which you may be unfamiliar, and draws obscure connections you may not immediately recognize or that you may be initially reluctant to acknowledge, especially if you are a Jordan Peterson fan.\nBut you can be sure of one thing. Unlike Jordan Peterson, I am not attempting to deceive, confuse, dazzle, or baffle you. Unlike Jordan Peterson, I am not attempting to change your perspective or your philosophy. Unlike Jordan Peterson, the logic I present is clear and straightforward. And unlike Jordan Peterson, I do not owe my allegiance to anything but the objective truth, as that concept has been defined in the dictionary and understood by Man since the beginning of time.\nYou need not take my word for any of this. Everything I am writing here is based on material evidence that you can obtain, examine, and analyze for yourself. So clear your mind, set aside your assumptions and preconceptions, and prepare yourself for a journey into the mind of one of the most shameless intellectual charlatans in the history of Man.\nUPDATE: Also #1 in Kindle Store  > Nonfiction > Self-Help > Spiritual",
  "tags": [
    "books"
  ],
  "categories": [],
  "sitemap_lastmod": "2018-11-19T20:28:53+00:00"
}