{
  "url": "https://voxday.net/2018/11/01/mailvox-a-review-of-the-consuming-fire/",
  "scraped_at": "2025-12-20T05:15:10.147913",
  "title": "Mailvox: a review of The Consuming Fire",
  "date_display": "November 1, 2018",
  "date_iso": "2018-11-01T22:35:13+00:00",
  "date_from_url": "2018-11-01",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p><i>A very successful SF writer sends his review of John Scalzi’s The Consuming Fire, the second in his The Interdependency series, in case anyone happens to be curious about it.</i></p><p><b>Review: </b>The true tragedy of <i>The Consuming Fire</i> is this: if this book, and <i>The Collapsing Empire</i>, had been written as one volume, it would have solved many of the problems besetting the first volume and made the combined volume far more satisfactory.  As it is, although <i>The Consuming Fire</i> is vastly superior to its predecessor, it lacks the satisfaction one may glean from a well-written Peter Hamilton, Brandon Sanderson or Iain M. Banks.  It’s also far too expensive for what one gets out of it.</p><p>The Interdependency – a network of star systems held together by the Flow, a series of hyper-dimensional rivers running through the higher dimensions – has finally discovered, thanks to the efforts of Cardenia Wu-Patrick, Marce Claremont and Kiva Lagos, that the Flow is collapsing and the Interdependency, as they know it, is doomed.  With only one planet within the system capable of supporting life without massive support from off-world, and that in enemy hands, the stage is set for a brutal civil war …</p><p>… Except it isn’t.  The book effectively separates into two halves.  One side covers Cardenia Wu-Patrick’s desperate attempts to convince the Interdependency that the Flow is indeed collapsing (something that should have been made easier by the complete collapse of one Flow stream) and facing a conspiracy that should have been able to overthrow her with ease, but shows such striking incompetence that their entire plan falls apart far too quickly.  The other side follows Marce as he (aided by the researcher who, accidentally, started the Bad Guys plotting) discovers that the Flow’s steady collapse may be opening up new streams, including to a system that was cut off hundreds of years ago.  (No, not long-lost Earth.)  They take a starship to the system, where they find a handful of survivors – and proof, perhaps, that the shift in the Flow may not be entirely natural.  The Interdependency’s sins – or those of its founders – may have come back to haunt it.  And then, with the discovery of a handful of new streams and the plotters defeated, the stage is set for a brutal civil war …</p><p>(Didn’t I just say that?  Really?)</p><p>Unlike <i>The Collapsing Empire</i>, this volume does manage to get across both the scale of the disaster facing the Interdependency – with brief asides touching on the effects on the wider universe as the collapse picks up speed – and the problems facing people who attempt to convince the bureaucracy and established interests that the sky is falling, although one expects that this particular version of ‘the sky is falling’ hasn’t been heard that often within the Interdependency.  If Scalzi was hoping to draw a link between the collapsing Flow and climate change, he failed.  The cold fact is that the people who insist that the climate is changing – and that human intervention is forcing the change – have been screaming ‘the sky is falling’ for so long that everyone else has simply stopped listening.  Here, one would expect the novelty alone to ensure that the claims got a fair hearing, although Scalzi is probably right to suggest that not everyone would want to believe.</p><p>The Marce plot works better, I think, although much of it is predictable and fails badly when the two plots interact.  It allows the reader to see both the fate in store for the Interdependency and, also, to pick up a flicker of hope (although Scalzi teases us with hints, rather than direct answers).  It’s clever of Scalzi to have Marce interact with the ‘enemy’ physicist, although it says nothing about the competence of the Independency’s security forces that they didn’t pick her up long ago.  (Or the bad guys, in not having her quietly hidden away somewhere or simply eliminated.)  It’s amusing to see that the lack of peer review bit both sides hard.  The bad guys weren’t the only ones to miss a few important details.  Kudos to Scalzi for making a point many would have missed.</p><p>However, the plot following Cardenia Wu-Patrick and Kiva Lagos is considerably weaker, owing to a combination of incompetence on both sides.  The bad guys appear certain to win – they pull off a spectacular prison break – until sheer chance, not remotely foreshadowed, blows their plans out of the water.  Scalzi does this very poorly, it must be noted.  The conspiracy is doomed because of the growing crisis, sure enough, but the interests of the competing parties are so different that the conspiracy is probably doomed anyway.  It requires the plotters to either give up most of their interests or start planning to stab their fellows in the back.  Arguably, this is what happens.  The bad guys run rampant until they are challenged, at which point they fold with astonishing speed.</p><p>The sexual politics are also quite irritating.  It’s amusing to have Cardenia Wu-Patrick worrying about inviting someone to bed when she can have him (or her) exiled or executed for saying no.  Scalzi neatly encapsulates the dilemma facing those who want to exonerate Bill Clinton for his conduct in office.  Kiva Lagos, who is the person who really needs those thoughts (as she’s as guilty as Slick Willy), doesn’t have them.  Cardenia Wu-Patrick acts, at times, like a lovelorn schoolgirl mooning over Marce (and worrying if he fancies the other physicist); Kiva Lagos is as sexually aggressive as ever, taking an important call while being serviced – that is the exact word used – by an enemy lawyer.  Thankfully, we see less of her in this story than the previous one – another moment when combining the two books would have been considerably more effective.  Truthfully, I wouldn’t object to having all the major power players in the book be women if they weren’t so strikingly incompetent. </p><p>It cannot be denied, however, that Scalzi dropped the ball in a number of places.  There are no scenes set on End, leaving that plot thread dangling for the moment.  To be fair, End is immaterial to the overall plot until the Independency finds a way to get back in touch with the lost world, but it’s still irritating.  Scalzi also has some of his characters veering backwards and forwards with terrifying speed, missing obvious opportunities to push their agendas because of the demands of the plot.  And most of his characters are basically snarky.  It’s sometimes hard to tell them apart.</p><p>Scalzi also takes a number of shots at organised religion, making it clear – right from the start of this book – that the Interdependency’s religion is based on a lie.  This is no steady corruption of a number of prophets, or a man who worked miracles, but a lie that was used to bind the Interdependency together.  There are shades of the fake religions of Foundation here too.  The main characters have no qualms about cynically manipulating the beliefs of their people to achieve their goals.  If you happen to be religious, you may find this offensive; if you are not, you may let it slip by.  Scalzi tries to add a hint of ambiguity with a character who may – or may not – have had a religious experience, but it’s hard to take it seriously.  It’s a neat piece of background, but one that ultimately fails.  Which is a shame, because there are concepts here – in the hands of a different writer – that might have been worth exploring.  What do you do if your fake religion suddenly has to deal with a very real prophet?  Or someone that cannot be branded a fake without calling your entire religion into question?</p><p>Overall, if Scalzi had combined these two books into one, I would have given them a much higher rating.  A combined volume would have avoided the problems plaguing the separate books – and probably had better editing – and settled a handful of issues before moving on to the third volume.  As it is, both books are ultimately unsatisfactory.  Scalzi appears determined to wring as much money as he can from the series, despite the limitations of the plot, but neither of his volumes have the sheer meat of <i>Game of Thrones</i> and its early successors.  It took me less than an hour to read it.  There are some improvements, yet the glacial plot movement and sheer incompetence of the plotters and counter-plotters is a major downer.  So too is the crudity of some of the characters.  In short, the book is too expensive for what it gives us.<br><b><br/></b><b>Rating: </b>Two out of five.</br></p></div>",
  "content_text": "A very successful SF writer sends his review of John Scalzi’s The Consuming Fire, the second in his The Interdependency series, in case anyone happens to be curious about it.\nReview:\nThe true tragedy of\nThe Consuming Fire\nis this: if this book, and\nThe Collapsing Empire\n, had been written as one volume, it would have solved many of the problems besetting the first volume and made the combined volume far more satisfactory.  As it is, although\nThe Consuming Fire\nis vastly superior to its predecessor, it lacks the satisfaction one may glean from a well-written Peter Hamilton, Brandon Sanderson or Iain M. Banks.  It’s also far too expensive for what one gets out of it.\nThe Interdependency – a network of star systems held together by the Flow, a series of hyper-dimensional rivers running through the higher dimensions – has finally discovered, thanks to the efforts of Cardenia Wu-Patrick, Marce Claremont and Kiva Lagos, that the Flow is collapsing and the Interdependency, as they know it, is doomed.  With only one planet within the system capable of supporting life without massive support from off-world, and that in enemy hands, the stage is set for a brutal civil war …\n… Except it isn’t.  The book effectively separates into two halves.  One side covers Cardenia Wu-Patrick’s desperate attempts to convince the Interdependency that the Flow is indeed collapsing (something that should have been made easier by the complete collapse of one Flow stream) and facing a conspiracy that should have been able to overthrow her with ease, but shows such striking incompetence that their entire plan falls apart far too quickly.  The other side follows Marce as he (aided by the researcher who, accidentally, started the Bad Guys plotting) discovers that the Flow’s steady collapse may be opening up new streams, including to a system that was cut off hundreds of years ago.  (No, not long-lost Earth.)  They take a starship to the system, where they find a handful of survivors – and proof, perhaps, that the shift in the Flow may not be entirely natural.  The Interdependency’s sins – or those of its founders – may have come back to haunt it.  And then, with the discovery of a handful of new streams and the plotters defeated, the stage is set for a brutal civil war …\n(Didn’t I just say that?  Really?)\nUnlike\nThe Collapsing Empire\n, this volume does manage to get across both the scale of the disaster facing the Interdependency – with brief asides touching on the effects on the wider universe as the collapse picks up speed – and the problems facing people who attempt to convince the bureaucracy and established interests that the sky is falling, although one expects that this particular version of ‘the sky is falling’ hasn’t been heard that often within the Interdependency.  If Scalzi was hoping to draw a link between the collapsing Flow and climate change, he failed.  The cold fact is that the people who insist that the climate is changing – and that human intervention is forcing the change – have been screaming ‘the sky is falling’ for so long that everyone else has simply stopped listening.  Here, one would expect the novelty alone to ensure that the claims got a fair hearing, although Scalzi is probably right to suggest that not everyone would want to believe.\nThe Marce plot works better, I think, although much of it is predictable and fails badly when the two plots interact.  It allows the reader to see both the fate in store for the Interdependency and, also, to pick up a flicker of hope (although Scalzi teases us with hints, rather than direct answers).  It’s clever of Scalzi to have Marce interact with the ‘enemy’ physicist, although it says nothing about the competence of the Independency’s security forces that they didn’t pick her up long ago.  (Or the bad guys, in not having her quietly hidden away somewhere or simply eliminated.)  It’s amusing to see that the lack of peer review bit both sides hard.  The bad guys weren’t the only ones to miss a few important details.  Kudos to Scalzi for making a point many would have missed.\nHowever, the plot following Cardenia Wu-Patrick and Kiva Lagos is considerably weaker, owing to a combination of incompetence on both sides.  The bad guys appear certain to win – they pull off a spectacular prison break – until sheer chance, not remotely foreshadowed, blows their plans out of the water.  Scalzi does this very poorly, it must be noted.  The conspiracy is doomed because of the growing crisis, sure enough, but the interests of the competing parties are so different that the conspiracy is probably doomed anyway.  It requires the plotters to either give up most of their interests or start planning to stab their fellows in the back.  Arguably, this is what happens.  The bad guys run rampant until they are challenged, at which point they fold with astonishing speed.\nThe sexual politics are also quite irritating.  It’s amusing to have Cardenia Wu-Patrick worrying about inviting someone to bed when she can have him (or her) exiled or executed for saying no.  Scalzi neatly encapsulates the dilemma facing those who want to exonerate Bill Clinton for his conduct in office.  Kiva Lagos, who is the person who really needs those thoughts (as she’s as guilty as Slick Willy), doesn’t have them.  Cardenia Wu-Patrick acts, at times, like a lovelorn schoolgirl mooning over Marce (and worrying if he fancies the other physicist); Kiva Lagos is as sexually aggressive as ever, taking an important call while being serviced – that is the exact word used – by an enemy lawyer.  Thankfully, we see less of her in this story than the previous one – another moment when combining the two books would have been considerably more effective.  Truthfully, I wouldn’t object to having all the major power players in the book be women if they weren’t so strikingly incompetent.\nIt cannot be denied, however, that Scalzi dropped the ball in a number of places.  There are no scenes set on End, leaving that plot thread dangling for the moment.  To be fair, End is immaterial to the overall plot until the Independency finds a way to get back in touch with the lost world, but it’s still irritating.  Scalzi also has some of his characters veering backwards and forwards with terrifying speed, missing obvious opportunities to push their agendas because of the demands of the plot.  And most of his characters are basically snarky.  It’s sometimes hard to tell them apart.\nScalzi also takes a number of shots at organised religion, making it clear – right from the start of this book – that the Interdependency’s religion is based on a lie.  This is no steady corruption of a number of prophets, or a man who worked miracles, but a lie that was used to bind the Interdependency together.  There are shades of the fake religions of Foundation here too.  The main characters have no qualms about cynically manipulating the beliefs of their people to achieve their goals.  If you happen to be religious, you may find this offensive; if you are not, you may let it slip by.  Scalzi tries to add a hint of ambiguity with a character who may – or may not – have had a religious experience, but it’s hard to take it seriously.  It’s a neat piece of background, but one that ultimately fails.  Which is a shame, because there are concepts here – in the hands of a different writer – that might have been worth exploring.  What do you do if your fake religion suddenly has to deal with a very real prophet?  Or someone that cannot be branded a fake without calling your entire religion into question?\nOverall, if Scalzi had combined these two books into one, I would have given them a much higher rating.  A combined volume would have avoided the problems plaguing the separate books – and probably had better editing – and settled a handful of issues before moving on to the third volume.  As it is, both books are ultimately unsatisfactory.  Scalzi appears determined to wring as much money as he can from the series, despite the limitations of the plot, but neither of his volumes have the sheer meat of\nGame of Thrones\nand its early successors.  It took me less than an hour to read it.  There are some improvements, yet the glacial plot movement and sheer incompetence of the plotters and counter-plotters is a major downer.  So too is the crudity of some of the characters.  In short, the book is too expensive for what it gives us.\nRating:\nTwo out of five.",
  "tags": [
    "mailvox"
  ],
  "categories": [],
  "sitemap_lastmod": "2018-11-01T22:35:13+00:00"
}