{
  "url": "https://voxday.net/2018/11/25/mailvox-seeing-through-the-word-salad/",
  "scraped_at": "2025-12-20T05:18:09.737006",
  "title": "Mailvox: seeing through the word-salad",
  "date_display": "November 25, 2018",
  "date_iso": "2018-11-25T18:27:42+00:00",
  "date_from_url": "2018-11-25",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>This email exchange with a former academic fan of Jordan Peterson may prove illuminating:</p><blockquote><p><b>Academic:</b> About [REDACTED]. He is a good guy.  He got sucked into Jordan Peterson the same way I did—he thinks in symbolism and heard Jordan apparently talking about the kind of symbolism I study. I am worried for him and for some of my other academic colleagues who are friends with Jordan. His fall is not going to be pretty and many innocent people are going to get hurt.</p><p><b>VD: </b>Yes, I rather imagine a lot of people who drank the Kool-Aid are going to be extremely disappointed. But if they were less narcissistic, they wouldn’t have fallen for Peterson in the first place. I can’t tell you how many of his fans and followers have told me “he sounds like me”. Yeah, well, that’s his game. That’s the con.</p><p><b>Academic:</b> Exactly. And guilty as charged. I was originally sucked in by his Logos-Christ speak—until I realized that it was all my projection onto his smoke screen. I am so thankful that you and Milo did the book—Peterson is a real danger, much more so than those who are more clearly our enemies.</p></blockquote><p>False prophets are usually worse than open and avowed enemies of the faith. And you should always be very careful to read what is actually there, rather than what you imagine might possibly be. This is a fundamental error that I see people making every single day, on this blog, in the YouTube comments, and in real life.</p><p>In my experience, if something sounds agreeable to you, then you should be MORE skeptical of it, not less so.</p></div>",
  "content_text": "This email exchange with a former academic fan of Jordan Peterson may prove illuminating:\nAcademic:\nAbout [REDACTED]. He is a good guy.  He got sucked into Jordan Peterson the same way I did—he thinks in symbolism and heard Jordan apparently talking about the kind of symbolism I study. I am worried for him and for some of my other academic colleagues who are friends with Jordan. His fall is not going to be pretty and many innocent people are going to get hurt.\nVD:\nYes, I rather imagine a lot of people who drank the Kool-Aid are going to be extremely disappointed. But if they were less narcissistic, they wouldn’t have fallen for Peterson in the first place. I can’t tell you how many of his fans and followers have told me “he sounds like me”. Yeah, well, that’s his game. That’s the con.\nAcademic:\nExactly. And guilty as charged. I was originally sucked in by his Logos-Christ speak—until I realized that it was all my projection onto his smoke screen. I am so thankful that you and Milo did the book—Peterson is a real danger, much more so than those who are more clearly our enemies.\nFalse prophets are usually worse than open and avowed enemies of the faith. And you should always be very careful to read what is actually there, rather than what you imagine might possibly be. This is a fundamental error that I see people making every single day, on this blog, in the YouTube comments, and in real life.\nIn my experience, if something sounds agreeable to you, then you should be MORE skeptical of it, not less so.",
  "tags": [
    "mailvox"
  ],
  "categories": [],
  "sitemap_lastmod": "2018-11-25T18:27:42+00:00"
}