{
  "url": "https://voxday.net/2018/11/19/mailvox-how-not-to-critique/",
  "scraped_at": "2025-12-20T05:17:22.343427",
  "title": "Mailvox: How not to critique",
  "date_display": "November 19, 2018",
  "date_iso": "2018-11-19T17:20:32+00:00",
  "date_from_url": "2018-11-19",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>This dialogue rather nicely addresses the two most recent Darkstream topics, Jordanetics and learning how to think effectively at the same time. It is perhaps most useful to contemplate this in juxtaposition of how I have gone about criticizing Peterson and his work.</p><blockquote><p><b>MC: </b>You are confusing the dialectic process which dates back to Socrates himself with dialectical materialism. “Political philosopher…” yeah, right. I challenge you to a livestreamed debate about your essential premise that Jordan is utilizing Marxism to formulate his philosophy.﻿</p><p><b>VD: </b>No, I’m not confusing that. No, that’s not my essential premise. Yes, I am one of the bestselling political philosophers alive, with three #1 bestsellers in that category. And no, I’m not going to debate someone who has never read my work and misrepresents my statements. Peterson is not utilizing Marxism to formulate his philosophy, but he is utilizing the same structural approach that Marx did. Thesis-antithesis-synthesis is structurally identical to Chaos-Order-More Perfect Order aka 12-Rule Path to Balance.﻿</p><p><b>MC: </b>You said verbatim that “his intellectual approach is fundamentally Marxist.”  This requires a gross misunderstanding of what the dialectic process— I.e., thesis-antithesis-synthesis— actually involves, and its rich history. It was developed in its earliest stages by Socrates through the Socratic method, and it was adopted by the scholastic Christians as the premise for their dialectic. Far from being philosophically Marxist and anti-Christian, Peterson’s adoption of the dialectic method is both a rejection of Marxism, and an acceptance of a method that has been used by Christians for hundreds of years. As for your credentials, I’m not arguing about how many best sellers you have. Any professional, career political philosopher would laugh at your claim that Dr. Peterson’s intellectual method is Marxist. And I’ve read more of your work than you think. The challenge to debate is still open.﻿</p><p><b>VD: </b>Yes, and obviously I misspoke as I intended to say that his structural approach to his philosophy is fundamentally similar to the Marxist approach. You are trying to build an entire narrative on a false foundation. And you are completely wrong about that being my “essential premise” even given that misstatement. I will never debate you, because you are not honest, you are primarily interested in demonstrating that you are a Smart Boy. You’re not a mind reader, you are wrong, and you haven’t bothered to even do your homework on this subject. So, drop it before I remove you from the channel.﻿</p><p><b>MC: </b>Now you’re making a different claim— and I appreciate that you’re no longer saying that Peterson’s intellectual approach is fundamentally Marxist. That may not have been considered an essential part of your argument to you, but as someone who watches your videos fairly regularly (and hasn’t criticized your work once until today), it matters to me how you paint the people you criticize. If you had claimed Jordan was fundamentally Marxist and stuck to it, that would have been an extraordinary claim. And in my defense, I am not at all concerned about being viewed as a “Smart Boy.” I am concerned about discovering the truth, wherever it comes from. And by the way, I’m still buying the book because I think there may be worthwhile criticisms in it. But I could not in good conscience let such a drastic accusation slide so easily. Kick me from your channel, if you will, but I think banning and refusal to debate are beneath you. Isn’t that what we criticize the Left about?﻿</p><p><b>VD: </b>Yes, it would have been an extraordinary claim, moreover, it would have been completely in contradiction to every single reference to Peterson and Marxism in the book I just wrote. Not that there are many, since Peterson is not only not a Marxist, he doesn’t even know very much about it despite his constant blathering about it.  The point is that your criticism was almost completely off-base. At no point did you ever stop to confirm that the meaning you quite reasonably assigned to it was intended, nor did you possess enough information to know that it was obviously an unintentional statement. Why would I ever debate anyone who suggests a totally irrelevant debate topic? There is literally nothing to debate.﻿</p></blockquote><p>So, what is the problem with this critical approach? Some of you will already have a pretty good idea of not only the problem, but the underlying reason for the problem, but we will ignore the latter as being obvious to those familiar with the topic.</p><p>First, never begin with a superior posture. Second, never make a definitive value statement at the start. Third, be very cautious about building a mountain out of a molehill, especially from a single piece of evidence. Fourth, always place more confidence in the written word than the spoken one. Fifth, refrain making any personal judgments in the early stages. And that’s just in the first paragraph.</p><p>Sixth, accept the responsible party’s expression of his intentions unless there is reason to believe he is lying or being evasive. Seventh, do your homework. Eighth, always be slow to leap to judgment. Express your suspicions, do not make concrete assertions.</p></div>",
  "content_text": "This dialogue rather nicely addresses the two most recent Darkstream topics, Jordanetics and learning how to think effectively at the same time. It is perhaps most useful to contemplate this in juxtaposition of how I have gone about criticizing Peterson and his work.\nMC:\nYou are confusing the dialectic process which dates back to Socrates himself with dialectical materialism. “Political philosopher…” yeah, right. I challenge you to a livestreamed debate about your essential premise that Jordan is utilizing Marxism to formulate his philosophy.﻿\nVD:\nNo, I’m not confusing that. No, that’s not my essential premise. Yes, I am one of the bestselling political philosophers alive, with three #1 bestsellers in that category. And no, I’m not going to debate someone who has never read my work and misrepresents my statements. Peterson is not utilizing Marxism to formulate his philosophy, but he is utilizing the same structural approach that Marx did. Thesis-antithesis-synthesis is structurally identical to Chaos-Order-More Perfect Order aka 12-Rule Path to Balance.﻿\nMC:\nYou said verbatim that “his intellectual approach is fundamentally Marxist.”  This requires a gross misunderstanding of what the dialectic process— I.e., thesis-antithesis-synthesis— actually involves, and its rich history. It was developed in its earliest stages by Socrates through the Socratic method, and it was adopted by the scholastic Christians as the premise for their dialectic. Far from being philosophically Marxist and anti-Christian, Peterson’s adoption of the dialectic method is both a rejection of Marxism, and an acceptance of a method that has been used by Christians for hundreds of years. As for your credentials, I’m not arguing about how many best sellers you have. Any professional, career political philosopher would laugh at your claim that Dr. Peterson’s intellectual method is Marxist. And I’ve read more of your work than you think. The challenge to debate is still open.﻿\nVD:\nYes, and obviously I misspoke as I intended to say that his structural approach to his philosophy is fundamentally similar to the Marxist approach. You are trying to build an entire narrative on a false foundation. And you are completely wrong about that being my “essential premise” even given that misstatement. I will never debate you, because you are not honest, you are primarily interested in demonstrating that you are a Smart Boy. You’re not a mind reader, you are wrong, and you haven’t bothered to even do your homework on this subject. So, drop it before I remove you from the channel.﻿\nMC:\nNow you’re making a different claim— and I appreciate that you’re no longer saying that Peterson’s intellectual approach is fundamentally Marxist. That may not have been considered an essential part of your argument to you, but as someone who watches your videos fairly regularly (and hasn’t criticized your work once until today), it matters to me how you paint the people you criticize. If you had claimed Jordan was fundamentally Marxist and stuck to it, that would have been an extraordinary claim. And in my defense, I am not at all concerned about being viewed as a “Smart Boy.” I am concerned about discovering the truth, wherever it comes from. And by the way, I’m still buying the book because I think there may be worthwhile criticisms in it. But I could not in good conscience let such a drastic accusation slide so easily. Kick me from your channel, if you will, but I think banning and refusal to debate are beneath you. Isn’t that what we criticize the Left about?﻿\nVD:\nYes, it would have been an extraordinary claim, moreover, it would have been completely in contradiction to every single reference to Peterson and Marxism in the book I just wrote. Not that there are many, since Peterson is not only not a Marxist, he doesn’t even know very much about it despite his constant blathering about it.  The point is that your criticism was almost completely off-base. At no point did you ever stop to confirm that the meaning you quite reasonably assigned to it was intended, nor did you possess enough information to know that it was obviously an unintentional statement. Why would I ever debate anyone who suggests a totally irrelevant debate topic? There is literally nothing to debate.﻿\nSo, what is the problem with this critical approach? Some of you will already have a pretty good idea of not only the problem, but the underlying reason for the problem, but we will ignore the latter as being obvious to those familiar with the topic.\nFirst, never begin with a superior posture. Second, never make a definitive value statement at the start. Third, be very cautious about building a mountain out of a molehill, especially from a single piece of evidence. Fourth, always place more confidence in the written word than the spoken one. Fifth, refrain making any personal judgments in the early stages. And that’s just in the first paragraph.\nSixth, accept the responsible party’s expression of his intentions unless there is reason to believe he is lying or being evasive. Seventh, do your homework. Eighth, always be slow to leap to judgment. Express your suspicions, do not make concrete assertions.",
  "tags": [
    "mailvox"
  ],
  "categories": [],
  "sitemap_lastmod": "2018-11-19T17:20:32+00:00"
}