{
  "url": "https://voxday.net/2018/11/27/neoliberal-despair/",
  "scraped_at": "2025-12-20T05:18:22.613718",
  "title": "Neoliberal despair",
  "date_display": "November 27, 2018",
  "date_iso": "2018-11-27T13:16:09+00:00",
  "date_from_url": "2018-11-27",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>David Brooks <a href=\"https://www.nytimes.com/2018/11/26/opinion/millennial-activists-generation-gap.html\">fears the post-Boomer future</a>:</p><blockquote><p>Two great belief systems are clashing here. The older liberals tend to be individualistic and meritocratic. A citizen’s job is to be activist, compassionate and egalitarian. Boomers generally think they earned their success through effort and talent. The younger militants tend to have been influenced by the cultural Marxism that is now the lingua franca in the elite academy. Group identity is what matters. Society is a clash of oppressed and oppressor groups. People who are successful usually got that way through some form of group privilege and a legacy of oppression….</p><p>The generation gap on the right is less dramatic. It’s less politically important because the young don’t influence the G.O.P. much; the old Trumpians do.</p><p>But over the long run it will matter. The boomer conservatives, raised in the era of Reagan, generally believe in universal systems — universal capitalism, universal democracy and the open movement of people and goods. Younger educated conservatives are more likely to see the dream of universal democracy as hopelessly naïve, and the system of global capitalism as a betrayal of the working class. Younger conservatives are comfortable in a demographically diverse society, but are also more likely to think in cultural terms, and to see cultural boundaries.</p><p>Whether on left or right, younger people have emerged in an era of lower social trust, less faith in institutions, a greater awareness of group identity. They live with the reality of tribal political warfare and are more formed by that warfare.</p></blockquote><p>This is precisely why the Alt-Right is inevitable, and probably not the more moderate varieties either. Both white American liberalism and white American conservatism are dying, because both ideological perspectives are fundamentally dependent upon the homogeneous majority white population that existed pre-1965. Note that neither the liberal nor the conservative ideology have ever taken root <i>anywhere </i>outside the United States despite the USA’s global cultural influence. That’s why they will not survive post-American US politics; neither holds any appeal to Diversity.</p><p>The big difference between Generation Z and its predecessors is that their knowledge of identity politics is real and formative, whereas that of the older generations is mostly symbolic and theoretical. The Boomers, Generation Xers, and Millennials love to feel that they are helping poor unfortunate minorities through their virtue-signaling, whereas Generation Z looks around and realizes that they are in the minority themselves and they are surrounded by a Diversity that hates, envies, and fears them.</p><p>The older generations of whites simply cannot conceive of the white population not being completely in charge. The youngest generation realizes how heavily the deck is stacked against them.</p></div>",
  "content_text": "David Brooks\nfears the post-Boomer future\n:\nTwo great belief systems are clashing here. The older liberals tend to be individualistic and meritocratic. A citizen’s job is to be activist, compassionate and egalitarian. Boomers generally think they earned their success through effort and talent. The younger militants tend to have been influenced by the cultural Marxism that is now the lingua franca in the elite academy. Group identity is what matters. Society is a clash of oppressed and oppressor groups. People who are successful usually got that way through some form of group privilege and a legacy of oppression….\nThe generation gap on the right is less dramatic. It’s less politically important because the young don’t influence the G.O.P. much; the old Trumpians do.\nBut over the long run it will matter. The boomer conservatives, raised in the era of Reagan, generally believe in universal systems — universal capitalism, universal democracy and the open movement of people and goods. Younger educated conservatives are more likely to see the dream of universal democracy as hopelessly naïve, and the system of global capitalism as a betrayal of the working class. Younger conservatives are comfortable in a demographically diverse society, but are also more likely to think in cultural terms, and to see cultural boundaries.\nWhether on left or right, younger people have emerged in an era of lower social trust, less faith in institutions, a greater awareness of group identity. They live with the reality of tribal political warfare and are more formed by that warfare.\nThis is precisely why the Alt-Right is inevitable, and probably not the more moderate varieties either. Both white American liberalism and white American conservatism are dying, because both ideological perspectives are fundamentally dependent upon the homogeneous majority white population that existed pre-1965. Note that neither the liberal nor the conservative ideology have ever taken root\nanywhere\noutside the United States despite the USA’s global cultural influence. That’s why they will not survive post-American US politics; neither holds any appeal to Diversity.\nThe big difference between Generation Z and its predecessors is that their knowledge of identity politics is real and formative, whereas that of the older generations is mostly symbolic and theoretical. The Boomers, Generation Xers, and Millennials love to feel that they are helping poor unfortunate minorities through their virtue-signaling, whereas Generation Z looks around and realizes that they are in the minority themselves and they are surrounded by a Diversity that hates, envies, and fears them.\nThe older generations of whites simply cannot conceive of the white population not being completely in charge. The youngest generation realizes how heavily the deck is stacked against them.",
  "tags": [
    "declineandfall"
  ],
  "categories": [],
  "sitemap_lastmod": "2018-11-27T13:16:09+00:00"
}