{
  "url": "https://voxday.net/2018/11/23/no-media-no-alternative-media-no-interviews/",
  "scraped_at": "2025-12-20T05:17:53.304533",
  "title": "No media, no alternative media, no interviews",
  "date_display": "November 23, 2018",
  "date_iso": "2018-11-23T14:27:41+00:00",
  "date_from_url": "2018-11-23",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>While I’m accustomed to being the recipient of an interview request or three per week, the recent launch of <i><a href=\"https://www.amazon.com/Jordanetics-Journey-Humanitys-Greatest-Thinker-ebook/dp/B07JY9XV38/\">Jordanetics</a> </i>has increased that to five or six per day, from media and alternative media around the world, everywhere from South America to Eastern Europe.</p><p>I hope no one will take any offense at my decision to decline ALL of these requests, because with a few very specific exceptions, I am no longer going to accept any invitations to an interview or an appearance from the media or the alternative media. My reasoning is very straightforward; <i>every single time</i> I talk to anyone in public, it causes problems and distractions that range from petty personal issues to significant and serious professional ones. They are not only a waste of time in and of themselves, but they take up an amount of time later that would be much more profitably spent on something other than drama and damage control.</p><p>So, I’m not doing it anymore. I was already not talking to the mainstream media; the <i>Reveal </i>hitpiece that inspired IGG’s nonsensical gossiping about nonexistent money laundering was the final straw. Seriously, just how prodigiously stupid do you have to be to fail to grasp that producing and selling MORE content than people believe is possible given the resources concerned is the EXACT OPPOSITE of money laundering, which involves the fabrication of nonexistent sales of products that don’t exist to cover for the movement of money derived from other activities?</p><p>But talking to the alternative media isn’t much better. The various livestreamers, podcasters, bloggers, and writers all have their own agendas, which is fine, but those agendas don’t necessarily have anything to do with mine even when our ideological alignments are not in opposition. If people want to know what I think, I have written and published 10 nonfiction books, written 535 columns, posted more than 20,000 blog posts, and recorded nine Voxiversity videos. I suggest anyone who is curious about my opinion on anything to consult any or all of those sources of information.</p><p>Now, I will certainly continue to talk to authors who are published by Castalia House. I will continue to talk to the retail outlets for our books and comics and games. I will continue to talk to my old friends and acquaintances with whom I have a personal relationship. But otherwise, I will not be granting interviews to anyone or appearing on any television shows, livestreams, or podcasts, so please don’t trouble to invite me even if you are confident you have only the best of intentions.</p></div>",
  "content_text": "While I’m accustomed to being the recipient of an interview request or three per week, the recent launch of\nJordanetics\nhas increased that to five or six per day, from media and alternative media around the world, everywhere from South America to Eastern Europe.\nI hope no one will take any offense at my decision to decline ALL of these requests, because with a few very specific exceptions, I am no longer going to accept any invitations to an interview or an appearance from the media or the alternative media. My reasoning is very straightforward;\nevery single time\nI talk to anyone in public, it causes problems and distractions that range from petty personal issues to significant and serious professional ones. They are not only a waste of time in and of themselves, but they take up an amount of time later that would be much more profitably spent on something other than drama and damage control.\nSo, I’m not doing it anymore. I was already not talking to the mainstream media; the\nReveal\nhitpiece that inspired IGG’s nonsensical gossiping about nonexistent money laundering was the final straw. Seriously, just how prodigiously stupid do you have to be to fail to grasp that producing and selling MORE content than people believe is possible given the resources concerned is the EXACT OPPOSITE of money laundering, which involves the fabrication of nonexistent sales of products that don’t exist to cover for the movement of money derived from other activities?\nBut talking to the alternative media isn’t much better. The various livestreamers, podcasters, bloggers, and writers all have their own agendas, which is fine, but those agendas don’t necessarily have anything to do with mine even when our ideological alignments are not in opposition. If people want to know what I think, I have written and published 10 nonfiction books, written 535 columns, posted more than 20,000 blog posts, and recorded nine Voxiversity videos. I suggest anyone who is curious about my opinion on anything to consult any or all of those sources of information.\nNow, I will certainly continue to talk to authors who are published by Castalia House. I will continue to talk to the retail outlets for our books and comics and games. I will continue to talk to my old friends and acquaintances with whom I have a personal relationship. But otherwise, I will not be granting interviews to anyone or appearing on any television shows, livestreams, or podcasts, so please don’t trouble to invite me even if you are confident you have only the best of intentions.",
  "tags": [
    "interview"
  ],
  "categories": [],
  "sitemap_lastmod": "2018-11-23T14:27:41+00:00"
}