{
  "url": "https://voxday.net/2018/11/25/rethinking-corporatism/",
  "scraped_at": "2025-12-20T05:18:06.086812",
  "title": "Rethinking corporatism",
  "date_display": "November 25, 2018",
  "date_iso": "2018-11-25T13:50:10+00:00",
  "date_from_url": "2018-11-25",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>Corporations are NOT capitalism, as the fact that some of the biggest corporations in the world are Chinese corporations registered in the People’s Republic of China run by the Communist Party. And the more one looks into all of the various aspects of corporatist society, from the mercenary pirate class that runs them to their short-term quarterly focus to their manipulation of the political system to the problems of regulatory capture, the more one has to wonder <a href=\"https://freebeacon.com/issues/patently-offensive/\">if they are worth the trouble</a> they invariably cause:</p><blockquote><p>Anyone who uses a computer or television has enjoyed the fruits of Gil Hyatt’s labor. He has pioneered technology and computer programming used by Panasonic, Sony, Philips, and Toshiba. He poured the licensing fees back into the lab where he has continued his research for decades. But beginning in the mid-1990’s, Hyatt said the U.S. Patent and Trademark Office (PTO) began enforcing a blockade against his patent applications. The agency, his suit claims, went so far as to create a dedicated group of regulators committed to delaying numerous applications until the 80-year-old inventor expires.</p><p>“The PTO founded what the agency calls the ‘Hyatt Unit’ in 2012 for the purpose of miring all of Mr. Hyatt’s applications in administrative purgatory until Mr. Hyatt gives up or dies,” the suit says….</p><p>Hyatt is no stranger to delays. He waited 22 years before the microprocessing tech he pioneered received a patent in 1990—one of the 75 patents has obtained from the agency before seeing his applications go seemingly dormant. The agency treated him as a “submariner”—one who adds small tweaks to existing patents to generate new ones—or worse a “patent troll”—a person who uses patents solely to sue other companies in the same field. Hyatt insists he is neither.</p><p>“I believe that the PTO, starting in the mid-90s was very strongly against individual inventors and were being lobbied and to some degree controlled by big companies,” Hyatt said. “I’ve never litigated against a company for infringement—I’ve never sued anyone for patents.”</p><p>PTO has argued that Hyatt is inappropriately attempting “to have this Court provide oversight into the complex and ongoing examination of his almost 400 applications comprised of over 115,000 claims.” The agency says the Court cannot issue a review until it renders a final judgment on the worthiness of the applications. PTO blamed Hyatt for the decades-long delay, saying his litigation “only serve to inhibit the agency from coming to a final decision.”</p><p>“There is simply no legal basis for the relief Mr. Hyatt seeks beyond the actions the USPTO has already taken,” the agency said in a motion to dismiss. “Agencies need the freedom to deliberate and come to final decisions on their own before the courts step in and review.”</p></blockquote><p>Who watches the watchers? The more things change, the more obvious it is that human nature doesn’t.</p></div>",
  "content_text": "Corporations are NOT capitalism, as the fact that some of the biggest corporations in the world are Chinese corporations registered in the People’s Republic of China run by the Communist Party. And the more one looks into all of the various aspects of corporatist society, from the mercenary pirate class that runs them to their short-term quarterly focus to their manipulation of the political system to the problems of regulatory capture, the more one has to wonder\nif they are worth the trouble\nthey invariably cause:\nAnyone who uses a computer or television has enjoyed the fruits of Gil Hyatt’s labor. He has pioneered technology and computer programming used by Panasonic, Sony, Philips, and Toshiba. He poured the licensing fees back into the lab where he has continued his research for decades. But beginning in the mid-1990’s, Hyatt said the U.S. Patent and Trademark Office (PTO) began enforcing a blockade against his patent applications. The agency, his suit claims, went so far as to create a dedicated group of regulators committed to delaying numerous applications until the 80-year-old inventor expires.\n“The PTO founded what the agency calls the ‘Hyatt Unit’ in 2012 for the purpose of miring all of Mr. Hyatt’s applications in administrative purgatory until Mr. Hyatt gives up or dies,” the suit says….\nHyatt is no stranger to delays. He waited 22 years before the microprocessing tech he pioneered received a patent in 1990—one of the 75 patents has obtained from the agency before seeing his applications go seemingly dormant. The agency treated him as a “submariner”—one who adds small tweaks to existing patents to generate new ones—or worse a “patent troll”—a person who uses patents solely to sue other companies in the same field. Hyatt insists he is neither.\n“I believe that the PTO, starting in the mid-90s was very strongly against individual inventors and were being lobbied and to some degree controlled by big companies,” Hyatt said. “I’ve never litigated against a company for infringement—I’ve never sued anyone for patents.”\nPTO has argued that Hyatt is inappropriately attempting “to have this Court provide oversight into the complex and ongoing examination of his almost 400 applications comprised of over 115,000 claims.” The agency says the Court cannot issue a review until it renders a final judgment on the worthiness of the applications. PTO blamed Hyatt for the decades-long delay, saying his litigation “only serve to inhibit the agency from coming to a final decision.”\n“There is simply no legal basis for the relief Mr. Hyatt seeks beyond the actions the USPTO has already taken,” the agency said in a motion to dismiss. “Agencies need the freedom to deliberate and come to final decisions on their own before the courts step in and review.”\nWho watches the watchers? The more things change, the more obvious it is that human nature doesn’t.",
  "tags": [
    "corpocracy"
  ],
  "categories": [],
  "sitemap_lastmod": "2018-11-25T13:50:10+00:00"
}