{
  "url": "https://voxday.net/2018/11/03/rip-dr-z/",
  "scraped_at": "2025-12-20T05:15:26.646874",
  "title": "RIP Dr. Z",
  "date_display": "November 3, 2018",
  "date_iso": "2018-11-03T15:43:11+00:00",
  "date_from_url": "2018-11-03",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>While I enjoyed Peter King, Dr. Z was always my favorite of Sports Illustrated’s Big Three football writers. His acerbic, opinionated style might not well have gone down with television viewers – he was fired by ESPN – but he was the inspiration for all the detailed analysis now provided by the likes of Football Outsiders and ProFootball Focus.</p><p><a href=\"https://www.si.com/nfl/2018/11/01/paul-zimmerman-dr-z-sports-illustrated-best-stories\">His articles</a> are a wealth of football history, dating back to the all-time great Notre Dame teams of 1946 and 1947 and the unheralded stars of the AAFC. He truly lived a life in football, and he was one of the sport’s greatest historians. His insight was deep, as indicated by this offhand observation in an article on the New York Giants defeat of the Buffalo Bills in Super Bowl XXV:</p><blockquote><p>“I want size on my entire defense,” says Parcells, “not only on my front seven, but in my secondary. [Five of his nine defensive backs weigh 200 pounds or more, and no defender weighs less than 190.] The defensive backs have to be physical on the receivers, jam them. Sure, they’ll get their share of catches, but they’re going to pay for them.”</p><p>That was the heart of the defensive scheme New York threw at Buffalo. Parcells was in charge of the overall concept, but the implementation was left to Bill Belichick, the brilliant, 38-year-old defensive coordinator who has head coach written all over him.</p></blockquote><p>We can hardly hold it against him that he did not predict Belichick would subsequently become the greatest NFL coach of all time, as he clearly perceived Belichick’s unusual potential. His attention to detail bordered on the obsessive; he made a habit of timing the performance of the national athems. My favorite feature was his post-season ratings of the NFL announcing teams, where he spoke for the viewers with the assurance of a subject-matter expert.</p><blockquote class=\"tr_bq\"><p>The worst is the search for the eternal “story line,” a favorite device of production people but something I’ve always felt is a deadly trap. “Here’s the story line,” we hear at the top of the show, or “among the many story lines,” etc. No, the story line is what develops from the game itself, and as an old handicapper, I can tell you that most of the time it differs from preconceived notions. So why bother with it at all? Why get locked into such a static device, instead of merely letting the game take its course?</p></blockquote><p>He was an old school man in a new school world, but he never compromised or concealed his opinions. He was also a wine aficionado and wasn’t afraid to demonstrate that he loved his wife as much as the sport to which he dedicated his life. He was, in short, a genuine man, and the world is fortunate that he left us such a treasure trove of his work.</p><p>Perhaps the best compliment one can pay him is to observe that if an alien were to come across the ruins of the planet Earth centuries in the future, the archive of Dr. Z’s writings would not merely suffice to allow that alien to understand the game of football, it would make that alien a fan of the defunct sport.</p></div>",
  "content_text": "While I enjoyed Peter King, Dr. Z was always my favorite of Sports Illustrated’s Big Three football writers. His acerbic, opinionated style might not well have gone down with television viewers – he was fired by ESPN – but he was the inspiration for all the detailed analysis now provided by the likes of Football Outsiders and ProFootball Focus.\nHis articles\nare a wealth of football history, dating back to the all-time great Notre Dame teams of 1946 and 1947 and the unheralded stars of the AAFC. He truly lived a life in football, and he was one of the sport’s greatest historians. His insight was deep, as indicated by this offhand observation in an article on the New York Giants defeat of the Buffalo Bills in Super Bowl XXV:\n“I want size on my entire defense,” says Parcells, “not only on my front seven, but in my secondary. [Five of his nine defensive backs weigh 200 pounds or more, and no defender weighs less than 190.] The defensive backs have to be physical on the receivers, jam them. Sure, they’ll get their share of catches, but they’re going to pay for them.”\nThat was the heart of the defensive scheme New York threw at Buffalo. Parcells was in charge of the overall concept, but the implementation was left to Bill Belichick, the brilliant, 38-year-old defensive coordinator who has head coach written all over him.\nWe can hardly hold it against him that he did not predict Belichick would subsequently become the greatest NFL coach of all time, as he clearly perceived Belichick’s unusual potential. His attention to detail bordered on the obsessive; he made a habit of timing the performance of the national athems. My favorite feature was his post-season ratings of the NFL announcing teams, where he spoke for the viewers with the assurance of a subject-matter expert.\nThe worst is the search for the eternal “story line,” a favorite device of production people but something I’ve always felt is a deadly trap. “Here’s the story line,” we hear at the top of the show, or “among the many story lines,” etc. No, the story line is what develops from the game itself, and as an old handicapper, I can tell you that most of the time it differs from preconceived notions. So why bother with it at all? Why get locked into such a static device, instead of merely letting the game take its course?\nHe was an old school man in a new school world, but he never compromised or concealed his opinions. He was also a wine aficionado and wasn’t afraid to demonstrate that he loved his wife as much as the sport to which he dedicated his life. He was, in short, a genuine man, and the world is fortunate that he left us such a treasure trove of his work.\nPerhaps the best compliment one can pay him is to observe that if an alien were to come across the ruins of the planet Earth centuries in the future, the archive of Dr. Z’s writings would not merely suffice to allow that alien to understand the game of football, it would make that alien a fan of the defunct sport.",
  "tags": [
    "sports"
  ],
  "categories": [],
  "sitemap_lastmod": "2018-11-03T15:43:11+00:00"
}