{
  "url": "https://voxday.net/2018/11/17/slandered-by-the-secret-king/",
  "scraped_at": "2025-12-20T05:17:06.294718",
  "title": "Slandered by the Secret King",
  "date_display": "November 17, 2018",
  "date_iso": "2018-11-17T13:56:53+00:00",
  "date_from_url": "2018-11-17",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>Two-Face van Sciver is clearly shaken by something, as he’s now emotionally projecting worse than the average SJW and resorting to outright slander. Perhaps Nick Rekeita informed him that IndieGoGo is going to be required to turn over all of their communications with him to Arkhaven as part of the discovery process permitted by the required arbitration system. Or perhaps it’s just the strain of Cyberfrog being late and 2VS feeling the pressure to deliver something capable of justifying more than half a million dollars’ worth of hype. This is from the transcript of <a href=\"https://www.youtube.com/watch?v=QVhuoU6uBUM\">his November 15th video</a> called <i>The FUTURE of the CG Movement</i>.</p><blockquote><p>You know about John Del Arroz, and  I’ll tell you guys here, you know John Del Arroz, basically, I’m not sure what  his whole thing with white nationalism  was. He says “I was just explaining what  it is that’s not how I feel.” That’s not  what I remember him saying when I heard  him say it, but I’ll take his word for it. Uh, the problem is, and I told him  privately, I said, “yeah you know, listen, even if it’s true that everyone’s  smearing you as a white nationalist and  you’re not, we all misheard, you  everyone knows you an apology because  that’s a serious thing.” But the next  thing you know, when Vox Day tried to  take over ComicsGate and I fought back, he sided with Vox Day in a really  snake-like way, and then what he did  after we had kind of, after we had sort  of, it seemed, made up, um, he started to he  started to mess with me on behalf of Vox Day, like he became Vox Day’s little toady.</p><p>Vox Day said, “you think that you can stop  me with, you think you can stop me with,  with your copyright trademark stuff, I’ll  show you what trademark, you know what I  can do with trademark, I’ll play with you  with that. So what he did was he went on Amazon.com and he launched a parody kind of, of CyberFrog, but spelled with a P like PsyberFrog, and he put it up for sale  on, on Amazon.com. Now I never would have  known about this because I don’t talk to  Vox Day so he wouldn’t, I wouldn’t have  found out, so who was the one who was  assigned to let me know that this troll  had happened?  John Del Arroz! And he shows up  immediately and goes, “hey man, I just  wanted to let you know about this, like  what do you think of this, like that’s  wrong,” and I was like, I got it, so you  guys are just gonna do this, what what’s  next, it’s gonna be like cyber frog but  spelled like TSyberfrog, I mean like, are  you guys just gonna do this just to show  that you can get around? I get it, I get  it, it’s funny, now stop it!</p><p>So after that,  like, I just kind of said, all right this  guy is there’s something up with him. I  don’t know what his thing is. I don’t  know what what his thing is, but like if  he’s gonna be Vox Day’s toady and troll  me on behalf of Vox, like, I just, get away  from me. Kind of, you know, like, just get  away from me! But me saying get away from  me, like, that’s apparently, you’re not  allowed to just tell people to go away. You used to be able to tell people to go  away, now when you tell people to go away,  they go “he’s harassing me by telling me  to go away, how dare he told me to go away, this guy,  and he’s turned everyone against me and  he’s telling me to go away!” No, I just, I  don’t, I don’t like you, I think you’re a  snake, you’ve proven yourself to be a  snake over and over again. I don’t know  what’s up with the white nationalism  thing, but you know it seemed to me that  you know that’s what you said, and then  you’re gonna do this on behalf of Vox Day? You, you know, it’s, it’s just two-faced! Get away, you’re trouble.</p></blockquote><p>First of all, as you might expect, 2VS is shamelessly and blatantly lying. And he knows he is lying. I did nothing of the sort. I didn’t say that and I didn’t do that. I had absolutely nothing to do with <a href=\"https://www.amazon.com/Psyberfrog-Comics-Adventure-Reagan-Wright-ebook/dp/B07H5DQ6GH/\">this Psyberfrog parody</a>. I didn’t create it, I didn’t launch it, I didn’t put it on Amazon, I didn’t tell anyone to do it and I didn’t suggest the idea to anyone do. This is straightforward slander and I can easily prove it by providing a court with the complete list of all of our products in our Amazon accounts.</p><p>Second, Jon Del Arroz is not my toady. He’s not one of my 535 Vile Faceless Minions. He’s not Dread Ilk. Nor is he two-faced or snake-like; 2VS is clearly projecting. Jon is, of course, one of our Dark Legion and Castalia House authors, as we will be publishing his <i>Flying Sparks</i> as well as his Alt-Hero novel, and he was an outspoken figure within ComicsGate who refused to denounce and disavow me, which is probably why 2VS is attacking him and attempting to imply that Jon is a white nationalist despite being one of the leading Hispanic science fiction authors. And speaking of Jon Del Arroz, here is his take on <a href=\"http://delarroz.com/2018/11/16/a-failed-movement-in-three-acts/\">why ComicsGate fell apart</a>.</p><p>Third, I never tried to take over ComicsGate and 2VS knows that better than anyone. Again, he is projecting his own behavior onto others and repeatedly lying to cover the fact that he had no objection to my acquisition of the imprint and creation of a logo until others reacted badly to it.</p><p>And fourth, everyone here knows that if I were to launch a parody of something, it would be high-quality and quite likely better than the original. Read <i>The Corroding Empire Book One: Corrosion</i> and <i>The Collapsing Empire</i>, if you harbor any doubts about that. If I were to do a parody of a 2VS comic, I would hire a good illustrator and a good colorist, then publish a comic called <i>Rainbow Brutus</i> in January which would almost certainly be considerably more entertaining than whatever hapless story 2VS will end up cobbling together when <i>Rainbow Brute</i> finally appears in April 2021.</p><p>2VS is a good example of what happens when Gammas find themselves in positions of leadership. It never ends well.</p></div>",
  "content_text": "Two-Face van Sciver is clearly shaken by something, as he’s now emotionally projecting worse than the average SJW and resorting to outright slander. Perhaps Nick Rekeita informed him that IndieGoGo is going to be required to turn over all of their communications with him to Arkhaven as part of the discovery process permitted by the required arbitration system. Or perhaps it’s just the strain of Cyberfrog being late and 2VS feeling the pressure to deliver something capable of justifying more than half a million dollars’ worth of hype. This is from the transcript of\nhis November 15th video\ncalled\nThe FUTURE of the CG Movement\n.\nYou know about John Del Arroz, and  I’ll tell you guys here, you know John Del Arroz, basically, I’m not sure what  his whole thing with white nationalism  was. He says “I was just explaining what  it is that’s not how I feel.” That’s not  what I remember him saying when I heard  him say it, but I’ll take his word for it. Uh, the problem is, and I told him  privately, I said, “yeah you know, listen, even if it’s true that everyone’s  smearing you as a white nationalist and  you’re not, we all misheard, you  everyone knows you an apology because  that’s a serious thing.” But the next  thing you know, when Vox Day tried to  take over ComicsGate and I fought back, he sided with Vox Day in a really  snake-like way, and then what he did  after we had kind of, after we had sort  of, it seemed, made up, um, he started to he  started to mess with me on behalf of Vox Day, like he became Vox Day’s little toady.\nVox Day said, “you think that you can stop  me with, you think you can stop me with,  with your copyright trademark stuff, I’ll  show you what trademark, you know what I  can do with trademark, I’ll play with you  with that. So what he did was he went on Amazon.com and he launched a parody kind of, of CyberFrog, but spelled with a P like PsyberFrog, and he put it up for sale  on, on Amazon.com. Now I never would have  known about this because I don’t talk to  Vox Day so he wouldn’t, I wouldn’t have  found out, so who was the one who was  assigned to let me know that this troll  had happened?  John Del Arroz! And he shows up  immediately and goes, “hey man, I just  wanted to let you know about this, like  what do you think of this, like that’s  wrong,” and I was like, I got it, so you  guys are just gonna do this, what what’s  next, it’s gonna be like cyber frog but  spelled like TSyberfrog, I mean like, are  you guys just gonna do this just to show  that you can get around? I get it, I get  it, it’s funny, now stop it!\nSo after that,  like, I just kind of said, all right this  guy is there’s something up with him. I  don’t know what his thing is. I don’t  know what what his thing is, but like if  he’s gonna be Vox Day’s toady and troll  me on behalf of Vox, like, I just, get away  from me. Kind of, you know, like, just get  away from me! But me saying get away from  me, like, that’s apparently, you’re not  allowed to just tell people to go away. You used to be able to tell people to go  away, now when you tell people to go away,  they go “he’s harassing me by telling me  to go away, how dare he told me to go away, this guy,  and he’s turned everyone against me and  he’s telling me to go away!” No, I just, I  don’t, I don’t like you, I think you’re a  snake, you’ve proven yourself to be a  snake over and over again. I don’t know  what’s up with the white nationalism  thing, but you know it seemed to me that  you know that’s what you said, and then  you’re gonna do this on behalf of Vox Day? You, you know, it’s, it’s just two-faced! Get away, you’re trouble.\nFirst of all, as you might expect, 2VS is shamelessly and blatantly lying. And he knows he is lying. I did nothing of the sort. I didn’t say that and I didn’t do that. I had absolutely nothing to do with\nthis Psyberfrog parody\n. I didn’t create it, I didn’t launch it, I didn’t put it on Amazon, I didn’t tell anyone to do it and I didn’t suggest the idea to anyone do. This is straightforward slander and I can easily prove it by providing a court with the complete list of all of our products in our Amazon accounts.\nSecond, Jon Del Arroz is not my toady. He’s not one of my 535 Vile Faceless Minions. He’s not Dread Ilk. Nor is he two-faced or snake-like; 2VS is clearly projecting. Jon is, of course, one of our Dark Legion and Castalia House authors, as we will be publishing his\nFlying Sparks\nas well as his Alt-Hero novel, and he was an outspoken figure within ComicsGate who refused to denounce and disavow me, which is probably why 2VS is attacking him and attempting to imply that Jon is a white nationalist despite being one of the leading Hispanic science fiction authors. And speaking of Jon Del Arroz, here is his take on\nwhy ComicsGate fell apart\n.\nThird, I never tried to take over ComicsGate and 2VS knows that better than anyone. Again, he is projecting his own behavior onto others and repeatedly lying to cover the fact that he had no objection to my acquisition of the imprint and creation of a logo until others reacted badly to it.\nAnd fourth, everyone here knows that if I were to launch a parody of something, it would be high-quality and quite likely better than the original. Read\nThe Corroding Empire Book One: Corrosion\nand\nThe Collapsing Empire\n, if you harbor any doubts about that. If I were to do a parody of a 2VS comic, I would hire a good illustrator and a good colorist, then publish a comic called\nRainbow Brutus\nin January which would almost certainly be considerably more entertaining than whatever hapless story 2VS will end up cobbling together when\nRainbow Brute\nfinally appears in April 2021.\n2VS is a good example of what happens when Gammas find themselves in positions of leadership. It never ends well.",
  "tags": [
    "cuckservative"
  ],
  "categories": [],
  "sitemap_lastmod": "2018-11-17T13:56:53+00:00"
}