{
  "url": "https://voxday.net/2018/11/12/so-much-for-those-lofty-principles/",
  "scraped_at": "2025-12-20T05:16:26.556443",
  "title": "So much for those lofty principles",
  "date_display": "November 12, 2018",
  "date_iso": "2018-11-12T13:37:25+00:00",
  "date_from_url": "2018-11-12",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>It took just over one year for Andrew Torba <a href=\"https://archive.fo/3MA6r#selection-699.0-719.349\">to climb down</a> from his untenable high horse of “free speech uber alles”:</p><blockquote class=\"tr_bq\"><p>Andrew Torba @a<br>This is unacceptable and we have taken action against this account. Targeting individuals with threatening language and behavior behind an anonymous account is cowardly and foolish. Users that do this will face accountability from Gab. </br></p></blockquote><p>Whatever happened to “suck it up, crybaby?” What a hypocritical moron. This is why Gab is doomed to failure. You simply can’t expect an organization to succeed, let alone a startup, when it is run by someone as immature, hot-headed, and totally unable to anticipate the obvious as Torba.</p><blockquote class=\"tr_bq\"><p>Andrew Torba @a<br>I don’t want to hear it from the people who want to play semantic games about what is actually a threat and what isn’t. The intent here is very clear and aimed at a specific individual user. It’s malicious and designed to terrorize someone into silence. The person who recieved these (and many more,) did feel threatened and did contact us about it.</br></p></blockquote><p>Of course he doesn’t want to hear from everyone who is capable of remembering his oft-expressed previous position from all of six months ago. Gab is a train wreck in a dumpster fire and it will never be capable of becoming a genuine alternative to Twitter. My only regret is that I didn’t continue to ignore Torba when he was lobbying Spacebunny to get me to pay attention to his emails.</p><p>Thanks to Oneway’s brilliant ongoing developments, Infogalactic will soon be offering a Twitter alternative that will actually work in the not-very-distant future. And no, we will not be promising free speech to social rejects and retards, to the contrary, we promise to clamp down relentlessly and remorselessly on all social media jackassery, trollery, and bantz because we are more than happy to leave that time-wasting, mind-numbing gamma nonsense to Gab and whatever other sites wish to cater to the unpleasant and the unproductive.</p></div>",
  "content_text": "It took just over one year for Andrew Torba\nto climb down\nfrom his untenable high horse of “free speech uber alles”:\nAndrew Torba @a\nThis is unacceptable and we have taken action against this account. Targeting individuals with threatening language and behavior behind an anonymous account is cowardly and foolish. Users that do this will face accountability from Gab.\nWhatever happened to “suck it up, crybaby?” What a hypocritical moron. This is why Gab is doomed to failure. You simply can’t expect an organization to succeed, let alone a startup, when it is run by someone as immature, hot-headed, and totally unable to anticipate the obvious as Torba.\nAndrew Torba @a\nI don’t want to hear it from the people who want to play semantic games about what is actually a threat and what isn’t. The intent here is very clear and aimed at a specific individual user. It’s malicious and designed to terrorize someone into silence. The person who recieved these (and many more,) did feel threatened and did contact us about it.\nOf course he doesn’t want to hear from everyone who is capable of remembering his oft-expressed previous position from all of six months ago. Gab is a train wreck in a dumpster fire and it will never be capable of becoming a genuine alternative to Twitter. My only regret is that I didn’t continue to ignore Torba when he was lobbying Spacebunny to get me to pay attention to his emails.\nThanks to Oneway’s brilliant ongoing developments, Infogalactic will soon be offering a Twitter alternative that will actually work in the not-very-distant future. And no, we will not be promising free speech to social rejects and retards, to the contrary, we promise to clamp down relentlessly and remorselessly on all social media jackassery, trollery, and bantz because we are more than happy to leave that time-wasting, mind-numbing gamma nonsense to Gab and whatever other sites wish to cater to the unpleasant and the unproductive.",
  "tags": [
    "#AltTech"
  ],
  "categories": [],
  "sitemap_lastmod": "2018-11-12T13:37:25+00:00"
}