{
  "url": "https://voxday.net/2018/11/20/taking-their-best-shots/",
  "scraped_at": "2025-12-20T05:17:31.628883",
  "title": "Taking their best shots",
  "date_display": "November 20, 2018",
  "date_iso": "2018-11-20T19:08:34+00:00",
  "date_from_url": "2018-11-20",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>It’s always interesting to see how desperate SJWs, or Peterson fans, are to convince people to move along, move along. There is nothing to see here! But you have to give Roderic at least a little credit. After all, he did go to the trouble of actually buying the book and reading the introduction and one chapter. That’s considerably more than the average fake reviewer ever manages.</p><blockquote><p><b><a href=\"https://www.amazon.com/gp/customer-reviews/R20FSBYIK8UOTF/ref=cm_cr_arp_d_rvw_ttl?ie=UTF8&amp;ASIN=B07JY9XV38\">A Cringeworthy Read</a></b></p><p>At the outset Day tells us why he lit into Peterson. Peterson wrote an article that rejected the idea that there is a conspiracy among Jews to promote the careers of fellow Jews over those of more deserving gentiles.. Day knows that this conspiracy exists because Ben Shapiro is doing so much better than he is. What else could explain this if there’s no conspiracy? It’s also very important to Day that everyone realize that the Jews are not smarter on average than other groups, as Peterson insists. The evidence Day provides for this is questionable — you can’t compare IQ averages obtained from different countries no doubt using different methods to measure it in the way that he does, and there are other studies to support the idea that Ashkenazi Jews are more intelligent on average plus an undeniable record of achievement by that group in the arts and sciences. Peterson’s other great sin was to fail to stand up for a conservative journalist who was criticized for being insufficiently tough in her interview with the Daily Stormer. Foreshadowing the rest of the book, Day lambasts Peterson for applying journalistic standards to that journalist that Peterson never meant to apply. It was clear that Peterson was just concerned about the public relations implications of what the journalist did. Regardless, that Peterson disagreed with Day on these issues was enough to convince Day that Peterson is a mountebank full of evil intent and malice who intends to mislead and lie to the public, and everything else that Peterson has ever said or done is put through that filter. Day set out to expose Peterson for the villain that he is and discredit his work through a torrent of videos, postings on social media, and now this book.</p><p>Day’s approach is to say that Peterson said something he didn’t say, to misinterpret something Peterson said, to use standards of thought that Peterson never meant to employ, and so on, and then to lambast Peterson for the resulting errors and absurdities. There is also a tendency to find small errors in what Peterson writes and then blow them all out of proportion such that everything else that Peterson wrote is supposedly thereby discredited. If Day had a legitimate criticism to make about what Peterson wrote I couldn’t find it.</p><p>For example, in Day’s takedown of Peterson’s first rule chapter, Stand Up Straight With Your Shoulder’s Back, in the 12 Rules book, Day heaps scorn on Peterson’s use of the lobster. Day claims that Peterson wrote that humans “are direct inheritors of the social hierarchy of crustaceans and share common ancestry with them” and therefore share some of their characteristics including brain chemistry and behavior, but of course humans didn’t evolve from lobsters, and Day goes on at length about this error and how it shows that Peterson is an ignorant clown. He even brings in an evolutionary biologist who he quotes to bolster this idea. The problem with this is that Peterson never said that humans evolved from lobsters in any way. The chapter isn’t about evolution. What he says is that lobsters are very primitive and ancient, and yet even at that very early point in history when they appeared they had established social hierarchies. They even use serotonin, a brain chemical, to track their status in the hierarchy, similar to the way human brains use it, our mood being good when our status and our serotonin is up and down when those things are down. (This is not surprising since all bilaterally symmetrical creatures, even worms, use serotonin in their nervous systems.) So, as Peterson says elsewhere, social hierarchies are not something that is created arbitrarily by white males to maintain their dominance, they are very old biology. Peterson uses serotonin and the lobster as metaphors for how we are hard wired to live in hierarchies,</p><p>The rest of the chapter is a bizarre misinterpretation of Peterson that ends with a quote from Peterson. The quote does not appear anywhere in the lobster chapter or in the 12 Rules book although Day implies that it does. It may be from something else that Peterson wrote. Without the proper context it’s impossible to say if that quote planted there is misleading us or not. Suffice to say it does not say what the rest of the chapter says. Peterson is not telling us to be mediocre, as Day claims. Peterson is giving us advice about how we can improve ourselves and elevate our social status and thereby our sense of well being. That we will most likely end up neither at the top nor the bottom of the hierarchy but somewhere in the middle is not something to be held up to contempt. It’s just they way things are most of the time. And it’s pretty tough at the top, anyway.</p></blockquote><p>The primary problem, of course, is that I never say that Peterson said something he didn’t clearly say, assume, or imply. I do not construct strawmen. While it can be difficult to ascertain what he is saying due to his intentionally incoherent writing, the connection Peterson draws between lobster and human is clearly not just metaphorical, as you can see for yourself from this selection from <i>12 Rules for Life, </i>but posits the very claim of common ancestry that Roderic denies.</p><blockquote><p>Their nervous systems are comparatively simple, with large, easily observable neurons, the magic cells of the brain. Because of this, scientists have been able to map the neural circuitry of lobsters very accurately. This has helped us understand the structure and function of the brain and behaviour of more complex animals, including human beings. Lobsters have more in common with you than you might think….<br>All that matters, from a Darwinian perspective, is permanence—and the dominance hierarchy, however social or cultural it might appear, has been around for some half a billion years. It’s permanent. It’s real. The dominance hierarchy is not capitalism. It’s not communism, either, for that matter. It’s not the military-industrial complex. It’s not the patriarchy—that disposable, malleable, arbitrary cultural artefact. It’s not even a human creation; not in the most profound sense. It is instead a near-eternal aspect of the environment, and much of what is blamed on these more ephemeral manifestations is a consequence of its unchanging existence. We (the sovereign we, the we that has been around since the beginning of life) have lived in a dominance hierarchy for a long, long time. We were struggling for position before we had skin, or hands, or lungs, or bones. There is little more natural than culture. Dominance hierarchies are older than trees.</br></p><p>The part of our brain that keeps track of our position in the dominance hierarchy is therefore exceptionally ancient and fundamental. It is a master control system, modulating our perceptions, values, emotions, thoughts and actions. It powerfully affects every aspect of our Being, conscious and unconscious alike. This is why, when we are defeated, we act very much like lobsters who have lost a fight. Our posture droops. We face the ground. We feel threatened, hurt, anxious and weak. If things do not improve, we become chronically depressed. Under such conditions, we can’t easily put up the kind of fight that life demands, and we become easy targets for harder-shelled bullies. And it is not only the behavioural and experiential similarities that are striking. Much of the basic neurochemistry is the same.</p><p>Consider serotonin, the chemical that governs posture and escape in the lobster. Low-ranking lobsters produce comparatively low levels of serotonin. This is also true of low-ranking human beings (and those low levels decrease more with each defeat). Low serotonin means decreased confidence. Low serotonin means more response to stress and costlier physical preparedness for emergency—as anything whatsoever may happen, at any time, at the bottom of the dominance hierarchy (and rarely something good). Low serotonin means less happiness, more pain and anxiety, more illness, and a shorter lifespan—among humans, just as among crustaceans.</p></blockquote><p>And the chapter does not close with “a quote from Peterson” but with an explanation of the paradox that Peterson presents followed by a statement of the true meaning of Peterson’s chapter. As fake reviews go, Roderic tries harder than most, but the effect of his effort is spoiled by his obvious ineptitude. I give it a 3/10.</p><p>More honest Peterson defenders are finding that the case made against their hero is a substantial one and should not be dismissed lightly:</p><blockquote><p><b><a href=\"https://www.amazon.com/gp/customer-reviews/R2ZT1H75PCNX5P/ref=cm_cr_dp_d_rvw_ttl?ie=UTF8&amp;ASIN=B07JY9XV38\">Serious Criticism that Cannot Be Dismissed</a></b></p><p>I was initially very skeptical of these arguments, even writing a post defending Jordan Peterson against these criticisms. But the more I thought about them, the harder they were to ignore.</p><p>In substance, the points are substantial, namely:<br>1) Jordan Peterson has, in documented cases, misrepresented statistics, sources, and history<br>2) Jordan Peterson has, in documented cases, broken his own rules (namely, by lying)<br>3) It is asserted that Jordan Peterson’s argument is motivated by fear and cowardice<br>4) It is asserted that Jordan Peterson’s method of delivery is (seemingly intentionally) vague and left open to multiple interpretations, resulting in confusion and followers who believe that Jordan Peterson is making mutually exclusive assertions<br>5) Jordan Peterson has, in documented cases, not stood up for free speech when actually pressed on the subject.</br></br></br></br></br></p><p>These are not the only arguments made, but they were the most substantial and impactful for me personally.</p><p>If you have grown to love Jordan Peterson, I understand the anger, suspicion, and outrage you may feel. It was my initial reaction to some of these claims. After feeling that, I could not bring myself to try to shame people for going in for Dr. Peterson. However, I would encourage skeptics and defenders of Peterson to read the book and make the decision for themselves.</p></blockquote><p>I find it interesting that the aspects of the case against Jordan Peterson this reviewer found most convincing are the aspects that I considered little more than laying the foundation for the much more damning elements.</p></div>",
  "content_text": "It’s always interesting to see how desperate SJWs, or Peterson fans, are to convince people to move along, move along. There is nothing to see here! But you have to give Roderic at least a little credit. After all, he did go to the trouble of actually buying the book and reading the introduction and one chapter. That’s considerably more than the average fake reviewer ever manages.\nA Cringeworthy Read\nAt the outset Day tells us why he lit into Peterson. Peterson wrote an article that rejected the idea that there is a conspiracy among Jews to promote the careers of fellow Jews over those of more deserving gentiles.. Day knows that this conspiracy exists because Ben Shapiro is doing so much better than he is. What else could explain this if there’s no conspiracy? It’s also very important to Day that everyone realize that the Jews are not smarter on average than other groups, as Peterson insists. The evidence Day provides for this is questionable — you can’t compare IQ averages obtained from different countries no doubt using different methods to measure it in the way that he does, and there are other studies to support the idea that Ashkenazi Jews are more intelligent on average plus an undeniable record of achievement by that group in the arts and sciences. Peterson’s other great sin was to fail to stand up for a conservative journalist who was criticized for being insufficiently tough in her interview with the Daily Stormer. Foreshadowing the rest of the book, Day lambasts Peterson for applying journalistic standards to that journalist that Peterson never meant to apply. It was clear that Peterson was just concerned about the public relations implications of what the journalist did. Regardless, that Peterson disagreed with Day on these issues was enough to convince Day that Peterson is a mountebank full of evil intent and malice who intends to mislead and lie to the public, and everything else that Peterson has ever said or done is put through that filter. Day set out to expose Peterson for the villain that he is and discredit his work through a torrent of videos, postings on social media, and now this book.\nDay’s approach is to say that Peterson said something he didn’t say, to misinterpret something Peterson said, to use standards of thought that Peterson never meant to employ, and so on, and then to lambast Peterson for the resulting errors and absurdities. There is also a tendency to find small errors in what Peterson writes and then blow them all out of proportion such that everything else that Peterson wrote is supposedly thereby discredited. If Day had a legitimate criticism to make about what Peterson wrote I couldn’t find it.\nFor example, in Day’s takedown of Peterson’s first rule chapter, Stand Up Straight With Your Shoulder’s Back, in the 12 Rules book, Day heaps scorn on Peterson’s use of the lobster. Day claims that Peterson wrote that humans “are direct inheritors of the social hierarchy of crustaceans and share common ancestry with them” and therefore share some of their characteristics including brain chemistry and behavior, but of course humans didn’t evolve from lobsters, and Day goes on at length about this error and how it shows that Peterson is an ignorant clown. He even brings in an evolutionary biologist who he quotes to bolster this idea. The problem with this is that Peterson never said that humans evolved from lobsters in any way. The chapter isn’t about evolution. What he says is that lobsters are very primitive and ancient, and yet even at that very early point in history when they appeared they had established social hierarchies. They even use serotonin, a brain chemical, to track their status in the hierarchy, similar to the way human brains use it, our mood being good when our status and our serotonin is up and down when those things are down. (This is not surprising since all bilaterally symmetrical creatures, even worms, use serotonin in their nervous systems.) So, as Peterson says elsewhere, social hierarchies are not something that is created arbitrarily by white males to maintain their dominance, they are very old biology. Peterson uses serotonin and the lobster as metaphors for how we are hard wired to live in hierarchies,\nThe rest of the chapter is a bizarre misinterpretation of Peterson that ends with a quote from Peterson. The quote does not appear anywhere in the lobster chapter or in the 12 Rules book although Day implies that it does. It may be from something else that Peterson wrote. Without the proper context it’s impossible to say if that quote planted there is misleading us or not. Suffice to say it does not say what the rest of the chapter says. Peterson is not telling us to be mediocre, as Day claims. Peterson is giving us advice about how we can improve ourselves and elevate our social status and thereby our sense of well being. That we will most likely end up neither at the top nor the bottom of the hierarchy but somewhere in the middle is not something to be held up to contempt. It’s just they way things are most of the time. And it’s pretty tough at the top, anyway.\nThe primary problem, of course, is that I never say that Peterson said something he didn’t clearly say, assume, or imply. I do not construct strawmen. While it can be difficult to ascertain what he is saying due to his intentionally incoherent writing, the connection Peterson draws between lobster and human is clearly not just metaphorical, as you can see for yourself from this selection from\n12 Rules for Life,\nbut posits the very claim of common ancestry that Roderic denies.\nTheir nervous systems are comparatively simple, with large, easily observable neurons, the magic cells of the brain. Because of this, scientists have been able to map the neural circuitry of lobsters very accurately. This has helped us understand the structure and function of the brain and behaviour of more complex animals, including human beings. Lobsters have more in common with you than you might think….\nAll that matters, from a Darwinian perspective, is permanence—and the dominance hierarchy, however social or cultural it might appear, has been around for some half a billion years. It’s permanent. It’s real. The dominance hierarchy is not capitalism. It’s not communism, either, for that matter. It’s not the military-industrial complex. It’s not the patriarchy—that disposable, malleable, arbitrary cultural artefact. It’s not even a human creation; not in the most profound sense. It is instead a near-eternal aspect of the environment, and much of what is blamed on these more ephemeral manifestations is a consequence of its unchanging existence. We (the sovereign we, the we that has been around since the beginning of life) have lived in a dominance hierarchy for a long, long time. We were struggling for position before we had skin, or hands, or lungs, or bones. There is little more natural than culture. Dominance hierarchies are older than trees.\nThe part of our brain that keeps track of our position in the dominance hierarchy is therefore exceptionally ancient and fundamental. It is a master control system, modulating our perceptions, values, emotions, thoughts and actions. It powerfully affects every aspect of our Being, conscious and unconscious alike. This is why, when we are defeated, we act very much like lobsters who have lost a fight. Our posture droops. We face the ground. We feel threatened, hurt, anxious and weak. If things do not improve, we become chronically depressed. Under such conditions, we can’t easily put up the kind of fight that life demands, and we become easy targets for harder-shelled bullies. And it is not only the behavioural and experiential similarities that are striking. Much of the basic neurochemistry is the same.\nConsider serotonin, the chemical that governs posture and escape in the lobster. Low-ranking lobsters produce comparatively low levels of serotonin. This is also true of low-ranking human beings (and those low levels decrease more with each defeat). Low serotonin means decreased confidence. Low serotonin means more response to stress and costlier physical preparedness for emergency—as anything whatsoever may happen, at any time, at the bottom of the dominance hierarchy (and rarely something good). Low serotonin means less happiness, more pain and anxiety, more illness, and a shorter lifespan—among humans, just as among crustaceans.\nAnd the chapter does not close with “a quote from Peterson” but with an explanation of the paradox that Peterson presents followed by a statement of the true meaning of Peterson’s chapter. As fake reviews go, Roderic tries harder than most, but the effect of his effort is spoiled by his obvious ineptitude. I give it a 3/10.\nMore honest Peterson defenders are finding that the case made against their hero is a substantial one and should not be dismissed lightly:\nSerious Criticism that Cannot Be Dismissed\nI was initially very skeptical of these arguments, even writing a post defending Jordan Peterson against these criticisms. But the more I thought about them, the harder they were to ignore.\nIn substance, the points are substantial, namely:\n1) Jordan Peterson has, in documented cases, misrepresented statistics, sources, and history\n2) Jordan Peterson has, in documented cases, broken his own rules (namely, by lying)\n3) It is asserted that Jordan Peterson’s argument is motivated by fear and cowardice\n4) It is asserted that Jordan Peterson’s method of delivery is (seemingly intentionally) vague and left open to multiple interpretations, resulting in confusion and followers who believe that Jordan Peterson is making mutually exclusive assertions\n5) Jordan Peterson has, in documented cases, not stood up for free speech when actually pressed on the subject.\nThese are not the only arguments made, but they were the most substantial and impactful for me personally.\nIf you have grown to love Jordan Peterson, I understand the anger, suspicion, and outrage you may feel. It was my initial reaction to some of these claims. After feeling that, I could not bring myself to try to shame people for going in for Dr. Peterson. However, I would encourage skeptics and defenders of Peterson to read the book and make the decision for themselves.\nI find it interesting that the aspects of the case against Jordan Peterson this reviewer found most convincing are the aspects that I considered little more than laying the foundation for the much more damning elements.",
  "tags": [
    "BookReview"
  ],
  "categories": [],
  "sitemap_lastmod": "2018-11-20T19:08:34+00:00"
}