{
  "url": "https://voxday.net/2018/11/05/the-war-they-will-lose/",
  "scraped_at": "2025-12-20T05:15:36.176788",
  "title": "The war they will lose",
  "date_display": "November 5, 2018",
  "date_iso": "2018-11-05T10:18:43+00:00",
  "date_from_url": "2018-11-05",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>Fred Reed is alarmed by <a href=\"http://www.unz.com/freed/lets-have-a-war-with-russia/\">the recent preparations for war</a> on the part of the USA, China, and Russia:</p><blockquote><p>The United States seems to be contemplating war with Russia, Iran, China, or all three. Washington pushes NATO ever closer to Russia, leaves the nuclear-missile treaty and tries to destroy both countries and China economically. Why the push for war?</p><p>Simple. Asia is awakening. China grows economically at a scorching pace–and all power rests on economic power. China is a large country, America a medium-sized one. America’s roughly two hundred million whites do virtually all of the scientific work on which national power depends. China has a billion increasingly educated Han Chinese, a five-to-one advantage. China’s stated aim is to united Eurasia among other places in one vast commercial union. Washington’s pugnacity has pushed China, Iran, and Russia together. The chain of nations, Pakistan, Afghanistan, Iran, Iraq, Syria, and Turkey all totter between looking east and looking west. If Washington doesn’t stop this growth, the American Empire will be marginalized within decades.</p><p>This doesn’t threaten the American public. It threatens the Empire and Israel.</p></blockquote><p>The USA has to give up its empire and its Israel First foreign policy or it is going to be militarily defeated within the next 15 years. In fact, it is now possible that the breakup in the 2030s that I have predicted for nearly two decades will be triggered by that military defeat rather than by the economic collapse that I assumed.</p><p>In addition to the misuse and abuse of the US military for the last 17 years, China has systematically weakened the US military infrastructure under the aegis of US trade policy. The Red Army has clearly learned the lesson of WWII, which is that industrial infrastructure will defeat training, esprit de corps and tactics. <a href=\"https://thesaker.is/the-pentagon-realised-what-it-has-done-the-chinese-put-the-us-army-on-its-knees/\">The Pentagon has belatedly realized</a> that this is a serious problem, but the dumbing down and demoralization of the US population due to immigration renders it largely unable to even begin addressing it.</p><blockquote><p>In the declassified part of the research of the American Department of Defence it is mentioned that in the US there are difficulties with future deliveries of the power switches that nearly all American missiles are equipped with. As officials of the Pentagon report, the producer of these switches was closed down, but the highest military ranks learned about it only after it became clear that the power switches ended. And there is nowhere to take new ones from, because the producer disappeared into thin air a whole 2 years ago. One more striking example: the country’s only producer of solid rocket motors for “air-to-air” missiles, as the American officials write, “encountered technical production issues”, the reasons for which couldn’t be found even after government and military experts were involved. Attempts to restart production failed, and the Pentagon was obliged to employ a Norwegian company to ensure uninterrupted deliveries. Obviously, this indicates a certain technical degradation of the entire American system, because only the loss of some key competencies can explain a situation in which production cannot be restored and the problem cannot even be determined.</p><p>Whilst becoming acquainted with the complaints of the leadership of the American army it is difficult to rid oneself of the impression that it isn’t a document of the US Department of Defence dated September, 2018 that is in front of your eyes, but a description of the problems of the Russian army from the era of the dashing 90’s. Literally there is no direction in which there would be no serious or very serious problems, and often they even can’t be solved at the expense of the bottomless military budget.</p><p>In the section on nuclear weapon problems the Pentagon complains that in the US there isn’t the necessary number of engineers and technicians who would have the corresponding education, training, and US citizenship that are necessary for working with army nuclear objects. The mention of nationality is of importance, because American higher education institutions produce enough engineers, physicists, and representatives of other technical specialties and exact sciences, however a disproportionately large number of these graduates are foreigners, most often from the People’s Republic of China.</p></blockquote><p>The neo-liberal world order has failed. The US reign as the only global superpower is already over. The world is changing, so be prepared for new developments in foreign affairs that were beyond imagining only ten years ago. The core problem, as far as I can see it, is that the financial elite has become addicted to the profits of low-cost war without end; for the price of a few hundred American lives every year, they make vast sums of money.</p><p>But after all these years, after all these wars, they can’t imagine the US actually losing a war and the whole system coming to a crashing end without a safe retreat for them and their endless war profits, so they will keep pushing and pushing until they trigger the inevitable reaction from either a regional or a continental power.</p></div>",
  "content_text": "Fred Reed is alarmed by\nthe recent preparations for war\non the part of the USA, China, and Russia:\nThe United States seems to be contemplating war with Russia, Iran, China, or all three. Washington pushes NATO ever closer to Russia, leaves the nuclear-missile treaty and tries to destroy both countries and China economically. Why the push for war?\nSimple. Asia is awakening. China grows economically at a scorching pace–and all power rests on economic power. China is a large country, America a medium-sized one. America’s roughly two hundred million whites do virtually all of the scientific work on which national power depends. China has a billion increasingly educated Han Chinese, a five-to-one advantage. China’s stated aim is to united Eurasia among other places in one vast commercial union. Washington’s pugnacity has pushed China, Iran, and Russia together. The chain of nations, Pakistan, Afghanistan, Iran, Iraq, Syria, and Turkey all totter between looking east and looking west. If Washington doesn’t stop this growth, the American Empire will be marginalized within decades.\nThis doesn’t threaten the American public. It threatens the Empire and Israel.\nThe USA has to give up its empire and its Israel First foreign policy or it is going to be militarily defeated within the next 15 years. In fact, it is now possible that the breakup in the 2030s that I have predicted for nearly two decades will be triggered by that military defeat rather than by the economic collapse that I assumed.\nIn addition to the misuse and abuse of the US military for the last 17 years, China has systematically weakened the US military infrastructure under the aegis of US trade policy. The Red Army has clearly learned the lesson of WWII, which is that industrial infrastructure will defeat training, esprit de corps and tactics.\nThe Pentagon has belatedly realized\nthat this is a serious problem, but the dumbing down and demoralization of the US population due to immigration renders it largely unable to even begin addressing it.\nIn the declassified part of the research of the American Department of Defence it is mentioned that in the US there are difficulties with future deliveries of the power switches that nearly all American missiles are equipped with. As officials of the Pentagon report, the producer of these switches was closed down, but the highest military ranks learned about it only after it became clear that the power switches ended. And there is nowhere to take new ones from, because the producer disappeared into thin air a whole 2 years ago. One more striking example: the country’s only producer of solid rocket motors for “air-to-air” missiles, as the American officials write, “encountered technical production issues”, the reasons for which couldn’t be found even after government and military experts were involved. Attempts to restart production failed, and the Pentagon was obliged to employ a Norwegian company to ensure uninterrupted deliveries. Obviously, this indicates a certain technical degradation of the entire American system, because only the loss of some key competencies can explain a situation in which production cannot be restored and the problem cannot even be determined.\nWhilst becoming acquainted with the complaints of the leadership of the American army it is difficult to rid oneself of the impression that it isn’t a document of the US Department of Defence dated September, 2018 that is in front of your eyes, but a description of the problems of the Russian army from the era of the dashing 90’s. Literally there is no direction in which there would be no serious or very serious problems, and often they even can’t be solved at the expense of the bottomless military budget.\nIn the section on nuclear weapon problems the Pentagon complains that in the US there isn’t the necessary number of engineers and technicians who would have the corresponding education, training, and US citizenship that are necessary for working with army nuclear objects. The mention of nationality is of importance, because American higher education institutions produce enough engineers, physicists, and representatives of other technical specialties and exact sciences, however a disproportionately large number of these graduates are foreigners, most often from the People’s Republic of China.\nThe neo-liberal world order has failed. The US reign as the only global superpower is already over. The world is changing, so be prepared for new developments in foreign affairs that were beyond imagining only ten years ago. The core problem, as far as I can see it, is that the financial elite has become addicted to the profits of low-cost war without end; for the price of a few hundred American lives every year, they make vast sums of money.\nBut after all these years, after all these wars, they can’t imagine the US actually losing a war and the whole system coming to a crashing end without a safe retreat for them and their endless war profits, so they will keep pushing and pushing until they trigger the inevitable reaction from either a regional or a continental power.",
  "tags": [
    "war"
  ],
  "categories": [],
  "sitemap_lastmod": "2018-11-05T10:18:43+00:00"
}