{
  "url": "https://voxday.net/2018/11/30/three-more-rules-for-life/",
  "scraped_at": "2025-12-20T05:18:52.965548",
  "title": "Three more rules for life",
  "date_display": "November 30, 2018",
  "date_iso": "2018-11-30T22:25:28+00:00",
  "date_from_url": "2018-11-30",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>From Appendix C of the newly released <a href=\"https://aerbook.com/maker/productcard-4283759-1875.html\">paperback edition of Jordanetics</a>. The first five rules were <a href=\"http://voxday.blogspot.com/2018/11/appendix-c.html\">previously posted here</a>.</p><p><b>6. Set your face against evil.</b> You will encounter evil within and evil without on a daily basis. Stand against all of it, without fear, without hesitation, and without remorse. And when you fail, when you give into temptation, when you are defeated, regroup, repent, and rise again.</p><p><b>7. Do what is right.</b> Learn to listen to the still, small voice of conscience. Do what you know to be right, not what you can rationalize, justify, or excuse. If you have to talk yourself into something, then you probably already know in your heart of hearts that you are doing the wrong thing.</p><p><b>8. Tell the truth in kindness.</b> It is too hard and too exhausting to spend all your mental energies trying to keep track of an ever-growing multitude of exaggerations, false narratives, self-serving spins, and outright lies. Just tell the truth, as you best understand it, without taking pride in it or using it to hurt others.</p><p>Appendix C is now also included in <a href=\"https://www.amazon.com/Jordanetics-Journey-Humanitys-Greatest-Thinker-ebook/dp/B07JY9XV38/\">the Kindle edition</a>.</p><p>UPDATE: I also did <a href=\"https://www.youtube.com/watch?v=LILEdBAi1z8\">an early Darkstream</a> announcing the publication of Jordanetics in paperback. The man is already running scared; he’s STILL trying to explain away his Kavanaugh tweet.</p></div>",
  "content_text": "From Appendix C of the newly released\npaperback edition of Jordanetics\n. The first five rules were\npreviously posted here\n.\n6. Set your face against evil.\nYou will encounter evil within and evil without on a daily basis. Stand against all of it, without fear, without hesitation, and without remorse. And when you fail, when you give into temptation, when you are defeated, regroup, repent, and rise again.\n7. Do what is right.\nLearn to listen to the still, small voice of conscience. Do what you know to be right, not what you can rationalize, justify, or excuse. If you have to talk yourself into something, then you probably already know in your heart of hearts that you are doing the wrong thing.\n8. Tell the truth in kindness.\nIt is too hard and too exhausting to spend all your mental energies trying to keep track of an ever-growing multitude of exaggerations, false narratives, self-serving spins, and outright lies. Just tell the truth, as you best understand it, without taking pride in it or using it to hurt others.\nAppendix C is now also included in\nthe Kindle edition\n.\nUPDATE: I also did\nan early Darkstream\nannouncing the publication of Jordanetics in paperback. The man is already running scared; he’s STILL trying to explain away his Kavanaugh tweet.",
  "tags": [
    "philosophy"
  ],
  "categories": [],
  "sitemap_lastmod": "2018-11-30T22:25:28+00:00"
}