{
  "url": "https://voxday.net/2018/11/18/were-here-to-help/",
  "scraped_at": "2025-12-20T05:17:15.021514",
  "title": "We’re here to help",
  "date_display": "November 18, 2018",
  "date_iso": "2018-11-18T16:53:18+00:00",
  "date_from_url": "2018-11-18",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>The USA <a href=\"https://www.rt.com/news/444277-us-australia-naval-base-china/\">is graciously offering</a> to protect the freedom of the seas and the financial integrity of several Pacific island nations, whether they want US protection or not.</p><blockquote><p>The US has said it will join Australia in the development of a naval base on Papua New Guinea’s Manus Island to “protect the freedom of the seas,” in a move apparently aimed at curbing China’s presence in the Pacific.</p><p>Australia, a staunch US ally in the Pacific, had already set its sights on Papua New Guinea’s Lombrum Naval Base on Manus Island earlier in November, seeking to build a deep-water facility for its Navy. Now, Washington apparently has also decided to join the effort, in a move clearly aimed at sending a signal to Beijing, which is already locked in a trade war with Washington and in disputes over the South China Sea.</p><p>It is no surprise that the US decision apparently came on the heels of rumors that China might also emerge as the eventual developer of the deep-water base. Some other reports suggested that China approached another Pacific island nation, Vanuatu, seeking to open a military base there.</p><p>Apart from that, the US also seems to be concerned that Beijing might use its growing influence over the Pacific island nations to get access to some military infrastructure in the vicinity of major maritime routes in the region. Pence even engaged in an indirect verbal duel with China’s President Xi Jingping at the APEC summit, where the two apparently fought for the attention of the smaller Pacific nations.</p><p>“Do not accept debt that could compromise your sovereignty. Protect your interests,” Pence called on the island nations, referring to China’s active policy of giving loans to the Pacific states, which might turn it into a major bilateral lender to island economies.</p><p>He then called on the Pacific nations to stick with the US as it allegedly offers a “better option” because it would supposedly never “coerce or compromise your independence.” Xi, in turn, said that “no one has the power to stop people from seeking a better life,” while calling on the Pacific nations to “strengthen development cooperation” as well.</p><p>However, in its attempt to outplay Beijing in its supposed rush to gain control over strategic locations in the Pacific, the US and Australia seemingly completely forgot to ask the locals about their take on the prospect of the base re-development.</p><p>No one has sought support from the locals, Manus Island Governor Charlie Benjamin said, as cited by Reuters. The project was also criticized by a former Papua New Guinea MP from the island, Ronnie Knight, who said that “there is lot of questions to be answered” first.</p><p>“There was no discussion with any of the locals, it has just been bulldozed through again and that is what makes people cross,” he told Australia’s ABC broadcaster, expressing his concerns about potentially “having a foreign base on our soil.”</p></blockquote><p>See, they’re the BAD empire. We’ll save you from them, and all out of the goodness of our hearts. Now, shut up, stop talking to them, and do what we tell you to do. While we’re at it, can I interest you in an offer of some loans at an interest rate you can’t possibly refuse? No, I mean, you literally <i>can’t</i> refuse them. Or else.</p><p>Don’t mind us just doing a little construction over here. It’s just a teeny, tiny, little military base. You’ll hardly notice it.</p></div>",
  "content_text": "The USA\nis graciously offering\nto protect the freedom of the seas and the financial integrity of several Pacific island nations, whether they want US protection or not.\nThe US has said it will join Australia in the development of a naval base on Papua New Guinea’s Manus Island to “protect the freedom of the seas,” in a move apparently aimed at curbing China’s presence in the Pacific.\nAustralia, a staunch US ally in the Pacific, had already set its sights on Papua New Guinea’s Lombrum Naval Base on Manus Island earlier in November, seeking to build a deep-water facility for its Navy. Now, Washington apparently has also decided to join the effort, in a move clearly aimed at sending a signal to Beijing, which is already locked in a trade war with Washington and in disputes over the South China Sea.\nIt is no surprise that the US decision apparently came on the heels of rumors that China might also emerge as the eventual developer of the deep-water base. Some other reports suggested that China approached another Pacific island nation, Vanuatu, seeking to open a military base there.\nApart from that, the US also seems to be concerned that Beijing might use its growing influence over the Pacific island nations to get access to some military infrastructure in the vicinity of major maritime routes in the region. Pence even engaged in an indirect verbal duel with China’s President Xi Jingping at the APEC summit, where the two apparently fought for the attention of the smaller Pacific nations.\n“Do not accept debt that could compromise your sovereignty. Protect your interests,” Pence called on the island nations, referring to China’s active policy of giving loans to the Pacific states, which might turn it into a major bilateral lender to island economies.\nHe then called on the Pacific nations to stick with the US as it allegedly offers a “better option” because it would supposedly never “coerce or compromise your independence.” Xi, in turn, said that “no one has the power to stop people from seeking a better life,” while calling on the Pacific nations to “strengthen development cooperation” as well.\nHowever, in its attempt to outplay Beijing in its supposed rush to gain control over strategic locations in the Pacific, the US and Australia seemingly completely forgot to ask the locals about their take on the prospect of the base re-development.\nNo one has sought support from the locals, Manus Island Governor Charlie Benjamin said, as cited by Reuters. The project was also criticized by a former Papua New Guinea MP from the island, Ronnie Knight, who said that “there is lot of questions to be answered” first.\n“There was no discussion with any of the locals, it has just been bulldozed through again and that is what makes people cross,” he told Australia’s ABC broadcaster, expressing his concerns about potentially “having a foreign base on our soil.”\nSee, they’re the BAD empire. We’ll save you from them, and all out of the goodness of our hearts. Now, shut up, stop talking to them, and do what we tell you to do. While we’re at it, can I interest you in an offer of some loans at an interest rate you can’t possibly refuse? No, I mean, you literally\ncan’t\nrefuse them. Or else.\nDon’t mind us just doing a little construction over here. It’s just a teeny, tiny, little military base. You’ll hardly notice it.",
  "tags": [
    "war"
  ],
  "categories": [],
  "sitemap_lastmod": "2018-11-18T16:53:18+00:00"
}