{
  "url": "https://voxday.net/2018/11/12/who-cares/",
  "scraped_at": "2025-12-20T05:16:28.364176",
  "title": "Who cares?",
  "date_display": "November 12, 2018",
  "date_iso": "2018-11-12T18:15:30+00:00",
  "date_from_url": "2018-11-12",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>I’m just wondering, why on Earth should anyone give a fragment of a quantum of a damn for the fact that the poor moderate media whores <a href=\"https://twitchy.com/samj-3930/2018/11/11/infuriating-kat-timpf-chewed-out-abused-run-out-of-establishment-and-youll-never-guess-why-ok-you-might/\">are now being treated in public</a> the way that many of us have been treated online for the last five years?</p><blockquote><p>Kat Timpf@KatTimpf<br> I was just ran out of an establishment because of where I work. Chewed out, abused. But I guess that’s the norm now.</br></p><p>And let’s be honest, Kat Timpf is really pretty moderate in the grand scheme of things so to attack her of all people at Fox? That’s just someone who doesn’t really pay attention. At this point, we are not sure where Kat was but we’re hoping she’ll post it soon so we can share …</p></blockquote><p>Because those who are really pretty moderate don’t deserve to be attacked, unlike those awful right-wing extremists, right? These people now looking for our sympathy and support are the very people who didn’t lift a finger when hundreds of people, up to and including Alex Jones, were driven off Facebook, Twitter, GoDaddy, IndieGoGo, Paypal, and other platforms for their badthink, who didn’t bother to denounce the culprits, let alone stop utilizing their services.</p><p>Now they’re being driven out of restaurants. So my response is, sowhat? Especially given the fact that the likes of Kat Timpf are still far too moderate to so much as <i>name the place</i> where they were victimized, for fear that someone will actually do something besides cringe and cower.</p></div>",
  "content_text": "I’m just wondering, why on Earth should anyone give a fragment of a quantum of a damn for the fact that the poor moderate media whores\nare now being treated in public\nthe way that many of us have been treated online for the last five years?\nKat Timpf@KatTimpf\nI was just ran out of an establishment because of where I work. Chewed out, abused. But I guess that’s the norm now.\nAnd let’s be honest, Kat Timpf is really pretty moderate in the grand scheme of things so to attack her of all people at Fox? That’s just someone who doesn’t really pay attention. At this point, we are not sure where Kat was but we’re hoping she’ll post it soon so we can share …\nBecause those who are really pretty moderate don’t deserve to be attacked, unlike those awful right-wing extremists, right? These people now looking for our sympathy and support are the very people who didn’t lift a finger when hundreds of people, up to and including Alex Jones, were driven off Facebook, Twitter, GoDaddy, IndieGoGo, Paypal, and other platforms for their badthink, who didn’t bother to denounce the culprits, let alone stop utilizing their services.\nNow they’re being driven out of restaurants. So my response is, sowhat? Especially given the fact that the likes of Kat Timpf are still far too moderate to so much as\nname the place\nwhere they were victimized, for fear that someone will actually do something besides cringe and cower.",
  "tags": [
    "media"
  ],
  "categories": [],
  "sitemap_lastmod": "2018-11-12T18:15:30+00:00"
}