{
  "url": "https://voxday.net/2018/11/17/yeats-the-baptist/",
  "scraped_at": "2025-12-20T05:17:08.115265",
  "title": "Yeats the Baptist",
  "date_display": "November 17, 2018",
  "date_iso": "2018-11-17T16:40:12+00:00",
  "date_from_url": "2018-11-17",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>Greg Johnson writes of what he considers to be <a href=\"https://www.counter-currents.com/2015/02/yeats-pagan-second-coming/\">the hopeful message of Yeats’s <i>Second Coming</i></a>:</p><blockquote><p>And the poem seems to indicate a reversal of that flight, and a reversal of the birth of Christ. Could Mary, resting on the flight into Egypt, rocking Jesus cradled between the paws of a sphinx, have vexed the stony beast to nightmare? Could it have finally stirred from its troubled sleep, its womb heavy with the prophet of a new age, and begun the search for an appropriate place to give birth? “And what rough beast, its hour come round at last, slouches towards Bethlehem to be born?” And what better place than Bethlehem, not to repeat but to reverse the birth of Christ and inaugurate a post-Christian age.</p><p>One can ask, however, if the poem ends on a note of horror or of hope. As I read it, there are three distinct stages to Yeats’ narrative. The first is the age when Christian values were the unchallenged core of Western civilization. This was a vital, flourishing civilization, but now it is over. The second stage is nihilism, both active and passive, occasioned by the loss of these core values. This is the present-day for Yeats and ourselves.</p><p>The third stage, which is yet to come, will follow the birth of the “rough beast.” Just as the birth of Jesus inaugurated Christian civilization, the rough beast will inaugurate a new pagan civilization. Its core values will be different than Christian values, which, of course, horrifies Christians, who hope to revive their religion. But the new pagan values, unlike Christian ones, will actually be believed, bringing the reign of nihilism to its end and creating a new, vital civilization. For pagans, this is a message of hope.</p></blockquote><p>I think his interpretation of the three distinct stages is correct. Which is why it is really going to be fascinating to see what Greg makes of <i>Jordanetics</i>, which I understand he plans to review. Because, despite the best efforts of fools, false prophets, and philosophers, no Man has been able to coherently conceive, let alone construct, a viable post-Christian civilization.</p></div>",
  "content_text": "Greg Johnson writes of what he considers to be\nthe hopeful message of Yeats’s\nSecond Coming\n:\nAnd the poem seems to indicate a reversal of that flight, and a reversal of the birth of Christ. Could Mary, resting on the flight into Egypt, rocking Jesus cradled between the paws of a sphinx, have vexed the stony beast to nightmare? Could it have finally stirred from its troubled sleep, its womb heavy with the prophet of a new age, and begun the search for an appropriate place to give birth? “And what rough beast, its hour come round at last, slouches towards Bethlehem to be born?” And what better place than Bethlehem, not to repeat but to reverse the birth of Christ and inaugurate a post-Christian age.\nOne can ask, however, if the poem ends on a note of horror or of hope. As I read it, there are three distinct stages to Yeats’ narrative. The first is the age when Christian values were the unchallenged core of Western civilization. This was a vital, flourishing civilization, but now it is over. The second stage is nihilism, both active and passive, occasioned by the loss of these core values. This is the present-day for Yeats and ourselves.\nThe third stage, which is yet to come, will follow the birth of the “rough beast.” Just as the birth of Jesus inaugurated Christian civilization, the rough beast will inaugurate a new pagan civilization. Its core values will be different than Christian values, which, of course, horrifies Christians, who hope to revive their religion. But the new pagan values, unlike Christian ones, will actually be believed, bringing the reign of nihilism to its end and creating a new, vital civilization. For pagans, this is a message of hope.\nI think his interpretation of the three distinct stages is correct. Which is why it is really going to be fascinating to see what Greg makes of\nJordanetics\n, which I understand he plans to review. Because, despite the best efforts of fools, false prophets, and philosophers, no Man has been able to coherently conceive, let alone construct, a viable post-Christian civilization.",
  "tags": [
    "Jordanetics"
  ],
  "categories": [],
  "sitemap_lastmod": "2018-11-17T16:40:12+00:00"
}