{
  "url": "https://voxday.net/2014/02/07/a-nightmare-for-science/",
  "scraped_at": "2025-12-15T16:45:45.533823",
  "title": "“A nightmare for science”",
  "date_display": "February 7, 2014",
  "date_iso": "2014-02-07T14:00:00+00:00",
  "date_from_url": "2014-02-07",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>It is remarkable how evolution enthusiasts can’t seem to reach the logical conclusion concerning <a href=\"http://www.thedailybeast.com/articles/2014/02/05/the-bill-nye-ken-ham-debate-was-a-nightmare-for-science.html\">their repeated inability to successfully debate creationists</a>. Then again, if they had as solid a grasp on logic and statistics as they do on the various epicycles of their ever-evolving “theory”, they would not be evangelical evolutionists in the first place:</p><blockquote class=\"tr_bq\"><p> In a much-hyped showdown, “the Science Guy” tried to defend evolution against creationist Ken Ham, and proved how slick science-deniers can be. How did the guy who’s right go so wrong?</p><p>On many mornings, I wake up and think, “You know what this country needs? More culture war.” As I scramble up a couple eggs, I find myself wishing—fervently wishing—that we could spend more time reducing substantive issues to mere spectacle. Later, as I scrub the pan, I’ll fantasize about how those very spectacles might even funnel money toward some of the country’s most politicized religious groups.</p><p>Fortunately, Bill “the Science Guy” Nye has heard my wish—which, really, is the wish of a nation. Why else would he have traveled to Kentucky this week in order to debate Ken Ham, the young-earth creationist founder of Answers in Genesis, about the origins of the world?</p><p>Actually, there are two other reasons that Nye might have done so, and I’ve given both possibilities a great deal of thought in the past few days. The first is that Nye, for all his bow-tied charm, is at heart a publicity-hungry cynic, eager to reestablish the national reputation he once had as the host of a PBS show. When his stint on Dancing With the Stars ended quickly, Nye turned to the only other channel that could launch him back to national attention: a sensationalized debate, replete with the media buzz that he craves.</p><p>Possibility number two is that Nye is clueless—that, for all his skill as a science communicator, Nye has less political acumen than your average wombat.</p><p>After watching the debate, I’m leaning toward that second possibility. Last night, it was easy to pick out the smarter man on the stage. Oddly, it was the same man who was arguing that the earth is 6,000 years old. It was like watching the Broncos play the Seahawks. Nye never had a chance.</p></blockquote><p>I didn’t watch the “debate”. I had no interest in it, surmising correctly, (as it turns out), that neither side would actually be debating, but were instead engaged in mutual preaching to their own choirs. And it is amusing to observe the wrestling with the temptation intellectual dishonesty poses to the evolutionists as a result of their frustration with their own inability to successful defend their faith</p><p>For example, the writer claims it is bullshit to distinguish between scientific evidence and historical extrapolation. He asserts: “We <i>can </i>use evidence from the present to extrapolate about the past.” Well, yes, but that doesn’t disprove Ham’s point, which isn’t so much a point as a basic fact. An extrapolation is not, by definition, an observation. Nor can a historical extrapolation be tested.</p><p>For some reason, science fetishists who understand very well that it is impossible to use science to prove that Abraham Lincoln succeeded George Washington as president do not understand that it is equally impossible to use science to prove that species X transformed into species Y. Extrapolation only takes us to the hypothesis part of the scientific equation, it does not get us past the necessary testing and observation aspects. Barring a time machine, it is history, not science.</p><p>And in the end, the author throws in the towel, admits defeat, and advocates a full-blown retreat:</p><blockquote class=\"tr_bq\"><p> You don’t need to be Sun Tzu to realize that, when it comes to guys like Ken Ham, you can’t really win. If you refuse to debate them, they claim to be censored. If you agree to debate them, you give them a public platform on which to argue that, yep, they’re being censored. Better not to engage at all, at least directly.</p></blockquote><p>Needless to say, the side that dares not directly engage is the side that knows it cannot successfully make its case. And the more the evangelical Darwinians appeal to an increasingly threadbare scientific authority, the weaker their case is observed to be by all impartial parties. When they’re saying: “you don’t understand the biology” and their critics are saying: “you don’t understand the math”, well, as it turns out, we have an excellent means of determining whose claims are founded in fact and whose are not.</p><p>And what we can readily test and observe with these two competing hypotheses is that the scientific evidence here does not favor those appealing to scientific authority.</p></div>",
  "content_text": "It is remarkable how evolution enthusiasts can’t seem to reach the logical conclusion concerning\ntheir repeated inability to successfully debate creationists\n. Then again, if they had as solid a grasp on logic and statistics as they do on the various epicycles of their ever-evolving “theory”, they would not be evangelical evolutionists in the first place:\nIn a much-hyped showdown, “the Science Guy” tried to defend evolution against creationist Ken Ham, and proved how slick science-deniers can be. How did the guy who’s right go so wrong?\nOn many mornings, I wake up and think, “You know what this country needs? More culture war.” As I scramble up a couple eggs, I find myself wishing—fervently wishing—that we could spend more time reducing substantive issues to mere spectacle. Later, as I scrub the pan, I’ll fantasize about how those very spectacles might even funnel money toward some of the country’s most politicized religious groups.\nFortunately, Bill “the Science Guy” Nye has heard my wish—which, really, is the wish of a nation. Why else would he have traveled to Kentucky this week in order to debate Ken Ham, the young-earth creationist founder of Answers in Genesis, about the origins of the world?\nActually, there are two other reasons that Nye might have done so, and I’ve given both possibilities a great deal of thought in the past few days. The first is that Nye, for all his bow-tied charm, is at heart a publicity-hungry cynic, eager to reestablish the national reputation he once had as the host of a PBS show. When his stint on Dancing With the Stars ended quickly, Nye turned to the only other channel that could launch him back to national attention: a sensationalized debate, replete with the media buzz that he craves.\nPossibility number two is that Nye is clueless—that, for all his skill as a science communicator, Nye has less political acumen than your average wombat.\nAfter watching the debate, I’m leaning toward that second possibility. Last night, it was easy to pick out the smarter man on the stage. Oddly, it was the same man who was arguing that the earth is 6,000 years old. It was like watching the Broncos play the Seahawks. Nye never had a chance.\nI didn’t watch the “debate”. I had no interest in it, surmising correctly, (as it turns out), that neither side would actually be debating, but were instead engaged in mutual preaching to their own choirs. And it is amusing to observe the wrestling with the temptation intellectual dishonesty poses to the evolutionists as a result of their frustration with their own inability to successful defend their faith\nFor example, the writer claims it is bullshit to distinguish between scientific evidence and historical extrapolation. He asserts: “We\ncan\nuse evidence from the present to extrapolate about the past.” Well, yes, but that doesn’t disprove Ham’s point, which isn’t so much a point as a basic fact. An extrapolation is not, by definition, an observation. Nor can a historical extrapolation be tested.\nFor some reason, science fetishists who understand very well that it is impossible to use science to prove that Abraham Lincoln succeeded George Washington as president do not understand that it is equally impossible to use science to prove that species X transformed into species Y. Extrapolation only takes us to the hypothesis part of the scientific equation, it does not get us past the necessary testing and observation aspects. Barring a time machine, it is history, not science.\nAnd in the end, the author throws in the towel, admits defeat, and advocates a full-blown retreat:\nYou don’t need to be Sun Tzu to realize that, when it comes to guys like Ken Ham, you can’t really win. If you refuse to debate them, they claim to be censored. If you agree to debate them, you give them a public platform on which to argue that, yep, they’re being censored. Better not to engage at all, at least directly.\nNeedless to say, the side that dares not directly engage is the side that knows it cannot successfully make its case. And the more the evangelical Darwinians appeal to an increasingly threadbare scientific authority, the weaker their case is observed to be by all impartial parties. When they’re saying: “you don’t understand the biology” and their critics are saying: “you don’t understand the math”, well, as it turns out, we have an excellent means of determining whose claims are founded in fact and whose are not.\nAnd what we can readily test and observe with these two competing hypotheses is that the scientific evidence here does not favor those appealing to scientific authority.",
  "tags": [
    "evolution",
    "science"
  ],
  "categories": [],
  "sitemap_lastmod": "2014-02-07T14:00:00+00:00"
}