{
  "url": "https://voxday.net/2014/02/26/an-authorial-announcemen/",
  "scraped_at": "2025-12-15T16:47:35.946038",
  "title": "An authorial announcement",
  "date_display": "February 26, 2014",
  "date_iso": "2014-02-26T18:00:00+00:00",
  "date_from_url": "2014-02-26",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>Fresh on the heels of Castalia House’s release of Mr. Kratman’s latest military science fiction, another author <a href=\"http://www.castaliahouse.com/john-c-wright-collection/\">joins the esoteric elite</a>:</p><blockquote class=\"tr_bq\"><p> We are very pleased to announce that we will be publishing a select collection of John C. Wright’s insightful essays, entitled <i>TRANSHUMAN AND SUBHUMAN: Essays on Science Fiction and Awful Truth</i>, later this spring. Mr. Wright was a finalist for the 2005 Nebula Award for Best Novel and was described by Publisher’s Weekly as “this fledgling century’s most important new SF talent”.</p></blockquote><p>Look for more announcements to come soon. We welcome submissions and have already found one new author with whom we intend to work in the future, so even if you’re an SFWA member, <a href=\"http://www.castaliahouse.com/ch-page/submissions/\">feel free to submit</a> your work to us.</p></div>",
  "content_text": "Fresh on the heels of Castalia House’s release of Mr. Kratman’s latest military science fiction, another author\njoins the esoteric elite\n:\nWe are very pleased to announce that we will be publishing a select collection of John C. Wright’s insightful essays, entitled\nTRANSHUMAN AND SUBHUMAN: Essays on Science Fiction and Awful Truth\n, later this spring. Mr. Wright was a finalist for the 2005 Nebula Award for Best Novel and was described by Publisher’s Weekly as “this fledgling century’s most important new SF talent”.\nLook for more announcements to come soon. We welcome submissions and have already found one new author with whom we intend to work in the future, so even if you’re an SFWA member,\nfeel free to submit\nyour work to us.",
  "tags": [
    "Castalia House"
  ],
  "categories": [],
  "sitemap_lastmod": "2014-02-26T18:00:00+00:00"
}