{
  "url": "https://voxday.net/2014/02/10/an-irrationality-of-atheists/",
  "scraped_at": "2025-12-15T16:45:58.098144",
  "title": "An irrationality of atheists",
  "date_display": "February 10, 2014",
  "date_iso": "2014-02-10T10:08:00+00:00",
  "date_from_url": "2014-02-10",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>I find it encouraging that more of the concepts I introduced in TIA six years ago, like the argument that religion does not cause war and the hypothesis that atheism is a mild form of neurological abnormality, <a href=\"http://opinionator.blogs.nytimes.com/2014/02/09/is-atheism-irrational/?hp&amp;rref=opinion\">have gradually percolated into the mainstream discourse</a>. In this New York Times article, the philosopher Gary Gutting interviews Alvin Platinga:</p><blockquote class=\"tr_bq\"><p> GG: Especially among today’s atheists, materialism seems to be a primary motive. They think there’s nothing beyond the material entities open to scientific inquiry, so there there’s no place for immaterial beings such as God.</p><p>AP: Well, if there are only material entities, then atheism certainly follows. But there is a really serious problem for materialism: It can’t be sensibly believed, at least if, like most materialists, you also believe that humans are the product of evolution.</p><p>GG: Why is that?</p><p> AP: I can’t give a complete statement of the argument here — for that see Chapter 10 of “Where the Conflict Really Lies.” But, roughly, here’s why. First, if materialism is true, human beings, naturally enough, are material objects. Now what, from this point of view, would a belief be? My belief that Marcel Proust is more subtle that Louis L’Amour, for example? Presumably this belief would have to be a material structure in my brain, say a collection of neurons that sends electrical impulses to other such structures as well as to nerves and muscles, and receives electrical impulses from other structures.</p><p>But in addition to such neurophysiological properties, this structure, if it is a belief, would also have to have a content: It would have, say, to be the belief that Proust is more subtle than L’Amour.</p><p>GG: So is your suggestion that a neurophysiological structure can’t be a belief? That a belief has to be somehow immaterial?</p><p>AP: That may be, but it’s not my point here. I’m interested in the fact that beliefs cause (or at least partly cause) actions. For example, my belief that there is a beer in the fridge (together with my desire to have a beer) can cause me to heave myself out of my comfortable armchair and lumber over to the fridge.</p><p>But here’s the important point: It’s by virtue of its material, neurophysiological properties that a belief causes the action. It’s in virtue of those electrical signals sent via efferent nerves to the relevant muscles, that the belief about the beer in the fridge causes me to go to the fridge. It is not by virtue of the content (there is a beer in the fridge) the belief has.</p><p>GG: Why do you say that?</p><p>AP: Because if this belief — this structure — had a totally different content (even, say, if it was a belief that there is no beer in the fridge) but had the same neurophysiological properties, it would still have caused that same action of going to the fridge. This means that the content of the belief isn’t a cause of the behavior. As far as causing the behavior goes, the content of the belief doesn’t matter.</p><p>GG: That does seem to be a hard conclusion to accept. But won’t evolution get the materialist out of this difficulty? For our species to have survived, presumably many, if not most, of our beliefs must be true — otherwise, we wouldn’t be functional in a dangerous world.</p><p>AP: Evolution will have resulted in our having beliefs that are adaptive; that is, beliefs that cause adaptive actions. But as we’ve seen, if materialism is true, the belief does not cause the adaptive action by way of its content: It causes that action by way of its neurophysiological properties. Hence it doesn’t matter what the content of the belief is, and it doesn’t matter whether that content is true or false. All that’s required is that the belief have the right neurophysiological properties. If it’s also true, that’s fine; but if false, that’s equally fine.</p><p>Evolution will select for belief-producing processes that produce beliefs with adaptive neurophysiological properties, but not for belief-producing processes that produce true beliefs. Given materialism and evolution, any particular belief is as likely to be false as true.</p><p>GG: So your claim is that if materialism is true, evolution doesn’t lead to most of our beliefs being true.</p><p>AP: Right. In fact, given materialism and evolution, it follows that our belief-producing faculties are not reliable.</p><p>Here’s why. If a belief is as likely to be false as to be true, we’d have to say the probability that any particular belief is true is about 50 percent. Now suppose we had a total of 100 independent beliefs (of course, we have many more). Remember that the probability that all of a group of beliefs are true is the multiplication of all their individual probabilities. Even if we set a fairly low bar for reliability — say, that at least two-thirds (67 percent) of our beliefs are true — our overall reliability, given materialism and evolution, is exceedingly low: something like .0004. So if you accept both materialism and evolution, you have good reason to believe that your belief-producing faculties are not reliable.</p><p>But to believe that is to fall into a total skepticism, which leaves you with no reason to accept any of your beliefs (including your beliefs in materialism and evolution!). The only sensible course is to give up the claim leading to this conclusion: that both materialism and evolution are true. Maybe you can hold one or the other, but not both.</p><p>So if you’re an atheist simply because you accept materialism, maintaining your atheism means you have to give up your belief that evolution is true. Another way to put it: The belief that both materialism and evolution are true is self-refuting. It shoots itself in the foot. Therefore it can’t rationally be held.</p></blockquote><p>I’ll have to think more about that argument before I accept that it holds any water. But I was disappointed that Platinga readily ceded so much ground on “the so-called problem of evil”. He wrote: “The so-called “problem of evil” would presumably be the strongest (and<br> maybe the only) evidence against theism. It does indeed have some<br> strength; it makes sense to think that the probability of theism, given<br> the existence of all the suffering and evil our world contains, is<br> fairly low.”</br></br></br></br></p><p>However, the observable existence of evil is not even the smallest problem for the varient of theism that is Christianity. Indeed, as I have pointed out repeatedly, the existence of real and material evil is an absolute <i>prerequisite </i>for Christianity.</p></div>",
  "content_text": "I find it encouraging that more of the concepts I introduced in TIA six years ago, like the argument that religion does not cause war and the hypothesis that atheism is a mild form of neurological abnormality,\nhave gradually percolated into the mainstream discourse\n. In this New York Times article, the philosopher Gary Gutting interviews Alvin Platinga:\nGG: Especially among today’s atheists, materialism seems to be a primary motive. They think there’s nothing beyond the material entities open to scientific inquiry, so there there’s no place for immaterial beings such as God.\nAP: Well, if there are only material entities, then atheism certainly follows. But there is a really serious problem for materialism: It can’t be sensibly believed, at least if, like most materialists, you also believe that humans are the product of evolution.\nGG: Why is that?\nAP: I can’t give a complete statement of the argument here — for that see Chapter 10 of “Where the Conflict Really Lies.” But, roughly, here’s why. First, if materialism is true, human beings, naturally enough, are material objects. Now what, from this point of view, would a belief be? My belief that Marcel Proust is more subtle that Louis L’Amour, for example? Presumably this belief would have to be a material structure in my brain, say a collection of neurons that sends electrical impulses to other such structures as well as to nerves and muscles, and receives electrical impulses from other structures.\nBut in addition to such neurophysiological properties, this structure, if it is a belief, would also have to have a content: It would have, say, to be the belief that Proust is more subtle than L’Amour.\nGG: So is your suggestion that a neurophysiological structure can’t be a belief? That a belief has to be somehow immaterial?\nAP: That may be, but it’s not my point here. I’m interested in the fact that beliefs cause (or at least partly cause) actions. For example, my belief that there is a beer in the fridge (together with my desire to have a beer) can cause me to heave myself out of my comfortable armchair and lumber over to the fridge.\nBut here’s the important point: It’s by virtue of its material, neurophysiological properties that a belief causes the action. It’s in virtue of those electrical signals sent via efferent nerves to the relevant muscles, that the belief about the beer in the fridge causes me to go to the fridge. It is not by virtue of the content (there is a beer in the fridge) the belief has.\nGG: Why do you say that?\nAP: Because if this belief — this structure — had a totally different content (even, say, if it was a belief that there is no beer in the fridge) but had the same neurophysiological properties, it would still have caused that same action of going to the fridge. This means that the content of the belief isn’t a cause of the behavior. As far as causing the behavior goes, the content of the belief doesn’t matter.\nGG: That does seem to be a hard conclusion to accept. But won’t evolution get the materialist out of this difficulty? For our species to have survived, presumably many, if not most, of our beliefs must be true — otherwise, we wouldn’t be functional in a dangerous world.\nAP: Evolution will have resulted in our having beliefs that are adaptive; that is, beliefs that cause adaptive actions. But as we’ve seen, if materialism is true, the belief does not cause the adaptive action by way of its content: It causes that action by way of its neurophysiological properties. Hence it doesn’t matter what the content of the belief is, and it doesn’t matter whether that content is true or false. All that’s required is that the belief have the right neurophysiological properties. If it’s also true, that’s fine; but if false, that’s equally fine.\nEvolution will select for belief-producing processes that produce beliefs with adaptive neurophysiological properties, but not for belief-producing processes that produce true beliefs. Given materialism and evolution, any particular belief is as likely to be false as true.\nGG: So your claim is that if materialism is true, evolution doesn’t lead to most of our beliefs being true.\nAP: Right. In fact, given materialism and evolution, it follows that our belief-producing faculties are not reliable.\nHere’s why. If a belief is as likely to be false as to be true, we’d have to say the probability that any particular belief is true is about 50 percent. Now suppose we had a total of 100 independent beliefs (of course, we have many more). Remember that the probability that all of a group of beliefs are true is the multiplication of all their individual probabilities. Even if we set a fairly low bar for reliability — say, that at least two-thirds (67 percent) of our beliefs are true — our overall reliability, given materialism and evolution, is exceedingly low: something like .0004. So if you accept both materialism and evolution, you have good reason to believe that your belief-producing faculties are not reliable.\nBut to believe that is to fall into a total skepticism, which leaves you with no reason to accept any of your beliefs (including your beliefs in materialism and evolution!). The only sensible course is to give up the claim leading to this conclusion: that both materialism and evolution are true. Maybe you can hold one or the other, but not both.\nSo if you’re an atheist simply because you accept materialism, maintaining your atheism means you have to give up your belief that evolution is true. Another way to put it: The belief that both materialism and evolution are true is self-refuting. It shoots itself in the foot. Therefore it can’t rationally be held.\nI’ll have to think more about that argument before I accept that it holds any water. But I was disappointed that Platinga readily ceded so much ground on “the so-called problem of evil”. He wrote: “The so-called “problem of evil” would presumably be the strongest (and\nmaybe the only) evidence against theism. It does indeed have some\nstrength; it makes sense to think that the probability of theism, given\nthe existence of all the suffering and evil our world contains, is\nfairly low.”\nHowever, the observable existence of evil is not even the smallest problem for the varient of theism that is Christianity. Indeed, as I have pointed out repeatedly, the existence of real and material evil is an absolute\nprerequisite\nfor Christianity.",
  "tags": [
    "atheism",
    "philosophy"
  ],
  "categories": [],
  "sitemap_lastmod": "2014-02-10T10:08:00+00:00"
}