{
  "url": "https://voxday.net/2014/02/03/answers-for-mj-3/",
  "scraped_at": "2025-12-15T16:45:19.678996",
  "title": "Answers for MJ 3",
  "date_display": "February 3, 2014",
  "date_iso": "2014-02-03T10:02:00+00:00",
  "date_from_url": "2014-02-03",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>It appears MJ is in dire need of some Stoic philosophy:</p><blockquote class=\"tr_bq\"><p> How exactly do you handle humanity? What I mean is this: when I get up in the morning I either find myself incredibly depressed because humanity is remarkably stupid and beyond hope, or I find myself incredibly hateful because humans are parasitic creatures, stupid, hopeless, hedonistic, narcissistic, and ungrateful among many other things. Or, on even worse days, I wonder if only I am the one being parasitic, stupid, narcissistic, etc. and I am simply projecting these internal characteristics on the world (as much as I don’t care for Freud and psychology in general, I think along these lines). I suppose these emotions stem from a weak faith. I would not be frightened, depressed, or hateful toward humanity if I had hope, faith, and trust in God. I am working on that. I just wondered if you had any other suggestions.</p></blockquote><p>TL;DR: I roll my eyes and move on. This is not exactly an unusual feeling. About 1,900 years ago, a Roman emperor wrote the following:</p><p><i>“Begin the morning by saying to thyself, I shall meet with the busybody,<br> the ungrateful, arrogant, deceitful, envious, unsocial. All these things<br> happen to them by reason of their ignorance of what is good and evil. But<br> I who have seen the nature of the good that it is beautiful, and of the<br> bad that it is ugly, and the nature of him who does wrong, that it is<br> akin to me, not only of the same blood or seed, but that it<br> participates in the same intelligence and the same portion of the<br> divinity, I can neither be injured by any of them, for no one can fix on<br> me what is ugly, nor can I be angry with my kinsman, nor hate him. For we<br> are made for co-operation, like feet, like hands, like eyelids, like the<br> rows of the upper and lower teeth. To act against one another, then, is<br> contrary to nature; and it is acting against one another to be vexed and<br> to turn away….</br></br></br></br></br></br></br></br></br></br></br></br></i><br> <i><br/></i><br> <i>“Thou must now at last perceive of what universe thou art now a part, and of what administrator of the universe thy existence is an efflux, and that a limit of time is fixed for thee, which if thou dost not use for clearing away the clouds from thy mind, it will go and thou wilt go, and it will never return. Every moment think steadily as a Roman and a man to do what thou hast in hand with perfect and simple dignity, and feeling of affection, and freedom, and justice, and to give thyself relief from all other thoughts. And thou wilt give thyself relief if thou dost every act of thy life as if it were the last, laying aside all carelessness and passionate aversion from the commands of reason, and all hypocrisy, and self-love, and discontent with the portion which has been given to thee.”</i></br></br></p><p>Most people, being idiots, fail to understand the purpose of my regular resort to the acronym MPAI. It is not a reminder to hold others in contempt; it is a flaw in my character that I seldom need any such reminders. Rather, it is a reminder that most people do not think before speaking or acting and that one should therefore not take pointless offense at their thoughtless words and actions. It is a reminder that people are making decisions with differing amounts of information and differing cognitive capacities, and that it is foolish to expect people to respond to the same input factors in the same way that I would.</p><p>God is an ever-present reminder that we are not the center of the universe. We are natural and instinctive Ptolemaics; from birth we are inclined to believe that our awareness is the center of all Creation and that without us the universe does not exist. This is why pride is a root of so much evil and why humility is a virtue. Humility is the child’s acceptance of his true place in the grand scheme of things, and it is little wonder that so many minds cling to their foolish pride and flee from that awful reality.</p><p>The observable fact is that without God, humanity is without hope. That is why even the finest minds have never been able to do better than the ancient philosophers did in advising calm acceptance of the daily horror show combined with the firm resolution to make the most of what little time one has.</p></div>",
  "content_text": "It appears MJ is in dire need of some Stoic philosophy:\nHow exactly do you handle humanity? What I mean is this: when I get up in the morning I either find myself incredibly depressed because humanity is remarkably stupid and beyond hope, or I find myself incredibly hateful because humans are parasitic creatures, stupid, hopeless, hedonistic, narcissistic, and ungrateful among many other things. Or, on even worse days, I wonder if only I am the one being parasitic, stupid, narcissistic, etc. and I am simply projecting these internal characteristics on the world (as much as I don’t care for Freud and psychology in general, I think along these lines). I suppose these emotions stem from a weak faith. I would not be frightened, depressed, or hateful toward humanity if I had hope, faith, and trust in God. I am working on that. I just wondered if you had any other suggestions.\nTL;DR: I roll my eyes and move on. This is not exactly an unusual feeling. About 1,900 years ago, a Roman emperor wrote the following:\n“Begin the morning by saying to thyself, I shall meet with the busybody,\nthe ungrateful, arrogant, deceitful, envious, unsocial. All these things\nhappen to them by reason of their ignorance of what is good and evil. But\nI who have seen the nature of the good that it is beautiful, and of the\nbad that it is ugly, and the nature of him who does wrong, that it is\nakin to me, not only of the same blood or seed, but that it\nparticipates in the same intelligence and the same portion of the\ndivinity, I can neither be injured by any of them, for no one can fix on\nme what is ugly, nor can I be angry with my kinsman, nor hate him. For we\nare made for co-operation, like feet, like hands, like eyelids, like the\nrows of the upper and lower teeth. To act against one another, then, is\ncontrary to nature; and it is acting against one another to be vexed and\nto turn away….\n“Thou must now at last perceive of what universe thou art now a part, and of what administrator of the universe thy existence is an efflux, and that a limit of time is fixed for thee, which if thou dost not use for clearing away the clouds from thy mind, it will go and thou wilt go, and it will never return. Every moment think steadily as a Roman and a man to do what thou hast in hand with perfect and simple dignity, and feeling of affection, and freedom, and justice, and to give thyself relief from all other thoughts. And thou wilt give thyself relief if thou dost every act of thy life as if it were the last, laying aside all carelessness and passionate aversion from the commands of reason, and all hypocrisy, and self-love, and discontent with the portion which has been given to thee.”\nMost people, being idiots, fail to understand the purpose of my regular resort to the acronym MPAI. It is not a reminder to hold others in contempt; it is a flaw in my character that I seldom need any such reminders. Rather, it is a reminder that most people do not think before speaking or acting and that one should therefore not take pointless offense at their thoughtless words and actions. It is a reminder that people are making decisions with differing amounts of information and differing cognitive capacities, and that it is foolish to expect people to respond to the same input factors in the same way that I would.\nGod is an ever-present reminder that we are not the center of the universe. We are natural and instinctive Ptolemaics; from birth we are inclined to believe that our awareness is the center of all Creation and that without us the universe does not exist. This is why pride is a root of so much evil and why humility is a virtue. Humility is the child’s acceptance of his true place in the grand scheme of things, and it is little wonder that so many minds cling to their foolish pride and flee from that awful reality.\nThe observable fact is that without God, humanity is without hope. That is why even the finest minds have never been able to do better than the ancient philosophers did in advising calm acceptance of the daily horror show combined with the firm resolution to make the most of what little time one has.",
  "tags": [
    "mailvox",
    "philosophy"
  ],
  "categories": [],
  "sitemap_lastmod": "2014-02-03T10:02:00+00:00"
}