{
  "url": "https://voxday.net/2014/02/02/answers-for-mj-2/",
  "scraped_at": "2025-12-15T16:45:12.348078",
  "title": "Answers for MJ 2",
  "date_display": "February 2, 2014",
  "date_iso": "2014-02-02T09:47:00+00:00",
  "date_from_url": "2014-02-02",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>In which MJ asks about Platonism and Socrates:</p><blockquote class=\"tr_bq\"><p> I wanted to ask you about your view of Platonism. I have two acquaintances who are fellow classical language majors; they are both atheists (I view them as rather militant at times) and as far as I understand they became Platonists after having taken a Greek philosophy course. I was wondering how compatible atheism and Platonism are.</p><p>While I am convinced that the human mind is able to fuse even contradicting philosophies together to its liking, avoiding the inconsistency in the process, I am not so sure that they form a coherent pair. In particular, Platonism opens up the necessity of a non-material world of the Forms. While a non-material level of existence does not immediately imply the existence of god, I conjecture that the necessity of a non-material world does at least open up the possibility of the existence of god more greatly than atheists would like. After all, I ask, if a non-material realm of the Forms exists, what is preventing there from being a non-material realm of flying monkeys, or other nonsensical abstractions? I don’t believe Plato’s philosophy expressly and logically forbids the possibility of other non-material worlds.</p><p>While Occam’s razor could be invoked, the razor alone wouldn’t necessarily bring truth to the discussion. Plus, the razor could work against Plato’s world of the Forms if there were a simpler non-material realm available. I don’t particularly care for Plato or Socrates. They’re fun to read at times, but…well, I think you have similar sentiments. While definitions may be the beginning of wisdom, they can also be the seeds of deceit; Socrates takes advantage of that time and time again.</p></blockquote><p>I am a nominal platonist in the sense that I believe in the supernatural realm but I am not a Platonist who subscribes to Plato’s various theories concerning that realm. Just to be clear, “platonism refers to “the philosophy that affirms the existence of abstract objects, which are asserted to “exist” in a “third realm distinct both from the sensible external world and from the internal world of consciousness, and is the opposite of nominalism”, which is <i>either </i>the assertion that everything that exists is a particular thing, or that everything that exists is concrete.</p><p>So, while it is technically possible for an atheist to be a platonist, at least in the case of a Christian atheist such as Scheisskopf from <i>Catch-22</i> who does not believe in a very particular god with very specific attributes, it is extraordinarily unlikely. A platonist, by definition, believes in the supernatural, and it is absolutely impossible for a platonist to be a rational materialist, which is the spectacularly ill-named nominalist philosophy to which most atheists subscribe.</p><p>MJ’s two fellow students are no more platonists than they are giraffes, indeed, they demonstrate very beautifully the intellectual shallowness of the militant atheist as well as the truth of Chesterton’s quote concerning how those who do not believe in God will readily believe in anything, no matter how absurd.</p><p>As for definitions being the seeds of deceit, well, we have certainly seen that in the series on the Fifth Horseman. While I am a fan of utilizing the Socratic method, I believe it should be used honestly, to better open men’s eyes to the truth, not deviously in order to trap people into confessing falsehoods in which they do not believe. As I demonstrated in <i>The Irrational Atheist</i>, Socrates is not above cheating and moving the goalposts, taking his opponent’s agreement and applying it to something to which Socrates himself admits the other man did not agree.</p><p>I vastly prefer Aristotle to either Socrates or Plato. And Aristotle correctly identified “ambiguity” in definition as being one of the chief rhetorical tactics of the sophists. And indeed, we see that very ambiguity utilized on an almost daily basis by intellectually dishonest interlocutors here on this blog and elsewhere. The sophistical manual of the Street Epistemologist is nothing but one long exercise in rhetorical ambiguity.</p><p><a href=\"http://en.wikipedia.org/wiki/Nominalism#cite_note-1\"></a></p></div>",
  "content_text": "In which MJ asks about Platonism and Socrates:\nI wanted to ask you about your view of Platonism. I have two acquaintances who are fellow classical language majors; they are both atheists (I view them as rather militant at times) and as far as I understand they became Platonists after having taken a Greek philosophy course. I was wondering how compatible atheism and Platonism are.\nWhile I am convinced that the human mind is able to fuse even contradicting philosophies together to its liking, avoiding the inconsistency in the process, I am not so sure that they form a coherent pair. In particular, Platonism opens up the necessity of a non-material world of the Forms. While a non-material level of existence does not immediately imply the existence of god, I conjecture that the necessity of a non-material world does at least open up the possibility of the existence of god more greatly than atheists would like. After all, I ask, if a non-material realm of the Forms exists, what is preventing there from being a non-material realm of flying monkeys, or other nonsensical abstractions? I don’t believe Plato’s philosophy expressly and logically forbids the possibility of other non-material worlds.\nWhile Occam’s razor could be invoked, the razor alone wouldn’t necessarily bring truth to the discussion. Plus, the razor could work against Plato’s world of the Forms if there were a simpler non-material realm available. I don’t particularly care for Plato or Socrates. They’re fun to read at times, but…well, I think you have similar sentiments. While definitions may be the beginning of wisdom, they can also be the seeds of deceit; Socrates takes advantage of that time and time again.\nI am a nominal platonist in the sense that I believe in the supernatural realm but I am not a Platonist who subscribes to Plato’s various theories concerning that realm. Just to be clear, “platonism refers to “the philosophy that affirms the existence of abstract objects, which are asserted to “exist” in a “third realm distinct both from the sensible external world and from the internal world of consciousness, and is the opposite of nominalism”, which is\neither\nthe assertion that everything that exists is a particular thing, or that everything that exists is concrete.\nSo, while it is technically possible for an atheist to be a platonist, at least in the case of a Christian atheist such as Scheisskopf from\nCatch-22\nwho does not believe in a very particular god with very specific attributes, it is extraordinarily unlikely. A platonist, by definition, believes in the supernatural, and it is absolutely impossible for a platonist to be a rational materialist, which is the spectacularly ill-named nominalist philosophy to which most atheists subscribe.\nMJ’s two fellow students are no more platonists than they are giraffes, indeed, they demonstrate very beautifully the intellectual shallowness of the militant atheist as well as the truth of Chesterton’s quote concerning how those who do not believe in God will readily believe in anything, no matter how absurd.\nAs for definitions being the seeds of deceit, well, we have certainly seen that in the series on the Fifth Horseman. While I am a fan of utilizing the Socratic method, I believe it should be used honestly, to better open men’s eyes to the truth, not deviously in order to trap people into confessing falsehoods in which they do not believe. As I demonstrated in\nThe Irrational Atheist\n, Socrates is not above cheating and moving the goalposts, taking his opponent’s agreement and applying it to something to which Socrates himself admits the other man did not agree.\nI vastly prefer Aristotle to either Socrates or Plato. And Aristotle correctly identified “ambiguity” in definition as being one of the chief rhetorical tactics of the sophists. And indeed, we see that very ambiguity utilized on an almost daily basis by intellectually dishonest interlocutors here on this blog and elsewhere. The sophistical manual of the Street Epistemologist is nothing but one long exercise in rhetorical ambiguity.",
  "tags": [
    "mailvox",
    "philosophy"
  ],
  "categories": [],
  "sitemap_lastmod": "2014-02-02T09:47:00+00:00"
}