{
  "url": "https://voxday.net/2014/02/16/darkened-hearts-poisoned-minds/",
  "scraped_at": "2025-12-15T16:46:38.356727",
  "title": "Darkened hearts, poisoned minds",
  "date_display": "February 16, 2014",
  "date_iso": "2014-02-16T16:50:00+00:00",
  "date_from_url": "2014-02-16",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>Kate Paulk <a href=\"http://madgeniusclub.com/2014/02/13/sfwa-can-haz-glittery-hoo-haa/\">is amused by the spectacle afforded</a> by the SFWA devouring itself:</p><blockquote class=\"tr_bq\"><p> It’s funny as hell, but it’s also sad to watch. The organization founded to help authors and act as their advocate has become a grotesque carnival freak show devouring its own newborn children, as often as not with the publishers who are busily devouring the slightly older authors watching on and approving. Not a word is said about the contracts that try to stop authors writing anything except what the publisher approves (even when it’s a totally different genre and a totally different name), or the contracts that claim the rights to your first born and your dog for all of eternity and beyond (yes, I’ve seen these. I didn’t sign). Oh well. Time to break out the popcorn and enjoy the show.</p></blockquote><p>And, since one of her commenters saw fit to complain about the fact that she made a factual observation about “the current SFWA president (you know, the one whose first major action as SFWA president was to <a href=\"http://madgeniusclub.com/2013/08/15/the-organization-formerly-known-as-sfwa/\" rel=\"noopener\" target=\"_blank\" title=\"The Organization Formerly Known As SFWA\">expel the losing candidate</a>)”, I should point out that Steven Gould’s hypocrisy was actually worse than that. As I pointed out in my response to the SFWA’s “investigative report”, Steven Gould was guilty of the exact same act for which I was purged from the SFWA, and<i> he was guilty of it before I was</i>. He used an official SFWA communications channel, in this case, the SFWA Forum, to link to an attack on an SFWA member.</p><p>The only difference? I used the SFWAauthors Twitter account to post the link to my blog, Gould posted the link to NK Jemisin’s blog in the SFWA Forum on the SFWA web site.</p><p>Sarah Hoyt, meanwhile <a href=\"http://accordingtohoyt.com/2014/02/16/the-heart-of-darkness/\">correctly points out</a> that the SFWA is perfectly content to point-and-shriek at the small fry while ignoring the abuses of the very publishers the organization was formed to fight:</p><blockquote class=\"tr_bq\"><p> Nota bene that all the fields taken over by “progressives” end up with unpaid work where the exploited ones – interns, adjuncts, beginning writers – are told that to complain would be unprofessional and where the weak people are held to much higher standards of behaviors than their masters.)</p><p>This flaw in the design of SFWA has always been apparent, and therefore the people inside chose the other route.  “Act like we’re a big bad union, but co-opt the employers, make nice to them.  We can at least secure good deals for ourselves and our friends.” Note that everyone they go after, and everyone they pound on are small presses or things their pet authors disapprove of: write for hire, Amazon.</p></blockquote><p>This is something most people don’t realize about the SFWA. It’s not merely that they are ideologically and politically corrupt, but they have totally given up on their primary purpose. As proof of Sarah’s accusations, consider this exchange between one member and a former SFWA president, Michael Capobianco:</p><blockquote class=\"tr_bq\"><p> Capobianco: “I’m informed that some DAW anthologies pay less than 5 cents a word.”</p><p>SFWA member: <i>“How are they therefore able to keep their pro status?”</i></p><p>Capobianco: “The lapses are overlooked because declaring DAW to not be a professional market would be counterproductive.”</p></blockquote><p>Counterproductive…. The SFWA defends authors from big publishers about as effectively as they defend free speech.</p></div>",
  "content_text": "Kate Paulk\nis amused by the spectacle afforded\nby the SFWA devouring itself:\nIt’s funny as hell, but it’s also sad to watch. The organization founded to help authors and act as their advocate has become a grotesque carnival freak show devouring its own newborn children, as often as not with the publishers who are busily devouring the slightly older authors watching on and approving. Not a word is said about the contracts that try to stop authors writing anything except what the publisher approves (even when it’s a totally different genre and a totally different name), or the contracts that claim the rights to your first born and your dog for all of eternity and beyond (yes, I’ve seen these. I didn’t sign). Oh well. Time to break out the popcorn and enjoy the show.\nAnd, since one of her commenters saw fit to complain about the fact that she made a factual observation about “the current SFWA president (you know, the one whose first major action as SFWA president was to\nexpel the losing candidate\n)”, I should point out that Steven Gould’s hypocrisy was actually worse than that. As I pointed out in my response to the SFWA’s “investigative report”, Steven Gould was guilty of the exact same act for which I was purged from the SFWA, and\nhe was guilty of it before I was\n. He used an official SFWA communications channel, in this case, the SFWA Forum, to link to an attack on an SFWA member.\nThe only difference? I used the SFWAauthors Twitter account to post the link to my blog, Gould posted the link to NK Jemisin’s blog in the SFWA Forum on the SFWA web site.\nSarah Hoyt, meanwhile\ncorrectly points out\nthat the SFWA is perfectly content to point-and-shriek at the small fry while ignoring the abuses of the very publishers the organization was formed to fight:\nNota bene that all the fields taken over by “progressives” end up with unpaid work where the exploited ones – interns, adjuncts, beginning writers – are told that to complain would be unprofessional and where the weak people are held to much higher standards of behaviors than their masters.)\nThis flaw in the design of SFWA has always been apparent, and therefore the people inside chose the other route.  “Act like we’re a big bad union, but co-opt the employers, make nice to them.  We can at least secure good deals for ourselves and our friends.” Note that everyone they go after, and everyone they pound on are small presses or things their pet authors disapprove of: write for hire, Amazon.\nThis is something most people don’t realize about the SFWA. It’s not merely that they are ideologically and politically corrupt, but they have totally given up on their primary purpose. As proof of Sarah’s accusations, consider this exchange between one member and a former SFWA president, Michael Capobianco:\nCapobianco: “I’m informed that some DAW anthologies pay less than 5 cents a word.”\nSFWA member:\n“How are they therefore able to keep their pro status?”\nCapobianco: “The lapses are overlooked because declaring DAW to not be a professional market would be counterproductive.”\nCounterproductive…. The SFWA defends authors from big publishers about as effectively as they defend free speech.",
  "tags": [
    "SFWA",
    "trainwreck"
  ],
  "categories": [],
  "sitemap_lastmod": "2014-02-16T16:50:00+00:00"
}