{
  "url": "https://voxday.net/2014/02/25/dead-horse-conclusive-beating/",
  "scraped_at": "2025-12-15T16:47:27.134660",
  "title": "Dead Horse: the conclusive beating",
  "date_display": "February 25, 2014",
  "date_iso": "2014-02-25T09:19:00+00:00",
  "date_from_url": "2014-02-25",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>Longtime Ilk will recall that once upon a time, in 2004, <a href=\"http://www.milobookclub.com/2004/08/05/michelle-goes-monica-for-fdr/\">a lengthy debate was inspired</a> by a book written by Me-So-Michelle that insisted the WWII-era internment of Japanese-Americans was justified on the basis of legitimate military fears of an invasion of America’s West Coast in early 1942. <a href=\"http://www.wnd.com/2004/09/26421/\">I took extreme exception</a> to that ludicrous attempt to justify internment, knowing that the argument was complete nonsense, and demonstrated that Malkin hadn’t done even a modicum of military research given her incorrect count of US carriers and inability to correctly interpret the significance of US carrier movements in early 1942.</p><p>This did not prevent <a href=\"http://www.milobookclub.com/2004/08/22/thoughtless-defense/\">a number of Malkin fans</a> from <a href=\"http://www.milobookclub.com/2004/09/06/evidence/\">attempting to defend the woman</a>, mostly on the sophisticated grounds of “yeah, but, how can you REALLY know, for, like, you know, sure?”</p><p>As it happens, the recently released gray book of Admiral Chester Nimitz, <a href=\"http://www.ibiblio.org/anrs/graybook.html\">published by the American Naval Records Society</a>, not only makes for fascinating reading, but conclusively settles the matter of the US military’s historical concerns regarding a potential invasion of the American West Coast in 1942. These are the verbatim words of the US Navy’s assessment of the situation in January 1942, quoted from Volume 1 of the briefings for the USN Commander in Chief, United States Pacific Fleet (CINCPACFLT). There is considerably more information than this available, but I have only transcribed that which is directly relevant to the subject at hand.</p><blockquote class=\"tr_bq\"><p> January 8, 1942<br> EMPLOYMENT OF CARRIER TASK FORCES IN JANUARY</br></p><p>ENEMY SITUATION<br> From the best intelligence we have, it appears that:</br></p><ol><li>The Far East offensives are occupying practically all of the amphibious forces of the enemy plus 3 or 4 carriers, 2 BB’s, about 13 cruisers, about one-third of his destroyers, some submarines and many auxiliary types. How long these forces will be needed in the Far East is problematical but it is believed that the end of January will see them there.</li><li>Since the raid on the 7th, all First Fleet units and carriers have apparently remained west of the Eastern Marshalls.</li><li>Carrier groups are being refitted or exchanged.</li></ol><p> ENEMY INTENTION</p><p>In other estimates the enemy’s intentions in general order of priority have been deduced as follows:</p><p>a) The prosecution of the offensives in the Far East until all of Malaya, Philippines and NEI have been captured. In this will probably be included Rangoon.<br> b) Consolidation of this territory.<br> c) Advance upon Australia.</br></br></p><p>    While these are going on:</p><p>d) Continued submarine raids on our forces and communications, minor attacks against outlying islands and Alaska.<br> e) Cruiser raids against the routes to Australia, and possibly to the Mainland.<br> f) Capture Samoa.<br> g) Capture Canton. [Canton Island (Kiribati)]<br> i) Capture Java.<br> J) Attack with strong forces, including carriers, for demolition Johnston, Palmyra, Midway.<br> k) Sweeps in force along our communications to outlying islands; along our route to Mainland.<br> l) Carrier raids on West Coast.<br> m) Attacks for capture of Midway, Palmyra; main Hawaiian Islands; Oahu.</br></br></br></br></br></br></br></br></p><p>One of the basic questions facing us is: Is the close cover of Oahu necessary at this time? Taking in combination the present state of its defenses and our deductions as to enemy intentions, the answer is “no”.</p></blockquote><p>In other words, the admiral commanding all the US military forces in the Pacific had absolutely no fear of a West Coast invasion, knew perfectly well that the limited Japanese transport capacity was committed elsewhere, and even went so far to conclude that the risk of a Hawaiian invasion was so low that it was not necessary to closely defend Hawaii, let alone California. Not only were Japanese naval forces fully engaged in the Far East, but their anticipated next move was in precisely the opposite direction from the West Coast!</p><p>As for the prospective carrier raids, <a href=\"http://www.milobookclub.com/2004/09/06/open-letter-to-michelle-malkin/\">I addressed the logistical aspects of them</a> back in 2004 and showed that no amount of carrier raids could have even slowed down the American production of war materials, much less “cripple the war effort”, as evidenced by the INCREASE in German manufacture under heavier and more regular bombing than the sort permitted by carrier raids.</p><p>The lesson, as before, is this: Michelle Malkin is an ignorant media whore with risible intellectual pretensions. To the best of my knowledge, she has never come out and admitted that she was wrong, nor has she publicly disavowed the ridiculous argument she presented in her book <i>In Defense of Internment: The Case for Racial Profiling in World War II and the War on Terror</i>.</p></div>",
  "content_text": "Longtime Ilk will recall that once upon a time, in 2004,\na lengthy debate was inspired\nby a book written by Me-So-Michelle that insisted the WWII-era internment of Japanese-Americans was justified on the basis of legitimate military fears of an invasion of America’s West Coast in early 1942.\nI took extreme exception\nto that ludicrous attempt to justify internment, knowing that the argument was complete nonsense, and demonstrated that Malkin hadn’t done even a modicum of military research given her incorrect count of US carriers and inability to correctly interpret the significance of US carrier movements in early 1942.\nThis did not prevent\na number of Malkin fans\nfrom\nattempting to defend the woman\n, mostly on the sophisticated grounds of “yeah, but, how can you REALLY know, for, like, you know, sure?”\nAs it happens, the recently released gray book of Admiral Chester Nimitz,\npublished by the American Naval Records Society\n, not only makes for fascinating reading, but conclusively settles the matter of the US military’s historical concerns regarding a potential invasion of the American West Coast in 1942. These are the verbatim words of the US Navy’s assessment of the situation in January 1942, quoted from Volume 1 of the briefings for the USN Commander in Chief, United States Pacific Fleet (CINCPACFLT). There is considerably more information than this available, but I have only transcribed that which is directly relevant to the subject at hand.\nJanuary 8, 1942\nEMPLOYMENT OF CARRIER TASK FORCES IN JANUARY\nENEMY SITUATION\nFrom the best intelligence we have, it appears that:\nThe Far East offensives are occupying practically all of the amphibious forces of the enemy plus 3 or 4 carriers, 2 BB’s, about 13 cruisers, about one-third of his destroyers, some submarines and many auxiliary types. How long these forces will be needed in the Far East is problematical but it is believed that the end of January will see them there.\nSince the raid on the 7th, all First Fleet units and carriers have apparently remained west of the Eastern Marshalls.\nCarrier groups are being refitted or exchanged.\nENEMY INTENTION\nIn other estimates the enemy’s intentions in general order of priority have been deduced as follows:\na) The prosecution of the offensives in the Far East until all of Malaya, Philippines and NEI have been captured. In this will probably be included Rangoon.\nb) Consolidation of this territory.\nc) Advance upon Australia.\nWhile these are going on:\nd) Continued submarine raids on our forces and communications, minor attacks against outlying islands and Alaska.\ne) Cruiser raids against the routes to Australia, and possibly to the Mainland.\nf) Capture Samoa.\ng) Capture Canton. [Canton Island (Kiribati)]\ni) Capture Java.\nJ) Attack with strong forces, including carriers, for demolition Johnston, Palmyra, Midway.\nk) Sweeps in force along our communications to outlying islands; along our route to Mainland.\nl) Carrier raids on West Coast.\nm) Attacks for capture of Midway, Palmyra; main Hawaiian Islands; Oahu.\nOne of the basic questions facing us is: Is the close cover of Oahu necessary at this time? Taking in combination the present state of its defenses and our deductions as to enemy intentions, the answer is “no”.\nIn other words, the admiral commanding all the US military forces in the Pacific had absolutely no fear of a West Coast invasion, knew perfectly well that the limited Japanese transport capacity was committed elsewhere, and even went so far to conclude that the risk of a Hawaiian invasion was so low that it was not necessary to closely defend Hawaii, let alone California. Not only were Japanese naval forces fully engaged in the Far East, but their anticipated next move was in precisely the opposite direction from the West Coast!\nAs for the prospective carrier raids,\nI addressed the logistical aspects of them\nback in 2004 and showed that no amount of carrier raids could have even slowed down the American production of war materials, much less “cripple the war effort”, as evidenced by the INCREASE in German manufacture under heavier and more regular bombing than the sort permitted by carrier raids.\nThe lesson, as before, is this: Michelle Malkin is an ignorant media whore with risible intellectual pretensions. To the best of my knowledge, she has never come out and admitted that she was wrong, nor has she publicly disavowed the ridiculous argument she presented in her book\nIn Defense of Internment: The Case for Racial Profiling in World War II and the War on Terror\n.",
  "tags": [
    "history",
    "war"
  ],
  "categories": [],
  "sitemap_lastmod": "2014-02-25T09:19:00+00:00"
}