{
  "url": "https://voxday.net/2014/02/14/do-they-have-script-or-something/",
  "scraped_at": "2025-12-15T16:46:26.162211",
  "title": "Do they have a script or something?",
  "date_display": "February 14, 2014",
  "date_iso": "2014-02-14T14:00:00+00:00",
  "date_from_url": "2014-02-14",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>Awareness <a href=\"http://www.patheos.com/blogs/markshea/2014/02/on-getting-punked-and-what-matters.html\">gradually dawns</a>:</p><blockquote class=\"tr_bq\"><p> If the account of my reader’s experience is fiction, oh well. I got punked. Dumb ol’ me. I got lied to. But here’s the thing: That doesn’t really matter all that much, because the issue is not whether some local group of DE types goes in for silly rituals or uses goofy code words lifted from Tolkien or has a kinkyboots fascination with inspecting your phenotype. It’s not whether a couple of rich guys have decided to patronize this stuff as their latest boutique cause. It’s that, yes, this stuff really is about racialism and the inculcation of pride. And you need look no further than the comments from DE types in my comboxes who show up to laugh at my gullibility in the matter of gnats and stay to swallow the camel of racialist pride (and, by the way, contempt for the Church, particularly among Reactionary Catholics)</p></blockquote><p>Even after getting trolled and being shown for a reactionary buffoon, Mark Shea still hasn’t grasped the essential point. There is no movement. There is no “Dark Enlightenment”. There are no secret meetings and oaths sworn on <i>On the Origin of Species by Means of Natural Selection, or the Preservation of Favoured Races in the Struggle for Life</i>. None of it is real. None of it exists. I’m not a Sith Lord.</p><p>The amusing thing is watching Shea attempt to simultaneously a) admit that he was wrong, b) claim that it doesn’t matter, c) stand by his claim that the Dark Enlightenment is a deadly danger, and d) pretend that one of its supposed leaders is unimportant. He adds this in the comments:</p><blockquote class=\"tr_bq\"><p> As near as I can tell, Vox Day is a non-denom Protestant of some sort<br> who has cobbled together a do-it-yourself theology from the stones and<br> bones of the American Christian landscape and is now alloying it with<br> some crap stuff about being among the High IQ elect. A sort of<br> Calvinized racialism.  And judging from the number of flying monkey he<br> sends my way, he seems to have a bit of a following.  Beyond that, I<br> don’t pay too much attention.</br></br></br></br></br></br></p></blockquote><p>I would say he doesn’t pay any attention at all. I’m not sure which is more absurd, the SFWA Board’s claim that I am a white supremacist or Shea’s idea that I am some sort of Calvinist. And while it’s absolutely fine that he pays no attention to me, that would appear to be a little strange considering that I am supposed to be one of the Sith Lords of the movement that concerns him so greatly.</p><p>I find it bemusing how a certain sort of critic always seems to be torn between warning everyone how Very Bad and Dangerous you are while simultaneously attempting to play down your influence. I suppose it’s not surprising that they don’t tend to be the sort of critics who are capable of mounting credible logical challenges.</p></div>",
  "content_text": "Awareness\ngradually dawns\n:\nIf the account of my reader’s experience is fiction, oh well. I got punked. Dumb ol’ me. I got lied to. But here’s the thing: That doesn’t really matter all that much, because the issue is not whether some local group of DE types goes in for silly rituals or uses goofy code words lifted from Tolkien or has a kinkyboots fascination with inspecting your phenotype. It’s not whether a couple of rich guys have decided to patronize this stuff as their latest boutique cause. It’s that, yes, this stuff really is about racialism and the inculcation of pride. And you need look no further than the comments from DE types in my comboxes who show up to laugh at my gullibility in the matter of gnats and stay to swallow the camel of racialist pride (and, by the way, contempt for the Church, particularly among Reactionary Catholics)\nEven after getting trolled and being shown for a reactionary buffoon, Mark Shea still hasn’t grasped the essential point. There is no movement. There is no “Dark Enlightenment”. There are no secret meetings and oaths sworn on\nOn the Origin of Species by Means of Natural Selection, or the Preservation of Favoured Races in the Struggle for Life\n. None of it is real. None of it exists. I’m not a Sith Lord.\nThe amusing thing is watching Shea attempt to simultaneously a) admit that he was wrong, b) claim that it doesn’t matter, c) stand by his claim that the Dark Enlightenment is a deadly danger, and d) pretend that one of its supposed leaders is unimportant. He adds this in the comments:\nAs near as I can tell, Vox Day is a non-denom Protestant of some sort\nwho has cobbled together a do-it-yourself theology from the stones and\nbones of the American Christian landscape and is now alloying it with\nsome crap stuff about being among the High IQ elect. A sort of\nCalvinized racialism.  And judging from the number of flying monkey he\nsends my way, he seems to have a bit of a following.  Beyond that, I\ndon’t pay too much attention.\nI would say he doesn’t pay any attention at all. I’m not sure which is more absurd, the SFWA Board’s claim that I am a white supremacist or Shea’s idea that I am some sort of Calvinist. And while it’s absolutely fine that he pays no attention to me, that would appear to be a little strange considering that I am supposed to be one of the Sith Lords of the movement that concerns him so greatly.\nI find it bemusing how a certain sort of critic always seems to be torn between warning everyone how Very Bad and Dangerous you are while simultaneously attempting to play down your influence. I suppose it’s not surprising that they don’t tend to be the sort of critics who are capable of mounting credible logical challenges.",
  "tags": [
    "freakshow"
  ],
  "categories": [],
  "sitemap_lastmod": "2014-02-14T14:00:00+00:00"
}