{
  "url": "https://voxday.net/2014/02/09/europes-tide-turns/",
  "scraped_at": "2025-12-15T16:45:54.319787",
  "title": "Europe’s tide turns",
  "date_display": "February 9, 2014",
  "date_iso": "2014-02-09T16:28:00+00:00",
  "date_from_url": "2014-02-09",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>Switzerland <a href=\"http://www.swissinfo.ch/eng/swiss_news/Swiss_agree_to_curb_immigration_and_rethink_EU_deal_.html?cid=37877780\">rejects the EU-imposed free movement of peoples</a> required by Shengen:</p><blockquote class=\"tr_bq\"><p> Voters in Switzerland have<br> narrowly approved a rightwing proposal to curb immigration. It imposes<br> limits on the number of foreigners allowed in and may signal an end to<br> the country’s free movement accord with the European Union. The initiative was approved by just 50.3% of the votes and was passed by a majority of cantons.</br></br></br></p><p>The<br> move by the Swiss People’s Party – known for its anti-foreigner and<br> anti-EU agenda – will see the reintroduction of quotas, as well as a<br> national preference when filling job vacancies and restrictions of<br> immigrants’ rights to social benefits.</br></br></br></br></p><p>Critically, it also<br> stipulates that Switzerland will have to renegotiate its bilateral<br> accord with the EU on the free movement of people within three years or<br> revoke it. This in turn could threaten other bilateral agreements with<br> the EU.</br></br></br></br></p></blockquote><p>This should mark the high water mark for mass immigration madness and perhaps the much needed reawakening of nationalism across the West as well. Switzerland is an excellent barometer in this regard because it is the only Western nation where the people have the ability to democratically overrule its representative leadership and the political games that allow the Western governments to ignore the democratic will of the people.</p></div>",
  "content_text": "Switzerland\nrejects the EU-imposed free movement of peoples\nrequired by Shengen:\nVoters in Switzerland have\nnarrowly approved a rightwing proposal to curb immigration. It imposes\nlimits on the number of foreigners allowed in and may signal an end to\nthe country’s free movement accord with the European Union. The initiative was approved by just 50.3% of the votes and was passed by a majority of cantons.\nThe\nmove by the Swiss People’s Party – known for its anti-foreigner and\nanti-EU agenda – will see the reintroduction of quotas, as well as a\nnational preference when filling job vacancies and restrictions of\nimmigrants’ rights to social benefits.\nCritically, it also\nstipulates that Switzerland will have to renegotiate its bilateral\naccord with the EU on the free movement of people within three years or\nrevoke it. This in turn could threaten other bilateral agreements with\nthe EU.\nThis should mark the high water mark for mass immigration madness and perhaps the much needed reawakening of nationalism across the West as well. Switzerland is an excellent barometer in this regard because it is the only Western nation where the people have the ability to democratically overrule its representative leadership and the political games that allow the Western governments to ignore the democratic will of the people.",
  "tags": [
    "EU",
    "immigration"
  ],
  "categories": [],
  "sitemap_lastmod": "2014-02-09T16:28:00+00:00"
}