{
  "url": "https://voxday.net/2014/02/04/fear-of-black-yoga-class_8460/",
  "scraped_at": "2025-12-15T16:45:26.707151",
  "title": "Fear of a Black Yoga Class",
  "date_display": "February 4, 2014",
  "date_iso": "2014-02-04T14:00:00+00:00",
  "date_from_url": "2014-02-04",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>One has to salute the remarkable courage of this brave young woman who was faced by a terrible moral crisis <a href=\"http://gawker.com/black-person-in-yoga-class-causes-profound-moral-crisis-1510975100\">in the very last place she expected it</a>:</p><blockquote class=\"tr_bq\"><p> A few weeks ago, as I settled into an exceptionally crowded midday<br> class, a young, fairly heavy black woman put her mat down directly<br> behind mine. It appeared she had never set foot in a yoga studio—she was<br> glancing around anxiously, adjusting her clothes, looking wide-eyed and<br> nervous. Within the first few minutes of gentle warm-up stretches, I<br> saw the fear in her eyes snowball, turning into panic and then despair.<br> Before we made it into our first downward dog, she had crouched down on<br> her elbows and knees, head lowered close to the ground, trapped and<br> vulnerable. She stayed there, staring, for the rest of the class.</br></br></br></br></br></br></br></br></p><p>Because I was directly in front of her, I had no choice but to look<br> straight at her every time my head was upside down (roughly once a<br> minute). I’ve seen people freeze or give up in yoga classes many times,<br> and it’s a sad thing, but as a student there’s nothing you can do about<br> it. At that moment, though, I found it impossible to stop thinking about<br> this woman. Even when I wasn’t positioned to stare directly at her, I<br> knew she was still staring directly at me. Over the course of the next<br> hour, I watched as her despair turned into resentment and then contempt.<br> I felt it all directed toward me and my body….</br></br></br></br></br></br></br></br></p><p>I got home from that class and promptly broke down crying. Yoga, a<br> beloved safe space that has helped me through many dark moments in over<br> six years of practice, suddenly felt deeply suspect. Knowing fully well<br> that one hour of perhaps self-importantly believing myself to be the<br> deserving target of a racially charged anger is nothing, is largely my<br> own psychological projection, is a drop in the bucket, is the tip of the<br> iceberg in American race relations, I was shaken by it all the same.</br></br></br></br></br></br></p></blockquote><p>Reading<br> this, one is left with one immediate and inescapable question: how on<br> Earth can anyone possibly even attempt to justify female suffrage?<br> Although one can’t help but be amused by the idea that a single invasion<br> by one African is sufficient to make this no-doubt “anti-racist” white<br> woman begin to question the safety and value of six years of yoga<br> classes.</br></br></br></br></br></br></p><p>Now, a few years ago, one might well have<br> assumed that this simply had to be an SWPL parody. And perhaps it is.<br> But we now live in a post-parodic society where nothing, no matter how<br> absurd, can be assumed to be a joke.</br></br></br></p><p>Especially such deadly serious matters as <strike>interracial </strike>inter-subspecies same-sex stare rape.</p></div>",
  "content_text": "One has to salute the remarkable courage of this brave young woman who was faced by a terrible moral crisis\nin the very last place she expected it\n:\nA few weeks ago, as I settled into an exceptionally crowded midday\nclass, a young, fairly heavy black woman put her mat down directly\nbehind mine. It appeared she had never set foot in a yoga studio—she was\nglancing around anxiously, adjusting her clothes, looking wide-eyed and\nnervous. Within the first few minutes of gentle warm-up stretches, I\nsaw the fear in her eyes snowball, turning into panic and then despair.\nBefore we made it into our first downward dog, she had crouched down on\nher elbows and knees, head lowered close to the ground, trapped and\nvulnerable. She stayed there, staring, for the rest of the class.\nBecause I was directly in front of her, I had no choice but to look\nstraight at her every time my head was upside down (roughly once a\nminute). I’ve seen people freeze or give up in yoga classes many times,\nand it’s a sad thing, but as a student there’s nothing you can do about\nit. At that moment, though, I found it impossible to stop thinking about\nthis woman. Even when I wasn’t positioned to stare directly at her, I\nknew she was still staring directly at me. Over the course of the next\nhour, I watched as her despair turned into resentment and then contempt.\nI felt it all directed toward me and my body….\nI got home from that class and promptly broke down crying. Yoga, a\nbeloved safe space that has helped me through many dark moments in over\nsix years of practice, suddenly felt deeply suspect. Knowing fully well\nthat one hour of perhaps self-importantly believing myself to be the\ndeserving target of a racially charged anger is nothing, is largely my\nown psychological projection, is a drop in the bucket, is the tip of the\niceberg in American race relations, I was shaken by it all the same.\nReading\nthis, one is left with one immediate and inescapable question: how on\nEarth can anyone possibly even attempt to justify female suffrage?\nAlthough one can’t help but be amused by the idea that a single invasion\nby one African is sufficient to make this no-doubt “anti-racist” white\nwoman begin to question the safety and value of six years of yoga\nclasses.\nNow, a few years ago, one might well have\nassumed that this simply had to be an SWPL parody. And perhaps it is.\nBut we now live in a post-parodic society where nothing, no matter how\nabsurd, can be assumed to be a joke.\nEspecially such deadly serious matters as\ninterracial\ninter-subspecies same-sex stare rape.",
  "tags": [],
  "categories": [],
  "sitemap_lastmod": "2014-02-04T14:00:00+00:00"
}