{
  "url": "https://voxday.net/2014/02/06/imaginary-women-in-military/",
  "scraped_at": "2025-12-15T16:45:38.570970",
  "title": "Imaginary women in the military",
  "date_display": "February 6, 2014",
  "date_iso": "2014-02-06T10:20:00+00:00",
  "date_from_url": "2014-02-06",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>It’s not the article at Tor that is of interest here, but rather <a href=\"http://www.tor.com/blogs/2012/01/admirals-and-amazons-women-in-military-science-fiction\">the discussion between Tom Kratman and a small collection of Pink SF enthusiasts</a> who do not permit their complete ignorance of all things military affect their ability to express some strong opinions on future war:<i> </i></p><blockquote class=\"tr_bq\"><p> <i>“Sexual attraction may be innate, but it’s not universal. See asexual, people who identify as.” </i></p><p>Do you really think the occasional fluke has a whole lot to say about mass armies? If so, why?</p><p><i>How people act on sexual attraction is learned behaviour.</i></p><p>Only in minor details. The love, lust, favoritism, demoralization, and de facto prostitution are fairly universal within any armed force that sees integrated sexes or integrated sexually compatible people unless extraordinary structural provisions are made. Those structural provision include segregation. Here’s an interesting quote from very liberal, very politically correct Canada’s PPCLI battle school: “Male/female attraction will not go away because we tell it to; and soldiers will court considerable risk to pursue the obvious.”</p><p>What you really seem to be saying is we can control it. Forget it; we can’t.</p><p>What you should not forget is the ability of an army, any army, to make a terrible idea look good through sheer weight of effort and duplicity practiced on an heroic scale. Think Vietnam…or Project 100,000.</p><p><i>“can’t be controlled.” Tom, man. What’re you saying, dude? That people use sex to game the system? (Some people use anything to game systems.) And somehow that’s what, especially unfair? Or you’re saying, what, the act of sex is so inherently super-special it has in itself some peculiarly distorting effect on hierarchies? (Or maybe you’re saying something about sexual coercion, but I’m not going there.) I say to this: grow some imagination. I’m tired of hearing “the future can’t be different because [argument which boils down to “I don’t want to think about what would have to change”].” Like I said, these may not be stories you want to read or tell? But don’t pretend they can’t be told, or that other people may not find your futures as implausible – and even unpleasant – as you might theirs, on good grounds. From where I stand, your futures do live in Opposite World. And unless you bring a more SFnal imagination to our present interaction, my opinion of your wrongheadedness isn’t likely to change. </i></p><p>No, you are presupposing that things which cannot be changed can. Worse, you have no obvious basis for believing it except that you want to. Do you have any expertise in the matter of combat? I do. What you’re demanding isn’t SF; it’s fantasy. The mere fact that you can so lightly dismiss the effect of using sex to game the system, and as if that were all of it, indicates that anything that interferes with your particular fantasy has to be rejected.</p><p>Yes, the effect of sex has distorting effects in hierarchies. Perhaps it doesn’t matter at any given corporation, but combat units are not corporations. The next time Bill Gates has to worry about a near ambush or artillery strike on his way to the office will be the first.</p><p>In this particular, no, the future cannot be different unless you write away what men and women are, how they think and act, what they care about, and what they’ll take risks for.</p></blockquote><p>Tom’s response is brilliant because it highlights the essential <i>inhumanity </i>of Pink SF. If great fiction speaks to the human condition, the great flaw of Pink SF is that it specifically and overtly rejects the human elements of the human condition. While I defer to Tom Kratman on what he insists is the legitimate possibility, given a considerable quantity of extreme and particular training, of women serving in an effective military unit, I remain extremely dubious that even the conventional notions of superstrength and mandatory reversible birth control could begin to permit women to become even mediocre soldiers. (4-3-6), in ASL terms, would be a best case scenario.</p><p>While I am not a military veteran, I am both a student of military history and a former martial arts fighter. As the former, I am aware that what settles battles is not who can kill the other side more effectively, but rather, who can cause the other side to run away or otherwise quit fighting first. As the latter, I have observed that women quit fighting as soon as they take a single damaging strike and not infrequently before then.</p><p>I have seen many men fight with broken bones; I myself once won a ringfight after having my nose broken in the initial exchange. I have never seen a woman get up off the ground after being flattened or bloodied and continue fighting except when she is in training with someone she trusts not to intentionally hurt her. In fact, when a woman isn’t hurt but simply gets frightened while sparring, she tends to turn her back on the opponent and literally cringe.</p><p>So, my conclusion is that women in combat will either surrender or run like rabbits as soon as they get sufficiently frightened or their unit takes a few casualties.</p><p>This comment, in particular, amused me:</p><blockquote class=\"tr_bq\"><p> Then again, on the other hand, we have John Scalzi, against whom I can<br> levy no such complaint. Scalzi, unlike Ringo, Kratman, or Williamson,<br> doesn’t have a military background of his own. Yet I find his future<br> military more convincingly <i>science-fictional</i> than those of the  aforementioned authors. <b><i>Why is that?</i></b></br></br></br></p></blockquote><p>I would think the answer is entirely obvious. Because you know nothing about war or the military and you prefer your weird non-science fantasies about old people’s orgies and men exchanging sexual favors to anything that can be reasonably extrapolated from the last 8,000 years of recorded military history.</p><p>The militaries in the science fiction world of QUANTUM MORTIS do not utilize female soldiers for the obvious reason that they are actually expected to engage in combat. The science fiction elements there involve physical augmentation, targeting-assisted weaponry, artificial intelligence, and interstellar mercenary corporations. They do not involve silly fantasies about strong, independent warrior women, which by rights should be classified as women’s erotic fiction rather than science fiction because it is quite literally anti-science.</p></div>",
  "content_text": "It’s not the article at Tor that is of interest here, but rather\nthe discussion between Tom Kratman and a small collection of Pink SF enthusiasts\nwho do not permit their complete ignorance of all things military affect their ability to express some strong opinions on future war:\n“Sexual attraction may be innate, but it’s not universal. See asexual, people who identify as.”\nDo you really think the occasional fluke has a whole lot to say about mass armies? If so, why?\nHow people act on sexual attraction is learned behaviour.\nOnly in minor details. The love, lust, favoritism, demoralization, and de facto prostitution are fairly universal within any armed force that sees integrated sexes or integrated sexually compatible people unless extraordinary structural provisions are made. Those structural provision include segregation. Here’s an interesting quote from very liberal, very politically correct Canada’s PPCLI battle school: “Male/female attraction will not go away because we tell it to; and soldiers will court considerable risk to pursue the obvious.”\nWhat you really seem to be saying is we can control it. Forget it; we can’t.\nWhat you should not forget is the ability of an army, any army, to make a terrible idea look good through sheer weight of effort and duplicity practiced on an heroic scale. Think Vietnam…or Project 100,000.\n“can’t be controlled.” Tom, man. What’re you saying, dude? That people use sex to game the system? (Some people use anything to game systems.) And somehow that’s what, especially unfair? Or you’re saying, what, the act of sex is so inherently super-special it has in itself some peculiarly distorting effect on hierarchies? (Or maybe you’re saying something about sexual coercion, but I’m not going there.) I say to this: grow some imagination. I’m tired of hearing “the future can’t be different because [argument which boils down to “I don’t want to think about what would have to change”].” Like I said, these may not be stories you want to read or tell? But don’t pretend they can’t be told, or that other people may not find your futures as implausible – and even unpleasant – as you might theirs, on good grounds. From where I stand, your futures do live in Opposite World. And unless you bring a more SFnal imagination to our present interaction, my opinion of your wrongheadedness isn’t likely to change.\nNo, you are presupposing that things which cannot be changed can. Worse, you have no obvious basis for believing it except that you want to. Do you have any expertise in the matter of combat? I do. What you’re demanding isn’t SF; it’s fantasy. The mere fact that you can so lightly dismiss the effect of using sex to game the system, and as if that were all of it, indicates that anything that interferes with your particular fantasy has to be rejected.\nYes, the effect of sex has distorting effects in hierarchies. Perhaps it doesn’t matter at any given corporation, but combat units are not corporations. The next time Bill Gates has to worry about a near ambush or artillery strike on his way to the office will be the first.\nIn this particular, no, the future cannot be different unless you write away what men and women are, how they think and act, what they care about, and what they’ll take risks for.\nTom’s response is brilliant because it highlights the essential\ninhumanity\nof Pink SF. If great fiction speaks to the human condition, the great flaw of Pink SF is that it specifically and overtly rejects the human elements of the human condition. While I defer to Tom Kratman on what he insists is the legitimate possibility, given a considerable quantity of extreme and particular training, of women serving in an effective military unit, I remain extremely dubious that even the conventional notions of superstrength and mandatory reversible birth control could begin to permit women to become even mediocre soldiers. (4-3-6), in ASL terms, would be a best case scenario.\nWhile I am not a military veteran, I am both a student of military history and a former martial arts fighter. As the former, I am aware that what settles battles is not who can kill the other side more effectively, but rather, who can cause the other side to run away or otherwise quit fighting first. As the latter, I have observed that women quit fighting as soon as they take a single damaging strike and not infrequently before then.\nI have seen many men fight with broken bones; I myself once won a ringfight after having my nose broken in the initial exchange. I have never seen a woman get up off the ground after being flattened or bloodied and continue fighting except when she is in training with someone she trusts not to intentionally hurt her. In fact, when a woman isn’t hurt but simply gets frightened while sparring, she tends to turn her back on the opponent and literally cringe.\nSo, my conclusion is that women in combat will either surrender or run like rabbits as soon as they get sufficiently frightened or their unit takes a few casualties.\nThis comment, in particular, amused me:\nThen again, on the other hand, we have John Scalzi, against whom I can\nlevy no such complaint. Scalzi, unlike Ringo, Kratman, or Williamson,\ndoesn’t have a military background of his own. Yet I find his future\nmilitary more convincingly\nscience-fictional\nthan those of the  aforementioned authors.\nWhy is that?\nI would think the answer is entirely obvious. Because you know nothing about war or the military and you prefer your weird non-science fantasies about old people’s orgies and men exchanging sexual favors to anything that can be reasonably extrapolated from the last 8,000 years of recorded military history.\nThe militaries in the science fiction world of QUANTUM MORTIS do not utilize female soldiers for the obvious reason that they are actually expected to engage in combat. The science fiction elements there involve physical augmentation, targeting-assisted weaponry, artificial intelligence, and interstellar mercenary corporations. They do not involve silly fantasies about strong, independent warrior women, which by rights should be classified as women’s erotic fiction rather than science fiction because it is quite literally anti-science.",
  "tags": [
    "war",
    "writing"
  ],
  "categories": [],
  "sitemap_lastmod": "2014-02-06T10:20:00+00:00"
}