{
  "url": "https://voxday.net/2014/02/12/lake-freeze-denialis/",
  "scraped_at": "2025-12-15T16:46:12.389556",
  "title": "Lake-freeze denialism",
  "date_display": "February 12, 2014",
  "date_iso": "2014-02-12T14:00:00+00:00",
  "date_from_url": "2014-02-12",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>It’s interesting to observe the difference between the science fetishists’ demands for evidence where the supernatural is concerned, and their ability to completely ignore it wherever their pet hypotheses <a href=\"http://cnsnews.com/news/article/barbara-hollingsworth/ice-expert-predicts-lake-superior-will-completely-freeze-over\">are jeopardized by observation</a>:</p><blockquote class=\"tr_bq\"><p> Lake Superior hasn’t completely frozen over in two decades. But an expert on Great Lakes ice says there’s a “very high likelihood” that the three-quadrillion-gallon lake will soon be totally covered with ice thanks to this winter’s record-breaking cold. The ice cover on the largest freshwater lake in the world hit a 20-year record of 91 percent on Feb. 5, 1994. Jay Austin, associate professor at the Large Lakes Observatory in Duluth, Minn., told CNSNews.com that he expects that record will be broken this winter when the most northern of the Great Lakes becomes totally shrouded in ice….</p><p>Austin attributes the large amount of ice on the lake to the “<a href=\"http://www.nws.noaa.gov/view/prodsByState.php?state=mn&amp;prodtype=public\">extraordinary cold</a> winter we’ve had,” pointing out that Duluth recently experienced an all-time <a href=\"http://www.duluthnewstribune.com/event/article/id/291286/\">record</a> of 23 straight days of below-zero temperatures. The previous record of 22 days was set in 1936 and tied in 1963, according to the National Weather Service.</p></blockquote><p>Of course, if we observational rationalists were to operate like the global warmists, we would immediately take a poll of everyone to decide if they believed Lake Superior would freeze over or not, then trumpet our consensus as irrefutable scientific fact.</p><p>I suggest we wait a month to see if the lake actually freezes over or not. Even if doing so makes me a lake-freeze denialist.</p></div>",
  "content_text": "It’s interesting to observe the difference between the science fetishists’ demands for evidence where the supernatural is concerned, and their ability to completely ignore it wherever their pet hypotheses\nare jeopardized by observation\n:\nLake Superior hasn’t completely frozen over in two decades. But an expert on Great Lakes ice says there’s a “very high likelihood” that the three-quadrillion-gallon lake will soon be totally covered with ice thanks to this winter’s record-breaking cold. The ice cover on the largest freshwater lake in the world hit a 20-year record of 91 percent on Feb. 5, 1994. Jay Austin, associate professor at the Large Lakes Observatory in Duluth, Minn., told CNSNews.com that he expects that record will be broken this winter when the most northern of the Great Lakes becomes totally shrouded in ice….\nAustin attributes the large amount of ice on the lake to the “\nextraordinary cold\nwinter we’ve had,” pointing out that Duluth recently experienced an all-time\nrecord\nof 23 straight days of below-zero temperatures. The previous record of 22 days was set in 1936 and tied in 1963, according to the National Weather Service.\nOf course, if we observational rationalists were to operate like the global warmists, we would immediately take a poll of everyone to decide if they believed Lake Superior would freeze over or not, then trumpet our consensus as irrefutable scientific fact.\nI suggest we wait a month to see if the lake actually freezes over or not. Even if doing so makes me a lake-freeze denialist.",
  "tags": [
    "AGW/CC"
  ],
  "categories": [],
  "sitemap_lastmod": "2014-02-12T14:00:00+00:00"
}