{
  "url": "https://voxday.net/2014/02/15/mailvox-compare-and-contras/",
  "scraped_at": "2025-12-15T16:46:29.916169",
  "title": "Mailvox: compare and contrast",
  "date_display": "February 15, 2014",
  "date_iso": "2014-02-15T12:00:00+00:00",
  "date_from_url": "2014-02-15",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><ol><li>Josh observed:<i> “It looks to me like the prestige of being published by a traditional<br> publisher is a commodity paid for by allowing them to rape you on the<br> royalties.”</br></br></i></li><li>McRapey defended Tor: <i>“I actually like my publishers, and they add value to my work and don’t rip me off in the process. Please don’t consider them evil (at least in their involvement with me), or try to cut them out of the pay loop. Thank you.”</i></li><li>Jerry Pournelle cited history:<i> “As to conceding 30% to Amazon, I’m damned happy to do it, since publishers take 90%, and back in the bad old days hardbound publishers got 50% of the 5% we got from paperbacks as well. And tried to grab half the movie rights.”</i></li></ol><p>I suggest a look at the facts are in order. Here are the specific terms from a Big Five publisher on a one-book contract offer with a $40,000 advance. Except for the retension of multimedia rights and the unusually high ebook royalties I negotiated, the terms are very similar to contracts with both larger and smaller advances from fellow Big Five publishers.</p><ul><li>full term of copyright</li><li>Hardcover: 10 percent of catalog retail price on first 10,000 copies, 12.5 percent on the next 5,000 copies, and 15 percent on 15,000+ copies.</li><li>Trade Paperback: 6 percent of catalog retail price on the first 20,000 copies and 7.5 percent on 20,000+ copies.</li><li>Mass Market Paperback: 9 percent on first 150,000 copies and 10 percent on 150,000+.</li><li>Ebook: 50 percent of revenues received.(1)</li><li>Foreign language: 25 percent of proceeds from foreign publisher. Which, if similar to these terms, means 2.5 percent on hardcover and 6.25 percent on ebook.</li><li>All multimedia rights to games, films, and so forth were retained by the author.(2)</li></ul><p>Now, keep in mind that this was considerably better than the boilerplate (see points 1 and 2 below). And there are certainly some authors who are able to command better terms than that, Hugh Howey being the prime example of an ideal model to follow. But before you dismiss me as someone who doesn’t know what he’s talking about or blithely accepts bad contracts, how many authors do you know receive bigger advances than 8x the median SF first novel advance in 2005, (and I’ve heard they’re down to around $3,000 now, in which case 13.3x), while not giving up any film or game rights and receiving twice the standard ebook royalty?</p><p>Keep in mind that Jerry and I are not the horror stories. We’re simply pointing out how bad traditional publishing contracts have been even though we are both relative success stories! Bruce Bethke, on the other hand, wasn’t so fortunate. Consider the fate of <b><i>Cyberpunk</i></b>: <i>“Initially written as a series of short stories in 1980, the novel was purchased by a publisher via an exclusive contract which<br> forbade Bethke to sell the novel to any other publisher. The publisher<br> decided not to release the novel, causing several years of legal battles<br> over the rights to the book.”</br></br></br></i></p><p>So, while Tor may not be ripping off McRapey, who happily accepts making less money per unit in return for primary author status at the largest SF publisher, they are most certainly taking advantage of their lesser auhors. Compare who the names of the writers they published 10-15 years ago to the names being published now. What you will see, and what you will see if you look at any major publisher’s list of authors published over time is a regular new author churn, with low-cost authors providing 1-3 new books before being dropped and replaced when they fail to achieve sufficient sales velocity. It’s a constant churning process, and sometimes the publisher gets it wrong, such as when Pocket Books dropped Dan Brown prior to him writing <b><i>The Da Vinci Code</i></b>, which is a sequel to the Pocket-published <b><i>Angels and Demons</i></b>.</p><p>As one of the people involved in that decision once told me: “Nobody knows what they’re doing in this industry. We act like we do, but we really don’t.”</p><p>For the most part, publishers don’t really care who makes it and who doesn’t, because there are always new replacement writers to pour into the publishing mill. And there is nothing wrong with this process at face value, after all, publishers can’t afford to keep publishing authors who don’t sell in sufficient numbers. The problem is that the winners and losers are, to a large part, predetermined by the gatekeepers within the publishing house due to print runs and decisions to reprint books that have sold through their print runs or not. In my experience, these decisions are seldom based in ideology or malice, but are mostly rooted in happenstance and bureaucratic inertia.</p><p>Also, I should correct a previous statement. John Scalzi did not denigrate “self-publishers” when he went on his anti-Random House rampage in his swan song as SFWA president. He explicitly denigrated independent publishers operating on the no-advances model.</p><blockquote class=\"tr_bq\"><p> So why are so many eBook-only publishers attempting to run with the “no advances” business model? If I had to guess, I would say because many of these then-erstwhile publishers assumed that publishing electronically had a low financial threshold of entry (not true, if you’re serious about it) and they fancied being publishers, so they started their businesses undercapitalized, and are now currently in the process of passing the consequences of that undercapitalization unto the authors they would like to work with. Alternately, as appears to be the case with Random House, they’re looking for a way to pass as much of the initial cost of publishing onto the author as possible, and one of the best ways to bring down those initial costs is to avoid paying the author anything up front. Both of these are bad business models, although one is more maliciously so, and both are to be avoided. Just because someone has stupidly or maliciously planned their business, doesn’t mean you’re obliged to sign a contract with them.</p></blockquote><p>There is nothing stupid or malicious about a shared risk/shared reward model. Only a rabbit who is afraid of risk could possibly suggest that there is. I leave it to the reader to compare the royalty terms of the traditional publishers shown above to the 25 to 65 percent royalties on revenues received offered by independent publishers utilizing the “no advances” shared-risk model, and to decide whose business model is disadvantageous to the author and which sort of contracts are therefore best avoided.</p><p>(1) With the Big Five these are now a standard 25 percent.<br> (2) I have a copy of the contract with the boilerplate struck out. They actually tried to grab 100 percent of the net proceeds from British Commonwealth rights, foreign language translation rights, motion picture and television rights, and commercial merchandising rights.</br></p></div>",
  "content_text": "Josh observed:\n“It looks to me like the prestige of being published by a traditional\npublisher is a commodity paid for by allowing them to rape you on the\nroyalties.”\nMcRapey defended Tor:\n“I actually like my publishers, and they add value to my work and don’t rip me off in the process. Please don’t consider them evil (at least in their involvement with me), or try to cut them out of the pay loop. Thank you.”\nJerry Pournelle cited history:\n“As to conceding 30% to Amazon, I’m damned happy to do it, since publishers take 90%, and back in the bad old days hardbound publishers got 50% of the 5% we got from paperbacks as well. And tried to grab half the movie rights.”\nI suggest a look at the facts are in order. Here are the specific terms from a Big Five publisher on a one-book contract offer with a $40,000 advance. Except for the retension of multimedia rights and the unusually high ebook royalties I negotiated, the terms are very similar to contracts with both larger and smaller advances from fellow Big Five publishers.\nfull term of copyright\nHardcover: 10 percent of catalog retail price on first 10,000 copies, 12.5 percent on the next 5,000 copies, and 15 percent on 15,000+ copies.\nTrade Paperback: 6 percent of catalog retail price on the first 20,000 copies and 7.5 percent on 20,000+ copies.\nMass Market Paperback: 9 percent on first 150,000 copies and 10 percent on 150,000+.\nEbook: 50 percent of revenues received.(1)\nForeign language: 25 percent of proceeds from foreign publisher. Which, if similar to these terms, means 2.5 percent on hardcover and 6.25 percent on ebook.\nAll multimedia rights to games, films, and so forth were retained by the author.(2)\nNow, keep in mind that this was considerably better than the boilerplate (see points 1 and 2 below). And there are certainly some authors who are able to command better terms than that, Hugh Howey being the prime example of an ideal model to follow. But before you dismiss me as someone who doesn’t know what he’s talking about or blithely accepts bad contracts, how many authors do you know receive bigger advances than 8x the median SF first novel advance in 2005, (and I’ve heard they’re down to around $3,000 now, in which case 13.3x), while not giving up any film or game rights and receiving twice the standard ebook royalty?\nKeep in mind that Jerry and I are not the horror stories. We’re simply pointing out how bad traditional publishing contracts have been even though we are both relative success stories! Bruce Bethke, on the other hand, wasn’t so fortunate. Consider the fate of\nCyberpunk\n:\n“Initially written as a series of short stories in 1980, the novel was purchased by a publisher via an exclusive contract which\nforbade Bethke to sell the novel to any other publisher. The publisher\ndecided not to release the novel, causing several years of legal battles\nover the rights to the book.”\nSo, while Tor may not be ripping off McRapey, who happily accepts making less money per unit in return for primary author status at the largest SF publisher, they are most certainly taking advantage of their lesser auhors. Compare who the names of the writers they published 10-15 years ago to the names being published now. What you will see, and what you will see if you look at any major publisher’s list of authors published over time is a regular new author churn, with low-cost authors providing 1-3 new books before being dropped and replaced when they fail to achieve sufficient sales velocity. It’s a constant churning process, and sometimes the publisher gets it wrong, such as when Pocket Books dropped Dan Brown prior to him writing\nThe Da Vinci Code\n, which is a sequel to the Pocket-published\nAngels and Demons\n.\nAs one of the people involved in that decision once told me: “Nobody knows what they’re doing in this industry. We act like we do, but we really don’t.”\nFor the most part, publishers don’t really care who makes it and who doesn’t, because there are always new replacement writers to pour into the publishing mill. And there is nothing wrong with this process at face value, after all, publishers can’t afford to keep publishing authors who don’t sell in sufficient numbers. The problem is that the winners and losers are, to a large part, predetermined by the gatekeepers within the publishing house due to print runs and decisions to reprint books that have sold through their print runs or not. In my experience, these decisions are seldom based in ideology or malice, but are mostly rooted in happenstance and bureaucratic inertia.\nAlso, I should correct a previous statement. John Scalzi did not denigrate “self-publishers” when he went on his anti-Random House rampage in his swan song as SFWA president. He explicitly denigrated independent publishers operating on the no-advances model.\nSo why are so many eBook-only publishers attempting to run with the “no advances” business model? If I had to guess, I would say because many of these then-erstwhile publishers assumed that publishing electronically had a low financial threshold of entry (not true, if you’re serious about it) and they fancied being publishers, so they started their businesses undercapitalized, and are now currently in the process of passing the consequences of that undercapitalization unto the authors they would like to work with. Alternately, as appears to be the case with Random House, they’re looking for a way to pass as much of the initial cost of publishing onto the author as possible, and one of the best ways to bring down those initial costs is to avoid paying the author anything up front. Both of these are bad business models, although one is more maliciously so, and both are to be avoided. Just because someone has stupidly or maliciously planned their business, doesn’t mean you’re obliged to sign a contract with them.\nThere is nothing stupid or malicious about a shared risk/shared reward model. Only a rabbit who is afraid of risk could possibly suggest that there is. I leave it to the reader to compare the royalty terms of the traditional publishers shown above to the 25 to 65 percent royalties on revenues received offered by independent publishers utilizing the “no advances” shared-risk model, and to decide whose business model is disadvantageous to the author and which sort of contracts are therefore best avoided.\n(1) With the Big Five these are now a standard 25 percent.\n(2) I have a copy of the contract with the boilerplate struck out. They actually tried to grab 100 percent of the net proceeds from British Commonwealth rights, foreign language translation rights, motion picture and television rights, and commercial merchandising rights.",
  "tags": [
    "McRapey",
    "writing"
  ],
  "categories": [],
  "sitemap_lastmod": "2014-02-15T12:00:00+00:00"
}