{
  "url": "https://voxday.net/2014/02/12/of-amazon-and-author-earnings/",
  "scraped_at": "2025-12-15T16:46:10.165198",
  "title": "Of Amazon and author earnings",
  "date_display": "February 12, 2014",
  "date_iso": "2014-02-12T11:04:00+00:00",
  "date_from_url": "2014-02-12",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>You may recall that last year, I pointed out that John Scalzi was not only doing authors a serious disservice by denigrating self-publishing, attacking publishers who mitigate their risk by not paying advances, and <a href=\"http://www.milobookclub.com/2013/03/11/how-not-to-be-sfwa-president-ii/\">throwing a public hissy fit over Random House moving into the 21st Century</a> with its Hydra imprint, he was actually doing himself a disservice by throwing away more than half his revenues for the privilege of being able to say he is approved by the gatekeepers at Tor. Scalzi, of course, pretended that I had no idea what I was talking about, because he is a special snowflake who has a totally unique publishing contract that bears no similarity to any other publishing deal in the industry or something like that.</p><p>After all, who are you going to trust on such matters, the economics writer who correctly predicted both the bull market in gold and the 2008 financial crisis or the Bernie Madoff of science fiction with his “50,000 DAILY READERS”?</p><p>I mention this because Hugh Howey, the massively successful SF self-publisher, just released <a href=\"http://authorearnings.com/the-report/\">a fascinating report on the current economics of publishing</a> and what he learned pretty much confirmed everything that I’ve been saying on the subject for the last two years. It also very clearly demonstrates that the current and past leadership of the SFWA consist of individuals who did not, and who do not, understand the electronic train coming down the tracks that is already in the process of crushing the traditional publishers.</p><blockquote class=\"tr_bq\"><p> Here is what our data guru found when he used sales per ranking data and applied it to the top 7,000 bestselling genre works on Amazon today: Looks good for the Big Five, doesn’t it? When it comes to gross dollar sales, they take half the pie. Remember, they only account for a little over a quarter of the unit sales. Also keep in mind that they only have to pay 25% of net revenue to the author. By contrast, self-published authors on Amazon’s platform keep 70% of the total purchase price.</p><p><a href=\"http://authorearnings.com/wp-content/uploads/2014/02/The_Data_-_A_Look_at_Author_Earnings_pages4.png\" imageanchor=\"1\" style=\"clear: left; float: left; margin-bottom: 1em; margin-right: 1em;\"><img border=\"0\" decoding=\"async\" fetchpriority=\"high\" height=\"221\" src=\"http://authorearnings.com/wp-content/uploads/2014/02/The_Data_-_A_Look_at_Author_Earnings_pages4.png\" width=\"320\"/></a> Let’s now look at revenue from the author’s perspective: It’s a complete inversion. Indie authors are earning nearly half the total author revenue from genre fiction sales on Amazon. Nearly half. This next chart reveals why: Blue represents the author. You can clearly see that for Big-Five published works, the publisher makes more than twice what the author makes for the sale of an e-book. Keep in mind that the profit margins for publishers are better on e-books than they are on hardbacks. That means the author gets a smaller cut while the publisher takes a larger share. This, despite the fact that e-books do not require printing, warehousing, or shipping. As a result, self-published authors as a group are making 50% more profit than their traditionally published counterparts, even though their books have only half the gross sales revenue.</p></blockquote><p>But here is the money bit:</p><blockquote class=\"tr_bq\"><p> You may have heard from other reports that e-books account for roughly 25% of overall book sales. But this figure is based only on sales reported by major publishers. E-book distributors like Amazon, Barnes &amp; Noble, Kobo, the iBookstore, and Google Play don’t reveal their sales data. That means that self-published e-books are not counted in that 25%. Neither are small presses, e-only presses, or Amazon’s publishing imprints. This would be like the Cookie Council seeking a report on global cookie sales and polling a handful of Girl Scout troops for the answer—then announcing that 25% of worldwide cookie sales are Thin Mints. But this is wrong. They’re just looking at Girl Scout cookies, and even then only a handful of troops.</p></blockquote><p>In other words, any statistics you read concerning the publishing industry are even less credible than the fiction produced by the Bureau of Economic Analysis. That being said, I believe Howey is right. I believe “the world of literature has its brightest days still ahead” and part of that is going to be the result of the destruction of the gatekeepers who have been methodically destroying science fiction and fantasy for the last 30 years. The gatekeepers cannot sustain their inflated prices, they cannot foist their favored authors on unsuspecting readers, and they can no longer pretend their books sell any better or are of any higher quality than those being produced by the myriad of other active publishers for much longer.</p><div class=\"separator\" style=\"clear: both; text-align: center;\"> <a href=\"http://authorearnings.com/wp-content/uploads/2014/02/The_Data_-_A_Look_at_Author_Earnings_pages1.png\" imageanchor=\"1\" style=\"clear: left; float: left; margin-bottom: 1em; margin-right: 1em;\"><noscript><img border=\"0\" decoding=\"async\" height=\"273\" src=\"http://authorearnings.com/wp-content/uploads/2014/02/The_Data_-_A_Look_at_Author_Earnings_pages1.png\" width=\"320\"/></noscript><img border=\"0\" class=\"lazyload\" data-src=\"http://authorearnings.com/wp-content/uploads/2014/02/The_Data_-_A_Look_at_Author_Earnings_pages1.png\" decoding=\"async\" height=\"273\" src=\"data:image/svg+xml,%3Csvg%20xmlns=%22http://www.w3.org/2000/svg%22%20viewBox=%220%200%20320%20273%22%3E%3C/svg%3E\" width=\"320\"/></a></div><p> <i>“It turns out that 86% of the top 2,500 genre fiction bestsellers in the<br> overall Amazon store are e-books. At the top of the charts, the<br> dominance of e-books is even more extreme. 92% of the Top-100<br> best-selling books in these genres are e-books!”</br></br></br></i></p><p>This doesn’t surprise me in the slightest. In 13 months, ebooks have comprised 94 percent of the sales of <i>A Throne of Bones</i>. And keep in mind that Howey’s statistics probably don’t include the distribution of free ebooks. My free/sold ratio is 5/1. This is why Castalia House is only producing print books in hardcover for the hard-core fans who enjoy collecting as well as reading; if it’s not electronic, it’s no longer really relevant.</p><p>I should mention that another serious problem for the traditional publishers I predicted during my campaign for SFWA president has already surfaced, and it has done so even sooner than I said it would. Dreamworks Interactive recently announced that it will no longer be licensing the publishing rights to its works, but will publish its own ebooks. This means that the very lucrative media tie-in model that is keeping many of the larger genre publishers afloat is about to disappear. That means no more paying sizable advances to award-winning authors of terrible romances in space on the basis of Halo tie-in sales. It will be interesting to see which of the major genre publishers goes down first.</p></div>",
  "content_text": "You may recall that last year, I pointed out that John Scalzi was not only doing authors a serious disservice by denigrating self-publishing, attacking publishers who mitigate their risk by not paying advances, and\nthrowing a public hissy fit over Random House moving into the 21st Century\nwith its Hydra imprint, he was actually doing himself a disservice by throwing away more than half his revenues for the privilege of being able to say he is approved by the gatekeepers at Tor. Scalzi, of course, pretended that I had no idea what I was talking about, because he is a special snowflake who has a totally unique publishing contract that bears no similarity to any other publishing deal in the industry or something like that.\nAfter all, who are you going to trust on such matters, the economics writer who correctly predicted both the bull market in gold and the 2008 financial crisis or the Bernie Madoff of science fiction with his “50,000 DAILY READERS”?\nI mention this because Hugh Howey, the massively successful SF self-publisher, just released\na fascinating report on the current economics of publishing\nand what he learned pretty much confirmed everything that I’ve been saying on the subject for the last two years. It also very clearly demonstrates that the current and past leadership of the SFWA consist of individuals who did not, and who do not, understand the electronic train coming down the tracks that is already in the process of crushing the traditional publishers.\nHere is what our data guru found when he used sales per ranking data and applied it to the top 7,000 bestselling genre works on Amazon today: Looks good for the Big Five, doesn’t it? When it comes to gross dollar sales, they take half the pie. Remember, they only account for a little over a quarter of the unit sales. Also keep in mind that they only have to pay 25% of net revenue to the author. By contrast, self-published authors on Amazon’s platform keep 70% of the total purchase price.\nLet’s now look at revenue from the author’s perspective: It’s a complete inversion. Indie authors are earning nearly half the total author revenue from genre fiction sales on Amazon. Nearly half. This next chart reveals why: Blue represents the author. You can clearly see that for Big-Five published works, the publisher makes more than twice what the author makes for the sale of an e-book. Keep in mind that the profit margins for publishers are better on e-books than they are on hardbacks. That means the author gets a smaller cut while the publisher takes a larger share. This, despite the fact that e-books do not require printing, warehousing, or shipping. As a result, self-published authors as a group are making 50% more profit than their traditionally published counterparts, even though their books have only half the gross sales revenue.\nBut here is the money bit:\nYou may have heard from other reports that e-books account for roughly 25% of overall book sales. But this figure is based only on sales reported by major publishers. E-book distributors like Amazon, Barnes & Noble, Kobo, the iBookstore, and Google Play don’t reveal their sales data. That means that self-published e-books are not counted in that 25%. Neither are small presses, e-only presses, or Amazon’s publishing imprints. This would be like the Cookie Council seeking a report on global cookie sales and polling a handful of Girl Scout troops for the answer—then announcing that 25% of worldwide cookie sales are Thin Mints. But this is wrong. They’re just looking at Girl Scout cookies, and even then only a handful of troops.\nIn other words, any statistics you read concerning the publishing industry are even less credible than the fiction produced by the Bureau of Economic Analysis. That being said, I believe Howey is right. I believe “the world of literature has its brightest days still ahead” and part of that is going to be the result of the destruction of the gatekeepers who have been methodically destroying science fiction and fantasy for the last 30 years. The gatekeepers cannot sustain their inflated prices, they cannot foist their favored authors on unsuspecting readers, and they can no longer pretend their books sell any better or are of any higher quality than those being produced by the myriad of other active publishers for much longer.\n“It turns out that 86% of the top 2,500 genre fiction bestsellers in the\noverall Amazon store are e-books. At the top of the charts, the\ndominance of e-books is even more extreme. 92% of the Top-100\nbest-selling books in these genres are e-books!”\nThis doesn’t surprise me in the slightest. In 13 months, ebooks have comprised 94 percent of the sales of\nA Throne of Bones\n. And keep in mind that Howey’s statistics probably don’t include the distribution of free ebooks. My free/sold ratio is 5/1. This is why Castalia House is only producing print books in hardcover for the hard-core fans who enjoy collecting as well as reading; if it’s not electronic, it’s no longer really relevant.\nI should mention that another serious problem for the traditional publishers I predicted during my campaign for SFWA president has already surfaced, and it has done so even sooner than I said it would. Dreamworks Interactive recently announced that it will no longer be licensing the publishing rights to its works, but will publish its own ebooks. This means that the very lucrative media tie-in model that is keeping many of the larger genre publishers afloat is about to disappear. That means no more paying sizable advances to award-winning authors of terrible romances in space on the basis of Halo tie-in sales. It will be interesting to see which of the major genre publishers goes down first.",
  "tags": [
    "books",
    "McRapey"
  ],
  "categories": [],
  "sitemap_lastmod": "2014-02-12T11:04:00+00:00"
}