{
  "url": "https://voxday.net/2014/02/17/of-petitions-and-pettiness/",
  "scraped_at": "2025-12-15T16:46:43.855219",
  "title": "Of petitions and pettiness",
  "date_display": "February 17, 2014",
  "date_iso": "2014-02-17T18:00:00+00:00",
  "date_from_url": "2014-02-17",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>Apparently I was correct to anticipate that my signature would be removed from Dave Truesdale’s SFWA petition:</p><blockquote class=\"tr_bq\"><p> “If Truesdale, a non-member, can present such a petition, Beale, a non-member, should be able to sign it. Removing someone’s name from a petition because one thinks they are an asshat is prima facie evidence that one is, onceself, an asshat. Maybe SFWA can chip in and buy an “UNCLEAN” sign for Beale to wear around his neck? SFWA’s not the fucking Pope.”</p></blockquote><p>This SFF Net discussion reminded me that I had an account there, not that I’ve used it since my presidential campaign. Or… perhaps not After reading that comment, it struck me that it would be completely<br> characteristic for the SFWA to ensure that my account at SFF Net was<br> deleted. I went there, and typed in the user name and password. Sure enough:</br></br></p><p><i>Sorry! We can’t find a user called tbeale. Please try again or write to Tech Support for assistance. </i></p><p>That made me laugh out loud<i>. </i>The comedy continues. But the sheer pettiness of the act makes it something useful to keep in mind for when you find yourself facing one of the nasty little rabbits caught in a trap and begging for mercy. Show them the same mercy they showed others. Cut them the same slack they offered others.</p><p>There is no need to hate them, just crush them under your heel and go on with life. One cannot forgive those who do not repent.</p></div>",
  "content_text": "Apparently I was correct to anticipate that my signature would be removed from Dave Truesdale’s SFWA petition:\n“If Truesdale, a non-member, can present such a petition, Beale, a non-member, should be able to sign it. Removing someone’s name from a petition because one thinks they are an asshat is prima facie evidence that one is, onceself, an asshat. Maybe SFWA can chip in and buy an “UNCLEAN” sign for Beale to wear around his neck? SFWA’s not the fucking Pope.”\nThis SFF Net discussion reminded me that I had an account there, not that I’ve used it since my presidential campaign. Or… perhaps not After reading that comment, it struck me that it would be completely\ncharacteristic for the SFWA to ensure that my account at SFF Net was\ndeleted. I went there, and typed in the user name and password. Sure enough:\nSorry! We can’t find a user called tbeale. Please try again or write to Tech Support for assistance.\nThat made me laugh out loud\n.\nThe comedy continues. But the sheer pettiness of the act makes it something useful to keep in mind for when you find yourself facing one of the nasty little rabbits caught in a trap and begging for mercy. Show them the same mercy they showed others. Cut them the same slack they offered others.\nThere is no need to hate them, just crush them under your heel and go on with life. One cannot forgive those who do not repent.",
  "tags": [
    "SFWA"
  ],
  "categories": [],
  "sitemap_lastmod": "2014-02-17T18:00:00+00:00"
}