{
  "url": "https://voxday.net/2014/02/22/publishers-weekly-on-indie-revo/",
  "scraped_at": "2025-12-15T16:47:13.174058",
  "title": "Publisher’s Weekly on the indie revolt",
  "date_display": "February 22, 2014",
  "date_iso": "2014-02-22T18:39:00+00:00",
  "date_from_url": "2014-02-22",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p><a href=\"http://www.publishersweekly.com/pw/by-topic/digital/content-and-e-books/article/61116-hugh-howey-and-the-indie-author-revolt.html\">It’s not looking good</a> for the traditional publishing industry:</p><blockquote class=\"tr_bq\"><p> For decades, aspiring authors were taught to bow before the altar of Big Publishing. Writers were taught that publishers alone possessed the wisdom to determine if a writer deserved passage through the pearly gates of author heaven. Writers were taught that publishers had an inalienable right to this power, and that this power was for the common good of readers. They were taught rejection made them stronger. They were taught that without a publisher’s blessing, they were a failed writer.</p><p>And it was true. Without a publisher, the writer was doomed to failure, because without a publisher the writer couldn’t reach readers. Six years ago publishers controlled the three essential legs of the professional publishing stool: the printing press, the access to retail distribution, and the knowledge of professional publishing best practices. It was a print-centric world where e-books were but an inconsequential glimmer in the eyes of a few delusional hippies, me included. A writer could self-publish in print, but without retail distribution these writers were destined to fill their garages with unsold printed books, all the while lining the pockets of vanity presses who exploited their dreams of authorship….</p><p>Today, the myth of traditional publishing is unraveling. The stigma of traditional publishing is on the rise.</p><p>The author community is growing increasingly disenchanted by Big Publishing’s hard line on 25% net e-book royalties, high e-book prices, slow payouts, and insistence on DRM copy protection. The recent news of major publishers touting record e-book-powered earnings only adds insult to authors’ perceived injury.</p><p>Authors are also disappointed by Big Publishing’s misguided foray into vanity publishing with Pearson/Penguin’s 2012 acquisition of Author Solutions, a company known for selling over-priced publishing packages to unsuspecting writers. Multiple publishers have formed sock puppet imprints powered by ASI: Simon &amp; Schuster’s Archway, Penguin Random House’s Partridge Publishing in India, HarperCollins’ Westbow, Hay House’s Balboa Press, Writer’s Digests’ Abbott Press, and Harlequin’s Dellarte Press. These deals with the devil confirmed the worst fears held by indie authors who already questioned if publishers viewed writers as partners or as chattel.</p></blockquote><p>Now, one could try to dismiss this because it is written by Mark Coker, who is betting big time on the indie publishing revolution with Smashwords. (Full disclosure, five of my books are available there.) But aside from the fact that he is in an ideal position to see what is taking place and sharp enough to have anticipated events, the significant fact is that Publisher’s Weekly obviously sees the writing on the wall.</p><p>The publication of this piece indicates that they have no intention of going down with the traditional publishing ship. Now, there is still a need for publishers; having been through all the headaches of getting set up for distribution, finding the right people with whom to work, and so forth, I would estimate that at least two-thirds of the traditionally published will have zero desire to become self-publishers if they can get a fair deal from independent publishers.</p><p>But publishers can’t continue to grab up to 93 percent of the revenue any longer. Publishers can’t live on the fat overhead they have traditionally demanded at the expense of the writers who were never presented with the choice between much smaller advances and significantly larger royalties. As Coker writes: “The solution is for publishers to realize that they are service providers to authors.”</p><p>That’s exactly what we’re doing at CH. We provide editing, superior covers, multiple foreign language editions within weeks of first publication, a boosted signal, reasonable rights-reversion terms, and the author receives an equal share of the royalties<i> at worst</i>. We know what authors want and need because we share their concerns and our business model is built on partnering with them, not systematically exploiting them.</p></div>",
  "content_text": "It’s not looking good\nfor the traditional publishing industry:\nFor decades, aspiring authors were taught to bow before the altar of Big Publishing. Writers were taught that publishers alone possessed the wisdom to determine if a writer deserved passage through the pearly gates of author heaven. Writers were taught that publishers had an inalienable right to this power, and that this power was for the common good of readers. They were taught rejection made them stronger. They were taught that without a publisher’s blessing, they were a failed writer.\nAnd it was true. Without a publisher, the writer was doomed to failure, because without a publisher the writer couldn’t reach readers. Six years ago publishers controlled the three essential legs of the professional publishing stool: the printing press, the access to retail distribution, and the knowledge of professional publishing best practices. It was a print-centric world where e-books were but an inconsequential glimmer in the eyes of a few delusional hippies, me included. A writer could self-publish in print, but without retail distribution these writers were destined to fill their garages with unsold printed books, all the while lining the pockets of vanity presses who exploited their dreams of authorship….\nToday, the myth of traditional publishing is unraveling. The stigma of traditional publishing is on the rise.\nThe author community is growing increasingly disenchanted by Big Publishing’s hard line on 25% net e-book royalties, high e-book prices, slow payouts, and insistence on DRM copy protection. The recent news of major publishers touting record e-book-powered earnings only adds insult to authors’ perceived injury.\nAuthors are also disappointed by Big Publishing’s misguided foray into vanity publishing with Pearson/Penguin’s 2012 acquisition of Author Solutions, a company known for selling over-priced publishing packages to unsuspecting writers. Multiple publishers have formed sock puppet imprints powered by ASI: Simon & Schuster’s Archway, Penguin Random House’s Partridge Publishing in India, HarperCollins’ Westbow, Hay House’s Balboa Press, Writer’s Digests’ Abbott Press, and Harlequin’s Dellarte Press. These deals with the devil confirmed the worst fears held by indie authors who already questioned if publishers viewed writers as partners or as chattel.\nNow, one could try to dismiss this because it is written by Mark Coker, who is betting big time on the indie publishing revolution with Smashwords. (Full disclosure, five of my books are available there.) But aside from the fact that he is in an ideal position to see what is taking place and sharp enough to have anticipated events, the significant fact is that Publisher’s Weekly obviously sees the writing on the wall.\nThe publication of this piece indicates that they have no intention of going down with the traditional publishing ship. Now, there is still a need for publishers; having been through all the headaches of getting set up for distribution, finding the right people with whom to work, and so forth, I would estimate that at least two-thirds of the traditionally published will have zero desire to become self-publishers if they can get a fair deal from independent publishers.\nBut publishers can’t continue to grab up to 93 percent of the revenue any longer. Publishers can’t live on the fat overhead they have traditionally demanded at the expense of the writers who were never presented with the choice between much smaller advances and significantly larger royalties. As Coker writes: “The solution is for publishers to realize that they are service providers to authors.”\nThat’s exactly what we’re doing at CH. We provide editing, superior covers, multiple foreign language editions within weeks of first publication, a boosted signal, reasonable rights-reversion terms, and the author receives an equal share of the royalties\nat worst\n. We know what authors want and need because we share their concerns and our business model is built on partnering with them, not systematically exploiting them.",
  "tags": [
    "Castalia House",
    "writing"
  ],
  "categories": [],
  "sitemap_lastmod": "2014-02-22T18:39:00+00:00"
}