{
  "url": "https://voxday.net/2014/02/24/quantum-mortis-programmed-mind/",
  "scraped_at": "2025-12-15T16:47:23.119760",
  "title": "QUANTUM MORTIS The Programmed Mind",
  "date_display": "February 24, 2014",
  "date_iso": "2014-02-24T18:00:00+00:00",
  "date_from_url": "2014-02-24",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><div class=\"separator\" style=\"clear: both; text-align: center;\"> <a href=\"http://www.amazon.com/dp/B00ILU0RC2\" imageanchor=\"1\" style=\"clear: left; float: left; margin-bottom: 1em; margin-right: 1em;\"><noscript><img border=\"0\" decoding=\"async\" src=\"http://www.milobookclub.com/wp-content/uploads/2014/02/QM_TPM_256.jpg\"/></noscript><img border=\"0\" class=\"lazyload\" data-src=\"http://www.milobookclub.com/wp-content/uploads/2014/02/QM_TPM_256.jpg\" decoding=\"async\" src=\"data:image/svg+xml,%3Csvg%20xmlns=%22http://www.w3.org/2000/svg%22%20viewBox=%220%200%20210%20140%22%3E%3C/svg%3E\"/></a></div><p>In addition to <i>Big Boys Don’t Cry</i> Castalia House also announced today <a href=\"http://www.amazon.com/dp/B00ILU0RC2\"><i><b>QUANTUM MORTIS The Programmed Mind</b></i></a>.  The book is set centuries before Chief Warrant Officer Graven Tower joined MCID-XAR, in a time when the<br> Greater Terran Ascendancy found itself facing a historic crisis after the<br> Shiva-class cruiser ATSV <i>Rigel </i>went missing during a routine patrol<br> through the Kantillon sector. Fortunately for the<br> Terran empire, the Ascendancy Intelligence Directorate’s top operative,<br> Daniela York, is on the scene. But is she capable of penetrating the<br> lethal plot perpetratd by House Dai Zhan’s ruthless assassins,<br> especially after the Directorate discovers the cyborgs of the<br> Man-Machine Integration may be involved? <br> <i>QUANTUM MORTIS The Programmed Mind</i> is a literary remix of a<br> true SF classic and is a tightly plotted, intense spy<br> thriller that lays the deep historical foundation for the futuristic<br> science fiction world of Quantum Mortis.</br></br></br></br></br></br></br></br></br></br></br></br></p><p>I asked a serious fan of the original work upon which QM-TPM is based, <i>The Programmed Man</i> by Jean and Jeff Sutton, to share his thoughts on whether he felt the book lived up to the original, which was a childhood favorite of mine. After reading it, he replied:</p><p>“The trouble with “reboots” isn’t that they <i>shouldn’t</i> be done. I’m not terribly sure they<i> can</i><br> be done. After all, Tolkien could not return to Middle Earth after <i>Lord<br> of the Rings</br></i>. Asimov tried to return to extend his colossal Foundation,<br> and failed galactically. I can list a score of other examples, and if<br> the original author is incapable, it seems evident that earnest<br> successors fare no better. <i>Dune </i>was not improved by re-visits by later<br> authors, nor was the Hyborian Age, and few Lovecraft pastiches come<br> anywhere close to the originals.</br></br></br></br></br></br></p><p>“That general observation is precisely why you’ll never catch me describing <i>Quantum Mortis: The Programmed Mind</i> with the epithet “reboot.”</p><p><i>“The Programmed Man</i> is among the more memorable science<br> fiction novels of the New Wave that you have never<br> heard of. Despite its distribution though young adult book clubs following publication, it was poorly suited<br> for longevity in the minds of young readers due to its complexity of plot and<br> its emphasis on intrigue rather than action. The plot is a<br> galaxy-spanning game of enigmas and deception in the hunt for a lone<br> individual who may, (or may not), hold the fate of the decline of<br> humankind in his genes. An extra twist is added to the narrative<br> in that much of the truth to the labyrinthine plot is concealed in the<br> words of vested and unreliable witnesses. The book is a lot of things: a<br> spy novel, a mystery, a nuclear war novel, and a foray into game<br> theory.</br></br></br></br></br></br></br></br></br></br></br></p><p>“In<i> The Programmed Man</i>, the core cloak-and-dagger game<br> structure is analyzed intellectually, and teased out in tantalizing<br> packets of conversation. The novel’s new successor, <i>Quantum Mortis: The Programmed Mind</i>,<br> is an explosive action novel that uses the core game structure as the<br> tinderbox for galactic conflict. It raises the body count and explores<br> new territory: sexual differences and artificial intelligence, as well as human<br> origin, awareness and identity. It also just happens to lay some<br> fascinating and significant historic turning points set within Day’s<br> Quantum Mortis universe. If <i>The Programmed Man</i> reads like the secret dossier transcripts of the historic event, then<i> Quantum Mortis: The Programmed Mind</i> is the pulse-pounding eyewitness experience.</br></br></br></br></br></br></br></br></p><p>“Whereas<br> the typical marriage of public domain works and modern authorship seem<br> most often to result in those “Jane Austen plus Monsters” semi-parodies, <i>Quantum Mortis: The Programmed Mind</i> breaks new<br> ground, presenting itself instead as a sizzling collaboration between<br> two powerful science fiction voices of two different eras.”</br></br></br></br></p><p><b>From the early reviews:</b></p><p>” Think <i>Hunt For Red October</i> if it was told from Admiral Greer’s perspective instead of Jack Ryan’s.”</p><p> “A great addition to the Quantum Mortis series, highly recommended.”</p><p>“Tight story telling.  Interesting well thought-out characters… and a fascinating futuristic spy plot.”</p></div>",
  "content_text": "In addition to\nBig Boys Don’t Cry\nCastalia House also announced today\nQUANTUM MORTIS The Programmed Mind\n.  The book is set centuries before Chief Warrant Officer Graven Tower joined MCID-XAR, in a time when the\nGreater Terran Ascendancy found itself facing a historic crisis after the\nShiva-class cruiser ATSV\nRigel\nwent missing during a routine patrol\nthrough the Kantillon sector. Fortunately for the\nTerran empire, the Ascendancy Intelligence Directorate’s top operative,\nDaniela York, is on the scene. But is she capable of penetrating the\nlethal plot perpetratd by House Dai Zhan’s ruthless assassins,\nespecially after the Directorate discovers the cyborgs of the\nMan-Machine Integration may be involved?\nQUANTUM MORTIS The Programmed Mind\nis a literary remix of a\ntrue SF classic and is a tightly plotted, intense spy\nthriller that lays the deep historical foundation for the futuristic\nscience fiction world of Quantum Mortis.\nI asked a serious fan of the original work upon which QM-TPM is based,\nThe Programmed Man\nby Jean and Jeff Sutton, to share his thoughts on whether he felt the book lived up to the original, which was a childhood favorite of mine. After reading it, he replied:\n“The trouble with “reboots” isn’t that they\nshouldn’t\nbe done. I’m not terribly sure they\ncan\nbe done. After all, Tolkien could not return to Middle Earth after\nLord\nof the Rings\n. Asimov tried to return to extend his colossal Foundation,\nand failed galactically. I can list a score of other examples, and if\nthe original author is incapable, it seems evident that earnest\nsuccessors fare no better.\nDune\nwas not improved by re-visits by later\nauthors, nor was the Hyborian Age, and few Lovecraft pastiches come\nanywhere close to the originals.\n“That general observation is precisely why you’ll never catch me describing\nQuantum Mortis: The Programmed Mind\nwith the epithet “reboot.”\n“The Programmed Man\nis among the more memorable science\nfiction novels of the New Wave that you have never\nheard of. Despite its distribution though young adult book clubs following publication, it was poorly suited\nfor longevity in the minds of young readers due to its complexity of plot and\nits emphasis on intrigue rather than action. The plot is a\ngalaxy-spanning game of enigmas and deception in the hunt for a lone\nindividual who may, (or may not), hold the fate of the decline of\nhumankind in his genes. An extra twist is added to the narrative\nin that much of the truth to the labyrinthine plot is concealed in the\nwords of vested and unreliable witnesses. The book is a lot of things: a\nspy novel, a mystery, a nuclear war novel, and a foray into game\ntheory.\n“In\nThe Programmed Man\n, the core cloak-and-dagger game\nstructure is analyzed intellectually, and teased out in tantalizing\npackets of conversation. The novel’s new successor,\nQuantum Mortis: The Programmed Mind\n,\nis an explosive action novel that uses the core game structure as the\ntinderbox for galactic conflict. It raises the body count and explores\nnew territory: sexual differences and artificial intelligence, as well as human\norigin, awareness and identity. It also just happens to lay some\nfascinating and significant historic turning points set within Day’s\nQuantum Mortis universe. If\nThe Programmed Man\nreads like the secret dossier transcripts of the historic event, then\nQuantum Mortis: The Programmed Mind\nis the pulse-pounding eyewitness experience.\n“Whereas\nthe typical marriage of public domain works and modern authorship seem\nmost often to result in those “Jane Austen plus Monsters” semi-parodies,\nQuantum Mortis: The Programmed Mind\nbreaks new\nground, presenting itself instead as a sizzling collaboration between\ntwo powerful science fiction voices of two different eras.”\nFrom the early reviews:\n” Think\nHunt For Red October\nif it was told from Admiral Greer’s perspective instead of Jack Ryan’s.”\n“A great addition to the Quantum Mortis series, highly recommended.”\n“Tight story telling.  Interesting well thought-out characters… and a fascinating futuristic spy plot.”",
  "tags": [
    "Castalia House",
    "Quantum Mortis"
  ],
  "categories": [],
  "sitemap_lastmod": "2014-02-24T18:00:00+00:00"
}