{
  "url": "https://voxday.net/2014/02/27/raising-steam-and-devolution-of/",
  "scraped_at": "2025-12-15T16:47:41.467220",
  "title": "Raising Steam and the devolution of Pratchett",
  "date_display": "February 27, 2014",
  "date_iso": "2014-02-27T18:15:00+00:00",
  "date_from_url": "2014-02-27",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>At his best, Terry Pratchett was much better than he was ever given credit for. His characters were deeply human, his social commentary could border on the brilliant, and if the humor occasionally fell flat at times, well, that was forgivable. That being said, for the sake of his own reputation, he probably should have ended the Discworld series with <i>Making Money</i>.</p><p><i>Raising Steam</i>, the 40th in the Discworld series, isn’t just a predictable spin on the same “new technology comes to Ankh-Morpork” that Pratchett has been increasingly relying upon since <i>Pyramids</i>, it’s Message Fiction. Even worse, it’s Multicultural Message Fiction, which reveals an author woefully out of touch with the nationalist zeitgeist now sweeping Europe.</p><p>It’s all very NuLabor and Kumbaya and Surely We Can All Be Friends, which looks hopelessly outdated in George Zimmerman’s America, Lee Rigby’s Britain, and Vladimir Putin’s Russia. And the speechifying, O sweet Rincewind, the speechifying!</p><blockquote class=\"tr_bq\"><p> His voice low, Rhys spoke. ‘For what purpose am I King? I will tell you. In a world where we formally recognize trolls, humans and, these days, all manner of species, even goblins, unreconstructed elements of dwarfdom persist in their campaign to keep the grags auditing all that is dwarfish.’<br> He looked sternly at Ardent as he continued, ‘Dwarfs from every area where dwarfs live in sufficient numbers have tried to modernize, but to no avail apart from those in Ankh-Morpork, and the shame of it is that often those determined to keep dwarfkind in the darkness have somehow inculcated their flocks into believing that change of any sort is a blasphemy, no specific blasphemy, just a blasphemy all by itself, spinning through the cosmos as sour as an ocean of vinegar. This cannot be!’<br> His voice rose and his fist crashed down on the table. ‘I am here to tell you, my friends and, indeed, my smiling enemies, that if we do not band together against the forces that wish to keep us in darkness dwarfkind will be diminished. We need to work together, talk to one another, deal properly with one another and not spend all our time in one enormous grump that the world isn’t entirely ours any more and, at the finish, ruin it for everyone. After all, who would deal with such as us in a world of new choices? In truth, we should act as sapient creatures should! If we don’t move with the future, the future will twist and roll right over us.’<br> Rhys paused to accommodate the inevitable outburst of Shame! and Not so! and all the other detritus of rotted debate, and then spoke again. ‘Yes, I recognize you, Albrecht Albrechtson. The floor is yours.’<br> The elderly dwarf, who had once been favourite to win the last election for Low King, said courteously, ‘Your majesty, you know I have no particular liking for the way that the world is going, nor some of your more modern ideas, but I have been shocked to discover that some of the more headstrong grags are still orchestrating attacks on the clacks system.’<br> The King said, ‘Are they mad?! We made it clear to this council and all dwarfs, after the message we received from Ankh-Morpork about their clacks being attacked, that this stupidity must cease at once. It’s even worse than the Nugganites, who were, to be sensible about this, totally and absolutely bloody insane.’<br> Albrecht coughed and said, ‘Your majesty, in this instance I find myself standing shoulder to shoulder with you. I am appalled to see things go this far. What are we but creatures of communication and communication accurately communicated is a benison to be cherished by all species everywhere. I never thought I would say this, but the news I am hearing lately, and am expected to delight in, makes me ashamed to call myself a dwarf. We have our differences and it’s right and proper that we should have them, and discourse and compromise are cornerstones in the proper world of politics, but here and now, your majesty, you have my full and unequivocal support. And as for those who stand in our way, I call down a murrain on them. I say, a murrain!’<br> There are uproars and there are uproars and this uproar stayed up for a very long time.<br> Eventually Albrecht Albrechtson brought his axe down on to the table, splitting the wood from top to bottom, bringing terrified silence across the gathered dwarfs, and said, ‘I support my King. That is what a King is for. A murrain, I said. A murrain. And a Ginnungagap for those that say different.’</br></br></br></br></br></br></br></br></p></blockquote><p>Then, three pages later, Lord Vetinari contemplates those irritating little unthinking people who stand in the way of Progress.</p><blockquote class=\"tr_bq\"><p> Curious, the Patrician thought, as Drumknott hurried away to dispatch a clacks to the editor of the Times, that people in Ankh-Morpork professed not to like change while at the same time fixating on every new entertainment and diversion that came their way. There was nothing the mob liked better than novelty. Lord Vetinari sighed again. Did they actually think? These days everybody used the clacks, even little old ladies who used it to send him clacks messages complaining about all these new-fangled ideas, totally missing the irony….<br> There was nothing for it but to follow the wave. New things, new ideas arrived and strutted their stuff and were vilified by some and then lo! that which had been a monster was suddenly totally important to the world. All the time the fanglers and artificers were coming up with even more useful things that hadn’t been foreseen and suddenly became essential. And the pillars of the world remained unshaken.</br></p></blockquote><p>Pratchett completely fails to see the irony in his presentation of a King and a Dictator as the voices of Inevitable Progress. This scene gives way, on literally the next page, to a dwarf waxing eloquent on how wonderful it is that dwarves and trolls are friends now, and twenty pages later, is followed by a FOURTH repetition of THE SAME VERY IMPORTANT MESSAGE.</p><blockquote class=\"tr_bq\"><p> Bleddyn had cooked a good rat supper and was upset when she saw his face and said, ‘Those damn grags again! Why don’t you tell them to put their nonsense where the light shines too much!’fn26<br> Bleddyn didn’t usually swear, so that surprised him, and she continued, ‘They had a point once. They said that we were being swallowed up by the humans and the trolls, and you know it’s true, except that it’s the wrong kind of truth. The kids’ve got human friends and one or two trolls as well and nobody notices, nobody thinks about it. Everyone is just people.’<br> He looked at her face and said, ‘But we’re diminished, less important!’<br> But Bleddyn was emphatic and said, ‘You silly old dwarf. Don’t you think the trolls consider themselves diminished too? People mingle and mingling is good! You’re a dwarf, with big dwarf hobnail boots and everything else it takes to be a dwarf. And remember, it wasn’t so long ago that dwarfs were very scarce outside of Uberwald. You must know your history? Nobody can take that away, and who knows, maybe some trolls are saying right now, “Oh dear, my little pebbles is being influenced by the dwarfs! It’s a sin!” The Turtle moves for everybody all the time, and those grags schism so often that they consider everyone is a schism out there on their own. Look it up. I’ve cooked you a lovely rat – nice and tender – so why not eat it up and get out into the sunshine? I know it isn’t dwarfish, but it’s good for getting your clothes dried.’<br> When he laughed she smiled and said, ‘All that’s wrong in the world is that it’s spilling over us as if we’re stones in a stream, and it’ll leave us eventually. Remember your old granddad telling you about going to fight the trolls in Koom Valley, yes? And then you told your son how you went back to Koom Valley and found out the whole damn business was a misunderstanding. And because of all this, our Brynmor won’t even have to fight unless someone is extremely stupid. Say no to the grags. Really, they’re bogeymen. I’ve spoken to all the women round here and they say exactly the same thing. </br></br></br></br></p></blockquote><p>It’s one tedious lecture after another and the sheer idiocy of the message is remarkable. The idea that war is based on misunderstanding, that people are all the same underneath, and that multiculturalism and multiethnic societies means our children won’t have to fight is not only wrong, it is downright backward. It is this very thinking that has guaranteed that the wars of the next generation will be more vicious, more bitter, and more terrible, on a larger scale, than anything Europe has seen since the Thirty Years War.</p><p>The nations did not come to exist in a vaccuum. Nations are born from two things, geographic isolation and the hellish cauldron of inter-group exile and extermination. Just as Hutus and Tutsis didn’t care that they were both called “Rwandans” when they murdered each other, no one is going to care that they are “British” or “French” or “American” when the debt-inflated pseudo-wealth is gone and the struggle for real resources begins.</p><p><i>Raising Steam</i> isn’t a capstone on a distinguished career, it is a badly written caricature that is a tombstone for a dying idea.</p></div>",
  "content_text": "At his best, Terry Pratchett was much better than he was ever given credit for. His characters were deeply human, his social commentary could border on the brilliant, and if the humor occasionally fell flat at times, well, that was forgivable. That being said, for the sake of his own reputation, he probably should have ended the Discworld series with\nMaking Money\n.\nRaising Steam\n, the 40th in the Discworld series, isn’t just a predictable spin on the same “new technology comes to Ankh-Morpork” that Pratchett has been increasingly relying upon since\nPyramids\n, it’s Message Fiction. Even worse, it’s Multicultural Message Fiction, which reveals an author woefully out of touch with the nationalist zeitgeist now sweeping Europe.\nIt’s all very NuLabor and Kumbaya and Surely We Can All Be Friends, which looks hopelessly outdated in George Zimmerman’s America, Lee Rigby’s Britain, and Vladimir Putin’s Russia. And the speechifying, O sweet Rincewind, the speechifying!\nHis voice low, Rhys spoke. ‘For what purpose am I King? I will tell you. In a world where we formally recognize trolls, humans and, these days, all manner of species, even goblins, unreconstructed elements of dwarfdom persist in their campaign to keep the grags auditing all that is dwarfish.’\nHe looked sternly at Ardent as he continued, ‘Dwarfs from every area where dwarfs live in sufficient numbers have tried to modernize, but to no avail apart from those in Ankh-Morpork, and the shame of it is that often those determined to keep dwarfkind in the darkness have somehow inculcated their flocks into believing that change of any sort is a blasphemy, no specific blasphemy, just a blasphemy all by itself, spinning through the cosmos as sour as an ocean of vinegar. This cannot be!’\nHis voice rose and his fist crashed down on the table. ‘I am here to tell you, my friends and, indeed, my smiling enemies, that if we do not band together against the forces that wish to keep us in darkness dwarfkind will be diminished. We need to work together, talk to one another, deal properly with one another and not spend all our time in one enormous grump that the world isn’t entirely ours any more and, at the finish, ruin it for everyone. After all, who would deal with such as us in a world of new choices? In truth, we should act as sapient creatures should! If we don’t move with the future, the future will twist and roll right over us.’\nRhys paused to accommodate the inevitable outburst of Shame! and Not so! and all the other detritus of rotted debate, and then spoke again. ‘Yes, I recognize you, Albrecht Albrechtson. The floor is yours.’\nThe elderly dwarf, who had once been favourite to win the last election for Low King, said courteously, ‘Your majesty, you know I have no particular liking for the way that the world is going, nor some of your more modern ideas, but I have been shocked to discover that some of the more headstrong grags are still orchestrating attacks on the clacks system.’\nThe King said, ‘Are they mad?! We made it clear to this council and all dwarfs, after the message we received from Ankh-Morpork about their clacks being attacked, that this stupidity must cease at once. It’s even worse than the Nugganites, who were, to be sensible about this, totally and absolutely bloody insane.’\nAlbrecht coughed and said, ‘Your majesty, in this instance I find myself standing shoulder to shoulder with you. I am appalled to see things go this far. What are we but creatures of communication and communication accurately communicated is a benison to be cherished by all species everywhere. I never thought I would say this, but the news I am hearing lately, and am expected to delight in, makes me ashamed to call myself a dwarf. We have our differences and it’s right and proper that we should have them, and discourse and compromise are cornerstones in the proper world of politics, but here and now, your majesty, you have my full and unequivocal support. And as for those who stand in our way, I call down a murrain on them. I say, a murrain!’\nThere are uproars and there are uproars and this uproar stayed up for a very long time.\nEventually Albrecht Albrechtson brought his axe down on to the table, splitting the wood from top to bottom, bringing terrified silence across the gathered dwarfs, and said, ‘I support my King. That is what a King is for. A murrain, I said. A murrain. And a Ginnungagap for those that say different.’\nThen, three pages later, Lord Vetinari contemplates those irritating little unthinking people who stand in the way of Progress.\nCurious, the Patrician thought, as Drumknott hurried away to dispatch a clacks to the editor of the Times, that people in Ankh-Morpork professed not to like change while at the same time fixating on every new entertainment and diversion that came their way. There was nothing the mob liked better than novelty. Lord Vetinari sighed again. Did they actually think? These days everybody used the clacks, even little old ladies who used it to send him clacks messages complaining about all these new-fangled ideas, totally missing the irony….\nThere was nothing for it but to follow the wave. New things, new ideas arrived and strutted their stuff and were vilified by some and then lo! that which had been a monster was suddenly totally important to the world. All the time the fanglers and artificers were coming up with even more useful things that hadn’t been foreseen and suddenly became essential. And the pillars of the world remained unshaken.\nPratchett completely fails to see the irony in his presentation of a King and a Dictator as the voices of Inevitable Progress. This scene gives way, on literally the next page, to a dwarf waxing eloquent on how wonderful it is that dwarves and trolls are friends now, and twenty pages later, is followed by a FOURTH repetition of THE SAME VERY IMPORTANT MESSAGE.\nBleddyn had cooked a good rat supper and was upset when she saw his face and said, ‘Those damn grags again! Why don’t you tell them to put their nonsense where the light shines too much!’fn26\nBleddyn didn’t usually swear, so that surprised him, and she continued, ‘They had a point once. They said that we were being swallowed up by the humans and the trolls, and you know it’s true, except that it’s the wrong kind of truth. The kids’ve got human friends and one or two trolls as well and nobody notices, nobody thinks about it. Everyone is just people.’\nHe looked at her face and said, ‘But we’re diminished, less important!’\nBut Bleddyn was emphatic and said, ‘You silly old dwarf. Don’t you think the trolls consider themselves diminished too? People mingle and mingling is good! You’re a dwarf, with big dwarf hobnail boots and everything else it takes to be a dwarf. And remember, it wasn’t so long ago that dwarfs were very scarce outside of Uberwald. You must know your history? Nobody can take that away, and who knows, maybe some trolls are saying right now, “Oh dear, my little pebbles is being influenced by the dwarfs! It’s a sin!” The Turtle moves for everybody all the time, and those grags schism so often that they consider everyone is a schism out there on their own. Look it up. I’ve cooked you a lovely rat – nice and tender – so why not eat it up and get out into the sunshine? I know it isn’t dwarfish, but it’s good for getting your clothes dried.’\nWhen he laughed she smiled and said, ‘All that’s wrong in the world is that it’s spilling over us as if we’re stones in a stream, and it’ll leave us eventually. Remember your old granddad telling you about going to fight the trolls in Koom Valley, yes? And then you told your son how you went back to Koom Valley and found out the whole damn business was a misunderstanding. And because of all this, our Brynmor won’t even have to fight unless someone is extremely stupid. Say no to the grags. Really, they’re bogeymen. I’ve spoken to all the women round here and they say exactly the same thing.\nIt’s one tedious lecture after another and the sheer idiocy of the message is remarkable. The idea that war is based on misunderstanding, that people are all the same underneath, and that multiculturalism and multiethnic societies means our children won’t have to fight is not only wrong, it is downright backward. It is this very thinking that has guaranteed that the wars of the next generation will be more vicious, more bitter, and more terrible, on a larger scale, than anything Europe has seen since the Thirty Years War.\nThe nations did not come to exist in a vaccuum. Nations are born from two things, geographic isolation and the hellish cauldron of inter-group exile and extermination. Just as Hutus and Tutsis didn’t care that they were both called “Rwandans” when they murdered each other, no one is going to care that they are “British” or “French” or “American” when the debt-inflated pseudo-wealth is gone and the struggle for real resources begins.\nRaising Steam\nisn’t a capstone on a distinguished career, it is a badly written caricature that is a tombstone for a dying idea.",
  "tags": [
    "Book Review",
    "books"
  ],
  "categories": [],
  "sitemap_lastmod": "2014-02-27T18:15:00+00:00"
}