{
  "url": "https://voxday.net/2014/02/26/rules-of-writing-viii-maintain-viability/",
  "scraped_at": "2025-12-15T16:47:32.289278",
  "title": "Rules of Writing VIII: maintain viability",
  "date_display": "February 26, 2014",
  "date_iso": "2014-02-26T11:29:00+00:00",
  "date_from_url": "2014-02-26",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>Most of the posts in this series have revolved around the craft of writing, but now that I’ve had the chance to see the publishing business from both sides, I think this is a good time to look at the business angle. Some of you may recall that during last summer’s lunacy, (was it four kerfluffles ago or only three? I’ve lost count), a certain SFWA president completely lost it in his penultimate act as SFWA president after Random House announced its Hydra imprint. He declared:</p><blockquote class=\"tr_bq\"><p> Advances are typically all authors make from a book. It’s a competitive market and most books sell relatively small numbers. One reason to go with a publisher at all — especially these days — is because you get a concrete, definable amount of money fronted to you at the start; which is to say, you know you’ll get paid at least that much. The publisher is not doing you a favor by fronting you an advance; the publisher is making a hard-headed determination of how much money it will owe you (under terms of contract) and giving you that much up front so they don’t have to bother with royalties on the back end.</p><p>It’s also — importantly — an amount of money the publisher has invested in a book, which it will not get back if the book fails. It’s the publisher’s skin in the game, as it were. If there’s no advance, there’s no skin in the game for the publisher, and no real motivation for the publisher to bust its ass on behalf of the book. Neither Random House nor Bertelsmann is some hard-scrabble, scrappy company trying to make it in this big world; please look again at their revenues and net income. However, even if they were hard-scrabble, scrappy companies it would still be wrong not to offer advances to authors.</p></blockquote><p>This is woefully clueless, but before I explain the essential problem with it, let me first point out that the individual concerned has clearly never grasped the risk-related aspects of the advance, the potential problem it creates for the writer, or the important distinction between short-term financial risk and long-term caeer risk that must be evaluated and balanced by the writer. As evidence, consider what the same author had to say about advances TEN YEARS AGO, before advances began to significantly decline and no-advance deals became increasingly common:</p><blockquote class=\"tr_bq\"><p> $0 to $3,000: A Shitty Deal. Because that’s what it is, my friends. Possibly the only thing worse than a shitty deal is no deal at all. Possibly.</p><p>$3,000 to $5,000: A Contemptible Deal. The deal you get when your publisher has well and truly got your number, and it is low.</p><p>$5,000 to $10,000: A “Meh” Deal. It’s not great, you know. But you can pay some bills. Get a few of these, and a tolerant spouse with a regular income, and you can tell your day job to piss off. This year, anyway.</p><p>$10,000 to $20,000: A Not Bad Deal. Note that “not bad” here should be said with a slight appreciative rise of the eyebrows and a small approving nod — this is the level at which the money begins to look not embarrassing both to writers and non-writers. A couple of these, and you’ll definitely be punting the day job (I did, anyway).</p><p>$20,000 to $100,000: A “Shut Up!” Deal. This needs to be said in the same enviously admiring vocal tone as a teenage girl might use to her girlfriend who is showing off the delicious new pumps she got at Robinsons-May for 30% off, or the vocal tone (same idea, lower register) Jim Kelly used when one of our number admitted to having at least a couple of deals in this range. With this kind of money, you don’t even need a supportive spouse to avoid the Enforced Top Ramen Diet (although, you know. Having one doesn’t hurt). But it’s not so much that the other writers actively begin to hate you.</p><p>$100,000 and above: “I’m Getting the Next Round.” Because if you’re at this level, you can buy and sell all the other writers at the table. Get ‘em a friggin’ beer, for God’s sake.</p></blockquote><p>It should be noted that I have received three separate SHUT UP deals from major publishers, so I’m neither ignorant nor in the “sour grapes” category. It is interesting to observe that even at the time, in 2004, other writers recognized that the SFWA president to-be didn’t understand the basic risks involved. Hence the following dialogue between Jeremy Lassen and John Scalzi:</p><blockquote class=\"tr_bq\"><p> JL: “A $20,000 advance = “not bad?” Fuck that. A $20,000 advance could mean the end of your fucking career. If you don’t sell 7,500 copies of your book in hardcover, or 15,000 of your book in trade paperback, you didn’t earn out.”</p><p>JS: “Or really NOT, since that was the exact amount of the advance for my first book, and I’ve subsequently sold six more, including two more to the same company. Sometimes I get more than that $20K, sometimes I get less…. What’s indisputable is that $20K paid my mortgage for the year. That’s Not Bad.”</p></blockquote><p>So, as long as you plan to rip-off Robert Heinlein, then follow that up with rip-offs of Philip K. Dick, H. Beam Piper, and Star Trek, you need not worry about killing off your career with a failed first novel on the basis of an excessive advance. For everyone else capable of learning from the 10 years that have passed by in the meantime, it might be wise to consider this cautionary tale, in which a young woman discovered that <a href=\"https://medium.com/debt-ridden/35d7c8aec846?src=longreads\">a $200,000 book deal was a Trojan Horse</a> insofar as her literary career was concerned:</p><blockquote class=\"tr_bq\"><p> In 2008 I sold a book-in-progress for $200,000 ($170,000 after commission, to be paid in four installments), which still seems to me like a lot of money. At the time, though, it seemed infinite. The resulting book—a “paperback original,” as they’re called—has sold around 8,000 copies, which is about a fifth of what it needed to sell not to be considered a flop. This essentially guarantees that no one will ever pay me that kind of money to write a book again….</p><p>MY FIRST CLUE THAT MY BOOK WOULD NOT BE A BESTSELLER came in a marketing meeting about six months prior to publication. Actually there were several clues in that meeting. The first came when a marketing assistant suggested that I start a blog, and I had to explain that her bosses had acquired my book in part because I was a well-known blogger. The second came when my publicist asked how I thought they should position my book. She rattled off a short list of commercially successful essay collections by funny, quirky female writers like Sloane Crosley, Laurie Notaro, and Julie Klam. Books with “Cake” and “Girls” in the title and jokey subtitles.</p><p>Having worked at a publishing house, I know that it’s not possible for<br> everyone who works at a publishing house to read all the books coming<br> out that season, or even parts of them, or even the descriptions of them<br> in the catalog or in-house “tip sheets.” But I also know that if a book<br> is supposed to be a “big” book, everyone in the office will read it. I<br> was a young woman, so of course they had lumped me in with the cake-girl<br> books.</br></br></br></br></br></br></p></blockquote><p>I had a similar problem, although what killed off the <i>Eternal Warriors</i> series was Pocket’s well-intentioned, but mistaken decision to retroactively shoehorn it into the <i>Left Behind</i> department, where it failed, rather than leaving it in the Fantasy department where <i>The War in Heaven</i> sold through all 35,000 copies in its two print runs. They even tossed out the half-completed Rowena painting that would have served as the cover for <i>The World in Shadow</i>. As it happens, Emily Gould survived her disastrous first book in the short term; she somehow managed to finagle a second $30,000 book contract on the strength of her social media presence. However, if <i>Friendship </i>fails, as <i>And the Heart Says Whatever</i> did, her traditional publishing career is done. Traditional publishing is now a two-strikes-and-you’re-out business.</p><p>And note that despite paying a $200,000 advance, her publisher only managed to move 8,000 copies. So much for the skin-in-the-game theory. If $200k isn’t enough to focus their attention, how much skin do you think a meager $3k advance going to get you? I can personally attest that not even a $60k contract was enough to get Pocket to do more than return my phone calls.</p><p>Now consider if Miss Gould had sold 8,000 ebooks with an independent publisher. At a 50 percent royalty on the $7.99 kindle price, she’d have earned about $2.75 per book, or $22,000. That is ALREADY into SHUT UP deal country; not only that, but she probably wouldn’t have fallen into debt on the basis of her “windfall”. And, if she still wanted to go the traditional route, most publishers would be open to publishing her rather than viewing her as if she’s radioactive.</p><p>As long as the writer is looking at his career beyond his current book, it is ALWAYS better to take a no-advance deal so long as a) he isn’t starving, b) the royalty rate is better than the standard 25 percent offered by the major publishers, and c) there is reason to believe that the independent publisher can both produce professional-quality books and find a market for them. Self-publishing is an excellent option, but having been through the oft-aggravating setup process, it is definitely not for everyone and not everyone can afford to drop between $250 and $1,000 on ISBN numbers, to say nothing of the price of good covers and editing.</p><p>Only the most short-sighted author will want his publisher to assume all the financial risk for them, because whereas the publisher is merely risking a few thousand dollars that first book, <i>the author is betting his entire career</i>. But very, very few authors write their best, or their most successful book, first. This means that it is downright foolish to attempt to shift the short-term risk to the publisher, because that necessarily means the author is assuming an inordinate amount of medium-to-long-term risk.</p><p>Maintaining viability should be the writer’s foremost objective on the business side. One never wants to bet one’s entire career on a single book. The risky bet can pay off, as Dan Brown proved after getting dropped by Pocket Books, but the reason we all know Dan Brown’s name is because he is the very rare exception. And it probably will not have escaped the sophisticated observer’s notice how these exceptions often appear to be linked to what shall be politely described as literary borrowing.</p><p>I will provide more information on this in a month or two, when I will conclusively demonstrate that in at least some cases, an author will actually receive a check for an amount equal to a professional word-rate from the new no-advance model months BEFORE he receives it from the traditional advance model.</p></div>",
  "content_text": "Most of the posts in this series have revolved around the craft of writing, but now that I’ve had the chance to see the publishing business from both sides, I think this is a good time to look at the business angle. Some of you may recall that during last summer’s lunacy, (was it four kerfluffles ago or only three? I’ve lost count), a certain SFWA president completely lost it in his penultimate act as SFWA president after Random House announced its Hydra imprint. He declared:\nAdvances are typically all authors make from a book. It’s a competitive market and most books sell relatively small numbers. One reason to go with a publisher at all — especially these days — is because you get a concrete, definable amount of money fronted to you at the start; which is to say, you know you’ll get paid at least that much. The publisher is not doing you a favor by fronting you an advance; the publisher is making a hard-headed determination of how much money it will owe you (under terms of contract) and giving you that much up front so they don’t have to bother with royalties on the back end.\nIt’s also — importantly — an amount of money the publisher has invested in a book, which it will not get back if the book fails. It’s the publisher’s skin in the game, as it were. If there’s no advance, there’s no skin in the game for the publisher, and no real motivation for the publisher to bust its ass on behalf of the book. Neither Random House nor Bertelsmann is some hard-scrabble, scrappy company trying to make it in this big world; please look again at their revenues and net income. However, even if they were hard-scrabble, scrappy companies it would still be wrong not to offer advances to authors.\nThis is woefully clueless, but before I explain the essential problem with it, let me first point out that the individual concerned has clearly never grasped the risk-related aspects of the advance, the potential problem it creates for the writer, or the important distinction between short-term financial risk and long-term caeer risk that must be evaluated and balanced by the writer. As evidence, consider what the same author had to say about advances TEN YEARS AGO, before advances began to significantly decline and no-advance deals became increasingly common:\n$0 to $3,000: A Shitty Deal. Because that’s what it is, my friends. Possibly the only thing worse than a shitty deal is no deal at all. Possibly.\n$3,000 to $5,000: A Contemptible Deal. The deal you get when your publisher has well and truly got your number, and it is low.\n$5,000 to $10,000: A “Meh” Deal. It’s not great, you know. But you can pay some bills. Get a few of these, and a tolerant spouse with a regular income, and you can tell your day job to piss off. This year, anyway.\n$10,000 to $20,000: A Not Bad Deal. Note that “not bad” here should be said with a slight appreciative rise of the eyebrows and a small approving nod — this is the level at which the money begins to look not embarrassing both to writers and non-writers. A couple of these, and you’ll definitely be punting the day job (I did, anyway).\n$20,000 to $100,000: A “Shut Up!” Deal. This needs to be said in the same enviously admiring vocal tone as a teenage girl might use to her girlfriend who is showing off the delicious new pumps she got at Robinsons-May for 30% off, or the vocal tone (same idea, lower register) Jim Kelly used when one of our number admitted to having at least a couple of deals in this range. With this kind of money, you don’t even need a supportive spouse to avoid the Enforced Top Ramen Diet (although, you know. Having one doesn’t hurt). But it’s not so much that the other writers actively begin to hate you.\n$100,000 and above: “I’m Getting the Next Round.” Because if you’re at this level, you can buy and sell all the other writers at the table. Get ‘em a friggin’ beer, for God’s sake.\nIt should be noted that I have received three separate SHUT UP deals from major publishers, so I’m neither ignorant nor in the “sour grapes” category. It is interesting to observe that even at the time, in 2004, other writers recognized that the SFWA president to-be didn’t understand the basic risks involved. Hence the following dialogue between Jeremy Lassen and John Scalzi:\nJL: “A $20,000 advance = “not bad?” Fuck that. A $20,000 advance could mean the end of your fucking career. If you don’t sell 7,500 copies of your book in hardcover, or 15,000 of your book in trade paperback, you didn’t earn out.”\nJS: “Or really NOT, since that was the exact amount of the advance for my first book, and I’ve subsequently sold six more, including two more to the same company. Sometimes I get more than that $20K, sometimes I get less…. What’s indisputable is that $20K paid my mortgage for the year. That’s Not Bad.”\nSo, as long as you plan to rip-off Robert Heinlein, then follow that up with rip-offs of Philip K. Dick, H. Beam Piper, and Star Trek, you need not worry about killing off your career with a failed first novel on the basis of an excessive advance. For everyone else capable of learning from the 10 years that have passed by in the meantime, it might be wise to consider this cautionary tale, in which a young woman discovered that\na $200,000 book deal was a Trojan Horse\ninsofar as her literary career was concerned:\nIn 2008 I sold a book-in-progress for $200,000 ($170,000 after commission, to be paid in four installments), which still seems to me like a lot of money. At the time, though, it seemed infinite. The resulting book—a “paperback original,” as they’re called—has sold around 8,000 copies, which is about a fifth of what it needed to sell not to be considered a flop. This essentially guarantees that no one will ever pay me that kind of money to write a book again….\nMY FIRST CLUE THAT MY BOOK WOULD NOT BE A BESTSELLER came in a marketing meeting about six months prior to publication. Actually there were several clues in that meeting. The first came when a marketing assistant suggested that I start a blog, and I had to explain that her bosses had acquired my book in part because I was a well-known blogger. The second came when my publicist asked how I thought they should position my book. She rattled off a short list of commercially successful essay collections by funny, quirky female writers like Sloane Crosley, Laurie Notaro, and Julie Klam. Books with “Cake” and “Girls” in the title and jokey subtitles.\nHaving worked at a publishing house, I know that it’s not possible for\neveryone who works at a publishing house to read all the books coming\nout that season, or even parts of them, or even the descriptions of them\nin the catalog or in-house “tip sheets.” But I also know that if a book\nis supposed to be a “big” book, everyone in the office will read it. I\nwas a young woman, so of course they had lumped me in with the cake-girl\nbooks.\nI had a similar problem, although what killed off the\nEternal Warriors\nseries was Pocket’s well-intentioned, but mistaken decision to retroactively shoehorn it into the\nLeft Behind\ndepartment, where it failed, rather than leaving it in the Fantasy department where\nThe War in Heaven\nsold through all 35,000 copies in its two print runs. They even tossed out the half-completed Rowena painting that would have served as the cover for\nThe World in Shadow\n. As it happens, Emily Gould survived her disastrous first book in the short term; she somehow managed to finagle a second $30,000 book contract on the strength of her social media presence. However, if\nFriendship\nfails, as\nAnd the Heart Says Whatever\ndid, her traditional publishing career is done. Traditional publishing is now a two-strikes-and-you’re-out business.\nAnd note that despite paying a $200,000 advance, her publisher only managed to move 8,000 copies. So much for the skin-in-the-game theory. If $200k isn’t enough to focus their attention, how much skin do you think a meager $3k advance going to get you? I can personally attest that not even a $60k contract was enough to get Pocket to do more than return my phone calls.\nNow consider if Miss Gould had sold 8,000 ebooks with an independent publisher. At a 50 percent royalty on the $7.99 kindle price, she’d have earned about $2.75 per book, or $22,000. That is ALREADY into SHUT UP deal country; not only that, but she probably wouldn’t have fallen into debt on the basis of her “windfall”. And, if she still wanted to go the traditional route, most publishers would be open to publishing her rather than viewing her as if she’s radioactive.\nAs long as the writer is looking at his career beyond his current book, it is ALWAYS better to take a no-advance deal so long as a) he isn’t starving, b) the royalty rate is better than the standard 25 percent offered by the major publishers, and c) there is reason to believe that the independent publisher can both produce professional-quality books and find a market for them. Self-publishing is an excellent option, but having been through the oft-aggravating setup process, it is definitely not for everyone and not everyone can afford to drop between $250 and $1,000 on ISBN numbers, to say nothing of the price of good covers and editing.\nOnly the most short-sighted author will want his publisher to assume all the financial risk for them, because whereas the publisher is merely risking a few thousand dollars that first book,\nthe author is betting his entire career\n. But very, very few authors write their best, or their most successful book, first. This means that it is downright foolish to attempt to shift the short-term risk to the publisher, because that necessarily means the author is assuming an inordinate amount of medium-to-long-term risk.\nMaintaining viability should be the writer’s foremost objective on the business side. One never wants to bet one’s entire career on a single book. The risky bet can pay off, as Dan Brown proved after getting dropped by Pocket Books, but the reason we all know Dan Brown’s name is because he is the very rare exception. And it probably will not have escaped the sophisticated observer’s notice how these exceptions often appear to be linked to what shall be politely described as literary borrowing.\nI will provide more information on this in a month or two, when I will conclusively demonstrate that in at least some cases, an author will actually receive a check for an amount equal to a professional word-rate from the new no-advance model months BEFORE he receives it from the traditional advance model.",
  "tags": [
    "Rules of Writing"
  ],
  "categories": [],
  "sitemap_lastmod": "2014-02-26T11:29:00+00:00"
}