{
  "url": "https://voxday.net/2014/02/08/rules-of-writing-vii-know-thyself/",
  "scraped_at": "2025-12-15T16:45:49.205946",
  "title": "Rules of Writing VII: know thyself",
  "date_display": "February 8, 2014",
  "date_iso": "2014-02-08T14:00:00+00:00",
  "date_from_url": "2014-02-08",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p><b>7. Thou shalt know who thou art as a writer</b></p><p>Just as there are various types of athletes, there are various types of writers. Some writers are prolific and can produce thousands of words a day for months on end. Others find it difficult to crank out a few hundred words a month. Some writers have a natural gift for prose and can make a shopping list read like a work of art. Others have a gift for mimicry and can rip off Shakespeare or Dashiell Hammett with equal ease.</p><p>The problem is that many writers have goals that are not in line with their talents or their experience. The results seldom work out much better than positioning a point guard in the paint, or lining up a 400-pound nose tackle at wide receiver. As an educational aside, I once saw the Minnesota Vikings attempt to execute a spectacularly ill-designed play that called for Cris Carter to block Reggie White as Randall Cunningham rolled out to his right. Carter was not small for a wide receiver, but White shoved him and sent him flying five yards backward in the air, right into Cunningham. Needless to say, we never saw that play called again.</p><p>If plotting is not your strength, don’t try to write murder mysteries. If you struggle to write more than a sentence or two on a daily basis, don’t even think about attempting epic fantasy. If you’re not interested in characters and how they feel, writing romance is probably not a good idea. If you have no idea how the magic phone in your pocket does all the amazing things it does and you have no interest in science, science fiction is not your ideal genre no matter how much you enjoy reading Asimov and Heinlein.</p><p>One of the biggest mistakes I see writers making is attempting to write books on the basis of what they enjoy reading rather than on the basis of what their literary strengths are. This makes no sense. It is rather like deciding that you’re going to write music like Van Halen even though you play the fiddle instead of the electric guitar. If you play the fiddle, you need to write music like Charlie Daniels or music that actually involves fiddles.</p><p>When I first started writing, my long-term objective was to write books like Umberto Eco’s books, because Umberto Eco was my favorite writer. There was one very significant problem there. Umberto Eco is a trained and accomplished medievalist. I am not. And it turned out that there is an even bigger problem. Umberto Eco is committed to an excruciatingly high level of detail and will devote an entire year to doing nothing but research before he starts writing a book. I can’t bother to put a basic outline together and prefer to approach a novel as a series of vignettes that are loosely arrayed in my imagination. So, what I have learned is that any attempt to write books in the Eco vein are doomed to certain failure.</p><p>But just because I don’t have Eco’s strengths doesn’t mean that I don’t have certain strengths of my own. I was raised in a military family, I am a lifelong wargamer, I read military history in two languages, and I have hundreds of hours of full-contact fighting experience. This permits me to provide considerably more strategic and tactical verisimilitude to the combat scenes in my book as well as what leads up to them; my first editor at Pocket Books successfully deduced I was a martial artist after having doubts about the description of one of the fight scenes from <i>The War in Heaven</i> and trying it out on her husband.</p><p>Recall this comment from a review of <b><i><a href=\"https://www.smashwords.com/books/view/405273\">A Throne of Bones</a></i></b>: <i>“The final battle in the book was the end result of a chain of<br> dominoes first tipped over right at the start of the book. Kudos on<br> that, because it definitely has more impact when the battle literally<br> couldn’t exist without the prior 600+ pages setting it up.”</br></br></br></i></p><p>I can’t do pretty prose. I can’t do police procedurals. And I can’t do technical mysteries that involve complicated puzzles. But how many authors can successfully pull off a stunt like that? And if I lack literary artistry, I am fortunate to have a considerable amount of literary stamina. I can crank out 400,000 words in a year without it exhausting me in any way. I also have a reasonable knowledge of history, economics and political science. This all lends itself to writing epic fantasy, which is not actually one of my favorite genres to read, in part because it is so seldom done well, but has turned out to be one that I rather enjoy writing.</p><p>Another review, this one of <a href=\"https://www.smashwords.com/books/view/406149\"><b><i>A Magic Broken</i></b></a>, mentioned that the story started slow and the opening line was considerably more bland and unexciting than the story turned out to be. A fair point, without question. But how misleading would it be to present what is essentially a 20,000-word short story with a noir-style start?</p><p>So, my conclusion is that the idea one should write what one loves or write one one knows is, for the most part, misguided. The author should instead write what is best suited to his talents. Now, it will obviously take some time for an author to learn what his literary strengths and weaknesses are. And it will take an amount of brutal self-honesty to admit that one’s abilities are not necessarily linked to one’s preferences. But this is a process that may actually be an integral part of the apocryphal quote concerning the need to write one million words of crap before one can expect to write anything worthy of public consumption.</p><p>The strange thing about writing is that many of those who dabble in it expect to find themselves to be accomplished writers without ever practicing. But the practice is necessary, not only so that one can develop one’s skills, but so one can discover the specific nature of those skills as well.</p><p>As for those who manage to hit one out of the park on their first effort, there is a word for such novelists: pseudo-biographers. It’s not an accident that so many first-time successes struggle to ever write anything that even approaches their debut work; if one is writing about oneself, one is not a true storyteller and it is a very rare individual whose life is so compelling that it merits more than one book about it.</p><p>Regardless, whether one is a pseudio-biographer, a storyteller, or a pure stylist, one’s chances of writing something others consider to be worth reading is considerably enhanced by knowing what you are, and then making your decisions on the basis of that knowledge.</p></div>",
  "content_text": "7. Thou shalt know who thou art as a writer\nJust as there are various types of athletes, there are various types of writers. Some writers are prolific and can produce thousands of words a day for months on end. Others find it difficult to crank out a few hundred words a month. Some writers have a natural gift for prose and can make a shopping list read like a work of art. Others have a gift for mimicry and can rip off Shakespeare or Dashiell Hammett with equal ease.\nThe problem is that many writers have goals that are not in line with their talents or their experience. The results seldom work out much better than positioning a point guard in the paint, or lining up a 400-pound nose tackle at wide receiver. As an educational aside, I once saw the Minnesota Vikings attempt to execute a spectacularly ill-designed play that called for Cris Carter to block Reggie White as Randall Cunningham rolled out to his right. Carter was not small for a wide receiver, but White shoved him and sent him flying five yards backward in the air, right into Cunningham. Needless to say, we never saw that play called again.\nIf plotting is not your strength, don’t try to write murder mysteries. If you struggle to write more than a sentence or two on a daily basis, don’t even think about attempting epic fantasy. If you’re not interested in characters and how they feel, writing romance is probably not a good idea. If you have no idea how the magic phone in your pocket does all the amazing things it does and you have no interest in science, science fiction is not your ideal genre no matter how much you enjoy reading Asimov and Heinlein.\nOne of the biggest mistakes I see writers making is attempting to write books on the basis of what they enjoy reading rather than on the basis of what their literary strengths are. This makes no sense. It is rather like deciding that you’re going to write music like Van Halen even though you play the fiddle instead of the electric guitar. If you play the fiddle, you need to write music like Charlie Daniels or music that actually involves fiddles.\nWhen I first started writing, my long-term objective was to write books like Umberto Eco’s books, because Umberto Eco was my favorite writer. There was one very significant problem there. Umberto Eco is a trained and accomplished medievalist. I am not. And it turned out that there is an even bigger problem. Umberto Eco is committed to an excruciatingly high level of detail and will devote an entire year to doing nothing but research before he starts writing a book. I can’t bother to put a basic outline together and prefer to approach a novel as a series of vignettes that are loosely arrayed in my imagination. So, what I have learned is that any attempt to write books in the Eco vein are doomed to certain failure.\nBut just because I don’t have Eco’s strengths doesn’t mean that I don’t have certain strengths of my own. I was raised in a military family, I am a lifelong wargamer, I read military history in two languages, and I have hundreds of hours of full-contact fighting experience. This permits me to provide considerably more strategic and tactical verisimilitude to the combat scenes in my book as well as what leads up to them; my first editor at Pocket Books successfully deduced I was a martial artist after having doubts about the description of one of the fight scenes from\nThe War in Heaven\nand trying it out on her husband.\nRecall this comment from a review of\nA Throne of Bones\n:\n“The final battle in the book was the end result of a chain of\ndominoes first tipped over right at the start of the book. Kudos on\nthat, because it definitely has more impact when the battle literally\ncouldn’t exist without the prior 600+ pages setting it up.”\nI can’t do pretty prose. I can’t do police procedurals. And I can’t do technical mysteries that involve complicated puzzles. But how many authors can successfully pull off a stunt like that? And if I lack literary artistry, I am fortunate to have a considerable amount of literary stamina. I can crank out 400,000 words in a year without it exhausting me in any way. I also have a reasonable knowledge of history, economics and political science. This all lends itself to writing epic fantasy, which is not actually one of my favorite genres to read, in part because it is so seldom done well, but has turned out to be one that I rather enjoy writing.\nAnother review, this one of\nA Magic Broken\n, mentioned that the story started slow and the opening line was considerably more bland and unexciting than the story turned out to be. A fair point, without question. But how misleading would it be to present what is essentially a 20,000-word short story with a noir-style start?\nSo, my conclusion is that the idea one should write what one loves or write one one knows is, for the most part, misguided. The author should instead write what is best suited to his talents. Now, it will obviously take some time for an author to learn what his literary strengths and weaknesses are. And it will take an amount of brutal self-honesty to admit that one’s abilities are not necessarily linked to one’s preferences. But this is a process that may actually be an integral part of the apocryphal quote concerning the need to write one million words of crap before one can expect to write anything worthy of public consumption.\nThe strange thing about writing is that many of those who dabble in it expect to find themselves to be accomplished writers without ever practicing. But the practice is necessary, not only so that one can develop one’s skills, but so one can discover the specific nature of those skills as well.\nAs for those who manage to hit one out of the park on their first effort, there is a word for such novelists: pseudo-biographers. It’s not an accident that so many first-time successes struggle to ever write anything that even approaches their debut work; if one is writing about oneself, one is not a true storyteller and it is a very rare individual whose life is so compelling that it merits more than one book about it.\nRegardless, whether one is a pseudio-biographer, a storyteller, or a pure stylist, one’s chances of writing something others consider to be worth reading is considerably enhanced by knowing what you are, and then making your decisions on the basis of that knowledge.",
  "tags": [
    "Rules of Writing"
  ],
  "categories": [],
  "sitemap_lastmod": "2014-02-08T14:00:00+00:00"
}