{
  "url": "https://voxday.net/2014/02/13/thats-no-statue-thats-mark-shea/",
  "scraped_at": "2025-12-15T16:46:20.769671",
  "title": "That’s no statue, that’s Mark Shea!",
  "date_display": "February 13, 2014",
  "date_iso": "2014-02-13T14:00:00+00:00",
  "date_from_url": "2014-02-13",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>In which Mark Shea gets trolled so hard, it’s a wonder he didn’t turn to stone. You absolutely MUST read <a href=\"http://www.patheos.com/blogs/markshea/2014/02/a-reader-writes-of-his-experience-among-the-dark-enlightenment-types.html\">A Reader Writes of his Experience Among the Dark Enlightenment Types</a>:</p><blockquote class=\"tr_bq\"><p> The thing about nascent movements like this is that it’s hard to know<br> when to pay attention and when to ignore them. If you ignore them they<br> can grow in the dark, like mushrooms on dung.  If you make too much<br> fuss, you can attract idiots–particularly extremist idiots–who<br> automatically assume that anything normal people find objectionable must<br> be awesome, radical, and “not PC” and therefore good.  But of course,<br> cannibalism is not PC either and embracing something simply and solely<br> on the basis that it is a “reaction” is one of the stupidest things<br> humans can do. You can’t build a life on protest and reaction.  You have<br> to be for something, not merely against something.  And at the end of<br> the day, the only real core of DE “thought” is to be for racialism.</br></br></br></br></br></br></br></br></br></br></p><p>Much of the stuff written above describes a sect that brings out<br> belly laughs. Eldar? Men of Numenor?  Seriously? Tolkien would have<br> these overgrown D and D players’ guts for garters if he heard they were<br> exploiting his work for their deplorable cultus. Particularly since<br> (which is my main concern about them) they are using his work as a grab<br> bag of code words for their deep-rooted racialist heresy<i>.</i></br></br></br></br></br></p><p><i>I first heard about the Dark Enlightenment (aka “Neo-Reaction” or<br> just “Reaction”) last year, the year after I graduated from college and<br> was interning at a conservative think tank. I briefly become involved<br> with the Dark Enlightenment and then left the movement in disgust. Here<br> is what I learned:</br></br></br></br></i><br> <i><br> </br></i><i>– The Dark Enlightenment is controlled by what the media call “Sith<br> Lords”. You have more public Lords like Mencius Moldbug and Nick Land,<br> but there are even some Lords up higher whose names are not revealed.<br> They say the Master Lord says ‘Et Ego in Arcadia’ which is an anagram<br> for ‘Tego Arcana Dei’ (“I hide the secrets of God”).</br></br></br></br></i><br> <i><br> </br></i><i>– But only the media call them ‘Sith Lords’. In Inner Speak, they will often use phrases like the Men of Númenor or the Eldars.</i><br> <i><br> </br></i><i>– I never met any of the higher Eldars, but I did once meet an Eldar<br> in Training. I don’t know his real name but people called him Legolas.<br> He had long blond hair, was dressed like a 19th century count, and wore a<br> pendant that had both a Christian Cross and Thor’s Hammer on it.</br></br></br></i><br> <i><br> </br></i><i>– The movement is a weird mixture of ethno-nationalists, futurists,<br> monarchists, PUAs (“pick-up artists” like Chateau Heartiste), Trad<br> Catholics, Trad Protestants, etc. They all believe in HBD (what they<br> call “human biodiversity” i.e. racism) but disagree on some other minor<br> points.</br></br></br></br></i><br> <i><br> </br></i><i>– The religious people in the movement (both Christians and pagans)<br> practice what is called “identitarian religion” (religion that doesn’t<br> deny ethnic identity).</br></br></i><br> <i><br> </br></i><i>– Some of the rising stars of the Dark Enlightenment on the internet<br> seem to be Radish Magazine, Occam’s Razor Mag, and Theden TV.</br></i><br> <i><br> </br></i><i>– The Dark Enlightenment allegedly has millions of dollars of money<br> to play with. They have a couple big donors. One is rumored to be a<br> major tech tycoon in Silicon Valley. They actually had a private 3-day<br> meeting on an island which was furnished with a French chef, etc.<br> Different forms of formal attire were required for each day (tuxedos,<br> 3-piece suits, etc), and some weird costumes were required too (capes,<br> hoods, etc) — which sound like a pagan cult. (I wasn’t at this function<br> but heard about it.)</br></br></br></br></br></br></br></i><br> <i><br> </br></i><i>– I was initiated into the first stages of the Dark Enlightenment,<br> which involved me stripping down naked so people could “inspect my<br> phenotype”. I was then given a series of very personal questions, often<br> relating to sexual matters. I was then told to put on a black cape. (I<br> really regret doing this but at the time I was younger, more<br> impressionable and eager to please.)</br></br></br></br></br></i><br> <i><br> </br></i><i>– For the initial oath taking, everyone must swear on a copy of<br> Darwin’s Origin of Species, just to show their fidelity to HBD. After<br> that, for the later oaths, seculars will swear again on Darwin, while<br/> Christians will swear on the Bible, and pagans on the Prose Edda or<br/> Iliad.</br></br></i><br/> <i><br/> </i><i>– At one of the meetings I heard someone continuously chanting “gens<br/> alba conservanda est” (Latin for “the white race must be preserved”) and<br/> then others were chanting things in Anglo-Saxon, Old Norse and Old<br/> German, but I don’t know those languages so I can’t remember exactly<br/> what they were saying. </i></br></br></br></br></br></br></br></br></br></p></blockquote><p>Now that was some epic artistic cruelty, so much so that one almost suspects the dark hand of Roissy. Thank the Divine Rainbow for Mark Shea, saving the world from nonexistent movements since 2014!<i> </i>Then again, as a media-identified Sith Lord, perhaps that’s merely what I want him to think….<i><br/></i></p></div>",
  "content_text": "In which Mark Shea gets trolled so hard, it’s a wonder he didn’t turn to stone. You absolutely MUST read\nA Reader Writes of his Experience Among the Dark Enlightenment Types\n:\nThe thing about nascent movements like this is that it’s hard to know\nwhen to pay attention and when to ignore them. If you ignore them they\ncan grow in the dark, like mushrooms on dung.  If you make too much\nfuss, you can attract idiots–particularly extremist idiots–who\nautomatically assume that anything normal people find objectionable must\nbe awesome, radical, and “not PC” and therefore good.  But of course,\ncannibalism is not PC either and embracing something simply and solely\non the basis that it is a “reaction” is one of the stupidest things\nhumans can do. You can’t build a life on protest and reaction.  You have\nto be for something, not merely against something.  And at the end of\nthe day, the only real core of DE “thought” is to be for racialism.\nMuch of the stuff written above describes a sect that brings out\nbelly laughs. Eldar? Men of Numenor?  Seriously? Tolkien would have\nthese overgrown D and D players’ guts for garters if he heard they were\nexploiting his work for their deplorable cultus. Particularly since\n(which is my main concern about them) they are using his work as a grab\nbag of code words for their deep-rooted racialist heresy\n.\nI first heard about the Dark Enlightenment (aka “Neo-Reaction” or\njust “Reaction”) last year, the year after I graduated from college and\nwas interning at a conservative think tank. I briefly become involved\nwith the Dark Enlightenment and then left the movement in disgust. Here\nis what I learned:\n– The Dark Enlightenment is controlled by what the media call “Sith\nLords”. You have more public Lords like Mencius Moldbug and Nick Land,\nbut there are even some Lords up higher whose names are not revealed.\nThey say the Master Lord says ‘Et Ego in Arcadia’ which is an anagram\nfor ‘Tego Arcana Dei’ (“I hide the secrets of God”).\n– But only the media call them ‘Sith Lords’. In Inner Speak, they will often use phrases like the Men of Númenor or the Eldars.\n– I never met any of the higher Eldars, but I did once meet an Eldar\nin Training. I don’t know his real name but people called him Legolas.\nHe had long blond hair, was dressed like a 19th century count, and wore a\npendant that had both a Christian Cross and Thor’s Hammer on it.\n– The movement is a weird mixture of ethno-nationalists, futurists,\nmonarchists, PUAs (“pick-up artists” like Chateau Heartiste), Trad\nCatholics, Trad Protestants, etc. They all believe in HBD (what they\ncall “human biodiversity” i.e. racism) but disagree on some other minor\npoints.\n– The religious people in the movement (both Christians and pagans)\npractice what is called “identitarian religion” (religion that doesn’t\ndeny ethnic identity).\n– Some of the rising stars of the Dark Enlightenment on the internet\nseem to be Radish Magazine, Occam’s Razor Mag, and Theden TV.\n– The Dark Enlightenment allegedly has millions of dollars of money\nto play with. They have a couple big donors. One is rumored to be a\nmajor tech tycoon in Silicon Valley. They actually had a private 3-day\nmeeting on an island which was furnished with a French chef, etc.\nDifferent forms of formal attire were required for each day (tuxedos,\n3-piece suits, etc), and some weird costumes were required too (capes,\nhoods, etc) — which sound like a pagan cult. (I wasn’t at this function\nbut heard about it.)\n– I was initiated into the first stages of the Dark Enlightenment,\nwhich involved me stripping down naked so people could “inspect my\nphenotype”. I was then given a series of very personal questions, often\nrelating to sexual matters. I was then told to put on a black cape. (I\nreally regret doing this but at the time I was younger, more\nimpressionable and eager to please.)\n– For the initial oath taking, everyone must swear on a copy of\nDarwin’s Origin of Species, just to show their fidelity to HBD. After\nthat, for the later oaths, seculars will swear again on Darwin, while\nChristians will swear on the Bible, and pagans on the Prose Edda or\nIliad.\n– At one of the meetings I heard someone continuously chanting “gens\nalba conservanda est” (Latin for “the white race must be preserved”) and\nthen others were chanting things in Anglo-Saxon, Old Norse and Old\nGerman, but I don’t know those languages so I can’t remember exactly\nwhat they were saying.\nNow that was some epic artistic cruelty, so much so that one almost suspects the dark hand of Roissy. Thank the Divine Rainbow for Mark Shea, saving the world from nonexistent movements since 2014!\nThen again, as a media-identified Sith Lord, perhaps that’s merely what I want him to think….",
  "tags": [
    "trainwreck"
  ],
  "categories": [],
  "sitemap_lastmod": "2014-02-13T14:00:00+00:00"
}