{
  "url": "https://voxday.net/2014/02/11/the-end-of-mass-migration/",
  "scraped_at": "2025-12-15T16:46:05.396800",
  "title": "The abolition of America",
  "date_display": "February 11, 2014",
  "date_iso": "2014-02-11T13:17:00+00:00",
  "date_from_url": "2014-02-11",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>Norway is already <a href=\"http://www.thelocal.no/20140211/norway-ruling-party-calls-for-swiss-style-referendum\">showing signs of following Switzerland’s lead</a> to shut down the economic and societal castastrophe of mass immigration.</p><blockquote class=\"tr_bq\"><p> Mazyar Keshvari, immigration policy spokesman for the<br> anti-immigration Progress Party, told the VG newspaper that he believed<br> Norway should follow Switzerland’s example. “Norway should also have a referendum on immigration,” he said. “I am<br> quite sure that there is majority support for tightening immigration<br> across Norway’s political parties. The polls show that.”</br></br></br></br></p></blockquote><p>No doubt this is one reason why. It simply IS NOT TRUE that mass immigration is good for the economy. It is an absolute lie.</p><blockquote class=\"tr_bq\"><p> The report, Sustainable Immigration, was put together by some of the party’s most vehemently anti-Islamic and anti-immigration figures, such as deputy leader Per Sandberg, and Oslo politician Christian Tybring-Gjedde. It cites figures that show that each non-Western immigrant costs the equivalent of 42 years of an average Norwegian’s tax payments, and calls for immigration from non-Western countries to be sharply reduced from from close to 20,000 a year to about 1,500 a year.</p></blockquote><p>Meanwhile, the most retarded “economist” on the planet, an evil little man who makes Paul Krugman look like a paragon of coherency and decency, managed to further embarrass himself <a href=\"http://econlog.econlib.org/archives/2014/02/what_the_swiss.html\">in response to the Swiss vote</a>:</p><blockquote class=\"tr_bq\"><p> The Swiss just passed a referendum to restrict immigration from the EU.  Tyler thinks this shows that open borders is a hopeless cause.  When immigration gets too high, public opinion naturally turns against immigration<i>.</i></p><p><i>“In my view immigration has gone well for Switzerland, both economically and culturally, and I am sorry to see this happen, even apart from the fact that it may cause a crisis in their relations with the European Union.  That said, you can take 27% as a kind of benchmark for the limits of immigration in most or all of today’s wealthy countries.  I believe that as you approach a number in that range, you get a backlash.”</i></p><p>But there’s a major problem with Tyler’s story: Swiss anti-immigration voting was highest in the places with the least immigrants!  This is no fluke.  In the U.S., anti-immigration sentiment is highest in the states with the least immigration – even if you assume that 100% of immigrants are pro-immigration.</p><p>The natural inference to draw, then, is the opposite of Tyler’s: The main hurdle to further immigration is insufficient immigration.  If countries could just get over the hump of status quo bias, anti-immigration attitudes would become as socially unacceptable as domestic racism.  Instead of coddling nativism with gradualism, we can, should, and must peacefully destroy nativism with abolitionism.</p></blockquote><p>This is Hitlerian logic and it makes clear the evil objectives of the pro-immigrationists like Caplan. Switzerland already has a non-native born population pushing 30 percent, most of which lives around Zurich or in the French-speaking cantons. It is those previously naturalized immigrants, combined with the international business class, that supported open immigration, just as a pair of Jewish and Irish third-generation immigrants were primarily responsible for pushing the 1965 Hart-Cellar Act that demolished the USA’s demographics and made the dissolution of the union inevitable.</p><p>It’s the Denny Green syndrome writ large. Just as women always want to hire more women and blacks always want to bring in more blacks, immigrants always want to bring in more immigrants to make themselves feel more at home. I see this all the time, in fact, I’m one of the very few expats who doesn’t primarily socialize with people from my home country.</p><p>The voting phenomenon Caplan is observing is simply the national equivalent of “white flight”, and what he is advocating is nothing less than the invasion and demographic destruction of European nations.</p></div>",
  "content_text": "Norway is already\nshowing signs of following Switzerland’s lead\nto shut down the economic and societal castastrophe of mass immigration.\nMazyar Keshvari, immigration policy spokesman for the\nanti-immigration Progress Party, told the VG newspaper that he believed\nNorway should follow Switzerland’s example. “Norway should also have a referendum on immigration,” he said. “I am\nquite sure that there is majority support for tightening immigration\nacross Norway’s political parties. The polls show that.”\nNo doubt this is one reason why. It simply IS NOT TRUE that mass immigration is good for the economy. It is an absolute lie.\nThe report, Sustainable Immigration, was put together by some of the party’s most vehemently anti-Islamic and anti-immigration figures, such as deputy leader Per Sandberg, and Oslo politician Christian Tybring-Gjedde. It cites figures that show that each non-Western immigrant costs the equivalent of 42 years of an average Norwegian’s tax payments, and calls for immigration from non-Western countries to be sharply reduced from from close to 20,000 a year to about 1,500 a year.\nMeanwhile, the most retarded “economist” on the planet, an evil little man who makes Paul Krugman look like a paragon of coherency and decency, managed to further embarrass himself\nin response to the Swiss vote\n:\nThe Swiss just passed a referendum to restrict immigration from the EU.  Tyler thinks this shows that open borders is a hopeless cause.  When immigration gets too high, public opinion naturally turns against immigration\n.\n“In my view immigration has gone well for Switzerland, both economically and culturally, and I am sorry to see this happen, even apart from the fact that it may cause a crisis in their relations with the European Union.  That said, you can take 27% as a kind of benchmark for the limits of immigration in most or all of today’s wealthy countries.  I believe that as you approach a number in that range, you get a backlash.”\nBut there’s a major problem with Tyler’s story: Swiss anti-immigration voting was highest in the places with the least immigrants!  This is no fluke.  In the U.S., anti-immigration sentiment is highest in the states with the least immigration – even if you assume that 100% of immigrants are pro-immigration.\nThe natural inference to draw, then, is the opposite of Tyler’s: The main hurdle to further immigration is insufficient immigration.  If countries could just get over the hump of status quo bias, anti-immigration attitudes would become as socially unacceptable as domestic racism.  Instead of coddling nativism with gradualism, we can, should, and must peacefully destroy nativism with abolitionism.\nThis is Hitlerian logic and it makes clear the evil objectives of the pro-immigrationists like Caplan. Switzerland already has a non-native born population pushing 30 percent, most of which lives around Zurich or in the French-speaking cantons. It is those previously naturalized immigrants, combined with the international business class, that supported open immigration, just as a pair of Jewish and Irish third-generation immigrants were primarily responsible for pushing the 1965 Hart-Cellar Act that demolished the USA’s demographics and made the dissolution of the union inevitable.\nIt’s the Denny Green syndrome writ large. Just as women always want to hire more women and blacks always want to bring in more blacks, immigrants always want to bring in more immigrants to make themselves feel more at home. I see this all the time, in fact, I’m one of the very few expats who doesn’t primarily socialize with people from my home country.\nThe voting phenomenon Caplan is observing is simply the national equivalent of “white flight”, and what he is advocating is nothing less than the invasion and demographic destruction of European nations.",
  "tags": [
    "immigration"
  ],
  "categories": [],
  "sitemap_lastmod": "2014-02-11T13:17:00+00:00"
}