{
  "url": "https://voxday.net/2014/02/03/the-new-iron-drea/",
  "scraped_at": "2025-12-15T16:45:21.514874",
  "title": "The new iron dream",
  "date_display": "February 3, 2014",
  "date_iso": "2014-02-03T14:00:00+00:00",
  "date_from_url": "2014-02-03",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><div class=\"separator\" style=\"clear: both; text-align: center;\"> <a href=\"http://www.castaliahouse.com/\" imageanchor=\"1\" style=\"clear: left; float: left; margin-bottom: 1em; margin-right: 1em;\"><noscript><img border=\"0\" decoding=\"async\" src=\"http://www.milobookclub.com/wp-content/uploads/2014/02/CH_logo_400.png\"/></noscript><img border=\"0\" class=\"lazyload\" data-src=\"http://www.milobookclub.com/wp-content/uploads/2014/02/CH_logo_400.png\" decoding=\"async\" src=\"data:image/svg+xml,%3Csvg%20xmlns=%22http://www.w3.org/2000/svg%22%20viewBox=%220%200%20210%20140%22%3E%3C/svg%3E\"/></a></div><p>It was amusing to learn about a new Kickstarter entitled <a href=\"https://www.inkshares.com/projects/the-old-iron-dream\">The Old Iron Dream</a>, which is intended to be “an in-depth piece of long-form journalism, a no-holds-barred, no-punches-pulled look at the sci-fi far-right”. The author mentions dangerous right-wing figures from John Campbell and Robert Heinlein to Jerry Pournelle and Larry Niven, as well as Orson Scott Card and me.</p><p>They haven’t seen <i>anything </i>yet.</p><p><a href=\"http://www.castaliahouse.com/\">Castalia House</a> is my new publisher and we intend to give Mr. Forbes and his fearful left-wing friends a good deal to worry about over the next few decades. We are working off the new publishing models which will provide authors better royalty rates than they can get anywhere without self-publishing, and we are encouraging the participation of the various readerships involved. We are intentionally keeping prices down with an eye to maximizing the ongoing technological disruption of the existing publishing companies; we do not view every free reader of one of our books as a lost potential customer, but rather, as a reader who has been rescued from the confining intellectual chains of the SF/F gatekeepers.</p><p>We are asking everyone who has ever wondered whatever happened to the golden age of SF, who has ever felt ripped off by being subjected to yet another left-wing lecture instead of being entertained, who has ever wondered how on Earth that dreadful PC schlock was ever published in the first place, who has ever bitten his tongue rather than say something that might end his career, to not only support us, but to join us in this neotraditionalist rebellion. Remember, the future belongs to those who show up for it.</p><p>We are looking for excellent authors. We are looking for committed translators. We are looking for merciless slush readers. We are looking for talented cover artists. We are looking for people who will spread the word that an alternative to what John C. Wright so aptly described as the relentless heart of darkness exists.</p><p>By the end of this month, Castalia House will be announcing the addition of four new books to the existing arsenal of <a href=\"http://www.castaliahouse.com/vox-scifi/\">science fiction</a> and <a href=\"http://www.castaliahouse.com/vox-fantasy/\">epic fantasy</a>, one of which will be mine, one of which will be a novella from an even better-known author, one of which will be an out-of-print novel from the public domain, and one of which will be an obscure ancient military text.</p><p>If you have any questions about Castalia House or our future plans for it, please feel free to ask them here.</p></div>",
  "content_text": "It was amusing to learn about a new Kickstarter entitled\nThe Old Iron Dream\n, which is intended to be “an in-depth piece of long-form journalism, a no-holds-barred, no-punches-pulled look at the sci-fi far-right”. The author mentions dangerous right-wing figures from John Campbell and Robert Heinlein to Jerry Pournelle and Larry Niven, as well as Orson Scott Card and me.\nThey haven’t seen\nanything\nyet.\nCastalia House\nis my new publisher and we intend to give Mr. Forbes and his fearful left-wing friends a good deal to worry about over the next few decades. We are working off the new publishing models which will provide authors better royalty rates than they can get anywhere without self-publishing, and we are encouraging the participation of the various readerships involved. We are intentionally keeping prices down with an eye to maximizing the ongoing technological disruption of the existing publishing companies; we do not view every free reader of one of our books as a lost potential customer, but rather, as a reader who has been rescued from the confining intellectual chains of the SF/F gatekeepers.\nWe are asking everyone who has ever wondered whatever happened to the golden age of SF, who has ever felt ripped off by being subjected to yet another left-wing lecture instead of being entertained, who has ever wondered how on Earth that dreadful PC schlock was ever published in the first place, who has ever bitten his tongue rather than say something that might end his career, to not only support us, but to join us in this neotraditionalist rebellion. Remember, the future belongs to those who show up for it.\nWe are looking for excellent authors. We are looking for committed translators. We are looking for merciless slush readers. We are looking for talented cover artists. We are looking for people who will spread the word that an alternative to what John C. Wright so aptly described as the relentless heart of darkness exists.\nBy the end of this month, Castalia House will be announcing the addition of four new books to the existing arsenal of\nscience fiction\nand\nepic fantasy\n, one of which will be mine, one of which will be a novella from an even better-known author, one of which will be an out-of-print novel from the public domain, and one of which will be an obscure ancient military text.\nIf you have any questions about Castalia House or our future plans for it, please feel free to ask them here.",
  "tags": [
    "books",
    "Castalia House"
  ],
  "categories": [],
  "sitemap_lastmod": "2014-02-03T14:00:00+00:00"
}