{
  "url": "https://voxday.net/2014/02/15/the-desolation-of-hobbi/",
  "scraped_at": "2025-12-15T16:46:33.214583",
  "title": "The desolation of The Hobbit",
  "date_display": "February 15, 2014",
  "date_iso": "2014-02-15T18:00:00+00:00",
  "date_from_url": "2014-02-15",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>In which John C. Wright explains how <a href=\"http://www.scifiwright.com/2014/02/the-hobbit-the-desolation-of-tolkien/\">Peter Jackson rapes the corpse of JRR Tolkien’s beloved book</a> in the first unnecessary cinematic sequel:</p><blockquote class=\"tr_bq\"><p> Where is the Hobbit in this film, allegedly called THE HOBBIT, again?</p><p>Ah, but then we see Bilbo. After his friends are captured by wood elves, using his ring of invisibility, he sneaks into the buried palace of the elf lord. Unseen, his wily eyes spy out that the elves drink wine imported from Laketown, and float the empty barrels downstream as part of their trade and traffic with the human settlment.</p><p>He waits until the jailor is drunk, steals the keys, frees the dwarves, and, instead of attempting to sneak them past the heavily guarded upper gates, takes them to the loading dock beneath the wine cellar, seals them in the barrels, and clings, still unseen, to a barrel himself as the unsuspecting elf prentices pole the empty barrels downstream to the Laketown. It is simple and brilliant. Unfortunately, he gets a wetting, and takes a headcold: little bit of realism, if not comedy relief.</p><p>Oh, no, wait. That is not what happens.</p><p>Just then, just when I thought I would be free from the repeated blows to my tender head of the Stupidity Hammer, the Stupidity Hammer rose up from the shining screen, drew back, whirled hugely and with great force and might and main slammed me right between the eyes so my brain squirted out my ears a yard past my shoulders in both directions.</p><p>Bilbo does not seal the barrels.</p><p>I will wait for you to recover in case you just got the sensation of a Stupidity Hammer clonking you from the computer screen. They I will repeat myself, because it is so dumb you might not believe me:</p><p>Bilbo does not seal the barrels. He leaves the tops open.</p><p>So the dwarves are perfectly visible, by which I mean visible to the eye, by which I mean not hidden. By which I mean people with eyeballs can see them, such as the elf-people from whom they are allegedly trying to escape.</p><p>Bilbo leaves the barrel tops open when he is dumping the barrels into the water, which is a substance, so I am given to believe, that enters openings and makes things wet inside, and sometimes even sinks things….</p><p>Just when I picked myself again off the sticky floor of the theater, blearily wondering where the Hobbit character was after whom this movie was apparently named might be, BAM! The familiar Hammer came down again. This time, it was a scene where Orlando Bloom is standing a zillion feet away from the evil orc bounty hunter Slopgog the Unmentionable or whatever his name is, and he does not shoot him with an elf arrow.</p><p>I sat there, rocking back and forth with my eyes crossed, and through the stream of drool and vitreous humor leaking down my chin I muttered again and again, “Shoot him with an elf arrow. Shoot. Him. With. An. Elf. Arrow. SHOOT HIM WITH AN ELF ARROW!”</p><p>But no. No elf arrow was forthcoming.</p><p>Blogsnog the Debunker or whatever his name is strolled in a leisurely fashion down the narrow walkway of Laketown, not ducking for cover, and meanwhile no one was calling for the town guard, and the elf guy continued not to shoot him with an elf arrow.</p><p>You see, the film slimer, er, maker, wanted this scene to be like a gunfight in an iconic Western, with Clint Eastwood and John Wayne staring at each other with narrowed eyes as each strides menacingly ever closer, spurs jangling with each step. Of course, in a Western, both are armed with revolvers, and both are wary of making the first move lest the other man prove fast enough to draw and shoot first, but then both shooters want to close the distance to improve their aim. That is what makes such scenes tense.</p><p>Here was what makes a sense spectacularly NOT tense. One guy has a gun and the other had a knife, or a club, or maybe strangling wire or even a stick of butter, because no one gives a rat’s fart for what the other guy has because you can shoot him first.</p><p>If you have the weapon that, you know, shoots, you can shoot the guy who has no weapon that shoots, and so there is no downside to letting him see you go for your gun, or, for that matter, use a winch to load your crossbow in a leisurely manner, because you can raise it and turn him into a pincushion before he can attack you with his club or strangling wire. Or stick of butter.</p><p>In such a case, he will be running toward you at full speed, because if he walks a menacing walk, well, that give you time to roll a cigarette, light it, put your foot in the stirrup thingie on the crossbow, clamp it to your belt winch, and crank the string back, yawn, read a magazine, drop a bolt in the slot, check the grease on the bolt, aim, make vacation plans, check the wind speed, and fire a bolt through this heart and left lung and out his back in a three-dee spray of unnamed orcish life fluids.</p><p>Unless you are superspeed acrobat the wonder elf, in which case you can shoot him nine times a second and spell out your monogram in his vital organs.</p><p>Well, who cares? Neither character was in the book anyway. I think I lost consciousness overcome by the fumes of the butter-substitute substance coating the theater floor between the seats. I woke a little later, and elfboy still had not shot Urgslug the Irkisonic, or whatever his name is. My wife had to stuff a wide handful of popcorn flavored food substitute into my face, in order to smother the broken, wretched burbling — shoot him … with …  an elf arrow.</p></blockquote><p>I didn’t bother seeing the second and third movies in the Matrix trilogy. I didn’t bother seeing the second and third movies in the Star Wars prequel trilogy. And I don’t think I’ll bother seeing the second and third movies in The Hobbit, ah, <i>trilogy</i> either.</p><p>You know it is bad when even hardcore Tolkien fans not only can’t be bothered to see it, but devoutly wish to avoid ever being forced to lay eyes upon it. A commenter named Rainforest Giant summarizes the problem, not only with Peter Jackson ruining The Hobbit, but with the entire edifice of Pink and Postmodern SF/F:</p><p><i>“Jackson… ruins heroics because he cannot<br> understand heroism.  He ruins a fairy tale because his world lacks the<br> deep magic.  His villains are straight out of Scooby Doo.  His special<br> effects mere lights smoke and mirrors.  His understanding of war and<br> conflict as meaningless as Xena or Buffy. Tolkien understood war, sacrifice, magic (as a storyteller and<br> father), heroes and villains, hope and despair.  Jackson lacks a deeper<br> soul thats why he writes bad fan fiction and cartoon action.”</br></br></br></br></br></br></i></p><p>It could have been even worse. At least the dwarves weren’t offering each other blow jobs because ground forces. Imagine if McRapey had chosen to rip off Tolkien instead of Heinlein, Dick, and Star Trek.<i> “</i>Famine for the spirit” and “a hog trough for the mind” is an exact description of the state of SF/F today.</p></div>",
  "content_text": "In which John C. Wright explains how\nPeter Jackson rapes the corpse of JRR Tolkien’s beloved book\nin the first unnecessary cinematic sequel:\nWhere is the Hobbit in this film, allegedly called THE HOBBIT, again?\nAh, but then we see Bilbo. After his friends are captured by wood elves, using his ring of invisibility, he sneaks into the buried palace of the elf lord. Unseen, his wily eyes spy out that the elves drink wine imported from Laketown, and float the empty barrels downstream as part of their trade and traffic with the human settlment.\nHe waits until the jailor is drunk, steals the keys, frees the dwarves, and, instead of attempting to sneak them past the heavily guarded upper gates, takes them to the loading dock beneath the wine cellar, seals them in the barrels, and clings, still unseen, to a barrel himself as the unsuspecting elf prentices pole the empty barrels downstream to the Laketown. It is simple and brilliant. Unfortunately, he gets a wetting, and takes a headcold: little bit of realism, if not comedy relief.\nOh, no, wait. That is not what happens.\nJust then, just when I thought I would be free from the repeated blows to my tender head of the Stupidity Hammer, the Stupidity Hammer rose up from the shining screen, drew back, whirled hugely and with great force and might and main slammed me right between the eyes so my brain squirted out my ears a yard past my shoulders in both directions.\nBilbo does not seal the barrels.\nI will wait for you to recover in case you just got the sensation of a Stupidity Hammer clonking you from the computer screen. They I will repeat myself, because it is so dumb you might not believe me:\nBilbo does not seal the barrels. He leaves the tops open.\nSo the dwarves are perfectly visible, by which I mean visible to the eye, by which I mean not hidden. By which I mean people with eyeballs can see them, such as the elf-people from whom they are allegedly trying to escape.\nBilbo leaves the barrel tops open when he is dumping the barrels into the water, which is a substance, so I am given to believe, that enters openings and makes things wet inside, and sometimes even sinks things….\nJust when I picked myself again off the sticky floor of the theater, blearily wondering where the Hobbit character was after whom this movie was apparently named might be, BAM! The familiar Hammer came down again. This time, it was a scene where Orlando Bloom is standing a zillion feet away from the evil orc bounty hunter Slopgog the Unmentionable or whatever his name is, and he does not shoot him with an elf arrow.\nI sat there, rocking back and forth with my eyes crossed, and through the stream of drool and vitreous humor leaking down my chin I muttered again and again, “Shoot him with an elf arrow. Shoot. Him. With. An. Elf. Arrow. SHOOT HIM WITH AN ELF ARROW!”\nBut no. No elf arrow was forthcoming.\nBlogsnog the Debunker or whatever his name is strolled in a leisurely fashion down the narrow walkway of Laketown, not ducking for cover, and meanwhile no one was calling for the town guard, and the elf guy continued not to shoot him with an elf arrow.\nYou see, the film slimer, er, maker, wanted this scene to be like a gunfight in an iconic Western, with Clint Eastwood and John Wayne staring at each other with narrowed eyes as each strides menacingly ever closer, spurs jangling with each step. Of course, in a Western, both are armed with revolvers, and both are wary of making the first move lest the other man prove fast enough to draw and shoot first, but then both shooters want to close the distance to improve their aim. That is what makes such scenes tense.\nHere was what makes a sense spectacularly NOT tense. One guy has a gun and the other had a knife, or a club, or maybe strangling wire or even a stick of butter, because no one gives a rat’s fart for what the other guy has because you can shoot him first.\nIf you have the weapon that, you know, shoots, you can shoot the guy who has no weapon that shoots, and so there is no downside to letting him see you go for your gun, or, for that matter, use a winch to load your crossbow in a leisurely manner, because you can raise it and turn him into a pincushion before he can attack you with his club or strangling wire. Or stick of butter.\nIn such a case, he will be running toward you at full speed, because if he walks a menacing walk, well, that give you time to roll a cigarette, light it, put your foot in the stirrup thingie on the crossbow, clamp it to your belt winch, and crank the string back, yawn, read a magazine, drop a bolt in the slot, check the grease on the bolt, aim, make vacation plans, check the wind speed, and fire a bolt through this heart and left lung and out his back in a three-dee spray of unnamed orcish life fluids.\nUnless you are superspeed acrobat the wonder elf, in which case you can shoot him nine times a second and spell out your monogram in his vital organs.\nWell, who cares? Neither character was in the book anyway. I think I lost consciousness overcome by the fumes of the butter-substitute substance coating the theater floor between the seats. I woke a little later, and elfboy still had not shot Urgslug the Irkisonic, or whatever his name is. My wife had to stuff a wide handful of popcorn flavored food substitute into my face, in order to smother the broken, wretched burbling — shoot him … with …  an elf arrow.\nI didn’t bother seeing the second and third movies in the Matrix trilogy. I didn’t bother seeing the second and third movies in the Star Wars prequel trilogy. And I don’t think I’ll bother seeing the second and third movies in The Hobbit, ah,\ntrilogy\neither.\nYou know it is bad when even hardcore Tolkien fans not only can’t be bothered to see it, but devoutly wish to avoid ever being forced to lay eyes upon it. A commenter named Rainforest Giant summarizes the problem, not only with Peter Jackson ruining The Hobbit, but with the entire edifice of Pink and Postmodern SF/F:\n“Jackson… ruins heroics because he cannot\nunderstand heroism.  He ruins a fairy tale because his world lacks the\ndeep magic.  His villains are straight out of Scooby Doo.  His special\neffects mere lights smoke and mirrors.  His understanding of war and\nconflict as meaningless as Xena or Buffy. Tolkien understood war, sacrifice, magic (as a storyteller and\nfather), heroes and villains, hope and despair.  Jackson lacks a deeper\nsoul thats why he writes bad fan fiction and cartoon action.”\nIt could have been even worse. At least the dwarves weren’t offering each other blow jobs because ground forces. Imagine if McRapey had chosen to rip off Tolkien instead of Heinlein, Dick, and Star Trek.\n“\nFamine for the spirit” and “a hog trough for the mind” is an exact description of the state of SF/F today.",
  "tags": [
    "movies"
  ],
  "categories": [],
  "sitemap_lastmod": "2014-02-15T18:00:00+00:00"
}