{
  "url": "https://voxday.net/2014/02/05/the-decline-of-grey-lady/",
  "scraped_at": "2025-12-15T16:45:33.751846",
  "title": "The decline of the Grey Lady",
  "date_display": "February 5, 2014",
  "date_iso": "2014-02-05T14:00:00+00:00",
  "date_from_url": "2014-02-05",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>This New York Observer article doesn’t tell us anything new. We all know <a href=\"http://observer.com/2014/02/the-tyranny-and-lethargy-of-the-times-editorial-page/\">the New York Times editorial page is terrible</a>. But it does help explain why:</p><blockquote class=\"tr_bq\"><p> IT’S WELL KNOWN AMONG THE SMALL WORLD of people who pay attention to such things that the liberal-leaning reporters at The Wall Street Journal resent the conservative-leaning editorial page of The Wall Street Journal. What’s less well known—and about to break into the open, threatening the very fabric of the institution—is how deeply the liberal-leaning reporters at The New York Times resent the liberal-leaning editorial page of The New York Times.</p><p>The New York Observer has learned over the course of interviews with more than two-dozen current and former Times staffers that the situation has “reached the boiling point” in the words of one current Times reporter….</p><p>“I think the editorials are viewed by most reporters as largely<br> irrelevant, and there’s not a lot of respect for the editorial page. The<br> editorials are dull, and that’s a cardinal sin. They aren’t getting any<br> less dull. As for the columnists, Friedman is the worst. He hasn’t had<br> an original thought in 20 years; he’s an embarrassment. He’s perceived<br> as an idiot who has been wrong about every major issue for 20 years,<br> from favoring the invasion of Iraq to the notion that green energy is<br> the most important topic in the world even as the financial markets were<br> imploding. Then there’s Maureen Dowd, who has been writing the same<br> column since George H. W. Bush was president.”</br></br></br></br></br></br></br></br></br></p><p>Yet another former <i>Times</i> writer concurred. “Andy [Rosenthal] is a wrecking<br> ball, a lot like his father but without the gravitas. What strikes me<br> about the editorial and op-ed pages is that they have become<br> relentlessly grim. With very few exceptions, there’s almost nothing<br> light-hearted or whimsical or sprightly about them, nothing to gladden<br> the soul.</br></br></br></br></br></p></blockquote><p>Of course, it probably doesn’t help that the paper has largely converted itself into one massive editorial page. A recent study showed that only one in six front page articles could be considered proper news, the rest were all editorials cloaked in a newsy disguise.</p><p>The thing is, newspapers are absolutely allergic to permitting anyone who isn’t a doctrinaire left-liberal get any exposure, so they sentence themselves to grim and tedious left-wing dogma. It is little surprise that even liberals tend to find it less than scintillating.</p></div>",
  "content_text": "This New York Observer article doesn’t tell us anything new. We all know\nthe New York Times editorial page is terrible\n. But it does help explain why:\nIT’S WELL KNOWN AMONG THE SMALL WORLD of people who pay attention to such things that the liberal-leaning reporters at The Wall Street Journal resent the conservative-leaning editorial page of The Wall Street Journal. What’s less well known—and about to break into the open, threatening the very fabric of the institution—is how deeply the liberal-leaning reporters at The New York Times resent the liberal-leaning editorial page of The New York Times.\nThe New York Observer has learned over the course of interviews with more than two-dozen current and former Times staffers that the situation has “reached the boiling point” in the words of one current Times reporter….\n“I think the editorials are viewed by most reporters as largely\nirrelevant, and there’s not a lot of respect for the editorial page. The\neditorials are dull, and that’s a cardinal sin. They aren’t getting any\nless dull. As for the columnists, Friedman is the worst. He hasn’t had\nan original thought in 20 years; he’s an embarrassment. He’s perceived\nas an idiot who has been wrong about every major issue for 20 years,\nfrom favoring the invasion of Iraq to the notion that green energy is\nthe most important topic in the world even as the financial markets were\nimploding. Then there’s Maureen Dowd, who has been writing the same\ncolumn since George H. W. Bush was president.”\nYet another former\nTimes\nwriter concurred. “Andy [Rosenthal] is a wrecking\nball, a lot like his father but without the gravitas. What strikes me\nabout the editorial and op-ed pages is that they have become\nrelentlessly grim. With very few exceptions, there’s almost nothing\nlight-hearted or whimsical or sprightly about them, nothing to gladden\nthe soul.\nOf course, it probably doesn’t help that the paper has largely converted itself into one massive editorial page. A recent study showed that only one in six front page articles could be considered proper news, the rest were all editorials cloaked in a newsy disguise.\nThe thing is, newspapers are absolutely allergic to permitting anyone who isn’t a doctrinaire left-liberal get any exposure, so they sentence themselves to grim and tedious left-wing dogma. It is little surprise that even liberals tend to find it less than scintillating.",
  "tags": [
    "media"
  ],
  "categories": [],
  "sitemap_lastmod": "2014-02-05T14:00:00+00:00"
}