{
  "url": "https://voxday.net/2014/02/07/the-end-of-multiculturalism-in-canada/",
  "scraped_at": "2025-12-15T16:45:43.724639",
  "title": "The end of multiculturalism in Canada",
  "date_display": "February 7, 2014",
  "date_iso": "2014-02-07T09:45:00+00:00",
  "date_from_url": "2014-02-07",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>George Jonas castigates the new type of Canadian immigrant: <a href=\"http://fullcomment.nationalpost.com/2014/02/06/george-jonas-multiculturalism-has-encouraged-a-new-type-of-immigrant-who-shares-our-wealth-but-not-our-values/\">the cultural invader</a>:</p><blockquote class=\"tr_bq\"><p> Canada, along with some other great immigrant societies, such as America or Australia, evolved into a coherent whole by welcoming new arrivals from the four corners of the Earth, offering them a chance to become a Canadian, American or Australian as they desired or managed to be, and then rewarding them according to how close they’ve come. In the process immigrants suffered casualties, but generally enriched the societies that enriched them, often within a single generation.</p><p>The assumption, unspoken but taken for granted until the 1960s, was that immigration was beneficial as long as it was designed to serve the interests of the host society first. The immigrant’s own interests would be served by the opportunity to eventually join the host society. For this to have any meaning, of course, the existence and desirability of a host nationality had to be taken for granted. If there had been no “Americans” or “Canadians,” there would have been nothing to join. Inherent in the American model of a “melting pot” as well as the fussier Canadian model of a “cultural mosaic” was the pre-existence of a nation to which the immigrant was applying to belong.</p><p>Until recent times, the West has been spoiled by the loyalty of immigrants, even from hostile regions or cultures…. It was in the past 40 years that the immigrant of dubious loyalty<br> emerged, followed by the disloyal native-born, sometimes of immigrant<br> ancestry, sometimes of Islamic conversion. The new immigrant seemed<br> ready to share the West’s wealth but not its values.</br></br></br></p><p>In many ways he<br> resembled an invader more than a settler or an asylum-seeker. Instead of<br> making efforts to assimilate, the invader demanded changes in the host<br> country’s culture. He called on society to accommodate his linguistic or<br> religious requirements. In 1985, a Sikh CNR railway worker refused to<br> exchange his turban for a regulation hard hat. This was innocuous<br> enough, but in 1991, less innocuously, a newly appointed Toronto police<br> board commissioner of Asian extraction declined to take the traditional<br> oath to the Queen.</br></br></br></br></br></br></br></br></p></blockquote><p>Those who uphold the values of the traditional West should not despair. The Ummayids who immigrated to Spain and imported their cultural values there were eventually expelled after 781 years of Reconquista. The West will win here too, but not until a sufficient number of Westerners realize that there will be no peace and their way of life cannot survive until the immigrants are returned home to their native lands.</p><p>Consider how small, in comparison to the present number of invaders, the earlier immigration was. And notice that the people invaded at the time also did not realize it was an invasion that was taking place around them:<br> <i><br/></i><br> <i>In 711 a raiding force from North Africa approximately 1,700-strong led by Tariq Ibn Ziyad landed south of present-day Spain. Ibn Abd-el-Hakem reports, one and a half centuries later, that “the people of Andalus did not observe them, thinking that the vessels crossing and recrossing were similar to the trading vessels which for their benefit plied backwards and forwards.”  Tariq’s forces were thence reinforced by those of his superior, the wali Musa ibn Nusair, and both went on to take control of most of Iberia with an army estimated at approximately 10,000–15,000 combatants.</i></br></br></p></div>",
  "content_text": "George Jonas castigates the new type of Canadian immigrant:\nthe cultural invader\n:\nCanada, along with some other great immigrant societies, such as America or Australia, evolved into a coherent whole by welcoming new arrivals from the four corners of the Earth, offering them a chance to become a Canadian, American or Australian as they desired or managed to be, and then rewarding them according to how close they’ve come. In the process immigrants suffered casualties, but generally enriched the societies that enriched them, often within a single generation.\nThe assumption, unspoken but taken for granted until the 1960s, was that immigration was beneficial as long as it was designed to serve the interests of the host society first. The immigrant’s own interests would be served by the opportunity to eventually join the host society. For this to have any meaning, of course, the existence and desirability of a host nationality had to be taken for granted. If there had been no “Americans” or “Canadians,” there would have been nothing to join. Inherent in the American model of a “melting pot” as well as the fussier Canadian model of a “cultural mosaic” was the pre-existence of a nation to which the immigrant was applying to belong.\nUntil recent times, the West has been spoiled by the loyalty of immigrants, even from hostile regions or cultures…. It was in the past 40 years that the immigrant of dubious loyalty\nemerged, followed by the disloyal native-born, sometimes of immigrant\nancestry, sometimes of Islamic conversion. The new immigrant seemed\nready to share the West’s wealth but not its values.\nIn many ways he\nresembled an invader more than a settler or an asylum-seeker. Instead of\nmaking efforts to assimilate, the invader demanded changes in the host\ncountry’s culture. He called on society to accommodate his linguistic or\nreligious requirements. In 1985, a Sikh CNR railway worker refused to\nexchange his turban for a regulation hard hat. This was innocuous\nenough, but in 1991, less innocuously, a newly appointed Toronto police\nboard commissioner of Asian extraction declined to take the traditional\noath to the Queen.\nThose who uphold the values of the traditional West should not despair. The Ummayids who immigrated to Spain and imported their cultural values there were eventually expelled after 781 years of Reconquista. The West will win here too, but not until a sufficient number of Westerners realize that there will be no peace and their way of life cannot survive until the immigrants are returned home to their native lands.\nConsider how small, in comparison to the present number of invaders, the earlier immigration was. And notice that the people invaded at the time also did not realize it was an invasion that was taking place around them:\nIn 711 a raiding force from North Africa approximately 1,700-strong led by Tariq Ibn Ziyad landed south of present-day Spain. Ibn Abd-el-Hakem reports, one and a half centuries later, that “the people of Andalus did not observe them, thinking that the vessels crossing and recrossing were similar to the trading vessels which for their benefit plied backwards and forwards.”  Tariq’s forces were thence reinforced by those of his superior, the wali Musa ibn Nusair, and both went on to take control of most of Iberia with an army estimated at approximately 10,000–15,000 combatants.",
  "tags": [
    "immigration"
  ],
  "categories": [],
  "sitemap_lastmod": "2014-02-07T09:45:00+00:00"
}