{
  "url": "https://voxday.net/2014/02/23/the-virulent-circle/",
  "scraped_at": "2025-12-15T16:47:16.465647",
  "title": "The virulent circle",
  "date_display": "February 23, 2014",
  "date_iso": "2014-02-23T14:00:00+00:00",
  "date_from_url": "2014-02-23",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>I find it modestly amusing how the only thing that the two sides of the low-grade civil war between the SFWA Old Guard and the Insect Army can agree upon is that I am simply beyond the pale.<br> <i><br/></i><br> <i>“That’s right! I am dangerous, Ice… man!”</i></br></br></p><p>Although it’s also amusing how a few of them seem to think that they should be able to discuss how terrible I am without me, you know, letting any of you know about it. Apparently they also think the MORE THAN ~50,000 DAILY READERS here are crackpots and hatey-hatey haters. Shame on all of you! From SFF.net, which I will remind you is the considerably more rational side of the two that are involved.</p><blockquote class=\"tr_bq\"><p> YOU ARE HEREBY WARNED  This is a hate site. They hate EVERYONE. Also the abode of crackpots.<br> – Lois Tilton (providing link to VP)</br></p><p>No one has to seek such things out. If we knew exactly why he was kicked out of SFWA, then we need never think of him again. But we don’t.<br> – Jerry Pournelle</br></p><p>I was pointing out that Beale is predictably taking advantage of the current flapping over the Truesdale matter to do more flapping of his own, on his own blog.  <br> – Lois Tilton</br></p><p>Vox Day is, of course, a perfect rendition of the Cory Doctorow prescription of writerly success. Welcome to the Promised Land.<br> – William Barton</br></p><p>As he will tell you.<br> – Lois Tilton</br></p><p>As far as I know, the only thing Beale has to do with the current flap is that he signed the petition at some point and his name was removed before it went public.  Beale commented on that on his blog.<br> – Steven Silver</br></p><p>I seriously doubt that. I saw an early draft of the petition and his name wasn’t there.  Dave would not be that dumb; it would have poisoned the whole effort. I wouldn’t take anything Beale says as accurate.<br> – Chuck Rothman</br></p><p>If Truesdale, a non-member, can present such a petition, Beale, a non-member, should be able to sign it. Removing someone’s name from a petition because one thinks they are an asshat is prima facie evidence that one is, onceself, an asshat. Maybe SFWA can chip in and buy an “UNCLEAN” sign for Beale to wear around his neck? SFWA’s not the fucking Pope. <br> – William Barton</br></p><p>Regarding Beale I have yet to see either charge or specification, apparently because even the mention of what he did to merit expulsion would be actionable or something of the sort.  I probably misunderstand, but apparently the Board can act as a Court of Star Chamber and doesn’t need charges and specifications.  I can’t say I find that reassuring.<br> – Jerry Pournelle</br></p></blockquote><p>Well, Mr. Rothman, Dave was precisely that dumb. It was also downright hilarious to see one member pointing out that Steven Gould’s actions have proved that I was “was the only possible choice for president who might have made me write a dues check this year.”</p><p>Anyhow, I sent Mr. Pournelle a copy of the SFWA report as well as my response to it. I have no idea what he will make of it, but at least he will be left in ignorance no longer.</p><p>As Lois Tilton has surmised, I don’t mind any of this. I have the impression that running a publishing house will permit me to have considerably more impact on the field of science fiction and fantasy than serving as president of SFWA would have. About which more tomorrow. And as it happens, many of the things I would have implemented inside the organization are equally implementable from the outside. About which more anon.</p></div>",
  "content_text": "I find it modestly amusing how the only thing that the two sides of the low-grade civil war between the SFWA Old Guard and the Insect Army can agree upon is that I am simply beyond the pale.\n“That’s right! I am dangerous, Ice… man!”\nAlthough it’s also amusing how a few of them seem to think that they should be able to discuss how terrible I am without me, you know, letting any of you know about it. Apparently they also think the MORE THAN ~50,000 DAILY READERS here are crackpots and hatey-hatey haters. Shame on all of you! From SFF.net, which I will remind you is the considerably more rational side of the two that are involved.\nYOU ARE HEREBY WARNED  This is a hate site. They hate EVERYONE. Also the abode of crackpots.\n– Lois Tilton (providing link to VP)\nNo one has to seek such things out. If we knew exactly why he was kicked out of SFWA, then we need never think of him again. But we don’t.\n– Jerry Pournelle\nI was pointing out that Beale is predictably taking advantage of the current flapping over the Truesdale matter to do more flapping of his own, on his own blog.\n– Lois Tilton\nVox Day is, of course, a perfect rendition of the Cory Doctorow prescription of writerly success. Welcome to the Promised Land.\n– William Barton\nAs he will tell you.\n– Lois Tilton\nAs far as I know, the only thing Beale has to do with the current flap is that he signed the petition at some point and his name was removed before it went public.  Beale commented on that on his blog.\n– Steven Silver\nI seriously doubt that. I saw an early draft of the petition and his name wasn’t there.  Dave would not be that dumb; it would have poisoned the whole effort. I wouldn’t take anything Beale says as accurate.\n– Chuck Rothman\nIf Truesdale, a non-member, can present such a petition, Beale, a non-member, should be able to sign it. Removing someone’s name from a petition because one thinks they are an asshat is prima facie evidence that one is, onceself, an asshat. Maybe SFWA can chip in and buy an “UNCLEAN” sign for Beale to wear around his neck? SFWA’s not the fucking Pope.\n– William Barton\nRegarding Beale I have yet to see either charge or specification, apparently because even the mention of what he did to merit expulsion would be actionable or something of the sort.  I probably misunderstand, but apparently the Board can act as a Court of Star Chamber and doesn’t need charges and specifications.  I can’t say I find that reassuring.\n– Jerry Pournelle\nWell, Mr. Rothman, Dave was precisely that dumb. It was also downright hilarious to see one member pointing out that Steven Gould’s actions have proved that I was “was the only possible choice for president who might have made me write a dues check this year.”\nAnyhow, I sent Mr. Pournelle a copy of the SFWA report as well as my response to it. I have no idea what he will make of it, but at least he will be left in ignorance no longer.\nAs Lois Tilton has surmised, I don’t mind any of this. I have the impression that running a publishing house will permit me to have considerably more impact on the field of science fiction and fantasy than serving as president of SFWA would have. About which more tomorrow. And as it happens, many of the things I would have implemented inside the organization are equally implementable from the outside. About which more anon.",
  "tags": [
    "SFWA"
  ],
  "categories": [],
  "sitemap_lastmod": "2014-02-23T14:00:00+00:00"
}