{
  "url": "https://voxday.net/2014/02/18/tilting-level-playing-field/",
  "scraped_at": "2025-12-15T16:46:47.135769",
  "title": "Tilting the level playing field",
  "date_display": "February 18, 2014",
  "date_iso": "2014-02-18T09:47:00+00:00",
  "date_from_url": "2014-02-18",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>The mainstream media’s attempts to ignore, belittle, and compete with the independent media has failed, so now they are desperately trying to appeal to anyone, from the government to Google, <a href=\"http://thefederalist.com/2014/02/17/the-new-contras-understanding-the-lefts-grip-on-media/\">who will stack the odds in their favor</a>:</p><blockquote class=\"tr_bq\"><p> Who, for example, could object to a paper that opens with something as reasonable as:</p><p><i>“At a time of extraordinary domestic and international policy challenges, Americans need high-quality news. Readers and viewers must decipher the policy options that the country faces and the manner in which various decisions affect them personally. It often is not readily apparent how to assess complicated policy choices and what the best steps are for moving forward.”</i></p><p>You know you are wading into difficult waters, however, when in the very next paragraph West and Stone quote warnings about the perils of the present political polarization from Brookings’ Thomas Mann and the American Enterprise Institute’s Norm Ornstein. AEI is indeed a conservative think tank, and a jewel of one at that, but any idea that coupling these two scholars from AEI and Brookings produces a balanced analysis should go out the window. Ornstein is AEI’s resident liberal and about as representative of the scholarship at AEI as I am of the Harlem Globetrotters. Mann and Ornstein are themselves very partisan players who would like nothing better than to go back to the old days when Tip O’Neill got the better of Bob Michel in the House of Representatives; they blame all of Congress’s dysfunctions on the Republicans, especially the Tea Party branch. So when West and Stone blame the role the news media are currently playing in the polarization that Mann and Ornstein decry there is more than just the sound of academic “tsk, tsking”—there’s also a slight whiff of “here’s hoping that we could set this darn clock back.”</p><p>In fact, attempts to do just that permeate the entire paper and its recommendations. West and Stone even chide the practice of pairing conservatives and liberals on TV to comment on issues, which they say results in “polarization of discourse and ‘false equivalence’ in reporting.” Getting both views means there is a lack of “nuanced analysis,” which “confuses viewers,” they write. As with all liberal grousing, there is also throughout the paper the suspicion that the average American is not capable of filtering the news by himself. Another passage reads, “the average reader’s ability to critically judge this new presentation of digital data is still developing and is lagging behind the ubiquity of interactives and infographics on the web.”</p><p>So journalists should lead the average American reader out of his torpor by linking to thoughtful commentary that give the context the reader needs, just like in the old days. And who might be good examples of such much-needed context-givers? West and Stone observe that “Platforms such as the Washington Post’s Wonkblog and Andrew Sullivan’s “The Dish” provide daily developments in policy news for those seeking to understand the intricacies of complex issues.” And, no it doesn’t end there. They also recommend Democracy Now!, which they describe as “a daily, independent program operated by journalists Amy Goodman and Juan Gonzalez. It runs stories that have ‘people and perspectives rarely heard in the U.S. corporate-sponsored media.’ Among the individuals it features include grassroots leaders, peace activists, academics, and independent analysts. The program regularly hosts substantive debates designed to improve public understanding of major issues.”</p><p>Both Sullivan and Klein are uniformly liberal in all issues and supportive of Barack Obama’s agenda. They are also, however, deep-thinking innovators who explain things thoroughly in their respective sites, even if from their perspectives. Not so for Goodman and Gonzalez, who can only be described as neo-Marxist apologists for Chavez, Castro and the Sandinistas.</p><p>We can only be thankful that West and Stone revealed their weakness for Goodman and Gonzalez for it alerts the discriminating reader to be on the lookout for danger to come, and it doesn’t take long to materialize. Buried beneath moderate-sounding verbiage there is nothing less than a call for neutering the citizen journalist through mass editing (crowd sourcing) and for making it harder for average web searchers to find ideas that do not conform to the accepted wisdom. “Citizens without journalistic training may be more likely to report inaccuracies or file misreports,” they write. “Because they are reporting of their own volition, it is possible that they might have a specific agenda or bias. They may repeat false ideas reported elsewhere and help bad ideas go viral.” Combining the mass editing of crowdsourcing (“the virtues of collective reasoning,” as the authors put it) with citizen journalism, however, would be a way to hold these untrained journalists accountable.</p><p>Perhaps even more troubling is their proposal for dealing with diversity of views on the web. West and Stone quote New York Times managing editor Jill Abramson as opining that there is “a human craving for trustworthy information about the world we live in- information that is tested, investigated, sorted, checked again, analyzed, and presented in a cogent form. …. They seek judgment from someone they can trust, who can ferret out information, dig behind it, and make sense of it.” I think we all know what the managing editor of the Times thinks when she talks about sorting and analyzing news. So here’s what West and Stone propose:</p><p><i>“Search engines employ many criteria in their algorithms, but many of them are based on the popularity of particular information sources. Yet these algorithms lack the embedded ethics of human gatekeepers and editors. Articles or sources that generate a lot of eyeballs are thought to be more helpful than others which do not. This biases information prioritizing towards popularity as opposed to thoughtfulness, reasonableness, or diversity of perspectives. “Digital firms should be encouraged to add criteria to their search engines that highlight information quality as opposed to mere popularity. They could do this by adding weight to sites that are known for high-quality coverage or providing diverse points of view. This would allow those information sources to be ranked higher in search results and therefore help news consumers find those materials.</i>“</p><p>In other words, Google, Facebook et al should move up higher and promote the “high quality coverage” practiced by Abramson, Klein, Sullivan, Gonzalez and Goodman, and which would produce once again the type of politics that Ornstein and Mann find acceptable. Much lower down would be the muck-raking journalism of James O’Keefe and Breitbart, the opinions of Sean Hannity and Hugh Hewitt or pieces run by National Affairs or NRO. Sen. Cruz’s refusal to go along with higher spending, or Sen. Lee’s analysis of how our current welfare system keeps the poor poor would be about 20 clicks away, if anywhere at all.</p></blockquote><p>This is precisely why I have continued pointing out the behavior of the SFWA with regards to me and other SF/F writers who refuse to join the hive mind. The Left always attempts to eliminate its opposition, by hook or by crook, because it doesn’t believe in open and honest competition, but manipulation and con artistry. This isn’t a current phenomenon; John C. Wright writes eloquently about how the founder of SFWA and the Clarion Writer’s Workshop, Damon Knight, waged a long-running campaign against one of the original <a href=\"http://www.scifiwright.com/2013/02/the-big-three/\">Big Three of Science Fiction</a>, A.E. van Vogt, which succeeded to the point that most people today wrongly believe the Big Three were Asimov, Heinlein, and either Arthur C. Clarke or Ray Bradbury.</p><p>(As we see time and time again, the rabbit of little ability but a highly developed talent for social manipulation and bureaucracy hated his superior in intellect and accomplishment. Knight famously claimed van Vogt was: “not a giant as often maintained. He’s only a pygmy who has learned to operate an overgrown typewriter.” I found this informative because after reading Knight’s fiction about ten years ago, I’d wondered how he could possibly have ever been named an SFWA Grandmaster. It turns out it was an Appreciation Grandmastership; he was the Scalzi of his day and began his now-forgotten SF career as the writer of a fanzine called <i>Snide</i>.)</p><p>So, we see the phenomenon writ small in the SFWA. We see it writ large in the European Union. But what we see is the same fractal political phenomenon that is always and everywhere dedicated to reducing the limits of the freedom of human thought.</p></div>",
  "content_text": "The mainstream media’s attempts to ignore, belittle, and compete with the independent media has failed, so now they are desperately trying to appeal to anyone, from the government to Google,\nwho will stack the odds in their favor\n:\nWho, for example, could object to a paper that opens with something as reasonable as:\n“At a time of extraordinary domestic and international policy challenges, Americans need high-quality news. Readers and viewers must decipher the policy options that the country faces and the manner in which various decisions affect them personally. It often is not readily apparent how to assess complicated policy choices and what the best steps are for moving forward.”\nYou know you are wading into difficult waters, however, when in the very next paragraph West and Stone quote warnings about the perils of the present political polarization from Brookings’ Thomas Mann and the American Enterprise Institute’s Norm Ornstein. AEI is indeed a conservative think tank, and a jewel of one at that, but any idea that coupling these two scholars from AEI and Brookings produces a balanced analysis should go out the window. Ornstein is AEI’s resident liberal and about as representative of the scholarship at AEI as I am of the Harlem Globetrotters. Mann and Ornstein are themselves very partisan players who would like nothing better than to go back to the old days when Tip O’Neill got the better of Bob Michel in the House of Representatives; they blame all of Congress’s dysfunctions on the Republicans, especially the Tea Party branch. So when West and Stone blame the role the news media are currently playing in the polarization that Mann and Ornstein decry there is more than just the sound of academic “tsk, tsking”—there’s also a slight whiff of “here’s hoping that we could set this darn clock back.”\nIn fact, attempts to do just that permeate the entire paper and its recommendations. West and Stone even chide the practice of pairing conservatives and liberals on TV to comment on issues, which they say results in “polarization of discourse and ‘false equivalence’ in reporting.” Getting both views means there is a lack of “nuanced analysis,” which “confuses viewers,” they write. As with all liberal grousing, there is also throughout the paper the suspicion that the average American is not capable of filtering the news by himself. Another passage reads, “the average reader’s ability to critically judge this new presentation of digital data is still developing and is lagging behind the ubiquity of interactives and infographics on the web.”\nSo journalists should lead the average American reader out of his torpor by linking to thoughtful commentary that give the context the reader needs, just like in the old days. And who might be good examples of such much-needed context-givers? West and Stone observe that “Platforms such as the Washington Post’s Wonkblog and Andrew Sullivan’s “The Dish” provide daily developments in policy news for those seeking to understand the intricacies of complex issues.” And, no it doesn’t end there. They also recommend Democracy Now!, which they describe as “a daily, independent program operated by journalists Amy Goodman and Juan Gonzalez. It runs stories that have ‘people and perspectives rarely heard in the U.S. corporate-sponsored media.’ Among the individuals it features include grassroots leaders, peace activists, academics, and independent analysts. The program regularly hosts substantive debates designed to improve public understanding of major issues.”\nBoth Sullivan and Klein are uniformly liberal in all issues and supportive of Barack Obama’s agenda. They are also, however, deep-thinking innovators who explain things thoroughly in their respective sites, even if from their perspectives. Not so for Goodman and Gonzalez, who can only be described as neo-Marxist apologists for Chavez, Castro and the Sandinistas.\nWe can only be thankful that West and Stone revealed their weakness for Goodman and Gonzalez for it alerts the discriminating reader to be on the lookout for danger to come, and it doesn’t take long to materialize. Buried beneath moderate-sounding verbiage there is nothing less than a call for neutering the citizen journalist through mass editing (crowd sourcing) and for making it harder for average web searchers to find ideas that do not conform to the accepted wisdom. “Citizens without journalistic training may be more likely to report inaccuracies or file misreports,” they write. “Because they are reporting of their own volition, it is possible that they might have a specific agenda or bias. They may repeat false ideas reported elsewhere and help bad ideas go viral.” Combining the mass editing of crowdsourcing (“the virtues of collective reasoning,” as the authors put it) with citizen journalism, however, would be a way to hold these untrained journalists accountable.\nPerhaps even more troubling is their proposal for dealing with diversity of views on the web. West and Stone quote New York Times managing editor Jill Abramson as opining that there is “a human craving for trustworthy information about the world we live in- information that is tested, investigated, sorted, checked again, analyzed, and presented in a cogent form. …. They seek judgment from someone they can trust, who can ferret out information, dig behind it, and make sense of it.” I think we all know what the managing editor of the Times thinks when she talks about sorting and analyzing news. So here’s what West and Stone propose:\n“Search engines employ many criteria in their algorithms, but many of them are based on the popularity of particular information sources. Yet these algorithms lack the embedded ethics of human gatekeepers and editors. Articles or sources that generate a lot of eyeballs are thought to be more helpful than others which do not. This biases information prioritizing towards popularity as opposed to thoughtfulness, reasonableness, or diversity of perspectives. “Digital firms should be encouraged to add criteria to their search engines that highlight information quality as opposed to mere popularity. They could do this by adding weight to sites that are known for high-quality coverage or providing diverse points of view. This would allow those information sources to be ranked higher in search results and therefore help news consumers find those materials.\n“\nIn other words, Google, Facebook et al should move up higher and promote the “high quality coverage” practiced by Abramson, Klein, Sullivan, Gonzalez and Goodman, and which would produce once again the type of politics that Ornstein and Mann find acceptable. Much lower down would be the muck-raking journalism of James O’Keefe and Breitbart, the opinions of Sean Hannity and Hugh Hewitt or pieces run by National Affairs or NRO. Sen. Cruz’s refusal to go along with higher spending, or Sen. Lee’s analysis of how our current welfare system keeps the poor poor would be about 20 clicks away, if anywhere at all.\nThis is precisely why I have continued pointing out the behavior of the SFWA with regards to me and other SF/F writers who refuse to join the hive mind. The Left always attempts to eliminate its opposition, by hook or by crook, because it doesn’t believe in open and honest competition, but manipulation and con artistry. This isn’t a current phenomenon; John C. Wright writes eloquently about how the founder of SFWA and the Clarion Writer’s Workshop, Damon Knight, waged a long-running campaign against one of the original\nBig Three of Science Fiction\n, A.E. van Vogt, which succeeded to the point that most people today wrongly believe the Big Three were Asimov, Heinlein, and either Arthur C. Clarke or Ray Bradbury.\n(As we see time and time again, the rabbit of little ability but a highly developed talent for social manipulation and bureaucracy hated his superior in intellect and accomplishment. Knight famously claimed van Vogt was: “not a giant as often maintained. He’s only a pygmy who has learned to operate an overgrown typewriter.” I found this informative because after reading Knight’s fiction about ten years ago, I’d wondered how he could possibly have ever been named an SFWA Grandmaster. It turns out it was an Appreciation Grandmastership; he was the Scalzi of his day and began his now-forgotten SF career as the writer of a fanzine called\nSnide\n.)\nSo, we see the phenomenon writ small in the SFWA. We see it writ large in the European Union. But what we see is the same fractal political phenomenon that is always and everywhere dedicated to reducing the limits of the freedom of human thought.",
  "tags": [
    "media",
    "SFWA"
  ],
  "categories": [],
  "sitemap_lastmod": "2014-02-18T09:47:00+00:00"
}