{
  "url": "https://voxday.net/2014/02/16/trolls-are-psychos/",
  "scraped_at": "2025-12-15T16:46:34.676962",
  "title": "Trolls are psychos",
  "date_display": "February 16, 2014",
  "date_iso": "2014-02-16T09:49:00+00:00",
  "date_from_url": "2014-02-16",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>I’m sure it won’t come as a shock to anyone here to discover that scientists at the University of Manitoba have discovered that <a href=\"http://www.slate.com/articles/health_and_science/climate_desk/2014/02/internet_troll_personality_study_machiavellianism_narcissism_psychopathy.html\">trolls really are horrible people</a>. In fact, they are psychopathic and spend an inordinate amount of time on the Internet:</p><blockquote class=\"tr_bq\"><p> 5.6 percent of survey respondents actually specified that they enjoyed “trolling.” By contrast, 41.3 percent of Internet users were “non-commenters,” meaning they didn’t like engaging online at all. So trolls are, as has often been suspected, a minority of online commenters, and an even smaller minority of overall Internet users.</p><p>The researchers conducted multiple studies, using samples from Amazon’s Mechanical Turk but also of college students, to try to understand why the act of trolling seems to attract this type of personality. They even constructed their own survey instrument, which they dubbed the Global Assessment of Internet Trolling, or GAIT, containing the following items:</p><p><i>I have sent people to shock websites for the lulz.</i></p><p>I like to troll people in forums or the comments section of websites.</p><p>I enjoy griefing other players in multiplayer games.</p><p>The more beautiful and pure a thing is, the more satisfying it is to corrupt.</p><p>Yes, some people actually say they agree with such statements. And again, doing so was correlated with sadism in its various forms, with psychopathy, and with Machiavellianism. Overall, the authors found that the relationship between sadism and trolling was the strongest, and that indeed, sadists appear to troll because they find it pleasurable. “Both trolls and sadists feel sadistic glee at the distress of others,” they wrote. “Sadists just want to have fun … and the Internet is their playground!</p></blockquote><p>Anyhow, one need have no sympathy for psychos like <a href=\"http://jordan179.livejournal.com/240847.html\">Andrew Marston</a>, Hunt Stoddard, <a href=\"http://setiathome.berkeley.edu/view_profile.php?userid=895208\">Greg Tingey</a>, and Tad in his various identities. They are seeking attention and pleasure in the distress of others, which is why it is always a mistake to engage with them. That’s why I no longer bother to engage with them and simply ban them the moment it is obvious they have popped up again.</p><p>This also may explain why I am not inclined towards trolling. I test lower than the average on psychopathy, despite having other Dark Triad traits. And obviously I am not sadistic, since the only individual I take any pleasure in tormenting has repeatedly assured us that he actually enjoys the attention on the rare occasions that he notices it at all. It’s a real win-win situation.</p></div>",
  "content_text": "I’m sure it won’t come as a shock to anyone here to discover that scientists at the University of Manitoba have discovered that\ntrolls really are horrible people\n. In fact, they are psychopathic and spend an inordinate amount of time on the Internet:\n5.6 percent of survey respondents actually specified that they enjoyed “trolling.” By contrast, 41.3 percent of Internet users were “non-commenters,” meaning they didn’t like engaging online at all. So trolls are, as has often been suspected, a minority of online commenters, and an even smaller minority of overall Internet users.\nThe researchers conducted multiple studies, using samples from Amazon’s Mechanical Turk but also of college students, to try to understand why the act of trolling seems to attract this type of personality. They even constructed their own survey instrument, which they dubbed the Global Assessment of Internet Trolling, or GAIT, containing the following items:\nI have sent people to shock websites for the lulz.\nI like to troll people in forums or the comments section of websites.\nI enjoy griefing other players in multiplayer games.\nThe more beautiful and pure a thing is, the more satisfying it is to corrupt.\nYes, some people actually say they agree with such statements. And again, doing so was correlated with sadism in its various forms, with psychopathy, and with Machiavellianism. Overall, the authors found that the relationship between sadism and trolling was the strongest, and that indeed, sadists appear to troll because they find it pleasurable. “Both trolls and sadists feel sadistic glee at the distress of others,” they wrote. “Sadists just want to have fun … and the Internet is their playground!\nAnyhow, one need have no sympathy for psychos like\nAndrew Marston\n, Hunt Stoddard,\nGreg Tingey\n, and Tad in his various identities. They are seeking attention and pleasure in the distress of others, which is why it is always a mistake to engage with them. That’s why I no longer bother to engage with them and simply ban them the moment it is obvious they have popped up again.\nThis also may explain why I am not inclined towards trolling. I test lower than the average on psychopathy, despite having other Dark Triad traits. And obviously I am not sadistic, since the only individual I take any pleasure in tormenting has repeatedly assured us that he actually enjoys the attention on the rare occasions that he notices it at all. It’s a real win-win situation.",
  "tags": [
    "science",
    "Troll Ban"
  ],
  "categories": [],
  "sitemap_lastmod": "2014-02-16T09:49:00+00:00"
}