{
  "url": "https://voxday.net/2014/02/17/victimless-sex-trafficking/",
  "scraped_at": "2025-12-15T16:46:40.181753",
  "title": "Victimless sex-trafficking",
  "date_display": "February 17, 2014",
  "date_iso": "2014-02-17T09:32:00+00:00",
  "date_from_url": "2014-02-17",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>The reason all sane and responsible people don’t give a damn about this so-called “sex trafficking” is that the girls involved are, quite literally, asking for it. In fact, they’re not so much asking for it <a href=\"http://www.nytimes.com/2014/02/13/opinion/kristof-when-emily-was-sold-for-sex.html?hp&amp;rref=opinion\">as demanding it</a>:</p><blockquote class=\"tr_bq\"><p> A 2002 Justice Department study suggested that more than 1.6 million American juveniles run away or are kicked out of their home each year. Ernie Allen, a former president of the National Center for Missing and Exploited Children, has estimated that at least 100,000 kids are sexually trafficked each year in the United States.</p><p>Perhaps they aren’t a priority because they’re seen as asking for it, not as victims. This was Emily’s fourth time running away, and she seems to have voluntarily connected with a pimp. Based on text messages that her family intercepted, Emily was apparently used by a pimp to recruit one of her girlfriends — a common practice.</p><p>“Made about 15 or 16 hundred,” Emily boasted to her friend in one text. “Come make money with me I promise u gonna be good.”</p><p>So it’s true that no one was holding a gun to Emily’s head. Then again, she was 15, in a perilous business. And, in this case it turned out, having sex with a half-dozen men a day and handing over every penny to an armed pimp….</p><p>Maria is bitter that the police haven’t done more. She has been pleading for months for help, hounding the police — and now she finds that her daughter has been advertised in four states on multiple prostitution websites and no one seems to have checked or noticed.</p><p>“I feel very strongly that it was racism,” Maria says. In fact, the Boston police force is admired nationally for its three-detective unit that fights human trafficking. This is the gold standard, yet, even here, a missing 15-year-old girl seemed to slip through the cracks.</p></blockquote><p>If a girl is old enough to be permitted to make legal decisions about murdering her unborn child, then surely she is old enough to decide if she wants to sell her body for money. It’s not racism, it’s simple common sense to leave an idiotic young whore to suffer the obvious consequences of her decisions. What are the police supposed to do, waste time and resources bringing her back so that she can run away again? That’s ridiculous.</p><p>If the mother put half the effort into raising her daughter that she appears to have put into hounding the police to fix her maternal failures, perhaps her daughter wouldn’t have run away so many times. No doubt Mr. Kristoff’s bleeding heart is in the right place, but he<br> would do better to concentrate his efforts on saving those who want to<br> be saved, not those who not only revel in their moral squalor, but<br> attempt to infect others with it.</br></br></br></p><p>God abandons the human trash determined to go its own way and leaves it to its inevitable destruction. Man should follow his example.</p></div>",
  "content_text": "The reason all sane and responsible people don’t give a damn about this so-called “sex trafficking” is that the girls involved are, quite literally, asking for it. In fact, they’re not so much asking for it\nas demanding it\n:\nA 2002 Justice Department study suggested that more than 1.6 million American juveniles run away or are kicked out of their home each year. Ernie Allen, a former president of the National Center for Missing and Exploited Children, has estimated that at least 100,000 kids are sexually trafficked each year in the United States.\nPerhaps they aren’t a priority because they’re seen as asking for it, not as victims. This was Emily’s fourth time running away, and she seems to have voluntarily connected with a pimp. Based on text messages that her family intercepted, Emily was apparently used by a pimp to recruit one of her girlfriends — a common practice.\n“Made about 15 or 16 hundred,” Emily boasted to her friend in one text. “Come make money with me I promise u gonna be good.”\nSo it’s true that no one was holding a gun to Emily’s head. Then again, she was 15, in a perilous business. And, in this case it turned out, having sex with a half-dozen men a day and handing over every penny to an armed pimp….\nMaria is bitter that the police haven’t done more. She has been pleading for months for help, hounding the police — and now she finds that her daughter has been advertised in four states on multiple prostitution websites and no one seems to have checked or noticed.\n“I feel very strongly that it was racism,” Maria says. In fact, the Boston police force is admired nationally for its three-detective unit that fights human trafficking. This is the gold standard, yet, even here, a missing 15-year-old girl seemed to slip through the cracks.\nIf a girl is old enough to be permitted to make legal decisions about murdering her unborn child, then surely she is old enough to decide if she wants to sell her body for money. It’s not racism, it’s simple common sense to leave an idiotic young whore to suffer the obvious consequences of her decisions. What are the police supposed to do, waste time and resources bringing her back so that she can run away again? That’s ridiculous.\nIf the mother put half the effort into raising her daughter that she appears to have put into hounding the police to fix her maternal failures, perhaps her daughter wouldn’t have run away so many times. No doubt Mr. Kristoff’s bleeding heart is in the right place, but he\nwould do better to concentrate his efforts on saving those who want to\nbe saved, not those who not only revel in their moral squalor, but\nattempt to infect others with it.\nGod abandons the human trash determined to go its own way and leaves it to its inevitable destruction. Man should follow his example.",
  "tags": [
    "MPAI",
    "philosophy"
  ],
  "categories": [],
  "sitemap_lastmod": "2014-02-17T09:32:00+00:00"
}