{
  "url": "https://voxday.net/2014/02/28/wallpaper-no-2/",
  "scraped_at": "2025-12-15T16:47:44.755046",
  "title": "Wallpaper No. 2",
  "date_display": "February 28, 2014",
  "date_iso": "2014-02-28T14:00:00+00:00",
  "date_from_url": "2014-02-28",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><div class=\"separator\" style=\"clear: both; text-align: center;\"> <a href=\"http://www.voxday.net/mart/QM-TPM_wallpaper.jpg\" imageanchor=\"1\" style=\"clear: left; float: left; margin-bottom: 1em; margin-right: 1em;\"><img border=\"0\" decoding=\"async\" fetchpriority=\"high\" height=\"180\" src=\"http://www.milobookclub.com/wp-content/uploads/2014/02/QM-TPM_wallpaper.jpg\" width=\"320\"/></a></div><p>In honor of the publication of <a href=\"http://www.amazon.com/dp/B00ILU0RC2\"><b><i>QUANTUM MORTIS The Programmed Mind</i></b></a>, JartStar has produced a wallpaper showing ATSV <i>Draco </i>approaching Bonoplane and the stricken Shiva-class cruiser in orbit around the planet. To download the full 1920×1080 picture, right click on the image and select “Save As”.</p><p>The initial reviews have been positive. Some selections:</p><ul><li>Writing you a quick note to let you know how much I enjoyed <i>The<br> Programmed Mind</br></i>…. The misdirection was excellent.  I read a good deal of sci-fi and a ton<br> of mystery, and this is definitely among the top books I have read.</br></li><li>I thought I knew how it was going to end, and was pleased to find out I<br> was only 50 percent correct. Suffice it to say the twists were great.<br> Highly recommend this as a precursor to MCID Chief Warrant Officer<br> Graven Tower’s world.</br></br></br></li><li>Tight story telling.  Interesting well thought-out characters… and a<br> fascinating futuristic spy plot.  The book fleshes out the Quantum<br> Mortis world even more, and sets the stage for what appears to be a<br> galaxy-sized war.</br></br></br></li><li>This book differs in subgenre from the other two<br> installments currently making up the QM series; there is less explosive<br> action and a bit of a Tom Clancy feel as other reviewers have noted,<br> where the character and personalities of individual characters have a<br> direct effect on the events that unfold. I enjoyed it more than the<br> other two for that reason, though I recommend reading the entire Quantum<br> Mortis series.</br></br></br></br></br></br></li></ul><p>Also, I think this guy Tom might have written <a href=\"http://www.amazon.com/dp/B00IKT7HQI\">a book or something</a>. Some people seem to think it’s all right….</p><ul></ul><p></p></div>",
  "content_text": "In honor of the publication of\nQUANTUM MORTIS The Programmed Mind\n, JartStar has produced a wallpaper showing ATSV\nDraco\napproaching Bonoplane and the stricken Shiva-class cruiser in orbit around the planet. To download the full 1920×1080 picture, right click on the image and select “Save As”.\nThe initial reviews have been positive. Some selections:\nWriting you a quick note to let you know how much I enjoyed\nThe\nProgrammed Mind\n…. The misdirection was excellent.  I read a good deal of sci-fi and a ton\nof mystery, and this is definitely among the top books I have read.\nI thought I knew how it was going to end, and was pleased to find out I\nwas only 50 percent correct. Suffice it to say the twists were great.\nHighly recommend this as a precursor to MCID Chief Warrant Officer\nGraven Tower’s world.\nTight story telling.  Interesting well thought-out characters… and a\nfascinating futuristic spy plot.  The book fleshes out the Quantum\nMortis world even more, and sets the stage for what appears to be a\ngalaxy-sized war.\nThis book differs in subgenre from the other two\ninstallments currently making up the QM series; there is less explosive\naction and a bit of a Tom Clancy feel as other reviewers have noted,\nwhere the character and personalities of individual characters have a\ndirect effect on the events that unfold. I enjoyed it more than the\nother two for that reason, though I recommend reading the entire Quantum\nMortis series.\nAlso, I think this guy Tom might have written\na book or something\n. Some people seem to think it’s all right….",
  "tags": [
    "Quantum Mortis"
  ],
  "categories": [],
  "sitemap_lastmod": "2014-02-28T14:00:00+00:00"
}