{
  "url": "https://voxday.net/2014/02/20/women-ruin-everything-academic-edition/",
  "scraped_at": "2025-12-15T16:46:59.232554",
  "title": "Women Ruin Everything: Academic edition",
  "date_display": "February 20, 2014",
  "date_iso": "2014-02-20T14:00:00+00:00",
  "date_from_url": "2014-02-20",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p><a href=\"http://www.thecrimson.com/column/the-red-line/article/2014/2/18/academic-freedom-justice/?page=single#\">This open argument</a> in favor of abanoning the Doctrine of Academic Freedom in favor of a Doctrine of Academic Justice is an excellent example of why women were not allowed into the universities in the first place. This is why they were not permitted to vote. We ignore the great minds of the past at our peril, and we have no right to complain about having to suffer the obvious consequences of entirely predictable actions:</p><blockquote class=\"tr_bq\"><p> In its oft-cited Statement of Principles on Academic Freedom and Tenure, the American Association of University Professors declares that “Teachers are entitled to full freedom in research and in the publication of the results.” In principle, this policy seems sound: It would not do for academics to have their research restricted by the political whims of the moment.</p><p>Yet the liberal obsession with “academic freedom” seems a bit misplaced to me. After all, no one ever has “full freedom” in research and publication. Which research proposals receive funding and what papers are accepted for publication are always contingent on political priorities. The words used to articulate a research question can have implications for its outcome. No academic question is ever “free” from political realities. If our university community opposes racism, sexism, and heterosexism, why should we put up with research that counters our goals simply in the name of “academic freedom”?</p><p>Instead, I would like to propose a more rigorous standard: one of “academic justice.” When an academic community observes research promoting or justifying oppression, it should ensure that this research does not continue.</p><p>The power to enforce academic justice comes from students, faculty, and workers organizing together to make our universities look as we want them to do. Two years ago, when former summer school instructor Subramanian Swamy published hateful commentary about Muslims in India, the Harvard community organized to ensure that he would not return to teach on campus. I consider that sort of organizing both appropriate and commendable. Perhaps it should even be applied more broadly.</p></blockquote><p>Women are, and have always been, intrinsically fascist at heart. With a small minority of exceptions, they hate freedom and will always trade it for the promise of security, physical and emotional. The Fascists understood this. The medieval philosophers understood this. The Founding Fathers understood this. The West rejected the idea in favor of sexual equality and the myth of progress, and now the university has abandoned its centuries-old tradition of academic freedom.</p><p>Yes, there are exceptions. Yes, not all women are the same. Yes, there are brilliant and sensible women. But the salient point is that the price of female involvement is reliably too high across the board. How much more destruction can Western Civilization be expected to survive before women of sense are willing to admit that the price of female participation in matters of governance is too great? Do we really need to undergo the Great Collapse before the ancient truths can be accepted once more?</p><p><i>“The lesson, as always, is this: women ruin everything.”</i><br> – Bill Simmons</br></p></div>",
  "content_text": "This open argument\nin favor of abanoning the Doctrine of Academic Freedom in favor of a Doctrine of Academic Justice is an excellent example of why women were not allowed into the universities in the first place. This is why they were not permitted to vote. We ignore the great minds of the past at our peril, and we have no right to complain about having to suffer the obvious consequences of entirely predictable actions:\nIn its oft-cited Statement of Principles on Academic Freedom and Tenure, the American Association of University Professors declares that “Teachers are entitled to full freedom in research and in the publication of the results.” In principle, this policy seems sound: It would not do for academics to have their research restricted by the political whims of the moment.\nYet the liberal obsession with “academic freedom” seems a bit misplaced to me. After all, no one ever has “full freedom” in research and publication. Which research proposals receive funding and what papers are accepted for publication are always contingent on political priorities. The words used to articulate a research question can have implications for its outcome. No academic question is ever “free” from political realities. If our university community opposes racism, sexism, and heterosexism, why should we put up with research that counters our goals simply in the name of “academic freedom”?\nInstead, I would like to propose a more rigorous standard: one of “academic justice.” When an academic community observes research promoting or justifying oppression, it should ensure that this research does not continue.\nThe power to enforce academic justice comes from students, faculty, and workers organizing together to make our universities look as we want them to do. Two years ago, when former summer school instructor Subramanian Swamy published hateful commentary about Muslims in India, the Harvard community organized to ensure that he would not return to teach on campus. I consider that sort of organizing both appropriate and commendable. Perhaps it should even be applied more broadly.\nWomen are, and have always been, intrinsically fascist at heart. With a small minority of exceptions, they hate freedom and will always trade it for the promise of security, physical and emotional. The Fascists understood this. The medieval philosophers understood this. The Founding Fathers understood this. The West rejected the idea in favor of sexual equality and the myth of progress, and now the university has abandoned its centuries-old tradition of academic freedom.\nYes, there are exceptions. Yes, not all women are the same. Yes, there are brilliant and sensible women. But the salient point is that the price of female involvement is reliably too high across the board. How much more destruction can Western Civilization be expected to survive before women of sense are willing to admit that the price of female participation in matters of governance is too great? Do we really need to undergo the Great Collapse before the ancient truths can be accepted once more?\n“The lesson, as always, is this: women ruin everything.”\n– Bill Simmons",
  "tags": [
    "education",
    "women"
  ],
  "categories": [],
  "sitemap_lastmod": "2014-02-20T14:00:00+00:00"
}