{
  "url": "https://voxday.net/2008/06/26/answering-question/",
  "scraped_at": "2026-01-08T22:28:35.138595",
  "title": "Plagiarism or Two Great Minds?",
  "date_display": "June 26, 2008",
  "date_iso": "2008-06-26T21:55:00+00:00",
  "date_from_url": "2008-06-26",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>Brainbiter considers <a href=\"http://sophronismos.wordpress.com/2008/04/16/gray-day/#comments\">some suspicious similarities</a> between Gray and Day:</p><blockquote><p>I am not seeking to promote [British philosopher John] Gray’s point of view here, but rather to provoke questions about Vox Day’s point of view. On a particular range of subjects, Day seems almost to have cribbed from Gray. Since Day’s opinions on a wide range of subjects are, by his own admission, not expert opinions but merely intelligent observations, it is reasonable to assume that his similarities to Gray are due to having read Gray or being indebted to the same sources.</p></blockquote><p>Reasonable, but incorrect.  This is easy.  I’ve never heard of this British John Gray.  I don’t know him.  While I’ve been in London every so often, I’ve never heard him speak and I’ve never read anything that he’s written.  The only John Gray I’ve ever heard of is the “Mars/Venus” guy, but I haven’t read any of his stuff either.  That being said, he sounds incredibly brilliant!  I suggest that the reason for the similarities between our conclusions about the New Atheists probably rests heavily on the fact that those conclusions are completely freaking obvious to anyone who has read the New Atheist literature, possesses a reasonable knowledge of history, is sufficiently observant, and is capable of logical analysis.</p><p>It’s kind of funny.  On the one hand, atheists like to assert that I’m crazy, I’m incredibly stupid, and have no idea what I’m talking about.  Then, on the other, they leap hungrily at the suggestion that I must be PLAGIARIZING from a well-respected academic philosopher.  Now, how those two things add up?  But then, as I chronicled so copiously in <i>The Irrational Atheist</i>, logic is not exactly  a strong point for most of these fellows.</p><p>UPDATE – In a different post, Brainbiter <a href=\"http://sophronismos.wordpress.com/2008/03/18/the-irrational-atheist-part-3/\">managed to crack me up</a>.  While his first surmise is true, I suppose some might consider the latter to be equally relevant. <i>“It could be that the atheists in question don’t go into the detailed reasons for their anxiety….  However, it is also possible that Vox is just too arrogant to bother.”</i></p><p>Well, kind of.  Had they given any coherent reasons, I would have attacked them.  But they didn’t, probably because they’re groundless.</p></div>",
  "content_text": "Brainbiter considers\nsome suspicious similarities\nbetween Gray and Day:\nI am not seeking to promote [British philosopher John] Gray’s point of view here, but rather to provoke questions about Vox Day’s point of view. On a particular range of subjects, Day seems almost to have cribbed from Gray. Since Day’s opinions on a wide range of subjects are, by his own admission, not expert opinions but merely intelligent observations, it is reasonable to assume that his similarities to Gray are due to having read Gray or being indebted to the same sources.\nReasonable, but incorrect.  This is easy.  I’ve never heard of this British John Gray.  I don’t know him.  While I’ve been in London every so often, I’ve never heard him speak and I’ve never read anything that he’s written.  The only John Gray I’ve ever heard of is the “Mars/Venus” guy, but I haven’t read any of his stuff either.  That being said, he sounds incredibly brilliant!  I suggest that the reason for the similarities between our conclusions about the New Atheists probably rests heavily on the fact that those conclusions are completely freaking obvious to anyone who has read the New Atheist literature, possesses a reasonable knowledge of history, is sufficiently observant, and is capable of logical analysis.\nIt’s kind of funny.  On the one hand, atheists like to assert that I’m crazy, I’m incredibly stupid, and have no idea what I’m talking about.  Then, on the other, they leap hungrily at the suggestion that I must be PLAGIARIZING from a well-respected academic philosopher.  Now, how those two things add up?  But then, as I chronicled so copiously in\nThe Irrational Atheist\n, logic is not exactly  a strong point for most of these fellows.\nUPDATE – In a different post, Brainbiter\nmanaged to crack me up\n.  While his first surmise is true, I suppose some might consider the latter to be equally relevant.\n“It could be that the atheists in question don’t go into the detailed reasons for their anxiety….  However, it is also possible that Vox is just too arrogant to bother.”\nWell, kind of.  Had they given any coherent reasons, I would have attacked them.  But they didn’t, probably because they’re groundless.",
  "tags": [],
  "categories": [],
  "sitemap_lastmod": "2008-06-26T20:55:00+00:00"
}