{
  "url": "https://voxday.net/2008/06/26/bugs-dogs-and-man/",
  "scraped_at": "2026-01-08T22:28:26.031261",
  "title": "Bugs, dogs, and the man",
  "date_display": "June 26, 2008",
  "date_iso": "2008-06-26T08:19:00+00:00",
  "date_from_url": "2008-06-26",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>Rachel has an amusing story <a href=\"http://rachellucas.com/index.php/2008/06/25/backyard-execution/\">about her reaction</a> to discovering that one of her precious pups is a carnivore.  But even the most civilized dog is a killer at heart; you can’t get much more effete than my Viszla and yet he is pure death on squirrels.  When he was younger and we’d go running around the lake, he’d suddenly dash to the side and hit a squirrel without breaking stride.  I always called him off, however, so he learned to make that one free strike count.  Once, however, we ran right through a line of ducklings and he must have been more curious than lethally inclined, because when I ordered him to “Drop” it, he spat the little fuzzball out and it staggered off towards the mama duck, apparently no worse for wear.</p><p>I don’t quite understand the fear of spiders and such expressed by both men and women in the comments to her post, though.  It’s not as if I like spiders or anything, but I find it amusing, to be honest, when I answer the call to arms and see Spacebunny pointing silently and accusatorily at an arachnid hanging out on the ceiling or wall.  Two nights ago, I was typing away in the darkness when I felt something crawl over my fingers and saw a flash of movement in the light of the screen; I was pretty sure it was a spider.  Sure enough, when I reached over to turn on the light, there was a decent-sized one standing just to the left of the laptop.  I’m not sure if I felt more annoyed or disgusted, either way, I made a fist and crushed it, then went for a paper towel to clean up the mess.  Mankind 1, Arachnids 0.  Don’t interrupt me when I’m writing.</p><p>That being said, I doubt I ever moved faster than when I felt something crawling over my shoulder one night just as Spacebunny said “Did you feel something?”  She went one way, I went the other, and if there was an Olympic event for “getting out of bed and turning on the light”, we would have tied for the gold.</p></div>",
  "content_text": "Rachel has an amusing story\nabout her reaction\nto discovering that one of her precious pups is a carnivore.  But even the most civilized dog is a killer at heart; you can’t get much more effete than my Viszla and yet he is pure death on squirrels.  When he was younger and we’d go running around the lake, he’d suddenly dash to the side and hit a squirrel without breaking stride.  I always called him off, however, so he learned to make that one free strike count.  Once, however, we ran right through a line of ducklings and he must have been more curious than lethally inclined, because when I ordered him to “Drop” it, he spat the little fuzzball out and it staggered off towards the mama duck, apparently no worse for wear.\nI don’t quite understand the fear of spiders and such expressed by both men and women in the comments to her post, though.  It’s not as if I like spiders or anything, but I find it amusing, to be honest, when I answer the call to arms and see Spacebunny pointing silently and accusatorily at an arachnid hanging out on the ceiling or wall.  Two nights ago, I was typing away in the darkness when I felt something crawl over my fingers and saw a flash of movement in the light of the screen; I was pretty sure it was a spider.  Sure enough, when I reached over to turn on the light, there was a decent-sized one standing just to the left of the laptop.  I’m not sure if I felt more annoyed or disgusted, either way, I made a fist and crushed it, then went for a paper towel to clean up the mess.  Mankind 1, Arachnids 0.  Don’t interrupt me when I’m writing.\nThat being said, I doubt I ever moved faster than when I felt something crawling over my shoulder one night just as Spacebunny said “Did you feel something?”  She went one way, I went the other, and if there was an Olympic event for “getting out of bed and turning on the light”, we would have tied for the gold.",
  "tags": [],
  "categories": [],
  "sitemap_lastmod": "2008-06-26T07:19:00+00:00"
}