{
  "url": "https://voxday.net/2008/06/09/challenge-to-pz-myers/",
  "scraped_at": "2026-01-08T22:26:40.853482",
  "title": "An invitation to PZ Myers",
  "date_display": "June 9, 2008",
  "date_iso": "2008-06-09T07:26:00+00:00",
  "date_from_url": "2008-06-09",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>Dear Dr. Myers,</p><p>You recently complained that <a href=\"http://scienceblogs.com/pharyngula/2008/06/another_blithering_apologist.php#comments\">you’ve never found any intelligent arguments for gods</a> and said the reason you only addressed the weak arguments was because you were unaware of the strong ones.  Happily, not only did I hear this intellectual <i>cri de coeur</i>, but so did the good hosts of the Northern Alliance Radio Show in your home state of Minnesota.</p><p>So, no doubt you will be delighted to hear that they have invited the two of us to debate the existence of gods on their show this coming Saturday.  It is my contention that there is not only substantial evidence for the existence of gods, but that the logic for the existence of gods is superior to the logic for the nonexistence of them as presented by yourself, Richard Dawkins, Sam Harris, and Daniel Dennett, to name a few.</p><p>I have accepted the invitation to the show and I hope you will soon do likewise.  You can let them know if you intend to show up and defend your side or not by emailing The Elder at rightwinger23 at hotmail.com.</p><p>With regards,<br>Vox</br></p><p><i>Since Dr. Myers does not always make a habit of reading this blog, <a href=\"http://scienceblogs.com/pharyngula/2008/06/i_cant_say_that_ive_listened_t.php\">I posted NARN’s invitation on his blog</a> as well, in addition to emailing him.</i></p><p><b>Update – PZ reveals himself to be nothing but another atheist coward:</b></p><blockquote><p>Wait — I complain about the absence of intelligent arguments for God, and Vox Day pops up his little pin head and squeaks about miracles and bleeding statues and liquefying holy relics?  Vox, you don’t qualify. You’re a pathetic little twerp with delusions of grandeur.</p></blockquote><p>Typical atheist.  He beats his chest and then runs away scared as soon as anyone calls him out.  He’s obviously afraid that he’ll get exposed and then won’t be able to play the big bad atheist hero of science anymore.  You have to love atheist illogic… just when did I say anything about miracles, statues or relics anyhow?  Run away, little professor, run away….</p></div>",
  "content_text": "Dear Dr. Myers,\nYou recently complained that\nyou’ve never found any intelligent arguments for gods\nand said the reason you only addressed the weak arguments was because you were unaware of the strong ones.  Happily, not only did I hear this intellectual\ncri de coeur\n, but so did the good hosts of the Northern Alliance Radio Show in your home state of Minnesota.\nSo, no doubt you will be delighted to hear that they have invited the two of us to debate the existence of gods on their show this coming Saturday.  It is my contention that there is not only substantial evidence for the existence of gods, but that the logic for the existence of gods is superior to the logic for the nonexistence of them as presented by yourself, Richard Dawkins, Sam Harris, and Daniel Dennett, to name a few.\nI have accepted the invitation to the show and I hope you will soon do likewise.  You can let them know if you intend to show up and defend your side or not by emailing The Elder at rightwinger23 at hotmail.com.\nWith regards,\nVox\nSince Dr. Myers does not always make a habit of reading this blog,\nI posted NARN’s invitation on his blog\nas well, in addition to emailing him.\nUpdate – PZ reveals himself to be nothing but another atheist coward:\nWait — I complain about the absence of intelligent arguments for God, and Vox Day pops up his little pin head and squeaks about miracles and bleeding statues and liquefying holy relics?  Vox, you don’t qualify. You’re a pathetic little twerp with delusions of grandeur.\nTypical atheist.  He beats his chest and then runs away scared as soon as anyone calls him out.  He’s obviously afraid that he’ll get exposed and then won’t be able to play the big bad atheist hero of science anymore.  You have to love atheist illogic… just when did I say anything about miracles, statues or relics anyhow?  Run away, little professor, run away….",
  "tags": [],
  "categories": [],
  "sitemap_lastmod": "2008-06-09T06:26:00+00:00"
}