{
  "url": "https://voxday.net/2008/06/10/charles-stross-interview/",
  "scraped_at": "2026-01-08T22:26:50.057917",
  "title": "Charles Stross interview",
  "date_display": "June 10, 2008",
  "date_iso": "2008-06-10T13:18:00+00:00",
  "date_from_url": "2008-06-10",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>The SF maestro speaks <a href=\"http://books.guardian.co.uk/departments/sciencefiction/story/0,,2284587,00.html\">on science and fiction</a>:</p><blockquote><p>“I think that if there’s one key insight science can bring to fiction,” he says, “it’s that fiction – the study of the human condition – needs to broaden its definition of the human condition. Because the human condition isn’t immutable and doomed to remain uniform forever. If it was, we’d still be living in caves rather than worrying about global climate change. To the extent that writers of mainstream literary fiction focus on the interior landscape exclusively, they’re wilfully ignoring processes and events that have a major impact on our lives. And I think that’s an unforgivably short-sighted position to take.”</p></blockquote><p>I don’t think he’s wrong… although I think the science fiction world has an awful lot that it needs to learn from mainstream fiction, especially the mainstream fiction of the past.  As I wrote a few years ago in <a href=\"http://www.milobookclub.com/2005/11/28/cs-lewis-and-problem-of-religion-in/\">my essay that appeared in the <i>Revisiting Narnia</i> anthology</a>, the foolish suppression and mischaracterization of religion in so much fantasy and science fiction has significantly crippled the genre by limiting it to cartoonish caricatures of the human condition.  Mary Eberstadt points out that it appears to be a problem that <a href=\"http://article.nationalreview.com/?q=MzJjODVkOWNlYTMyMDYzYmZjYTkyZGM4MzIxNjY3ZDc=\">has a deleterious effect on all the arts</a> these days.</p><p>As for Stross’s work, while I loved <i>Accelerando</i> and enjoyed <i>Halting State</i>, I like his Bob Howard novels best of all.  If you have any appreciation for things squamous or rugose and haven’t read <i>The Atrocity Archives</i> or <i>The Jennifer Morgue</i>, you’re really missing out.</p></div>",
  "content_text": "The SF maestro speaks\non science and fiction\n:\n“I think that if there’s one key insight science can bring to fiction,” he says, “it’s that fiction – the study of the human condition – needs to broaden its definition of the human condition. Because the human condition isn’t immutable and doomed to remain uniform forever. If it was, we’d still be living in caves rather than worrying about global climate change. To the extent that writers of mainstream literary fiction focus on the interior landscape exclusively, they’re wilfully ignoring processes and events that have a major impact on our lives. And I think that’s an unforgivably short-sighted position to take.”\nI don’t think he’s wrong… although I think the science fiction world has an awful lot that it needs to learn from mainstream fiction, especially the mainstream fiction of the past.  As I wrote a few years ago in\nmy essay that appeared in the\nRevisiting Narnia\nanthology\n, the foolish suppression and mischaracterization of religion in so much fantasy and science fiction has significantly crippled the genre by limiting it to cartoonish caricatures of the human condition.  Mary Eberstadt points out that it appears to be a problem that\nhas a deleterious effect on all the arts\nthese days.\nAs for Stross’s work, while I loved\nAccelerando\nand enjoyed\nHalting State\n, I like his Bob Howard novels best of all.  If you have any appreciation for things squamous or rugose and haven’t read\nThe Atrocity Archives\nor\nThe Jennifer Morgue\n, you’re really missing out.",
  "tags": [],
  "categories": [],
  "sitemap_lastmod": "2008-06-10T12:18:00+00:00"
}