{
  "url": "https://voxday.net/2008/06/09/cowardly-atheis/",
  "scraped_at": "2026-01-08T22:26:46.386365",
  "title": "The cowardly atheist",
  "date_display": "June 9, 2008",
  "date_iso": "2008-06-09T21:50:00+00:00",
  "date_from_url": "2008-06-09",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>PZ explains why he hasn’t ever encountered any strong arguments for the existence of gods… it’s hard to listen <a href=\"http://scienceblogs.com/pharyngula/2008/06/sorry_vox_i_dont_debate_crazy.php\">when your head is buried in the sand</a>:</p><blockquote><p>The fact that the Northern Alliance radio show actually thinks Vox Day is a credible voice for conservative thought tells me right away that there is something wrong with them, and no, I’m not going to trust them at all.</p><p>I’ve also read Day’s horrible little book, The Irrational Atheist. Well, to be honest, I read a few chapters of dreck, then flipped through the rest rather quickly. It’s actually the “Vox Day Hates Sam Harris” book, with occasional potshots at other New Atheists, and it’s really not very good. You would think that if he had a strong rational argument with evidence for any gods, then he would have put it in there — nothing would more seriously deflate one of us scientific atheists who claim there is no evidence for god than, say, presenting credible evidence for god. That was what I actually skimmed through the book for, but it wasn’t there.</p></blockquote><p>I don’t know, I wouldn’t have cared if it was Minnesota Atheist Talk.  The venue makes no difference to me.  Also, it’s worth noting that I’m a libertarian, not a conservative, and the Powerline guys aren’t a whole lot fonder of me than PZ is.  (They’re pals with Malkin and they support the Iraqi occupation and I doubt they’re down with legalizing drugs.)  But I guess it’s hard to blame him for not wishing to imperil his sobriety and his sanity in an encounter with the dark and mysterious brotherhood known collectively as <a href=\"http://www.fraterslibertas.com/\">the Fraters Libertas</a>.</p><p>As for TIA, I didn’t take the occasional potshot at Dawkins, Hitchens and Onfray, but devoted an entire chapter to each of them.  PZ also skips over the small fact that TIA not only wiped out Dawkins’s self-described central argument of TGD, but also inspired Sam Harris to admit that he didn’t have a case against religious faith, but rather tribalism.  And I suspect Dawkins isn’t going to be citing that “striking” Red State argument again anytime soon.  I don’t know how I could have made it any more clear that TIA was a book about atheism and atheist arguments, not a theological book about God.  I may well write that book someday, in fact, this little episode makes it much more likely that I’ll write it sooner rather than later, but TIA isn’t it and it was never intended to be.</p></div>",
  "content_text": "PZ explains why he hasn’t ever encountered any strong arguments for the existence of gods… it’s hard to listen\nwhen your head is buried in the sand\n:\nThe fact that the Northern Alliance radio show actually thinks Vox Day is a credible voice for conservative thought tells me right away that there is something wrong with them, and no, I’m not going to trust them at all.\nI’ve also read Day’s horrible little book, The Irrational Atheist. Well, to be honest, I read a few chapters of dreck, then flipped through the rest rather quickly. It’s actually the “Vox Day Hates Sam Harris” book, with occasional potshots at other New Atheists, and it’s really not very good. You would think that if he had a strong rational argument with evidence for any gods, then he would have put it in there — nothing would more seriously deflate one of us scientific atheists who claim there is no evidence for god than, say, presenting credible evidence for god. That was what I actually skimmed through the book for, but it wasn’t there.\nI don’t know, I wouldn’t have cared if it was Minnesota Atheist Talk.  The venue makes no difference to me.  Also, it’s worth noting that I’m a libertarian, not a conservative, and the Powerline guys aren’t a whole lot fonder of me than PZ is.  (They’re pals with Malkin and they support the Iraqi occupation and I doubt they’re down with legalizing drugs.)  But I guess it’s hard to blame him for not wishing to imperil his sobriety and his sanity in an encounter with the dark and mysterious brotherhood known collectively as\nthe Fraters Libertas\n.\nAs for TIA, I didn’t take the occasional potshot at Dawkins, Hitchens and Onfray, but devoted an entire chapter to each of them.  PZ also skips over the small fact that TIA not only wiped out Dawkins’s self-described central argument of TGD, but also inspired Sam Harris to admit that he didn’t have a case against religious faith, but rather tribalism.  And I suspect Dawkins isn’t going to be citing that “striking” Red State argument again anytime soon.  I don’t know how I could have made it any more clear that TIA was a book about atheism and atheist arguments, not a theological book about God.  I may well write that book someday, in fact, this little episode makes it much more likely that I’ll write it sooner rather than later, but TIA isn’t it and it was never intended to be.",
  "tags": [],
  "categories": [],
  "sitemap_lastmod": "2008-06-09T20:50:00+00:00"
}