{
  "url": "https://voxday.net/2008/06/23/death-machines/",
  "scraped_at": "2026-01-08T22:28:11.251854",
  "title": "Death machines",
  "date_display": "June 23, 2008",
  "date_iso": "2008-06-23T14:32:00+00:00",
  "date_from_url": "2008-06-23",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>I once had a Suzuki 750; it was my first bike and it was not the wisest purchase I’ve ever made.  A 750 is a lot of bike for a first-timer and while I did eventually figure out how to ride it, I never got all that comfortable riding it in traffic.  I sold it to a friend after a gym acquaintance managed to get himself erased by an old woman pulling out of the shopping mall in a 25-MPH zone.  I figured that anything that left me vulnerable enough to get killed by elderly women was not my cup of tea.</p><p>I had, however, been contemplating getting a Vespa or something to ride to the club, what with gas prices climbing through the roof and all.  It’s not that it’s far away, it’s actually what some might consider jogging distance, although the terrain renders that somewhat impractical.  Anyhow, I was in the left lane on a one way street and was just beginning to turn left when an idiot girl – she looked around 16 – shot past me going about 45 MPH <i>on the freaking left</i>.  If she’d been going even a little slower, she would have likely t-boned the car and launched herself into the brick building on the corner.  Now, I’m certainly delighted to not have a massive repair bill and a dead teenage girl on my hands, I do find myself wondering what parent allows their idiot teenager to drive those things.  I’ve seen the results of several scooter accidents over the last few years and even had to phone one in once when I came across a kid with a broken leg lying in the road, and in none of those cases was the kid over the age of 20.</p></div>",
  "content_text": "I once had a Suzuki 750; it was my first bike and it was not the wisest purchase I’ve ever made.  A 750 is a lot of bike for a first-timer and while I did eventually figure out how to ride it, I never got all that comfortable riding it in traffic.  I sold it to a friend after a gym acquaintance managed to get himself erased by an old woman pulling out of the shopping mall in a 25-MPH zone.  I figured that anything that left me vulnerable enough to get killed by elderly women was not my cup of tea.\nI had, however, been contemplating getting a Vespa or something to ride to the club, what with gas prices climbing through the roof and all.  It’s not that it’s far away, it’s actually what some might consider jogging distance, although the terrain renders that somewhat impractical.  Anyhow, I was in the left lane on a one way street and was just beginning to turn left when an idiot girl – she looked around 16 – shot past me going about 45 MPH\non the freaking left\n.  If she’d been going even a little slower, she would have likely t-boned the car and launched herself into the brick building on the corner.  Now, I’m certainly delighted to not have a massive repair bill and a dead teenage girl on my hands, I do find myself wondering what parent allows their idiot teenager to drive those things.  I’ve seen the results of several scooter accidents over the last few years and even had to phone one in once when I came across a kid with a broken leg lying in the road, and in none of those cases was the kid over the age of 20.",
  "tags": [],
  "categories": [],
  "sitemap_lastmod": "2008-06-23T13:32:00+00:00"
}