{
  "url": "https://voxday.net/2008/06/19/euro-2008-quarterfinals/",
  "scraped_at": "2026-01-08T22:27:47.213691",
  "title": "Euro 2008 quarterfinals",
  "date_display": "June 19, 2008",
  "date_iso": "2008-06-19T06:00:00+00:00",
  "date_from_url": "2008-06-19",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>The group stage went pretty much as I expected.  The only disappointment was that there wasn’t a decent third team in Germany’s group, as they would have almost surely flamed out if there had been a Sweden or a Czech Republic there.  The only real surprise was Holland, as not even my Ajax friend expected them to beat both France and Italy.  I figured them for a loss to Italy and maybe a tie with France.  Speaking of the Azurri, they finished strong, as usual, and put <i>Les Blues</i> away without any trouble.  But Spain looks tough, very tough, and I don’t think the oft-confused Italian defense is going to shut down Villa, Fabregas, and company.  Turkey shouldn’t be in the quarters at all; they got lucky against both the Swiss and the Czechs.  But, as the Greeks showed four years ago, a little timely luck can take you a long way in this tournament.</p><p>Here’s what I expect:</p><p>Portugal over Germany<br>Croatia over Turkey<br>Holland over Russia<br>Spain over Italy</br></br></br></p><p>The two I’m less confident about are Portugal and Croatia, since Portugal has a history of choking and Germany has a history of over-performing.  But the Portuguese have played much better this tournament and while Cristiano Ronaldo is a complete cheeseball, he’s not a choker.  Croatia is a more complete team than either the Swiss or the Czechs, but who knows if the Turkish luck has run out or not.  I’d be surprised if Italy beat Spain and shocked if Russia beat an increasingly impressive Holland.</p></div>",
  "content_text": "The group stage went pretty much as I expected.  The only disappointment was that there wasn’t a decent third team in Germany’s group, as they would have almost surely flamed out if there had been a Sweden or a Czech Republic there.  The only real surprise was Holland, as not even my Ajax friend expected them to beat both France and Italy.  I figured them for a loss to Italy and maybe a tie with France.  Speaking of the Azurri, they finished strong, as usual, and put\nLes Blues\naway without any trouble.  But Spain looks tough, very tough, and I don’t think the oft-confused Italian defense is going to shut down Villa, Fabregas, and company.  Turkey shouldn’t be in the quarters at all; they got lucky against both the Swiss and the Czechs.  But, as the Greeks showed four years ago, a little timely luck can take you a long way in this tournament.\nHere’s what I expect:\nPortugal over Germany\nCroatia over Turkey\nHolland over Russia\nSpain over Italy\nThe two I’m less confident about are Portugal and Croatia, since Portugal has a history of choking and Germany has a history of over-performing.  But the Portuguese have played much better this tournament and while Cristiano Ronaldo is a complete cheeseball, he’s not a choker.  Croatia is a more complete team than either the Swiss or the Czechs, but who knows if the Turkish luck has run out or not.  I’d be surprised if Italy beat Spain and shocked if Russia beat an increasingly impressive Holland.",
  "tags": [],
  "categories": [],
  "sitemap_lastmod": "2008-06-19T05:00:00+00:00"
}