{
  "url": "https://voxday.net/2008/06/10/euro-2008-day-3/",
  "scraped_at": "2026-01-08T22:26:48.236149",
  "title": "Euro 2008 day 3",
  "date_display": "June 10, 2008",
  "date_iso": "2008-06-10T08:53:00+00:00",
  "date_from_url": "2008-06-10",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>1.  I know the Azzurri always start slow in the big tournaments.  But that was a bad, bad loss to the Oranje.  The defense looked nearly as bad as Poland’s, which is an ominous sign for a team that has historically depended upon a rock-solid defense.  But Cannavaro is out with injury, Maldini is retired from international play and the midfield is aging.  They’ll still make it to the next round, but they sure don’t look like the World Cup winners of two years ago.</p><p>2.  I’ve always liked Rob Van Persie and while I don’t like Van Nistleroy, he’s a very dangerous striker.  I was surprised that the Dutch midfield controlled the ball so effectively, and having an in-form Van der Sar in the net is always an advantage.  The Dutch defense looked a bit shaky to me, but Toni and Del Piero didn’t ever look like they were going to take much advantage of that.  Neither will the French or Romanian attackers, but Germany, Spain, and Portugal may.</p><p>3.  One of the great pleasures of this tournament is listening to the English announcers moan and complain about how awful every game that doesn’t feature the English team is.  Which, of course, is all of them.  That being said, Alan Hanson was entirely correct to criticize the boring and static French attack; in tournaments like these, if you don’t go after the lesser teams and take the points, you’re likely to find yourself out of the quarterfinals.  France can’t play for ties now, they probably require at least one win against Italy and Holland and might need two.</p><p>4.  I kind of miss Gheorghe Hagi.  It’s just not the same seeing Romania in action and not hearing the announcers talk about “the Maradona of the Carpathians”.  That’s my nominee for Most Unwieldy Nickname in sports.</p><p>5.  Nicolas Anelka had two decent season for Arsenal, for which we are grateful.  Since then, Le Sulk been reliably ineffective.  In international play, two of his five goals in games that count are against <i>the Faroe freaking Islands</i>.  I have no idea why he’s on the French squad, let alone the field.  Hell, I could score against the Faroe Islands.  Seriously.</p><p>6.  Does anyone else think it would have been funny if a bunch of Italians had stormed the Romanian bench at halftime and set fire to it?  Okay, maybe it’s just me.</p></div>",
  "content_text": "1.  I know the Azzurri always start slow in the big tournaments.  But that was a bad, bad loss to the Oranje.  The defense looked nearly as bad as Poland’s, which is an ominous sign for a team that has historically depended upon a rock-solid defense.  But Cannavaro is out with injury, Maldini is retired from international play and the midfield is aging.  They’ll still make it to the next round, but they sure don’t look like the World Cup winners of two years ago.\n2.  I’ve always liked Rob Van Persie and while I don’t like Van Nistleroy, he’s a very dangerous striker.  I was surprised that the Dutch midfield controlled the ball so effectively, and having an in-form Van der Sar in the net is always an advantage.  The Dutch defense looked a bit shaky to me, but Toni and Del Piero didn’t ever look like they were going to take much advantage of that.  Neither will the French or Romanian attackers, but Germany, Spain, and Portugal may.\n3.  One of the great pleasures of this tournament is listening to the English announcers moan and complain about how awful every game that doesn’t feature the English team is.  Which, of course, is all of them.  That being said, Alan Hanson was entirely correct to criticize the boring and static French attack; in tournaments like these, if you don’t go after the lesser teams and take the points, you’re likely to find yourself out of the quarterfinals.  France can’t play for ties now, they probably require at least one win against Italy and Holland and might need two.\n4.  I kind of miss Gheorghe Hagi.  It’s just not the same seeing Romania in action and not hearing the announcers talk about “the Maradona of the Carpathians”.  That’s my nominee for Most Unwieldy Nickname in sports.\n5.  Nicolas Anelka had two decent season for Arsenal, for which we are grateful.  Since then, Le Sulk been reliably ineffective.  In international play, two of his five goals in games that count are against\nthe Faroe freaking Islands\n.  I have no idea why he’s on the French squad, let alone the field.  Hell, I could score against the Faroe Islands.  Seriously.\n6.  Does anyone else think it would have been funny if a bunch of Italians had stormed the Romanian bench at halftime and set fire to it?  Okay, maybe it’s just me.",
  "tags": [],
  "categories": [],
  "sitemap_lastmod": "2008-06-10T07:53:00+00:00"
}