{
  "url": "https://voxday.net/2008/06/27/euro-2008-semis/",
  "scraped_at": "2026-01-08T22:28:36.951206",
  "title": "Euro 2008 semis",
  "date_display": "June 27, 2008",
  "date_iso": "2008-06-27T09:35:00+00:00",
  "date_from_url": "2008-06-27",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>The two semifinal games were two of the better games played in what has been a surprisingly lackluster tournament.  The problem, I think, is that none of the more skilled teams has a reliable back four, which has caused most of the managers to play their midfielders in a predominantly defensive position.  With a few notable exceptions – such as Lang’s game-winning goal for Germany – we haven’t seen many attacking runs forward by the defenders on the wings.  Of course, it probably didn’t help that Greece managed to win the previous tournament with little more than solid defending and an in-form keeper.</p><p>1.  Pre-tournament favorite Germany still looks shaky, but they’re in the finals.  If Podolski and Schweinsteiger didn’t combine for that surprise first goal in quick response to Turkey’s – Germany was under non-stop assault for the first 20 minutes and hadn’t generated a single serious attack before their first score – they might have lost 4-0.  But they did and kept Germany in the game long enough to get them past the point of potential collapse, proving that it’s always dangerous to count out the Germans no matter how average they appear.</p><p>2.  Russia under Hiddink was definitely the most exciting team in the tournament.  As in the Holland game, they threw everything they had at the Spanish, but the Spanish defense was more solid than the Dutch.  Italy showed that you can shut down Villa, Torres, Fabregas and Silva by playing ten men back, but playing not to lose is foolish, especially against a squad with plenty of ace penalty-takers.  Russia’s defense isn’t that good, so once it became apparent that the Spanish defense wasn’t overly bothered by the pressure, it was clear that the Russians were doomed even before the first Spanish goal in the second half.  You have to respect Hiddink, though.  I think he would be a very interesting coach for the US team to consider for the next World Cup.</p><p>3.  Donadoni got fired, and deservedly so.  He’s a great player, a good-looking clotheshorse, and a terrible manager.  I seriously think I could have gotten Italy past the group stage, counting on Luca Toni in the attack was simply stupid.</p><p>4.  One of the English announcers has a rather peculiar tendency towards the redundant.  Is it really necessary to declare “Now it’s Torres for Spain” or “On the ball is Schweinsteiger for Germany”? Sure, in some situations clarifying any potential ambiguity would be  desirable, but I’m confident that most people can figure out which side Li Yao or Marco Matterazi are playing for when China is up against Italy.</p><p>5.  Spain looks very, very good.  My predictions have been pretty bad, but I’ve talked up Spain all along and I think this is the year they win it all.  Casillas hasn’t been asked to do much, but he’s risen to the occasion when required; for example, his save on Camoranesi’s shot in the Italy game turned out to be crucial.  With the exception of the dread Italian <i>catenaccio</i>, Cesc and the other midfielders have had little trouble opening up and carving apart opposing defenses and the ease with which Turkey scored on Germany – to say nothing of the customary blunders of Jens Lehman with which every Arsenal fan is all too familiar – I see no reason to believe that Spain will have too much trouble with an overmatched Germany.  3-1 Spain.</p></div>",
  "content_text": "The two semifinal games were two of the better games played in what has been a surprisingly lackluster tournament.  The problem, I think, is that none of the more skilled teams has a reliable back four, which has caused most of the managers to play their midfielders in a predominantly defensive position.  With a few notable exceptions – such as Lang’s game-winning goal for Germany – we haven’t seen many attacking runs forward by the defenders on the wings.  Of course, it probably didn’t help that Greece managed to win the previous tournament with little more than solid defending and an in-form keeper.\n1.  Pre-tournament favorite Germany still looks shaky, but they’re in the finals.  If Podolski and Schweinsteiger didn’t combine for that surprise first goal in quick response to Turkey’s – Germany was under non-stop assault for the first 20 minutes and hadn’t generated a single serious attack before their first score – they might have lost 4-0.  But they did and kept Germany in the game long enough to get them past the point of potential collapse, proving that it’s always dangerous to count out the Germans no matter how average they appear.\n2.  Russia under Hiddink was definitely the most exciting team in the tournament.  As in the Holland game, they threw everything they had at the Spanish, but the Spanish defense was more solid than the Dutch.  Italy showed that you can shut down Villa, Torres, Fabregas and Silva by playing ten men back, but playing not to lose is foolish, especially against a squad with plenty of ace penalty-takers.  Russia’s defense isn’t that good, so once it became apparent that the Spanish defense wasn’t overly bothered by the pressure, it was clear that the Russians were doomed even before the first Spanish goal in the second half.  You have to respect Hiddink, though.  I think he would be a very interesting coach for the US team to consider for the next World Cup.\n3.  Donadoni got fired, and deservedly so.  He’s a great player, a good-looking clotheshorse, and a terrible manager.  I seriously think I could have gotten Italy past the group stage, counting on Luca Toni in the attack was simply stupid.\n4.  One of the English announcers has a rather peculiar tendency towards the redundant.  Is it really necessary to declare “Now it’s Torres for Spain” or “On the ball is Schweinsteiger for Germany”? Sure, in some situations clarifying any potential ambiguity would be  desirable, but I’m confident that most people can figure out which side Li Yao or Marco Matterazi are playing for when China is up against Italy.\n5.  Spain looks very, very good.  My predictions have been pretty bad, but I’ve talked up Spain all along and I think this is the year they win it all.  Casillas hasn’t been asked to do much, but he’s risen to the occasion when required; for example, his save on Camoranesi’s shot in the Italy game turned out to be crucial.  With the exception of the dread Italian\ncatenaccio\n, Cesc and the other midfielders have had little trouble opening up and carving apart opposing defenses and the ease with which Turkey scored on Germany – to say nothing of the customary blunders of Jens Lehman with which every Arsenal fan is all too familiar – I see no reason to believe that Spain will have too much trouble with an overmatched Germany.  3-1 Spain.",
  "tags": [],
  "categories": [],
  "sitemap_lastmod": "2008-06-27T08:35:00+00:00"
}