{
  "url": "https://voxday.net/2008/06/12/euro-2008-day-5/",
  "scraped_at": "2026-01-08T22:27:07.941259",
  "title": "Euro 2008 day 5",
  "date_display": "June 12, 2008",
  "date_iso": "2008-06-12T08:15:00+00:00",
  "date_from_url": "2008-06-12",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>1.  The Swiss blew it.  There’s no two ways about it, they had the game in hand and they just simply choked.  Hassan Yakin’s error was the sort of thing I yell at my kids about; when the ball is coming across from the right at any angle greater than 45 degrees, <i>you must use your left foot</i>.  I have the worst left foot on my team, but I score more reliably in that position than my far superior teammates because it’s simply a question of angles and redirection, not shooting technique.  And failing to score on a 4-1 break is inexcusable at that level, you could see that they were hesitant despite the three-man advantage.  But the biggest mistake was the manager’s decision to put Benaglio in goal over Zuberbuehler, who kept a clean sheet in four World Cup games.  Benaglio has hesitant hands and I have no doubt whatsoever that Zubi would have saved that first Turkish goal.</p><p>2.  It took Portugal a while, but they finally put it together to finish off the Czechs without too much trouble.  The Czechs played reasonably well, but they simply couldn’t deal with the speed and firepower of the Portuguese midfield.  Cristiano Ronaldo may be an annoying and arrogant cheeseball, but he really is as good as advertised.  The Czech’s should make it through to the next stage, though, as I’d be surprised if they didn’t beat Turkey without too much trouble.</p><p>3. <i>“What are your thoughts on Luca Toni? I read an article by an Azzurri partisan who thinks Toni is substantially overrated. This guy claimed that it’s well known that the defenses in the Bundesliga are significantly worse than those in the EPL, Serie A, and La Liga, and this fact played a major role in Toni’s huge season for Bayern Munich this past year.”</i></p><p>I have never thought Toni was particularly effective despite the fact that he has scored goals at an incredible rate at Palermo, Fiorentina, and now Bayern.  He reminds me of a talented Irish player with whom I once played in the United States.  I averaged about a goal per game, distributed pretty evenly regardless of whom we played.  He averaged two goals per game, but he would always score three or four against the bad teams and never scored against any of the good teams.  Toni is a big, physical striker and I think he is extraordinarily effective when he can simply overpower lesser defenders.  But since that’s not possible at the highest level of international play, he’s of arguably less utility than a player like Inzaghi, Di Natale or Del Piero.  For example, Inzaghi’s career scoring rate since 2001 is .43 in Serie A and .43 in international play.  Since 2003, Toni’s is .68 in league play and .43 in international play, but his 15 goals have come in a hat trick against Belarus and in games against lesser teams such as Ukraine, Scotland and the Faroe Islands.</p></div>",
  "content_text": "1.  The Swiss blew it.  There’s no two ways about it, they had the game in hand and they just simply choked.  Hassan Yakin’s error was the sort of thing I yell at my kids about; when the ball is coming across from the right at any angle greater than 45 degrees,\nyou must use your left foot\n.  I have the worst left foot on my team, but I score more reliably in that position than my far superior teammates because it’s simply a question of angles and redirection, not shooting technique.  And failing to score on a 4-1 break is inexcusable at that level, you could see that they were hesitant despite the three-man advantage.  But the biggest mistake was the manager’s decision to put Benaglio in goal over Zuberbuehler, who kept a clean sheet in four World Cup games.  Benaglio has hesitant hands and I have no doubt whatsoever that Zubi would have saved that first Turkish goal.\n2.  It took Portugal a while, but they finally put it together to finish off the Czechs without too much trouble.  The Czechs played reasonably well, but they simply couldn’t deal with the speed and firepower of the Portuguese midfield.  Cristiano Ronaldo may be an annoying and arrogant cheeseball, but he really is as good as advertised.  The Czech’s should make it through to the next stage, though, as I’d be surprised if they didn’t beat Turkey without too much trouble.\n3.\n“What are your thoughts on Luca Toni? I read an article by an Azzurri partisan who thinks Toni is substantially overrated. This guy claimed that it’s well known that the defenses in the Bundesliga are significantly worse than those in the EPL, Serie A, and La Liga, and this fact played a major role in Toni’s huge season for Bayern Munich this past year.”\nI have never thought Toni was particularly effective despite the fact that he has scored goals at an incredible rate at Palermo, Fiorentina, and now Bayern.  He reminds me of a talented Irish player with whom I once played in the United States.  I averaged about a goal per game, distributed pretty evenly regardless of whom we played.  He averaged two goals per game, but he would always score three or four against the bad teams and never scored against any of the good teams.  Toni is a big, physical striker and I think he is extraordinarily effective when he can simply overpower lesser defenders.  But since that’s not possible at the highest level of international play, he’s of arguably less utility than a player like Inzaghi, Di Natale or Del Piero.  For example, Inzaghi’s career scoring rate since 2001 is .43 in Serie A and .43 in international play.  Since 2003, Toni’s is .68 in league play and .43 in international play, but his 15 goals have come in a hat trick against Belarus and in games against lesser teams such as Ukraine, Scotland and the Faroe Islands.",
  "tags": [],
  "categories": [],
  "sitemap_lastmod": "2008-06-12T07:15:00+00:00"
}