{
  "url": "https://voxday.net/2008/06/05/euzis-gestapo-up/",
  "scraped_at": "2026-01-08T22:26:15.396478",
  "title": "The Euzis gestapo up",
  "date_display": "June 5, 2008",
  "date_iso": "2008-06-05T08:11:00+00:00",
  "date_from_url": "2008-06-05",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>Here we <a href=\"http://www.iht.com/articles/2008/06/04/europe/germany.php\">go again</a>:</p><blockquote><p>Despite strong criticism from the opposition and even its own coalition partners, Chancellor Angela Merkel’s government agreed Wednesday to give Germany’s police forces greater powers to monitor homes, telephones and private computers, maintaining that an enhanced reach would protect citizens from terrorist attacks.</p></blockquote><p>A Reichkanzler asserting sweeping new powers for the Staatspolizei.  That’s new.  One of these days, people are going to figure out that it’s not the terrorists who are the problem, but the governments.  The frustrating thing is that Umberto Eco wrote his essay explaining the symbiotic nature of the relationship between terrorist and government, <i>Striking at the Heart of the State?</i>, back in the late Seventies.</p></div>",
  "content_text": "Here we\ngo again\n:\nDespite strong criticism from the opposition and even its own coalition partners, Chancellor Angela Merkel’s government agreed Wednesday to give Germany’s police forces greater powers to monitor homes, telephones and private computers, maintaining that an enhanced reach would protect citizens from terrorist attacks.\nA Reichkanzler asserting sweeping new powers for the Staatspolizei.  That’s new.  One of these days, people are going to figure out that it’s not the terrorists who are the problem, but the governments.  The frustrating thing is that Umberto Eco wrote his essay explaining the symbiotic nature of the relationship between terrorist and government,\nStriking at the Heart of the State?\n, back in the late Seventies.",
  "tags": [],
  "categories": [],
  "sitemap_lastmod": "2008-06-05T07:11:00+00:00"
}