{
  "url": "https://voxday.net/2008/06/15/fathers-day-emasculation/",
  "scraped_at": "2026-01-08T22:27:28.180499",
  "title": "A Father’s Day emasculation",
  "date_display": "June 15, 2008",
  "date_iso": "2008-06-15T19:43:00+00:00",
  "date_from_url": "2008-06-15",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>Spacebunny went out of her way today to throw an extra special Father’s Day.  There was a giant mocha ready upon rising.  There was a talent show followed by invisible tea followed by an imaginary feast.  There was lasagna with extra ricotta, the prosecco flowed like water and was followed by a chocolate cream pie complete with a graham cracker crust.  There were presents; the <i>pièce de résistance</i> was the only current game system I didn’t have, a Nintendo Wii.</p><p>And then, she promptly rendered the entire exercise moot by trouncing me – yes, trouncing me – at Wii Sports Bowling.  Not only did she win the first game by a score of 146 to 125, but she beat me in a best of three.  Now, it probably won’t surprise you to know that I’m not a particularly good bowler, but it <i>is</i> nevertheless a video game, so I should probably hear the end of this right around the time that Heimdall sounds his horn.  Spacebunny is many fine things; however, being a kind and gracious winner is not necessarily one of them.</p><p>I’ll have to buy her a Wii Fit.  That way, we both win.</p></div>",
  "content_text": "Spacebunny went out of her way today to throw an extra special Father’s Day.  There was a giant mocha ready upon rising.  There was a talent show followed by invisible tea followed by an imaginary feast.  There was lasagna with extra ricotta, the prosecco flowed like water and was followed by a chocolate cream pie complete with a graham cracker crust.  There were presents; the\npièce de résistance\nwas the only current game system I didn’t have, a Nintendo Wii.\nAnd then, she promptly rendered the entire exercise moot by trouncing me – yes, trouncing me – at Wii Sports Bowling.  Not only did she win the first game by a score of 146 to 125, but she beat me in a best of three.  Now, it probably won’t surprise you to know that I’m not a particularly good bowler, but it\nis\nnevertheless a video game, so I should probably hear the end of this right around the time that Heimdall sounds his horn.  Spacebunny is many fine things; however, being a kind and gracious winner is not necessarily one of them.\nI’ll have to buy her a Wii Fit.  That way, we both win.",
  "tags": [],
  "categories": [],
  "sitemap_lastmod": "2008-06-15T18:43:00+00:00"
}