{
  "url": "https://voxday.net/2008/06/20/historically-illiterate-atheis/",
  "scraped_at": "2026-01-08T22:27:49.030599",
  "title": "The historically illiterate atheist",
  "date_display": "June 20, 2008",
  "date_iso": "2008-06-20T06:47:00+00:00",
  "date_from_url": "2008-06-20",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>I keep telling you that the atheist icons really aren’t that intelligent or well-educated, and while many have begun to accept that reality, some of their acolytes have proved harder to convince.  Which is strange, since they tend to reveal their historical ignorance almost every time they open their mouths.  In his column about his new book today, <a href=\"http://www.worldnetdaily.com/index.php?fa=PAGE.view&amp;pageId=67578\">Pat Buchanan embarrasses the blundering blitherbuss Christopher Hitchens</a>:</p><blockquote><p>And why did Hitler invade Russia? This writer quotes Hitler 10 times as saying that only by knocking out Russia could he convince Britain it could not win and must end the war.</p><p>Hitchens mocks this view, invoking the Hitler-madman theory.</p><p>“Could we have a better definition of derangement and megalomania than the case of a dictator who overrules his own generals and invades Russia in wintertime …?”</p><p>Christopher, Hitler invaded Russia on June 22.</p></blockquote><p>Hitler was no madman, he was simply evil.  As for his decision to invade Russia, like both his predecessor and his successors, (Napoleon and the EU), he became overconfident due to his previous successes.  Hitler had previously overruled a number of his more cautious generals in the past and been proven right to have done so.  And as for Hitchens, it should come as little surprise that he confuses a literary bon mot about never invading Russia in the winter with actual knowledge of the historical Operation Barbarossa.</p><p>I realize some people may have laughed when I pointed out in <i>The Irrational Atheist</i> that gamers actually know more about this sort of thing than most journalists and academics, but it’s absolutely true.  No ASLer or CMOB player could ever make such a boneheaded mistake.</p><p>UPDATE – It’s amusing, but when Spacebunny dropped the post in my office after I posted this, I opened up a large envelope which turned out to contain the premier issue of the new magazine from Strategy &amp; Tactics, <i>World at War: The Strategy and Tactics of World War II</i>.  The first game included? <i>Barbarossa: East Front 1941-1945</i>.  One relevant point I’ve already noticed in my initial scan of the lead article – fantastic maps, by the way – is that German strategic intelligence informed Hitler and his generals that there were 200 combat divisions in the Soviet order of battle, of which only 50-75 were on the front facing Germany; in fact, the Soviets had 360 divisions at their disposal.  Thus, neither Hitler nor his generals were aware that Zhukov and Stalin were waging a war of attrition for the first year of the war, especially since the capture of 390,000 troops and 4,500 tanks at Smolensk and Minsk led the German High Command to believe that they were successfully repeating their previous blitzkriegs of France and the Low Countries.</p></div>",
  "content_text": "I keep telling you that the atheist icons really aren’t that intelligent or well-educated, and while many have begun to accept that reality, some of their acolytes have proved harder to convince.  Which is strange, since they tend to reveal their historical ignorance almost every time they open their mouths.  In his column about his new book today,\nPat Buchanan embarrasses the blundering blitherbuss Christopher Hitchens\n:\nAnd why did Hitler invade Russia? This writer quotes Hitler 10 times as saying that only by knocking out Russia could he convince Britain it could not win and must end the war.\nHitchens mocks this view, invoking the Hitler-madman theory.\n“Could we have a better definition of derangement and megalomania than the case of a dictator who overrules his own generals and invades Russia in wintertime …?”\nChristopher, Hitler invaded Russia on June 22.\nHitler was no madman, he was simply evil.  As for his decision to invade Russia, like both his predecessor and his successors, (Napoleon and the EU), he became overconfident due to his previous successes.  Hitler had previously overruled a number of his more cautious generals in the past and been proven right to have done so.  And as for Hitchens, it should come as little surprise that he confuses a literary bon mot about never invading Russia in the winter with actual knowledge of the historical Operation Barbarossa.\nI realize some people may have laughed when I pointed out in\nThe Irrational Atheist\nthat gamers actually know more about this sort of thing than most journalists and academics, but it’s absolutely true.  No ASLer or CMOB player could ever make such a boneheaded mistake.\nUPDATE – It’s amusing, but when Spacebunny dropped the post in my office after I posted this, I opened up a large envelope which turned out to contain the premier issue of the new magazine from Strategy & Tactics,\nWorld at War: The Strategy and Tactics of World War II\n.  The first game included?\nBarbarossa: East Front 1941-1945\n.  One relevant point I’ve already noticed in my initial scan of the lead article – fantastic maps, by the way – is that German strategic intelligence informed Hitler and his generals that there were 200 combat divisions in the Soviet order of battle, of which only 50-75 were on the front facing Germany; in fact, the Soviets had 360 divisions at their disposal.  Thus, neither Hitler nor his generals were aware that Zhukov and Stalin were waging a war of attrition for the first year of the war, especially since the capture of 390,000 troops and 4,500 tanks at Smolensk and Minsk led the German High Command to believe that they were successfully repeating their previous blitzkriegs of France and the Low Countries.",
  "tags": [],
  "categories": [],
  "sitemap_lastmod": "2008-06-20T05:47:00+00:00"
}