{
  "url": "https://voxday.net/2008/06/30/illogic-of-ancients/",
  "scraped_at": "2026-01-08T22:28:58.699442",
  "title": "Illogic of the ancients",
  "date_display": "June 30, 2008",
  "date_iso": "2008-06-30T12:30:00+00:00",
  "date_from_url": "2008-06-30",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>The Daily Telegraph <a href=\"http://www.telegraph.co.uk/opinion/main.jhtml?xml=/opinion/2008/06/30/do3005.xml\">has an article about Darwin</a> which points out that his atheism, as with most atheists, derived from very irrational emotion rather than reason.  Unlike Job, Darwin could not bear the pain of the tragedy in his life and turned from God; the Book of Job makes it clear that Job is an unusual exemplary in this regard, it is Darwin’s behavior that is the norm.  But what I found interesting was the reference to <s>Epictetus</s>Epicurus in the comments, a quote which was occasionally brought up by the more intelligent atheists and which I have seen being aped more and more often by the thoughtless talking points crowd.</p><p><i>Is God willing to prevent evil, but not able? Then he is not omnipotent.</i></p><p>This is correct, however, the underlying assumption that God defines evil in the same sense that we do is baseless and probably incorrect.  And sans a definition of evil, the whole argument is irrelevant sans anyhow.  Sam Harris, for example, considers inanimate objects to be evil, apparently based on size.</p><p><i>Is he able, but not willing? Then he is malevolent.</i></p><p>Incorrect four times over.  This assumes God’s definition of evil is identical to our own and that evil cannot be turned to a subsequent or ultimate purpose of good.  It also assumes a level of interest on God’s part without any basis for doing so.  And finally, it assumes that God would value enforcing good behavior over permitting free will that allows the possibility of evil action.</p><p><i>Is he both able, and willing? Then whence cometh evil?</i></p><p>This assumes an absence of free will.  Evil comes from the human heart; the Christian definition of evil is not “things that counter our desires”, but rather, our choice to exalt our will over God’s Will.</p><p><i>Is he neither willing, nor able? Then why call him God?</i></p><p>Because He is the Creator.  Call him the Dungeon Master or the Game Designer if you prefer.  Either way, He is the Rulemaker and Lawgiver.</p><p>Now, despite my having provided these critiques for some time now, a few people still insist on claiming that my logical abilities are not as good as advertised.  I should very much like to see these critics defend the reasoning of either <s>Epictetus</s>Epicurus or of Socrates in <i>Euthyphro</i>; surely if my logic is weak, it should be no problem to defeat it in with the help of two of the great historical philosophers.</p></div>",
  "content_text": "The Daily Telegraph\nhas an article about Darwin\nwhich points out that his atheism, as with most atheists, derived from very irrational emotion rather than reason.  Unlike Job, Darwin could not bear the pain of the tragedy in his life and turned from God; the Book of Job makes it clear that Job is an unusual exemplary in this regard, it is Darwin’s behavior that is the norm.  But what I found interesting was the reference to\nEpictetus\nEpicurus in the comments, a quote which was occasionally brought up by the more intelligent atheists and which I have seen being aped more and more often by the thoughtless talking points crowd.\nIs God willing to prevent evil, but not able? Then he is not omnipotent.\nThis is correct, however, the underlying assumption that God defines evil in the same sense that we do is baseless and probably incorrect.  And sans a definition of evil, the whole argument is irrelevant sans anyhow.  Sam Harris, for example, considers inanimate objects to be evil, apparently based on size.\nIs he able, but not willing? Then he is malevolent.\nIncorrect four times over.  This assumes God’s definition of evil is identical to our own and that evil cannot be turned to a subsequent or ultimate purpose of good.  It also assumes a level of interest on God’s part without any basis for doing so.  And finally, it assumes that God would value enforcing good behavior over permitting free will that allows the possibility of evil action.\nIs he both able, and willing? Then whence cometh evil?\nThis assumes an absence of free will.  Evil comes from the human heart; the Christian definition of evil is not “things that counter our desires”, but rather, our choice to exalt our will over God’s Will.\nIs he neither willing, nor able? Then why call him God?\nBecause He is the Creator.  Call him the Dungeon Master or the Game Designer if you prefer.  Either way, He is the Rulemaker and Lawgiver.\nNow, despite my having provided these critiques for some time now, a few people still insist on claiming that my logical abilities are not as good as advertised.  I should very much like to see these critics defend the reasoning of either\nEpictetus\nEpicurus or of Socrates in\nEuthyphro\n; surely if my logic is weak, it should be no problem to defeat it in with the help of two of the great historical philosophers.",
  "tags": [],
  "categories": [],
  "sitemap_lastmod": "2008-06-30T11:30:00+00:00"
}