{
  "url": "https://voxday.net/2008/06/21/importance-of-condescension/",
  "scraped_at": "2026-01-08T22:27:59.920542",
  "title": "The importance of condescension",
  "date_display": "June 21, 2008",
  "date_iso": "2008-06-21T09:11:00+00:00",
  "date_from_url": "2008-06-21",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>I’m not exactly sure why, but people occasionally take exception to my observation of the fact that we are all occasionally irrational and that the overwhelming majority of people are irrational idiots most of the time.  That this is observation is necessary to understand the course of human events should not be debatable; the fact that it is occasionally debated only serves to highlight the truth of the observation.</p><p>I was in Paris recently, which was fitting since I was just finishing up a book written by a resident Parisian, namely, <i>The Devil’s Delusion</i> by David Berlinski.  My plans dictated a brief sojourn on the Metro, so I stopped at the sole ticket vending machine in the area with the intention of buying a single fare, only to discover that the machine did not take notes but instead required Euro coins, which I possessed in insufficient quantity.  I turned around, spotted a fruit vendor, and purchased a banana, which provided me with not only the prospect of future nourishment, but also sufficient change for the intended purchase.</p><p>However, my little diversion to the fruit stand now meant that I was in line behind four people – two of whom made a couple that later proved to possess perhaps a third of a functional brain between them – and mistakenly assumed that this would delay my Metro-boarding intentions by a matter of two or three minutes.  The first gentleman found it difficult to operate the machine; he first had severe problems figuring out the mechanism used to choose between different selections, then appeared mystified by the two buttons, one green and one red, which were required to either approve or cancel the highlighted selection.  His purchase of a ticket took approximately six minutes.</p><p>The couple also had some trouble working the machine as well as deciding where they were seeking to travel.  It only required them about eight minutes to sort everything out – at this point I was timing people since I had nothing better to do – and upon finally making their selection, they made the shocking discovery that the machine did not take Euro notes.  Being a gentleman of decency, restraint, and a high regard for the social niceties, I elected not to pursue my momentary desire to utilize my extensive martial arts training in order to break both their necks and thereby prevent the evolutionary horrors the two of them might one day unleash upon an unsuspecting planet should they ever happen to stumble upon a method of propagating their brainless species.  Instead, I directed their attention to the fruit stand and suggested that a purchase of one or more items might be a reasonable means of acquiring the requisite coins.</p><p>This prospect filled their slack-jawed faces with dismay, for by this time the line extended back some 15 or 20 people and it was obvious that following my example might well require thirty minutes or more at this point.  However, the rumbles of discontent from what was threatening to rapidly devolve into a lynch mob quickly proved persuasive, and the two dull young things meandered off towards the fruit stand, never to be seen again.  It would not surprise me to learn that they were outwitted and devoured by a crack squad of strawberries.</p><p>I could only wonder how the final obstacle had entertained himself during the 15 previous minutes, as he had no sooner stepped in front of the machine than he began peering around the hall, as if in search of a map of station lines.  He turned to me and babbled something in French, which I correctly interpreted as a question involving lines and stations.  Unfortunately, my French was inadequate for the task of explaining that in the likely event he was intending to travel to a destination somewhere in Paris, there was no need to select that particular destination at the moment since the same ticket would suffice for all.  Or, alternatively, he could purchase a slightly more expensive ticket that would cover every possible eventuality.  I attempted to explain this in Italian; I don’t know if he understood my point or if he was merely alarmed by the ominous rumbles of the expanding and increasingly impatient mob behind me, but regardless, he finally came to realize that this was not an optimal moment to familiarize himself with the layout of the Paris underground system.  He selected a single fare, then was promptly defeated by the failure of the machine to respond in any way.</p><p>Calmly reflecting, as I often do, that most people are idiots, I concluded that I should neither be surprised nor dismayed by the gentleman’s inability to either observe his hapless predecessors’ actions or interact with an interface that requires a functioning mind on the other end.  I therefore took the liberty of stepping forward and pressing a certain green button on his behalf.  Appropriately appreciative, he nodded his gratitude and to my surprise, alertly inserted the proper amount of coins in the slot and received his ticket.  It was with some difficulty that I resisted the urge to applaud.</p><p>And so it was that only 23 minutes after first approaching the ticket machine and noticing that it took only coins and cards, I selected my fare, confirmed the selection, inserted a 2-Euro coin and received both my ticket and the appropriate amount of change.  That took approximately 20 seconds.</p><p>This is why condescension towards and contempt for one’s intellectual inferiors are not only important, but downright necessary for survival in modern times.  Some of you have occasionally asked how I can be so tranquil about the persistent illogic expressed with such mind-numbing regularity by the atheists, feminists, science fetishists and other critics who are occasionally so kind as to grace us with their attentions, but the truth is that I find the experience to be almost meditational.  Call it the Art of Enlightened Condescension or the Zen of Contempt, whatever you like, but the only other serious option is to withdraw into a hermit’s cave and never communicate with the larger part of humanity again.</p></div>",
  "content_text": "I’m not exactly sure why, but people occasionally take exception to my observation of the fact that we are all occasionally irrational and that the overwhelming majority of people are irrational idiots most of the time.  That this is observation is necessary to understand the course of human events should not be debatable; the fact that it is occasionally debated only serves to highlight the truth of the observation.\nI was in Paris recently, which was fitting since I was just finishing up a book written by a resident Parisian, namely,\nThe Devil’s Delusion\nby David Berlinski.  My plans dictated a brief sojourn on the Metro, so I stopped at the sole ticket vending machine in the area with the intention of buying a single fare, only to discover that the machine did not take notes but instead required Euro coins, which I possessed in insufficient quantity.  I turned around, spotted a fruit vendor, and purchased a banana, which provided me with not only the prospect of future nourishment, but also sufficient change for the intended purchase.\nHowever, my little diversion to the fruit stand now meant that I was in line behind four people – two of whom made a couple that later proved to possess perhaps a third of a functional brain between them – and mistakenly assumed that this would delay my Metro-boarding intentions by a matter of two or three minutes.  The first gentleman found it difficult to operate the machine; he first had severe problems figuring out the mechanism used to choose between different selections, then appeared mystified by the two buttons, one green and one red, which were required to either approve or cancel the highlighted selection.  His purchase of a ticket took approximately six minutes.\nThe couple also had some trouble working the machine as well as deciding where they were seeking to travel.  It only required them about eight minutes to sort everything out – at this point I was timing people since I had nothing better to do – and upon finally making their selection, they made the shocking discovery that the machine did not take Euro notes.  Being a gentleman of decency, restraint, and a high regard for the social niceties, I elected not to pursue my momentary desire to utilize my extensive martial arts training in order to break both their necks and thereby prevent the evolutionary horrors the two of them might one day unleash upon an unsuspecting planet should they ever happen to stumble upon a method of propagating their brainless species.  Instead, I directed their attention to the fruit stand and suggested that a purchase of one or more items might be a reasonable means of acquiring the requisite coins.\nThis prospect filled their slack-jawed faces with dismay, for by this time the line extended back some 15 or 20 people and it was obvious that following my example might well require thirty minutes or more at this point.  However, the rumbles of discontent from what was threatening to rapidly devolve into a lynch mob quickly proved persuasive, and the two dull young things meandered off towards the fruit stand, never to be seen again.  It would not surprise me to learn that they were outwitted and devoured by a crack squad of strawberries.\nI could only wonder how the final obstacle had entertained himself during the 15 previous minutes, as he had no sooner stepped in front of the machine than he began peering around the hall, as if in search of a map of station lines.  He turned to me and babbled something in French, which I correctly interpreted as a question involving lines and stations.  Unfortunately, my French was inadequate for the task of explaining that in the likely event he was intending to travel to a destination somewhere in Paris, there was no need to select that particular destination at the moment since the same ticket would suffice for all.  Or, alternatively, he could purchase a slightly more expensive ticket that would cover every possible eventuality.  I attempted to explain this in Italian; I don’t know if he understood my point or if he was merely alarmed by the ominous rumbles of the expanding and increasingly impatient mob behind me, but regardless, he finally came to realize that this was not an optimal moment to familiarize himself with the layout of the Paris underground system.  He selected a single fare, then was promptly defeated by the failure of the machine to respond in any way.\nCalmly reflecting, as I often do, that most people are idiots, I concluded that I should neither be surprised nor dismayed by the gentleman’s inability to either observe his hapless predecessors’ actions or interact with an interface that requires a functioning mind on the other end.  I therefore took the liberty of stepping forward and pressing a certain green button on his behalf.  Appropriately appreciative, he nodded his gratitude and to my surprise, alertly inserted the proper amount of coins in the slot and received his ticket.  It was with some difficulty that I resisted the urge to applaud.\nAnd so it was that only 23 minutes after first approaching the ticket machine and noticing that it took only coins and cards, I selected my fare, confirmed the selection, inserted a 2-Euro coin and received both my ticket and the appropriate amount of change.  That took approximately 20 seconds.\nThis is why condescension towards and contempt for one’s intellectual inferiors are not only important, but downright necessary for survival in modern times.  Some of you have occasionally asked how I can be so tranquil about the persistent illogic expressed with such mind-numbing regularity by the atheists, feminists, science fetishists and other critics who are occasionally so kind as to grace us with their attentions, but the truth is that I find the experience to be almost meditational.  Call it the Art of Enlightened Condescension or the Zen of Contempt, whatever you like, but the only other serious option is to withdraw into a hermit’s cave and never communicate with the larger part of humanity again.",
  "tags": [],
  "categories": [],
  "sitemap_lastmod": "2008-06-21T08:11:00+00:00"
}