{
  "url": "https://voxday.net/2008/06/02/interview-with-david-frum_02/",
  "scraped_at": "2026-01-08T22:25:49.689312",
  "title": "Interview with David Frum",
  "date_display": "June 2, 2008",
  "date_iso": "2008-06-02T00:01:00+00:00",
  "date_from_url": "2008-06-02",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p><i>Vox Day interviewed David Frum, the author of <a href=\"http://www.amazon.com/Comeback-Conservatism-That-Can-Again/dp/0385515332/ref=pd_bbs_sr_3?ie=UTF8&amp;s=books&amp;qid=1212272918&amp;sr=8-3\">Comeback: Conservatism That Can Win Again</a>, on May 27th.</i></p><p><b>VD: George W. Bush campaigned as a nominal conservative but the manner in which he governed was obviously non-conservative both home and abroad.  How does the great public distaste for his administration somehow translate into a need to abandon the conservative principles that he never instituted?</b></p><p>DF: There’s a natural tendency among conservatives to believe that if you’re in trouble, it’s because you weren’t enough like you.  Be more yourself and people will like you better.  I call this the English Tourist approach to politics; if people don’t understand you, just say the same thing over again louder and slower.  The reason George Bush campaigned as he did, and the reason that he governed as he did, was because he correctly analyzed the politics of the late ’90’s.  The conservative brand was already in trouble in the late 1990’s.  Let’s remember that the parties of the Left in 2000 drew more votes than the party of the right.  You add together what Al Gore got with what Ralph Nader got and they beat the Republicans by three percent of the popular vote.  So, there was a problem.  He set out to deal with that problem by holding onto the parts of the conservative message that were most popular while adding to it other things.</p><p>The problem that George Bush got into was not that he wasn’t pure enough, the problem is that he had a correct diagnosis but he came up with a purely communications strategy for dealing with the problem.  It wasn’t a policy strategy, he didn’t have policies that would make real improvements in people’s lives, but he did have some messages that allowed him to evade and cope with the adverse political realities of the year 2000.  The closer I look at this and the more I think about it, the more convinced I am that if a more principled, more pure conservative had run in 2000, he would have lost very, very badly.</p><p><b>If we follow that logic, what would have been the results of a Bush government that had governed more conservatively, because it’s hard to imagine that he would have become less popular than he is today?</b></p><p>What do we mean when we say “if he had governed more conservatively?”</p><p><b>I would say abandoning things like the prescription drug policy, abandoning things like the unpopular policy of open immigration, the judge nominations, and other actions where he went directly against his Republican base.</b></p><p>Let’s break those out.  Had George Bush not promised a prescription drug benefit in his campaign – and I say this as someone who does not approve of the prescription drug benefit – I don’t think George Bush could have won that election.  It is a program that is supported by between 80 and 90 percent of the American people.  And so had he not promised it, he would not have been elected.   Having promised it, had he not delivered on what was probably the most popular of his domestic policy items, I think he would have had great political trouble in 2004.  Now, open immigration or relatively open immigration, there I agree with you and George Bush adopted a policy that was both bad policy and unpopular.  That was, alas, an example of the president being truly principled.  For him, this really is a principle.  It’s also an example of a political miscalculation.  They got the country wrong.  Where the country was, what the policy was, they made a whole series of mistakes about that.</p><p>The lesson I draw  from that is not that had you had a more principled and consistent conservative that it would be better, the conclusion I would draw from that is that you have to be a very careful student of where the public is, what’s reasonable, what’s doable, and whether your principles actually work.</p><p><b>Is it correct to say that in a broad sense, your advice in <i>Comeback</i> involves abandoning unpopular principles in favor of electoral strategies that are capable of winning?</b></p><p>When I think of politics, I distinguish between three things: principles, policies, and narrative.  A principle is a core ideological commitment like limited government.  A principle also fairly general.  It doesn’t always give you an immediate direction as to what you should do when you sit down at a desk and take over in government.  Your principles yield policies.  The policies have to be explained and defended with narratives that relate them to people’s lives.   My challenge to conservatism is less to change principles – I think we want to defend and protect principles – it’s much more about the need to modernize policies.  One of the really dangerous things that conservative tend to do is to fetishize policies.  We turn policies into principles.  I can remember when the urban enterprise zone was a litmus test issue.  If you were a real conservative you believed in the urban enterprise zone, if you didn’t believe in it then you weren’t a real conservative.  But the urban enterprise zone is a policy, not a principle, and it was a policy that turned out to be mistaken.  It was based on a mistaken analysis of what was damaging America’s cities in the 1980’s.  We never did do the urban enterprise zone and yet we got the urban recovery anyway, because it turned out that it was crime rather than overregulation that was the major problem that American cities faced.</p><p>So, my advice is that we should be very wary about turning policies into principles.  Another example is the policy of trying to reduce the top rate of the Federal personal income tax.  We have made that a philosophical principle, but there are a lot of different taxes and in a time of fiscal stringency, which is what we are moving into, it’s going to be very difficult to cut any of them.  You need to have a really hard-headed analysis about which of these taxes is most damaging to the American economy.  You cannot make this policy prescription, left over from the 1970’s, into a test of philosophical purity.</p><p><b>I thought one of the more astute observations you made was that in a time when 50 percent of the American public doesn’t pay income taxes, payroll taxes are a much more important factor from the political perspective.</b></p><p>Not as important a factor, by the way, as health care.  If you look at the personal economy of people in the middle of the income distribution, for them, health care functions like a tax.  It is the thing that is cutting into their income.  They’re getting the same benefit, or actually, it’s deteriorating from their point of view even if it’s more technologically sophisticated, but it costs more.  Fewer things are covered, you have to pay higher co-pays, it’s a degrading benefit but you are paying a larger and larger slice of your claim on the American economy to buy it.  I think that is a really important consideration, so if you believe in the principle of limited government, but the idea that we’re always going to approach limited government in exactly the same way that we did in 1977 is to have fossilized thinking.</p><p><b>In light of this concept of not clinging to unpopular or outmoded policies that have become principles, how would you justify the continued Republican support for the unpopular War on Terror and the continued foreign military occupations?</b></p><p>I would say two things.  One is that I note how the Iraq war is become much less unpopular, all the time, as the success of the recent tactics kick in.  Before we started talking, I was just reading the latest Pew Survey, released earlier in the spring, that shows a dramatic surge and change in American views of both what they think about the war and what they think the policy should be.  We now have a statistical dead heat between those who want to keep troops in Iraq and bring troops home gradually.  Only about 14 pe<br> rcent of the country supports the Obama policy of bringing the troops home immediately or very rapidly.  So that’s one thing.   The second is that not losing wars is a core principle, it’s one of my core principles.  Whatever you think of the war, and I supported it from the start but whether you supported it or not, the decision to lose it is a very different thing than the decision to start it.</br></p><p>And finally, I would say that when we say what will it mean in the 21st century to be a conservative, to be a member of the party of the center-right in any of the advanced industrial democracies, but especially the United States, it begins with the defense of the nation.  Because one of the things I think I see in our politics is that left and right are much less divided by economics in these years than they were half a century ago.  The differences are becoming ever more minute, ever more technical, and ever more about means.  On the social issues that have become so important to Republicans we can see also that the country is shifting in ways that are very different from the politics we’ve been used to in the past.  But this divide about which party is the party of the nation, of national independence, of national self-defense, this remains as acute and as powerful as ever.  If Republicans and conservatives lose their identity on that, I don’t know what is left of them.  There is an idea, and I suppose you may share it, that the party of the center right should be a party of consistent libertarianism.  But that’s just not where these societies are.  I myself am not a libertarian.</p><p><b>I am a libertarian and I agree with you.  There’s simply not enough people there.</b></p><p>There’s 8 to 10 percent of the population there.  Maybe.</p><p><b>That’s generous.</b></p><p>That can’t be the basis of your coalition.  What is the basis of your center-right party is the constellation of ideas including national self-defense, winning wars, and national identity, which involves the immigration issue and other such issues.  Those are going to be the real battleground of politics and you can’t be pushed off that.</p><p><b>Looking at national identity as an important battleground of the future, aren’t the Republicans largely on the wrong side of the national sovereignty issue?  At least, the branch of the Republican party that is enthusiastic about the Law of the Sea Treaty, NAFTA and these other supra-national organizations.</b></p><p>Here’s where I distinguish between philosophy and policy.  If my philosophy is that you want to advance the interest of the nation, to defend the right of the nation to make its own decisions, then you have to decide which of these global interests and these series of global partnerships do respect that national identity and national sovereignty and which of them are threatening to it.  It then becomes a very empirical matter, which of these agreements are advantageous and which are disadvantageous.  There, I think you can’t be doctrinaire.  You look at NAFTA.  I was very strongly in favor of NAFTA, certainly the US-Canada free trade agreement, NAFTA a little bit less, back in 1994.  Looking back, I think NAFTA did much less good than I expected.  Much less good for the United States, much less good for Mexico and it’s pretty much a wash for the Canadian point of view.</p><p><b>But haven’t we learned anything from the transformation of the European Common Market into the governing European Union?  Don’t we need to pay attention to those possible threats to national sovereignty?</b></p><p>I don’t think that’s a good comparison.  What was wrong with NAFTA is not that it was a threat to national sovereignty.  NAFTA has no institutional guiding mechanisms.  It has no political component.  It is in no way comparable to the European Union.  The problem with NAFTA… had you asked me in the early ’90’s what I expected to happen, I would have said that I expected NAFTA to generate industrial employment in Mexico that would absorb the surplus of Mexican agricultural labor that was going to be displaced by the superior efficiency of American agriculture.  What happened instead was American’s agriculture proved so stunningly more efficient that it transformed the way agriculture was done in Mexico and it shook a lot of agricultural laborers off the land.  They lost their work.  But, it did not generate nearly as much industrial employment in Mexico as I would have expected, largely because the advent of China onto the world scene, with the result that many of those displaced agricultural laborers ended up moving to the United States.  So, whereas I thought in 1994 that NAFTA would be a means to curb migration and illegal migration from Mexico to the United States, in fact it ended up stimulating it.  That’s the diagnosis of NAFTA, but there is no NAFTA super-government.  That problem isn’t there.   The United States, Canada, and Mexico do their business the same way they’ve always done at the government level.</p><p><b>One of the things I thought was tremendously insightful about <i>Comeback</i> was looking at prison reform as an aspect of a law-and-order policy.</b></p><p>This has been on my mind for a long time.  One of the things they required us to do when I was in law school was to visit a prison.  It was a haunting experience.  Even when it’s good, it’s terrible.  We have sent so many people to prison as part of a policy we advocated as conservatives and we were right about it.  But there’s a moral element of the issue which entails the abuses that occur in American prisons and there’s a pragmatic element which is how the policy tends to break down and become unsustainable.  As the crime problem abates, people forget how bad it used to be.  If your prisons are inhumane and people forget why you ever sent people there, you’ll then have a weakening of resolve for any effective crime policy.  I think it has a big impact on the voting attitudes of black America, where it touches people.  People have cousins, nephews and children there; I forget the exact number but there’s a very high proportion of African-Americans who undergo this experience.  If it seems brutal, if it seems that society has written these people off who go there, that is a message that has a very negative effect.  If it’s Republicans and conservatives who seem the most enthusiastic or indifferent about what happens to the people who go there, it has a big impact on how we’re perceived.</p><p><b>One thing that struck my mind when I was reading that section was a study on Thucydides I’ve been doing with some people on the blog.  It occurred to me that since the USA jails so many people with skills that other countries would find useful, bringing back some sort of exile might make sense.  Some third world countries might like to have the services of the guy who was running Enron at their disposal and be willing to pay for it.  You could kill two birds with one stone that way.</b></p><p>I’ll tell you, I had never thought about that.  It’s an interesting thought.  Let me brood about that.</p><p><b>I thought one of the more unexpected concepts you produced was an alliance with India as a potential replacement for a demographically declining Europe.  How do you see that fitting into the political nexus you’ve been contemplating in <i>Comeback</i>?</b></p><p>One of the bigger themes of <i>Comeback</i> is how the world around us changes faster than our minds are prepared to absorb.  That’s the big theme of this book, is that change is the great fact of human life.  Since 2001, we have had this tremendous debate inside the United States.  People have accused George Bush, the Republicans, the neoconservatives, Donald Rumsfeld and so forth, of not being sensitive enough to the concerns of our European allies and how the answer to problem after problem is to work more closely with our traditional European allies.  Now, I’m a big believer in working with the traditional European allies when we can.  But it is such a reactionary thought to say that and n<br> ot to notice how the power of America’s European allies is ebbing away.  This is not a prospective thing, it’s something that is well in place already.  I’m not thinking here about just population, because those changes are still fairly far out into the future.  But in economic terms, Europe’s share of world GDP is declining at a rapid pace, certainly compared to 1985.   They’re paying for their pensions and other obligations, so they can’t afford to pay for an effective military anymore.  They may have manpower, but if you don’t have equipment to go with it, you can’t be on a modern battlefield.  My father-in-law was in Korea with the Canadian forces, he came under American friendly fire and he lived to tell the tale.  Well, if you come under American friendly fire today, you do not live to tell the tale.  If you’re going to be on a battlefield where Americans are shooting, you’d better have some very sophisticated friend-or-foe technology and if you haven’t invested in that, it’s too dangerous to be on that battlefield.  Our European friends have not invested in that.  They are going to be a declining force in international politics; they already are.  Sometimes people say that with a certain sense of grim satisfaction, I say that with none.  The United States is in danger of being left alone in a world that is increasingly uncongenial to the democratic idea.  So, it’s going to need to make new kinds of friends.</br></p><p>If you look around and say who is going to have the heft and the power, and who has enough democratic identity to play that role, India is the logical candidate.  But it’s going to be a very difficult relationship.  Otto von Bismarck is supposed to have said that the most important fact of world politics in the 20th century was that Britain and the United States spoke the same language, well, the United States and the Indian elite speak the same language.  But they have a very different history, so the relationship is going to be a lot more different to organize.  There are historical grievances, resentments, and the cultures are much farther apart than the United States and its traditional European allies were.  That said, the two will need each other, and on the basis of that there may be an interest-based relationship that can be constructed.</p><p>Now, how does that fit into the rest of the book?  It does so in two ways.  The core concern of the book is about my conservatism, which is first and foremost a belief system about the greatness and power of the United States.  So, when I think about the economic reforms I want to see, the social reforms, the foreign policy reforms, you need to reaffirm, in a very competitive world, the greatness and power of the United States.  But second, it’s an example of how you need to not allow decisions about the future to be clouded by remembrances of the way things used to be.  Maybe it was a better and easier world when the United States and its traditional European allies produced half of the world’s output, but that world is gone.  No matter how much you wish it wasn’t gone, it’s gone.  In politics, you have to make your plans based on facts as they are.  On a whole range of political issues, I think we have to have the firmness and the future-mindedness to say that we’re going to deal with the world as we find it.</p><p><b>Finally, on an unrelated note, I just wanted to compliment you on <a href=\"http://frum.nationalreview.com/post/?q=NzEyMmJkNmZiZjJjNjc4NTFhZTQwZGJlZmU1OTJjMGM=\">your Bookshelf</a>.  I think it’s fantastic and I do follow it avidly.</b></p><p>Thank you.  It’s the weirdest thing, I just started doing it and I get like four times as much response… I thought this was just a complete personal idiosyncracy and it’s the thing that people seem to really like.  Everybody feels like they don’t have enough time to read, they want to know what to read, and people who read blogs are readers.</p></div>",
  "content_text": "Vox Day interviewed David Frum, the author of\nComeback: Conservatism That Can Win Again\n, on May 27th.\nVD: George W. Bush campaigned as a nominal conservative but the manner in which he governed was obviously non-conservative both home and abroad.  How does the great public distaste for his administration somehow translate into a need to abandon the conservative principles that he never instituted?\nDF: There’s a natural tendency among conservatives to believe that if you’re in trouble, it’s because you weren’t enough like you.  Be more yourself and people will like you better.  I call this the English Tourist approach to politics; if people don’t understand you, just say the same thing over again louder and slower.  The reason George Bush campaigned as he did, and the reason that he governed as he did, was because he correctly analyzed the politics of the late ’90’s.  The conservative brand was already in trouble in the late 1990’s.  Let’s remember that the parties of the Left in 2000 drew more votes than the party of the right.  You add together what Al Gore got with what Ralph Nader got and they beat the Republicans by three percent of the popular vote.  So, there was a problem.  He set out to deal with that problem by holding onto the parts of the conservative message that were most popular while adding to it other things.\nThe problem that George Bush got into was not that he wasn’t pure enough, the problem is that he had a correct diagnosis but he came up with a purely communications strategy for dealing with the problem.  It wasn’t a policy strategy, he didn’t have policies that would make real improvements in people’s lives, but he did have some messages that allowed him to evade and cope with the adverse political realities of the year 2000.  The closer I look at this and the more I think about it, the more convinced I am that if a more principled, more pure conservative had run in 2000, he would have lost very, very badly.\nIf we follow that logic, what would have been the results of a Bush government that had governed more conservatively, because it’s hard to imagine that he would have become less popular than he is today?\nWhat do we mean when we say “if he had governed more conservatively?”\nI would say abandoning things like the prescription drug policy, abandoning things like the unpopular policy of open immigration, the judge nominations, and other actions where he went directly against his Republican base.\nLet’s break those out.  Had George Bush not promised a prescription drug benefit in his campaign – and I say this as someone who does not approve of the prescription drug benefit – I don’t think George Bush could have won that election.  It is a program that is supported by between 80 and 90 percent of the American people.  And so had he not promised it, he would not have been elected.   Having promised it, had he not delivered on what was probably the most popular of his domestic policy items, I think he would have had great political trouble in 2004.  Now, open immigration or relatively open immigration, there I agree with you and George Bush adopted a policy that was both bad policy and unpopular.  That was, alas, an example of the president being truly principled.  For him, this really is a principle.  It’s also an example of a political miscalculation.  They got the country wrong.  Where the country was, what the policy was, they made a whole series of mistakes about that.\nThe lesson I draw  from that is not that had you had a more principled and consistent conservative that it would be better, the conclusion I would draw from that is that you have to be a very careful student of where the public is, what’s reasonable, what’s doable, and whether your principles actually work.\nIs it correct to say that in a broad sense, your advice in\nComeback\ninvolves abandoning unpopular principles in favor of electoral strategies that are capable of winning?\nWhen I think of politics, I distinguish between three things: principles, policies, and narrative.  A principle is a core ideological commitment like limited government.  A principle also fairly general.  It doesn’t always give you an immediate direction as to what you should do when you sit down at a desk and take over in government.  Your principles yield policies.  The policies have to be explained and defended with narratives that relate them to people’s lives.   My challenge to conservatism is less to change principles – I think we want to defend and protect principles – it’s much more about the need to modernize policies.  One of the really dangerous things that conservative tend to do is to fetishize policies.  We turn policies into principles.  I can remember when the urban enterprise zone was a litmus test issue.  If you were a real conservative you believed in the urban enterprise zone, if you didn’t believe in it then you weren’t a real conservative.  But the urban enterprise zone is a policy, not a principle, and it was a policy that turned out to be mistaken.  It was based on a mistaken analysis of what was damaging America’s cities in the 1980’s.  We never did do the urban enterprise zone and yet we got the urban recovery anyway, because it turned out that it was crime rather than overregulation that was the major problem that American cities faced.\nSo, my advice is that we should be very wary about turning policies into principles.  Another example is the policy of trying to reduce the top rate of the Federal personal income tax.  We have made that a philosophical principle, but there are a lot of different taxes and in a time of fiscal stringency, which is what we are moving into, it’s going to be very difficult to cut any of them.  You need to have a really hard-headed analysis about which of these taxes is most damaging to the American economy.  You cannot make this policy prescription, left over from the 1970’s, into a test of philosophical purity.\nI thought one of the more astute observations you made was that in a time when 50 percent of the American public doesn’t pay income taxes, payroll taxes are a much more important factor from the political perspective.\nNot as important a factor, by the way, as health care.  If you look at the personal economy of people in the middle of the income distribution, for them, health care functions like a tax.  It is the thing that is cutting into their income.  They’re getting the same benefit, or actually, it’s deteriorating from their point of view even if it’s more technologically sophisticated, but it costs more.  Fewer things are covered, you have to pay higher co-pays, it’s a degrading benefit but you are paying a larger and larger slice of your claim on the American economy to buy it.  I think that is a really important consideration, so if you believe in the principle of limited government, but the idea that we’re always going to approach limited government in exactly the same way that we did in 1977 is to have fossilized thinking.\nIn light of this concept of not clinging to unpopular or outmoded policies that have become principles, how would you justify the continued Republican support for the unpopular War on Terror and the continued foreign military occupations?\nI would say two things.  One is that I note how the Iraq war is become much less unpopular, all the time, as the success of the recent tactics kick in.  Before we started talking, I was just reading the latest Pew Survey, released earlier in the spring, that shows a dramatic surge and change in American views of both what they think about the war and what they think the policy should be.  We now have a statistical dead heat between those who want to keep troops in Iraq and bring troops home gradually.  Only about 14 pe\nrcent of the country supports the Obama policy of bringing the troops home immediately or very rapidly.  So that’s one thing.   The second is that not losing wars is a core principle, it’s one of my core principles.  Whatever you think of the war, and I supported it from the start but whether you supported it or not, the decision to lose it is a very different thing than the decision to start it.\nAnd finally, I would say that when we say what will it mean in the 21st century to be a conservative, to be a member of the party of the center-right in any of the advanced industrial democracies, but especially the United States, it begins with the defense of the nation.  Because one of the things I think I see in our politics is that left and right are much less divided by economics in these years than they were half a century ago.  The differences are becoming ever more minute, ever more technical, and ever more about means.  On the social issues that have become so important to Republicans we can see also that the country is shifting in ways that are very different from the politics we’ve been used to in the past.  But this divide about which party is the party of the nation, of national independence, of national self-defense, this remains as acute and as powerful as ever.  If Republicans and conservatives lose their identity on that, I don’t know what is left of them.  There is an idea, and I suppose you may share it, that the party of the center right should be a party of consistent libertarianism.  But that’s just not where these societies are.  I myself am not a libertarian.\nI am a libertarian and I agree with you.  There’s simply not enough people there.\nThere’s 8 to 10 percent of the population there.  Maybe.\nThat’s generous.\nThat can’t be the basis of your coalition.  What is the basis of your center-right party is the constellation of ideas including national self-defense, winning wars, and national identity, which involves the immigration issue and other such issues.  Those are going to be the real battleground of politics and you can’t be pushed off that.\nLooking at national identity as an important battleground of the future, aren’t the Republicans largely on the wrong side of the national sovereignty issue?  At least, the branch of the Republican party that is enthusiastic about the Law of the Sea Treaty, NAFTA and these other supra-national organizations.\nHere’s where I distinguish between philosophy and policy.  If my philosophy is that you want to advance the interest of the nation, to defend the right of the nation to make its own decisions, then you have to decide which of these global interests and these series of global partnerships do respect that national identity and national sovereignty and which of them are threatening to it.  It then becomes a very empirical matter, which of these agreements are advantageous and which are disadvantageous.  There, I think you can’t be doctrinaire.  You look at NAFTA.  I was very strongly in favor of NAFTA, certainly the US-Canada free trade agreement, NAFTA a little bit less, back in 1994.  Looking back, I think NAFTA did much less good than I expected.  Much less good for the United States, much less good for Mexico and it’s pretty much a wash for the Canadian point of view.\nBut haven’t we learned anything from the transformation of the European Common Market into the governing European Union?  Don’t we need to pay attention to those possible threats to national sovereignty?\nI don’t think that’s a good comparison.  What was wrong with NAFTA is not that it was a threat to national sovereignty.  NAFTA has no institutional guiding mechanisms.  It has no political component.  It is in no way comparable to the European Union.  The problem with NAFTA… had you asked me in the early ’90’s what I expected to happen, I would have said that I expected NAFTA to generate industrial employment in Mexico that would absorb the surplus of Mexican agricultural labor that was going to be displaced by the superior efficiency of American agriculture.  What happened instead was American’s agriculture proved so stunningly more efficient that it transformed the way agriculture was done in Mexico and it shook a lot of agricultural laborers off the land.  They lost their work.  But, it did not generate nearly as much industrial employment in Mexico as I would have expected, largely because the advent of China onto the world scene, with the result that many of those displaced agricultural laborers ended up moving to the United States.  So, whereas I thought in 1994 that NAFTA would be a means to curb migration and illegal migration from Mexico to the United States, in fact it ended up stimulating it.  That’s the diagnosis of NAFTA, but there is no NAFTA super-government.  That problem isn’t there.   The United States, Canada, and Mexico do their business the same way they’ve always done at the government level.\nOne of the things I thought was tremendously insightful about\nComeback\nwas looking at prison reform as an aspect of a law-and-order policy.\nThis has been on my mind for a long time.  One of the things they required us to do when I was in law school was to visit a prison.  It was a haunting experience.  Even when it’s good, it’s terrible.  We have sent so many people to prison as part of a policy we advocated as conservatives and we were right about it.  But there’s a moral element of the issue which entails the abuses that occur in American prisons and there’s a pragmatic element which is how the policy tends to break down and become unsustainable.  As the crime problem abates, people forget how bad it used to be.  If your prisons are inhumane and people forget why you ever sent people there, you’ll then have a weakening of resolve for any effective crime policy.  I think it has a big impact on the voting attitudes of black America, where it touches people.  People have cousins, nephews and children there; I forget the exact number but there’s a very high proportion of African-Americans who undergo this experience.  If it seems brutal, if it seems that society has written these people off who go there, that is a message that has a very negative effect.  If it’s Republicans and conservatives who seem the most enthusiastic or indifferent about what happens to the people who go there, it has a big impact on how we’re perceived.\nOne thing that struck my mind when I was reading that section was a study on Thucydides I’ve been doing with some people on the blog.  It occurred to me that since the USA jails so many people with skills that other countries would find useful, bringing back some sort of exile might make sense.  Some third world countries might like to have the services of the guy who was running Enron at their disposal and be willing to pay for it.  You could kill two birds with one stone that way.\nI’ll tell you, I had never thought about that.  It’s an interesting thought.  Let me brood about that.\nI thought one of the more unexpected concepts you produced was an alliance with India as a potential replacement for a demographically declining Europe.  How do you see that fitting into the political nexus you’ve been contemplating in\nComeback\n?\nOne of the bigger themes of\nComeback\nis how the world around us changes faster than our minds are prepared to absorb.  That’s the big theme of this book, is that change is the great fact of human life.  Since 2001, we have had this tremendous debate inside the United States.  People have accused George Bush, the Republicans, the neoconservatives, Donald Rumsfeld and so forth, of not being sensitive enough to the concerns of our European allies and how the answer to problem after problem is to work more closely with our traditional European allies.  Now, I’m a big believer in working with the traditional European allies when we can.  But it is such a reactionary thought to say that and n\not to notice how the power of America’s European allies is ebbing away.  This is not a prospective thing, it’s something that is well in place already.  I’m not thinking here about just population, because those changes are still fairly far out into the future.  But in economic terms, Europe’s share of world GDP is declining at a rapid pace, certainly compared to 1985.   They’re paying for their pensions and other obligations, so they can’t afford to pay for an effective military anymore.  They may have manpower, but if you don’t have equipment to go with it, you can’t be on a modern battlefield.  My father-in-law was in Korea with the Canadian forces, he came under American friendly fire and he lived to tell the tale.  Well, if you come under American friendly fire today, you do not live to tell the tale.  If you’re going to be on a battlefield where Americans are shooting, you’d better have some very sophisticated friend-or-foe technology and if you haven’t invested in that, it’s too dangerous to be on that battlefield.  Our European friends have not invested in that.  They are going to be a declining force in international politics; they already are.  Sometimes people say that with a certain sense of grim satisfaction, I say that with none.  The United States is in danger of being left alone in a world that is increasingly uncongenial to the democratic idea.  So, it’s going to need to make new kinds of friends.\nIf you look around and say who is going to have the heft and the power, and who has enough democratic identity to play that role, India is the logical candidate.  But it’s going to be a very difficult relationship.  Otto von Bismarck is supposed to have said that the most important fact of world politics in the 20th century was that Britain and the United States spoke the same language, well, the United States and the Indian elite speak the same language.  But they have a very different history, so the relationship is going to be a lot more different to organize.  There are historical grievances, resentments, and the cultures are much farther apart than the United States and its traditional European allies were.  That said, the two will need each other, and on the basis of that there may be an interest-based relationship that can be constructed.\nNow, how does that fit into the rest of the book?  It does so in two ways.  The core concern of the book is about my conservatism, which is first and foremost a belief system about the greatness and power of the United States.  So, when I think about the economic reforms I want to see, the social reforms, the foreign policy reforms, you need to reaffirm, in a very competitive world, the greatness and power of the United States.  But second, it’s an example of how you need to not allow decisions about the future to be clouded by remembrances of the way things used to be.  Maybe it was a better and easier world when the United States and its traditional European allies produced half of the world’s output, but that world is gone.  No matter how much you wish it wasn’t gone, it’s gone.  In politics, you have to make your plans based on facts as they are.  On a whole range of political issues, I think we have to have the firmness and the future-mindedness to say that we’re going to deal with the world as we find it.\nFinally, on an unrelated note, I just wanted to compliment you on\nyour Bookshelf\n.  I think it’s fantastic and I do follow it avidly.\nThank you.  It’s the weirdest thing, I just started doing it and I get like four times as much response… I thought this was just a complete personal idiosyncracy and it’s the thing that people seem to really like.  Everybody feels like they don’t have enough time to read, they want to know what to read, and people who read blogs are readers.",
  "tags": [],
  "categories": [],
  "sitemap_lastmod": "2008-06-01T23:01:00+00:00"
}