{
  "url": "https://voxday.net/2008/06/13/irish-eu-vote/",
  "scraped_at": "2026-01-08T22:27:15.362948",
  "title": "The Irish EU vote",
  "date_display": "June 13, 2008",
  "date_iso": "2008-06-13T05:08:00+00:00",
  "date_from_url": "2008-06-13",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>Isn’t it a bit strange that there still hasn’t been any news released on the result of yesterday’s vote by the Irish people on the <s>European Constitution</s>Lisbon Treaty?  If the result of the referendum had been Yes, I expected there would be triumphal headlines trumpeted all across Europe this morning.  Instead there’s… total silence.</p><p>So, what happened?  Have they hired Mugabe’s vote counters for this one?  All I’ve seen so far is some early commentary on turnout being low, which is presumably good for the No vote if history is an accurate guide.  Here’s hoping the Irish had the good sense to kill the Imperial Europe dream for the third time in three centuries.</p><p>UPDATE – Good news… for now.  But, unsurprisingly, the <s>Bonapartistes</s> <s>Nazis</s> Eurofascists <a href=\"http://www.timesonline.co.uk/tol/news/world/europe/article4128055.ece\">aren’t about to quit</a> trying to force the Irish to vote and vote again until they have no right to vote anymore:</p><blockquote><p>Ireland has voted No to the Lisbon Treaty, plunging the European Union into a new crisis.  With results coming in from across the country, a final result of 52 per cent against and 48 per cent in favour of the treaty was rapidly hardening. A final declaration is not expected until after 4 pm….  The senior figure admitted that in spite of Brian Cowen’s assurance on the eve of voting that a rerun – as happened after the Irish rejected the Nice treaty in 2001 – would not occur, it was now much more likely.</p></blockquote><p>It’s also outrageous how the media is complaining about 3 million voters deciding the fate of nearly 500 million people.  They would do much better to point their finger at the political elite that has lied and schemed and plotted to prevent the other 497 million  from being permitted the chance to vote on their own fate… and ignored the clear wishes of the French and Dutch voters.</p></div>",
  "content_text": "Isn’t it a bit strange that there still hasn’t been any news released on the result of yesterday’s vote by the Irish people on the\nEuropean Constitution\nLisbon Treaty?  If the result of the referendum had been Yes, I expected there would be triumphal headlines trumpeted all across Europe this morning.  Instead there’s… total silence.\nSo, what happened?  Have they hired Mugabe’s vote counters for this one?  All I’ve seen so far is some early commentary on turnout being low, which is presumably good for the No vote if history is an accurate guide.  Here’s hoping the Irish had the good sense to kill the Imperial Europe dream for the third time in three centuries.\nUPDATE – Good news… for now.  But, unsurprisingly, the\nBonapartistes\nNazis\nEurofascists\naren’t about to quit\ntrying to force the Irish to vote and vote again until they have no right to vote anymore:\nIreland has voted No to the Lisbon Treaty, plunging the European Union into a new crisis.  With results coming in from across the country, a final result of 52 per cent against and 48 per cent in favour of the treaty was rapidly hardening. A final declaration is not expected until after 4 pm….  The senior figure admitted that in spite of Brian Cowen’s assurance on the eve of voting that a rerun – as happened after the Irish rejected the Nice treaty in 2001 – would not occur, it was now much more likely.\nIt’s also outrageous how the media is complaining about 3 million voters deciding the fate of nearly 500 million people.  They would do much better to point their finger at the political elite that has lied and schemed and plotted to prevent the other 497 million  from being permitted the chance to vote on their own fate… and ignored the clear wishes of the French and Dutch voters.",
  "tags": [],
  "categories": [],
  "sitemap_lastmod": "2008-06-13T04:08:00+00:00"
}