{
  "url": "https://voxday.net/2008/06/24/no-loss/",
  "scraped_at": "2026-01-08T22:28:20.542226",
  "title": "No loss",
  "date_display": "June 24, 2008",
  "date_iso": "2008-06-24T18:35:00+00:00",
  "date_from_url": "2008-06-24",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>I never thought George Carlin was funny.  Not even a little bit.  It wasn’t due to his language or anything, whether it was Carlin’s lame routine about seven words or his cameos in movies like Dogma, I just thought he was lame, boring, and obvious from the start and never saw any reason to change my opinion.  His uttered wisdom, such as it was, seemed design to impress those with average IQs; they were chock full of the illusion of intelligence rather than anything approaching the real thing.</p><p>The Original Cyberpunk was impressed by Carlin in his younger years, but he <a href=\"http://rantingroom.blogspot.com/2006/07/difference-between-humor-and-odor.html\">eventually grew out of it</a>.  I’m tempted to say that it’s amazing how many people never did, but then I reflect back upon that magical moment in Paris and all is right with the world again.</p><blockquote><p>Now, how can I say this? “This book is bad.” No, that’s inadequate. “This book is stunningly awful.” No, still not there. How about, “Carlin’s collection of allegedly humorous quips and stories is a week-old turd sautéed in dog vomit over a flaming fart.”</p><p>Yes, I think that begins to get close to it.</p></blockquote><p>UPDATE – CB fails to note the irony in his response: <i>“Honestly Vox, Carlin just died. The body isnt even cold yet and your talking about what hack he was and how his death is ‘No Loss’. Have alittle bit of class.”</i></p><p>Let me get this straight.  An individual who devoted his entire career to tearing down tradition and encouraging disrespect and believed that humans are nothing more than meaningless collections of atoms is no more, so we should therefore, on the basis of the respect traditionally shown for the dead, refrain from discussing him and the quality of his past work as if they were anything more significant than an empty espresso cup or the pile of partially digested intestinal refuse deposited in the backyard by the dog?</p><p>I don’t think so.  Carlin showed no respect, therefore he merits none himself.</p></div>",
  "content_text": "I never thought George Carlin was funny.  Not even a little bit.  It wasn’t due to his language or anything, whether it was Carlin’s lame routine about seven words or his cameos in movies like Dogma, I just thought he was lame, boring, and obvious from the start and never saw any reason to change my opinion.  His uttered wisdom, such as it was, seemed design to impress those with average IQs; they were chock full of the illusion of intelligence rather than anything approaching the real thing.\nThe Original Cyberpunk was impressed by Carlin in his younger years, but he\neventually grew out of it\n.  I’m tempted to say that it’s amazing how many people never did, but then I reflect back upon that magical moment in Paris and all is right with the world again.\nNow, how can I say this? “This book is bad.” No, that’s inadequate. “This book is stunningly awful.” No, still not there. How about, “Carlin’s collection of allegedly humorous quips and stories is a week-old turd sautéed in dog vomit over a flaming fart.”\nYes, I think that begins to get close to it.\nUPDATE – CB fails to note the irony in his response:\n“Honestly Vox, Carlin just died. The body isnt even cold yet and your talking about what hack he was and how his death is ‘No Loss’. Have alittle bit of class.”\nLet me get this straight.  An individual who devoted his entire career to tearing down tradition and encouraging disrespect and believed that humans are nothing more than meaningless collections of atoms is no more, so we should therefore, on the basis of the respect traditionally shown for the dead, refrain from discussing him and the quality of his past work as if they were anything more significant than an empty espresso cup or the pile of partially digested intestinal refuse deposited in the backyard by the dog?\nI don’t think so.  Carlin showed no respect, therefore he merits none himself.",
  "tags": [],
  "categories": [],
  "sitemap_lastmod": "2008-06-24T17:35:00+00:00"
}