{
  "url": "https://voxday.net/2008/06/10/of-tails-and-brave-turning-thereof/",
  "scraped_at": "2026-01-08T22:26:55.547195",
  "title": "Of tails and the brave turning thereof",
  "date_display": "June 10, 2008",
  "date_iso": "2008-06-10T18:56:00+00:00",
  "date_from_url": "2008-06-10",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>The Fraters find a point of commonality between <a href=\"http://www.fraterslibertas.com/2008/06/and-gallantly-he-chickened-out.html\">three courageous intellectual warriors</a>:</p><blockquote><p>What do Sam Harris, Michelle Malkin, and PZ Meyers have in common?</p><p>No JB, it’s not a perky smile and a nice set of gams. Rather all three have been challenged to a debate with Vox Day on the airwaves of the First Team of the Northern Alliance Radio Network and all three have declined to take up the gauntlet.</p></blockquote><p>You know, I’m beginning to think that maybe it’s me….  I really do have to stick up for Sam here, though.  The soon-to-be Dr. Harris has always been quite willing to answer the questions I’ve emailed him and we would have already arranged a debate if he wasn’t occupied with completing his doctorate.</p><p>Malkin, on the other hand, was afraid to have her total lack of research for <i>In Defense of Internment</i> exposed.  I don’t know precisely what PZ Myers fears, but I’m sure that whatever it is, it’s a perfectly rational fear of something material.  He’s an atheist, you know.</p></div>",
  "content_text": "The Fraters find a point of commonality between\nthree courageous intellectual warriors\n:\nWhat do Sam Harris, Michelle Malkin, and PZ Meyers have in common?\nNo JB, it’s not a perky smile and a nice set of gams. Rather all three have been challenged to a debate with Vox Day on the airwaves of the First Team of the Northern Alliance Radio Network and all three have declined to take up the gauntlet.\nYou know, I’m beginning to think that maybe it’s me….  I really do have to stick up for Sam here, though.  The soon-to-be Dr. Harris has always been quite willing to answer the questions I’ve emailed him and we would have already arranged a debate if he wasn’t occupied with completing his doctorate.\nMalkin, on the other hand, was afraid to have her total lack of research for\nIn Defense of Internment\nexposed.  I don’t know precisely what PZ Myers fears, but I’m sure that whatever it is, it’s a perfectly rational fear of something material.  He’s an atheist, you know.",
  "tags": [],
  "categories": [],
  "sitemap_lastmod": "2008-06-10T17:56:00+00:00"
}