{
  "url": "https://voxday.net/2008/06/26/on-heller/",
  "scraped_at": "2026-01-08T22:28:31.481926",
  "title": "OnHeller",
  "date_display": "June 26, 2008",
  "date_iso": "2008-06-26T14:15:00+00:00",
  "date_from_url": "2008-06-26",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>The supposedly big Supreme Court decision on the Washington D.C. gun law is today, and while it has the potential to be a landmark decision in defense of the Second Amendment, I fully expect the Supreme Court to pull one of their patented weasel jobs.  The Court has a much greater tendency to get expansive in its interpretations when extending Federal power, not when limiting it.  They’re not going to uphold the DC law because it’s too much of an obvious reach, but neither are they going to defend the Constitution as written and underline the individual right to keep and bear arms.</p><p>The most likely result is the overturning of the DC law on some meaningless technicality that will allow them to safely ignore the 20,000+ unconstitutional gun laws on the books and leave things in that nebulous state that requires more of the “interpretation” that lawyers find so profitable.  I’ll be delighted to be proven wrong on this, but I’ll be very surprised if the <i>Heller</i> decision provides any clarification of the Second Amendment.</p><p>UPDATE – yes, we appear to have the full weasel in effect.  Although perhaps that judgment is a bit too harsh since they did at least destroy the “collective right” argument.  I should give them some credit for that.  Ed Whelan of Bench Memos <a href=\"http://bench.nationalreview.com/post/?q=MWI3OTFhNmIxNDc3NTRhZmYwNmE5ZDE3NWEwMjM2OWY=\">posts from the syllabus</a>:</p><p><i>(a) The Second Amendment protects an individual right to possess a firearm unconnected with service in a militia and to use that arm for traditionally lawful purposes, such as self-defense at home.</i></p><p>(b) The Second Amendment right is not unlimited.  The Court’s opinion should not cast doubt on concealed-weapons prohibitions, laws barring possession of firearms by felons and the mentally ill, laws barring firearms in sensitive places like schools and government buildings, and laws imposing conditions on commercial sale of arms.</p><p>(c) D.C.’s handgun ban and trigger-lock requirement violate the Second Amendment.  The total ban on handgun possession prohibits an entire class of arms that Americans overwhelmingly choose for the lawful purpose of self-defense.  Under any standard of scrutiny, that ban falls.  The trigger-lock requirement makes self-defense impossible.  D.C. may use a licensing scheme.</p><p>UPDATE II – It may be worse than I expected.  Scalia is apparently <a href=\"http://www.scotusblog.com/wp/heller-quotes-from-the-majority/\">denying a military purpose</a> to militia weapons in the majority opinion.  That’s both ahistorical and insane.</p><p><i>“the most natural reading of ‘keep Arms’ in the Second Amendment is to “have weapons.”</i></p><p>“The term was applied, then as now, to weapons that were not specifically designed for military use and were not employed in a military capacity.”</p><p>“Putting all of these textual elements together, we find that they guarantee the individual right to possess and carry weapons in case of confrontation.”</p><p>“Thus, we do not read the Second Amendment to protect the right of citizens to carry arms for any sort of confrontation, just as we do not read the First Amendment to protect the right of citizens to speak for any purpose.”</p><p>I’m guessing that a confrontation with the government is not going to fall within the aegis of this protected right, despite the historical context of the Constitution’s authors having very recently confronted their own lawful government with arms.</p></div>",
  "content_text": "The supposedly big Supreme Court decision on the Washington D.C. gun law is today, and while it has the potential to be a landmark decision in defense of the Second Amendment, I fully expect the Supreme Court to pull one of their patented weasel jobs.  The Court has a much greater tendency to get expansive in its interpretations when extending Federal power, not when limiting it.  They’re not going to uphold the DC law because it’s too much of an obvious reach, but neither are they going to defend the Constitution as written and underline the individual right to keep and bear arms.\nThe most likely result is the overturning of the DC law on some meaningless technicality that will allow them to safely ignore the 20,000+ unconstitutional gun laws on the books and leave things in that nebulous state that requires more of the “interpretation” that lawyers find so profitable.  I’ll be delighted to be proven wrong on this, but I’ll be very surprised if the\nHeller\ndecision provides any clarification of the Second Amendment.\nUPDATE – yes, we appear to have the full weasel in effect.  Although perhaps that judgment is a bit too harsh since they did at least destroy the “collective right” argument.  I should give them some credit for that.  Ed Whelan of Bench Memos\nposts from the syllabus\n:\n(a) The Second Amendment protects an individual right to possess a firearm unconnected with service in a militia and to use that arm for traditionally lawful purposes, such as self-defense at home.\n(b) The Second Amendment right is not unlimited.  The Court’s opinion should not cast doubt on concealed-weapons prohibitions, laws barring possession of firearms by felons and the mentally ill, laws barring firearms in sensitive places like schools and government buildings, and laws imposing conditions on commercial sale of arms.\n(c) D.C.’s handgun ban and trigger-lock requirement violate the Second Amendment.  The total ban on handgun possession prohibits an entire class of arms that Americans overwhelmingly choose for the lawful purpose of self-defense.  Under any standard of scrutiny, that ban falls.  The trigger-lock requirement makes self-defense impossible.  D.C. may use a licensing scheme.\nUPDATE II – It may be worse than I expected.  Scalia is apparently\ndenying a military purpose\nto militia weapons in the majority opinion.  That’s both ahistorical and insane.\n“the most natural reading of ‘keep Arms’ in the Second Amendment is to “have weapons.”\n“The term was applied, then as now, to weapons that were not specifically designed for military use and were not employed in a military capacity.”\n“Putting all of these textual elements together, we find that they guarantee the individual right to possess and carry weapons in case of confrontation.”\n“Thus, we do not read the Second Amendment to protect the right of citizens to carry arms for any sort of confrontation, just as we do not read the First Amendment to protect the right of citizens to speak for any purpose.”\nI’m guessing that a confrontation with the government is not going to fall within the aegis of this protected right, despite the historical context of the Constitution’s authors having very recently confronted their own lawful government with arms.",
  "tags": [],
  "categories": [],
  "sitemap_lastmod": "2008-06-26T13:15:00+00:00"
}