{
  "url": "https://voxday.net/2008/06/23/pattern-is-clarified/",
  "scraped_at": "2026-01-08T22:28:05.465697",
  "title": "A pattern is clarified",
  "date_display": "June 23, 2008",
  "date_iso": "2008-06-23T08:09:00+00:00",
  "date_from_url": "2008-06-23",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>You’ll note that since the banning of the men’s clubs, there aren’t a lot of men-and-women’s clubs left.  If this dynamic holds true in the synagogue and the church, then we should expect the non-Orthodox forms of Judaism and the mainstream denominations to follow the example of the men’s clubs and significantly decline over the next twenty years.</p><blockquote><p>“Men need to be encouraged to come back into the synagogue,” said Stuart M. Matlins, editor in chief of Jewish Lights Publishing. The Vermont-based publisher has a long list of women’s studies books, but this fall is publishing a guide for Jewish men, and next spring is publishing a modern men’s Torah commentary. “The welcoming of women into leadership positions is something I have worked very hard on, but we don’t want to lose the men.”</p><p>The phenomenon is most pronounced in the Reform movement, which is the largest branch of Judaism in the United States, but is also being observed, to a lesser extent, in conservative Judaism. In Orthodox Judaism, where traditional gender roles are maintained, a more familiar struggle is underway, as orthodox feminists agitate for greater roles in worship and possible ordination as rabbis.  There is no consensus about why women are now disproportionately represented in non-Orthodox settings, although scholars and Jewish leaders note that the pattern, although a departure from traditional Judaism, mirrors the pattern seen in mainline Protestantism.</p></blockquote><p>It’s not just religious organizations where this pattern is apparent.  If television, the SF/F publishing industry and the defunct social clubs of yore are any guide, then Mr. Matlins’s hopes are unlikely to be realized.  The men aren’t coming back.  This has some interesting implications worth considering for the games industry, which for 15 years has been preaching a mantra of seeking more appeal to women.  However, a few ill-conceived and much-covered exceptions aside, the games industry has taken what is in practice a separate-but-equal approach, wherein games are designed directly for their distinct markets rather than attempting to shoehorn everything into the one-size-fits-all approach pursued by the television industry.  There are women who play <i>GTA IV</i> and there are men who play <i>Diner Dash</i> and <i>Pet Shop Hop</i>, but the various designs are seldom modified in order to take the statistical outliers into effect.</p><p>MMO’s offer an interesting situation in this regard, since they appeal to both men and women at the moment.  However, since the social history of forcibly merging the divergent sexual dynamics into a single equalitarian dynamic is so reliably negative, it will probably be very important to maintain the distinct areas of appeal to men and women if one is to keep both groups interested in playing.</p></div>",
  "content_text": "You’ll note that since the banning of the men’s clubs, there aren’t a lot of men-and-women’s clubs left.  If this dynamic holds true in the synagogue and the church, then we should expect the non-Orthodox forms of Judaism and the mainstream denominations to follow the example of the men’s clubs and significantly decline over the next twenty years.\n“Men need to be encouraged to come back into the synagogue,” said Stuart M. Matlins, editor in chief of Jewish Lights Publishing. The Vermont-based publisher has a long list of women’s studies books, but this fall is publishing a guide for Jewish men, and next spring is publishing a modern men’s Torah commentary. “The welcoming of women into leadership positions is something I have worked very hard on, but we don’t want to lose the men.”\nThe phenomenon is most pronounced in the Reform movement, which is the largest branch of Judaism in the United States, but is also being observed, to a lesser extent, in conservative Judaism. In Orthodox Judaism, where traditional gender roles are maintained, a more familiar struggle is underway, as orthodox feminists agitate for greater roles in worship and possible ordination as rabbis.  There is no consensus about why women are now disproportionately represented in non-Orthodox settings, although scholars and Jewish leaders note that the pattern, although a departure from traditional Judaism, mirrors the pattern seen in mainline Protestantism.\nIt’s not just religious organizations where this pattern is apparent.  If television, the SF/F publishing industry and the defunct social clubs of yore are any guide, then Mr. Matlins’s hopes are unlikely to be realized.  The men aren’t coming back.  This has some interesting implications worth considering for the games industry, which for 15 years has been preaching a mantra of seeking more appeal to women.  However, a few ill-conceived and much-covered exceptions aside, the games industry has taken what is in practice a separate-but-equal approach, wherein games are designed directly for their distinct markets rather than attempting to shoehorn everything into the one-size-fits-all approach pursued by the television industry.  There are women who play\nGTA IV\nand there are men who play\nDiner Dash\nand\nPet Shop Hop\n, but the various designs are seldom modified in order to take the statistical outliers into effect.\nMMO’s offer an interesting situation in this regard, since they appeal to both men and women at the moment.  However, since the social history of forcibly merging the divergent sexual dynamics into a single equalitarian dynamic is so reliably negative, it will probably be very important to maintain the distinct areas of appeal to men and women if one is to keep both groups interested in playing.",
  "tags": [],
  "categories": [],
  "sitemap_lastmod": "2008-06-23T07:09:00+00:00"
}