{
  "url": "https://voxday.net/2008/06/05/posturing-from-bunker/",
  "scraped_at": "2026-01-08T22:26:19.049885",
  "title": "Posturing from the bunker",
  "date_display": "June 5, 2008",
  "date_iso": "2008-06-05T12:30:00+00:00",
  "date_from_url": "2008-06-05",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>PZ engages in <a href=\"http://scienceblogs.com/pharyngula/2008/06/another_blithering_apologist.php#comments\">the customary atheist chest-beating</a> about his supposed willingness to engage in intellectual combat:</p><blockquote><p>Somebody somewhere is going to have to someday point me to some intelligent arguments for gods, because I’ve sure never found them. And I know, someone is going to complain that I always pick on the weak arguments…while not bothering to tell me what the strong ones are.</p></blockquote><p>This posturing is pretty funny.  The Minnesota Atheists Talk radio show he champions is afraid to allow a paid advertisement for TIA, PZ himself doesn’t dare to so much as mention the book even though it’s inspired Sam Harris to fundamentally revise his thesis about the end of <s>faith</s>tribalism, and I’ve never seen any mention of the likes of a serious theological heavyweight.  Greg Boyd would chew him up worse than Doug Wilson destroyed Christopher Hitchens, albeit politely.</p><p>PZ, if you’re genuinely looking for an intelligent argument for gods, I’ll be happy to give you one anytime you like.  Your blog, my blog, on Northern Alliance or Minnesota Atheists radio, it makes no difference to me.  But, I rather think you won’t dare, since we both already know that you don’t have an intelligent argument for the nonexistence of gods that I haven’t already demonstrated to be flawed in one way or another.</p><p>Speaking of atheist arguments, I’ve been meaning to get around to the ten arguments that were suggested by Blackblade, Endosymbiosis, Stanford and a few others here.  Let’s start with Blackblade’s Argument from Imperfect Design.</p><p>The Argument from Imperfect Design is based on the idea that since the physical “design” of our bodies is obviously flawed, in manners that a human designer would have easily recognized and avoided, they cannot have been designed by an intelligent designer, much less an omniscient one, therefore they cannot have been purposefully designed.  This absence of purposeful design proves that the theoretical designer does not exist.  Because I do not need to argue the details in order to refute this argument, I shall concede the otherwise entirely debatable points that the human design is flawed, that a human-order intelligence could have done better, and that the Creator is more or less omniscient from a human perspective.</p><p>Now, consider John Madden NFL Football 2008 in any of its various incarnations.  There are around 1,700 virtual players existing in the game, all of whom are given ratings for various physical characteristics such as Speed, Tackling, Passing Accuracy, and so forth.  99 is the perfect rating, 0 is presumably the lowest, although one seldom sees a rating south of 50.  Of these 1,700+ players, not a single one is designed for perfection; even that rare player with an Overall rating of 99 does not possess a 99 rating for every characteristic.  (Adrian Peterson might come close in Madden 2009, except for an INJ rating in the low 70s.)</p><p>Does this observable design inefficiency indicate that there is no design inherent to John Madden NFL Football?  By no means!  Perfection would be inimical to the purpose of the game, it would be a detriment to both the simulation and the enjoyment of the player; imperfection of design is intrinsic to the game.  Now, we may not know the purpose of the game called Life, much less what, if anything, it is designed to simulate or test, but there is certainly substantial evidence in the Bible suggesting that Man’s imperfection is inherent to his design.  The Argument from Imperfect Design does legitimately call into question both the designer’s goodness as well as his omniscience, but it does not, it cannot, call his actual <i>existence</i> into question.  Now, imperfect design doesn’t prove the designer’s existence either, but it may provide us with certain clues as to our intended purposes.</p><p>It’s perhaps worth noting that the Argument from Imperfect Design also touches on a tangential issue, that of theodicy.  Now, I have little patience for such an easily settled issue that has nevertheless troubled so many inferior minds for so long, so I shall merely point out that it is as ridiculous for humans to call God’s existence into question because bad things happen as it is for the football players in a PS/3 universe to doubt the existence of John Madden because season-ending injuries are permitted to occur in his game.</p><p>Not, you understand, that I didn’t raise my eyes to the heavens, shake my fist, and cry “why, John, why?” when Adrian Peterson went down with a season-ending injury in the last game of the 2010 preseason.</p></div>",
  "content_text": "PZ engages in\nthe customary atheist chest-beating\nabout his supposed willingness to engage in intellectual combat:\nSomebody somewhere is going to have to someday point me to some intelligent arguments for gods, because I’ve sure never found them. And I know, someone is going to complain that I always pick on the weak arguments…while not bothering to tell me what the strong ones are.\nThis posturing is pretty funny.  The Minnesota Atheists Talk radio show he champions is afraid to allow a paid advertisement for TIA, PZ himself doesn’t dare to so much as mention the book even though it’s inspired Sam Harris to fundamentally revise his thesis about the end of\nfaith\ntribalism, and I’ve never seen any mention of the likes of a serious theological heavyweight.  Greg Boyd would chew him up worse than Doug Wilson destroyed Christopher Hitchens, albeit politely.\nPZ, if you’re genuinely looking for an intelligent argument for gods, I’ll be happy to give you one anytime you like.  Your blog, my blog, on Northern Alliance or Minnesota Atheists radio, it makes no difference to me.  But, I rather think you won’t dare, since we both already know that you don’t have an intelligent argument for the nonexistence of gods that I haven’t already demonstrated to be flawed in one way or another.\nSpeaking of atheist arguments, I’ve been meaning to get around to the ten arguments that were suggested by Blackblade, Endosymbiosis, Stanford and a few others here.  Let’s start with Blackblade’s Argument from Imperfect Design.\nThe Argument from Imperfect Design is based on the idea that since the physical “design” of our bodies is obviously flawed, in manners that a human designer would have easily recognized and avoided, they cannot have been designed by an intelligent designer, much less an omniscient one, therefore they cannot have been purposefully designed.  This absence of purposeful design proves that the theoretical designer does not exist.  Because I do not need to argue the details in order to refute this argument, I shall concede the otherwise entirely debatable points that the human design is flawed, that a human-order intelligence could have done better, and that the Creator is more or less omniscient from a human perspective.\nNow, consider John Madden NFL Football 2008 in any of its various incarnations.  There are around 1,700 virtual players existing in the game, all of whom are given ratings for various physical characteristics such as Speed, Tackling, Passing Accuracy, and so forth.  99 is the perfect rating, 0 is presumably the lowest, although one seldom sees a rating south of 50.  Of these 1,700+ players, not a single one is designed for perfection; even that rare player with an Overall rating of 99 does not possess a 99 rating for every characteristic.  (Adrian Peterson might come close in Madden 2009, except for an INJ rating in the low 70s.)\nDoes this observable design inefficiency indicate that there is no design inherent to John Madden NFL Football?  By no means!  Perfection would be inimical to the purpose of the game, it would be a detriment to both the simulation and the enjoyment of the player; imperfection of design is intrinsic to the game.  Now, we may not know the purpose of the game called Life, much less what, if anything, it is designed to simulate or test, but there is certainly substantial evidence in the Bible suggesting that Man’s imperfection is inherent to his design.  The Argument from Imperfect Design does legitimately call into question both the designer’s goodness as well as his omniscience, but it does not, it cannot, call his actual\nexistence\ninto question.  Now, imperfect design doesn’t prove the designer’s existence either, but it may provide us with certain clues as to our intended purposes.\nIt’s perhaps worth noting that the Argument from Imperfect Design also touches on a tangential issue, that of theodicy.  Now, I have little patience for such an easily settled issue that has nevertheless troubled so many inferior minds for so long, so I shall merely point out that it is as ridiculous for humans to call God’s existence into question because bad things happen as it is for the football players in a PS/3 universe to doubt the existence of John Madden because season-ending injuries are permitted to occur in his game.\nNot, you understand, that I didn’t raise my eyes to the heavens, shake my fist, and cry “why, John, why?” when Adrian Peterson went down with a season-ending injury in the last game of the 2010 preseason.",
  "tags": [],
  "categories": [],
  "sitemap_lastmod": "2008-06-05T11:30:00+00:00"
}