{
  "url": "https://voxday.net/2008/06/20/revisiting-assumptions/",
  "scraped_at": "2026-01-08T22:27:56.289224",
  "title": "Revisiting assumptions",
  "date_display": "June 20, 2008",
  "date_iso": "2008-06-20T15:30:00+00:00",
  "date_from_url": "2008-06-20",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>This <a href=\"http://wbztv.com/local/gloucester.high.school.2.751873.html\">teen pregnancy pact</a> suggests that one of the basic assumptions of sex ed, that ensuring teenage girls understand that pregnancy is a possible consequence of sex, will either cause them to abstain from having sex or use contraception, is not as reliable in the real world as it is in theory:</p><blockquote><p>There’s a stunning twist to the sudden rise in teen pregnancies at Gloucester High School. Seventeen students there are expecting and many of them became that way on purpose.  Time Magazine first reported that nearly half of the girls confessed to making a pact to get pregnant and raise their babies together.</p></blockquote><p>It is, of course, interesting to note the female expectation that the fathers will not be involved in the rearing of their children.  Could this be the first sign of an evolving American Amazonia?  Note to self: invest in grass hut companies….</p><p>UPDATE – Rachel Lucas <a href=\"http://rachellucas.com/index.php/2008/06/20/two-words-mandatory-sterilization\">is characteristically unperturbed</a> by this news.  While I’d take exception to a few of her assertions, I find it difficult to disagree with her conclusion on the matter:</p><blockquote><p>God, I hate teenagers.</p></blockquote><p>And yet, it is interesting that girls who reach sexual maturity have such a strong drive to do what girls who reach sexual maturity are designed to do despite their decade or so of brainwashing to the contrary.  Only in a bizarre “reality-based” secular society could this propagation of the species be deemed such a terrible thing.  I mean, let’s face it, none of these girls were going to endow the human race with nuclear fusion or a cure for cancer anyhow.</p></div>",
  "content_text": "This\nteen pregnancy pact\nsuggests that one of the basic assumptions of sex ed, that ensuring teenage girls understand that pregnancy is a possible consequence of sex, will either cause them to abstain from having sex or use contraception, is not as reliable in the real world as it is in theory:\nThere’s a stunning twist to the sudden rise in teen pregnancies at Gloucester High School. Seventeen students there are expecting and many of them became that way on purpose.  Time Magazine first reported that nearly half of the girls confessed to making a pact to get pregnant and raise their babies together.\nIt is, of course, interesting to note the female expectation that the fathers will not be involved in the rearing of their children.  Could this be the first sign of an evolving American Amazonia?  Note to self: invest in grass hut companies….\nUPDATE – Rachel Lucas\nis characteristically unperturbed\nby this news.  While I’d take exception to a few of her assertions, I find it difficult to disagree with her conclusion on the matter:\nGod, I hate teenagers.\nAnd yet, it is interesting that girls who reach sexual maturity have such a strong drive to do what girls who reach sexual maturity are designed to do despite their decade or so of brainwashing to the contrary.  Only in a bizarre “reality-based” secular society could this propagation of the species be deemed such a terrible thing.  I mean, let’s face it, none of these girls were going to endow the human race with nuclear fusion or a cure for cancer anyhow.",
  "tags": [],
  "categories": [],
  "sitemap_lastmod": "2008-06-20T14:30:00+00:00"
}