{
  "url": "https://voxday.net/2008/06/08/thucydides-and-triple-whammy/",
  "scraped_at": "2026-01-08T22:26:33.492928",
  "title": "Thucydides and the Triple Whammy",
  "date_display": "June 8, 2008",
  "date_iso": "2008-06-08T14:35:00+00:00",
  "date_from_url": "2008-06-08",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>You’ve got another week to prepare for the next section of Thucydides.  The combination of a tournament, a game, and the start of Euro 2008 all happening on the same day rendered me <i>hors de combat</i>.</p><p>As for Euro 2008, my thoughts are as follows:</p><p>1.  The Italians were my clear favorites until Cannevaro got hurt in training.  The Germans are everyone else’s favorites, but I have my doubts about their strikers and their keeper.  The French strikers are also dubious; Henry isn’t what he once was and he’s never performed that well on the world stage anyhow.  And after Greece won last time – roughly the European soccer equivalent of Appalachian State winning the national title via the BCS – it seems almost insane to bother making picks.  I guess I still see the Azzurri as favorites, just not as clearly, thanks to their depth.  I know they’re squabbling in camp and the prima donnas are clashing over everything from playing time to mirror time, but when has this ever not been the case? <i>Avanti Azzurri!</i></p><p>2.  The Swiss were robbed last night.  A handball no-call cost them a penalty and then they hit the woodwork on what should have been an easy put-away.  While Frei isn’t the loss he’s reported to be and Yakin is much better up front, they really needed the point that a tie would have given them.  With Turkey looking very beatable and Portugal looking very not-beatable, the first game probably settled the group in the Czech Republic’s favor.  It just goes to show how the defense should <i>never</i> push forward on a partial clear.</p><p>3.  The Portuguese took a while to get going, but they are going to make some noise in this tournament.  What was a 2-0 game could have just as easily been 5-0 were it not for the goalkeeper’s friend coming to the Turkish defense no less than three times.  They’ll walk through the group stage; I loathe Cristiano Ronaldo but he is probably the best player in the tournament since Kaka’ and the rest of the Brazilians aren’t in it.</p><p>4.  I’ve never seen Turkey look this weak.  They looked like they could easily manage to lose to both Switzerland and the Czech Republic.</p><p>5.  If Spacebunny leaves me, it will apparently be for a member of the Swedish national team.  Is it a bad sign that she suggested a road trip next week to watch one of their practices?</p><p>Speaking of woodwork and goalkeepers, I tried a new kid in goal for the first time last week, mostly because he can punt the ball well.  He only played two games before breaking a finger, but he allowed just two goals in those two games.  I didn’t think much of it at the time, but after the tournament a scout for Black, the pro team, asked if he’d be available next year to join their kids team at the next level up.  I basically scoffed at this… until the tournament yesterday.  The boy’s finger was recovered enough to play and this time he allowed ten goals in five games, but six of them were against the other big program, Blue, and of the ten only two of them were even remotely stoppable.  He saved at least five shots that I was sure were going in, which was why we went 3-1-1 in the tournament but had Blue inquiring about him for next year as well.</p><p>I’ve had three other kids graduate to Black over the last five years, but this one is the most surprising because he’s shown absolutely no signs of being more than an average player over the last three years; if they’d been interested in this year’s star midfielder, I wouldn’t have been surprised at all.  It’s a good lesson, though.  I guess sometimes you just need to find the place that happens to suit you best.</p><p>By the way, Spacebunny and I thought we were going to be able to avoid flying a tournament flag on the car until this morning.  But then, how can you possibly argue with irrefutable logic like: “first we can get a flag for the car, and then… woo-hoo!”</p></div>",
  "content_text": "You’ve got another week to prepare for the next section of Thucydides.  The combination of a tournament, a game, and the start of Euro 2008 all happening on the same day rendered me\nhors de combat\n.\nAs for Euro 2008, my thoughts are as follows:\n1.  The Italians were my clear favorites until Cannevaro got hurt in training.  The Germans are everyone else’s favorites, but I have my doubts about their strikers and their keeper.  The French strikers are also dubious; Henry isn’t what he once was and he’s never performed that well on the world stage anyhow.  And after Greece won last time – roughly the European soccer equivalent of Appalachian State winning the national title via the BCS – it seems almost insane to bother making picks.  I guess I still see the Azzurri as favorites, just not as clearly, thanks to their depth.  I know they’re squabbling in camp and the prima donnas are clashing over everything from playing time to mirror time, but when has this ever not been the case?\nAvanti Azzurri!\n2.  The Swiss were robbed last night.  A handball no-call cost them a penalty and then they hit the woodwork on what should have been an easy put-away.  While Frei isn’t the loss he’s reported to be and Yakin is much better up front, they really needed the point that a tie would have given them.  With Turkey looking very beatable and Portugal looking very not-beatable, the first game probably settled the group in the Czech Republic’s favor.  It just goes to show how the defense should\nnever\npush forward on a partial clear.\n3.  The Portuguese took a while to get going, but they are going to make some noise in this tournament.  What was a 2-0 game could have just as easily been 5-0 were it not for the goalkeeper’s friend coming to the Turkish defense no less than three times.  They’ll walk through the group stage; I loathe Cristiano Ronaldo but he is probably the best player in the tournament since Kaka’ and the rest of the Brazilians aren’t in it.\n4.  I’ve never seen Turkey look this weak.  They looked like they could easily manage to lose to both Switzerland and the Czech Republic.\n5.  If Spacebunny leaves me, it will apparently be for a member of the Swedish national team.  Is it a bad sign that she suggested a road trip next week to watch one of their practices?\nSpeaking of woodwork and goalkeepers, I tried a new kid in goal for the first time last week, mostly because he can punt the ball well.  He only played two games before breaking a finger, but he allowed just two goals in those two games.  I didn’t think much of it at the time, but after the tournament a scout for Black, the pro team, asked if he’d be available next year to join their kids team at the next level up.  I basically scoffed at this… until the tournament yesterday.  The boy’s finger was recovered enough to play and this time he allowed ten goals in five games, but six of them were against the other big program, Blue, and of the ten only two of them were even remotely stoppable.  He saved at least five shots that I was sure were going in, which was why we went 3-1-1 in the tournament but had Blue inquiring about him for next year as well.\nI’ve had three other kids graduate to Black over the last five years, but this one is the most surprising because he’s shown absolutely no signs of being more than an average player over the last three years; if they’d been interested in this year’s star midfielder, I wouldn’t have been surprised at all.  It’s a good lesson, though.  I guess sometimes you just need to find the place that happens to suit you best.\nBy the way, Spacebunny and I thought we were going to be able to avoid flying a tournament flag on the car until this morning.  But then, how can you possibly argue with irrefutable logic like: “first we can get a flag for the car, and then… woo-hoo!”",
  "tags": [],
  "categories": [],
  "sitemap_lastmod": "2008-06-08T13:35:00+00:00"
}