{
  "url": "https://voxday.net/2008/06/03/two-sciences/",
  "scraped_at": "2026-01-08T22:26:00.847126",
  "title": "Two sciences",
  "date_display": "June 3, 2008",
  "date_iso": "2008-06-03T10:53:00+00:00",
  "date_from_url": "2008-06-03",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>Physicists, as the philosopher Daniel Dennett has noted, have very precise models that work very effectively.  Evolutionary biologists, on the other hand, have horribly imprecise models that don’t even pretend to work at all.  Naturally, given the idiosyncracies of human nature, it is the latter who are extremely arrogant and aggressively certain <a href=\"http://www.nytimes.com/2008/06/03/science/03dark.html?8dpc\">that they completely understand</a> the way in which the material world is functioning:</p><blockquote><p>Although cosmologists have adopted a cute name, dark energy, for whatever is driving this apparently antigravitational behavior on the part of the universe, nobody claims to understand why it is happening, or its implications for the future of the universe and of the life within it, despite thousands of learned papers, scores of conferences and millions of dollars’ worth of telescope time. It has led some cosmologists to the verge of abandoning their fondest dream: a theory that can account for the universe and everything about it in a single breath.</p></blockquote><p>By the way, I went over the ten studies that were previously recommended to me as making use of an evolutionary model to predict something.  They were nothing of the kind.  In fact, from the thirty-five or so studies I have now read, it seems that most evolutionary studies are designed primarily to demonstrate that some previously observed animal behavior “is consistent with evolution by natural selection”.</p></div>",
  "content_text": "Physicists, as the philosopher Daniel Dennett has noted, have very precise models that work very effectively.  Evolutionary biologists, on the other hand, have horribly imprecise models that don’t even pretend to work at all.  Naturally, given the idiosyncracies of human nature, it is the latter who are extremely arrogant and aggressively certain\nthat they completely understand\nthe way in which the material world is functioning:\nAlthough cosmologists have adopted a cute name, dark energy, for whatever is driving this apparently antigravitational behavior on the part of the universe, nobody claims to understand why it is happening, or its implications for the future of the universe and of the life within it, despite thousands of learned papers, scores of conferences and millions of dollars’ worth of telescope time. It has led some cosmologists to the verge of abandoning their fondest dream: a theory that can account for the universe and everything about it in a single breath.\nBy the way, I went over the ten studies that were previously recommended to me as making use of an evolutionary model to predict something.  They were nothing of the kind.  In fact, from the thirty-five or so studies I have now read, it seems that most evolutionary studies are designed primarily to demonstrate that some previously observed animal behavior “is consistent with evolution by natural selection”.",
  "tags": [],
  "categories": [],
  "sitemap_lastmod": "2008-06-03T09:53:00+00:00"
}