{
  "url": "https://voxday.net/2014/09/06/a-non-starter/",
  "scraped_at": "2025-12-16T12:26:54.914773",
  "title": "A non-starter",
  "date_display": "September 6, 2014",
  "date_iso": "2014-09-06T17:00:00+00:00",
  "date_from_url": "2014-09-06",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>A good idea <a href=\"http://thehill.com/policy/international/216791-cruz-want-citizenship-stripped-from-us-fighters-linked-to-isis\">doomed to failure</a> by the rapacious US tax bureaucracy:</p><blockquote class=\"tr_bq\"><p> Sen. Ted Cruz (R-Texas) is slated to introduce legislation next week<br> that would revoke the U.S. citizenship of anyone fighting or providing<br> support to terrorist groups working to attack the United States. Cruz said he is filing the Expatriate Terrorist Act in reaction to<br> the threat posed by the Islamic State in Iraq and Syria (ISIS). It would<br> provide another level of protection to prevent foreign fighters from<br> re-entering the United States, he said.</br></br></br></br></br></p></blockquote><p>Prediction: once the IRS realizes that this legislation would provide an cost-efficient means for expatriates to get rid of their US citizenship, it will become a non-starter. In fact, with the recent 400 percent increase in administrative fees, (it now costs about $2,500 to drop your citizenship even though it’s about a two-minute process) it would probably cost less to do it by simply donating to ISIS.</p></div>",
  "content_text": "A good idea\ndoomed to failure\nby the rapacious US tax bureaucracy:\nSen. Ted Cruz (R-Texas) is slated to introduce legislation next week\nthat would revoke the U.S. citizenship of anyone fighting or providing\nsupport to terrorist groups working to attack the United States. Cruz said he is filing the Expatriate Terrorist Act in reaction to\nthe threat posed by the Islamic State in Iraq and Syria (ISIS). It would\nprovide another level of protection to prevent foreign fighters from\nre-entering the United States, he said.\nPrediction: once the IRS realizes that this legislation would provide an cost-efficient means for expatriates to get rid of their US citizenship, it will become a non-starter. In fact, with the recent 400 percent increase in administrative fees, (it now costs about $2,500 to drop your citizenship even though it’s about a two-minute process) it would probably cost less to do it by simply donating to ISIS.",
  "tags": [
    "law",
    "trainwreck"
  ],
  "categories": [],
  "sitemap_lastmod": "2014-09-06T16:00:00+00:00"
}