{
  "url": "https://voxday.net/2014/09/08/a-rhetorical-case-for-segregation/",
  "scraped_at": "2025-12-16T12:27:07.544159",
  "title": "A rhetorical case for segregation",
  "date_display": "September 8, 2014",
  "date_iso": "2014-09-08T13:00:00+00:00",
  "date_from_url": "2014-09-08",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>Obviously, the counter-argument is that anyone who doesn’t want their young son <a href=\"http://www.thegatewaypundit.com/2014/09/youths-laugh-on-video-as-black-mob-beat-kroger-store-employee-unconscious-in-parking-lot-video/\">to be attacked and beaten into unconsciousness </a>by a horde of vibrant youth while working is just a terrible, terrible raciss and bad person:</p><blockquote class=\"tr_bq\"><p> Kroger customers are afraid and outraged by a recent brutal beating that took place. Particularly, because it was unprovoked and could have happened to anyone.</p><p>WMC Action News 5 pulled up the video on a cell phone and went to the spot where the assaults happened. As you might imagine, shoppers who watched the video were outraged.</p><p>Some couldn’t believe what they were seeing.</p><p>“That’s a shame there is no excuse for any of that,” said James Murf.</p><p>The grocery store is practically brand new, built just last year. How two store employees and a customer could get beat up there has many baffled.</p><p>“I don’t know what the world is coming to when people just attack some random person,” said Barbara Michael.</p><p>A witness says he was standing there watching the fight as it happened. He declined to go on camera but told WMC he thought the hitting and kicking started after a Kroger employee exchanged words with a young man in the parking lot, over a shopping basket.</p></blockquote><p>Translation: the employee was trying to do his job and the vibrant youth violently objected. In a free society, Kroger would simply announce that it will no longer permit any vibrants under the age of forty to enter its premises for insurance reasons. But we do not live in a free society, which is why the American people are eventually going to find themselves in a race war of epic proportions that will last until the historical state of ethnic homogenuity prevails. A five percent minority population appears to be the maximum limit of mutually beneficial inter-ethnic relations; it can be less, of course, depending upon the behavior of the minority.</p><p>Nobody in his right mind wants a race war. Or any sort of civil war. Wars are always unpredictable. But no one who is cognizant of history will deny that partition wars are how multiethnic empires usually come to an end. Reading WWI histories very much drives home certain similarities between the collapsing, decadent Austro-Hungarian empire and the still-powerful, but creaky Pax Americana; the USA has not yet lost its military dominance but the various cracks in its power are readily visible. And the problem is that the only reliable way to avoid race wars is not idiotic sloganeering and inter-racial propaganda, but segregated borders.</p><p>Jared Diamond and his theories of geographic determinism notwithstanding, those historical states did not come about by accident, any more than Zimbabwe now just happens to be almost entirely black or Iraq now just happens to be almost entirely free of Jews and Christians. It would be hard to identify a time in human history when some form of ethnic or religious cleansing was not taking place.</p><p>The evil myth of racial equality in America could only survive so long as vibrants were a mostly segregated minority, whose predilections and general dyscivicism were hidden from the white college students who only ever came across the vibrant best and brightest. The Civil Rights movement, which some conservatives still foolishly lionize, was a disaster for the USA; not as historically cataclysmic as the Immigration Act of 1965 or the combination of no-fault divorce and legal abortion, but a disaster nonetheless.</p><p>England is beginning to come to terms with the fact that Enoch Powell was right. I expect that America will eventually come to terms with the fact that Bull Connor and George Wallace were right as well. But the segregationists made one serious mistake. “Segregation now, segregation<br> tomorrow, segregation forever” is just a rhetoric. The more convincing argument, and the historical reality, is this: “Segregation now or elimination tomorrow.”</br></p><p>And before all the white boy liberals are tempted to play the Raciss Card, just remember, kemosabe, the Red Card trumps it. And my tribe knows all about the vital necessity of segregation for survival, or as we call it, the reservation.</p></div>",
  "content_text": "Obviously, the counter-argument is that anyone who doesn’t want their young son\nto be attacked and beaten into unconsciousness\nby a horde of vibrant youth while working is just a terrible, terrible raciss and bad person:\nKroger customers are afraid and outraged by a recent brutal beating that took place. Particularly, because it was unprovoked and could have happened to anyone.\nWMC Action News 5 pulled up the video on a cell phone and went to the spot where the assaults happened. As you might imagine, shoppers who watched the video were outraged.\nSome couldn’t believe what they were seeing.\n“That’s a shame there is no excuse for any of that,” said James Murf.\nThe grocery store is practically brand new, built just last year. How two store employees and a customer could get beat up there has many baffled.\n“I don’t know what the world is coming to when people just attack some random person,” said Barbara Michael.\nA witness says he was standing there watching the fight as it happened. He declined to go on camera but told WMC he thought the hitting and kicking started after a Kroger employee exchanged words with a young man in the parking lot, over a shopping basket.\nTranslation: the employee was trying to do his job and the vibrant youth violently objected. In a free society, Kroger would simply announce that it will no longer permit any vibrants under the age of forty to enter its premises for insurance reasons. But we do not live in a free society, which is why the American people are eventually going to find themselves in a race war of epic proportions that will last until the historical state of ethnic homogenuity prevails. A five percent minority population appears to be the maximum limit of mutually beneficial inter-ethnic relations; it can be less, of course, depending upon the behavior of the minority.\nNobody in his right mind wants a race war. Or any sort of civil war. Wars are always unpredictable. But no one who is cognizant of history will deny that partition wars are how multiethnic empires usually come to an end. Reading WWI histories very much drives home certain similarities between the collapsing, decadent Austro-Hungarian empire and the still-powerful, but creaky Pax Americana; the USA has not yet lost its military dominance but the various cracks in its power are readily visible. And the problem is that the only reliable way to avoid race wars is not idiotic sloganeering and inter-racial propaganda, but segregated borders.\nJared Diamond and his theories of geographic determinism notwithstanding, those historical states did not come about by accident, any more than Zimbabwe now just happens to be almost entirely black or Iraq now just happens to be almost entirely free of Jews and Christians. It would be hard to identify a time in human history when some form of ethnic or religious cleansing was not taking place.\nThe evil myth of racial equality in America could only survive so long as vibrants were a mostly segregated minority, whose predilections and general dyscivicism were hidden from the white college students who only ever came across the vibrant best and brightest. The Civil Rights movement, which some conservatives still foolishly lionize, was a disaster for the USA; not as historically cataclysmic as the Immigration Act of 1965 or the combination of no-fault divorce and legal abortion, but a disaster nonetheless.\nEngland is beginning to come to terms with the fact that Enoch Powell was right. I expect that America will eventually come to terms with the fact that Bull Connor and George Wallace were right as well. But the segregationists made one serious mistake. “Segregation now, segregation\ntomorrow, segregation forever” is just a rhetoric. The more convincing argument, and the historical reality, is this: “Segregation now or elimination tomorrow.”\nAnd before all the white boy liberals are tempted to play the Raciss Card, just remember, kemosabe, the Red Card trumps it. And my tribe knows all about the vital necessity of segregation for survival, or as we call it, the reservation.",
  "tags": [
    "Vibrancy is our strength"
  ],
  "categories": [],
  "sitemap_lastmod": "2014-09-08T12:00:00+00:00"
}