{
  "url": "https://voxday.net/2014/09/29/a-universal-and-immutable-rule/",
  "scraped_at": "2025-12-16T12:29:31.629289",
  "title": "“A universal and immutable rule”",
  "date_display": "September 29, 2014",
  "date_iso": "2014-09-29T20:54:00+00:00",
  "date_from_url": "2014-09-29",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>I don’t quite see how blatantly lying about readily observable human behavior and presenting a completely illogical argument is going to help Jeffrey Goldberg convince anyone that prejudice springs, ex nihilo, <a href=\"http://www.theatlantic.com/international/archive/2014/09/does-human-rights-watchs-kenneth-roth-understand-the-nature-of-prejudice/380556/\">out of the irrationality of the human mind</a>.</p><blockquote class=\"tr_bq\"><p> A few days ago, the executive director of Human Rights Watch, Kenneth Roth, tweeted the following statement: “Germans rally against anti-Semitism that flared in Europe in response to Israel’s conduct in Gaza war. Merkel joins.” Roth provided a link to a New York Times article about the rally, which took place in Berlin.</p><p>Roth’s framing of this issue is very odd and obtuse. Anti-Semitism in Europe did not flare “in response to Israel’s conduct in Gaza,” or anywhere else. Anti-Semitic violence and invective are not responses to events in the Middle East, just as anti-Semitism does not erupt  “in response” to the policies of banks owned by Jews, or in response to editorial positions taken by The New York Times. This is for the simple reason that Jews do not cause anti-Semitism.</p><p>It is a universal and immutable rule that the targets of prejudice are not the cause of prejudice. Just as Jews (or Jewish organizations, or the Jewish state) do not cause anti-Semitism to flare, or intensify, or even to exist, neither do black people cause racism, nor gay people homophobia, nor Muslims Islamophobia. Like all prejudices, anti-Semitism is not a rational response to observable events; it is a manifestation of irrational hatred. Its proponents justify their anti-Semitism by pointing to the (putatively offensive or repulsive) behavior of their targets, but this does not mean that major figures in the world of human-rights advocacy should accept these pathetic excuses as legitimate.</p></blockquote><p>Anti-Semitism in Europe did not flare “in response to Israel’s conduct in Gaza? It’s passing strange, then, that European anti-semitism should randomly happen to have flared up at the very moment that Israel launched its Gaza offensive. And isn’t it astonishing to be informed that that absolutely no prejudices are the result of rational responses?</p><p>Goldberg is a more cartoonish example of an anti-Jewish stereotype of a perfidious Jew speaking with forked tongue than most anti-Semites could produce. His behavior is sufficiently dishonest to generate a perfectly rational distrust of anything he says; it is not a manifestation of irrational hatred to disbelieve an obvious liar.</p><p>The amusing thing is that his position can be shown to be obviously nonsensical by simply looking at Jewish prejudices. Israelis quite reasonably point to historical Arab behavior to justify their anti-Palestinian prejudices and policies and Jews frequently point to medieval Christian behavior to justify their anti-Christian biases, so how is it even theoretically possible to claim that Jews do not cause any anti-Semitism? Are they not human? Do they not act? Are they not independent moral agents? Is it truly not even <i>possible </i>that their every act does not meet with universal approval?</p><p>The fact is that some prejudices are entirely rational and the logical result of the behavior of those who share identifiable characteristics with the targets of prejudice. The woman who is raped tends to fear men. The white man who was beaten up by blacks at school tends to dislike Africans. A Palestinian whose house was bombed by Israelis is likely to be anti-semitic. These are not manifestations of irrational hatred, they are perfectly rational and understandable prejudices with causes based in human action.</p><p>The fact that some prejudices may be irrational does not mean that they all necessarily are, and it is unfortunate that Jeffrey Goldberg should further fan the flames of anti-semitism by providing those who hate Jews with such an egregious example of Jewish intellectual dishonesty.</p></div>",
  "content_text": "I don’t quite see how blatantly lying about readily observable human behavior and presenting a completely illogical argument is going to help Jeffrey Goldberg convince anyone that prejudice springs, ex nihilo,\nout of the irrationality of the human mind\n.\nA few days ago, the executive director of Human Rights Watch, Kenneth Roth, tweeted the following statement: “Germans rally against anti-Semitism that flared in Europe in response to Israel’s conduct in Gaza war. Merkel joins.” Roth provided a link to a New York Times article about the rally, which took place in Berlin.\nRoth’s framing of this issue is very odd and obtuse. Anti-Semitism in Europe did not flare “in response to Israel’s conduct in Gaza,” or anywhere else. Anti-Semitic violence and invective are not responses to events in the Middle East, just as anti-Semitism does not erupt  “in response” to the policies of banks owned by Jews, or in response to editorial positions taken by The New York Times. This is for the simple reason that Jews do not cause anti-Semitism.\nIt is a universal and immutable rule that the targets of prejudice are not the cause of prejudice. Just as Jews (or Jewish organizations, or the Jewish state) do not cause anti-Semitism to flare, or intensify, or even to exist, neither do black people cause racism, nor gay people homophobia, nor Muslims Islamophobia. Like all prejudices, anti-Semitism is not a rational response to observable events; it is a manifestation of irrational hatred. Its proponents justify their anti-Semitism by pointing to the (putatively offensive or repulsive) behavior of their targets, but this does not mean that major figures in the world of human-rights advocacy should accept these pathetic excuses as legitimate.\nAnti-Semitism in Europe did not flare “in response to Israel’s conduct in Gaza? It’s passing strange, then, that European anti-semitism should randomly happen to have flared up at the very moment that Israel launched its Gaza offensive. And isn’t it astonishing to be informed that that absolutely no prejudices are the result of rational responses?\nGoldberg is a more cartoonish example of an anti-Jewish stereotype of a perfidious Jew speaking with forked tongue than most anti-Semites could produce. His behavior is sufficiently dishonest to generate a perfectly rational distrust of anything he says; it is not a manifestation of irrational hatred to disbelieve an obvious liar.\nThe amusing thing is that his position can be shown to be obviously nonsensical by simply looking at Jewish prejudices. Israelis quite reasonably point to historical Arab behavior to justify their anti-Palestinian prejudices and policies and Jews frequently point to medieval Christian behavior to justify their anti-Christian biases, so how is it even theoretically possible to claim that Jews do not cause any anti-Semitism? Are they not human? Do they not act? Are they not independent moral agents? Is it truly not even\npossible\nthat their every act does not meet with universal approval?\nThe fact is that some prejudices are entirely rational and the logical result of the behavior of those who share identifiable characteristics with the targets of prejudice. The woman who is raped tends to fear men. The white man who was beaten up by blacks at school tends to dislike Africans. A Palestinian whose house was bombed by Israelis is likely to be anti-semitic. These are not manifestations of irrational hatred, they are perfectly rational and understandable prejudices with causes based in human action.\nThe fact that some prejudices may be irrational does not mean that they all necessarily are, and it is unfortunate that Jeffrey Goldberg should further fan the flames of anti-semitism by providing those who hate Jews with such an egregious example of Jewish intellectual dishonesty.",
  "tags": [
    "Zion"
  ],
  "categories": [],
  "sitemap_lastmod": "2014-09-29T19:54:00+00:00"
}