{
  "url": "https://voxday.net/2014/09/19/an-open-source-projec/",
  "scraped_at": "2025-12-16T12:28:18.540231",
  "title": "An Open Source project",
  "date_display": "September 19, 2014",
  "date_iso": "2014-09-19T08:40:00+00:00",
  "date_from_url": "2014-09-19",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>Calling all interested programmers:</p><p>We have a potential problem down the road. Our favored means of making ebooks is to construct them manually, which permits us to create very clean, professional ebooks without all the extra HTML trash that is an artifact of converting files from the various word processors. We do this with a program called Sigil, which is open source software, but unfortunately Sigil <a href=\"http://sigildev.blogspot.ch/2014/02/sigils-spiritual-successor.html\">is no longer being maintained</a>.</p><p>Some of the functionality of Sigil is being brought into Calibre, which is an excellent Open Source program, but is not focused on ebook production and has an editor that is more limited in its capabilities. Calibre also now requires QT5, which means those using older OS like XP cannot use it.</p><p>Now, other than a few minor features it would be nice to add for the sake of efficiency, Sigil works perfectly fine now. It’s not an immediate problem. But, as the EPUB standard changes over time, that may not always be the case. So, I’d like to find a programmer or two with OSS experience, and one or two programmers interested in gaining OSS experience, to keep Sigil alive. We have the server space that can be used to host it and are quite willing to provide it, so if you’re a programmer who is genuinely interested in helping maintain and improve Sigil, please shoot me an email with SIGIL in the subject.</p><p>If you want to have a look at the source code first, <a href=\"http://code.google.com/p/sigil/downloads/detail?name=Sigil-0.7.4-Code.zip\">you can DL the 12MB file here</a>.</p><p>UPDATE: Good news. The project leader, John, says that the project was merely pining for the fjords for lack of contributors. He’s quite happy to advise and so forth. We’ve got six or seven volunteers so far, so I’ll get in touch with everyone via email tonight and we can discuss what to do first.</p><p>The big question/problem is QT. John’s current plan is to go foward with QT 5.3, which rules out XP and that user base. So, the question is what is the best way to get the new user features into a version that does not require the latest QT short of a fork.</p></div>",
  "content_text": "Calling all interested programmers:\nWe have a potential problem down the road. Our favored means of making ebooks is to construct them manually, which permits us to create very clean, professional ebooks without all the extra HTML trash that is an artifact of converting files from the various word processors. We do this with a program called Sigil, which is open source software, but unfortunately Sigil\nis no longer being maintained\n.\nSome of the functionality of Sigil is being brought into Calibre, which is an excellent Open Source program, but is not focused on ebook production and has an editor that is more limited in its capabilities. Calibre also now requires QT5, which means those using older OS like XP cannot use it.\nNow, other than a few minor features it would be nice to add for the sake of efficiency, Sigil works perfectly fine now. It’s not an immediate problem. But, as the EPUB standard changes over time, that may not always be the case. So, I’d like to find a programmer or two with OSS experience, and one or two programmers interested in gaining OSS experience, to keep Sigil alive. We have the server space that can be used to host it and are quite willing to provide it, so if you’re a programmer who is genuinely interested in helping maintain and improve Sigil, please shoot me an email with SIGIL in the subject.\nIf you want to have a look at the source code first,\nyou can DL the 12MB file here\n.\nUPDATE: Good news. The project leader, John, says that the project was merely pining for the fjords for lack of contributors. He’s quite happy to advise and so forth. We’ve got six or seven volunteers so far, so I’ll get in touch with everyone via email tonight and we can discuss what to do first.\nThe big question/problem is QT. John’s current plan is to go foward with QT 5.3, which rules out XP and that user base. So, the question is what is the best way to get the new user features into a version that does not require the latest QT short of a fork.",
  "tags": [
    "technology"
  ],
  "categories": [],
  "sitemap_lastmod": "2014-09-19T07:40:00+00:00"
}