{
  "url": "https://voxday.net/2014/09/20/baby-boomers-graduated-from-high-schoo/",
  "scraped_at": "2025-12-16T12:28:26.980731",
  "title": "Baby Boomers graduated from high school!",
  "date_display": "September 20, 2014",
  "date_iso": "2014-09-20T17:01:00+00:00",
  "date_from_url": "2014-09-20",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>Fifty years ago! And they wonder why Generation X <a href=\"http://www.nytimes.com/2014/09/20/business/a-50th-high-school-reunion-and-a-generation-to-follow-.html?ref=your-money\">can’t wait to euthanize them</a> all:</p><blockquote class=\"tr_bq\"><p> Fiftieth reunions are not new, of course. They’ve been celebrated for<br> decades — by small numbers at first, and larger numbers as more people<br> lived long enough to put a party together. But this year, there is one<br> difference: The Class of 1964 is the first graduating class of the<br> post-World War II baby boom and the leading edge of the generation<br> retreating — however reluctantly — from the center stage to the backlot<br> of retirement.</br></br></br></br></br></br></p></blockquote><p>Well, if that’s not a news item, I don’t know what is. I mean, no one has ever had a 50th high school reunion that involved Baby Boomers before! But I’m sure we can all come together in celebrating the fact that this landmark means the Baby Boomers are one step closer to all of us never having to hear about their idiot generation again.</p><p>Don’t be bitter, Boomers. We just hoped you’d die before you got old too.</p></div>",
  "content_text": "Fifty years ago! And they wonder why Generation X\ncan’t wait to euthanize them\nall:\nFiftieth reunions are not new, of course. They’ve been celebrated for\ndecades — by small numbers at first, and larger numbers as more people\nlived long enough to put a party together. But this year, there is one\ndifference: The Class of 1964 is the first graduating class of the\npost-World War II baby boom and the leading edge of the generation\nretreating — however reluctantly — from the center stage to the backlot\nof retirement.\nWell, if that’s not a news item, I don’t know what is. I mean, no one has ever had a 50th high school reunion that involved Baby Boomers before! But I’m sure we can all come together in celebrating the fact that this landmark means the Baby Boomers are one step closer to all of us never having to hear about their idiot generation again.\nDon’t be bitter, Boomers. We just hoped you’d die before you got old too.",
  "tags": [
    "Baby Boomers"
  ],
  "categories": [],
  "sitemap_lastmod": "2014-09-20T16:01:00+00:00"
}