{
  "url": "https://voxday.net/2014/09/04/barometer-and-bernie-madoff/",
  "scraped_at": "2025-12-16T12:26:43.628853",
  "title": "Barometer and Bernie Madoff",
  "date_display": "September 4, 2014",
  "date_iso": "2014-09-04T16:00:00+00:00",
  "date_from_url": "2014-09-04",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>The SF Weekly has an appropriate article entitled <a href=\"http://www.sfweekly.com/sanfrancisco/john-scalzi-comiccon-lock-in/Content?oid=3126373\">“Science Friction”</a>:</p><blockquote class=\"tr_bq\"><p> If you’re looking for a barometer of the state of science fiction in the U.S., consider the career of John Scalzi….. Scalzi’s June<br> 2011 to July 2013 tenure as SFWA president ran fairly smoothly — until<br> its final month. The decision to feature a buxom, scantily clad,<br> redheaded warrior on the cover of the SFWA Bulletin ignited a firestorm<br> of controversy.</br></br></br></br></p><p>“There was a strong generational divide on that issue,” Scalzi says.<br> “There were a lot of older authors who were like, ‘I don’t see the<br> problem with that. It’s a strong feminist symbol.’ And there were a lot<br> of younger authors who were like, ‘You’re kidding me. You don’t see the<br> problem here?'”</br></br></br></br></p><p>Scalzi was traveling on the last day of his 2013 book tour when the<br> controversy came to a head. “I was literally on the plane, watching it<br> all go up on Twitter,” he says. “I was coming into my last month as<br> president but I was like, ‘Fuck, I’ve got to deal with this.'”</br></br></br></p><p>Having approved the cover without thinking through all of its<br> implications, Scalzi apologized to the membership for his “screw-up.”<br> SFWA put procedures in place that allowed the organization to weather<br> that storm and others, including the expulsion of Theodore Beale, aka<br> Vox Day, who used a promotional SFWA Twitter feed to link to<br> inflammatory remarks on his blog (where he called another author<br> “half-savage” and an editor a “fat frog”). Day was subsequently removed<br> from SFWA a month after Scalzi’s tenure.</br></br></br></br></br></br></br></p><p>In his personal online feud with Day, Scalzi and his supporters also<br> ended up raising funds for charities benefiting women, gays, and<br> minorities. By pledging $5 every time Day used Scalzi’s name or used a<br> derogatory nickname for anyone else in a post, the group raised $50,000<br> in pledges. (Scalzi capped his contribution at $1,000, and his readers<br> did the rest.)</br></br></br></br></br></p></blockquote><p>As usual, the media finds me to be one of the most interesting things about Scalzi, although only Salon has ever troubled to get my side to the story. I do find some modest amusement in the fact that even when McRapey is out pushing his new novel, the media is more interested in his passive-aggressive crusade against me than in his book. They’d probably be even more interested if they knew that he and Patrick Nielsen Hayden threatened to quit SFWA if I was not “removed”, or read his bizarre victory rant on Twitter after “Opera Vita Aeterna” failed to win Best Novelette. Or if they had any idea what <a href=\"http://www.milobookclub.com/2014/08/19/fraud-and-douchebaggery/\">a complete fraud</a> he has always been; one observes that he no longer talks up his “online blog” in interviews these days.</p><p>Meanwhile, regarding the state of science fiction: <i>“The biggest declines were in biography/autobiography (down 26%, partially because of the huge success of Steve Jobs in 2011), science fiction (down 21%), and business (down 18%).”</i><br> – Publisher’s Weekly, 11 January 2013</br></p><p>As for him being a barometer, one observes Scalzi is still trying to escape the science fiction and fantasy market: <i>“With writing and selling Lock In, we are looking to a larger<br> market,” Scalzi said. “Not disrespecting the science fiction and fantasy<br> market, obviously, but to open it up and bring in new readers.”</br></br></i></p><p>It is downright perverse for one of the biggest cheerleaders of the two-decade Pink SF diversity movement that has turned off more people to SF/F than anything else in its history to talk about bringing in new readers. Scalzi isn’t merely the Bernie Madoff of science fiction, he is also one of its leading californicators. Having first conned his way into it, he shat all over it in the company of his fellow Social Justice Warriors and is now attempting to move on to greener pastures as yet unsullied by his particular one-trick pony approach to literature.</p><p>But that’s precisely why we will win the genre back in the end. We’re here because we want to be here, because we actually love genuine science fiction and classic fantasy, not because we think it’s the best place to pursue social justice or con a few people out of a few dollars. We’ll win because the gatekeepers who took over the publishers and tried to force Pink SF on everyone are losing their grip. We’ll win because women like Tiger are translating QUANTUM MORTIS into Chinese, and because men like Emilio are translating <a href=\"http://www.amazon.com/dp/B00N9760GO\"><i><b>ONE BRIGHT STAR TO GUIDE THEM</b></i></a> into Spanish. (Both of them sent me their finished translations yesterday; while the Spanish one is already good to go, figuring out how to make a Chinese ebook will take me a little while.)</p><p>So, I hope McRapey is entirely successful in making his leap into the soulless void of Hollywood. He’s been a blight on science fiction ever since he first serialized his Robert Heinlein imitation on his “online column” with its “more than two million page views monthly”. The sooner he finds his true place writing snarky politically correct dialogue for television sitcoms, the better.</p><p>As for commissioning songs, one would be remiss if one failed to mention <a href=\"http://www.voxday.net/tox/GrooveKittens.mp3\">Everything is Falling Into Place (Groove Kittens mix)</a> by Rapey McRaperson and the Pink Rabbit Posse. And since we’re talking about science fiction, I should probably mention that <a href=\"http://www.amazon.com/dp/B00ILU0RC2\"><b><i>QUANTUM MORTIS: A Mind Programmed</i></b></a> is free today and tomorrow on Amazon.</p><p>UPDATE: McRapey is getting annoyed that people keep pointing out that Larry Correia sells more than he does, even though his publisher keeps buying him a one-week spot on the NYT bestseller list each time he writes a book:</p><blockquote class=\"tr_bq\"><p>     Over on the right-wing SF/F frothosphere, it’s apparently become the fashion to assert a particular conservative writer sell me than me…—<br>     John Scalzi (@scalzi) September 04, 2014</br></p><p>    .. and apparently this is important for REASONS, and proof of liberal bias in the universe blah blah blah oh jesus why this again.—<br>     John Scalzi (@scalzi) September 04, 2014</br></p><p>    Leaving aside whether this particular writer sells more than me or not: Honestly, who really gives a shit if he does?—<br>     John Scalzi (@scalzi) September 04, 2014</br></p><p>    If he does: Good for him! I hope he’s happy. It has ABSOLUTELY NO BEARING on how and whether I can sell my books, or he his.—<br>     John Scalzi (@scalzi) September 04, 2014</br></p><p>    It seems some people need publishing to be some zero-sum game in which you can only succeed if someone else is failing, etc.—<br>     John Scalzi (@scalzi) September 04, 2014</br></p><p>    In fact, that’s a profoundly way of looking at the publishing world. It’s not zero sum: My success doesn’t stop any other success.—<br>     John Scalzi (@scalzi) September 04, 2014</br></p><p>    And other people’s success do not impede mine. There are enough readers for many authors to do well. Which is great!—<br>     John Scalzi (@scalzi) September 04, 2014</br></p><p>    I find the NEED to say one writer is more successful than another FOR REASONS to be an example of how some people never stop being 12.—<br>     John Scalzi (@scalzi) September 04, 2014</br></p><p>    So, if you’re one of those people, stop being 12. If your favorite writer sells more than me, great! I sell enough. And that’s enough.—<br>     John Scalzi (@scalzi) September 04, 2014</br></p><p>    End of rant.—<br>     John Scalzi (@scalzi) September 04, 2014</br></p></blockquote><p>Who gives a shit THAT he does, Johnny? Not “if he does”. Why, YOU most certainly do! That’s why you’re constantly trying to suck up to Larry Correia and John Ringo while repeatedly insulting other Baen authors who don’t sell quite as well.</p><p>Also, the publishing world is zero-sum. There are a limited number of readers, a finite amount of time in which a book hits its peak sales, and a reader who is reading a free copy of QUANTUM MORTIS A Mind Programmed or the excellent ONE BRIGHT STAR TO GUIDE THEM is a reader who is not reading something else.</p><p>That is precisely why the mainstream publishers are so angry that Amazon permits authors to give away their books 20 days out of the year and why Amazon limits the giveaways to 20 days.</p></div>",
  "content_text": "The SF Weekly has an appropriate article entitled\n“Science Friction”\n:\nIf you’re looking for a barometer of the state of science fiction in the U.S., consider the career of John Scalzi….. Scalzi’s June\n2011 to July 2013 tenure as SFWA president ran fairly smoothly — until\nits final month. The decision to feature a buxom, scantily clad,\nredheaded warrior on the cover of the SFWA Bulletin ignited a firestorm\nof controversy.\n“There was a strong generational divide on that issue,” Scalzi says.\n“There were a lot of older authors who were like, ‘I don’t see the\nproblem with that. It’s a strong feminist symbol.’ And there were a lot\nof younger authors who were like, ‘You’re kidding me. You don’t see the\nproblem here?'”\nScalzi was traveling on the last day of his 2013 book tour when the\ncontroversy came to a head. “I was literally on the plane, watching it\nall go up on Twitter,” he says. “I was coming into my last month as\npresident but I was like, ‘Fuck, I’ve got to deal with this.'”\nHaving approved the cover without thinking through all of its\nimplications, Scalzi apologized to the membership for his “screw-up.”\nSFWA put procedures in place that allowed the organization to weather\nthat storm and others, including the expulsion of Theodore Beale, aka\nVox Day, who used a promotional SFWA Twitter feed to link to\ninflammatory remarks on his blog (where he called another author\n“half-savage” and an editor a “fat frog”). Day was subsequently removed\nfrom SFWA a month after Scalzi’s tenure.\nIn his personal online feud with Day, Scalzi and his supporters also\nended up raising funds for charities benefiting women, gays, and\nminorities. By pledging $5 every time Day used Scalzi’s name or used a\nderogatory nickname for anyone else in a post, the group raised $50,000\nin pledges. (Scalzi capped his contribution at $1,000, and his readers\ndid the rest.)\nAs usual, the media finds me to be one of the most interesting things about Scalzi, although only Salon has ever troubled to get my side to the story. I do find some modest amusement in the fact that even when McRapey is out pushing his new novel, the media is more interested in his passive-aggressive crusade against me than in his book. They’d probably be even more interested if they knew that he and Patrick Nielsen Hayden threatened to quit SFWA if I was not “removed”, or read his bizarre victory rant on Twitter after “Opera Vita Aeterna” failed to win Best Novelette. Or if they had any idea what\na complete fraud\nhe has always been; one observes that he no longer talks up his “online blog” in interviews these days.\nMeanwhile, regarding the state of science fiction:\n“The biggest declines were in biography/autobiography (down 26%, partially because of the huge success of Steve Jobs in 2011), science fiction (down 21%), and business (down 18%).”\n– Publisher’s Weekly, 11 January 2013\nAs for him being a barometer, one observes Scalzi is still trying to escape the science fiction and fantasy market:\n“With writing and selling Lock In, we are looking to a larger\nmarket,” Scalzi said. “Not disrespecting the science fiction and fantasy\nmarket, obviously, but to open it up and bring in new readers.”\nIt is downright perverse for one of the biggest cheerleaders of the two-decade Pink SF diversity movement that has turned off more people to SF/F than anything else in its history to talk about bringing in new readers. Scalzi isn’t merely the Bernie Madoff of science fiction, he is also one of its leading californicators. Having first conned his way into it, he shat all over it in the company of his fellow Social Justice Warriors and is now attempting to move on to greener pastures as yet unsullied by his particular one-trick pony approach to literature.\nBut that’s precisely why we will win the genre back in the end. We’re here because we want to be here, because we actually love genuine science fiction and classic fantasy, not because we think it’s the best place to pursue social justice or con a few people out of a few dollars. We’ll win because the gatekeepers who took over the publishers and tried to force Pink SF on everyone are losing their grip. We’ll win because women like Tiger are translating QUANTUM MORTIS into Chinese, and because men like Emilio are translating\nONE BRIGHT STAR TO GUIDE THEM\ninto Spanish. (Both of them sent me their finished translations yesterday; while the Spanish one is already good to go, figuring out how to make a Chinese ebook will take me a little while.)\nSo, I hope McRapey is entirely successful in making his leap into the soulless void of Hollywood. He’s been a blight on science fiction ever since he first serialized his Robert Heinlein imitation on his “online column” with its “more than two million page views monthly”. The sooner he finds his true place writing snarky politically correct dialogue for television sitcoms, the better.\nAs for commissioning songs, one would be remiss if one failed to mention\nEverything is Falling Into Place (Groove Kittens mix)\nby Rapey McRaperson and the Pink Rabbit Posse. And since we’re talking about science fiction, I should probably mention that\nQUANTUM MORTIS: A Mind Programmed\nis free today and tomorrow on Amazon.\nUPDATE: McRapey is getting annoyed that people keep pointing out that Larry Correia sells more than he does, even though his publisher keeps buying him a one-week spot on the NYT bestseller list each time he writes a book:\nOver on the right-wing SF/F frothosphere, it’s apparently become the fashion to assert a particular conservative writer sell me than me…—\nJohn Scalzi (@scalzi) September 04, 2014\n.. and apparently this is important for REASONS, and proof of liberal bias in the universe blah blah blah oh jesus why this again.—\nJohn Scalzi (@scalzi) September 04, 2014\nLeaving aside whether this particular writer sells more than me or not: Honestly, who really gives a shit if he does?—\nJohn Scalzi (@scalzi) September 04, 2014\nIf he does: Good for him! I hope he’s happy. It has ABSOLUTELY NO BEARING on how and whether I can sell my books, or he his.—\nJohn Scalzi (@scalzi) September 04, 2014\nIt seems some people need publishing to be some zero-sum game in which you can only succeed if someone else is failing, etc.—\nJohn Scalzi (@scalzi) September 04, 2014\nIn fact, that’s a profoundly way of looking at the publishing world. It’s not zero sum: My success doesn’t stop any other success.—\nJohn Scalzi (@scalzi) September 04, 2014\nAnd other people’s success do not impede mine. There are enough readers for many authors to do well. Which is great!—\nJohn Scalzi (@scalzi) September 04, 2014\nI find the NEED to say one writer is more successful than another FOR REASONS to be an example of how some people never stop being 12.—\nJohn Scalzi (@scalzi) September 04, 2014\nSo, if you’re one of those people, stop being 12. If your favorite writer sells more than me, great! I sell enough. And that’s enough.—\nJohn Scalzi (@scalzi) September 04, 2014\nEnd of rant.—\nJohn Scalzi (@scalzi) September 04, 2014\nWho gives a shit THAT he does, Johnny? Not “if he does”. Why, YOU most certainly do! That’s why you’re constantly trying to suck up to Larry Correia and John Ringo while repeatedly insulting other Baen authors who don’t sell quite as well.\nAlso, the publishing world is zero-sum. There are a limited number of readers, a finite amount of time in which a book hits its peak sales, and a reader who is reading a free copy of QUANTUM MORTIS A Mind Programmed or the excellent ONE BRIGHT STAR TO GUIDE THEM is a reader who is not reading something else.\nThat is precisely why the mainstream publishers are so angry that Amazon permits authors to give away their books 20 days out of the year and why Amazon limits the giveaways to 20 days.",
  "tags": [
    "McRapey"
  ],
  "categories": [],
  "sitemap_lastmod": "2014-09-04T15:00:00+00:00"
}