{
  "url": "https://voxday.net/2014/09/08/books-worth-reading/",
  "scraped_at": "2025-12-16T12:27:10.512674",
  "title": "Books worth reading",
  "date_display": "September 8, 2014",
  "date_iso": "2014-09-08T20:00:00+00:00",
  "date_from_url": "2014-09-08",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p><a href=\"http://georgepwood.com/2014/09/08/review-of-quantum-mortis-a-mind-programmed-by-vox-day/\">A new review</a> of <i><b>QUANTUM MORTIS: A MIND PROGRAMMED</b></i>:</p><blockquote class=\"tr_bq\"><p> James Jesus Angleton famous described the eternal battle between<br> espionage and counterintelligence as “a wilderness of mirrors.” I<br> thought of that phrase while reading <i>A Mind Programmed</i>, the latest installation in the <i>Quantum Mortis</i><br> series of science fiction stories. Few people or things are what they<br> seem in this story, and even when you see what they really are, you<br> still have questions….</br></br></br></br></br></p><p>I’m new to science fiction, but I enjoyed <i>A Mind Programmed</i>. Though a bit dialogue heavy and slow in the middle, the book spun a good yarn and kept my interest throughout. </p></blockquote><p>And there are several Amazon reviews of John C. Wright’s <i><b>ONE BRIGHT STAR TO GUIDE THEM</b></i> worth reading, such as <a href=\"http://www.amazon.com/review/RQ51TT0NMHHM7/ref=cm_cr_pr_perm?ie=UTF8&amp;ASIN=B00N9760GO\">this one by Kyle Robinson</a>:</p><blockquote class=\"tr_bq\"><p> Given my fondness of fantasy literature, it might surprise some acquaintances to learn that I never read much fantasy when I was a child. I never read Narnia, Redwall, Harry Potter, or any of the other books in the genre. (I only read CS Lewis’s Narnia books earlier this year, in fact.) This places me outside of Wright’s target audience, perhaps, and gives me something of an outsider’s perspective on his story One Bright Star To Guide Them.</p><p>Wright has consistently delivered thought-provoking and compelling stories. Awake In The Night Land was a truly spectacular accomplishment and even if The Golden Age trilogy (which is essentially progressive rock in literary form) had a steep learning curve, the sheer imagination behind the series more than earned my continued respect for Wright. City Beyond Time – though book-ended by stories I felt were less compelling than the excellent tales in between – did not disappoint either. But after reading the first Everness book, I wondered if One Bright Star would end up retreading the same kind of story Wright told in that duology. And despite the appealing premise I was concerned that my lack of context would make this story more difficult to enjoy, despite the intriguing premise</p><p>The answer is a resounding No. One Bright Star is pure magic, radiating with the virtuosity of a writer whose literary muscle and knack for inscribing heartfelt emotion work in splendid unison. The world and its characters are made so compelling that you, the reader, should not be surprised if your lap is dribbled in drool upon finishing the story, as you salivate for more. One Bright Star is more immediately enjoyable and tightly orchestrated than the comparatively ponderous Everness, and Wright knits his story with a tangible melancholy that proves he is more than capable of making statements in fantasy that rival his science fiction output….</p><p>One Bright Star has one of the best endings I’ve enjoyed in recent<br> memory, and the fact that he draws from the reader such emotion toward<br> his characters and world in such a brief time is a testament to his<br> skill.  By the end of the story, it’s easy to forget that you have spent<br> only a few dozen pages in Wright’s world, rather than hundreds.  And<br> despite the fact that I never read Wright’s inspirations as a youth, I<br> was thoroughly walloped by the poignancy and emotional power of the<br> ending, which should be all the more stirring for those who have dwelt<br> within the worlds of Lewis, Tolkein, and Cooper.</br></br></br></br></br></br></br></br></p></blockquote><p>You know a novella is really good when the chief complaint of the more critical reviews is that <a href=\"http://www.amazon.com/review/R1FR9HN6OTHOSQ/ref=cm_cr_pr_perm?ie=UTF8&amp;ASIN=B00N9760GO\">it isn’t longer</a>:</p><blockquote class=\"tr_bq\"><p> I was sure a homage to Narnia written by John C. Wright would be right up my alley. However, I found myself disappointed by this novella. There’s a great story to be told here, and flashes of it shine through, but I think the novella is just too short to really flesh it out…. I’ve seen enough of Wright’s work to know that he’s capable of brilliantly expanding on the things that I felt were rushed, but for whatever reason he chose not to. 30 more pages would’ve made this book a masterpiece. </p></blockquote><p>The ironic thing about this criticism is that the novella is already an expanded version of the short story originally published in F&amp;SF magazine. I have no doubt that Mr. Wright could easily expand the novella to a full novel, and indeed, a full trilogy covering both the childhood events and subsequent events. And perhaps he will one day do so, but the fact is that he really said everything that needed to be said in the novella.</p><p>And finally, there is this review of <b><i><a href=\"http://www.amazon.com/gp/review/R20COL3UP1CERO/ref=cm_cr_pr_rvw_ttl?ASIN=B00I4W7WTS\">QUANTUM MORTIS: A MAN DISRUPTED</a></i></b>:</p><blockquote class=\"tr_bq\"><p> Very good sci-fi noir. There have not been many good detective sci-fi noir novels. Effinger did some good near future books, but that was about it.</p><p>The setting here is a military police detective who, due to his world’s laws on embassies, is a member of a section assigned to police crimes involving embassies and governments in exile. Personal AIs, flying cars and power suits, body enhancements, police robots. However, the world has crowded mega towers, and a dark side that is well explored. Very well written, tight scenes. Enjoyable.</p></blockquote></div>",
  "content_text": "A new review\nof\nQUANTUM MORTIS: A MIND PROGRAMMED\n:\nJames Jesus Angleton famous described the eternal battle between\nespionage and counterintelligence as “a wilderness of mirrors.” I\nthought of that phrase while reading\nA Mind Programmed\n, the latest installation in the\nQuantum Mortis\nseries of science fiction stories. Few people or things are what they\nseem in this story, and even when you see what they really are, you\nstill have questions….\nI’m new to science fiction, but I enjoyed\nA Mind Programmed\n. Though a bit dialogue heavy and slow in the middle, the book spun a good yarn and kept my interest throughout.\nAnd there are several Amazon reviews of John C. Wright’s\nONE BRIGHT STAR TO GUIDE THEM\nworth reading, such as\nthis one by Kyle Robinson\n:\nGiven my fondness of fantasy literature, it might surprise some acquaintances to learn that I never read much fantasy when I was a child. I never read Narnia, Redwall, Harry Potter, or any of the other books in the genre. (I only read CS Lewis’s Narnia books earlier this year, in fact.) This places me outside of Wright’s target audience, perhaps, and gives me something of an outsider’s perspective on his story One Bright Star To Guide Them.\nWright has consistently delivered thought-provoking and compelling stories. Awake In The Night Land was a truly spectacular accomplishment and even if The Golden Age trilogy (which is essentially progressive rock in literary form) had a steep learning curve, the sheer imagination behind the series more than earned my continued respect for Wright. City Beyond Time – though book-ended by stories I felt were less compelling than the excellent tales in between – did not disappoint either. But after reading the first Everness book, I wondered if One Bright Star would end up retreading the same kind of story Wright told in that duology. And despite the appealing premise I was concerned that my lack of context would make this story more difficult to enjoy, despite the intriguing premise\nThe answer is a resounding No. One Bright Star is pure magic, radiating with the virtuosity of a writer whose literary muscle and knack for inscribing heartfelt emotion work in splendid unison. The world and its characters are made so compelling that you, the reader, should not be surprised if your lap is dribbled in drool upon finishing the story, as you salivate for more. One Bright Star is more immediately enjoyable and tightly orchestrated than the comparatively ponderous Everness, and Wright knits his story with a tangible melancholy that proves he is more than capable of making statements in fantasy that rival his science fiction output….\nOne Bright Star has one of the best endings I’ve enjoyed in recent\nmemory, and the fact that he draws from the reader such emotion toward\nhis characters and world in such a brief time is a testament to his\nskill.  By the end of the story, it’s easy to forget that you have spent\nonly a few dozen pages in Wright’s world, rather than hundreds.  And\ndespite the fact that I never read Wright’s inspirations as a youth, I\nwas thoroughly walloped by the poignancy and emotional power of the\nending, which should be all the more stirring for those who have dwelt\nwithin the worlds of Lewis, Tolkein, and Cooper.\nYou know a novella is really good when the chief complaint of the more critical reviews is that\nit isn’t longer\n:\nI was sure a homage to Narnia written by John C. Wright would be right up my alley. However, I found myself disappointed by this novella. There’s a great story to be told here, and flashes of it shine through, but I think the novella is just too short to really flesh it out…. I’ve seen enough of Wright’s work to know that he’s capable of brilliantly expanding on the things that I felt were rushed, but for whatever reason he chose not to. 30 more pages would’ve made this book a masterpiece.\nThe ironic thing about this criticism is that the novella is already an expanded version of the short story originally published in F&SF magazine. I have no doubt that Mr. Wright could easily expand the novella to a full novel, and indeed, a full trilogy covering both the childhood events and subsequent events. And perhaps he will one day do so, but the fact is that he really said everything that needed to be said in the novella.\nAnd finally, there is this review of\nQUANTUM MORTIS: A MAN DISRUPTED\n:\nVery good sci-fi noir. There have not been many good detective sci-fi noir novels. Effinger did some good near future books, but that was about it.\nThe setting here is a military police detective who, due to his world’s laws on embassies, is a member of a section assigned to police crimes involving embassies and governments in exile. Personal AIs, flying cars and power suits, body enhancements, police robots. However, the world has crowded mega towers, and a dark side that is well explored. Very well written, tight scenes. Enjoyable.",
  "tags": [
    "Book Review",
    "Castalia House"
  ],
  "categories": [],
  "sitemap_lastmod": "2014-09-08T19:00:00+00:00"
}