{
  "url": "https://voxday.net/2014/09/30/competitive-asset-stripping/",
  "scraped_at": "2025-12-16T12:29:37.078274",
  "title": "Competitive asset-stripping",
  "date_display": "September 30, 2014",
  "date_iso": "2014-09-30T17:00:00+00:00",
  "date_from_url": "2014-09-30",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>Russia <a href=\"http://news.yahoo.com/russian-draft-law-allow-seizure-foreign-property-124247659--business.html\">calls the globalist bluff</a>:</p><blockquote class=\"tr_bq\"><div id=\"yui_3_16_0_1_1412089902412_1747\"> Russian courts could get the<br> green light to seize foreign assets on Russian territory under a draft<br> law intended as a response to Western sanctions over the Ukraine crisis. The draft, which was submitted to parliament on Wednesday<br> by a pro-Kremlin deputy, would also allow state compensation for an<br> individual whose property is seized in foreign jurisdictions.</br></br></br></br></div><div id=\"yui_3_16_0_1_1412089902412_547\"> Italian authorities this week seized property worth about<br> 30 million euros ($40 million) belonging to companies controlled by<br> Arkady Rotenberg, an ally of President Vladimir Putin targeted by the<br> U.S. and European Union sanctions.</br></br></br></div><div id=\"yui_3_16_0_1_1412089902412_550\"> The draft law, published on a parliamentary database,<br> would allow for compensation for Russian citizens who suffer because of<br> an “unlawful court act” in a foreign jurisdiction and clear the way to<br> foreign state assets in Russia being seized, even if they are subject to<br> international immunity.</br></br></br></br></div></blockquote><p>Asset-stripping sanctions aren’t going to be very effective if the Russians simply compensate those whose assets are stripped by taking them from Western companies with Russian assets. This could have some interesting knock-on effects in the NBA.</p><p>And isn’t it remarkable how the sanctity of free trade is so readily disrupted when something is at stake besides the livelihoods and standards of living of the working and middle classes?</p></div>",
  "content_text": "Russia\ncalls the globalist bluff\n:\nRussian courts could get the\ngreen light to seize foreign assets on Russian territory under a draft\nlaw intended as a response to Western sanctions over the Ukraine crisis. The draft, which was submitted to parliament on Wednesday\nby a pro-Kremlin deputy, would also allow state compensation for an\nindividual whose property is seized in foreign jurisdictions.\nItalian authorities this week seized property worth about\n30 million euros ($40 million) belonging to companies controlled by\nArkady Rotenberg, an ally of President Vladimir Putin targeted by the\nU.S. and European Union sanctions.\nThe draft law, published on a parliamentary database,\nwould allow for compensation for Russian citizens who suffer because of\nan “unlawful court act” in a foreign jurisdiction and clear the way to\nforeign state assets in Russia being seized, even if they are subject to\ninternational immunity.\nAsset-stripping sanctions aren’t going to be very effective if the Russians simply compensate those whose assets are stripped by taking them from Western companies with Russian assets. This could have some interesting knock-on effects in the NBA.\nAnd isn’t it remarkable how the sanctity of free trade is so readily disrupted when something is at stake besides the livelihoods and standards of living of the working and middle classes?",
  "tags": [
    "free trade",
    "war"
  ],
  "categories": [],
  "sitemap_lastmod": "2014-09-30T16:00:00+00:00"
}