{
  "url": "https://voxday.net/2014/09/25/ebola-zombies/",
  "scraped_at": "2025-12-16T12:28:57.468316",
  "title": "Godless Ebola zombies",
  "date_display": "September 25, 2014",
  "date_iso": "2014-09-25T08:19:00+00:00",
  "date_from_url": "2014-09-25",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>Fantastic. It’s not just a lethal hemorrhagic virus, it’s now mutated into something capable of <a href=\"http://allafrica.com/stories/201409240829.html\">creating The Walking Dead</a>:</p><blockquote class=\"tr_bq\"><p> Two Ebola patients, who died of the virus in separate communities in Nimba County have reportedly resurrected in the county. The victims, both females, believed to be in their 60s and 40s respectively, died of the Ebola virus recently in Hope Village Community and the Catholic Community in Ganta, Nimba.</p><p>But to the amazement of residents and onlookers on Monday, the deceased reportedly regained life in total disbelief. The New Dawn Nimba County correspondent said the late Dorris Quoi of Hope Village Community and the second victim only identified as Ma Kebeh, said to be in her late 60s, were about to be taken for burial when they resurrected.</p></blockquote><p>Note that the two victims not only regained life, but they did so in “total disbelief”. Perhaps this newly mutated virus is the antidote for religion for which Richard Dawkins has hitherto been searching in vain. It would, of course, be <i>deeply </i>raciss to be skeptical of these accounts in any way, given the fact that both the eyewitnesses and the journalists are African.</p></div>",
  "content_text": "Fantastic. It’s not just a lethal hemorrhagic virus, it’s now mutated into something capable of\ncreating The Walking Dead\n:\nTwo Ebola patients, who died of the virus in separate communities in Nimba County have reportedly resurrected in the county. The victims, both females, believed to be in their 60s and 40s respectively, died of the Ebola virus recently in Hope Village Community and the Catholic Community in Ganta, Nimba.\nBut to the amazement of residents and onlookers on Monday, the deceased reportedly regained life in total disbelief. The New Dawn Nimba County correspondent said the late Dorris Quoi of Hope Village Community and the second victim only identified as Ma Kebeh, said to be in her late 60s, were about to be taken for burial when they resurrected.\nNote that the two victims not only regained life, but they did so in “total disbelief”. Perhaps this newly mutated virus is the antidote for religion for which Richard Dawkins has hitherto been searching in vain. It would, of course, be\ndeeply\nraciss to be skeptical of these accounts in any way, given the fact that both the eyewitnesses and the journalists are African.",
  "tags": [
    "Vibrancy is our strength"
  ],
  "categories": [],
  "sitemap_lastmod": "2014-09-25T07:19:00+00:00"
}