{
  "url": "https://voxday.net/2014/09/04/esr-calls-bs-on-torco/",
  "scraped_at": "2025-12-16T12:26:40.330732",
  "title": "esr calls BS on tor.com",
  "date_display": "September 4, 2014",
  "date_iso": "2014-09-04T08:42:00+00:00",
  "date_from_url": "2014-09-04",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>Specifically, <a href=\"http://esr.ibiblio.org/?p=6220\">with regards to their woefully misplaced glee</a> concerning an asserted discovery of “women warriors”:</p><blockquote class=\"tr_bq\"><p> Better Identification of Viking Corpses Reveals: Half of the Warriors Were Female insists an article at tor.com. It’s complete bullshit.</p><p>What you find when you read the linked article is an obvious, though as it turns out a superficial problem. The linked research doesn’t say what the article claims. What it establishes is that a hair less than half of Viking migrants were female, which is no surprise to anyone who’s been paying attention. The leap from that to “half the warriors were female” is unjustified and quite large.</p><p>There’s a deeper problem the article is trying to ignore or gaslight out of existence: reality is, at least where pre-gunpowder weapons are involved, viciously sexist.</p><p>It happens that I know a whole lot from direct experience about fighting and training with contact weapons – knives, swords, and polearms in particular. I do this for fun, and I do it in training environments that include women among the fighters.</p><p>I also know a good deal about Viking archeology – and my wife, an expert on Viking and late Iron Age costume who corresponds on equal terms with specialist historians, may know more than I do. (Persons new to the blog might wish to read my review of William Short’s Viking Weapons and Combat.) We’ve both read saga literature. We both have more than a passing acquaintance with the archeological and other evidence from other cultures historically reported to field women in combat, such as the Scythians, and have discussed it in depth.</p><p>And I’m calling bullshit. Males have, on average, about a 150% advantage in upper-body strength over females. It takes an exceptionally strong woman to match the ability of even the average man to move a contact weapon with power and speed and precise control. At equivalent levels of training, with the weight of real weapons rather than boffers, that strength advantage will almost always tell.</p><p>Supporting this, there is only very scant archeological evidence for female warriors (burials with weapons). There is almost no such evidence from Viking cultures, and what little we have is disputed; the Scythians and earlier Germanics from the Migration period have substantially more burials that might have been warrior women. Tellingly, they are almost always archers.</p></blockquote><p>Here we go again. Who do these science fiction SJW idiots think they’re trying to fool? That retarded Hugo-winning blog post about how women have always fought notwithstanding, all these women – and it is mostly women – have proven with their insane inventions and historical misrepresentations is that they have never, ever, stepped into a ring with a man.</p><p>As I have previously mentioned, I have fought women. I have fought female black belts. And it’s like fighting very flexible 12 year old boys, only the women usually quit faster. I’ve never fought a full two-minute round with a woman where I didn’t ease off; most times they will simply quit after the second time you knock them down. They are slow, small, and weak. They are much slower and weaker than you probably imagine if you have never kicked one in the face or punched one in the stomach.</p><p>I found the occasional look of betrayal some women would show to be particularly amusing. Yes, I did just hit you in the face. Yes, I’m sure it did hurt. No, I won’t stop because you’ve got tears welling up in your eyes. What on Earth do you think you are here for? That sort of dojo bunny never stuck around for long. The sort that did ended up marrying both of our senseis.</p><p>More importantly, there is the evidence of historical logic. Any society that made use of women warriors wouldn’t have survived for long. From Families and Demographics in the Viking Age:<br>   <br> <i>“A typical woman probably bore 7 infants during her lifetime,<br> 29 months apart on average. During pregnancy, women were expected to continue<br> working. After the child’s birth, the mother typically returned to work with<br> little delay. Evidence suggests that mothers nursed their children until the age<br> of 2 years, which may have dictated the interval between the births of a<br> couple’s children. A typical couple probably had 2 or<br> 3 living children at any one time. Few parents lived to see their<br> children marry. And fewer lived to see their first grandchild.</br></br></br></br></br></br></br></i></br></br></p><p>So, a female warrior would have had to be not just as good as her male counterparts, but exceptional, and kill AT LEAST seven enemy warriors before being killed herself for the opportunity cost of her warrior womanhood to be considered break even from the tribe’s perspective. Then again, it’s not impossible for at least one bygone society to have been this stupid and shortsighted. After all, our society observably is.</p><p>The idea that the Vikings were sexually egalitarian is hysterical if you have ever read the account of a Viking funeral written by Ibn Fadlan in 921, when he was serving as the secretary of an embassy from the Baghdad Caliphate to the Bulgars. By my count, sixteen men have sex with the slave girl who “volunteers” to be slain with her master before she is stabbed and strangled on the ship that is subsequently burned. Wikipedia <a href=\"http://en.wikipedia.org/wiki/Norse_funeral\">has a partial description</a>, which appears in full in the revised edition of THE HISTORY OF THE VIKINGS by Gwyn Jones.</p><p>And even the mythical warrior woman Brynhildr followed the practice in the human sacrifice she offered for Sigurd.<br>     Bond-women five<br>     shall follow him,<br>     And eight of my thralls,<br>     well-born are they,<br>     Children with me,<br>     and mine they were<br>     As gifts that Buthli<br>     his daughter gave.<br> <a href=\"http://en.wikipedia.org/wiki/Norse_funeral#cite_note-Bellows-16\"></a></br></br></br></br></br></br></br></br></br></p></div>",
  "content_text": "Specifically,\nwith regards to their woefully misplaced glee\nconcerning an asserted discovery of “women warriors”:\nBetter Identification of Viking Corpses Reveals: Half of the Warriors Were Female insists an article at tor.com. It’s complete bullshit.\nWhat you find when you read the linked article is an obvious, though as it turns out a superficial problem. The linked research doesn’t say what the article claims. What it establishes is that a hair less than half of Viking migrants were female, which is no surprise to anyone who’s been paying attention. The leap from that to “half the warriors were female” is unjustified and quite large.\nThere’s a deeper problem the article is trying to ignore or gaslight out of existence: reality is, at least where pre-gunpowder weapons are involved, viciously sexist.\nIt happens that I know a whole lot from direct experience about fighting and training with contact weapons – knives, swords, and polearms in particular. I do this for fun, and I do it in training environments that include women among the fighters.\nI also know a good deal about Viking archeology – and my wife, an expert on Viking and late Iron Age costume who corresponds on equal terms with specialist historians, may know more than I do. (Persons new to the blog might wish to read my review of William Short’s Viking Weapons and Combat.) We’ve both read saga literature. We both have more than a passing acquaintance with the archeological and other evidence from other cultures historically reported to field women in combat, such as the Scythians, and have discussed it in depth.\nAnd I’m calling bullshit. Males have, on average, about a 150% advantage in upper-body strength over females. It takes an exceptionally strong woman to match the ability of even the average man to move a contact weapon with power and speed and precise control. At equivalent levels of training, with the weight of real weapons rather than boffers, that strength advantage will almost always tell.\nSupporting this, there is only very scant archeological evidence for female warriors (burials with weapons). There is almost no such evidence from Viking cultures, and what little we have is disputed; the Scythians and earlier Germanics from the Migration period have substantially more burials that might have been warrior women. Tellingly, they are almost always archers.\nHere we go again. Who do these science fiction SJW idiots think they’re trying to fool? That retarded Hugo-winning blog post about how women have always fought notwithstanding, all these women – and it is mostly women – have proven with their insane inventions and historical misrepresentations is that they have never, ever, stepped into a ring with a man.\nAs I have previously mentioned, I have fought women. I have fought female black belts. And it’s like fighting very flexible 12 year old boys, only the women usually quit faster. I’ve never fought a full two-minute round with a woman where I didn’t ease off; most times they will simply quit after the second time you knock them down. They are slow, small, and weak. They are much slower and weaker than you probably imagine if you have never kicked one in the face or punched one in the stomach.\nI found the occasional look of betrayal some women would show to be particularly amusing. Yes, I did just hit you in the face. Yes, I’m sure it did hurt. No, I won’t stop because you’ve got tears welling up in your eyes. What on Earth do you think you are here for? That sort of dojo bunny never stuck around for long. The sort that did ended up marrying both of our senseis.\nMore importantly, there is the evidence of historical logic. Any society that made use of women warriors wouldn’t have survived for long. From Families and Demographics in the Viking Age:\n“A typical woman probably bore 7 infants during her lifetime,\n29 months apart on average. During pregnancy, women were expected to continue\nworking. After the child’s birth, the mother typically returned to work with\nlittle delay. Evidence suggests that mothers nursed their children until the age\nof 2 years, which may have dictated the interval between the births of a\ncouple’s children. A typical couple probably had 2 or\n3 living children at any one time. Few parents lived to see their\nchildren marry. And fewer lived to see their first grandchild.\nSo, a female warrior would have had to be not just as good as her male counterparts, but exceptional, and kill AT LEAST seven enemy warriors before being killed herself for the opportunity cost of her warrior womanhood to be considered break even from the tribe’s perspective. Then again, it’s not impossible for at least one bygone society to have been this stupid and shortsighted. After all, our society observably is.\nThe idea that the Vikings were sexually egalitarian is hysterical if you have ever read the account of a Viking funeral written by Ibn Fadlan in 921, when he was serving as the secretary of an embassy from the Baghdad Caliphate to the Bulgars. By my count, sixteen men have sex with the slave girl who “volunteers” to be slain with her master before she is stabbed and strangled on the ship that is subsequently burned. Wikipedia\nhas a partial description\n, which appears in full in the revised edition of THE HISTORY OF THE VIKINGS by Gwyn Jones.\nAnd even the mythical warrior woman Brynhildr followed the practice in the human sacrifice she offered for Sigurd.\nBond-women five\nshall follow him,\nAnd eight of my thralls,\nwell-born are they,\nChildren with me,\nand mine they were\nAs gifts that Buthli\nhis daughter gave.",
  "tags": [
    "history",
    "women"
  ],
  "categories": [],
  "sitemap_lastmod": "2014-09-04T07:42:00+00:00"
}