{
  "url": "https://voxday.net/2014/09/08/holding-line/",
  "scraped_at": "2025-12-16T12:27:05.725046",
  "title": "Holding the line",
  "date_display": "September 8, 2014",
  "date_iso": "2014-09-08T08:35:00+00:00",
  "date_from_url": "2014-09-08",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>One of the Honey Badgers, Hannah Wallen, explains <a href=\"http://honeybadgerbrigade.com/2014/09/07/gamergate-journalism-as-a-social-justice-war-game/\">why the SJW hate is so ferocious</a> for the gamers in Gamergate:</p><blockquote class=\"tr_bq\"><p> The only people who are equipped to fight off that rushing tide of manipulation and control are those for whom potential social rejection doesn’t constitute a threat.</p><p>That, gamers, is why gamergate is not about any one of the damseling drama queens receiving the coverage in gaming media that is now spilling over into other news sources. It not about the media themselves, either, or the companies supporting the industry.</p><p>It’s about us.</p><p>We’re not under attack because we owe anyone anything we have refused to give, or because we’ve done anything we shouldn’t have done. We’re under attack because we’re one of the last shields that human individuality in western society has.</p><p>It’s absolutely vital that gamers continue to reject the shaming and demands being launched at us by elitist social engineers in journalism. We’re the line they can’t be allowed to cross, the last bastion of intellectual freedom. Out of everyone, we have the one factor that can stop them from owning the social landscape of the western world. Out of everyone, we have the power of immunity to their weapon of choice. We have the ability to turn that very same weapon around and use it against them by not only refusing to adopt their narrative, but making our rejection of it hurt them financially.</p><p>This is how we’re going to hold the line and begin pushing back. It’s going to be ridiculously ugly. The beast that is social justice elitism is not going to go peacefully, nor is it going to change its tactics. We’re going to see that  monstrous, flailing attempt to shame us into compliance continue. We’re going to see the accusations and whining, damseling and demonization all accelerate as the elites try to smash the resistance without understanding why it exists. And then hopefully we’ll see like-minded individuals joining the ranks of resistance as they realize they don’t have to be adopt the victim narrative to be part of a community. If we can achieve just that one thing by standing our ground and defending our territory, we can push that bullying force out, take our community back, and get back to gaming in peace.</p></blockquote><p>It’s not a bad piece. Only the geeks of Gamerdom are not as alone as they think they are. Those who have followed the SFWA saga of the last two years will recognize the pattern that is at work there, that is at work in places as diverse as NBA team ownership and the executive offices of the tech industry. The SJW jihadists are attempting to drive out every heretic who dares to violate their equalitarian dogma anywhere one can be found.</p><p>But it is not only low-status rejects and outcasts who are impervious to their social pressure. And those of us who are neither rejects nor outcasts, but lone wolves by preference and temperament have the ability to build rival structures, rival institutions, and rival organizations that have the distinct advantage of operating in accordance with science, history, and objective reality rather than dogmatic fantasy.</p><p>Every time we refuse to back down, every time we refuse to accept their dogma as truth, we win. We reduce the amount of social pressure they are able to bring to bear. They know that. And it makes them furious. One need only read the foam-flecked rantings of their more outspoken members about me or about other members of the open resistance to see that. What makes them so angry about our very public resistance to their dogma is that their social pressure becomes less effective when it is seen to be resistible. That is why it is so important to  resist openly rather than to do so in a private and covert manner.</p><p>Because regardless of what you think in the privacy of your own mind, the public acquiescence of your silence causes others to believe that you are in accordance with the dogma and thereby adds to the social pressure placed upon others.</p><p>Sarah Hoyt <a href=\"http://accordingtohoyt.com/2014/09/07/grocers-of-despair-a-blast-from-the-past-post-from-december-2012/\">talks about despair</a> and how it is not only debilitating, but a sin. And perhaps some feel an amount of despair when they finally see how the cards are stacked against them simply for committing the crime of believing what their own eyes can see. But I see despair as being primarily a combination of ignorance with a failure of imagination. Things will not always be this way because the world is not, and has never been, a static place.</p><p>Maybe they will get worse. Maybe they will get better. But they won’t get any better while one sits and laments one’s losses and disappointments. One can ALWAYS accomplish SOMETHING positive, even if it is no more than refusing to be moved by lies, blandishments, and social pressure. Learn to take pride and pleasure in the small victories and you will find yourself considerably less inclined to worry overmuch about the disappointments and defeats.</p></div>",
  "content_text": "One of the Honey Badgers, Hannah Wallen, explains\nwhy the SJW hate is so ferocious\nfor the gamers in Gamergate:\nThe only people who are equipped to fight off that rushing tide of manipulation and control are those for whom potential social rejection doesn’t constitute a threat.\nThat, gamers, is why gamergate is not about any one of the damseling drama queens receiving the coverage in gaming media that is now spilling over into other news sources. It not about the media themselves, either, or the companies supporting the industry.\nIt’s about us.\nWe’re not under attack because we owe anyone anything we have refused to give, or because we’ve done anything we shouldn’t have done. We’re under attack because we’re one of the last shields that human individuality in western society has.\nIt’s absolutely vital that gamers continue to reject the shaming and demands being launched at us by elitist social engineers in journalism. We’re the line they can’t be allowed to cross, the last bastion of intellectual freedom. Out of everyone, we have the one factor that can stop them from owning the social landscape of the western world. Out of everyone, we have the power of immunity to their weapon of choice. We have the ability to turn that very same weapon around and use it against them by not only refusing to adopt their narrative, but making our rejection of it hurt them financially.\nThis is how we’re going to hold the line and begin pushing back. It’s going to be ridiculously ugly. The beast that is social justice elitism is not going to go peacefully, nor is it going to change its tactics. We’re going to see that  monstrous, flailing attempt to shame us into compliance continue. We’re going to see the accusations and whining, damseling and demonization all accelerate as the elites try to smash the resistance without understanding why it exists. And then hopefully we’ll see like-minded individuals joining the ranks of resistance as they realize they don’t have to be adopt the victim narrative to be part of a community. If we can achieve just that one thing by standing our ground and defending our territory, we can push that bullying force out, take our community back, and get back to gaming in peace.\nIt’s not a bad piece. Only the geeks of Gamerdom are not as alone as they think they are. Those who have followed the SFWA saga of the last two years will recognize the pattern that is at work there, that is at work in places as diverse as NBA team ownership and the executive offices of the tech industry. The SJW jihadists are attempting to drive out every heretic who dares to violate their equalitarian dogma anywhere one can be found.\nBut it is not only low-status rejects and outcasts who are impervious to their social pressure. And those of us who are neither rejects nor outcasts, but lone wolves by preference and temperament have the ability to build rival structures, rival institutions, and rival organizations that have the distinct advantage of operating in accordance with science, history, and objective reality rather than dogmatic fantasy.\nEvery time we refuse to back down, every time we refuse to accept their dogma as truth, we win. We reduce the amount of social pressure they are able to bring to bear. They know that. And it makes them furious. One need only read the foam-flecked rantings of their more outspoken members about me or about other members of the open resistance to see that. What makes them so angry about our very public resistance to their dogma is that their social pressure becomes less effective when it is seen to be resistible. That is why it is so important to  resist openly rather than to do so in a private and covert manner.\nBecause regardless of what you think in the privacy of your own mind, the public acquiescence of your silence causes others to believe that you are in accordance with the dogma and thereby adds to the social pressure placed upon others.\nSarah Hoyt\ntalks about despair\nand how it is not only debilitating, but a sin. And perhaps some feel an amount of despair when they finally see how the cards are stacked against them simply for committing the crime of believing what their own eyes can see. But I see despair as being primarily a combination of ignorance with a failure of imagination. Things will not always be this way because the world is not, and has never been, a static place.\nMaybe they will get worse. Maybe they will get better. But they won’t get any better while one sits and laments one’s losses and disappointments. One can ALWAYS accomplish SOMETHING positive, even if it is no more than refusing to be moved by lies, blandishments, and social pressure. Learn to take pride and pleasure in the small victories and you will find yourself considerably less inclined to worry overmuch about the disappointments and defeats.",
  "tags": [
    "SFWA",
    "society"
  ],
  "categories": [],
  "sitemap_lastmod": "2014-09-08T07:35:00+00:00"
}