{
  "url": "https://voxday.net/2014/09/03/learning-from-zion/",
  "scraped_at": "2025-12-16T12:26:36.651055",
  "title": "Learning from Zion",
  "date_display": "September 3, 2014",
  "date_iso": "2014-09-03T17:00:00+00:00",
  "date_from_url": "2014-09-03",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>I’m certain the many Jews in the American media will have no problem with the USA or any European nations <a href=\"http://www.israelnationalnews.com/News/News.aspx/184648\">following Israel’s lead</a> in how it handles what it calls “infiltrators”:</p><blockquote class=\"tr_bq\"><p> With Gaza terrorists showering Israel with rockets, August didn’t bring much good news for Israelis. But every cloud has a silver lining: in August a noted increase was recorded of illegal African immigrants leaving the country.</p><p>While there was no specific connection to the war, observers said that many in the infiltrator community were taken by surprise by the intensity of the war – and many of them have apparently decided that Israel isn’t necessarily the best place for them.</p><p>A total of 379 illegals voluntarily left Israel in August, more than had left the previous four months altogether. It was also significantly more than had left the country in August the previous year, when 216 illegals voluntarily emigrated.</p><p>So far this year, 5,388 illegal Africans have left Israel voluntarily; Israeli authorities who have investigated the infiltrators have repeatedly reported that nearly all of them snuck into Israel looking for job opportunities.</p><p>In June, more than 1,000 illegal African immigrants staged a sit-in near the southern border with Egypt, following a protest march against their internment camp in Holot, near the Sinai border, where they are required to stay. The infiltrators called for help leaving the country.</p><p>Israel requires illegal immigrants who have been in the country for more than five years to live in Holot. Under legislation passed in December 2013, authorities can detain illegal immigrants for up to a year without trial.</p></blockquote><p>It’s a good idea. But can you even imagine the hysterics that would fill the mainstream media if the US government required all of its <strike>illegal immigrants</strike>undocumented workers who had been in the USA for more than five years to live in an internment camp in Death Valley?</p><p>In any event, there is precedent. It’s often pointed out that Israel is effectively a Western nation, so let’s see the rest of the Western nations follow suit.</p></div>",
  "content_text": "I’m certain the many Jews in the American media will have no problem with the USA or any European nations\nfollowing Israel’s lead\nin how it handles what it calls “infiltrators”:\nWith Gaza terrorists showering Israel with rockets, August didn’t bring much good news for Israelis. But every cloud has a silver lining: in August a noted increase was recorded of illegal African immigrants leaving the country.\nWhile there was no specific connection to the war, observers said that many in the infiltrator community were taken by surprise by the intensity of the war – and many of them have apparently decided that Israel isn’t necessarily the best place for them.\nA total of 379 illegals voluntarily left Israel in August, more than had left the previous four months altogether. It was also significantly more than had left the country in August the previous year, when 216 illegals voluntarily emigrated.\nSo far this year, 5,388 illegal Africans have left Israel voluntarily; Israeli authorities who have investigated the infiltrators have repeatedly reported that nearly all of them snuck into Israel looking for job opportunities.\nIn June, more than 1,000 illegal African immigrants staged a sit-in near the southern border with Egypt, following a protest march against their internment camp in Holot, near the Sinai border, where they are required to stay. The infiltrators called for help leaving the country.\nIsrael requires illegal immigrants who have been in the country for more than five years to live in Holot. Under legislation passed in December 2013, authorities can detain illegal immigrants for up to a year without trial.\nIt’s a good idea. But can you even imagine the hysterics that would fill the mainstream media if the US government required all of its\nillegal immigrants\nundocumented workers who had been in the USA for more than five years to live in an internment camp in Death Valley?\nIn any event, there is precedent. It’s often pointed out that Israel is effectively a Western nation, so let’s see the rest of the Western nations follow suit.",
  "tags": [
    "immigration",
    "Zion"
  ],
  "categories": [],
  "sitemap_lastmod": "2014-09-03T16:00:00+00:00"
}