{
  "url": "https://voxday.net/2014/09/05/los-revisores-querian/",
  "scraped_at": "2025-12-16T12:26:48.504956",
  "title": "Los revisores querían",
  "date_display": "September 5, 2014",
  "date_iso": "2014-09-05T13:00:00+00:00",
  "date_from_url": "2014-09-05",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>If you speak Spanish and are interested in reviewing <a href=\"http://www.amazon.com/Estrella-Brillante-para-Guiarlos-Spanish-ebook/dp/B00NBH5A3Q\"><b><i>Una Estrella Brillante para Guiarlos</i></b></a> by John C. Wright for Amazon, please shoot me an email with ESTRELLA in the subject. The translator, Emilio, explains why it made sense to use Mexican Spanish rather than theoretically more proper Spanish.</p><blockquote class=\"tr_bq\"><p> According to the royal academy of the Spanish language, the country<br> that speaks the most proper Spanish is Colombia. But large companies,<br> like Disney, use the Mexican translation for their movies or shows for<br> all Latin America, since it’s considered the most neutral by most Latin American countries. It’s easier to understand a translation to Mexican Spanish in Peru, Argentina, or the Dominican Republic than any of those<br> dialects elsewhere. So there’s an argument to be made, that if you want<br> it to be successful economically, it should have a Mexican translation.</br></br></br></br></br></p></blockquote><p>Good enough for me. Emilio is also one of the guys who has expressed interest in setting up a new gaming review site, as is Caedryn, who posted the following comment yesterday:</p><blockquote class=\"tr_bq\"><p> If anyone is interested, I would really like to start a push for making and contributing to a blue gaming site. I have been putting around on making my own using blogger, but I run into a scope of just how much there is to cover in the industry for one person, and a realization of how relatively mediocre my writing ability is to carry a place on its own.</p><p>I personally have very limited experience on the blogging side of things, but I was a QA tester in college for a couple of companies and am working on a table top game independently as a hobby. So… very limited experience on that side as well past an obsessive desire to learn and dissect mechanics and writing.</p><p>I’d like a place for people who actually like games to be able to write about them without the need to feed into the industry and clickbait for revenue.</p><p>I’d personally want it to be a place for tabletop and video gaming or any other genres I may have missed that tie into such a framework. We could include gameplay/podcasts/whatever medium you’re into for providing commentary and reporting on news and events. I’d like to get a solid group of people together from the ilk to start talking about site design and structure and anyone initially interested in writing regardless of time dedication then branch out from there with requests for regular writers and so on.</p><p>If anyone is interested in writing at all or helping build the site, please send me an email at the account I’ve made for the project gammaphiedATgmail.com so I can get an email chain together to start discussion over this weekend.</p></blockquote><p>This is a project that both I and Castalia House will definitely want to support. Castalia, of course, is inspired by the most famous game-related novel of all, <i>Das Glasperlenspiel </i>by Hermann Hesse. I don’t have time to head up the project, but would be more than pleased to help out, as I am willing contribute my old game review columns to serve as an archive of historical reviews. I’ve also been teaching a game development course at a technical institute, and I suspect some of the students might be very interested in getting involved.</p><p>In other news, one really has to respect the power of Instapundit. Last week, we put up a free novella. There were 848 downloads and it climbed to a respectable Amazon rank although I don’t recall what it was. Yesterday, Instapundit mentioned  that <b><i><a href=\"http://www.amazon.com/QUANTUM-MORTIS-A-Mind-Programmed-ebook/dp/B00ILU0RC2/ref=zg_bs_6157856011_f_1\">QUANTUM MORTIS: A MIND PROGRAMMED</a></i></b> was a free download. It’s presently #1 in military fiction, #4 in science fiction, and #52 on Amazon.</p></div>",
  "content_text": "If you speak Spanish and are interested in reviewing\nUna Estrella Brillante para Guiarlos\nby John C. Wright for Amazon, please shoot me an email with ESTRELLA in the subject. The translator, Emilio, explains why it made sense to use Mexican Spanish rather than theoretically more proper Spanish.\nAccording to the royal academy of the Spanish language, the country\nthat speaks the most proper Spanish is Colombia. But large companies,\nlike Disney, use the Mexican translation for their movies or shows for\nall Latin America, since it’s considered the most neutral by most Latin American countries. It’s easier to understand a translation to Mexican Spanish in Peru, Argentina, or the Dominican Republic than any of those\ndialects elsewhere. So there’s an argument to be made, that if you want\nit to be successful economically, it should have a Mexican translation.\nGood enough for me. Emilio is also one of the guys who has expressed interest in setting up a new gaming review site, as is Caedryn, who posted the following comment yesterday:\nIf anyone is interested, I would really like to start a push for making and contributing to a blue gaming site. I have been putting around on making my own using blogger, but I run into a scope of just how much there is to cover in the industry for one person, and a realization of how relatively mediocre my writing ability is to carry a place on its own.\nI personally have very limited experience on the blogging side of things, but I was a QA tester in college for a couple of companies and am working on a table top game independently as a hobby. So… very limited experience on that side as well past an obsessive desire to learn and dissect mechanics and writing.\nI’d like a place for people who actually like games to be able to write about them without the need to feed into the industry and clickbait for revenue.\nI’d personally want it to be a place for tabletop and video gaming or any other genres I may have missed that tie into such a framework. We could include gameplay/podcasts/whatever medium you’re into for providing commentary and reporting on news and events. I’d like to get a solid group of people together from the ilk to start talking about site design and structure and anyone initially interested in writing regardless of time dedication then branch out from there with requests for regular writers and so on.\nIf anyone is interested in writing at all or helping build the site, please send me an email at the account I’ve made for the project gammaphiedATgmail.com so I can get an email chain together to start discussion over this weekend.\nThis is a project that both I and Castalia House will definitely want to support. Castalia, of course, is inspired by the most famous game-related novel of all,\nDas Glasperlenspiel\nby Hermann Hesse. I don’t have time to head up the project, but would be more than pleased to help out, as I am willing contribute my old game review columns to serve as an archive of historical reviews. I’ve also been teaching a game development course at a technical institute, and I suspect some of the students might be very interested in getting involved.\nIn other news, one really has to respect the power of Instapundit. Last week, we put up a free novella. There were 848 downloads and it climbed to a respectable Amazon rank although I don’t recall what it was. Yesterday, Instapundit mentioned  that\nQUANTUM MORTIS: A MIND PROGRAMMED\nwas a free download. It’s presently #1 in military fiction, #4 in science fiction, and #52 on Amazon.",
  "tags": [
    "Castalia House",
    "games"
  ],
  "categories": [],
  "sitemap_lastmod": "2014-09-05T12:00:00+00:00"
}