{
  "url": "https://voxday.net/2014/09/18/of-fraudulent-lists-and-fake-bestsellers/",
  "scraped_at": "2025-12-16T12:28:14.482227",
  "title": "Of fraudulent lists and fake “bestsellers”",
  "date_display": "September 18, 2014",
  "date_iso": "2014-09-18T20:00:00+00:00",
  "date_from_url": "2014-09-18",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>File 770 sounds a little disappointed to discover that an SF “bestseller” on the NYT Bestsellers List <a href=\"http://file770.com/?p=18813\">doesn’t necessarily indicate</a> the mainstream adoption of SF:</p><blockquote class=\"tr_bq\"><p> I’m a science fiction fan, yet I’m constantly being surprised to discover how that shapes my thinking. Although I know bestseller lists are artificial constructs, I also know they are constructs dominated by mainstream fiction and literary biases. Consequently, when a science fiction writer appears on the New York Times bestseller list I don’t ask how, I just shout “Hooray!” But now a Higher Critic has explained why I should be dissatisfied and suspicious about how they got there.</p><p>And now I am.</p><p>Vox Day unfavorably compared John Scalzi to Larry Correia based on alleged manipulation of the bestseller list. But isn’t Correia’s status as a bestselling author the same reason people believe Correia is the gold standard?</p><p>Even here, all Larry Correia ever did was point out two times when his books made the New York <i>Times</i> best seller list. Which they did. But both times the books disappeared from the list the following week. One and done….</p><p>I’m perfectly happy that Larry Correia is an NYT bestselling author. (Which I said in the post.) But since Correia and Scalzi both have experienced the same one-and-done pattern, then why would anybody doubt that Scalzi’s listings are also the result of real sales, Vox Day notwithstanding?</p></blockquote><p>Actually, <a href=\"http://www.milobookclub.com/2014/09/15/spinning-bestseller-narrative/\">I didn’t compare them</a>. I merely referenced Scalzi’s own comments on the subject. As always, Larry Correia is perfectly capable <a href=\"http://monsterhunternation.com/2014/09/17/file-770-is-mad-at-me-again-so-i-explain-how-authors-get-paid/\">of speaking for himself</a>. As for me, I answered Mr. Glyer on his own blog as follows: There are two reasons for the difference between Scalzi’s one-week showings and Mr. Correia’s. 1. Correia’s Amazon rankings at the time correlated correctly with his NYT bestseller listing. Scalzi’s Amazon rankings aren’t egregiously off, but they’re not high enough to be credible. 2. Baen Books is not known for attempting to game various awards and bestseller lists. Tor Books, which has won the Locus Award for Best Publisher <i>27 years in a row</i>, among other things, is.</p><p>Does anyone really and truly believe that whereas OLD MAN’S WAR and THE GHOST BRIGADES did not sell well enough to make the NYT Bestseller list, FUZZY NATION did?</p><p>All one had to do was look at the Amazon rankings to see that LOCK IN was not selling well enough to have made the bestseller list without a bulk-sale marketing campaign. And as noted on File 770, I had an inkling LOCK IN would not only be on the NYT bestseller list, but be there for a single week before disappearing.</p><p>These faux bestsellers aren’t any great secret. It’s just one of the ways the Big Five publishers promote their favored authors. Talk to a top editor or a publishing executive if you don’t believe me; I’m not making this stuff up. Tor is simply trying to massage public perceptions to bump a high mid-list writer into reliable bestseller status.</p><p>And then, as it happened, the Washington Examiner happened to address the issue of <a href=\"http://washingtonexaminer.com/omg-limbaughs-jesus-banished-from-nyt-best-seller-list/article/2553612\">the unreliability of this particular list</a> today:</p><blockquote class=\"tr_bq\"><p> The New York Times Book Review, which has a history of belatedly recognizing conservative bestsellers, has banished conservative legal author David Limbaugh’s latest, Jesus on Trial, from its upcoming best seller list despite having sales better than 17 other books on the list.</p><p>According to publishing sources, Limbaugh’s probe into the accuracy of the Bible sold 9,660 in its first week out, according to Nielsen BookScan. That should have made it No. 4 on the NYT print hardcover sales list.</p><p>Instead, Henry Kissinger’s World Order, praised by Hillary Clinton in the Washington Post, is No. 4 despite weekly sales of 6,607….</p><p>The September 28 list of the top 20 print hardcover best sellers includes one book that sold just 1,570 copies.</p><p>Limbaugh, published by Regnery, has been a New York Times best seller, so the newspaper should have been looking out for his high sales numbers. And as a hint, they could have looked at Amazon, where Limbaugh’s Jesus hit No. 1 recently. On Thursday, it ranked No. 6 in books sold on Amazon.</p></blockquote><p>Note first that Mr. Scalzi’s LOCK IN is presently ranked #3,566 on Amazon and did not make the September 28th list. The #20 book to which the Examiner presumably refers is I AM MALALA which is presently ranked #992 on Amazon. Keep in mind that there are two different lists and that non-fiction usually sells more than fiction.</p><p>The New York Times bestseller list is simply not what it claims to be. It’s mostly a marketing device manipulated by media ideologues and marketing departments. Some books make it legitimately. Others don’t. Fortunately, Amazon gives us a means of distinguishing between the two.</p></div>",
  "content_text": "File 770 sounds a little disappointed to discover that an SF “bestseller” on the NYT Bestsellers List\ndoesn’t necessarily indicate\nthe mainstream adoption of SF:\nI’m a science fiction fan, yet I’m constantly being surprised to discover how that shapes my thinking. Although I know bestseller lists are artificial constructs, I also know they are constructs dominated by mainstream fiction and literary biases. Consequently, when a science fiction writer appears on the New York Times bestseller list I don’t ask how, I just shout “Hooray!” But now a Higher Critic has explained why I should be dissatisfied and suspicious about how they got there.\nAnd now I am.\nVox Day unfavorably compared John Scalzi to Larry Correia based on alleged manipulation of the bestseller list. But isn’t Correia’s status as a bestselling author the same reason people believe Correia is the gold standard?\nEven here, all Larry Correia ever did was point out two times when his books made the New York\nTimes\nbest seller list. Which they did. But both times the books disappeared from the list the following week. One and done….\nI’m perfectly happy that Larry Correia is an NYT bestselling author. (Which I said in the post.) But since Correia and Scalzi both have experienced the same one-and-done pattern, then why would anybody doubt that Scalzi’s listings are also the result of real sales, Vox Day notwithstanding?\nActually,\nI didn’t compare them\n. I merely referenced Scalzi’s own comments on the subject. As always, Larry Correia is perfectly capable\nof speaking for himself\n. As for me, I answered Mr. Glyer on his own blog as follows: There are two reasons for the difference between Scalzi’s one-week showings and Mr. Correia’s. 1. Correia’s Amazon rankings at the time correlated correctly with his NYT bestseller listing. Scalzi’s Amazon rankings aren’t egregiously off, but they’re not high enough to be credible. 2. Baen Books is not known for attempting to game various awards and bestseller lists. Tor Books, which has won the Locus Award for Best Publisher\n27 years in a row\n, among other things, is.\nDoes anyone really and truly believe that whereas OLD MAN’S WAR and THE GHOST BRIGADES did not sell well enough to make the NYT Bestseller list, FUZZY NATION did?\nAll one had to do was look at the Amazon rankings to see that LOCK IN was not selling well enough to have made the bestseller list without a bulk-sale marketing campaign. And as noted on File 770, I had an inkling LOCK IN would not only be on the NYT bestseller list, but be there for a single week before disappearing.\nThese faux bestsellers aren’t any great secret. It’s just one of the ways the Big Five publishers promote their favored authors. Talk to a top editor or a publishing executive if you don’t believe me; I’m not making this stuff up. Tor is simply trying to massage public perceptions to bump a high mid-list writer into reliable bestseller status.\nAnd then, as it happened, the Washington Examiner happened to address the issue of\nthe unreliability of this particular list\ntoday:\nThe New York Times Book Review, which has a history of belatedly recognizing conservative bestsellers, has banished conservative legal author David Limbaugh’s latest, Jesus on Trial, from its upcoming best seller list despite having sales better than 17 other books on the list.\nAccording to publishing sources, Limbaugh’s probe into the accuracy of the Bible sold 9,660 in its first week out, according to Nielsen BookScan. That should have made it No. 4 on the NYT print hardcover sales list.\nInstead, Henry Kissinger’s World Order, praised by Hillary Clinton in the Washington Post, is No. 4 despite weekly sales of 6,607….\nThe September 28 list of the top 20 print hardcover best sellers includes one book that sold just 1,570 copies.\nLimbaugh, published by Regnery, has been a New York Times best seller, so the newspaper should have been looking out for his high sales numbers. And as a hint, they could have looked at Amazon, where Limbaugh’s Jesus hit No. 1 recently. On Thursday, it ranked No. 6 in books sold on Amazon.\nNote first that Mr. Scalzi’s LOCK IN is presently ranked #3,566 on Amazon and did not make the September 28th list. The #20 book to which the Examiner presumably refers is I AM MALALA which is presently ranked #992 on Amazon. Keep in mind that there are two different lists and that non-fiction usually sells more than fiction.\nThe New York Times bestseller list is simply not what it claims to be. It’s mostly a marketing device manipulated by media ideologues and marketing departments. Some books make it legitimately. Others don’t. Fortunately, Amazon gives us a means of distinguishing between the two.",
  "tags": [
    "books",
    "McRapey",
    "media"
  ],
  "categories": [],
  "sitemap_lastmod": "2014-09-18T19:00:00+00:00"
}