{
  "url": "https://voxday.net/2014/09/02/one-bright-star-to-guide-the/",
  "scraped_at": "2025-12-16T12:26:31.149569",
  "title": "One Bright Star To Guide Them",
  "date_display": "September 2, 2014",
  "date_iso": "2014-09-02T20:30:00+00:00",
  "date_from_url": "2014-09-02",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><div class=\"separator\" style=\"clear: both; text-align: center;\"></div><div class=\"separator\" style=\"clear: both; text-align: center;\"> <a href=\"http://www.milobookclub.com/wp-content/uploads/2014/09/OBS_900-1.jpg\" imageanchor=\"1\" style=\"clear: left; float: left; margin-bottom: 1em; margin-right: 1em;\"><img border=\"0\" decoding=\"async\" fetchpriority=\"high\" height=\"400\" src=\"http://www.milobookclub.com/wp-content/uploads/2014/09/OBS_900-1.jpg\" width=\"250\"/></a></div><p>At long last, we are very pleased to announce the publication of <a href=\"http://www.castaliahouse.com/downloads/one-bright-star-to-guide-them/\"><i></i></a><i><a href=\"http://www.amazon.com/dp/B00N9760GO\"><b><i>ONE BRIGHT STAR TO GUIDE THEM</i></b></a> </i> by John C. Wright. It is a beautiful novella in which Mr. Wright once more proves himself to be the Master of the Final Word; in all my reading I have yet to discover an author who is more accomplished at writing elegant, perfectly-fitting endings that leave the reader in breathless awe. The novella is available in Kindle format for $2.99 at Amazon and in DRM-free EPUB format <a href=\"http://www.castaliahouse.com/downloads/one-bright-star-to-guide-them/\">at Castalia House</a>.</p><p><i>As children, long ago, Tommy Robertson and his three friends, Penny,<br> Sally, and Richard, passed through a secret gate in a ruined garden and<br> found themselves in an elfin land, where they aided a brave prince<br> against the evil forces of the Winter King. Decades later, successful,<br> stout, and settled in his ways, Tommy is long parted from his childhood<br> friends, and their magical adventures are but a half-buried memory.</br></br></br></br></br></i></p><p><i> </i><i>But on the very eve of his promotion to London, a silver key and a<br> coal-black cat appear from the past, and Tommy finds himself summoned to<br> serve as England’s champion against the invincible Knight of Ghosts and<br> Shadows.  The terror and wonder of Faerie has broken into the Green and<br> Pleasant Land, and he alone has been given the eyes to see it. To<br> gather his companions and their relics is his quest, but age and time<br> have changed them too. Like Tommy, they are more worldly-wise, and more<br> fearful. And evil things from childhood stories grow older and darker<br> and more frightening with the passing of the years.<br> </br></br></br></br></br></br></br></br></br></i><br> <i><br/></i><i><b><i> </i></b></i><br> <i><a href=\"http://www.amazon.com/dp/B00N9760GO\"><b><i>ONE BRIGHT STAR TO GUIDE THEM</i></b></a> begins where other fairy tales end.<br> Brilliant and bittersweet, the novella hearkens back to the greatest and<br> best-loved classics of childhood fantasy. John C. Wright’s beautiful<br> fairy tale is not a subversion of these classics, but a loving and<br> nostalgic homage to them, and reminds the reader that although Ever<br> After may not always be happy, the Road of Life goes ever on and evil<br> must be defeated anew by each and every generation. </br></br></br></br></br></br></i></br></br></p><p>If you are a fan of John C. Wright or C.S. Lewis, this is one novella you simply will not want to miss. Nor is it the only Wright-related book news today, for as can be seen below, the hardcover version of <a href=\"http://www.amazon.com/Awake-Night-Land-John-Wright-ebook/dp/B00JM98V60/ref=sr_1_4?s=digital-text&amp;ie=UTF8&amp;qid=1409674287&amp;sr=1-4\"><b><i>AWAKE IN THE NIGHT LAND</i></b></a> has arrived and will soon be available from Amazon.</p><div class=\"separator\" style=\"clear: both; text-align: center;\"> <a href=\"http://www.milobookclub.com/wp-content/uploads/2014/09/AWAKE_dust.jpg\" imageanchor=\"1\" style=\"margin-left: 1em; margin-right: 1em;\"><noscript><img border=\"0\" decoding=\"async\" height=\"216\" src=\"http://www.milobookclub.com/wp-content/uploads/2014/09/AWAKE_dust.jpg\" width=\"400\"/></noscript><img border=\"0\" class=\"lazyload\" data-src=\"http://www.milobookclub.com/wp-content/uploads/2014/09/AWAKE_dust.jpg\" decoding=\"async\" height=\"216\" src=\"data:image/svg+xml,%3Csvg%20xmlns=%22http://www.w3.org/2000/svg%22%20viewBox=%220%200%20400%20216%22%3E%3C/svg%3E\" width=\"400\"/></a></div><p> UPDATE: Amazon, in its inimitable wisdom, has finally decided to provide pricing information and permit prospective readers of <i><a href=\"http://www.amazon.com/dp/B00N9760GO\"><b><i>ONE BRIGHT STAR TO GUIDE THEM</i></b></a> </i> to “Buy Now with 1-Click”. Please consider taking the time to post a review after you read the novella.</p></div>",
  "content_text": "At long last, we are very pleased to announce the publication of\nONE BRIGHT STAR TO GUIDE THEM\nby John C. Wright. It is a beautiful novella in which Mr. Wright once more proves himself to be the Master of the Final Word; in all my reading I have yet to discover an author who is more accomplished at writing elegant, perfectly-fitting endings that leave the reader in breathless awe. The novella is available in Kindle format for $2.99 at Amazon and in DRM-free EPUB format\nat Castalia House\n.\nAs children, long ago, Tommy Robertson and his three friends, Penny,\nSally, and Richard, passed through a secret gate in a ruined garden and\nfound themselves in an elfin land, where they aided a brave prince\nagainst the evil forces of the Winter King. Decades later, successful,\nstout, and settled in his ways, Tommy is long parted from his childhood\nfriends, and their magical adventures are but a half-buried memory.\nBut on the very eve of his promotion to London, a silver key and a\ncoal-black cat appear from the past, and Tommy finds himself summoned to\nserve as England’s champion against the invincible Knight of Ghosts and\nShadows.  The terror and wonder of Faerie has broken into the Green and\nPleasant Land, and he alone has been given the eyes to see it. To\ngather his companions and their relics is his quest, but age and time\nhave changed them too. Like Tommy, they are more worldly-wise, and more\nfearful. And evil things from childhood stories grow older and darker\nand more frightening with the passing of the years.\nONE BRIGHT STAR TO GUIDE THEM\nbegins where other fairy tales end.\nBrilliant and bittersweet, the novella hearkens back to the greatest and\nbest-loved classics of childhood fantasy. John C. Wright’s beautiful\nfairy tale is not a subversion of these classics, but a loving and\nnostalgic homage to them, and reminds the reader that although Ever\nAfter may not always be happy, the Road of Life goes ever on and evil\nmust be defeated anew by each and every generation.\nIf you are a fan of John C. Wright or C.S. Lewis, this is one novella you simply will not want to miss. Nor is it the only Wright-related book news today, for as can be seen below, the hardcover version of\nAWAKE IN THE NIGHT LAND\nhas arrived and will soon be available from Amazon.\nUPDATE: Amazon, in its inimitable wisdom, has finally decided to provide pricing information and permit prospective readers of\nONE BRIGHT STAR TO GUIDE THEM\nto “Buy Now with 1-Click”. Please consider taking the time to post a review after you read the novella.",
  "tags": [
    "Castalia House"
  ],
  "categories": [],
  "sitemap_lastmod": "2014-09-02T19:30:00+00:00"
}