{
  "url": "https://voxday.net/2014/09/24/russia-takes-on-globalist-pr/",
  "scraped_at": "2025-12-16T12:28:51.990361",
  "title": "Russia takes on the globalist PR",
  "date_display": "September 24, 2014",
  "date_iso": "2014-09-24T13:00:00+00:00",
  "date_from_url": "2014-09-24",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p><a href=\"http://www.ft.com/cms/s/0/f83e04ee-4339-11e4-be3f-00144feabdc0.html\">Limiting foreign media ownership</a> wouldn’t be a bad idea for the USA either.</p><blockquote class=\"tr_bq\"><p> Russia appears poised for a clampdown on western involvement in its media with<br> new legislation limiting foreign media ownership gaining momentum in<br> the Duma. Russian lawmakers on Tuesday overwhelmingly backed a bill that would<br> restrict foreign ownership of the country’s media properties to 20 per<br> cent. At present, foreign stakes in radio and television are capped at<br> 50 per cent, but no such restrictions apply to print media.</br></br></br></br></br></p><p>If adopted into law, the proposed changes would uproot the Russia<br> business of some of the world’s leading media groups and could force a<br> reshuffle of the Russian media industry….</br></br></p><p>The draft legislation also prevents foreigners from appointing top<br> editors and otherwise exerting control by more formally separating the<br> ownership and publisher roles. “With all these details, this is a piece<br> of legislation that has not been written hastily but with careful<br> consideration to close all potential loopholes,” said the foreign<br> executive.</br></br></br></br></br></p></blockquote><p>I’ve never quite understood how having foreigners own your corporations is supposed to be beneficial to anyone but the propagandists. Especially with the credit money system. Write a few bonds, “loan” the borrowed money to a state corporation, then have it buy up a controlling interest in the stock of a publicly traded media corporation belonging to the country you want to control. Congratulations, you now own a propaganda outlet with a mainline connection direct into the communications bloodstream of that country. It’s not exactly rocket science.</p><p>It’s rather remarkable how so many of Putin’s actions appear sensible, while so many of Obama’s appear to be so haplessly counterproductive as to be almost sinister.</p></div>",
  "content_text": "Limiting foreign media ownership\nwouldn’t be a bad idea for the USA either.\nRussia appears poised for a clampdown on western involvement in its media with\nnew legislation limiting foreign media ownership gaining momentum in\nthe Duma. Russian lawmakers on Tuesday overwhelmingly backed a bill that would\nrestrict foreign ownership of the country’s media properties to 20 per\ncent. At present, foreign stakes in radio and television are capped at\n50 per cent, but no such restrictions apply to print media.\nIf adopted into law, the proposed changes would uproot the Russia\nbusiness of some of the world’s leading media groups and could force a\nreshuffle of the Russian media industry….\nThe draft legislation also prevents foreigners from appointing top\neditors and otherwise exerting control by more formally separating the\nownership and publisher roles. “With all these details, this is a piece\nof legislation that has not been written hastily but with careful\nconsideration to close all potential loopholes,” said the foreign\nexecutive.\nI’ve never quite understood how having foreigners own your corporations is supposed to be beneficial to anyone but the propagandists. Especially with the credit money system. Write a few bonds, “loan” the borrowed money to a state corporation, then have it buy up a controlling interest in the stock of a publicly traded media corporation belonging to the country you want to control. Congratulations, you now own a propaganda outlet with a mainline connection direct into the communications bloodstream of that country. It’s not exactly rocket science.\nIt’s rather remarkable how so many of Putin’s actions appear sensible, while so many of Obama’s appear to be so haplessly counterproductive as to be almost sinister.",
  "tags": [
    "media"
  ],
  "categories": [],
  "sitemap_lastmod": "2014-09-24T12:00:00+00:00"
}