{
  "url": "https://voxday.net/2014/09/17/scalzi-spins-his-merry-way/",
  "scraped_at": "2025-12-16T12:28:07.905631",
  "title": "Scalzi spins his merry way",
  "date_display": "September 17, 2014",
  "date_iso": "2014-09-17T23:24:00+00:00",
  "date_from_url": "2014-09-17",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>One of the stranger metaphysical theories I’ve encountered is presented on Twitter:</p><blockquote class=\"tr_bq\"><p> There’s a dude out there who every time he asserts I’m failing,<br> something cool happens for me. Suspect this is karma punching him the<br> face.</br></br></p></blockquote><p>I find it amusing that Johnny is trying to claim that I assert he’s failing. I’ve never asserted anything of the sort EXCEPT for the fact that the sales of LOCK IN are obviously a) no better than they were for REDSHIRTS or FUZZY NATION despite b) considerably more marketing effort on the publisher’s part. I don’t think that Scalzi is failing. I think that Tor Books is failing.</p><p>Scalzi’s success doesn’t bother me at all. It certainly doesn’t harm me in the slightest. (To be honest, although I very seldom think about it, if there is one person whose success bothers me, it is Jensen Huang’s.)  I certainly wouldn’t want to trade places with the strange little guy. Aside from everything else, I’d want to kill myself if I ever saw that weird flabby body in the mirror. Anyhow, I think Scalzi is much better suited for writing<br> television scripts than novels, as he’s not a good novelist, but his one-dimensional snark routine should go over very well with the TV-watching Trekkie crowd.</br></p><p>It’s also typical that Scalzi tries to act as if he’s not the one who has repeatedly attacked me, as if he’s not the one who put pressure on SFWA to expel me from the organization. He is always trying to pretend that things are going so wonderfully well for him that he doesn’t care about the fact that I routinely expose his fraudulent efforts to market himself.</p><p>Anyhow, the point is that I haven’t repeatedly asserted that he is failing, (except, of course, as a self-respecting man). I have repeatedly asserted that he is <i>lying. </i>And I have backed up those assertions with conclusive evidence.</p></div>",
  "content_text": "One of the stranger metaphysical theories I’ve encountered is presented on Twitter:\nThere’s a dude out there who every time he asserts I’m failing,\nsomething cool happens for me. Suspect this is karma punching him the\nface.\nI find it amusing that Johnny is trying to claim that I assert he’s failing. I’ve never asserted anything of the sort EXCEPT for the fact that the sales of LOCK IN are obviously a) no better than they were for REDSHIRTS or FUZZY NATION despite b) considerably more marketing effort on the publisher’s part. I don’t think that Scalzi is failing. I think that Tor Books is failing.\nScalzi’s success doesn’t bother me at all. It certainly doesn’t harm me in the slightest. (To be honest, although I very seldom think about it, if there is one person whose success bothers me, it is Jensen Huang’s.)  I certainly wouldn’t want to trade places with the strange little guy. Aside from everything else, I’d want to kill myself if I ever saw that weird flabby body in the mirror. Anyhow, I think Scalzi is much better suited for writing\ntelevision scripts than novels, as he’s not a good novelist, but his one-dimensional snark routine should go over very well with the TV-watching Trekkie crowd.\nIt’s also typical that Scalzi tries to act as if he’s not the one who has repeatedly attacked me, as if he’s not the one who put pressure on SFWA to expel me from the organization. He is always trying to pretend that things are going so wonderfully well for him that he doesn’t care about the fact that I routinely expose his fraudulent efforts to market himself.\nAnyhow, the point is that I haven’t repeatedly asserted that he is failing, (except, of course, as a self-respecting man). I have repeatedly asserted that he is\nlying.\nAnd I have backed up those assertions with conclusive evidence.",
  "tags": [
    "McRapey"
  ],
  "categories": [],
  "sitemap_lastmod": "2014-09-17T22:24:00+00:00"
}