{
  "url": "https://voxday.net/2014/09/15/spinning-bestseller-narrative/",
  "scraped_at": "2025-12-16T12:27:48.018357",
  "title": "Spinning the “bestseller” narrative",
  "date_display": "September 15, 2014",
  "date_iso": "2014-09-15T08:28:00+00:00",
  "date_from_url": "2014-09-15",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>Once more, Johnny is counting on the fact that people don’t know the relevant facts in order to attempt to mislead them and spin the narrative in his favor. Notice, in particular, his blatant lie about my ignorance, when the fact is that just as when I caught him repeatedly lying about his traffic, I am the precise opposite of ignorant on the subject:</p><blockquote class=\"tr_bq\"><p> Vaguely related, not too long ago I noted with some amusement a perennial detractor of mine blathering ignorantly, as he nearly always does on any subject relating to me, about how it didn’t seem to him that Lock In was doing particularly well; this was almost immediately before the book hit the NYT Hardcover list and was Bookscan’s #1 top-selling front list science fiction novel. I considered sending him one of these cookies, so he could eat his words. But then I thought that giving a cookie to an asshole was a backwards way of doing things, at least from the point of view of the cookie. So, no cookies for him. He’ll just have to bask in the infinite pleasure of being wrong, so very wrong, yet again. He’s used to that, in any event.</p></blockquote><p>Now, who was wrong about those <a href=\"http://www.milobookclub.com/2014/08/19/fraud-and-douchebaggery/\">“two million page views monthly”</a> again? It’s so typical of SF/F’s Bernie Madoff that he claims I am “so very wrong” when events have gone EXACTLY as I predicted they would. It’s not that<i> Lock In</i> has been a massive failure; most, though not all, books by a reasonably known author that have been pushed as hard as Tor has pushed <i>Lock In</i> will be similarly successful in its first month. Initial “success” in the publishing industry is, to a great extent, predetermined by the publisher’s decisions concerning print runs and marketing budgets.</p><p>For example, Dan Brown’s <i>Angels and Demons</i> was such an initial failure for Pocket Books that they turned down its sequel. That’s why <i>The Da Vinci Code</i> has a different publisher than its predecessor. Pocket has since sold millions of copies, and they could have sold tens of millions of copies of Brown’s other books as well if they had simply given <i>Angels and Demons</i> a bigger print run and a marketing campaign. An executive at Random House once told me that Pocket’s mishandling of Dan Brown was the single biggest mistake he has personally observed in the industry.</p><p>So, it’s no surprise that <i>Lock In</i> is superficially successful, as Tor has invested a lot of money (relatively speaking) in the marketing of the book in both obvious ways, such as the author’s nationwide book tour and the reviews in various media outlets, and less obvious ways, such as <a href=\"http://online.wsj.com/news/articles/SB10001424127887323864304578316143623600544\">buying the book onto the New York Times Bestseller list</a>.  On Hugh Howey’s site, Tim Grahl <a href=\"http://www.hughhowey.com/the-nyt-and-wsj-best-seller-lists-must-die/\">explains how these lists work</a> and why they are merely marketing vehicles as opposed to reliable indicators of how a book is selling vis-a-vis other books.</p><p>This is the specific “also selling” addendum to the <a href=\"http://www.nytimes.com/best-sellers-books/2014-09-14/hardcover-fiction/list.html\">Hardcover Fiction list of September 14th</a>, to which McRapey is referring:</p><blockquote class=\"tr_bq\"><p>     17. THE HEIST, by Daniel Silva (Harper)<br>     18. THE SILKWORM, by Robert Galbraith (Mulholland/Little, Brown)<br>     19. THE MINIATURIST, by Jessie Burton (Ecco)<br> <b>    20. LOCK IN, by John Scalzi (Tor)</b><br>     21. TOM CLANCY: SUPPORT AND DEFEND, by Mark Greaney (Putnam)<br>     22. LOVE LETTERS, by Debbie Macomber (Ballantine)<br>     23. CLOSE TO HOME, by Lisa Jackson (Kensington)<br>     24. INVISIBLE, by James Patterson and David Ellis (Little, Brown)<br>     25. HER LAST WHISPER, by Karen Robards (Ballantine)</br></br></br></br></br></br></br></br></p><p>A version of this list appears in the September 14, 2014 issue of The New York Times Book Review. Rankings reflect sales for the week ending August 30, 2014.</p></blockquote><p>That’s great and all, but recall what I pointed out before <i>Lock In</i> reached the NYT bestseller list: “McRapey is getting annoyed that people keep pointing out that Larry<br> Correia sells more than he does, even though <b>his publisher keeps buying<br> him a one-week spot on the NYT bestseller list </br></b>each time he writes a<br> book.”  And also “Just keep an eye on the NYT list. <b>If LOCK IN is only on it for one week,<br> it’s a paid marketing stunt. </br></b>If it stays on it for several weeks, it’s<br> probably legitimate.”</br></br></br></p><p>And now the verdict is in, which is probably why McRapey is already out there frantically trying to spin the narrative again.  Here is the most recent New York Times Hardcover Fiction Bestseller list, including the “also selling” section, for <a href=\"http://www.nytimes.com/best-sellers-books/2014-09-21/hardcover-fiction/list.html\">the week of September 21st</a>. Care to guess what book isn’t on it?</p><ol><li>PERSONAL, by Lee Child</li><li>SOMEWHERE SAFE WITH SOMEBODY GOOD, by Jane Karon</li><li>THE BONE CLOCKS, by David Mitchell</li><li>THE SECRET PLACE, by Tana French</li><li>THE EYE OF HEAVEN, by Clive Kussler</li><li>COLORLESS TSUKURU TAZAKI, by Haruku Murakami</li><li>THE LONG WAY HOME, by Louise Penny</li><li>THE GOLDFINCH, by Donna Tartt</li><li>BIG LITTLE LIES, by Liane Moriarty</li><li>MEAN STREAK, by Sandra Brown</li><li>ALL THE LIGHT WE CANNOT SEE, by Anthony Doerr</li><li>DARK BLOOD, by Christine Feehan</li><li>SON OF NO ONE, by Sherrilyn Kenyon</li><li>WE ARE NOT OURSELVES, by Matthew Thomas</li><li>ADULTERY, by Paulo Coelho</li><li>SHIFTING SHADOWS, by Patricia Briggs </li><li>MURDER 101, by Faye Kellerman</li><li>ANGELS WALKING, by Karen Kingsbury </li><li>THE HUSBAND’S SECRET, by Liane Moriarty</li><li>THE 6TH EXTINCTION, by James Rollins</li></ol><p>What a complete surprise! With its one-week showing of #20, <i>Lock In</i> didn’t even do as well as his previous “New York Times bestseller” <a href=\"http://www.nytimes.com/best-sellers-books/2012-06-24/hardcover-fiction/list.html\"><i>Redshirts </i>(#15)</a> although it did do better than that famously popular bestseller <a href=\"http://www.nytimes.com/best-sellers-books/2011-05-29/hardcover-fiction/list.html\"><i>Fuzzy Nation</i> (#23).</a>  Recall what I wrote back in February 2013: “the fact is that most of Tor’s “New York Times bestsellers” observably<br> fit what we are informed is the profile of the fake bestseller. They<br> appear on the list for a single week, only to vanish the following week,<br> never to make another appearance there again.”</br></br></br></p><p>(Scalzi also claims <i>The Lost Colony</i> was a New York Times bestseller, although I was unable to find it on any of <a href=\"http://www.hawes.com/2007/2007.htm\">the 2007 lists</a>. I suspect this is because the historical lists do not include the “also selling” section. <i>Redshirts </i>is his only book to appear on the actual list per se.)</p><p>Notice that the closest comparable, Paolo Coelho’s <i>Adultery</i>, which is presently at #15 in its third week on the list, has an Amazon rank of 292 overall and a Science Fiction and Fantasy rank of 71. That’s what a legitimate bestseller looks like. <i>Lock In</i>, by comparison, has an overall rank of 2,807 and isn’t even in the Science Fiction and Fantasy top 100. It falls an order of magnitude short. Haruki Murakami’s latest is on the top 100 list for some reason, which I find very strange since there is literally nothing science fictional or fantastic about it, although I suppose that won’t prevent it from winning a Hugo next year either.</p><p><i>Lock In</i> does not appear on The Wall Street Journal’s bestseller list and is #107 on the USA Today list. Perhaps it will go up from there, but note that <i>Redshirts </i>never went higher than 55 on that list and <i>Fuzzy Nation</i> never appeared at all. In other words, the initial indications are that despite the massive marketing effort Tor Books put behind it, <i>Lock In</i> is not even doing as well as Scalzi’s award-winning Star Trek ripoff.</p><p>This is potentially significant due to what it may mean for Tor Books. I’ve heard, and seen, evidence that they are not doing very well over the last two or three years. I suspected that the otherwise inexplicable decision to push <i>Lock In</i> so hard was an indication of their urgent need for a quick revenue boost, and so I conclude that<i> Lock In</i>‘s failure to become a legitimate bestseller presages an eventual shake-up of some kind at the publisher. As always, the value of a predictive model is its ability to predict future events. It will be interesting to see if PNH is still at Tor Books proper one<br> year from now. If he is not, I suggest that will tend to support my<br> observations here.</br></br></p><p>In any event, Scalzi is spinning his “success” in the same way that an NFL running back’s agent spins it when he’s angling for a new contract. Sure, he gained a thousand yards and the team made the playoffs, but the problem is that it took him 305 attempts to gain those yards, he’s averaging 3.3 YPC , the team was a wild card that lost in the first round, and his salary is $8 million per year. The team can get similar results at considerably less cost from someone else. That’s the inevitable downside of the big splashy marketing campaign for every Big Five author. With great marketing expenditures come great expectations. Merely good results of the sort that observably could have been achieved without them is a failure.</p><p>UPDATE: McRapey is so busy with his book tour and NOT paying attention to anything that I say that he tweeted this response almost immediately:</p><blockquote class=\"tr_bq\"><p> Latest stupid from my detractors: “You were ONLY on the NYT list for a week! You’re not a real bestseller!” Shine on, you crazy diamonds!</p></blockquote><p>Well, this is awkward. Ah, Johnny, look, it’s not a real bestseller. It’s a fake one that Tor Books bulk-bought for you, just like they did with <i>The Last Colony</i> and <i>Fuzzy Nation</i> and <i>Redshirts</i>. Some would call it fraud. Tor Books calls it “marketing”.</p><p>Chin up, Johnny! Oh, wait, you don’t have one. Um, well, stay strong, tiger!</p></div>",
  "content_text": "Once more, Johnny is counting on the fact that people don’t know the relevant facts in order to attempt to mislead them and spin the narrative in his favor. Notice, in particular, his blatant lie about my ignorance, when the fact is that just as when I caught him repeatedly lying about his traffic, I am the precise opposite of ignorant on the subject:\nVaguely related, not too long ago I noted with some amusement a perennial detractor of mine blathering ignorantly, as he nearly always does on any subject relating to me, about how it didn’t seem to him that Lock In was doing particularly well; this was almost immediately before the book hit the NYT Hardcover list and was Bookscan’s #1 top-selling front list science fiction novel. I considered sending him one of these cookies, so he could eat his words. But then I thought that giving a cookie to an asshole was a backwards way of doing things, at least from the point of view of the cookie. So, no cookies for him. He’ll just have to bask in the infinite pleasure of being wrong, so very wrong, yet again. He’s used to that, in any event.\nNow, who was wrong about those\n“two million page views monthly”\nagain? It’s so typical of SF/F’s Bernie Madoff that he claims I am “so very wrong” when events have gone EXACTLY as I predicted they would. It’s not that\nLock In\nhas been a massive failure; most, though not all, books by a reasonably known author that have been pushed as hard as Tor has pushed\nLock In\nwill be similarly successful in its first month. Initial “success” in the publishing industry is, to a great extent, predetermined by the publisher’s decisions concerning print runs and marketing budgets.\nFor example, Dan Brown’s\nAngels and Demons\nwas such an initial failure for Pocket Books that they turned down its sequel. That’s why\nThe Da Vinci Code\nhas a different publisher than its predecessor. Pocket has since sold millions of copies, and they could have sold tens of millions of copies of Brown’s other books as well if they had simply given\nAngels and Demons\na bigger print run and a marketing campaign. An executive at Random House once told me that Pocket’s mishandling of Dan Brown was the single biggest mistake he has personally observed in the industry.\nSo, it’s no surprise that\nLock In\nis superficially successful, as Tor has invested a lot of money (relatively speaking) in the marketing of the book in both obvious ways, such as the author’s nationwide book tour and the reviews in various media outlets, and less obvious ways, such as\nbuying the book onto the New York Times Bestseller list\n.  On Hugh Howey’s site, Tim Grahl\nexplains how these lists work\nand why they are merely marketing vehicles as opposed to reliable indicators of how a book is selling vis-a-vis other books.\nThis is the specific “also selling” addendum to the\nHardcover Fiction list of September 14th\n, to which McRapey is referring:\n17. THE HEIST, by Daniel Silva (Harper)\n18. THE SILKWORM, by Robert Galbraith (Mulholland/Little, Brown)\n19. THE MINIATURIST, by Jessie Burton (Ecco)\n20. LOCK IN, by John Scalzi (Tor)\n21. TOM CLANCY: SUPPORT AND DEFEND, by Mark Greaney (Putnam)\n22. LOVE LETTERS, by Debbie Macomber (Ballantine)\n23. CLOSE TO HOME, by Lisa Jackson (Kensington)\n24. INVISIBLE, by James Patterson and David Ellis (Little, Brown)\n25. HER LAST WHISPER, by Karen Robards (Ballantine)\nA version of this list appears in the September 14, 2014 issue of The New York Times Book Review. Rankings reflect sales for the week ending August 30, 2014.\nThat’s great and all, but recall what I pointed out before\nLock In\nreached the NYT bestseller list: “McRapey is getting annoyed that people keep pointing out that Larry\nCorreia sells more than he does, even though\nhis publisher keeps buying\nhim a one-week spot on the NYT bestseller list\neach time he writes a\nbook.”  And also “Just keep an eye on the NYT list.\nIf LOCK IN is only on it for one week,\nit’s a paid marketing stunt.\nIf it stays on it for several weeks, it’s\nprobably legitimate.”\nAnd now the verdict is in, which is probably why McRapey is already out there frantically trying to spin the narrative again.  Here is the most recent New York Times Hardcover Fiction Bestseller list, including the “also selling” section, for\nthe week of September 21st\n. Care to guess what book isn’t on it?\nPERSONAL, by Lee Child\nSOMEWHERE SAFE WITH SOMEBODY GOOD, by Jane Karon\nTHE BONE CLOCKS, by David Mitchell\nTHE SECRET PLACE, by Tana French\nTHE EYE OF HEAVEN, by Clive Kussler\nCOLORLESS TSUKURU TAZAKI, by Haruku Murakami\nTHE LONG WAY HOME, by Louise Penny\nTHE GOLDFINCH, by Donna Tartt\nBIG LITTLE LIES, by Liane Moriarty\nMEAN STREAK, by Sandra Brown\nALL THE LIGHT WE CANNOT SEE, by Anthony Doerr\nDARK BLOOD, by Christine Feehan\nSON OF NO ONE, by Sherrilyn Kenyon\nWE ARE NOT OURSELVES, by Matthew Thomas\nADULTERY, by Paulo Coelho\nSHIFTING SHADOWS, by Patricia Briggs\nMURDER 101, by Faye Kellerman\nANGELS WALKING, by Karen Kingsbury\nTHE HUSBAND’S SECRET, by Liane Moriarty\nTHE 6TH EXTINCTION, by James Rollins\nWhat a complete surprise! With its one-week showing of #20,\nLock In\ndidn’t even do as well as his previous “New York Times bestseller”\nRedshirts\n(#15)\nalthough it did do better than that famously popular bestseller\nFuzzy Nation\n(#23).\nRecall what I wrote back in February 2013: “the fact is that most of Tor’s “New York Times bestsellers” observably\nfit what we are informed is the profile of the fake bestseller. They\nappear on the list for a single week, only to vanish the following week,\nnever to make another appearance there again.”\n(Scalzi also claims\nThe Lost Colony\nwas a New York Times bestseller, although I was unable to find it on any of\nthe 2007 lists\n. I suspect this is because the historical lists do not include the “also selling” section.\nRedshirts\nis his only book to appear on the actual list per se.)\nNotice that the closest comparable, Paolo Coelho’s\nAdultery\n, which is presently at #15 in its third week on the list, has an Amazon rank of 292 overall and a Science Fiction and Fantasy rank of 71. That’s what a legitimate bestseller looks like.\nLock In\n, by comparison, has an overall rank of 2,807 and isn’t even in the Science Fiction and Fantasy top 100. It falls an order of magnitude short. Haruki Murakami’s latest is on the top 100 list for some reason, which I find very strange since there is literally nothing science fictional or fantastic about it, although I suppose that won’t prevent it from winning a Hugo next year either.\nLock In\ndoes not appear on The Wall Street Journal’s bestseller list and is #107 on the USA Today list. Perhaps it will go up from there, but note that\nRedshirts\nnever went higher than 55 on that list and\nFuzzy Nation\nnever appeared at all. In other words, the initial indications are that despite the massive marketing effort Tor Books put behind it,\nLock In\nis not even doing as well as Scalzi’s award-winning Star Trek ripoff.\nThis is potentially significant due to what it may mean for Tor Books. I’ve heard, and seen, evidence that they are not doing very well over the last two or three years. I suspected that the otherwise inexplicable decision to push\nLock In\nso hard was an indication of their urgent need for a quick revenue boost, and so I conclude that\nLock In\n‘s failure to become a legitimate bestseller presages an eventual shake-up of some kind at the publisher. As always, the value of a predictive model is its ability to predict future events. It will be interesting to see if PNH is still at Tor Books proper one\nyear from now. If he is not, I suggest that will tend to support my\nobservations here.\nIn any event, Scalzi is spinning his “success” in the same way that an NFL running back’s agent spins it when he’s angling for a new contract. Sure, he gained a thousand yards and the team made the playoffs, but the problem is that it took him 305 attempts to gain those yards, he’s averaging 3.3 YPC , the team was a wild card that lost in the first round, and his salary is $8 million per year. The team can get similar results at considerably less cost from someone else. That’s the inevitable downside of the big splashy marketing campaign for every Big Five author. With great marketing expenditures come great expectations. Merely good results of the sort that observably could have been achieved without them is a failure.\nUPDATE: McRapey is so busy with his book tour and NOT paying attention to anything that I say that he tweeted this response almost immediately:\nLatest stupid from my detractors: “You were ONLY on the NYT list for a week! You’re not a real bestseller!” Shine on, you crazy diamonds!\nWell, this is awkward. Ah, Johnny, look, it’s not a real bestseller. It’s a fake one that Tor Books bulk-bought for you, just like they did with\nThe Last Colony\nand\nFuzzy Nation\nand\nRedshirts\n. Some would call it fraud. Tor Books calls it “marketing”.\nChin up, Johnny! Oh, wait, you don’t have one. Um, well, stay strong, tiger!",
  "tags": [
    "corpocracy",
    "McRapey"
  ],
  "categories": [],
  "sitemap_lastmod": "2014-09-15T07:28:00+00:00"
}