{
  "url": "https://voxday.net/2014/09/26/technology-making-life-better/",
  "scraped_at": "2025-12-16T12:29:04.847874",
  "title": "Technology making life better",
  "date_display": "September 26, 2014",
  "date_iso": "2014-09-26T06:00:00+00:00",
  "date_from_url": "2014-09-26",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>For bankers, anyhow. And don’t think <a href=\"http://dealbook.nytimes.com/2014/09/24/miss-a-payment-good-luck-moving-that-car/?_php=true&amp;_type=blogs&amp;_r=0\">this payment technology</a> won’t eventually be applied to medical systems:</p><blockquote class=\"tr_bq\"><p> Auto loans to borrowers considered subprime, those with credit scores at or below 640, have spiked in the last five years. The jump has been driven in large part by the demand among investors for securities backed by the loans, which offer high returns at a time of low interest rates. Roughly 25 percent of all new auto loans made last year were subprime, and the volume of subprime auto loans reached more than $145 billion in the first three months of this year.</p><p>But before they can drive off the lot, many subprime borrowers like Ms. Bolender must have their car outfitted with a so-called starter interrupt device, which allows lenders to remotely disable the ignition. Using the GPS technology on the devices, the lenders can also track the cars’ location and movements.</p><p>The devices, which have been installed in about two million vehicles, are helping feed the subprime boom by enabling more high-risk borrowers to get loans. But there is a big catch. By simply clicking a mouse or tapping a smartphone, lenders retain the ultimate control. Borrowers must stay current with their payments, or lose access to their vehicle…. Now used in about one-quarter of subprime auto loans nationwide, the<br> devices are reshaping the dynamics of auto lending by making timely<br> payments as vital to driving a car as gasoline.</br></br></p></blockquote><p>Brave New World indeed. They’re really squeezing every last drop of credit out of the economy.</p></div>",
  "content_text": "For bankers, anyhow. And don’t think\nthis payment technology\nwon’t eventually be applied to medical systems:\nAuto loans to borrowers considered subprime, those with credit scores at or below 640, have spiked in the last five years. The jump has been driven in large part by the demand among investors for securities backed by the loans, which offer high returns at a time of low interest rates. Roughly 25 percent of all new auto loans made last year were subprime, and the volume of subprime auto loans reached more than $145 billion in the first three months of this year.\nBut before they can drive off the lot, many subprime borrowers like Ms. Bolender must have their car outfitted with a so-called starter interrupt device, which allows lenders to remotely disable the ignition. Using the GPS technology on the devices, the lenders can also track the cars’ location and movements.\nThe devices, which have been installed in about two million vehicles, are helping feed the subprime boom by enabling more high-risk borrowers to get loans. But there is a big catch. By simply clicking a mouse or tapping a smartphone, lenders retain the ultimate control. Borrowers must stay current with their payments, or lose access to their vehicle…. Now used in about one-quarter of subprime auto loans nationwide, the\ndevices are reshaping the dynamics of auto lending by making timely\npayments as vital to driving a car as gasoline.\nBrave New World indeed. They’re really squeezing every last drop of credit out of the economy.",
  "tags": [
    "corpocracy",
    "technology"
  ],
  "categories": [],
  "sitemap_lastmod": "2014-09-26T05:00:00+00:00"
}