{
  "url": "https://voxday.net/2014/09/01/the-decline-of-game-reviews/",
  "scraped_at": "2025-12-16T12:26:20.472656",
  "title": "The decline of game reviews",
  "date_display": "September 1, 2014",
  "date_iso": "2014-09-01T13:00:00+00:00",
  "date_from_url": "2014-09-01",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><div class=\"separator\" style=\"clear: both; text-align: center;\"></div><div class=\"separator\" style=\"clear: both; text-align: center;\"> <a href=\"https://images.encyclopediadramatica.es/2/23/Kotaco.jpg\" imageanchor=\"1\" style=\"margin-left: 1em; margin-right: 1em;\"><noscript><img border=\"0\" decoding=\"async\" src=\"https://images.encyclopediadramatica.es/2/23/Kotaco.jpg\"/></noscript><img border=\"0\" class=\"lazyload\" data-src=\"https://images.encyclopediadramatica.es/2/23/Kotaco.jpg\" decoding=\"async\" src=\"data:image/svg+xml,%3Csvg%20xmlns=%22http://www.w3.org/2000/svg%22%20viewBox=%220%200%20210%20140%22%3E%3C/svg%3E\"/></a></div><p> Speaking of the declining quality of reviews, consider the implications of this superficially glowing review of McRapey’s latest book in <a href=\"http://www.usatoday.com/story/life/books/2014/08/30/lock-in/14361393/\">USA TODAY</a>: <i>“Lock In cements the award-winning writer as one of the best in today’s sci-fi community”</i></p><p>That is intended as praise, but it is more correctly understood as an indictment of today’s sci-fi community. And this comment from an Amazon review made me laugh: <i>“I was a little irked that the huge revelation in this book is basically<br> that computers can be hacked.  I mean really?  You put a computer in<br> someone’s brain and you are all like “Oh, that will be completely safe,<br> we have a ton of safeguards in place.”  I think it was incredibly<br> ignorant (and anti-climatic) to think that no one would realize a brain<br> computer can be hacked just like any other type of computer.  If you<br> have software it can be hacked.”</br></br></br></br></br></br></i></p><p>Wait, embedded computers can be hacked? MIND! BLOWN! I can only conclude that Mr. Scalzi’s technological genius sounds like a perfect match for the SyFy audience.</p><p>Given the rather limited enthusiasm with which <i>Lock In</i> has been greeted by his fans (it only has a 4.1 rating on Amazon in its first week),  I’m wondering why Tor Books has put such a big marketing blitz behind the book. I’ve heard rumors (and seen some indications myself) that they are experiencing difficulties, and certainly it isn’t a good sign that their bestsellers for the last three years have either been game tie-in novels or Orson Scott Card novels first published three decades ago.</p><p>My surmise, and at this point it is nothing more than that, is Tor Books desperately needs Scalzi to have a Larry Correia-sized hit in order to make up for all the award-winning drek it has published that hasn’t sold. Hence the outsized push, which McRapey’s book doesn’t appear to be able to support. I expect it won’t be too long before we start hearing more about this, probably in the next 6-9 months.</p><p>The usual suspects may now commence with their customary accusations of jealousy. Go ahead, my little friends, you know you want to. Go ahead and get them out of the way so the rest of us can proceed with the discussion. Anyhow, to return to the subject of game reviews, I see Breitbart has <a href=\"http://www.breitbart.com/Breitbart-London/2014/09/01/Lying-Greedy-Promiscuous-Feminist-Bullies-are-Tearing-the-Video-Game-Industry-Apart\">a good summary of the Quinnspiracy and #GamerGate</a>:</p><blockquote class=\"tr_bq\"><p> The enduring effect of #GamerGate is obvious: the gaming media has destroyed its reputation and its relationship with readers, who will never again trust it on any issue beyond which power-up is most likely to get you past level 17. By blaming its readers and burying its head in the sand, the politicised bloggers who previously influenced the opinions of millions have voluntarily given up their authority to rabid, single-issue campaigners who silence criticism and sleep with journalists and peers to get ahead.</p><p>This is a subject I’ll return to in a later column: a brief history of corruption in video game journalism needs to be written. In the meantime, those of us with some critical distance from the chaos can only sit back and marvel at how wide-ranging and fundamental the damage to the indie games industry has been these last two weeks. There are now two, bitterly opposed factions in the industry. Journalists and activists, who care more about gender politics than the video games they are supposed to be reporting on, and gamers, mocked, derided and bullied… but unbowed.</p><p>Video gamers, and video game culture, will never be the same again.</p></blockquote><p>That certainly sounds more than a little familiar, doesn’t it?</p></div>",
  "content_text": "Speaking of the declining quality of reviews, consider the implications of this superficially glowing review of McRapey’s latest book in\nUSA TODAY\n:\n“Lock In cements the award-winning writer as one of the best in today’s sci-fi community”\nThat is intended as praise, but it is more correctly understood as an indictment of today’s sci-fi community. And this comment from an Amazon review made me laugh:\n“I was a little irked that the huge revelation in this book is basically\nthat computers can be hacked.  I mean really?  You put a computer in\nsomeone’s brain and you are all like “Oh, that will be completely safe,\nwe have a ton of safeguards in place.”  I think it was incredibly\nignorant (and anti-climatic) to think that no one would realize a brain\ncomputer can be hacked just like any other type of computer.  If you\nhave software it can be hacked.”\nWait, embedded computers can be hacked? MIND! BLOWN! I can only conclude that Mr. Scalzi’s technological genius sounds like a perfect match for the SyFy audience.\nGiven the rather limited enthusiasm with which\nLock In\nhas been greeted by his fans (it only has a 4.1 rating on Amazon in its first week),  I’m wondering why Tor Books has put such a big marketing blitz behind the book. I’ve heard rumors (and seen some indications myself) that they are experiencing difficulties, and certainly it isn’t a good sign that their bestsellers for the last three years have either been game tie-in novels or Orson Scott Card novels first published three decades ago.\nMy surmise, and at this point it is nothing more than that, is Tor Books desperately needs Scalzi to have a Larry Correia-sized hit in order to make up for all the award-winning drek it has published that hasn’t sold. Hence the outsized push, which McRapey’s book doesn’t appear to be able to support. I expect it won’t be too long before we start hearing more about this, probably in the next 6-9 months.\nThe usual suspects may now commence with their customary accusations of jealousy. Go ahead, my little friends, you know you want to. Go ahead and get them out of the way so the rest of us can proceed with the discussion. Anyhow, to return to the subject of game reviews, I see Breitbart has\na good summary of the Quinnspiracy and #GamerGate\n:\nThe enduring effect of #GamerGate is obvious: the gaming media has destroyed its reputation and its relationship with readers, who will never again trust it on any issue beyond which power-up is most likely to get you past level 17. By blaming its readers and burying its head in the sand, the politicised bloggers who previously influenced the opinions of millions have voluntarily given up their authority to rabid, single-issue campaigners who silence criticism and sleep with journalists and peers to get ahead.\nThis is a subject I’ll return to in a later column: a brief history of corruption in video game journalism needs to be written. In the meantime, those of us with some critical distance from the chaos can only sit back and marvel at how wide-ranging and fundamental the damage to the indie games industry has been these last two weeks. There are now two, bitterly opposed factions in the industry. Journalists and activists, who care more about gender politics than the video games they are supposed to be reporting on, and gamers, mocked, derided and bullied… but unbowed.\nVideo gamers, and video game culture, will never be the same again.\nThat certainly sounds more than a little familiar, doesn’t it?",
  "tags": [
    "games",
    "McRapey"
  ],
  "categories": [],
  "sitemap_lastmod": "2014-09-01T12:00:00+00:00"
}