{
  "url": "https://voxday.net/2014/09/17/the-fiction-police/",
  "scraped_at": "2025-12-16T12:28:00.551294",
  "title": "Defeating the fiction police",
  "date_display": "September 17, 2014",
  "date_iso": "2014-09-17T08:00:00+00:00",
  "date_from_url": "2014-09-17",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><div class=\"separator\" style=\"clear: both; text-align: center;\"> <a href=\"http://33.media.tumblr.com/238a2b625c0b1529546cce2c83732da8/tumblr_nbz1knJbXK1rwmkdpo1_500.png\" imageanchor=\"1\" style=\"margin-left: 1em; margin-right: 1em;\"><noscript><img border=\"0\" decoding=\"async\" src=\"http://33.media.tumblr.com/238a2b625c0b1529546cce2c83732da8/tumblr_nbz1knJbXK1rwmkdpo1_500.png\"/></noscript><img border=\"0\" class=\"lazyload\" data-src=\"http://33.media.tumblr.com/238a2b625c0b1529546cce2c83732da8/tumblr_nbz1knJbXK1rwmkdpo1_500.png\" decoding=\"async\" src=\"data:image/svg+xml,%3Csvg%20xmlns=%22http://www.w3.org/2000/svg%22%20viewBox=%220%200%20210%20140%22%3E%3C/svg%3E\"/></a></div><p> The cartoon is <a href=\"http://uvwmaps.com/post/97614834253/social-justice\">from here</a>. One autistic indy game developer points out that he doesn’t think <a href=\"http://gamergate.giz.moe/2014/09/tumblr-crowned-daemon-a-personal-statement-from-an-indie-dev-on-why-gamergate-is-important/\">praising the talking dog for the content of his speech</a> is helping him:</p><blockquote class=\"tr_bq\"><p> Those in the gaming mass media think they’re doing people like me a favor, but they’re not. They’re smothering me and others like me. I know now there is no way they will hold my game truly accountable for any flaws it might ultimately have because they’ll think that any dismissal or criticism of the game as a whole will be a direct attack on autistic people, and it quite clearly is not. When people do dog pile on games that cover issues like this (I won’t name names but I’m sure you can fill in the blanks), it’s because of how the subject matter is approached, not that it was approached at all. The flaws of these games have been in their inability to truly connect with the people who play them, not that they had the audacity to attempt something new. If I had come forward before this, I would have been made a pet of the ‘social justice gaming crowd’, a person they could throw around to show how diverse and righteous they are, all while shielding themselves from criticism. I would be given preferential treatment just like I always have. It never ends….</p><p>Seeing a new game get ravaged for supposed sexism, racism, homophobia,<br> transphobia, ableism, etc. seemingly every week makes me feel less<br> inclined to want to write characters like Tinker, Hannah, or the many<br> others who will be playable in our game. To these people and<br> publications, all I have to ask is: is this what you want? Do you want<br> people to be too afraid to make inclusive art? Because whether that was<br> your intent or not, it’s what’s actually happening. It’s hard enough<br> investing all your money and time into making a studio, working for<br> years on a game that will eventually be judged by both critics and<br> consumers without then also having to be worried that those same critics<br> will sensationalize your game in order to make a few more big articles.</br></br></br></br></br></br></br></br></br></br></p></blockquote><p>My answer is that the game developer should do as Harlan Ellison has suggested that the author do: answer them with the mighty power of your pen. By which he means to ignore them and write or develop whatever it is that YOU decide you want your book, or your game, to be.</p><p>Some people have already complained that FIRST SWORD has no female gladiators.  Tough. There is no need for them and so we’re not going to waste any time or development resources on them. And if the Social Justice Whores don’t like that, well, they are welcome to decry the lack of female slavery in our game to their heart’s content; it’s not going to make any difference whatsoever to me or to how well the game does.</p><p>The only power the Social Justice Whores have over you is the power you give them. Look at VP and its continually growing traffic. Look at Castalia and the increasing number of books it is publishing. Both have prospered despite the best efforts of the SJWs to attack them. There is no reason to give them even the slightest ground; doing so only inflames and encourages them. So don’t do it!</p><p>Root them out wherever they have infested, slap down all their attempts to invade and influence, and resolutely ignore them when they are safely on the outside. John C. Wright explains how they, and a panoply of other evils, <a href=\"http://www.scifiwright.com/2014/09/victory-3/\">will be defeated</a>:</p><blockquote class=\"tr_bq\"><p> I submit that victory shall be ours by using the same methods we used to overthrow the Roman Empire and replace paganism with Christianity.</p><p>First, we must pray. We must live differently from the pagans around us, according to standards of higher discipline, displaying more fidelity in marriage, eschewing divorce, assisting the poor and downtrodden, and living lives so holy that even the devils are amazed.</p><p>Second, by being willing to suffer public scorn, loss of prestige, position, and fortune for Christ.</p><p>Third, by being open, vocal, coordinated, and relentless in our efforts. Fourth, by staying on message and never giving an inch.</p><p>Fifth and last, by showing the imagination of man that no one can live in the craven airless cesspool of the mental environment of political correctness, but that men flourish and grow strong and brave, not to mention more sexually appealing, in the walled gardens of the Church and the battlefields of life.</p></blockquote><p>Stay on message. Never give an inch. Stop trying to play moderate in the hopes that you’ll escape the heat. Stop trying to win them over by telling them that you’re not opposed to them when, in fact, you are. You cannot reason with the willfully insane.</p></div>",
  "content_text": "The cartoon is\nfrom here\n. One autistic indy game developer points out that he doesn’t think\npraising the talking dog for the content of his speech\nis helping him:\nThose in the gaming mass media think they’re doing people like me a favor, but they’re not. They’re smothering me and others like me. I know now there is no way they will hold my game truly accountable for any flaws it might ultimately have because they’ll think that any dismissal or criticism of the game as a whole will be a direct attack on autistic people, and it quite clearly is not. When people do dog pile on games that cover issues like this (I won’t name names but I’m sure you can fill in the blanks), it’s because of how the subject matter is approached, not that it was approached at all. The flaws of these games have been in their inability to truly connect with the people who play them, not that they had the audacity to attempt something new. If I had come forward before this, I would have been made a pet of the ‘social justice gaming crowd’, a person they could throw around to show how diverse and righteous they are, all while shielding themselves from criticism. I would be given preferential treatment just like I always have. It never ends….\nSeeing a new game get ravaged for supposed sexism, racism, homophobia,\ntransphobia, ableism, etc. seemingly every week makes me feel less\ninclined to want to write characters like Tinker, Hannah, or the many\nothers who will be playable in our game. To these people and\npublications, all I have to ask is: is this what you want? Do you want\npeople to be too afraid to make inclusive art? Because whether that was\nyour intent or not, it’s what’s actually happening. It’s hard enough\ninvesting all your money and time into making a studio, working for\nyears on a game that will eventually be judged by both critics and\nconsumers without then also having to be worried that those same critics\nwill sensationalize your game in order to make a few more big articles.\nMy answer is that the game developer should do as Harlan Ellison has suggested that the author do: answer them with the mighty power of your pen. By which he means to ignore them and write or develop whatever it is that YOU decide you want your book, or your game, to be.\nSome people have already complained that FIRST SWORD has no female gladiators.  Tough. There is no need for them and so we’re not going to waste any time or development resources on them. And if the Social Justice Whores don’t like that, well, they are welcome to decry the lack of female slavery in our game to their heart’s content; it’s not going to make any difference whatsoever to me or to how well the game does.\nThe only power the Social Justice Whores have over you is the power you give them. Look at VP and its continually growing traffic. Look at Castalia and the increasing number of books it is publishing. Both have prospered despite the best efforts of the SJWs to attack them. There is no reason to give them even the slightest ground; doing so only inflames and encourages them. So don’t do it!\nRoot them out wherever they have infested, slap down all their attempts to invade and influence, and resolutely ignore them when they are safely on the outside. John C. Wright explains how they, and a panoply of other evils,\nwill be defeated\n:\nI submit that victory shall be ours by using the same methods we used to overthrow the Roman Empire and replace paganism with Christianity.\nFirst, we must pray. We must live differently from the pagans around us, according to standards of higher discipline, displaying more fidelity in marriage, eschewing divorce, assisting the poor and downtrodden, and living lives so holy that even the devils are amazed.\nSecond, by being willing to suffer public scorn, loss of prestige, position, and fortune for Christ.\nThird, by being open, vocal, coordinated, and relentless in our efforts. Fourth, by staying on message and never giving an inch.\nFifth and last, by showing the imagination of man that no one can live in the craven airless cesspool of the mental environment of political correctness, but that men flourish and grow strong and brave, not to mention more sexually appealing, in the walled gardens of the Church and the battlefields of life.\nStay on message. Never give an inch. Stop trying to play moderate in the hopes that you’ll escape the heat. Stop trying to win them over by telling them that you’re not opposed to them when, in fact, you are. You cannot reason with the willfully insane.",
  "tags": [
    "games",
    "SJW"
  ],
  "categories": [],
  "sitemap_lastmod": "2014-09-17T07:00:00+00:00"
}