{
  "url": "https://voxday.net/2014/09/23/the-beginning-of-end/",
  "scraped_at": "2025-12-16T12:28:44.375029",
  "title": "The beginning of the end",
  "date_display": "September 23, 2014",
  "date_iso": "2014-09-23T13:00:00+00:00",
  "date_from_url": "2014-09-23",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p><a href=\"http://www.americanrhetoric.com/speeches/alexandersolzhenitsynharvard.htm\">This 1978 speech</a> given by Alexander Solzhenitsyn at Harvard is not only prophetic, but appears to have fallen entirely on deaf ears:</p><blockquote class=\"tr_bq\"><p> How short a time ago, relatively, the small, new European world was easily seizing colonies everywhere, not only without anticipating any real resistance, but also usually despising any possible values in the conquered people’s approach to life. On the face of it, it was an overwhelming success. There were no geographic frontiers [limits] to it. Western society expanded in a triumph of human independence and power. And all of a sudden in the 20th century came the discovery of its fragility and friability.</p><p>We now see that the conquests proved to be short lived and precarious — and this, in turn, points to defects in the Western view of the world which led to these conquests. Relations with the former colonial world now have turned into their opposite and the Western world often goes to extremes of subservience, but it is difficult yet to estimate the total size of the bill which former colonial countries will present to the West and it is difficult to predict whether the surrender not only of its last colonies, but of everything it owns, will be sufficient for the West to foot the bill.</p><p>But the blindness of superiority continues in spite of all and upholds the belief that the vast regions everywhere on our planet should develop and mature to the level of present day Western systems, which in theory are the best and in practice the most attractive. There is this belief that all those other worlds are only being temporarily prevented (by wicked governments or by heavy crises or by their own barbarity and incomprehension) from taking the way of Western pluralistic democracy and from adopting the Western way of life. Countries are judged on the merit of their progress in this direction.</p><p>However, it is a conception which develops out of Western incomprehension of the essence of other worlds, out of the mistake of measuring them all with a Western yardstick. The real picture of our planet’s development is quite different and which about our divided world gave birth to the theory of convergence between leading Western countries and the Soviet Union. It is a soothing theory which overlooks the fact that these worlds are not at all developing into similarity. Neither one can be transformed into the other without the use of violence. Besides, convergence inevitably means acceptance of the other side’s defects, too, and this is hardly desirable.</p><p>If I were today addressing an audience in my country, examining the overall pattern of the world’s rifts, I would have concentrated on the East’s calamities. But since my forced exile in the West has now lasted four years and since my audience is a Western one, I think it may be of greater interest to concentrate on certain aspects of the West, in our days, such as I see them.</p><p>A decline in courage may be the most striking feature which an outside observer notices in the West in our days. The Western world has lost its civil courage, both as a whole and separately, in each country, each government, each political party, and, of course, in the United Nations. Such a decline in courage is particularly noticeable among the ruling groups and the intellectual elite, causing an impression of loss of courage by the entire society. Of course, there are many courageous individuals, but they have no determining influence on public life.</p><p>Political and intellectual bureaucrats show depression, passivity, and perplexity in their actions and in their statements, and even more so in theoretical reflections to explain how realistic, reasonable, as well as intellectually and even morally worn it is to base state policies on weakness and cowardice. And decline in courage is ironically emphasized by occasional explosions of anger and inflexibility on the part of the same bureaucrats when dealing with weak governments and with countries not supported by anyone, or with currents which cannot offer any resistance. But they get tongue-tied and paralyzed when they deal with powerful governments and threatening forces, with aggressors and international terrorists.</p><p>Should one point out that from ancient times declining courage has been considered the beginning of the end?</p></blockquote><p>Solzhenitsyn even foresaw the vicious and unending assault of the Social Justice Warriors: “Social dogmatism leaves us completely helpless in front of the trials of our times.” Social Justice Enforcers would be a more apt term. The SJWs are nothing less than the <i>mutaween </i>of the godless West, the self-appointed enforcers of the would-be globalist elite’s hellish parody of morality.</p><p>This is the time to make your choice. This is the time to stand up for what you believe. This is the time to show courage rather than to keep silent in the hope that you will be overlooked and the rabid mob will pass you by. This is the time to support those who stand with you and abandon those who don’t. This is the time to stop trying to appease the voracious, insatiable rabbits, who have tasted blood and discovered that they rather like it.</p><p>This is not the time for cowardice.</p><p>Sooner or later, the end will come. Every society ever known to Man has come to an end and ours will not be an exception. But if it ends in our time, let us be found with wounds in the front of our bodies and broken, bloody swords in hand. And if it ends in our children’s or grandchildren’s times, let them be able to look to us, as we look to Solzhenitsyn, and know that we prepared them for the battles they must fight.</p></div>",
  "content_text": "This 1978 speech\ngiven by Alexander Solzhenitsyn at Harvard is not only prophetic, but appears to have fallen entirely on deaf ears:\nHow short a time ago, relatively, the small, new European world was easily seizing colonies everywhere, not only without anticipating any real resistance, but also usually despising any possible values in the conquered people’s approach to life. On the face of it, it was an overwhelming success. There were no geographic frontiers [limits] to it. Western society expanded in a triumph of human independence and power. And all of a sudden in the 20th century came the discovery of its fragility and friability.\nWe now see that the conquests proved to be short lived and precarious — and this, in turn, points to defects in the Western view of the world which led to these conquests. Relations with the former colonial world now have turned into their opposite and the Western world often goes to extremes of subservience, but it is difficult yet to estimate the total size of the bill which former colonial countries will present to the West and it is difficult to predict whether the surrender not only of its last colonies, but of everything it owns, will be sufficient for the West to foot the bill.\nBut the blindness of superiority continues in spite of all and upholds the belief that the vast regions everywhere on our planet should develop and mature to the level of present day Western systems, which in theory are the best and in practice the most attractive. There is this belief that all those other worlds are only being temporarily prevented (by wicked governments or by heavy crises or by their own barbarity and incomprehension) from taking the way of Western pluralistic democracy and from adopting the Western way of life. Countries are judged on the merit of their progress in this direction.\nHowever, it is a conception which develops out of Western incomprehension of the essence of other worlds, out of the mistake of measuring them all with a Western yardstick. The real picture of our planet’s development is quite different and which about our divided world gave birth to the theory of convergence between leading Western countries and the Soviet Union. It is a soothing theory which overlooks the fact that these worlds are not at all developing into similarity. Neither one can be transformed into the other without the use of violence. Besides, convergence inevitably means acceptance of the other side’s defects, too, and this is hardly desirable.\nIf I were today addressing an audience in my country, examining the overall pattern of the world’s rifts, I would have concentrated on the East’s calamities. But since my forced exile in the West has now lasted four years and since my audience is a Western one, I think it may be of greater interest to concentrate on certain aspects of the West, in our days, such as I see them.\nA decline in courage may be the most striking feature which an outside observer notices in the West in our days. The Western world has lost its civil courage, both as a whole and separately, in each country, each government, each political party, and, of course, in the United Nations. Such a decline in courage is particularly noticeable among the ruling groups and the intellectual elite, causing an impression of loss of courage by the entire society. Of course, there are many courageous individuals, but they have no determining influence on public life.\nPolitical and intellectual bureaucrats show depression, passivity, and perplexity in their actions and in their statements, and even more so in theoretical reflections to explain how realistic, reasonable, as well as intellectually and even morally worn it is to base state policies on weakness and cowardice. And decline in courage is ironically emphasized by occasional explosions of anger and inflexibility on the part of the same bureaucrats when dealing with weak governments and with countries not supported by anyone, or with currents which cannot offer any resistance. But they get tongue-tied and paralyzed when they deal with powerful governments and threatening forces, with aggressors and international terrorists.\nShould one point out that from ancient times declining courage has been considered the beginning of the end?\nSolzhenitsyn even foresaw the vicious and unending assault of the Social Justice Warriors: “Social dogmatism leaves us completely helpless in front of the trials of our times.” Social Justice Enforcers would be a more apt term. The SJWs are nothing less than the\nmutaween\nof the godless West, the self-appointed enforcers of the would-be globalist elite’s hellish parody of morality.\nThis is the time to make your choice. This is the time to stand up for what you believe. This is the time to show courage rather than to keep silent in the hope that you will be overlooked and the rabid mob will pass you by. This is the time to support those who stand with you and abandon those who don’t. This is the time to stop trying to appease the voracious, insatiable rabbits, who have tasted blood and discovered that they rather like it.\nThis is not the time for cowardice.\nSooner or later, the end will come. Every society ever known to Man has come to an end and ours will not be an exception. But if it ends in our time, let us be found with wounds in the front of our bodies and broken, bloody swords in hand. And if it ends in our children’s or grandchildren’s times, let them be able to look to us, as we look to Solzhenitsyn, and know that we prepared them for the battles they must fight.",
  "tags": [
    "decline and fall",
    "history"
  ],
  "categories": [],
  "sitemap_lastmod": "2014-09-23T12:00:00+00:00"
}