{
  "url": "https://voxday.net/2014/09/24/the-agenda-driven-sports-media/",
  "scraped_at": "2025-12-16T12:28:50.139513",
  "title": "The agenda-driven sports media",
  "date_display": "September 24, 2014",
  "date_iso": "2014-09-24T07:00:00+00:00",
  "date_from_url": "2014-09-24",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>It’s a bit amusing to see Mike Florio backtracking after repeatedly demanding that the Ravens provide evidence of their claims that the ESPN report was full of errors:</p><blockquote class=\"tr_bq\"><p> One of the more glaring problems with ESPN’s story regarding the Ravens’ mishandling of the Ray Rice investigation relates to the text messages sent by owner Steve Bisciotti to Rice after the team cut him. In the story, ESPN presents the text messages in italics.  While quotes weren’t used, the technique created the clear impression that the text messages were being quoted verbatim. The surrounding context reinforced the idea that exact quotes were being shared…. ESPN has acknowledged that the italicized text messages did not reflect actual quotes.</p><p>“We understand the confusion surrounding our use of italics and recognize we could have been more clear,” ESPN said Tuesday in a statement. “Most importantly, the information in our story about the contents of the texts was consistent with what the team released.”</p><p>While the contents were consistent, the clear and obvious error in the presentation invites fair questions regarding whether other aspects of the story are incorrect, especially in light of the strong (albeit belated) written response the Ravens provided to 15 different aspects of the report.</p><p>This specific flaw also carries with it some irony.  At a time when the Ravens fairly have been hammered for failing to ask for the notorious elevator video, ESPN didn’t ask the Ravens to confirm the precise contents of the text messages sent by Bisciotti. Instead, ESPN asked only if Bisciotti sent two text messages to Rice.</p><p>The story from ESPN doesn’t disclose that ESPN asked the Ravens only to confirm that Bisciotti sent two text messages and not to confirm the contents of the text messages.  But the words selected by the authors invite a perception that the Ravens were informed of the alleged language of the text messages: “Asked about the text messages Friday, the team did not deny Bisciotti had sent them: ‘His text messages to Ray reflect his belief that everyone is capable of redemption and that others, including players, can learn from Ray’s experience.’”</p></blockquote><p>So, ESPN is making up quotes, misrepresented their communications with the Ravens, and claimed that Ray Rice was watching the Ravens-Bengals game from his home<br> with former teammate AQ Shipley even though Shipley was on the<br> field for the Colts at that time, but Florio still thinks that we should take their report seriously? After all, the Ravens response was, in Florio’s opinion, “belated”.</br></br></p><p>At this point, it’s difficult to rely upon the sports media to get the final score of the games right. Assuming they bother to report it in the first place, given all the socially vital crusades for which they have to find space.</p><p>That being said, good on Bill Simmons for being willing to step up and <a href=\"http://ftw.usatoday.com/2014/09/espn-bill-simmons-profane-rant-roger-goodell\">say exactly what he thinks</a> about Roger Goodell. He may be on the opposite side of the fence, but at least he is genuinely calling them as he sees them:</p><blockquote class=\"tr_bq\"><p> “Goodell, if he didn’t know what was on that tape, he’s a liar. I’m just<br> saying it. He is lying. If you put him up on a lie detector test, that<br> guy would fail. For all these people to pretend they didn’t know is such<br> [expletive] [expletive]. It really is, it’s such [expletive]<br> [expletive]. For him to go into that press conference and pretend<br> otherwise — I was so insulted.”</br></br></br></br></br></p></blockquote><p>I think Goodell was lying too. I don’t think the tape justified one additional day of suspension for Ray Rice, but I don’t think there is any doubt that the NFL Commissioner didn’t know what was on it.</p></div>",
  "content_text": "It’s a bit amusing to see Mike Florio backtracking after repeatedly demanding that the Ravens provide evidence of their claims that the ESPN report was full of errors:\nOne of the more glaring problems with ESPN’s story regarding the Ravens’ mishandling of the Ray Rice investigation relates to the text messages sent by owner Steve Bisciotti to Rice after the team cut him. In the story, ESPN presents the text messages in italics.  While quotes weren’t used, the technique created the clear impression that the text messages were being quoted verbatim. The surrounding context reinforced the idea that exact quotes were being shared…. ESPN has acknowledged that the italicized text messages did not reflect actual quotes.\n“We understand the confusion surrounding our use of italics and recognize we could have been more clear,” ESPN said Tuesday in a statement. “Most importantly, the information in our story about the contents of the texts was consistent with what the team released.”\nWhile the contents were consistent, the clear and obvious error in the presentation invites fair questions regarding whether other aspects of the story are incorrect, especially in light of the strong (albeit belated) written response the Ravens provided to 15 different aspects of the report.\nThis specific flaw also carries with it some irony.  At a time when the Ravens fairly have been hammered for failing to ask for the notorious elevator video, ESPN didn’t ask the Ravens to confirm the precise contents of the text messages sent by Bisciotti. Instead, ESPN asked only if Bisciotti sent two text messages to Rice.\nThe story from ESPN doesn’t disclose that ESPN asked the Ravens only to confirm that Bisciotti sent two text messages and not to confirm the contents of the text messages.  But the words selected by the authors invite a perception that the Ravens were informed of the alleged language of the text messages: “Asked about the text messages Friday, the team did not deny Bisciotti had sent them: ‘His text messages to Ray reflect his belief that everyone is capable of redemption and that others, including players, can learn from Ray’s experience.’”\nSo, ESPN is making up quotes, misrepresented their communications with the Ravens, and claimed that Ray Rice was watching the Ravens-Bengals game from his home\nwith former teammate AQ Shipley even though Shipley was on the\nfield for the Colts at that time, but Florio still thinks that we should take their report seriously? After all, the Ravens response was, in Florio’s opinion, “belated”.\nAt this point, it’s difficult to rely upon the sports media to get the final score of the games right. Assuming they bother to report it in the first place, given all the socially vital crusades for which they have to find space.\nThat being said, good on Bill Simmons for being willing to step up and\nsay exactly what he thinks\nabout Roger Goodell. He may be on the opposite side of the fence, but at least he is genuinely calling them as he sees them:\n“Goodell, if he didn’t know what was on that tape, he’s a liar. I’m just\nsaying it. He is lying. If you put him up on a lie detector test, that\nguy would fail. For all these people to pretend they didn’t know is such\n[expletive] [expletive]. It really is, it’s such [expletive]\n[expletive]. For him to go into that press conference and pretend\notherwise — I was so insulted.”\nI think Goodell was lying too. I don’t think the tape justified one additional day of suspension for Ray Rice, but I don’t think there is any doubt that the NFL Commissioner didn’t know what was on it.",
  "tags": [
    "media",
    "sports"
  ],
  "categories": [],
  "sitemap_lastmod": "2014-09-24T06:00:00+00:00"
}