{
  "url": "https://voxday.net/2014/09/25/the-greatest-medical-scandal-of-all-time/",
  "scraped_at": "2025-12-16T12:28:59.351258",
  "title": "“The Greatest Medical Scandal of All Time”",
  "date_display": "September 25, 2014",
  "date_iso": "2014-09-25T13:00:00+00:00",
  "date_from_url": "2014-09-25",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>Dr. Bernard Dalbergue, a former pharmaceutical industry physician with Gardasil manufacturer Merck, declares that Gardasil has <a href=\"http://healthimpactnews.com/2014/mercks-former-doctor-predicts-that-gardasil-will-become-the-greatest-medical-scandal-of-all-time/\">“has absolutely no effect on cervical cancer”</a>:</p><blockquote class=\"tr_bq\"><p> The full extent of the Gardasil scandal needs to be assessed: everyone knew when this vaccine was released on the American market that it would prove to be worthless!  Diane Harper, a major opinion leader in the United States, was one of the first to blow the whistle, pointing out the fraud and scam of it all.</p><p>Gardasil is useless and costs a fortune!  In addition, decision-makers at all levels are aware of it!</p><p>Cases of Guillain-Barré syndrome, paralysis of the lower limbs, vaccine-induced MS and vaccine-induced encephalitis can be found, whatever the vaccine.</p><p>I predict that Gardasil will become the greatest medical scandal of all times because at some point in time, the evidence will add up to prove that this vaccine, technical and scientific feat that it may be, has absolutely no effect on cervical cancer and that all the very many adverse effects which destroy lives and even kill, serve no other purpose than to generate profit for the manufacturers.</p></blockquote><p>Gardasil appears to be literally worse than useless, because it has demonstrably harmed many girls and young women without any reduction of cervical cancer rates. Gardasil was introduced in 2006. As of 8 September 2013 there have been<br> more than 57 million doses distributed in the United States. The result with the latest available data <a href=\"http://www.cdc.gov/cancer/cervical/statistics/\">from the CDC</a>:</br></p><p><b>2003:</b> 11,745 women in the United States were diagnosed with cervical cancer<br> <b>2011: </b>12,109 women in the United States were diagnosed with cervical cancer</br></p><p>Needless to say, the pro-vaxxers are already attempting to destroy <a href=\"http://www.skepticalraptor.com/skepticalraptorblog.php/antivaccine-lunatics-invent-hero/\">Dr. Dalbergue’s reputation</a>.</p></div>",
  "content_text": "Dr. Bernard Dalbergue, a former pharmaceutical industry physician with Gardasil manufacturer Merck, declares that Gardasil has\n“has absolutely no effect on cervical cancer”\n:\nThe full extent of the Gardasil scandal needs to be assessed: everyone knew when this vaccine was released on the American market that it would prove to be worthless!  Diane Harper, a major opinion leader in the United States, was one of the first to blow the whistle, pointing out the fraud and scam of it all.\nGardasil is useless and costs a fortune!  In addition, decision-makers at all levels are aware of it!\nCases of Guillain-Barré syndrome, paralysis of the lower limbs, vaccine-induced MS and vaccine-induced encephalitis can be found, whatever the vaccine.\nI predict that Gardasil will become the greatest medical scandal of all times because at some point in time, the evidence will add up to prove that this vaccine, technical and scientific feat that it may be, has absolutely no effect on cervical cancer and that all the very many adverse effects which destroy lives and even kill, serve no other purpose than to generate profit for the manufacturers.\nGardasil appears to be literally worse than useless, because it has demonstrably harmed many girls and young women without any reduction of cervical cancer rates. Gardasil was introduced in 2006. As of 8 September 2013 there have been\nmore than 57 million doses distributed in the United States. The result with the latest available data\nfrom the CDC\n:\n2003:\n11,745 women in the United States were diagnosed with cervical cancer\n2011:\n12,109 women in the United States were diagnosed with cervical cancer\nNeedless to say, the pro-vaxxers are already attempting to destroy\nDr. Dalbergue’s reputation\n.",
  "tags": [
    "vaccines"
  ],
  "categories": [],
  "sitemap_lastmod": "2014-09-25T12:00:00+00:00"
}