{
  "url": "https://voxday.net/2014/09/20/the-anti-nfl-sjws-seek-more-scalps/",
  "scraped_at": "2025-12-16T12:28:25.160188",
  "title": "The anti-NFL SJWs seek more scalps",
  "date_display": "September 20, 2014",
  "date_iso": "2014-09-20T13:00:00+00:00",
  "date_from_url": "2014-09-20",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>Now Floria wants to see Baltimore’s president, general manager, coach, and possibly owner <a href=\"http://profootballtalk.nbcsports.com/2014/09/19/espn-reports-makes-it-clear-cass-knew-contents-of-video/\">to be hounded from the league</a> as well:</p><blockquote class=\"tr_bq\"><p> The Ravens contend that the ESPN report contains “numerous errors,<br> inaccuracies, false assumptions and, perhaps, misunderstandings,” but<br> the Ravens have identified none of them yet.  Apparently, the list<br> alleged errors, inaccuracies, false assumptions, and perhaps<br> misunderstanding is coming next week, after their game against the<br> Browns.</br></br></br></br></br></p><p>Sorry, but that’s not nearly good enough.  One of the league’s<br> billion-dollar network partners has pinned on the Ravens and the NFL a<br> report that, if accurate, should result in the termination of the<br> employment of Cass, Newsome, and perhaps even Harbaugh.  Likewise, real<br> questions should be raised about Steve Bisciotti’s fitness to own the<br> team, if the report is accurate and if he had any knowledge of the<br> coverup.  (Or perhaps even if he didn’t.)</br></br></br></br></br></br></p></blockquote><p>This is getting BEYOND ridiculous. The idea that an organization might *gasp* attempt to protect its own interests rather than embark upon an anti-domestic violence crusade aimed at one of its employees is not even newsworthy, let alone a rational basis for decimating its employees. There is no “coverup”.</p><p>As I have said from the start, the NFL should announce that domestic violence is, like every other crime, neither its responsibility nor its concern, and declare that it is leaving all such matters up to the relevant criminal justice system. For the obvious reason that it isn’t.</p><p>And Roger Goodell needs to be fired. Not because he is insufficiently concerned about the poor widdle womens who ain’t never done nothing but get beat on, but because he opened this whole can of worms with his own posturing attempts to curry favor with the Social Justice Whores.</p></div>",
  "content_text": "Now Floria wants to see Baltimore’s president, general manager, coach, and possibly owner\nto be hounded from the league\nas well:\nThe Ravens contend that the ESPN report contains “numerous errors,\ninaccuracies, false assumptions and, perhaps, misunderstandings,” but\nthe Ravens have identified none of them yet.  Apparently, the list\nalleged errors, inaccuracies, false assumptions, and perhaps\nmisunderstanding is coming next week, after their game against the\nBrowns.\nSorry, but that’s not nearly good enough.  One of the league’s\nbillion-dollar network partners has pinned on the Ravens and the NFL a\nreport that, if accurate, should result in the termination of the\nemployment of Cass, Newsome, and perhaps even Harbaugh.  Likewise, real\nquestions should be raised about Steve Bisciotti’s fitness to own the\nteam, if the report is accurate and if he had any knowledge of the\ncoverup.  (Or perhaps even if he didn’t.)\nThis is getting BEYOND ridiculous. The idea that an organization might *gasp* attempt to protect its own interests rather than embark upon an anti-domestic violence crusade aimed at one of its employees is not even newsworthy, let alone a rational basis for decimating its employees. There is no “coverup”.\nAs I have said from the start, the NFL should announce that domestic violence is, like every other crime, neither its responsibility nor its concern, and declare that it is leaving all such matters up to the relevant criminal justice system. For the obvious reason that it isn’t.\nAnd Roger Goodell needs to be fired. Not because he is insufficiently concerned about the poor widdle womens who ain’t never done nothing but get beat on, but because he opened this whole can of worms with his own posturing attempts to curry favor with the Social Justice Whores.",
  "tags": [
    "sports",
    "trainwreck"
  ],
  "categories": [],
  "sitemap_lastmod": "2014-09-20T12:00:00+00:00"
}