{
  "url": "https://voxday.net/2014/09/14/the-problem-with-ste/",
  "scraped_at": "2025-12-16T12:27:43.597143",
  "title": "The problem with STEM",
  "date_display": "September 14, 2014",
  "date_iso": "2014-09-14T13:47:00+00:00",
  "date_from_url": "2014-09-14",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>What people fail to realize is that <a href=\"http://www.nbcnews.com/feature/maria-shriver/why-tech-sector-struggles-close-gender-gap-n193711\">the problem in the tech industry</a> isn’t that there aren’t enough women getting STEM degrees, the problem is that too many are doing so:</p><blockquote class=\"tr_bq\"><p> <i>Research shows women share negative experiences far more widely than men. Does that have an impact on diversity? Do women start avoiding certain companies because they are well informed about the cul</i>ture?</p><p>Barbara: Absolutely. There were two technology companies which had this enormous turnover, and we actually tracked where the women went. And again, these companies had this huge focus on recruiting women but the culture wasn’t inclusive or gender intelligent, and so the women would end up leaving.</p><p>We have these amazing women with STEM degrees, and they’re shelving that education and going off to do something else.</p><p>When we tracked down where they went, what we found is that they went to smaller or mid-sized companies, or some of them just left the sector. They would say, “I do not even want to be in technology anymore.” So here we have these amazing women with STEM degrees, and they’re shelving that education and going off to do something else.</p><p><i>What’s one of the most common frustrations you hear from women in the tech sector?</i></p><p>Barbara: One female engineer described it as a drip-drip-drip: it’s not just one thing that happens once. She calls it being “cleverly dismissed.” So, she’ll bring up a concern or something, and it gets cleverly dismissed. If you have these drip-drip experiences of feeling excluded and dismissed over years and years, this is where women don’t feel valued for their intellect, for their ideas, or for the different way of thinking they bring, which is so useful and so important.</p></blockquote><p>That’s one aspect of the problem right there. The “different way of thinking they bring” is neither useful nor important. It’s irrelevant. All those clever dismissals are just the tech gammas being nice to their coworkers, because in most cases the correct response to the concerns being raised would be: “what on Earth does that have to do with our actual objectives and responsibilities?”</p><p>The main reason there are not more women actually doing technology-related work in the technology sector despite their expensive STEM degrees is a very simple one: <i>all those amazing women don’t like the nature of the actual work itself.</i> They’re not good at it, they don’t like it, and so they tend to gravitate towards tangentially related sectors, like marketing technology or selling it.</p><p>Which is fine, but it’s hardly an efficient use of resources or an indicator that forcing even less-interested women into the field is a good idea.</p></div>",
  "content_text": "What people fail to realize is that\nthe problem in the tech industry\nisn’t that there aren’t enough women getting STEM degrees, the problem is that too many are doing so:\nResearch shows women share negative experiences far more widely than men. Does that have an impact on diversity? Do women start avoiding certain companies because they are well informed about the cul\nture?\nBarbara: Absolutely. There were two technology companies which had this enormous turnover, and we actually tracked where the women went. And again, these companies had this huge focus on recruiting women but the culture wasn’t inclusive or gender intelligent, and so the women would end up leaving.\nWe have these amazing women with STEM degrees, and they’re shelving that education and going off to do something else.\nWhen we tracked down where they went, what we found is that they went to smaller or mid-sized companies, or some of them just left the sector. They would say, “I do not even want to be in technology anymore.” So here we have these amazing women with STEM degrees, and they’re shelving that education and going off to do something else.\nWhat’s one of the most common frustrations you hear from women in the tech sector?\nBarbara: One female engineer described it as a drip-drip-drip: it’s not just one thing that happens once. She calls it being “cleverly dismissed.” So, she’ll bring up a concern or something, and it gets cleverly dismissed. If you have these drip-drip experiences of feeling excluded and dismissed over years and years, this is where women don’t feel valued for their intellect, for their ideas, or for the different way of thinking they bring, which is so useful and so important.\nThat’s one aspect of the problem right there. The “different way of thinking they bring” is neither useful nor important. It’s irrelevant. All those clever dismissals are just the tech gammas being nice to their coworkers, because in most cases the correct response to the concerns being raised would be: “what on Earth does that have to do with our actual objectives and responsibilities?”\nThe main reason there are not more women actually doing technology-related work in the technology sector despite their expensive STEM degrees is a very simple one:\nall those amazing women don’t like the nature of the actual work itself.\nThey’re not good at it, they don’t like it, and so they tend to gravitate towards tangentially related sectors, like marketing technology or selling it.\nWhich is fine, but it’s hardly an efficient use of resources or an indicator that forcing even less-interested women into the field is a good idea.",
  "tags": [
    "technology"
  ],
  "categories": [],
  "sitemap_lastmod": "2014-09-14T12:47:00+00:00"
}