{
  "url": "https://voxday.net/2014/09/12/the-great-war-100-years-later/",
  "scraped_at": "2025-12-16T12:27:32.837941",
  "title": "The Great War 100 years later",
  "date_display": "September 12, 2014",
  "date_iso": "2014-09-12T13:00:00+00:00",
  "date_from_url": "2014-09-12",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>esr <a href=\"http://esr.ibiblio.org/?p=6235&amp;cpage=1#comment-1095907\">reviews <i>Collision of Empires</i></a>, a history of WWI:</p><blockquote class=\"tr_bq\"><p> Collision of Empires (Prit Buttar; Osprey Publishing) is a clear and accessible history that attempts to address a common lack in accounts of the Great War that began a century ago this year: they tend to be centered on the Western Front and the staggering meat-grinder that static trench warfare became as outmoded tactics collided with the reality of machine guns and indirect-fire artillery.</p><p>Concentration on the Western Front is understandable in the U.S. and England; the successor states of the Western Front’s victors have maintained good records, and nationals of the English-speaking countries were directly involved there. But in many ways the Eastern Front story is more interesting, especially in the first year that Buttar chooses to cover – less static, and with a sometimes bewilderingly varied cast. And, arguably, larger consequences. The war in the east eventually destroyed three empires and put Lenin’s Communists in power in Russia.</p><p>Prit Buttar does a really admirable job of illuminating the thinking of the German, Austrian, and Russian leadership in the run-up to the war – not just at the diplomatic level but in the ways that their militaries were struggling to come to grips with the implications of new technology. The extensive discussion of internecine disputes over military doctrine in the three officer corps involved is better than anything similar I’ve seen elsewhere.</p></blockquote><p>There is more at his site. However, as a corrective to this obviously<br> deficient history of the Great War, allow me to recommend the book I just<br> finished reading, namely, <i>CATASTROPHE 1914</i> by Max Hastings, which can be<br> summarized as follows.</br></br></br></p><div class=\"comment-content\"><ol><li>The Great War was the inevitable consequence of dastardly German militarism. Since the<br> Kaiser didn’t forcibly stop Austria from invading Serbia, the Germans<br> are entirely to blame for making British lads volunteer to travel to the continent<br> and die in the mud.</br></br></br></li><li>Moltke was a psychological train wreck wholly unsuitable for command.</li><li>French was a psychological train wreck wholly unsuitable for command.</li><li>Churchill was an excitable loon wholly unsuitable for command of any unit larger than a company.</li><li>If it were not for the brave and heroic British Expeditionary Force<br> defending freedom, justice, and democracy, the Germans would have broken<br> through the French lines and conquered the continent.</br></br></li><li>The French did a little fighting too. So did the Russians. The Serbs<br> killed lots of Austrians. None of this had any serious effect on the<br> war, which was won by British courage and pluck.</br></br></li><li>The death of millions was worth it in the end, because Germany is bad and if the Central Powers had won, Europe would not have the European Union today.</li></ol></div></div>",
  "content_text": "esr\nreviews\nCollision of Empires\n, a history of WWI:\nCollision of Empires (Prit Buttar; Osprey Publishing) is a clear and accessible history that attempts to address a common lack in accounts of the Great War that began a century ago this year: they tend to be centered on the Western Front and the staggering meat-grinder that static trench warfare became as outmoded tactics collided with the reality of machine guns and indirect-fire artillery.\nConcentration on the Western Front is understandable in the U.S. and England; the successor states of the Western Front’s victors have maintained good records, and nationals of the English-speaking countries were directly involved there. But in many ways the Eastern Front story is more interesting, especially in the first year that Buttar chooses to cover – less static, and with a sometimes bewilderingly varied cast. And, arguably, larger consequences. The war in the east eventually destroyed three empires and put Lenin’s Communists in power in Russia.\nPrit Buttar does a really admirable job of illuminating the thinking of the German, Austrian, and Russian leadership in the run-up to the war – not just at the diplomatic level but in the ways that their militaries were struggling to come to grips with the implications of new technology. The extensive discussion of internecine disputes over military doctrine in the three officer corps involved is better than anything similar I’ve seen elsewhere.\nThere is more at his site. However, as a corrective to this obviously\ndeficient history of the Great War, allow me to recommend the book I just\nfinished reading, namely,\nCATASTROPHE 1914\nby Max Hastings, which can be\nsummarized as follows.\nThe Great War was the inevitable consequence of dastardly German militarism. Since the\nKaiser didn’t forcibly stop Austria from invading Serbia, the Germans\nare entirely to blame for making British lads volunteer to travel to the continent\nand die in the mud.\nMoltke was a psychological train wreck wholly unsuitable for command.\nFrench was a psychological train wreck wholly unsuitable for command.\nChurchill was an excitable loon wholly unsuitable for command of any unit larger than a company.\nIf it were not for the brave and heroic British Expeditionary Force\ndefending freedom, justice, and democracy, the Germans would have broken\nthrough the French lines and conquered the continent.\nThe French did a little fighting too. So did the Russians. The Serbs\nkilled lots of Austrians. None of this had any serious effect on the\nwar, which was won by British courage and pluck.\nThe death of millions was worth it in the end, because Germany is bad and if the Central Powers had won, Europe would not have the European Union today.",
  "tags": [
    "history",
    "war"
  ],
  "categories": [],
  "sitemap_lastmod": "2014-09-12T12:00:00+00:00"
}