{
  "url": "https://voxday.net/2014/09/28/the-cults-of-faux-science/",
  "scraped_at": "2025-12-16T12:29:17.316405",
  "title": "The cults of faux science",
  "date_display": "September 28, 2014",
  "date_iso": "2014-09-28T09:05:00+00:00",
  "date_from_url": "2014-09-28",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>Jenkins, Thiele, and Douthat need not worry. There is no <a href=\"http://www.unz.com/isteve/douthat-the-cult-deficit/\">deficit of cults</a> these days, they simply tend to sell themselves in the “science” market rather than the “religion” market. As Steve Sailer observes correctly, this is hardly new:</p><blockquote class=\"tr_bq\"><p> Today, for example, it seems obvious that Freudianism was a cult, but it was treated with immense respect in post-WWII America. Vladimir Nabokov had the aristocratic self-assurance to scoff publicly and repeatedly at Freud, but how many other men of reputation dared?</p><p>For example, few called Stephen Jay Gould a cult leader, but the man who told his followers — “Say it five times before breakfast tomorrow; more important, understand it as the center of a network of implication: ‘Human equality is a contingent fact of history’” — can perhaps be understood as the type of soothsayer who tries to hijack the prestige of science for his own anti-scientific purposes in the tradition of Sigmund Freud, Karl Marx, Ayn Rand, and L. Ron Hubbard.</p></blockquote><p>Indeed, how can one possibly look at either the global climate change cult or the “marriage equality” cult or the magic geography cult or the politically correct pinkshirts and conclude that people are any less disinclined to believe in bizarre and obvious nonsense than 100 or 200 years ago? To say nothing of Keynesianism, which is quite literally nothing more than Freudian concepts applied to economics.</p><p>It’s a little surprising that no one ever notices the link between Freud and Keynes, but this is most likely because it seems almost no one besides me ever seems to bother actually going back to read the original source, The General Theory of The General Theory of Employment, Interest and Money rather than a) an Austrian critique or b) a Neo-Keynesian extrapolation.</p><p>Even those few who get it, such as the author of “<a href=\"http://www.mps.it/NR/rdonlyres/34A46B32-29C9-4F7E-9DF3-FF2E1873DD4F/55499/Winslow.pdf\">Keynes on the Relation of the Capitalist “Vulgar Passions” to Financial Crises</a>” (PDF), don’t seem to trace the Freud-Keynes link back to its source. Consider:</p><p><i>“It is shown that, generally speaking, the actual level of output and employment depends, not on the capacity to produce or on the pre-existing level of incomes,<br>but on the current decisions to produce which depend in turn on current decisions to invest and on present expectations of current and prospective consumption. Moreover, as soon as we know the propensity to consume and to save (as I call it), that is to say the result for the community as a whole of the individual psychological inclinations as to how to dispose of given incomes, we can calculate what level of incomes, and therefore what level of output and employment, is in profit-equilibrium with a given level of new investment; out of which develops the doctrine of the Multiplier….</br></i></p><p>The fundamental psychological law, upon which we are entitled to depend with great confidence both a priori from our knowledge of human nature and from the detailed facts of experience, is that men are disposed, as a rule and on the average, to increase their consumption as their income increases, but not by as much as the increase in their income.” </p><p>Keynesianism is nothing more than applied Freudianism. And considering the spread of its current influence, combined with the tens of millions of adherents to other, equally ridiculous false sciences, it should be clear that there is no deficit of cults these days, they just don’t have the common decency to give themselves ridiculous appellations and keep a safe distance away from sane people anymore.</p></div>",
  "content_text": "Jenkins, Thiele, and Douthat need not worry. There is no\ndeficit of cults\nthese days, they simply tend to sell themselves in the “science” market rather than the “religion” market. As Steve Sailer observes correctly, this is hardly new:\nToday, for example, it seems obvious that Freudianism was a cult, but it was treated with immense respect in post-WWII America. Vladimir Nabokov had the aristocratic self-assurance to scoff publicly and repeatedly at Freud, but how many other men of reputation dared?\nFor example, few called Stephen Jay Gould a cult leader, but the man who told his followers — “Say it five times before breakfast tomorrow; more important, understand it as the center of a network of implication: ‘Human equality is a contingent fact of history’” — can perhaps be understood as the type of soothsayer who tries to hijack the prestige of science for his own anti-scientific purposes in the tradition of Sigmund Freud, Karl Marx, Ayn Rand, and L. Ron Hubbard.\nIndeed, how can one possibly look at either the global climate change cult or the “marriage equality” cult or the magic geography cult or the politically correct pinkshirts and conclude that people are any less disinclined to believe in bizarre and obvious nonsense than 100 or 200 years ago? To say nothing of Keynesianism, which is quite literally nothing more than Freudian concepts applied to economics.\nIt’s a little surprising that no one ever notices the link between Freud and Keynes, but this is most likely because it seems almost no one besides me ever seems to bother actually going back to read the original source, The General Theory of The General Theory of Employment, Interest and Money rather than a) an Austrian critique or b) a Neo-Keynesian extrapolation.\nEven those few who get it, such as the author of “\nKeynes on the Relation of the Capitalist “Vulgar Passions” to Financial Crises\n” (PDF), don’t seem to trace the Freud-Keynes link back to its source. Consider:\n“It is shown that, generally speaking, the actual level of output and employment depends, not on the capacity to produce or on the pre-existing level of incomes,\nbut on the current decisions to produce which depend in turn on current decisions to invest and on present expectations of current and prospective consumption. Moreover, as soon as we know the propensity to consume and to save (as I call it), that is to say the result for the community as a whole of the individual psychological inclinations as to how to dispose of given incomes, we can calculate what level of incomes, and therefore what level of output and employment, is in profit-equilibrium with a given level of new investment; out of which develops the doctrine of the Multiplier….\nThe fundamental psychological law, upon which we are entitled to depend with great confidence both a priori from our knowledge of human nature and from the detailed facts of experience, is that men are disposed, as a rule and on the average, to increase their consumption as their income increases, but not by as much as the increase in their income.”\nKeynesianism is nothing more than applied Freudianism. And considering the spread of its current influence, combined with the tens of millions of adherents to other, equally ridiculous false sciences, it should be clear that there is no deficit of cults these days, they just don’t have the common decency to give themselves ridiculous appellations and keep a safe distance away from sane people anymore.",
  "tags": [
    "economics",
    "science"
  ],
  "categories": [],
  "sitemap_lastmod": "2014-09-28T08:05:00+00:00"
}