{
  "url": "https://voxday.net/2014/09/19/the-ebola-exponen/",
  "scraped_at": "2025-12-16T12:28:20.023212",
  "title": "The Ebola exponent",
  "date_display": "September 19, 2014",
  "date_iso": "2014-09-19T11:02:00+00:00",
  "date_from_url": "2014-09-19",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>This, combined with socionomics will explain why we’ve been seeing <a href=\"http://www.npr.org/blogs/goatsandsoda/2014/09/18/349341606/why-the-math-of-the-ebola-epidemic-is-so-scary\">all the pandemic-related television </a>shows of late:</p><blockquote class=\"tr_bq\"><p> Right now we’ve had more than 5,000 cases of Ebola, and at least 2,600 people have died. Some scientists, like Alessandro Vespignani at Northeastern University in Boston, are taking numbers like that and putting them into computer models to see where this epidemic is going. “For instance, in our modeling, by mid-October, we’re already between 10,000 to 25,000 cases,” he says.</p><p>Five thousand cases of Ebola is bad; 10,000 to 25,000 is unbelievable. And that’s where the exponential curve comes into play. “Well,<br> an exponential curve is a curve that doubles every certain amount of<br> time,” Vespignani says. And with this outbreak, cases are doubling every<br> three to four weeks. So if help doesn’t arrive in time — and<br> the growth rate stays the same — then 15,000 Ebola cases in mid-October<br> could turn into 30,000 cases by mid-November, and 60,000 cases by<br> mid-December.</br></br></br></br></br></br></p></blockquote><p>Meanwhile, aid efforts are hampered, to put it mildly, <a href=\"http://www.washingtonpost.com/news/to-your-health/wp/2014/09/18/missing-health-workers-in-guinea-were-educating-villagers-about-ebola-when-they-were-attacked/\">by the local fauna</a>:</p><blockquote class=\"tr_bq\"><p> The bodies of eight people, including several health workers and three journalists, have been found days after they were attacked while distributing information about Ebola in a Guinean village near the city of Nzerekore, according to Reuters.</p><p>“The eight bodies were found in the village latrine,” Albert Damantang Camara, a spokesman for Guinea’s government, told Reuters on Thursday. “Three of them had their throats slit.”</p></blockquote><p>Quarantine and closing the borders, as Sierra Leone is doing, would suffice to keep Ebola out of the West. So, naturally, the globalists in office prefer to literally import the disease and expose thousands of soldiers and aid workers to it in Africa, thereby risking a global pandemic, rather than simply leave the independent African nations to their own resources and permitting the epidemic to safely run its course.</p><p>And if the World Health reports that the statistics are being underreported are correct, the exponential curve may already be in effect.</p></div>",
  "content_text": "This, combined with socionomics will explain why we’ve been seeing\nall the pandemic-related television\nshows of late:\nRight now we’ve had more than 5,000 cases of Ebola, and at least 2,600 people have died. Some scientists, like Alessandro Vespignani at Northeastern University in Boston, are taking numbers like that and putting them into computer models to see where this epidemic is going. “For instance, in our modeling, by mid-October, we’re already between 10,000 to 25,000 cases,” he says.\nFive thousand cases of Ebola is bad; 10,000 to 25,000 is unbelievable. And that’s where the exponential curve comes into play. “Well,\nan exponential curve is a curve that doubles every certain amount of\ntime,” Vespignani says. And with this outbreak, cases are doubling every\nthree to four weeks. So if help doesn’t arrive in time — and\nthe growth rate stays the same — then 15,000 Ebola cases in mid-October\ncould turn into 30,000 cases by mid-November, and 60,000 cases by\nmid-December.\nMeanwhile, aid efforts are hampered, to put it mildly,\nby the local fauna\n:\nThe bodies of eight people, including several health workers and three journalists, have been found days after they were attacked while distributing information about Ebola in a Guinean village near the city of Nzerekore, according to Reuters.\n“The eight bodies were found in the village latrine,” Albert Damantang Camara, a spokesman for Guinea’s government, told Reuters on Thursday. “Three of them had their throats slit.”\nQuarantine and closing the borders, as Sierra Leone is doing, would suffice to keep Ebola out of the West. So, naturally, the globalists in office prefer to literally import the disease and expose thousands of soldiers and aid workers to it in Africa, thereby risking a global pandemic, rather than simply leave the independent African nations to their own resources and permitting the epidemic to safely run its course.\nAnd if the World Health reports that the statistics are being underreported are correct, the exponential curve may already be in effect.",
  "tags": [
    "science",
    "trainwreck"
  ],
  "categories": [],
  "sitemap_lastmod": "2014-09-19T10:02:00+00:00"
}