{
  "url": "https://voxday.net/2014/09/21/the-vagaries-of-calcio/",
  "scraped_at": "2025-12-16T12:28:28.799528",
  "title": "The vagaries of calcio",
  "date_display": "September 21, 2014",
  "date_iso": "2014-09-21T11:56:00+00:00",
  "date_from_url": "2014-09-21",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>I’ve seldom been as angry as I was a weekend ago. For the last month, Ender has worked very hard to earn his place as the youngest member of a pretty good team, literally fighting for respect from some of this teammates and doing more than his part to shore up the defense when some injuries and suspensions removed all four of the defensive starters.</p><p>However, he is also the backup goalie, which is the position he plays most often in practice. He’s as tall as the starting goalie, but being three years younger, is about 20 pounds lighter. Two weeks ago, the quasi-coach told him that he was going to play, then neglected to put him in even though the team went up three goals and was in complete control of the game. Then last weekend, we showed up to the game to discover that a) a new coach, b) the starting goalie had injured his foot at school, and c) a goalie who belonged to a different club.</p><p>It was bad enough that instead of starting the backup, they’d gone outside the club to bring in a new goalie. But that was justifiable, since Ender had a poor practice earlier that week. What was worse was that the borrowed goalie was <i>terrible</i>. He only gave up three goals, but that was entirely misleading because the other team simply could not put anything on net. They must have beaten him 12-15 times, but kept shooting the ball wide or over the goal. It became a bit farcical at one point when the kid was out of position, got beaten by a lob, and instead of turning around and catching it on the bounce, tried to do a bicycle kick that missed. He was bailed out by the fact that the ball happened to bounce on the hard ground of the penalty spot rather than the grass, and bounced just over the crossbar.</p><p>Nevertheless, Ender still didn’t go in, even when his team was again up by three goals. He was angry and I was downright furious. Why am I spending an entire afternoon every weekend to watch my son not play? After the game, Ender told the coach that if he wasn’t going to play even when the starter goes down and the team has a three-goal lead, he’d much rather suit up as a defensive substitute. I suspect this may have alarmed the new coach since he was suddenly faced with the prospect of having one suboptimal goalie on loan and no backups.</p><p>I didn’t question the coach’s right to decide whatever he wanted. Making bad decisions is a coach’s prerogative. What I thought was egregiously stupid from the club’s perspective was the apparent reluctance to work with what they’ve got. Ender is young enough that he could be their starting goalie for the next three years and he is their most promising candidate for the spot since the current starter will be too old next year. And he may be slight, but he’s almost certainly going to be a more imposing physical specimen than the current starter in the near future. So instead of working to develop him, you discourage him to the point of having him switch positions? It made zero sense.</p><p>The new coach must have reached a similar conclusion after Ender had two very good practices this week, as he not only started him this weekend, but didn’t even bring back the loaner-goalie as a backup. Ender was visibly scared stiff after taking the field, but the whole team was supportive and the defense did a fantastic job in the first half of keeping the pressure off him.  Except for one little thing in the first ten minutes: they gave up an unnecessary penalty. Just what every young keeper making his debut needs. Ender dove right and missed the ball, but it hit the post and Ender got up just in time to make a nice reaction save on a close-range shot from the rebound.</p><p>That, along with a stuffed one-on-one late in the game were the high points. However, he let one high shot get through his hands when he jumped a little too late, and then I had to warn him when the team went up 4-1 because the defenders began to get goal-hungry and lazy about getting back to defend. To no avail, as it turned out, because the other team’s strikers rapidly put two more past him from close range that probably couldn’t have been helped, then, flustered, he blew a fourth one that he should have had. Still, his team ended up winning 7-4, he made three or four solid saves, and the general verdict was that he’ll make for a decent backup at this point. Not a great debut, but far from a disaster, and the first team coach told me that he thinks Ender has the ability to play at the next level in three years when he’s eligible. Since his own son is on the pro track, I suspect he knows what he’s talking about.</p><p>My own season has been personally satisfying but somewhat frustrating from a team standpoint. We tied our first two games against a very good team and a bad one while I contributed essentially nothing besides a few near misses. Last week, I found myself losing my starting spot, although it might have only been the captain wanting to save me for the second half when the defense is tired and the field is more open. He’s well aware of my age and limitations. We lost to our number two rivals 4-2, although I did get an assist when the right midfielder put the ball past the defense down the line for me. I pulled the two central defenders and the keeper to me as I approached the box, then chipped it over them towards the far post, where Julien, a tall attacker who plays for us as well as the first team, effortlessly headed it in. It was pretty; after the game the opposing team’s goalie came up to say what a nice attack it was. Of course, its easy to be magnanimous when you win. We have a bit of a history, as three of the last five games between our teams have come down to me going one-on-one with him at the final whistle. The edge is his at this point, 2-1.</p><p>This weekend, I not only started, but had to play the whole game, as we had lost two of our four attackers, including Julien, to injury, and our third attacker couldn’t make it. Fortunately, we were playing a lesser team and the midfielder who was moved up to the other attacker’s position was in the mood to pass, which isn’t always the case. I scored the first goal when he went one-on-one with the keeper, then slid it over to me to put in the empty net. Unfortunately, the clueless referee waved it off for offside, which was impossible since I was BEHIND both the ball and the player who passed it to me. I got a second goal, which actually counted, when the same guy put a long cross-field pass past the defense, I ran onto it, and slid it across the face of goal.</p><p>Then I got a third one by jumping a careless backpass from a defender, rounding the keeper as he came out for it, and walking it into the net. I should have had a fourth when Sergio sent a perfect ground cross through the box, but I leaned back too far and hit the crossbar. Stupid, stupid, stupid… I knew the moment I hit it that it was going too high. I had another great opportunity later cutting in from the right, but Giorgio called for it so I drew the goalie and slid it across to him and he was about a step behind where he should have been. He barely managed to get his foot onto it so the ball went wide. That cost us, because two defensive blunders gifted them a pair of easy goals and we ended up with a 3-3 tie. Two goals is great and all, but I legitimately had three and probably should have had five.</p><p>On the one hand, it’s good to know that even at my advanced age I can still help the team, and on a good day, compete favorably with the guys in their late twenties and early thirties. On the other hand, almost everything hurts and I’m walking like a man twice my age today.</p></div>",
  "content_text": "I’ve seldom been as angry as I was a weekend ago. For the last month, Ender has worked very hard to earn his place as the youngest member of a pretty good team, literally fighting for respect from some of this teammates and doing more than his part to shore up the defense when some injuries and suspensions removed all four of the defensive starters.\nHowever, he is also the backup goalie, which is the position he plays most often in practice. He’s as tall as the starting goalie, but being three years younger, is about 20 pounds lighter. Two weeks ago, the quasi-coach told him that he was going to play, then neglected to put him in even though the team went up three goals and was in complete control of the game. Then last weekend, we showed up to the game to discover that a) a new coach, b) the starting goalie had injured his foot at school, and c) a goalie who belonged to a different club.\nIt was bad enough that instead of starting the backup, they’d gone outside the club to bring in a new goalie. But that was justifiable, since Ender had a poor practice earlier that week. What was worse was that the borrowed goalie was\nterrible\n. He only gave up three goals, but that was entirely misleading because the other team simply could not put anything on net. They must have beaten him 12-15 times, but kept shooting the ball wide or over the goal. It became a bit farcical at one point when the kid was out of position, got beaten by a lob, and instead of turning around and catching it on the bounce, tried to do a bicycle kick that missed. He was bailed out by the fact that the ball happened to bounce on the hard ground of the penalty spot rather than the grass, and bounced just over the crossbar.\nNevertheless, Ender still didn’t go in, even when his team was again up by three goals. He was angry and I was downright furious. Why am I spending an entire afternoon every weekend to watch my son not play? After the game, Ender told the coach that if he wasn’t going to play even when the starter goes down and the team has a three-goal lead, he’d much rather suit up as a defensive substitute. I suspect this may have alarmed the new coach since he was suddenly faced with the prospect of having one suboptimal goalie on loan and no backups.\nI didn’t question the coach’s right to decide whatever he wanted. Making bad decisions is a coach’s prerogative. What I thought was egregiously stupid from the club’s perspective was the apparent reluctance to work with what they’ve got. Ender is young enough that he could be their starting goalie for the next three years and he is their most promising candidate for the spot since the current starter will be too old next year. And he may be slight, but he’s almost certainly going to be a more imposing physical specimen than the current starter in the near future. So instead of working to develop him, you discourage him to the point of having him switch positions? It made zero sense.\nThe new coach must have reached a similar conclusion after Ender had two very good practices this week, as he not only started him this weekend, but didn’t even bring back the loaner-goalie as a backup. Ender was visibly scared stiff after taking the field, but the whole team was supportive and the defense did a fantastic job in the first half of keeping the pressure off him.  Except for one little thing in the first ten minutes: they gave up an unnecessary penalty. Just what every young keeper making his debut needs. Ender dove right and missed the ball, but it hit the post and Ender got up just in time to make a nice reaction save on a close-range shot from the rebound.\nThat, along with a stuffed one-on-one late in the game were the high points. However, he let one high shot get through his hands when he jumped a little too late, and then I had to warn him when the team went up 4-1 because the defenders began to get goal-hungry and lazy about getting back to defend. To no avail, as it turned out, because the other team’s strikers rapidly put two more past him from close range that probably couldn’t have been helped, then, flustered, he blew a fourth one that he should have had. Still, his team ended up winning 7-4, he made three or four solid saves, and the general verdict was that he’ll make for a decent backup at this point. Not a great debut, but far from a disaster, and the first team coach told me that he thinks Ender has the ability to play at the next level in three years when he’s eligible. Since his own son is on the pro track, I suspect he knows what he’s talking about.\nMy own season has been personally satisfying but somewhat frustrating from a team standpoint. We tied our first two games against a very good team and a bad one while I contributed essentially nothing besides a few near misses. Last week, I found myself losing my starting spot, although it might have only been the captain wanting to save me for the second half when the defense is tired and the field is more open. He’s well aware of my age and limitations. We lost to our number two rivals 4-2, although I did get an assist when the right midfielder put the ball past the defense down the line for me. I pulled the two central defenders and the keeper to me as I approached the box, then chipped it over them towards the far post, where Julien, a tall attacker who plays for us as well as the first team, effortlessly headed it in. It was pretty; after the game the opposing team’s goalie came up to say what a nice attack it was. Of course, its easy to be magnanimous when you win. We have a bit of a history, as three of the last five games between our teams have come down to me going one-on-one with him at the final whistle. The edge is his at this point, 2-1.\nThis weekend, I not only started, but had to play the whole game, as we had lost two of our four attackers, including Julien, to injury, and our third attacker couldn’t make it. Fortunately, we were playing a lesser team and the midfielder who was moved up to the other attacker’s position was in the mood to pass, which isn’t always the case. I scored the first goal when he went one-on-one with the keeper, then slid it over to me to put in the empty net. Unfortunately, the clueless referee waved it off for offside, which was impossible since I was BEHIND both the ball and the player who passed it to me. I got a second goal, which actually counted, when the same guy put a long cross-field pass past the defense, I ran onto it, and slid it across the face of goal.\nThen I got a third one by jumping a careless backpass from a defender, rounding the keeper as he came out for it, and walking it into the net. I should have had a fourth when Sergio sent a perfect ground cross through the box, but I leaned back too far and hit the crossbar. Stupid, stupid, stupid… I knew the moment I hit it that it was going too high. I had another great opportunity later cutting in from the right, but Giorgio called for it so I drew the goalie and slid it across to him and he was about a step behind where he should have been. He barely managed to get his foot onto it so the ball went wide. That cost us, because two defensive blunders gifted them a pair of easy goals and we ended up with a 3-3 tie. Two goals is great and all, but I legitimately had three and probably should have had five.\nOn the one hand, it’s good to know that even at my advanced age I can still help the team, and on a good day, compete favorably with the guys in their late twenties and early thirties. On the other hand, almost everything hurts and I’m walking like a man twice my age today.",
  "tags": [
    "sports"
  ],
  "categories": [],
  "sitemap_lastmod": "2014-09-21T10:56:00+00:00"
}