{
  "url": "https://voxday.net/2014/09/24/they-think-theyve-won/",
  "scraped_at": "2025-12-16T12:28:53.802652",
  "title": "They think they’ve won",
  "date_display": "September 24, 2014",
  "date_iso": "2014-09-24T17:00:00+00:00",
  "date_from_url": "2014-09-24",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>The pinkshirts don’t just think they’re winning, <a href=\"http://laurie-penny.com/why-were-winning-social-justice-warriors-and-the-new-culture-war/\">they think they’ve already won</a>. Because Inevitable, insofar as I can follow what passes for the logic:</p><blockquote class=\"tr_bq\"><p> There’s a culture war happening right now. It’s happening in games, in film, in journalism, in television, in fiction, in fandom. It’s happening online, everywhere. And everywhere, sexists, recreational misogynists and bigots are losing.</p><p>They are losing, and they don’t know why….</p><p>I’m talking about gender itself, sex and sexuality itself, as a game you can play and win by ‘beating’ the other ‘side’ into submission. A game where the other ‘side’ isn’t really human at all. Shoot to kill. Destroy the brain. Move on.</p><p>Games and pickup artistry gave a formal structure to that mindset for this generation, but it’s older than that. The gamification of misogyny predates the internet, but right now, in this world full of angry, broken, lost young men convinced that women have robbed them of some fundamental win in life, it’s rampant.</p><p>The trouble is that treating other human beings like faceless opponents doesn’t work in the real world.</p><p>Gender isn’t a game you can play and win by brutalising and harassing and shaming and hurting the other ‘side.’  Ultimately, there is no other side. Gender oppression is structural. Everybody loses, in the long term, because everybody has to live in a culture where it’s normal to hound women out of their homes for daring to demand fairer treatment, normal to shame girls and queer people into silence for suggesting that there might be other interesting stories to tell. There is no way to win this game, except by not playing at all.</p><p>So they can’t understand why they’re losing.</p><p>They can’t understand why their arguments aren’t working. They can’t understand why game designers, industry leaders, writers, public figures are lining up to disown their ideas and pledge to do better by women and girls in the future. They can’t understand why, just for example, when my friend, the games critic and consultant Leigh Alexander, was abused and ‘called out’ as an unprofessional slut, a lying cunt, morally and personally corrupt, just for speaking truthfully and beautifully about all of this, it was Alexander who was invited to write her first piece for Time magazine, Alexander who got to define the agenda for the mainstream, who received praise and recognition, whilst her abusers’ words will be lost in a howling vortex of comment threads and subreddits and, eventually, forgotten.</p><p>Their rage is the rage of bewilderment.</p></blockquote><p>This is a beautiful piece of feminist agit-prop, which begs the very question it asserts. It is an attempt to simultaneously encourage the Social Justice Whores who are demoralized by the unexpectedly fierce resistance being shown by the gaming community while undermining that resistance by falsely claiming it to be counterproductive.</p><p>Notice how the need to resort to existing allies is portrayed as some sort of victory; is there any doubt that Time Magazine was on their side from the start? The classic female attempt to silence the opposition and pretend it doesn’t exist instead of confronting and defeating it is portrayed as a victory, instead of the renewed offensive it actually is. But in fact, the need to throw in your big guns is indicative of the fact that the battle is not going your way.</p><p>The Social Justice Whores, who as I noted yesterday are the moral <i>mutaweenies </i>of the godless Left, are making two major mistakes. First, they have completely failed to understand their enemy. Second, they have prematurely declared victory.</p><p>We aren’t bewildered at all. Nor are we even slightly mystified by why we have been losing for decades, anymore than we fail to grasp why the pinkshirts are suddenly feeling the need to screech louder and redouble their efforts. The truth is that they are meeting with active and stubborn male resistance for the first time in years and they are stunned and astonished by it. Remember, an angry woman always engages in psychological projection. When Penny Red talks about “the rage of bewilderment” she is talking about herself.</p><p>The problem is not that “women are creating culture, changing culture,<br> redefining culture”, the problem is that women are actively attempting to DESTROY culture and they offer nothing that anyone wants in its place. That is why “those cunts, those poisonous cunts, those<br> disgusting, uppity cunts must be stopped”. And that is why they will be stopped.</br></br></p><p>We will win so long as we refuse to submit because we are the creators. They are nothing but pale imitators and parasites. They create nothing new, they bring nothing to the table, they gorge themselves insatiably off the scraps that we cast off and then claim to be feeding themselves.</p><p>A year ago, Castalia House did not exist. In six months, we have sold or given away more than 35,000 books. That’s a drop in the bucket, but it is a start and we are but one minor player in the growing resistance to the SJWs “in games, in film, in journalism, in television, in fiction, in fandom.” The sides are being drawn up, and soon it will become apparent that the pinkshirts have absolutely no idea how reliant they were upon male forbearance.</p><p>But we know what our predecessors did not, we see where their perceptions failed them, so we will show no mercy and we will not give them one single inch of additional ground. They will soon find that victory comes considerably harder when the enemy is actually aware there is a war on. Ask yourself this: if they are truly winning this latest battle, why did Penny Red feel the need to close comments on her blog post?</p></div>",
  "content_text": "The pinkshirts don’t just think they’re winning,\nthey think they’ve already won\n. Because Inevitable, insofar as I can follow what passes for the logic:\nThere’s a culture war happening right now. It’s happening in games, in film, in journalism, in television, in fiction, in fandom. It’s happening online, everywhere. And everywhere, sexists, recreational misogynists and bigots are losing.\nThey are losing, and they don’t know why….\nI’m talking about gender itself, sex and sexuality itself, as a game you can play and win by ‘beating’ the other ‘side’ into submission. A game where the other ‘side’ isn’t really human at all. Shoot to kill. Destroy the brain. Move on.\nGames and pickup artistry gave a formal structure to that mindset for this generation, but it’s older than that. The gamification of misogyny predates the internet, but right now, in this world full of angry, broken, lost young men convinced that women have robbed them of some fundamental win in life, it’s rampant.\nThe trouble is that treating other human beings like faceless opponents doesn’t work in the real world.\nGender isn’t a game you can play and win by brutalising and harassing and shaming and hurting the other ‘side.’  Ultimately, there is no other side. Gender oppression is structural. Everybody loses, in the long term, because everybody has to live in a culture where it’s normal to hound women out of their homes for daring to demand fairer treatment, normal to shame girls and queer people into silence for suggesting that there might be other interesting stories to tell. There is no way to win this game, except by not playing at all.\nSo they can’t understand why they’re losing.\nThey can’t understand why their arguments aren’t working. They can’t understand why game designers, industry leaders, writers, public figures are lining up to disown their ideas and pledge to do better by women and girls in the future. They can’t understand why, just for example, when my friend, the games critic and consultant Leigh Alexander, was abused and ‘called out’ as an unprofessional slut, a lying cunt, morally and personally corrupt, just for speaking truthfully and beautifully about all of this, it was Alexander who was invited to write her first piece for Time magazine, Alexander who got to define the agenda for the mainstream, who received praise and recognition, whilst her abusers’ words will be lost in a howling vortex of comment threads and subreddits and, eventually, forgotten.\nTheir rage is the rage of bewilderment.\nThis is a beautiful piece of feminist agit-prop, which begs the very question it asserts. It is an attempt to simultaneously encourage the Social Justice Whores who are demoralized by the unexpectedly fierce resistance being shown by the gaming community while undermining that resistance by falsely claiming it to be counterproductive.\nNotice how the need to resort to existing allies is portrayed as some sort of victory; is there any doubt that Time Magazine was on their side from the start? The classic female attempt to silence the opposition and pretend it doesn’t exist instead of confronting and defeating it is portrayed as a victory, instead of the renewed offensive it actually is. But in fact, the need to throw in your big guns is indicative of the fact that the battle is not going your way.\nThe Social Justice Whores, who as I noted yesterday are the moral\nmutaweenies\nof the godless Left, are making two major mistakes. First, they have completely failed to understand their enemy. Second, they have prematurely declared victory.\nWe aren’t bewildered at all. Nor are we even slightly mystified by why we have been losing for decades, anymore than we fail to grasp why the pinkshirts are suddenly feeling the need to screech louder and redouble their efforts. The truth is that they are meeting with active and stubborn male resistance for the first time in years and they are stunned and astonished by it. Remember, an angry woman always engages in psychological projection. When Penny Red talks about “the rage of bewilderment” she is talking about herself.\nThe problem is not that “women are creating culture, changing culture,\nredefining culture”, the problem is that women are actively attempting to DESTROY culture and they offer nothing that anyone wants in its place. That is why “those cunts, those poisonous cunts, those\ndisgusting, uppity cunts must be stopped”. And that is why they will be stopped.\nWe will win so long as we refuse to submit because we are the creators. They are nothing but pale imitators and parasites. They create nothing new, they bring nothing to the table, they gorge themselves insatiably off the scraps that we cast off and then claim to be feeding themselves.\nA year ago, Castalia House did not exist. In six months, we have sold or given away more than 35,000 books. That’s a drop in the bucket, but it is a start and we are but one minor player in the growing resistance to the SJWs “in games, in film, in journalism, in television, in fiction, in fandom.” The sides are being drawn up, and soon it will become apparent that the pinkshirts have absolutely no idea how reliant they were upon male forbearance.\nBut we know what our predecessors did not, we see where their perceptions failed them, so we will show no mercy and we will not give them one single inch of additional ground. They will soon find that victory comes considerably harder when the enemy is actually aware there is a war on. Ask yourself this: if they are truly winning this latest battle, why did Penny Red feel the need to close comments on her blog post?",
  "tags": [
    "SJW"
  ],
  "categories": [],
  "sitemap_lastmod": "2014-09-24T16:00:00+00:00"
}