{
  "url": "https://voxday.net/2014/09/11/video-game-sex-war/",
  "scraped_at": "2025-12-16T12:27:24.772993",
  "title": "Video Game Sex War",
  "date_display": "September 11, 2014",
  "date_iso": "2014-09-11T08:32:00+00:00",
  "date_from_url": "2014-09-11",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>There’s a headline for you. It’s pretty obvious that the anti-game women are alarmed and in retreat when they are <a href=\"http://www.telegraph.co.uk/technology/video-games/11087308/Women-strike-back-in-the-video-games-sex-war.html\">running to the international media</a> for support simply because Zoe Quinn was exposed as a whore taking advantage of corruption in the world of independent game journalism:</p><blockquote class=\"tr_bq\"><p> Evil women are coming to take away your computer games. At least, that’s the message that a group of angry young men have been articulating on the internet in the past few weeks. According to them, these games – once a haven for socially awkward teenage boys – are being ruined by the monstrous regiment….</p><p>This online explosion grew from two separate, though connected, incidents. The<br> first was the success of a series of videos made by the blogger Anita<br> Sarkeesian, called Tropes vs Women, which explored the portrayal of women in<br> video games (generally submissive and for decoration). When she launched a<br> crowdfund appeal for the project in 2012, she raised $150,000 more than she<br> asked for, but also unleashed a vicious campaign of sustained harassment.<br> Hackers tried to gain access to her social media accounts and she was<br> bombarded with tweets and emails threatening her with rape and death. A few<br> weeks ago, she had to leave her home because she feared for her safety.</br></br></br></br></br></br></br></br></p><p>While this was going on, a game developer called Zoe Quinn also became the<br> target of abuse, when her former boyfriend posted online accusations of<br> infidelity: he claimed she had cheated on him with a games journalist. A few<br> impressionable young men decided that this was their opportunity to end<br> “corruption” in games journalism once and for all. They bombarded Quinn with<br> abuse and threats, insisting that their anger was about press ethics – she<br> had traded sexual favours for good reviews – rather than misogyny. It turned<br> out that the journalist in question had not even reviewed Quinn’s game.</br></br></br></br></br></br></br></p><p>While many of the men involved in these incidents are undoubtedly motivated by<br> sexism and sadism – there is a nasty trend on the internet to abuse women<br> per se – they are right about one thing: women are coming to take away their<br> computer games…. [A]s video games are increasingly subjected to the same cultural criticism<br> that is routinely applied to books, films and television programmes, their<br> developers are coming under pressure to change the way they portray women.<br> This, obviously, angers many of those who define themselves as “gamers” and<br> who feel threatened by the idea of such interference…. Games are growing up, whether gamers like it or not, and<br> testosterone-riddled male-power fantasies are bound to fall out of favour as<br> a result. The nerds are going to have to grow up and learn to live with the<br> invasion.</br></br></br></br></br></br></br></br></br></br></p></blockquote><p>In other words, she’s admitting that those awful angry young men are absolutely correct. But speaking as a game designer who knows a fair percentage of the top game developers, these assertions are downright risible. I was at the offices of an extremely successful new game developer not too terribly long ago, and I would estimate around three percent of their employees were women. And in two days of discussions concerning what they were working on and what they were planning to develop in the future, there was absolutely zero mention of what might be of interest to women or female gamers. It’s just not their market, and therefore it is of no interest or concern to them.</p><p>My own game now in development, <a href=\"http://alpenwolf.com/\">FIRST SWORD</a>, came under some criticism from the likes of Manboobz and other petty SJWs a few months ago because I made it clear there will be no female fantasy gladiators. Historically speaking, female gladiators were the light comic relief between the real action; they were often set against midgets, for example. These complaints had no more effect on my design decisions than complaints about prostitutes had on Rockstar or complaints about scanty armor on female characters have had on every game company everywhere. But it is more than a little ironic to see that there are pinkshirts who will actually complain about the fact that I am refusing to design female slavery, in which women would be literally bought and sold as property, into a game.</p><p>The fact that there is now a large Lite Games industry in which women are the vast majority of the consumers doesn’t change what continues to appeal and sell to young men. You don’t need to tell me about the difference. After all, I designed Hot Dish for THQ, one of the more successful “casual games” played predominantly by women before Zynga rode the Facebook platform to going public. Some of the other options I came up with were a Wedding Dress game, a Bridal Party game, and a sorority-based game. I was literally years ahead of today’s pinkshirts.</p><p>But these casual girl games have as little to do with the current AAA shooters as the shooters do with the turn-based wargames that preceded them. Girl games are just another gaming genre, that’s all, and they will have as little effect on the design and development of games in other genres as has always been the case in the past. Now certainly, if someone comes up with a good mechanic in one of them that is useful in another genre, it will be copied and used. After all, Candy Crush Saga is simply a dumbed-down version of Steve Fawkner’s Puzzle Quest, thus allowing one to trace its design lineage all the way back to a turn-based wargame, Warlords, a CGW game-of-the-year which has probably been played by fewer women over the last 25 years than read this blog. But Call of Duty hasn’t changed how designers or players approach Advanced Squad Leader, and Depression Quest won’t change how they approach Call of Duty either.</p><p>The reason that the game industry is much less susceptible to the sort of pressure that Sarkeesian and Quinn are attempting to appeal is that whereas it is easy to write and publish books, it is much harder to design and develop games. And the sort of men who design and develop games are considerably less inclined to pay any attention to whatever it is that the pinkshirts are demanding today than the sort of men who used to write science fiction.</p><p>I find it all rather amusing. If the pinkshirts are already complaining about the lack of women in a fantasy gladiator game still in development, it should be downright hilarious to see their response to RIDING THE RED HORSE when it comes out in November.</p><p>But since we’re speaking of inclusiveness, this is as good a place as any to note that the Spanish (<a href=\"http://t.co/RLziFZQYei\"><i><b>La Gravedad Mata</b></i></a>) and Portuguese (<b><i><a href=\"http://t.co/GYLDZ21VHY\">Gravidade Mortal</a></i></b>) versions of <i><b>QUANTUM MORTIS Gravity Kills</b></i> are free today on Amazon. As is the immortal John C. Wright’s <a href=\"http://www.amazon.com/Awake-Night-John-C-Wright-ebook/dp/B00K425CL6\"><i><b>Awake in the Night</b></i></a>.</p><p>UPDATE: Lest you doubt it, academic feminists are <a href=\"http://pastebin.com/X46rkJJu\">quite literally attempting to destroy the game industry</a> in much the same way they have destroyed science fiction and fantasy:</p><blockquote class=\"tr_bq\"><p> Adrienne: Why do we see such tension between academics and game designers?  less of an issue with indies, but there are always some people in industry that have similar questions until industrial logic takes over later and how can we better intervene in industrial logics to disturb that process.  How can academics bridge the gap to the industry audience to help them do different work?  How can we disrupt the capitalist norms that facilitate this?</p><p>Deirdra: This is a hard, personal issue.  Getting attacked or having friends getting attacked hurts.  It’s hard not to feel personally attacked and to get to an academic spot where you take the personal out of it.</p><p>Andrew: Feels quite viscerally injured when someone like Samantha Allen is lost to the industry because the reaction to her by some gamers was so violent that it didn’t make sense to stay. Academia needs to push for more radical positions within the industry to help make things better.</p></blockquote><p>If they think the reaction was violent already, they haven’t seen anything yet now that we actually know what they are up to. It is time for the game industry to declare war on academia.</p></div>",
  "content_text": "There’s a headline for you. It’s pretty obvious that the anti-game women are alarmed and in retreat when they are\nrunning to the international media\nfor support simply because Zoe Quinn was exposed as a whore taking advantage of corruption in the world of independent game journalism:\nEvil women are coming to take away your computer games. At least, that’s the message that a group of angry young men have been articulating on the internet in the past few weeks. According to them, these games – once a haven for socially awkward teenage boys – are being ruined by the monstrous regiment….\nThis online explosion grew from two separate, though connected, incidents. The\nfirst was the success of a series of videos made by the blogger Anita\nSarkeesian, called Tropes vs Women, which explored the portrayal of women in\nvideo games (generally submissive and for decoration). When she launched a\ncrowdfund appeal for the project in 2012, she raised $150,000 more than she\nasked for, but also unleashed a vicious campaign of sustained harassment.\nHackers tried to gain access to her social media accounts and she was\nbombarded with tweets and emails threatening her with rape and death. A few\nweeks ago, she had to leave her home because she feared for her safety.\nWhile this was going on, a game developer called Zoe Quinn also became the\ntarget of abuse, when her former boyfriend posted online accusations of\ninfidelity: he claimed she had cheated on him with a games journalist. A few\nimpressionable young men decided that this was their opportunity to end\n“corruption” in games journalism once and for all. They bombarded Quinn with\nabuse and threats, insisting that their anger was about press ethics – she\nhad traded sexual favours for good reviews – rather than misogyny. It turned\nout that the journalist in question had not even reviewed Quinn’s game.\nWhile many of the men involved in these incidents are undoubtedly motivated by\nsexism and sadism – there is a nasty trend on the internet to abuse women\nper se – they are right about one thing: women are coming to take away their\ncomputer games…. [A]s video games are increasingly subjected to the same cultural criticism\nthat is routinely applied to books, films and television programmes, their\ndevelopers are coming under pressure to change the way they portray women.\nThis, obviously, angers many of those who define themselves as “gamers” and\nwho feel threatened by the idea of such interference…. Games are growing up, whether gamers like it or not, and\ntestosterone-riddled male-power fantasies are bound to fall out of favour as\na result. The nerds are going to have to grow up and learn to live with the\ninvasion.\nIn other words, she’s admitting that those awful angry young men are absolutely correct. But speaking as a game designer who knows a fair percentage of the top game developers, these assertions are downright risible. I was at the offices of an extremely successful new game developer not too terribly long ago, and I would estimate around three percent of their employees were women. And in two days of discussions concerning what they were working on and what they were planning to develop in the future, there was absolutely zero mention of what might be of interest to women or female gamers. It’s just not their market, and therefore it is of no interest or concern to them.\nMy own game now in development,\nFIRST SWORD\n, came under some criticism from the likes of Manboobz and other petty SJWs a few months ago because I made it clear there will be no female fantasy gladiators. Historically speaking, female gladiators were the light comic relief between the real action; they were often set against midgets, for example. These complaints had no more effect on my design decisions than complaints about prostitutes had on Rockstar or complaints about scanty armor on female characters have had on every game company everywhere. But it is more than a little ironic to see that there are pinkshirts who will actually complain about the fact that I am refusing to design female slavery, in which women would be literally bought and sold as property, into a game.\nThe fact that there is now a large Lite Games industry in which women are the vast majority of the consumers doesn’t change what continues to appeal and sell to young men. You don’t need to tell me about the difference. After all, I designed Hot Dish for THQ, one of the more successful “casual games” played predominantly by women before Zynga rode the Facebook platform to going public. Some of the other options I came up with were a Wedding Dress game, a Bridal Party game, and a sorority-based game. I was literally years ahead of today’s pinkshirts.\nBut these casual girl games have as little to do with the current AAA shooters as the shooters do with the turn-based wargames that preceded them. Girl games are just another gaming genre, that’s all, and they will have as little effect on the design and development of games in other genres as has always been the case in the past. Now certainly, if someone comes up with a good mechanic in one of them that is useful in another genre, it will be copied and used. After all, Candy Crush Saga is simply a dumbed-down version of Steve Fawkner’s Puzzle Quest, thus allowing one to trace its design lineage all the way back to a turn-based wargame, Warlords, a CGW game-of-the-year which has probably been played by fewer women over the last 25 years than read this blog. But Call of Duty hasn’t changed how designers or players approach Advanced Squad Leader, and Depression Quest won’t change how they approach Call of Duty either.\nThe reason that the game industry is much less susceptible to the sort of pressure that Sarkeesian and Quinn are attempting to appeal is that whereas it is easy to write and publish books, it is much harder to design and develop games. And the sort of men who design and develop games are considerably less inclined to pay any attention to whatever it is that the pinkshirts are demanding today than the sort of men who used to write science fiction.\nI find it all rather amusing. If the pinkshirts are already complaining about the lack of women in a fantasy gladiator game still in development, it should be downright hilarious to see their response to RIDING THE RED HORSE when it comes out in November.\nBut since we’re speaking of inclusiveness, this is as good a place as any to note that the Spanish (\nLa Gravedad Mata\n) and Portuguese (\nGravidade Mortal\n) versions of\nQUANTUM MORTIS Gravity Kills\nare free today on Amazon. As is the immortal John C. Wright’s\nAwake in the Night\n.\nUPDATE: Lest you doubt it, academic feminists are\nquite literally attempting to destroy the game industry\nin much the same way they have destroyed science fiction and fantasy:\nAdrienne: Why do we see such tension between academics and game designers?  less of an issue with indies, but there are always some people in industry that have similar questions until industrial logic takes over later and how can we better intervene in industrial logics to disturb that process.  How can academics bridge the gap to the industry audience to help them do different work?  How can we disrupt the capitalist norms that facilitate this?\nDeirdra: This is a hard, personal issue.  Getting attacked or having friends getting attacked hurts.  It’s hard not to feel personally attacked and to get to an academic spot where you take the personal out of it.\nAndrew: Feels quite viscerally injured when someone like Samantha Allen is lost to the industry because the reaction to her by some gamers was so violent that it didn’t make sense to stay. Academia needs to push for more radical positions within the industry to help make things better.\nIf they think the reaction was violent already, they haven’t seen anything yet now that we actually know what they are up to. It is time for the game industry to declare war on academia.",
  "tags": [
    "freakshow",
    "games",
    "SJW"
  ],
  "categories": [],
  "sitemap_lastmod": "2014-09-11T07:32:00+00:00"
}