{
  "url": "https://voxday.net/2014/09/12/why-one-writes/",
  "scraped_at": "2025-12-16T12:27:34.725448",
  "title": "Why one writes",
  "date_display": "September 12, 2014",
  "date_iso": "2014-09-12T18:09:00+00:00",
  "date_from_url": "2014-09-12",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>There are those who write primarily for money. That is their right, but they are nothing more than word whores and they are not to be imitated, because word whoredom wears at one’s soul and generally does not pay well. John C. Wright explains <a href=\"http://www.scifiwright.com/2014/09/your-book-of-gold/\">a much better reason for writing</a>:</p><blockquote class=\"tr_bq\"><p> If you only write one book in your whole life, and only sell 600 copies or less, nonetheless, I assure you, I solemnly assure you, that this book will be someone’s absolutely favorite book of all time, and it will come to him on some dark day and give him sunlight, and open his eyes and fill his heart and make him see things in life even you never suspected, and will be his most precious tale, and it will live in his heart like the Book of Gold.</p><p>Let me give you three examples to support my point: VOYAGE TO ARCTURUS by David Lindsay had perhaps more effect and influence on me in my youth than any other book aside from WORLD OF NULL-A by A.E. van Vogt. To be fair, I misinterpreted both books, and took them to be preaching a resolute form of scientific Stoicism, an absolute devotion to sanity and truth which I doubt either author would recognize. I never wrote Mr. van Vogt a fan letter, despite that my whole life was influenced by him (but I did write a novel to honor him). Had it not been for his books, I never would have studied philosophy in High School, never would have gone to Saint John’s in Annapolis, never would have read the Great Books. I never would have met my wife.</p><p>As for Mr. Lindsay, he sold less than 600 copies of his book, and died in poverty, ignored and forgotten, of an abscess in a tooth any competent dentist could have pulled. And this is a book luminaries such as Colin Wilson, C.S. Lewis, and Harold Bloom regard as seminal. Mr. Wilson called it the greatest novel of the Twentieth Century.</p><p>The third example is my own. I wrote a short story called AWAKE IN THE NIGHT for the website of Andy Robertson, and was paid enough to buy a new stove. People have written me to say that this tale inspired dreams and nightmares, inspired new resolve, inspired hope, and at least one woman who was in the midst of her most wretched hour of despair, said she found strength just from the one description of a star appearing through the darkest clouds. What these readers see in my work is far beyond what I have the power to put down on the page: the hand of heaven touched that work, and those readers who express awe are seeing not the author’s hand, but the hand of the Creator who is author of us all, who guided the work without my knowledge.</p><p>I was luckier than Mr Lindsay in that I have gotten the letters and applause from admirers denied him, but like him,  I have no idea of what future generations, if any, will read and admire my work. I will never know. It is beyond my event horizon. So that is not why writers write.</p><p>I write for that one reader I will never see, the one who needs just such a tale as I can pen, in just such a time and place, some rainy afternoon or dark hour, when providence will bring my book into his hands. And he will open it, and it will not be a book, but a casement, from which he will glimpse the needed vision his soul requires of a world larger than our own, or a star in a heaven wider and higher than ours, a star aflame with magic more majestic than any star mortal astronomers can name.</p></blockquote><p>I am a much lesser writer than Mr. Wright. I write primarily for my own amusement and in order to help me order my thoughts, in part because I have never forgotten something a young woman once told me: “Everyone thinks they have great thoughts, but that’s just a feeling. Those thoughts might not even exist, so the value of a thought can only be determined after it is articulated.” And since I spend most of my time alone, the only way for me to articulate my thoughts is to write them down.</p><p>For example, I’m sure many people have said at one time or another something like this: “I wonder how dwarves live deep underground in caves?” When I think such a thought, my mind tends to wander towards figuring out how the dwarven economy might work by raising sightless fish and salamanders for meat, and harvesting various fungi and other lifeforms that don’t require light. And then I start doing research, which inevitably forces me to reconsider my initial thoughts.</p><p><i>“Many cave communities will rely on food being brought  into the cave<br> from the surface. This organic debris includes leafs, twigs etc. brought<br> in by surface streams or falling down vertical shafts;<br> it also includes organic matter brought in by visitors to the cave,<br> carcasses of animals that have wandered in, and droppings from animals<br> such as bats.<br> The amount of debris that can be brought in is very evident in Porth<br> yr Ogof<br> – including large tree trunks. Most creatures will be found near the<br> surface where food is more plentiful – the deeper you go in a cave the<br> harder you will have to look.<br> In the depths of a cave the communities may be concentrated around<br> food sources generated by cave bacteria on e.g. flowstone.”</br></br></br></br></br></br></br></br></br></br></br></br></i></p><p>This means that any community of intelligent beings dwelling deep underground would have to have a major industry that revolved around bringing organic matter into the caves, which implies a transportation system for that matter and so forth. I imagine most fans of Selenoth can guess where this particular thought ended up going. My muse is not Beauty, but Logic, which has a peculiar beauty all its own.</p><p>In any event, I consider it a mistake to write for any reason besides the joy of it. As Mr. Wright observes, there will always be someone who appreciates one’s work, and it doesn’t really matter a great deal if one only has one ideal reader or one million.</p><p>And since we’re on the topic of writing, I should probably mention that my first solo books, the <i>Eternal Warriors</i> trilogy, are finally back in electronic print. All three books, <a href=\"http://www.castaliahouse.com/downloads/the-war-in-heaven/\"><b><i>The War in Heaven</i></b></a>, <a href=\"http://www.castaliahouse.com/downloads/the-world-in-shadow/\"><b><i>The World in Shadow</i></b></a>, and <a href=\"http://www.castaliahouse.com/downloads/the-wrath-of-angels/\"><b><i>The Wrath of Angels</i></b></a> are now exclusively available from the Castalia House store. We will also have some interesting announcements regarding some other authors who will be available from the store next week.</p></div>",
  "content_text": "There are those who write primarily for money. That is their right, but they are nothing more than word whores and they are not to be imitated, because word whoredom wears at one’s soul and generally does not pay well. John C. Wright explains\na much better reason for writing\n:\nIf you only write one book in your whole life, and only sell 600 copies or less, nonetheless, I assure you, I solemnly assure you, that this book will be someone’s absolutely favorite book of all time, and it will come to him on some dark day and give him sunlight, and open his eyes and fill his heart and make him see things in life even you never suspected, and will be his most precious tale, and it will live in his heart like the Book of Gold.\nLet me give you three examples to support my point: VOYAGE TO ARCTURUS by David Lindsay had perhaps more effect and influence on me in my youth than any other book aside from WORLD OF NULL-A by A.E. van Vogt. To be fair, I misinterpreted both books, and took them to be preaching a resolute form of scientific Stoicism, an absolute devotion to sanity and truth which I doubt either author would recognize. I never wrote Mr. van Vogt a fan letter, despite that my whole life was influenced by him (but I did write a novel to honor him). Had it not been for his books, I never would have studied philosophy in High School, never would have gone to Saint John’s in Annapolis, never would have read the Great Books. I never would have met my wife.\nAs for Mr. Lindsay, he sold less than 600 copies of his book, and died in poverty, ignored and forgotten, of an abscess in a tooth any competent dentist could have pulled. And this is a book luminaries such as Colin Wilson, C.S. Lewis, and Harold Bloom regard as seminal. Mr. Wilson called it the greatest novel of the Twentieth Century.\nThe third example is my own. I wrote a short story called AWAKE IN THE NIGHT for the website of Andy Robertson, and was paid enough to buy a new stove. People have written me to say that this tale inspired dreams and nightmares, inspired new resolve, inspired hope, and at least one woman who was in the midst of her most wretched hour of despair, said she found strength just from the one description of a star appearing through the darkest clouds. What these readers see in my work is far beyond what I have the power to put down on the page: the hand of heaven touched that work, and those readers who express awe are seeing not the author’s hand, but the hand of the Creator who is author of us all, who guided the work without my knowledge.\nI was luckier than Mr Lindsay in that I have gotten the letters and applause from admirers denied him, but like him,  I have no idea of what future generations, if any, will read and admire my work. I will never know. It is beyond my event horizon. So that is not why writers write.\nI write for that one reader I will never see, the one who needs just such a tale as I can pen, in just such a time and place, some rainy afternoon or dark hour, when providence will bring my book into his hands. And he will open it, and it will not be a book, but a casement, from which he will glimpse the needed vision his soul requires of a world larger than our own, or a star in a heaven wider and higher than ours, a star aflame with magic more majestic than any star mortal astronomers can name.\nI am a much lesser writer than Mr. Wright. I write primarily for my own amusement and in order to help me order my thoughts, in part because I have never forgotten something a young woman once told me: “Everyone thinks they have great thoughts, but that’s just a feeling. Those thoughts might not even exist, so the value of a thought can only be determined after it is articulated.” And since I spend most of my time alone, the only way for me to articulate my thoughts is to write them down.\nFor example, I’m sure many people have said at one time or another something like this: “I wonder how dwarves live deep underground in caves?” When I think such a thought, my mind tends to wander towards figuring out how the dwarven economy might work by raising sightless fish and salamanders for meat, and harvesting various fungi and other lifeforms that don’t require light. And then I start doing research, which inevitably forces me to reconsider my initial thoughts.\n“Many cave communities will rely on food being brought  into the cave\nfrom the surface. This organic debris includes leafs, twigs etc. brought\nin by surface streams or falling down vertical shafts;\nit also includes organic matter brought in by visitors to the cave,\ncarcasses of animals that have wandered in, and droppings from animals\nsuch as bats.\nThe amount of debris that can be brought in is very evident in Porth\nyr Ogof\n– including large tree trunks. Most creatures will be found near the\nsurface where food is more plentiful – the deeper you go in a cave the\nharder you will have to look.\nIn the depths of a cave the communities may be concentrated around\nfood sources generated by cave bacteria on e.g. flowstone.”\nThis means that any community of intelligent beings dwelling deep underground would have to have a major industry that revolved around bringing organic matter into the caves, which implies a transportation system for that matter and so forth. I imagine most fans of Selenoth can guess where this particular thought ended up going. My muse is not Beauty, but Logic, which has a peculiar beauty all its own.\nIn any event, I consider it a mistake to write for any reason besides the joy of it. As Mr. Wright observes, there will always be someone who appreciates one’s work, and it doesn’t really matter a great deal if one only has one ideal reader or one million.\nAnd since we’re on the topic of writing, I should probably mention that my first solo books, the\nEternal Warriors\ntrilogy, are finally back in electronic print. All three books,\nThe War in Heaven\n,\nThe World in Shadow\n, and\nThe Wrath of Angels\nare now exclusively available from the Castalia House store. We will also have some interesting announcements regarding some other authors who will be available from the store next week.",
  "tags": [
    "writing"
  ],
  "categories": [],
  "sitemap_lastmod": "2014-09-12T17:09:00+00:00"
}