{
  "url": "https://voxday.net/2023/05/25/advantage-unauthorized/",
  "scraped_at": "2026-01-08T13:57:45.142777",
  "title": "Advantage Unauthorized",
  "date_display": "May 25, 2023",
  "date_iso": "2023-05-25T10:16:05+00:00",
  "date_from_url": "2023-05-25",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>A professional copy editor <a href=\"https://old.reddit.com/r/redscarepod/comments/13l2pv0/ai_is_making_everything_fake_and_gay/\">laments the replacement of mediocrities</a> with pattern probability tables:</p><blockquote class=\"wp-block-quote is-layout-flow wp-block-quote-is-layout-flow\"><p>I’m a copy editor and almost all the recent jobs I’ve had have been editing text written by AI. College application essays, marketing articles, reports. My job is quickly going from improving human beings’ writing to tweaking text written by robots so that it sounds somewhat human and evades AI detection software. I like helping people express their ideas by editing their writing, not changing endless text written by a computer that all sounds the same to trick people into thinking it was written by a person. The tech has already taken copy writers’ jobs and soon I’m sure it’ll be sophisticated enough to take mine too.</p><p>I hate soulless AI-generated art. I struggle to even understand the point of art if it wasn’t created by a conscious, talented human being with a soul. Soon books, TV shows, and movies will be churned out by computers. All that comes up on search engines anymore are dozens of identical AI generated articles that only graze the surface of the topic and never answer your question.</p></blockquote><p>First of all, AI is a misnomer because there is no intelligence there. It’s simply design-for-effect applied to text generation, which is why <em>Advanced Squad Leader</em> feels like a WWII infantry simulation when it isn’t a simulation at all. I know this because I designed, and applied for a patent that was rejected, for an Artificial Player Character that provided the effect of simulating human behavior in an MMO game without actually simulating anything. It was just a weighted pattern probability table that, ironically, provided the game designer with more “realistic” human behavior by the NPCs than most real player-characters were displaying.</p><p>Second, while these generated patterns can provide realistic results that exceed the mediocre norm, they can never, on the basis of the pattern probabilities alone, ever reach the level of good writers, let alone great ones, because they contain no basis for the specificity required for quality analysis and application. This is the explanation for the copy editor’s correct complaint about “articles that only graze the surface of the topic and never answer your question.”</p><p>Third is the limitations imposed by the AI-programmers, which massively reduce both the relevance and utility of the generated texts. When ideas, events, and individuals are banished from the input, the output will necessarily diverge from reality, and often, coherence.</p><p>This is why the creators who are both talented and unauthorized possess an inherent, structural advantage over what presently passes for AI-generated writing, an advantage that is unlikely to diminish with future iterations of the technology.</p><p><em><a href=\"https://social.infogalactic.com/micropost/593e3471-3087-4bc4-92b0-5329be1ac43f\">DISCUSS ON SG</a></em></p></div>",
  "content_text": "A professional copy editor\nlaments the replacement of mediocrities\nwith pattern probability tables:\nI’m a copy editor and almost all the recent jobs I’ve had have been editing text written by AI. College application essays, marketing articles, reports. My job is quickly going from improving human beings’ writing to tweaking text written by robots so that it sounds somewhat human and evades AI detection software. I like helping people express their ideas by editing their writing, not changing endless text written by a computer that all sounds the same to trick people into thinking it was written by a person. The tech has already taken copy writers’ jobs and soon I’m sure it’ll be sophisticated enough to take mine too.\nI hate soulless AI-generated art. I struggle to even understand the point of art if it wasn’t created by a conscious, talented human being with a soul. Soon books, TV shows, and movies will be churned out by computers. All that comes up on search engines anymore are dozens of identical AI generated articles that only graze the surface of the topic and never answer your question.\nFirst of all, AI is a misnomer because there is no intelligence there. It’s simply design-for-effect applied to text generation, which is why\nAdvanced Squad Leader\nfeels like a WWII infantry simulation when it isn’t a simulation at all. I know this because I designed, and applied for a patent that was rejected, for an Artificial Player Character that provided the effect of simulating human behavior in an MMO game without actually simulating anything. It was just a weighted pattern probability table that, ironically, provided the game designer with more “realistic” human behavior by the NPCs than most real player-characters were displaying.\nSecond, while these generated patterns can provide realistic results that exceed the mediocre norm, they can never, on the basis of the pattern probabilities alone, ever reach the level of good writers, let alone great ones, because they contain no basis for the specificity required for quality analysis and application. This is the explanation for the copy editor’s correct complaint about “articles that only graze the surface of the topic and never answer your question.”\nThird is the limitations imposed by the AI-programmers, which massively reduce both the relevance and utility of the generated texts. When ideas, events, and individuals are banished from the input, the output will necessarily diverge from reality, and often, coherence.\nThis is why the creators who are both talented and unauthorized possess an inherent, structural advantage over what presently passes for AI-generated writing, an advantage that is unlikely to diminish with future iterations of the technology.\nDISCUSS ON SG",
  "tags": [
    "technology",
    "writing"
  ],
  "categories": [],
  "sitemap_lastmod": "2023-05-25T10:16:07+00:00"
}