{
  "url": "https://voxday.net/2023/05/27/bill-gates-sex-machine/",
  "scraped_at": "2026-01-08T13:58:01.322071",
  "title": "Bill Gates, Sex Machine",
  "date_display": "May 27, 2023",
  "date_iso": "2023-05-27T19:21:00+00:00",
  "date_from_url": "2023-05-27",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>AC puts a very different spin <a href=\"https://www.anonymousconservative.com/blog/news-briefs-05-07-2023-2/\">on Bill Gates’s affair</a> with a young Russian bridge player.</p><blockquote class=\"wp-block-quote is-layout-flow wp-block-quote-is-layout-flow\"><p>The story was Bill Gates competed in a Bridge tournament, and he was so impressed with the intellect she displayed, he had an affair with her, and she, little star struck ingénue was so awed by his star power, he was able to get her in the sack. Epstein crossed paths with her by chance, when she was seeking $500,000 to set up a Bridge-oriented website, and while he did not give her the cash, he paid for her to attend computer programmer school, and let her stay in his apartment in New York City for nothing. Then he later tried to blackmail Gates into putting money into a JPMorgan charitable fund using his knowledge of the affair.</p><p>What really happened? This girl knew Anna Chapman. She was a spook. Moreover, a trained honeypot spook, probably. They probably met in honeypot school. Bill Gates runs Microsoft. His software is on everyone’s computers. Years before this, he was probably approached, or connected with someone, probably with relation to bridge. A bridge connection. Supposedly you never want to simply send your infiltrator in cold, looking to compromise someone, or get something, because they first have to fight to gain trust, and your meeting may always seem unusual and provoke suspicion. You first insert another person, beyond reproach, who never tries to compromise the target, or get anything out of them. They build trust and a bond with the target, and then you then insert the compromiser through them, using an introduction and some social capital (Here is my friend…), so the compromising agent has some social capital going in, and the target will never wonder how they met, or if there was an ulterior motive. Gates probably has another agent in his circles somewhere who introduced them. I would assume she was part of a massive operation, specifically targeting Gates, maybe hoping to get him to insert someone into Microsoft at some point, maybe someone who could get a backdoor into Windows, if they could get deep enough. Impossible to know how it worked from here, beyond he was a target, and was so important it was probably impressive in scope once she got in with him.</p><p>It also explains why Epstein let her stay in his apartment when she came to New York (and met her friend Anna Chapman) and why he paid for her to go to computer programmer school. Epstein was pure intelligence, and he likely knew exactly who she was and who she worked for. So he probably planted her somewhere in a controlled apartment, probably put up with cameras and microphones being monitored by his bosses, and a controlled school, where his intel handlers could get a good, long, multi-year look at her, maybe with an eye to turning her, or at least building a legend on her. Epstein contacting Gates about her probably was not so much a case of <em>“I know about your affair,”</em> but was probably more along the lines of, <em>“I know you got compromised by a Russian agent.”</em></p></blockquote><p>AC’s scenario would certainly go a long way toward explaining why Bill Gates the face of all things Clown World these days. I don’t know about you, but I tend to doubt he has any particularly strong attachment to Africa, vaccines, or farming. He’s basically a creepier, sexually ambiguous Elon Musk playing the role of Smart, Successful Billionaire, as even the old stories about his supposed programming chops tend to strike one as little more than a charade.</p><p><em><a href=\"https://social.infogalactic.com/micropost/96c88c61-658f-4c75-a246-3fa831ce9121\">DISCUSS ON SG</a></em></p></div>",
  "content_text": "AC puts a very different spin\non Bill Gates’s affair\nwith a young Russian bridge player.\nThe story was Bill Gates competed in a Bridge tournament, and he was so impressed with the intellect she displayed, he had an affair with her, and she, little star struck ingénue was so awed by his star power, he was able to get her in the sack. Epstein crossed paths with her by chance, when she was seeking $500,000 to set up a Bridge-oriented website, and while he did not give her the cash, he paid for her to attend computer programmer school, and let her stay in his apartment in New York City for nothing. Then he later tried to blackmail Gates into putting money into a JPMorgan charitable fund using his knowledge of the affair.\nWhat really happened? This girl knew Anna Chapman. She was a spook. Moreover, a trained honeypot spook, probably. They probably met in honeypot school. Bill Gates runs Microsoft. His software is on everyone’s computers. Years before this, he was probably approached, or connected with someone, probably with relation to bridge. A bridge connection. Supposedly you never want to simply send your infiltrator in cold, looking to compromise someone, or get something, because they first have to fight to gain trust, and your meeting may always seem unusual and provoke suspicion. You first insert another person, beyond reproach, who never tries to compromise the target, or get anything out of them. They build trust and a bond with the target, and then you then insert the compromiser through them, using an introduction and some social capital (Here is my friend…), so the compromising agent has some social capital going in, and the target will never wonder how they met, or if there was an ulterior motive. Gates probably has another agent in his circles somewhere who introduced them. I would assume she was part of a massive operation, specifically targeting Gates, maybe hoping to get him to insert someone into Microsoft at some point, maybe someone who could get a backdoor into Windows, if they could get deep enough. Impossible to know how it worked from here, beyond he was a target, and was so important it was probably impressive in scope once she got in with him.\nIt also explains why Epstein let her stay in his apartment when she came to New York (and met her friend Anna Chapman) and why he paid for her to go to computer programmer school. Epstein was pure intelligence, and he likely knew exactly who she was and who she worked for. So he probably planted her somewhere in a controlled apartment, probably put up with cameras and microphones being monitored by his bosses, and a controlled school, where his intel handlers could get a good, long, multi-year look at her, maybe with an eye to turning her, or at least building a legend on her. Epstein contacting Gates about her probably was not so much a case of\n“I know about your affair,”\nbut was probably more along the lines of,\n“I know you got compromised by a Russian agent.”\nAC’s scenario would certainly go a long way toward explaining why Bill Gates the face of all things Clown World these days. I don’t know about you, but I tend to doubt he has any particularly strong attachment to Africa, vaccines, or farming. He’s basically a creepier, sexually ambiguous Elon Musk playing the role of Smart, Successful Billionaire, as even the old stories about his supposed programming chops tend to strike one as little more than a charade.\nDISCUSS ON SG",
  "tags": [
    "Clown World",
    "conspiracy"
  ],
  "categories": [],
  "sitemap_lastmod": "2023-05-27T19:21:02+00:00"
}