{
  "url": "https://voxday.net/2023/05/31/clown-world-vs-gamma-world/",
  "scraped_at": "2026-01-08T13:58:26.271350",
  "title": "Clown World vs Gamma World",
  "date_display": "May 31, 2023",
  "date_iso": "2023-05-31T11:46:50+00:00",
  "date_from_url": "2023-05-31",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>The Kurgan observes <a href=\"https://www.gfilotto.com/clown-world-will-be-more-paranoia-than-gamma-world\">the growing number of similarities</a> between Clown World and two of the science fiction role-playing games of the early 1980s.</p><blockquote class=\"wp-block-quote is-layout-flow wp-block-quote-is-layout-flow\"><p><em>Gamma World</em> had:</p><ul class=\"wp-block-list\"><li>Purebloods (aka pure strain humans) and we have those.</li><li>Mutants, and we have those too now, thanks to the genetic serum murder juice, except in Gamma World at least most of the times they have some super-powers. While in this version they only het defects and most likely an early death.</li><li>Mutated animals, and again, we have those for similar reasons to the mutated humans</li></ul><p>But <em>Gamma World</em> has almost unlimited freedom. You walk around with whatever weapons you want, exploring the mutated wasteland. And we definitely do not have that in this reality.</p><p><em>Paranoia </em>also had mutants, and occasionally the mutation could be useful, but more often than not it was a reason to be executed by the schizophrenic computer that ran the whole underground complex your unfortunate genetically modified clones found themselves in.</p><p>It also had various factions, communists, transhumanists, def leperd fans, and others, all vying for power and trying to eliminate every other faction. Layered over that was the nominal career of the player character which… you guessed it, was trying to out-do and survive all the others player characters. The game was so deadly that each character had six clones, as these died in spectacular fashion and often were executed by order of the all-powerful computer.</p><p>The premise of the game was that due to some catastrophic war, humans had gone underground into Alpha Complex where competing high level programmers all shoved their versions of utopia into the mainframe running things in the large underground Alpha Complex. This rendered the Computer essentially schizophrenic and paranoid, with ugly consequences for anyone that came into contact with it, which was daily due to the fact that the computer ran most of the complex. Reproduction was done exclusively by cloning and if a character started to develop normal feelings as a result of being off the hormone filled soylent green they were fed, it was a capital offence.</p><p>Well, we are not quite underground yet, but the totalitarian control under a schizophrenic “elite” who think they know best and to whom we are all subject to varying degrees is certainly coming at is fast. As is the war on anything and everything natural.</p></blockquote><p>I was more of a <em>Traveller </em>man myself, but I did own a set of the original <em>Gamma World</em> books even though I never had the opportunity to play it. I never read or played <em>Paranoia</em>, but based on the Kurgan’s description, it does appear that Clown World is headed squarely in that direction, with the exciting addition of a reality-defying demonic element.</p><p><em><a href=\"https://social.infogalactic.com/micropost/68bd53ff-8a68-42c1-93e7-a83635f9356a\">DISCUSS ON SG</a></em></p></div>",
  "content_text": "The Kurgan observes\nthe growing number of similarities\nbetween Clown World and two of the science fiction role-playing games of the early 1980s.\nGamma World\nhad:\nPurebloods (aka pure strain humans) and we have those.\nMutants, and we have those too now, thanks to the genetic serum murder juice, except in Gamma World at least most of the times they have some super-powers. While in this version they only het defects and most likely an early death.\nMutated animals, and again, we have those for similar reasons to the mutated humans\nBut\nGamma World\nhas almost unlimited freedom. You walk around with whatever weapons you want, exploring the mutated wasteland. And we definitely do not have that in this reality.\nParanoia\nalso had mutants, and occasionally the mutation could be useful, but more often than not it was a reason to be executed by the schizophrenic computer that ran the whole underground complex your unfortunate genetically modified clones found themselves in.\nIt also had various factions, communists, transhumanists, def leperd fans, and others, all vying for power and trying to eliminate every other faction. Layered over that was the nominal career of the player character which… you guessed it, was trying to out-do and survive all the others player characters. The game was so deadly that each character had six clones, as these died in spectacular fashion and often were executed by order of the all-powerful computer.\nThe premise of the game was that due to some catastrophic war, humans had gone underground into Alpha Complex where competing high level programmers all shoved their versions of utopia into the mainframe running things in the large underground Alpha Complex. This rendered the Computer essentially schizophrenic and paranoid, with ugly consequences for anyone that came into contact with it, which was daily due to the fact that the computer ran most of the complex. Reproduction was done exclusively by cloning and if a character started to develop normal feelings as a result of being off the hormone filled soylent green they were fed, it was a capital offence.\nWell, we are not quite underground yet, but the totalitarian control under a schizophrenic “elite” who think they know best and to whom we are all subject to varying degrees is certainly coming at is fast. As is the war on anything and everything natural.\nI was more of a\nTraveller\nman myself, but I did own a set of the original\nGamma World\nbooks even though I never had the opportunity to play it. I never read or played\nParanoia\n, but based on the Kurgan’s description, it does appear that Clown World is headed squarely in that direction, with the exciting addition of a reality-defying demonic element.\nDISCUSS ON SG",
  "tags": [
    "Clown World",
    "games"
  ],
  "categories": [],
  "sitemap_lastmod": "2023-05-31T11:46:53+00:00"
}