{
  "url": "https://voxday.net/2023/05/30/dont-talk-to-clown-world/",
  "scraped_at": "2026-01-08T13:58:21.129993",
  "title": "Don’t Talk to Clown World",
  "date_display": "May 30, 2023",
  "date_iso": "2023-05-30T15:20:05+00:00",
  "date_from_url": "2023-05-30",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>The Chinese have apparently decided that <a href=\"https://www.rt.com/news/577113-china-rebuffs-pentagon-meeting/\">there is no point in talking</a> to the United States. It would be reasonable to assume that they have reached the same conclusion as the Russians, which is that the governments of Clown World are agreement-incapable.</p><blockquote class=\"wp-block-quote is-layout-flow wp-block-quote-is-layout-flow\"><p>China has rejected Washington’s proposal that their respective defense chiefs meet this week, the Pentagon said on Monday. The news comes amid a renewed diplomatic spat between the two countries.</p><p>“Overnight, the PRC informed the US that they have declined our early May invitation for Secretary [Lloyd] Austin to meet with PRC Minister of National Defense Li Shangfu in Singapore,” the Pentagon said in a statement to the Wall Street Journal, referring to the People’s Republic of China.</p><p>“The Department believes strongly in the importance of maintaining open lines of military-to-military communication between Washington and Beijing to ensure that competition does not veer into conflict,” the statement read.</p><p>The WSJ cited an unnamed US defense official as saying that China’s dismissal was “an unusually blunt message.”</p><p>According to the report, the Pentagon had wanted the meeting to take place on the sidelines of the annual Shangri-La Dialogue security forum. Li will speak at the event as part of his trip to Singapore from May 31 to June 4, the Chinese Defense Ministry said. The Pentagon said last week that attempts to establish contacts with their Chinese counterparts in recent months have failed.</p></blockquote><p>The Great Bifurcation of the global economy continues apace.</p><p>Whether one is operating at the international, the professional, or the personal level, it makes absolutely no sense to talk to parties one knows to be dishonest. Once you permit any communication whatsoever with a liar, a gaslighter, or a manipulator, they will do their utmost to use literally <em>anything</em> you say against you in some way. Moreover, if you engage with them directly, they can invent your words out of thin air and turn the situation into a “he said, she said” scenario that leaves you in retreat and on the defensive no matter what you actually say. Any engagement is inherently disadvantageous.</p><p>Once you have determined that the other side is a bad actor, do not engage with them at all, ideally, not even to tell them you will not talk to them. But if it is necessary to RSVP, such as in the case of international diplomatic relations or formal invitations to family events, then simply checking “no” and refusing to provide any explanation whatsoever is the correct action. Remember, an explanation is an invitation to argue, and is itself a form of engagement and communication.</p><p>Note the way in which the Chinese a) declined a specific invitation to meet with the Secretary of Defense with “an unusually blunt message” and b) have not permitted the Pentagon to “establish contacts” at all. This is very wise, as it prevents the US propaganda machine from spinning the Chinese response due to the fact that there is nothing to spin.</p><p><em><a href=\"https://social.infogalactic.com/micropost/7bc8507b-3330-4a17-b6db-1e75a489855b\">DISCUSS ON SG</a></em></p></div>",
  "content_text": "The Chinese have apparently decided that\nthere is no point in talking\nto the United States. It would be reasonable to assume that they have reached the same conclusion as the Russians, which is that the governments of Clown World are agreement-incapable.\nChina has rejected Washington’s proposal that their respective defense chiefs meet this week, the Pentagon said on Monday. The news comes amid a renewed diplomatic spat between the two countries.\n“Overnight, the PRC informed the US that they have declined our early May invitation for Secretary [Lloyd] Austin to meet with PRC Minister of National Defense Li Shangfu in Singapore,” the Pentagon said in a statement to the Wall Street Journal, referring to the People’s Republic of China.\n“The Department believes strongly in the importance of maintaining open lines of military-to-military communication between Washington and Beijing to ensure that competition does not veer into conflict,” the statement read.\nThe WSJ cited an unnamed US defense official as saying that China’s dismissal was “an unusually blunt message.”\nAccording to the report, the Pentagon had wanted the meeting to take place on the sidelines of the annual Shangri-La Dialogue security forum. Li will speak at the event as part of his trip to Singapore from May 31 to June 4, the Chinese Defense Ministry said. The Pentagon said last week that attempts to establish contacts with their Chinese counterparts in recent months have failed.\nThe Great Bifurcation of the global economy continues apace.\nWhether one is operating at the international, the professional, or the personal level, it makes absolutely no sense to talk to parties one knows to be dishonest. Once you permit any communication whatsoever with a liar, a gaslighter, or a manipulator, they will do their utmost to use literally\nanything\nyou say against you in some way. Moreover, if you engage with them directly, they can invent your words out of thin air and turn the situation into a “he said, she said” scenario that leaves you in retreat and on the defensive no matter what you actually say. Any engagement is inherently disadvantageous.\nOnce you have determined that the other side is a bad actor, do not engage with them at all, ideally, not even to tell them you will not talk to them. But if it is necessary to RSVP, such as in the case of international diplomatic relations or formal invitations to family events, then simply checking “no” and refusing to provide any explanation whatsoever is the correct action. Remember, an explanation is an invitation to argue, and is itself a form of engagement and communication.\nNote the way in which the Chinese a) declined a specific invitation to meet with the Secretary of Defense with “an unusually blunt message” and b) have not permitted the Pentagon to “establish contacts” at all. This is very wise, as it prevents the US propaganda machine from spinning the Chinese response due to the fact that there is nothing to spin.\nDISCUSS ON SG",
  "tags": [
    "China"
  ],
  "categories": [],
  "sitemap_lastmod": "2023-05-30T15:22:41+00:00"
}