{
  "url": "https://voxday.net/2023/05/02/how-the-vaxx-causes-cancer/",
  "scraped_at": "2026-01-08T13:55:29.202631",
  "title": "How the Vaxx Causes Cancer",
  "date_display": "May 2, 2023",
  "date_iso": "2023-05-02T11:32:13+00:00",
  "date_from_url": "2023-05-02",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>And especially, why it is triggering pre-existing cancers that had previously been in remission. <a href=\"https://twitter.com/fseiichizb4/status/1651638404193595392\">Translated from Twitter</a>.</p><p><strong>Professor Murakami of Tokyo University of Science: </strong><em>Pfizer’s mRNA vaccine had plasmid DNA, so when I checked it, I was surprised to find the SV40 sequence. SV40 is a promoter of cancer viruses, and the presence of this sequence facilitates the translocation of DNA to the human nucleus. easier to enter the genome. Even though it’s a sequence that is completely unnecessary to make an mRNA vaccine. Why SV40?</em></p><p><strong>Trilliana 華</strong>: <em>The plasmid DNA map submitted by Pfizer to the EMA (European Medicines Agency) does not appear to include SV40. Why did you hide it? The contents of the plasmid DNA submitted to PMA by Pfizer (left) and the contents revealed this time (right). The double-enhanced SV40 promoter is completely absent from the declaration. Why did you deliberately insert the unnecessary cancer sequence twice? Why did you hide an important point that should never be overlooked?</em></p><div class=\"wp-block-image\"><figure class=\"aligncenter size-full\"><img alt=\"\" class=\"wp-image-57990\" decoding=\"async\" fetchpriority=\"high\" height=\"249\" sizes=\"(max-width: 512px) 100vw, 512px\" src=\"https://voxday.net/wp-content/uploads/2023/05/image.png\" srcset=\"https://voxday.net/wp-content/uploads/2023/05/image.png 512w, https://voxday.net/wp-content/uploads/2023/05/image-300x146.png 300w\" width=\"512\"/></figure></div><p>This appears to explain the explosive increase we are seeing in recurring cancers that are unusually aggressive and increasingly lethal, which are <a href=\"https://twitter.com/EthicalSkeptic/status/1648882315194519553\">up 20 percent</a> among the under-55 population since 2020. And unfortunately, the risks do not appear to be declining over time since the injections, although it is too soon to reach any conclusions on that score. It is therefore extremely important to encourage your vaccinated friends and family with a history of cancer to move up their checkup timelines, in order to give them a chance of catching a recurring cancer early enough to give them a chance of having it successfully treated again.</p><p>It’s worth noting that this information is broadly consistent with a leak from a purported Moderna engineer back in December 2020 on 4chan.</p><blockquote class=\"wp-block-quote is-layout-flow wp-block-quote-is-layout-flow\"><p>I’m an industrial engineer at Moderna and the other one of us is a process development engineer. I’m sure the same thing is happening with Pfizer-BioNTech. It was hard to put things together based on the small quantities of additions happening in manual step (highly unorthodox for a continuous process production). The explanation we got was highly sensitive trade secret adjuvants being added. Digging in deeper showed how sensitive it actually was.</p><p>Most people’s understanding of this novel vaccine type is that it works as follows:</p><ul class=\"wp-block-list\"><li>Make mRNA coding for S protein</li><li>Make lipid nanoparticle delivery system</li><li>Profit</li></ul><p>How it actually works from what we’ve uncovered.</p><ol class=\"wp-block-list\"><li>Make mRNA coding for S protein</li><li>Make mRNA coding for mutant versions of CYP19A1 and CDKN1B in smaller amounts</li><li>Make sure that while delivery system for (1) mostly ends up in liver, most of (2) ends up in the gonads</li><li>Make sure form and quantity of additive upregulating LINE-1 reverse transcription activity makes it hard to detect among legit adjuvants</li><li>Effects from (2) integrated by (4) are recessive: mildly oncogenic effects in vaccine recipients unlikely to be noticed for many years</li><li>(5) recessive but since most of population vaccinated, in next-generation female offspring have premature ovarian failure</li></ol><p>(6) coincides with poor people being obsoleted by Al and robotics, so we didn’t have to dig for motivation.</p></blockquote><p><strong>UPDATE: </strong>More detailed technical information <a href=\"https://anandamide.substack.com/p/sequencing-the-pfizer-monovalent\">on the sequencing</a> of the Pfizer mRNA vaccine.</p><p><em><a href=\"https://social.infogalactic.com/micropost/9b583d59-43ae-48ae-bfdc-b1a5fcdff197\">DISCUSS ON SG</a></em></p></div>",
  "content_text": "And especially, why it is triggering pre-existing cancers that had previously been in remission.\nTranslated from Twitter\n.\nProfessor Murakami of Tokyo University of Science:\nPfizer’s mRNA vaccine had plasmid DNA, so when I checked it, I was surprised to find the SV40 sequence. SV40 is a promoter of cancer viruses, and the presence of this sequence facilitates the translocation of DNA to the human nucleus. easier to enter the genome. Even though it’s a sequence that is completely unnecessary to make an mRNA vaccine. Why SV40?\nTrilliana 華\n:\nThe plasmid DNA map submitted by Pfizer to the EMA (European Medicines Agency) does not appear to include SV40. Why did you hide it? The contents of the plasmid DNA submitted to PMA by Pfizer (left) and the contents revealed this time (right). The double-enhanced SV40 promoter is completely absent from the declaration. Why did you deliberately insert the unnecessary cancer sequence twice? Why did you hide an important point that should never be overlooked?\nThis appears to explain the explosive increase we are seeing in recurring cancers that are unusually aggressive and increasingly lethal, which are\nup 20 percent\namong the under-55 population since 2020. And unfortunately, the risks do not appear to be declining over time since the injections, although it is too soon to reach any conclusions on that score. It is therefore extremely important to encourage your vaccinated friends and family with a history of cancer to move up their checkup timelines, in order to give them a chance of catching a recurring cancer early enough to give them a chance of having it successfully treated again.\nIt’s worth noting that this information is broadly consistent with a leak from a purported Moderna engineer back in December 2020 on 4chan.\nI’m an industrial engineer at Moderna and the other one of us is a process development engineer. I’m sure the same thing is happening with Pfizer-BioNTech. It was hard to put things together based on the small quantities of additions happening in manual step (highly unorthodox for a continuous process production). The explanation we got was highly sensitive trade secret adjuvants being added. Digging in deeper showed how sensitive it actually was.\nMost people’s understanding of this novel vaccine type is that it works as follows:\nMake mRNA coding for S protein\nMake lipid nanoparticle delivery system\nProfit\nHow it actually works from what we’ve uncovered.\nMake mRNA coding for S protein\nMake mRNA coding for mutant versions of CYP19A1 and CDKN1B in smaller amounts\nMake sure that while delivery system for (1) mostly ends up in liver, most of (2) ends up in the gonads\nMake sure form and quantity of additive upregulating LINE-1 reverse transcription activity makes it hard to detect among legit adjuvants\nEffects from (2) integrated by (4) are recessive: mildly oncogenic effects in vaccine recipients unlikely to be noticed for many years\n(5) recessive but since most of population vaccinated, in next-generation female offspring have premature ovarian failure\n(6) coincides with poor people being obsoleted by Al and robotics, so we didn’t have to dig for motivation.\nUPDATE:\nMore detailed technical information\non the sequencing\nof the Pfizer mRNA vaccine.\nDISCUSS ON SG",
  "tags": [
    "conspiracy",
    "science",
    "vaccines"
  ],
  "categories": [],
  "sitemap_lastmod": "2023-05-02T13:10:48+00:00"
}