{
  "url": "https://voxday.net/2023/05/13/like-the-lambada-only-math/",
  "scraped_at": "2026-01-08T13:56:35.969125",
  "title": "Like the Lambada, Only Math",
  "date_display": "May 13, 2023",
  "date_iso": "2023-05-13T17:12:51+00:00",
  "date_from_url": "2023-05-13",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>Forrest Bishop dares to go where few have gone before: <a href=\"https://www.scribd.com/document/320890002/The-Forbidden-Equation-i-qc#\">the Forbidden Equation!</a></p><blockquote class=\"wp-block-quote is-layout-flow wp-block-quote-is-layout-flow\"><p>There are two great branches of Physics, dating back centuries, called Mechanics and Electromagnetism, with the more recent Electrodynamics as a blending of the two. Mechanics is about billiard balls and roller coasters, buildings, rockets, and cars, stuff like that. Electromagnetism is about electricity &amp; magnetism, optics, radio, the juice that courses through your devices.</p><p>Mechanics has a few foundational, algebraic equations, <em>F = ma</em> (force equals mass times acceleration) is as close to its core as any. Everything to do with engineering moving machines is built on <em>F = ma</em>, all the airplanes, satellites, the works. And yet it’s just three little letters and an equal sign. It may seem like such a trifle, but it is arguably the most useful equation in the world, far more so than the famous <em>e = mc2</em> of Electrodynamics.</p><p>Electromagnetism has its foundational algebra, too, which precedes and enables all the fancy squiggles and Greek letters. There’s <em>F=kQlQ2/r2</em>, <em>P = FV</em>, and a few others. But there is one seemingly little trifle that sits right at its core, three little letters and an equal sign: <em><strong>i = qc</strong></em>. It plays a role similar to <em>F = ma</em>. being the condition precedent for Maxwell’s Equations, Quantum Electrodynamics, and the Standard Model. And it is arguably <em>the most Forbidden Equation</em> in the world.</p></blockquote><p>One gets the sense that Dan Brown could write an incredibly bad novel with a title like that. Frankly, I’m tempted…</p><p><em><a href=\"https://social.infogalactic.com/micropost/f41840d9-df1b-467e-9366-d22580ec7e8d\">DISCUSS ON SG</a></em></p></div>",
  "content_text": "Forrest Bishop dares to go where few have gone before:\nthe Forbidden Equation!\nThere are two great branches of Physics, dating back centuries, called Mechanics and Electromagnetism, with the more recent Electrodynamics as a blending of the two. Mechanics is about billiard balls and roller coasters, buildings, rockets, and cars, stuff like that. Electromagnetism is about electricity & magnetism, optics, radio, the juice that courses through your devices.\nMechanics has a few foundational, algebraic equations,\nF = ma\n(force equals mass times acceleration) is as close to its core as any. Everything to do with engineering moving machines is built on\nF = ma\n, all the airplanes, satellites, the works. And yet it’s just three little letters and an equal sign. It may seem like such a trifle, but it is arguably the most useful equation in the world, far more so than the famous\ne = mc2\nof Electrodynamics.\nElectromagnetism has its foundational algebra, too, which precedes and enables all the fancy squiggles and Greek letters. There’s\nF=kQlQ2/r2\n,\nP = FV\n, and a few others. But there is one seemingly little trifle that sits right at its core, three little letters and an equal sign:\ni = qc\n. It plays a role similar to\nF = ma\n. being the condition precedent for Maxwell’s Equations, Quantum Electrodynamics, and the Standard Model. And it is arguably\nthe most Forbidden Equation\nin the world.\nOne gets the sense that Dan Brown could write an incredibly bad novel with a title like that. Frankly, I’m tempted…\nDISCUSS ON SG",
  "tags": [
    "conspiracy",
    "media",
    "science"
  ],
  "categories": [],
  "sitemap_lastmod": "2023-05-13T17:12:53+00:00"
}