{
  "url": "https://voxday.net/2023/05/30/never-talk-to-the-media/",
  "scraped_at": "2026-01-08T13:58:19.674575",
  "title": "Never Talk to the Media",
  "date_display": "May 30, 2023",
  "date_iso": "2023-05-30T11:19:56+00:00",
  "date_from_url": "2023-05-30",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>A Washington Post reporter laments that more and more people are recognizing that the media is their self-appointed enemy and are <a href=\"https://twitter.com/farhip/status/1662262232443494405\">refusing to talk to them</a>.</p><blockquote class=\"wp-block-quote is-layout-flow wp-block-quote-is-layout-flow\"><p>Some people think it’s a good idea <em>not</em> to talk to reporters, that they’ll only make you look bad. Even if true (it’s mostly not), you give up any chance of making your case and countering any assumptions. The benefits are far greater than the risks.</p></blockquote><p>It’s an excellent idea to <em><span style=\"text-decoration: underline;\">not</span></em> talk to reporters. There is absolutely no point in attempting to “make your case” and “counter any assumptions”, since the reporter is going to write the story from the perspective that the editor assigned him regardless of what you tell him. They use a massive bag of rhetorical tricks to undermine what you say in contradiction to their narrative, ranging from “X claimed”  to “(real name: X)”, all of which are consciously designed to make what you say appear false and thereby bolster their narrative.</p><p>But it is interesting that enough people are refusing to talk to reporters that it is making their job more difficult and reducing the credibility of their stories for lack of actual sources. A number of those who responded on Twitter called the reporter out on his assumptions.</p><p><em>This is an exceedingly optimistic assumption of good faith on the part of reporters, my friend.</em></p><p><em>That there seems to be a sort of unintentional admission in your tweet escapes no one.</em></p><p>To which the reporter responded in characteristically dishonest terms.</p><blockquote class=\"wp-block-quote is-layout-flow wp-block-quote-is-layout-flow\"><p>Yes, and widely misunderstood, too. My comment about “assumptions” is about the would-be source, not the reporter. If the <em>source</em> assumes the reporter has a distorted understanding or will get something wrong, talking to him/her might clear that up. This happened to me lately where a bunch of people banded together to see to it that sources wouldn’t talk to me for my reporting, thinking this would punish me. But it only meant that they silenced themselves and their voices could not be heard in my reporting.</p></blockquote><p>No, talking to a reporter will NEVER clear up their distorted understandings. Never, ever, ever. The only thing the inclusion of your voice will provide them with is a target and evidence for their manufactured indictments. And he’s not fooling those who have engaged with him.</p><p><em>You silence us anyway. Far better not to talk to you so our words can’t be twisted.</em></p><p>Exactly. On a not-entirely-unrelated note, the criminal trial for one of the reporters who published the most recent hit piece on me will begin in July. Contrary to their assumptions, reporters are not above the law. Never talk to them. Never respond to their texts or emails, not even to tell them “I won’t talk to you.” Nothing good will ever come of any engagement with the media.</p><p><em><a href=\"https://social.infogalactic.com/micropost/e9b9f96b-01a6-4ccc-a69a-08c6cf01cc3a\">DISCUSS ON SG</a></em></p></div>",
  "content_text": "A Washington Post reporter laments that more and more people are recognizing that the media is their self-appointed enemy and are\nrefusing to talk to them\n.\nSome people think it’s a good idea\nnot\nto talk to reporters, that they’ll only make you look bad. Even if true (it’s mostly not), you give up any chance of making your case and countering any assumptions. The benefits are far greater than the risks.\nIt’s an excellent idea to\nnot\ntalk to reporters. There is absolutely no point in attempting to “make your case” and “counter any assumptions”, since the reporter is going to write the story from the perspective that the editor assigned him regardless of what you tell him. They use a massive bag of rhetorical tricks to undermine what you say in contradiction to their narrative, ranging from “X claimed”  to “(real name: X)”, all of which are consciously designed to make what you say appear false and thereby bolster their narrative.\nBut it is interesting that enough people are refusing to talk to reporters that it is making their job more difficult and reducing the credibility of their stories for lack of actual sources. A number of those who responded on Twitter called the reporter out on his assumptions.\nThis is an exceedingly optimistic assumption of good faith on the part of reporters, my friend.\nThat there seems to be a sort of unintentional admission in your tweet escapes no one.\nTo which the reporter responded in characteristically dishonest terms.\nYes, and widely misunderstood, too. My comment about “assumptions” is about the would-be source, not the reporter. If the\nsource\nassumes the reporter has a distorted understanding or will get something wrong, talking to him/her might clear that up. This happened to me lately where a bunch of people banded together to see to it that sources wouldn’t talk to me for my reporting, thinking this would punish me. But it only meant that they silenced themselves and their voices could not be heard in my reporting.\nNo, talking to a reporter will NEVER clear up their distorted understandings. Never, ever, ever. The only thing the inclusion of your voice will provide them with is a target and evidence for their manufactured indictments. And he’s not fooling those who have engaged with him.\nYou silence us anyway. Far better not to talk to you so our words can’t be twisted.\nExactly. On a not-entirely-unrelated note, the criminal trial for one of the reporters who published the most recent hit piece on me will begin in July. Contrary to their assumptions, reporters are not above the law. Never talk to them. Never respond to their texts or emails, not even to tell them “I won’t talk to you.” Nothing good will ever come of any engagement with the media.\nDISCUSS ON SG",
  "tags": [
    "media"
  ],
  "categories": [],
  "sitemap_lastmod": "2023-05-30T11:21:07+00:00"
}