{
  "url": "https://voxday.net/2023/05/13/not-the-next-ukraine/",
  "scraped_at": "2026-01-08T13:56:34.108123",
  "title": "Not the Next Ukraine",
  "date_display": "May 13, 2023",
  "date_iso": "2023-05-13T14:20:17+00:00",
  "date_from_url": "2023-05-13",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>Taiwan makes it clear that it has no intention of permitting Clown World <a href=\"https://archive.ph/cPFoB#selection-1203.23-1223.254\">to sacrifice it</a> in the name of containing or deterring China.</p><blockquote class=\"wp-block-quote is-layout-flow wp-block-quote-is-layout-flow\"><p>Taiwan Minister of National Defense Chiu Kuo-cheng (邱國正) on Monday said that the armed forces would not tolerate the destruction of any Taiwanese facility, in response to a suggestion by U.S. Congressman Seth Moulton that the U.S. should warn China that it would “blow up” Taiwan Semiconductor Manufacturing Co. (TSMC) if it attacked Taiwan.</p><p>At a conference organized by the California-based think tank Milken Institute in May, Moulton was asked what deterrence effect U.S. chip policy could have on China, to which he responded, “the U.S. should make it very clear to the Chinese that if you invade Taiwan, we’re going to blow up TSMC.” U.S. defense policy advisor and former government official Michele Flournoy quickly countered his remark, saying that if TSMC was destroyed, there would be a “two trillion dollar impact on the global economy within the first year” and “you’d put manufacturing around the world at a standstill.”</p><p>Before a session of the Legislative Yuan on Monday, Chiu was asked by the media to comment on Moulton’s statement. Chiu said that anyone who wants to bomb any facility in Taiwan, regardless of whether it is meant for defensive purposes, has exceeded defense norms, reported <em>Liberty Times</em>. The defense minister said that the armed forces are responsible for defending Taiwan and its people, materials, and strategic resources. Therefore, “if they want to bomb this or that,” the armed forces will not tolerate this kind of situation, Chiu said.</p></blockquote><p>It’s very much for the good of the people of Taiwan island that their leadership is taking this stand. No doubt they’ve seen what the foreign leadership of Ukraine has done to the people of Ukraine, and even the most rabid proponent of independence would prefer reunification to that.</p><p>I still anticipate that the reunification of Taiwan with the mainland will eventually be as peaceful as the reunification of Hong Kong proved to be. Sure, there will be protests and much criticism from the globalist media, but ultimately, it should be possible for both Chinese parties to accomplish the inevitable without war or even violence.</p><p><em><a href=\"https://social.infogalactic.com/micropost/f066aa31-b094-4d6c-9dd5-8578ecdd8512\">DISCUSS ON SG</a></em></p></div>",
  "content_text": "Taiwan makes it clear that it has no intention of permitting Clown World\nto sacrifice it\nin the name of containing or deterring China.\nTaiwan Minister of National Defense Chiu Kuo-cheng (邱國正) on Monday said that the armed forces would not tolerate the destruction of any Taiwanese facility, in response to a suggestion by U.S. Congressman Seth Moulton that the U.S. should warn China that it would “blow up” Taiwan Semiconductor Manufacturing Co. (TSMC) if it attacked Taiwan.\nAt a conference organized by the California-based think tank Milken Institute in May, Moulton was asked what deterrence effect U.S. chip policy could have on China, to which he responded, “the U.S. should make it very clear to the Chinese that if you invade Taiwan, we’re going to blow up TSMC.” U.S. defense policy advisor and former government official Michele Flournoy quickly countered his remark, saying that if TSMC was destroyed, there would be a “two trillion dollar impact on the global economy within the first year” and “you’d put manufacturing around the world at a standstill.”\nBefore a session of the Legislative Yuan on Monday, Chiu was asked by the media to comment on Moulton’s statement. Chiu said that anyone who wants to bomb any facility in Taiwan, regardless of whether it is meant for defensive purposes, has exceeded defense norms, reported\nLiberty Times\n. The defense minister said that the armed forces are responsible for defending Taiwan and its people, materials, and strategic resources. Therefore, “if they want to bomb this or that,” the armed forces will not tolerate this kind of situation, Chiu said.\nIt’s very much for the good of the people of Taiwan island that their leadership is taking this stand. No doubt they’ve seen what the foreign leadership of Ukraine has done to the people of Ukraine, and even the most rabid proponent of independence would prefer reunification to that.\nI still anticipate that the reunification of Taiwan with the mainland will eventually be as peaceful as the reunification of Hong Kong proved to be. Sure, there will be protests and much criticism from the globalist media, but ultimately, it should be possible for both Chinese parties to accomplish the inevitable without war or even violence.\nDISCUSS ON SG",
  "tags": [
    "China",
    "war"
  ],
  "categories": [],
  "sitemap_lastmod": "2023-05-13T14:20:18+00:00"
}