{
  "url": "https://voxday.net/2023/05/01/not-alarmist-avante-garde/",
  "scraped_at": "2026-01-08T13:55:21.866477",
  "title": "Not Alarmist, Avante Garde",
  "date_display": "May 1, 2023",
  "date_iso": "2023-05-01T10:10:14+00:00",
  "date_from_url": "2023-05-01",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>An anon at AC’s site has begun to conclude that I might have known what I was talking about when I pointed out the satanic roots of the Enlightenment “freedoms”.</p><blockquote class=\"wp-block-quote is-layout-flow wp-block-quote-is-layout-flow\"><p>Freedom of speech is gone. Freedom of the press is gone. Freedom of religion is gone. I used to think Vox was an alarmist when he claimed those “freedoms” were actually anti-Christian tactics concocted by Satanic “Enlightenment” thinkers to destroy Christianity. Except it looks like he is right.</p><p>I wonder if 9/11 had multiple purposes. Maybe Iraq was a sideshow meant to distract us as they accomplished their true goals: the creation of Homeland Security, the Patriot Act, increased domestic surrlveillance, the ruining of air travel, and so on.</p><p>Once they got that in place, they began banning speech, first as hate crime, then as “disinformation,” now as “Putin propaganda.” No matter what you call it, freedom of speech is on its way out. Freedom of the press is based on freedom of speech and now reporting the wrong thing gets you thrown off media and potentially arrested. How about freedom of assembly or freedom of religion? On their way out. COVID showed the sham of both. The Oregon decision to forbid a Christian woman from adopting or fostering children, on account of her religion, and the closing of churches, but not BLM rallies, during COVID are data points on the destruction of those so called freedom.</p><p>So if you realize all this, and you are a Christian, then what would keep you from instituting mandatory Christianity? After all, if there is no freedom of religion, then what would you prefer, child raping, child sacrificing Satanists ruling this area; or the child protecting Christians who built the European and North American civilization that is quickly being destroyed before your eyes?</p></blockquote><p>Putin has figured this out. Wang Hunin and Xi Xinping have figured this out. The Elightenment concepts of “democracy”, “human rights”, and “freedoms” that have been used to establish and expand the liberal world order are not only lies, they are collectively one gigantic satanic trap for a nation. They are a means of transforming a society of men seeking honor, glory, and righteousness into a society of weak, pleasure-seeking lotus-eaters.</p><blockquote class=\"wp-block-quote is-layout-flow wp-block-quote-is-layout-flow\"><p>Increasingly commercial societies would be more liberal both at home and abroad. Their citizens would seek prosperity and comfort and abandon the atavistic passions, the struggles for honor and glory, and the tribal hatreds that had produced conflict throughout history. The ancient Greeks believed that embedded in human nature was something called <em>thumos</em>, a spiritedness and ferocity in defense of clan, tribe, city, or state. In the Enlightenment view, however, commerce would tame and perhaps even eliminate <em>thumos</em> in people and in nations.</p> <cite><em>The Return of History and the End of Dreams, Robert Kagan</em></cite></blockquote><p>Individual freedom is not the <em>sine qua non</em> of human existence or human society. And contrary to the Enlightenment propagandists, neither individual wealth nor national economic growth are the supreme metric that merit government prioritization. To the contrary, they are temptations meant to sap the spirit and morals of the nation.</p><p><em><a href=\"https://social.infogalactic.com/micropost/1fecc9c6-85bf-4c84-ad2d-ca506b9bc9d0\">DISCUSS ON SG</a></em></p></div>",
  "content_text": "An anon at AC’s site has begun to conclude that I might have known what I was talking about when I pointed out the satanic roots of the Enlightenment “freedoms”.\nFreedom of speech is gone. Freedom of the press is gone. Freedom of religion is gone. I used to think Vox was an alarmist when he claimed those “freedoms” were actually anti-Christian tactics concocted by Satanic “Enlightenment” thinkers to destroy Christianity. Except it looks like he is right.\nI wonder if 9/11 had multiple purposes. Maybe Iraq was a sideshow meant to distract us as they accomplished their true goals: the creation of Homeland Security, the Patriot Act, increased domestic surrlveillance, the ruining of air travel, and so on.\nOnce they got that in place, they began banning speech, first as hate crime, then as “disinformation,” now as “Putin propaganda.” No matter what you call it, freedom of speech is on its way out. Freedom of the press is based on freedom of speech and now reporting the wrong thing gets you thrown off media and potentially arrested. How about freedom of assembly or freedom of religion? On their way out. COVID showed the sham of both. The Oregon decision to forbid a Christian woman from adopting or fostering children, on account of her religion, and the closing of churches, but not BLM rallies, during COVID are data points on the destruction of those so called freedom.\nSo if you realize all this, and you are a Christian, then what would keep you from instituting mandatory Christianity? After all, if there is no freedom of religion, then what would you prefer, child raping, child sacrificing Satanists ruling this area; or the child protecting Christians who built the European and North American civilization that is quickly being destroyed before your eyes?\nPutin has figured this out. Wang Hunin and Xi Xinping have figured this out. The Elightenment concepts of “democracy”, “human rights”, and “freedoms” that have been used to establish and expand the liberal world order are not only lies, they are collectively one gigantic satanic trap for a nation. They are a means of transforming a society of men seeking honor, glory, and righteousness into a society of weak, pleasure-seeking lotus-eaters.\nIncreasingly commercial societies would be more liberal both at home and abroad. Their citizens would seek prosperity and comfort and abandon the atavistic passions, the struggles for honor and glory, and the tribal hatreds that had produced conflict throughout history. The ancient Greeks believed that embedded in human nature was something called\nthumos\n, a spiritedness and ferocity in defense of clan, tribe, city, or state. In the Enlightenment view, however, commerce would tame and perhaps even eliminate\nthumos\nin people and in nations.\nThe Return of History and the End of Dreams, Robert Kagan\nIndividual freedom is not the\nsine qua non\nof human existence or human society. And contrary to the Enlightenment propagandists, neither individual wealth nor national economic growth are the supreme metric that merit government prioritization. To the contrary, they are temptations meant to sap the spirit and morals of the nation.\nDISCUSS ON SG",
  "tags": [
    "Clown World",
    "economics",
    "history",
    "mailvox"
  ],
  "categories": [],
  "sitemap_lastmod": "2023-05-01T10:10:16+00:00"
}