{
  "url": "https://voxday.net/2023/05/09/the-construction-of-a-criminal/",
  "scraped_at": "2026-01-08T13:56:10.404101",
  "title": "The Construction of a Criminal",
  "date_display": "May 9, 2023",
  "date_iso": "2023-05-09T10:09:23+00:00",
  "date_from_url": "2023-05-09",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>Sundance chronicles how the Deep State, in combination with Big Tech, is constructing false records in order <a href=\"https://archive.is/Yn5lj\">to concoct false crimes</a> supposedly committed by individuals it wishes to target.</p><blockquote class=\"wp-block-quote is-layout-flow wp-block-quote-is-layout-flow\"><p>I was never in Washington DC on January 6, 2021, nor did I work with or communicate with anyone who was involved in any of the activities that are subject to the J6 committee investigative authority.</p><p>I’m going to skip a lot of background noise, irrelevant legal stuff, jurisdictional issues, discoveries from discussions with lawyers and the experience gained in association with this ridiculous subpoena. I am going to focus on the biggest story within it.</p><p>Sticking to the information in the Red Box above, notice how the J6 committee has evidence, “public-source information and documents on file”, showing my participation, communication, and contact with people and technology that are material interests to the committee.</p><p>Here’s the kicker…. I had no clue what the hell they were talking about. There’s not a single aspect of their outline that I had any knowledge or connection of.</p><p>I had no idea what Zello was. I had no idea who 1% watchdog might be. I had never heard of “Stop the Steal J6” or associated “channel.” I had never heard of the person redacted, and I had never communicated with any Oath Keeper, any communication system, or platform, or anyone or anything – nothing – that is outlined in that subpoena.</p><p>Those points of evidence outlined in the subpoena had no connection to me at all.</p><p>The subpoena might as well have been asking me to appear in Michigan because my Red Ferrari was involved in a hit and run accident, during my trip to Detroit. I don’t own a Ferrari; I have never been to Michigan; I certainly never had an accident; I wasn’t on a trip and have never visited Detroit. The entire construct of their probable cause for the subpoena was silly. Complete and utter nonsense.</p><p>That said, how could there be “public records” and “documentary” evidence of something that never happened?</p><p>At first, I thought this was some silly case of mistaken identity and they just sent a subpoena to the wrong person. However, the investigators were adamant the evidence existed, and the need for testimony was required. After taking advice from several smart people, and after discovering the costs associated with just the reply to the committee and/or representation therein; suddenly I realized there might be more value for me in this subpoena than the committee. After all, how can there be public-records and documents that I own a red Ferrari and went to Michigan when I don’t and never did.</p><p>After several back and forths I discovered, through their admissions of their own research, and through documents they extracted as an outcome of their tasks to prove the merit of their claims, that someone <em>inside</em> Twitter had created a fictitious identity of me associated with the networks and communications as the investigators described them.</p></blockquote><p>Here is one obvious application for AI, which is to create fake shadow accounts that provide a false record of criminal activity. It will then be up to the accused to prove that he did not do what the record shows that he did.</p><p>This is yet another reason to stay off the converged platforms. It’s much easier to prove you never had an account with a platform if you never interacted with it in any way, shape or form than if you were utilizing it on a regular basis.</p><p><em><a href=\"https://social.infogalactic.com/micropost/c20ba6ca-88fc-4e65-b884-16d1a99cb4e1\">DISCUSS ON SG</a></em></p></div>",
  "content_text": "Sundance chronicles how the Deep State, in combination with Big Tech, is constructing false records in order\nto concoct false crimes\nsupposedly committed by individuals it wishes to target.\nI was never in Washington DC on January 6, 2021, nor did I work with or communicate with anyone who was involved in any of the activities that are subject to the J6 committee investigative authority.\nI’m going to skip a lot of background noise, irrelevant legal stuff, jurisdictional issues, discoveries from discussions with lawyers and the experience gained in association with this ridiculous subpoena. I am going to focus on the biggest story within it.\nSticking to the information in the Red Box above, notice how the J6 committee has evidence, “public-source information and documents on file”, showing my participation, communication, and contact with people and technology that are material interests to the committee.\nHere’s the kicker…. I had no clue what the hell they were talking about. There’s not a single aspect of their outline that I had any knowledge or connection of.\nI had no idea what Zello was. I had no idea who 1% watchdog might be. I had never heard of “Stop the Steal J6” or associated “channel.” I had never heard of the person redacted, and I had never communicated with any Oath Keeper, any communication system, or platform, or anyone or anything – nothing – that is outlined in that subpoena.\nThose points of evidence outlined in the subpoena had no connection to me at all.\nThe subpoena might as well have been asking me to appear in Michigan because my Red Ferrari was involved in a hit and run accident, during my trip to Detroit. I don’t own a Ferrari; I have never been to Michigan; I certainly never had an accident; I wasn’t on a trip and have never visited Detroit. The entire construct of their probable cause for the subpoena was silly. Complete and utter nonsense.\nThat said, how could there be “public records” and “documentary” evidence of something that never happened?\nAt first, I thought this was some silly case of mistaken identity and they just sent a subpoena to the wrong person. However, the investigators were adamant the evidence existed, and the need for testimony was required. After taking advice from several smart people, and after discovering the costs associated with just the reply to the committee and/or representation therein; suddenly I realized there might be more value for me in this subpoena than the committee. After all, how can there be public-records and documents that I own a red Ferrari and went to Michigan when I don’t and never did.\nAfter several back and forths I discovered, through their admissions of their own research, and through documents they extracted as an outcome of their tasks to prove the merit of their claims, that someone\ninside\nTwitter had created a fictitious identity of me associated with the networks and communications as the investigators described them.\nHere is one obvious application for AI, which is to create fake shadow accounts that provide a false record of criminal activity. It will then be up to the accused to prove that he did not do what the record shows that he did.\nThis is yet another reason to stay off the converged platforms. It’s much easier to prove you never had an account with a platform if you never interacted with it in any way, shape or form than if you were utilizing it on a regular basis.\nDISCUSS ON SG",
  "tags": [
    "Clown World",
    "conspiracy",
    "technology"
  ],
  "categories": [],
  "sitemap_lastmod": "2023-05-09T11:26:20+00:00"
}