{
  "url": "https://voxday.net/2023/05/21/the-battle-for-bakhmut-is-over/",
  "scraped_at": "2026-01-08T13:57:22.513213",
  "title": "The Battle for Bakhmut is Over",
  "date_display": "May 21, 2023",
  "date_iso": "2023-05-21T10:00:39+00:00",
  "date_from_url": "2023-05-21",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>One year after Russian forces reclaimed Mariupol, they have expelled the forces of the Kiev regime from Bakhmut. As Simplicius notes <a href=\"https://simplicius76.substack.com/p/sitrep-52023-bakhmut-falls-artemovsk\">in his most recent sitrep</a>, the frantic retroactive denial of the city’s importance, contradicting all the previous posturing of Zelensky and his globalist backers, has begun in earnest, thereby underlining the veracity of the Russian assertions.</p><blockquote class=\"wp-block-quote is-layout-flow wp-block-quote-is-layout-flow\"><p>None of the tricks worked. All the endless distractions, diversions, deflections, and myriad attempts to pry our eyes from the inevitable, massive humiliation for NATO forces in Bakhmut—or is it Artemovsk now?—using every tool in their possession, from diversionary strikes on civilians on Russian border towns, to outright political assassination to steal headlines and steer public attention: none of it worked.</p><p>Bakhmut today has fallen on the exact one year anniversary of the fall of Mariupol on May 20th, 2022. And not surprisingly, the posture adopted by the UA supporters is the same exact energy as before: cringe, cope, excuse-making. “Bakhmut’s mission is accomplished,” they say, swallowing sobs.</p></blockquote><p>It’s a long article, but the most interesting part to me is the connection he draws between the talk of the expedited delivery of F-16s to Ukraine and the anticipation of the failure, or even the nonexistence, of the Ukrainian spring offensive that is supposed to justify continued support for the Kiev regime in the West. It is very apparent that support for Kiev is faltering everywhere from Berlin to Washington, even as support for Russia is growing <a href=\"https://www.rt.com/russia/576638-russia-muslim-countries-sanctions/\">across Africa and Araby</a>.</p><p>But while Clown World’s realists are looking for a negotiated exit which may or may not be possible, the neoclowns who started the whole thing are as rabidly aggressive as ever. Hence the F-16 gambit, which has been dreamed up to provide the basis for an argument in favor of Ukraine’s eventual success after the inevitable failure of the UFA “offensive” becomes undeniable in August or September.</p><p>However, I’d be remiss if I didn’t note Simplicius’s observations on the incapacitation of the Commander-in-Chief of the Armed Forces of Ukraine, Valerii Zaluzhnyi, who was seriously wounded on May 8th during a visit to a command post by a Russian missile. The fact that the deputy Minister of Defense for the Kiev regime is now talking openly about the possibility that Russia “intends to assassinate” Zaluzhnyi strongly implies that the wound was fatal and he is already out of the picture.</p><p>While Ukraine has other generals, the fact that the UFA’s Commander-in-Chief has been taken off the board will likely factor in to the eventual decision of various countries like France and Germany to throw in the towel sooner rather than later. There was never any significant desire for war with Russia on the part of any European country outside of Poland and the UK, and what little there was is gone in the aftermath of Russia’s relentless string of victories on the military, economic, and diplomatic fronts.</p><p>Anyhow, read the whole thing for a much more realistic perspective on the current situation than you will read in any mainstream media publication.</p><p><em><a href=\"https://social.infogalactic.com/micropost/6f5065e5-c73e-4aa8-9260-7a9d78ab2cdc\">DISCUSS ON SG</a></em></p></div>",
  "content_text": "One year after Russian forces reclaimed Mariupol, they have expelled the forces of the Kiev regime from Bakhmut. As Simplicius notes\nin his most recent sitrep\n, the frantic retroactive denial of the city’s importance, contradicting all the previous posturing of Zelensky and his globalist backers, has begun in earnest, thereby underlining the veracity of the Russian assertions.\nNone of the tricks worked. All the endless distractions, diversions, deflections, and myriad attempts to pry our eyes from the inevitable, massive humiliation for NATO forces in Bakhmut—or is it Artemovsk now?—using every tool in their possession, from diversionary strikes on civilians on Russian border towns, to outright political assassination to steal headlines and steer public attention: none of it worked.\nBakhmut today has fallen on the exact one year anniversary of the fall of Mariupol on May 20th, 2022. And not surprisingly, the posture adopted by the UA supporters is the same exact energy as before: cringe, cope, excuse-making. “Bakhmut’s mission is accomplished,” they say, swallowing sobs.\nIt’s a long article, but the most interesting part to me is the connection he draws between the talk of the expedited delivery of F-16s to Ukraine and the anticipation of the failure, or even the nonexistence, of the Ukrainian spring offensive that is supposed to justify continued support for the Kiev regime in the West. It is very apparent that support for Kiev is faltering everywhere from Berlin to Washington, even as support for Russia is growing\nacross Africa and Araby\n.\nBut while Clown World’s realists are looking for a negotiated exit which may or may not be possible, the neoclowns who started the whole thing are as rabidly aggressive as ever. Hence the F-16 gambit, which has been dreamed up to provide the basis for an argument in favor of Ukraine’s eventual success after the inevitable failure of the UFA “offensive” becomes undeniable in August or September.\nHowever, I’d be remiss if I didn’t note Simplicius’s observations on the incapacitation of the Commander-in-Chief of the Armed Forces of Ukraine, Valerii Zaluzhnyi, who was seriously wounded on May 8th during a visit to a command post by a Russian missile. The fact that the deputy Minister of Defense for the Kiev regime is now talking openly about the possibility that Russia “intends to assassinate” Zaluzhnyi strongly implies that the wound was fatal and he is already out of the picture.\nWhile Ukraine has other generals, the fact that the UFA’s Commander-in-Chief has been taken off the board will likely factor in to the eventual decision of various countries like France and Germany to throw in the towel sooner rather than later. There was never any significant desire for war with Russia on the part of any European country outside of Poland and the UK, and what little there was is gone in the aftermath of Russia’s relentless string of victories on the military, economic, and diplomatic fronts.\nAnyhow, read the whole thing for a much more realistic perspective on the current situation than you will read in any mainstream media publication.\nDISCUSS ON SG",
  "tags": [
    "Russia",
    "war"
  ],
  "categories": [],
  "sitemap_lastmod": "2023-05-21T12:34:02+00:00"
}