{
  "url": "https://voxday.net/2023/05/07/the-clowns-know-collapse-is-nigh/",
  "scraped_at": "2026-01-08T13:55:57.854644",
  "title": "The Clowns Know Collapse is Nigh",
  "date_display": "May 7, 2023",
  "date_iso": "2023-05-07T11:16:00+00:00",
  "date_from_url": "2023-05-07",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>Whether you read Clown World’s intellectuals, pay attention to the statements by its military leaders, or read the statements by its economic directors, the one thing that is very clear is that all of the leading clowns are highly aware of the probability that Clown World is going to collapse, most likely in a sudden and catastrophic manner. What’s fascinating is the way in which <a href=\"https://www.rt.com/business/575772-imf-world-split-rival-blocs/\">they have literally nothing to offer</a> in response to the situation except bromides about “cooperation” and pathetic appeals to “working together” at a time when the rest of the world has all but openly declared war on the new liberal rules-based democratic world order, or whatever it is calling itself today.</p><blockquote class=\"wp-block-quote is-layout-flow wp-block-quote-is-layout-flow\"><p>The managing director of the International Monetary Fund (IMF) has warned that the world is on the edge of geo-economic fragmentation, which she believes could add more “cold water” to already anemic global growth. Speaking by video-link at the Brussels Economic Forum on Wednesday, Kristalina Georgieva called for cooperation at a time when growth across the globe is extremely weak by historical standards.</p><p>“After decades of increasing global integration, there is a growing risk that the world may split into rival economic blocs,” the IMF chief said. “And that’s a scenario that would be bad for everyone, including for people in Europe.”</p><p>She warned that growth prospects were increasingly bleak at a time when the global outlook is weak both in the near and medium term. The IMF projects growth to remain around 3% over the next five years, the lowest medium-term forecast in more than three decades.</p><p>“And yet, central bankers cannot take their eyes off the ball until stubborn inflation is firmly under control,” Georgieva pointed out. “The required monetary tightening is weighing on growth and exposing some financial vulnerabilities.”</p><p>Reviving multilateral cooperation is vital for long-term growth everywhere, according to the official, who warned that trade fragmentation could cost up to 7% to the global economy in the long term. That’s “roughly equivalent to the combined annual output of Germany and Japan,” she said, adding that some nations could see GDP losses of up to 12% if technological decoupling is added.</p></blockquote><p>I expect that the economies of the occupied West are going to shrink considerably more than 12 percent. Remember, in the Great Depression, “industrial production in the United States declined 47 percent and real gross domestic product (GDP) fell 30 percent.” And this is a bigger, more permanent contraction that has been underway since 2008, so a peak-to-trough decline of around 50 percent would not be out of line.</p><p>The reality is that we will probably never know the true extent of the economic contraction in the USA, because a) the statistics are as fake and gay as everything else in Clown World and b) the USA is not going to survive as a unitary political entity so no one will be calculating the relevant statistics required for the comparison.</p><p><em><a href=\"https://social.infogalactic.com/micropost/307d9b97-7abe-4d8f-815b-2c0ba69aed97\">DISCUSS ON SG</a></em></p></div>",
  "content_text": "Whether you read Clown World’s intellectuals, pay attention to the statements by its military leaders, or read the statements by its economic directors, the one thing that is very clear is that all of the leading clowns are highly aware of the probability that Clown World is going to collapse, most likely in a sudden and catastrophic manner. What’s fascinating is the way in which\nthey have literally nothing to offer\nin response to the situation except bromides about “cooperation” and pathetic appeals to “working together” at a time when the rest of the world has all but openly declared war on the new liberal rules-based democratic world order, or whatever it is calling itself today.\nThe managing director of the International Monetary Fund (IMF) has warned that the world is on the edge of geo-economic fragmentation, which she believes could add more “cold water” to already anemic global growth. Speaking by video-link at the Brussels Economic Forum on Wednesday, Kristalina Georgieva called for cooperation at a time when growth across the globe is extremely weak by historical standards.\n“After decades of increasing global integration, there is a growing risk that the world may split into rival economic blocs,” the IMF chief said. “And that’s a scenario that would be bad for everyone, including for people in Europe.”\nShe warned that growth prospects were increasingly bleak at a time when the global outlook is weak both in the near and medium term. The IMF projects growth to remain around 3% over the next five years, the lowest medium-term forecast in more than three decades.\n“And yet, central bankers cannot take their eyes off the ball until stubborn inflation is firmly under control,” Georgieva pointed out. “The required monetary tightening is weighing on growth and exposing some financial vulnerabilities.”\nReviving multilateral cooperation is vital for long-term growth everywhere, according to the official, who warned that trade fragmentation could cost up to 7% to the global economy in the long term. That’s “roughly equivalent to the combined annual output of Germany and Japan,” she said, adding that some nations could see GDP losses of up to 12% if technological decoupling is added.\nI expect that the economies of the occupied West are going to shrink considerably more than 12 percent. Remember, in the Great Depression, “industrial production in the United States declined 47 percent and real gross domestic product (GDP) fell 30 percent.” And this is a bigger, more permanent contraction that has been underway since 2008, so a peak-to-trough decline of around 50 percent would not be out of line.\nThe reality is that we will probably never know the true extent of the economic contraction in the USA, because a) the statistics are as fake and gay as everything else in Clown World and b) the USA is not going to survive as a unitary political entity so no one will be calculating the relevant statistics required for the comparison.\nDISCUSS ON SG",
  "tags": [
    "Clown World",
    "decline and fall",
    "economics"
  ],
  "categories": [],
  "sitemap_lastmod": "2023-05-07T11:16:02+00:00"
}