{
  "url": "https://voxday.net/2023/05/14/the-treason-interview/",
  "scraped_at": "2026-01-08T13:56:44.991231",
  "title": "The Treason Interview",
  "date_display": "May 14, 2023",
  "date_iso": "2023-05-14T21:46:42+00:00",
  "date_from_url": "2023-05-14",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p><em>The Washington Post</em> omitted significant sections of its recent interview with Vladimir Zelensky. <a href=\"https://www.rt.com/russia/576285-wapo-zelensky-deleted-interview/\">From <em>Russia Today</em></a>:</p><blockquote class=\"wp-block-quote is-layout-flow wp-block-quote-is-layout-flow\"><p>The Washington Post has deleted a large tract of an interview with Ukrainian President Vladimir Zelensky in which he lashed out at alleged “traitors” in his ranks. RT is publishing the entire section that the US newspaper would rather keep hidden.</p><p>The following section appeared in an interview with the Ukrainian president published on Saturday. By Sunday it had been removed with no explanation. After discussing a trove of recently leaked Pentagon documents, which revealed – among other things – that the US monitors Zelensky’s communications, the newspaper presented him with a fresh allegation that has not yet been reported in the US media.</p><p>Note that Evgeny Prigozhin is the founder and head of the Wagner Group, a Russian private military company currently fighting in the Donetsk People’s Republic.</p><p><strong>WaPo: </strong>The documents indicate that GUR, your intelligence directorate, has back-channel contact with Evgeny Prigozhin that you were aware of, including meeting with Evgeny Prigozhin and GUR officers. Is that true?</p><p><strong>Zelensky: </strong>This is a matter of [military] intelligence. Do you want me to be convicted of state treason? And so, it’s very interesting, if someone is saying that you have documents, or if someone from our government is speaking about the activities of our intelligence, I would also like to ask you a question: With which sources from Ukraine do you have contact? Who is talking about the activities of our intelligence? Because this is the most severe felony in our country. Which Ukrainians are you talking to?</p><p><strong>WaPo: </strong>I talked to officials in government, but these documents are not from Ukraine, they are from…</p><p><strong>Zelensky:</strong> It doesn’t matter where the documents are from. The question is with which Ukrainian official did you talk? Because if they say something about our intelligence, that’s treason. If they say something about a specific offensive plan of one general or another, this is also treason. That’s why I asked you, which Ukrainians are you talking to?</p><p><strong>WaPo: </strong>About these specific documents? You are the first person I am talking to about them.</p><p><strong>Zelensky: </strong>Okay.</p><p><strong>WaPo: </strong>And I can read you what information exactly there is about Prigozhin and the GUR. On February 13, Kirill Budanov, chief of Ukraine’s Main Directorate of Intelligence, informed you about a Russian plan to destabilize Moldova with two former Wagner associates. Budanov informed you that he viewed the Russian scheme as a way to incriminate Prigozhin because “we have dealings” with him. You instructed Budanov to inform Moldovan President Maia Sandu, and Budanov told you that the GUR had informed Prigozhin that he would be labeled a traitor who has been working with Ukraine. The document also says that Budanov expected the Russians to use details of Prigozhin’s secret talks with the GUR and meetings with GUR officers in Africa…</p><p><strong>Zelensky: </strong>Listen, to be honest, well, you just read something, you say something. I just don’t understand where you get it, whom you talk to and so on. You talk about how I met with Budanov. This suggests that you – how do you put it? It looks like you have people who have some records or you have some evidence or you have something, because that’s what it looks like.</p> <cite>Here are the Zelensky ‘treason’ quotes the Washington Post deleted, Russia Today, 14 May 2023</cite></blockquote><p>It’s becoming increasingly apparent that Zelensky knows the days of the Kiev regime are numbered. Both the USA and the UK are taking bigger and bolder risks with their anti-Russian activity while the media clowns are cranking their narrative machine up to eight or nine in the hopes that they can somehow alter the situation through their word spells.</p><p>And, in the meantime, both China and Russia are saying less and less, even as the Russian Air Force begins <a href=\"https://simplicius76.substack.com/p/nuclear-fallout-russian-strikes-create\">to strike more heavily</a> at targets in western Ukraine. It feels as if something has to break soon, but what and when cannot be known with any degree of confidence.</p><p><em><a href=\"https://social.infogalactic.com/micropost/1f5a6c56-0644-4d5a-9d59-11a31d4091ba\">DISCUSS ON SG</a></em></p></div>",
  "content_text": "The Washington Post\nomitted significant sections of its recent interview with Vladimir Zelensky.\nFrom\nRussia Today\n:\nThe Washington Post has deleted a large tract of an interview with Ukrainian President Vladimir Zelensky in which he lashed out at alleged “traitors” in his ranks. RT is publishing the entire section that the US newspaper would rather keep hidden.\nThe following section appeared in an interview with the Ukrainian president published on Saturday. By Sunday it had been removed with no explanation. After discussing a trove of recently leaked Pentagon documents, which revealed – among other things – that the US monitors Zelensky’s communications, the newspaper presented him with a fresh allegation that has not yet been reported in the US media.\nNote that Evgeny Prigozhin is the founder and head of the Wagner Group, a Russian private military company currently fighting in the Donetsk People’s Republic.\nWaPo:\nThe documents indicate that GUR, your intelligence directorate, has back-channel contact with Evgeny Prigozhin that you were aware of, including meeting with Evgeny Prigozhin and GUR officers. Is that true?\nZelensky:\nThis is a matter of [military] intelligence. Do you want me to be convicted of state treason? And so, it’s very interesting, if someone is saying that you have documents, or if someone from our government is speaking about the activities of our intelligence, I would also like to ask you a question: With which sources from Ukraine do you have contact? Who is talking about the activities of our intelligence? Because this is the most severe felony in our country. Which Ukrainians are you talking to?\nWaPo:\nI talked to officials in government, but these documents are not from Ukraine, they are from…\nZelensky:\nIt doesn’t matter where the documents are from. The question is with which Ukrainian official did you talk? Because if they say something about our intelligence, that’s treason. If they say something about a specific offensive plan of one general or another, this is also treason. That’s why I asked you, which Ukrainians are you talking to?\nWaPo:\nAbout these specific documents? You are the first person I am talking to about them.\nZelensky:\nOkay.\nWaPo:\nAnd I can read you what information exactly there is about Prigozhin and the GUR. On February 13, Kirill Budanov, chief of Ukraine’s Main Directorate of Intelligence, informed you about a Russian plan to destabilize Moldova with two former Wagner associates. Budanov informed you that he viewed the Russian scheme as a way to incriminate Prigozhin because “we have dealings” with him. You instructed Budanov to inform Moldovan President Maia Sandu, and Budanov told you that the GUR had informed Prigozhin that he would be labeled a traitor who has been working with Ukraine. The document also says that Budanov expected the Russians to use details of Prigozhin’s secret talks with the GUR and meetings with GUR officers in Africa…\nZelensky:\nListen, to be honest, well, you just read something, you say something. I just don’t understand where you get it, whom you talk to and so on. You talk about how I met with Budanov. This suggests that you – how do you put it? It looks like you have people who have some records or you have some evidence or you have something, because that’s what it looks like.\nHere are the Zelensky ‘treason’ quotes the Washington Post deleted, Russia Today, 14 May 2023\nIt’s becoming increasingly apparent that Zelensky knows the days of the Kiev regime are numbered. Both the USA and the UK are taking bigger and bolder risks with their anti-Russian activity while the media clowns are cranking their narrative machine up to eight or nine in the hopes that they can somehow alter the situation through their word spells.\nAnd, in the meantime, both China and Russia are saying less and less, even as the Russian Air Force begins\nto strike more heavily\nat targets in western Ukraine. It feels as if something has to break soon, but what and when cannot be known with any degree of confidence.\nDISCUSS ON SG",
  "tags": [
    "media",
    "Russia",
    "war"
  ],
  "categories": [],
  "sitemap_lastmod": "2023-05-14T21:51:20+00:00"
}