{
  "url": "https://voxday.net/2023/05/28/the-narrative-shifts-again/",
  "scraped_at": "2026-01-08T13:58:04.976683",
  "title": "The Narrative Shifts Again",
  "date_display": "May 28, 2023",
  "date_iso": "2023-05-28T10:08:10+00:00",
  "date_from_url": "2023-05-28",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>In a perceptive article <a href=\"https://simplicius76.substack.com/p/latest-headlines-digest-the-wests\">on the shifting media narrative</a>, Simplicius notes that Clown World’s pet mouthpieces are gradually accommodating the public to the idea that the Ukro-NATO army is losing the battle for Ukraine.</p><blockquote class=\"wp-block-quote is-layout-flow wp-block-quote-is-layout-flow\"><p>There’s been a huge rash of eye-opening and thought-provoking articles recently, which I haven’t been able to fit into other posts, and which have been building up on my tabs bar. So I figured I would wash them all through a single post dedicated to compiling these latest signals from the Western elites as to their thoughts on how the conflict is changing.</p><p>And certainly, judging by these recent issues, the tone and sentiment is shifting drastically. One can hardly find a single piece still optimistic for the Ukrainian side, apart from the disingenuous lot who continue hyper-focusing on tiny minutiae, like some irrelevant Ukrainian drone strike on a Russian building in Krasnodar, which might’ve damaged the corner of the roof’s eaves.</p></blockquote><p>This is almost certainly to help prepare the American and European publics for the opening of fronts in Africa and South America, now that the initial forces have been sent to Sudan and Peru, and reinforcements have been sent to the US base in Djibouti, in a belated attempt to keep both rebellious states from breaking free from the Clown World Order.</p><p>I note, in response to a recent criticism that I read, but forgot to save the link, the New Yorker article indicates that the performance of the Armed Forces of Ukraine has actually been strategically and operationally worse than the Arab armies that were defeated by the Israeli Defense Forces.</p><p><em>Within weeks, the [Ukrainian] battalion faced annihilation: entire platoons had been wiped out in close-contact firefights, and some seventy men had been encircled and massacred. The dwindling survivors, one officer told me, “became useless because they were so tired.” In January, what was left of the battalion retreated from the village and established defensive positions in the tree lines and open farmland a mile to the west. “Wagner kicked our asses,” the officer said. Pavlo estimated that, owing to the casualties his unit had sustained, eighty per cent of his men were new draftees. “They’re civilians with no experience,” he said. “If they give me ten, I’m lucky when three of them can fight.”</em></p><p>At least the Arab commanders had the sense and the ability to repeatedly preserve the greater part of their military assets when defeated; the total number of Arab soldiers lost from 1948 to 1982 is estimated at 91,105, three times the Israeli total of 23,620, whereas the UFA may have lost more than 50,000 in a single battle in a futile attempt to hold on to a strategically-unimportant city of 70,000, and done so unnecessarily.</p><p><em>When Russia was faced with city battles – Kyiv, Kharkiv City, and Kherson City – they chose to abandon each while establishing more defensible defensive positions elsewhere. Ukraine, on the other hand, chose to fight for their major cities. The results are telling.</em>.. <em>As far back as December, it was clear that Ukraine would not be able to keep Bakhmut. Once Russian troops advanced around the flanks of the city and took all the roads supporting the garrison under fire control, the chances of holding the city fell to almost zero. What Ukraine could and should have done is follow the Russian example at Kherson and withdraw to the next prepared defensive position in the vicinity of Kramatorsk or Slavyansk.</em></p><p>Strategy, Logistics, and Operations all trump Tactics. Individual bravery on the part of conscript soldiers is irrelevant. Praise from the victors about courageously their opponents died means nothing in these circumstances. It’s one thing when an overmatched force like the Sacred Band of Thebes or the 300 Spartans at Thermoplylae fight to the last man while inflicting a disproportionate number of casualties on the victorious enemy, it’s another when a numerically superior force that is fighting on the defensive in well-prepared positions not only manages to lose, but get annihilated by ground forces that largely consist of a mercenary light infantry that is at least fifty percent convicts. (Yes, I know the air support and artillery, including the tanks, are regulars.) It’s the observable military performance that matters, and the repeated failures of the UFA at Mariupol, Severodonetsk, Lysychansk, Soledar, and Bakhmut appears to be approaching comprehensive, if not proverbial.</p><p>This Ukrainian operational incompetence is intentional, of course. Neither the Fake Ukrainians who nominally run the Kiev regime nor the US-based neoclowns who give them their orders have any interest in sparing the lives of the Ukrainians who are so bravely, and so foolishly, marching obediently into the Russian meatgrinder. The satanic clowns are never happier than when they’re able to arrange a fratricidal European war, and the retarded Ukrainians are reaping the inevitable consequences of obeying foreign rulers who hate them and are ruthlessly sacrificing them in order to preserve the illusion of their global neo-empire.</p><p>But the illusion will not be preserved, no matter how many Ukrainians are sacrificed to Russian artillery shells prior to the “surprise” attack by NATO forces in July. Sooner or later, Ukraine will fall, followed eventually by the New International Rules-Based World Order. As Simplicius notes, Russia is doing the right thing as it prepares for the battle against the real enemy.</p><blockquote class=\"wp-block-quote is-layout-flow wp-block-quote-is-layout-flow\"><p>I believe what Russia is doing is the smart thing, weakening the opponent for as long as it takes with a style of warfare that favors Russia greatly. Why be rushed into offensive actions just because bloggers on Telegram are getting jittery, and sustain losses, when you can easily destroy your opponent from long range indefinitely, then swoop in to finish him off when he’s barely able to resist.</p></blockquote><p><em><a href=\"https://social.infogalactic.com/micropost/1569c6b4-a83b-4b06-9bef-d3084cc66968\">DISCUSS ON SG</a></em></p></div>",
  "content_text": "In a perceptive article\non the shifting media narrative\n, Simplicius notes that Clown World’s pet mouthpieces are gradually accommodating the public to the idea that the Ukro-NATO army is losing the battle for Ukraine.\nThere’s been a huge rash of eye-opening and thought-provoking articles recently, which I haven’t been able to fit into other posts, and which have been building up on my tabs bar. So I figured I would wash them all through a single post dedicated to compiling these latest signals from the Western elites as to their thoughts on how the conflict is changing.\nAnd certainly, judging by these recent issues, the tone and sentiment is shifting drastically. One can hardly find a single piece still optimistic for the Ukrainian side, apart from the disingenuous lot who continue hyper-focusing on tiny minutiae, like some irrelevant Ukrainian drone strike on a Russian building in Krasnodar, which might’ve damaged the corner of the roof’s eaves.\nThis is almost certainly to help prepare the American and European publics for the opening of fronts in Africa and South America, now that the initial forces have been sent to Sudan and Peru, and reinforcements have been sent to the US base in Djibouti, in a belated attempt to keep both rebellious states from breaking free from the Clown World Order.\nI note, in response to a recent criticism that I read, but forgot to save the link, the New Yorker article indicates that the performance of the Armed Forces of Ukraine has actually been strategically and operationally worse than the Arab armies that were defeated by the Israeli Defense Forces.\nWithin weeks, the [Ukrainian] battalion faced annihilation: entire platoons had been wiped out in close-contact firefights, and some seventy men had been encircled and massacred. The dwindling survivors, one officer told me, “became useless because they were so tired.” In January, what was left of the battalion retreated from the village and established defensive positions in the tree lines and open farmland a mile to the west. “Wagner kicked our asses,” the officer said. Pavlo estimated that, owing to the casualties his unit had sustained, eighty per cent of his men were new draftees. “They’re civilians with no experience,” he said. “If they give me ten, I’m lucky when three of them can fight.”\nAt least the Arab commanders had the sense and the ability to repeatedly preserve the greater part of their military assets when defeated; the total number of Arab soldiers lost from 1948 to 1982 is estimated at 91,105, three times the Israeli total of 23,620, whereas the UFA may have lost more than 50,000 in a single battle in a futile attempt to hold on to a strategically-unimportant city of 70,000, and done so unnecessarily.\nWhen Russia was faced with city battles – Kyiv, Kharkiv City, and Kherson City – they chose to abandon each while establishing more defensible defensive positions elsewhere. Ukraine, on the other hand, chose to fight for their major cities. The results are telling.\n..\nAs far back as December, it was clear that Ukraine would not be able to keep Bakhmut. Once Russian troops advanced around the flanks of the city and took all the roads supporting the garrison under fire control, the chances of holding the city fell to almost zero. What Ukraine could and should have done is follow the Russian example at Kherson and withdraw to the next prepared defensive position in the vicinity of Kramatorsk or Slavyansk.\nStrategy, Logistics, and Operations all trump Tactics. Individual bravery on the part of conscript soldiers is irrelevant. Praise from the victors about courageously their opponents died means nothing in these circumstances. It’s one thing when an overmatched force like the Sacred Band of Thebes or the 300 Spartans at Thermoplylae fight to the last man while inflicting a disproportionate number of casualties on the victorious enemy, it’s another when a numerically superior force that is fighting on the defensive in well-prepared positions not only manages to lose, but get annihilated by ground forces that largely consist of a mercenary light infantry that is at least fifty percent convicts. (Yes, I know the air support and artillery, including the tanks, are regulars.) It’s the observable military performance that matters, and the repeated failures of the UFA at Mariupol, Severodonetsk, Lysychansk, Soledar, and Bakhmut appears to be approaching comprehensive, if not proverbial.\nThis Ukrainian operational incompetence is intentional, of course. Neither the Fake Ukrainians who nominally run the Kiev regime nor the US-based neoclowns who give them their orders have any interest in sparing the lives of the Ukrainians who are so bravely, and so foolishly, marching obediently into the Russian meatgrinder. The satanic clowns are never happier than when they’re able to arrange a fratricidal European war, and the retarded Ukrainians are reaping the inevitable consequences of obeying foreign rulers who hate them and are ruthlessly sacrificing them in order to preserve the illusion of their global neo-empire.\nBut the illusion will not be preserved, no matter how many Ukrainians are sacrificed to Russian artillery shells prior to the “surprise” attack by NATO forces in July. Sooner or later, Ukraine will fall, followed eventually by the New International Rules-Based World Order. As Simplicius notes, Russia is doing the right thing as it prepares for the battle against the real enemy.\nI believe what Russia is doing is the smart thing, weakening the opponent for as long as it takes with a style of warfare that favors Russia greatly. Why be rushed into offensive actions just because bloggers on Telegram are getting jittery, and sustain losses, when you can easily destroy your opponent from long range indefinitely, then swoop in to finish him off when he’s barely able to resist.\nDISCUSS ON SG",
  "tags": [
    "Russia",
    "war"
  ],
  "categories": [],
  "sitemap_lastmod": "2023-05-28T10:18:20+00:00"
}