{
  "url": "https://voxday.net/2023/05/15/the-failure-of-modern-science/",
  "scraped_at": "2026-01-08T13:56:46.880021",
  "title": "The Failure of Modern Science",
  "date_display": "May 15, 2023",
  "date_iso": "2023-05-15T10:10:32+00:00",
  "date_from_url": "2023-05-15",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>Peer review was supposed to be the gold standard of science. Instead, <a href=\"https://www.experimental-history.com/p/the-rise-and-fall-of-peer-review\">it turned out to be a fraud</a> that polluted the knowledge base, corrupted the profession, and destroyed confidence in the method.</p><blockquote class=\"wp-block-quote is-layout-flow wp-block-quote-is-layout-flow\"><p>For the last 60 years or so, science has been running an experiment on itself. The experimental design wasn’t great; there was no randomization and no control group. Nobody was in charge, exactly, and nobody was really taking consistent measurements. And yet it was the most massive experiment ever run, and it included every scientist on Earth.</p><p>Most of those folks didn’t even realize they were in an experiment. Many of them, including me, weren’t born when the experiment started. If we had noticed what was going on, maybe we would have demanded a basic level of scientific rigor. Maybe nobody objected because the hypothesis seemed so obviously true: science will be better off if we have someone check every paper and reject the ones that don’t pass muster. They called it “peer review.”</p><p>This was a massive change. From antiquity to modernity, scientists wrote letters and circulated monographs, and the main barriers stopping them from communicating their findings were the cost of paper, postage, or a printing press, or on rare occasions, the cost of a visit from the Catholic Church. Scientific journals appeared in the 1600s, but they operated more like magazines or newsletters, and their processes of picking articles ranged from “we print whatever we get” to “the editor asks his friend what he thinks” to “the whole society votes.” Sometimes journals couldn’t get enough papers to publish, so editors had to go around begging their friends to submit manuscripts, or fill the space themselves. Scientific publishing remained a hodgepodge for centuries.</p><p>(Only one of Einstein’s papers was ever peer-reviewed, by the way, and he was so surprised and upset that he published his paper in a different journal instead.)</p><p>That all changed after World War II. Governments poured funding into research, and they convened “peer reviewers” to ensure they weren’t wasting their money on foolish proposals. That funding turned into a deluge of papers, and journals that previously struggled to fill their pages now struggled to pick which articles to print. Reviewing papers before publication, which was “quite rare” until the 1960s, became much more common. Then it became universal.</p><p>Now pretty much every journal uses outside experts to vet papers, and papers that don’t please reviewers get rejected. You can still write to your friends about your findings, but hiring committees and grant agencies act as if the only science that exists is the stuff published in peer-reviewed journals. This is the grand experiment we’ve been running for six decades.</p><p>The results are in. It failed.</p> <cite>The Rise and Fall of Peer Review, Adam Mastroanni, 13 December 2022</cite></blockquote><p>It’s very important to remember that most people neither know or understand anything about science, so the idea that science is not only less than perfectly reliable, but is, in fact, <a href=\"https://journals.plos.org/plosmedicine/article?id=10.1371/journal.pmed.0020124\">reliably false</a> is extremely foreign to them. They have no idea that reliable science is called “engineering”, and in fact, their grasp of the credibility of the two fields is usually inverted.</p><p>But if you are an independent thinker capable of processing information on your own, it should not be too difficult to grasp that science is intrinsically flawed due to several unavoidable factors that boil down to the absence of any controlling factor for the human element.</p><p>Peer review was never that missing factor. As I pointed out years ago, peer review doesn’t even rise to the level of editing, much less auditing, it is more akin to slush-file reading by volunteers. The great irony of the primary defense of peer review is that it is a concept based on nothing more than pure logic utilized to justify an activity specifically conceived to replace the use of pure logic.</p><p><strong>UPDATE: </strong>The retards are never going to learn, no matter how reliably they fail.</p><p><em>It’s already starting in the comments: I don’t think it failed perhaps as much as it stopped working. REAL PEEER REVIEW HAS NOT BEEN TRIED.</em></p><p><em><a href=\"https://social.infogalactic.com/micropost/61e2858d-d114-43fc-8de8-29071ec7a9d3\">DISCUSS ON SG</a></em></p></div>",
  "content_text": "Peer review was supposed to be the gold standard of science. Instead,\nit turned out to be a fraud\nthat polluted the knowledge base, corrupted the profession, and destroyed confidence in the method.\nFor the last 60 years or so, science has been running an experiment on itself. The experimental design wasn’t great; there was no randomization and no control group. Nobody was in charge, exactly, and nobody was really taking consistent measurements. And yet it was the most massive experiment ever run, and it included every scientist on Earth.\nMost of those folks didn’t even realize they were in an experiment. Many of them, including me, weren’t born when the experiment started. If we had noticed what was going on, maybe we would have demanded a basic level of scientific rigor. Maybe nobody objected because the hypothesis seemed so obviously true: science will be better off if we have someone check every paper and reject the ones that don’t pass muster. They called it “peer review.”\nThis was a massive change. From antiquity to modernity, scientists wrote letters and circulated monographs, and the main barriers stopping them from communicating their findings were the cost of paper, postage, or a printing press, or on rare occasions, the cost of a visit from the Catholic Church. Scientific journals appeared in the 1600s, but they operated more like magazines or newsletters, and their processes of picking articles ranged from “we print whatever we get” to “the editor asks his friend what he thinks” to “the whole society votes.” Sometimes journals couldn’t get enough papers to publish, so editors had to go around begging their friends to submit manuscripts, or fill the space themselves. Scientific publishing remained a hodgepodge for centuries.\n(Only one of Einstein’s papers was ever peer-reviewed, by the way, and he was so surprised and upset that he published his paper in a different journal instead.)\nThat all changed after World War II. Governments poured funding into research, and they convened “peer reviewers” to ensure they weren’t wasting their money on foolish proposals. That funding turned into a deluge of papers, and journals that previously struggled to fill their pages now struggled to pick which articles to print. Reviewing papers before publication, which was “quite rare” until the 1960s, became much more common. Then it became universal.\nNow pretty much every journal uses outside experts to vet papers, and papers that don’t please reviewers get rejected. You can still write to your friends about your findings, but hiring committees and grant agencies act as if the only science that exists is the stuff published in peer-reviewed journals. This is the grand experiment we’ve been running for six decades.\nThe results are in. It failed.\nThe Rise and Fall of Peer Review, Adam Mastroanni, 13 December 2022\nIt’s very important to remember that most people neither know or understand anything about science, so the idea that science is not only less than perfectly reliable, but is, in fact,\nreliably false\nis extremely foreign to them. They have no idea that reliable science is called “engineering”, and in fact, their grasp of the credibility of the two fields is usually inverted.\nBut if you are an independent thinker capable of processing information on your own, it should not be too difficult to grasp that science is intrinsically flawed due to several unavoidable factors that boil down to the absence of any controlling factor for the human element.\nPeer review was never that missing factor. As I pointed out years ago, peer review doesn’t even rise to the level of editing, much less auditing, it is more akin to slush-file reading by volunteers. The great irony of the primary defense of peer review is that it is a concept based on nothing more than pure logic utilized to justify an activity specifically conceived to replace the use of pure logic.\nUPDATE:\nThe retards are never going to learn, no matter how reliably they fail.\nIt’s already starting in the comments: I don’t think it failed perhaps as much as it stopped working. REAL PEEER REVIEW HAS NOT BEEN TRIED.\nDISCUSS ON SG",
  "tags": [
    "history",
    "science"
  ],
  "categories": [],
  "sitemap_lastmod": "2023-05-15T13:35:35+00:00"
}