{
  "url": "https://voxday.net/2023/05/03/the-history-of-the-us-color-revolution/",
  "scraped_at": "2026-01-08T13:55:32.512563",
  "title": "The History of the US Color Revolution",
  "date_display": "May 3, 2023",
  "date_iso": "2023-05-03T09:04:43+00:00",
  "date_from_url": "2023-05-03",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>Ron Unz writes a brief, but comprehensive <a href=\"https://www.unz.com/runz/the-neocons-and-their-rise-to-power/\">history of the rise of the neocons</a> from a minor anti-Soviet faction of the Democratic Party to the foreign policy establishment. And in doing so, he implicitly explains why 9/11 happened and who was responsible for it.</p><blockquote class=\"wp-block-quote is-layout-flow wp-block-quote-is-layout-flow\"><p><em>The complete ideological triumph of the Neocons after the 9/11 attacks was all the more shocking given the crushing recent political defeat they had suffered. During the 2000 presidential campaign, nearly all of the Neocons had aligned themselves with Sen. John McCain, whose battle with Bush for the Republican nomination had eventually turned quite bitter, and as a consequence, they had been almost entirely frozen out of any high-level appointments. Both Vice President Dick Cheney and Defense Secretary Donald Rumsfeld were then widely regarded as Bush Republicans, lacking any significant Neocon ties, and the same was true for all the other top administration figures such as Colin Powell, Condeleeza Rice, and Paul O’Neil. Indeed, the only Neoconservative offered a Cabinet spot was Linda Chavez, and not only was the Labor Department always regarded as something of a boobie prize in a GOP Administration, but she was ultimately forced to withdraw her nomination due to her “nanny problems.” The highest-ranking Neocon serving under Bush was Rumsfeld Deputy Paul Wolfowitz, whose seemingly inconsequential appointment had passed without any notice.</em></p><p><em>Most of the Neocons themselves certainly seemed to recognize the catastrophic loss they had suffered in the 2000 election. Back in those days, I was on very friendly terms with Bill Kristol, and when I stopped by his office at the Weekly Standard for a chat in the spring of 2001, he seemed in a remarkably depressed state of mind. I remember that at one point, he took his head in his hands and wondered aloud whether it was time for him to just abandon the political battle, resigning his editorship and taking up a quiet post at a DC thinktank. Yet just eight or ten months later, he and his close allies were on their way to gaining overwhelming influence in our government. In an eerie parallel to the story told in Alexander Solzhenitsyn’s Lenin in Zurich, the totally fortuitous 9/11 attacks and the outbreak of war had suddenly allowed a small but determined ideological faction to seize control of a gigantic country.</em></p><p>In the aftermath of the 9/11 Attacks, the Neocons had solidified their control of nearly all existing conservative media outlets, prompting Pat Buchanan and a couple of partners to found <em>The American Conservative</em> in 2002. The following year, he used that platform for a blistering attack on Bush’s Iraq War foreign policy, which he denounced as a Neocon project. David Frum, a former Bush speechwriter and one of his targets, launched a near-simultaneous broadside in <em>National Review</em> against Buchanan and other critics, whom he condemned as “unpatriotic conservatives.” Taken together, the two lengthy pieces provide a good overview of the key figures on both sides of that bitter ideological battle.</p><p>Many moderates and liberals were equally appalled by the Iraq War as it unfolded, but unlike Buchanan they were often quite gun-shy in highlighting the obvious pro-Israel roots and motives of the leading Neocon backers…</p><p>Despite the unprecedented strategic disaster of the Iraq War, the Neocons fully retained their hold on the Republican Party’s foreign policy, while their Democratic counterparts achieved the same success across the political aisle. Thus, when the manifest failures of the Bush Administration led to the overwhelming victory of Barack Obama in 2008, Bush Neocons were merely replaced by Obama Neocons. Donald Trump’s unexpected triumph in 2016 brought to power the Trump Neocons such as Mike Pompeo and John Bolton, who were then succeeded in 2020 by Biden Neocons Antony Blinken and Victoria Nuland.</p><p>As I recently explained:</p><p><em>One difficulty is that the very term “Neocon” used here has actually become much less meaningful than it once was. After having controlled American foreign policy for more than three decades, promoting their allies and protégés and purging their opponents, the adherents of that world view now constitute nearly the entire political establishment, including control of the leading thinktanks and publications. By now, I doubt there are many prominent figures in either party who follow a sharply different line. Furthermore, over the last two decades, the national security-focused Neocons have largely merged with the economically-focused neoliberals, forming a unified ideological block that represents the political worldview of the elites running both American parties.</em></p><p>Our nation’s two most recent Secretaries of State have been Mike Pompeo and Antony Blinken, and I’m not whether either of them even considers himself a Neocon, given that their foreign policy views are almost universal within their political circle. Do fish think that water is wet?</p><p>But consider the reality of today’s American foreign policy. In 1992 Neocon Paul Wolfowitz had drafted a Defense document advocating measures to ensure our permanent global military dominance but when it leaked the proposal was immediately repudiated by our Republican President and top military leaders, let alone the Democrats; however a decade later this “Wolfowitz Doctrine” had became our policy under Bush and today it enjoys complete bipartisan support.</p><p>Or consider the 28 standing ovations received by the Israeli prime minister when he spoke before a joint session of Congress in 2015, including the Stalinesque touch that some of our elected officials were denounced for applauding with insufficient enthusiasm. Given such a political environment, the strong pressure once exerted upon the Jewish State by such varied American Presidents as Carter, Reagan, Bush, and Clinton would be unthinkable today.</p><p>From the moment the Ukraine war began, our entire media and political establishments have been in absolute lock-step, with scarcely a trace of doubt or dissent. There has been no willingness to recognize the role of NATO expansion in provoking the conflict nor to ask questions about a possible American role in the explosions that destroyed Europe’s Nord Stream energy pipelines.</p> <cite><em><strong>The Neocons and Their Rise to Power</strong></em>, Ron Unz, 1 May 2023</cite></blockquote><p>Totally fortuitous indeed. There are a lot of “fortuitous” things that seem to happen around the world whenever the neoclowns are involved in some way, shape, or form. But as Robert Kagan’s last three books have chronicled, events are no longer trending in their favor because their fundamental axioms are false, thereby ensuring their ultimate failure even in areas – <em>especially</em> in areas – where they have been successful in the past.</p><p>It’s an excellent primer on neoconnery, although I reject the claim that the neoclowns are not Trotskyite world revolutionaries, which should be painfully obvious given the number of color revolutions they have attempted to launch around the world since the turn of the century. I highly recommend reading the whole thing because one cannot even begin to understand Clown World without knowing who the neoclowns are, from whence they came, and what their global imperialist objectives are.</p><p><em><a href=\"https://social.infogalactic.com/micropost/81c297c6-0f56-4556-a2c1-7f65d6cc8d9f\">DISCUSS ON SG</a></em></p></div>",
  "content_text": "Ron Unz writes a brief, but comprehensive\nhistory of the rise of the neocons\nfrom a minor anti-Soviet faction of the Democratic Party to the foreign policy establishment. And in doing so, he implicitly explains why 9/11 happened and who was responsible for it.\nThe complete ideological triumph of the Neocons after the 9/11 attacks was all the more shocking given the crushing recent political defeat they had suffered. During the 2000 presidential campaign, nearly all of the Neocons had aligned themselves with Sen. John McCain, whose battle with Bush for the Republican nomination had eventually turned quite bitter, and as a consequence, they had been almost entirely frozen out of any high-level appointments. Both Vice President Dick Cheney and Defense Secretary Donald Rumsfeld were then widely regarded as Bush Republicans, lacking any significant Neocon ties, and the same was true for all the other top administration figures such as Colin Powell, Condeleeza Rice, and Paul O’Neil. Indeed, the only Neoconservative offered a Cabinet spot was Linda Chavez, and not only was the Labor Department always regarded as something of a boobie prize in a GOP Administration, but she was ultimately forced to withdraw her nomination due to her “nanny problems.” The highest-ranking Neocon serving under Bush was Rumsfeld Deputy Paul Wolfowitz, whose seemingly inconsequential appointment had passed without any notice.\nMost of the Neocons themselves certainly seemed to recognize the catastrophic loss they had suffered in the 2000 election. Back in those days, I was on very friendly terms with Bill Kristol, and when I stopped by his office at the Weekly Standard for a chat in the spring of 2001, he seemed in a remarkably depressed state of mind. I remember that at one point, he took his head in his hands and wondered aloud whether it was time for him to just abandon the political battle, resigning his editorship and taking up a quiet post at a DC thinktank. Yet just eight or ten months later, he and his close allies were on their way to gaining overwhelming influence in our government. In an eerie parallel to the story told in Alexander Solzhenitsyn’s Lenin in Zurich, the totally fortuitous 9/11 attacks and the outbreak of war had suddenly allowed a small but determined ideological faction to seize control of a gigantic country.\nIn the aftermath of the 9/11 Attacks, the Neocons had solidified their control of nearly all existing conservative media outlets, prompting Pat Buchanan and a couple of partners to found\nThe American Conservative\nin 2002. The following year, he used that platform for a blistering attack on Bush’s Iraq War foreign policy, which he denounced as a Neocon project. David Frum, a former Bush speechwriter and one of his targets, launched a near-simultaneous broadside in\nNational Review\nagainst Buchanan and other critics, whom he condemned as “unpatriotic conservatives.” Taken together, the two lengthy pieces provide a good overview of the key figures on both sides of that bitter ideological battle.\nMany moderates and liberals were equally appalled by the Iraq War as it unfolded, but unlike Buchanan they were often quite gun-shy in highlighting the obvious pro-Israel roots and motives of the leading Neocon backers…\nDespite the unprecedented strategic disaster of the Iraq War, the Neocons fully retained their hold on the Republican Party’s foreign policy, while their Democratic counterparts achieved the same success across the political aisle. Thus, when the manifest failures of the Bush Administration led to the overwhelming victory of Barack Obama in 2008, Bush Neocons were merely replaced by Obama Neocons. Donald Trump’s unexpected triumph in 2016 brought to power the Trump Neocons such as Mike Pompeo and John Bolton, who were then succeeded in 2020 by Biden Neocons Antony Blinken and Victoria Nuland.\nAs I recently explained:\nOne difficulty is that the very term “Neocon” used here has actually become much less meaningful than it once was. After having controlled American foreign policy for more than three decades, promoting their allies and protégés and purging their opponents, the adherents of that world view now constitute nearly the entire political establishment, including control of the leading thinktanks and publications. By now, I doubt there are many prominent figures in either party who follow a sharply different line. Furthermore, over the last two decades, the national security-focused Neocons have largely merged with the economically-focused neoliberals, forming a unified ideological block that represents the political worldview of the elites running both American parties.\nOur nation’s two most recent Secretaries of State have been Mike Pompeo and Antony Blinken, and I’m not whether either of them even considers himself a Neocon, given that their foreign policy views are almost universal within their political circle. Do fish think that water is wet?\nBut consider the reality of today’s American foreign policy. In 1992 Neocon Paul Wolfowitz had drafted a Defense document advocating measures to ensure our permanent global military dominance but when it leaked the proposal was immediately repudiated by our Republican President and top military leaders, let alone the Democrats; however a decade later this “Wolfowitz Doctrine” had became our policy under Bush and today it enjoys complete bipartisan support.\nOr consider the 28 standing ovations received by the Israeli prime minister when he spoke before a joint session of Congress in 2015, including the Stalinesque touch that some of our elected officials were denounced for applauding with insufficient enthusiasm. Given such a political environment, the strong pressure once exerted upon the Jewish State by such varied American Presidents as Carter, Reagan, Bush, and Clinton would be unthinkable today.\nFrom the moment the Ukraine war began, our entire media and political establishments have been in absolute lock-step, with scarcely a trace of doubt or dissent. There has been no willingness to recognize the role of NATO expansion in provoking the conflict nor to ask questions about a possible American role in the explosions that destroyed Europe’s Nord Stream energy pipelines.\nThe Neocons and Their Rise to Power\n, Ron Unz, 1 May 2023\nTotally fortuitous indeed. There are a lot of “fortuitous” things that seem to happen around the world whenever the neoclowns are involved in some way, shape, or form. But as Robert Kagan’s last three books have chronicled, events are no longer trending in their favor because their fundamental axioms are false, thereby ensuring their ultimate failure even in areas –\nespecially\nin areas – where they have been successful in the past.\nIt’s an excellent primer on neoconnery, although I reject the claim that the neoclowns are not Trotskyite world revolutionaries, which should be painfully obvious given the number of color revolutions they have attempted to launch around the world since the turn of the century. I highly recommend reading the whole thing because one cannot even begin to understand Clown World without knowing who the neoclowns are, from whence they came, and what their global imperialist objectives are.\nDISCUSS ON SG",
  "tags": [
    "Clown World",
    "globalism",
    "history",
    "neoclowns"
  ],
  "categories": [],
  "sitemap_lastmod": "2023-05-03T09:17:38+00:00"
}