{
  "url": "https://voxday.net/2023/05/08/the-russians-call-out-nasa/",
  "scraped_at": "2026-01-08T13:56:05.175224",
  "title": "The Russians Call Out NASA",
  "date_display": "May 8, 2023",
  "date_iso": "2023-05-08T12:24:36+00:00",
  "date_from_url": "2023-05-08",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>For decades, Boomers who believe in the Moon landing narrative more firmly than they believe in God, Family, or Country have argued that the landings couldn’t have been faked or the Russians would have called out NASA. But now the former head of the Russian space agency <a href=\"https://www.rt.com/russia/575937-roscosmos-rogozin-us-moon-landing-proof/\">is doing precisely that</a>.</p><blockquote class=\"wp-block-quote is-layout-flow wp-block-quote-is-layout-flow\"><p>The former head of Russia’s Roscosmos space agency, Dmitry Rogozin, has expressed doubt that the US Apollo 11 mission really landed on the Moon in 1969, saying he has yet to see conclusive proof.</p><p>In a post on his Telegram channel on Sunday, Rogozin said he began his personal quest for the truth “about ten years ago” when he was still working in the Russian government, and that he grew skeptical about whether the Americans had actually set foot on the Moon when he compared how exhausted Soviet cosmonauts looked upon returning from their flights, and how seemingly unaffected the Apollo 11 crew was by contrast.</p><p>Rogozin said he sent requests for evidence to Roscosmos at the time. All he received in response was a book featuring Soviet Cosmonaut Aleksey Leonov’s account of how he talked to the American astronauts and how they told him they had been on the Moon.</p><p>The former official wrote that he continued with his efforts when he was appointed head of Roscosmos in 2018. However, according to Rogozin, no evidence was presented to him. Instead, several unnamed academics angrily criticized him for undermining the “sacred cooperation with NASA,” he claimed. The former Roscosmos chief also said he had “received an angry phone call from a top-ranking official” who supposedly accused him of complicating international relations.</p><p>Rogozin concluded by saying he still cannot believe that the US was able to pull off the feat, but is now unable to, despite the incredible progress in technology since the late 1960s. What he claims to have found out, however, was that Washington has “its people in [the Russian] establishment.”</p></blockquote><p><strong>Translation: </strong>NASA faked major elements of the space program and everyone in a place to know better kept quiet for fear of being targeted by Clown World. But now it is becoming increasingly obvious and the official Moon landing narrative is rapidly crumbling.</p><p>I very much doubt this will be the only historical hoax to be exposed by the Russians over the next decade.</p><p><em><a href=\"https://social.infogalactic.com/micropost/0460537e-e417-4094-bb98-4f9490d89bc7\">DISCUSS ON SG</a></em></p></div>",
  "content_text": "For decades, Boomers who believe in the Moon landing narrative more firmly than they believe in God, Family, or Country have argued that the landings couldn’t have been faked or the Russians would have called out NASA. But now the former head of the Russian space agency\nis doing precisely that\n.\nThe former head of Russia’s Roscosmos space agency, Dmitry Rogozin, has expressed doubt that the US Apollo 11 mission really landed on the Moon in 1969, saying he has yet to see conclusive proof.\nIn a post on his Telegram channel on Sunday, Rogozin said he began his personal quest for the truth “about ten years ago” when he was still working in the Russian government, and that he grew skeptical about whether the Americans had actually set foot on the Moon when he compared how exhausted Soviet cosmonauts looked upon returning from their flights, and how seemingly unaffected the Apollo 11 crew was by contrast.\nRogozin said he sent requests for evidence to Roscosmos at the time. All he received in response was a book featuring Soviet Cosmonaut Aleksey Leonov’s account of how he talked to the American astronauts and how they told him they had been on the Moon.\nThe former official wrote that he continued with his efforts when he was appointed head of Roscosmos in 2018. However, according to Rogozin, no evidence was presented to him. Instead, several unnamed academics angrily criticized him for undermining the “sacred cooperation with NASA,” he claimed. The former Roscosmos chief also said he had “received an angry phone call from a top-ranking official” who supposedly accused him of complicating international relations.\nRogozin concluded by saying he still cannot believe that the US was able to pull off the feat, but is now unable to, despite the incredible progress in technology since the late 1960s. What he claims to have found out, however, was that Washington has “its people in [the Russian] establishment.”\nTranslation:\nNASA faked major elements of the space program and everyone in a place to know better kept quiet for fear of being targeted by Clown World. But now it is becoming increasingly obvious and the official Moon landing narrative is rapidly crumbling.\nI very much doubt this will be the only historical hoax to be exposed by the Russians over the next decade.\nDISCUSS ON SG",
  "tags": [
    "conspiracy",
    "history",
    "Russia",
    "technology"
  ],
  "categories": [],
  "sitemap_lastmod": "2023-05-08T12:24:38+00:00"
}