{
  "url": "https://voxday.net/2023/05/28/the-real-war-starts-in-summer/",
  "scraped_at": "2026-01-08T13:58:06.808242",
  "title": "The Real War Starts in Summer",
  "date_display": "May 28, 2023",
  "date_iso": "2023-05-28T15:15:41+00:00",
  "date_from_url": "2023-05-28",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>Noted military strategist and accomplished color revolutionary Victoria Nuland openly admitted that <a href=\"https://www.rt.com/news/576926-us-ukraine-counteroffensive-nuland/\">the neoclowns are responsible</a> for the Ukrainian strategery that has thus far proven to be considerably less competent than that of the Arabs who lost all of the Arab-Israeli wars.</p><blockquote class=\"wp-block-quote is-layout-flow wp-block-quote-is-layout-flow\"><p>US Under Secretary of State for Political Affairs Victoria Nuland told an audience in Kiev on Thursday that Washington has been helping plan the Ukrainian ‘counteroffensive’ against Russia for almost half a year.</p><p>“Even as you plan for the counteroffensive, which we have been working on with you for some 4-5 months, we are already beginning our discussions with [the] Ukrainian government and with friends in Kiev – both on the civilian side and on the military side – about Ukraine’s long-term future,” Nuland told the Kiev Security Forum via video-link from the State Department.</p><p>She added that the attack will be “likely starting and moving concurrently” with events such as the NATO summit in Lithuania, scheduled for July 11.</p></blockquote><p>Now that it’s impossible to move large quantities of men and machines undetected, military offensives customarily begin under the cover of exercises. And it’s very, very unlikely that the biggest NATO air exercise in history just happens to be scheduled on month before the date that Victoria Nuland mentioned.</p><blockquote class=\"wp-block-quote is-layout-flow wp-block-quote-is-layout-flow\"><p>The largest NATO air exercise since the alliance’s founding in 1949 will be taking place this summer, and the U.S. Air National Guard (ANG) will be providing nearly half of the airpower slated to participate. As for how that show of force may be perceived by global threats like Russia as war rages on in Ukraine, senior ANG officials have said they can “take away whatever message they want.”</p><p>The expansive exercise has been dubbed Air Defender 2023 (AD23), and it’s scheduled to occur later this year between June 12-23. AD23, which has been brewing since 2018, will be led by Germany and take place primarily in that country but with additional forward operating locations in the Czech Republic, Estonia, and Latvia, according to the ANG.</p><p>Among the 10,000 personnel slated to attend and the 220 aircraft that will be employed throughout AD23, the ANG alone will be providing roughly 100 aircraft contributed by 46 wings from 35 states. At another press event held recently at Joint Base Andrews in Maryland, Loh highlighted that AD23 will mark the ANG’s largest deployment across the Atlantic since the Gulf War.</p><p>Specific assets that will participate in AD23 are said to include a wide range of U.S. types, including the F-35A, F-15C, and F-16; the A-10C; the KC-135 and KC-46A tankers for refueling operations; and the C-17A and C-130J aircraft as the ANG’s primary modes of transportation. An MQ-9 Reaper drone from the Texas Air Guard’s 147th Attack Wing will be employed, as well, and Defense News noted that U.S. Navy F/A-18 fighters, NATO E-3 airborne early warning and control jets, and German A400 tankers will also be present among many other types.</p></blockquote><p>I suspect the very sophisticated strategy on the part of Nuland and the neoclowns goes something like this: <em>If the Russians are expecting a NATO air attack in July, but it actually begins in June, this will take them completely by surprise. And since, as we all know, the art of war is entirely dependent upon taking the enemy by surprise, this means we will win</em>.<em> Checkmate, Putin!</em></p><p>Anyhow, as I’ve been saying literally from the start, Ukraine is only the battleground. Sooner or later, NATO has to either surrender or engage the Russians directly, devoid of any excuses, puppets, or proxies. And that is when we will see the true strength of Clown World revealed, or as I suspect is much more likely the case, exposed.</p><p><em><a href=\"https://social.infogalactic.com/micropost/3aad0072-fb28-4b2c-8c2f-f3f43a2eba97\">DISCUSS ON SG</a></em></p></div>",
  "content_text": "Noted military strategist and accomplished color revolutionary Victoria Nuland openly admitted that\nthe neoclowns are responsible\nfor the Ukrainian strategery that has thus far proven to be considerably less competent than that of the Arabs who lost all of the Arab-Israeli wars.\nUS Under Secretary of State for Political Affairs Victoria Nuland told an audience in Kiev on Thursday that Washington has been helping plan the Ukrainian ‘counteroffensive’ against Russia for almost half a year.\n“Even as you plan for the counteroffensive, which we have been working on with you for some 4-5 months, we are already beginning our discussions with [the] Ukrainian government and with friends in Kiev – both on the civilian side and on the military side – about Ukraine’s long-term future,” Nuland told the Kiev Security Forum via video-link from the State Department.\nShe added that the attack will be “likely starting and moving concurrently” with events such as the NATO summit in Lithuania, scheduled for July 11.\nNow that it’s impossible to move large quantities of men and machines undetected, military offensives customarily begin under the cover of exercises. And it’s very, very unlikely that the biggest NATO air exercise in history just happens to be scheduled on month before the date that Victoria Nuland mentioned.\nThe largest NATO air exercise since the alliance’s founding in 1949 will be taking place this summer, and the U.S. Air National Guard (ANG) will be providing nearly half of the airpower slated to participate. As for how that show of force may be perceived by global threats like Russia as war rages on in Ukraine, senior ANG officials have said they can “take away whatever message they want.”\nThe expansive exercise has been dubbed Air Defender 2023 (AD23), and it’s scheduled to occur later this year between June 12-23. AD23, which has been brewing since 2018, will be led by Germany and take place primarily in that country but with additional forward operating locations in the Czech Republic, Estonia, and Latvia, according to the ANG.\nAmong the 10,000 personnel slated to attend and the 220 aircraft that will be employed throughout AD23, the ANG alone will be providing roughly 100 aircraft contributed by 46 wings from 35 states. At another press event held recently at Joint Base Andrews in Maryland, Loh highlighted that AD23 will mark the ANG’s largest deployment across the Atlantic since the Gulf War.\nSpecific assets that will participate in AD23 are said to include a wide range of U.S. types, including the F-35A, F-15C, and F-16; the A-10C; the KC-135 and KC-46A tankers for refueling operations; and the C-17A and C-130J aircraft as the ANG’s primary modes of transportation. An MQ-9 Reaper drone from the Texas Air Guard’s 147th Attack Wing will be employed, as well, and Defense News noted that U.S. Navy F/A-18 fighters, NATO E-3 airborne early warning and control jets, and German A400 tankers will also be present among many other types.\nI suspect the very sophisticated strategy on the part of Nuland and the neoclowns goes something like this:\nIf the Russians are expecting a NATO air attack in July, but it actually begins in June, this will take them completely by surprise. And since, as we all know, the art of war is entirely dependent upon taking the enemy by surprise, this means we will win\n.\nCheckmate, Putin!\nAnyhow, as I’ve been saying literally from the start, Ukraine is only the battleground. Sooner or later, NATO has to either surrender or engage the Russians directly, devoid of any excuses, puppets, or proxies. And that is when we will see the true strength of Clown World revealed, or as I suspect is much more likely the case, exposed.\nDISCUSS ON SG",
  "tags": [
    "neoclowns",
    "Russia",
    "war"
  ],
  "categories": [],
  "sitemap_lastmod": "2023-05-28T15:15:42+00:00"
}