{
  "url": "https://voxday.net/2010/11/03/adios-california/",
  "scraped_at": "2026-01-08T23:41:45.933767",
  "title": "Adios California",
  "date_display": "November 3, 2010",
  "date_iso": "2010-11-03T12:06:00+00:00",
  "date_from_url": "2010-11-03",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>Not to belittle the historic electoral landslide, which despite the Republican inability to regain the Senate was an even bigger political event than 1994, I suspect the most significant result of last night’s election occurred in California.  It wasn’t the failure of Proposition 19, which would have decriminalized marijuana and marked the first roll-back of the thirty-year Drug War, but rather the passage of Proposition 25 by a ten-point margin.</p><p>Why was this significant?  Because California’s Republican legislators can no longer prevent their Democratic counterparts from raising taxes and increasing spending now that the number of votes required to pass the state budget and spending bills related to the budget has been reduced from two-thirds to a simple majority.  As Kevin Williamson noted on NRO: <i>“This election means two things for California: 1. It is now more likely to end up needing a federal bailout, and 2. It is less likely to find Congress receptive to that idea.”</i></p><p>California is already more or less insolvent, it’s just shuffling its debts around to delay the inevitable.  But the relaxed budgetary controls as a result of the change to the state constitution almost surely guarantee that the legislature’s attempts to respond to the problem will be counterproductive and make what is already a disastrous situation even worse.  It is remotely possible that the second re-election of Governor Moonbeam could somewhat meliorate this structural change, as despite being a Democrat he had a better record for fiscal conservatism than either Ronald Reagan or Arnold Schwarzenegger.  But since the veto is much less reliable than simple math, I wouldn’t count on it.</p><p>I would not be surprised if the eventual bankruptcies of California and Illinois become one of the more important issues of the 2012 election.  If the bipartisan Republican-led bank bailouts were enough to inspire the Tea Party, who can imagine what effect a bipartisan, Democrat-led state bailout will have on the electorate?  Rick Santelli asked us if we wanted to pay for our neighbor’s mortgages, but most Americans would much rather do that than pay for California’s teachers unions, prison guards, and imported Mexicans.</p></div>",
  "content_text": "Not to belittle the historic electoral landslide, which despite the Republican inability to regain the Senate was an even bigger political event than 1994, I suspect the most significant result of last night’s election occurred in California.  It wasn’t the failure of Proposition 19, which would have decriminalized marijuana and marked the first roll-back of the thirty-year Drug War, but rather the passage of Proposition 25 by a ten-point margin.\nWhy was this significant?  Because California’s Republican legislators can no longer prevent their Democratic counterparts from raising taxes and increasing spending now that the number of votes required to pass the state budget and spending bills related to the budget has been reduced from two-thirds to a simple majority.  As Kevin Williamson noted on NRO:\n“This election means two things for California: 1. It is now more likely to end up needing a federal bailout, and 2. It is less likely to find Congress receptive to that idea.”\nCalifornia is already more or less insolvent, it’s just shuffling its debts around to delay the inevitable.  But the relaxed budgetary controls as a result of the change to the state constitution almost surely guarantee that the legislature’s attempts to respond to the problem will be counterproductive and make what is already a disastrous situation even worse.  It is remotely possible that the second re-election of Governor Moonbeam could somewhat meliorate this structural change, as despite being a Democrat he had a better record for fiscal conservatism than either Ronald Reagan or Arnold Schwarzenegger.  But since the veto is much less reliable than simple math, I wouldn’t count on it.\nI would not be surprised if the eventual bankruptcies of California and Illinois become one of the more important issues of the 2012 election.  If the bipartisan Republican-led bank bailouts were enough to inspire the Tea Party, who can imagine what effect a bipartisan, Democrat-led state bailout will have on the electorate?  Rick Santelli asked us if we wanted to pay for our neighbor’s mortgages, but most Americans would much rather do that than pay for California’s teachers unions, prison guards, and imported Mexicans.",
  "tags": [
    "politics"
  ],
  "categories": [],
  "sitemap_lastmod": "2010-11-03T12:06:00+00:00"
}