{
  "url": "https://voxday.net/2010/11/28/christianity-and-paganis/",
  "scraped_at": "2026-01-08T23:43:50.646607",
  "title": "Christianity and paganism",
  "date_display": "November 28, 2010",
  "date_iso": "2010-11-28T11:43:00+00:00",
  "date_from_url": "2010-11-28",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>Being ignorant of history, the secularists of the West are naive in the extreme.  Having been raised the fruits amidst the societal inertia of the civilization once known as Christendom, they errantly conclude that the heat will remain once the fires have been quenched simply because it takes time for the embers to die down.  Even for the committed and militant atheist, <a href=\"http://www.dailymail.co.uk/news/article-1333465/Liberias-General-Butt-Naked-The-evil-man-world.html\">this account of a modern-day Saul’s unexpected conversion</a> to Christianity should underline the central need for civilized religion to compete with the attractions of other religions.</p><blockquote><p>In the course of those days the priest has a vision: he meets the devil who tells him he will become a great warrior.  The devil says to increase his power he must continue the rituals of child sacrifice and cannibalism.  The initiation is complete and the priest is now one of the most powerful leaders in West Africa. The priest is 11 years old.   As prophesied, the boy priest grew up to become one of Liberia’s most notorious warlords: General Butt Naked….</p><p>It was the summer of 1996 and his clansmen were caught up in a ferocious battle.  It was decided that a sacrifice was needed. As the rockets rained down, a mother brought her three-year-old daughter to him.  Something about the child struck the pitiless General and for the first time in his life he hesitated.  As he relives the moment with me, his face becomes contorted.</p><p>‘The child was very unusually beautiful and kind. Most of the children are brought to me by the elders, they’re crying, they’re fighting. This child was peaceful,’ he recalls. ‘I thought, “This child must not die.” I struggled.</p><p>‘Of all of the thousands that I killed, I wish I did not kill that little girl . . . ‘ his voice trails off. He is close to tears for the first and only time. ‘Right after killing her, I had my epiphany.’</p><p>He claims he saw a white light in the shape of a man. A voice told him, ‘repent and live or refuse and die’. He believes it was Christ.</p><p>The impact was immediate. From that day the killing, the sacrifices and cannibalism ended and Blahyi entered a period of turmoil that led his men to believe he had gone mad. Within months he had left the Butt Naked Brigade and by the end of September 1996 he was baptised in the sea near Monrovia.</p></blockquote><p>Few in the West are conversant with the similarly hideous practices of the pagan Europeans that preceded their conversion to Christianity.  From the flaming human sacrifices of the druids to the ritual rape-and-murders of the Viking funerals, Europeans have been historically prone to behavior that is no less abhorrent to modern sensibilities than the cannibalistic devil-worship of Africans today.  There is no evidence whatsoever that a progressive secular society can survive for more than three generations; most of the evidence tends to indicate that it can’t even survive one.</p><p>The great irony is that the position of the scientific, anti-religious progressive is ultimately based on a non-scientific and religious foundation: an unshaken belief in the perfectability of Man and the inevitability of human progress towards religion-inspired behavior without religious belief.</p></div>",
  "content_text": "Being ignorant of history, the secularists of the West are naive in the extreme.  Having been raised the fruits amidst the societal inertia of the civilization once known as Christendom, they errantly conclude that the heat will remain once the fires have been quenched simply because it takes time for the embers to die down.  Even for the committed and militant atheist,\nthis account of a modern-day Saul’s unexpected conversion\nto Christianity should underline the central need for civilized religion to compete with the attractions of other religions.\nIn the course of those days the priest has a vision: he meets the devil who tells him he will become a great warrior.  The devil says to increase his power he must continue the rituals of child sacrifice and cannibalism.  The initiation is complete and the priest is now one of the most powerful leaders in West Africa. The priest is 11 years old.   As prophesied, the boy priest grew up to become one of Liberia’s most notorious warlords: General Butt Naked….\nIt was the summer of 1996 and his clansmen were caught up in a ferocious battle.  It was decided that a sacrifice was needed. As the rockets rained down, a mother brought her three-year-old daughter to him.  Something about the child struck the pitiless General and for the first time in his life he hesitated.  As he relives the moment with me, his face becomes contorted.\n‘The child was very unusually beautiful and kind. Most of the children are brought to me by the elders, they’re crying, they’re fighting. This child was peaceful,’ he recalls. ‘I thought, “This child must not die.” I struggled.\n‘Of all of the thousands that I killed, I wish I did not kill that little girl . . . ‘ his voice trails off. He is close to tears for the first and only time. ‘Right after killing her, I had my epiphany.’\nHe claims he saw a white light in the shape of a man. A voice told him, ‘repent and live or refuse and die’. He believes it was Christ.\nThe impact was immediate. From that day the killing, the sacrifices and cannibalism ended and Blahyi entered a period of turmoil that led his men to believe he had gone mad. Within months he had left the Butt Naked Brigade and by the end of September 1996 he was baptised in the sea near Monrovia.\nFew in the West are conversant with the similarly hideous practices of the pagan Europeans that preceded their conversion to Christianity.  From the flaming human sacrifices of the druids to the ritual rape-and-murders of the Viking funerals, Europeans have been historically prone to behavior that is no less abhorrent to modern sensibilities than the cannibalistic devil-worship of Africans today.  There is no evidence whatsoever that a progressive secular society can survive for more than three generations; most of the evidence tends to indicate that it can’t even survive one.\nThe great irony is that the position of the scientific, anti-religious progressive is ultimately based on a non-scientific and religious foundation: an unshaken belief in the perfectability of Man and the inevitability of human progress towards religion-inspired behavior without religious belief.",
  "tags": [
    "Christianity"
  ],
  "categories": [],
  "sitemap_lastmod": "2010-11-28T11:43:00+00:00"
}