{
  "url": "https://voxday.net/2010/11/07/economics-of-polygamy/",
  "scraped_at": "2026-01-08T23:42:04.370231",
  "title": "The economics of polygamy",
  "date_display": "November 7, 2010",
  "date_iso": "2010-11-07T13:38:00+00:00",
  "date_from_url": "2010-11-07",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>The Economicon explains why we can expect to see <a href=\"http://blog.mises.org/14520/polygamy-comes-out/\">polygamy embraced by the state</a> before too long:</p><blockquote><p>Legalizing polygamy, economist David Friedman wrote in his book <i>Hidden Order: The Economics of Everyday Life</i>, “allows some men who before wanted one wife to try to marry two instead — provided that they are willing to offer terms at which potential wives are willing to accept half a husband apiece. So the demand curve for wives shifts out. The supply curve stays the same, the demand curve shifts out, so the price must go up. Women are better off.”</p></blockquote><p>It’s very hard to argue with the economic law of supply and demand.  And the flipside of that is the recognition that most men will be worse off, with the obvious exception of those sufficiently rich and powerful enough to both support and attract multiple wives.  Given that the general trend of American society is already in motion towards the economic benefit of women in general and elite men in particular, the fact that legalized polygamy fits squarely upon this progressive trend line would appear to make it all but a done deal, especially if one takes into account the decline of traditionally monogamous Christian culture and its replacement by various pagan cultures that range from openly polygamous African and Arabic immigrant cultures to the practical polygamy of the secular divorce culture in which men financially support multiple wives and families while limiting their sexual involvement to the latest wife.</p><p>Keep in mind that from both practical and sociological perspectives, the legal status of a woman as an “ex-wife” rather than a “wife” is largely beside the point so long as the man is still responsible for being the primary provider for the familial unit.  And please note that I’m not at all interested in the various arguments that can reasonably be made for Christian polygamy on a theological basis as they are an irrelevant tangent in this societal context.</p><p>Being eminently practical beneath their superficially romantic exteriors, women can usually be relied upon to politically press for that which leads to the material advantage of their sex.  Notice how the historical commitment to “sexual equality” on the part of feminist activists was thrown entirely out the window once it was perceived that the pendulum had swung in the opposite direction.  This isn’t to say that millions of American women won’t be continue to be content in a monogamous state-licensed relationship, only that enough of them will be convinced of the material benefits and potential security of not being limited to one that they will be willing to provide the political horses required to ride through the cracks in the traditionalist wall made by the judidical homogamy advocates.</p><p>Moreover, invoking supply and demand again indicates that this is an obvious way to counteract the so-called male marriage strike.  As the supply of marriageable men dries up due to male inclination and/or male unemployment, the institution of legalized polygamy can not only make up for this shortage, but essentially render future supply deficiencies nonexistent.  If Roissy is correct about female hypergamy and “five minutes of Alpha are better than a lifetime of Beta [Gamma]”, then it can only be a matter of time before lower-status women begin to actively <i>demand</i> legal polygamy in order to expand their access to relationships with higher-status men capable of supporting them and their progeny.</p><p>The question ultimately boils down to whether women of the politically active sort would prefer half of Prince Charming’s castle to the entirety of a woodcutter’s cottage.  The acquisition of male assets through divorce was never going to work for long, as it only took forty years – a little less than two generations – for growing male awareness to break the traditional marital model and reduce marriage rates among the 25-34 age group from 80% to 45% and the overall rate to 52%.  In less than three generations from Ronald Reagan’s signing of the California no-fault divorce law in 1969, conventional monogamous marriage will no longer be the statistical norm.</p><p>So, women will either have to become the primary familial providers or they will turn to a different wealth distribution model.  Both history and economics strongly suggest the latter.</p></div>",
  "content_text": "The Economicon explains why we can expect to see\npolygamy embraced by the state\nbefore too long:\nLegalizing polygamy, economist David Friedman wrote in his book\nHidden Order: The Economics of Everyday Life\n, “allows some men who before wanted one wife to try to marry two instead — provided that they are willing to offer terms at which potential wives are willing to accept half a husband apiece. So the demand curve for wives shifts out. The supply curve stays the same, the demand curve shifts out, so the price must go up. Women are better off.”\nIt’s very hard to argue with the economic law of supply and demand.  And the flipside of that is the recognition that most men will be worse off, with the obvious exception of those sufficiently rich and powerful enough to both support and attract multiple wives.  Given that the general trend of American society is already in motion towards the economic benefit of women in general and elite men in particular, the fact that legalized polygamy fits squarely upon this progressive trend line would appear to make it all but a done deal, especially if one takes into account the decline of traditionally monogamous Christian culture and its replacement by various pagan cultures that range from openly polygamous African and Arabic immigrant cultures to the practical polygamy of the secular divorce culture in which men financially support multiple wives and families while limiting their sexual involvement to the latest wife.\nKeep in mind that from both practical and sociological perspectives, the legal status of a woman as an “ex-wife” rather than a “wife” is largely beside the point so long as the man is still responsible for being the primary provider for the familial unit.  And please note that I’m not at all interested in the various arguments that can reasonably be made for Christian polygamy on a theological basis as they are an irrelevant tangent in this societal context.\nBeing eminently practical beneath their superficially romantic exteriors, women can usually be relied upon to politically press for that which leads to the material advantage of their sex.  Notice how the historical commitment to “sexual equality” on the part of feminist activists was thrown entirely out the window once it was perceived that the pendulum had swung in the opposite direction.  This isn’t to say that millions of American women won’t be continue to be content in a monogamous state-licensed relationship, only that enough of them will be convinced of the material benefits and potential security of not being limited to one that they will be willing to provide the political horses required to ride through the cracks in the traditionalist wall made by the judidical homogamy advocates.\nMoreover, invoking supply and demand again indicates that this is an obvious way to counteract the so-called male marriage strike.  As the supply of marriageable men dries up due to male inclination and/or male unemployment, the institution of legalized polygamy can not only make up for this shortage, but essentially render future supply deficiencies nonexistent.  If Roissy is correct about female hypergamy and “five minutes of Alpha are better than a lifetime of Beta [Gamma]”, then it can only be a matter of time before lower-status women begin to actively\ndemand\nlegal polygamy in order to expand their access to relationships with higher-status men capable of supporting them and their progeny.\nThe question ultimately boils down to whether women of the politically active sort would prefer half of Prince Charming’s castle to the entirety of a woodcutter’s cottage.  The acquisition of male assets through divorce was never going to work for long, as it only took forty years – a little less than two generations – for growing male awareness to break the traditional marital model and reduce marriage rates among the 25-34 age group from 80% to 45% and the overall rate to 52%.  In less than three generations from Ronald Reagan’s signing of the California no-fault divorce law in 1969, conventional monogamous marriage will no longer be the statistical norm.\nSo, women will either have to become the primary familial providers or they will turn to a different wealth distribution model.  Both history and economics strongly suggest the latter.",
  "tags": [
    "society"
  ],
  "categories": [],
  "sitemap_lastmod": "2010-11-07T13:38:00+00:00"
}