{
  "url": "https://voxday.net/2010/11/13/et-tu-brauchli/",
  "scraped_at": "2026-01-08T23:42:41.323734",
  "title": "Et tu, Brauchli?",
  "date_display": "November 13, 2010",
  "date_iso": "2010-11-13T17:00:00+00:00",
  "date_from_url": "2010-11-13",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>My track record of political predictions is, admittedly, less than perfectly reliable.  But I would encourage you to keep two things in mind.  First, I make my predictions very far in advance of most opinion writers.  Second, even when I am wrong, the results usually show that I correctly anticipated the general trend.  For example, I was wrong about Hillary winning the 2008 Democratic nomination, but recall that I said she would win it back when the consensus was that she would stay in the Senate.</p><p>So, <a href=\"http://www.washingtonpost.com/wp-dyn/content/article/2010/11/12/AR2010111202846.html?sub=AR\">this unexpected editorial from the Washington Post</a> is therefore rather interesting in light of my supposedly crazy prediction that Obama is not going to be the Democratic nominee in 2012.</p><blockquote><p>This is a critical moment for the country. From the faltering economy to the burdensome deficit to our foreign policy struggles, America is suffering a widespread sense of crisis and anxiety about the future. Under these circumstances, Obama has the opportunity to seize the high ground and the imagination of the nation once again, and to galvanize the public for the hard decisions that must be made. The only way he can do so, though, is by putting national interests ahead of personal or political ones.</p><p>To that end, we believe Obama should announce immediately that he will not be a candidate for reelection in 2012…. We do not come to this conclusion lightly. But it is clear, we believe, that the president has largely lost the consent of the governed.</p></blockquote><p>He certainly has.  And if he’s lost the white independents, he’s lost the unemployed youth, he’s lost the Washington Post, and he’s losing the New York Times, how can he possibly expect to beat the Lizard Queen when she shows her true colors?  His only hope is to turn on the banks and ride the wave of popular discontent, but given the number of Goldmanites he’s appointed, I assume he’ll look for a golden parachute instead.</p><p>UPDATE: Whispers from Washington: “<i>I’m not claiming to know anyone important, just a bunch of old denizens of DC. Mostly they’re mid-level retired military who’ve found themselves a cozy life (that means $100Gs plus and their pensions) in the bureaucracy. Other “Ilk” will probably confirm what’s being said. I’ve been hearing for six months that Obama is erratic, irrational, and paranoid (he may have reason for that last one). It’s rumored the Democratic Leadership and the press have been covering this up since the night he was elected (something happened that night and there’s lots of different stories) but he’s gotten much worse. Every word he utters is canned and without a trace of spontaneity and this is being attributed to his use Anti-depressants… and worse.</i></p><p>Last week I heard that the NYTs (not the WP) was going to do an editorial asking him not to run in 2012. Running off to Diwali after the huge defeat was seen as the last straw. Apparently he’s not met with anyone from the Democratic party since the election debacle and refused to until this coming week. This has allowed Pelosi and her crew to make a move. A reasonable head of the Democratic party, Obama in this case, should have stopped that. But he didn’t to say the least. He left the party twisting in the winds of fate….  The most fantastic charge of all is that Joe Fucking Biden stays as far away from Obie as possible (and not the other way around as I’ve always assumed). Less surprising is Biden has brought up the 25th amendment. Not surprising in the sense that Biden wants to be prez and will never be elected.”</p></div>",
  "content_text": "My track record of political predictions is, admittedly, less than perfectly reliable.  But I would encourage you to keep two things in mind.  First, I make my predictions very far in advance of most opinion writers.  Second, even when I am wrong, the results usually show that I correctly anticipated the general trend.  For example, I was wrong about Hillary winning the 2008 Democratic nomination, but recall that I said she would win it back when the consensus was that she would stay in the Senate.\nSo,\nthis unexpected editorial from the Washington Post\nis therefore rather interesting in light of my supposedly crazy prediction that Obama is not going to be the Democratic nominee in 2012.\nThis is a critical moment for the country. From the faltering economy to the burdensome deficit to our foreign policy struggles, America is suffering a widespread sense of crisis and anxiety about the future. Under these circumstances, Obama has the opportunity to seize the high ground and the imagination of the nation once again, and to galvanize the public for the hard decisions that must be made. The only way he can do so, though, is by putting national interests ahead of personal or political ones.\nTo that end, we believe Obama should announce immediately that he will not be a candidate for reelection in 2012…. We do not come to this conclusion lightly. But it is clear, we believe, that the president has largely lost the consent of the governed.\nHe certainly has.  And if he’s lost the white independents, he’s lost the unemployed youth, he’s lost the Washington Post, and he’s losing the New York Times, how can he possibly expect to beat the Lizard Queen when she shows her true colors?  His only hope is to turn on the banks and ride the wave of popular discontent, but given the number of Goldmanites he’s appointed, I assume he’ll look for a golden parachute instead.\nUPDATE: Whispers from Washington: “\nI’m not claiming to know anyone important, just a bunch of old denizens of DC. Mostly they’re mid-level retired military who’ve found themselves a cozy life (that means $100Gs plus and their pensions) in the bureaucracy. Other “Ilk” will probably confirm what’s being said. I’ve been hearing for six months that Obama is erratic, irrational, and paranoid (he may have reason for that last one). It’s rumored the Democratic Leadership and the press have been covering this up since the night he was elected (something happened that night and there’s lots of different stories) but he’s gotten much worse. Every word he utters is canned and without a trace of spontaneity and this is being attributed to his use Anti-depressants… and worse.\nLast week I heard that the NYTs (not the WP) was going to do an editorial asking him not to run in 2012. Running off to Diwali after the huge defeat was seen as the last straw. Apparently he’s not met with anyone from the Democratic party since the election debacle and refused to until this coming week. This has allowed Pelosi and her crew to make a move. A reasonable head of the Democratic party, Obama in this case, should have stopped that. But he didn’t to say the least. He left the party twisting in the winds of fate….  The most fantastic charge of all is that Joe Fucking Biden stays as far away from Obie as possible (and not the other way around as I’ve always assumed). Less surprising is Biden has brought up the 25th amendment. Not surprising in the sense that Biden wants to be prez and will never be elected.”",
  "tags": [
    "politics"
  ],
  "categories": [],
  "sitemap_lastmod": "2010-11-13T17:00:00+00:00"
}