{
  "url": "https://voxday.net/2010/11/07/explaining-gamma/",
  "scraped_at": "2026-01-08T23:42:07.707465",
  "title": "Explaining Gamma",
  "date_display": "November 7, 2010",
  "date_iso": "2010-11-07T23:00:00+00:00",
  "date_from_url": "2010-11-07",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>Do you know the story of Snow White?  Then surely you remember how the seven dwarves took her in when she was homeless, provided her with food and shelter, and cared so much about her that they shed tears for her and built her a spectacular crystal <s>pedestal</s>bier.</p><p>And of course, you will recall that she ran off with Prince Charming at the very first opportunity.</p><p>Dwarves are Gammas.  Alphas are Prince Charmings.  Most men, being Betas and Deltas, fall somewhere in between and therefore face a choice about how to comport themselves in their interactions with the opposite sex.  But we can draw two important conclusions from the fairy tale.  One, behaving like a dwarf won’t get you the girl.  Two, Prince Charming doesn’t stick around to ask twice; if Snow White doesn’t want to get on the horse right away, he rides on without her.  It’s a big forest and there are plenty of girls on the girl tree.</p></div>",
  "content_text": "Do you know the story of Snow White?  Then surely you remember how the seven dwarves took her in when she was homeless, provided her with food and shelter, and cared so much about her that they shed tears for her and built her a spectacular crystal\npedestal\nbier.\nAnd of course, you will recall that she ran off with Prince Charming at the very first opportunity.\nDwarves are Gammas.  Alphas are Prince Charmings.  Most men, being Betas and Deltas, fall somewhere in between and therefore face a choice about how to comport themselves in their interactions with the opposite sex.  But we can draw two important conclusions from the fairy tale.  One, behaving like a dwarf won’t get you the girl.  Two, Prince Charming doesn’t stick around to ask twice; if Snow White doesn’t want to get on the horse right away, he rides on without her.  It’s a big forest and there are plenty of girls on the girl tree.",
  "tags": [
    "women"
  ],
  "categories": [],
  "sitemap_lastmod": "2010-11-07T23:00:00+00:00"
}