{
  "url": "https://voxday.net/2010/11/22/finally/",
  "scraped_at": "2026-01-08T23:43:29.068421",
  "title": "Finally!",
  "date_display": "November 22, 2010",
  "date_iso": "2010-11-22T18:19:00+00:00",
  "date_from_url": "2010-11-22",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>Childress <a href=\"http://profootballtalk.nbcsports.com/2010/11/22/vikings-fire-brad-childress/\">is gone</a>:</p><blockquote><p>Jay Glazer of FOX Sports is first reported, and the Vikings have confirmed, that Childress has been fired…. Defensive coordinator Leslie Frazier has been named the interim head coach for the rest of the 2010 season.</p></blockquote><p>I never thought I’d say this, but thank you Green Bay!  I have no confidence in Frazier, but I actively disliked Childress from the moment his hiring was announced.  I don’t even think Andy Reid is a good head coach – he’s a great <i>quarterbacks</i> coach, to be sure – so hiring someone who worked under Reid and didn’t even call the plays as his offensive coordinator seemed totally inexplicable.  The success the Vikings have had was the result of Rick Spielman’s work in bringing in good players; literally anyone could have achieved decent results with the talent he brought in.</p><p>One wonders how Wilf made his money, since handing Childress an extension last year when absolutely no one was offering him a job was one of the dumbest business decisions I’ve ever seen.  Now he’ll be paying for it.  I doubt any of the marquis coaches will have a lot of interest in the job, but I’d take a serious look at Brian Billick.  Anyone who can win a Super Bowl with Trent Dilfer at quarterback has something going on and I always liked his pre-game speech before the AFC Championship game against the favored Titans.</p><p>“When you go in the lion’s den, you don’t tippy toe in — you carry a spear, you go in screaming like a banshee, you kick whatever doors in, and say, ‘Where’s the son of a bitch?'”</p></div>",
  "content_text": "Childress\nis gone\n:\nJay Glazer of FOX Sports is first reported, and the Vikings have confirmed, that Childress has been fired…. Defensive coordinator Leslie Frazier has been named the interim head coach for the rest of the 2010 season.\nI never thought I’d say this, but thank you Green Bay!  I have no confidence in Frazier, but I actively disliked Childress from the moment his hiring was announced.  I don’t even think Andy Reid is a good head coach – he’s a great\nquarterbacks\ncoach, to be sure – so hiring someone who worked under Reid and didn’t even call the plays as his offensive coordinator seemed totally inexplicable.  The success the Vikings have had was the result of Rick Spielman’s work in bringing in good players; literally anyone could have achieved decent results with the talent he brought in.\nOne wonders how Wilf made his money, since handing Childress an extension last year when absolutely no one was offering him a job was one of the dumbest business decisions I’ve ever seen.  Now he’ll be paying for it.  I doubt any of the marquis coaches will have a lot of interest in the job, but I’d take a serious look at Brian Billick.  Anyone who can win a Super Bowl with Trent Dilfer at quarterback has something going on and I always liked his pre-game speech before the AFC Championship game against the favored Titans.\n“When you go in the lion’s den, you don’t tippy toe in — you carry a spear, you go in screaming like a banshee, you kick whatever doors in, and say, ‘Where’s the son of a bitch?'”",
  "tags": [
    "sports"
  ],
  "categories": [],
  "sitemap_lastmod": "2010-11-22T18:19:00+00:00"
}