{
  "url": "https://voxday.net/2010/11/23/greece-down-ireland-down-spain-is-nex/",
  "scraped_at": "2026-01-08T23:43:32.699116",
  "title": "Greece down, Ireland down, Spain is next",
  "date_display": "November 23, 2010",
  "date_iso": "2010-11-23T15:15:00+00:00",
  "date_from_url": "2010-11-23",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>The Irish government caved to the EU and IMF “rescue” team and is attempting to put Irish taxpayers for the next three generations on the hook for around $100 billion Euros in order to bail out the American and European banks that made bad loans into the Emerald Isle.  This is more than a little ironic; after shedding great quantities of Irish blood in an effort to free themselves from centuries of British rule, the Irish government <a href=\"http://www.irishtimes.com/newspaper/breaking/2010/1123/breaking4.html\">has placed the Irish people on the verge</a> of serfdom to a much crueler taskmaster.</p><blockquote><p>The EU-IMF rescue deal for Ireland hinges on the publication of the four-year plan and the passing of the budget, the Government has insisted. Minister for Transport Noel Dempsey said this morning the rescue package was contingent on the budget being approved by the Dáil on December 7th….  Minister for Finance Brian Lehihan said passing the budget is vital.</p><p>“We need to pass this budget, we need to publish this plan tomorrow, which we will doing,” he said. The plan has been finalised, the budget will be introduced and the necessary funding will be obtained. They’re the priorities for this country at present.”</p></blockquote><p>It is interesting how the people of Iceland’s decision to spurn being “saved” has not been covered by the media.  Instead of pledging their future income to bail out their bankers, they are prosecuting them.  If the Irish people do not wish to return to serfdom, they will have to follow the Icelandic example and choose to default on the massive bank debts that their government elected to accept last year.</p><p>And in the meantime, Spanish bond yields have increased to 224 points over U.S. treasuries, 67 more than one year ago.</p></div>",
  "content_text": "The Irish government caved to the EU and IMF “rescue” team and is attempting to put Irish taxpayers for the next three generations on the hook for around $100 billion Euros in order to bail out the American and European banks that made bad loans into the Emerald Isle.  This is more than a little ironic; after shedding great quantities of Irish blood in an effort to free themselves from centuries of British rule, the Irish government\nhas placed the Irish people on the verge\nof serfdom to a much crueler taskmaster.\nThe EU-IMF rescue deal for Ireland hinges on the publication of the four-year plan and the passing of the budget, the Government has insisted. Minister for Transport Noel Dempsey said this morning the rescue package was contingent on the budget being approved by the Dáil on December 7th….  Minister for Finance Brian Lehihan said passing the budget is vital.\n“We need to pass this budget, we need to publish this plan tomorrow, which we will doing,” he said. The plan has been finalised, the budget will be introduced and the necessary funding will be obtained. They’re the priorities for this country at present.”\nIt is interesting how the people of Iceland’s decision to spurn being “saved” has not been covered by the media.  Instead of pledging their future income to bail out their bankers, they are prosecuting them.  If the Irish people do not wish to return to serfdom, they will have to follow the Icelandic example and choose to default on the massive bank debts that their government elected to accept last year.\nAnd in the meantime, Spanish bond yields have increased to 224 points over U.S. treasuries, 67 more than one year ago.",
  "tags": [
    "banks"
  ],
  "categories": [],
  "sitemap_lastmod": "2010-11-23T15:15:00+00:00"
}