{
  "url": "https://voxday.net/2010/11/29/heroism-of-wikileaks/",
  "scraped_at": "2026-01-08T23:43:59.792008",
  "title": "The heroism of WikiLeaks",
  "date_display": "November 29, 2010",
  "date_iso": "2010-11-29T18:15:00+00:00",
  "date_from_url": "2010-11-29",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>And the lunacy of Government Newspeak.  We have truly reached a point of no return if the provision of accurate information to the people about what their supposedly democratic government is doing <a href=\"http://news.cnet.com/8301-13578_3-20023941-38.html?tag=cnetRiver\">is equated with <i>terrorism</i></a> by their so-called leaders:</p><blockquote><p>The incoming chairman of the House Homeland Security Committee says WikiLeaks should be officially designated as a terrorist organization.  Rep. Peter King (R-N.Y.), the panel’s presumptive next head, asked the Obama administration today to “determine whether WikiLeaks could be designated a foreign terrorist organization,” putting the group in the same company as Al Qaeda and Aum Shinrikyo, the Japanese cult that released deadly sarin gas on the Tokyo subway.</p><p>“WikiLeaks appears to meet the legal criteria” of a U.S.-designated terrorist organization, King wrote in a letter to Secretary of State Hillary Clinton reviewed by CNET. He added: “WikiLeaks presents a clear and present danger to the national security of the United States.”</p></blockquote><p>If WikiLeaks meets the legal criteria of a “U.S.-designated terrorist organization” then so does Wikipedia and the Encyclopedia Britannica.  Governments always want to operate in the dark and keep their subjects in ignorance, which is why Julian Assange should not be assailed by the American people, he should be awarded the Presidential Medal of Freedom, regardless of whatever his motivations in making all of this information available to the public might be.</p><p>WikiLeaks is nothing more or less than a technological blow for American freedom.  Assange is no traitor; the accusation doesn’t even make sense considering that he has absolutely no connection with the United States.  But it should come as no surprise to the readers of this blog that the verbal attack against the organization is being led by one of those freedom-loving Republicans.</p><p>Moreover, the crocodile tears of those in the media who fear that the release of information to the public will “get people killed” is absolutely ludicrous given their support for the ongoing military occupations that have killed hundreds of thousands more people than any number of leaks possibly could.  In fact, to the extent that WikiLeaks permits Americans to force an end to their leaders’ pointless and unpopular wars, it will almost certainly save lives. After all, when one considers that numerous American leaders have waxed bellicose about the need to go to war to prevent Iran getting nukes, wouldn’t it be pertinent for them to know that <a href=\"http://www.washingtontimes.com/news/2010/nov/28/wikileaks-releases-state-reports/\">China is actively helping Iran</a> obtain them?</p><p><i>“More than 250,000 classified State Department reports made public on Sunday reveal that China was urged to stop shipments through Beijing of missiles from North Korea to Iran, and that Saudi Arabia’s monarch urged the United States to attack Iran’s nuclear facilities.”</i></p></div>",
  "content_text": "And the lunacy of Government Newspeak.  We have truly reached a point of no return if the provision of accurate information to the people about what their supposedly democratic government is doing\nis equated with\nterrorism\nby their so-called leaders:\nThe incoming chairman of the House Homeland Security Committee says WikiLeaks should be officially designated as a terrorist organization.  Rep. Peter King (R-N.Y.), the panel’s presumptive next head, asked the Obama administration today to “determine whether WikiLeaks could be designated a foreign terrorist organization,” putting the group in the same company as Al Qaeda and Aum Shinrikyo, the Japanese cult that released deadly sarin gas on the Tokyo subway.\n“WikiLeaks appears to meet the legal criteria” of a U.S.-designated terrorist organization, King wrote in a letter to Secretary of State Hillary Clinton reviewed by CNET. He added: “WikiLeaks presents a clear and present danger to the national security of the United States.”\nIf WikiLeaks meets the legal criteria of a “U.S.-designated terrorist organization” then so does Wikipedia and the Encyclopedia Britannica.  Governments always want to operate in the dark and keep their subjects in ignorance, which is why Julian Assange should not be assailed by the American people, he should be awarded the Presidential Medal of Freedom, regardless of whatever his motivations in making all of this information available to the public might be.\nWikiLeaks is nothing more or less than a technological blow for American freedom.  Assange is no traitor; the accusation doesn’t even make sense considering that he has absolutely no connection with the United States.  But it should come as no surprise to the readers of this blog that the verbal attack against the organization is being led by one of those freedom-loving Republicans.\nMoreover, the crocodile tears of those in the media who fear that the release of information to the public will “get people killed” is absolutely ludicrous given their support for the ongoing military occupations that have killed hundreds of thousands more people than any number of leaks possibly could.  In fact, to the extent that WikiLeaks permits Americans to force an end to their leaders’ pointless and unpopular wars, it will almost certainly save lives. After all, when one considers that numerous American leaders have waxed bellicose about the need to go to war to prevent Iran getting nukes, wouldn’t it be pertinent for them to know that\nChina is actively helping Iran\nobtain them?\n“More than 250,000 classified State Department reports made public on Sunday reveal that China was urged to stop shipments through Beijing of missiles from North Korea to Iran, and that Saudi Arabia’s monarch urged the United States to attack Iran’s nuclear facilities.”",
  "tags": [
    "politics"
  ],
  "categories": [],
  "sitemap_lastmod": "2010-11-29T18:15:00+00:00"
}