{
  "url": "https://voxday.net/2010/11/30/incompetent-economist-at-ny/",
  "scraped_at": "2026-01-08T23:44:03.434190",
  "title": "An incompetent economist at the NYT",
  "date_display": "November 30, 2010",
  "date_iso": "2010-11-30T00:50:00+00:00",
  "date_from_url": "2010-11-30",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>It’s little wonder <a href=\"http://www.nytimes.com/2005/09/01/business/01scene.html?_r=1\">they can’t figure out</a> that we’re in a depression.</p><blockquote><p>Virtually all economists consider opportunity cost a central concept. Yet a recent study by Paul J. Ferraro and Laura O. Taylor of Georgia State University suggests that most professional economists may not really understand it. At the 2005 annual meetings of the American Economic Association, the researchers asked almost 200 professional economists to answer this question:</p><p>“You won a free ticket to see an Eric Clapton concert (which has no resale value). Bob Dylan is performing on the same night and is your next-best alternative activity. Tickets to see Dylan cost $40. On any given day, you would be willing to pay up to $50 to see Dylan. Assume there are no other costs of seeing either performer. Based on this information, what is the opportunity cost of seeing Eric Clapton? (a) $0, (b) $10, (c) $40, or (d) $50.”</p><p>The opportunity cost of seeing Clapton is the total value of everything you must sacrifice to attend his concert – namely, the value to you of attending the Dylan concert. That value is $10 – the difference between the $50 that seeing his concert would be worth to you and the $40 you would have to pay for a ticket. So the unambiguously correct answer to the question is $10. Yet only 21.6 percent of the professional economists surveyed chose that answer, a smaller percentage than if they had chosen randomly.</p></blockquote><p>This is completely wrong and the 27.6 percent of economists who answered (d) $50 were correct.  Remember, the question posed states that the opportunity cost is the total value of everything you must sacrifice to attend the Clapton concert.  The total value of the Dylan concert to you is $50.  In attending the Clapton concert, you do not attend the Dylan concert <i>which you valued at $50</i>.  Therefore, the opportunity cost to you is $50 even though not going to see Dylan meant that you didn’t have to pay the $40 you would have otherwise had to pay for a ticket.  Opportunity cost is a cost, it is not the net of cost minus implied savings.</p><p>In order to incorrectly claiming the correct answer is $10, Robert Frank has to change his definition of opportunity cost from “the total value of everything you must sacrifice” to a nonsensical one that factors in things that you might have otherwise had to sacrifice but didn’t.  Based on the example given, it doesn’t matter what the cost of the Dylan ticket is.  Whether the Dylan ticket costs $5 or $500, the opportunity cost of going to see Clapton for free is still $50 <i>because that is the value that you place on seeing Dylan and you did not see him</i>.  The fact that you didn’t spend $40 on a Dylan ticket is irrelevant; why not throw in $5 for the pizza you didn’t buy and another $150,000 for the Lamborghini you didn’t buy either as well: by Frank’s bizarre reckoning, the opportunity cost of seeing Clapton will leave you with a profit of $150,015!</p><p>To put it in terms that even non-economists should be able to understand, let us consider Archie’s Dilemma.  When contemplating choosing Veronica (who is on the pill) over Betty (who isn’t), the opportunity cost of nailing the brunette is NOT not banging the blonde less the price of a condom, it is simply not banging the blonde.</p><p>Like most Keynesians and monetarists, (and most mainstream economists are one or the other), neither Frank nor the authors of the study understand that value is subjective, not objective, and so they make their usual mistake of running arbitrary numbers through meaningless formulas and ending up with a result that is not so much inaccurate as indefensible and irrelevant.  I strongly suspect that a basic mistake was made in formulating the question, since a more meaningful way of structuring the question would be to attach a price to the <i>Clapton</i> ticket.</p><p>If, for example, both concert tickets cost $40, then the opportunity cost of going to the Clapton concert would have been $90, $40 for the Clapton ticket and $50 for the sacrificed value of the unattended Dylan concert.  Either the study’s authors meant to trick the AEA economists by posing an incredibly simple question or they made a rather stupid mistake.  Regardless, Tyler Cowen of Marginal Revolution <a href=\"http://www.marginalrevolution.com/marginalrevolution/2005/09/medieval_disqui.html\">ends up with the right answer</a> although I don’t think he quite grasped the precise problem with the question and Mr. Frank, the study’s authors, and 21.6 percent of the AEA economists are wrong.</p><p>If Paul Krugman had posted this conundrum, the correct answer would have been (e) opportunity cost and the limits of the space-time continuum are barbarous right-wing relics so borrow $40 and attend <i>both</i> concerts.</p><p>UPDATE: Since various people are tripping all over their various attempts to define “opportunity cost” instead of paying attention to how it was defined in the question, I will highlight the relevant portion of the question posed by Frank here.</p><p><b>“The opportunity cost of seeing Clapton” is the total value of everything you must sacrifice to attend his concert – namely, the value to you of attending the Dylan concert.”</b></p><p>The value of attending the Dylan concert to you is $50.  This means the value of the discount on the ticket is $10.  Now, it’s vital to note that Frank assigns TWO distinctly different definitions to “the opportunity cost of seeing Clapton” in his question, thus conclusively proving his point that economists, especially economists writing in the New York Times, don’t understand opportunity cost.  Naturally, there are two different answers to the two different questions-in-the-question.  The answer to question (A) the “total value of everything you must sacrifice”, is $60 since you’re giving up both the value of the Dylan concert and the value of the discount in order to see Clapton.  The answer to question (B) the “value to you of attending the Dylan concert” is $50.  However, the four multiple choices provided make it clear that Frank is looking for an answer to question (B) rather than question (A), which is why the correct answer is (d) $50.</p></div>",
  "content_text": "It’s little wonder\nthey can’t figure out\nthat we’re in a depression.\nVirtually all economists consider opportunity cost a central concept. Yet a recent study by Paul J. Ferraro and Laura O. Taylor of Georgia State University suggests that most professional economists may not really understand it. At the 2005 annual meetings of the American Economic Association, the researchers asked almost 200 professional economists to answer this question:\n“You won a free ticket to see an Eric Clapton concert (which has no resale value). Bob Dylan is performing on the same night and is your next-best alternative activity. Tickets to see Dylan cost $40. On any given day, you would be willing to pay up to $50 to see Dylan. Assume there are no other costs of seeing either performer. Based on this information, what is the opportunity cost of seeing Eric Clapton? (a) $0, (b) $10, (c) $40, or (d) $50.”\nThe opportunity cost of seeing Clapton is the total value of everything you must sacrifice to attend his concert – namely, the value to you of attending the Dylan concert. That value is $10 – the difference between the $50 that seeing his concert would be worth to you and the $40 you would have to pay for a ticket. So the unambiguously correct answer to the question is $10. Yet only 21.6 percent of the professional economists surveyed chose that answer, a smaller percentage than if they had chosen randomly.\nThis is completely wrong and the 27.6 percent of economists who answered (d) $50 were correct.  Remember, the question posed states that the opportunity cost is the total value of everything you must sacrifice to attend the Clapton concert.  The total value of the Dylan concert to you is $50.  In attending the Clapton concert, you do not attend the Dylan concert\nwhich you valued at $50\n.  Therefore, the opportunity cost to you is $50 even though not going to see Dylan meant that you didn’t have to pay the $40 you would have otherwise had to pay for a ticket.  Opportunity cost is a cost, it is not the net of cost minus implied savings.\nIn order to incorrectly claiming the correct answer is $10, Robert Frank has to change his definition of opportunity cost from “the total value of everything you must sacrifice” to a nonsensical one that factors in things that you might have otherwise had to sacrifice but didn’t.  Based on the example given, it doesn’t matter what the cost of the Dylan ticket is.  Whether the Dylan ticket costs $5 or $500, the opportunity cost of going to see Clapton for free is still $50\nbecause that is the value that you place on seeing Dylan and you did not see him\n.  The fact that you didn’t spend $40 on a Dylan ticket is irrelevant; why not throw in $5 for the pizza you didn’t buy and another $150,000 for the Lamborghini you didn’t buy either as well: by Frank’s bizarre reckoning, the opportunity cost of seeing Clapton will leave you with a profit of $150,015!\nTo put it in terms that even non-economists should be able to understand, let us consider Archie’s Dilemma.  When contemplating choosing Veronica (who is on the pill) over Betty (who isn’t), the opportunity cost of nailing the brunette is NOT not banging the blonde less the price of a condom, it is simply not banging the blonde.\nLike most Keynesians and monetarists, (and most mainstream economists are one or the other), neither Frank nor the authors of the study understand that value is subjective, not objective, and so they make their usual mistake of running arbitrary numbers through meaningless formulas and ending up with a result that is not so much inaccurate as indefensible and irrelevant.  I strongly suspect that a basic mistake was made in formulating the question, since a more meaningful way of structuring the question would be to attach a price to the\nClapton\nticket.\nIf, for example, both concert tickets cost $40, then the opportunity cost of going to the Clapton concert would have been $90, $40 for the Clapton ticket and $50 for the sacrificed value of the unattended Dylan concert.  Either the study’s authors meant to trick the AEA economists by posing an incredibly simple question or they made a rather stupid mistake.  Regardless, Tyler Cowen of Marginal Revolution\nends up with the right answer\nalthough I don’t think he quite grasped the precise problem with the question and Mr. Frank, the study’s authors, and 21.6 percent of the AEA economists are wrong.\nIf Paul Krugman had posted this conundrum, the correct answer would have been (e) opportunity cost and the limits of the space-time continuum are barbarous right-wing relics so borrow $40 and attend\nboth\nconcerts.\nUPDATE: Since various people are tripping all over their various attempts to define “opportunity cost” instead of paying attention to how it was defined in the question, I will highlight the relevant portion of the question posed by Frank here.\n“The opportunity cost of seeing Clapton” is the total value of everything you must sacrifice to attend his concert – namely, the value to you of attending the Dylan concert.”\nThe value of attending the Dylan concert to you is $50.  This means the value of the discount on the ticket is $10.  Now, it’s vital to note that Frank assigns TWO distinctly different definitions to “the opportunity cost of seeing Clapton” in his question, thus conclusively proving his point that economists, especially economists writing in the New York Times, don’t understand opportunity cost.  Naturally, there are two different answers to the two different questions-in-the-question.  The answer to question (A) the “total value of everything you must sacrifice”, is $60 since you’re giving up both the value of the Dylan concert and the value of the discount in order to see Clapton.  The answer to question (B) the “value to you of attending the Dylan concert” is $50.  However, the four multiple choices provided make it clear that Frank is looking for an answer to question (B) rather than question (A), which is why the correct answer is (d) $50.",
  "tags": [
    "economics"
  ],
  "categories": [],
  "sitemap_lastmod": "2010-11-30T00:50:00+00:00"
}