{
  "url": "https://voxday.net/2010/11/13/initial-impressions-of-moral-landscape/",
  "scraped_at": "2026-01-08T23:42:39.472415",
  "title": "Initial impressions ofThe Moral Landscape",
  "date_display": "November 13, 2010",
  "date_iso": "2010-11-13T09:20:00+00:00",
  "date_from_url": "2010-11-13",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>I tend to do a lot of light reading while I travel, but amidst gorging on a cornucopia of PG Wodehouse novels I also managed to bookmark my way through Sam Harris’s latest book, <i>The Moral Landscape</i>.  It was every bit as disjointed, illogical, and rife with incompetent and incoherent arguments as his first two books would lead one to expect.  It was also disturbingly petty in parts; I don’t think he has any idea how bad his quixotic public jihad against Francis Collins has made him look in the scientific community.  Despite the plethora of reflexive anti-religious cheap shots, the book is actually much more an attack on the greater part of the secular scientific community, (especially Jonathan Haidt and Scott Atran), than it is on the theistic community.  While the Nobel laureate’s minor scientific achievements do tend to render one of Sam’s core arguments laughable, that doesn’t suffice to account for his decision to devote <i>nearly an entire chapter</i> of a five-chapter book to a completely irrelevant attack on single individual.</p><p>Here is one example of classic Harrisian illogic of the sort that litters the book from <a href=\"http://www.wired.com/magazine/2010/11/pl_print_harris/\">a recent Wired interview</a>:</p><p><i>WIRED: <b>[H]asn’t religion made some people behave more morally?</b></i></p><p>HARRIS: The problem is that religion tends to give people bad reasons to be good. Is it better to alleviate famine in Africa because you think Jesus Christ is watching and deciding whether to reward you with an eternity of happiness after death? Or is it better to do that because you actually care about the suffering of your fellow human beings?</p><p>First, note that Harris doesn’t answer the question, except to implicitly accept it.  Second, observe that he fails to make the rational response that a) it doesn’t matter why you do something, the morality is primarily to be found in the act, not the intention, and b) there is no reason to believe that the two motivations are mutually exclusive, in fact, there is substantial evidence to indicate that the two usually coincide.  It’s a false and irrelevant dichotomy.  And third, you really can’t understand the degree to which this response demonstrates Harris’s inimitable incoherence if you haven’t read his section declaring himself to be a <i>consequentialist</i>.  Apparently he is that rare breed of consequentialist who doesn’t care about the consequences.</p><p>Sam is to be congratulated, however, for being a man about the disappointing results of his neurological research.  I helped him refine a few of the religious questions for the fMRI experiments he discusses, and as it turned out, his hypothesis that there would be an observable difference in brain activity when contemplating factual beliefs versus religious beliefs was incorrect.  This was Sam’s conclusion: <i>“Our study was designed to elicit the same responses from the two groups on nonreligious stimuli (e.g., “Eagles really exist”) and opposite responses on religious stimuli (e.g., “Angels really exist”). The fact that we obtained essentially the same result for belief in both devout Christians and nonbelievers, on both categories of content, argues strongly that the difference between belief and disbelief is the same, regardless of what is being thought about.”</i></p><p>What Sam neglects to mention is that it also indicates that there is no difference between the two categories of belief, thus removing from his potential arsenal what he had hoped would be a substantive scientific argument in his war on faith.  If he had been able to show there was an observable material difference between the two types of belief, he would have used that to make a case for the superiority of one over the other; I surmise that was the primary motivation for the experiment.  However, his experiments did produce some interesting results, including the fact that it appears to give atheists a sense of pleasure to deny religious statements.  So, ironically, Sam Harris would appear to have produced the first <i>scientific evidence</i> in support of <i>my</i> hypothesis that it is often <a href=\"http://1.bp.blogspot.com/_3UXl0oMYPLs/SXWZGAYJf8I/AAAAAAAAAFo/tiHGbGA9JMY/s1600-h/atheism-nogod.jpg\">the assholery that causes the atheism</a> rather than the other way around.  On which note, I would be remiss indeed if I did not quote to the following comment from the appendix:</p><p>“<i>Given my experience as a critic of religion, I must say that it has been quite disconcerting to see the caricature of the overeducated, atheistic moral nihilist regularly appearing in my inbox and on the blogs. I sincerely hope that people like Rick Warren have not been paying attention.”</i><br> – Sam Harris, <i>The Moral Landscape</i>, Chapter 1 Note 2</br></p><p>Anyhow, I don’t intend this to be either a review or a critique of the book, I merely intended to pose a question to those of you who are interested in this subject.  How would you like me to review <i>The Moral Landscape</i>, in an overall summary, a chapter-by-chapter deconstruction, a thematic critique, or a simple list of the erroneous arguments I noted in the course of reading the book. I can tell you right now that I’m not going to write an entire bloody book as I did with TIA; the book doesn’t even begin to justify that sort of time and effort.  I’m not a big fan of the chapter-by-chapter approach since most people who use it make the mistake of anticipatory criticism since they don’t read the whole book before jumping in, but in this case that wouldn’t apply since I have read the entire book as well as the notes.  On the other hand, the book is only five chapters and the chapters don’t really stick to coherent themes, so it may not make sense anyhow.</p></div>",
  "content_text": "I tend to do a lot of light reading while I travel, but amidst gorging on a cornucopia of PG Wodehouse novels I also managed to bookmark my way through Sam Harris’s latest book,\nThe Moral Landscape\n.  It was every bit as disjointed, illogical, and rife with incompetent and incoherent arguments as his first two books would lead one to expect.  It was also disturbingly petty in parts; I don’t think he has any idea how bad his quixotic public jihad against Francis Collins has made him look in the scientific community.  Despite the plethora of reflexive anti-religious cheap shots, the book is actually much more an attack on the greater part of the secular scientific community, (especially Jonathan Haidt and Scott Atran), than it is on the theistic community.  While the Nobel laureate’s minor scientific achievements do tend to render one of Sam’s core arguments laughable, that doesn’t suffice to account for his decision to devote\nnearly an entire chapter\nof a five-chapter book to a completely irrelevant attack on single individual.\nHere is one example of classic Harrisian illogic of the sort that litters the book from\na recent Wired interview\n:\nWIRED:\n[H]asn’t religion made some people behave more morally?\nHARRIS: The problem is that religion tends to give people bad reasons to be good. Is it better to alleviate famine in Africa because you think Jesus Christ is watching and deciding whether to reward you with an eternity of happiness after death? Or is it better to do that because you actually care about the suffering of your fellow human beings?\nFirst, note that Harris doesn’t answer the question, except to implicitly accept it.  Second, observe that he fails to make the rational response that a) it doesn’t matter why you do something, the morality is primarily to be found in the act, not the intention, and b) there is no reason to believe that the two motivations are mutually exclusive, in fact, there is substantial evidence to indicate that the two usually coincide.  It’s a false and irrelevant dichotomy.  And third, you really can’t understand the degree to which this response demonstrates Harris’s inimitable incoherence if you haven’t read his section declaring himself to be a\nconsequentialist\n.  Apparently he is that rare breed of consequentialist who doesn’t care about the consequences.\nSam is to be congratulated, however, for being a man about the disappointing results of his neurological research.  I helped him refine a few of the religious questions for the fMRI experiments he discusses, and as it turned out, his hypothesis that there would be an observable difference in brain activity when contemplating factual beliefs versus religious beliefs was incorrect.  This was Sam’s conclusion:\n“Our study was designed to elicit the same responses from the two groups on nonreligious stimuli (e.g., “Eagles really exist”) and opposite responses on religious stimuli (e.g., “Angels really exist”). The fact that we obtained essentially the same result for belief in both devout Christians and nonbelievers, on both categories of content, argues strongly that the difference between belief and disbelief is the same, regardless of what is being thought about.”\nWhat Sam neglects to mention is that it also indicates that there is no difference between the two categories of belief, thus removing from his potential arsenal what he had hoped would be a substantive scientific argument in his war on faith.  If he had been able to show there was an observable material difference between the two types of belief, he would have used that to make a case for the superiority of one over the other; I surmise that was the primary motivation for the experiment.  However, his experiments did produce some interesting results, including the fact that it appears to give atheists a sense of pleasure to deny religious statements.  So, ironically, Sam Harris would appear to have produced the first\nscientific evidence\nin support of\nmy\nhypothesis that it is often\nthe assholery that causes the atheism\nrather than the other way around.  On which note, I would be remiss indeed if I did not quote to the following comment from the appendix:\n“\nGiven my experience as a critic of religion, I must say that it has been quite disconcerting to see the caricature of the overeducated, atheistic moral nihilist regularly appearing in my inbox and on the blogs. I sincerely hope that people like Rick Warren have not been paying attention.”\n– Sam Harris,\nThe Moral Landscape\n, Chapter 1 Note 2\nAnyhow, I don’t intend this to be either a review or a critique of the book, I merely intended to pose a question to those of you who are interested in this subject.  How would you like me to review\nThe Moral Landscape\n, in an overall summary, a chapter-by-chapter deconstruction, a thematic critique, or a simple list of the erroneous arguments I noted in the course of reading the book. I can tell you right now that I’m not going to write an entire bloody book as I did with TIA; the book doesn’t even begin to justify that sort of time and effort.  I’m not a big fan of the chapter-by-chapter approach since most people who use it make the mistake of anticipatory criticism since they don’t read the whole book before jumping in, but in this case that wouldn’t apply since I have read the entire book as well as the notes.  On the other hand, the book is only five chapters and the chapters don’t really stick to coherent themes, so it may not make sense anyhow.",
  "tags": [
    "atheism",
    "books"
  ],
  "categories": [],
  "sitemap_lastmod": "2010-11-13T09:20:00+00:00"
}