{
  "url": "https://voxday.net/2010/11/10/intellectual-rigor-mortis/",
  "scraped_at": "2026-01-08T23:42:22.898993",
  "title": "Intellectual rigor mortis",
  "date_display": "November 10, 2010",
  "date_iso": "2010-11-10T08:57:00+00:00",
  "date_from_url": "2010-11-10",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>Ann Althouse succinctly encapsulates <a href=\"http://althouse.blogspot.com/2010/11/huffpo-introduces-divorce-section.html\">why most women are so uninteresting</a>:</p><blockquote><p>Two divorced women went out walking, and what do you think they talked about? Philosophy?</p></blockquote><p>I have to admit, that made me laugh.  If there is anything less interesting than a divorcee, of either sex, going on and on about their former spouse more than 10 years post-divorce, it probably has something to do with organic chemistry.  And yet I have no doubt that the new Divorce section of the Huffington Post and its aphoristic motto of “His happiness is a small price to pay for my freedom!” will find a large and appreciative female readership.</p><p>In reading Althouse’s post, another aphorism insensibly came to mind: <i>“Great minds discuss ideas. Average minds discuss events. Small minds discuss people.”</i> – Eleanor Roosevelt.</p><p>Unsurprisingly, Ms Ephron’s narcissistic motto is reflective of the fundamental female miscalculation that leads to so many divorces these days.  First, “unhappily married adults who divorced were no more likely to report emotional and psychological improvements than those who stayed married” according to a study entitled “<a href=\"http://www.americanvalues.org/html/r-unhappy_ii.html\">Does Divorce Make People Happy</a>?”  Second, even if men don’t become happier after divorce, they are materially better off, whereas the opposite is true for women according to the Institute for Social and Economic Research. <i>“Divorce makes men – and particularly fathers – significantly richer. When a father separates from the mother of his children, according to new research, his available income increases by around one third. Women, in contrast, suffer severe financial penalties. Regardless of whether she has children, the average woman’s income falls by more than a fifth and remains low for many years.”</i></p><p>This is one reason why <a href=\"http://www.dailymail.co.uk/news/article-1321438/Recession-hits-women-harder-men-female-bankruptcy-soars.html\">nearly three times more women are filing bankruptcy</a> than men now.  In times of investment booms and expanding wealth, everyone has an economic margin of error and can afford to do stupid things like get divorced for shallow, superficial, and ephemeral reasons.  Contractionary times are considerably less forgiving and make it more important to not only have a partner upon whom you can rely, but be a reliable partner yourself as well.</p><p>On a tangential note, I suspect that many women would do well to learn from Spacebunny’s understanding that while the male mind is not wholly unconcerned with the lives of those around them, it does tend to be focused on other, more significant matters.  By way of example, this morning I told her the <i>extremely exciting</i> news that one heroic lion of technology has <i><a href=\"http://groups.google.com/group/candy-apple-user-group\">ported WinApple to Android</a>!</i> You know what that means, that’s right, the entire Ultima series, starting with Akalabeth, <i>on your phone</i>.  And Wizardry.  And Swashbuckler.  In fact, you might even be able to fit <i>the entire Asimov achive</i> on it!  Strangely, she did not react with the celebratory glee and happy dance that one would naturally expect upon learning of such a grand leap forward in the human race’s mobile standard of living.  Instead, she responded with little more than an amused smile and a complete non sequitor.  “I am totally superfluous in your world.”</p><p>Now, what man could fail to love a woman who obviously knows that <i>Call of Duty: Black Ops</i> was released on Monday?</p></div>",
  "content_text": "Ann Althouse succinctly encapsulates\nwhy most women are so uninteresting\n:\nTwo divorced women went out walking, and what do you think they talked about? Philosophy?\nI have to admit, that made me laugh.  If there is anything less interesting than a divorcee, of either sex, going on and on about their former spouse more than 10 years post-divorce, it probably has something to do with organic chemistry.  And yet I have no doubt that the new Divorce section of the Huffington Post and its aphoristic motto of “His happiness is a small price to pay for my freedom!” will find a large and appreciative female readership.\nIn reading Althouse’s post, another aphorism insensibly came to mind:\n“Great minds discuss ideas. Average minds discuss events. Small minds discuss people.”\n– Eleanor Roosevelt.\nUnsurprisingly, Ms Ephron’s narcissistic motto is reflective of the fundamental female miscalculation that leads to so many divorces these days.  First, “unhappily married adults who divorced were no more likely to report emotional and psychological improvements than those who stayed married” according to a study entitled “\nDoes Divorce Make People Happy\n?”  Second, even if men don’t become happier after divorce, they are materially better off, whereas the opposite is true for women according to the Institute for Social and Economic Research.\n“Divorce makes men – and particularly fathers – significantly richer. When a father separates from the mother of his children, according to new research, his available income increases by around one third. Women, in contrast, suffer severe financial penalties. Regardless of whether she has children, the average woman’s income falls by more than a fifth and remains low for many years.”\nThis is one reason why\nnearly three times more women are filing bankruptcy\nthan men now.  In times of investment booms and expanding wealth, everyone has an economic margin of error and can afford to do stupid things like get divorced for shallow, superficial, and ephemeral reasons.  Contractionary times are considerably less forgiving and make it more important to not only have a partner upon whom you can rely, but be a reliable partner yourself as well.\nOn a tangential note, I suspect that many women would do well to learn from Spacebunny’s understanding that while the male mind is not wholly unconcerned with the lives of those around them, it does tend to be focused on other, more significant matters.  By way of example, this morning I told her the\nextremely exciting\nnews that one heroic lion of technology has\nported WinApple to Android\n!\nYou know what that means, that’s right, the entire Ultima series, starting with Akalabeth,\non your phone\n.  And Wizardry.  And Swashbuckler.  In fact, you might even be able to fit\nthe entire Asimov achive\non it!  Strangely, she did not react with the celebratory glee and happy dance that one would naturally expect upon learning of such a grand leap forward in the human race’s mobile standard of living.  Instead, she responded with little more than an amused smile and a complete non sequitor.  “I am totally superfluous in your world.”\nNow, what man could fail to love a woman who obviously knows that\nCall of Duty: Black Ops\nwas released on Monday?",
  "tags": [
    "women"
  ],
  "categories": [],
  "sitemap_lastmod": "2010-11-10T08:57:00+00:00"
}