{
  "url": "https://voxday.net/2010/11/06/joel-rosenberg-gets-protected-and/",
  "scraped_at": "2026-01-08T23:42:02.523834",
  "title": "Joel Rosenberg gets protected and served",
  "date_display": "November 6, 2010",
  "date_iso": "2010-11-06T09:06:00+00:00",
  "date_from_url": "2010-11-06",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>As I have written on numerous occasions, the police are both lawless and unaccountable.  One wonders how they can be considered to be “law enforcement officers” when they demonstrate so reliably that <i>they have no idea what the relevant law is</i>:</p><blockquote><p>Sergeant William Palmer, the Minneapolis Police Department Spokesman, <a href=\"http://www.facebook.com/note.php?note_id=168890773129900&amp;id=687146929\">is under investigation for assaulting Joel Rosenberg</a>, a local self-defense activist, in the waiting room of the office of Timothy Dolan, Minneapolis Police Chief. this afternoon, at approximately 130PM.</p><p>Rosenberg and his wife, Felicia Herman, had arrived at the office by previous arrangement with the suspect, Palmer, to examine the first of several Minnesota Government Data Practices Act responses that Rosenberg has submitted to the MPD and the City of Minneapolis. In addition to his responsibilities as police spokesman, Palmer is also the MPD’s Data Practices Officer.</p><p>When Rosenberg removed his jacket, revealing one of the two lawfully-carried handguns on his person, Palmer leaped at him, laid hands on him without lawful authority or Rosenberg’s consent, and removed one of Rosenberg’s pistols, “sweeping”, or momentarily pointing it, at Rosenberg as he moved to unload it.</p><p>“Palmer did not commit a further assault by patting me down,” Rosenberg said. “If he did, he probably would have found the snubnose revolver in my right pocket, and threatened me with that, too.” Rosenberg smiled. “He took one of my knives, too, but missed two others.”</p><p>Palmer admitted, in front of Rosenberg, two witnesses, and a video camera, that he had done so out of a belief that it was somehow unlawful for Rosenberg, a permit holder, firearms instructor and the author of Everything You Need to Know About (Legally) Carrying a Handgun in Minnesota to carry in Minneapolis City Hall, and threatened Rosenberg with the loss of his carry permit — something that Palmer has neither the authority to threaten nor to do — and with arrest.</p><p>Rosenberg responded, “I will not resist arrest, sir,” and attempted to advise Palmer that Minnesota Statute 624.714 not only permits Rosenberg to carry his firearm there, but that Subd. 23 of that statute says (emphasis added):</p><p>No sheriff, police chief, governmental unit, government official, government employee, or other person or body acting under color of law or governmental authority may change, modify, or supplement these criteria or procedures, <b>or limit the exercise of a permit to carry</b>.</p><p> “It’s really very simple,” Rosenberg explained. “Bill had no right to touch me at all, much less grab my gun, much less point it at me, even momentarily. I expect that the HennCo Sheriff’s Office will investigate, and act according to both the facts and the law.  And that’s not the only crime Bill committed today, in that act. He really needs to obey the law that he is sworn to enforce and uphold. Whatever that was today, it was not ‘To Protect’ nor ‘To Serve.’  It’s not for him to make up the law as he goes along.”</p><p>Rosenberg immediately proceeded to the office of the Hennepin County Sheriff, where he filed a criminal complaint with Detective Bill Gottwaldt, who has promised Rosenberg a fair and impartial investigation.</p></blockquote><p>And yes, it’s THAT Joel Rosenberg, the science fiction author and straight shooter.  I’m sure we all expect Officer Palmer to be prosecuted to the full extent of the law and punished accordingly.</p></div>",
  "content_text": "As I have written on numerous occasions, the police are both lawless and unaccountable.  One wonders how they can be considered to be “law enforcement officers” when they demonstrate so reliably that\nthey have no idea what the relevant law is\n:\nSergeant William Palmer, the Minneapolis Police Department Spokesman,\nis under investigation for assaulting Joel Rosenberg\n, a local self-defense activist, in the waiting room of the office of Timothy Dolan, Minneapolis Police Chief. this afternoon, at approximately 130PM.\nRosenberg and his wife, Felicia Herman, had arrived at the office by previous arrangement with the suspect, Palmer, to examine the first of several Minnesota Government Data Practices Act responses that Rosenberg has submitted to the MPD and the City of Minneapolis. In addition to his responsibilities as police spokesman, Palmer is also the MPD’s Data Practices Officer.\nWhen Rosenberg removed his jacket, revealing one of the two lawfully-carried handguns on his person, Palmer leaped at him, laid hands on him without lawful authority or Rosenberg’s consent, and removed one of Rosenberg’s pistols, “sweeping”, or momentarily pointing it, at Rosenberg as he moved to unload it.\n“Palmer did not commit a further assault by patting me down,” Rosenberg said. “If he did, he probably would have found the snubnose revolver in my right pocket, and threatened me with that, too.” Rosenberg smiled. “He took one of my knives, too, but missed two others.”\nPalmer admitted, in front of Rosenberg, two witnesses, and a video camera, that he had done so out of a belief that it was somehow unlawful for Rosenberg, a permit holder, firearms instructor and the author of Everything You Need to Know About (Legally) Carrying a Handgun in Minnesota to carry in Minneapolis City Hall, and threatened Rosenberg with the loss of his carry permit — something that Palmer has neither the authority to threaten nor to do — and with arrest.\nRosenberg responded, “I will not resist arrest, sir,” and attempted to advise Palmer that Minnesota Statute 624.714 not only permits Rosenberg to carry his firearm there, but that Subd. 23 of that statute says (emphasis added):\nNo sheriff, police chief, governmental unit, government official, government employee, or other person or body acting under color of law or governmental authority may change, modify, or supplement these criteria or procedures,\nor limit the exercise of a permit to carry\n.\n“It’s really very simple,” Rosenberg explained. “Bill had no right to touch me at all, much less grab my gun, much less point it at me, even momentarily. I expect that the HennCo Sheriff’s Office will investigate, and act according to both the facts and the law.  And that’s not the only crime Bill committed today, in that act. He really needs to obey the law that he is sworn to enforce and uphold. Whatever that was today, it was not ‘To Protect’ nor ‘To Serve.’  It’s not for him to make up the law as he goes along.”\nRosenberg immediately proceeded to the office of the Hennepin County Sheriff, where he filed a criminal complaint with Detective Bill Gottwaldt, who has promised Rosenberg a fair and impartial investigation.\nAnd yes, it’s THAT Joel Rosenberg, the science fiction author and straight shooter.  I’m sure we all expect Officer Palmer to be prosecuted to the full extent of the law and punished accordingly.",
  "tags": [
    "NWA was right"
  ],
  "categories": [],
  "sitemap_lastmod": "2010-11-06T09:06:00+00:00"
}