{
  "url": "https://voxday.net/2010/11/04/killer-police-lying-again/",
  "scraped_at": "2026-01-08T23:41:51.383062",
  "title": "Killer police lying again",
  "date_display": "November 4, 2010",
  "date_iso": "2010-11-04T10:43:00+00:00",
  "date_from_url": "2010-11-04",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>I wrote in the discussion that followed <a href=\"http://www.milobookclub.com/2010/10/27/portrait-in-conservative-cluelessness/\">my previous post</a> on the police shooting of the Pace University football player that we would be able to tell if the police were lying about committing murder or telling the truth about defending themselves on the basis of the eventual availability of the video evidence.  Needless to say, I’m <i>astonished</i> that, in yet another amazing series of the sort of coincidences that somehow surround police shootings, all of the cameras in all of the squad cars <a href=\"http://www.myfoxboston.com/dpp/news/local/police-dash-cameras-not-operational-during-dj-henry-student-shooting-25-apx-20101103\">tragically happened to malfunction</a> at the very moment when Danroy Henry was shot and killed.</p><blockquote><p>Video cameras in squad cars were “not operational” when police officers shot and killed a college football player during a disturbance outside a bar, prosecutors said in a document released Tuesday.  The Westchester County District Attorney’s Office filed the document in objecting to a request from a lawyer for the student’s family to view audio and video recordings of the shooting.  Danroy Henry, 20, a Pace University student from Easton, Mass., was killed Oct. 17 as he drove his Nissan near the bar in Thornwood near the university campus.</p></blockquote><p>If you still believe that the police in the United States are subject to the law at this point, you are either not paying attention or you are willfully stupid.  This is no longer a matter for debate.  And since the politicians are unable to keep the police under control, the long-term solution is for the state constitutions to be amended ordering the complete disarming of all state and local police except for specially trained, <i>non-militarized</i>, non-SWAT teams who are answerable to scrutiny and prosecution by the state supreme court when police shootings take place.  Armed Americans are not only capable of defending themselves from the criminally inclined, they can do so much more safely without the lawless “service and protection” of the armed police forces.</p><p>As long as the police refuse to be held accountable by the laws and conspire to protect the murderers and lawbreakers in their midst, they cannot be trusted with lethal weapons in public.</p></div>",
  "content_text": "I wrote in the discussion that followed\nmy previous post\non the police shooting of the Pace University football player that we would be able to tell if the police were lying about committing murder or telling the truth about defending themselves on the basis of the eventual availability of the video evidence.  Needless to say, I’m\nastonished\nthat, in yet another amazing series of the sort of coincidences that somehow surround police shootings, all of the cameras in all of the squad cars\ntragically happened to malfunction\nat the very moment when Danroy Henry was shot and killed.\nVideo cameras in squad cars were “not operational” when police officers shot and killed a college football player during a disturbance outside a bar, prosecutors said in a document released Tuesday.  The Westchester County District Attorney’s Office filed the document in objecting to a request from a lawyer for the student’s family to view audio and video recordings of the shooting.  Danroy Henry, 20, a Pace University student from Easton, Mass., was killed Oct. 17 as he drove his Nissan near the bar in Thornwood near the university campus.\nIf you still believe that the police in the United States are subject to the law at this point, you are either not paying attention or you are willfully stupid.  This is no longer a matter for debate.  And since the politicians are unable to keep the police under control, the long-term solution is for the state constitutions to be amended ordering the complete disarming of all state and local police except for specially trained,\nnon-militarized\n, non-SWAT teams who are answerable to scrutiny and prosecution by the state supreme court when police shootings take place.  Armed Americans are not only capable of defending themselves from the criminally inclined, they can do so much more safely without the lawless “service and protection” of the armed police forces.\nAs long as the police refuse to be held accountable by the laws and conspire to protect the murderers and lawbreakers in their midst, they cannot be trusted with lethal weapons in public.",
  "tags": [
    "NWA was right"
  ],
  "categories": [],
  "sitemap_lastmod": "2010-11-04T10:43:00+00:00"
}