{
  "url": "https://voxday.net/2010/11/16/lack-of-consequences-has-consequences/",
  "scraped_at": "2026-01-08T23:42:52.279981",
  "title": "A lack of consequences has consequences",
  "date_display": "November 16, 2010",
  "date_iso": "2010-11-16T11:43:00+00:00",
  "date_from_url": "2010-11-16",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>A policeman observes <a href=\"http://www.the-spearhead.com/2010/10/08/stop-looking-for-a-wife-you-wont-find-one/#comment-46859\">the effects of legal inequality</a> in the name of sexual equality:</p><blockquote><p>[A]s a former criminal investigator and street officer I have observed the deadly effects of feminism on women. Many women feel that they are entitled to browbeat, berate, and abuse men without consequences. By rule of law they would be right. By law of nature they often only realize their folly too late. Again and again I have seen this. The couple that has 5 or 10 domestic disturbance calls then one final call.</p><p>These aren’t the “burning bed” women. Those women don’t call the police. When that abuse comes to light it is usually a third party that makes the call. The most common is the dysfunctional couple that argue to a fever pitch until the guy has had enough. Often he will try to leave for awhile and she tries to block his exit, as she has not felt adequately satisfied with his level of torment. He removes her from his path, and she calls when he is gone citing that he has attacked her and is out on the road. A very common occurance. On the occasions when we arrive to find both at the home the male will be relatively calm while the female is hysterical or playing hard on the victim card. With the “imminent fear” standard in place women have learned to exploit this feature of the domestic abuse law. I taught rookie officers how to properly make the woman tip her hand to see if she was really in fear. Simply enough, you casually isolate the two parties and tell her that he will not be arrested on this occasion. When they are faking it, the fear act dissolves and you see who the aggressor really is. Not only will she aggress against the male partner but also at the officers.</p></blockquote><p>The present legal situation presents a vicious, downward spiral once a woman makes the unilateral decision that she is the head of the household.  There is little point in lamenting the legal realities, as they are what they are and significant change is unlikely until after a) the ongoing economic contraction fundamentally alters the male-female dynamic, or b) Sharia is instituted as is now apparently on the table in places like Amsterdamistan, Londonistan and <a href=\"http://www.huffingtonpost.com/2010/11/08/oklahoma-sharia-law-struck-down-_n_780632.html\">Oklahoma</a>.</p><p>While primary blame must be attached to the woman declares herself queen, there is no shortage of it to be attached to the man who makes the decision, conscious or unconscious, to submit to her rule.  Once that decision is made, the possibility of the downward spiral becomes omnipresent; while couples that involve sufficiently low-status men may never embark upon it, some form of negative outcome is nevertheless likely.</p><p>Now, it’s not necessary to overreact and decry all possibility of long-term relationships with women simply because the law is stacked in favor of them.  That is the instinctive Gamma response and is no different than the way that they tend to exaggerate every Game concept to the point of parodic inutility.  All that is really necessary to forestall the likelihood of this downward spiral is to make it clear that although there may be no legal or physical consequences for a woman’s abusive actions, there will be serious repercussions for the relationship.  Once a man makes it clear that he would truly rather be dead or working in the bowels of a Patagonian coal mine than live his life being treated badly by the one person who is supposed to be his helpmeet, only a deeply neurotic or psychopathic woman is going to push the issue beyond a few tests to establish his credibility on the matter.</p><p>In summary, if you are a browbeaten, hen-pecked man, it is ultimately your fault because you have not only voluntarily chosen that woman, but to accept being treated that way by her as well.  It’s not worth it.  No real man will ever live that way, and furthermore, as the policeman suggests, you are unlikely to be doing either her or yourself a service with your silence endurance.</p></div>",
  "content_text": "A policeman observes\nthe effects of legal inequality\nin the name of sexual equality:\n[A]s a former criminal investigator and street officer I have observed the deadly effects of feminism on women. Many women feel that they are entitled to browbeat, berate, and abuse men without consequences. By rule of law they would be right. By law of nature they often only realize their folly too late. Again and again I have seen this. The couple that has 5 or 10 domestic disturbance calls then one final call.\nThese aren’t the “burning bed” women. Those women don’t call the police. When that abuse comes to light it is usually a third party that makes the call. The most common is the dysfunctional couple that argue to a fever pitch until the guy has had enough. Often he will try to leave for awhile and she tries to block his exit, as she has not felt adequately satisfied with his level of torment. He removes her from his path, and she calls when he is gone citing that he has attacked her and is out on the road. A very common occurance. On the occasions when we arrive to find both at the home the male will be relatively calm while the female is hysterical or playing hard on the victim card. With the “imminent fear” standard in place women have learned to exploit this feature of the domestic abuse law. I taught rookie officers how to properly make the woman tip her hand to see if she was really in fear. Simply enough, you casually isolate the two parties and tell her that he will not be arrested on this occasion. When they are faking it, the fear act dissolves and you see who the aggressor really is. Not only will she aggress against the male partner but also at the officers.\nThe present legal situation presents a vicious, downward spiral once a woman makes the unilateral decision that she is the head of the household.  There is little point in lamenting the legal realities, as they are what they are and significant change is unlikely until after a) the ongoing economic contraction fundamentally alters the male-female dynamic, or b) Sharia is instituted as is now apparently on the table in places like Amsterdamistan, Londonistan and\nOklahoma\n.\nWhile primary blame must be attached to the woman declares herself queen, there is no shortage of it to be attached to the man who makes the decision, conscious or unconscious, to submit to her rule.  Once that decision is made, the possibility of the downward spiral becomes omnipresent; while couples that involve sufficiently low-status men may never embark upon it, some form of negative outcome is nevertheless likely.\nNow, it’s not necessary to overreact and decry all possibility of long-term relationships with women simply because the law is stacked in favor of them.  That is the instinctive Gamma response and is no different than the way that they tend to exaggerate every Game concept to the point of parodic inutility.  All that is really necessary to forestall the likelihood of this downward spiral is to make it clear that although there may be no legal or physical consequences for a woman’s abusive actions, there will be serious repercussions for the relationship.  Once a man makes it clear that he would truly rather be dead or working in the bowels of a Patagonian coal mine than live his life being treated badly by the one person who is supposed to be his helpmeet, only a deeply neurotic or psychopathic woman is going to push the issue beyond a few tests to establish his credibility on the matter.\nIn summary, if you are a browbeaten, hen-pecked man, it is ultimately your fault because you have not only voluntarily chosen that woman, but to accept being treated that way by her as well.  It’s not worth it.  No real man will ever live that way, and furthermore, as the policeman suggests, you are unlikely to be doing either her or yourself a service with your silence endurance.",
  "tags": [
    "women"
  ],
  "categories": [],
  "sitemap_lastmod": "2010-11-16T11:43:00+00:00"
}