{
  "url": "https://voxday.net/2010/11/20/mailvox-beyond-overload/",
  "scraped_at": "2026-01-08T23:43:14.224709",
  "title": "Mailvox: beyond overload",
  "date_display": "November 20, 2010",
  "date_iso": "2010-11-20T09:38:00+00:00",
  "date_from_url": "2010-11-20",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>HW writes of the effects of engaging in an intellectually hazardous adventure:</p><blockquote><p><b>Effects of reading 7 years of Vox Popoli entries in two months:</b></p><p>I started following your blog and somehow came to the insane conclusion that I should read every single one of your posts, starting from 2003.  I came to Vox Popoli after reading TIA and thoroughly enjoying the unapologetic demolition of the New Atheists’ best arguments. While I know that TIA is not meant as a defense of Christianity, its author was clearly a believer, and not the kind whose confused imagination portrays Christ as a limp-wristed hippy. Vox’s posts on feminism piqued my interest further and I decided to read the entire archive. You know, for fun.</p><p>How has concentrated exposure to Vox’s writing affected my life? Let’s break it down by category.</p><p>Career: Won’t try to become a professional writer.</p><p>Economics: Intense feelings of doom.</p><p>Child-rearing: First child is due in January. Won’t be vaccinating, (at least immediately), will be homeschooling. It’s clear now that my public school education was not only inefficient, but just plain wrong at times. The Dark Ages never happened? Who knew?!</p><p>Politics: Clearer view of how police power is dangerous and needs to be severely restricted. I previously described myself as a conservative, and though my political leanings were similar to libertarianism, I consistently voted Republican. However, as I reached the end of the 2008 archives, that changed. Two years of the Obama administration has conditioned me to blame everything on him, and the bailouts fit his modus operandi perfectly, so my brain naturally added the farcical attempts at recovery to his list of sins. Then a shocking realization: Bush was still President. The man I VOTED FOR was governing like Obama. The time-travel effect of the archives has convinced me that Bush was not conservative, and I now regret voting for McCain. Fortunately, this was in time for the November elections, and my wife and I cast our first votes for libertarian candidates.</p><p>Digesting the archives was a thoroughly enjoyable experience and while it challenged several of my concepts of the world, I don’t feel that it’s any exaggeration to say that I’m better off for it. I’m taking steps to cure my historical blind spots and my wife happened to be convincing me that homeschooling was superior at the same time as I was reading Vox’s posts on the subject. The only downside to finishing this little project is that I have to wait until you post now, instead of being able to simply move on to the next month. I guess I’ll start <i>Summa Elvetica</i>…</p></blockquote><p>I know the feeling, I did much the same thing a few years ago when I discovered Fred Reed’s articles.  I am pleased that HW found the experience to be a useful one, especially because it appears to have encouraged him to think for himself and to heighten his critical faculties.  The primary goal of this blog is to encourage myself and others to raise our intellectual game in a free, casual, and reasonably civil manner.</p><p>Speaking of which, I have an idea for a book which would require an amount of fairly serious research help from the Ilk.  Despite the copious amounts of ink and its digital substitute that have been devoted to blathering in ignorance about religion and war, there has never been a serious book about it from the military historians, the military strategists, or the critics of religion.  So, I’m contemplating the expansion of the two chapters of TIA devoted to the subject into a book entitled <i>God and War</i> that deals with the use and utility of religion in historical warfare dating back to the earliest written records.</p><p>This would not be a book of apologetics or even an attack on the hypothesis that religion causes war, it would be a straightforward summary of all the known facts about the relationship between religion and the causes and practice of war.  This strikes me as a more useful contribution to the sum of human knowledge than continuing to beat up on intellectual lightweights like the New Atheists and Keynesian economists.  It’s a rather large-scale undertaking and will take an amount of time to write since I can’t devote any work time to it, so it would help speed up the process if if five or ten people would be willing to help with digging up the details on specific wars that have either eluded the three-volumes of the Encyclopedia of Wars or been given insufficient shrift by the authors of that very useful reference work.</p><p>Anyhow, it’s just an idea at this stage, so let me know if it would be of any interest to you, either as a reader or a potential volunteer.</p></div>",
  "content_text": "HW writes of the effects of engaging in an intellectually hazardous adventure:\nEffects of reading 7 years of Vox Popoli entries in two months:\nI started following your blog and somehow came to the insane conclusion that I should read every single one of your posts, starting from 2003.  I came to Vox Popoli after reading TIA and thoroughly enjoying the unapologetic demolition of the New Atheists’ best arguments. While I know that TIA is not meant as a defense of Christianity, its author was clearly a believer, and not the kind whose confused imagination portrays Christ as a limp-wristed hippy. Vox’s posts on feminism piqued my interest further and I decided to read the entire archive. You know, for fun.\nHow has concentrated exposure to Vox’s writing affected my life? Let’s break it down by category.\nCareer: Won’t try to become a professional writer.\nEconomics: Intense feelings of doom.\nChild-rearing: First child is due in January. Won’t be vaccinating, (at least immediately), will be homeschooling. It’s clear now that my public school education was not only inefficient, but just plain wrong at times. The Dark Ages never happened? Who knew?!\nPolitics: Clearer view of how police power is dangerous and needs to be severely restricted. I previously described myself as a conservative, and though my political leanings were similar to libertarianism, I consistently voted Republican. However, as I reached the end of the 2008 archives, that changed. Two years of the Obama administration has conditioned me to blame everything on him, and the bailouts fit his modus operandi perfectly, so my brain naturally added the farcical attempts at recovery to his list of sins. Then a shocking realization: Bush was still President. The man I VOTED FOR was governing like Obama. The time-travel effect of the archives has convinced me that Bush was not conservative, and I now regret voting for McCain. Fortunately, this was in time for the November elections, and my wife and I cast our first votes for libertarian candidates.\nDigesting the archives was a thoroughly enjoyable experience and while it challenged several of my concepts of the world, I don’t feel that it’s any exaggeration to say that I’m better off for it. I’m taking steps to cure my historical blind spots and my wife happened to be convincing me that homeschooling was superior at the same time as I was reading Vox’s posts on the subject. The only downside to finishing this little project is that I have to wait until you post now, instead of being able to simply move on to the next month. I guess I’ll start\nSumma Elvetica\n…\nI know the feeling, I did much the same thing a few years ago when I discovered Fred Reed’s articles.  I am pleased that HW found the experience to be a useful one, especially because it appears to have encouraged him to think for himself and to heighten his critical faculties.  The primary goal of this blog is to encourage myself and others to raise our intellectual game in a free, casual, and reasonably civil manner.\nSpeaking of which, I have an idea for a book which would require an amount of fairly serious research help from the Ilk.  Despite the copious amounts of ink and its digital substitute that have been devoted to blathering in ignorance about religion and war, there has never been a serious book about it from the military historians, the military strategists, or the critics of religion.  So, I’m contemplating the expansion of the two chapters of TIA devoted to the subject into a book entitled\nGod and War\nthat deals with the use and utility of religion in historical warfare dating back to the earliest written records.\nThis would not be a book of apologetics or even an attack on the hypothesis that religion causes war, it would be a straightforward summary of all the known facts about the relationship between religion and the causes and practice of war.  This strikes me as a more useful contribution to the sum of human knowledge than continuing to beat up on intellectual lightweights like the New Atheists and Keynesian economists.  It’s a rather large-scale undertaking and will take an amount of time to write since I can’t devote any work time to it, so it would help speed up the process if if five or ten people would be willing to help with digging up the details on specific wars that have either eluded the three-volumes of the Encyclopedia of Wars or been given insufficient shrift by the authors of that very useful reference work.\nAnyhow, it’s just an idea at this stage, so let me know if it would be of any interest to you, either as a reader or a potential volunteer.",
  "tags": [
    "books",
    "mailvox"
  ],
  "categories": [],
  "sitemap_lastmod": "2010-11-20T09:38:00+00:00"
}