{
  "url": "https://voxday.net/2010/11/23/mailvox-ah-shore-did-that-thang/",
  "scraped_at": "2026-01-08T23:43:34.563098",
  "title": "Mailvox: the currency circus",
  "date_display": "November 23, 2010",
  "date_iso": "2010-11-23T23:22:00+00:00",
  "date_from_url": "2010-11-23",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>DMM queries my forex views:</p><blockquote><p>You wrote on Oct 19th <a href=\"http://www.milobookclub.com/2010/10/19/its-all-about-foreclosures/\">the following</a>: “This should also mark a surge in USD strength contra nearly everyone’s expectations.”  I am curious if you still feel that there will be a strengthening of the dollar? With the latest actions of the FED many are claiming we will see a 20% loss in value. You have also stated that the debt deflation is overwhelming the attempted inflation of the dollar but does the FED’s actions yesterday make you think differently or are you still of the same opinion?</p></blockquote><p>Given that the Euro has fallen from 1.39 to 1.34 against the dollar in the last month despite the brief spike courtesy of the Fed’s quantitative easing announcement, I think my contrarian position has been generally supported by events so far.  I see no reason to change my opinion.  I find it remarkable that so few see that the way in which these massive money pumps are not driving the dollar down anywhere near the depths it was in 2008 indicate that the USA is in a <i>deflationary</i> environment, not the inflationary one that almost everyone presently believes is the situation.</p><p>At $80, oil is much less expensive than it was in 2007.  Housing prices continue to fall.  And while the Federal Reserve is frantically pumping as much money through the US Treasury as it can, it’s going to run up against the debt limit soon and it cannot hope to create enough debt to make up for the $2.8 trillion in nonexistent assets presently held by the four largest U.S. banks alone.  They have run extend-and-pretend longer than I’d imagined they could, but they’ve had to run it longer than they’d thought they’d have to and they cannot run it indefinitely.  Either the economy turns around or something gives, and I see little sign of the former.</p><p>The important thing to remember is that the massive amounts of money being created by the central banks to bail out loans made to Greek and Irish debtors are only meant to <i>replace</i> money (debt) that has already gone up in smoke with the defaulted loans.</p></div>",
  "content_text": "DMM queries my forex views:\nYou wrote on Oct 19th\nthe following\n: “This should also mark a surge in USD strength contra nearly everyone’s expectations.”  I am curious if you still feel that there will be a strengthening of the dollar? With the latest actions of the FED many are claiming we will see a 20% loss in value. You have also stated that the debt deflation is overwhelming the attempted inflation of the dollar but does the FED’s actions yesterday make you think differently or are you still of the same opinion?\nGiven that the Euro has fallen from 1.39 to 1.34 against the dollar in the last month despite the brief spike courtesy of the Fed’s quantitative easing announcement, I think my contrarian position has been generally supported by events so far.  I see no reason to change my opinion.  I find it remarkable that so few see that the way in which these massive money pumps are not driving the dollar down anywhere near the depths it was in 2008 indicate that the USA is in a\ndeflationary\nenvironment, not the inflationary one that almost everyone presently believes is the situation.\nAt $80, oil is much less expensive than it was in 2007.  Housing prices continue to fall.  And while the Federal Reserve is frantically pumping as much money through the US Treasury as it can, it’s going to run up against the debt limit soon and it cannot hope to create enough debt to make up for the $2.8 trillion in nonexistent assets presently held by the four largest U.S. banks alone.  They have run extend-and-pretend longer than I’d imagined they could, but they’ve had to run it longer than they’d thought they’d have to and they cannot run it indefinitely.  Either the economy turns around or something gives, and I see little sign of the former.\nThe important thing to remember is that the massive amounts of money being created by the central banks to bail out loans made to Greek and Irish debtors are only meant to\nreplace\nmoney (debt) that has already gone up in smoke with the defaulted loans.",
  "tags": [
    "economics"
  ],
  "categories": [],
  "sitemap_lastmod": "2010-11-23T23:22:00+00:00"
}