{
  "url": "https://voxday.net/2010/11/23/mailvox-tale-of-two-atheists/",
  "scraped_at": "2026-01-08T23:43:30.890780",
  "title": "Mailvox: a tale of two atheists",
  "date_display": "November 23, 2010",
  "date_iso": "2010-11-23T10:33:00+00:00",
  "date_from_url": "2010-11-23",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>JM writes:</p><blockquote><p>I was born of two avowed atheists, along with two sisters, one older, one younger, and we were raised with the highest of social values and principles, and this was done by taking us to church from our earliest days, and learning morality from Christian religion, even though my parents both deny the correctness of the theology.  They considered their options, concluded they could find no fixed means of inculcating moral behavior in us any other way, and chose to use what worked on them and for so many others, while making no personal claims at all about religion, what they believed in, but let their examples show, and let us assume they were connected to the moral lessons we were learning in Church, fully supporting those lessons, but with no means of connecting the dichotomy.  I was certain I was an atheist at eleven, but could not come up with any possible way to put together a rational morality without presuming for the sake of argument, a superior being who would ultimately judge our behavior according to an established set of standards….</p><p>Of my parents and two sisters, and myself, I alone am a believer, and while I am assailed every time we are together, and challenged at every turn, I can do no more than Galileo did, as he accepted his rebuke, and turned away saying to himself, yet we still move around the sun.</p><p>I know science does not give moral answers, I’ve lived through enough of this world to know this for a certainty, yet I know that science does give accurate answers to so many reasonable questions, I don’t deny its validity.  I also know that morality is an absolute, and it is fixed, and accept that it is made law, just as a part of Creation, and is a part of God himself.  I know much about the history and lineage of man, and accept my place in society, and in God’s will, knowing it is of the greatest consequence of all, and I simply accept it is not subject to dissection by science, or if it is, the beginnings of that work are not within our grasp yet.</p><p>It is hard to deal with quantum mechanics, entanglement, dark energy and matter, and also deal with faith and God, good and evil, all as truths, and all directly impacting us, but just because it is hard does not take away the self evident truths which we base our moral standards on, nor does it remove the necessity of pursuing good, because failing to do so inevitably provides the opening for evil to enter into one’s choices and one becomes evil by do it.</p></blockquote><p>I think perhaps it is easier to recognize the limited scope of scientific utility if one’s training is in fields where the state of science is not so much inexact as hopelessly inaccurate.  Economists such as Paul Krugman are every bit as convinced of the mathematical verity of their pseudoscientific dogma as Richard Dawkins, but it is much, much easier for the skeptical economist who rejects the various forms of Keynesianism to demonstrate the falsity of mainstream economic science than it is for the skeptical biologist due to the much shorter time frame in which the economists operate.  Having witnessed the repeated construction of economic epicycles in order to explain away the theory’s extensive panoply of failures, it is not at all difficult to see exactly the same process at work in biology and even physics.</p><p>The choice is simple, Sam Harris’s envisioning of a utilitarian moral landscape notwithstanding.  Either there are rules of the game as well as an original provider of those rules or <i>there is no game</i>.  Consider the following definition: <i>“GAME – a competitive activity involving skill, chance, or endurance on the part of two or more persons who play according to a set of rules.”</i> No rules, no game.  The same applies to life; either there is a purpose to life and a set of rules related to that purpose or there is no purpose and no rules.  This is not an original thought, as numerous philosophers of various creeds have pointed out, the choice has always been between God and the Void.  Attempting to disguise that choice by appealing to science, self-interest, or collective humanity is doomed to failure by logic as well as historical observation.</p><p>The intellectual poverty of Harris’s case can be seen in the arguments of his followers.  I don’t know what it is about atheists, but they do seem remarkably prone to thinking that they can argue in ignorance.  Consider the following exchange with KH:</p><blockquote><p>KH: <i>Sam Harris made a point in one of his books that God doesn’t heal amputees. I don’t find that to be an “intellectual failure.” He’s right.  Just a straight-shooting, blue-collar observation.  Christians don’t pray for a worker’s severed arm to regrow. What would you say to counter such a statement?</i></p><p>VD: That’s amusing.  You do realize that one solitary point, correct or incorrect, is insufficient to make a book an intellectual success or failure, right?  You clearly haven’t read TIA or you would be aware that both <i>The End of Faith</i> and <i>Letter to a Christian Nation</i> are full of logical and factual errors.  As for how would I respond, I would ask him what his evidence is for such a statement.  Has he done any scientific surveys of amputees and the Christians who know them?  There is no reason to believe his statement about amputees to be any better evidenced than his statement that all the research shows corporal punishment to have a negative effect on children’s behavior.</p><p>KH: <i>I was simply using one example from Sam’s works to illustrate how I thought he was correct. Another question you cannot answer, Vox, but he can (because he’s right) is:  Why don’t we find rabbits in the layers of Cambrian rocks, next to trilobites, if they were all created together?  This gradual increase in complexity as you go upward from older to younger rocks is empirically evident.  I seriously would need you to convince me on this simple point to believe that his works are an intellectual failure.</i></p><p>VD: One or two correct examples do not suffice to prevent an entire book from being an intellectual failure.  The intellectual failure or success of a book is determined by the success or failure of its central thesis; all three of Sam’s books are failures by this reckoning.  And, contra your incorrect assertion, of course I can easily answer what is not actually Sam’s point, but one that he cribs from J.S. Haldane: circular reasoning is used in the geological dating of rocks and fossils.  Furthermore, there is no “gradual increase in complexity”; you clearly know very little about either the fossil record or geology if you genuinely believe “you go upward from older to younger rocks”.  Do you even know what “punctuated equilibrium” means, much less why the concept was developed in the first place?</p><p>You must realize that it is as ludicrous to attempt to criticize my critique of Sam Harris as it would have been for me to attempt to criticize Sam Harris without first reading his books.</p></blockquote><p>Neither amputees nor trilobites have much, if anything, to do with the central theses of <i>The End of Faith</i>, <i>Letter to a Christian Nation</i>, or <i>The Moral Landscape</i>.  But this doesn’t prevent dogmatic atheists desperate to find spiritual leadership from leaping blindly to defend Mr. Harris from substantive criticisms of his works.</p><p>And, as we all know, when rabbit fossils are eventually discovered in Cambrian rocks, (actually “Precambrian”, KH didn’t even get the Haldane quote right), scientists will trample each other in the stampede to claim that a) the fossils are not rabbits, b) the rocks are not Precambrian, and c) evolution is “a large package of ideas, including: that life on Earth has evolved over billions of years; that this evolution is driven by certain mechanisms; and that these mechanisms have produced a specific “family tree” that defines the relationships among species and the order in which they appeared” and therefore a single impossible anachronism should not be sufficient to destroy such an important and glorious edifice constructed over so many years by so many famous scientists.</p><p>UPDATE: KH emailed again to complain that I did not directly answer the question about why we don’t find rabbit fossils next to trilobite fossils.  (He also complained I didn’t answer the first one, which is simply not true.)  The reason I answered the implied question rather than the direct one is because the direct question is very stupid.  But, at the risk of belaboring the obvious, the reason we don’t find rabbit fossils next to trilobite fossils is not because they lived in different eras, (even assuming that they did, in fact, live in different eras), it is the same reason we do not find giraffe fossils next to sperm whale fossils.  Barring the discovery of the hitherto unknown <i>Sylvilagus oceanus maximus</i>, the present state of scientage indicates that rabbits are land animals and trilobites are marine animals.</p></div>",
  "content_text": "JM writes:\nI was born of two avowed atheists, along with two sisters, one older, one younger, and we were raised with the highest of social values and principles, and this was done by taking us to church from our earliest days, and learning morality from Christian religion, even though my parents both deny the correctness of the theology.  They considered their options, concluded they could find no fixed means of inculcating moral behavior in us any other way, and chose to use what worked on them and for so many others, while making no personal claims at all about religion, what they believed in, but let their examples show, and let us assume they were connected to the moral lessons we were learning in Church, fully supporting those lessons, but with no means of connecting the dichotomy.  I was certain I was an atheist at eleven, but could not come up with any possible way to put together a rational morality without presuming for the sake of argument, a superior being who would ultimately judge our behavior according to an established set of standards….\nOf my parents and two sisters, and myself, I alone am a believer, and while I am assailed every time we are together, and challenged at every turn, I can do no more than Galileo did, as he accepted his rebuke, and turned away saying to himself, yet we still move around the sun.\nI know science does not give moral answers, I’ve lived through enough of this world to know this for a certainty, yet I know that science does give accurate answers to so many reasonable questions, I don’t deny its validity.  I also know that morality is an absolute, and it is fixed, and accept that it is made law, just as a part of Creation, and is a part of God himself.  I know much about the history and lineage of man, and accept my place in society, and in God’s will, knowing it is of the greatest consequence of all, and I simply accept it is not subject to dissection by science, or if it is, the beginnings of that work are not within our grasp yet.\nIt is hard to deal with quantum mechanics, entanglement, dark energy and matter, and also deal with faith and God, good and evil, all as truths, and all directly impacting us, but just because it is hard does not take away the self evident truths which we base our moral standards on, nor does it remove the necessity of pursuing good, because failing to do so inevitably provides the opening for evil to enter into one’s choices and one becomes evil by do it.\nI think perhaps it is easier to recognize the limited scope of scientific utility if one’s training is in fields where the state of science is not so much inexact as hopelessly inaccurate.  Economists such as Paul Krugman are every bit as convinced of the mathematical verity of their pseudoscientific dogma as Richard Dawkins, but it is much, much easier for the skeptical economist who rejects the various forms of Keynesianism to demonstrate the falsity of mainstream economic science than it is for the skeptical biologist due to the much shorter time frame in which the economists operate.  Having witnessed the repeated construction of economic epicycles in order to explain away the theory’s extensive panoply of failures, it is not at all difficult to see exactly the same process at work in biology and even physics.\nThe choice is simple, Sam Harris’s envisioning of a utilitarian moral landscape notwithstanding.  Either there are rules of the game as well as an original provider of those rules or\nthere is no game\n.  Consider the following definition:\n“GAME – a competitive activity involving skill, chance, or endurance on the part of two or more persons who play according to a set of rules.”\nNo rules, no game.  The same applies to life; either there is a purpose to life and a set of rules related to that purpose or there is no purpose and no rules.  This is not an original thought, as numerous philosophers of various creeds have pointed out, the choice has always been between God and the Void.  Attempting to disguise that choice by appealing to science, self-interest, or collective humanity is doomed to failure by logic as well as historical observation.\nThe intellectual poverty of Harris’s case can be seen in the arguments of his followers.  I don’t know what it is about atheists, but they do seem remarkably prone to thinking that they can argue in ignorance.  Consider the following exchange with KH:\nKH:\nSam Harris made a point in one of his books that God doesn’t heal amputees. I don’t find that to be an “intellectual failure.” He’s right.  Just a straight-shooting, blue-collar observation.  Christians don’t pray for a worker’s severed arm to regrow. What would you say to counter such a statement?\nVD: That’s amusing.  You do realize that one solitary point, correct or incorrect, is insufficient to make a book an intellectual success or failure, right?  You clearly haven’t read TIA or you would be aware that both\nThe End of Faith\nand\nLetter to a Christian Nation\nare full of logical and factual errors.  As for how would I respond, I would ask him what his evidence is for such a statement.  Has he done any scientific surveys of amputees and the Christians who know them?  There is no reason to believe his statement about amputees to be any better evidenced than his statement that all the research shows corporal punishment to have a negative effect on children’s behavior.\nKH:\nI was simply using one example from Sam’s works to illustrate how I thought he was correct. Another question you cannot answer, Vox, but he can (because he’s right) is:  Why don’t we find rabbits in the layers of Cambrian rocks, next to trilobites, if they were all created together?  This gradual increase in complexity as you go upward from older to younger rocks is empirically evident.  I seriously would need you to convince me on this simple point to believe that his works are an intellectual failure.\nVD: One or two correct examples do not suffice to prevent an entire book from being an intellectual failure.  The intellectual failure or success of a book is determined by the success or failure of its central thesis; all three of Sam’s books are failures by this reckoning.  And, contra your incorrect assertion, of course I can easily answer what is not actually Sam’s point, but one that he cribs from J.S. Haldane: circular reasoning is used in the geological dating of rocks and fossils.  Furthermore, there is no “gradual increase in complexity”; you clearly know very little about either the fossil record or geology if you genuinely believe “you go upward from older to younger rocks”.  Do you even know what “punctuated equilibrium” means, much less why the concept was developed in the first place?\nYou must realize that it is as ludicrous to attempt to criticize my critique of Sam Harris as it would have been for me to attempt to criticize Sam Harris without first reading his books.\nNeither amputees nor trilobites have much, if anything, to do with the central theses of\nThe End of Faith\n,\nLetter to a Christian Nation\n, or\nThe Moral Landscape\n.  But this doesn’t prevent dogmatic atheists desperate to find spiritual leadership from leaping blindly to defend Mr. Harris from substantive criticisms of his works.\nAnd, as we all know, when rabbit fossils are eventually discovered in Cambrian rocks, (actually “Precambrian”, KH didn’t even get the Haldane quote right), scientists will trample each other in the stampede to claim that a) the fossils are not rabbits, b) the rocks are not Precambrian, and c) evolution is “a large package of ideas, including: that life on Earth has evolved over billions of years; that this evolution is driven by certain mechanisms; and that these mechanisms have produced a specific “family tree” that defines the relationships among species and the order in which they appeared” and therefore a single impossible anachronism should not be sufficient to destroy such an important and glorious edifice constructed over so many years by so many famous scientists.\nUPDATE: KH emailed again to complain that I did not directly answer the question about why we don’t find rabbit fossils next to trilobite fossils.  (He also complained I didn’t answer the first one, which is simply not true.)  The reason I answered the implied question rather than the direct one is because the direct question is very stupid.  But, at the risk of belaboring the obvious, the reason we don’t find rabbit fossils next to trilobite fossils is not because they lived in different eras, (even assuming that they did, in fact, live in different eras), it is the same reason we do not find giraffe fossils next to sperm whale fossils.  Barring the discovery of the hitherto unknown\nSylvilagus oceanus maximus\n, the present state of scientage indicates that rabbits are land animals and trilobites are marine animals.",
  "tags": [
    "atheism",
    "philosophy"
  ],
  "categories": [],
  "sitemap_lastmod": "2010-11-23T10:33:00+00:00"
}