{
  "url": "https://voxday.net/2010/11/02/mailvox-voice-of-optimis/",
  "scraped_at": "2026-01-08T23:41:38.575908",
  "title": "Mailvox: the voice of optimism",
  "date_display": "November 2, 2010",
  "date_iso": "2010-11-02T10:58:00+00:00",
  "date_from_url": "2010-11-02",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>RC contends that the Tea Party is here to stay:</p><blockquote><p>You are reading this the situation incorrectly.</p><p>The TEA Party will (in 2 more years) oust more elected officials (even TEA Partiers) who have not supported the core conservative principles!  We are in it for the long run.  If you believe true TEA Partiers will be co-opted once in power, you are wrong.  They know they will get the boot!</p><p>Good governance will not occur in one election cycle.  It will take 3 cycles to fully purge the deadwood.</p><p>As you can see, powerful, lifetime politicians are struggling as never before to retain their seats.  Do you REALLY believe they want that battle very often?  No way!  Do you REALLY believe the GOP believes it is in a position superior to the TEA Party?  No way.  No Money!  Partiers give direct to candidates–no longer only RNC.  Sure, they raise money.  But, we can raise more. Say our numbers grow to a mere 40 million (from the about 20 million today).  If each contributes $100 for targeted campaign  contributions, that gives  $4 billion to support 1/2 the Congress and the presidential race.  Works out to about $15 million per candidate (if averaged).  If more is needed, we kick in an extra $100.</p><p>My guess is that the GOP is happy that the TEA Party came along.  Also, they realize that the Partiers are not stupid.  There are TEA Party strategy sessions all the time.  Even though from ground up, we all want the same core principles defended.  Woe be to those that stray!  Voting nationwide with our checkbooks or credit cards (and in massive numbers) is nothing to sneeze at.</p><p>Also, look at the increase in numbers of precinct delegates, poll watchers, candidates, etc.  Training sessions, bill reviews, rallies, marches, e-mails, phone calls, etc.<br> Cannot agree with you.  The synergy is great.  We will prevail in restoring the republic.</br></p><p>Our greatest advantage?  Passion for what is right.  We have it.</p></blockquote><p>It sounds good.  It’s not impossible.  But it is nevertheless highly improbable.  I don’t hear any powerful Republicans showing much concern of the Tea Party turning on them, and more to the point, I see a lot of signs that the Tea Party has already been co-opted.  When establishment Republicans are talking about gradual change and bipartisan consolidation while neocons like Sarah Palin and Dana Loesch are hailed as Tea Party “leaders”, it doesn’t take a genius to see that what has happened time and time again to rebellious conservative grass roots organizations is already happening to the Tea Party.</p><p>That being said, there is one X factor that could lead to the Tea Party growing up to become a viable third party and that is the next wave of the depression now taking shape.  Historically, American parties have formed around the issue of the banks; the Democratic party was originally the anti-banking party of Andrew Jackson and William Jennings Bryan while the Whigs and Republicans were pro-bank.  But both modern parties have been wholly owned by the banking interests since Democrat Woodrow Wilson and a Democratic Congress pushed through the Federal Reserve Act of 1913.  (The Ilk will note the counterpush at work.)</p><p>So, there is a clear political vaccuum which the Tea Party could profitably fill.  And indeed, it was <i>the reaction to the bank bailouts</i> that originally inspired the first Tea Party reactions although that has rapidly been transformed into an incoherent, anti-spending-except-for-the greater-part-of-the-spending movement.  If, and only if, the Tea Party gravitates towards a genuine anti-banking, anti-immigration, <i>anti-Republican</i> party and forces the two factions of the ruling party to merge <i>de jure</i> as well as <i>de facto</i>, it can reasonably hope to succeed and effect change.  But as yet, I see few, if any, signs of that.</p></div>",
  "content_text": "RC contends that the Tea Party is here to stay:\nYou are reading this the situation incorrectly.\nThe TEA Party will (in 2 more years) oust more elected officials (even TEA Partiers) who have not supported the core conservative principles!  We are in it for the long run.  If you believe true TEA Partiers will be co-opted once in power, you are wrong.  They know they will get the boot!\nGood governance will not occur in one election cycle.  It will take 3 cycles to fully purge the deadwood.\nAs you can see, powerful, lifetime politicians are struggling as never before to retain their seats.  Do you REALLY believe they want that battle very often?  No way!  Do you REALLY believe the GOP believes it is in a position superior to the TEA Party?  No way.  No Money!  Partiers give direct to candidates–no longer only RNC.  Sure, they raise money.  But, we can raise more. Say our numbers grow to a mere 40 million (from the about 20 million today).  If each contributes $100 for targeted campaign  contributions, that gives  $4 billion to support 1/2 the Congress and the presidential race.  Works out to about $15 million per candidate (if averaged).  If more is needed, we kick in an extra $100.\nMy guess is that the GOP is happy that the TEA Party came along.  Also, they realize that the Partiers are not stupid.  There are TEA Party strategy sessions all the time.  Even though from ground up, we all want the same core principles defended.  Woe be to those that stray!  Voting nationwide with our checkbooks or credit cards (and in massive numbers) is nothing to sneeze at.\nAlso, look at the increase in numbers of precinct delegates, poll watchers, candidates, etc.  Training sessions, bill reviews, rallies, marches, e-mails, phone calls, etc.\nCannot agree with you.  The synergy is great.  We will prevail in restoring the republic.\nOur greatest advantage?  Passion for what is right.  We have it.\nIt sounds good.  It’s not impossible.  But it is nevertheless highly improbable.  I don’t hear any powerful Republicans showing much concern of the Tea Party turning on them, and more to the point, I see a lot of signs that the Tea Party has already been co-opted.  When establishment Republicans are talking about gradual change and bipartisan consolidation while neocons like Sarah Palin and Dana Loesch are hailed as Tea Party “leaders”, it doesn’t take a genius to see that what has happened time and time again to rebellious conservative grass roots organizations is already happening to the Tea Party.\nThat being said, there is one X factor that could lead to the Tea Party growing up to become a viable third party and that is the next wave of the depression now taking shape.  Historically, American parties have formed around the issue of the banks; the Democratic party was originally the anti-banking party of Andrew Jackson and William Jennings Bryan while the Whigs and Republicans were pro-bank.  But both modern parties have been wholly owned by the banking interests since Democrat Woodrow Wilson and a Democratic Congress pushed through the Federal Reserve Act of 1913.  (The Ilk will note the counterpush at work.)\nSo, there is a clear political vaccuum which the Tea Party could profitably fill.  And indeed, it was\nthe reaction to the bank bailouts\nthat originally inspired the first Tea Party reactions although that has rapidly been transformed into an incoherent, anti-spending-except-for-the greater-part-of-the-spending movement.  If, and only if, the Tea Party gravitates towards a genuine anti-banking, anti-immigration,\nanti-Republican\nparty and forces the two factions of the ruling party to merge\nde jure\nas well as\nde facto\n, it can reasonably hope to succeed and effect change.  But as yet, I see few, if any, signs of that.",
  "tags": [
    "politics"
  ],
  "categories": [],
  "sitemap_lastmod": "2010-11-02T10:58:00+00:00"
}