{
  "url": "https://voxday.net/2010/11/11/mailvox-true-owners/",
  "scraped_at": "2026-01-08T23:42:35.762451",
  "title": "Mailvox: true owners",
  "date_display": "November 11, 2010",
  "date_iso": "2010-11-11T21:15:00+00:00",
  "date_from_url": "2010-11-11",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>BG queries about who actually owns the home:</p><blockquote><p>I am a recent convert to your blog. I enjoy your unconventional, but unfailingly thoughtful, opinions.</p><p>Here is something for you to ponder. Assume that the evidence shows that the putative owner of a mortgage is not the actual owner of the mortgage, due to improper transfer procedures in the securitization process, such as a failure to properly endorse and record the necessary transfer documents. The implications for foreclosures may be profound, as you and others have indicated.</p><p>But think about this from a different point of view for a minujte. Wouldn’t this logic imply that a nondefaulting homeowner, who has been making all of the payments on his home, has in fact not been paying the proper person? Could the true owner of the mortgage sue the homeowner for not making payments to the true owner? The true owner might want to do this because the banks, servicers and other intermediaries might soon all be broke due to the foreclosure problem.</p></blockquote><p>It does imply that the wrong party has been paid, in fact, this is exactly why multiple banks have been foreclosing on some houses.  The problem is that in the case of a broken line of mortgage transference, it is not only difficult to ascertain the true holder of the debt, but in many cases the connection of the debt to the title is cancelled by virtue of the note proving the claim being destroyed in the process of the transfer.  In such cases, the debt may still be owed to the “true owner”, but it is no longer secured by the home.</p><p>So, to answer the rest of BG’s questions, yes, the true owner <i>of the debt</i> can sue the homeowner but is very unlikely to because he has no claim on the house.  The reason it makes no sense for the true debt-holder to sue the homeowner is that a bankruptcy filing on the part of the homeowner will discharge that debt without relinquishing the house.</p></div>",
  "content_text": "BG queries about who actually owns the home:\nI am a recent convert to your blog. I enjoy your unconventional, but unfailingly thoughtful, opinions.\nHere is something for you to ponder. Assume that the evidence shows that the putative owner of a mortgage is not the actual owner of the mortgage, due to improper transfer procedures in the securitization process, such as a failure to properly endorse and record the necessary transfer documents. The implications for foreclosures may be profound, as you and others have indicated.\nBut think about this from a different point of view for a minujte. Wouldn’t this logic imply that a nondefaulting homeowner, who has been making all of the payments on his home, has in fact not been paying the proper person? Could the true owner of the mortgage sue the homeowner for not making payments to the true owner? The true owner might want to do this because the banks, servicers and other intermediaries might soon all be broke due to the foreclosure problem.\nIt does imply that the wrong party has been paid, in fact, this is exactly why multiple banks have been foreclosing on some houses.  The problem is that in the case of a broken line of mortgage transference, it is not only difficult to ascertain the true holder of the debt, but in many cases the connection of the debt to the title is cancelled by virtue of the note proving the claim being destroyed in the process of the transfer.  In such cases, the debt may still be owed to the “true owner”, but it is no longer secured by the home.\nSo, to answer the rest of BG’s questions, yes, the true owner\nof the debt\ncan sue the homeowner but is very unlikely to because he has no claim on the house.  The reason it makes no sense for the true debt-holder to sue the homeowner is that a bankruptcy filing on the part of the homeowner will discharge that debt without relinquishing the house.",
  "tags": [
    "banks"
  ],
  "categories": [],
  "sitemap_lastmod": "2010-11-11T21:15:00+00:00"
}