{
  "url": "https://voxday.net/2010/11/08/more-vibrancy-in-minneapolis/",
  "scraped_at": "2026-01-08T23:42:13.170249",
  "title": "More vibrancy in Minneapolis",
  "date_display": "November 8, 2010",
  "date_iso": "2010-11-08T19:19:00+00:00",
  "date_from_url": "2010-11-08",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>Isn’t <a href=\"http://news.yahoo.com/s/ap/20101108/ap_on_re_us/us_somali_sex_trafficking_1\">immigration wonderful</a>!  And think of all the wonderful Somali restaurants!</p><blockquote><p>Twenty-nine people have been indicted in a sex trafficking ring spanning three states and allegedly run by Minneapolis-based Somali gangs.  An indictment unsealed Monday in U.S. District Court in Nashville says one of the goals of the gangs was to recruit females under age 18, including some under age 14, and force them into prostitution in exchange for cash, drugs or other items. The indictment says the sex ring operated in Minneapolis, Nashville, and Columbus, Ohio.</p></blockquote><p>If you are still clinging to the notion that a mere change of geographic location is sufficient to erase thousands of years of genetic and cultural influence, you are being willfully stupid.  Immigration is a <i>disaster</i> for every country; it’s no better for the modern inhabitants of the USA than it was for the Indian tribes.  It’s ridiculous to assert that the Irish, Swedish, or Italian immigrants “made America great”, as one has only to look at the historical homelands from whence they came as well as their voting records to realize that they destroyed the English concept of human liberty upon which the USA was originally founded.</p><p>The first great wave of 19th century immigration weakened America but wasn’t strong enough to kill it.  The second great wave of the late 20th century finished what the first wave started, most people just haven’t realized it yet.  It is ludicrous to talk of “taking America back”; the most anyone can reasonably hope for is some sort of heavily armed rump state set in Middle America that is surrounded by bankrupt, progressive, hellholes run on the Greco-Mexican model to the east, south, and west, and a progressive welfare state to the north.</p></div>",
  "content_text": "Isn’t\nimmigration wonderful\n!  And think of all the wonderful Somali restaurants!\nTwenty-nine people have been indicted in a sex trafficking ring spanning three states and allegedly run by Minneapolis-based Somali gangs.  An indictment unsealed Monday in U.S. District Court in Nashville says one of the goals of the gangs was to recruit females under age 18, including some under age 14, and force them into prostitution in exchange for cash, drugs or other items. The indictment says the sex ring operated in Minneapolis, Nashville, and Columbus, Ohio.\nIf you are still clinging to the notion that a mere change of geographic location is sufficient to erase thousands of years of genetic and cultural influence, you are being willfully stupid.  Immigration is a\ndisaster\nfor every country; it’s no better for the modern inhabitants of the USA than it was for the Indian tribes.  It’s ridiculous to assert that the Irish, Swedish, or Italian immigrants “made America great”, as one has only to look at the historical homelands from whence they came as well as their voting records to realize that they destroyed the English concept of human liberty upon which the USA was originally founded.\nThe first great wave of 19th century immigration weakened America but wasn’t strong enough to kill it.  The second great wave of the late 20th century finished what the first wave started, most people just haven’t realized it yet.  It is ludicrous to talk of “taking America back”; the most anyone can reasonably hope for is some sort of heavily armed rump state set in Middle America that is surrounded by bankrupt, progressive, hellholes run on the Greco-Mexican model to the east, south, and west, and a progressive welfare state to the north.",
  "tags": [
    "Invasion"
  ],
  "categories": [],
  "sitemap_lastmod": "2010-11-08T19:19:00+00:00"
}