{
  "url": "https://voxday.net/2010/11/30/opportunity-cost-of-sex/",
  "scraped_at": "2026-01-08T23:44:05.279829",
  "title": "The opportunity cost of sex",
  "date_display": "November 30, 2010",
  "date_iso": "2010-11-30T14:15:00+00:00",
  "date_from_url": "2010-11-30",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>Since Spacebunny mentioned that the previous post was of the sort to cause most people to feign death rather than risk inadvertantly entering into the discussion, I thought I’d post <a href=\"http://www.hookingupsmart.com/2010/11/29/hookinguprealities/the-hidden-cost-of-keeping-sex-casual/\">Susan Walsh’s rather different take</a> on the opportunity cost study.  I suspect it is much more likely to prove interesting to the non-economists in our midst.  Not that pedantic debates over opportunity cost versus net utility calculations aren’t stone cold sexy, you understand.</p><blockquote><p>One of the most valuable key economic concepts is that of opportunity cost. It’s the cost of not choosing something, the benefits left behind on the road not taken, and it’s an important component of any choice you make. Sometimes the tradeoff is obvious – if you choose to date Brad, you’re giving up the opportunity to date Jonathan, for example. Often times, though, opportunity costs can be hidden, which can lead to making irrational decisions….</p><p>Women often figure they have nothing to lose by staying in a disappointing arrangement until something better comes along. This is a terrible strategy for three reasons:</p></blockquote><p>It’s not just women who make this mistake.  As I’ve told some of my male friends time and time again, women should not be confused with jobs.  While the best way to find a new job is to have a job, the best way to find a wife is not to have a wife.  If you want to meet women, you are much better off being out, about and unattached than caught up in a half-hearted relationship with a girl that you plan to trade in for someone better on the off-chance that you happen to meet them on one of the nights that you’re not sitting at home watching re-runs of Sex in the City with a woman you don’t even particularly like.  It’s not fair to her and it’s not utility maximizing for you.</p><p>UPDATE: We’re not talking about pre-selection here.  We’re talking about the sort of man who is in a “serious relationship” but doesn’t want to be and is simply waiting around for someone else to come along before he can break it off with her.</p></div>",
  "content_text": "Since Spacebunny mentioned that the previous post was of the sort to cause most people to feign death rather than risk inadvertantly entering into the discussion, I thought I’d post\nSusan Walsh’s rather different take\non the opportunity cost study.  I suspect it is much more likely to prove interesting to the non-economists in our midst.  Not that pedantic debates over opportunity cost versus net utility calculations aren’t stone cold sexy, you understand.\nOne of the most valuable key economic concepts is that of opportunity cost. It’s the cost of not choosing something, the benefits left behind on the road not taken, and it’s an important component of any choice you make. Sometimes the tradeoff is obvious – if you choose to date Brad, you’re giving up the opportunity to date Jonathan, for example. Often times, though, opportunity costs can be hidden, which can lead to making irrational decisions….\nWomen often figure they have nothing to lose by staying in a disappointing arrangement until something better comes along. This is a terrible strategy for three reasons:\nIt’s not just women who make this mistake.  As I’ve told some of my male friends time and time again, women should not be confused with jobs.  While the best way to find a new job is to have a job, the best way to find a wife is not to have a wife.  If you want to meet women, you are much better off being out, about and unattached than caught up in a half-hearted relationship with a girl that you plan to trade in for someone better on the off-chance that you happen to meet them on one of the nights that you’re not sitting at home watching re-runs of Sex in the City with a woman you don’t even particularly like.  It’s not fair to her and it’s not utility maximizing for you.\nUPDATE: We’re not talking about pre-selection here.  We’re talking about the sort of man who is in a “serious relationship” but doesn’t want to be and is simply waiting around for someone else to come along before he can break it off with her.",
  "tags": [
    "economics",
    "women"
  ],
  "categories": [],
  "sitemap_lastmod": "2010-11-30T14:15:00+00:00"
}