{
  "url": "https://voxday.net/2010/11/01/republican-irrelevance/",
  "scraped_at": "2026-01-08T23:41:34.854181",
  "title": "Republican irrelevance",
  "date_display": "November 1, 2010",
  "date_iso": "2010-11-01T17:15:00+00:00",
  "date_from_url": "2010-11-01",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>In which it is proved by the Republican House Majority Leader-to-be, Rep. John Boehner:</p><blockquote><p><a href=\"http://www.usatoday.com/news/opinion/forum/2010-11-01-column01_ST1_N.htm\">Why You Should Vote For Republicans</a></p><p>Americans are speaking out and demanding a new way forward in Washington. Republicans have listened and outlined a new governing agenda in the form of a Pledge to America focused on creating jobs, cutting spending and changing the way Washington does business.</p><p>A smaller government</p><p>At the core of the Pledge is an idea Washington just hasn’t tried before — that the path to recovery lies in making government smaller instead of making it bigger. To jump-start job creation, the economic uncertainty gripping small businesses has to be eliminated, and the spending binge in Washington has to be stopped.</p><p>The Pledge puts forth a clear plan to end the current uncertainty, starting with stopping all looming tax hikes so that small businesses can get back to creating jobs. This is followed by a blueprint for fiscal sanity that begins with cutting spending to pre-“stimulus,” pre-bailout levels, a move that will save taxpayers $100 billion in the first year alone.</p></blockquote><p>Very well.  Smaller government sounds good.  Saving $100 billion in the first year alone sounds like a lot.  Now, what was the federal budget in 2010?  According to “A New Era of Responsibility: Renewing America’s Promise” which is the Orwellian title for The United States Federal Budget for Fiscal Year 2010, the 2010 budget is $3.552 trillion.  And according to the most recent estimate in July, the deficit alone is going to be $1.47 trillion instead of the $1.171 trillion originally forecast.</p><p>So, Republicans are going to cut 2.8% of the federal budget, or if you prefer, 6.8% of the federal budget deficit.  In other words, if the nation were a car speeding towards a canyon at 70 miles per hour, the Republicans master plan for saving the passengers would be to <i>slow the car down to 65.2 MPH!</i> And let’s see if what Boehner’s plans are for addressing the four pressing issues I mentioned in <a href=\"http://www.wnd.com/index.php?fa=PAGE.view&amp;pageId=221997\">today’s column</a>:</p><p><i>1) The economy.</i> He mentioned it.  But repealing “the job-killing health care law and” replacing “it with common-sense reforms focused on lowering costs and protecting American jobs” is isn’t even going to begin solving the debt-deflation problem of $52 trillion in public and private debt.</p><p><i>2) The massive mortgage fraud.</i> Nothing.  I suspect the Republicans will come out on the side of the banks and sacrifice the rule of law for nothing.  But who knows?  Boehner didn’t mention it.</p><p><i>3) Immigration.</i> Nothing, although there is just a hint of anti-Ricardian rhetoric detectable in the phrase “protecting American jobs”.  Again, Republicans are more likely to be part of the problem than the solution here; Ronald Reagan was signed Ted Kennedy’s 1986 law.</p><p><i>4) The endless wars.</i> Nothing.  And they’re for it.</p><p>In conclusion, I see no reason not to vote Republican if it amuses you.  They’re certainly not going to make things any worse than the Obama-Reid-Pelosi Democrats.  So vote how thou wilt, because it will make no substantive difference in the material outcome of the nation’s fate.</p></div>",
  "content_text": "In which it is proved by the Republican House Majority Leader-to-be, Rep. John Boehner:\nWhy You Should Vote For Republicans\nAmericans are speaking out and demanding a new way forward in Washington. Republicans have listened and outlined a new governing agenda in the form of a Pledge to America focused on creating jobs, cutting spending and changing the way Washington does business.\nA smaller government\nAt the core of the Pledge is an idea Washington just hasn’t tried before — that the path to recovery lies in making government smaller instead of making it bigger. To jump-start job creation, the economic uncertainty gripping small businesses has to be eliminated, and the spending binge in Washington has to be stopped.\nThe Pledge puts forth a clear plan to end the current uncertainty, starting with stopping all looming tax hikes so that small businesses can get back to creating jobs. This is followed by a blueprint for fiscal sanity that begins with cutting spending to pre-“stimulus,” pre-bailout levels, a move that will save taxpayers $100 billion in the first year alone.\nVery well.  Smaller government sounds good.  Saving $100 billion in the first year alone sounds like a lot.  Now, what was the federal budget in 2010?  According to “A New Era of Responsibility: Renewing America’s Promise” which is the Orwellian title for The United States Federal Budget for Fiscal Year 2010, the 2010 budget is $3.552 trillion.  And according to the most recent estimate in July, the deficit alone is going to be $1.47 trillion instead of the $1.171 trillion originally forecast.\nSo, Republicans are going to cut 2.8% of the federal budget, or if you prefer, 6.8% of the federal budget deficit.  In other words, if the nation were a car speeding towards a canyon at 70 miles per hour, the Republicans master plan for saving the passengers would be to\nslow the car down to 65.2 MPH!\nAnd let’s see if what Boehner’s plans are for addressing the four pressing issues I mentioned in\ntoday’s column\n:\n1) The economy.\nHe mentioned it.  But repealing “the job-killing health care law and” replacing “it with common-sense reforms focused on lowering costs and protecting American jobs” is isn’t even going to begin solving the debt-deflation problem of $52 trillion in public and private debt.\n2) The massive mortgage fraud.\nNothing.  I suspect the Republicans will come out on the side of the banks and sacrifice the rule of law for nothing.  But who knows?  Boehner didn’t mention it.\n3) Immigration.\nNothing, although there is just a hint of anti-Ricardian rhetoric detectable in the phrase “protecting American jobs”.  Again, Republicans are more likely to be part of the problem than the solution here; Ronald Reagan was signed Ted Kennedy’s 1986 law.\n4) The endless wars.\nNothing.  And they’re for it.\nIn conclusion, I see no reason not to vote Republican if it amuses you.  They’re certainly not going to make things any worse than the Obama-Reid-Pelosi Democrats.  So vote how thou wilt, because it will make no substantive difference in the material outcome of the nation’s fate.",
  "tags": [
    "politics"
  ],
  "categories": [],
  "sitemap_lastmod": "2010-11-01T17:15:00+00:00"
}