{
  "url": "https://voxday.net/2010/11/19/science-vs-history/",
  "scraped_at": "2026-01-08T23:43:10.621174",
  "title": "“Science” vs History",
  "date_display": "November 19, 2010",
  "date_iso": "2010-11-19T18:03:00+00:00",
  "date_from_url": "2010-11-19",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>I have to admit, Scott Locklin <a href=\"http://takimag.com/article/when_man_invented_science/print\">identifies the invention of science</a> long before I had imagined; I always assumed that it was considered to have begun with Galileo, the so-called Father of Science.  Of course, neither scenario fits at all well with the revisionist history of the atheist secularists and their passionate attachment to the ridiculous idea that science and religion are intrinsically at odds:</p><blockquote><p>Pope Benedict’s trip to Ole Blighty is over, and that sanctimonious gasbag Dawkins didn’t manage to arrest him in the name of secular humanism. While I’m not a believer myself, I often wonder at such professional atheists who cover themselves in the mantle of “science.” Don’t they know any history?</p><p>What we refer to today as “science” is something which was invented by humans, rather than springing forth from Jove’s forehead in some ancient time before time. There is a definite date before which there was no science and a date after which there was science. This isn’t controversial or mysterious: We know exactly when it happened, and some of the original manuscripts which invented science and modern thought still exist….</p><p>History’s first scientist was Robert Grosseteste, although his work is little known in popular education today. He was born in 1170 or so to a humble Suffolk family. He found his calling in the Catholic Church, as important a source of social mobility then as the university system is now. It was Grosseteste who formulated the first description of the scientific process. He was the first European in centuries to study Aristotle’s works and the first to study Arab natural philosopher Abu Ibn al-Haytham’s writings. From these thinkers he developed the idea of “composition and resolution,” which is the scientific method in itself.</p></blockquote><p>Interesting.  And of course, as we know from other areas of their demonstrated ignorance, the short answer is: no, the professional atheists don’t know any history.  And as a general rule, when science and history happen to conflict, it’s <i>usually</i> wise to bet on history.</p></div>",
  "content_text": "I have to admit, Scott Locklin\nidentifies the invention of science\nlong before I had imagined; I always assumed that it was considered to have begun with Galileo, the so-called Father of Science.  Of course, neither scenario fits at all well with the revisionist history of the atheist secularists and their passionate attachment to the ridiculous idea that science and religion are intrinsically at odds:\nPope Benedict’s trip to Ole Blighty is over, and that sanctimonious gasbag Dawkins didn’t manage to arrest him in the name of secular humanism. While I’m not a believer myself, I often wonder at such professional atheists who cover themselves in the mantle of “science.” Don’t they know any history?\nWhat we refer to today as “science” is something which was invented by humans, rather than springing forth from Jove’s forehead in some ancient time before time. There is a definite date before which there was no science and a date after which there was science. This isn’t controversial or mysterious: We know exactly when it happened, and some of the original manuscripts which invented science and modern thought still exist….\nHistory’s first scientist was Robert Grosseteste, although his work is little known in popular education today. He was born in 1170 or so to a humble Suffolk family. He found his calling in the Catholic Church, as important a source of social mobility then as the university system is now. It was Grosseteste who formulated the first description of the scientific process. He was the first European in centuries to study Aristotle’s works and the first to study Arab natural philosopher Abu Ibn al-Haytham’s writings. From these thinkers he developed the idea of “composition and resolution,” which is the scientific method in itself.\nInteresting.  And of course, as we know from other areas of their demonstrated ignorance, the short answer is: no, the professional atheists don’t know any history.  And as a general rule, when science and history happen to conflict, it’s\nusually\nwise to bet on history.",
  "tags": [
    "atheism",
    "science"
  ],
  "categories": [],
  "sitemap_lastmod": "2010-11-19T18:03:00+00:00"
}