{
  "url": "https://voxday.net/2010/11/21/strip-search-usa/",
  "scraped_at": "2026-01-08T23:43:21.709985",
  "title": "Strip search USA",
  "date_display": "November 21, 2010",
  "date_iso": "2010-11-21T18:00:00+00:00",
  "date_from_url": "2010-11-21",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>No nation that is willing to collectively submit to this behavior is one that deserves to survive.  Only a nation of fat and worthless sheep who have wholly abandoned their inheritance of liberty would prefer <i>to have its children strip-searched</i> than give up air travel.  On a potentially related note, not that you had any doubt, but the big banks are definitely going to need the expected TARP II soon.  It turns out that many of the so-called mortgage-backed securities <i>didn’t have any mortgages backing them.</i></p><blockquote><p>Countrywide Routinely Failed to Send Key Docs to MBS Trustees, B of A Employee Says, by Kate Berry, American Banker: Countrywide, the mortgage giant that’s now part of Bank of America Corp., routinely didn’t bother to transfer essential documents for loans sold to investors, an employee testified…. it was customary for Countrywide to maintain possession of the original note and related loan documents.</p></blockquote><p>Denninger explains the significance <a href=\"http://market-ticker.org/akcs-www?post=172904\">at the Market Ticker</a>.</p></div>",
  "content_text": "No nation that is willing to collectively submit to this behavior is one that deserves to survive.  Only a nation of fat and worthless sheep who have wholly abandoned their inheritance of liberty would prefer\nto have its children strip-searched\nthan give up air travel.  On a potentially related note, not that you had any doubt, but the big banks are definitely going to need the expected TARP II soon.  It turns out that many of the so-called mortgage-backed securities\ndidn’t have any mortgages backing them.\nCountrywide Routinely Failed to Send Key Docs to MBS Trustees, B of A Employee Says, by Kate Berry, American Banker: Countrywide, the mortgage giant that’s now part of Bank of America Corp., routinely didn’t bother to transfer essential documents for loans sold to investors, an employee testified…. it was customary for Countrywide to maintain possession of the original note and related loan documents.\nDenninger explains the significance\nat the Market Ticker\n.",
  "tags": [
    "Americana"
  ],
  "categories": [],
  "sitemap_lastmod": "2010-11-21T18:00:00+00:00"
}