{
  "url": "https://voxday.net/2010/11/27/vox-academy/",
  "scraped_at": "2026-01-08T23:43:47.029006",
  "title": "Vox Academy",
  "date_display": "November 27, 2010",
  "date_iso": "2010-11-27T13:12:00+00:00",
  "date_from_url": "2010-11-27",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>Like many others, including Bill Gates, I was very impressed with Khan Academy’s creation of 1,600 short online lectures on various subjects from the French Revolution to calculus.  However, I was more than a little underwhelmed with the short collection of economic lectures, especially when the very first one on inflation began by getting the very definition of inflation wrong.  So, I have begun producing a short series of video lectures on the difference between inflation and the Consumer Price Index using OpenOffice Impress in combination with the Camtasia software that Mr. Khan uses for his lectures.  I hope to have the first one uploaded to YouTube this weekend; they don’t take very long to make so my goal is to produce one per week and incorporate a quiz at the end of each series.</p><p>I’m not a fan of lecture-based learning myself, but I have learned that I am in the distinct minority in my preference for reading rather than listening or viewing.  Hence the experiment.  My question is this: what subjects beyond an inflation series would be of interest to the Ilk?  Some of the various ideas that have occurred to me are a chapter-by-chapter study of Paul Samuelson’s <i>Economics</i>, a critical series addressing Sam Harris’s latest book, a series on Shakespeare or Dante in the vein of Isaac Asimov’s massive doorstop, or, of course, a series on the prospects for a Japanese naval invasion of the American West Coast in 1942.  Does anyone have any better ideas?</p></div>",
  "content_text": "Like many others, including Bill Gates, I was very impressed with Khan Academy’s creation of 1,600 short online lectures on various subjects from the French Revolution to calculus.  However, I was more than a little underwhelmed with the short collection of economic lectures, especially when the very first one on inflation began by getting the very definition of inflation wrong.  So, I have begun producing a short series of video lectures on the difference between inflation and the Consumer Price Index using OpenOffice Impress in combination with the Camtasia software that Mr. Khan uses for his lectures.  I hope to have the first one uploaded to YouTube this weekend; they don’t take very long to make so my goal is to produce one per week and incorporate a quiz at the end of each series.\nI’m not a fan of lecture-based learning myself, but I have learned that I am in the distinct minority in my preference for reading rather than listening or viewing.  Hence the experiment.  My question is this: what subjects beyond an inflation series would be of interest to the Ilk?  Some of the various ideas that have occurred to me are a chapter-by-chapter study of Paul Samuelson’s\nEconomics\n, a critical series addressing Sam Harris’s latest book, a series on Shakespeare or Dante in the vein of Isaac Asimov’s massive doorstop, or, of course, a series on the prospects for a Japanese naval invasion of the American West Coast in 1942.  Does anyone have any better ideas?",
  "tags": [
    "education"
  ],
  "categories": [],
  "sitemap_lastmod": "2010-11-27T13:12:00+00:00"
}