{
  "url": "https://voxday.net/2010/11/17/war-on-human-nature/",
  "scraped_at": "2026-01-08T23:43:01.468052",
  "title": "The war on human nature",
  "date_display": "November 17, 2010",
  "date_iso": "2010-11-17T14:30:00+00:00",
  "date_from_url": "2010-11-17",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>It is not a new one.  Sam Harris’s moralistic brand of scientific utopianism is merely the latest in a long line of philosophical ideologies that end up killing large numbers of people in an attempt to remake them.  One thing I have discovered in delving deeper into what can be broadly labeled “scientific humanism” is how little its advocates realize that they are only beginning to consider important concepts that have been active matters for intensive debate by economists for two centuries.</p><p>Consider the following quote from Ludwig von Mises from <i>Economic Calculation in the Socialist Commonwealth</i>, published in 1920:</p><p><i>“All socialist systems, including that of Karl Marx, and his orthodox supporters, proceed from the assumption that in a socialist society a conflict between the interests of the particular and the general could not possibly arise.  Everybody will act in his own interest in giving of his best because he participates in the product of all economic activity.  The obvious objection that the individual is very little concerned whether he himself is diligent and enthusiastic, and that it is of greater moment to him that everybody else should be, is either completely ignored or insufficiently dealt with by them.  They believe they can construct a socialist commonwealth on the basis of the Categorical Imperative alone.  How lightly it is their wont to proceed in this way is best shown by <a href=\"http://en.wikipedia.org/wiki/Karl_Kautsky\">Kautsky </a>when he says, <b>“If socialism is a social necessity, then it would be human nature and not socialism which would have to readjust itself if ever the two clashed.”</b></i></p><p>It’s interesting how many philosophical ideologies, including scientific humanism, rely upon one form or another of this illogic.  One sees some form of this argument not only made by the secular humanists of the New Atheist cabal, but also by the advocates of global corporatism and AGW/CC activists as well as the Ricardian free traders.  (There is, of course, a certain amount of ideological overlap between these groups.) Ironically, those who are prone to relying upon these utopian and purely philosophical arguments almost inevitably claim to be realistic empiricists despite the fact that the observable and empirical evidence tends to be stacked rather heavily against them.</p><p>But it isn’t their ignorance that makes them dangerous.  The danger lies in their inability to recognize the logical consequences of their arguments.  Those who believe in the perfectibility of Man are inevitably bound to find themselves eventually advocating the culling of imperfect men.</p></div>",
  "content_text": "It is not a new one.  Sam Harris’s moralistic brand of scientific utopianism is merely the latest in a long line of philosophical ideologies that end up killing large numbers of people in an attempt to remake them.  One thing I have discovered in delving deeper into what can be broadly labeled “scientific humanism” is how little its advocates realize that they are only beginning to consider important concepts that have been active matters for intensive debate by economists for two centuries.\nConsider the following quote from Ludwig von Mises from\nEconomic Calculation in the Socialist Commonwealth\n, published in 1920:\n“All socialist systems, including that of Karl Marx, and his orthodox supporters, proceed from the assumption that in a socialist society a conflict between the interests of the particular and the general could not possibly arise.  Everybody will act in his own interest in giving of his best because he participates in the product of all economic activity.  The obvious objection that the individual is very little concerned whether he himself is diligent and enthusiastic, and that it is of greater moment to him that everybody else should be, is either completely ignored or insufficiently dealt with by them.  They believe they can construct a socialist commonwealth on the basis of the Categorical Imperative alone.  How lightly it is their wont to proceed in this way is best shown by\nKautsky\nwhen he says,\n“If socialism is a social necessity, then it would be human nature and not socialism which would have to readjust itself if ever the two clashed.”\nIt’s interesting how many philosophical ideologies, including scientific humanism, rely upon one form or another of this illogic.  One sees some form of this argument not only made by the secular humanists of the New Atheist cabal, but also by the advocates of global corporatism and AGW/CC activists as well as the Ricardian free traders.  (There is, of course, a certain amount of ideological overlap between these groups.) Ironically, those who are prone to relying upon these utopian and purely philosophical arguments almost inevitably claim to be realistic empiricists despite the fact that the observable and empirical evidence tends to be stacked rather heavily against them.\nBut it isn’t their ignorance that makes them dangerous.  The danger lies in their inability to recognize the logical consequences of their arguments.  Those who believe in the perfectibility of Man are inevitably bound to find themselves eventually advocating the culling of imperfect men.",
  "tags": [
    "philosophy"
  ],
  "categories": [],
  "sitemap_lastmod": "2010-11-17T14:30:00+00:00"
}