{
  "url": "https://voxday.net/2010/11/17/we-wont-fly/",
  "scraped_at": "2026-01-08T23:43:03.289653",
  "title": "We won’t fly",
  "date_display": "November 17, 2010",
  "date_iso": "2010-11-17T18:15:00+00:00",
  "date_from_url": "2010-11-17",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><div class=\"separator\" style=\"clear: both; text-align: center;\"><a href=\"http://wewontfly.com/wp-content/themes/thesis_18/custom/rotator/crossoutfly.jpg\" imageanchor=\"1\" style=\"clear: left; float: left; margin-bottom: 1em; margin-right: 1em;\"><img border=\"0\" decoding=\"async\" fetchpriority=\"high\" height=\"240\" src=\"http://wewontfly.com/wp-content/themes/thesis_18/custom/rotator/crossoutfly.jpg\" width=\"320\"/></a></div><p>Neither Spacebunny nor I have any intention of flying while the TSA is permitted to force travelers to choose between being scanned naked or sexually molested.  This is an absolute travesty and if Americans do not resist it now, they will have no cause to complain when they start facing the same choice every time they leave the house and travel in a car, a bus, or a train, all of which are presently under the abusive authority of the Transportation Security Administration.  As I wrote in my column on Monday, I recommend that Americans not settle for merely opting out of the scanners and submitting to the <s>grope test</s>gate rape, but rather stay home, save money, and see how long it will take before the airlines stop meekly accepting every Federal dictate handed down from on bureaucratic high in the interest of their own survival.  See <a href=\"http://wewontfly.com/blog/\">We Won’t Fly</a> for more details.</p><p>Needless to say, every pervert and pedophile has probably submitted their application to the TSA upon hearing that hot down-the-pants action was now part of the job description; SB sent me this little bit of unsurprising news about a police search <a href=\"http://www.winthroptranscript.com/2010/03/04/winthrop-man-sought-in-connection-with-child-rape-case/\">for one of the TSA’s finest</a>.</p><blockquote><p> Winthrop Police were searching this week for 45-year old Sean  Shanahan, most recently of 26 Shirley Street apartment #3 on five  charges including two counts of statutory rape, two counts of enticing a  child and one count of indecent assault and battery on a child under  14, after the alleged victim’s parents reported finding disturbing and  explicit text messages on the child’s cell phone.  “This individual (Shanahan) is someone who was familiar with the  child,” explained Police Chief Terrence Delehanty. “It appears that this  case began with a series of text messages and then progressed to other  activities that included the statutory rape charges.”</p><p>Shanahan, a Transportation Security Administration employee at Logan  Airport, has not appeared at his job in several days and has also not  been back to his apartment on Shirley Street, following an initial  search of his residence by police, which resulted in the confiscation of  a computer and cell phone from his home.</p></blockquote><p> Clearly this is all just a terrible misunderstanding, as Shanahan is obviously nothing more than a deeply committed employee who is so devoted to transportation security that he took his work home with him.  The TSA will probably promote him.  And for those who think the scanners are a reasonable option, note that, statistically speaking, they are as about as dangerous to your health <a href=\"http://cosmiclog.msnbc.msn.com/_news/2010/11/16/5477568-are-airport-x-ray-scanners-harmful\">as those dangerous airborne terrorists</a>.</p></div>",
  "content_text": "Neither Spacebunny nor I have any intention of flying while the TSA is permitted to force travelers to choose between being scanned naked or sexually molested.  This is an absolute travesty and if Americans do not resist it now, they will have no cause to complain when they start facing the same choice every time they leave the house and travel in a car, a bus, or a train, all of which are presently under the abusive authority of the Transportation Security Administration.  As I wrote in my column on Monday, I recommend that Americans not settle for merely opting out of the scanners and submitting to the\ngrope test\ngate rape, but rather stay home, save money, and see how long it will take before the airlines stop meekly accepting every Federal dictate handed down from on bureaucratic high in the interest of their own survival.  See\nWe Won’t Fly\nfor more details.\nNeedless to say, every pervert and pedophile has probably submitted their application to the TSA upon hearing that hot down-the-pants action was now part of the job description; SB sent me this little bit of unsurprising news about a police search\nfor one of the TSA’s finest\n.\nWinthrop Police were searching this week for 45-year old Sean  Shanahan, most recently of 26 Shirley Street apartment #3 on five  charges including two counts of statutory rape, two counts of enticing a  child and one count of indecent assault and battery on a child under  14, after the alleged victim’s parents reported finding disturbing and  explicit text messages on the child’s cell phone.  “This individual (Shanahan) is someone who was familiar with the  child,” explained Police Chief Terrence Delehanty. “It appears that this  case began with a series of text messages and then progressed to other  activities that included the statutory rape charges.”\nShanahan, a Transportation Security Administration employee at Logan  Airport, has not appeared at his job in several days and has also not  been back to his apartment on Shirley Street, following an initial  search of his residence by police, which resulted in the confiscation of  a computer and cell phone from his home.\nClearly this is all just a terrible misunderstanding, as Shanahan is obviously nothing more than a deeply committed employee who is so devoted to transportation security that he took his work home with him.  The TSA will probably promote him.  And for those who think the scanners are a reasonable option, note that, statistically speaking, they are as about as dangerous to your health\nas those dangerous airborne terrorists\n.",
  "tags": [
    "Americana"
  ],
  "categories": [],
  "sitemap_lastmod": "2010-11-17T18:15:00+00:00"
}