{
  "url": "https://voxday.net/2010/11/01/whom-gods-would-destroy-2/",
  "scraped_at": "2026-01-08T23:41:36.717867",
  "title": "Whom the gods would destroy",
  "date_display": "November 1, 2010",
  "date_iso": "2010-11-01T19:45:00+00:00",
  "date_from_url": "2010-11-01",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>Medea had nothing on the Minnesota Vikings.  After that ludicrous collapse yesterday, they went and <i>waived Randy Moss!</i> Right, because <i>he</i> was the problem.  Interestingly enough, Favre wasn’t the problem last night, the one underthrown ball to Percy Harvin that led to a fantastic interception by the Patriot rookie cornerback notwithstanding.</p><p>1.  Childress blew another challenge.  A week late doesn’t count, Chilly.<br> 2.  Going for it on fourth-and-goal was a reasonable call.  Trying to run behind Loadholt instead of Hutchinson wasn’t.<br> 3.  Apparently we have never heard of “play-action” passes.  Especially not when everyone in the stadium knows the ball is going to AD.<br> 4.  Asher Allen.<br> 5.  And again, Asher Allen.  Is there any way Antoine Winfield doesn’t make that tackle on Wes Welker?<br> 6.  The Tarvaris Jackson Experiment still cannot play quarterback in the National Football League.  I remember that signature, “lift up the ball high as the pocket collapses around you, then somehow manage to hold onto it as you get sacked” play.  Nice to see he’s still got it.</br></br></br></br></br></p><p>Naturally, the solution to all of this was getting rid of the Hall of Fame wide receiver who commanded double and triple-teams all game.  Childress has to go and he has to go now.  He’s the only coach in the league capable of being outcoached by Mike Singletary.  There’s no need for an interim coach, just let Brett Favre do it.  It’s not like he could do any worse.</p><p>I kind of hope New England signs Moss.  It would be a fitting conclusion to the madness.</p></div>",
  "content_text": "Medea had nothing on the Minnesota Vikings.  After that ludicrous collapse yesterday, they went and\nwaived Randy Moss!\nRight, because\nhe\nwas the problem.  Interestingly enough, Favre wasn’t the problem last night, the one underthrown ball to Percy Harvin that led to a fantastic interception by the Patriot rookie cornerback notwithstanding.\n1.  Childress blew another challenge.  A week late doesn’t count, Chilly.\n2.  Going for it on fourth-and-goal was a reasonable call.  Trying to run behind Loadholt instead of Hutchinson wasn’t.\n3.  Apparently we have never heard of “play-action” passes.  Especially not when everyone in the stadium knows the ball is going to AD.\n4.  Asher Allen.\n5.  And again, Asher Allen.  Is there any way Antoine Winfield doesn’t make that tackle on Wes Welker?\n6.  The Tarvaris Jackson Experiment still cannot play quarterback in the National Football League.  I remember that signature, “lift up the ball high as the pocket collapses around you, then somehow manage to hold onto it as you get sacked” play.  Nice to see he’s still got it.\nNaturally, the solution to all of this was getting rid of the Hall of Fame wide receiver who commanded double and triple-teams all game.  Childress has to go and he has to go now.  He’s the only coach in the league capable of being outcoached by Mike Singletary.  There’s no need for an interim coach, just let Brett Favre do it.  It’s not like he could do any worse.\nI kind of hope New England signs Moss.  It would be a fitting conclusion to the madness.",
  "tags": [
    "sports"
  ],
  "categories": [],
  "sitemap_lastmod": "2010-11-01T19:45:00+00:00"
}