{
  "url": "https://voxday.net/2010/11/10/why-hello-mr-dagger/",
  "scraped_at": "2026-01-08T23:42:26.611874",
  "title": "The Republican Iago strikes",
  "date_display": "November 10, 2010",
  "date_iso": "2010-11-10T18:16:00+00:00",
  "date_from_url": "2010-11-10",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>The elders of the GOP show <a href=\"http://dyn.politico.com/printstory.cfm?uuid=317CEEC0-DC88-C8A7-61499B727950D540\">their de Gaullesque gratitude</a> for the Tea Party putting them back in the driver’s seat:</p><blockquote><p>Senate Minority Leader Mitch McConnell is maneuvering behind the scenes to defeat a conservative plan aimed at restricting earmarks, setting up a high-stakes showdown that pits the GOP leader and his “Old Bull” allies against Sen. Jim DeMint (R-S.C.) and a new breed of conservative senators….  By keeping a low profile so far, McConnell is seeking to avoid an all-out public battle among his GOP colleagues over earmarks before the new Congress starts. He also wants to avoid alienating the tea party movement and conservative activists who helped win six Senate seats for Republicans on Election Day, victories that dramatically strengthened McConnell’s hand as he plans to battle the White House over repealing health care reform, retaining Bush-era tax cuts and reining in federal spending.</p></blockquote><p>Right, that’s why Americans turned against Obama and the Democrats.  It wasn’t due to all the excessive taxing, borrowing, and spending, but because they wanted <i>Republicans</i> to do the excessive taxing, borrowing, and spending.  I can’t say it’s unexpected, but it is impressively shameless.</p><p>Welcome to Washington, Tea Partiers.  How do you like the feel of that dagger in your back?  Kind of stings, doesn’t it.</p></div>",
  "content_text": "The elders of the GOP show\ntheir de Gaullesque gratitude\nfor the Tea Party putting them back in the driver’s seat:\nSenate Minority Leader Mitch McConnell is maneuvering behind the scenes to defeat a conservative plan aimed at restricting earmarks, setting up a high-stakes showdown that pits the GOP leader and his “Old Bull” allies against Sen. Jim DeMint (R-S.C.) and a new breed of conservative senators….  By keeping a low profile so far, McConnell is seeking to avoid an all-out public battle among his GOP colleagues over earmarks before the new Congress starts. He also wants to avoid alienating the tea party movement and conservative activists who helped win six Senate seats for Republicans on Election Day, victories that dramatically strengthened McConnell’s hand as he plans to battle the White House over repealing health care reform, retaining Bush-era tax cuts and reining in federal spending.\nRight, that’s why Americans turned against Obama and the Democrats.  It wasn’t due to all the excessive taxing, borrowing, and spending, but because they wanted\nRepublicans\nto do the excessive taxing, borrowing, and spending.  I can’t say it’s unexpected, but it is impressively shameless.\nWelcome to Washington, Tea Partiers.  How do you like the feel of that dagger in your back?  Kind of stings, doesn’t it.",
  "tags": [
    "politics"
  ],
  "categories": [],
  "sitemap_lastmod": "2010-11-10T18:16:00+00:00"
}