{
  "url": "https://voxday.net/2010/11/22/wnd-column_22-3/",
  "scraped_at": "2026-01-08T23:43:23.545977",
  "title": "WND column",
  "date_display": "November 22, 2010",
  "date_iso": "2010-11-22T08:04:00+00:00",
  "date_from_url": "2010-11-22",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p><b><a href=\"http://www.wnd.com/index.php?fa=PAGE.view&amp;pageId=231089\"><i>The Moral Landscape</i></a></b></p><p>Sam Harris’s first two books were commercial successes and intellectual failures. Riddled with basic factual and logical errors, <i>The End of Faith</i> and <i>Letter to a Christian Nation</i> served as little more than godless red meat snapped up by unthinking atheists around the English-speaking world. His third book, <i>The Moral Landscape</i>, is also a challenge to established wisdom, but it is a much more sober, serious and interesting book than its predecessors.</p><p>The basis for the book is Harris’s own neuroscience experiments, in which he tested his hypothesis that when hooked up to an fMRI scanner, the human brain would produce an observable difference in its activity when contemplating non-religious beliefs than when considering religious beliefs. As it happens, the hypothesis was found to be incorrect, as the same responses were elicited from both the believing group and the non-believing group for religious and nonreligious stimuli alike. (Full disclosure: I was one of the Christians asked by Mr. Harris to review the religious stimuli to ensure their theological verisimilitude. In my opinion, the questions utilized were both reasonable and fair.)</p><p> NOTE: For those who happen to be interested in the subject, I will be posting the bookmarked notes I made in the course of reading <i>The Moral Landscape</i> here later this week.</p></div>",
  "content_text": "The Moral Landscape\nSam Harris’s first two books were commercial successes and intellectual failures. Riddled with basic factual and logical errors,\nThe End of Faith\nand\nLetter to a Christian Nation\nserved as little more than godless red meat snapped up by unthinking atheists around the English-speaking world. His third book,\nThe Moral Landscape\n, is also a challenge to established wisdom, but it is a much more sober, serious and interesting book than its predecessors.\nThe basis for the book is Harris’s own neuroscience experiments, in which he tested his hypothesis that when hooked up to an fMRI scanner, the human brain would produce an observable difference in its activity when contemplating non-religious beliefs than when considering religious beliefs. As it happens, the hypothesis was found to be incorrect, as the same responses were elicited from both the believing group and the non-believing group for religious and nonreligious stimuli alike. (Full disclosure: I was one of the Christians asked by Mr. Harris to review the religious stimuli to ensure their theological verisimilitude. In my opinion, the questions utilized were both reasonable and fair.)\nNOTE: For those who happen to be interested in the subject, I will be posting the bookmarked notes I made in the course of reading\nThe Moral Landscape\nhere later this week.",
  "tags": [
    "atheism",
    "books"
  ],
  "categories": [],
  "sitemap_lastmod": "2010-11-22T08:04:00+00:00"
}