{
  "url": "https://voxday.net/2010/11/15/wnd-column_15-3/",
  "scraped_at": "2026-01-08T23:42:46.795163",
  "title": "WND column",
  "date_display": "November 15, 2010",
  "date_iso": "2010-11-15T08:02:00+00:00",
  "date_from_url": "2010-11-15",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p><b><a href=\"http://www.wnd.com/index.php?fa=PAGE.view&amp;pageId=228089\">National No-Fly Zone</a></b></p><p>Although they don’t realize it yet, the will of Americans is being tested by the federal agency known as the Transportation Security Administration. Not being content with forcing air passengers to leave their deadly nail clippers and water bottles at home, the TSA now wants them to submit to full-visual X-ray examination machines that are now being installed as standard security devices at airports around the nation.</p><p>Addendum: Beezle emails to report that my conclusions about the TSA’s Orwellian long-term intentions <a href=\"http://www.commondreams.org/view/2010/10/04-1\">appear to be correct</a>. <i>If you have been feeling uneasy about having to be X-rayed by a Transportation Security Administration goon who can look under your clothes every time you fly, consider this: at least you can say no, and agree to be subjected to an old-fashioned full-body search.  No opt-out for the latest in anti-terror technology though, with reports just out in Forbes Magazine and the Christian Science Monitor that the Homeland Security Department has purchased 500 mobile X-ray vans called ZBVs that can scan cars, trucks and homes without the drivers even knowing that they’re being zapped.</i></p></div>",
  "content_text": "National No-Fly Zone\nAlthough they don’t realize it yet, the will of Americans is being tested by the federal agency known as the Transportation Security Administration. Not being content with forcing air passengers to leave their deadly nail clippers and water bottles at home, the TSA now wants them to submit to full-visual X-ray examination machines that are now being installed as standard security devices at airports around the nation.\nAddendum: Beezle emails to report that my conclusions about the TSA’s Orwellian long-term intentions\nappear to be correct\n.\nIf you have been feeling uneasy about having to be X-rayed by a Transportation Security Administration goon who can look under your clothes every time you fly, consider this: at least you can say no, and agree to be subjected to an old-fashioned full-body search.  No opt-out for the latest in anti-terror technology though, with reports just out in Forbes Magazine and the Christian Science Monitor that the Homeland Security Department has purchased 500 mobile X-ray vans called ZBVs that can scan cars, trucks and homes without the drivers even knowing that they’re being zapped.",
  "tags": [
    "WND"
  ],
  "categories": [],
  "sitemap_lastmod": "2010-11-15T08:02:00+00:00"
}