{
  "url": "https://voxday.net/2010/11/04/you-wanted-it-you-got-i/",
  "scraped_at": "2026-01-08T23:41:53.198890",
  "title": "You wanted it, you got it",
  "date_display": "November 4, 2010",
  "date_iso": "2010-11-04T14:45:00+00:00",
  "date_from_url": "2010-11-04",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>If <a href=\"http://www.dailymail.co.uk/femail/article-1326369/Is-man-left-40-isnt-rude-ignorant-pig.html\">this woman’s lament</a> doesn’t put an amused smile on your face today, well, you’re probably not a man under the age of fifty:</p><blockquote><p>Let me tell you, dear ladies: the age of chivalry is dead.</p><p>Yesterday, I drove out of a car park in ­Kensington, London, to find the power-steering on my BMW had gone. The car wouldn’t move.  Thankfully, I was in a cul de sac, not a motorway.  I stopped and tried to pull over. My car was one foot from the kerb. I put my hazard lights on.  Next to me was a building site full of men in fluoro ­jackets standing doing ­nothing. They could see my distress when I began ­peering under the bonnet. I got back in the car, and on my mobile phone to call the BMW breakdown ­service to get the vehicle recovered. I was in tears. Still no one ­bothered to help….</p><p>I had thought it was just my ex-husband who used to allow me to put petrol in the car while he sat warm in the passenger seat, but if my ­experience yesterday ­morning is anything to go by, it’s a generational phenomenon.  As Top Gear’s James May said this week, young men have lost their masculinity, in that they can no longer fix things. And this loss of manners is far worse.  Young working British men: you should be ashamed.</p></blockquote><p>Be ashamed of what?  The “f****** cow” is totally in the wrong here.  And I wonder, were those nearby men really “doing nothing” or did she simply neither realize nor care how they were occupying themselves thanks to her female solipsism?</p><p>Women demanded legal and political equality and our great-grandfathers were foolish enough to grant it to them.  So they used that equality to force the last three generations of men to spend between 12 and 16 years being drenched in feminist propaganda about how women were strong, independent, and equal to us, except of course for their intrinsic emotional and moral superiority.  Once they had achieved sufficient political power, they then set about redefining the concept of equality in a successful effort to strip men of their legal rights and render them legally inferior in an extra-Constitutional court system where men are guilty until pronounced innocent.  And then, after all this, they’re surprised when we don’t treat them like our great-grandfathers treated their great-grandmothers.</p><p>I am confident that I speak for many, if not most of the men of my generation in my instinctive response to this woman’s petulant <i>demand</i> that men be at her beck and call:  F— you and fix it yourself, Ms Strong Independent Woman.  It’s not my problem.</p><p>I suspect that these days, the average man is probably more likely to help a male stranger than to help women he doesn’t know.  At least a man is likely to have the decency to be grateful and not take your assistance as some sort of rightful homage.  As for chivalry being dead, I think it is pertinent to quote Isaac Asimov on the historical conventions of the concept.</p><p>“This is Helen as viewed through the eyes of courtly love.  By the convention of the troubadours, a woman need not deserve love, she need merely be a woman.”  And don’t forget, a woman’s chivalric champion was ideally supposed to be her <i>adulterous</i> lover.  It is little wonder, then, that modern women lament chivalry’s death.<br> (HT: SB)</br></p></div>",
  "content_text": "If\nthis woman’s lament\ndoesn’t put an amused smile on your face today, well, you’re probably not a man under the age of fifty:\nLet me tell you, dear ladies: the age of chivalry is dead.\nYesterday, I drove out of a car park in ­Kensington, London, to find the power-steering on my BMW had gone. The car wouldn’t move.  Thankfully, I was in a cul de sac, not a motorway.  I stopped and tried to pull over. My car was one foot from the kerb. I put my hazard lights on.  Next to me was a building site full of men in fluoro ­jackets standing doing ­nothing. They could see my distress when I began ­peering under the bonnet. I got back in the car, and on my mobile phone to call the BMW breakdown ­service to get the vehicle recovered. I was in tears. Still no one ­bothered to help….\nI had thought it was just my ex-husband who used to allow me to put petrol in the car while he sat warm in the passenger seat, but if my ­experience yesterday ­morning is anything to go by, it’s a generational phenomenon.  As Top Gear’s James May said this week, young men have lost their masculinity, in that they can no longer fix things. And this loss of manners is far worse.  Young working British men: you should be ashamed.\nBe ashamed of what?  The “f****** cow” is totally in the wrong here.  And I wonder, were those nearby men really “doing nothing” or did she simply neither realize nor care how they were occupying themselves thanks to her female solipsism?\nWomen demanded legal and political equality and our great-grandfathers were foolish enough to grant it to them.  So they used that equality to force the last three generations of men to spend between 12 and 16 years being drenched in feminist propaganda about how women were strong, independent, and equal to us, except of course for their intrinsic emotional and moral superiority.  Once they had achieved sufficient political power, they then set about redefining the concept of equality in a successful effort to strip men of their legal rights and render them legally inferior in an extra-Constitutional court system where men are guilty until pronounced innocent.  And then, after all this, they’re surprised when we don’t treat them like our great-grandfathers treated their great-grandmothers.\nI am confident that I speak for many, if not most of the men of my generation in my instinctive response to this woman’s petulant\ndemand\nthat men be at her beck and call:  F— you and fix it yourself, Ms Strong Independent Woman.  It’s not my problem.\nI suspect that these days, the average man is probably more likely to help a male stranger than to help women he doesn’t know.  At least a man is likely to have the decency to be grateful and not take your assistance as some sort of rightful homage.  As for chivalry being dead, I think it is pertinent to quote Isaac Asimov on the historical conventions of the concept.\n“This is Helen as viewed through the eyes of courtly love.  By the convention of the troubadours, a woman need not deserve love, she need merely be a woman.”  And don’t forget, a woman’s chivalric champion was ideally supposed to be her\nadulterous\nlover.  It is little wonder, then, that modern women lament chivalry’s death.\n(HT: SB)",
  "tags": [
    "women"
  ],
  "categories": [],
  "sitemap_lastmod": "2010-11-04T14:45:00+00:00"
}