{
  "url": "https://voxday.net/2019/02/23/burning-the-deadwood/",
  "scraped_at": "2025-12-20T05:31:18.406064",
  "title": "Burning the deadwood",
  "date_display": "February 23, 2019",
  "date_iso": "2019-02-23T11:02:25+00:00",
  "date_from_url": "2019-02-23",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>There is certainly nothing like the mention <a href=\"https://www.youtube.com/watch?v=o-aXTOfsy04\">of the state of Israel</a> and one’s opinion concerning it to bring out the lurking spergs, alt-retards, and other undesirables on a YouTube channel. I’m no enthusiast of the “look how virtuously moderate poor little me is because I am attacked by Left and Right” approach, but I will confess that it can be a little bit bewildering to find oneself being accused of a) antisemitism and b) being a Mossad agent within the space of two comments.</p><p>MPAI but SPASC. Which is to say Most People Are Idiots but Some People are Seriously Crazy.</p><p>Anyhow, the good thing about YouTube is that unlike Blogger, it makes it very easily to permanently disappear a commenter and his comments for good with just a single click. This is absolutely necessary there, as otherwise every single channel would have the comments turned off for good.</p><p>But the good news is that the video offensive continues making solid progress. The Darkstream now has nearly 20k subscribers, and if you haven’t <a href=\"https://www.youtube.com/channel/UCGJNdaSwFeP3pLd1MhN0dRg/videos\">subscribed to it</a> yet I would encourage you to do so even if you’re not a big video watcher, for the extended audiobook samples if nothing else. Voxiversity has been on inadvertent hiatus due to the high demand for its producer, and that demand is only going to grow from here for reasons that will be clear in due course, so I’ve hired another producer who is very good at his recommendation and we anticipate releasing at least two Voxiversities in March.</p><p>There is also a third video front that is going to launch very soon for which I am seeking an tech-savvy volunteer from the VFM who has a) plenty of free time and a good Internet connection, b) doesn’t mind dealing with tedious uploads, and c) has some ability to create simple image collages of the sort that I create for the Darkstream every night. I’m only looking for VFM at the moment, so if you’re not VFM, please don’t volunteer. If you qualify and you’re interested, please email me.</p><p>In other news, multiple arbitration processes have formally commenced. I can’t say more than that at the moment, and I may not be able to say much more once they have concluded, but I will share what I permitted to share. And to those who have expressed a desire to bring independent actions, I would recommend continuing to hold fire for the time being.</p></div>",
  "content_text": "There is certainly nothing like the mention\nof the state of Israel\nand one’s opinion concerning it to bring out the lurking spergs, alt-retards, and other undesirables on a YouTube channel. I’m no enthusiast of the “look how virtuously moderate poor little me is because I am attacked by Left and Right” approach, but I will confess that it can be a little bit bewildering to find oneself being accused of a) antisemitism and b) being a Mossad agent within the space of two comments.\nMPAI but SPASC. Which is to say Most People Are Idiots but Some People are Seriously Crazy.\nAnyhow, the good thing about YouTube is that unlike Blogger, it makes it very easily to permanently disappear a commenter and his comments for good with just a single click. This is absolutely necessary there, as otherwise every single channel would have the comments turned off for good.\nBut the good news is that the video offensive continues making solid progress. The Darkstream now has nearly 20k subscribers, and if you haven’t\nsubscribed to it\nyet I would encourage you to do so even if you’re not a big video watcher, for the extended audiobook samples if nothing else. Voxiversity has been on inadvertent hiatus due to the high demand for its producer, and that demand is only going to grow from here for reasons that will be clear in due course, so I’ve hired another producer who is very good at his recommendation and we anticipate releasing at least two Voxiversities in March.\nThere is also a third video front that is going to launch very soon for which I am seeking an tech-savvy volunteer from the VFM who has a) plenty of free time and a good Internet connection, b) doesn’t mind dealing with tedious uploads, and c) has some ability to create simple image collages of the sort that I create for the Darkstream every night. I’m only looking for VFM at the moment, so if you’re not VFM, please don’t volunteer. If you qualify and you’re interested, please email me.\nIn other news, multiple arbitration processes have formally commenced. I can’t say more than that at the moment, and I may not be able to say much more once they have concluded, but I will share what I permitted to share. And to those who have expressed a desire to bring independent actions, I would recommend continuing to hold fire for the time being.",
  "tags": [
    "Darkstream"
  ],
  "categories": [],
  "sitemap_lastmod": "2019-02-23T11:02:25+00:00"
}