{
  "url": "https://voxday.net/2019/02/03/chuck-dixons-avalon-trilogy-at-arkhaven/",
  "scraped_at": "2025-12-20T05:28:31.148557",
  "title": "Chuck Dixon’s Avalon trilogy at Arkhaven",
  "date_display": "February 3, 2019",
  "date_iso": "2019-02-03T17:31:00+00:00",
  "date_from_url": "2019-02-03",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>The first three issues of Chuck Dixon’s Avalon are now available in high-quality, DRM-free CBZ format <a href=\"http://arkhavencomics.com/product-category/comics/avalon/\">on the Arkhaven store</a>. A Kindle-format edition is also included with each digital edition sale, in case you happen to prefer that format. Each issue retails for $2.99.</p><p>Meanwhile, Ben is understandably getting impatient:</p><blockquote class=\"tr_bq\"><p>When the hell is the next book coming out? You’re turning into rrrr Martin.</p></blockquote><p>It’s an understandable comparison, though I don’t believe it is a fair one. I would remind Ben and others who are impatiently waiting for more epic fantasy that I have an obligation to those who are so generously supporting my other projects. And those projects, in order of the level of their support, are as follows:</p><ol><li>Arkhaven (specifically AH and AH:Q, but also including Swan Knight Saga) </li><li>Infogalactic</li><li>Darkstream/Voxiversity</li></ol><p>Now, I very much enjoy working on <i>The Arts of Dark and Light</i>. It is a literal labor of love. It is the best thing I have yet written. But how can I justify taking so much time away from actual commitments that it hinders my ability to deliver on them, especially when I’m late on several of them as it is?</p><p>Furthermore, there is an important principle of reinforcing success and abandoning failure that must always be kept in mind. Non-fiction works such as <i>SJWAL </i>and <i>Jordanetics </i>each sell 6x more copies than novels like <i>A Throne of Bones</i> or <i>Quantum Mortis</i>, and they take CONSIDERABLY less time to write. I have a family to support, and as the Darkstream viewers know, considerable vet bills to pay. Selenoth is very far from a failure, but neither is it a commercial success on the scale of Arkhaven or even the Darkstream. So, I simply can’t justify spending very much time on indulging myself by working on the epic fantasy saga.</p><p>Readers also demanded more Quantum Mortis and I managed to find a way to deliver a lot more without taking up too much of my time. We will be announcing at least one new, and very large, Quantum Mortis project this year about which QM fans will be extremely excited, particularly those who have enjoyed <a href=\"http://arkhavencomics.com/product-tag/wardogs-inc/\">the Wardogs Inc. trilogy</a>. It’s going to be awesome. But that’s not an option for TAODAL. I can’t simply do an outline and bring in a co-author or two to crank out three or more volumes.</p><p>Here is the primary problem with the “Vox RR Day” meme: whereas George Martin is rather spectacularly failing to deliver on what pays his bills, I’m actually delivering on what pays mine. That’s why <i>Corporate Cancer </i>will come out before the extended version of <i>A Sea of Skulls</i>, and that’s why the next two big announcements we make will not be related to Selenoth in any way. And, of course, it doesn’t help me finish ASOS sooner when I’m having to spend so much time on things like Indiegogo and Amazon, to say nothing of building an alternative print/ebook/audio distribution channel, even though I’m very, very glad that we have done so and that so many of you have enthusiastically opted for it.</p><p>All that being said, I very much appreciate the continued passion for, and the interest in, TAODAL. Remember, I love it too. I continue to work on <i>A Sea of Skulls </i>and I am very pleased with the way it is progressing, though not the rate at which it progresses, and there will be a happy, though not entirely unanticipated, surprise for Selenoth fans this week.</p><p>TECH NOTE: for those having trouble with MP4 audiobook format, please <a href=\"https://arkhavencomics.com/audiobook-info/\">read this guide</a> to using it on the various platforms.</p></div>",
  "content_text": "The first three issues of Chuck Dixon’s Avalon are now available in high-quality, DRM-free CBZ format\non the Arkhaven store\n. A Kindle-format edition is also included with each digital edition sale, in case you happen to prefer that format. Each issue retails for $2.99.\nMeanwhile, Ben is understandably getting impatient:\nWhen the hell is the next book coming out? You’re turning into rrrr Martin.\nIt’s an understandable comparison, though I don’t believe it is a fair one. I would remind Ben and others who are impatiently waiting for more epic fantasy that I have an obligation to those who are so generously supporting my other projects. And those projects, in order of the level of their support, are as follows:\nArkhaven (specifically AH and AH:Q, but also including Swan Knight Saga)\nInfogalactic\nDarkstream/Voxiversity\nNow, I very much enjoy working on\nThe Arts of Dark and Light\n. It is a literal labor of love. It is the best thing I have yet written. But how can I justify taking so much time away from actual commitments that it hinders my ability to deliver on them, especially when I’m late on several of them as it is?\nFurthermore, there is an important principle of reinforcing success and abandoning failure that must always be kept in mind. Non-fiction works such as\nSJWAL\nand\nJordanetics\neach sell 6x more copies than novels like\nA Throne of Bones\nor\nQuantum Mortis\n, and they take CONSIDERABLY less time to write. I have a family to support, and as the Darkstream viewers know, considerable vet bills to pay. Selenoth is very far from a failure, but neither is it a commercial success on the scale of Arkhaven or even the Darkstream. So, I simply can’t justify spending very much time on indulging myself by working on the epic fantasy saga.\nReaders also demanded more Quantum Mortis and I managed to find a way to deliver a lot more without taking up too much of my time. We will be announcing at least one new, and very large, Quantum Mortis project this year about which QM fans will be extremely excited, particularly those who have enjoyed\nthe Wardogs Inc. trilogy\n. It’s going to be awesome. But that’s not an option for TAODAL. I can’t simply do an outline and bring in a co-author or two to crank out three or more volumes.\nHere is the primary problem with the “Vox RR Day” meme: whereas George Martin is rather spectacularly failing to deliver on what pays his bills, I’m actually delivering on what pays mine. That’s why\nCorporate Cancer\nwill come out before the extended version of\nA Sea of Skulls\n, and that’s why the next two big announcements we make will not be related to Selenoth in any way. And, of course, it doesn’t help me finish ASOS sooner when I’m having to spend so much time on things like Indiegogo and Amazon, to say nothing of building an alternative print/ebook/audio distribution channel, even though I’m very, very glad that we have done so and that so many of you have enthusiastically opted for it.\nAll that being said, I very much appreciate the continued passion for, and the interest in, TAODAL. Remember, I love it too. I continue to work on\nA Sea of Skulls\nand I am very pleased with the way it is progressing, though not the rate at which it progresses, and there will be a happy, though not entirely unanticipated, surprise for Selenoth fans this week.\nTECH NOTE: for those having trouble with MP4 audiobook format, please\nread this guide\nto using it on the various platforms.",
  "tags": [
    "Selenoth"
  ],
  "categories": [],
  "sitemap_lastmod": "2019-02-03T17:31:00+00:00"
}