{
  "url": "https://voxday.net/2019/02/14/cucks-are-so-very-clever/",
  "scraped_at": "2025-12-20T05:29:57.304067",
  "title": "Cucks are so very clever",
  "date_display": "February 14, 2019",
  "date_iso": "2019-02-14T17:43:06+00:00",
  "date_from_url": "2019-02-14",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>I don’t think <a href=\"https://pjmedia.com/instapundit/321734/\">complaining about the anti-semitism of Muslims</a> is going to be any more rhetorically effective than pointing out how Dems R the Real Racists.</p><blockquote class=\"tr_bq\"><p>Jesse Kelly@JesseKellyDC<br>Republicans should be POURING money into IIhan Omar’s re-election campaign. If you’re a Republican and you wanted to plant a destructive parasite in the Democrat party, what exactly would you be doing differently than what she’s doing? It’s glorious. I’m donating.</br></p></blockquote><p>Instapundit is similarly skeptical: <i>On the other hand, that’s probably what the Germans thought when they put Lenin on the train for Moscow.</i><br><i><br/></i>Even so, the fact that there are no less than <strike>SEVEN</strike> EIGHT posts about anti-semitism on the main page and none concerning anti-American, anti-Christian, or anti-white statements does tend to raise an eyebrow or two. Because that’s the conservative grand strategy, to win by being even less racist and anti-semitic than Democrats.<br><i><br/></i>Anyhow, the fact that most people keep their mouths shut for fear of falling under the scrutiny of the Eye of Soros does not mean that they are going to leap to the defense of that which they fear once those with more courage or less to lose begin to speak out against it.</br></br></p></div>",
  "content_text": "I don’t think\ncomplaining about the anti-semitism of Muslims\nis going to be any more rhetorically effective than pointing out how Dems R the Real Racists.\nJesse Kelly@JesseKellyDC\nRepublicans should be POURING money into IIhan Omar’s re-election campaign. If you’re a Republican and you wanted to plant a destructive parasite in the Democrat party, what exactly would you be doing differently than what she’s doing? It’s glorious. I’m donating.\nInstapundit is similarly skeptical:\nOn the other hand, that’s probably what the Germans thought when they put Lenin on the train for Moscow.\nEven so, the fact that there are no less than\nSEVEN\nEIGHT posts about anti-semitism on the main page and none concerning anti-American, anti-Christian, or anti-white statements does tend to raise an eyebrow or two. Because that’s the conservative grand strategy, to win by being even less racist and anti-semitic than Democrats.\nAnyhow, the fact that most people keep their mouths shut for fear of falling under the scrutiny of the Eye of Soros does not mean that they are going to leap to the defense of that which they fear once those with more courage or less to lose begin to speak out against it.",
  "tags": [
    "rhetoric"
  ],
  "categories": [],
  "sitemap_lastmod": "2019-02-14T17:43:06+00:00"
}