{
  "url": "https://voxday.net/2019/02/24/darkstream-20k/",
  "scraped_at": "2025-12-20T05:31:33.046562",
  "title": "Darkstream 20k",
  "date_display": "February 24, 2019",
  "date_iso": "2019-02-24T18:13:00+00:00",
  "date_from_url": "2019-02-24",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>To celebrate this subscriber milestone for the Darkstream, I’ve uploaded <a href=\"https://youtu.be/UwidXu90yYU\">this one-hour 43-minute excerpt</a> from the Jordanetics audiobook, which includes Milo’s Foreword, my own Introduction, and chapters one and five. If you haven’t read or listened to the book yet, this extended audio sample provides a solid foundation for the book’s case against Jordan Peterson and his evil philosophy.</p><div style=\"text-align: center;\"><iframe allow=\"accelerometer; autoplay; encrypted-media; gyroscope; picture-in-picture\" allowfullscreen=\"\" frameborder=\"0\" height=\"284\" src=\"https://www.youtube.com/embed/UwidXu90yYU\" width=\"512\"></iframe></div><p>It includes one of my favorite sections of the book, which addresses the oft-heard claim that Jordan Peterson’s thinking is simply too advanced for less-refined intellects to understand. The claim is particularly amusing for me in light of how few recognize, or even notice, my occasional literary pyrotechnic.</p><p><b>Objection 1: Jordan Peterson is a complex thinker with a Platonic approach that is easily misunderstood by those who don’t carefully follow him. You just don’t understand him.</b></p><p>I answer that, It is true that Peterson is inclined to excessive wordiness and run-on sentences, his references are often obscure, and the examples he provides are frequently too loosely connected and meandering for the average person to easily follow. But the nebulous word salad Peterson customarily presents in lieu of logical arguments is not at all typical of a genius-level intellect, to the contrary, it is much more commonly observed among academic poseurs who wish to be mistaken for one.</p><p>If you have actually read the great thinkers of whom Peterson is almost entirely ignorant, one thing that will often strike you is the intense clarity of their thought processes. Their genius stems from the way in which they enlighten the reader, from the way they turn dark chaos into orderly light. They do not confuse, to the contrary, they clarify.</p><p>As an exercise, compare the following four sentences, all of which are more complex than the norm these days. I ran each of them through the Gunning-Fog Index, a weighted average of the number of words per sentence, and the number of long words per word. The index provides a number that is supposed to indicate that the text can be understood by someone who left full-time education at a later age than the number; the higher the number, the more complicated the text. But it’s really just an objective measure of textual complexity.</p><ul><li><i>We must be able to employ persuasion, just as strict reasoning can be employed, on opposite sides of a question, not in order that we may in practice employ it in both ways (for we must not make people believe what is wrong), but in order that we may see clearly what the facts are, and that, if another man argues unfairly, we on our part may be able to confute him. </i>(GFI 31.6)</li><li><i>In like manner the poet with his words and phrases may be said to lay on the colours of the several arts, himself understanding their nature only enough to imitate them; and other people, who are as ignorant as he is, and judge only from his words, imagine that if he speaks of cobbling, or of military tactics, or of anything else, in metre and harmony and rhythm, he speaks very well –such is the sweet influence which melody and rhythm by nature have.</i> (GFI 21.9)</li><li><i>The great dramatists and religious thinkers of the world have been able to grasp this fact, at least implicitly, and to transmit it in story and image; modern analytic thinkers and existential theorists have attempted to abstract these ideas upward into “higher consciousness,” and to present them in logical and purely semantic form.</i> (GFI 18.2)</li><li><i>We have considered that students in this doctrine have not seldom been hampered by what they have found written by other authors, partly on account of the multiplication of useless questions, articles, and arguments, partly also because those things that are needful for them to know are not taught according to the order of the subject matter, but according as the plan of the book might require, or the occasion of the argument offer, partly, too, because frequent repetition brought weariness and confusion to the minds of readers.</i> (GFI 40.2)</li></ul><p>Were you able to distinguish the Peterson quote from the Aquinas, the Aristotle, and the Plato quotes? If you noticed, the Peterson sentence, which is the third sentence, is considerably shorter and less structurally complex than the other three examples, but it is also observably less clear than them. Whereas the Aristotle sentence in particular is rich with meaning, as it implies a vital distinction between rhetoric and dialectic that many today have trouble grasping even when it is explained to them in no little detail, but nevertheless clarifies the relevant point for the reader, the Peterson sentence unnecessarily complicates what is a fairly simple and straightforward observation about the mythopoetic human response to the concepts of good and evil.</p><p>And yes, the GFI on that last sentence was a respectable 36.3. But it wasn’t actually that hard to follow or understand, was it? Complexity is neither ambiguity nor nebulosity, and insight does not require complexity. Also, in case you’re interested, the authors of the four sentences, in order, were: Aristotle, Plato/Socrates, Peterson, Aquinas.</p></div>",
  "content_text": "To celebrate this subscriber milestone for the Darkstream, I’ve uploaded\nthis one-hour 43-minute excerpt\nfrom the Jordanetics audiobook, which includes Milo’s Foreword, my own Introduction, and chapters one and five. If you haven’t read or listened to the book yet, this extended audio sample provides a solid foundation for the book’s case against Jordan Peterson and his evil philosophy.\nIt includes one of my favorite sections of the book, which addresses the oft-heard claim that Jordan Peterson’s thinking is simply too advanced for less-refined intellects to understand. The claim is particularly amusing for me in light of how few recognize, or even notice, my occasional literary pyrotechnic.\nObjection 1: Jordan Peterson is a complex thinker with a Platonic approach that is easily misunderstood by those who don’t carefully follow him. You just don’t understand him.\nI answer that, It is true that Peterson is inclined to excessive wordiness and run-on sentences, his references are often obscure, and the examples he provides are frequently too loosely connected and meandering for the average person to easily follow. But the nebulous word salad Peterson customarily presents in lieu of logical arguments is not at all typical of a genius-level intellect, to the contrary, it is much more commonly observed among academic poseurs who wish to be mistaken for one.\nIf you have actually read the great thinkers of whom Peterson is almost entirely ignorant, one thing that will often strike you is the intense clarity of their thought processes. Their genius stems from the way in which they enlighten the reader, from the way they turn dark chaos into orderly light. They do not confuse, to the contrary, they clarify.\nAs an exercise, compare the following four sentences, all of which are more complex than the norm these days. I ran each of them through the Gunning-Fog Index, a weighted average of the number of words per sentence, and the number of long words per word. The index provides a number that is supposed to indicate that the text can be understood by someone who left full-time education at a later age than the number; the higher the number, the more complicated the text. But it’s really just an objective measure of textual complexity.\nWe must be able to employ persuasion, just as strict reasoning can be employed, on opposite sides of a question, not in order that we may in practice employ it in both ways (for we must not make people believe what is wrong), but in order that we may see clearly what the facts are, and that, if another man argues unfairly, we on our part may be able to confute him.\n(GFI 31.6)\nIn like manner the poet with his words and phrases may be said to lay on the colours of the several arts, himself understanding their nature only enough to imitate them; and other people, who are as ignorant as he is, and judge only from his words, imagine that if he speaks of cobbling, or of military tactics, or of anything else, in metre and harmony and rhythm, he speaks very well –such is the sweet influence which melody and rhythm by nature have.\n(GFI 21.9)\nThe great dramatists and religious thinkers of the world have been able to grasp this fact, at least implicitly, and to transmit it in story and image; modern analytic thinkers and existential theorists have attempted to abstract these ideas upward into “higher consciousness,” and to present them in logical and purely semantic form.\n(GFI 18.2)\nWe have considered that students in this doctrine have not seldom been hampered by what they have found written by other authors, partly on account of the multiplication of useless questions, articles, and arguments, partly also because those things that are needful for them to know are not taught according to the order of the subject matter, but according as the plan of the book might require, or the occasion of the argument offer, partly, too, because frequent repetition brought weariness and confusion to the minds of readers.\n(GFI 40.2)\nWere you able to distinguish the Peterson quote from the Aquinas, the Aristotle, and the Plato quotes? If you noticed, the Peterson sentence, which is the third sentence, is considerably shorter and less structurally complex than the other three examples, but it is also observably less clear than them. Whereas the Aristotle sentence in particular is rich with meaning, as it implies a vital distinction between rhetoric and dialectic that many today have trouble grasping even when it is explained to them in no little detail, but nevertheless clarifies the relevant point for the reader, the Peterson sentence unnecessarily complicates what is a fairly simple and straightforward observation about the mythopoetic human response to the concepts of good and evil.\nAnd yes, the GFI on that last sentence was a respectable 36.3. But it wasn’t actually that hard to follow or understand, was it? Complexity is neither ambiguity nor nebulosity, and insight does not require complexity. Also, in case you’re interested, the authors of the four sentences, in order, were: Aristotle, Plato/Socrates, Peterson, Aquinas.",
  "tags": [
    "Darkstream"
  ],
  "categories": [],
  "sitemap_lastmod": "2019-02-24T18:13:00+00:00"
}