{
  "url": "https://voxday.net/2019/02/09/if-you-choose-rhetoric/",
  "scraped_at": "2025-12-20T05:29:13.163808",
  "title": "If you choose rhetoric",
  "date_display": "February 9, 2019",
  "date_iso": "2019-02-09T12:13:33+00:00",
  "date_from_url": "2019-02-09",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>You will get rhetoric. JF’s fans are crying that it’s unfair I have responded to JF on the rhetorical level. They also don’t know what “disingenuous” or “ad hominem” mean:</p><blockquote class=\"tr_bq\"><p>Look its disingenuous for Vox to whine about JF’s rhetorical dismissals and then ad hominem attack him.</p></blockquote><p>There is nothing in the least bit disingenuous for someone whose dialectic overtures are met with rhetoric to subsequently switch to rhetoric. Nor am I asserting that JF’s irrelevant objections and inability to distinguish between concurrent and successional regimes, and between <i>Pan troglodytes</i> and <i>Homo sapiens sapiens</i>, have anything to do with his panoply of physical, philosophical, moral, and mental shortcomings. What he said in the debate was simply wrong. The total number of seeds ever produced by every tree in the forest over time says almost nothing meaningful about the historical annual growth rate of the trees standing in the forest today.</p><p>I just find it to be tremendously amusing that an autistic French degenerate who sexually preys on <a href=\"https://www.youtube.com/watch?v=OG4oqynMGxs&amp;feature=youtu.be\">women living really kickass lives</a> is stupid enough to rhetorically attack a) a comedian and b) the author of what may the best modern book on rhetoric, both of whom are more intelligent and more socially hardened than he is, and his fans somehow interpret this as evidence of his superior intelligence.</p><p>If you know <i>anything at all </i>about Owen Benjamin, if you know <i>anything at all</i> about me, then you have a pretty good idea how merciless this is going to be and how long it is likely to last. So, don’t shed any tears, don’t bother shaking any fingers, just sit back, have a <i>croissant</i>, and enjoy the ride.</p></div>",
  "content_text": "You will get rhetoric. JF’s fans are crying that it’s unfair I have responded to JF on the rhetorical level. They also don’t know what “disingenuous” or “ad hominem” mean:\nLook its disingenuous for Vox to whine about JF’s rhetorical dismissals and then ad hominem attack him.\nThere is nothing in the least bit disingenuous for someone whose dialectic overtures are met with rhetoric to subsequently switch to rhetoric. Nor am I asserting that JF’s irrelevant objections and inability to distinguish between concurrent and successional regimes, and between\nPan troglodytes\nand\nHomo sapiens sapiens\n, have anything to do with his panoply of physical, philosophical, moral, and mental shortcomings. What he said in the debate was simply wrong. The total number of seeds ever produced by every tree in the forest over time says almost nothing meaningful about the historical annual growth rate of the trees standing in the forest today.\nI just find it to be tremendously amusing that an autistic French degenerate who sexually preys on\nwomen living really kickass lives\nis stupid enough to rhetorically attack a) a comedian and b) the author of what may the best modern book on rhetoric, both of whom are more intelligent and more socially hardened than he is, and his fans somehow interpret this as evidence of his superior intelligence.\nIf you know\nanything at all\nabout Owen Benjamin, if you know\nanything at all\nabout me, then you have a pretty good idea how merciless this is going to be and how long it is likely to last. So, don’t shed any tears, don’t bother shaking any fingers, just sit back, have a\ncroissant\n, and enjoy the ride.",
  "tags": [
    "rhetoric"
  ],
  "categories": [],
  "sitemap_lastmod": "2019-02-09T12:13:33+00:00"
}