{
  "url": "https://voxday.net/2019/02/16/in-full-retreat/",
  "scraped_at": "2025-12-20T05:30:17.289416",
  "title": "In full retreat",
  "date_display": "February 16, 2019",
  "date_iso": "2019-02-16T19:02:37+00:00",
  "date_from_url": "2019-02-16",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>The defenders of the Neo-Darwinian hypothesis of evolution through natural selection and a whole host of things that have nothing to do with natural selection <a href=\"https://www.youtube.com/watch?v=LlX3A_fhzPg\">are frantically fighting a rhetorical withdrawa</a>l as they attempt to deal with the problem of the average rate of mutational fixations over time.</p><blockquote><p><b>Torin McCabe:</b> Vox first you said you could use math equation using fixation rates to disprove evolution since there is not enough time.  People called BS saying you could not use those rates. Next you say that we should be able to see differences in historic DNA and yes of course scientists are looking into that but again you are jumping gun if you assume that the rate of change is uniform across time.  For example 80{f03b982df00939a0603520e349290ee9e722cb707fe7cb6b379ee8d64c20e193} of the change could have occurred in 20{f03b982df00939a0603520e349290ee9e722cb707fe7cb6b379ee8d64c20e193} of the time leaving long periods of relative stability.  So regretfully your case cannot just be proved by showing how human DNA was relatively static for 100,000 years of a 12 million year period.  It will look very strange if we find DNA that narrows all the change to a very short period of time; and then perhaps external influence could then be an interesting hypothesis.﻿</p><p><b>Vox: </b>We can and it increasingly looks like we will. The defenders of the Neo-Darwinian hypothesis are losing the scientific battle, losing badly, and you know it because you’re attempting to retreat to a position of “well, it could have all happened super fast in the one area that we can’t examine yet.”  And even that retreat fails to account for the fact that we should be seeing more and faster fixated mutations among the human race further separating us from the CHLCA because a) beneficial mutations fixate faster among growing populations and b) the environmental changes have been greater over the last 450 years than at any time previous, including catastrophes and Ice Ages.</p><p>The Neo-Darwinian hypothesis has not been conclusively falsified, not yet, but the probability that it will be is rapidly increasing with advancements in genetic science. And with every retreat to “yeah, but I can imagine that this thing we haven’t ever observed is still theoretically possible”, more and more people are rhetorically convinced that the Darwinian emperor has no clothes.</p><p>It doesn’t help when you tell ridiculous lies like: <i>“again you are jumping gun if you assume that the rate of change is uniform across time”</i>. I have never, ever assumed any such thing nor can you pretend that I have. You are erroneously conflating an AVERAGE rate over time with a UNIFORM rate over time. And the more you engage in dishonest definitional changes like that, the less credible your criticism is.</p><p>But I am glad you finally admit that this is pointing to some very intriguing possibilities. If all the DNA changes occurred in a time too short for the various mechanisms currently proposed, as increasingly appears to be the case, then there must be some other mechanism at work. And isn’t that much more interesting to consider than simply trying to find a way to defend an outmoded and erroneous hypothesis?﻿</p><p><b>Smock Man: </b>It is about observed vs theoretical. Torin, Vox already agreed, as do I, that your theoretical case is possible. What Vox is saying is that if every time we observe the rate of change, and it contradicts the theory, we should begin to be skeptical. The observations we see dont make the theoretical case impossible. But you need to revise your arguments if they disagree with observation. And we are seeing that, which is a good thing.﻿</p><p><b>Torin McCabe: </b>Are you one of the “dread ilk” the fabled smart people who follow Vox?  So far I am less than impressed with most of those I have talked with﻿</p><p><b>Smock Man: </b>No, I am not. I didn’t read vox until 2015.﻿</p><p><b>Thomas Saint:  </b>It does not have to be uniform. But the existence of continuous change itself starts to come into question if it is absent in recorded instances. It’s a matter of probability. The longer the period extant of no observable genetic changes, either addition or subtraction, the higher the average rate of change must be within the unmeasured time-frame. Evolution is starting to look like a theory that ignores probability, when the whole theory is predicated on probability.</p><p>Evolution seems a nonsense if it magically doesn’t apply to a 450 year period during which populations have exploded and environments have changed to unprecedented scale. Evolution is based on ‘change’ as well as ‘time’. Remove change, and time actually becomes irrelevant. 450 years is still a large number of human generations. There must be evidence of replacement of genetic base-pairs. Vox has established a feasible number.</p><p>Evolutionists basically have to now argue that environmental change basically has to be apocalyptic to get a single replacement of a gene pair, or that humans and in fact all species have our final form. Is that what evolutionists are arguing? This theory is really starting to ridiculous isn’t it.﻿</p><p><b>Torin McCabe: </b>Yes it is a matter of probability.  Can you do some math for me: what percentage is 450 of 12 million years?  The “magic”, “unprecedented”, “apocalyptic”, and “ridiculous” slurs are not arguments.  450 years is a good start but based on a real understanding of probability much more data is needed to explain 12 million years.  There is no need for argument, get some good coverage and the answer is there.  Stop here dude, you are making a fool of yourself﻿</p><p><b>Vox: </b>No, he’s not. But you are not merely making a fool of yourself, you are being obnoxious and are very close to getting banned. First, your appeal to big numbers biologists don’t understand is irrelevant. Second, according to the current understanding of the theory, the 450 years should be seeing a higher-than-average rate of fixated mutations, not a lower-than-average rate. Third, the relevant number is 9 million years, not 12 million. And fourth, the sample years being 0.00005 of the total makes them five times more statistically relevant than the 0.00001 samples that are used to correctly predict U.S. presidential elections.﻿</p></blockquote><p>Isn’t it informative how rhetorical, nasty, and completely unscientific they get the more you press them on the actual facts and figures that are necessarily involved. At this point, we can’t even reasonably call evolution by natural selection a “theory” anymore, as it is more accurately described as a “low-probability hypothesis” that will almost certainly be entirely falsified within our lifetimes.</p><p><b>UPDATE: </b>After Torin McCabe demanded “a retraction and an apology” I banned him from the channel. He apparently believes as long as you say “if”, then it’s fine to say anything you want when you describe someone else’s actions. It is not and that is why he is not welcome to take part in the Darkstream discourse anymore.</p></div>",
  "content_text": "The defenders of the Neo-Darwinian hypothesis of evolution through natural selection and a whole host of things that have nothing to do with natural selection\nare frantically fighting a rhetorical withdrawa\nl as they attempt to deal with the problem of the average rate of mutational fixations over time.\nTorin McCabe:\nVox first you said you could use math equation using fixation rates to disprove evolution since there is not enough time.  People called BS saying you could not use those rates. Next you say that we should be able to see differences in historic DNA and yes of course scientists are looking into that but again you are jumping gun if you assume that the rate of change is uniform across time.  For example 80{f03b982df00939a0603520e349290ee9e722cb707fe7cb6b379ee8d64c20e193} of the change could have occurred in 20{f03b982df00939a0603520e349290ee9e722cb707fe7cb6b379ee8d64c20e193} of the time leaving long periods of relative stability.  So regretfully your case cannot just be proved by showing how human DNA was relatively static for 100,000 years of a 12 million year period.  It will look very strange if we find DNA that narrows all the change to a very short period of time; and then perhaps external influence could then be an interesting hypothesis.﻿\nVox:\nWe can and it increasingly looks like we will. The defenders of the Neo-Darwinian hypothesis are losing the scientific battle, losing badly, and you know it because you’re attempting to retreat to a position of “well, it could have all happened super fast in the one area that we can’t examine yet.”  And even that retreat fails to account for the fact that we should be seeing more and faster fixated mutations among the human race further separating us from the CHLCA because a) beneficial mutations fixate faster among growing populations and b) the environmental changes have been greater over the last 450 years than at any time previous, including catastrophes and Ice Ages.\nThe Neo-Darwinian hypothesis has not been conclusively falsified, not yet, but the probability that it will be is rapidly increasing with advancements in genetic science. And with every retreat to “yeah, but I can imagine that this thing we haven’t ever observed is still theoretically possible”, more and more people are rhetorically convinced that the Darwinian emperor has no clothes.\nIt doesn’t help when you tell ridiculous lies like:\n“again you are jumping gun if you assume that the rate of change is uniform across time”\n. I have never, ever assumed any such thing nor can you pretend that I have. You are erroneously conflating an AVERAGE rate over time with a UNIFORM rate over time. And the more you engage in dishonest definitional changes like that, the less credible your criticism is.\nBut I am glad you finally admit that this is pointing to some very intriguing possibilities. If all the DNA changes occurred in a time too short for the various mechanisms currently proposed, as increasingly appears to be the case, then there must be some other mechanism at work. And isn’t that much more interesting to consider than simply trying to find a way to defend an outmoded and erroneous hypothesis?﻿\nSmock Man:\nIt is about observed vs theoretical. Torin, Vox already agreed, as do I, that your theoretical case is possible. What Vox is saying is that if every time we observe the rate of change, and it contradicts the theory, we should begin to be skeptical. The observations we see dont make the theoretical case impossible. But you need to revise your arguments if they disagree with observation. And we are seeing that, which is a good thing.﻿\nTorin McCabe:\nAre you one of the “dread ilk” the fabled smart people who follow Vox?  So far I am less than impressed with most of those I have talked with﻿\nSmock Man:\nNo, I am not. I didn’t read vox until 2015.﻿\nThomas Saint:\nIt does not have to be uniform. But the existence of continuous change itself starts to come into question if it is absent in recorded instances. It’s a matter of probability. The longer the period extant of no observable genetic changes, either addition or subtraction, the higher the average rate of change must be within the unmeasured time-frame. Evolution is starting to look like a theory that ignores probability, when the whole theory is predicated on probability.\nEvolution seems a nonsense if it magically doesn’t apply to a 450 year period during which populations have exploded and environments have changed to unprecedented scale. Evolution is based on ‘change’ as well as ‘time’. Remove change, and time actually becomes irrelevant. 450 years is still a large number of human generations. There must be evidence of replacement of genetic base-pairs. Vox has established a feasible number.\nEvolutionists basically have to now argue that environmental change basically has to be apocalyptic to get a single replacement of a gene pair, or that humans and in fact all species have our final form. Is that what evolutionists are arguing? This theory is really starting to ridiculous isn’t it.﻿\nTorin McCabe:\nYes it is a matter of probability.  Can you do some math for me: what percentage is 450 of 12 million years?  The “magic”, “unprecedented”, “apocalyptic”, and “ridiculous” slurs are not arguments.  450 years is a good start but based on a real understanding of probability much more data is needed to explain 12 million years.  There is no need for argument, get some good coverage and the answer is there.  Stop here dude, you are making a fool of yourself﻿\nVox:\nNo, he’s not. But you are not merely making a fool of yourself, you are being obnoxious and are very close to getting banned. First, your appeal to big numbers biologists don’t understand is irrelevant. Second, according to the current understanding of the theory, the 450 years should be seeing a higher-than-average rate of fixated mutations, not a lower-than-average rate. Third, the relevant number is 9 million years, not 12 million. And fourth, the sample years being 0.00005 of the total makes them five times more statistically relevant than the 0.00001 samples that are used to correctly predict U.S. presidential elections.﻿\nIsn’t it informative how rhetorical, nasty, and completely unscientific they get the more you press them on the actual facts and figures that are necessarily involved. At this point, we can’t even reasonably call evolution by natural selection a “theory” anymore, as it is more accurately described as a “low-probability hypothesis” that will almost certainly be entirely falsified within our lifetimes.\nUPDATE:\nAfter Torin McCabe demanded “a retraction and an apology” I banned him from the channel. He apparently believes as long as you say “if”, then it’s fine to say anything you want when you describe someone else’s actions. It is not and that is why he is not welcome to take part in the Darkstream discourse anymore.",
  "tags": [
    "Darkstream"
  ],
  "categories": [],
  "sitemap_lastmod": "2019-02-16T19:02:37+00:00"
}