{
  "url": "https://voxday.net/2019/02/13/italy-may-be-out-first/",
  "scraped_at": "2025-12-20T05:29:45.550531",
  "title": "Italy may be out first",
  "date_display": "February 13, 2019",
  "date_iso": "2019-02-13T13:20:14+00:00",
  "date_from_url": "2019-02-13",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>The EU <a href=\"https://www.rt.com/news/451365-conte-verhofstadt-puppet-eu/\">is rapidly splintering </a>even before Brexit has taken place:</p><blockquote><p>Italian PM Giuseppe Conte has hit back at claims made by a chief EU lawmaker that he is a “puppet” of his country’s coalition party leaders, after declaring the bloc had “lost contact” with its people. The EU Parliament witnessed ill-tempered exchanges between Conte, who was making his debut speech, and leading MEPs. Guy Verhofstadt addressed the PM, saying that he regrets Italy has gone from being a big defender of Europe “to the back of the line.”</p><p>Bemoaning what he sees as the “political degeneration of Italy,” Verhofstadt accused Conte of being a “puppet” of the Five Star Movement’s Luigi Di Maio and the Northern League’s Matteo Salvini. He also claimed that Italy, at times, “behaves in an anti-European way, openly spiteful against other member states.”</p><p>Matteo Salvini<br>Che alcuni burocrati europei, complici del disastro di questi anni, si permettano di insultare presidente del consiglio, governo e Popolo italiano è davvero VERGOGNOSO. Preparate gli scatoloni, il 26 maggio i cittadini vi manderanno a casa.</br></p><p>It comes after a diplomatic row between France and Italy. Last week, France recalled its ambassador from Rome after a meeting was held between Italy’s deputy prime minister and leaders of the French Yellow Vest protester movement, who have been calling for French President Emmanuel Macron’s resignation.</p></blockquote><p>Translation: <i>That some EU bureaucrats, who are complicit in the disaster of recent years, are permitted to insult the President of the parliament, the government, and the people of Italy is truly SHAMEFUL. Pack your bags, because on the 26th of May (the EU parliamentary elections) the citizens will send you home. </i></p><p>Meanwhile, Treasonous May is trying to arrange to prevent a No-Deal Brexit, even though that is the best possible outcome for the British people.</p></div>",
  "content_text": "The EU\nis rapidly splintering\neven before Brexit has taken place:\nItalian PM Giuseppe Conte has hit back at claims made by a chief EU lawmaker that he is a “puppet” of his country’s coalition party leaders, after declaring the bloc had “lost contact” with its people. The EU Parliament witnessed ill-tempered exchanges between Conte, who was making his debut speech, and leading MEPs. Guy Verhofstadt addressed the PM, saying that he regrets Italy has gone from being a big defender of Europe “to the back of the line.”\nBemoaning what he sees as the “political degeneration of Italy,” Verhofstadt accused Conte of being a “puppet” of the Five Star Movement’s Luigi Di Maio and the Northern League’s Matteo Salvini. He also claimed that Italy, at times, “behaves in an anti-European way, openly spiteful against other member states.”\nMatteo Salvini\nChe alcuni burocrati europei, complici del disastro di questi anni, si permettano di insultare presidente del consiglio, governo e Popolo italiano è davvero VERGOGNOSO. Preparate gli scatoloni, il 26 maggio i cittadini vi manderanno a casa.\nIt comes after a diplomatic row between France and Italy. Last week, France recalled its ambassador from Rome after a meeting was held between Italy’s deputy prime minister and leaders of the French Yellow Vest protester movement, who have been calling for French President Emmanuel Macron’s resignation.\nTranslation:\nThat some EU bureaucrats, who are complicit in the disaster of recent years, are permitted to insult the President of the parliament, the government, and the people of Italy is truly SHAMEFUL. Pack your bags, because on the 26th of May (the EU parliamentary elections) the citizens will send you home.\nMeanwhile, Treasonous May is trying to arrange to prevent a No-Deal Brexit, even though that is the best possible outcome for the British people.",
  "tags": [
    "politics"
  ],
  "categories": [],
  "sitemap_lastmod": "2019-02-13T13:20:14+00:00"
}