{
  "url": "https://voxday.net/2019/02/10/joe-cant-let-it-go/",
  "scraped_at": "2025-12-20T05:29:23.687009",
  "title": "Joe can’t let it go",
  "date_display": "February 10, 2019",
  "date_iso": "2019-02-10T18:00:06+00:00",
  "date_from_url": "2019-02-10",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>Apparently my educated observation that gym bunny Joe Rogan knows nothing about fighting has really gotten under his inked skin.</p><blockquote><p><b>Doom Bunny: </b>Vox Day, a human devil, devoted to the art of subtle distortions in service of Lucifer, is going to be in charge of a Wikipedia replacement. Well, that sounds about right for this fallen world, which prioritizes the destruction of biblical Christians.</p><p>Of course, given that most people don’t want to be bothered seeing Day for what it obviously is, and support it in its Satanism, then I guess God the Father will start cutting at some point. You were all warned. Do remember that through your screaming and crying.</p><p><b>Owen Benjamin: </b>Doom Bunny we know it’s you Rogan. Relax.</p></blockquote><p>Some people have been after me to go on Rogan’s show, but considering that he isn’t even man enough to call out pencilnecks like Jordan Peterson and Jack-o’-Twitter when he has them in the studio, I don’t see what the point of that could possibly be. Besides, he’s media and I don’t talk to the media.</p><p>And given the shameless retreats into rhetoric on the part of my most recent debate opponents, I see no reason to engage in any more non-written debates either.</p></div>",
  "content_text": "Apparently my educated observation that gym bunny Joe Rogan knows nothing about fighting has really gotten under his inked skin.\nDoom Bunny:\nVox Day, a human devil, devoted to the art of subtle distortions in service of Lucifer, is going to be in charge of a Wikipedia replacement. Well, that sounds about right for this fallen world, which prioritizes the destruction of biblical Christians.\nOf course, given that most people don’t want to be bothered seeing Day for what it obviously is, and support it in its Satanism, then I guess God the Father will start cutting at some point. You were all warned. Do remember that through your screaming and crying.\nOwen Benjamin:\nDoom Bunny we know it’s you Rogan. Relax.\nSome people have been after me to go on Rogan’s show, but considering that he isn’t even man enough to call out pencilnecks like Jordan Peterson and Jack-o’-Twitter when he has them in the studio, I don’t see what the point of that could possibly be. Besides, he’s media and I don’t talk to the media.\nAnd given the shameless retreats into rhetoric on the part of my most recent debate opponents, I see no reason to engage in any more non-written debates either.",
  "tags": [
    "rhetoric"
  ],
  "categories": [],
  "sitemap_lastmod": "2019-02-10T18:00:06+00:00"
}