{
  "url": "https://voxday.net/2019/02/07/maximal-mutations/",
  "scraped_at": "2026-01-08T19:30:04.175001",
  "title": "Maximal mutations",
  "date_display": "February 7, 2019",
  "date_iso": "2019-02-07T14:26:14+00:00",
  "date_from_url": "2019-02-07",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>As I promised last night, here are the numbers I utilized <a href=\"https://youtu.be/Aaqec_0FPqA\">in last night’s debate</a> on the theory of evolution by natural selection with biologist JF Gariepy:</p><p><b><u>BACTERIA</u></b><br> Years: 3,800,000,000<br> Years per generation: 0.000071347 (37.5 mins per generation)<br> Generations per fixed mutation: 1600<br> Years per fixed mutation: 0.114<br> Maximum fixed mutations: 33,288,000,916</br></br></br></br></br></p><p>Source: Sequencing of 19 whole genomes detected 25 mutations that were fixed in the 40,000 generations of the experiment.<br> <i>NATURE</i>, 2009</br></p><p>NOTE: These 25 mutations were fixed in parallel. The 1600 generations per fixed mutation represent an <i>average</i>. So, JF’s appeal to massive parallel propagation is already accounted for, at least with regards to observed fixation in bacteria.</p><p><b><u>MAMMALS</u></b><br> Years: 200,000,000<br> Years per generation: 4.3<br> Generations per fixed mutation: 1600<br> Years per fixed mutation: 6880<br> Maximum fixed mutations: 29,070</br></br></br></br></br></p><p>NOTE: the bottom number represents the maximum number of fixed mutations from <i>Morganucodontid </i>to <i>Homo sapiens sapiens</i>.</p><p><b><u>CHLCA</u></b><br> Years: 9,000,000<br> Years per generation: 20<br> Generations per fixed mutation: 1600 <em>(Note: 8170 generations fastest Y-chromosomal lineage observed and extrapolated.)</em><br> Years per fixed mutation: 32000<br> Maximum fixed mutations: 125</br></br></br></br></br></p><p>NOTE: the 9 million represents the latest average estimate for the Chimpanzee-Human Last Common Ancestor, which estimate has ranged from as little as 4 million years on the basis of the molecular clock to 25 million years.</p><p>Now, the primary problem with JF’s appeal to parallel gene propagation is that it requires a minimum of 15,000,000 mutations to become fixed in the human population, and another 15,000,000 mutations to become fixed in the chimpanzee population, and to do so in an amount of time that permits 125 fixed mutations in series.</p><p>In other words, there must be 120,000 genes simultaneously fixing throughout the entire population in parallel at all times, and the same process has to happen TWICE. This does not strike me as credible, even if we don’t bother questioning JF’s claim that the observed genetic differences between human and chimpanzee lie on a spectrum and that not all humans will possess the 15 million mutations that separate <i>Homo sapiens sapiens</i> from <i>Pan troglodytes</i> and that not all chimpanzees possess the additional 15 million mutations that separate <i>Pan troglodytes </i>from <i>Homo sapiens sapiens</i>.</p><p>Or, to put it more simply, there have been 450,000 chimp and human generations since the CHLCA. Based on the number of mutations observed fixing <u>in parallel</u> in the <i>Nature </i>study, that would permit 562 total fixed mutations in that time frame. Which is only 29,999,438 short of the approximate number observed.</p><p>I understand that some people are disappointed that I did not drive these points home during the debate, or that I did not answer JF’s rhetoric with any rhetorical killshots of my own. But JF is not, and has never been, my target. I’m hunting much bigger game. That being said, I will analyze his program and make use of it at some point in the not-too-distant future.</p></div>",
  "content_text": "As I promised last night, here are the numbers I utilized\nin last night’s debate\non the theory of evolution by natural selection with biologist JF Gariepy:\nBACTERIA\nYears: 3,800,000,000\nYears per generation: 0.000071347 (37.5 mins per generation)\nGenerations per fixed mutation: 1600\nYears per fixed mutation: 0.114\nMaximum fixed mutations: 33,288,000,916\nSource: Sequencing of 19 whole genomes detected 25 mutations that were fixed in the 40,000 generations of the experiment.\nNATURE\n, 2009\nNOTE: These 25 mutations were fixed in parallel. The 1600 generations per fixed mutation represent an\naverage\n. So, JF’s appeal to massive parallel propagation is already accounted for, at least with regards to observed fixation in bacteria.\nMAMMALS\nYears: 200,000,000\nYears per generation: 4.3\nGenerations per fixed mutation: 1600\nYears per fixed mutation: 6880\nMaximum fixed mutations: 29,070\nNOTE: the bottom number represents the maximum number of fixed mutations from\nMorganucodontid\nto\nHomo sapiens sapiens\n.\nCHLCA\nYears: 9,000,000\nYears per generation: 20\nGenerations per fixed mutation: 1600\n(Note: 8170 generations fastest Y-chromosomal lineage observed and extrapolated.)\nYears per fixed mutation: 32000\nMaximum fixed mutations: 125\nNOTE: the 9 million represents the latest average estimate for the Chimpanzee-Human Last Common Ancestor, which estimate has ranged from as little as 4 million years on the basis of the molecular clock to 25 million years.\nNow, the primary problem with JF’s appeal to parallel gene propagation is that it requires a minimum of 15,000,000 mutations to become fixed in the human population, and another 15,000,000 mutations to become fixed in the chimpanzee population, and to do so in an amount of time that permits 125 fixed mutations in series.\nIn other words, there must be 120,000 genes simultaneously fixing throughout the entire population in parallel at all times, and the same process has to happen TWICE. This does not strike me as credible, even if we don’t bother questioning JF’s claim that the observed genetic differences between human and chimpanzee lie on a spectrum and that not all humans will possess the 15 million mutations that separate\nHomo sapiens sapiens\nfrom\nPan troglodytes\nand that not all chimpanzees possess the additional 15 million mutations that separate\nPan troglodytes\nfrom\nHomo sapiens sapiens\n.\nOr, to put it more simply, there have been 450,000 chimp and human generations since the CHLCA. Based on the number of mutations observed fixing\nin parallel\nin the\nNature\nstudy, that would permit 562 total fixed mutations in that time frame. Which is only 29,999,438 short of the approximate number observed.\nI understand that some people are disappointed that I did not drive these points home during the debate, or that I did not answer JF’s rhetoric with any rhetorical killshots of my own. But JF is not, and has never been, my target. I’m hunting much bigger game. That being said, I will analyze his program and make use of it at some point in the not-too-distant future.",
  "tags": [
    "evolution"
  ],
  "categories": [],
  "sitemap_lastmod": "2024-11-19T11:00:01+00:00"
}