{
  "url": "https://voxday.net/2019/02/16/pretty-good-read/",
  "scraped_at": "2025-12-20T05:30:15.433199",
  "title": "“Pretty good read”",
  "date_display": "February 16, 2019",
  "date_iso": "2019-02-16T13:00:01+00:00",
  "date_from_url": "2019-02-16",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>Humanity’s Greatest Thinker addresses <i>Jordanetics</i>, or as he calls it, “Dianetics” and <a href=\"https://www.youtube.com/watch?v=t_k-3oLr6PE&amp;feature=youtu.be\">describes it as a “pretty good read”</a>.</p><blockquote><p><b>Interviewer: </b>Well, it’s hilarious you you kind of get, your celebrity gets co-opted from people on all sorts of parts of the political spectrum, and extremes of the political spectrum, doesn’t it.</p><p><b>Jordan Peterson: </b>Well, I think there’s some of that. I don’t know it’s co-opted too much on the radical left, let’s say, although I certainly face the majority of my opposition from the radical left but the radical right types are not very fond of me either. There was a new book written called Dianetics by a rather reprehensible individual named Vox Day and if you want to find out what the ethno nationalists think about me that’s a pretty good read. I wouldn’t call it precisely complementary.</p></blockquote><p><b><i><a href=\"https://arkhavencomics.com/product/jordanetics-audiobook/\">Jordanetics </a></i></b>is a pretty good read and/or listen. It’s also a pretty thorough demonstration that Jordan Peterson is considerably worse than reprehensible. He’s downright evil and he is preaching an extremely evil and destructive philosophy.</p></div>",
  "content_text": "Humanity’s Greatest Thinker addresses\nJordanetics\n, or as he calls it, “Dianetics” and\ndescribes it as a “pretty good read”\n.\nInterviewer:\nWell, it’s hilarious you you kind of get, your celebrity gets co-opted from people on all sorts of parts of the political spectrum, and extremes of the political spectrum, doesn’t it.\nJordan Peterson:\nWell, I think there’s some of that. I don’t know it’s co-opted too much on the radical left, let’s say, although I certainly face the majority of my opposition from the radical left but the radical right types are not very fond of me either. There was a new book written called Dianetics by a rather reprehensible individual named Vox Day and if you want to find out what the ethno nationalists think about me that’s a pretty good read. I wouldn’t call it precisely complementary.\nJordanetics\nis a pretty good read and/or listen. It’s also a pretty thorough demonstration that Jordan Peterson is considerably worse than reprehensible. He’s downright evil and he is preaching an extremely evil and destructive philosophy.",
  "tags": [
    "books"
  ],
  "categories": [],
  "sitemap_lastmod": "2019-02-16T13:00:01+00:00"
}