{
  "url": "https://voxday.net/2019/02/01/someone-was-talking-to-you/",
  "scraped_at": "2025-12-20T05:28:08.133254",
  "title": "Someone was talking to you",
  "date_display": "February 1, 2019",
  "date_iso": "2019-02-01T12:53:03+00:00",
  "date_from_url": "2019-02-01",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>But it wasn’t God. I’m not even remotely surprised by Jordan Peterson’s account of one of his spiritual experiences. The Fencing Bear shares <a href=\"https://fencingbearatprayer.blogspot.com/2019/01/the-sworn-book-of-professor-peterson.html\">an interview with the Manufactured Man</a>:</p><blockquote><p><b>Peterson:</b> I can tell you one of the experiences that I had… When I was…. This would be in 1985 or thereabouts, when I was busily working on the first draft of my book <i>Maps of Meaning</i>, where I was outlining this idea that the path of the Hero who voluntarily confronts uncertainty and stands on the border between Chaos and Order is the appropriate target for human development. It’s an alternative to the chaos of nihilism and the totalitarianism of rigid belief. So, and that’s the bearing of responsibility for Being. I was working all of that out. It’s actually an answer to the postmodern conundrum as far as I can tell as well. But anyways, at the same time I was making this sculpture, which is about a foot thick. It’s made out of layers of what’s called  foam core, which is styrofoam pressed between two pieces of paper that’s about a quarter of an inch thick and so often used for backing on prints and so on if you get them framed. I made this piece that I called “The Meaning of Music,” and it’s a mandala, so it’s a circle inscribed inside of a square, although I tried to make it multidimensional in a complex way that I can’t really describe at the moment. But what I was trying to do—and I broke it into pieces—what I was trying to do was to produce a visual object that flickered and changed when you looked at it because it was too complex to process visually. You know, like a Necker cube? That’s one of those cubes that reverses when you look at it.</p><p><b>Trussell: </b>Yes.</p><p><b>Peterson: </b>Well, this is like a Necker cube on steroids. Because music, of course, it stays the same across time, but also transforms across time. And it’s full of layered patterns, you know. And the patterns interact harmoniously with one another… And I was fascinated by music because it gives people the direct intimation of meaning. Even if they’re nihilistic punk rockers, they still can’t criticize the experience of meaning that they engage in when they’re listening to their favorite band. It helps them transcend the nihilism of their irrationality…. And you can’t argue with it. It’s like arguing with dance…. It’s beyond argument. And so I was making this sculpture, and I spent like four months on it. I was thinking about it a lot. And I got it mostly assembled, and then I was in my living room in Montreal, and I was listening to Mozart’s Fourth Symphony, the Jupiter Symphony, and I was really listening to it, and it’s one of these complexly, multi-leveled, patterned pieces of auditory sculpture that I believe represents Being. Because what Being is is multiple levels of patterned transformation interacting simultaneously, and music is a representation of that, which is why I think we find it meaningful. Anyways, I was listening intently to this symphony and at the same time I was concentrating on the sculpture that I had made, and all of a sudden—and everything I am about to say is a metaphor because there’s no way of encapsulating it properly in words—it was as if the heavens opened up above me. I mean, I was still in my living room, but the experience is best represented by one of those early Renaissance paintings where you see God or Christ up in the sky with an opening in the sky against the clouds and against the sun so…it was like that, even though I didn’t really see that, it felt like that, and there were some visuals that were associated with it. And then I felt something descend upon me that had a personal nature. You know, something like you were describing as a… higher consciousness that was actually a being of a sort, and it filled me from the inside out. And…it was enrapturing, let’s say. And it was an incredible feeling…. It was a divine feeling, I suppose is the right way of thinking about it. It was certainly a religious experience…. And it transformed me. And it turned me into something far more than I normally was. And maybe you can think about that as an intimation of what you could become if you worked on it for the rest of your life, which is sometimes what I think hallucinogens provide people with—an image of who they could be if they shed all of their dead wood.</p><p><b>Trussell: </b>Right.</p><p><b>Peterson: </b>Anyways, it was as if an offer was being made to me that I could be like that from now on permanently. And I thought, well, I don’t know how to do that. I couldn’t walk down the street in this condition, in this elevated condition. I wouldn’t belong in the world anymore. I wouldn’t know how to function. I don’t know how I could do it… So, this experience, this thing, say, that was communicating with me…accepted that as an answer, although I would say, with some sorrow, and then it receded. And then I went and talked to my wife, and I told her what had happened, and I was shaking, like, a lot…. Like, a tremendous amount. And my pupils were completely dilated.</p></blockquote><p>An offer was almost certainly being made. And Peterson isn’t telling the whole truth about it. Whether or not he accepted the offer that was made to him then, he certainly accepted it, or one very much like it, later.</p></div>",
  "content_text": "But it wasn’t God. I’m not even remotely surprised by Jordan Peterson’s account of one of his spiritual experiences. The Fencing Bear shares\nan interview with the Manufactured Man\n:\nPeterson:\nI can tell you one of the experiences that I had… When I was…. This would be in 1985 or thereabouts, when I was busily working on the first draft of my book\nMaps of Meaning\n, where I was outlining this idea that the path of the Hero who voluntarily confronts uncertainty and stands on the border between Chaos and Order is the appropriate target for human development. It’s an alternative to the chaos of nihilism and the totalitarianism of rigid belief. So, and that’s the bearing of responsibility for Being. I was working all of that out. It’s actually an answer to the postmodern conundrum as far as I can tell as well. But anyways, at the same time I was making this sculpture, which is about a foot thick. It’s made out of layers of what’s called  foam core, which is styrofoam pressed between two pieces of paper that’s about a quarter of an inch thick and so often used for backing on prints and so on if you get them framed. I made this piece that I called “The Meaning of Music,” and it’s a mandala, so it’s a circle inscribed inside of a square, although I tried to make it multidimensional in a complex way that I can’t really describe at the moment. But what I was trying to do—and I broke it into pieces—what I was trying to do was to produce a visual object that flickered and changed when you looked at it because it was too complex to process visually. You know, like a Necker cube? That’s one of those cubes that reverses when you look at it.\nTrussell:\nYes.\nPeterson:\nWell, this is like a Necker cube on steroids. Because music, of course, it stays the same across time, but also transforms across time. And it’s full of layered patterns, you know. And the patterns interact harmoniously with one another… And I was fascinated by music because it gives people the direct intimation of meaning. Even if they’re nihilistic punk rockers, they still can’t criticize the experience of meaning that they engage in when they’re listening to their favorite band. It helps them transcend the nihilism of their irrationality…. And you can’t argue with it. It’s like arguing with dance…. It’s beyond argument. And so I was making this sculpture, and I spent like four months on it. I was thinking about it a lot. And I got it mostly assembled, and then I was in my living room in Montreal, and I was listening to Mozart’s Fourth Symphony, the Jupiter Symphony, and I was really listening to it, and it’s one of these complexly, multi-leveled, patterned pieces of auditory sculpture that I believe represents Being. Because what Being is is multiple levels of patterned transformation interacting simultaneously, and music is a representation of that, which is why I think we find it meaningful. Anyways, I was listening intently to this symphony and at the same time I was concentrating on the sculpture that I had made, and all of a sudden—and everything I am about to say is a metaphor because there’s no way of encapsulating it properly in words—it was as if the heavens opened up above me. I mean, I was still in my living room, but the experience is best represented by one of those early Renaissance paintings where you see God or Christ up in the sky with an opening in the sky against the clouds and against the sun so…it was like that, even though I didn’t really see that, it felt like that, and there were some visuals that were associated with it. And then I felt something descend upon me that had a personal nature. You know, something like you were describing as a… higher consciousness that was actually a being of a sort, and it filled me from the inside out. And…it was enrapturing, let’s say. And it was an incredible feeling…. It was a divine feeling, I suppose is the right way of thinking about it. It was certainly a religious experience…. And it transformed me. And it turned me into something far more than I normally was. And maybe you can think about that as an intimation of what you could become if you worked on it for the rest of your life, which is sometimes what I think hallucinogens provide people with—an image of who they could be if they shed all of their dead wood.\nTrussell:\nRight.\nPeterson:\nAnyways, it was as if an offer was being made to me that I could be like that from now on permanently. And I thought, well, I don’t know how to do that. I couldn’t walk down the street in this condition, in this elevated condition. I wouldn’t belong in the world anymore. I wouldn’t know how to function. I don’t know how I could do it… So, this experience, this thing, say, that was communicating with me…accepted that as an answer, although I would say, with some sorrow, and then it receded. And then I went and talked to my wife, and I told her what had happened, and I was shaking, like, a lot…. Like, a tremendous amount. And my pupils were completely dilated.\nAn offer was almost certainly being made. And Peterson isn’t telling the whole truth about it. Whether or not he accepted the offer that was made to him then, he certainly accepted it, or one very much like it, later.",
  "tags": [
    "Jordanetics"
  ],
  "categories": [],
  "sitemap_lastmod": "2019-02-01T12:53:03+00:00"
}