{
  "url": "https://voxday.net/2019/02/08/the-retreat-begins/",
  "scraped_at": "2025-12-20T05:29:07.614477",
  "title": "The retreat begins",
  "date_display": "February 8, 2019",
  "date_iso": "2019-02-08T14:20:25+00:00",
  "date_from_url": "2019-02-08",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>Torin was trying to cover JF’s intellectual surrender and his retreat from math, science, and logic in our debate earlier this week:</p><p><i>You seem quick to dismiss JF but what he said made perfect sense to me. If you want to create your own model OK. But if he is not comfortable with your assumptions also fine. I am confused a bit by the attacks but I guess this is just play. Yet the attribution of “fleeing” and “don’t call it science” are things I would not say unless I was damn sure. And since I have expertise in some fields I know how hard it is to be damn sure</i></p><p>Sir Hamster was having none of it:</p><p><i>“seem” – I watched the debate, and I saw JF making objections to the model that were already accounted for in the model. I knew it the moment he said it in the debate, and Vox confirmed it in tonight’s Darkstream. </i><br><i><br/></i><i>“comfortable” – JF’s feelings as a biologist are not very interesting or relevant when we can demonstrate his objections are irrelevant.  </i><i>Having watched the debate, JF fled the moment he retreated to rhetorical plays, like when he claimed he was crushing Vox’s dreams. </i><br><i><br/></i><i>Vox was stepping through the construction of a model using generous assumptions favorable to TENS. That’s not a dream, nor was it crushed. TENS advocates should have built their own model. They haven’t, nor do they want to. At this point, the reasonable conclusion is that they don’t want to deal with the questions such a model would bring. </i><br><i><br/></i><i>If you want to call what I said, “attacks”, you should recognize that JF resorted to rhetorical attacks in the debate. It was intellectual surrender. </i></br></br></br></p><p>Torin tried to maintain a fighting withdrawal:</p><p><i>I saw two different models because of a disagreement on assumptions. Sure there was some rhetoric. But a lot of rhetoric is going on here. This is why I stopped playing team sports. Have a good one.</i><br><i><br/></i>But Owen Benjamin <a href=\"https://www.youtube.com/watch?v=Z7PZHUkFXbI\">had the last word</a> in his analogical description of the debate:<br><i><br/></i><i><b>Vox: </b>We can measure how tall the trees are. And we know how old they are. So, what is the annual rate of growth?</i><br><b><i><br/></i></b><i><b>JFG: </b>No, no, it is time for me to crush your dreams. Can you not see all zee seeds zat are scattered around zee forest? Zere are so many of zem! Meellions and beellions! Now look at zis picture, do you not see how zee acorns, zey have zee different sizes? Zoot alors! Croissant!</i><br><i><br/></i>The amusing thing is some of JF’s fans <a href=\"https://www.youtube.com/watch?v=RbzHN2JDzYQ&amp;lc=UgzCOnjh4KrPcUzIuQZ4AaABAg.8r47EXXD4G-8r4Kzu-6UHS\">are demanding that I debate him again</a>, not 12 hours after insisting that he crushed me.</br></br></br></br></p><blockquote class=\"tr_bq\"><p>The reason you don’t want a second debate is clearly because you are a terrible loser and dishonest intellectual. You really think that biologists haven’t gone over these theories of yours before? If you are so certain that all of this is satanic gamma talk perpetuated by 110 IQ mid wits then why not destroy JF and the rest of us in a second debate. Because you are afraid of losing even more face, nobody is fooled by your stammering retort in this video. Man up and put your ideas to the test or admit defeat!﻿</p></blockquote><p>Of course I’m not going to debate him again. As I observed in <a href=\"https://youtu.be/RbzHN2JDzYQ\">the Darkstream last night</a>, there is no point, since he’s either too dumb to understand the issue or too dishonest to address it directly. I gave him the chance to refute my case, he whiffed more completely than his followers are even able to understand, and I was able to learn what I needed to learn. Let’s not forget, this was the second time I’ve spoken to him about something that wasn’t his book, and the second time he has completely failed to understand a perfectly straightforward argument.</p><p>I’m beginning to wonder if Downe’s Syndrome might be sexually transmitted.</p></div>",
  "content_text": "Torin was trying to cover JF’s intellectual surrender and his retreat from math, science, and logic in our debate earlier this week:\nYou seem quick to dismiss JF but what he said made perfect sense to me. If you want to create your own model OK. But if he is not comfortable with your assumptions also fine. I am confused a bit by the attacks but I guess this is just play. Yet the attribution of “fleeing” and “don’t call it science” are things I would not say unless I was damn sure. And since I have expertise in some fields I know how hard it is to be damn sure\nSir Hamster was having none of it:\n“seem” – I watched the debate, and I saw JF making objections to the model that were already accounted for in the model. I knew it the moment he said it in the debate, and Vox confirmed it in tonight’s Darkstream.\n“comfortable” – JF’s feelings as a biologist are not very interesting or relevant when we can demonstrate his objections are irrelevant.\nHaving watched the debate, JF fled the moment he retreated to rhetorical plays, like when he claimed he was crushing Vox’s dreams.\nVox was stepping through the construction of a model using generous assumptions favorable to TENS. That’s not a dream, nor was it crushed. TENS advocates should have built their own model. They haven’t, nor do they want to. At this point, the reasonable conclusion is that they don’t want to deal with the questions such a model would bring.\nIf you want to call what I said, “attacks”, you should recognize that JF resorted to rhetorical attacks in the debate. It was intellectual surrender.\nTorin tried to maintain a fighting withdrawal:\nI saw two different models because of a disagreement on assumptions. Sure there was some rhetoric. But a lot of rhetoric is going on here. This is why I stopped playing team sports. Have a good one.\nBut Owen Benjamin\nhad the last word\nin his analogical description of the debate:\nVox:\nWe can measure how tall the trees are. And we know how old they are. So, what is the annual rate of growth?\nJFG:\nNo, no, it is time for me to crush your dreams. Can you not see all zee seeds zat are scattered around zee forest? Zere are so many of zem! Meellions and beellions! Now look at zis picture, do you not see how zee acorns, zey have zee different sizes? Zoot alors! Croissant!\nThe amusing thing is some of JF’s fans\nare demanding that I debate him again\n, not 12 hours after insisting that he crushed me.\nThe reason you don’t want a second debate is clearly because you are a terrible loser and dishonest intellectual. You really think that biologists haven’t gone over these theories of yours before? If you are so certain that all of this is satanic gamma talk perpetuated by 110 IQ mid wits then why not destroy JF and the rest of us in a second debate. Because you are afraid of losing even more face, nobody is fooled by your stammering retort in this video. Man up and put your ideas to the test or admit defeat!﻿\nOf course I’m not going to debate him again. As I observed in\nthe Darkstream last night\n, there is no point, since he’s either too dumb to understand the issue or too dishonest to address it directly. I gave him the chance to refute my case, he whiffed more completely than his followers are even able to understand, and I was able to learn what I needed to learn. Let’s not forget, this was the second time I’ve spoken to him about something that wasn’t his book, and the second time he has completely failed to understand a perfectly straightforward argument.\nI’m beginning to wonder if Downe’s Syndrome might be sexually transmitted.",
  "tags": [
    "evolution"
  ],
  "categories": [],
  "sitemap_lastmod": "2019-02-08T14:20:25+00:00"
}