{
  "url": "https://voxday.net/2019/02/26/the-end-of-atheism/",
  "scraped_at": "2025-12-20T05:31:41.487382",
  "title": "The end of atheism",
  "date_display": "February 26, 2019",
  "date_iso": "2019-02-26T12:42:37+00:00",
  "date_from_url": "2019-02-26",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>The Z-Man explains <a href=\"http://thezman.com/wordpress/?p=16520\">why atheism is on the decline</a> in parallel with the retreat of Christianity from the public space:</p><blockquote><p>The central defect of atheism, old and new, is it is an entirely negative western identity and entirely dependent on Christianity. Specifically, it requires people of some status to defend Christianity and the Christian belief in the super natural. Atheism has always been the oxpecker of mass movements. Everything about it relies on its host both tolerating it and thriving on its own. It’s why atheism has had its spasms of success when Christianity in America has had a revival, as in the 80’s and the 2000’s.</p><p>Atheists will deny this, of course. They will argue, as Dennett often does, that the steep decline of Christianity is proof their arguments were superior. The reason they no longer talk about their thing is they won and their enemy is dead. The fact that there are plenty of Muslims and crackpot feminist airheads around spouting magical oogily-boogily never seems to get their attention for some reason. The only guy to venture into this area was Dawkins, but the Prog quickly reminded him who pays his bills.</p><p>That’s always been the tell with atheism. Belief in something as insane as male privilege or implicit whiteness should get their attention. After all, these are not just beliefs in the supernatural, they are primitive beliefs in the supernatural. Men of the classical period had more plausible and complex beliefs than people like Amy Harmon. She is a click away from demanding human sacrifice. Yet, the new atheists were never much interest in those magical beliefs. They were too busy hounding the last Christians.</p><p>That’s another tell. Atheism has always been a popular pose on the Left, because it was a useful signal. The bad whites loved their boom sticks and sky gods. The good whites rejected all those crazy beliefs. It’s why atheists tended to focus on the mainstream of Christianity, like Catholics and mainline Protestant churches. Mormons were always an easy target. They avoided the Jews and black Baptists. Sure, once in while a zinger against the tribe would be tossed in, but the enemy was always white Christians.</p><p>The decline on atheism is a good example of the perils of negative identity. When you define yourself as being in opposition to someone or something, you inevitably become a slave to it. Your very existence depends on it. As the main Christian churches collapse in scandal and bizarre attempts to move Left, the enemies for atheists to attack are getting more difficult to find.</p></blockquote><p>What I find interesting is how many people now understand that atheism is not what it etymologically purports to be, a lack of belief in gods, or even a lack of belief in the supernatural, but what it has observably been since the Abbe Jean Meslier posthumously published his <i>Memoir of the Thoughts and Feelings of Jean Meslier: Clear and Evident Demonstrations of the Vanity and Falsity of All the Religions of the World</i> in 1729, mere Western anti-Christianity.</p><p>That’s all very well and good. But now apply precisely the same historical observation and logic to the concepts of free speech, freedom of thought, and the Enlightenment. What you find yourself concluding may very well surprise, if not dismay, you, depending upon your allegiance to the aforementioned dogmas.</p></div>",
  "content_text": "The Z-Man explains\nwhy atheism is on the decline\nin parallel with the retreat of Christianity from the public space:\nThe central defect of atheism, old and new, is it is an entirely negative western identity and entirely dependent on Christianity. Specifically, it requires people of some status to defend Christianity and the Christian belief in the super natural. Atheism has always been the oxpecker of mass movements. Everything about it relies on its host both tolerating it and thriving on its own. It’s why atheism has had its spasms of success when Christianity in America has had a revival, as in the 80’s and the 2000’s.\nAtheists will deny this, of course. They will argue, as Dennett often does, that the steep decline of Christianity is proof their arguments were superior. The reason they no longer talk about their thing is they won and their enemy is dead. The fact that there are plenty of Muslims and crackpot feminist airheads around spouting magical oogily-boogily never seems to get their attention for some reason. The only guy to venture into this area was Dawkins, but the Prog quickly reminded him who pays his bills.\nThat’s always been the tell with atheism. Belief in something as insane as male privilege or implicit whiteness should get their attention. After all, these are not just beliefs in the supernatural, they are primitive beliefs in the supernatural. Men of the classical period had more plausible and complex beliefs than people like Amy Harmon. She is a click away from demanding human sacrifice. Yet, the new atheists were never much interest in those magical beliefs. They were too busy hounding the last Christians.\nThat’s another tell. Atheism has always been a popular pose on the Left, because it was a useful signal. The bad whites loved their boom sticks and sky gods. The good whites rejected all those crazy beliefs. It’s why atheists tended to focus on the mainstream of Christianity, like Catholics and mainline Protestant churches. Mormons were always an easy target. They avoided the Jews and black Baptists. Sure, once in while a zinger against the tribe would be tossed in, but the enemy was always white Christians.\nThe decline on atheism is a good example of the perils of negative identity. When you define yourself as being in opposition to someone or something, you inevitably become a slave to it. Your very existence depends on it. As the main Christian churches collapse in scandal and bizarre attempts to move Left, the enemies for atheists to attack are getting more difficult to find.\nWhat I find interesting is how many people now understand that atheism is not what it etymologically purports to be, a lack of belief in gods, or even a lack of belief in the supernatural, but what it has observably been since the Abbe Jean Meslier posthumously published his\nMemoir of the Thoughts and Feelings of Jean Meslier: Clear and Evident Demonstrations of the Vanity and Falsity of All the Religions of the World\nin 1729, mere Western anti-Christianity.\nThat’s all very well and good. But now apply precisely the same historical observation and logic to the concepts of free speech, freedom of thought, and the Enlightenment. What you find yourself concluding may very well surprise, if not dismay, you, depending upon your allegiance to the aforementioned dogmas.",
  "tags": [
    "Christianity"
  ],
  "categories": [],
  "sitemap_lastmod": "2019-02-26T12:42:37+00:00"
}