{
  "url": "https://voxday.net/2019/02/19/the-intrinsic-limits-on-power/",
  "scraped_at": "2025-12-20T05:30:41.093756",
  "title": "The intrinsic limits on power",
  "date_display": "February 19, 2019",
  "date_iso": "2019-02-19T13:37:17+00:00",
  "date_from_url": "2019-02-19",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>I’ve been reading the third volume of Oman’s excellent <i>A History of the Peninsular War</i>, and a particular passage on the solid reasoning that lay behind Napoleon’s self-obstructive and objectively suboptimal decision to refuse to appoint a proper unitary command to execute the invasion of Portugal and the attack on Wellington’s British army while simultaneously maintaining the Spanish occupation caused me to reflect on the limits imposed on evil by its own nature.</p><blockquote><p>As has been shown above, from his own words, he [Napoleon] was conscious that he was too far from the scene of operation, and that mere ordinary directions to his lieutenants might not be carried out with zeal. <i>‘Je donne l’ordre. L’exécutera-t-on? De si loin obéit qui veut.’</i> But if this were so, it was surely necessary either that he should go to Spain in person, or else—the more obvious alternative—that he should appoint a real Commander-in-Chief in the Peninsula, who should have authority to order all the other marshals and generals to obey his directions, without malingering or appeals to Paris. Napoleon had deliberately created a divided authority beyond the Pyrenees when he set up his military governments, and instructed Suchet, Kellermann, and the other governors to report directly to himself, and to pay no attention to commands emanating from Madrid. King Joseph, as a central source of orders, had been reduced to a nullity by this ill-conceived decree. Even over the troops not included in the new viceroyalties he had no practical authority. Not he and his chief of the staff, but Masséna, ought to have been entrusted with a full and autocratic power of command over all the armies of Spain, if a true unity of purpose was to be achieved.</p><p>This necessary arrangement the Emperor utterly refused to carry out: he sent rebukes to Drouet for hesitating to obey the orders of the Prince of Essling, and he jested at the absurd conduct of Ney and Junot in conducting themselves like independent generals. But these officers were in command of troops definitely allotted to the Army of Portugal. Over the other generals of Spain he refused to allow Masséna any control, and he continued to send them his own ever-tardy instructions, which had often ceased to be appropriate long before the dispatch had reached its destination. If we seek the reasons of this unwise persistence in his old methods, we find that they were two.</p><p>The first was his secret, but only half-disguised, intention to annex all the Spanish provinces north of the Ebro to France, an insane resolve which led him to keep Suchet and Macdonald in Aragon and Catalonia, as well as the governors of Navarre and Biscay, out of the control of any central authority that he might set up in Spain. The second was his jealousy of entrusting the vast army south of the Ebro, far more than 250,000 men at the moment, to any single commander. He remembered Soult’s absurd strivings after royalty in Portugal; he knew that Masséna, though the best of soldiers, was false, selfish, and ambitious; and he refused to hand over to either of them a full control over the whole of the forces in the Peninsula. It was even better, in his estimation, to leave King Joseph a shadow of power, than to take the risk of giving overmuch authority to one of the two able, but not wholly trustworthy, marshals to whom he must otherwise have entrusted it.</p></blockquote><p>Napoleon made a conscious choice to reduce the probabilities of defeating Wellington and conquering Portugal in order to reduce the risk of creating a powerful rival power on the Peninsula. He knew he couldn’t trust Soult or Masséna to remain loyal to him if either of them found themselves victorious and in command of an army capable of rivalling his own forces, so he refused to take the step that was absolutely required in order to win the war.</p><p>This is one of the fundamental weaknesses of evil, however strong it appears, however much potential force it has at its disposal. Self-interest imposes an intrinsic limit on evil’s ability to bring its power to bear, because it always has to worry about its forces fragmenting and pursuing their own goals instead of the obediently pursuing the goals set by the leadership. This, of course, is why evil puts so much effort into creating social pressures and false narratives its NPCs will blindly follow, and to ensuring that its NPCs never dare to think independently or in a critical manner.</p></div>",
  "content_text": "I’ve been reading the third volume of Oman’s excellent\nA History of the Peninsular War\n, and a particular passage on the solid reasoning that lay behind Napoleon’s self-obstructive and objectively suboptimal decision to refuse to appoint a proper unitary command to execute the invasion of Portugal and the attack on Wellington’s British army while simultaneously maintaining the Spanish occupation caused me to reflect on the limits imposed on evil by its own nature.\nAs has been shown above, from his own words, he [Napoleon] was conscious that he was too far from the scene of operation, and that mere ordinary directions to his lieutenants might not be carried out with zeal.\n‘Je donne l’ordre. L’exécutera-t-on? De si loin obéit qui veut.’\nBut if this were so, it was surely necessary either that he should go to Spain in person, or else—the more obvious alternative—that he should appoint a real Commander-in-Chief in the Peninsula, who should have authority to order all the other marshals and generals to obey his directions, without malingering or appeals to Paris. Napoleon had deliberately created a divided authority beyond the Pyrenees when he set up his military governments, and instructed Suchet, Kellermann, and the other governors to report directly to himself, and to pay no attention to commands emanating from Madrid. King Joseph, as a central source of orders, had been reduced to a nullity by this ill-conceived decree. Even over the troops not included in the new viceroyalties he had no practical authority. Not he and his chief of the staff, but Masséna, ought to have been entrusted with a full and autocratic power of command over all the armies of Spain, if a true unity of purpose was to be achieved.\nThis necessary arrangement the Emperor utterly refused to carry out: he sent rebukes to Drouet for hesitating to obey the orders of the Prince of Essling, and he jested at the absurd conduct of Ney and Junot in conducting themselves like independent generals. But these officers were in command of troops definitely allotted to the Army of Portugal. Over the other generals of Spain he refused to allow Masséna any control, and he continued to send them his own ever-tardy instructions, which had often ceased to be appropriate long before the dispatch had reached its destination. If we seek the reasons of this unwise persistence in his old methods, we find that they were two.\nThe first was his secret, but only half-disguised, intention to annex all the Spanish provinces north of the Ebro to France, an insane resolve which led him to keep Suchet and Macdonald in Aragon and Catalonia, as well as the governors of Navarre and Biscay, out of the control of any central authority that he might set up in Spain. The second was his jealousy of entrusting the vast army south of the Ebro, far more than 250,000 men at the moment, to any single commander. He remembered Soult’s absurd strivings after royalty in Portugal; he knew that Masséna, though the best of soldiers, was false, selfish, and ambitious; and he refused to hand over to either of them a full control over the whole of the forces in the Peninsula. It was even better, in his estimation, to leave King Joseph a shadow of power, than to take the risk of giving overmuch authority to one of the two able, but not wholly trustworthy, marshals to whom he must otherwise have entrusted it.\nNapoleon made a conscious choice to reduce the probabilities of defeating Wellington and conquering Portugal in order to reduce the risk of creating a powerful rival power on the Peninsula. He knew he couldn’t trust Soult or Masséna to remain loyal to him if either of them found themselves victorious and in command of an army capable of rivalling his own forces, so he refused to take the step that was absolutely required in order to win the war.\nThis is one of the fundamental weaknesses of evil, however strong it appears, however much potential force it has at its disposal. Self-interest imposes an intrinsic limit on evil’s ability to bring its power to bear, because it always has to worry about its forces fragmenting and pursuing their own goals instead of the obediently pursuing the goals set by the leadership. This, of course, is why evil puts so much effort into creating social pressures and false narratives its NPCs will blindly follow, and to ensuring that its NPCs never dare to think independently or in a critical manner.",
  "tags": [
    "war"
  ],
  "categories": [],
  "sitemap_lastmod": "2019-02-19T13:37:17+00:00"
}