{
  "url": "https://voxday.net/2019/02/04/the-next-neocon-target/",
  "scraped_at": "2025-12-20T05:28:36.646749",
  "title": "The next neocon target",
  "date_display": "February 4, 2019",
  "date_iso": "2019-02-04T14:39:55+00:00",
  "date_from_url": "2019-02-04",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>It’s an interesting confession of neocon weakness in the aftermath of the Syrian debacle that <a href=\"http://www.unz.com/tsaker/the-us-aggression-against-venezuela-as-a-diagnostic-tool/\">they are presently targeting Venezuela</a> instead of another Middle Eastern state. But, as the Saker points out, Russia is not in a position to help defend the Venezuelans as they defended the Syrians from imperial aggression:</p><blockquote class=\"tr_bq\"><p>I am getting a lot of emails suggesting that Russia might do in Venezuela what she did in Syria. Let me immediately tell you that this is not going to happen. Yes, there are a lot of Russians in Venezuela, but the “Russians are not coming”. For one thing, I will never cease to repeat that the Russian intervention in Syria was a very small one, and that even if this small force proved formidable, it was really acting primarily as a force multiplier for the Iranians, Hezbollah and the Syrian government forces. And yet, even the deployment of this very small force necessitated a huge logistics effort from Russia whose military (being a purely defensive one) is simply not structured for long-distance power projection. Syria is about 1000km from Russia. Venezuela is about 10 times (!) further. Yes, I know,a few Tu-160 visited the country twice now and there are Russian advisors in the country and the Venezuelans have a few pretty good Russian weapons systems. But here, again, this is a game of numbers. Limited numbers of Russian-made combat aircraft (fixed and rotary wing), air defense missiles or even large numbers of advanced MANPADs or assault rifles won’t do the trick against a determined US-Colombian invasion. Finally, there is no Venezuelan equivalent to Iran or Hezbollah (an outside ally and friend) which would be capable and willing to deploy real combat forces for actual, sustained combat against the invader.</p></blockquote><p>I can’t help but suspect that Trump has something up his sleeve here. Is he throwing the neocons into a tar baby, perhaps? Is there anyone, anywhere, who is buying the inept imperial rhetoric about the democratic legitimacy of an unelected foreign puppet?</p><p>And it is bizarre that the USA is posturing as if it is going to fix a third-world failed state when it is rapidly transforming into one itself. Apparently the plan is for <a href=\"https://www.moonofalabama.org/2019/01/venezuela-coup-attempt-part-of-a-larger-project-military-intervention-likely-to-fail.html#comments\">a second New American Century</a>, albeit in South America now that the Middle East plan has failed.</p></div>",
  "content_text": "It’s an interesting confession of neocon weakness in the aftermath of the Syrian debacle that\nthey are presently targeting Venezuela\ninstead of another Middle Eastern state. But, as the Saker points out, Russia is not in a position to help defend the Venezuelans as they defended the Syrians from imperial aggression:\nI am getting a lot of emails suggesting that Russia might do in Venezuela what she did in Syria. Let me immediately tell you that this is not going to happen. Yes, there are a lot of Russians in Venezuela, but the “Russians are not coming”. For one thing, I will never cease to repeat that the Russian intervention in Syria was a very small one, and that even if this small force proved formidable, it was really acting primarily as a force multiplier for the Iranians, Hezbollah and the Syrian government forces. And yet, even the deployment of this very small force necessitated a huge logistics effort from Russia whose military (being a purely defensive one) is simply not structured for long-distance power projection. Syria is about 1000km from Russia. Venezuela is about 10 times (!) further. Yes, I know,a few Tu-160 visited the country twice now and there are Russian advisors in the country and the Venezuelans have a few pretty good Russian weapons systems. But here, again, this is a game of numbers. Limited numbers of Russian-made combat aircraft (fixed and rotary wing), air defense missiles or even large numbers of advanced MANPADs or assault rifles won’t do the trick against a determined US-Colombian invasion. Finally, there is no Venezuelan equivalent to Iran or Hezbollah (an outside ally and friend) which would be capable and willing to deploy real combat forces for actual, sustained combat against the invader.\nI can’t help but suspect that Trump has something up his sleeve here. Is he throwing the neocons into a tar baby, perhaps? Is there anyone, anywhere, who is buying the inept imperial rhetoric about the democratic legitimacy of an unelected foreign puppet?\nAnd it is bizarre that the USA is posturing as if it is going to fix a third-world failed state when it is rapidly transforming into one itself. Apparently the plan is for\na second New American Century\n, albeit in South America now that the Middle East plan has failed.",
  "tags": [
    "NeoCon"
  ],
  "categories": [],
  "sitemap_lastmod": "2019-02-04T14:39:55+00:00"
}