{
  "url": "https://voxday.net/2019/02/20/there-is-a-lot-to-love/",
  "scraped_at": "2025-12-20T05:30:50.339103",
  "title": "There is a lot to love",
  "date_display": "February 20, 2019",
  "date_iso": "2019-02-20T10:50:24+00:00",
  "date_from_url": "2019-02-20",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>According to CatholicAnarchist Bear, Jordan Peterson <a href=\"https://youtu.be/-MgSoGL4ERM?t=59\">is still going on about me</a> in New Zealand.</p><blockquote class=\"tr_bq\"><p>Pretty funny how JP is giving you free publicity on live NZ live TV, this time he said you are a man completely in love with his own intelligence.﻿</p><p><b>Jordan Peterson: </b>I think the tactics to describe what I’m doing are generally reprehensible, but that’s not surprising, it’s part and parcel of the way political discourse is conducted today. A lot of epithets and namecalling, none of which is justified in my estimation.</p><p><b>Hayley Holt:  </b>And a lot of pendulum-swinging. You’re not a friend of the radical left, so people may assume you are a friend of the radical right, but that’s not true is it?</p><p><b>Jordan Peterson: </b>No the radical right is not very fond of me. There is a book written recently by a man named Vox Day called <i>Jordanetics </i>which is a criticism of what I’m doing from the radical right perspective. It’s a particularly low-blow book, I would say, written by someone who is dreadfully in love with his own intelligence, um, but its fine as far as I’m concerned. It’s a good thing because I’m not a fan of collectivists on the right either. I think it’s a mistake to make your primary identity your group, it doesn’t matter if it’s a nationalist perspective, or an ethnic or racial perspective, or a sexual perspective, it’s a fundamental error and an extraordinarily dangerous one.</p></blockquote><p>That’s like saying Owen Benjamin is a man who is dreadfully in love with his own height. I may enjoy being highly intelligent, and I may rely upon having more cognitive firepower at my disposal than most on a not-infrequent basis, but this is the sort of comment that is made by someone who knows nothing of the experience himself. What those of lesser intelligence fail to realize about the UHIQ or the subject savant is that we actually have a tendency to take our intellectual gifts for granted; we are far less obsessed with them than our observers and critics are.</p><p>In other words, it’s not that we think we are so special, it’s that we find it very hard to believe that other people can’t do what we do. My father, the designer of various military and aeronautic technologies who did his doctoral work at MIT, genuinely could not believe that anyone was even remotely puzzled by math. “What’s there to be confused about?” he would ask in disbelief. “It’s all literally right there!” It’s like imagining a Frenchman to be impressed by the fact that he speaks French. Of course he does, it’s part of what makes him who and what he is!</p><p>Anyhow, it’s clear that Peterson is attempting to accomplish two things here. First, he’s trying to rhetorically disqualify a book that is significantly damaging him with his fan club by discrediting the author with epithets and namecalling. Second, he’s attempting to use my criticism as a way of positioning himself as a centrist and a victim. And, of course, because he is a habitual liar, he doesn’t even hesitate to lie about the book, about the author, and about himself.</p><p>All you really need to know about Peterson can be seen in this one interview, especially the way he so readily resorts to the rhetorical tactics he declares to be reprehensible in lieu of substantive responses? I invite you to count the number of lies and deceptions he tells in that last paragraph alone. Without bothering to do so myself and based only on an initial read, I’ll put the over/under at seven.</p></div>",
  "content_text": "According to CatholicAnarchist Bear, Jordan Peterson\nis still going on about me\nin New Zealand.\nPretty funny how JP is giving you free publicity on live NZ live TV, this time he said you are a man completely in love with his own intelligence.﻿\nJordan Peterson:\nI think the tactics to describe what I’m doing are generally reprehensible, but that’s not surprising, it’s part and parcel of the way political discourse is conducted today. A lot of epithets and namecalling, none of which is justified in my estimation.\nHayley Holt:\nAnd a lot of pendulum-swinging. You’re not a friend of the radical left, so people may assume you are a friend of the radical right, but that’s not true is it?\nJordan Peterson:\nNo the radical right is not very fond of me. There is a book written recently by a man named Vox Day called\nJordanetics\nwhich is a criticism of what I’m doing from the radical right perspective. It’s a particularly low-blow book, I would say, written by someone who is dreadfully in love with his own intelligence, um, but its fine as far as I’m concerned. It’s a good thing because I’m not a fan of collectivists on the right either. I think it’s a mistake to make your primary identity your group, it doesn’t matter if it’s a nationalist perspective, or an ethnic or racial perspective, or a sexual perspective, it’s a fundamental error and an extraordinarily dangerous one.\nThat’s like saying Owen Benjamin is a man who is dreadfully in love with his own height. I may enjoy being highly intelligent, and I may rely upon having more cognitive firepower at my disposal than most on a not-infrequent basis, but this is the sort of comment that is made by someone who knows nothing of the experience himself. What those of lesser intelligence fail to realize about the UHIQ or the subject savant is that we actually have a tendency to take our intellectual gifts for granted; we are far less obsessed with them than our observers and critics are.\nIn other words, it’s not that we think we are so special, it’s that we find it very hard to believe that other people can’t do what we do. My father, the designer of various military and aeronautic technologies who did his doctoral work at MIT, genuinely could not believe that anyone was even remotely puzzled by math. “What’s there to be confused about?” he would ask in disbelief. “It’s all literally right there!” It’s like imagining a Frenchman to be impressed by the fact that he speaks French. Of course he does, it’s part of what makes him who and what he is!\nAnyhow, it’s clear that Peterson is attempting to accomplish two things here. First, he’s trying to rhetorically disqualify a book that is significantly damaging him with his fan club by discrediting the author with epithets and namecalling. Second, he’s attempting to use my criticism as a way of positioning himself as a centrist and a victim. And, of course, because he is a habitual liar, he doesn’t even hesitate to lie about the book, about the author, and about himself.\nAll you really need to know about Peterson can be seen in this one interview, especially the way he so readily resorts to the rhetorical tactics he declares to be reprehensible in lieu of substantive responses? I invite you to count the number of lies and deceptions he tells in that last paragraph alone. Without bothering to do so myself and based only on an initial read, I’ll put the over/under at seven.",
  "tags": [
    "mailvox"
  ],
  "categories": [],
  "sitemap_lastmod": "2019-02-20T10:50:24+00:00"
}