{
  "url": "https://voxday.net/2019/02/11/whopping-the-floor/",
  "scraped_at": "2025-12-20T05:29:27.348591",
  "title": "Whopping the floor",
  "date_display": "February 11, 2019",
  "date_iso": "2019-02-11T12:28:04+00:00",
  "date_from_url": "2019-02-11",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>This is highly amusing. A reader sent me a transcript of JF’s absurd attempt at performing a victory lap after his inept retreat to rhetoric in what passed for our debate about the theory of evolution by natural selection:</p><blockquote><p>So there was the debate about the theory of evolution with our friend Vox Day. Vox Day has now made a reply, a kind of analysis after the debate. He considered that I have been winning rhetorically which is hilarious because I could basically not speak, I was unable to speak because I had a deep cough and I was unable to say much sentences. To claim that I have been playing it, playing it dishonest with the rhetoric that is the, is so beside reality that I do not know what to say about this. That being said, he seems to not have understood fully my point. So let me just clarify with the paint description. [JF opens up a paint file and takes notes while talking]</p><p>So, Vox Day’s argument. Vox Day he set his own threshold, he came here and said: Alright I have all sorts of takes on the theory of evolution, but today I’m going to do a case that I have a few premises about what should happen in evolution, and this includes mutation and fixation of the mutation. So the mutation must occur and then the mutation must spread across the population, and this is what we call fixation. And he says I have calculated the fixation rate. I have obtained this rate from single cell organism. Maybe it was bacteria, maybe it was single cell nucareat, I don’t know where he got his number, but he said based on this premise my conclusion is that the human-chimp division could not have happened in less than 12 million year as is claimed by evolutionary theorists.</p><p>Alright, so that is an argument with a structure, and I have not been winning rhetorically against this freaking argument. I said Vox Day I reject your premise here, you got it wrong. [JF is circling the note that says: “Fixation → rate bacteria” under “1. Premise”] And I even specified why you got it wrong. Because fixation rate, fixation rate greatly vary. Fixation rate in single cell organism is not equal to fixation rate in mammal. And there is two reasons for it. One is sexual reproduction. The second is variability of population size.</p><p>Why do we not use fixated rates? It’s because fixated rate are highly dependent on the number of population you have, the number of competitors you have to overcome before a gene becomes widespread in the population. It depends a lot on what you are fighting against, and a million bacteria are fighting together for dominance of the whole population. But because bacteria do not reproduce sexually, or if we are talking about since cell nucareat they do, but only optionally unlike mammals. They are stuck in a replicative cycle that keeps all of the mutations in the same genome. In other words there are no short cut for evolution. If you want to evolve two good genes in a bacteria it needs to be the case that the first gene mutates, and the second gene then mutates. That’s what happen in a non sexual life form.</p><p>In a sexual life form like mammals, mutations can get fixed much faster because sometimes you have bottleneck effects, sometimes you will not have a million mammal in a population. Sometimes the productively relevant population that will leave decent in the future can be reduced to thirty, sixty, one hundred fifty. Because all of the others may be subject too have facing environmental pressures that will end up either having them die or their decedents. So the rate of fixation for bacteria is totally unrelated to the rate of fixation in mammals. Because on top of it in mammals the mutation is not stuck in a single individual and all of its decedents. It can jump, because you can fuck woman. And if you fuck woman it is an opportunity for your mutated genes to jump and combine with other mutated genes. Not only because the chromosomes will come from, one from your father, one from your mother and they will link together to form your chromosome, but on top of it there is crossover. So there are scissors that come in, they cut DNA and they re-plug DNA at different parts. This generates a lot of mutations on its own, but it also generates an opportunity for mutations to spread into the population at much much much faster rates than bacteria. The only way for a bacteria to fix their a mutation is to out compete all others.</p><p>And on top of it Vox Day is working with a fallacy witch is a fallacy of species as a natural category. It is one thing to say that today chimpanzees cannot reproduce with humans, homo sapiens. It is another thing to know exactly when that lack of reproduction possibility has started for real. Could homo erectus reproduce with a chimpanzee? Who knows, we don’t have homo erectus sperm, we’ll never know. Are there some transitional life form between the two species that could reproduce? Possibly, we don’t know. So that is why we do not talk about fixated, because fixated is a mathematical illusion, created by your understanding of the population size. We do not have population sizes back in Africa in seven million years ago. So we follow mutations and lines of descent like a fucking boss. This is what Vox Day has not understood and he thinks that I have misunderstood him. Motherfucker, I am a PhD in biology. I whopped the floor with you, I have cleaned the floor with you and I had a big cough. I was suffering and I could only use a few words per sentence and I was suffering.</p></blockquote><p>He’s going to be suffering a lot more once people start explaining the difference between rhetoric and dialectic to him, to say nothing of the fact that he completely failed to understand that I specifically addressed the possibility – which is not at all the certainty that he assumes it to be – that fixation rates are considerably faster in mammals than in bacteria for a variety of proposed reasons that include the Fisher–Muller effect and the Ruby in the Rubbish effect, among others. And I did so in the debate, he simply did not understand that I had done so, and not only that, that I had done so in a manner extremely favorable to the orthodox perspective.</p><p>Remember, in my initial bacterial model, I utilized the observed average fixation rate of 1,600 generations. First notice that JF completely omits to mention that he incorrectly assumed that this was a successional-mutations regime and tried to claim that I was wrong because I was unaware of parallel mutations. However, it was a concurrent-mutations regime, which is why I pointed out in my post-debate analysis that JF was wrong and that particular objection was irrelevant.</p><p>Second, I <i>directly addressed</i> the possibility of faster fixation rates in mammals. In fact, I came up with a completely different fixation model which was built around the idea of a minimum viable population mutating into a recurring series of minimum viable populations. It should be conceptually impossible for fixation to occur any faster than this barring genetic engineering, even if we take asteroids, volcanoes, Biblical floods, and other possible catastrophes into account. This rate reduced the average fixed mutation propagation time from 1,600 to 15.7 generations, more than two <i>orders of magnitude</i> faster than the observed parallel fixation rate. And despite this average rate being considerably faster than any fixation event that has ever been observed or even seriously proposed, the recurring minimum viable population scenario still renders even the maximal evolutionary timelines highly improbable to the point of being considered a mathematical impossibility given the observed genetic differences.</p><p>So, it is clear that despite his PhD in biology, JF completely failed to grasp that I had already foreseen and accounted for his objections, and not only that, he <i>still </i>doesn’t understand the significance of the numbers that I cited any better than he understood the math of Askhkenazi intelligence before having it explained to him three times. And he still doesn’t understand that the number of seeds scattered about the forest floor has very, very little to do with calculating the average annual growth rate of the tallest trees in the forest. And finally, his claim that fixation is a mathematical illusion is belied by the continued attempts of more serious and competent biologists <a href=\"https://www.nature.com/articles/nature17143\">to address that very issue</a>.</p></div>",
  "content_text": "This is highly amusing. A reader sent me a transcript of JF’s absurd attempt at performing a victory lap after his inept retreat to rhetoric in what passed for our debate about the theory of evolution by natural selection:\nSo there was the debate about the theory of evolution with our friend Vox Day. Vox Day has now made a reply, a kind of analysis after the debate. He considered that I have been winning rhetorically which is hilarious because I could basically not speak, I was unable to speak because I had a deep cough and I was unable to say much sentences. To claim that I have been playing it, playing it dishonest with the rhetoric that is the, is so beside reality that I do not know what to say about this. That being said, he seems to not have understood fully my point. So let me just clarify with the paint description. [JF opens up a paint file and takes notes while talking]\nSo, Vox Day’s argument. Vox Day he set his own threshold, he came here and said: Alright I have all sorts of takes on the theory of evolution, but today I’m going to do a case that I have a few premises about what should happen in evolution, and this includes mutation and fixation of the mutation. So the mutation must occur and then the mutation must spread across the population, and this is what we call fixation. And he says I have calculated the fixation rate. I have obtained this rate from single cell organism. Maybe it was bacteria, maybe it was single cell nucareat, I don’t know where he got his number, but he said based on this premise my conclusion is that the human-chimp division could not have happened in less than 12 million year as is claimed by evolutionary theorists.\nAlright, so that is an argument with a structure, and I have not been winning rhetorically against this freaking argument. I said Vox Day I reject your premise here, you got it wrong. [JF is circling the note that says: “Fixation → rate bacteria” under “1. Premise”] And I even specified why you got it wrong. Because fixation rate, fixation rate greatly vary. Fixation rate in single cell organism is not equal to fixation rate in mammal. And there is two reasons for it. One is sexual reproduction. The second is variability of population size.\nWhy do we not use fixated rates? It’s because fixated rate are highly dependent on the number of population you have, the number of competitors you have to overcome before a gene becomes widespread in the population. It depends a lot on what you are fighting against, and a million bacteria are fighting together for dominance of the whole population. But because bacteria do not reproduce sexually, or if we are talking about since cell nucareat they do, but only optionally unlike mammals. They are stuck in a replicative cycle that keeps all of the mutations in the same genome. In other words there are no short cut for evolution. If you want to evolve two good genes in a bacteria it needs to be the case that the first gene mutates, and the second gene then mutates. That’s what happen in a non sexual life form.\nIn a sexual life form like mammals, mutations can get fixed much faster because sometimes you have bottleneck effects, sometimes you will not have a million mammal in a population. Sometimes the productively relevant population that will leave decent in the future can be reduced to thirty, sixty, one hundred fifty. Because all of the others may be subject too have facing environmental pressures that will end up either having them die or their decedents. So the rate of fixation for bacteria is totally unrelated to the rate of fixation in mammals. Because on top of it in mammals the mutation is not stuck in a single individual and all of its decedents. It can jump, because you can fuck woman. And if you fuck woman it is an opportunity for your mutated genes to jump and combine with other mutated genes. Not only because the chromosomes will come from, one from your father, one from your mother and they will link together to form your chromosome, but on top of it there is crossover. So there are scissors that come in, they cut DNA and they re-plug DNA at different parts. This generates a lot of mutations on its own, but it also generates an opportunity for mutations to spread into the population at much much much faster rates than bacteria. The only way for a bacteria to fix their a mutation is to out compete all others.\nAnd on top of it Vox Day is working with a fallacy witch is a fallacy of species as a natural category. It is one thing to say that today chimpanzees cannot reproduce with humans, homo sapiens. It is another thing to know exactly when that lack of reproduction possibility has started for real. Could homo erectus reproduce with a chimpanzee? Who knows, we don’t have homo erectus sperm, we’ll never know. Are there some transitional life form between the two species that could reproduce? Possibly, we don’t know. So that is why we do not talk about fixated, because fixated is a mathematical illusion, created by your understanding of the population size. We do not have population sizes back in Africa in seven million years ago. So we follow mutations and lines of descent like a fucking boss. This is what Vox Day has not understood and he thinks that I have misunderstood him. Motherfucker, I am a PhD in biology. I whopped the floor with you, I have cleaned the floor with you and I had a big cough. I was suffering and I could only use a few words per sentence and I was suffering.\nHe’s going to be suffering a lot more once people start explaining the difference between rhetoric and dialectic to him, to say nothing of the fact that he completely failed to understand that I specifically addressed the possibility – which is not at all the certainty that he assumes it to be – that fixation rates are considerably faster in mammals than in bacteria for a variety of proposed reasons that include the Fisher–Muller effect and the Ruby in the Rubbish effect, among others. And I did so in the debate, he simply did not understand that I had done so, and not only that, that I had done so in a manner extremely favorable to the orthodox perspective.\nRemember, in my initial bacterial model, I utilized the observed average fixation rate of 1,600 generations. First notice that JF completely omits to mention that he incorrectly assumed that this was a successional-mutations regime and tried to claim that I was wrong because I was unaware of parallel mutations. However, it was a concurrent-mutations regime, which is why I pointed out in my post-debate analysis that JF was wrong and that particular objection was irrelevant.\nSecond, I\ndirectly addressed\nthe possibility of faster fixation rates in mammals. In fact, I came up with a completely different fixation model which was built around the idea of a minimum viable population mutating into a recurring series of minimum viable populations. It should be conceptually impossible for fixation to occur any faster than this barring genetic engineering, even if we take asteroids, volcanoes, Biblical floods, and other possible catastrophes into account. This rate reduced the average fixed mutation propagation time from 1,600 to 15.7 generations, more than two\norders of magnitude\nfaster than the observed parallel fixation rate. And despite this average rate being considerably faster than any fixation event that has ever been observed or even seriously proposed, the recurring minimum viable population scenario still renders even the maximal evolutionary timelines highly improbable to the point of being considered a mathematical impossibility given the observed genetic differences.\nSo, it is clear that despite his PhD in biology, JF completely failed to grasp that I had already foreseen and accounted for his objections, and not only that, he\nstill\ndoesn’t understand the significance of the numbers that I cited any better than he understood the math of Askhkenazi intelligence before having it explained to him three times. And he still doesn’t understand that the number of seeds scattered about the forest floor has very, very little to do with calculating the average annual growth rate of the tallest trees in the forest. And finally, his claim that fixation is a mathematical illusion is belied by the continued attempts of more serious and competent biologists\nto address that very issue\n.",
  "tags": [
    "rhetoric"
  ],
  "categories": [],
  "sitemap_lastmod": "2019-02-11T12:28:04+00:00"
}