{
  "url": "https://voxday.net/2019/02/07/why-the-us-is-interested-in-venezuala/",
  "scraped_at": "2025-12-20T05:29:00.309920",
  "title": "Why the US is interested in Venezuala",
  "date_display": "February 7, 2019",
  "date_iso": "2019-02-07T21:50:31+00:00",
  "date_from_url": "2019-02-07",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>The Saker interviews Michael Hudson to learn why the USA is suddenly <a href=\"http://www.unz.com/tsaker/saker-interview-with-michael-hudson-on-venezuela/\">so interested in Venezuela</a>, of all places:</p><blockquote><p>The Saker: <i>Could you outline the various reforms and changes introduced by Hugo Chavez? What did he do right, and what did he do wrong?</i></p><p>Michael Hudson: Chavez sought to restore a mixed economy to Venezuela, using its government revenue – mainly from oil, of course – to develop infrastructure and domestic spending on health care, education, employment to raise living standards and productivity for his electoral constituency.</p><p>What he was unable to do was to clean up the embezzlement and built-in rake-off of income from the oil sector. And he was unable to stem the capital flight of the oligarchy, taking its wealth and moving it abroad – while running away themselves.</p><p>This was not “wrong”. It merely takes a long time to change an economy’s disruption – while the U.S. is using sanctions and “dirty tricks” to stop that process.</p><p>The Saker: <i>What are, in your opinion, the causes of the current economic crisis in Venezuela – is it primarily due to mistakes by Chavez and Maduro or is the main cause US sabotage, subversion and sanctions?</i></p><p>Michael Hudson: There is no way that Chavez and Maduro could have pursued a pro-Venezuelan policy aimed at achieving economic independence without inciting fury, subversion and sanctions from the United States. American foreign policy remains as focused on oil as it was when it invaded Iraq under Dick Cheney’s regime. U.S. policy is to treat Venezuela as an extension of the U.S. economy, running a trade surplus in oil to spend in the United States or transfer its savings to U.S. banks.</p><p>By imposing sanctions that prevent Venezuela from gaining access to its U.S. bank deposits and the assets of its state-owned Citco, the United States is making it impossible for Venezuela to pay its foreign debt. This is forcing it into default, which U.S. diplomats hope to use as an excuse to foreclose on Venezuela’s oil resources and seize its foreign assets much as Paul Singer hedge fund sought to do with Argentina’s foreign assets.</p><p>Just as U.S. policy under Kissinger was to make Chile’s “economy scream,” so the U.S. is following the same path against Venezuela. It is using that country as a “demonstration effect” to warn other countries not to act in their self-interest in any way that prevents their economic surplus from being siphoned off by U.S. investors.</p><p>The Saker: <i>What in your opinion should Maduro do next (assuming he stays in power and the USA does not overthrow him) to rescue the Venezuelan economy?</i></p><p>Michael Hudson: I cannot think of anything that President Maduro can do that he is not doing. At best, he can seek foreign support – and demonstrate to the world the need for an alternative international financial and economic system.</p><p>He already has begun to do this by trying to withdraw Venezuela’s gold from the Bank of England and Federal Reserve. This is turning into “asymmetrical warfare,” threatening to de-sanctify the dollar standard in international finance. The refusal of England and the United States to grant an elected government control of its foreign assets demonstrates to the entire world that U.S. diplomats and courts alone can and will control foreign countries as an extension of U.S. nationalism.</p><p>The price of the U.S. economic attack on Venezuela is thus to fracture the global monetary system. Maduro’s defensive move is showing other countries the need to protect themselves from becoming “another Venezuela” by finding a new safe haven and paying agent for their gold, foreign exchange reserves and foreign debt financing, away from the dollar, sterling and euro areas.</p><p>The only way that Maduro can fight successfully is on the institutional level, upping the ante to move “outside the box.” His plan – and of course it is a longer-term plan – is to help catalyze a new international economic order independent of the U.S. dollar standard. It will work in the short run only if the United States believes that it can emerge from this fight as an honest financial broker, honest banking system and supporter of democratically elected regimes. The Trump administration is destroying illusion more thoroughly than any anti-imperialist critic or economic rival could do!</p></blockquote><p>In short, Venezuela is another crisis point for US financial imperialism. The inability of Venezuela to take possession of its own gold in London is yet another indication that the neo-liberal world order is increasingly unstable. It’s not about the oil, it’s about the debt.</p><p>It certainly doesn’t help that US officials are doing incredibly stupid things, like the Secretary of State calling Juan Guaido “duly-elected” when the man has never even run for President of Venezuela! The two candidates who lost the 2018 election to Nicolás Maduro were Henri Falcón and Javier Bertucci, while Henrique Capriles was the losing candidate in the 2013 election that was also won by Maduro.</p></div>",
  "content_text": "The Saker interviews Michael Hudson to learn why the USA is suddenly\nso interested in Venezuela\n, of all places:\nThe Saker:\nCould you outline the various reforms and changes introduced by Hugo Chavez? What did he do right, and what did he do wrong?\nMichael Hudson: Chavez sought to restore a mixed economy to Venezuela, using its government revenue – mainly from oil, of course – to develop infrastructure and domestic spending on health care, education, employment to raise living standards and productivity for his electoral constituency.\nWhat he was unable to do was to clean up the embezzlement and built-in rake-off of income from the oil sector. And he was unable to stem the capital flight of the oligarchy, taking its wealth and moving it abroad – while running away themselves.\nThis was not “wrong”. It merely takes a long time to change an economy’s disruption – while the U.S. is using sanctions and “dirty tricks” to stop that process.\nThe Saker:\nWhat are, in your opinion, the causes of the current economic crisis in Venezuela – is it primarily due to mistakes by Chavez and Maduro or is the main cause US sabotage, subversion and sanctions?\nMichael Hudson: There is no way that Chavez and Maduro could have pursued a pro-Venezuelan policy aimed at achieving economic independence without inciting fury, subversion and sanctions from the United States. American foreign policy remains as focused on oil as it was when it invaded Iraq under Dick Cheney’s regime. U.S. policy is to treat Venezuela as an extension of the U.S. economy, running a trade surplus in oil to spend in the United States or transfer its savings to U.S. banks.\nBy imposing sanctions that prevent Venezuela from gaining access to its U.S. bank deposits and the assets of its state-owned Citco, the United States is making it impossible for Venezuela to pay its foreign debt. This is forcing it into default, which U.S. diplomats hope to use as an excuse to foreclose on Venezuela’s oil resources and seize its foreign assets much as Paul Singer hedge fund sought to do with Argentina’s foreign assets.\nJust as U.S. policy under Kissinger was to make Chile’s “economy scream,” so the U.S. is following the same path against Venezuela. It is using that country as a “demonstration effect” to warn other countries not to act in their self-interest in any way that prevents their economic surplus from being siphoned off by U.S. investors.\nThe Saker:\nWhat in your opinion should Maduro do next (assuming he stays in power and the USA does not overthrow him) to rescue the Venezuelan economy?\nMichael Hudson: I cannot think of anything that President Maduro can do that he is not doing. At best, he can seek foreign support – and demonstrate to the world the need for an alternative international financial and economic system.\nHe already has begun to do this by trying to withdraw Venezuela’s gold from the Bank of England and Federal Reserve. This is turning into “asymmetrical warfare,” threatening to de-sanctify the dollar standard in international finance. The refusal of England and the United States to grant an elected government control of its foreign assets demonstrates to the entire world that U.S. diplomats and courts alone can and will control foreign countries as an extension of U.S. nationalism.\nThe price of the U.S. economic attack on Venezuela is thus to fracture the global monetary system. Maduro’s defensive move is showing other countries the need to protect themselves from becoming “another Venezuela” by finding a new safe haven and paying agent for their gold, foreign exchange reserves and foreign debt financing, away from the dollar, sterling and euro areas.\nThe only way that Maduro can fight successfully is on the institutional level, upping the ante to move “outside the box.” His plan – and of course it is a longer-term plan – is to help catalyze a new international economic order independent of the U.S. dollar standard. It will work in the short run only if the United States believes that it can emerge from this fight as an honest financial broker, honest banking system and supporter of democratically elected regimes. The Trump administration is destroying illusion more thoroughly than any anti-imperialist critic or economic rival could do!\nIn short, Venezuela is another crisis point for US financial imperialism. The inability of Venezuela to take possession of its own gold in London is yet another indication that the neo-liberal world order is increasingly unstable. It’s not about the oil, it’s about the debt.\nIt certainly doesn’t help that US officials are doing incredibly stupid things, like the Secretary of State calling Juan Guaido “duly-elected” when the man has never even run for President of Venezuela! The two candidates who lost the 2018 election to Nicolás Maduro were Henri Falcón and Javier Bertucci, while Henrique Capriles was the losing candidate in the 2013 election that was also won by Maduro.",
  "tags": [
    "declineandfall"
  ],
  "categories": [],
  "sitemap_lastmod": "2019-02-07T21:50:31+00:00"
}