{
  "url": "https://voxday.net/2019/02/10/wolves-in-the-southern-baptist-pulpits/",
  "scraped_at": "2025-12-20T05:29:21.867008",
  "title": "Wolves in the Southern Baptist pulpits",
  "date_display": "February 10, 2019",
  "date_iso": "2019-02-10T16:00:01+00:00",
  "date_from_url": "2019-02-10",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>This report on the Southern Baptist hierarchy and various church leaderships <a href=\"https://www.houstonchronicle.com/news/investigations/article/Southern-Baptist-sexual-abuse-spreads-as-leaders-13588038.php\">attempting to protect sexual predators</a> doesn’t surprise me. Back when I was in the States, the pastor of our Southern Baptist church told me of two separate attempts to take over churches by people who were of nefarious attempt. Not all that glitters is gold and not everyone who says they are Christian actually serves Jesus Christ. This is the price of ignoring Paul’s warning about wolves in sheep’s clothing as well as the ill-considered belief in forgiving the unrepentant.</p><blockquote><p>In June 2008, she paid her way to Indianapolis, where she and others asked leaders of the Southern Baptist Convention and its 47,000 churches to track sexual predators and take action against congregations that harbored or concealed abusers. Vasquez, by then in her 40s, implored them to consider prevention policies like those adopted by faiths that include the Catholic Church.</p><p>Days later, Southern Baptist leaders rejected nearly every proposed reform….</p><p>Journalists in the two newsrooms spent more than six months reviewing thousands of pages of court, prison and police records and conducting hundreds of interviews. They built a database of former leaders in Southern Baptist churches who have been convicted of sex crimes.</p><p>The investigation reveals that:</p><p>• At least 35 church pastors, employees and volunteers who exhibited predatory behavior were still able to find jobs at churches during the past two decades. In some cases, church leaders apparently failed to alert law enforcement about complaints or to warn other congregations about allegations of misconduct.<br>• Several past presidents and prominent leaders of the Southern Baptist Convention are among those criticized by victims for concealing or mishandling abuse complaints within their own churches or seminaries.<br>• Some registered sex offenders returned to the pulpit. Others remain there, including a Houston preacher who sexually assaulted a teenager and now is the principal officer of a Houston nonprofit that works with student organizations, federal records show. Its name: Touching the Future Today Inc.<br>• Many of the victims were adolescents who were molested, sent explicit photos or texts, exposed to pornography, photographed nude, or repeatedly raped by youth pastors. Some victims as young as 3 were molested or raped inside pastors’ studies and Sunday school classrooms. A few were adults — women and men who sought pastoral guidance and instead say they were seduced or sexually assaulted.</br></br></br></p></blockquote><p>It’s not just the schools and churches that are protecting the predators. It’s also <a href=\"https://www.powerlineblog.com/archives/2019/02/a-pedophile-on-the-reservation.php\">the medical community</a>:</p><blockquote><p>The long Journal story, which is well worth reading in its entirety, includes a facsimile of a hand-written letter that Mark wrote about Dr. Weber, blowing the whistle on him as a predator. Across all the years, I immediately recognized the handwriting. The letter included this observation about Weber’s propensity to select boys and young men as reservation clinic patients:</p><p><i>[T]he probability of Dr. Weber seeing so few females–based on random chance–is two out of a trillion. I have first-hand knowledge, based on my years of association with this individual, that he preferentially chooses skinny and normal weight teenage boys and young men in his practice and I observed him on many occasions picking the charts of these patients out of my own box.</i></p><p>You would think this sort of revelation from a colleague would be the end of Dr. Weber’s association with the Indian Health Service. But no:</p><p><i>After a clash with Mr. Weber, Dr. Butterbrodt was pulled into a supervisor’s office and, within weeks, transferred to a remote facility in North Dakota and stripped of bonus pay, which amounted to around one-third of his annual salary, according to personnel records and Dr. Butterbrodt. “I was chased off by a pedophile and the people who chose him over me,” said Dr. Butterbrodt, who retired soon after.</i></p></blockquote><p>Every organization must be pressured to adopt a no-tolerance policy for sex criminals. No church should ever permit any man who admits or is even credibly accused of sexually preying on minors to have any employment at all within the church. And, as Spacebunny notes, since we have a three-strikes laws concerning drug offenses, which are comparatively minor, shouldn’t we have a two-strikes-and-life-imprisonment laws for sex crimes involving minors?</p></div>",
  "content_text": "This report on the Southern Baptist hierarchy and various church leaderships\nattempting to protect sexual predators\ndoesn’t surprise me. Back when I was in the States, the pastor of our Southern Baptist church told me of two separate attempts to take over churches by people who were of nefarious attempt. Not all that glitters is gold and not everyone who says they are Christian actually serves Jesus Christ. This is the price of ignoring Paul’s warning about wolves in sheep’s clothing as well as the ill-considered belief in forgiving the unrepentant.\nIn June 2008, she paid her way to Indianapolis, where she and others asked leaders of the Southern Baptist Convention and its 47,000 churches to track sexual predators and take action against congregations that harbored or concealed abusers. Vasquez, by then in her 40s, implored them to consider prevention policies like those adopted by faiths that include the Catholic Church.\nDays later, Southern Baptist leaders rejected nearly every proposed reform….\nJournalists in the two newsrooms spent more than six months reviewing thousands of pages of court, prison and police records and conducting hundreds of interviews. They built a database of former leaders in Southern Baptist churches who have been convicted of sex crimes.\nThe investigation reveals that:\n• At least 35 church pastors, employees and volunteers who exhibited predatory behavior were still able to find jobs at churches during the past two decades. In some cases, church leaders apparently failed to alert law enforcement about complaints or to warn other congregations about allegations of misconduct.\n• Several past presidents and prominent leaders of the Southern Baptist Convention are among those criticized by victims for concealing or mishandling abuse complaints within their own churches or seminaries.\n• Some registered sex offenders returned to the pulpit. Others remain there, including a Houston preacher who sexually assaulted a teenager and now is the principal officer of a Houston nonprofit that works with student organizations, federal records show. Its name: Touching the Future Today Inc.\n• Many of the victims were adolescents who were molested, sent explicit photos or texts, exposed to pornography, photographed nude, or repeatedly raped by youth pastors. Some victims as young as 3 were molested or raped inside pastors’ studies and Sunday school classrooms. A few were adults — women and men who sought pastoral guidance and instead say they were seduced or sexually assaulted.\nIt’s not just the schools and churches that are protecting the predators. It’s also\nthe medical community\n:\nThe long Journal story, which is well worth reading in its entirety, includes a facsimile of a hand-written letter that Mark wrote about Dr. Weber, blowing the whistle on him as a predator. Across all the years, I immediately recognized the handwriting. The letter included this observation about Weber’s propensity to select boys and young men as reservation clinic patients:\n[T]he probability of Dr. Weber seeing so few females–based on random chance–is two out of a trillion. I have first-hand knowledge, based on my years of association with this individual, that he preferentially chooses skinny and normal weight teenage boys and young men in his practice and I observed him on many occasions picking the charts of these patients out of my own box.\nYou would think this sort of revelation from a colleague would be the end of Dr. Weber’s association with the Indian Health Service. But no:\nAfter a clash with Mr. Weber, Dr. Butterbrodt was pulled into a supervisor’s office and, within weeks, transferred to a remote facility in North Dakota and stripped of bonus pay, which amounted to around one-third of his annual salary, according to personnel records and Dr. Butterbrodt. “I was chased off by a pedophile and the people who chose him over me,” said Dr. Butterbrodt, who retired soon after.\nEvery organization must be pressured to adopt a no-tolerance policy for sex criminals. No church should ever permit any man who admits or is even credibly accused of sexually preying on minors to have any employment at all within the church. And, as Spacebunny notes, since we have a three-strikes laws concerning drug offenses, which are comparatively minor, shouldn’t we have a two-strikes-and-life-imprisonment laws for sex crimes involving minors?",
  "tags": [
    "declineandfall"
  ],
  "categories": [],
  "sitemap_lastmod": "2019-02-10T16:00:01+00:00"
}