{
  "url": "https://voxday.net/2017/03/27/a-theory-falsified/",
  "scraped_at": "2025-12-18T07:07:51.103438",
  "title": "A theory, falsified, again",
  "date_display": "March 27, 2017",
  "date_iso": "2017-03-27T11:43:00+00:00",
  "date_from_url": "2017-03-27",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>One wonders how many times evolutionary biologists are going to see <a href=\"http://nautil.us/issue/9/Time/evolution-youre-drunk\">their hypotheses falsified </a>before they finally give up and abandon ship on their pet theory.</p><blockquote class=\"tr_bq\"><p> Before the advent of rapid, accurate, and inexpensive DNA sequencing technology in the early 2000s, biologists guessed that genes would provide more evidence for increasing complexity in evolution. Simple, early organisms would have fewer genes than complex ones, they predicted, just as a blueprint of Dorothy’s cottage in Kansas would be less complicated than one for the Emerald City. Instead, their assumptions of increasing complexity began to fall apart. First to go was an easy definition of how complexity manifested itself. After all, amoebas had huge genomes. Now, DNA analyses are rearranging evolutionary trees, suggesting that the arrow scientists envisioned between simplicity and complexity actually spins like a weather vane caught in a tornado.</p></blockquote><p>In summary:</p><ol><li>Biologists predicted genome size would increase over time, and that was wrong. </li><li>Biologists then predicted that gene number would increase over time, and that was wrong. </li><li>Biologists predicted that complex body parts would develop after simpler body parts, and that was wrong.</li><li>Biologists have now found that the oldest living ancestor of animals, comb jellies, already had brain, nervous system, and muscles, and that sponges later <i>lost </i>those genes. Complexity was there at the start. </li><li>Biologists have also found, through experiment, that most mutations cause a <i>loss </i>of complexity.</li></ol><p>The latter is particularly important, because it renders evolution statistically improbable to the point of impossibility. How many scientific theories can produce so many predictions that are completely proven wrong, so many hypotheses that are falsified, and still be considered orthodox dogma that one must be a madman or a barbarian to question?</p><p>I don’t have the answer, but frankly, at this point, I am more inclined to believe in the possibility either alien breeding programs or the grand simulation hypothesis I am in the combination of abiogenesis and the neo-Darwinian synthesis. The combination is not only too temporally difficult and statistically improbable, but reliably produces incorrect hypotheses. I wouldn’t go so far as to say it isn’t science, merely that it is bad and outdated science that is unlikely to ever have any engineering relevance.</p></div>",
  "content_text": "One wonders how many times evolutionary biologists are going to see\ntheir hypotheses falsified\nbefore they finally give up and abandon ship on their pet theory.\nBefore the advent of rapid, accurate, and inexpensive DNA sequencing technology in the early 2000s, biologists guessed that genes would provide more evidence for increasing complexity in evolution. Simple, early organisms would have fewer genes than complex ones, they predicted, just as a blueprint of Dorothy’s cottage in Kansas would be less complicated than one for the Emerald City. Instead, their assumptions of increasing complexity began to fall apart. First to go was an easy definition of how complexity manifested itself. After all, amoebas had huge genomes. Now, DNA analyses are rearranging evolutionary trees, suggesting that the arrow scientists envisioned between simplicity and complexity actually spins like a weather vane caught in a tornado.\nIn summary:\nBiologists predicted genome size would increase over time, and that was wrong.\nBiologists then predicted that gene number would increase over time, and that was wrong.\nBiologists predicted that complex body parts would develop after simpler body parts, and that was wrong.\nBiologists have now found that the oldest living ancestor of animals, comb jellies, already had brain, nervous system, and muscles, and that sponges later\nlost\nthose genes. Complexity was there at the start.\nBiologists have also found, through experiment, that most mutations cause a\nloss\nof complexity.\nThe latter is particularly important, because it renders evolution statistically improbable to the point of impossibility. How many scientific theories can produce so many predictions that are completely proven wrong, so many hypotheses that are falsified, and still be considered orthodox dogma that one must be a madman or a barbarian to question?\nI don’t have the answer, but frankly, at this point, I am more inclined to believe in the possibility either alien breeding programs or the grand simulation hypothesis I am in the combination of abiogenesis and the neo-Darwinian synthesis. The combination is not only too temporally difficult and statistically improbable, but reliably produces incorrect hypotheses. I wouldn’t go so far as to say it isn’t science, merely that it is bad and outdated science that is unlikely to ever have any engineering relevance.",
  "tags": [
    "evolution",
    "science"
  ],
  "categories": [],
  "sitemap_lastmod": "2017-03-27T10:43:00+00:00"
}