{
  "url": "https://voxday.net/2017/03/08/almost-indescribably-good/",
  "scraped_at": "2025-12-18T07:05:02.230954",
  "title": "Almost indescribably good",
  "date_display": "March 8, 2017",
  "date_iso": "2017-03-08T13:10:00+00:00",
  "date_from_url": "2017-03-08",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>People occasionally ask me why I am such a Babymetal enthusiast. All I have to say is that they are, quite literally, one of the very best bands in the world, from technical and songwriting perspectives, even if one ignores the awesome Japanese theatrical elements. They’re uniformly excellent.</p><p>One thing I like about twentyone pilots is the way they can move effortlessly between musical lanes. What most people don’t realize is that Babymetal’s range is even greater. It’s not just the signature combination of J-Pop and power metal of <a href=\"https://www.youtube.com/watch?v=_KZ-iIsx2Qk\">Doki Doki Morning</a>, or even the big chord, big chorus metal of <a href=\"https://www.youtube.com/watch?v=GvD3CHA48pA\">Karate</a>, that is chiefly of note in this regard, but the fact that Babymetal has the ability to do everything from X-metal-tribute power ballads to metal-infused Deep Forest. This is what you can do when you assemble exceptional talent under a unique vision; I view it in some ways as a conceptual model for Castalia House.</p><p>Consider the heavily emotional No Rain, No Rainbow, which features a guitar solo that reminds me more than a little of my favorite anthem, My Chemical Romance’s <i>Welcome to the Black Parade</i>. Su-metal is absolutely no joke as a vocalist, and I love the fitting, if uncharacteristic, restraint of the Kami band here.<br> <i><br/></i><br/></br></p><div style=\"text-align: center;\"> <iframe allowfullscreen=\"\" frameborder=\"0\" height=\"284\" src=\"https://www.youtube.com/embed/DGJunhe9S2w\" width=\"512\"></iframe></div><p>English speakers will probably not understand why Su-metal is on the edge of crying at the end, so <a href=\"https://du-metal.blogspot.com/2014/09/no-rain-no-rainbow.html\">a translation</a> might help.</p><p><i>Even the despair becomes the light.</i><br> <i>Though an endless rain continues to fall.</i><br> <i>Even the despair becomes the light.</i><br> <i>A sad rain throws a rainbow far far away.</i><br> <i><br/></i><br> <i>We shall never meet again,</i><br> <i>But I want not to forget you forever.</i><br> <i>If the dream continues, I wish I’ll never wake up from it.</i><br> <i><br/></i><br> <i>An endless rain fills my heart </i><i>forever.</i></br></br></br></br></br></br></br></br></br></p><p>However, my favorite Babymetal song is one of the less well-known songs from <i>Metal Resistance</i>, From Dusk Till Dawn. Some compare it to Enigma on steroids, but I think Deep Forest is the more accurate comparison. It really shows off Koba-metal’s skill as a producer.</p><div style=\"text-align: center;\"></div><div style=\"text-align: center;\"> <iframe allowfullscreen=\"\" frameborder=\"0\" height=\"284\" src=\"https://www.youtube.com/embed/l2ZpXXs40BM\" width=\"512\"></iframe></div><div style=\"text-align: left;\"> And if you don’t believe these guys can do anything they want musically, and do it better than most, have a listen to the Kari band, which is the fusion jazz project of three of the Kami band members.</div><div style=\"text-align: center;\"></div><div style=\"text-align: center;\"> <iframe allowfullscreen=\"\" frameborder=\"0\" height=\"284\" src=\"https://www.youtube.com/embed/Ys26wIQvUxI\" width=\"512\"></iframe></div></div>",
  "content_text": "People occasionally ask me why I am such a Babymetal enthusiast. All I have to say is that they are, quite literally, one of the very best bands in the world, from technical and songwriting perspectives, even if one ignores the awesome Japanese theatrical elements. They’re uniformly excellent.\nOne thing I like about twentyone pilots is the way they can move effortlessly between musical lanes. What most people don’t realize is that Babymetal’s range is even greater. It’s not just the signature combination of J-Pop and power metal of\nDoki Doki Morning\n, or even the big chord, big chorus metal of\nKarate\n, that is chiefly of note in this regard, but the fact that Babymetal has the ability to do everything from X-metal-tribute power ballads to metal-infused Deep Forest. This is what you can do when you assemble exceptional talent under a unique vision; I view it in some ways as a conceptual model for Castalia House.\nConsider the heavily emotional No Rain, No Rainbow, which features a guitar solo that reminds me more than a little of my favorite anthem, My Chemical Romance’s\nWelcome to the Black Parade\n. Su-metal is absolutely no joke as a vocalist, and I love the fitting, if uncharacteristic, restraint of the Kami band here.\nEnglish speakers will probably not understand why Su-metal is on the edge of crying at the end, so\na translation\nmight help.\nEven the despair becomes the light.\nThough an endless rain continues to fall.\nEven the despair becomes the light.\nA sad rain throws a rainbow far far away.\nWe shall never meet again,\nBut I want not to forget you forever.\nIf the dream continues, I wish I’ll never wake up from it.\nAn endless rain fills my heart\nforever.\nHowever, my favorite Babymetal song is one of the less well-known songs from\nMetal Resistance\n, From Dusk Till Dawn. Some compare it to Enigma on steroids, but I think Deep Forest is the more accurate comparison. It really shows off Koba-metal’s skill as a producer.\nAnd if you don’t believe these guys can do anything they want musically, and do it better than most, have a listen to the Kari band, which is the fusion jazz project of three of the Kami band members.",
  "tags": [
    "music"
  ],
  "categories": [],
  "sitemap_lastmod": "2017-03-08T13:10:00+00:00"
}