{
  "url": "https://voxday.net/2017/03/07/build-your-own-platforms/",
  "scraped_at": "2025-12-18T07:04:51.223239",
  "title": "Build your own platforms",
  "date_display": "March 7, 2017",
  "date_iso": "2017-03-07T11:53:00+00:00",
  "date_from_url": "2017-03-07",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>Disqus no longer wishes to permit Occidental Dissent <a href=\"http://www.occidentaldissent.com/2017/03/07/disqus-censors-occidental-dissent/\">to be part of the discussion</a>:</p><blockquote><p> “Hi there,</p><p>We wanted to reach out to inform you that your site has been found to be in conflict with the values and terms of use of Disqus. Because of this, Disqus is unable to offer your site continued discussion services past the next 30 days.</p><p>Site activity or content that can result in the termination of discussion services include:<br> – Technical misuse of Disqus services: generating a large amount of nonsense threads, posts, or other objects.<br> – Featuring copyrighted material, which results in DMCA takedown requests.<br> – Adult-oriented sites which result in abuse complaints, users with inappropriate avatars or behavior visiting other Disqus sites in an unwelcome way, or are otherwise misusing Disqus services.<br> – Using Disqus on pages that contain hate speech, which violates Disqus’ Terms of Service and results in abuse complaints.</br></br></br></br></p><p>Additional information on these Basic Rules may be found here …”</p></blockquote><p>The Right would do well to adapt this friendly denial of service approach. The next time someone you don’t like, or of whom you don’t approve, wants you to bake a cake or whatever, just inform them that they are in conflict with your values and terms of use.</p><p>It’s particularly useful for breaking up with women. “Hey, I’m really sorry, but you’ve been found to be in conflict with my values. Because of this, I’m unable to offer you continued relationship services.”</p><p>There is no point crying about this attempt to shut down dissent and police both thoughts and speech. It’s what converged organizations do; they are more interested in your submission than your business. Pointing out their double standards and hypocrisy will accomplish nothing; they know they are hypocrites and they consider it to be a virtue.</p><p>So, build your own platform. That is the only way to avoid being techno-silenced.</p><p>Meanwhile, the Zman <a href=\"http://thezman.com/wordpress/?p=9777\">explains the worthlessness of the Establishment Right </a>and why the Alt-Right need spare no sympathy for pseudo-rightists like Charles Murray now that SJWs are attacking them as well as the actual Right.</p><blockquote><p> When Ann Coulter gets screamed at on campus, guys like Murray just shrug, because after all, Coulter deserves it. She’s a bad thinker.</p><p>That’s the thing with these guys. They don’t care about free speech or the open exchange of ideas. They care about their free speech and their access to the marketplace of ideas, which means staying in good with the Left. When a John Derbyshire is shut down by the campus lunatics, Conservative Inc is silent. To defend Derb or anyone else the Left has ruled out of bounds would risk their standing and that can never happen. The only core principle of these so-called conservatives is to remain on the good side of the Left.</p><p>This is not supposed to happen to good thinkers like Charles Murray, so it is a big deal to the people who pretend to be on our side. It also offers another opportunity for Conservative Inc. to pretend they are on the front lines fighting the Left. As I pointed out the other day, these guys are looking for a way to insert themselves at the front of the movement they claim to lead, at least until things get serious. You just know that one of them will be declaring himself the “respectable” version of the Dissident Right.</p><p>The incident is a good reminder of Official Right’s worthlessness. Murray’s piece reads like an apology. That’s because it is an apology. The boys and girls of Conservative Inc have always worked to position themselves at the edge of what the Left considers the respectable Right. Twenty years ago, the Bell Curve was right at the edge. Now, the Left considers it heresy and Murray knows it. It’s why he invested so much effort into advertising his opposition to Trump. It’s part of the long apology for his past heresy.</p><p>Murray is fond of the label Establishmentarians to describe his peers. While it is true that they are forever defending the establishment, they have no say in what is and what is not the “establishment.” That’s decided by the Left. Since that is always changing, most of these guys spend their days trying to justify the latest movement of the Overtone Window as conservative. It’s why a Jonah Goldberg was out declaring homosexuality a core conservative principle  It’s why a National Review is pro-tranny.</p><p>It’s also why the most important project of the Dissident Right is discrediting those palace guards of the Progressive establishment. Guys like Charles Murray are useful opponents for the Left and not just because they are always willing to take a dive. Like the tomato cans that fill up the fight card for a weak champion, Conservative Inc insulates the Establishment from a real challenge. Instead of having to face off against people who are willing to punch back, the Left likes these journeyman who are just happy for the payday.</p></blockquote><p>Of course, if you punch back, or even permit others to punch back, you will be deplatformed. The choice is always the same, no matter what the context. Fight back or submit.</p></div>",
  "content_text": "Disqus no longer wishes to permit Occidental Dissent\nto be part of the discussion\n:\n“Hi there,\nWe wanted to reach out to inform you that your site has been found to be in conflict with the values and terms of use of Disqus. Because of this, Disqus is unable to offer your site continued discussion services past the next 30 days.\nSite activity or content that can result in the termination of discussion services include:\n– Technical misuse of Disqus services: generating a large amount of nonsense threads, posts, or other objects.\n– Featuring copyrighted material, which results in DMCA takedown requests.\n– Adult-oriented sites which result in abuse complaints, users with inappropriate avatars or behavior visiting other Disqus sites in an unwelcome way, or are otherwise misusing Disqus services.\n– Using Disqus on pages that contain hate speech, which violates Disqus’ Terms of Service and results in abuse complaints.\nAdditional information on these Basic Rules may be found here …”\nThe Right would do well to adapt this friendly denial of service approach. The next time someone you don’t like, or of whom you don’t approve, wants you to bake a cake or whatever, just inform them that they are in conflict with your values and terms of use.\nIt’s particularly useful for breaking up with women. “Hey, I’m really sorry, but you’ve been found to be in conflict with my values. Because of this, I’m unable to offer you continued relationship services.”\nThere is no point crying about this attempt to shut down dissent and police both thoughts and speech. It’s what converged organizations do; they are more interested in your submission than your business. Pointing out their double standards and hypocrisy will accomplish nothing; they know they are hypocrites and they consider it to be a virtue.\nSo, build your own platform. That is the only way to avoid being techno-silenced.\nMeanwhile, the Zman\nexplains the worthlessness of the Establishment Right\nand why the Alt-Right need spare no sympathy for pseudo-rightists like Charles Murray now that SJWs are attacking them as well as the actual Right.\nWhen Ann Coulter gets screamed at on campus, guys like Murray just shrug, because after all, Coulter deserves it. She’s a bad thinker.\nThat’s the thing with these guys. They don’t care about free speech or the open exchange of ideas. They care about their free speech and their access to the marketplace of ideas, which means staying in good with the Left. When a John Derbyshire is shut down by the campus lunatics, Conservative Inc is silent. To defend Derb or anyone else the Left has ruled out of bounds would risk their standing and that can never happen. The only core principle of these so-called conservatives is to remain on the good side of the Left.\nThis is not supposed to happen to good thinkers like Charles Murray, so it is a big deal to the people who pretend to be on our side. It also offers another opportunity for Conservative Inc. to pretend they are on the front lines fighting the Left. As I pointed out the other day, these guys are looking for a way to insert themselves at the front of the movement they claim to lead, at least until things get serious. You just know that one of them will be declaring himself the “respectable” version of the Dissident Right.\nThe incident is a good reminder of Official Right’s worthlessness. Murray’s piece reads like an apology. That’s because it is an apology. The boys and girls of Conservative Inc have always worked to position themselves at the edge of what the Left considers the respectable Right. Twenty years ago, the Bell Curve was right at the edge. Now, the Left considers it heresy and Murray knows it. It’s why he invested so much effort into advertising his opposition to Trump. It’s part of the long apology for his past heresy.\nMurray is fond of the label Establishmentarians to describe his peers. While it is true that they are forever defending the establishment, they have no say in what is and what is not the “establishment.” That’s decided by the Left. Since that is always changing, most of these guys spend their days trying to justify the latest movement of the Overtone Window as conservative. It’s why a Jonah Goldberg was out declaring homosexuality a core conservative principle  It’s why a National Review is pro-tranny.\nIt’s also why the most important project of the Dissident Right is discrediting those palace guards of the Progressive establishment. Guys like Charles Murray are useful opponents for the Left and not just because they are always willing to take a dive. Like the tomato cans that fill up the fight card for a weak champion, Conservative Inc insulates the Establishment from a real challenge. Instead of having to face off against people who are willing to punch back, the Left likes these journeyman who are just happy for the payday.\nOf course, if you punch back, or even permit others to punch back, you will be deplatformed. The choice is always the same, no matter what the context. Fight back or submit.",
  "tags": [
    "#AltRight",
    "#AltTech"
  ],
  "categories": [],
  "sitemap_lastmod": "2017-03-07T11:53:00+00:00"
}