{
  "url": "https://voxday.net/2017/03/26/dear-oh-dear/",
  "scraped_at": "2025-12-18T07:07:45.982112",
  "title": "Dear, oh dear",
  "date_display": "March 26, 2017",
  "date_iso": "2017-03-26T18:00:00+00:00",
  "date_from_url": "2017-03-26",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><div class=\"separator\" style=\"clear: both; text-align: center;\"> <a href=\"https://1.bp.blogspot.com/-liDhvU294Zc/WNfu5unHc_I/AAAAAAAACZw/pDCKBz8aM3oezuZyYh_8gA5laR1fpyhJACLcB/s1600/Other_Items.jpg\" imageanchor=\"1\" style=\"margin-left: 1em; margin-right: 1em;\"><img border=\"0\" decoding=\"async\" fetchpriority=\"high\" height=\"298\" src=\"http://www.milobookclub.com/wp-content/uploads/2017/03/Other_Items.jpg\" width=\"400\"/></a></div><p>And you see, even if I wasn’t opposed to fake reviews, the following is why, in this case, they are not only wrong and deceptive, but redundant. There will be no shortage of legitimate one-star reviews by Scalzi fans who feel let down by his latest effort, particularly since it is the result of nearly two years of groundless hype.</p><blockquote><p> <b>Half a novel. Don’t bother.</b><br> March 25, 2017<br> Format: Kindle Edition|Verified Purchase</br></br></p><p>I’ve enjoyed Scalzi’s work enough that I pre-ordered this novel. Having read it (and enjoyed what there was of it) I feel profoundly cheated.</p><p>The problem has nothing to do with length — plenty of excellent complete novels have been written in fewer pages. Here though, critical elements of the story are left undeveloped at the end of the novel. I don’t want to spoil what there is of the plot, so suffice it to say that there are no meaningufl resolutions of conflicts facing any of the main characters except, I suppose, for the one who dies and another relatively minor villian. The resolution of the only interesting plot question that is revealed is blindingly obvious half way through the book. So no payoff there either.</p><p>I have no objection to setting a plot line that sets up a sequel. The series seems to be almost an imperative in sci-sfi publishing these days. But that’s quite different from a novel that basically ends with a “to be continued” on all fronts that anyone cares about.</p></blockquote><p>As for the fake good reviews, why, the more the better! The more people who fall for the deception and buy the shlockfest, the more disgusted Scalzi-haters there will be. Remember, even I once fell for “the new Heinlein” hype too.</p><p>The problem Tor Books faces is simple. Sooner or later, the truth will out. And the truth is that John Scalzi is a mediocre and derivative midlister who has only reached “major” status in science fiction as a result of his own deceptive self-marketing combined with the extraordinary marketing efforts made on his behalf by Patrick Nielsen Hayden. Scalzi has a legitimate fan base, but it is much smaller than Larry Correia’s; imagine how many books Larry would sell if he was being featured in Audible advertising, having fake New York Times bestseller slots arranged for him, and talked up by Tor-published contributors at the <i>Guardian</i>, then featured in puff pieces in the <i>New York Times</i>, and NPR.</p><p><a href=\"http://www.isfdb.org/wiki/images/1/11/THRWNTBWR1991.jpg\" imageanchor=\"1\" style=\"clear: right; float: right; margin-bottom: 1em; margin-left: 1em;\"><noscript><img border=\"0\" decoding=\"async\" height=\"320\" src=\"http://www.isfdb.org/wiki/images/1/11/THRWNTBWR1991.jpg\" width=\"198\"/></noscript><img border=\"0\" class=\"lazyload\" data-src=\"http://www.isfdb.org/wiki/images/1/11/THRWNTBWR1991.jpg\" decoding=\"async\" height=\"320\" src=\"data:image/svg+xml,%3Csvg%20xmlns=%22http://www.w3.org/2000/svg%22%20viewBox=%220%200%20198%20320%22%3E%3C/svg%3E\" width=\"198\"/></a>Pity poor Brandon Sanderson, who actually is a major SF author and outsells Scalzi by a significant margin, but doesn’t get one-tenth the attention or support from his publisher that Scalzi does. That’s the price of working with an SJW-converged publisher. They will always put their political agenda ahead of their professional responsibilities.</p><p>Anyhow, I’d assumed Scalzi would need to “restructure” his contract after delivering the fourth book. In light of this disaster, he’s probably going to have to do so after he fails to deliver the second book on time and Macmillan finally discovers that PNH has sold them a midlister in major’s clothing.</p><p>In any event, Johan Kalsi and I would like to thank you all for making his debut with Castalia House such an unforgettable one. ARE YOU NOT ENTERTAINED? Mr. Kalsi is already hard at work on the sequel to <i><b><a href=\"http://amzn.to/2mdtblw\">Corrosion</a></b></i>, which will be entitled <i>Corrosion and Empire,</i> and eagerly awaits the announcement from Tor Books concerning the direction of his next new series. And I have to say, perhaps the most amusing thing in all this, to me, is the angry, upset SF-SJWs who are unaware that this little stunt is literally nothing new in the science fiction world; it should hardly surprise anyone that the current publisher of <i>There Will Be War </i>would be aware of the various, perfectly legitimate, marketing possibilities in this regard.</p><div style=\"text-align: left;\"> There is more at Castalia House. Including, but not limited, to this video commentary.</div><div style=\"text-align: center;\"></div><div style=\"text-align: center;\"> <iframe allowfullscreen=\"\" frameborder=\"0\" height=\"284\" src=\"https://www.youtube.com/embed/HfAo6TgVl-0\" width=\"512\"></iframe></div></div>",
  "content_text": "And you see, even if I wasn’t opposed to fake reviews, the following is why, in this case, they are not only wrong and deceptive, but redundant. There will be no shortage of legitimate one-star reviews by Scalzi fans who feel let down by his latest effort, particularly since it is the result of nearly two years of groundless hype.\nHalf a novel. Don’t bother.\nMarch 25, 2017\nFormat: Kindle Edition|Verified Purchase\nI’ve enjoyed Scalzi’s work enough that I pre-ordered this novel. Having read it (and enjoyed what there was of it) I feel profoundly cheated.\nThe problem has nothing to do with length — plenty of excellent complete novels have been written in fewer pages. Here though, critical elements of the story are left undeveloped at the end of the novel. I don’t want to spoil what there is of the plot, so suffice it to say that there are no meaningufl resolutions of conflicts facing any of the main characters except, I suppose, for the one who dies and another relatively minor villian. The resolution of the only interesting plot question that is revealed is blindingly obvious half way through the book. So no payoff there either.\nI have no objection to setting a plot line that sets up a sequel. The series seems to be almost an imperative in sci-sfi publishing these days. But that’s quite different from a novel that basically ends with a “to be continued” on all fronts that anyone cares about.\nAs for the fake good reviews, why, the more the better! The more people who fall for the deception and buy the shlockfest, the more disgusted Scalzi-haters there will be. Remember, even I once fell for “the new Heinlein” hype too.\nThe problem Tor Books faces is simple. Sooner or later, the truth will out. And the truth is that John Scalzi is a mediocre and derivative midlister who has only reached “major” status in science fiction as a result of his own deceptive self-marketing combined with the extraordinary marketing efforts made on his behalf by Patrick Nielsen Hayden. Scalzi has a legitimate fan base, but it is much smaller than Larry Correia’s; imagine how many books Larry would sell if he was being featured in Audible advertising, having fake New York Times bestseller slots arranged for him, and talked up by Tor-published contributors at the\nGuardian\n, then featured in puff pieces in the\nNew York Times\n, and NPR.\nPity poor Brandon Sanderson, who actually is a major SF author and outsells Scalzi by a significant margin, but doesn’t get one-tenth the attention or support from his publisher that Scalzi does. That’s the price of working with an SJW-converged publisher. They will always put their political agenda ahead of their professional responsibilities.\nAnyhow, I’d assumed Scalzi would need to “restructure” his contract after delivering the fourth book. In light of this disaster, he’s probably going to have to do so after he fails to deliver the second book on time and Macmillan finally discovers that PNH has sold them a midlister in major’s clothing.\nIn any event, Johan Kalsi and I would like to thank you all for making his debut with Castalia House such an unforgettable one. ARE YOU NOT ENTERTAINED? Mr. Kalsi is already hard at work on the sequel to\nCorrosion\n, which will be entitled\nCorrosion and Empire,\nand eagerly awaits the announcement from Tor Books concerning the direction of his next new series. And I have to say, perhaps the most amusing thing in all this, to me, is the angry, upset SF-SJWs who are unaware that this little stunt is literally nothing new in the science fiction world; it should hardly surprise anyone that the current publisher of\nThere Will Be War\nwould be aware of the various, perfectly legitimate, marketing possibilities in this regard.\nThere is more at Castalia House. Including, but not limited, to this video commentary.",
  "tags": [
    "books",
    "Castalia House",
    "McRapey"
  ],
  "categories": [],
  "sitemap_lastmod": "2017-03-26T17:00:00+00:00"
}