{
  "url": "https://voxday.net/2017/03/01/guilt-is-sjw-engine/",
  "scraped_at": "2025-12-18T07:04:06.185452",
  "title": "Guilt is the SJW engine",
  "date_display": "March 1, 2017",
  "date_iso": "2017-03-01T16:06:00+00:00",
  "date_from_url": "2017-03-01",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><div class=\"tr_bq\"> Two psychologists have determined that <a href=\"https://reason.com/blog/2017/03/01/moral-outrage-is-self-serving\">moral outrage is self-serving</a> and is a means of attempting to assuage guilty feelings:</div><blockquote><p> For each study, a new group of respondents (solicited through Amazon’s Mechanical Turk program) were presented with a fabricated news article about either labor exploitation in developing countries or climate change. For studies using the climate-change article, half of participants read that the biggest driver of man-made climate change was American consumers, while the others read that Chinese consumers were most to blame. With the labor exploitation article, participants in one study were primed to think about small ways in which they might be contributing to child labor, labor trafficking, and poor working conditions in “sweatshops”; in another, they learned about poor conditions in factories making Apple products and the company’s failure to stop this.<br>After exposure to their respective articles, study participants were given a series of short surveys and exercises to assess their levels of things like personal guilt, collective guilt, anger at third parties (“multinational corporations,” “international oil companies”) involved in the environmental destruction/labor exploitation, desire to see someone punished, and belief in personal moral standing, as well as baseline beliefs about the topics in question and positive or negative affect. Here’s the gist of Rothschild and Keefer’s findings:</br></p><ol><li><b>Triggering feelings of personal culpability for a problem increases moral outrage at a third-party target.</b> For instance, respondents who read that Americans are the biggest consumer drivers of climate change “reported significantly higher levels of outrage at the environmental destruction” caused by “multinational oil corporations” than did the respondents who read that Chinese consumers were most to blame.</li></ol><ol><li><b>The more guilt over one’s own potential complicity, the more desire “to punish a third-party through increased moral outrage at that target.”</b> For instance, participants in study one read about sweatshop labor exploitation, rated their own identification with common consumer practices that allegedly contribute, then rated their level of anger at “international corporations” who perpetuate the exploitative system and desire to punish these entities. The results showed that increased guilt “predicted increased punitiveness toward a third-party harm-doer due to increased moral outrage at the target.”</li></ol><ol><li><b>Having the opportunity to express outrage at a third-party decreased guilt in people threatened through “ingroup immorality.”</b> Study participants who read that Americans were the biggest drivers of man-made climate change showed significantly higher guilt scores than those who read the blame-China article when they weren’t given an opportunity to express anger at or assign blame to a third-party. However, having this opportunity to rage against hypothetical corporations led respondents who read the blame-America story to express significantly lower levels of guilt than the China group. Respondents who read that Chinese consumers were to blame had similar guilt levels regardless of whether they had the opportunity to express moral outrage.</li></ol><ol><li><b>“The opportunity to express moral outrage at corporate harm-doers” inflated participants perception of personal morality</b>. Asked to rate their own moral character after reading the article blaming Americans for climate change, respondents saw themselves as having “significantly lower personal moral character” than those who read the blame-China article—that is, when they weren’t given an out in the form of third-party blame. Respondents in the America-shaming group wound up with similar levels of moral pride as the China control group when they were first asked to rate the level of blame deserved by various corporate actors and their personal level of anger at these groups. In both this and a similar study using the labor-exploitation article, “the opportunity to express moral outrage at corporate harm-doing (vs. not) led to significantly higher personal moral character ratings,” the authors found.</li></ol><ol><li><b>Guilt-induced moral outrage was lessened when people could assert their goodness through alternative means, “even in an unrelated context.” </b>Study five used the labor exploitation article, asked all participants questions to assess their level of “collective guilt” (i.e., “feelings of guilt for the harm caused by one’s own group”) about the situation, then gave them an article about horrific conditions at Apple product factories. After that, a control group was given a neutral exercise, while others were asked to briefly describe what made them a good and decent person; both exercises were followed by an assessment of empathy and moral outrage. The researchers found that for those with high collective-guilt levels, having the chance to assert their moral goodness first led to less moral outrage at corporations. But when the high-collective-guilt folks were given the neutral exercise and couldn’t assert they were good people, they wound up with more moral outrage at third parties. Meanwhile, for those low in collective guilt, affirming their own moral goodness first led to marginally more moral outrage at corporations.</li></ol><p>These findings held true even accounting for things such as respondents political ideology, general affect, and background feelings about the issues.</p></blockquote><p>Instead of repenting or going to confession, SJWs act out about their moral outrage. Which, of course, explains their quasi-religious fanaticism. As well as all the white people waxing outraged about “white privilege” and genuflecting before “Black Lives Matter”.</p></div>",
  "content_text": "Two psychologists have determined that\nmoral outrage is self-serving\nand is a means of attempting to assuage guilty feelings:\nFor each study, a new group of respondents (solicited through Amazon’s Mechanical Turk program) were presented with a fabricated news article about either labor exploitation in developing countries or climate change. For studies using the climate-change article, half of participants read that the biggest driver of man-made climate change was American consumers, while the others read that Chinese consumers were most to blame. With the labor exploitation article, participants in one study were primed to think about small ways in which they might be contributing to child labor, labor trafficking, and poor working conditions in “sweatshops”; in another, they learned about poor conditions in factories making Apple products and the company’s failure to stop this.\nAfter exposure to their respective articles, study participants were given a series of short surveys and exercises to assess their levels of things like personal guilt, collective guilt, anger at third parties (“multinational corporations,” “international oil companies”) involved in the environmental destruction/labor exploitation, desire to see someone punished, and belief in personal moral standing, as well as baseline beliefs about the topics in question and positive or negative affect. Here’s the gist of Rothschild and Keefer’s findings:\nTriggering feelings of personal culpability for a problem increases moral outrage at a third-party target.\nFor instance, respondents who read that Americans are the biggest consumer drivers of climate change “reported significantly higher levels of outrage at the environmental destruction” caused by “multinational oil corporations” than did the respondents who read that Chinese consumers were most to blame.\nThe more guilt over one’s own potential complicity, the more desire “to punish a third-party through increased moral outrage at that target.”\nFor instance, participants in study one read about sweatshop labor exploitation, rated their own identification with common consumer practices that allegedly contribute, then rated their level of anger at “international corporations” who perpetuate the exploitative system and desire to punish these entities. The results showed that increased guilt “predicted increased punitiveness toward a third-party harm-doer due to increased moral outrage at the target.”\nHaving the opportunity to express outrage at a third-party decreased guilt in people threatened through “ingroup immorality.”\nStudy participants who read that Americans were the biggest drivers of man-made climate change showed significantly higher guilt scores than those who read the blame-China article when they weren’t given an opportunity to express anger at or assign blame to a third-party. However, having this opportunity to rage against hypothetical corporations led respondents who read the blame-America story to express significantly lower levels of guilt than the China group. Respondents who read that Chinese consumers were to blame had similar guilt levels regardless of whether they had the opportunity to express moral outrage.\n“The opportunity to express moral outrage at corporate harm-doers” inflated participants perception of personal morality\n. Asked to rate their own moral character after reading the article blaming Americans for climate change, respondents saw themselves as having “significantly lower personal moral character” than those who read the blame-China article—that is, when they weren’t given an out in the form of third-party blame. Respondents in the America-shaming group wound up with similar levels of moral pride as the China control group when they were first asked to rate the level of blame deserved by various corporate actors and their personal level of anger at these groups. In both this and a similar study using the labor-exploitation article, “the opportunity to express moral outrage at corporate harm-doing (vs. not) led to significantly higher personal moral character ratings,” the authors found.\nGuilt-induced moral outrage was lessened when people could assert their goodness through alternative means, “even in an unrelated context.”\nStudy five used the labor exploitation article, asked all participants questions to assess their level of “collective guilt” (i.e., “feelings of guilt for the harm caused by one’s own group”) about the situation, then gave them an article about horrific conditions at Apple product factories. After that, a control group was given a neutral exercise, while others were asked to briefly describe what made them a good and decent person; both exercises were followed by an assessment of empathy and moral outrage. The researchers found that for those with high collective-guilt levels, having the chance to assert their moral goodness first led to less moral outrage at corporations. But when the high-collective-guilt folks were given the neutral exercise and couldn’t assert they were good people, they wound up with more moral outrage at third parties. Meanwhile, for those low in collective guilt, affirming their own moral goodness first led to marginally more moral outrage at corporations.\nThese findings held true even accounting for things such as respondents political ideology, general affect, and background feelings about the issues.\nInstead of repenting or going to confession, SJWs act out about their moral outrage. Which, of course, explains their quasi-religious fanaticism. As well as all the white people waxing outraged about “white privilege” and genuflecting before “Black Lives Matter”.",
  "tags": [
    "science",
    "SJW"
  ],
  "categories": [],
  "sitemap_lastmod": "2017-03-01T16:06:00+00:00"
}