{
  "url": "https://voxday.net/2017/03/13/hitler-did-nothing-wrong/",
  "scraped_at": "2025-12-18T07:05:36.058976",
  "title": "Hitler did nothing wrong",
  "date_display": "March 13, 2017",
  "date_iso": "2017-03-13T01:13:00+00:00",
  "date_from_url": "2017-03-13",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>In tonight’s Darkstream, I addressed <a href=\"https://www.periscope.tv/voxday/1jMJgYoYmZkKL\">one of the more historically retarded statements we hear</a> from time to time from trolls as well as the sincerely ignorant.</p><p>It’s hard to overestimate the stupidity of the Alt-White, which frequently confuses German supremacism for trans-white nationalism and lionizes a successful rhetorician who failed to learn from either his early successes or his subsequent failures, and in doing so managed to transform Germany from a likely global superpower into a conquered US satrapy for 70 years and counting.</p><p>The list of things that Hitler did wrong is considerably longer than the list of things he did right. I mean, successfully bluffing the French and British governments, and stabbing the Soviets in the back first, hardly makes up for a) launching a two-front war by b) invading Russia, then c) unnecessarily declaring war on the most powerful industrial nation on Earth. Hitler wasn’t merely a complete failure, he was a <i>guaranteed </i>failure before the end of 1941.</p><p>I always find it amusing when people call me a Nazi. I have considerably more contempt for Nazis than the most sincere Nazi-hater. Those who hate the Nazis fear them and consider them to be evil and scary villains. I don’t fear them and I consider them to be inept, ignorant losers. I’m not counter-signaling here; I don’t counter-signal Communists or people with Down’s Syndrome either.</p><p>And for those who try to claim that it’s just rhetoric, yes, I am aware of its use in that capacity. The point is that the best and most effective rhetoric is rooted in truth, not ignorance and buffoonery.</p></div>",
  "content_text": "In tonight’s Darkstream, I addressed\none of the more historically retarded statements we hear\nfrom time to time from trolls as well as the sincerely ignorant.\nIt’s hard to overestimate the stupidity of the Alt-White, which frequently confuses German supremacism for trans-white nationalism and lionizes a successful rhetorician who failed to learn from either his early successes or his subsequent failures, and in doing so managed to transform Germany from a likely global superpower into a conquered US satrapy for 70 years and counting.\nThe list of things that Hitler did wrong is considerably longer than the list of things he did right. I mean, successfully bluffing the French and British governments, and stabbing the Soviets in the back first, hardly makes up for a) launching a two-front war by b) invading Russia, then c) unnecessarily declaring war on the most powerful industrial nation on Earth. Hitler wasn’t merely a complete failure, he was a\nguaranteed\nfailure before the end of 1941.\nI always find it amusing when people call me a Nazi. I have considerably more contempt for Nazis than the most sincere Nazi-hater. Those who hate the Nazis fear them and consider them to be evil and scary villains. I don’t fear them and I consider them to be inept, ignorant losers. I’m not counter-signaling here; I don’t counter-signal Communists or people with Down’s Syndrome either.\nAnd for those who try to claim that it’s just rhetoric, yes, I am aware of its use in that capacity. The point is that the best and most effective rhetoric is rooted in truth, not ignorance and buffoonery.",
  "tags": [
    "#AltRight",
    "Darkstream",
    "history"
  ],
  "categories": [],
  "sitemap_lastmod": "2017-03-13T01:13:00+00:00"
}