{
  "url": "https://voxday.net/2017/03/04/i-saw-it-coming/",
  "scraped_at": "2025-12-18T07:04:29.567641",
  "title": "“I saw it coming”",
  "date_display": "March 4, 2017",
  "date_iso": "2017-03-04T11:07:00+00:00",
  "date_from_url": "2017-03-04",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><div style=\"text-align: center;\"> <iframe allowfullscreen=\"\" frameborder=\"0\" height=\"284\" src=\"https://www.youtube.com/embed/F3KsTDTJLzA\" width=\"512\"></iframe></div><p>Pewdiepie correctly understands that it is his Internet audience that matters, not the media, and not the gatekeepers. He provides a powerful example for Milo, and for every other independent thinker who is not going to be lifted up and protected by the SJW-amenable authorities.</p><p>We don’t need the Wall Street Journal. We don’t need Disney. We don’t need the Media Corpocracy or <a href=\"http://static2.businessinsider.com/image/4fd9ee1e6bb3f7af5700000a/media-infographic.jpg\">the Six Corpocrats</a> who own 90 percent of it.</p><p>We are here to disrupt them and replace them, not to join them and work for them as creative serfs.</p><p>The coordinated corpocratic attack on Pewdiepie is a high-profile object lesson straight out of <a href=\"http://amzn.to/1sBYA10\">SJWAL</a>: no matter who you are, no matter how big you are, no matter how many fans and followers you have, if you threaten the Narrative in <i>any </i>way, even inadvertently, you will be attacked, discredited, disqualified, and, if possible, destroyed.</p><p>Don’t think you won’t be. Stand up and fight or submit and serve. Those are your choices.</p></div>",
  "content_text": "Pewdiepie correctly understands that it is his Internet audience that matters, not the media, and not the gatekeepers. He provides a powerful example for Milo, and for every other independent thinker who is not going to be lifted up and protected by the SJW-amenable authorities.\nWe don’t need the Wall Street Journal. We don’t need Disney. We don’t need the Media Corpocracy or\nthe Six Corpocrats\nwho own 90 percent of it.\nWe are here to disrupt them and replace them, not to join them and work for them as creative serfs.\nThe coordinated corpocratic attack on Pewdiepie is a high-profile object lesson straight out of\nSJWAL\n: no matter who you are, no matter how big you are, no matter how many fans and followers you have, if you threaten the Narrative in\nany\nway, even inadvertently, you will be attacked, discredited, disqualified, and, if possible, destroyed.\nDon’t think you won’t be. Stand up and fight or submit and serve. Those are your choices.",
  "tags": [
    "#AltTech",
    "media"
  ],
  "categories": [],
  "sitemap_lastmod": "2017-03-04T11:07:00+00:00"
}