{
  "url": "https://voxday.net/2017/03/23/naughty-naughty/",
  "scraped_at": "2025-12-18T07:07:18.266265",
  "title": "Quality customer service",
  "date_display": "March 23, 2017",
  "date_iso": "2017-03-23T13:21:00+00:00",
  "date_from_url": "2017-03-23",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>Making a list, checking it twice… and then we send in our report to Amazon requesting a formal investigation of the concerted, ongoing, three-year attempt to manipulate reviews of books published by Castalia House. You see, getting Mr. Kalsi’s book back up repeatedly wasn’t the only thing I discussed with Amazon, as they are now increasingly aware that there are serious shenanigans concerning policy-violating attacks on Castalia House and other publishers.</p><p><i>We understand that you may have manipulated product reviews…. Amazon tries to maintain customer trust and provide the best possible shopping experience. For this reason, Amazon investigates if it learns that sellers, vendors, or others have attempted to manipulate reviews. </i></p><p>We’ve compiled a comprehensive list of well over 250 accounts dating back to 2014, many complete with names and addresses. For example, 23 of the 28 one-star reviews of SJWAL are fakes. 5 of the 5 one-star reviews of Cuckservative are fakes. 5 of the 9 one-star reviews of ATOB are fakes. 2 of the 5 one-star reviews of Somewhither are fakes. There are already 14 fake reviews of Corrosion.</p><p>And this doesn’t even begin to get into the fake reviews on Goodreads, which Amazon owns. Anyhow, if you’d like to add your account to the list, please feel free to post a fake review on a Castalia House book today.</p><p>Interestingly enough, many of the recent fake reviewers are from Massachusetts. But we also have Urbana and Chicago, Arlington, and even London. And one from Ohio. Hmmmm.</p><p>This was amusing. <a href=\"http://file770.com/?p=33993#comment-583653\">From File 770</a>:</p><blockquote class=\"tr_bq\"><p> rochrist on March 22, 2017 at 10:40 pm said:<br> I made the mistake of making a snarking comment in one of the fake reviews. The fellow immediately tracked me down in RL. He assures me though that it will be Vox himself I hear from. He is just a dutiful minion.</br></p></blockquote><p>It’s just good customer service to get in touch with unhappy customers. We would be <i>severely </i>derelict in our duties were we to fail to get in touch with unsatisfied customers. Castalia House is committed to customer service, and those who have had trouble downloading or reading our books can testify that we always attempt to resolve their problems in a timely manner. I certainly appreciate the efforts of the public to help Castalia continue to provide such excellent customer service.</p><p>UPDATE: Strange. One of our dedicated, albeit self-appointed, customer service representatives called a dissatisfied customer this morning. He seemed very upset to be receiving such excellent customer service, claimed he was not a customer, and insisted that he had neither purchased nor read the book despite having posted a Customer Review. Sadly, he hung up before the helpful service representative could ascertain the precise nature of his dissatisfaction with our product.</p><p>It seems he was not happy about being recorded for quality control, particularly when he was informed that he was living in a one-party consent state in which his permission was not required.</p><p>UPDATE: Despite the best efforts of SJWs to inhibit sales by frantically posting fake reviews, the Amazon rank continues to climb. It’s like they’ve never heard of the Streisand Effect. Now it’s up to 666. How very, indeed.</p><p>UPDATE: Meanwhile, the fake reviewers should probably pace themselves. <i><b><a href=\"http://amzn.to/2nKW9eL\">Corrosion </a></b></i>will be available on iBooks, Barnes &amp; Noble, and other platforms soon.</p></div>",
  "content_text": "Making a list, checking it twice… and then we send in our report to Amazon requesting a formal investigation of the concerted, ongoing, three-year attempt to manipulate reviews of books published by Castalia House. You see, getting Mr. Kalsi’s book back up repeatedly wasn’t the only thing I discussed with Amazon, as they are now increasingly aware that there are serious shenanigans concerning policy-violating attacks on Castalia House and other publishers.\nWe understand that you may have manipulated product reviews…. Amazon tries to maintain customer trust and provide the best possible shopping experience. For this reason, Amazon investigates if it learns that sellers, vendors, or others have attempted to manipulate reviews.\nWe’ve compiled a comprehensive list of well over 250 accounts dating back to 2014, many complete with names and addresses. For example, 23 of the 28 one-star reviews of SJWAL are fakes. 5 of the 5 one-star reviews of Cuckservative are fakes. 5 of the 9 one-star reviews of ATOB are fakes. 2 of the 5 one-star reviews of Somewhither are fakes. There are already 14 fake reviews of Corrosion.\nAnd this doesn’t even begin to get into the fake reviews on Goodreads, which Amazon owns. Anyhow, if you’d like to add your account to the list, please feel free to post a fake review on a Castalia House book today.\nInterestingly enough, many of the recent fake reviewers are from Massachusetts. But we also have Urbana and Chicago, Arlington, and even London. And one from Ohio. Hmmmm.\nThis was amusing.\nFrom File 770\n:\nrochrist on March 22, 2017 at 10:40 pm said:\nI made the mistake of making a snarking comment in one of the fake reviews. The fellow immediately tracked me down in RL. He assures me though that it will be Vox himself I hear from. He is just a dutiful minion.\nIt’s just good customer service to get in touch with unhappy customers. We would be\nseverely\nderelict in our duties were we to fail to get in touch with unsatisfied customers. Castalia House is committed to customer service, and those who have had trouble downloading or reading our books can testify that we always attempt to resolve their problems in a timely manner. I certainly appreciate the efforts of the public to help Castalia continue to provide such excellent customer service.\nUPDATE: Strange. One of our dedicated, albeit self-appointed, customer service representatives called a dissatisfied customer this morning. He seemed very upset to be receiving such excellent customer service, claimed he was not a customer, and insisted that he had neither purchased nor read the book despite having posted a Customer Review. Sadly, he hung up before the helpful service representative could ascertain the precise nature of his dissatisfaction with our product.\nIt seems he was not happy about being recorded for quality control, particularly when he was informed that he was living in a one-party consent state in which his permission was not required.\nUPDATE: Despite the best efforts of SJWs to inhibit sales by frantically posting fake reviews, the Amazon rank continues to climb. It’s like they’ve never heard of the Streisand Effect. Now it’s up to 666. How very, indeed.\nUPDATE: Meanwhile, the fake reviewers should probably pace themselves.\nCorrosion\nwill be available on iBooks, Barnes & Noble, and other platforms soon.",
  "tags": [
    "Castalia House",
    "SJW"
  ],
  "categories": [],
  "sitemap_lastmod": "2017-03-23T13:21:00+00:00"
}