{
  "url": "https://voxday.net/2017/03/08/news-is-conspiracy-theory-15/",
  "scraped_at": "2025-12-18T07:05:00.373448",
  "title": "News is Conspiracy Theory +15",
  "date_display": "March 8, 2017",
  "date_iso": "2017-03-08T10:33:00+00:00",
  "date_from_url": "2017-03-08",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>Spacebunny joked yesterday that she was old enough to remember when Echelon was conspiracy theory. It has now become readily apparent that what used to be derided as “conspiracy theory” is nothing more than the news, 15 years early. Consider a few historical references from this blog.</p><p>The Patriot Act and the IAO are constitutional abominations. The War on Terror is being used exactly in the same way that the War on Drugs has been used for decades – to provide the federal government with the ability to infringe upon the liberty of the American people. Your house can get stormed with a no-knock raid if an anonymous telephone call accuses you of the wrong sort of botany project, and soon the same thing will be the case if you happen to visit the wrong web sites or use dangerous terminology in your emails. Echelon is still out there transcribing American faxes, emails and telephone calls, after all.<br> – <a href=\"http://www.milobookclub.com/2003/10/22/missing-poin-2/\">October 22, 2003</a></br></p><p>The US government sees fit to eavesdrop on everyone inside and outside the United States with its Echelon system, but unlike a parent trying to raise a child, that level of oversight is necessary. Terrorists, don’t you know. Why, without it, we wouldn’t have caught bin Laden and prevented the 9/11 attacks….<br> – <a href=\"http://www.milobookclub.com/2004/12/10/this-is-why-you-cant-use-phone-dear/\">December 10, 2004</a></br></p><p><i>Arrived too late, the act has been done.</i><br> <i>The wind was against them, letters intercepted on their way.</i><br> <i>The conspirators were nine of a party.</i><br> <i>By Caesar the Younger shall these enterprises be undertaken.</i></br></br></br></p><p>Echelon and the Bush administration’s spying on Americans will be defended by the Supreme Court, should it ever get that far. Most likely, they’ll do so by refusing to hear a challenge against it.<br> – <a href=\"http://www.milobookclub.com/2006/01/03/quatrainial-explanation/\">January 3, 2006</a></br></p><p>CIALeaks proves, once and for all, that Edward Snowden is one of the greatest heroes in American history. One hopes that the God-Emperor will recognize this and offer him a pardon; it is the CIA that is far more of an enemy to the President and the American people than the Russians these days.</p><p>Even better, President Trump should appoint Snowden to be the head of the NSA and charge him with turning it into a government agency that is entirely compatible with the U.S. Constitution and rule by the people. #SnowdenForNSA</p><div style=\"text-align: center;\"> <a href=\"http://amzn.to/2mBFXI3\">This book is a worthy successor to the ideas brought to us by both Lovecraft and Doyle</a></div></div>",
  "content_text": "Spacebunny joked yesterday that she was old enough to remember when Echelon was conspiracy theory. It has now become readily apparent that what used to be derided as “conspiracy theory” is nothing more than the news, 15 years early. Consider a few historical references from this blog.\nThe Patriot Act and the IAO are constitutional abominations. The War on Terror is being used exactly in the same way that the War on Drugs has been used for decades – to provide the federal government with the ability to infringe upon the liberty of the American people. Your house can get stormed with a no-knock raid if an anonymous telephone call accuses you of the wrong sort of botany project, and soon the same thing will be the case if you happen to visit the wrong web sites or use dangerous terminology in your emails. Echelon is still out there transcribing American faxes, emails and telephone calls, after all.\n–\nOctober 22, 2003\nThe US government sees fit to eavesdrop on everyone inside and outside the United States with its Echelon system, but unlike a parent trying to raise a child, that level of oversight is necessary. Terrorists, don’t you know. Why, without it, we wouldn’t have caught bin Laden and prevented the 9/11 attacks….\n–\nDecember 10, 2004\nArrived too late, the act has been done.\nThe wind was against them, letters intercepted on their way.\nThe conspirators were nine of a party.\nBy Caesar the Younger shall these enterprises be undertaken.\nEchelon and the Bush administration’s spying on Americans will be defended by the Supreme Court, should it ever get that far. Most likely, they’ll do so by refusing to hear a challenge against it.\n–\nJanuary 3, 2006\nCIALeaks proves, once and for all, that Edward Snowden is one of the greatest heroes in American history. One hopes that the God-Emperor will recognize this and offer him a pardon; it is the CIA that is far more of an enemy to the President and the American people than the Russians these days.\nEven better, President Trump should appoint Snowden to be the head of the NSA and charge him with turning it into a government agency that is entirely compatible with the U.S. Constitution and rule by the people. #SnowdenForNSA\nThis book is a worthy successor to the ideas brought to us by both Lovecraft and Doyle",
  "tags": [
    "conspiracy",
    "technology"
  ],
  "categories": [],
  "sitemap_lastmod": "2017-03-08T10:33:00+00:00"
}