{
  "url": "https://voxday.net/2017/03/24/portrait-of-dark-lord/",
  "scraped_at": "2025-12-18T07:07:26.223550",
  "title": "Portrait of the Dark Lord",
  "date_display": "March 24, 2017",
  "date_iso": "2017-03-24T09:25:00+00:00",
  "date_from_url": "2017-03-24",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p><i>Now, this is the exact opposite of the fake reviews with which SJWs are littering Amazon. Daniel F. reviews <a href=\"http://amzn.to/2l6XqHo\">The Collected Columns Vol. 1, Innocence &amp; Intellect, 2001-2005</a>, now available in a 764-page <a href=\"http://amzn.to/2nuDFxV\">hardcover</a> edition.</i><br> <i><br/></i><br> <br> <b><a href=\"https://www.amazon.com/gp/customer-reviews/R1KK82HRWFMO1R/ref=cm_cr_arp_d_rvw_ttl?ie=UTF8&amp;ASIN=B01N9Z4TXZ\">PORTRAIT OF THE DARK LORD AS A YOUNG MAN</a></b></br></br></br></p><p>Vox Day is a prolific author who, over the course of two decades, has covered an impressive range of topics and genres. He has been a video game reviewer, a syndicated columnist, a science fiction and fantasy novelist, the author of major works on religious and economic matters, and of course, a prominent blogger.</p><p>Over the past two years, he has also firmly established himself as perhaps the most important analyst, taxonomist, synthesizer and theorist of political philosophy writing today. Consider: In the span of little more than a year, Vox wrote and published:</p><p>“<a href=\"http://amzn.to/1sBYA10\">SJWs Always Lie</a>”, an indispensable analysis of, and handbook for dealing with, the totalitarian thought-police who comprise the most dangerous current of Leftism today;</p><p>“<i><a href=\"http://amzn.to/1Wnka63\">Cuckservative</a></i>” (co-authored with John Red Eagle), an even more valuable polemical case against modern day American conservatism that exposed Conservative Inc. as feckless enablers of progressivism; and</p><p>“<a href=\"http://www.milobookclub.com/2016/08/24/what-alt-right-is/\">The 16 Points of the Alternative Right</a>”, a taxonomy and description of what is undoubtedly the most salient political current today, and the only movement that can resist the anti-civilizational tendencies and consequences of all mainstream political thought, left and “right”.</p><p>With all of these works, Vox was ahead of the curve, both anticipating and shaping many of the nascent trends playing out today. Vox coined, or gave greater currency to, a number of concepts and terms that are crucial for understanding and discussing contemporary politics: SJW, cuckservative, Alt Right, entryism, convergence, Magic Dirt, churchian.</p><p>With the collection under review, we are now asked to reflect upon Vox’s judgment and analysis in columns he penned a decade and a half ago. There are at least three reasons why someone would want to read this collection: (1) to understand the intellectual development and evolution of an important thinker; (2) to reflect on events starting from 9/11 and see how one writer’s contemporaneous reactions stand up over time; and (3) for the philosophical and literary value inherent in the writing itself.</p><p>(1) In one of the columns collected here, Vox described himself as “a radical pro-life Austrian-school neo-capitalist Jacksonian techno-libertarian Southern Baptist Christian”. It is against that definition that we can see how his thinking has evolved over the years. For this reader, the changes in Vox’s worldview make sense in light of events and the learning he has done. To quote one of Vox’s economic nemeses, John Maynard Keynes: “When the facts change, I change my mind. What do you do, sir?”</p><p>I was struck by how _little_ Vox has needed to change his mind: he remains consistent on a number of key issues, which prefigure his thinking in SJWAL, Cuckservative and the 16 Points:</p><p>On the thought police: “The solution for successfully defeating them is not to retreat and apologize, but to confront them and turn up the heat instead.”</p><p>On mainstream politics: “An analysis of the near-identical governing practices of the two parties in our two-party system would require a book—not a column—but it would show that the two are, for all practical purposes, effectively one.”</p><p>On mainstream conservatism: “Conservative proponents of government, unfortunately, have increasingly tended to mutate into the pale echoes of their socialist (liberal) counterparts.”</p><p>On globalism: “If humanity’s past record is a reasonable guide, globalism may represent the single deadliest threat to mankind in our long, murderous history.”</p><p>On Churchians: “Once a church makes the fatal decision to befriend the world and seek its approval instead of that of the God whom it is called to serve, its fate is sealed.”</p><p>In what ways, then, has Vox’s thought developed and changed? From the laundry list description of himself quoted above, the two major points of evolution relate to Austrian / capitalist economics and libertarian politics. Those philosophies are both elegant systems that value and, theoretically, promote human flourishing, and are seductive to many an intelligent, thoughtful person. Vox’s understanding of the political spectrum in these columns was based purely upon individualism versus collectivism. “There is the collective and the individual and there is totalitarianism and libertarianism—that is the true spectrum.” There are a number of interesting columns evaluating communism and Fascism and other political philosophies on these terms that are quite persuasive. His column illustrating that Nazism was essentially Communism plus anti-Semitism is both humorous and effective as political rhetoric. There are also a number of very stimulating columns on the compatibility of libertarian politics with Christianity that merit deep consideration.</p><p>Today, Vox no longer considers himself a libertarian. He grants greater weight to “irrational” phenomena and realities such as biological and tribal identity. I would argue that Carlyle’s view of Left and Right as being distinguished by chaos, leveling and egalitarianism versus order, hierarchy and anti-egalitarianism must be taken into account in understanding the political spectrum. Even if the _ideal_ society would be a libertarian or anarchist one, it may well be that the one most conducive to human flourishing, the one that best prevents conflict and war, is in fact one that values the collective, values the group and does not view the world solely in terms of atomized individuals. As Steve Sailer has written elsewhere “Libertarianism in one country!!”</p><p>On economics, the devastating effects of “free trade” agreements and Ricardian free trade theory generally have led Vox away from purely capitalist / Austrian economics. Even in these columns, he recognized that part of the problem with “free trade” is that it was anything but free: “The irony of mutations like phone book-sized tomes such as NAFTA is that a real free-trade agreement only has to be about a sentence long: Congress shall pass no laws with regards to trade with (fill in the blank here).” This was a trenchant critique of “free trade” from a libertarian perspective, although Vox today no longer defends free trade even in the abstract.</p><p>What led Vox’s thought to evolve on these points? The facts have changed, and he has had to adjust his thinking rather than deny reality. “ Let reason be silent where experience gainsays its conclusions.” Libertarianism and pure classical liberal economics are elegant and seductive systems; but they did not stand up to the test of empirical evidence. So Vox has changed his mind. Vox has always been a critic of Plato and a disciple of Aristotle, so it is unsurprising that the changes in his thought with regards to economics and politics over the past 15 years could be summarized as less Platonic, more Aristotelian.</p><p>(2) As far as the strength of his judgments of events at the time, these columns stand up very well. To take one example, from his very earliest columns following 9/11, Vox correctly identified both the major threat and the major error in our response to 9/11: The threat was the use of war to justify encroachment upon our domestic liberties: “War corrodes a society by allowing centralist forces within government to excuse actions they would never be allowed to take in more peaceful times.” The major error was to fail to name the enemy and, thus, to ignore the Huntingtonian, civilizational conflict that was at the root of the problem. “Terror is a tactic, not an enemy, and the current phraseology only serves to obscure the fact that America has real enemies committed to her destruction.”</p><p>(3) While it may be fun to look back at old columns as an exercise in evaluating and revisiting old issues and judgments, a book should be read on its own merits. Samuel Johnson memorably described the duties of an author as being “to instruct and to entertain.” (Although Samuel Johnson is not a name I have ever seen Vox Day refer to, there are more than a few parallels and similarities between these two fascinating and important figures.) So, how does Vox’s writing itself hold up as instruction and entertainment?</p><p>I came away from this collection with a renewed respect for the man as a writer. The tone is generally that of the Happy Warrior, with a somewhat ironically elevated and detached manner appropriate to the columnist. Vox’s intelligence, good judgment and analytical ability, along with humor and wit, shine through. There is a great deal of wisdom and good sense throughout his writing. “Bon mots” abound in these columns on a myriad of topics:</p><p>On globalism: “The U.N. is not a debating society, it is an embryotic world government.”</p><p>On hypergamy: “The root of the problem is that the kind of man she wants is precisely the man who is smart enough to stay away from her.”</p><p>On parenthood: “Life is not only about happiness, it is about many things, sacrifice being one of them. And being a parent requires the greatest sacrifice of all, to live one’s life for the love of another.”</p><p>On capitalism: “Global corporations and free-market capitalism have about as much to do with one another as chipmunks and integrated circuit design.”</p><p>On Hillary (back in the early 2000s): “She proved to be as painfully inadequate in exercising power as she is ruthless in pursuing it.”</p><p>On American Empire: “I enjoyed reading Gibbon’s Decline and Fall of the Roman Empire. I’m not, however, taking much pleasure in watching the sequel unfold before my eyes.”</p><p>On entryism: “The slippery slope is not a paranoid straw man, it is the primary way in which a weak, but determined minority exerts its will on a more powerful, but less disciplined majority.”</p><p>On government: “There is no criminal gang or collection of scam artists who perpetrate even a small fraction of the crimes that the federal government commits and abets.”</p><p>On atheism: “Without God, there is only the left-hand path of the philosopher. It leads invariably to Hell, by way of the guillotine, the gulag and the gas chamber. The atheist is irrational because he has no other choice—because the rational consequences of his non-belief are simply too terrible to bear.”</p><p>For those familiar only with Vox’s more recent work, there are a number of topics in these columns that will be new to you or that are expounded on at greater length. These include: morality vs. law; jury nullification; marital relations and parenting; critiques of pragmatism and utilitarianism; Christianity; straight-up economic analysis.</p><p>I will end this review with one more quote, taken from Vox’s column of October 27, 2003. The personal nature of the column was unusual for the collection as a whole. Yet I believe this excerpt provides an accurate glimpse into the heart and soul of the Dark Lord then, and the Dark Lord today:</p><p>“The shadow is an illusion. It is like the pleasure—it passes, it waxes and wanes with time. Only that which you consider to be fairytales is the reality, it is that hope that is the truth, and only through that blinding light can the shadow be entirely banished. And if you feel that you must give in, that you are no longer strong enough to stand on your own, then surrender to the light, not to the darkness.”</p></div>",
  "content_text": "Now, this is the exact opposite of the fake reviews with which SJWs are littering Amazon. Daniel F. reviews\nThe Collected Columns Vol. 1, Innocence & Intellect, 2001-2005\n, now available in a 764-page\nhardcover\nedition.\nPORTRAIT OF THE DARK LORD AS A YOUNG MAN\nVox Day is a prolific author who, over the course of two decades, has covered an impressive range of topics and genres. He has been a video game reviewer, a syndicated columnist, a science fiction and fantasy novelist, the author of major works on religious and economic matters, and of course, a prominent blogger.\nOver the past two years, he has also firmly established himself as perhaps the most important analyst, taxonomist, synthesizer and theorist of political philosophy writing today. Consider: In the span of little more than a year, Vox wrote and published:\n“\nSJWs Always Lie\n”, an indispensable analysis of, and handbook for dealing with, the totalitarian thought-police who comprise the most dangerous current of Leftism today;\n“\nCuckservative\n” (co-authored with John Red Eagle), an even more valuable polemical case against modern day American conservatism that exposed Conservative Inc. as feckless enablers of progressivism; and\n“\nThe 16 Points of the Alternative Right\n”, a taxonomy and description of what is undoubtedly the most salient political current today, and the only movement that can resist the anti-civilizational tendencies and consequences of all mainstream political thought, left and “right”.\nWith all of these works, Vox was ahead of the curve, both anticipating and shaping many of the nascent trends playing out today. Vox coined, or gave greater currency to, a number of concepts and terms that are crucial for understanding and discussing contemporary politics: SJW, cuckservative, Alt Right, entryism, convergence, Magic Dirt, churchian.\nWith the collection under review, we are now asked to reflect upon Vox’s judgment and analysis in columns he penned a decade and a half ago. There are at least three reasons why someone would want to read this collection: (1) to understand the intellectual development and evolution of an important thinker; (2) to reflect on events starting from 9/11 and see how one writer’s contemporaneous reactions stand up over time; and (3) for the philosophical and literary value inherent in the writing itself.\n(1) In one of the columns collected here, Vox described himself as “a radical pro-life Austrian-school neo-capitalist Jacksonian techno-libertarian Southern Baptist Christian”. It is against that definition that we can see how his thinking has evolved over the years. For this reader, the changes in Vox’s worldview make sense in light of events and the learning he has done. To quote one of Vox’s economic nemeses, John Maynard Keynes: “When the facts change, I change my mind. What do you do, sir?”\nI was struck by how _little_ Vox has needed to change his mind: he remains consistent on a number of key issues, which prefigure his thinking in SJWAL, Cuckservative and the 16 Points:\nOn the thought police: “The solution for successfully defeating them is not to retreat and apologize, but to confront them and turn up the heat instead.”\nOn mainstream politics: “An analysis of the near-identical governing practices of the two parties in our two-party system would require a book—not a column—but it would show that the two are, for all practical purposes, effectively one.”\nOn mainstream conservatism: “Conservative proponents of government, unfortunately, have increasingly tended to mutate into the pale echoes of their socialist (liberal) counterparts.”\nOn globalism: “If humanity’s past record is a reasonable guide, globalism may represent the single deadliest threat to mankind in our long, murderous history.”\nOn Churchians: “Once a church makes the fatal decision to befriend the world and seek its approval instead of that of the God whom it is called to serve, its fate is sealed.”\nIn what ways, then, has Vox’s thought developed and changed? From the laundry list description of himself quoted above, the two major points of evolution relate to Austrian / capitalist economics and libertarian politics. Those philosophies are both elegant systems that value and, theoretically, promote human flourishing, and are seductive to many an intelligent, thoughtful person. Vox’s understanding of the political spectrum in these columns was based purely upon individualism versus collectivism. “There is the collective and the individual and there is totalitarianism and libertarianism—that is the true spectrum.” There are a number of interesting columns evaluating communism and Fascism and other political philosophies on these terms that are quite persuasive. His column illustrating that Nazism was essentially Communism plus anti-Semitism is both humorous and effective as political rhetoric. There are also a number of very stimulating columns on the compatibility of libertarian politics with Christianity that merit deep consideration.\nToday, Vox no longer considers himself a libertarian. He grants greater weight to “irrational” phenomena and realities such as biological and tribal identity. I would argue that Carlyle’s view of Left and Right as being distinguished by chaos, leveling and egalitarianism versus order, hierarchy and anti-egalitarianism must be taken into account in understanding the political spectrum. Even if the _ideal_ society would be a libertarian or anarchist one, it may well be that the one most conducive to human flourishing, the one that best prevents conflict and war, is in fact one that values the collective, values the group and does not view the world solely in terms of atomized individuals. As Steve Sailer has written elsewhere “Libertarianism in one country!!”\nOn economics, the devastating effects of “free trade” agreements and Ricardian free trade theory generally have led Vox away from purely capitalist / Austrian economics. Even in these columns, he recognized that part of the problem with “free trade” is that it was anything but free: “The irony of mutations like phone book-sized tomes such as NAFTA is that a real free-trade agreement only has to be about a sentence long: Congress shall pass no laws with regards to trade with (fill in the blank here).” This was a trenchant critique of “free trade” from a libertarian perspective, although Vox today no longer defends free trade even in the abstract.\nWhat led Vox’s thought to evolve on these points? The facts have changed, and he has had to adjust his thinking rather than deny reality. “ Let reason be silent where experience gainsays its conclusions.” Libertarianism and pure classical liberal economics are elegant and seductive systems; but they did not stand up to the test of empirical evidence. So Vox has changed his mind. Vox has always been a critic of Plato and a disciple of Aristotle, so it is unsurprising that the changes in his thought with regards to economics and politics over the past 15 years could be summarized as less Platonic, more Aristotelian.\n(2) As far as the strength of his judgments of events at the time, these columns stand up very well. To take one example, from his very earliest columns following 9/11, Vox correctly identified both the major threat and the major error in our response to 9/11: The threat was the use of war to justify encroachment upon our domestic liberties: “War corrodes a society by allowing centralist forces within government to excuse actions they would never be allowed to take in more peaceful times.” The major error was to fail to name the enemy and, thus, to ignore the Huntingtonian, civilizational conflict that was at the root of the problem. “Terror is a tactic, not an enemy, and the current phraseology only serves to obscure the fact that America has real enemies committed to her destruction.”\n(3) While it may be fun to look back at old columns as an exercise in evaluating and revisiting old issues and judgments, a book should be read on its own merits. Samuel Johnson memorably described the duties of an author as being “to instruct and to entertain.” (Although Samuel Johnson is not a name I have ever seen Vox Day refer to, there are more than a few parallels and similarities between these two fascinating and important figures.) So, how does Vox’s writing itself hold up as instruction and entertainment?\nI came away from this collection with a renewed respect for the man as a writer. The tone is generally that of the Happy Warrior, with a somewhat ironically elevated and detached manner appropriate to the columnist. Vox’s intelligence, good judgment and analytical ability, along with humor and wit, shine through. There is a great deal of wisdom and good sense throughout his writing. “Bon mots” abound in these columns on a myriad of topics:\nOn globalism: “The U.N. is not a debating society, it is an embryotic world government.”\nOn hypergamy: “The root of the problem is that the kind of man she wants is precisely the man who is smart enough to stay away from her.”\nOn parenthood: “Life is not only about happiness, it is about many things, sacrifice being one of them. And being a parent requires the greatest sacrifice of all, to live one’s life for the love of another.”\nOn capitalism: “Global corporations and free-market capitalism have about as much to do with one another as chipmunks and integrated circuit design.”\nOn Hillary (back in the early 2000s): “She proved to be as painfully inadequate in exercising power as she is ruthless in pursuing it.”\nOn American Empire: “I enjoyed reading Gibbon’s Decline and Fall of the Roman Empire. I’m not, however, taking much pleasure in watching the sequel unfold before my eyes.”\nOn entryism: “The slippery slope is not a paranoid straw man, it is the primary way in which a weak, but determined minority exerts its will on a more powerful, but less disciplined majority.”\nOn government: “There is no criminal gang or collection of scam artists who perpetrate even a small fraction of the crimes that the federal government commits and abets.”\nOn atheism: “Without God, there is only the left-hand path of the philosopher. It leads invariably to Hell, by way of the guillotine, the gulag and the gas chamber. The atheist is irrational because he has no other choice—because the rational consequences of his non-belief are simply too terrible to bear.”\nFor those familiar only with Vox’s more recent work, there are a number of topics in these columns that will be new to you or that are expounded on at greater length. These include: morality vs. law; jury nullification; marital relations and parenting; critiques of pragmatism and utilitarianism; Christianity; straight-up economic analysis.\nI will end this review with one more quote, taken from Vox’s column of October 27, 2003. The personal nature of the column was unusual for the collection as a whole. Yet I believe this excerpt provides an accurate glimpse into the heart and soul of the Dark Lord then, and the Dark Lord today:\n“The shadow is an illusion. It is like the pleasure—it passes, it waxes and wanes with time. Only that which you consider to be fairytales is the reality, it is that hope that is the truth, and only through that blinding light can the shadow be entirely banished. And if you feel that you must give in, that you are no longer strong enough to stand on your own, then surrender to the light, not to the darkness.”",
  "tags": [
    "Book Review",
    "Castalia House"
  ],
  "categories": [],
  "sitemap_lastmod": "2017-03-24T09:25:00+00:00"
}