{
  "url": "https://voxday.net/2017/03/13/revisionist-history/",
  "scraped_at": "2025-12-18T07:05:37.870055",
  "title": "Revisionist history fail",
  "date_display": "March 13, 2017",
  "date_iso": "2017-03-13T10:21:00+00:00",
  "date_from_url": "2017-03-13",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>SteelPalm was attempting to pass off revisionist history on one of the very worst sites on the Internet to try to do that.</p><blockquote class=\"tr_bq\"><p> You know how Hitler could have definitely won the war? If he had spared his German Jewish scientists and also used the Jewish scientists in the territories he conquered.</p></blockquote><p>That is completely false. There were more US-born Jewish scientists than foreign-born Jewish scientists working on the Manhattan Project. The idea that the Germans didn’t succeed in making an atomic bomb due to “persecution of Jewish scientists” was not only a self-serving idea put forth by a Dutch-born Jew whose parents died during the Holocaust, but it wasn’t even the primary reason he provided. Samual Goudsmit <i>“concluded that the failure of the German atomic bomb project was attributable to factors such as bureaucracy, Allied bombing campaigns, the persecution of Jewish scientists, and Werner Karl Heisenberg’s failed leadership.”</i><br> <i><br/></i><br> Many of the foreign-born Jewish scientists were not from Germany. Hitler had already made his fatal mistake of invading Czechoslovakia and triggering the war with Britain and France by invading Poland before scientists such as Tellar, Segrè, and Szilard would have even been theoretically accessible to him, but the reality is that most of them were already working in the Allied West before 1933. Rudolf Peierls and Hans Bethe were both already at Cambridge on Rockefeller Foundation scholarships in 1930; Otto Frisch left for London when Hitler was elected in 1933.</br></br></p><p>How could Hitler have possibly spared scientists, much less used them, when they were already out of his reach before he came to power? And more importantly, Germany never had the industrial wherewithal to develop atomic technology and weaponize it; they simply didn’t have the manpower or the materials to spare while they were already engaged in fighting a war on both fronts. The USA possessed every single advantage in the various relevant aspects, yet it still barely managed to produce three testable weapons before the end of the war.</p><blockquote class=\"tr_bq\"><p> Your cloying, whining rhetoric of the “I can’t even!” variety aside, the Manhattan Project consisted of almost exclusively Jewish scientists and was headed by a Jewish scientist.</p></blockquote><p>I really don’t understand what SteelPalm is attempting to do here. His repeated and counterproductive attempts to defend his people by resorting to a false historical narrative is not going to make anyone think better of them. Quite the contrary, I would think.</p><p>The Manhattan Project was not “headed by a Jewish scientist”. J. Robert Oppenheimer was the Scientific Director of the Los Alamos laboratory, he was not even one of the two head scientists of the project. Major General Leslie Groves headed the Manhattan Project, and his scientific advisors were Richard Tolman and James Conant. Los Alamos was only one of four major MP sites and it was considerably smaller than Oak Ridge.</p><p>There were <a href=\"http://www.americanthinker.com/articles/2015/02/jewish_scientists_helped_america_build_the_atom_bomb.html\">26 Jewish scientists of note</a> involved in some way with the Manhattan Project. 13 were US-born, 13 were foreign born. Hans Bethe was also half-Jewish, but he is usually omitted because he was raised Protestant. These 26 men did not make up the near-entirety of the scientific personnel of the project; one of the “scientists” listed was not even a scientist, but an engineer still in college. Not only did these 26 “Jewish scientists” not make up the majority of the 6,000 scientists involved in the project, they didn’t even make up the majority of <i>physicists </i>involved.</p><p>It is true that Jewish scientists, both US- and foreign-born, made vital contributions to the Manhattan Project. It is unlikely that the atomic bomb would have been completed in 1945 without them; it probably would have taken another year or three and therefore would never have been dropped in war. But to claim that Jewish scientists were “almost exclusively” responsible for it is utterly false and a tremendous insult to literally thousands of American scientists and engineers, to say nothing of the six British and Australian members of the vital MAUD Committee, without which the Manhattan Project would probably not have been created in time to factor into the history of WWII.</p><p>Ironically, <a href=\"https://infogalactic.com/info/Mark_Oliphant\">the biggest single contribution</a> to the Manhattan Project was probably made by a man who was not an American, was not Jewish, and although a scientist who later worked on the project in a scientific capacity, his unique and utterly vital contribution was entirely bureaucratic in nature.</p><blockquote class=\"tr_bq\"><p> When there was no reaction from America to the reports of the MAUD Committee, Mark Oliphant crossed the Atlantic in an unheated bomber in August 1941. He found that Lyman Briggs had not circulated the reports to the Uranium Committee, but had kept them in a safe. Oliphant then contacted Ernest Lawrence, James Conant, Enrico Fermi and Arthur Compton and managed to increase the urgency of the American research programmes. The MAUD Reports finally made a big impression. Overnight the Americans changed their minds about the feasibility of an atomic bomb and suggested a cooperative effort with Britain. Harold C. Urey and George Braxton Pegram were sent to the UK in November 1941, to confer but Britain did not take up the offer of collaboration. </p></blockquote><p>Remember, this took place almost exactly two years after <a href=\"https://infogalactic.com/info/Einstein%E2%80%93Szil%C3%A1rd_letter\">the famous Einstein–Szilárd letter</a> was delivered to FDR. The Manhattan Project was not inspired by that letter, as many incorrectly assume, but rather, by Oliphant’s stubbornness in bringing the MAUD reports to the attention of the Uranium Committee. This should be obvious, because the budget for the project was approved by FDR in June 1942 and the Manhattan Engineer District was created two months later.</p><p>It also demonstrates there is considerable truth to the “for want of a nail” aphorism.</p></div>",
  "content_text": "SteelPalm was attempting to pass off revisionist history on one of the very worst sites on the Internet to try to do that.\nYou know how Hitler could have definitely won the war? If he had spared his German Jewish scientists and also used the Jewish scientists in the territories he conquered.\nThat is completely false. There were more US-born Jewish scientists than foreign-born Jewish scientists working on the Manhattan Project. The idea that the Germans didn’t succeed in making an atomic bomb due to “persecution of Jewish scientists” was not only a self-serving idea put forth by a Dutch-born Jew whose parents died during the Holocaust, but it wasn’t even the primary reason he provided. Samual Goudsmit\n“concluded that the failure of the German atomic bomb project was attributable to factors such as bureaucracy, Allied bombing campaigns, the persecution of Jewish scientists, and Werner Karl Heisenberg’s failed leadership.”\nMany of the foreign-born Jewish scientists were not from Germany. Hitler had already made his fatal mistake of invading Czechoslovakia and triggering the war with Britain and France by invading Poland before scientists such as Tellar, Segrè, and Szilard would have even been theoretically accessible to him, but the reality is that most of them were already working in the Allied West before 1933. Rudolf Peierls and Hans Bethe were both already at Cambridge on Rockefeller Foundation scholarships in 1930; Otto Frisch left for London when Hitler was elected in 1933.\nHow could Hitler have possibly spared scientists, much less used them, when they were already out of his reach before he came to power? And more importantly, Germany never had the industrial wherewithal to develop atomic technology and weaponize it; they simply didn’t have the manpower or the materials to spare while they were already engaged in fighting a war on both fronts. The USA possessed every single advantage in the various relevant aspects, yet it still barely managed to produce three testable weapons before the end of the war.\nYour cloying, whining rhetoric of the “I can’t even!” variety aside, the Manhattan Project consisted of almost exclusively Jewish scientists and was headed by a Jewish scientist.\nI really don’t understand what SteelPalm is attempting to do here. His repeated and counterproductive attempts to defend his people by resorting to a false historical narrative is not going to make anyone think better of them. Quite the contrary, I would think.\nThe Manhattan Project was not “headed by a Jewish scientist”. J. Robert Oppenheimer was the Scientific Director of the Los Alamos laboratory, he was not even one of the two head scientists of the project. Major General Leslie Groves headed the Manhattan Project, and his scientific advisors were Richard Tolman and James Conant. Los Alamos was only one of four major MP sites and it was considerably smaller than Oak Ridge.\nThere were\n26 Jewish scientists of note\ninvolved in some way with the Manhattan Project. 13 were US-born, 13 were foreign born. Hans Bethe was also half-Jewish, but he is usually omitted because he was raised Protestant. These 26 men did not make up the near-entirety of the scientific personnel of the project; one of the “scientists” listed was not even a scientist, but an engineer still in college. Not only did these 26 “Jewish scientists” not make up the majority of the 6,000 scientists involved in the project, they didn’t even make up the majority of\nphysicists\ninvolved.\nIt is true that Jewish scientists, both US- and foreign-born, made vital contributions to the Manhattan Project. It is unlikely that the atomic bomb would have been completed in 1945 without them; it probably would have taken another year or three and therefore would never have been dropped in war. But to claim that Jewish scientists were “almost exclusively” responsible for it is utterly false and a tremendous insult to literally thousands of American scientists and engineers, to say nothing of the six British and Australian members of the vital MAUD Committee, without which the Manhattan Project would probably not have been created in time to factor into the history of WWII.\nIronically,\nthe biggest single contribution\nto the Manhattan Project was probably made by a man who was not an American, was not Jewish, and although a scientist who later worked on the project in a scientific capacity, his unique and utterly vital contribution was entirely bureaucratic in nature.\nWhen there was no reaction from America to the reports of the MAUD Committee, Mark Oliphant crossed the Atlantic in an unheated bomber in August 1941. He found that Lyman Briggs had not circulated the reports to the Uranium Committee, but had kept them in a safe. Oliphant then contacted Ernest Lawrence, James Conant, Enrico Fermi and Arthur Compton and managed to increase the urgency of the American research programmes. The MAUD Reports finally made a big impression. Overnight the Americans changed their minds about the feasibility of an atomic bomb and suggested a cooperative effort with Britain. Harold C. Urey and George Braxton Pegram were sent to the UK in November 1941, to confer but Britain did not take up the offer of collaboration.\nRemember, this took place almost exactly two years after\nthe famous Einstein–Szilárd letter\nwas delivered to FDR. The Manhattan Project was not inspired by that letter, as many incorrectly assume, but rather, by Oliphant’s stubbornness in bringing the MAUD reports to the attention of the Uranium Committee. This should be obvious, because the budget for the project was approved by FDR in June 1942 and the Manhattan Engineer District was created two months later.\nIt also demonstrates there is considerable truth to the “for want of a nail” aphorism.",
  "tags": [
    "history",
    "technology",
    "Zion"
  ],
  "categories": [],
  "sitemap_lastmod": "2017-03-13T10:21:00+00:00"
}