{
  "url": "https://voxday.net/2017/03/30/science-vs-galileo/",
  "scraped_at": "2025-12-18T07:08:17.406267",
  "title": "Science vs Galileo",
  "date_display": "March 30, 2017",
  "date_iso": "2017-03-30T10:24:00+00:00",
  "date_from_url": "2017-03-30",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>As most readers of this blog know, the “Flat Earth Church vs Galileo” narrative is mostly revisionist history that has been completely mischaracterized by atheists who fucking love science because they believe it disproves the existence of the Baby Jesus. But what is interesting is that there was <a href=\"http://www.intellectualtakeout.org/blog/opposition-galileo-was-scientific-not-just-religious\">a considerable amount of scientific opposition</a> to Galileo at the time as well, which is of course ignored by the ahistorical atheist narrative:</p><blockquote><p> In 1614, when the telescope was new technology, a young man in Germany published a book filled with illustrations of the exciting new things being discovered telescopically: moons circling Jupiter, moon-like phases of Venus, spots on the Sun, the rough and cratered lunar surface. The young man was Johann Georg Locher, and his book was Mathematical Disquisitions Concerning Astronomical Controversies and Novelties. And while Locher heaped praise upon Galileo, he challenged ideas that Galileo championed – on scientific grounds.</p><p>You see, Locher was an anti-Copernican, a fan of the ancient astronomer Ptolemy, and a student within the Establishment (his mentor was Christoph Scheiner, a prominent Jesuit astronomer). Locher argued that Copernicus was wrong about Earth circling the Sun, and that Earth was fixed in place, at the centre of the Universe, like Ptolemy said. But Locher was making no religious argument. Yes, he said, a moving Earth messes with certain Biblical passages, like Joshua telling the Sun to stand still. But it also messes with certain astronomical terms, such as sunrise and sunset. Copernicans had work-arounds for all that, Locher said, even though they might be convoluted. What Copernicans could not work around, though, were the scientific arguments against their theory. Indeed, Locher even proposed a mechanism to explain how Earth could orbit the Sun (a sort of perpetual falling – this decades before Isaac Newton would explain orbits by means of perpetual falling), but he said it would not help the Copernicans, on account of the other problems with their theory.</p><p>What were those problems? A big one was the size of stars in the Copernican universe. Copernicus proposed that certain oddities observed in the movements of planets through the constellations were due to the fact that Earth itself was moving. Stars show no such oddities, so Copernicus had to theorise that, rather than being just beyond the planets as astronomers had traditionally supposed, stars were so incredibly distant that Earth’s motion was insignificant by comparison. But seen from Earth, stars appear as dots of certain sizes or magnitudes. The only way stars could be so incredibly distant and have such sizes was if they were all incredibly huge, every last one dwarfing the Sun. Tycho Brahe, the most prominent astronomer of the era and a favourite of the Establishment, thought this was absurd, while Peter Crüger, a leading Polish mathematician, wondered how the Copernican system could ever survive in the face of the star-size problem.</p><p>Locher thought much was up in the air and ripe for study. In light of the star-size problem, he thought that the Earth clearly did not move; the Sun circled it. But the telescope made it clear that Venus circled the Sun, and that sunspots also went around the Sun. Brahe had theorised that all planets circled the Sun, while it circled Earth. Locher noted that Brahe might be right, but what was clear was that the telescope supported Ptolemy.</p></blockquote><p>Granted, Locher didn’t imprison Galileo. But then, he didn’t have the power to do so, nor had Galileo treacherously turned on him, disregarded his wishes, and intentionally made him look like an ass in his published dialogue. The true lesson of Galileo and the Church is not one of religion and science, but rather, the price of being proud, stubborn, and socially retarded.</p></div>",
  "content_text": "As most readers of this blog know, the “Flat Earth Church vs Galileo” narrative is mostly revisionist history that has been completely mischaracterized by atheists who fucking love science because they believe it disproves the existence of the Baby Jesus. But what is interesting is that there was\na considerable amount of scientific opposition\nto Galileo at the time as well, which is of course ignored by the ahistorical atheist narrative:\nIn 1614, when the telescope was new technology, a young man in Germany published a book filled with illustrations of the exciting new things being discovered telescopically: moons circling Jupiter, moon-like phases of Venus, spots on the Sun, the rough and cratered lunar surface. The young man was Johann Georg Locher, and his book was Mathematical Disquisitions Concerning Astronomical Controversies and Novelties. And while Locher heaped praise upon Galileo, he challenged ideas that Galileo championed – on scientific grounds.\nYou see, Locher was an anti-Copernican, a fan of the ancient astronomer Ptolemy, and a student within the Establishment (his mentor was Christoph Scheiner, a prominent Jesuit astronomer). Locher argued that Copernicus was wrong about Earth circling the Sun, and that Earth was fixed in place, at the centre of the Universe, like Ptolemy said. But Locher was making no religious argument. Yes, he said, a moving Earth messes with certain Biblical passages, like Joshua telling the Sun to stand still. But it also messes with certain astronomical terms, such as sunrise and sunset. Copernicans had work-arounds for all that, Locher said, even though they might be convoluted. What Copernicans could not work around, though, were the scientific arguments against their theory. Indeed, Locher even proposed a mechanism to explain how Earth could orbit the Sun (a sort of perpetual falling – this decades before Isaac Newton would explain orbits by means of perpetual falling), but he said it would not help the Copernicans, on account of the other problems with their theory.\nWhat were those problems? A big one was the size of stars in the Copernican universe. Copernicus proposed that certain oddities observed in the movements of planets through the constellations were due to the fact that Earth itself was moving. Stars show no such oddities, so Copernicus had to theorise that, rather than being just beyond the planets as astronomers had traditionally supposed, stars were so incredibly distant that Earth’s motion was insignificant by comparison. But seen from Earth, stars appear as dots of certain sizes or magnitudes. The only way stars could be so incredibly distant and have such sizes was if they were all incredibly huge, every last one dwarfing the Sun. Tycho Brahe, the most prominent astronomer of the era and a favourite of the Establishment, thought this was absurd, while Peter Crüger, a leading Polish mathematician, wondered how the Copernican system could ever survive in the face of the star-size problem.\nLocher thought much was up in the air and ripe for study. In light of the star-size problem, he thought that the Earth clearly did not move; the Sun circled it. But the telescope made it clear that Venus circled the Sun, and that sunspots also went around the Sun. Brahe had theorised that all planets circled the Sun, while it circled Earth. Locher noted that Brahe might be right, but what was clear was that the telescope supported Ptolemy.\nGranted, Locher didn’t imprison Galileo. But then, he didn’t have the power to do so, nor had Galileo treacherously turned on him, disregarded his wishes, and intentionally made him look like an ass in his published dialogue. The true lesson of Galileo and the Church is not one of religion and science, but rather, the price of being proud, stubborn, and socially retarded.",
  "tags": [
    "history",
    "science"
  ],
  "categories": [],
  "sitemap_lastmod": "2017-03-30T09:24:00+00:00"
}