{
  "url": "https://voxday.net/2017/03/28/so-laughing-so-not-at-all-butthur/",
  "scraped_at": "2025-12-18T07:07:56.617036",
  "title": "So laughing, so NOT AT ALL butthurt",
  "date_display": "March 28, 2017",
  "date_iso": "2017-03-28T09:25:00+00:00",
  "date_from_url": "2017-03-28",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>One cannot help but reflect upon the truth of the Third Law of SJW when presented with <a href=\"https://www.amazon.com/gp/customer-reviews/R3JQ3RUBJ83H50/ref=cm_cr_arp_d_rvw_ttl?ie=UTF8&amp;ASIN=B06XFQ24QC\">this emotionally incontinent confessional </a>that passes for a “book review” by one Jon Milne. Note that we are told this is not the first time Mr. Milne has felt the need to “review” a book by Castalia House, even though there are no other reviews listed by anyone of that name.</p><p>It’s fascinating to see that SJWs are so confident that the relevant authority will prove amenable, or at least indifferent, that they are willing to so openly admit their violations of the review guidelines as well as their intentions of attempting to manipulate Community Content.</p><blockquote><p> <b><a href=\"https://www.amazon.com/gp/customer-reviews/R3JQ3RUBJ83H50/ref=cm_cr_arp_d_rvw_ttl?ie=UTF8&amp;ASIN=B06XFQ24QC\">A massive inferiority and insecurity complex dooms this book to failure from the start</a></b><br> By Jon Milne on March 28, 2017</br></p><p>Much like with my review for “SJWs Always Lie” – inexplicably not subtitled “My Inability To Somehow Not Notice Two Chapter 5s During My Awesome Editing Skills” – I am delighted to admit I did not read “The Corroding Empire”. I did not need to. It was not the cover itself that convinced me of giving it a 1 star review, but rather the attitude and motivations the publisher had in creating the cover that provides all the justification I need.</p><p>Consider an alternate scenario: Castalia House releases this book, with the real name of the author (Harry Seldon) on the cover, as well as not having the identical artwork, fonts, and positioning of the words as an other considerably higher selling book. In other words, the book by Mr Seldon would be allowed to stand on it’s own two feet and attract judgment purely for it’s literary merits, or lack thereof, and then attract those who want to read it into buying and scoring the publisher some bucks. It stands to reason that if the book was of high quality, then people would buy it, and the would not need to rely on any cheap publicity stunts based on trying to score political points.</p><p>And yet it is precisely this desperation on the part of Vox Day – a guy who seriously holds the hilariously stupid view of “White Genocide” that mixed race babies will totally cause the destruction of Earth – that leaves a permanent black mark on this book and completely strips it of whatever credibility it might have as a literary work. Because no matter what Mr Beale may insist about how totally awesome he thinks this book is, it’s quite evident that he was clearly not confident in the ability of this literary work to sell without saddling it with a spectacularly lame gimmick as part of a great big amount of bitterness he has in relation to the success of John Scalzi.</p><p>It’s truly amazing how much sour grapes old Theodore is full of that Mr Scalzi has a highly lucrative book deal worth millions of dollars, something which Beale is nowhere close to ever achieving. Other “highlights” of Beale’s obsession with Scalzi include the Hugo Awards of 2015 and 2016, wherein Beale thought-policed his mindless drones, uh, I mean, followers into voting specific works dictated by a slate onto the ballots, all for the self-entitled purpose of winning awards they somehow feel entitled to, and to stick it to the so-called “SJWs” and “CHORFs” who are totally working behind the scenes to steal the whole science fiction genre from “TrueFans(tm) like Voxy and his Dread Milk minions. I mean, they never exactly elaborate how this conspiracy actually works, but still…</p><p>This is the mindset behind the “Corroding Empire’s” publication. Not one motivated purely by a desire to please fans and for the love of writing, but by petty squabbles fuelled by inferiority and insecurity complexes on Theodore Beale’s part, as well as a ridiculous obsession with needing vindication from awards. Perhaps Beale should research some of the most highly regarded movies of all time, many of which did not ever win or even get nominated for Oscars, and do the same for music albums and TV shows and video games etc and their equivalent awards which they never won, and then he could maybe reach a much-needed epiphany about whatever “vindication” he so desperately craves.</p><p>In closing, I present a contrast of an author who used and still uses a pseudonym for her writing with far more dignity and grace, even if her real name ended up getting leaked. I talk of course of the highly successful J.K. Rowling, currently writing as Robert Galbraith for the Cormoron Strike series of crime novels, all of them highly rated and highly selling. And of course, one can’t forget that according to TheRabidPuppiesDotCom, Hugo Award Nominee and perhaps the world’s greatest author Chuck Tingle has a counter going for how each book is doing: Scalzi’s “Collapsing Empire” has an Amazon Best-seller’s Rank of #235, where as “Corroding Empire” by Harry Telson is ranked #1671. Add another notch of failure to Castalia House’s marketing strategy.</p><p>Now comes the part where I get an outraged phone call from Castalia House decrying me for my “WrongThink”. I could definitely use a laugh.</p></blockquote><p>I’m sure Tor Books is ever so relieved that the first book in its big bet on John Scalzi has managed to outsell an ebook from an independent publisher. No doubt that was their metric for success. As for my supposed sour grapes, I note I signed my first million-dollar contract was when I was 27 and it was not the most recent one. I very much doubt that anyone who has read a reasonable portion of both our collected works would believe for a second that I would ever wish to trade my bibliography for his. And, quite to the contrary of SJW assumptions, I sincerely wish Scalzi’s contract had been ten times bigger in monetary terms; <i>Tor delenda est</i> is the point, after all, as Scalzi is little more than Patrick Nielsen Hayden’s creation. Even Scalzi’s first unprovoked attack on me in 2005 was inspired by PNH, the corrupt, beating heart of all that is wormwood and rotten in science fiction.</p><p>As for the “failure” of <b><i><a href=\"http://amzn.to/2mdtblw\">Corrosion</a></i></b>, those reviewers who have, unlike Mr. Milne, troubled to actually read the novel, have almost uniformly been pleasantly surprised to discover that it is actually a solid science fiction novel in its own right. Castalia House does not publish Tor-like trash, not even when we are gleefully sowing chaos and havoc. From the latest reviews of the first book of <i>The Corroding Empire</i>:</p><ul><li><i>Did not know what to expect. Was very pleasantly surprised to discover a first rate SciFy novel. An involved tale of what can go wrong when dimly understood digital algorithms developed by aware AI machine intelligences tightly control the galaxy. Until they don’t. Then, the fun starts.</i></li><li><i>I was reading very late at night. I finished an intense chapter detailing a farmer in a life and death fight with systemic wide algo-decay, and went to sleep.  A few hours later I was awakened by the sound of our electricity going off, I drowsily thought to myself, ‘oh, drat, more algo-decay.’ and then woke up more fully into my own world.  Kind of cool when a book does world building that well, isn’t it?</i></li><li><i>I read “Foundation” and it’s sequel 50+ years ago and remember them as about a 4 star duo. Enjoyed the Main character, a robot who goes through many changes. The idea of “corrosion” due to basic algorithms over centuries is good. The science ideas are fascinating,, so I enjoyed the book.</i></li><li><i>I remember Foundation as having a general optimistic tone, where the viewpoint characters overcome the challenges of their day guided by the all-knowing ghost of Hari Seldon. There was a sense of inevitability that was only punctured in later books. Corrosion takes an almost opposite track, illustrating a decaying galaxy where chaos reigns and even the far-sighted seer dedicated to restoration is stymied by events and very human reactions. Without going into spoilers, the world of the Corroding Empire is a darker place than the world of Foundation. Yet this darker world also makes the bright spots of the story all the more hopeful and rewarding.</i></li><li><i>I know this book is based on Asimov’s Foundation, which is a book I found amusing but not terribly compelling. I actually found this book to be much more interesting, not least because A) the premise was comparatively much more novel and B) it actually had characters I cared about. If you are too dim or humorless to get the obvious joke, this really says a lot more about you than the author or seller. I find it incredibly impressive that this was written essentially on a dare and turned out as well as it did.</i></li></ul><p>The simple fact is that <i><b><a href=\"http://amzn.to/2mdtblw\">Book One of The Corroding Empire: Corrosion</a></b></i>, by Johan Kalsi, was an absolutely smashing success in the eyes of everyone involved, as the fake review by Mr. Milne so beautifully demonstrates. It was a fantastic performance by the highly efficient Castalia House team, wonderfully supported by the ever-loyal Castalia House readers, and after a bit of confusion at the start, even our new friends at Amazon came through in the end.</p><p>Seriously, though, why do SJWs always pretend they are laughing, even when you can see they are shaking with rage?</p><p>They’re big science fiction fans too. In addition to not reading the books they review, SF-SJWs aren’t even familiar with the classic SF canon:</p><blockquote class=\"tr_bq\"><p> EDIT: My bad on the “Harry Seldon” thing. An honest mistake. I’ve never read any Asimov novels, the closest exposure I’ve had being the “I, Robot” movie released in the mid-2000s, which I remember liking. Nothing a trip to my local library can’t fix. Duly changed those references in my review anyway.</p></blockquote><p>In fairness, I very much doubt John Scalzi has read very many Asimov novels either. I doubt he’s even finished the original <i>Foundation </i>trilogy.</p></div>",
  "content_text": "One cannot help but reflect upon the truth of the Third Law of SJW when presented with\nthis emotionally incontinent confessional\nthat passes for a “book review” by one Jon Milne. Note that we are told this is not the first time Mr. Milne has felt the need to “review” a book by Castalia House, even though there are no other reviews listed by anyone of that name.\nIt’s fascinating to see that SJWs are so confident that the relevant authority will prove amenable, or at least indifferent, that they are willing to so openly admit their violations of the review guidelines as well as their intentions of attempting to manipulate Community Content.\nA massive inferiority and insecurity complex dooms this book to failure from the start\nBy Jon Milne on March 28, 2017\nMuch like with my review for “SJWs Always Lie” – inexplicably not subtitled “My Inability To Somehow Not Notice Two Chapter 5s During My Awesome Editing Skills” – I am delighted to admit I did not read “The Corroding Empire”. I did not need to. It was not the cover itself that convinced me of giving it a 1 star review, but rather the attitude and motivations the publisher had in creating the cover that provides all the justification I need.\nConsider an alternate scenario: Castalia House releases this book, with the real name of the author (Harry Seldon) on the cover, as well as not having the identical artwork, fonts, and positioning of the words as an other considerably higher selling book. In other words, the book by Mr Seldon would be allowed to stand on it’s own two feet and attract judgment purely for it’s literary merits, or lack thereof, and then attract those who want to read it into buying and scoring the publisher some bucks. It stands to reason that if the book was of high quality, then people would buy it, and the would not need to rely on any cheap publicity stunts based on trying to score political points.\nAnd yet it is precisely this desperation on the part of Vox Day – a guy who seriously holds the hilariously stupid view of “White Genocide” that mixed race babies will totally cause the destruction of Earth – that leaves a permanent black mark on this book and completely strips it of whatever credibility it might have as a literary work. Because no matter what Mr Beale may insist about how totally awesome he thinks this book is, it’s quite evident that he was clearly not confident in the ability of this literary work to sell without saddling it with a spectacularly lame gimmick as part of a great big amount of bitterness he has in relation to the success of John Scalzi.\nIt’s truly amazing how much sour grapes old Theodore is full of that Mr Scalzi has a highly lucrative book deal worth millions of dollars, something which Beale is nowhere close to ever achieving. Other “highlights” of Beale’s obsession with Scalzi include the Hugo Awards of 2015 and 2016, wherein Beale thought-policed his mindless drones, uh, I mean, followers into voting specific works dictated by a slate onto the ballots, all for the self-entitled purpose of winning awards they somehow feel entitled to, and to stick it to the so-called “SJWs” and “CHORFs” who are totally working behind the scenes to steal the whole science fiction genre from “TrueFans(tm) like Voxy and his Dread Milk minions. I mean, they never exactly elaborate how this conspiracy actually works, but still…\nThis is the mindset behind the “Corroding Empire’s” publication. Not one motivated purely by a desire to please fans and for the love of writing, but by petty squabbles fuelled by inferiority and insecurity complexes on Theodore Beale’s part, as well as a ridiculous obsession with needing vindication from awards. Perhaps Beale should research some of the most highly regarded movies of all time, many of which did not ever win or even get nominated for Oscars, and do the same for music albums and TV shows and video games etc and their equivalent awards which they never won, and then he could maybe reach a much-needed epiphany about whatever “vindication” he so desperately craves.\nIn closing, I present a contrast of an author who used and still uses a pseudonym for her writing with far more dignity and grace, even if her real name ended up getting leaked. I talk of course of the highly successful J.K. Rowling, currently writing as Robert Galbraith for the Cormoron Strike series of crime novels, all of them highly rated and highly selling. And of course, one can’t forget that according to TheRabidPuppiesDotCom, Hugo Award Nominee and perhaps the world’s greatest author Chuck Tingle has a counter going for how each book is doing: Scalzi’s “Collapsing Empire” has an Amazon Best-seller’s Rank of #235, where as “Corroding Empire” by Harry Telson is ranked #1671. Add another notch of failure to Castalia House’s marketing strategy.\nNow comes the part where I get an outraged phone call from Castalia House decrying me for my “WrongThink”. I could definitely use a laugh.\nI’m sure Tor Books is ever so relieved that the first book in its big bet on John Scalzi has managed to outsell an ebook from an independent publisher. No doubt that was their metric for success. As for my supposed sour grapes, I note I signed my first million-dollar contract was when I was 27 and it was not the most recent one. I very much doubt that anyone who has read a reasonable portion of both our collected works would believe for a second that I would ever wish to trade my bibliography for his. And, quite to the contrary of SJW assumptions, I sincerely wish Scalzi’s contract had been ten times bigger in monetary terms;\nTor delenda est\nis the point, after all, as Scalzi is little more than Patrick Nielsen Hayden’s creation. Even Scalzi’s first unprovoked attack on me in 2005 was inspired by PNH, the corrupt, beating heart of all that is wormwood and rotten in science fiction.\nAs for the “failure” of\nCorrosion\n, those reviewers who have, unlike Mr. Milne, troubled to actually read the novel, have almost uniformly been pleasantly surprised to discover that it is actually a solid science fiction novel in its own right. Castalia House does not publish Tor-like trash, not even when we are gleefully sowing chaos and havoc. From the latest reviews of the first book of\nThe Corroding Empire\n:\nDid not know what to expect. Was very pleasantly surprised to discover a first rate SciFy novel. An involved tale of what can go wrong when dimly understood digital algorithms developed by aware AI machine intelligences tightly control the galaxy. Until they don’t. Then, the fun starts.\nI was reading very late at night. I finished an intense chapter detailing a farmer in a life and death fight with systemic wide algo-decay, and went to sleep.  A few hours later I was awakened by the sound of our electricity going off, I drowsily thought to myself, ‘oh, drat, more algo-decay.’ and then woke up more fully into my own world.  Kind of cool when a book does world building that well, isn’t it?\nI read “Foundation” and it’s sequel 50+ years ago and remember them as about a 4 star duo. Enjoyed the Main character, a robot who goes through many changes. The idea of “corrosion” due to basic algorithms over centuries is good. The science ideas are fascinating,, so I enjoyed the book.\nI remember Foundation as having a general optimistic tone, where the viewpoint characters overcome the challenges of their day guided by the all-knowing ghost of Hari Seldon. There was a sense of inevitability that was only punctured in later books. Corrosion takes an almost opposite track, illustrating a decaying galaxy where chaos reigns and even the far-sighted seer dedicated to restoration is stymied by events and very human reactions. Without going into spoilers, the world of the Corroding Empire is a darker place than the world of Foundation. Yet this darker world also makes the bright spots of the story all the more hopeful and rewarding.\nI know this book is based on Asimov’s Foundation, which is a book I found amusing but not terribly compelling. I actually found this book to be much more interesting, not least because A) the premise was comparatively much more novel and B) it actually had characters I cared about. If you are too dim or humorless to get the obvious joke, this really says a lot more about you than the author or seller. I find it incredibly impressive that this was written essentially on a dare and turned out as well as it did.\nThe simple fact is that\nBook One of The Corroding Empire: Corrosion\n, by Johan Kalsi, was an absolutely smashing success in the eyes of everyone involved, as the fake review by Mr. Milne so beautifully demonstrates. It was a fantastic performance by the highly efficient Castalia House team, wonderfully supported by the ever-loyal Castalia House readers, and after a bit of confusion at the start, even our new friends at Amazon came through in the end.\nSeriously, though, why do SJWs always pretend they are laughing, even when you can see they are shaking with rage?\nThey’re big science fiction fans too. In addition to not reading the books they review, SF-SJWs aren’t even familiar with the classic SF canon:\nEDIT: My bad on the “Harry Seldon” thing. An honest mistake. I’ve never read any Asimov novels, the closest exposure I’ve had being the “I, Robot” movie released in the mid-2000s, which I remember liking. Nothing a trip to my local library can’t fix. Duly changed those references in my review anyway.\nIn fairness, I very much doubt John Scalzi has read very many Asimov novels either. I doubt he’s even finished the original\nFoundation\ntrilogy.",
  "tags": [
    "Book Review",
    "books",
    "Castalia House",
    "SJW"
  ],
  "categories": [],
  "sitemap_lastmod": "2017-03-28T08:25:00+00:00"
}