{
  "url": "https://voxday.net/2017/03/23/the-bounty-of-kek/",
  "scraped_at": "2025-12-18T07:07:24.369577",
  "title": "The bounty of Kek",
  "date_display": "March 23, 2017",
  "date_iso": "2017-03-23T22:38:00+00:00",
  "date_from_url": "2017-03-23",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>This one-star fake review pretty much sums up the current SF-SJW perspective:</p><blockquote class=\"tr_bq\"><p> This book is, by acknowledgement of the author, a direct attempt to discredit John Scalzi. I am appalled that Amazon decided to resume selling this item.</p></blockquote><p>Because, obviously, even if Amazon isn’t in the business of policing any attempts to discredit John Scalzi, <i>it should be</i>. Really, any book that discredits any public figure on the Left should be banned, the publisher arrested, and the author publicly flogged, right?</p><p>The tragic thing is that they don’t even realize that <i>they </i>are the very fascists they believe they hate.</p><p>Some of them have switched tactics now that they can’t count on the SJW insider to end the cognitive pain and amygdala triggering they are experiencing. You see, if they feign to be confused, then perhaps someone will do something and <i>make the pain stop!</i><br> <i><br/></i><br> Even if it violates the Amazon Community guidelines.<br> <i><br/></i><br> <i>Any attempt to manipulate Community content or features, including by contributing false, misleading, or inauthentic content, is strictly prohibited. If you violate our Guidelines, we may restrict your ability to use Community features, remove content, delist related products, or suspend or terminate your account…. </i><br> <i><br/></i><br> <i>Customer Reviews and Questions and Answers should be about the product. Feedback about the seller, your shipment experience, or packaging can be shared at www.amazon.com/feedback or www.amazon.com/packaging. Comments about pricing, product availability or alternate ordering options are also not about the product and should not be shared in Customer Reviews or Questions and Answers.</i></br></br></br></br></br></br></p><ul><li>Bait and switch… I was looking for Tor’s latest release by Salzi… this is deceptive advertising worthy of a back ally Chinese factory.</li><li>Fake troll book. Check out the good author here.Terrible book. If you want good sci-fi, check out this one instead. MUCH better author:</li><li>Gross. The only good thing about it is its cover, which they apparently got from somewhere else.</li><li>Terrible obvious attempt to rip off/ride the coattails of an actually good author, done by none other than the leader of the Rabid Puppies</li><li>One star. Ugh.</li><li>A clear and blatant attempt to ride John Scalzi’s name to make a quick buck. Vox Day is a parasite who imagines his ham-fisted proclamations to be schemes.</li><li>Wow, really? Please don’t mistake this book for the absolutely fantastic writings of John Scalzi.</li><li>Theodore Beale (the actual author) should have spent more time on character development, and the editing leaves something to be desired. I borrowed a friend’s copy and in hindsight, I’m glad it’s not a book I spent money on myself.</li><li>Ugh, I totally thought this was John Scalzi’s new book and bought it by mistake. It was bad. Really bad. Don’t waste your time.</li><li>Rip off, borderline copyright infringement of John Scalzi’s book by an inferior right-wing scam publishing house. Avoid.</li><li>This is not “Collapsing Empire” got this by mistake, as the author ripped the cover straight from the aforementioned title. Was fooled into getting this and went through great lengths to get a refund. This books reads as if it was a hastily written Asimov fan fic. The writer seems like he could be intelligent and skilled, but forgets his craft multiple times in the first three chapters.</li><li>Badly edited dreck from an ethically repugnant company. The confused tenses in the very first sentence of the narrative (visible in the preview) tell me there’s no need to read more.</li><li>Petty rip-off of John Scalzi’s new book The Collapsing Empire. Fake author name, fake book from a childish hack writer. Go buy Scalzi’s work instead.</li><li>Be warned: IT’S A RIPOFF. See Also: Ripoff artist from “conservative publishing house” engages in wholesale plagiarism. They even ripped off the cover art, and the fake pseudonym-author name is designed directly to attack REAL author John Scalzi, who white supremacist garbageman “Vox Day”, the publisher, has decided to feud with.</li></ul><p>In other words, they’re all in clear violation of the Community Guidelines for Customer Reviews, their various rationalizations and logical gymnastics notwithstanding. (File 770’s Rev. Bob, in particular, should note that the mere act of doing a Customer Review, by definition, makes one a Customer.) And it’s not as if the fake reviewer who lied about “going to great lengths to get a refund” or the fake reviewer who “borrowed a book from a friend” are going to fool Amazon. They don’t even fool us and we don’t have access to their accounts. But we can see the refund history of the book.</p><p>Now, it’s downright hilarious that Scalzi fans would be upset by any other author ripping him off, considering that ripping off better authors has made up the entire extent of John Scalzi’s literary career, such as it is. His big new book is already 20 percent off in the bookstores; they’ll be remaindering it soon. He’s not done as a mediocre writer of trivial one-voice snark for those who find that sort of thing entertaining, but everyone now realizes that the emperor Tor dressed up as a “major science fiction author” is entirely naked, and has been all along.</p><p>The much more interesting observation is the childish rage that these SJWs are openly exhibiting, both in the comments at iO9 and in the fake Amazon reviews. And the reason for this is that they are fearful and demoralized, so they are lashing out in helpless anger. The constant strain of the pressure that they’ve been feeling since the initial shock of the Rabid Puppies triumph two years ago has steadily grown, and it has been compounded by the God-Emperor’s unexpected election.</p><p>As one observer commented, they are rapidly exhausted and the residual emotion gets dealt with by other defense mechanisms. People can only take so much, and SJWs are far more delicate and emotionally incontinent than the norm.</p><p>They don’t see these things coming. They don’t have the normal human capacity to accept reality, so therefore they have no ability to anticipate enemy action. To do so would be to accept the anathema that the Narrative is wrong, that their enemies are not stupid, evil, hapless buffoons who fail at every single contest, but independent agents possessing the ability to defeat them now and in the future. This is why they predict our failure every single time; because just the <i>thought </i>of our possible success is painful and frightening to them.</p><p>Confronting the reality of it, well, you can see the result of that.</p><p>But don’t think that we inflicting pain on them merely for our pleasure. In fact, this emotional pain is the only mercy we can show them because it is their only path to sanity. And so, even as they scream and vent and shriek and lie, we do well to continue to calmly apply the pressure, with clean consciences, pure hearts, and the satisfaction of knowing that the truth will out.</p><p>At the moment, <b><i><a href=\"http://amzn.to/2nKW9eL\">Corrosion: The Corroded Empire, Book One</a></i></b> is #625 on Amazon, less than 400 spots behind <i>The Collapsing Career of the Author</i>. Even before you buy it, even before you have read the first word on your Kindle, are you not entertained?</p><p>All these lulz, they are Kek’s gift to you.</p><p>Case in point. They “laugh” to relieve the emotional pain they are experiencing as a result of their cognitive dissonance between the SJW Narrative and reality.</p><blockquote><p> Good lord. Your dumb attempt at attention-getting, then whiny blog post about how YOU are somehow the victim for infringing on someone’s copyright is amusing, as an outsider who is aware of your name through all of the bullshit you attempt to start. I did, actually try to read your work, too. Just to not be a troll. Wow, it sucked ass. Really.  But, really, doesn’t it just burn your hide that people wouldn’t read your crappy ‘right-wing’ fiction at all if you weren’t such a whiny little dick about everything? That must suck. Realizing that even with the kerfuffle you attempt to create every time you drop a big turd on the world of ‘Sci-Fi’, people are still ignoring your work because you are such a terrible author must just infuriate you. I mean, people still read Heinlein, despite his very far-right views. People still support Card, even though he is sort of a dick and a total homophobe. At least his fiction is good… People aren’t ignoring your work because of your politics, they ignore your work because it sucks ass. And they still ignore it, even when you beg for attention from ‘The Left’, like a little snowflake baby-boy.</p><p>HAHAHAHAHAHAHA</p><p>BWAHAHAHAHAHA</p><p>Oh!</p><p>HAHAHAHAHAHAHAH</p></blockquote></div>",
  "content_text": "This one-star fake review pretty much sums up the current SF-SJW perspective:\nThis book is, by acknowledgement of the author, a direct attempt to discredit John Scalzi. I am appalled that Amazon decided to resume selling this item.\nBecause, obviously, even if Amazon isn’t in the business of policing any attempts to discredit John Scalzi,\nit should be\n. Really, any book that discredits any public figure on the Left should be banned, the publisher arrested, and the author publicly flogged, right?\nThe tragic thing is that they don’t even realize that\nthey\nare the very fascists they believe they hate.\nSome of them have switched tactics now that they can’t count on the SJW insider to end the cognitive pain and amygdala triggering they are experiencing. You see, if they feign to be confused, then perhaps someone will do something and\nmake the pain stop!\nEven if it violates the Amazon Community guidelines.\nAny attempt to manipulate Community content or features, including by contributing false, misleading, or inauthentic content, is strictly prohibited. If you violate our Guidelines, we may restrict your ability to use Community features, remove content, delist related products, or suspend or terminate your account….\nCustomer Reviews and Questions and Answers should be about the product. Feedback about the seller, your shipment experience, or packaging can be shared at www.amazon.com/feedback or www.amazon.com/packaging. Comments about pricing, product availability or alternate ordering options are also not about the product and should not be shared in Customer Reviews or Questions and Answers.\nBait and switch… I was looking for Tor’s latest release by Salzi… this is deceptive advertising worthy of a back ally Chinese factory.\nFake troll book. Check out the good author here.Terrible book. If you want good sci-fi, check out this one instead. MUCH better author:\nGross. The only good thing about it is its cover, which they apparently got from somewhere else.\nTerrible obvious attempt to rip off/ride the coattails of an actually good author, done by none other than the leader of the Rabid Puppies\nOne star. Ugh.\nA clear and blatant attempt to ride John Scalzi’s name to make a quick buck. Vox Day is a parasite who imagines his ham-fisted proclamations to be schemes.\nWow, really? Please don’t mistake this book for the absolutely fantastic writings of John Scalzi.\nTheodore Beale (the actual author) should have spent more time on character development, and the editing leaves something to be desired. I borrowed a friend’s copy and in hindsight, I’m glad it’s not a book I spent money on myself.\nUgh, I totally thought this was John Scalzi’s new book and bought it by mistake. It was bad. Really bad. Don’t waste your time.\nRip off, borderline copyright infringement of John Scalzi’s book by an inferior right-wing scam publishing house. Avoid.\nThis is not “Collapsing Empire” got this by mistake, as the author ripped the cover straight from the aforementioned title. Was fooled into getting this and went through great lengths to get a refund. This books reads as if it was a hastily written Asimov fan fic. The writer seems like he could be intelligent and skilled, but forgets his craft multiple times in the first three chapters.\nBadly edited dreck from an ethically repugnant company. The confused tenses in the very first sentence of the narrative (visible in the preview) tell me there’s no need to read more.\nPetty rip-off of John Scalzi’s new book The Collapsing Empire. Fake author name, fake book from a childish hack writer. Go buy Scalzi’s work instead.\nBe warned: IT’S A RIPOFF. See Also: Ripoff artist from “conservative publishing house” engages in wholesale plagiarism. They even ripped off the cover art, and the fake pseudonym-author name is designed directly to attack REAL author John Scalzi, who white supremacist garbageman “Vox Day”, the publisher, has decided to feud with.\nIn other words, they’re all in clear violation of the Community Guidelines for Customer Reviews, their various rationalizations and logical gymnastics notwithstanding. (File 770’s Rev. Bob, in particular, should note that the mere act of doing a Customer Review, by definition, makes one a Customer.) And it’s not as if the fake reviewer who lied about “going to great lengths to get a refund” or the fake reviewer who “borrowed a book from a friend” are going to fool Amazon. They don’t even fool us and we don’t have access to their accounts. But we can see the refund history of the book.\nNow, it’s downright hilarious that Scalzi fans would be upset by any other author ripping him off, considering that ripping off better authors has made up the entire extent of John Scalzi’s literary career, such as it is. His big new book is already 20 percent off in the bookstores; they’ll be remaindering it soon. He’s not done as a mediocre writer of trivial one-voice snark for those who find that sort of thing entertaining, but everyone now realizes that the emperor Tor dressed up as a “major science fiction author” is entirely naked, and has been all along.\nThe much more interesting observation is the childish rage that these SJWs are openly exhibiting, both in the comments at iO9 and in the fake Amazon reviews. And the reason for this is that they are fearful and demoralized, so they are lashing out in helpless anger. The constant strain of the pressure that they’ve been feeling since the initial shock of the Rabid Puppies triumph two years ago has steadily grown, and it has been compounded by the God-Emperor’s unexpected election.\nAs one observer commented, they are rapidly exhausted and the residual emotion gets dealt with by other defense mechanisms. People can only take so much, and SJWs are far more delicate and emotionally incontinent than the norm.\nThey don’t see these things coming. They don’t have the normal human capacity to accept reality, so therefore they have no ability to anticipate enemy action. To do so would be to accept the anathema that the Narrative is wrong, that their enemies are not stupid, evil, hapless buffoons who fail at every single contest, but independent agents possessing the ability to defeat them now and in the future. This is why they predict our failure every single time; because just the\nthought\nof our possible success is painful and frightening to them.\nConfronting the reality of it, well, you can see the result of that.\nBut don’t think that we inflicting pain on them merely for our pleasure. In fact, this emotional pain is the only mercy we can show them because it is their only path to sanity. And so, even as they scream and vent and shriek and lie, we do well to continue to calmly apply the pressure, with clean consciences, pure hearts, and the satisfaction of knowing that the truth will out.\nAt the moment,\nCorrosion: The Corroded Empire, Book One\nis #625 on Amazon, less than 400 spots behind\nThe Collapsing Career of the Author\n. Even before you buy it, even before you have read the first word on your Kindle, are you not entertained?\nAll these lulz, they are Kek’s gift to you.\nCase in point. They “laugh” to relieve the emotional pain they are experiencing as a result of their cognitive dissonance between the SJW Narrative and reality.\nGood lord. Your dumb attempt at attention-getting, then whiny blog post about how YOU are somehow the victim for infringing on someone’s copyright is amusing, as an outsider who is aware of your name through all of the bullshit you attempt to start. I did, actually try to read your work, too. Just to not be a troll. Wow, it sucked ass. Really.  But, really, doesn’t it just burn your hide that people wouldn’t read your crappy ‘right-wing’ fiction at all if you weren’t such a whiny little dick about everything? That must suck. Realizing that even with the kerfuffle you attempt to create every time you drop a big turd on the world of ‘Sci-Fi’, people are still ignoring your work because you are such a terrible author must just infuriate you. I mean, people still read Heinlein, despite his very far-right views. People still support Card, even though he is sort of a dick and a total homophobe. At least his fiction is good… People aren’t ignoring your work because of your politics, they ignore your work because it sucks ass. And they still ignore it, even when you beg for attention from ‘The Left’, like a little snowflake baby-boy.\nHAHAHAHAHAHAHA\nBWAHAHAHAHAHA\nOh!\nHAHAHAHAHAHAHAH",
  "tags": [
    "mailvox",
    "SJW"
  ],
  "categories": [],
  "sitemap_lastmod": "2017-03-23T22:38:00+00:00"
}