{
  "url": "https://voxday.net/2017/03/17/the-fake-intellectua/",
  "scraped_at": "2025-12-18T07:06:17.682414",
  "title": "The fake intellectual",
  "date_display": "March 17, 2017",
  "date_iso": "2017-03-17T12:00:00+00:00",
  "date_from_url": "2017-03-17",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>Steve Sailer, quite rightly, despises Malcolm Gladwell. Gladwell is a poor man’s John Maynard Keynes, making a nice living selling false ideas useful to the establishment to the middle class midwits who erroneously consider themselves to be intelligent. But I had no idea that <a href=\"http://exiledonline.com/malcolm-gladwell-unmasked-a-look-into-the-life-work-of-america%E2%80%99s-most-successful-propagandist/\">he was a complete shill</a> who is essentially nothing more than an ad man dressed up rather unconvincingly as a public intellectual.</p><blockquote><p> Malcolm Gladwell says that he got into journalism by accident, that his real dream was to work for an ad agency. “I decided I wanted to be in advertising. I applied to eighteen advertising agencies in the city of Toronto and received eighteen rejection letters, which I taped in a row on my wall,” he wrote in his What the Dog Saw. If true, then Gladwell didn’t fail at all.  Rather, he has achieved his dream of becoming an ad man beyond all expectation. His position as a public intellectual and respected New Yorker makes him infinitely more effective and useful as an ad man than he would ever be if he were sitting and writing ad copy in the office of some big-name advertising conglomerate.</p><p>Yep, Gladwell has come a long way from his youthful days at the National Journalism Center, but, on the other hand, he hasn’t really moved at all. As Philip Morris put it, the National Journalism Center “was developed to train budding journalists in free market political and economic principles . . . to get across our side of the story.” Their investment in Malcolm Gladwell has paid off beyond their wildest dreams.</p></blockquote><p>Seriously, Gladwell’s resume reads like a demon’s list of American corporations, from tobacco companies to pharmaceutical companies, Bank of America, and even freaking ENRON. The more one looks at the “news” media, the more it becomes readily apparent how totally shot through with corruption it is.</p><p>I’ve always considered Gladwell to be a nonsensical babbler, but I actually thought he believed his bullshit. It turns out he is merely a ruthlessly cynical con man. Of course, it only stands to reason that the fake news would rely upon fake intellectuals.</p></div>",
  "content_text": "Steve Sailer, quite rightly, despises Malcolm Gladwell. Gladwell is a poor man’s John Maynard Keynes, making a nice living selling false ideas useful to the establishment to the middle class midwits who erroneously consider themselves to be intelligent. But I had no idea that\nhe was a complete shill\nwho is essentially nothing more than an ad man dressed up rather unconvincingly as a public intellectual.\nMalcolm Gladwell says that he got into journalism by accident, that his real dream was to work for an ad agency. “I decided I wanted to be in advertising. I applied to eighteen advertising agencies in the city of Toronto and received eighteen rejection letters, which I taped in a row on my wall,” he wrote in his What the Dog Saw. If true, then Gladwell didn’t fail at all.  Rather, he has achieved his dream of becoming an ad man beyond all expectation. His position as a public intellectual and respected New Yorker makes him infinitely more effective and useful as an ad man than he would ever be if he were sitting and writing ad copy in the office of some big-name advertising conglomerate.\nYep, Gladwell has come a long way from his youthful days at the National Journalism Center, but, on the other hand, he hasn’t really moved at all. As Philip Morris put it, the National Journalism Center “was developed to train budding journalists in free market political and economic principles . . . to get across our side of the story.” Their investment in Malcolm Gladwell has paid off beyond their wildest dreams.\nSeriously, Gladwell’s resume reads like a demon’s list of American corporations, from tobacco companies to pharmaceutical companies, Bank of America, and even freaking ENRON. The more one looks at the “news” media, the more it becomes readily apparent how totally shot through with corruption it is.\nI’ve always considered Gladwell to be a nonsensical babbler, but I actually thought he believed his bullshit. It turns out he is merely a ruthlessly cynical con man. Of course, it only stands to reason that the fake news would rely upon fake intellectuals.",
  "tags": [
    "corpocracy",
    "media"
  ],
  "categories": [],
  "sitemap_lastmod": "2017-03-17T12:00:00+00:00"
}