{
  "url": "https://voxday.net/2017/03/14/the-opposition-media-discovers-alt-tec/",
  "scraped_at": "2025-12-18T07:05:50.296328",
  "title": "The Opposition Media discovers Alt-Tech",
  "date_display": "March 14, 2017",
  "date_iso": "2017-03-14T12:42:00+00:00",
  "date_from_url": "2017-03-14",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>Mother Jones publishes the usual “hey, we discovered these guys are totally evil racist misogynists” <a href=\"http://www.motherjones.com/politics/2017/03/silicon-valley-tech-alt-right-racism-misogyny\">hit piece</a>:</p><blockquote><p> Alt-techies are scornful of South Asians working in Silicon Valley under H-1B visas. White Morpheus, the Daily Stormer reader, told me that he became a white supremacist after working with “unqualified subcontinentals who were brought in by visa fraud to drive down American engineering wages” and who “produce subpar work product.” (Before I contacted him, White Morpheus had posted on Daily Stormer about forming a neo-Nazi meetup group in Silicon Valley and using programming tools to create more video games “like Angry Goy.”)</p><p>The H-1B visa program, which Trump has vowed to reform, is unpopular among many tech workers due to concerns about its effect on wages and job security. Studies have shown that the largest recipients of H-1B visas are outsourcing firms, and that H-1B workers get paid less money than their American counterparts for the same work. But hardcore racists see an opening to turn the H-1B debate into a recruitment tool in the Valley. “A bill is being introduced in the House of Representatives that will neutralize the economic advantages these anti-American companies get from gaming the H1-b visa system,” a contributor to the Daily Stormer wrote recently. “If the cucks in Congress don’t block it, the not-so-humanitarian motives of big business in browning and third-worldizing America will be revealed.”</p><p>“Tomorrow, being a Hispanic, Black, Muslim or woman in the USA is going to be very scary,” the Latino founder of a Silicon Valley startup wrote on Facebook on election night. The post elicited an outpouring of solidarity from many Bay Area techies—but not from Andrew Torba, an alum of the Y-Combinator tech incubator, who tweeted a screenshot of the post with the line “Build the wall.”</p><p>When other Y-Combinator graduates began criticizing Torba on Facebook, he waded into the fray: “All of you: Fuck off,” he wrote. “Take your morally superior, elitist, virtue signaling bullshit and shove it.” Using an alt-right term meant to demean mainstream conservatives, he added, “I call it like I see it, and I helped meme a president into office, cucks.”</p><p>Y-Combinator soon banned Torba from its alumni network for “speaking in a threatening, harassing way towards other YC founders,” in violation of its ethics policy. Torba denied threatening or harassing YC founders and called the ban “a quintessential example of Silicon Valley censorship in action.” He later turned down my request to speak with him about the incident by posting parts of my email to him on social media with the comment “We don’t interview with fake news sites.”</p></blockquote><p>Andrew was right to turn down the reporter’s “request to speak with him”. This article is an clear object lesson in WHY YOU NEVER TALK TO THE MEDIA. I’ve turned down four or five interview requests in the last week alone. Deny them content. Deny them the ability to use you for their Narrative. Don’t try to use them, because they are using you. Don’t dance for them.</p><p>As for all you idiot spergs with your predictable and oh-so-clever-advice-that-no-one-ever-thought-of-before to “record the interview yourself”, just shut up already. All that advice indicates is that you don’t know what you’re talking about and no one has ever bothered to interview you. I recorded the <i>Wired </i>interview that was used against me. I recorded the David Pakman interview as well. The only reason the latter recording helped is that I have a bigger microphone than Pakman; the former<i> </i>didn’t do me one damned bit of good even when I brought it to the attention of the <i>Wired </i>editor.</p><p>I don’t know how I can make it any more clear: DO NOT TALK TO THE MEDIA. Even one of my very few former exceptions to the rule, Milo, has demonstrated that it is fundamentally a losing proposition.</p><p>Now, I’m not talking about friends and allies. I’m doing Stefan’s show in a few weeks and we’re going to discuss Dostoevsky. I did an interview with Brittany and Tara that I believe will be posted today. That’s different. Neither Stefan nor Brittany nor Tara are part of the opposition media nor can they easily be utilized by the opposition media.</p></div>",
  "content_text": "Mother Jones publishes the usual “hey, we discovered these guys are totally evil racist misogynists”\nhit piece\n:\nAlt-techies are scornful of South Asians working in Silicon Valley under H-1B visas. White Morpheus, the Daily Stormer reader, told me that he became a white supremacist after working with “unqualified subcontinentals who were brought in by visa fraud to drive down American engineering wages” and who “produce subpar work product.” (Before I contacted him, White Morpheus had posted on Daily Stormer about forming a neo-Nazi meetup group in Silicon Valley and using programming tools to create more video games “like Angry Goy.”)\nThe H-1B visa program, which Trump has vowed to reform, is unpopular among many tech workers due to concerns about its effect on wages and job security. Studies have shown that the largest recipients of H-1B visas are outsourcing firms, and that H-1B workers get paid less money than their American counterparts for the same work. But hardcore racists see an opening to turn the H-1B debate into a recruitment tool in the Valley. “A bill is being introduced in the House of Representatives that will neutralize the economic advantages these anti-American companies get from gaming the H1-b visa system,” a contributor to the Daily Stormer wrote recently. “If the cucks in Congress don’t block it, the not-so-humanitarian motives of big business in browning and third-worldizing America will be revealed.”\n“Tomorrow, being a Hispanic, Black, Muslim or woman in the USA is going to be very scary,” the Latino founder of a Silicon Valley startup wrote on Facebook on election night. The post elicited an outpouring of solidarity from many Bay Area techies—but not from Andrew Torba, an alum of the Y-Combinator tech incubator, who tweeted a screenshot of the post with the line “Build the wall.”\nWhen other Y-Combinator graduates began criticizing Torba on Facebook, he waded into the fray: “All of you: Fuck off,” he wrote. “Take your morally superior, elitist, virtue signaling bullshit and shove it.” Using an alt-right term meant to demean mainstream conservatives, he added, “I call it like I see it, and I helped meme a president into office, cucks.”\nY-Combinator soon banned Torba from its alumni network for “speaking in a threatening, harassing way towards other YC founders,” in violation of its ethics policy. Torba denied threatening or harassing YC founders and called the ban “a quintessential example of Silicon Valley censorship in action.” He later turned down my request to speak with him about the incident by posting parts of my email to him on social media with the comment “We don’t interview with fake news sites.”\nAndrew was right to turn down the reporter’s “request to speak with him”. This article is an clear object lesson in WHY YOU NEVER TALK TO THE MEDIA. I’ve turned down four or five interview requests in the last week alone. Deny them content. Deny them the ability to use you for their Narrative. Don’t try to use them, because they are using you. Don’t dance for them.\nAs for all you idiot spergs with your predictable and oh-so-clever-advice-that-no-one-ever-thought-of-before to “record the interview yourself”, just shut up already. All that advice indicates is that you don’t know what you’re talking about and no one has ever bothered to interview you. I recorded the\nWired\ninterview that was used against me. I recorded the David Pakman interview as well. The only reason the latter recording helped is that I have a bigger microphone than Pakman; the former\ndidn’t do me one damned bit of good even when I brought it to the attention of the\nWired\neditor.\nI don’t know how I can make it any more clear: DO NOT TALK TO THE MEDIA. Even one of my very few former exceptions to the rule, Milo, has demonstrated that it is fundamentally a losing proposition.\nNow, I’m not talking about friends and allies. I’m doing Stefan’s show in a few weeks and we’re going to discuss Dostoevsky. I did an interview with Brittany and Tara that I believe will be posted today. That’s different. Neither Stefan nor Brittany nor Tara are part of the opposition media nor can they easily be utilized by the opposition media.",
  "tags": [
    "#AltTech",
    "media"
  ],
  "categories": [],
  "sitemap_lastmod": "2017-03-14T12:42:00+00:00"
}