{
  "url": "https://voxday.net/2018/05/15/12-rules-for-life-a-catholic-review/",
  "scraped_at": "2025-12-19T21:02:15.205494",
  "title": "12 Rules for Life: A Catholic review",
  "date_display": "May 15, 2018",
  "date_iso": "2018-05-15T17:23:10+00:00",
  "date_from_url": "2018-05-15",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>Sam Rocha does not think much of Jordan Peterson’s <i>12 Rules for Life</i> either, and reaches much the same conclusion about the charlatan that I have in <a href=\"https://www.catholicnewsagency.com/news/book-review-jordan-petersons-12-rules-for-life-78542\">his review of the book</a> at the Catholic News Agency.</p><blockquote><p>In <i>12 Rules for Life</i>, Peterson makes a number of claims that obliquely relate to his opposition to the C-16 bill and to the points he has raised in his media appearances since then, but he does not credit any of this as contributing directly to this book. Instead, he cites his hero, Aleksandr Solzhenitsyn, as articulating Peterson’s core idea for the book: an opposition to the view that human beings are created for happiness. In this respect, Peterson unwittingly picks a fight with Aristotle’s ancient and enduring ideas of human flourishing and the good life within the first three pages of his 2018 book about how to live.</p><p>Peterson also provides an early footnote explaining his usage of the capitalized word “Being,” a term he uses throughout the book’s nearly 400 pages. Peterson credits his repeated usage of this term to Martin Heidegger. Anyone who has read Heidegger’s Being and Time, however, will find no resemblance between Heidegger’s and Peterson’s notions of Being, including the undifferentiated spelling (Heidegger distinguished between Being and the beings). Peterson’s reference to Heidegger is ultimately an appeal to authority, attempting to justify his use of the term “Being” as an abstract neologism. But it is not remotely true that Heidegger was using Being as a neologism. After all, Heidegger did make up an abstract neologism, Dasein, to explain the way in which Being is experienced through our particular existence. Peterson’s repetition of the word “Being” throughout the book is impossible to understand on Heideggerian terms, and Peterson provides no explanation for it but this one, in his footnote. This example is par for the course: Peterson employs a litany of big names without substantive engagement, while missing the sources that his own ideas are in passive dialogue and conflict with.</p><p>In other words, Peterson’s book begins with an oddly incomplete account of its origins and motivations, followed by an unconscious dismissal of Aristotle’s most compelling account of the purpose of life, followed by a lazy attempt to justify using a specialized term as a mystical buzzword for the rest of the book. Yet in some respects, these are the most reasonable eight pages of the book.</p></blockquote><p>In case you haven’t noticed, the more intelligent and the better-read the reader happens to be, the less he thinks of Jordan Peterson and the ludicrous pseudo-intellectual bafflegabbery that comprises Jordanetics. In case Sam’s review convinces you to give the book a pass, Sam has helpfully put together this list of twelve rules for approaching life as Jordan Peterson and his fans do.</p><p>Rule #1: Dominance Hierarchies Dominate, Hierarchically ( OF COURSE!), But They Don’t Really Know How to Make Upright Arguments or Provide Broad-Shouldered Reasons or Offer Serious Examples That Don’t Involve Psychologizing Crustaceans</p><p>Rule #2: “Postmodern Neo Marxists” Refers to Lacan But Not Jung, To Derrida But Not Nietzsche, To Foucault But Not Freud, But Please Don’t Ask Peterson About Terry Eagleton, Slavoj Zizek, Alain Badiou, Or Anyone Else Alive Today Who Is This Thing He Repeats Over And Over</p><p>Rule #3: If You Write One Book In 1999 With Routledge About Being Scared Of Nuclear War And You Cannot Get Enough Attention, Find A Good Culture War In 2016, Open a Patreon Account, And Get A Book Contract With Random House.</p><p>Rule #4: If Someone Critiques Peterson in 2017, Ask Them To Stop Being A Scaredy-Cat And Get In Touch With Him Directly; If Someone Critiques Peterson In 2018, Call Them Jealous And Bitter And Question Who They Are To Think They Could Debate JORDAN B PETERSON</p><p>Rule #5: As You Are Working As A Tenured Full Professor At A Major Research University, Convince Culture Warriors To Pay You Tens Of Thousands Of Dollars ON Patreon To Protect You From Something Bad From Happening To You</p><p>Rule #6: When You Are Promoted To Full Professor, Instead Of Writing An Opus Or Taking Joint Appointments Or A Chair Or A Distinguished Professorship, Publish A Rule Book Based on Your Quora Profile, YouTube Channel, And Your Only Other Book From 1999 Instead</p><p>Rule #7: If Jordan B Peterson Is Ever Criticized, Be Sure To Follow His Lead And Never Provide Reasons, Examples, Evidence, Counterfactuals, Arguments, Or Anything That Is Substantial Because You Are More Into The Phenomenon Of Peterson And His Effect On Society And He Is AMAZING</p><p>Rule #8: Quote Tons Of Philosophers In Your Books And Claim To Base Your Ideas Off Of Philosophical Ideas But Always Refuse To Debate Philosophers, Excepting Sam Harris Who Owned You In Your First Debate So Much You Wrote Him A Letter Afterwards—Debate Journalists Instead</p><p>Rule #9: Talk A Lot About IQ And Your IQ And Social Darwinism And Jungian Psychoanalysis And The Ying Yang And The Dragon Of Chaos And When You Get To The Book Of Genesis Christians Will Immediately Count You As An Exegete And An Evangelist For Their Cause</p><p>Rule #10: Anytime You Try To Defend Your General Position Against ALL Forms Of Marxism, Find A Way Back To Hitler And Stalin And Make Anyone Who Disagrees With You A Moral Monster, But Be Sure To Get VERY MAD About It And Show Them You Mean Business And Quote Adorno—Oopsies…</p><p>Rule #11: Talk More Than You Write Because It Is Hard To Be Pinned Down On What You Say, Also Use Your Professor Position To Add Credibility As A “Scientist” While You Try And Destroy The Corrupt Social Justice University—It Really Covers All Your Bases, Like The Salary + Patreon</p><p>Rule #12: Don’t Tell Marshall McLuhen, George Grant, Naomi Klein, Or Charles Taylor That Jordan Peterson Is Canada’s Greatest Intellectual And A Prophet For Our Time And When Someone Shows You Exactly How Nutty This Is Tell Them “Okay Man; I Only Think Peterson Is Just All right”</p></div>",
  "content_text": "Sam Rocha does not think much of Jordan Peterson’s\n12 Rules for Life\neither, and reaches much the same conclusion about the charlatan that I have in\nhis review of the book\nat the Catholic News Agency.\nIn\n12 Rules for Life\n, Peterson makes a number of claims that obliquely relate to his opposition to the C-16 bill and to the points he has raised in his media appearances since then, but he does not credit any of this as contributing directly to this book. Instead, he cites his hero, Aleksandr Solzhenitsyn, as articulating Peterson’s core idea for the book: an opposition to the view that human beings are created for happiness. In this respect, Peterson unwittingly picks a fight with Aristotle’s ancient and enduring ideas of human flourishing and the good life within the first three pages of his 2018 book about how to live.\nPeterson also provides an early footnote explaining his usage of the capitalized word “Being,” a term he uses throughout the book’s nearly 400 pages. Peterson credits his repeated usage of this term to Martin Heidegger. Anyone who has read Heidegger’s Being and Time, however, will find no resemblance between Heidegger’s and Peterson’s notions of Being, including the undifferentiated spelling (Heidegger distinguished between Being and the beings). Peterson’s reference to Heidegger is ultimately an appeal to authority, attempting to justify his use of the term “Being” as an abstract neologism. But it is not remotely true that Heidegger was using Being as a neologism. After all, Heidegger did make up an abstract neologism, Dasein, to explain the way in which Being is experienced through our particular existence. Peterson’s repetition of the word “Being” throughout the book is impossible to understand on Heideggerian terms, and Peterson provides no explanation for it but this one, in his footnote. This example is par for the course: Peterson employs a litany of big names without substantive engagement, while missing the sources that his own ideas are in passive dialogue and conflict with.\nIn other words, Peterson’s book begins with an oddly incomplete account of its origins and motivations, followed by an unconscious dismissal of Aristotle’s most compelling account of the purpose of life, followed by a lazy attempt to justify using a specialized term as a mystical buzzword for the rest of the book. Yet in some respects, these are the most reasonable eight pages of the book.\nIn case you haven’t noticed, the more intelligent and the better-read the reader happens to be, the less he thinks of Jordan Peterson and the ludicrous pseudo-intellectual bafflegabbery that comprises Jordanetics. In case Sam’s review convinces you to give the book a pass, Sam has helpfully put together this list of twelve rules for approaching life as Jordan Peterson and his fans do.\nRule #1: Dominance Hierarchies Dominate, Hierarchically ( OF COURSE!), But They Don’t Really Know How to Make Upright Arguments or Provide Broad-Shouldered Reasons or Offer Serious Examples That Don’t Involve Psychologizing Crustaceans\nRule #2: “Postmodern Neo Marxists” Refers to Lacan But Not Jung, To Derrida But Not Nietzsche, To Foucault But Not Freud, But Please Don’t Ask Peterson About Terry Eagleton, Slavoj Zizek, Alain Badiou, Or Anyone Else Alive Today Who Is This Thing He Repeats Over And Over\nRule #3: If You Write One Book In 1999 With Routledge About Being Scared Of Nuclear War And You Cannot Get Enough Attention, Find A Good Culture War In 2016, Open a Patreon Account, And Get A Book Contract With Random House.\nRule #4: If Someone Critiques Peterson in 2017, Ask Them To Stop Being A Scaredy-Cat And Get In Touch With Him Directly; If Someone Critiques Peterson In 2018, Call Them Jealous And Bitter And Question Who They Are To Think They Could Debate JORDAN B PETERSON\nRule #5: As You Are Working As A Tenured Full Professor At A Major Research University, Convince Culture Warriors To Pay You Tens Of Thousands Of Dollars ON Patreon To Protect You From Something Bad From Happening To You\nRule #6: When You Are Promoted To Full Professor, Instead Of Writing An Opus Or Taking Joint Appointments Or A Chair Or A Distinguished Professorship, Publish A Rule Book Based on Your Quora Profile, YouTube Channel, And Your Only Other Book From 1999 Instead\nRule #7: If Jordan B Peterson Is Ever Criticized, Be Sure To Follow His Lead And Never Provide Reasons, Examples, Evidence, Counterfactuals, Arguments, Or Anything That Is Substantial Because You Are More Into The Phenomenon Of Peterson And His Effect On Society And He Is AMAZING\nRule #8: Quote Tons Of Philosophers In Your Books And Claim To Base Your Ideas Off Of Philosophical Ideas But Always Refuse To Debate Philosophers, Excepting Sam Harris Who Owned You In Your First Debate So Much You Wrote Him A Letter Afterwards—Debate Journalists Instead\nRule #9: Talk A Lot About IQ And Your IQ And Social Darwinism And Jungian Psychoanalysis And The Ying Yang And The Dragon Of Chaos And When You Get To The Book Of Genesis Christians Will Immediately Count You As An Exegete And An Evangelist For Their Cause\nRule #10: Anytime You Try To Defend Your General Position Against ALL Forms Of Marxism, Find A Way Back To Hitler And Stalin And Make Anyone Who Disagrees With You A Moral Monster, But Be Sure To Get VERY MAD About It And Show Them You Mean Business And Quote Adorno—Oopsies…\nRule #11: Talk More Than You Write Because It Is Hard To Be Pinned Down On What You Say, Also Use Your Professor Position To Add Credibility As A “Scientist” While You Try And Destroy The Corrupt Social Justice University—It Really Covers All Your Bases, Like The Salary + Patreon\nRule #12: Don’t Tell Marshall McLuhen, George Grant, Naomi Klein, Or Charles Taylor That Jordan Peterson Is Canada’s Greatest Intellectual And A Prophet For Our Time And When Someone Shows You Exactly How Nutty This Is Tell Them “Okay Man; I Only Think Peterson Is Just All right”",
  "tags": [
    "BookReview"
  ],
  "categories": [],
  "sitemap_lastmod": "2018-05-15T16:23:10+00:00"
}