{
  "url": "https://voxday.net/2018/05/15/a-foundation-of-intellectual-sand/",
  "scraped_at": "2025-12-19T21:02:09.740448",
  "title": "A foundation of intellectual sand",
  "date_display": "May 15, 2018",
  "date_iso": "2018-05-15T10:36:19+00:00",
  "date_from_url": "2018-05-15",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>This is the sort of basic historical error that Jordan Peterson commits with a surprising degree of regularity. From <i>Maps of Meaning</i>:</p><blockquote><p>Prior to the time of Descartes, Bacon and Newton, man lived in an animated, spiritual world, saturated with meaning, imbued with moral purpose. The nature of this purpose was revealed in the stories people told each other—stories about the structure of the cosmos and the place of man. But now we think empirically (at least we think we think empirically), and the spirits that once inhabited the universe have vanished. The forces released by the advent of the experiment have wreaked havoc within the mythic world. Jung states:</p><p><i>How totally different did the world appear to medieval man! For him the earth was eternally fixed and at rest in the center of the universe, encircled by the course of a sun that solicitously bestowed its warmth. Men were all children of God under the loving care of the Most High, who prepared them for eternal blessedness; and all knew exactly what they should do and how they should conduct themselves in order to rise from a corruptible world to an incorruptible and joyous existence. Such a life no longer seems real to us, even in our dreams. Natural science has long ago torn this lovely veil to shreds.</i></p><p>Even if the medieval individual was not in all cases tenderly and completely enraptured by his religious beliefs (he was a great believer in hell, for example), he was certainly not plagued by the plethora of rational doubts and moral uncertainties that beset his modern counterpart. Religion for the pre-experimental mind was not so much a matter of faith as a matter of fact—which means that the prevailing religious viewpoint was not merely one compelling theory among many….</p><p>Medieval people, unused to rhetorical speech, were easily seized emotionally or inspired to action by passionate words.</p></blockquote><p>This is little more than a mystic’s poetic version of the false science-religion polarity put forth by historically ignorant atheists. <b><a href=\"https://infogalactic.com/info/Rhetoric#Medieval_to_Enlightenment\">Infogalactic</a></b>:</p><blockquote><p>After the breakup of the western Roman Empire, the study of rhetoric continued to be central to the study of the verbal arts; but the study of the verbal arts went into decline for several centuries, followed eventually by a gradual rise in formal education, culminating in the rise of medieval universities. But rhetoric transmuted during this period into the arts of letter writing (ars dictaminis) and sermon writing (ars praedicandi). As part of the trivium, rhetoric was secondary to the study of logic, and its study was highly scholastic: students were given repetitive exercises in the creation of discourses on historical subjects (suasoriae) or on classic legal questions (controversiae).</p><p>Although he is not commonly regarded as a rhetorician, St. Augustine (354-430) was trained in rhetoric and was at one time a professor of Latin rhetoric in Milan. After his conversion to Christianity, he became interested in using these “pagan” arts for spreading his religion. This new use of rhetoric is explored in the Fourth Book of his <i>De Doctrina Christiana</i>, which laid the foundation of what would become homiletics, the rhetoric of the sermon. Augustine begins the book by asking why “the power of eloquence, which is so efficacious in pleading either for the erroneous cause or the right”, should not be used for righteous purposes (IV.3).</p><p>One early concern of the medieval Christian church was its attitude to classical rhetoric itself. Jerome (d. 420) complained, “What has Horace to do with the Psalms, Virgil with the Gospels, Cicero with the Apostles?” Augustine is also remembered for arguing for the preservation of pagan works and fostering a church tradition that led to conservation of numerous pre-Christian rhetorical writings.</p><p>Rhetoric would not regain its classical heights until the renaissance, but new writings did advance rhetorical thought. Boethius, in his brief <i>Overview of the Structure of Rhetoric</i>, continues Aristotle’s taxonomy by placing rhetoric in subordination to philosophical argument or dialectic. The introduction of Arab scholarship from European relations with the Muslim empire renewed interest in Aristotle and Classical thought in general, leading to what some historians call the 12th century renaissance. A number of medieval grammars and studies of poetry and rhetoric appeared.</p><p>Late medieval rhetorical writings include those of St. Thomas Aquinas, Matthew of Vendome (<i>Ars Versificatoria</i>, 1175), and Geoffrey of Vinsauf (<i>Poetria Nova</i>, 1200–1216). Another interesting record of medieval rhetorical thought can be seen in the many animal debate poems popular in England and the continent during the Middle Ages, such as The Owl and the Nightingale (13th century) and Geoffrey Chaucer’s Parliament of Fowls (1382).</p></blockquote><p>The historical truth is that the average medieval man was probably more cognizant of the distinction between rhetorical speech and dialectical speech than postmodern man is, and the average educated medieval man almost certainly had a far more sophisticated technical understanding of rhetoric than the average modern or postmodern academic. Including Dr. Jordan Peterson himself.</p><p>Moreover, note that while Jung’s erroneous assertion is limited to the medievals, Peterson’s is not, as he extends Jung’s false claim to includes all men prior to Descartes, Bacon and Newton. Anyone even remotely familiar with classical or Eastern philosophy will immediately recognize the absurdity of the statement. How could anyone who has read <i>Outlines of Pyrrhonism</i> possibly accept the idea that no one before Descartes thought empirically? Even if one hasn’t, the fact that the author’s name is <i>Sextus Empiricus</i> should provide at least a hint that something is seriously wrong with the notion.</p><p>Does Peterson genuinely believe people today do not respond emotionally to charges of racism, sexism, antisemitism, homophobia, and now transphobia? Does he truly believe they are not “easily seized emotionally or inspired to action by passionate words”? As for the idea that Man today thinks empirically, one has only to review a few of the furious responses of Jordan Peterson’s fans to the revelations concerning his genuine beliefs and philosophy to wholly disprove that notion.</p><p>The chief problem, as near as I can tell, is that Peterson seldom bothers reading much actual source material, preferring to rely instead on what academics have written about it. In the case of his absurd claim concerning the unfamiliarity of medieval people with rhetorical speech, he refers to a 1967 study by Huizenga, while his failure to cite Aristotle, Aquinas, Augustine or Cicero even once while discussing the subject strongly suggests that at the time he wrote <i>Maps of Meaning</i>, he had never read any of them.</p><p>From a review of <i>Thomas Aquinas on Persuasion: Action, Ends, and Natural Rhetoric</i> by Jeffrey J.Maciejewski.</p><blockquote class=\"tr_bq\"><p>Much has been written about the early Church Fathers and their efforts to adapt Classical rhetorical theory to Christian thought. The greatest focus here has been on the philosopher and theologian Augustine of Hippo (345-430), whose contributions to a uniquely Christian rhetoric have been described by George Kennedy and Calvin Troup to name but a few. The focus on Augustine has perhaps overshadowed another influential Christian thinker, Thomas Aquinas. He also adapted Classical precepts, namely, Aristotelianism – and his impact on the development of the (Catholic) Christian CHurch has been as formidable as Augustine’s, if not more so.</p></blockquote><p>What sort of architecture of belief can any man hope to construct without Aristotle, let alone Augustine and Aquinas? And what sort of belief system can be expected to stand when constructed upon on a foundation of such shoddy intellectual sand?</p></div>",
  "content_text": "This is the sort of basic historical error that Jordan Peterson commits with a surprising degree of regularity. From\nMaps of Meaning\n:\nPrior to the time of Descartes, Bacon and Newton, man lived in an animated, spiritual world, saturated with meaning, imbued with moral purpose. The nature of this purpose was revealed in the stories people told each other—stories about the structure of the cosmos and the place of man. But now we think empirically (at least we think we think empirically), and the spirits that once inhabited the universe have vanished. The forces released by the advent of the experiment have wreaked havoc within the mythic world. Jung states:\nHow totally different did the world appear to medieval man! For him the earth was eternally fixed and at rest in the center of the universe, encircled by the course of a sun that solicitously bestowed its warmth. Men were all children of God under the loving care of the Most High, who prepared them for eternal blessedness; and all knew exactly what they should do and how they should conduct themselves in order to rise from a corruptible world to an incorruptible and joyous existence. Such a life no longer seems real to us, even in our dreams. Natural science has long ago torn this lovely veil to shreds.\nEven if the medieval individual was not in all cases tenderly and completely enraptured by his religious beliefs (he was a great believer in hell, for example), he was certainly not plagued by the plethora of rational doubts and moral uncertainties that beset his modern counterpart. Religion for the pre-experimental mind was not so much a matter of faith as a matter of fact—which means that the prevailing religious viewpoint was not merely one compelling theory among many….\nMedieval people, unused to rhetorical speech, were easily seized emotionally or inspired to action by passionate words.\nThis is little more than a mystic’s poetic version of the false science-religion polarity put forth by historically ignorant atheists.\nInfogalactic\n:\nAfter the breakup of the western Roman Empire, the study of rhetoric continued to be central to the study of the verbal arts; but the study of the verbal arts went into decline for several centuries, followed eventually by a gradual rise in formal education, culminating in the rise of medieval universities. But rhetoric transmuted during this period into the arts of letter writing (ars dictaminis) and sermon writing (ars praedicandi). As part of the trivium, rhetoric was secondary to the study of logic, and its study was highly scholastic: students were given repetitive exercises in the creation of discourses on historical subjects (suasoriae) or on classic legal questions (controversiae).\nAlthough he is not commonly regarded as a rhetorician, St. Augustine (354-430) was trained in rhetoric and was at one time a professor of Latin rhetoric in Milan. After his conversion to Christianity, he became interested in using these “pagan” arts for spreading his religion. This new use of rhetoric is explored in the Fourth Book of his\nDe Doctrina Christiana\n, which laid the foundation of what would become homiletics, the rhetoric of the sermon. Augustine begins the book by asking why “the power of eloquence, which is so efficacious in pleading either for the erroneous cause or the right”, should not be used for righteous purposes (IV.3).\nOne early concern of the medieval Christian church was its attitude to classical rhetoric itself. Jerome (d. 420) complained, “What has Horace to do with the Psalms, Virgil with the Gospels, Cicero with the Apostles?” Augustine is also remembered for arguing for the preservation of pagan works and fostering a church tradition that led to conservation of numerous pre-Christian rhetorical writings.\nRhetoric would not regain its classical heights until the renaissance, but new writings did advance rhetorical thought. Boethius, in his brief\nOverview of the Structure of Rhetoric\n, continues Aristotle’s taxonomy by placing rhetoric in subordination to philosophical argument or dialectic. The introduction of Arab scholarship from European relations with the Muslim empire renewed interest in Aristotle and Classical thought in general, leading to what some historians call the 12th century renaissance. A number of medieval grammars and studies of poetry and rhetoric appeared.\nLate medieval rhetorical writings include those of St. Thomas Aquinas, Matthew of Vendome (\nArs Versificatoria\n, 1175), and Geoffrey of Vinsauf (\nPoetria Nova\n, 1200–1216). Another interesting record of medieval rhetorical thought can be seen in the many animal debate poems popular in England and the continent during the Middle Ages, such as The Owl and the Nightingale (13th century) and Geoffrey Chaucer’s Parliament of Fowls (1382).\nThe historical truth is that the average medieval man was probably more cognizant of the distinction between rhetorical speech and dialectical speech than postmodern man is, and the average educated medieval man almost certainly had a far more sophisticated technical understanding of rhetoric than the average modern or postmodern academic. Including Dr. Jordan Peterson himself.\nMoreover, note that while Jung’s erroneous assertion is limited to the medievals, Peterson’s is not, as he extends Jung’s false claim to includes all men prior to Descartes, Bacon and Newton. Anyone even remotely familiar with classical or Eastern philosophy will immediately recognize the absurdity of the statement. How could anyone who has read\nOutlines of Pyrrhonism\npossibly accept the idea that no one before Descartes thought empirically? Even if one hasn’t, the fact that the author’s name is\nSextus Empiricus\nshould provide at least a hint that something is seriously wrong with the notion.\nDoes Peterson genuinely believe people today do not respond emotionally to charges of racism, sexism, antisemitism, homophobia, and now transphobia? Does he truly believe they are not “easily seized emotionally or inspired to action by passionate words”? As for the idea that Man today thinks empirically, one has only to review a few of the furious responses of Jordan Peterson’s fans to the revelations concerning his genuine beliefs and philosophy to wholly disprove that notion.\nThe chief problem, as near as I can tell, is that Peterson seldom bothers reading much actual source material, preferring to rely instead on what academics have written about it. In the case of his absurd claim concerning the unfamiliarity of medieval people with rhetorical speech, he refers to a 1967 study by Huizenga, while his failure to cite Aristotle, Aquinas, Augustine or Cicero even once while discussing the subject strongly suggests that at the time he wrote\nMaps of Meaning\n, he had never read any of them.\nFrom a review of\nThomas Aquinas on Persuasion: Action, Ends, and Natural Rhetoric\nby Jeffrey J.Maciejewski.\nMuch has been written about the early Church Fathers and their efforts to adapt Classical rhetorical theory to Christian thought. The greatest focus here has been on the philosopher and theologian Augustine of Hippo (345-430), whose contributions to a uniquely Christian rhetoric have been described by George Kennedy and Calvin Troup to name but a few. The focus on Augustine has perhaps overshadowed another influential Christian thinker, Thomas Aquinas. He also adapted Classical precepts, namely, Aristotelianism – and his impact on the development of the (Catholic) Christian CHurch has been as formidable as Augustine’s, if not more so.\nWhat sort of architecture of belief can any man hope to construct without Aristotle, let alone Augustine and Aquinas? And what sort of belief system can be expected to stand when constructed upon on a foundation of such shoddy intellectual sand?",
  "tags": [
    "rhetoric"
  ],
  "categories": [],
  "sitemap_lastmod": "2018-05-15T09:36:19+00:00"
}