{
  "url": "https://voxday.net/2018/05/18/a-misrepresentation-by-sargon/",
  "scraped_at": "2025-12-19T21:02:44.566412",
  "title": "A misrepresentation by Sargon",
  "date_display": "May 18, 2018",
  "date_iso": "2018-05-18T15:06:14+00:00",
  "date_from_url": "2018-05-18",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>The Public Space asserts that my fellow GamerGater misrepresented me in a YouTube video entitled <a href=\"https://youtu.be/cFbROBXhecQ?t=2166\">Sargon Misrepresents Vox Day About Jordan Peterson</a>:</p><blockquote><p>Sargon of Akkad is ruining my name now because there’s text that I’ve written which says Sargon of Akkad is solid, he always fairly represents even his opponent, but on a video published two days ago he misrepresents Vox Day, presenting his blog post as attributing a communist conspiracy to Jordan Peterson, which is not at all what Vox Day was saying. Let’s hear the statement by Sargon:</p><p><i>So in the last few days an Alt-Right science fiction author called Vox day on his blog has exposed Jordan Peterson being involved with a new global partnership to eradicate poverty and transform across economies through sustainable development, which I guess is some communist globalist conspiracy or something. I haven’t bother looking into it, I don’t even care if he’s associated with it.</i></p><p>“So I guess it’s a communist globalist conspiracy or something like this, I didn’t look into it.” If you want to make a video about this subject – and then Sargon goes on, by the way, to counter the point that he imagines Vox Day may have done while he admittedly didn’t read the article. Of course, the article by Vox Day was not saying that Jordan Peterson is involved in a communist conspiracy. The point by Sargon passes right beside the point made by Vox Day.</p><p>The point made by Vox Day is that Jordan Peterson is involved in international conferences that talk about immigration, that seek to open countries to immigration, and that also featured speakers like John Podesta with a known share from the Democratic Party. He is the gateway for the control of the Democratic Party by rich elites and so this is a fair critique that Vox Day has done of Jordan Peterson, and Sargon misrepresents it as a paranoid representation of Jordan Peterson being involved in a communist conspiracy.</p></blockquote><p>They go into more detail; watch the video from 36:06 to 41:00 to catch their whole take on it. And JFG is absolutely right; if one is going to opine on a paper, one has the duty to actually read it. It is <i>because </i>Sargon disagrees with me that he really ought to do better. As he would learn if he actually bothered to look into the matter, Jordan Peterson is involved in the opposite of a godless communist conspiracy, he is the author of the narrative for a massive globalist corporatist campaign that involves governments, NGOs, international corporations, and academics.</p><p>But Sargon isn’t the only Peterson defender determined to avert his eyes rather than discover what the Prophet of Do What Thou Deemest to be Desirable is actually doing. One poor Jordanologist who is destined for disenchantment was clearly grasping at straws when he decided to advocate for the devil.</p><blockquote class=\"tr_bq\"><p>Devil’s Advocate for a moment: The UN’s IPCC report had many scientists ask to have their names removed because they disagreed with the conclusions and how the report was being used for political purposes.  Do you think that could be the case here? That JP was a “contributor” the UN report, but if you asked him about it, he would disagree with its conclusions?﻿</p></blockquote><p>No, that cannot be the case here. Given that Jordan Peterson himself publicly claimed to have written the narrative of the final draft, from which he removed “the ideological claptrap” contained in the previous drafts, there can be no question that he is not only a full-blown supporter of <i><b><a href=\"https://sustainabledevelopment.un.org/content/documents/8932013-05{5ef772fee69ac4b193684519cdfa7d08db277ef27bc2bea5ca166bcd02367f0a}20-{5ef772fee69ac4b193684519cdfa7d08db277ef27bc2bea5ca166bcd02367f0a}20HLP{5ef772fee69ac4b193684519cdfa7d08db277ef27bc2bea5ca166bcd02367f0a}20Report{5ef772fee69ac4b193684519cdfa7d08db277ef27bc2bea5ca166bcd02367f0a}20-{5ef772fee69ac4b193684519cdfa7d08db277ef27bc2bea5ca166bcd02367f0a}20A{5ef772fee69ac4b193684519cdfa7d08db277ef27bc2bea5ca166bcd02367f0a}20New{5ef772fee69ac4b193684519cdfa7d08db277ef27bc2bea5ca166bcd02367f0a}20Global{5ef772fee69ac4b193684519cdfa7d08db277ef27bc2bea5ca166bcd02367f0a}20Partnership.pdf\">A New Global Partnership</a></b></i>, but that whatever ideology remains in it is something with which he, at the very least, has no problem. Read the report; it’s only 81 pages and it’s considerably easier to read than either <i>12 Rules of Life</i> or <i>Maps of Meaning</i>.</p><p>This whole Jordanetics affair reminds me more and more of the New Atheists. Then, as now, I appear to have read considerably more of their works than any of their fans appear to have bothered reading.</p></div>",
  "content_text": "The Public Space asserts that my fellow GamerGater misrepresented me in a YouTube video entitled\nSargon Misrepresents Vox Day About Jordan Peterson\n:\nSargon of Akkad is ruining my name now because there’s text that I’ve written which says Sargon of Akkad is solid, he always fairly represents even his opponent, but on a video published two days ago he misrepresents Vox Day, presenting his blog post as attributing a communist conspiracy to Jordan Peterson, which is not at all what Vox Day was saying. Let’s hear the statement by Sargon:\nSo in the last few days an Alt-Right science fiction author called Vox day on his blog has exposed Jordan Peterson being involved with a new global partnership to eradicate poverty and transform across economies through sustainable development, which I guess is some communist globalist conspiracy or something. I haven’t bother looking into it, I don’t even care if he’s associated with it.\n“So I guess it’s a communist globalist conspiracy or something like this, I didn’t look into it.” If you want to make a video about this subject – and then Sargon goes on, by the way, to counter the point that he imagines Vox Day may have done while he admittedly didn’t read the article. Of course, the article by Vox Day was not saying that Jordan Peterson is involved in a communist conspiracy. The point by Sargon passes right beside the point made by Vox Day.\nThe point made by Vox Day is that Jordan Peterson is involved in international conferences that talk about immigration, that seek to open countries to immigration, and that also featured speakers like John Podesta with a known share from the Democratic Party. He is the gateway for the control of the Democratic Party by rich elites and so this is a fair critique that Vox Day has done of Jordan Peterson, and Sargon misrepresents it as a paranoid representation of Jordan Peterson being involved in a communist conspiracy.\nThey go into more detail; watch the video from 36:06 to 41:00 to catch their whole take on it. And JFG is absolutely right; if one is going to opine on a paper, one has the duty to actually read it. It is\nbecause\nSargon disagrees with me that he really ought to do better. As he would learn if he actually bothered to look into the matter, Jordan Peterson is involved in the opposite of a godless communist conspiracy, he is the author of the narrative for a massive globalist corporatist campaign that involves governments, NGOs, international corporations, and academics.\nBut Sargon isn’t the only Peterson defender determined to avert his eyes rather than discover what the Prophet of Do What Thou Deemest to be Desirable is actually doing. One poor Jordanologist who is destined for disenchantment was clearly grasping at straws when he decided to advocate for the devil.\nDevil’s Advocate for a moment: The UN’s IPCC report had many scientists ask to have their names removed because they disagreed with the conclusions and how the report was being used for political purposes.  Do you think that could be the case here? That JP was a “contributor” the UN report, but if you asked him about it, he would disagree with its conclusions?﻿\nNo, that cannot be the case here. Given that Jordan Peterson himself publicly claimed to have written the narrative of the final draft, from which he removed “the ideological claptrap” contained in the previous drafts, there can be no question that he is not only a full-blown supporter of\nA New Global Partnership\n, but that whatever ideology remains in it is something with which he, at the very least, has no problem. Read the report; it’s only 81 pages and it’s considerably easier to read than either\n12 Rules of Life\nor\nMaps of Meaning\n.\nThis whole Jordanetics affair reminds me more and more of the New Atheists. Then, as now, I appear to have read considerably more of their works than any of their fans appear to have bothered reading.",
  "tags": [
    "Jordanetics"
  ],
  "categories": [],
  "sitemap_lastmod": "2018-05-18T14:06:14+00:00"
}