{
  "url": "https://voxday.net/2018/05/04/a-restructuring-seems-in-order/",
  "scraped_at": "2025-12-19T21:00:23.468406",
  "title": "A restructuring seems in order",
  "date_display": "May 4, 2018",
  "date_iso": "2018-05-04T20:00:08+00:00",
  "date_from_url": "2018-05-04",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>This is an informative article <a href=\"http://www.unz.com/plang/israels-juvenile-ground-army/\">on the unique structure of the IDF</a>, which explains both the apparent indiscipline of the IDF with regards to the Gaza protests as well as the underperformance of the IDF in the 2006 war with Hezbollah.</p><blockquote><p>There are no career ground force sergeants except as technicians. Unless the system has changed very recently, the IDF ground forces typically do not have career NCOs in the LINE of the combat arms. This is a structural tradition that derives originally from the Russian tsar’s army and which came to Palestine through Russian and Polish Zionist immigrants. This tradition of organization passed through the Hagenah into the IDF. The IDF “line” conscripts what amount to yearly classes of recruits and selects from them more promising soldiers who are given NCO level command responsibilities as; infantry leaders, tank commanders, artillery gun captains, etc. The IDF does have career NCOs but they are typically found in jobs of a more technical nature rather than junior combat command at the squad or platoon (section) level.</p><p>As a result, junior officers (company grade) are required to perform duties that in more traditionally organized armies would be performed by sergeants. Leading a small combat or reconnaissance patrol would be an example. As a result, a non-reserve infantry or tank company in the field consists of people who are all about the same age (19-22) and commanded by a captain in his mid-20s. What is missing in this scene is the voice of grown up counsel provided by sergeants in their 30s and 40s telling these young people what it is that would be wise to do based on real experience and mature judgment. In contrast a 22 year old American platoon leader would have a mature platoon sergeant as his assistant and counselor.</p><p>As a result of this system of manning, the IDF’s ground force is more unpredictable and volatile at the tactical (company) level than might be the case otherwise. The national government has a hard time knowing whether or not specific policies will be followed in the field.</p></blockquote><p>To put this problem into perspective, if you’ve seen <i>Band of Brothers</i>, then you have some idea of the importance of the role that sergeants play in an infantry company. It was the sergeants’ revolt that led to Easy Company being led into battle by Dick Winters instead of Herbert Sobel, and it was Sgt. Carwood Lipton (played by Donnie Wahlberg) who was credited by Winters’s eventual replacement, Ronald Speirs, for holding Easy Company together.</p><p>If I were an IDF strategist, I would look very long and hard at figuring out how to get some seasoned veterans salting the smaller tactical units. The principle of having experienced veterans advising young officers has been a fundamental one of successful military organizations since Rome’s battle-hardened centurions were advising young patrician tribunes embarking upon the <i>cursum honorum</i>.</p></div>",
  "content_text": "This is an informative article\non the unique structure of the IDF\n, which explains both the apparent indiscipline of the IDF with regards to the Gaza protests as well as the underperformance of the IDF in the 2006 war with Hezbollah.\nThere are no career ground force sergeants except as technicians. Unless the system has changed very recently, the IDF ground forces typically do not have career NCOs in the LINE of the combat arms. This is a structural tradition that derives originally from the Russian tsar’s army and which came to Palestine through Russian and Polish Zionist immigrants. This tradition of organization passed through the Hagenah into the IDF. The IDF “line” conscripts what amount to yearly classes of recruits and selects from them more promising soldiers who are given NCO level command responsibilities as; infantry leaders, tank commanders, artillery gun captains, etc. The IDF does have career NCOs but they are typically found in jobs of a more technical nature rather than junior combat command at the squad or platoon (section) level.\nAs a result, junior officers (company grade) are required to perform duties that in more traditionally organized armies would be performed by sergeants. Leading a small combat or reconnaissance patrol would be an example. As a result, a non-reserve infantry or tank company in the field consists of people who are all about the same age (19-22) and commanded by a captain in his mid-20s. What is missing in this scene is the voice of grown up counsel provided by sergeants in their 30s and 40s telling these young people what it is that would be wise to do based on real experience and mature judgment. In contrast a 22 year old American platoon leader would have a mature platoon sergeant as his assistant and counselor.\nAs a result of this system of manning, the IDF’s ground force is more unpredictable and volatile at the tactical (company) level than might be the case otherwise. The national government has a hard time knowing whether or not specific policies will be followed in the field.\nTo put this problem into perspective, if you’ve seen\nBand of Brothers\n, then you have some idea of the importance of the role that sergeants play in an infantry company. It was the sergeants’ revolt that led to Easy Company being led into battle by Dick Winters instead of Herbert Sobel, and it was Sgt. Carwood Lipton (played by Donnie Wahlberg) who was credited by Winters’s eventual replacement, Ronald Speirs, for holding Easy Company together.\nIf I were an IDF strategist, I would look very long and hard at figuring out how to get some seasoned veterans salting the smaller tactical units. The principle of having experienced veterans advising young officers has been a fundamental one of successful military organizations since Rome’s battle-hardened centurions were advising young patrician tribunes embarking upon the\ncursum honorum\n.",
  "tags": [
    "war"
  ],
  "categories": [],
  "sitemap_lastmod": "2018-05-04T19:00:08+00:00"
}