{
  "url": "https://voxday.net/2018/05/17/alt%e2%98%85hero-1-the-initial-reactions/",
  "scraped_at": "2025-12-19T21:02:33.540363",
  "title": "Alt★Hero #1: the initial reactions",
  "date_display": "May 17, 2018",
  "date_iso": "2018-05-17T13:37:03+00:00",
  "date_from_url": "2018-05-17",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><div class=\"separator\" style=\"clear: both; text-align: center;\"><a href=\"https://cdn.idka.com/3a61a65f-d446-412f-a06d-cb3d92078583\" imageanchor=\"1\" style=\"margin-left: 1em; margin-right: 1em;\"><noscript><img border=\"0\" data-original-height=\"478\" data-original-width=\"460\" decoding=\"async\" src=\"https://cdn.idka.com/3a61a65f-d446-412f-a06d-cb3d92078583\"/></noscript><img border=\"0\" class=\"lazyload\" data-original-height=\"478\" data-original-width=\"460\" data-src=\"https://cdn.idka.com/3a61a65f-d446-412f-a06d-cb3d92078583\" decoding=\"async\" src=\"data:image/svg+xml,%3Csvg%20xmlns=%22http://www.w3.org/2000/svg%22%20viewBox=%220%200%20460%20478%22%3E%3C/svg%3E\"/></a></div><p>Some of the initial reactions to the first digital edition of Alt★Hero, Issue #1, from email and the forums. The general reaction is extremely positive.</p><ul><li>I liked the artstyle and colouring. The story so far is gripping, and as someone who backed this project in order to start hitting back in the culture war in order to provide some sensible reading material for the next generation, I love the result.</li><li>Really loving the story so far! One satisfied backer!</li><li>I just wanted to congratulate you and your production team on Alt*Hero 1.  It’s spectacularly well-drawn, and the story line, while still abbreviated, holds promise for a lot of development further down the road.  I think it’s more than capable of giving Marvel, DC, etc. a run for their money.</li><li>Overall, well done.</li><li>First thought: nothing like clearing the fences on the first swing, with the grumble that you were just warming up. The coloring was great, story was succinct and spot-on; it’s amazing what you can do with the correct amount of dialogue. Excellent artwork that showed the story and reaction without needing to tell. That’s a lot of dynamic range in the action and wording. The climax and ending surprised me.</li><li>The coloring was wonderful, art was solid and the story was well-paced and not overly talk-y (a la Bendis, which I hate). Rainbow was handled perfectly, I thought, all body language and natural dialogue with none of the SJW preachiness we’re used to, either in one direction or another. Great start overall. Vox is definitely on to something here.</li><li>Just finished reading Alt*Hero #1. I really enjoyed it. Topical to world events, fun “bad” guys, with a sense of ominous foreboding on what’s coming up in the series.</li><li>This is why I donated. A big thank-you to the Alt-Hero and Arkhaven teams.</li><li>Congrats mate.  Huge professional accomplishment.</li></ul><div>That being said, we are absolutely not resting on any initial laurels. Some professional criticism from various industry pros:</div><div><ul><li>This was a very nice origin story for Dynamique and set up the global landscape for the series. I think starting in Europe is smart as everyone’s going to expect #MAGA American politics.</li><li>Fast-paced. Funny where it needs to be. God, could comics use some humor right now.</li><li>The lettering. The balloons are too cramped and the lettering doesn’t stack right. The font is bad as well. The worst aspect is the placement. Too often balloons are placed to cover actions or primary figures. It’s especially frustrating when plenty of available negative space is left uncovered that would been better real estate for the balloons.</li><li>Overall I’d call the story 4.5/5. It’s just minor elements, nothing major. Art I’d call at 2.5/5 could use major improvement.</li><li>Establishment panels. Reading this whole, I see that it needed establishment panels at the beginning of most transition scenes. We need to know where the characters are in relation to one another and their environment before proceeding. </li><li>The characters are very distinct, and you can tell who is speaking mostly just based on the dialogue itself which is much better than most comics. Your use of humor is also very important — it sets the stage that this is not all that serious, which actually helps the reader forget about the art a little bit. If the tone was more serious, the art would matter and stick out more. Overall, it’s compelling.</li></ul><div>And not everyone was equally enthusiastic.</div><div><ul><li>I read the backer copy of Alt★Hero #1, and I have to be honest with you. It was total crap. The art was atrocious and amateurish. Scene transitions were awkward. Also, certain shots were composed in a confusing way. I got no sense of Dynamique’s motivations. There were way too many characters introduced from the beginning, drowning out Dynamique even further. The beginning itself had a very basic flaw — why should we care that this redheaded model is being kidnapped at all? </li></ul></div><div>I am not at all fazed by the criticism, and I think most of the professional criticism is both valid and worthy of figuring out how to address in the future. Let’s face it, it is a better first effort than my first solo novel. I am very pleased with the general nature of the professional criticism, because I have known from the start that the technical elements would inevitably take us time and experience to master. As I mentioned in my conversation with Ethan van Scriver, you can fix the art, you can fix the technical aspects, but you cannot fix the story or the characters. They are either interesting or they are not. And ultimately, it is the story and the characters that will determine the success of the endeavor.<p>UPDATE: As many people predicted, the naysayers who claimed Alt★Hero was a scam are simply moving the goalposts now that Issue #1 has been released. Which is why I never bothered to engage with any of them, but just ignored the petty little anklebiters from the start. And I will continue to do so. They never had any credibility in the first place, as I’m from the game industry, I subscribe to the id Software philosophy of “it’s done when it’s done,” and I never gave any hard release dates in the first place. People will continue to trash it – especially Jordan Peterson fans, it appears – and that will only help us become more successful over time.</p><p>I also note that we are providing considerably more than we promised. Yes, the digital version of the first issue is out to backers. But we will also release a print edition of that first issue very soon, which we neither planned nor promised to do, <i>and we will release it in four languages</i>. I’m selecting the font for the French, Italian, and German versions this week, because Backissues BB, the Blambot font we used for the digital edition, does not have the necessary accents.</p><p>Also, our comics will never appear in the previews. We don’t work with Diamond and we don’t talk to the comics media. If you want to know what we’re doing, you’ll have to subscribe to our email newsletter, which right now is only available to backers.</p><p>LateNightComics<br>I’ve been calling Vox Day’s #althero a scam since day one. Even argued with him about it. Still no comic hahaha…. what a JOKE!</br></p><p>LateNightComics<br>So far every deadline has been missed, it’s not in previews and I haven’t seen a single person review it. Vox Day is a liar and #althero is a scam that hurt our side. Vox can either deliver the issue or refund the money he took under false pretenses.</br></p><p>LateNightComics<br>Sorry Jon I know you and Vox are boys you should encourage him to be a man and follow through on his word instead of getting himself banned on purpose and pocketing the money.</br></p><p>LateNightComics<br>If @DiversityAndCmx pulled the same bullshit as Vox Day I would never stop calling him out. @JonMalin and @BrettRSmith76 have reputations worth protecting I guess Vox doesn’t care what people think about him.</br></p><p>LateNightComics<br>He paid the people he needed to pay so there’s that at least. It just hurts all indie fundraisers when crooks and liars get involved in our hobby and trash it with bull crap like #althero</br></p><p>Flannel Avenger<br>So, when Alt-Hero ships I take it that you will publicly recant your accusations of scam?</br></p><p>LateNightComics<br>No I won’t it’s still a garbage comic and he still pocketed most of that money to prop up other projects.</br></p><p>Jawbreakers Fan Jon Del Arroz<br>How do you know it’s a garbage comic when you just said it doesn’t exist? This is backward logic and haterade nonsense.</br></p><p>LateNightComics<br>Maybe you’re right and Vox is simply horrible at marketing his product. He was high energy when he was fundraising now it’s sleepy time once the checks cleared.</br></p><p>LateNightComics<br>If Vox wanted people like me to shut up he could announce a hard release date or eat his shorts.</br></p><p>Jawbreakers Fan Jon Del Arroz<br>Yeah, we’re talking 2 months late from the goal which was made clear was not a promise timing wise from day one and this guy’s flipping out.</br></p><p>LateNightComics<br>I’m not flipping out, I’m calling out. It’s got to be done sometimes and horrible customer service is Dan Slott/ Mark Waid behavior. I just had hoped Vox would be different than those guys.</br></p></div></div></div>",
  "content_text": "Some of the initial reactions to the first digital edition of Alt★Hero, Issue #1, from email and the forums. The general reaction is extremely positive.\nI liked the artstyle and colouring. The story so far is gripping, and as someone who backed this project in order to start hitting back in the culture war in order to provide some sensible reading material for the next generation, I love the result.\nReally loving the story so far! One satisfied backer!\nI just wanted to congratulate you and your production team on Alt*Hero 1.  It’s spectacularly well-drawn, and the story line, while still abbreviated, holds promise for a lot of development further down the road.  I think it’s more than capable of giving Marvel, DC, etc. a run for their money.\nOverall, well done.\nFirst thought: nothing like clearing the fences on the first swing, with the grumble that you were just warming up. The coloring was great, story was succinct and spot-on; it’s amazing what you can do with the correct amount of dialogue. Excellent artwork that showed the story and reaction without needing to tell. That’s a lot of dynamic range in the action and wording. The climax and ending surprised me.\nThe coloring was wonderful, art was solid and the story was well-paced and not overly talk-y (a la Bendis, which I hate). Rainbow was handled perfectly, I thought, all body language and natural dialogue with none of the SJW preachiness we’re used to, either in one direction or another. Great start overall. Vox is definitely on to something here.\nJust finished reading Alt*Hero #1. I really enjoyed it. Topical to world events, fun “bad” guys, with a sense of ominous foreboding on what’s coming up in the series.\nThis is why I donated. A big thank-you to the Alt-Hero and Arkhaven teams.\nCongrats mate.  Huge professional accomplishment.\nThat being said, we are absolutely not resting on any initial laurels. Some professional criticism from various industry pros:\nThis was a very nice origin story for Dynamique and set up the global landscape for the series. I think starting in Europe is smart as everyone’s going to expect #MAGA American politics.\nFast-paced. Funny where it needs to be. God, could comics use some humor right now.\nThe lettering. The balloons are too cramped and the lettering doesn’t stack right. The font is bad as well. The worst aspect is the placement. Too often balloons are placed to cover actions or primary figures. It’s especially frustrating when plenty of available negative space is left uncovered that would been better real estate for the balloons.\nOverall I’d call the story 4.5/5. It’s just minor elements, nothing major. Art I’d call at 2.5/5 could use major improvement.\nEstablishment panels. Reading this whole, I see that it needed establishment panels at the beginning of most transition scenes. We need to know where the characters are in relation to one another and their environment before proceeding.\nThe characters are very distinct, and you can tell who is speaking mostly just based on the dialogue itself which is much better than most comics. Your use of humor is also very important — it sets the stage that this is not all that serious, which actually helps the reader forget about the art a little bit. If the tone was more serious, the art would matter and stick out more. Overall, it’s compelling.\nAnd not everyone was equally enthusiastic.\nI read the backer copy of Alt★Hero #1, and I have to be honest with you. It was total crap. The art was atrocious and amateurish. Scene transitions were awkward. Also, certain shots were composed in a confusing way. I got no sense of Dynamique’s motivations. There were way too many characters introduced from the beginning, drowning out Dynamique even further. The beginning itself had a very basic flaw — why should we care that this redheaded model is being kidnapped at all?\nI am not at all fazed by the criticism, and I think most of the professional criticism is both valid and worthy of figuring out how to address in the future. Let’s face it, it is a better first effort than my first solo novel. I am very pleased with the general nature of the professional criticism, because I have known from the start that the technical elements would inevitably take us time and experience to master. As I mentioned in my conversation with Ethan van Scriver, you can fix the art, you can fix the technical aspects, but you cannot fix the story or the characters. They are either interesting or they are not. And ultimately, it is the story and the characters that will determine the success of the endeavor.\nUPDATE: As many people predicted, the naysayers who claimed Alt★Hero was a scam are simply moving the goalposts now that Issue #1 has been released. Which is why I never bothered to engage with any of them, but just ignored the petty little anklebiters from the start. And I will continue to do so. They never had any credibility in the first place, as I’m from the game industry, I subscribe to the id Software philosophy of “it’s done when it’s done,” and I never gave any hard release dates in the first place. People will continue to trash it – especially Jordan Peterson fans, it appears – and that will only help us become more successful over time.\nI also note that we are providing considerably more than we promised. Yes, the digital version of the first issue is out to backers. But we will also release a print edition of that first issue very soon, which we neither planned nor promised to do,\nand we will release it in four languages\n. I’m selecting the font for the French, Italian, and German versions this week, because Backissues BB, the Blambot font we used for the digital edition, does not have the necessary accents.\nAlso, our comics will never appear in the previews. We don’t work with Diamond and we don’t talk to the comics media. If you want to know what we’re doing, you’ll have to subscribe to our email newsletter, which right now is only available to backers.\nLateNightComics\nI’ve been calling Vox Day’s #althero a scam since day one. Even argued with him about it. Still no comic hahaha…. what a JOKE!\nLateNightComics\nSo far every deadline has been missed, it’s not in previews and I haven’t seen a single person review it. Vox Day is a liar and #althero is a scam that hurt our side. Vox can either deliver the issue or refund the money he took under false pretenses.\nLateNightComics\nSorry Jon I know you and Vox are boys you should encourage him to be a man and follow through on his word instead of getting himself banned on purpose and pocketing the money.\nLateNightComics\nIf @DiversityAndCmx pulled the same bullshit as Vox Day I would never stop calling him out. @JonMalin and @BrettRSmith76 have reputations worth protecting I guess Vox doesn’t care what people think about him.\nLateNightComics\nHe paid the people he needed to pay so there’s that at least. It just hurts all indie fundraisers when crooks and liars get involved in our hobby and trash it with bull crap like #althero\nFlannel Avenger\nSo, when Alt-Hero ships I take it that you will publicly recant your accusations of scam?\nLateNightComics\nNo I won’t it’s still a garbage comic and he still pocketed most of that money to prop up other projects.\nJawbreakers Fan Jon Del Arroz\nHow do you know it’s a garbage comic when you just said it doesn’t exist? This is backward logic and haterade nonsense.\nLateNightComics\nMaybe you’re right and Vox is simply horrible at marketing his product. He was high energy when he was fundraising now it’s sleepy time once the checks cleared.\nLateNightComics\nIf Vox wanted people like me to shut up he could announce a hard release date or eat his shorts.\nJawbreakers Fan Jon Del Arroz\nYeah, we’re talking 2 months late from the goal which was made clear was not a promise timing wise from day one and this guy’s flipping out.\nLateNightComics\nI’m not flipping out, I’m calling out. It’s got to be done sometimes and horrible customer service is Dan Slott/ Mark Waid behavior. I just had hoped Vox would be different than those guys.",
  "tags": [
    "Alt-Hero"
  ],
  "categories": [],
  "sitemap_lastmod": "2018-05-17T12:37:03+00:00"
}