{
  "url": "https://voxday.net/2018/05/13/an-eminent-person/",
  "scraped_at": "2025-12-19T21:01:47.126451",
  "title": "An eminent person",
  "date_display": "May 13, 2018",
  "date_iso": "2018-05-13T13:19:15+00:00",
  "date_from_url": "2018-05-13",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>/pol/ is <a href=\"https://8ch.net/pol/res/11576451.html#11576451\">onto the Jordanetics fraud</a>.</p><p>UPDATE: The 8chan thread already got nuked, so it has been <a href=\"https://boards.4chan.org/pol/thread/171451022\">reposted at 4chan</a>, and has also been <a href=\"https://archive.fo/8zMNU\">archived</a>.</p><blockquote class=\"tr_bq\"><p>Jordan B. Peterson worked on the UN Secretary General’s High Level Panel on Sustainable Development, editing a document that was released in 2013 entitled ‘A NEW GLOBAL PARTNERSHIP: ERADICATE POVERTY AND TRANSFORM ECONOMIES THROUGH SUSTAINABLE DEVELOPMENT’. One of the panel members of this UN High Council was none other than skippy himself, John Podesta.</p></blockquote><p><b>A NEW GLOBAL PARTNERSHIP:ERADICATE POVERTY AND TRANSFORM ECONOMIES THROUGH SUSTAINABLE DEVELOPMENT</b><br><b>The Report of the High-Level Panel of Eminent Persons on the Post-2015 Development Agenda</b></br></p><p>In July 2012, Secretary-General Ban Ki-moon announced the 27 members of a High-level Panel to advise on the global development framework beyond 2015, the target date for the Millennium Development Goals (MDGs).</p><p>The Panel was part of the Secretary-General’s post-2015 initiative mandated by the 2010 MDG Summit. UN Member States have called for open, inclusive consultations involving civil society, the private sector, academia and research institutions from all regions, in addition to the UN system, to advance the development framework beyond 2015.</p><p><i>There  is  a  global  ethic  for  a globalised  world,  based on  our   common  humanity,  the  Rio  principles  and  the shared ethos of all  traditions: “do as you would be done by.”  </i></p><blockquote><p>Look what it says on page 18 under the heading ‘Global Impact by 2030’:</p><p><b>International Migration:</b></p><p><i>The universal human rights and fundamental freedoms of migrants must be respected. These migrants make a positive economic contribution to their host countries, by building up their labour force.</i></p></blockquote><p>From the report: <i>The  deliberations  of  the  Panel  were  informed  by  the  broad  consultative  process  conducted  by  the  United  Nations,  as  directed  by  the  Secretary-General  in  our  terms  of reference. This includes national and global thematic consultations under the aegis of the United Nations Development Group (UNDG), regional consultations undertaken by  the  Regional  Commissions,  consultations  with  businesses  around  the  world  under  the guidance of the UN Global Compact, and the views of the scientific and academic community as conveyed through the Sustainable Development Solutions Network. We are grateful for the perspective these extensive consultations provided.</i></p><p>Some initially doubted that Peterson was actually involved with this UN agenda, since he is not listed among the 27 members of the panel. However, <a href=\"https://www.youtube.com/watch?v=8KUnK_Nz1ws\">in an interview</a> with <i>The Dark Room Podcast</i> in October 2016, Peterson openly declared that he was not merely involved with the UN HLP report, but actually wrote the underlying narrative for it.</p><p><i>I’m a media whore, you know…. I’m a professor at the University of Toronto so far. I’m a clinical psychologist, I have a clinical practice, I’m a business consultant, I do executive coaching, mostly for senior partners of big law firms. I run a testing business for the world’s biggest early-stage technology incubator in California, called the Founder Institute. They’ve started 2,000 business in the past five years and I’ve screened all 30,000 of their entrants because I know how to predict entrepreneurial ability. I designed a program called Future Authoring that has helped more than 7,000 university students improve their grades by 25 percent and decrease their dropout by about the same amount. I worked on the UN Secretary-General’s High Panel for Sustainability Report that was delivered, I believe, in 2013, and rewrote the underlying narrative to strip out most of the ideological claptrap.</i><br><i><br/></i>His involvement with the UN was also <a href=\"https://archive.fo/ejdQY\">confirmed in his bio</a> at Moses Znaimer’s conference,<i> Ideacity:</i></br></p><blockquote class=\"tr_bq\"><p>Dr. Jordan Peterson has been a dishwasher, gas jockey, bartender, beekeeper, and railway line worker. He’s taught mythology to lawyers, doctors and businessmen, consulted for the UN Secretary General’s High Level Panel on Sustainable Development, helped his clinical clients manage depression, OCD, anxiety, and schizophrenia, and lectured extensively internationally. Dr. Peterson has published more than 100 scientific papers, and revolutionized the psychology of religion with his book <i>Maps of Meaning: The Architecture of Belief</i>. As a Harvard professor, he was nominated for the prestigious Levinson Teaching Prize. His YouTube channel’s videos have over 8,000,000 views, and his lectures on mythology were turned into a popular 13-part series on TVO. Dr. Peterson’s online self-help program, <i>The Self Authoring Suite</i>, has been featured in Oprah Magazine, CBC Radio and NPR, and has helped over 100,000 people resolve the problems of their past and radically improve their future.</p></blockquote><p>I can’t say I’m even a little bit surprised to learn that <a href=\"https://media.8ch.net/file_store/bb111d08ae9d87bbaa6193448223e12588a0ac3f25a606a240e00a04e87df11d.jpg\">Peterson is NWO</a>, given that one of his stated motives is to dissuade young men from opposing the neo-liberal world order. But Peterson’s involvement in writing that particular document is interesting in light of how, in <i>Maps of Meaning</i>, he explicitly observes that immigrating foreigners have been considered a source of chaos dating back to the classical era. That would put the imperative for the Hero to “slay the Dragon of Chaos” into a new perspective, would it not? In other words, there is now very good reason to believe that Peterson actually knows the extent of the philosophical evil he is advocating; he is not some sort of naive, accidental Pied Piper.</p><p>It is clear that Peterson is not, and never has been, what he presents himself as being. Once I finished the first chapter of <i>Maps of Meaning</i>, a thought struck me – which I will later explicate, as it is relevant to demonstrating what an intellectual fraud he is and how wholly ignorant of the Western canon – and I predicted to a companion that there would be less than FIVE references to Aristotle, Thomas Aquinas, and Augustine in the entire 714-page book.</p><p>Then I did a search. There were two references to Aristotle. TWO! That was all. My companion was duly impressed, especially when I contrasted that lack of references with the vast number of references to Jung, Freud, and Plato. Now, here is the punchline: both references to Aristotle were contained in a single quotation by “the eminent theologist Reinhold Niebuhr”. Peterson never once refers to Aristotle himself, or any of the great philosopher’s many works.</p><p>I had been wondering how Peterson could produce some of the stupid and obviously false statements he had made about history, such as medieval people not being familiar with rhetoric, or the ancients not knowing how to think empirically. But apparently he really is that ignorant, because he’s never actually read most of the classics, he has only read <i>about </i>them, third- or even fourth-hand.</p><p>Forget his being buddy-buddy with Ben Shapiro. That’s bad enough, but this guy de-platformed Faith Goldy for her associations… <i>and he’s connected to John freaking Podesta!</i></p></div>",
  "content_text": "/pol/ is\nonto the Jordanetics fraud\n.\nUPDATE: The 8chan thread already got nuked, so it has been\nreposted at 4chan\n, and has also been\narchived\n.\nJordan B. Peterson worked on the UN Secretary General’s High Level Panel on Sustainable Development, editing a document that was released in 2013 entitled ‘A NEW GLOBAL PARTNERSHIP: ERADICATE POVERTY AND TRANSFORM ECONOMIES THROUGH SUSTAINABLE DEVELOPMENT’. One of the panel members of this UN High Council was none other than skippy himself, John Podesta.\nA NEW GLOBAL PARTNERSHIP:ERADICATE POVERTY AND TRANSFORM ECONOMIES THROUGH SUSTAINABLE DEVELOPMENT\nThe Report of the High-Level Panel of Eminent Persons on the Post-2015 Development Agenda\nIn July 2012, Secretary-General Ban Ki-moon announced the 27 members of a High-level Panel to advise on the global development framework beyond 2015, the target date for the Millennium Development Goals (MDGs).\nThe Panel was part of the Secretary-General’s post-2015 initiative mandated by the 2010 MDG Summit. UN Member States have called for open, inclusive consultations involving civil society, the private sector, academia and research institutions from all regions, in addition to the UN system, to advance the development framework beyond 2015.\nThere  is  a  global  ethic  for  a globalised  world,  based on  our   common  humanity,  the  Rio  principles  and  the shared ethos of all  traditions: “do as you would be done by.”\nLook what it says on page 18 under the heading ‘Global Impact by 2030’:\nInternational Migration:\nThe universal human rights and fundamental freedoms of migrants must be respected. These migrants make a positive economic contribution to their host countries, by building up their labour force.\nFrom the report:\nThe  deliberations  of  the  Panel  were  informed  by  the  broad  consultative  process  conducted  by  the  United  Nations,  as  directed  by  the  Secretary-General  in  our  terms  of reference. This includes national and global thematic consultations under the aegis of the United Nations Development Group (UNDG), regional consultations undertaken by  the  Regional  Commissions,  consultations  with  businesses  around  the  world  under  the guidance of the UN Global Compact, and the views of the scientific and academic community as conveyed through the Sustainable Development Solutions Network. We are grateful for the perspective these extensive consultations provided.\nSome initially doubted that Peterson was actually involved with this UN agenda, since he is not listed among the 27 members of the panel. However,\nin an interview\nwith\nThe Dark Room Podcast\nin October 2016, Peterson openly declared that he was not merely involved with the UN HLP report, but actually wrote the underlying narrative for it.\nI’m a media whore, you know…. I’m a professor at the University of Toronto so far. I’m a clinical psychologist, I have a clinical practice, I’m a business consultant, I do executive coaching, mostly for senior partners of big law firms. I run a testing business for the world’s biggest early-stage technology incubator in California, called the Founder Institute. They’ve started 2,000 business in the past five years and I’ve screened all 30,000 of their entrants because I know how to predict entrepreneurial ability. I designed a program called Future Authoring that has helped more than 7,000 university students improve their grades by 25 percent and decrease their dropout by about the same amount. I worked on the UN Secretary-General’s High Panel for Sustainability Report that was delivered, I believe, in 2013, and rewrote the underlying narrative to strip out most of the ideological claptrap.\nHis involvement with the UN was also\nconfirmed in his bio\nat Moses Znaimer’s conference,\nIdeacity:\nDr. Jordan Peterson has been a dishwasher, gas jockey, bartender, beekeeper, and railway line worker. He’s taught mythology to lawyers, doctors and businessmen, consulted for the UN Secretary General’s High Level Panel on Sustainable Development, helped his clinical clients manage depression, OCD, anxiety, and schizophrenia, and lectured extensively internationally. Dr. Peterson has published more than 100 scientific papers, and revolutionized the psychology of religion with his book\nMaps of Meaning: The Architecture of Belief\n. As a Harvard professor, he was nominated for the prestigious Levinson Teaching Prize. His YouTube channel’s videos have over 8,000,000 views, and his lectures on mythology were turned into a popular 13-part series on TVO. Dr. Peterson’s online self-help program,\nThe Self Authoring Suite\n, has been featured in Oprah Magazine, CBC Radio and NPR, and has helped over 100,000 people resolve the problems of their past and radically improve their future.\nI can’t say I’m even a little bit surprised to learn that\nPeterson is NWO\n, given that one of his stated motives is to dissuade young men from opposing the neo-liberal world order. But Peterson’s involvement in writing that particular document is interesting in light of how, in\nMaps of Meaning\n, he explicitly observes that immigrating foreigners have been considered a source of chaos dating back to the classical era. That would put the imperative for the Hero to “slay the Dragon of Chaos” into a new perspective, would it not? In other words, there is now very good reason to believe that Peterson actually knows the extent of the philosophical evil he is advocating; he is not some sort of naive, accidental Pied Piper.\nIt is clear that Peterson is not, and never has been, what he presents himself as being. Once I finished the first chapter of\nMaps of Meaning\n, a thought struck me – which I will later explicate, as it is relevant to demonstrating what an intellectual fraud he is and how wholly ignorant of the Western canon – and I predicted to a companion that there would be less than FIVE references to Aristotle, Thomas Aquinas, and Augustine in the entire 714-page book.\nThen I did a search. There were two references to Aristotle. TWO! That was all. My companion was duly impressed, especially when I contrasted that lack of references with the vast number of references to Jung, Freud, and Plato. Now, here is the punchline: both references to Aristotle were contained in a single quotation by “the eminent theologist Reinhold Niebuhr”. Peterson never once refers to Aristotle himself, or any of the great philosopher’s many works.\nI had been wondering how Peterson could produce some of the stupid and obviously false statements he had made about history, such as medieval people not being familiar with rhetoric, or the ancients not knowing how to think empirically. But apparently he really is that ignorant, because he’s never actually read most of the classics, he has only read\nabout\nthem, third- or even fourth-hand.\nForget his being buddy-buddy with Ben Shapiro. That’s bad enough, but this guy de-platformed Faith Goldy for her associations…\nand he’s connected to John freaking Podesta!",
  "tags": [
    "Jordanetics"
  ],
  "categories": [],
  "sitemap_lastmod": "2018-05-13T12:19:15+00:00"
}