{
  "url": "https://voxday.net/2018/05/28/and-conservatives-are-supposed-to-care/",
  "scraped_at": "2025-12-19T21:04:22.049438",
  "title": "And conservatives are supposed to care?",
  "date_display": "May 28, 2018",
  "date_iso": "2018-05-28T20:30:06+00:00",
  "date_from_url": "2018-05-28",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>To whom does <a href=\"https://www.campusreform.org/?ID=10949\">this woman</a> think she is going to appeal for help? Conservatives and Christians have been relentlessly driven out of academia for the last 50 years!</p><blockquote><p>A former University of Maryland professor is preparing for a legal battle against school administrators who she claims discriminated against her over a trip to Israel.</p><p>Dr. Melissa Landa, a Jewish professor who worked in the Education Department at UMD until last June, claims that her contract was not renewed by administrators due to discrimination against her pro-Israel beliefs and her stance against the “Boycott, Divestment, Sanctions” (BDS) movement.</p><p>“Once my involvement with Israel became political, that is when things started to change.” </p><p>According to its official website, the BDS movement claims to work “to end international support for Israel’s oppression of Palestinians and pressure Israel to comply with international law.”</p><p>In a video published on her website, Landa, who has been vocal regarding anti-Semitic, pro-Palestine movements, argues that her active stance contributed to her being “ostracized” by colleagues and eventually dismissed from the university. Landa also alleges that the acts taken against her are not unique, and are just one example of the “one-sided” administration that she believes are biased toward the BDS movement.</p><p>“Across the country, Jewish professors and Jewish students are being intimidated and silenced for their opposition to the BDS movement,” Landa states in the video. “This must stop.”</p></blockquote><p>I, for one, couldn’t care less about Jewish professors and Jewish students being driven out of academia across the West. This is isn’t just the future they wanted, <i>this is the very future they demanded. </i>To paraphrase Thomas More, they cut down the trees of academic freedom and now there is nothing to protect them from the devil that is coming for them.</p><p>Clearly, these strategic cretins have learned absolutely nothing from the predictable consequences of their actions, given that the astonishingly stupid response to the growing popularity of the BDS movement has been <a href=\"http://www.israelallies.org/usa/news_article/press_release_south_carolina_adopts_first_anti-bds_law_in_america/\">to launch an organized attack on the 1st Amendment rights of Americans</a>. Even Americans who don’t care about Israel one way or the other are going to be supporting BDS soon.</p><blockquote><p>Willem Griffioen, Executive Director of the Israel Allies Foundation (IAF) issued the following statement in response to Governor Haley’s signing of H 3583.</p><p>“We applaud the State of South Carolina for making H 3583 the law and delivering a historic piece of pro-Israel legislation in doing so.  The timing and importance of this groundbreaking legislation cannot be overstated. It was truly an honor for our organization to contribute our expertise and educational resources to this effort.”</p><p>“Our work on this issue has only just begun. IAF’s team of experts have merged South Carolina’s H 3583 with Illinois’ SB 1761 into one piece of model legislation. IAF has now proven its preparedness to help lead the legislative battle against the Boycott, Divestment, and Sanctions movement (BDS) in all fifty states. We are offering all of the supporting resources legislators need to accomplish this important point of public policy. IAF is pleased to announce that a bloc of sponsors across 18 states has already committed to introducing similar legislation in their next legislative cycle.”</p></blockquote><p>This is “Ground Campaign Against Russia”-level political stupidity.</p></div>",
  "content_text": "To whom does\nthis woman\nthink she is going to appeal for help? Conservatives and Christians have been relentlessly driven out of academia for the last 50 years!\nA former University of Maryland professor is preparing for a legal battle against school administrators who she claims discriminated against her over a trip to Israel.\nDr. Melissa Landa, a Jewish professor who worked in the Education Department at UMD until last June, claims that her contract was not renewed by administrators due to discrimination against her pro-Israel beliefs and her stance against the “Boycott, Divestment, Sanctions” (BDS) movement.\n“Once my involvement with Israel became political, that is when things started to change.”\nAccording to its official website, the BDS movement claims to work “to end international support for Israel’s oppression of Palestinians and pressure Israel to comply with international law.”\nIn a video published on her website, Landa, who has been vocal regarding anti-Semitic, pro-Palestine movements, argues that her active stance contributed to her being “ostracized” by colleagues and eventually dismissed from the university. Landa also alleges that the acts taken against her are not unique, and are just one example of the “one-sided” administration that she believes are biased toward the BDS movement.\n“Across the country, Jewish professors and Jewish students are being intimidated and silenced for their opposition to the BDS movement,” Landa states in the video. “This must stop.”\nI, for one, couldn’t care less about Jewish professors and Jewish students being driven out of academia across the West. This is isn’t just the future they wanted,\nthis is the very future they demanded.\nTo paraphrase Thomas More, they cut down the trees of academic freedom and now there is nothing to protect them from the devil that is coming for them.\nClearly, these strategic cretins have learned absolutely nothing from the predictable consequences of their actions, given that the astonishingly stupid response to the growing popularity of the BDS movement has been\nto launch an organized attack on the 1st Amendment rights of Americans\n. Even Americans who don’t care about Israel one way or the other are going to be supporting BDS soon.\nWillem Griffioen, Executive Director of the Israel Allies Foundation (IAF) issued the following statement in response to Governor Haley’s signing of H 3583.\n“We applaud the State of South Carolina for making H 3583 the law and delivering a historic piece of pro-Israel legislation in doing so.  The timing and importance of this groundbreaking legislation cannot be overstated. It was truly an honor for our organization to contribute our expertise and educational resources to this effort.”\n“Our work on this issue has only just begun. IAF’s team of experts have merged South Carolina’s H 3583 with Illinois’ SB 1761 into one piece of model legislation. IAF has now proven its preparedness to help lead the legislative battle against the Boycott, Divestment, and Sanctions movement (BDS) in all fifty states. We are offering all of the supporting resources legislators need to accomplish this important point of public policy. IAF is pleased to announce that a bloc of sponsors across 18 states has already committed to introducing similar legislation in their next legislative cycle.”\nThis is “Ground Campaign Against Russia”-level political stupidity.",
  "tags": [
    "education"
  ],
  "categories": [],
  "sitemap_lastmod": "2018-05-28T19:30:06+00:00"
}