{
  "url": "https://voxday.net/2018/05/06/bafflegab-and-bullshit/",
  "scraped_at": "2025-12-19T21:00:30.768052",
  "title": "Bafflegab and bullshit",
  "date_display": "May 6, 2018",
  "date_iso": "2018-05-06T10:13:24+00:00",
  "date_from_url": "2018-05-06",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>Keep in mind that this purports to be <a href=\"http://blog.paulmckeever.ca/uncategorized/what-sam-harris-was-missing-re-jordan-peterson-and-what-is-true/\">a DEFENSE of Jordan Peterson’s self-unmasking</a> in his interview on the subject of truth with Sam Harris. Which is amusing, as it reads a lot more like an indictment.</p><blockquote><p>For Harris, ideas are propositions about what really exists, independently of one’s mind, and science is an attempt to identify facts (i.e., ideas) about reality.  However, to a pragmatist such as Peterson, reality – i.e. the world around oneself – is not the thing under consideration because one cannot  obtain any knowledge at all of what causes one’s sensations: what exists outside of one’s own mind is not knowable.  For Peterson, there are no “facts” about reality.  For Peterson an “idea” is not a proposition about reality.  Instead, for Peterson, every “idea” is a plan of action.  The meaning of an idea is the effect of acting upon the idea. Thus, for a pragmatist, the meaning of “grizzly bear” is not “man-eating beast” but something like “run away!” or “throw a stone at it!”.</p><p>On this view, the truth of an idea is determined by its efficacy in achieving some goal (different pragmatists have differing ideas about what sorts of goals should be achieved). For example, if the goal is to remain unbitten, “run away” is a plan of action that is sufficiently true to act upon if running away is an effective way to remain unbitten, but “run away” is not a sufficiently true plan of action to act upon if running away is not an effective way to remain bitten. Likewise, “throw a stone at it!” is sufficiently true to act upon if throwing a stone at the grizzly bear is effective in preventing one from being bitten, but “throw a stone at it!” is not sufficiently true to act upon if throwing a stone at the grizzly bear is ineffective in preventing one from being bitten.</p><p>It follows that, for Peterson, science is not an attempt to discover ideas about, or “facts” about, reality.  Rather, science is an attempt to discover plans of action that, given the other ideas we hold, appear to be sufficiently true to act upon in order to attain one’s ethical purpose.  Hence Peterson’s statement that:</p><p>“I think of science as a tool, rather than as a description of reality.  And, well, that’s where we differ.”</p><p>Peterson’s Pragmatist Ethics/Purpose</p><p>For pragmatism, it is not enough for an idea (i.e., a plan of action) to “work” or to be “effective”.  Pragmatism requires the idea to be effective in achieving an ethically good end.  Thus, one might invent a weapon that is extremely effective in doing one thing: turning the Earth and every living thing on it to lifeless ash in milliseconds.  However, such a weapon does not “work” – is not “efficacious” – by the pragmatic standard, because it does not achieve an ethically good purpose.  Hence Peterson’s assertion that the sufficiency of an idea’s truth depends upon the idea being ethically good.</p><p>Different pragmatists hold differing versions of what constitutes a proper ethical purpose.  Peterson’s clearly was: survival; survival of the individual or of humanity as a whole.  Thus, for Peterson, an idea (i.e., a plan of action) is good if it is efficacious in achieving survival of the individual or of humanity as a whole.  Staying with the grizzly bear example, if a given idea – e.g., “run away!” – is an effective plan of action for surviving, then the idea “grizzly bear” (meaning “run away”) is a sufficiently true idea because it is a good idea.</p><p>Contrast this with Harris’ perspective on truth.   For Harris, “grizzly bear” is not a plan of action.  It is instead a concept of a large, hairy, man-eating mammal.  For Harris, it is true that a grizzly bear is a large, hairy, man-eating mammal because a grizzly bear can be observed to be exactly that, in reality.  In other words, on the Correspondence theory of truth to which Harris subscribes, the concept of a grizzly bear being a large, hairy, man-eating mammal is true if the concept corresponds to the facts of reality.  If grizzly bears – independently of what anyone thinks of them – really are large, hairy, man-eating mammals, then the concept in one’s head (i.e., large, hairy, man-eating mammal) is true because it Corresponds to the facts of reality.  And, on the Correspondence theory of truth, the concept is true whether or not running from a grizzly bear would be effective in avoiding a grizzly bite.</p><p>What Harris Seemed to be Missing</p><p>At this point, it should be clear to the reader that Harris seemed unaware of the foundations of pragmatism, his talk about arguing with Richard Rorty in undergraduate courses notwithstanding.</p><p>Harris wrongly thought Peterson to believe that there are facts of reality that exist independently of ones senses.  Peterson rejects the very idea that one can even consider any reality other than the experiences in one’s own head.</p><p>Harris wrongly thought that Peterson views ideas and propositions as ideas and propositions about reality; about the world around one.  Peterson views ideas not as claims about what exists in reality, but as plans of action.</p><p>Harris wrongly thought that Peterson views the role of science as the endeavour to discover the facts of reality.  Peterson views the role of science as the discovery of plans of action that are effective in achieving the ethical purpose of surviving.</p><p>Harris could not understand Peterson’s refusal to admit the truth of propositions independently of moral considerations because pragmatism is founded upon a whole lot of premises that Harris apparently is unaware of, and that were not discussed explicitly during the Harris-Peterson conversation.</p></blockquote><p>Translation: Sam Harris, for all his various shortcomings, generally uses words as they are commonly understood. These Corresponding Truthy Pragmatists or whatever they happen to call themselves, are utilizing the old charlatan’s trick of calling a spoon a fork in order to prove that one can eat soup with a fork.</p><p>Of course, we have no idea if Jordan Peterson’s specific non-truth “truth” is actually pragmatic correspondence truth or not, because this is only one of the FOUR different definitions presently on offer from members of Peterson’s crazy cargo cult.</p><p>By the way, I finished <i>12 Rules of Life</i> today. I’ll do a Darkstream later to discuss my initial impressions, then will start writing my review of the book for Monday, but I really do have to retract my earlier statement that Jordan Peterson is the bastard spawn of Bill Kristol and Deeprak Chopra. He’s actually more akin to the tragic love child of Bill Kristol and Stuart Smalley. And he is most definitely a Gamma male as well as a physical coward who quite literally ran from a fight as a sixth-grader.</p><p>He’s also had a tremendous amount of tragedy in and around his life, which I expect accounts for his bizarre equation of both life and evil with suffering.</p><p>Anyhow, I’ll read <i>Maps of Meaning</i> next, at which point I will have read more of Jordan Peterson’s work than 99.9 percent of his fans currently complaining that I know nothing about him. Apparently they are also unfamiliar with the concept of “hypothesis” and “calling your shot”. A sample of <a href=\"https://www.youtube.com/watch?v=SrCS7qy5e0k\">the cargo cult’s responses</a>.</p><ul><li><i>Wow…never realized how incredibly insecure Vox was untill now﻿</i></li><li><i>don’t waste your time… this is the lunatic.  JP is awesome!!!﻿</i></li><li><i>You’re arrogant, puffed up and bitterly jealous. You’re also extremely boring, rambling, and no matter how many books you stand in front of, and no matter how long you ramble on for, you’re never going to convince me that you’re intelligent enough to pass comment on other people’s intelligence. I presume that you got your IQ score from one of those ads at the bottom of a web page for a gutter tabloid. Neither are you fit to tie Jordan Peterson’s shoelaces. He’s clear, you’re muddled. He’s gripping, you’re boring. Incredibly monotonous. He’s funny and witty. You’re painfully and excruciatingly robotic and clearly have no emotional intelligence. Your droning barely conceals your desperate whimper, “Please buy my books too!” My answer to that is NO! get off the screen of my iPad, you sad, pathetic little gnome!﻿</i></li></ul><div>Jordan Peterson is “clear”, while I am “muddled”? That must be more of that incoherent truth in action.</div></div>",
  "content_text": "Keep in mind that this purports to be\na DEFENSE of Jordan Peterson’s self-unmasking\nin his interview on the subject of truth with Sam Harris. Which is amusing, as it reads a lot more like an indictment.\nFor Harris, ideas are propositions about what really exists, independently of one’s mind, and science is an attempt to identify facts (i.e., ideas) about reality.  However, to a pragmatist such as Peterson, reality – i.e. the world around oneself – is not the thing under consideration because one cannot  obtain any knowledge at all of what causes one’s sensations: what exists outside of one’s own mind is not knowable.  For Peterson, there are no “facts” about reality.  For Peterson an “idea” is not a proposition about reality.  Instead, for Peterson, every “idea” is a plan of action.  The meaning of an idea is the effect of acting upon the idea. Thus, for a pragmatist, the meaning of “grizzly bear” is not “man-eating beast” but something like “run away!” or “throw a stone at it!”.\nOn this view, the truth of an idea is determined by its efficacy in achieving some goal (different pragmatists have differing ideas about what sorts of goals should be achieved). For example, if the goal is to remain unbitten, “run away” is a plan of action that is sufficiently true to act upon if running away is an effective way to remain unbitten, but “run away” is not a sufficiently true plan of action to act upon if running away is not an effective way to remain bitten. Likewise, “throw a stone at it!” is sufficiently true to act upon if throwing a stone at the grizzly bear is effective in preventing one from being bitten, but “throw a stone at it!” is not sufficiently true to act upon if throwing a stone at the grizzly bear is ineffective in preventing one from being bitten.\nIt follows that, for Peterson, science is not an attempt to discover ideas about, or “facts” about, reality.  Rather, science is an attempt to discover plans of action that, given the other ideas we hold, appear to be sufficiently true to act upon in order to attain one’s ethical purpose.  Hence Peterson’s statement that:\n“I think of science as a tool, rather than as a description of reality.  And, well, that’s where we differ.”\nPeterson’s Pragmatist Ethics/Purpose\nFor pragmatism, it is not enough for an idea (i.e., a plan of action) to “work” or to be “effective”.  Pragmatism requires the idea to be effective in achieving an ethically good end.  Thus, one might invent a weapon that is extremely effective in doing one thing: turning the Earth and every living thing on it to lifeless ash in milliseconds.  However, such a weapon does not “work” – is not “efficacious” – by the pragmatic standard, because it does not achieve an ethically good purpose.  Hence Peterson’s assertion that the sufficiency of an idea’s truth depends upon the idea being ethically good.\nDifferent pragmatists hold differing versions of what constitutes a proper ethical purpose.  Peterson’s clearly was: survival; survival of the individual or of humanity as a whole.  Thus, for Peterson, an idea (i.e., a plan of action) is good if it is efficacious in achieving survival of the individual or of humanity as a whole.  Staying with the grizzly bear example, if a given idea – e.g., “run away!” – is an effective plan of action for surviving, then the idea “grizzly bear” (meaning “run away”) is a sufficiently true idea because it is a good idea.\nContrast this with Harris’ perspective on truth.   For Harris, “grizzly bear” is not a plan of action.  It is instead a concept of a large, hairy, man-eating mammal.  For Harris, it is true that a grizzly bear is a large, hairy, man-eating mammal because a grizzly bear can be observed to be exactly that, in reality.  In other words, on the Correspondence theory of truth to which Harris subscribes, the concept of a grizzly bear being a large, hairy, man-eating mammal is true if the concept corresponds to the facts of reality.  If grizzly bears – independently of what anyone thinks of them – really are large, hairy, man-eating mammals, then the concept in one’s head (i.e., large, hairy, man-eating mammal) is true because it Corresponds to the facts of reality.  And, on the Correspondence theory of truth, the concept is true whether or not running from a grizzly bear would be effective in avoiding a grizzly bite.\nWhat Harris Seemed to be Missing\nAt this point, it should be clear to the reader that Harris seemed unaware of the foundations of pragmatism, his talk about arguing with Richard Rorty in undergraduate courses notwithstanding.\nHarris wrongly thought Peterson to believe that there are facts of reality that exist independently of ones senses.  Peterson rejects the very idea that one can even consider any reality other than the experiences in one’s own head.\nHarris wrongly thought that Peterson views ideas and propositions as ideas and propositions about reality; about the world around one.  Peterson views ideas not as claims about what exists in reality, but as plans of action.\nHarris wrongly thought that Peterson views the role of science as the endeavour to discover the facts of reality.  Peterson views the role of science as the discovery of plans of action that are effective in achieving the ethical purpose of surviving.\nHarris could not understand Peterson’s refusal to admit the truth of propositions independently of moral considerations because pragmatism is founded upon a whole lot of premises that Harris apparently is unaware of, and that were not discussed explicitly during the Harris-Peterson conversation.\nTranslation: Sam Harris, for all his various shortcomings, generally uses words as they are commonly understood. These Corresponding Truthy Pragmatists or whatever they happen to call themselves, are utilizing the old charlatan’s trick of calling a spoon a fork in order to prove that one can eat soup with a fork.\nOf course, we have no idea if Jordan Peterson’s specific non-truth “truth” is actually pragmatic correspondence truth or not, because this is only one of the FOUR different definitions presently on offer from members of Peterson’s crazy cargo cult.\nBy the way, I finished\n12 Rules of Life\ntoday. I’ll do a Darkstream later to discuss my initial impressions, then will start writing my review of the book for Monday, but I really do have to retract my earlier statement that Jordan Peterson is the bastard spawn of Bill Kristol and Deeprak Chopra. He’s actually more akin to the tragic love child of Bill Kristol and Stuart Smalley. And he is most definitely a Gamma male as well as a physical coward who quite literally ran from a fight as a sixth-grader.\nHe’s also had a tremendous amount of tragedy in and around his life, which I expect accounts for his bizarre equation of both life and evil with suffering.\nAnyhow, I’ll read\nMaps of Meaning\nnext, at which point I will have read more of Jordan Peterson’s work than 99.9 percent of his fans currently complaining that I know nothing about him. Apparently they are also unfamiliar with the concept of “hypothesis” and “calling your shot”. A sample of\nthe cargo cult’s responses\n.\nWow…never realized how incredibly insecure Vox was untill now﻿\ndon’t waste your time… this is the lunatic.  JP is awesome!!!﻿\nYou’re arrogant, puffed up and bitterly jealous. You’re also extremely boring, rambling, and no matter how many books you stand in front of, and no matter how long you ramble on for, you’re never going to convince me that you’re intelligent enough to pass comment on other people’s intelligence. I presume that you got your IQ score from one of those ads at the bottom of a web page for a gutter tabloid. Neither are you fit to tie Jordan Peterson’s shoelaces. He’s clear, you’re muddled. He’s gripping, you’re boring. Incredibly monotonous. He’s funny and witty. You’re painfully and excruciatingly robotic and clearly have no emotional intelligence. Your droning barely conceals your desperate whimper, “Please buy my books too!” My answer to that is NO! get off the screen of my iPad, you sad, pathetic little gnome!﻿\nJordan Peterson is “clear”, while I am “muddled”? That must be more of that incoherent truth in action.",
  "tags": [
    "BookReview"
  ],
  "categories": [],
  "sitemap_lastmod": "2018-05-06T09:13:24+00:00"
}