{
  "url": "https://voxday.net/2018/05/28/battlefield-5-and-gamergate-2/",
  "scraped_at": "2025-12-19T21:04:16.534711",
  "title": "Battlefield 5 and GamerGate 2",
  "date_display": "May 28, 2018",
  "date_iso": "2018-05-28T12:04:32+00:00",
  "date_from_url": "2018-05-28",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p><a href=\"https://youtu.be/JYGnvuI9Z6w\">This Darkstream</a> starts poorly, but bear with it as it appears I am finally beginning to figure out how this livestreaming thing actually works.</p><div style=\"text-align: center;\"><iframe allow=\"autoplay; encrypted-media\" allowfullscreen=\"\" frameborder=\"0\" height=\"284\" src=\"https://www.youtube.com/embed/JYGnvuI9Z6w\" width=\"512\"></iframe></div><p>This is <i>Battlefield 5</i>. The trailer was released quite recently and a couple of the striking things about it are the way in which that we have this figure here. At first you’re not sure what the time frame is, then you realize there are World War II tanks, some of the weapons are also WWII-era, and then you realize, wait a minute, is that a woman riding on a Jeep on the battlefield?</p><p>Now what is a jeep doing suddenly surrounded by all of these tanks, and is that a… what kind of plane is that? I can’t tell. It looked for a second like it might be some sort of Messerschmitt, like a Messerschmitt 109, but if you recall your World War II history then you realize that Messerschmitt 109s were mostly used in air-to-air combat, they were not used as ground support, and you certainly were not shooting them down with machine guns. And so you know what we’re seeing here…  and that was, if I recall correctly, that was actually a V1 buzz bomb rocket, which again you would not use on the battlefield, okay, they were used for bombing civilian centers.</p><p>Oh, and here we get rescued by a woman, a woman with a claw no less, interesting. So, a lot of people were not terribly impressed with this and for good reason. What is the purpose of this game, what are they trying to demonstrate? You know, I understand, I think we all understand, that an arcade game is not meant to be a serious World War II combat simulation okay? I played Modern Warfare 2 through Level 70 Elite and I also played two previous Battlefields, and you know, the interesting thing about this is that were we’re seeing the same sort of behavior from the producers that we were seeing when GamerGate first got started and what we’re seeing is the appeal to possibility.</p><p>So what SJWs do is they come in and then they begin messing around with the history. They begin messing around with whatever they can in order to get the point across that they want to get across, and so it doesn’t matter whether you’re talking about a fantasy game, it doesn’t matter whether you’re talking about a World War II game. What was particularly egregious about this is that we all had the same response when they first came out with the remake of the old <i>Dungeons &amp; Dragons</i> games [Beamdog’s <i>Balder’s Gate II</i> etc] but the argument then was that it’s fantasy, you know, it’s  fantasy, so what does it matter? If you can have dragons, and you have flying dragons and dragons breathing fire and all this sort of thing, well, why can’t you have women who are just as good at fighting as men?</p><p>Well, the reason is because it’s not consistent with the story lines, it’s also not consistent with what the audience wants, and so now what we’re seeing is that they’re getting even more egregious, now they are putting these women in the battlefield and they are making them more heroic and more lethal than the men as this particular trailer demonstrated, and they’re using the excuse of saying, well you know there were WACS and there were WAVS and there were Russian snipers and all that sort of thing, and that’s all true, but none of that excuses what they’re doing. All they’re trying to do is come up with some sort of ex post facto rationalization for what they’re doing.</p><p>I’ve played dozens of World War II-related games, you can look on my shelf right there, you can see I’m an <i>Advanced Squad Leader</i> player. At no point in time in the extremely complicated <i>Advanced Squad Leader</i> system – where they literally count the precise numbers and probability of the appearance on the battlefield of the most obscure German, Romanian, and Russian tanks – at no point did they ever see any need to simulate women. I mean they’ve got everything from the late war  German militias that were called “the stomach battalions” because they were made of young kids and men who had previously been disqualified from service and they even got that accounted for My son and I are about to play <i>Decision at Elst</i>, which is the the first ASL Starter Kit campaign game, and they’ve actually got special rules for steeples because it’s important for the actual physical characteristics of the territory where that was found… again they’re going to that level of detail and yet there’s been no need whatsoever to figure out how to simulate women in combat in World War II.</p><p>So you know, this is a new level of egregious, this is a new level of SJW onslaught, this is a new offensive by SJWs in the game industry.</p></div>",
  "content_text": "This Darkstream\nstarts poorly, but bear with it as it appears I am finally beginning to figure out how this livestreaming thing actually works.\nThis is\nBattlefield 5\n. The trailer was released quite recently and a couple of the striking things about it are the way in which that we have this figure here. At first you’re not sure what the time frame is, then you realize there are World War II tanks, some of the weapons are also WWII-era, and then you realize, wait a minute, is that a woman riding on a Jeep on the battlefield?\nNow what is a jeep doing suddenly surrounded by all of these tanks, and is that a… what kind of plane is that? I can’t tell. It looked for a second like it might be some sort of Messerschmitt, like a Messerschmitt 109, but if you recall your World War II history then you realize that Messerschmitt 109s were mostly used in air-to-air combat, they were not used as ground support, and you certainly were not shooting them down with machine guns. And so you know what we’re seeing here…  and that was, if I recall correctly, that was actually a V1 buzz bomb rocket, which again you would not use on the battlefield, okay, they were used for bombing civilian centers.\nOh, and here we get rescued by a woman, a woman with a claw no less, interesting. So, a lot of people were not terribly impressed with this and for good reason. What is the purpose of this game, what are they trying to demonstrate? You know, I understand, I think we all understand, that an arcade game is not meant to be a serious World War II combat simulation okay? I played Modern Warfare 2 through Level 70 Elite and I also played two previous Battlefields, and you know, the interesting thing about this is that were we’re seeing the same sort of behavior from the producers that we were seeing when GamerGate first got started and what we’re seeing is the appeal to possibility.\nSo what SJWs do is they come in and then they begin messing around with the history. They begin messing around with whatever they can in order to get the point across that they want to get across, and so it doesn’t matter whether you’re talking about a fantasy game, it doesn’t matter whether you’re talking about a World War II game. What was particularly egregious about this is that we all had the same response when they first came out with the remake of the old\nDungeons & Dragons\ngames [Beamdog’s\nBalder’s Gate II\netc] but the argument then was that it’s fantasy, you know, it’s  fantasy, so what does it matter? If you can have dragons, and you have flying dragons and dragons breathing fire and all this sort of thing, well, why can’t you have women who are just as good at fighting as men?\nWell, the reason is because it’s not consistent with the story lines, it’s also not consistent with what the audience wants, and so now what we’re seeing is that they’re getting even more egregious, now they are putting these women in the battlefield and they are making them more heroic and more lethal than the men as this particular trailer demonstrated, and they’re using the excuse of saying, well you know there were WACS and there were WAVS and there were Russian snipers and all that sort of thing, and that’s all true, but none of that excuses what they’re doing. All they’re trying to do is come up with some sort of ex post facto rationalization for what they’re doing.\nI’ve played dozens of World War II-related games, you can look on my shelf right there, you can see I’m an\nAdvanced Squad Leader\nplayer. At no point in time in the extremely complicated\nAdvanced Squad Leader\nsystem – where they literally count the precise numbers and probability of the appearance on the battlefield of the most obscure German, Romanian, and Russian tanks – at no point did they ever see any need to simulate women. I mean they’ve got everything from the late war  German militias that were called “the stomach battalions” because they were made of young kids and men who had previously been disqualified from service and they even got that accounted for My son and I are about to play\nDecision at Elst\n, which is the the first ASL Starter Kit campaign game, and they’ve actually got special rules for steeples because it’s important for the actual physical characteristics of the territory where that was found… again they’re going to that level of detail and yet there’s been no need whatsoever to figure out how to simulate women in combat in World War II.\nSo you know, this is a new level of egregious, this is a new level of SJW onslaught, this is a new offensive by SJWs in the game industry.",
  "tags": [
    "#GamerGate"
  ],
  "categories": [],
  "sitemap_lastmod": "2018-05-28T11:04:32+00:00"
}