{
  "url": "https://voxday.net/2018/05/07/book-review-12-rules-of-life-an-antidote-to-chaos/",
  "scraped_at": "2025-12-19T21:00:52.684840",
  "title": "Book Review: 12 RULES OF LIFE: An Antidote to Chaos",
  "date_display": "May 7, 2018",
  "date_iso": "2018-05-07T18:19:18+00:00",
  "date_from_url": "2018-05-07",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>Jordan Peterson is the public intellectual du jour. Some have even declared that he is the most important public intellectual in the world. Primarily known for his videos and lectures, his second book, <i>12 Rules of Life: An Antidote to Chaos</i>, is a practical distillation of his philosophy that has been an international bestseller and has also been widely and enthusiastically embraced as a useful guide to improving one’s life.</p><p>To the extent that this is true, it is a tragic indictment of the extent to which parents have increasingly failed to raise their children properly. Peterson’s rules are pedestrian and childish on their face, encouraging the reader to stand up straight, speak precisely, tell the truth, pet the neighborhood cat, and generally behave the way in which a 10-year-old boy from a good family was historically expected to behave for most of the 20th century in the West. This is all well and good, even if the fact that it is apparently necessary to explain these things to adult men and women tends to inspire one to weep for the state of modern Man.</p><p>However, the more sophisticated reader cannot help but notice that Peterson does not follow his own rules, particularly the three which relate to speaking precisely, telling the truth, and getting one’s own house in order before trying to fix the world.</p><p>Peterson is an engaging and accessible writer when he is simply recounting events of the past or relating experiences from his own life. He is a sympathetic author, and he effectively communicates the way in which the tragedy and suffering he has experienced throughout his life have made a deep impression on his psyche. It is when he tries to wax profound and articulate his underlying philosophy that his writing invariably wades into a swamp of nonsensical name-dropping that is less Jungian than Joycean, a meandering waking stream of consciousness that not only fails to substantially support the nominal premise, but often bears no relationship to it whatsoever.</p><p>To call Peterson’s writing imprecise really does not do it justice. His definitions of “life” and “evil”, both predicated on “suffering”, are so similar that the careless reader skimming over the text might well conclude that life is evil and the deepest truth requires one to inflict unnecessary suffering on others. His many references are seldom very pertinent to the subject at hand and are primarily displayed to dazzle and impress the unsophisticated reader, who little realizes that a reference to Neil deGrasse Tyson or Prince would have been just as relevant to the point being made as the scientific study cited or the Pareto Principle. One of the most entertaining aspects of the book is the way that Peterson never permits his failure to correctly grasp a concept to stand in the way of his brandishing it like a child flashing a fake F.B.I. badge.</p><p>Or, more ominously, like a woman’s stalker flashing a fake police badge at her door. For there is a method to Peterson’s textual madness. Every deeper concept is presented and discussed in the most nebulous, most vague, and most plausibly deniable manner. Peterson is slippery and evasive about his own beliefs throughout the book, and only the most well-informed, most careful reader who has a sufficient grasp of the various theologies and philosophies that Peterson references so freely can hope to discern what Peterson actually believes with any reasonable degree of confidence.</p><p>But the intellectual fog can be penetrated by an attentive reader. Jordan Peterson is not, in contrast to the incorrect assumptions of many of his readers and critics alike, a Christian or a man of the Right. Nor is he a courageous intellectual, to the contrary, he is a deeply terrified individual. More importantly, he is not a man dedicated to the truth, at least, not the truth in the conventional sense in which in the term is usually understood by the average English-speaking individual, which is why the <i>12 Rules of Life</i> ultimately amounts to pseudo-intellectual sleight-of-hand meant to direct the reader down the false path of Peterson’s post-Christian philosophy, which for lack of an existing term we might as well christen Jordanetics.</p><p>It is strange that the book’s primary objective is so little recognized by its readers, considering that Peterson all but spells it out in both the title of the book as well as its coda. We are told that <i>The 12 Rules</i> are an antidote to chaos, but as Peterson fans are often quick to point out, they are not only practical rules for everyday living, but metaphors for larger concepts as well. And the metaphorical chaos to which Peterson refers in the title is not a messy room, but a messy world that terrifies him, and which he has come to save by creating order out of the chaos with his “newfound Pen of Light.”</p><p>The best way to illustrate the never-ending stream of references that serve as Peterson’s reasoning is to simply quote the book, in this case, a section of his chapter explaining the rule that you should treat yourself like someone you are responsible for helping. And if you find yourself wondering what in the world Anton Chekhov, snakes, Michaelangelo’s Pietà, Oedipal nightmares, arboreal evolutionary adaptations, and the Garden of Eden actually have to do with the importance of taking your prescribed medications, the answer is absolutely nothing.</p><p><b>Text Sample:</b>  <i>There is simply no way to wall off some isolated portion of the greater surrounding reality and make everything permanently predictable and safe within it. Some of what has been no-matter-how-carefully excluded will always sneak back in. A serpent, metaphorically speaking, will inevitably appear. Even the most assiduous of parents cannot fully protect their children, even if they lock them in the basement, safely away from drugs, alcohol and internet porn. In that extreme case, the too-cautious, too-caring parent merely substitutes him or herself for the other terrible problems of life. This is the great Freudian Oedipal nightmare. It is far better to render Beings in your care competent than to protect them.</i><br><i><br/></i><i>And even if it were possible to permanently banish everything threatening—everything dangerous (and, therefore, everything challenging and interesting), that would mean only that another danger would emerge: that of permanent human infantilism and absolute uselessness. How could the nature of man ever reach its full potential without challenge and danger? How dull and contemptible would we become if there was no longer reason to pay attention? Maybe God thought His new creation would be able to handle the serpent, and considered its presence the lesser of two evils.Question for parents: do you want to make your children safe, or strong?</i><br><i><br/></i><i>In any case, there’s a serpent in the Garden, and he’s a “subtil” beast, according to the ancient story (difficult to see, vaporous, cunning, deceitful and treacherous). It therefore comes as no surprise when he decides to play a trick on Eve. Why Eve, instead of Adam? It could just be chance. It was fifty-fifty for Eve, statistically speaking, and those are pretty high odds. But I have learned that these old stories contain nothing superfluous. Anything accidental—anything that does not serve the plot—has long been forgotten in the telling. As the Russian playwright Anton Chekhov advised, “If there is a rifle hanging on the wall in act one, it must be fired in the next act. Otherwise it has no business being there.” Perhaps primordial Eve had more reason to attend to serpents than Adam. Maybe they were more likely, for example, to prey on her tree-dwelling infants. Perhaps it is for this reason that Eve’s daughters are more protective, self-conscious, fearful and nervous, to this day (even, and especially, in the most egalitarian of modern human societies). In any case, the serpent tells Eve that if she eats the forbidden fruit, she won’t die. Instead, her eyes will be opened. She will become like God, knowing good from evil. Of course, the serpent doesn’t let her know she will be like God in only that one way. But he is a serpent, after all. Being human, and wanting to know more, Eve decides to eat the fruit. Poof! She wakes up: she’s conscious, or perhaps self-conscious, for the first time.</i><br><i><br/></i><i>Now, no clear-seeing, conscious woman is going to tolerate an unawakened man. So, Eve immediately shares the fruit with Adam. That makes him self-conscious. Little has changed. Women have been making men self-conscious since the beginning of time. They do this primarily by rejecting them—but they also do it by shaming them, if men do not take responsibility. Since women bear the primary burden of reproduction, it’s no wonder. It is very hard to see how it could be otherwise. But the capacity of women to shame men and render them self-conscious is still a primal force of nature.</i><br><i><br/></i><i>Now, you may ask: what in the world have snakes got to do with vision? Well, first, it’s clearly of some importance to see them, because they might prey on you (particularly when you’re little and live in trees, like our arboreal ancestors). Dr. Lynn Isbell, professor of anthropology and animal behaviour at the University of California, has suggested that the stunningly acute vision almost uniquely possessed by human beings was an adaptation forced on us tens of millions of years ago by the necessity of detecting and avoiding the terrible danger of snakes, with whom our ancestors co-evolved. This is perhaps one of the reasons the snake features in the garden of Paradise as the creature who gave us the vision of God (in addition to serving as the primordial and eternal enemy of mankind). This is perhaps one of the reasons why Mary, the eternal, archetypal mother—Eve perfected—is so commonly shown in medieval and Renaissance iconography holding the Christ Child in the air, as far away as possible from a predatory reptile, which she has firmly pinned under her foot. And there’s more. It’s fruit that the snake offers, and fruit is also associated with a transformation of vision, in that our ability to see color is an adaptation that allows us to rapidly detect the ripe and therefore edible bounty of trees.</i><br><i><br/></i><i>Our primordial parents hearkened to the snake. They ate the fruit. Their eyes opened. They both awoke. You might think, as Eve did initially, that this would be a good thing. Sometimes, however, half a gift is worse than none. Adam and Eve wake up, all right, but only enough to discover some terrible things. First, they notice that they’re naked.</i></br></br></br></br></br></p></div>",
  "content_text": "Jordan Peterson is the public intellectual du jour. Some have even declared that he is the most important public intellectual in the world. Primarily known for his videos and lectures, his second book,\n12 Rules of Life: An Antidote to Chaos\n, is a practical distillation of his philosophy that has been an international bestseller and has also been widely and enthusiastically embraced as a useful guide to improving one’s life.\nTo the extent that this is true, it is a tragic indictment of the extent to which parents have increasingly failed to raise their children properly. Peterson’s rules are pedestrian and childish on their face, encouraging the reader to stand up straight, speak precisely, tell the truth, pet the neighborhood cat, and generally behave the way in which a 10-year-old boy from a good family was historically expected to behave for most of the 20th century in the West. This is all well and good, even if the fact that it is apparently necessary to explain these things to adult men and women tends to inspire one to weep for the state of modern Man.\nHowever, the more sophisticated reader cannot help but notice that Peterson does not follow his own rules, particularly the three which relate to speaking precisely, telling the truth, and getting one’s own house in order before trying to fix the world.\nPeterson is an engaging and accessible writer when he is simply recounting events of the past or relating experiences from his own life. He is a sympathetic author, and he effectively communicates the way in which the tragedy and suffering he has experienced throughout his life have made a deep impression on his psyche. It is when he tries to wax profound and articulate his underlying philosophy that his writing invariably wades into a swamp of nonsensical name-dropping that is less Jungian than Joycean, a meandering waking stream of consciousness that not only fails to substantially support the nominal premise, but often bears no relationship to it whatsoever.\nTo call Peterson’s writing imprecise really does not do it justice. His definitions of “life” and “evil”, both predicated on “suffering”, are so similar that the careless reader skimming over the text might well conclude that life is evil and the deepest truth requires one to inflict unnecessary suffering on others. His many references are seldom very pertinent to the subject at hand and are primarily displayed to dazzle and impress the unsophisticated reader, who little realizes that a reference to Neil deGrasse Tyson or Prince would have been just as relevant to the point being made as the scientific study cited or the Pareto Principle. One of the most entertaining aspects of the book is the way that Peterson never permits his failure to correctly grasp a concept to stand in the way of his brandishing it like a child flashing a fake F.B.I. badge.\nOr, more ominously, like a woman’s stalker flashing a fake police badge at her door. For there is a method to Peterson’s textual madness. Every deeper concept is presented and discussed in the most nebulous, most vague, and most plausibly deniable manner. Peterson is slippery and evasive about his own beliefs throughout the book, and only the most well-informed, most careful reader who has a sufficient grasp of the various theologies and philosophies that Peterson references so freely can hope to discern what Peterson actually believes with any reasonable degree of confidence.\nBut the intellectual fog can be penetrated by an attentive reader. Jordan Peterson is not, in contrast to the incorrect assumptions of many of his readers and critics alike, a Christian or a man of the Right. Nor is he a courageous intellectual, to the contrary, he is a deeply terrified individual. More importantly, he is not a man dedicated to the truth, at least, not the truth in the conventional sense in which in the term is usually understood by the average English-speaking individual, which is why the\n12 Rules of Life\nultimately amounts to pseudo-intellectual sleight-of-hand meant to direct the reader down the false path of Peterson’s post-Christian philosophy, which for lack of an existing term we might as well christen Jordanetics.\nIt is strange that the book’s primary objective is so little recognized by its readers, considering that Peterson all but spells it out in both the title of the book as well as its coda. We are told that\nThe 12 Rules\nare an antidote to chaos, but as Peterson fans are often quick to point out, they are not only practical rules for everyday living, but metaphors for larger concepts as well. And the metaphorical chaos to which Peterson refers in the title is not a messy room, but a messy world that terrifies him, and which he has come to save by creating order out of the chaos with his “newfound Pen of Light.”\nThe best way to illustrate the never-ending stream of references that serve as Peterson’s reasoning is to simply quote the book, in this case, a section of his chapter explaining the rule that you should treat yourself like someone you are responsible for helping. And if you find yourself wondering what in the world Anton Chekhov, snakes, Michaelangelo’s Pietà, Oedipal nightmares, arboreal evolutionary adaptations, and the Garden of Eden actually have to do with the importance of taking your prescribed medications, the answer is absolutely nothing.\nText Sample:\nThere is simply no way to wall off some isolated portion of the greater surrounding reality and make everything permanently predictable and safe within it. Some of what has been no-matter-how-carefully excluded will always sneak back in. A serpent, metaphorically speaking, will inevitably appear. Even the most assiduous of parents cannot fully protect their children, even if they lock them in the basement, safely away from drugs, alcohol and internet porn. In that extreme case, the too-cautious, too-caring parent merely substitutes him or herself for the other terrible problems of life. This is the great Freudian Oedipal nightmare. It is far better to render Beings in your care competent than to protect them.\nAnd even if it were possible to permanently banish everything threatening—everything dangerous (and, therefore, everything challenging and interesting), that would mean only that another danger would emerge: that of permanent human infantilism and absolute uselessness. How could the nature of man ever reach its full potential without challenge and danger? How dull and contemptible would we become if there was no longer reason to pay attention? Maybe God thought His new creation would be able to handle the serpent, and considered its presence the lesser of two evils.Question for parents: do you want to make your children safe, or strong?\nIn any case, there’s a serpent in the Garden, and he’s a “subtil” beast, according to the ancient story (difficult to see, vaporous, cunning, deceitful and treacherous). It therefore comes as no surprise when he decides to play a trick on Eve. Why Eve, instead of Adam? It could just be chance. It was fifty-fifty for Eve, statistically speaking, and those are pretty high odds. But I have learned that these old stories contain nothing superfluous. Anything accidental—anything that does not serve the plot—has long been forgotten in the telling. As the Russian playwright Anton Chekhov advised, “If there is a rifle hanging on the wall in act one, it must be fired in the next act. Otherwise it has no business being there.” Perhaps primordial Eve had more reason to attend to serpents than Adam. Maybe they were more likely, for example, to prey on her tree-dwelling infants. Perhaps it is for this reason that Eve’s daughters are more protective, self-conscious, fearful and nervous, to this day (even, and especially, in the most egalitarian of modern human societies). In any case, the serpent tells Eve that if she eats the forbidden fruit, she won’t die. Instead, her eyes will be opened. She will become like God, knowing good from evil. Of course, the serpent doesn’t let her know she will be like God in only that one way. But he is a serpent, after all. Being human, and wanting to know more, Eve decides to eat the fruit. Poof! She wakes up: she’s conscious, or perhaps self-conscious, for the first time.\nNow, no clear-seeing, conscious woman is going to tolerate an unawakened man. So, Eve immediately shares the fruit with Adam. That makes him self-conscious. Little has changed. Women have been making men self-conscious since the beginning of time. They do this primarily by rejecting them—but they also do it by shaming them, if men do not take responsibility. Since women bear the primary burden of reproduction, it’s no wonder. It is very hard to see how it could be otherwise. But the capacity of women to shame men and render them self-conscious is still a primal force of nature.\nNow, you may ask: what in the world have snakes got to do with vision? Well, first, it’s clearly of some importance to see them, because they might prey on you (particularly when you’re little and live in trees, like our arboreal ancestors). Dr. Lynn Isbell, professor of anthropology and animal behaviour at the University of California, has suggested that the stunningly acute vision almost uniquely possessed by human beings was an adaptation forced on us tens of millions of years ago by the necessity of detecting and avoiding the terrible danger of snakes, with whom our ancestors co-evolved. This is perhaps one of the reasons the snake features in the garden of Paradise as the creature who gave us the vision of God (in addition to serving as the primordial and eternal enemy of mankind). This is perhaps one of the reasons why Mary, the eternal, archetypal mother—Eve perfected—is so commonly shown in medieval and Renaissance iconography holding the Christ Child in the air, as far away as possible from a predatory reptile, which she has firmly pinned under her foot. And there’s more. It’s fruit that the snake offers, and fruit is also associated with a transformation of vision, in that our ability to see color is an adaptation that allows us to rapidly detect the ripe and therefore edible bounty of trees.\nOur primordial parents hearkened to the snake. They ate the fruit. Their eyes opened. They both awoke. You might think, as Eve did initially, that this would be a good thing. Sometimes, however, half a gift is worse than none. Adam and Eve wake up, all right, but only enough to discover some terrible things. First, they notice that they’re naked.",
  "tags": [
    "BookReview"
  ],
  "categories": [],
  "sitemap_lastmod": "2018-05-07T17:19:18+00:00"
}