{
  "url": "https://voxday.net/2018/05/30/conservative-purges-tac-edition/",
  "scraped_at": "2025-12-19T21:04:38.238082",
  "title": "Conservative purges: TAC edition",
  "date_display": "May 30, 2018",
  "date_iso": "2018-05-30T18:04:34+00:00",
  "date_from_url": "2018-05-30",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>Ron Unz describes <a href=\"http://www.unz.com/runz/why-the-american-conservative-purged-its-own-publisher/\">how he was purged</a> from <i>The American Conservative</i> in 2013:</p><blockquote><p>On June 12th, 2013 I was having an unusually lengthy phone conversation with Daniel McCarthy, editor of <i>The American Conservative</i> (TAC). I live in Silicon Valley, three thousand miles away from DC, and despite holding the nominal title of publisher my involvement with TAC business operations had usually been negligible, amounting to just a few minutes a week on the phone. But I had grown alarmed over the lack of any major new donations since January, and had begun urging McCarthy to make the cuts in expenses necessary for the publication’s survival, while lobbying the board on the same subject. Web traffic had also been sharply declining for six or seven months, suggesting the need for a change in editorial focus. And several months earlier, TAC had cut its print frequency in half to just six issues a year while doubling the annual subscription rate to $60, thus quadrupling the per issue cost to an unreasonable $10, a pricing decision I’d strongly questioned at the time and now believed we needed to reverse.</p><p>Despite my tradition of operational disengagement, I felt comfortable pressing these points. Since late 2006 I had provided some 70{434e4795edb8718426f2262f16bc350bda72304c69f2c22d1de5754882bdf177} of TAC’s total funding, and even after converting the publication into a non-profit in 2010, I had still remained TAC’s largest donor during 2012, while also serving as chairman. TAC had come close to shutting down on a couple of previous occasions and I wanted to avoid taking such a risk again, especially since over the last year or two I had begun regularly publishing some of my own articles in the magazine.</p><p>Finally, at the end of the call I asked McCarthy whether he’d yet had a chance to prepare a redlined edit copy of the new article I’d submitted a couple of weeks earlier and on which he’d previously suggested one or two minor changes that I had subsequently made. To my enormous surprise, he informed me that he’d decided to flatly reject the entire piece—an analytical study of American urban crime rates—as representing the sort of racially-inflammatory material that had no place in a quality magazine such as <i>TAC</i>. He instead suggested that a more appropriate venue for my article would be one of the webzines categorized as White Nationalist hate-sites by the Southern Poverty Law Center.</p><p>After a few stunned words on my part, I hung up the phone and almost immediately received an emailing McCarthy had sent out to his undisclosed distribution list, harshly criticizing my behavior while repeating his same charges in more measured terms, describing the subject of my article as “a distraction from TAC’s mission” and something that would “fatally detract” from TAC’s advocacy of “the case for noninterventionism and restricting executive power.” I soon discovered that my TAC blogging privileges had also been terminated, banning me from the website. Later, my access to TAC’s ongoing website traffic information was eliminated. So more than six years after becoming TAC’s publisher, I had been summarily purged.</p><p>For several weeks I made frustrating attempts to gain support from the other members of TAC’s governing board. But they had spent years just as totally disengaged as myself from TAC’s operations and had absolutely no desire to involve themselves in what they perceived as some sort of rancorous personal dispute. During this period I did my best to avoid publicizing my situation, partly because I found it so humiliating, but finally in late July <i>National Review</i> learned of this simmering controversy and solicited an interview. Initially I hesitated, but seeing that <i>TAC</i>—after rejecting my article as “a distraction”—had covered its homepage for several days straight with articles about British rock bands, zombies, giant robots, and cartoon characters, I became angry enough to provide my side of the story to the media. Three days after NR ran its short he said-she said item, <i>TAC</i>’s board convened in a special Sunday phone session to remove me, formalizing what had already occurred.</p></blockquote><p>No wonder conservatives never get anywhere, not with opinion leaders like these.</p></div>",
  "content_text": "Ron Unz describes\nhow he was purged\nfrom\nThe American Conservative\nin 2013:\nOn June 12th, 2013 I was having an unusually lengthy phone conversation with Daniel McCarthy, editor of\nThe American Conservative\n(TAC). I live in Silicon Valley, three thousand miles away from DC, and despite holding the nominal title of publisher my involvement with TAC business operations had usually been negligible, amounting to just a few minutes a week on the phone. But I had grown alarmed over the lack of any major new donations since January, and had begun urging McCarthy to make the cuts in expenses necessary for the publication’s survival, while lobbying the board on the same subject. Web traffic had also been sharply declining for six or seven months, suggesting the need for a change in editorial focus. And several months earlier, TAC had cut its print frequency in half to just six issues a year while doubling the annual subscription rate to $60, thus quadrupling the per issue cost to an unreasonable $10, a pricing decision I’d strongly questioned at the time and now believed we needed to reverse.\nDespite my tradition of operational disengagement, I felt comfortable pressing these points. Since late 2006 I had provided some 70{434e4795edb8718426f2262f16bc350bda72304c69f2c22d1de5754882bdf177} of TAC’s total funding, and even after converting the publication into a non-profit in 2010, I had still remained TAC’s largest donor during 2012, while also serving as chairman. TAC had come close to shutting down on a couple of previous occasions and I wanted to avoid taking such a risk again, especially since over the last year or two I had begun regularly publishing some of my own articles in the magazine.\nFinally, at the end of the call I asked McCarthy whether he’d yet had a chance to prepare a redlined edit copy of the new article I’d submitted a couple of weeks earlier and on which he’d previously suggested one or two minor changes that I had subsequently made. To my enormous surprise, he informed me that he’d decided to flatly reject the entire piece—an analytical study of American urban crime rates—as representing the sort of racially-inflammatory material that had no place in a quality magazine such as\nTAC\n. He instead suggested that a more appropriate venue for my article would be one of the webzines categorized as White Nationalist hate-sites by the Southern Poverty Law Center.\nAfter a few stunned words on my part, I hung up the phone and almost immediately received an emailing McCarthy had sent out to his undisclosed distribution list, harshly criticizing my behavior while repeating his same charges in more measured terms, describing the subject of my article as “a distraction from TAC’s mission” and something that would “fatally detract” from TAC’s advocacy of “the case for noninterventionism and restricting executive power.” I soon discovered that my TAC blogging privileges had also been terminated, banning me from the website. Later, my access to TAC’s ongoing website traffic information was eliminated. So more than six years after becoming TAC’s publisher, I had been summarily purged.\nFor several weeks I made frustrating attempts to gain support from the other members of TAC’s governing board. But they had spent years just as totally disengaged as myself from TAC’s operations and had absolutely no desire to involve themselves in what they perceived as some sort of rancorous personal dispute. During this period I did my best to avoid publicizing my situation, partly because I found it so humiliating, but finally in late July\nNational Review\nlearned of this simmering controversy and solicited an interview. Initially I hesitated, but seeing that\nTAC\n—after rejecting my article as “a distraction”—had covered its homepage for several days straight with articles about British rock bands, zombies, giant robots, and cartoon characters, I became angry enough to provide my side of the story to the media. Three days after NR ran its short he said-she said item,\nTAC\n’s board convened in a special Sunday phone session to remove me, formalizing what had already occurred.\nNo wonder conservatives never get anywhere, not with opinion leaders like these.",
  "tags": [
    "cuckservative"
  ],
  "categories": [],
  "sitemap_lastmod": "2018-05-30T17:04:34+00:00"
}