{
  "url": "https://voxday.net/2018/05/11/darkstream-identity-is-tradition/",
  "scraped_at": "2025-12-19T21:01:29.146427",
  "title": "Darkstream: identity is tradition",
  "date_display": "May 11, 2018",
  "date_iso": "2018-05-11T13:20:53+00:00",
  "date_from_url": "2018-05-11",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>In <a href=\"https://www.youtube.com/watch?v=1SL2EUk-T0g&amp;feature=youtu.be\">last night’s Darkstream</a>, I mentioned the way in which the people of Tongling, China, impressed Douglas Adams with the size and speed of their unprecedented, and ultimately unsuccessful, attempt to save the now-extinct baiji, the Yangtze River Dolphin.</p><p>From <i>Last Chance to See</i>:</p><blockquote><p>A little upstream of Tongling, opposite the town of Datong, there is an elbow-shaped bend in the river. In the crook of the elbow lie two triangular islands, between which runs a channel of water. The channel is about one and a half kilometres long, five metres deep, and between forty and two hundred metres wide, and this channel will be the dolphins’ semi-nature reserve.</p><p>Fences of bamboo and metal are being constructed at either end of the channel, through which water from the main river flows continuously. A huge amount of remodelling and construction work is being done to make this possible. A large artificial hospital and holding pools are being built on one of the islands to hold injured or newly captured dolphins. A fish farm is being built on the other to feed them.</p><p>The scale of the project is enormous.</p><p>It is very, very expensive, the committee said, solemnly, and they can’t even be sure that it will work. But they have to try. The baiji, they explained, is very important to them and it is their duty to protect it.</p><p>Mark asked them how on earth they raised the money to do it. It had all been put into operation in an extraordinarily short time.</p><p>Yes, they said, we have had to work very, very fast.</p><p>They had raised money from many sources. A substantial amount came from the central government, and more again from local government. Then there were many donations from local people and businesses. They had also, they said a little hesitantly, gone into the business of public relations, and they would welcome our comments on this. Chinese knew little of such matters, but we, as Westerners, must surely be experts.</p><p>First, they said, they had persuaded the local brewery to use the baiji as their trademark. Had we tried Baiji Beer? It was of a good quality, now much respected in all of China. Then others had followed. The committee had entered into . . . Here there was a bit of a vocabulary problem, which necessitated a little discussion with the interpreter before the right phrase at last emerged.</p><p>They had entered into licensing agreements. Local businesses had put money into the project, in return for which they were licensed to use the baiji. symbol, which in turn made good publicity for the baiji dolphin.</p><p>So now there was not only Baiji Beer, there was also the Baiji Hotel, Baiji shoes, Baiji Cola, Baiji computerised weighing scales, Baiji toilet paper, Baiji phosphorus fertiliser, and Baiji Bentonite. Bentonite was a new one on me, and I asked them what it was.</p><p>They explained that Bentonite was a mining product used in the production of toothpaste, iron and steel casting, and also as an additive for pig food. Baiji Bentonite was a very successful product. Did we, as experts, think that this public relations was good?</p><p>We said it was absolutely astonishing, and congratulated them.</p><p>They were very gratified to know this, they said, from Western experts in such matters.</p><p>We felt more than a little abashed at these encomiums. It was very hard to imagine anywhere in the Western world that would be capable of responding with such prodigious speed, imagination and communal determination to such a problem. Although the committee told us that they hoped that, since Tongling had recently been declared an open city to visitors for the first time, the dolphins and the semi-nature reserve might bring tourists and tourist money to the area, it was very clear that this was not the primary impulse.</p><p>At the end they said, ‘The residents in the area gain some profit – that’s natural – but we have more profound plans, that is to protect the dolphin as a species, not to let it become extinct in our generation. Its protection is our duty. As we know that only two hundred pieces of this animal survive it may go extinct if we don’t take measures to prevent it, and if that happens we will feel guilty for our descendants and later generations.’</p><p>We left the room feeling, for the first time in China, uplifted. It seemed that, for all the stilted and awkward formality of the meeting, we had had our first and only real glimpse of the Chinese mind. They took it as their natural duty to protect this animal, both for its own sake and for that of the future world.</p></blockquote><p><i>An excerpt from the transcript of <a href=\"https://www.youtube.com/watch?v=1SL2EUk-T0g&amp;feature=youtu.be\">the Darkstream</a>.</i></p><p>The main reason that the Chinese commissioners gave for these huge efforts that they were putting forth to try to save this animal was because they felt that a failure to do so, a failure to preserve the animal, was going to shame them in both the eyes of their ancestors and their descendants. You know, they viewed themselves as being part of this great chain of family, this chain of tribe and nation that had a responsibility for the land and the animals in their area, and it really struck me because this is exactly what the Fake Opposition like Ben Shapiro, like Jordan Peterson, stand against. You know, when Jordan Peterson is telling you that you have no right to take pride in the accomplishments of your ancestors, what he’s also telling you is that you have no responsibility whatsoever to your children and your descendants.</p><p>You know I’ve said repeatedly that the philosophy Jordan Peterson is pushing is an evil one, and it is, and one aspect of that evil, one way that we know that it is wrong, is that he and Shapiro and all these other Fake Opposition members are saying “oh all that matters is the individual, all that matters is you, you should only pay attention to your own needs, your own standards, you’ve no right to take pride in your legacy, you have no responsibility to instill those traditions and values into your children.” After all, if you have no responsibility to carry on the work of your parents, if you have no right to take pride in the legacy and the achievement of your parents, then neither do your children have any right or responsibility to do so with regards to you! I mean this is a very obvious transitive principle of logic at work, and so I think that it’s so important to understand that when conservatives are coming out against identity politics, you need to understand that they are simultaneously coming out against family values, tribal values, and national values.</p><p>You know they don’t want to admit that they’re doing this, but that’s exactly what they’re doing, and it’s also connected to the advice of people like Ben Shapiro to go and chase the young. He’s saying, “well the Republicans need to change their policies, they need to embrace things like gay marriage and they need to embrace things like abortion and whatever else it is that the young are okay with,” but that’s profoundly stupid because the young have no experience. The young don’t understand why the traditions existed in the first place and they don’t understand why the traditions are necessary to provide the very society and culture that they enjoy today.</p><p>And of course because these people do not want to preserve the West, you know the people who think that, Ben Shapiro and Jordan Peterson and the Weinsteins and all these other fake opposition folks, you know, the Sam Harrises, whatever, they don’t want to preserve the West, they do not want to preserve Western civilization. They’re not Christian, they’re either neutral on Christianity or they’re anti-Christian, they don’t want to preserve the European nations – to the contrast they want to replace the European nations – and so the more that you understand this, the more you realize how evil these people are, how evil their objectives are.</p><p><i>Those who have accomplished something as individuals feel no need to be proud of their race.</i><br>– Jordan Peterson</br></p><p><i>Real cultural appropriation — that’s when someone is proud of his culture despite having done nothing to support it, extend it or transform it: a message to the far right.</i><br>– Jordan Peterson</br></p><p><i>You shouldn’t be “proud” of your culture: you should be honored by the privilege of partaking in it, and grateful for its existence, despite your inadequacy. That is not at all the same thing.</i><br>– Jordan Peterson</br></p><p>Q: What’s the goal of the radical right? A: <i>Unearned identity with the glories of the past.</i><br>– Jordan Peterson</br></p><p><i>Now the right-wing identitarians have their panties in a knot about what I’ve said about the pathology of racial pride…. Demonstrating (as if it is necessary) that the mirror reflection of malevolence is also…. malevolence. </i><br>– Jordan Peterson</br></p><p>Jordan Peterson is a filthy liar – an absolutely <i>shameless </i>liar – and what passes for his “wisdom” doesn’t even rise to the level of that demonstrated by atheist Chinese communists. Most of the men and women of accomplishment I have known are proud of their race, proud of their nation, proud of their state, and proud of their tribe. Indeed, they often appeal to that pride in order to inspire their children and grandchildren to behave in a manner that is worthy of their race, nation, state, and tribe.</p><p>A man has more than a right, he has a <i>responsibility </i>to be proud of his race just as he should be proud of his military unit, his alma mater, or his soccer club, even before he has managed to meaningfully contribute to it or not. Indeed, why would a member of any group be moved to support or extend or contribute to it if one did not feel a sense of pride in belonging to it? These are the petty words of a very small man who has never worn a uniform of any kind, who has never walked into a stadium with the eyes of thousands of spectators upon him, knowing full well that he was not there to represent himself, but rather, all of those whom the colors he was wearing represented.</p><p>What this man is teaching a generation of rootless young men is absolute anathema to the core values that were instilled in me by my grandfather, the bravest man I ever knew, a man hailed as “the Marine’s Marine” by the Commandant of the USMC himself.</p><p>If you still don’t believe that Jordan Peterson is a sick, evil, and dishonest individual pushing an evil philosophy on the unsuspecting and the unsophisticated, remember, this is a man who claimed that his cousin is the most beautiful woman he has ever seen and dreamed about her being killed and cannibalized. Repeatedly.</p></div>",
  "content_text": "In\nlast night’s Darkstream\n, I mentioned the way in which the people of Tongling, China, impressed Douglas Adams with the size and speed of their unprecedented, and ultimately unsuccessful, attempt to save the now-extinct baiji, the Yangtze River Dolphin.\nFrom\nLast Chance to See\n:\nA little upstream of Tongling, opposite the town of Datong, there is an elbow-shaped bend in the river. In the crook of the elbow lie two triangular islands, between which runs a channel of water. The channel is about one and a half kilometres long, five metres deep, and between forty and two hundred metres wide, and this channel will be the dolphins’ semi-nature reserve.\nFences of bamboo and metal are being constructed at either end of the channel, through which water from the main river flows continuously. A huge amount of remodelling and construction work is being done to make this possible. A large artificial hospital and holding pools are being built on one of the islands to hold injured or newly captured dolphins. A fish farm is being built on the other to feed them.\nThe scale of the project is enormous.\nIt is very, very expensive, the committee said, solemnly, and they can’t even be sure that it will work. But they have to try. The baiji, they explained, is very important to them and it is their duty to protect it.\nMark asked them how on earth they raised the money to do it. It had all been put into operation in an extraordinarily short time.\nYes, they said, we have had to work very, very fast.\nThey had raised money from many sources. A substantial amount came from the central government, and more again from local government. Then there were many donations from local people and businesses. They had also, they said a little hesitantly, gone into the business of public relations, and they would welcome our comments on this. Chinese knew little of such matters, but we, as Westerners, must surely be experts.\nFirst, they said, they had persuaded the local brewery to use the baiji as their trademark. Had we tried Baiji Beer? It was of a good quality, now much respected in all of China. Then others had followed. The committee had entered into . . . Here there was a bit of a vocabulary problem, which necessitated a little discussion with the interpreter before the right phrase at last emerged.\nThey had entered into licensing agreements. Local businesses had put money into the project, in return for which they were licensed to use the baiji. symbol, which in turn made good publicity for the baiji dolphin.\nSo now there was not only Baiji Beer, there was also the Baiji Hotel, Baiji shoes, Baiji Cola, Baiji computerised weighing scales, Baiji toilet paper, Baiji phosphorus fertiliser, and Baiji Bentonite. Bentonite was a new one on me, and I asked them what it was.\nThey explained that Bentonite was a mining product used in the production of toothpaste, iron and steel casting, and also as an additive for pig food. Baiji Bentonite was a very successful product. Did we, as experts, think that this public relations was good?\nWe said it was absolutely astonishing, and congratulated them.\nThey were very gratified to know this, they said, from Western experts in such matters.\nWe felt more than a little abashed at these encomiums. It was very hard to imagine anywhere in the Western world that would be capable of responding with such prodigious speed, imagination and communal determination to such a problem. Although the committee told us that they hoped that, since Tongling had recently been declared an open city to visitors for the first time, the dolphins and the semi-nature reserve might bring tourists and tourist money to the area, it was very clear that this was not the primary impulse.\nAt the end they said, ‘The residents in the area gain some profit – that’s natural – but we have more profound plans, that is to protect the dolphin as a species, not to let it become extinct in our generation. Its protection is our duty. As we know that only two hundred pieces of this animal survive it may go extinct if we don’t take measures to prevent it, and if that happens we will feel guilty for our descendants and later generations.’\nWe left the room feeling, for the first time in China, uplifted. It seemed that, for all the stilted and awkward formality of the meeting, we had had our first and only real glimpse of the Chinese mind. They took it as their natural duty to protect this animal, both for its own sake and for that of the future world.\nAn excerpt from the transcript of\nthe Darkstream\n.\nThe main reason that the Chinese commissioners gave for these huge efforts that they were putting forth to try to save this animal was because they felt that a failure to do so, a failure to preserve the animal, was going to shame them in both the eyes of their ancestors and their descendants. You know, they viewed themselves as being part of this great chain of family, this chain of tribe and nation that had a responsibility for the land and the animals in their area, and it really struck me because this is exactly what the Fake Opposition like Ben Shapiro, like Jordan Peterson, stand against. You know, when Jordan Peterson is telling you that you have no right to take pride in the accomplishments of your ancestors, what he’s also telling you is that you have no responsibility whatsoever to your children and your descendants.\nYou know I’ve said repeatedly that the philosophy Jordan Peterson is pushing is an evil one, and it is, and one aspect of that evil, one way that we know that it is wrong, is that he and Shapiro and all these other Fake Opposition members are saying “oh all that matters is the individual, all that matters is you, you should only pay attention to your own needs, your own standards, you’ve no right to take pride in your legacy, you have no responsibility to instill those traditions and values into your children.” After all, if you have no responsibility to carry on the work of your parents, if you have no right to take pride in the legacy and the achievement of your parents, then neither do your children have any right or responsibility to do so with regards to you! I mean this is a very obvious transitive principle of logic at work, and so I think that it’s so important to understand that when conservatives are coming out against identity politics, you need to understand that they are simultaneously coming out against family values, tribal values, and national values.\nYou know they don’t want to admit that they’re doing this, but that’s exactly what they’re doing, and it’s also connected to the advice of people like Ben Shapiro to go and chase the young. He’s saying, “well the Republicans need to change their policies, they need to embrace things like gay marriage and they need to embrace things like abortion and whatever else it is that the young are okay with,” but that’s profoundly stupid because the young have no experience. The young don’t understand why the traditions existed in the first place and they don’t understand why the traditions are necessary to provide the very society and culture that they enjoy today.\nAnd of course because these people do not want to preserve the West, you know the people who think that, Ben Shapiro and Jordan Peterson and the Weinsteins and all these other fake opposition folks, you know, the Sam Harrises, whatever, they don’t want to preserve the West, they do not want to preserve Western civilization. They’re not Christian, they’re either neutral on Christianity or they’re anti-Christian, they don’t want to preserve the European nations – to the contrast they want to replace the European nations – and so the more that you understand this, the more you realize how evil these people are, how evil their objectives are.\nThose who have accomplished something as individuals feel no need to be proud of their race.\n– Jordan Peterson\nReal cultural appropriation — that’s when someone is proud of his culture despite having done nothing to support it, extend it or transform it: a message to the far right.\n– Jordan Peterson\nYou shouldn’t be “proud” of your culture: you should be honored by the privilege of partaking in it, and grateful for its existence, despite your inadequacy. That is not at all the same thing.\n– Jordan Peterson\nQ: What’s the goal of the radical right? A:\nUnearned identity with the glories of the past.\n– Jordan Peterson\nNow the right-wing identitarians have their panties in a knot about what I’ve said about the pathology of racial pride…. Demonstrating (as if it is necessary) that the mirror reflection of malevolence is also…. malevolence.\n– Jordan Peterson\nJordan Peterson is a filthy liar – an absolutely\nshameless\nliar – and what passes for his “wisdom” doesn’t even rise to the level of that demonstrated by atheist Chinese communists. Most of the men and women of accomplishment I have known are proud of their race, proud of their nation, proud of their state, and proud of their tribe. Indeed, they often appeal to that pride in order to inspire their children and grandchildren to behave in a manner that is worthy of their race, nation, state, and tribe.\nA man has more than a right, he has a\nresponsibility\nto be proud of his race just as he should be proud of his military unit, his alma mater, or his soccer club, even before he has managed to meaningfully contribute to it or not. Indeed, why would a member of any group be moved to support or extend or contribute to it if one did not feel a sense of pride in belonging to it? These are the petty words of a very small man who has never worn a uniform of any kind, who has never walked into a stadium with the eyes of thousands of spectators upon him, knowing full well that he was not there to represent himself, but rather, all of those whom the colors he was wearing represented.\nWhat this man is teaching a generation of rootless young men is absolute anathema to the core values that were instilled in me by my grandfather, the bravest man I ever knew, a man hailed as “the Marine’s Marine” by the Commandant of the USMC himself.\nIf you still don’t believe that Jordan Peterson is a sick, evil, and dishonest individual pushing an evil philosophy on the unsuspecting and the unsophisticated, remember, this is a man who claimed that his cousin is the most beautiful woman he has ever seen and dreamed about her being killed and cannibalized. Repeatedly.",
  "tags": [
    "cuckservative"
  ],
  "categories": [],
  "sitemap_lastmod": "2018-05-11T12:20:53+00:00"
}