{
  "url": "https://voxday.net/2018/05/29/darkstream-tommy-robinson-and-the-death-of-eu-democracy/",
  "scraped_at": "2025-12-19T21:04:23.880875",
  "title": "Darkstream: Tommy Robinson and the death of EU democracy",
  "date_display": "May 29, 2018",
  "date_iso": "2018-05-29T09:25:06+00:00",
  "date_from_url": "2018-05-29",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p><i>I’m still working on getting out <a href=\"https://www.youtube.com/watch?v=U2XPyD60dIc\">the livestreaming kinks</a>. This was all just inexperienced user error; I forgot that without my headset on, I couldn’t hear the audio track of the Wilders video but the viewers could, and I talked over it. Then I loaded the wrong Stefan clip, which was much longer than the one I had cut, and trying to stop it caused the streaming software to freeze on my end. But we soldiered on anyhow. Also, I forgot to retitle the stream before I started it, hence some of the earlier confusion on the part of those watching live. It’s a learning process.</i><br><i><br/></i></br></p><div style=\"text-align: center;\"><iframe allow=\"autoplay; encrypted-media\" allowfullscreen=\"\" frameborder=\"0\" height=\"284\" src=\"https://www.youtube.com/embed/U2XPyD60dIc\" width=\"512\"></iframe></div><p>I think is important to observe here who is speaking out about this and who isn’t. Okay, where are the big, self-appointed champions of free speech in this? Have we heard Ben Shapiro say anything yet? Have we heard Jordan Peterson use his big microphone in order to champion the cause of Tommy Robinson, or at the very least, to protest what is happening with regards to the British media’s gag order?</p><p>Now contra what you guys might think, I’m not obsessed with these guys, I have no idea what they’ve said on the subject, but I know enough about them to guess that they’re not going to say anything, because when push comes to shove, they are more concerned about eliminating and eradicating nationalism than they are in championing the free speech that they claim to support.</p><p>Now the problem is actually much much bigger than what Tommy Robinson is facing, or than the British media is facing. A lot of you may not realize this, but in Italy two nationalist parties recently dominated the most recent Italian election, Movimento Cinque Stelle, which is of the Left, and La Liga which is led by Matteo Salvini, is of the Right, and between the two of them they have an absolute majority in the Italian parliament. (Combined, they hold 69.7 percent of the seats.) In fact La Liga has a has a very powerful position there, they’re one of the more powerful parliamentary parties in Europe at the moment, (with 37 percent of the seats) but what was remarkable was that the Italian President managed to interfere with the formation of a government and the sole reason that he stood in the way and prevented the formation of a government was because he wanted to keep a 81-year-old Euroskeptic out of the Finance Ministry.</p><p>So what that tells us is that all of the professed ideals of the European Union, all the various claims to democracy and so forth are entirely false. It all comes down to power and money, you know, the European Union is doing whatever it can to silence people like Tommy Robinson, they’re doing as much as they can to keep the public from finding out what’s really going on, but most of all they are absolutely desperate to protect the single currency because the single currency is what makes all of the banking games and all of the shenanigans and everything possible.</p><p>And so it’s important to understand that these games that they’re playing are just that, they’re games. They have no moral high ground and they have absolutely not a single democratic leg to stand on. You know, as is so common with intellectual charlatans throughout the world, and throughout history, what they play is the game of bait and switch, they play the game of changing the very clear and well-understood definition of terms, so now what we see is that democracy no longer means “the will of the people” it now means the approved will of the Neo-liberal World Order.</p><p>You see all these claims that the US has to defend democracy but if the US is going to defend  democracy it should be invading Europe again.</p></div>",
  "content_text": "I’m still working on getting out\nthe livestreaming kinks\n. This was all just inexperienced user error; I forgot that without my headset on, I couldn’t hear the audio track of the Wilders video but the viewers could, and I talked over it. Then I loaded the wrong Stefan clip, which was much longer than the one I had cut, and trying to stop it caused the streaming software to freeze on my end. But we soldiered on anyhow. Also, I forgot to retitle the stream before I started it, hence some of the earlier confusion on the part of those watching live. It’s a learning process.\nI think is important to observe here who is speaking out about this and who isn’t. Okay, where are the big, self-appointed champions of free speech in this? Have we heard Ben Shapiro say anything yet? Have we heard Jordan Peterson use his big microphone in order to champion the cause of Tommy Robinson, or at the very least, to protest what is happening with regards to the British media’s gag order?\nNow contra what you guys might think, I’m not obsessed with these guys, I have no idea what they’ve said on the subject, but I know enough about them to guess that they’re not going to say anything, because when push comes to shove, they are more concerned about eliminating and eradicating nationalism than they are in championing the free speech that they claim to support.\nNow the problem is actually much much bigger than what Tommy Robinson is facing, or than the British media is facing. A lot of you may not realize this, but in Italy two nationalist parties recently dominated the most recent Italian election, Movimento Cinque Stelle, which is of the Left, and La Liga which is led by Matteo Salvini, is of the Right, and between the two of them they have an absolute majority in the Italian parliament. (Combined, they hold 69.7 percent of the seats.) In fact La Liga has a has a very powerful position there, they’re one of the more powerful parliamentary parties in Europe at the moment, (with 37 percent of the seats) but what was remarkable was that the Italian President managed to interfere with the formation of a government and the sole reason that he stood in the way and prevented the formation of a government was because he wanted to keep a 81-year-old Euroskeptic out of the Finance Ministry.\nSo what that tells us is that all of the professed ideals of the European Union, all the various claims to democracy and so forth are entirely false. It all comes down to power and money, you know, the European Union is doing whatever it can to silence people like Tommy Robinson, they’re doing as much as they can to keep the public from finding out what’s really going on, but most of all they are absolutely desperate to protect the single currency because the single currency is what makes all of the banking games and all of the shenanigans and everything possible.\nAnd so it’s important to understand that these games that they’re playing are just that, they’re games. They have no moral high ground and they have absolutely not a single democratic leg to stand on. You know, as is so common with intellectual charlatans throughout the world, and throughout history, what they play is the game of bait and switch, they play the game of changing the very clear and well-understood definition of terms, so now what we see is that democracy no longer means “the will of the people” it now means the approved will of the Neo-liberal World Order.\nYou see all these claims that the US has to defend democracy but if the US is going to defend  democracy it should be invading Europe again.",
  "tags": [
    "Darkstream"
  ],
  "categories": [],
  "sitemap_lastmod": "2018-05-29T08:25:06+00:00"
}