{
  "url": "https://voxday.net/2018/05/25/darkstream-the-free-speech-fake/",
  "scraped_at": "2025-12-19T21:03:45.116123",
  "title": "Darkstream: the Free Speech Fake",
  "date_display": "May 25, 2018",
  "date_iso": "2018-05-25T12:35:17+00:00",
  "date_from_url": "2018-05-25",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><div style=\"text-align: center;\"><iframe allow=\"autoplay; encrypted-media\" allowfullscreen=\"\" frameborder=\"0\" height=\"284\" src=\"https://www.youtube.com/embed/AoyjECn0wZ0\" width=\"512\"></iframe></div><p><i><a href=\"https://www.youtube.com/watch?v=AoyjECn0wZ0\">From the recent transcript</a> of my second successful attempt at livestreaming a Darkstream. If you want alerts for when I go live with them, subscribe to the <b><a href=\"https://www.youtube.com/channel/UCGJNdaSwFeP3pLd1MhN0dRg\">voxday</a> </b>channel, which is distinct from the <b>Voxiversity </b>channel.</i></p><p>Here’s the thing: If Jordan Peterson is a genuine free speech advocate, then what is he doing on Patreon? Why is he supporting an SJW-converged organization that is actively and aggressively opposed to free speech? Has anyone asked him that?</p><p>You know, the thing that you have to understand is that in the same way that Ben Shapiro is a fake American conservative, Jordan Peterson is a fake free speech advocate. Now, I’m not saying that the free speech is the most vital thing in the world – I’m not a free speech advocate myself – but if you’re going to sell yourself as a free speech advocate, if you’re going to claim to be a free speech champion, if you’re going to run around the country, run around the world, lecturing people on how they they have to be individuals and they have to speak their own truth, then there is absolutely no way that you<br>should be working with a company like Patreon. There’s absolutely no way that you should be supporting any business that is as ruthlessly prone to speech policing as Patreon!</br></p><p><i>This led to an informative exchange in the comments when one commenter quite reasonably requested a clarification concerning my claim not to be a free speech advocate. For the record, I am not, nor have I ever claimed to be, a follower or admirer of Voltaire. I will absolutely <u>not</u> defend anyone’s absolute right to blaspheme or even be impolite, much less to the death. To the contrary, I have even pointed out <a href=\"http://voxday.blogspot.com/2012/01/voltaire-had-it-wrong.html\">how very wrong he was</a>.</i><br><i><br/></i><b>JustAintThatWay:</b> <i>“… I’m not a free speech advocate …” </i>Say what?  Clarification requested. From any WesternCiv, let alone a book publisher.  “I may not agree w/  what you say, but will defend to the death, your right to say it”-style.﻿<br><i><br/></i><b>VD:</b> Read more about the history of free speech. It’s nothing more than a philosophical attack on Western Civilization in general and Christianity in particular. JB Bury, a strong advocate, has written a very informative history that makes it clear that it was always about getting rid of the West’s blasphemy laws.﻿<br><i><br/></i><b>Joshua Coleman: </b>I’d recommend you read the Supreme Court rulings in <i>Reynolds vs United States, Commonwealth Vs Nesbit, </i>and <i>Lindenmuller Vs The People. </i>They reaffirm that the First Amendment, and in particular the Religion clause, was not a free license to say anything you like. Specifically, anything that was considered “Subversive of good order” and “overt acts against peace” were not protected, and among those things was advocation of immorality. The Libertarian / Conservative / Liberal interpretation of ‘you can say anything’ is ahistorical. The First Amendment was to protect your right to express your Christianity without State interference, not to subvert Christian order and morality. You could be prosecuted for doing or advocating immorality such as bigamy, polygamy, parricide, infanticide, etc.</br></br></br></p></div>",
  "content_text": "From the recent transcript\nof my second successful attempt at livestreaming a Darkstream. If you want alerts for when I go live with them, subscribe to the\nvoxday\nchannel, which is distinct from the\nVoxiversity\nchannel.\nHere’s the thing: If Jordan Peterson is a genuine free speech advocate, then what is he doing on Patreon? Why is he supporting an SJW-converged organization that is actively and aggressively opposed to free speech? Has anyone asked him that?\nYou know, the thing that you have to understand is that in the same way that Ben Shapiro is a fake American conservative, Jordan Peterson is a fake free speech advocate. Now, I’m not saying that the free speech is the most vital thing in the world – I’m not a free speech advocate myself – but if you’re going to sell yourself as a free speech advocate, if you’re going to claim to be a free speech champion, if you’re going to run around the country, run around the world, lecturing people on how they they have to be individuals and they have to speak their own truth, then there is absolutely no way that you\nshould be working with a company like Patreon. There’s absolutely no way that you should be supporting any business that is as ruthlessly prone to speech policing as Patreon!\nThis led to an informative exchange in the comments when one commenter quite reasonably requested a clarification concerning my claim not to be a free speech advocate. For the record, I am not, nor have I ever claimed to be, a follower or admirer of Voltaire. I will absolutely\nnot\ndefend anyone’s absolute right to blaspheme or even be impolite, much less to the death. To the contrary, I have even pointed out\nhow very wrong he was\n.\nJustAintThatWay:\n“… I’m not a free speech advocate …”\nSay what?  Clarification requested. From any WesternCiv, let alone a book publisher.  “I may not agree w/  what you say, but will defend to the death, your right to say it”-style.﻿\nVD:\nRead more about the history of free speech. It’s nothing more than a philosophical attack on Western Civilization in general and Christianity in particular. JB Bury, a strong advocate, has written a very informative history that makes it clear that it was always about getting rid of the West’s blasphemy laws.﻿\nJoshua Coleman:\nI’d recommend you read the Supreme Court rulings in\nReynolds vs United States, Commonwealth Vs Nesbit,\nand\nLindenmuller Vs The People.\nThey reaffirm that the First Amendment, and in particular the Religion clause, was not a free license to say anything you like. Specifically, anything that was considered “Subversive of good order” and “overt acts against peace” were not protected, and among those things was advocation of immorality. The Libertarian / Conservative / Liberal interpretation of ‘you can say anything’ is ahistorical. The First Amendment was to protect your right to express your Christianity without State interference, not to subvert Christian order and morality. You could be prosecuted for doing or advocating immorality such as bigamy, polygamy, parricide, infanticide, etc.",
  "tags": [
    "Darkstream"
  ],
  "categories": [],
  "sitemap_lastmod": "2018-05-25T11:35:17+00:00"
}