{
  "url": "https://voxday.net/2018/05/26/direct-from-the-lunatics-mouth/",
  "scraped_at": "2025-12-19T21:04:01.769608",
  "title": "Direct from the lunatic’s mouth",
  "date_display": "May 26, 2018",
  "date_iso": "2018-05-26T23:35:09+00:00",
  "date_from_url": "2018-05-26",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p><i>This is the most informative, and damning, section of Maps of Meaning. Perhaps it will help some of the morons and midwits who have never read any of this and simply can’t seem to grasp that Jordan Peterson is a globalist lunatic with delusions of grandiosity and a Messiah complex despite it being repeatedly pointed out to them.</i><br><i><br/></i><i>I have put what I consider to be the most important revelations <b>in bold</b>. It’s a bit frustrating, since I have been telling people about this since the day I read what confirmed my earlier suspicions about the man, but instead of simply going to the source and determining if I was telling the truth or not, literally scores of Peterson defenders opted to instead accuse me of everything from jealousy to slander to invention. But it is not only all right there, it has all been right there since 1999!</i></br></p><p>Christ said, the kingdom of heaven is spread out upon the earth, but men do not see it. <b>What if it was nothing but our self-deceit, our cowardice, hatred and fear, that pollutes our experience and turns the world into hell?</b> This is a hypothesis, at least—as good as any other, admirable and capable of generating hope. Why can’t we make the experiment, and find out if it is true?</p><p>The central ideas of Christianity are rooted in Gnostic philosophy, which, in accordance with psychological laws, simply had to grow up at a time when the classical religions had become obsolete. <b>It was founded on the perception of symbols thrown up by the unconscious individuation process</b> which always sets in when the collective dominants of human life fall into decay. At such a time there is bound to be a considerable number of individuals who are possesed by archetypes of a numinous nature that force their way to the surface in order to form new dominants.</p><p>This state of possession shows itself almost without exception in the fact that the possessed identify themselves with the archetypal contents of their unconscious, and, because they do not realize that the role which is being thrust upon them is the effect of new contents still to be understood, they exemplify these concretely in their own lives, thus becoming prophets and reformers.</p><p>In so far as the archetypal content of the Christian drama was able to give satisfying expression to the uneasy and clamorous unconscious of the many, the <i>consensus omnium</i> raised this drama to a universally binding truth—not of course by an act of judgment, but by the irrational fact of possession, which is far more effective.</p><p><b>Thus Jesus became the tutelary image or amulet against the archetypal powers that threatened to possess everyone.</b> The glad tidings announced: “It has happened, but it will not happen to you inasmuch as you believe in Jesus Christ, the Son of God!”</p><p>Yet it could and it can and it will happen to everyone in whom the Christian dominant has decayed….</p><p><i>Dear Dad</i><br><i><br/></i><i>I promised you that one day I would tell you what the book I am trying to write is supposed to be about. I haven’t been working on it much in the last month, although in some regards it is always on my mind and everything I learn, in my other work, has some bearing upon it. Because I have abandoned it, temporarily, I thought perhaps I could tell you about it, and that would help me organize my thoughts.</i><br><i><br/></i><i>I don’t completely understand the driving force behind what I have been working on, although I understand it better now than I used to, three or four years ago, when <b>it was literally driving me crazy</b>. I had been obsessed with the idea of war for three or four years prior to that, <b>often dreaming extremely violent dreams</b>, centered around the theme of destruction. I believe now that my concern with death on a mass scale was intimately tied into my personal life, and that concerns with the meaning of life on a personal level (which arise with the contemplation of death) took a general form for me, which had to do with the value of humanity, and the purpose of life in general.</i><br><i><br/></i><i>Carl Jung has suggested that all personal problems are relevant to society, because we are all so much alike, and that any sufficiently profound solution to a personal problem may, if communicated, reduce the likelihood of that problem existing in anyone’s experience in the future. This is in fact how society and the individual support one another. It was in this way that my concern with war, which is the application of death on the general level, led me into concepts and ideas concerning the meaning of life on the personal level, which I could never have imagined as relevant, or believable, prior to learning about them—and which I still believe <b>border on what might normally be considered insanity</b>.</i><br><i><br/></i><i>The reasons for war, many believe, are rooted in politics. Since it is groups of men that fight, and since groups indulge in politics, this belief seems well-founded and in fact contains some truth. It is just as true, however, that it is a good thing to look for something you don’t want to find in a place where you know it won’t be—and the modern concern with global politics, and the necessity to be involved in a “good cause, ” rather than to live responsibly, seems to me to be evidence that the desire not to find often overpowers the real search for truth. You see, it is true that people don’t want the truth, because the truth destroys what lack of faith erects, and the false comfort it contains. It is not possible to live in the world that you wish could be, and in the real world at the same time, and it often seems a bad bargain to destroy fantasy for reality. It is desire for lack of responsibility that underlies this evasion, in part—but it is also fear of possibility. At least this is how it seems to me.</i><br><i><br/></i><i>Because everyone is a product of their times, and because that applies to me as well, I looked for what I wanted to find where it was obvious to everyone it would be—in politics, in political science, in the study of group behavior. This took up the years I spent involved with the NDP, and in studying political science, until I learned that the application of a system of thought, like socialism (or any other ism, for that matter) to a problem, and solving that problem, were not the same thing. In the former case, you have someone (who is not you) to blame—the rich, the Americans, the white people, the government, the system—whatever, as long as it is someone else.</i><br><i><br/></i><i>I came to realize, slowly, that <b>a problem of global proportions existed as a problem because everyone on the globe thought and acted to maintain that problem</b>. Now what that means is that if the problem has a solution, then what everyone thinks is wrong—and that meant, too, that what I thought had to be fundamentally wrong. Now the problem with this line of reasoning is simple. It leads inexorably to the following conclusion: the more fundamental the problem, the more fundamental the error—in my own viewpoint.</i><br><i><br/></i><i>I came to believe that <b>survival itself, and more, depended upon a solution to the problem of war.</b> This made me consider that perhaps everything I believed was wrong. This consideration was not particularly pleasant, and was severely complicated by the fact that I had also come to realize that, although I definitely believed a variety of things, I did not always know what I believed—and when I knew what, I did not know why.</i><br><i><br/></i><i>You see, history itself conditioned everything I believed, even when I did not know it, and it was sheer unconscious arrogance that made me posit to begin with that I had half a notion of who or what I was, or what the process of history had created, and how I was affected by that creation.</i><br><i><br/></i><i>It is one thing to be unconscious of the answers, and quite another to be unable to even consider the question.</i><br><i><br/></i><i>I had a notion that confronting what terrified me—what turned my dreams against me—could help me withstand that terrible thing. This idea—granted me by the grace of God—allowed me to believe that I could find what I most wanted (if I could tolerate the truth; if I was willing to follow wherever it led me; if I was willing to devote my life to acting upon what I had discovered, whatever that might be, without reservation— knowing somehow that once started, an aborted attempt would destroy at least my self-respect, <b>at most my sanity</b> and desire to live).</i><br><i><br/></i><i>I believe now that everyone has this choice in front of them, even when they do not know or refuse to admit it; that everyone makes this choice, with every decision and action they take.</i><br><i><br/></i><i>I mentioned earlier that history conditioned what I think and acted. Pursuit of this realization—which is rather self-evident, once realized—has led me to the study of history, as a psychological phenomenon. You see, if what I think and am is a product of history, that means that history must take form inside me, so to speak, and from inside me determine who I am. This is easier to understand if you consider that I carry around inside me an image of you—composed of memories of how you act, and what you expected, and depictions of your behavior. This image has had profound impact on howI behaved, as a child—when, even in your absence, I was compelled to follow the rules which you followed (and which I learned through imitation, and which you instilled into me, through praise and punishment). Sometimes that image of you, in me, even takes the form of a personality, when I dream about you.</i><br><i><br/></i><i>So it is a straightforward matter to believe, from the psychological point of view, that each individual carries around an image of his parents, and that this image governs his behavior, at least in part.</i><br><i><br/></i><i>But you see it is the case that the rules that you followed—and which I learned from you—were not rules that you yourself created, but rather those that you handed to me just as you had been handed them while still a child.</i><br><i><br/></i><i>And it is more than likely true that the majority of what I learned from you was never verbalized—that the rules which governed the way you acted (and that I learned while watching you) were implicit in your behavior, and are now implicit in mine. It was exactly in this manner that I learned language—mostly from watching and listening, partly from explicit instruction. And just as it is certainly possible (and most commonly so) to speak correctly and yet to be unable to describe the rules of grammar that “underlie” the production of language, it is possible to act upon the world and make assumptions about its nature without knowing much about the values and beliefs that necessarily underlie those actions and assumptions.</i><br><i><br/></i><i>The structure of our language has been created in a historical process, and is in a sense an embodiment of that process. The structure of that which governs our actions and perceptions has also been created during the course of history, and is the embodiment of history.</i><br><i><br/></i><i>The implications of this idea overwhelmed me. <b>I have been attempting to consider history itself as a unitary phenomenon</b>—as a single thing, in a sense—in order to understand what it is, and how it affects what I think and do. If you realize that history is in some sense in your head, and you also realize that you know nothing of the significance of history, of its meaning—which is almost certainly true—then you must realize that you know nothing of the significance of yourself, and of y our own meaning.</i><br><i><br/></i><i>I am writing my book in an attempt to explain the psychological significance of history—to explain the meaning of history. In doing so, I have “discovered” a number of interesting things:</i><br><i><br/></i><i>1.All cultures, excepting the Western, do not possess a history based on “objective events.” The history of alternative cultures—even those as highly developed as the Indian, Chinese, and ancient Greco-Roman—is mythological, which means that it describes what an event meant, in psychological terms, instead of how it happened, in empirical terms.</i><br><i><br/></i><i>2.All cultures, even those most disparate in nature, develop among broadly predictable lines, and have, within their mythological history, certain constant features (just as all languages share grammatical structure, given a sufficiently abstract analysis). The lines among which culture develops are determined biologically, and the rules which govern that development are the consequence of the pyschological expression of neurophysiological structures. (This thesis will be the most difficult for me to prove, but I have some solid evidence in its favor, and as I study more neuroanatomy and neuropsychology, the evidence becomes clearer).</i><br><i><br/></i><i>3.Mythological renditions of history, like those in the Bible, are just as “true” as the standard Western empirical renditions, just as literally true, but how they are true is different. Western historians describe (or think they describe) “what” happened. The traditions of mythology and religion describe the significance of what happened (and it must be noted that if what happens is without significance, it is irrelevant).</i><br><i><br/></i><i>Anyway—I can’t explain in one letter the full scope of what I am planning to do. In this book, I hope to describe a number of historical tendencies, and how they affect individual behavior—in the manner I have attempted in this letter. More importantly, perhaps, I hope to describe not only what the problem is (in historical terms), but where a possible solution might lie, and what that solution conceivably could be—and <b>I hope to describe it in a manner that makes its application possible</b>.</i><br><i><br/></i><i>If you ‘re interested in me telling you more (I can’t always tell if someone is interested) then I will, later. I don’t know, Dad, but<b> I think I have discovered something that no one else has any idea about</b>, and I’m not sure I can do it justice. Its scope is so broad that I can see only parts of it clearly at one time, and it is exceedingly difficult to set down comprehensibly in writing. You see, most of the kind of knowledge that I am trying to transmit verbally and logically has always been passed down from one person to another by means of art and music and religion and tradition, and not by rational explanation, and it is like translating from one language to another. It’s not just a different language, though—it is an entirely different mode of experience.</i><br><i><br/></i><i>Anyways</i><br><i><br/></i><i>I’m glad that you and Mom are doing well. Thank you for doing my income tax returns.</i><br><i><br/></i><i>Jordan</i></br></br></br></br></br></br></br></br></br></br></br></br></br></br></br></br></br></br></br></br></br></br></br></br></br></br></p><p>It has been almost twelve years since <b>I first grasped the essence of the paradox that lies at the bottom of human motivation for evil</b>: People need their group identification, because that identification protects them, literally, from the terrible forces of the unknown. It is for this reason that every individual who is not decadent will strive to protect his territory, actual and psychological. But the tendency to protect means hatred of the <i>other</i>, and the inevitability of war—and we are now too technologically powerful to engage in war. To allow victory to the other, however—or even continued existence, on his terms—means subjugation, dissolution of protective structure, and exposure to that which is most feared. For me, this meant “damned if you do, damned if you don’t”: belief systems regulate affect, but conflict between belief systems is inevitable.</p><p>Formulation and understanding of this terrible paradox devastated me. I had always been convinced that sufficient understanding of a problem—any problem—would lead to its resolution. Here I was, however, possessed of understanding that seemed not only sufficient but complete, caught nonetheless between the devil and the deep blue sea. I could not see how there could be any alternative to either <i>having </i>a belief system or to <i>not having</i> a belief system—and could see little but the disadvantage of both positions.</p><p><i>So, in case you still haven’t figured it out yet, Peterson’s grand solution to war is the elimination of competing group identities. One world, one race, one identity. Evil will be vanquished and paradise on Earth will result.</i><br><i><br/></i><i>Yes, it’s really that stupid. And notice that in this passage, he made the very transformation from inference to fact, from thought experiment to grasping the essence of the paradox, that Schiff points out in his article on Peterson.</i></br></p></div>",
  "content_text": "This is the most informative, and damning, section of Maps of Meaning. Perhaps it will help some of the morons and midwits who have never read any of this and simply can’t seem to grasp that Jordan Peterson is a globalist lunatic with delusions of grandiosity and a Messiah complex despite it being repeatedly pointed out to them.\nI have put what I consider to be the most important revelations\nin bold\n. It’s a bit frustrating, since I have been telling people about this since the day I read what confirmed my earlier suspicions about the man, but instead of simply going to the source and determining if I was telling the truth or not, literally scores of Peterson defenders opted to instead accuse me of everything from jealousy to slander to invention. But it is not only all right there, it has all been right there since 1999!\nChrist said, the kingdom of heaven is spread out upon the earth, but men do not see it.\nWhat if it was nothing but our self-deceit, our cowardice, hatred and fear, that pollutes our experience and turns the world into hell?\nThis is a hypothesis, at least—as good as any other, admirable and capable of generating hope. Why can’t we make the experiment, and find out if it is true?\nThe central ideas of Christianity are rooted in Gnostic philosophy, which, in accordance with psychological laws, simply had to grow up at a time when the classical religions had become obsolete.\nIt was founded on the perception of symbols thrown up by the unconscious individuation process\nwhich always sets in when the collective dominants of human life fall into decay. At such a time there is bound to be a considerable number of individuals who are possesed by archetypes of a numinous nature that force their way to the surface in order to form new dominants.\nThis state of possession shows itself almost without exception in the fact that the possessed identify themselves with the archetypal contents of their unconscious, and, because they do not realize that the role which is being thrust upon them is the effect of new contents still to be understood, they exemplify these concretely in their own lives, thus becoming prophets and reformers.\nIn so far as the archetypal content of the Christian drama was able to give satisfying expression to the uneasy and clamorous unconscious of the many, the\nconsensus omnium\nraised this drama to a universally binding truth—not of course by an act of judgment, but by the irrational fact of possession, which is far more effective.\nThus Jesus became the tutelary image or amulet against the archetypal powers that threatened to possess everyone.\nThe glad tidings announced: “It has happened, but it will not happen to you inasmuch as you believe in Jesus Christ, the Son of God!”\nYet it could and it can and it will happen to everyone in whom the Christian dominant has decayed….\nDear Dad\nI promised you that one day I would tell you what the book I am trying to write is supposed to be about. I haven’t been working on it much in the last month, although in some regards it is always on my mind and everything I learn, in my other work, has some bearing upon it. Because I have abandoned it, temporarily, I thought perhaps I could tell you about it, and that would help me organize my thoughts.\nI don’t completely understand the driving force behind what I have been working on, although I understand it better now than I used to, three or four years ago, when\nit was literally driving me crazy\n. I had been obsessed with the idea of war for three or four years prior to that,\noften dreaming extremely violent dreams\n, centered around the theme of destruction. I believe now that my concern with death on a mass scale was intimately tied into my personal life, and that concerns with the meaning of life on a personal level (which arise with the contemplation of death) took a general form for me, which had to do with the value of humanity, and the purpose of life in general.\nCarl Jung has suggested that all personal problems are relevant to society, because we are all so much alike, and that any sufficiently profound solution to a personal problem may, if communicated, reduce the likelihood of that problem existing in anyone’s experience in the future. This is in fact how society and the individual support one another. It was in this way that my concern with war, which is the application of death on the general level, led me into concepts and ideas concerning the meaning of life on the personal level, which I could never have imagined as relevant, or believable, prior to learning about them—and which I still believe\nborder on what might normally be considered insanity\n.\nThe reasons for war, many believe, are rooted in politics. Since it is groups of men that fight, and since groups indulge in politics, this belief seems well-founded and in fact contains some truth. It is just as true, however, that it is a good thing to look for something you don’t want to find in a place where you know it won’t be—and the modern concern with global politics, and the necessity to be involved in a “good cause, ” rather than to live responsibly, seems to me to be evidence that the desire not to find often overpowers the real search for truth. You see, it is true that people don’t want the truth, because the truth destroys what lack of faith erects, and the false comfort it contains. It is not possible to live in the world that you wish could be, and in the real world at the same time, and it often seems a bad bargain to destroy fantasy for reality. It is desire for lack of responsibility that underlies this evasion, in part—but it is also fear of possibility. At least this is how it seems to me.\nBecause everyone is a product of their times, and because that applies to me as well, I looked for what I wanted to find where it was obvious to everyone it would be—in politics, in political science, in the study of group behavior. This took up the years I spent involved with the NDP, and in studying political science, until I learned that the application of a system of thought, like socialism (or any other ism, for that matter) to a problem, and solving that problem, were not the same thing. In the former case, you have someone (who is not you) to blame—the rich, the Americans, the white people, the government, the system—whatever, as long as it is someone else.\nI came to realize, slowly, that\na problem of global proportions existed as a problem because everyone on the globe thought and acted to maintain that problem\n. Now what that means is that if the problem has a solution, then what everyone thinks is wrong—and that meant, too, that what I thought had to be fundamentally wrong. Now the problem with this line of reasoning is simple. It leads inexorably to the following conclusion: the more fundamental the problem, the more fundamental the error—in my own viewpoint.\nI came to believe that\nsurvival itself, and more, depended upon a solution to the problem of war.\nThis made me consider that perhaps everything I believed was wrong. This consideration was not particularly pleasant, and was severely complicated by the fact that I had also come to realize that, although I definitely believed a variety of things, I did not always know what I believed—and when I knew what, I did not know why.\nYou see, history itself conditioned everything I believed, even when I did not know it, and it was sheer unconscious arrogance that made me posit to begin with that I had half a notion of who or what I was, or what the process of history had created, and how I was affected by that creation.\nIt is one thing to be unconscious of the answers, and quite another to be unable to even consider the question.\nI had a notion that confronting what terrified me—what turned my dreams against me—could help me withstand that terrible thing. This idea—granted me by the grace of God—allowed me to believe that I could find what I most wanted (if I could tolerate the truth; if I was willing to follow wherever it led me; if I was willing to devote my life to acting upon what I had discovered, whatever that might be, without reservation— knowing somehow that once started, an aborted attempt would destroy at least my self-respect,\nat most my sanity\nand desire to live).\nI believe now that everyone has this choice in front of them, even when they do not know or refuse to admit it; that everyone makes this choice, with every decision and action they take.\nI mentioned earlier that history conditioned what I think and acted. Pursuit of this realization—which is rather self-evident, once realized—has led me to the study of history, as a psychological phenomenon. You see, if what I think and am is a product of history, that means that history must take form inside me, so to speak, and from inside me determine who I am. This is easier to understand if you consider that I carry around inside me an image of you—composed of memories of how you act, and what you expected, and depictions of your behavior. This image has had profound impact on howI behaved, as a child—when, even in your absence, I was compelled to follow the rules which you followed (and which I learned through imitation, and which you instilled into me, through praise and punishment). Sometimes that image of you, in me, even takes the form of a personality, when I dream about you.\nSo it is a straightforward matter to believe, from the psychological point of view, that each individual carries around an image of his parents, and that this image governs his behavior, at least in part.\nBut you see it is the case that the rules that you followed—and which I learned from you—were not rules that you yourself created, but rather those that you handed to me just as you had been handed them while still a child.\nAnd it is more than likely true that the majority of what I learned from you was never verbalized—that the rules which governed the way you acted (and that I learned while watching you) were implicit in your behavior, and are now implicit in mine. It was exactly in this manner that I learned language—mostly from watching and listening, partly from explicit instruction. And just as it is certainly possible (and most commonly so) to speak correctly and yet to be unable to describe the rules of grammar that “underlie” the production of language, it is possible to act upon the world and make assumptions about its nature without knowing much about the values and beliefs that necessarily underlie those actions and assumptions.\nThe structure of our language has been created in a historical process, and is in a sense an embodiment of that process. The structure of that which governs our actions and perceptions has also been created during the course of history, and is the embodiment of history.\nThe implications of this idea overwhelmed me.\nI have been attempting to consider history itself as a unitary phenomenon\n—as a single thing, in a sense—in order to understand what it is, and how it affects what I think and do. If you realize that history is in some sense in your head, and you also realize that you know nothing of the significance of history, of its meaning—which is almost certainly true—then you must realize that you know nothing of the significance of yourself, and of y our own meaning.\nI am writing my book in an attempt to explain the psychological significance of history—to explain the meaning of history. In doing so, I have “discovered” a number of interesting things:\n1.All cultures, excepting the Western, do not possess a history based on “objective events.” The history of alternative cultures—even those as highly developed as the Indian, Chinese, and ancient Greco-Roman—is mythological, which means that it describes what an event meant, in psychological terms, instead of how it happened, in empirical terms.\n2.All cultures, even those most disparate in nature, develop among broadly predictable lines, and have, within their mythological history, certain constant features (just as all languages share grammatical structure, given a sufficiently abstract analysis). The lines among which culture develops are determined biologically, and the rules which govern that development are the consequence of the pyschological expression of neurophysiological structures. (This thesis will be the most difficult for me to prove, but I have some solid evidence in its favor, and as I study more neuroanatomy and neuropsychology, the evidence becomes clearer).\n3.Mythological renditions of history, like those in the Bible, are just as “true” as the standard Western empirical renditions, just as literally true, but how they are true is different. Western historians describe (or think they describe) “what” happened. The traditions of mythology and religion describe the significance of what happened (and it must be noted that if what happens is without significance, it is irrelevant).\nAnyway—I can’t explain in one letter the full scope of what I am planning to do. In this book, I hope to describe a number of historical tendencies, and how they affect individual behavior—in the manner I have attempted in this letter. More importantly, perhaps, I hope to describe not only what the problem is (in historical terms), but where a possible solution might lie, and what that solution conceivably could be—and\nI hope to describe it in a manner that makes its application possible\n.\nIf you ‘re interested in me telling you more (I can’t always tell if someone is interested) then I will, later. I don’t know, Dad, but\nI think I have discovered something that no one else has any idea about\n, and I’m not sure I can do it justice. Its scope is so broad that I can see only parts of it clearly at one time, and it is exceedingly difficult to set down comprehensibly in writing. You see, most of the kind of knowledge that I am trying to transmit verbally and logically has always been passed down from one person to another by means of art and music and religion and tradition, and not by rational explanation, and it is like translating from one language to another. It’s not just a different language, though—it is an entirely different mode of experience.\nAnyways\nI’m glad that you and Mom are doing well. Thank you for doing my income tax returns.\nJordan\nIt has been almost twelve years since\nI first grasped the essence of the paradox that lies at the bottom of human motivation for evil\n: People need their group identification, because that identification protects them, literally, from the terrible forces of the unknown. It is for this reason that every individual who is not decadent will strive to protect his territory, actual and psychological. But the tendency to protect means hatred of the\nother\n, and the inevitability of war—and we are now too technologically powerful to engage in war. To allow victory to the other, however—or even continued existence, on his terms—means subjugation, dissolution of protective structure, and exposure to that which is most feared. For me, this meant “damned if you do, damned if you don’t”: belief systems regulate affect, but conflict between belief systems is inevitable.\nFormulation and understanding of this terrible paradox devastated me. I had always been convinced that sufficient understanding of a problem—any problem—would lead to its resolution. Here I was, however, possessed of understanding that seemed not only sufficient but complete, caught nonetheless between the devil and the deep blue sea. I could not see how there could be any alternative to either\nhaving\na belief system or to\nnot having\na belief system—and could see little but the disadvantage of both positions.\nSo, in case you still haven’t figured it out yet, Peterson’s grand solution to war is the elimination of competing group identities. One world, one race, one identity. Evil will be vanquished and paradise on Earth will result.\nYes, it’s really that stupid. And notice that in this passage, he made the very transformation from inference to fact, from thought experiment to grasping the essence of the paradox, that Schiff points out in his article on Peterson.",
  "tags": [
    "Jordanetics"
  ],
  "categories": [],
  "sitemap_lastmod": "2018-05-26T22:35:09+00:00"
}