{
  "url": "https://voxday.net/2018/05/09/excerpt-do-we-need-god-to-be-good/",
  "scraped_at": "2025-12-19T21:01:08.861715",
  "title": "EXCERPT: Do We Need God to be Good",
  "date_display": "May 9, 2018",
  "date_iso": "2018-05-09T01:26:39+00:00",
  "date_from_url": "2018-05-09",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p><i>An excerpt from anthropologist Dr. Hallpike’s conclusive demolition of evolutionary psychology, among other things, <a href=\"https://www.amazon.com/Need-God-Good-Anthropologist-Considers-ebook/dp/B07B6TT861/\">DO WE NEED GOD TO BE GOOD?</a></i></p><p>‘Evolutionary psychologists’, who claim that our human abilities and traits are very specific adaptations to the problems of pre-historic life on the savannah in East Africa, have not faced up to the fact that we know virtually nothing about what this life involved, about the social relations and organisation of our ancestors in those remote epochs, and still less about their mental capacities. If we are going to use the theory of natural selection to explain the characteristics of any species, it is obviously essential to have a detailed knowledge of their behaviour in relation to their environment. In the case of a social species it is particularly important to observe the relations between individuals, and modern studies of chimpanzees and gorillas are obvious examples of how this should be done.</p><p>But while it is reasonable to assume that our ancestors in this remote period lived in very small groups of gatherers and scavenger/hunters, and to deduce from this that we must have been an innately sociable species for a very long time, and that some of the well-established gender differences seem to be adaptations to this way of life, it is difficult to be sure about much else. Normal science proceeds from the known to the unknown, but evolutionary psychology tries to do it the other way round.</p><p>Language is central to human culture, but we do not even know when our ancestors were first able to utter sentences like ‘Shall we go hunting tomorrow?’, and it is quite possible that they only achieved this level of linguistic ability well within the last 100,000 years or so. But without language there would have been no way of referring to the future or the past, no means of conveying information, no group planning, no way of communicating group norms and ideas of sharing and cheating, and no discussion of technology and other problems of survival. We cannot even imagine what a pre-linguistic human society might have been like. It cannot be sufficiently emphasized, therefore, that our profound ignorance about early humans is quite incompatible with any informed discussion of possible adaptations.</p><p>Even in the case of the earliest Homo sapiens sapiens from around 200,000 years ago we do not know what sort of things they might have said to each other, (or if they could have said much at all), what made them laugh, or even if they laughed, what they quarrelled about or how they organised sharing within the group. Nor do we have any idea when they first had personal names, or when they could form the ideas of ‘grandfather’, or ‘mother’s brother’, or when they developed the idea of some sort of official union between adult men and women, or if they exchanged women between bands, or how hunting co-operation was organized, or what sort of leadership existed. Nor do we know when humans first had ideas of magic and symbolism, gods, ghosts, and spirits, or when or why they first performed religious rituals and disposed of the dead in a more than merely physical manner.</p><p>Ignoring these drastic limitations on our knowledge has meant that many so-called ‘adaptive explanations’ are merely pseudo-scientific ‘Just So Stories’, often made up without any anthropological knowledge, that have increasingly brought evolutionary psychology into disrepute. For example, it has been claimed (in the <i>Proceedings of the Royal Society</i> no less) that more than a million years ago, early humans lost their body hair because it was full of nasty parasites, and potential mates therefore preferred partners with the least amount of hair so that it was eliminated by sexual selection. Instead of body hair, humans took to wearing clothes: ‘clothes, unlike fur, can be changed and cleaned’. We know nothing whatsoever about the sexual preferences of our ancestors a million years ago, but at least we know they could not possibly have had clothes, because these have only been around for a few thousand years since the introduction of farming and weaving. Another example of an adaptive theory, recently published in<i> New Scientist </i>, is obviously based on the author’s experience of living in London rather than on any anthropological knowledge about hunter-gatherers. ‘The first, and most ancient function of manners is to solve the problem of how to be social without getting sick [from other people’s germs].’ No it isn’t. If there was a ‘first and most ancient function of manners’ it would have been to reduce social friction among small groups of people who have to live and get along with one another, and a hunter-gatherer band was, in any case, the environment where one had the least chance in human history of catching a disease from someone else.</p><p>Some years previously, <i>New Scientist</i> also published an evolutionary explanation of nightmares: ‘In the ancestral environment human life was short and full of threats’, so that ‘A dream-production mechanism that tends to select threatening events, and to simulate them over and over again in various combinations, would have been valuable for the development of threat-avoiding skills’. Since most people wake up screaming when the threat comes, however, nightmares seem a most unpromising educational tool. And as I write, yet another evolutionary knee-slapper has appeared, in <i>Biological Reviews</i>, this time maintaining that men’s faces and jaws are more robust than women’s because for millions of years men have engaged in fist fights. The problem here is that we know from anthropological studies that hunter-gatherers are not recorded as engaging in fist fights but in physical conflicts typically use weapons like clubs, spears, or rocks because they are so much more effective than trying to use one’s bare hands. Boxing as such is a skill that has to be deliberately taught and is only found in a small minority of societies which makes it extremely unlikely that it was an important form of human combat for millions of years.</p><p>The second problem is that if our ancestors were so closely adapted to the environment of prehistoric East Africa, this should be able to tell us a great deal about their subsequent behaviour, especially during the last 10,000 years of maximal social and cultural change. For example, we would expect humans, in their expansion all over the globe, to have chosen environments with a discernible resemblance to the savannah of East Africa, and to have avoided those that differed markedly from it, like rain-forests, deserts, the Arctic, islands in the Pacific Ocean, and high mountain ranges. We would also expect them, after millions of years of simple, egalitarian hunter-gatherer existence in small groups, to have been strongly resistant to the formation of large-scale, highly stratified societies, and again to have had great difficulty in mastering mathematics, science, and modern electronic technology, just to mention a few glaring examples of major cultural change.</p><p>Yet we know very well that in these and innumerable other respects, human habitats, social organisation, culture, technology and modes of thought have diverged in wildly different ways from the simple model of Man in his prehistoric environment, so that evolutionary psychology has no predictive value at all in these essential respects. This alone makes it very unlikely that human abilities and dispositions were ever closely adapted to particular ancestral conditions. ‘Among the multitude of animals which scamper, fly, burrow and swim around us, man is the only one who is not locked into his environment. His imagination, his reason, his emotional subtlety and toughness, make it possible for him not to accept the environment but to change it.’</p><p>Thirdly, Man’s extraordinary intellectual abilities, in particular, raise the problem that in Darwinian theory biological adaptations can only be to existing circumstances, never to those that might be encountered in the future. We did not acquire our mathematical abilities, for example, so that thousands of years later we could be good with computers. This fundamental point about human abilities was first made by A.R. Wallace, Darwin’s co-formulator of the theory of natural selection, who had extensive first-hand acquaintance with hunter-gatherers of the Amazon and south-east Asia. He noted that on the one hand their mode of life made only very limited intellectual demands on them, and did not require abstract concepts of number and geometry, space, time, music, and advanced ethical principles, yet as individuals they were potentially capable of mastering the highly demanding cognitive skills of modern industrial civilisation if they were given the chance to acquire them. Since, as noted, natural selection can only produce traits that are adapted to existing, and not future, conditions, it ‘could only have endowed savage man with a brain a little superior to that of an ape, where he actually possesses one little inferior to that of a philosopher’.</p><p>This is particularly obvious in the case of mathematics, where even today many simple cultures, especially hunter-gatherers but including some shifting cultivators may only have words for single, pair, and many. The Tauade of Papua New Guinea with whom I lived were like this, and indeed, the hunter-gatherer Piraha of South America are described as having no number words at all, not even the grammatical distinction between singular and plural. We can get a good idea why this should be so from the example of a Cree hunter from eastern Canada: he was asked in a court case involving land how many rivers there were in his hunting territory, and did not know:</p><p><i>The hunter knew every river in his territory individually and therefore had no need to know how many there were. Indeed, he would know each stretch of each river as an individual thing and therefore had no need to know in numerical terms how long the rivers were. The point of the story is that we count things when we are ignorant of their individual identity—this can arise when we don’t have enough experience of the objects, when there are too many of them to know individually, or when they are all the same, none of which conditions obtain very often for a hunter. If he has several knives they will be known individually by their different sizes, shapes, and specialized uses. If he has several pairs of moccasins they will be worn to different degrees, having been made at different times, and may be of different materials and design.</i></p><p>What needs to be emphasised here, therefore, is that our hunter-gatherer ancestors could easily have survived without the need for verbal numerals or for any counting at all, and that consequently there could have been no selective pressure for arithmetical skills to evolve in the specific conditions of the Pleistocene of East Africa. As we all know, mathematics has only flowered in the last few centuries, and among a tiny minority of people, far too brief a time-span for natural selection to have had the least effect. The mathematician Keith Devlin very reasonably concludes: ‘Whatever features of our brain enable (some of) us to do mathematics must have been present long before we had any mathematics. Those crucial features, therefore, must have evolved to fulfil some other purpose’(my emphasis). Because we have no idea what that ‘other purpose’ might have been we are obviously not going to discover the origin of the mathematical features of the human brain from anything we suppose our ancestors might have been doing in pre-history.</p><p>Mathematics is only one particularly glaring example of a whole range of advanced human thought in logic, philosophy, and science, of a type known as ‘formal operations’, which has only emerged in literate civilisations, and is never found among hunter-gatherers. This general type of thought must therefore be the result, like mathematics, of the brain using its faculties in novel ways, which therefore cannot be traced back to African prehistory.</p></div>",
  "content_text": "An excerpt from anthropologist Dr. Hallpike’s conclusive demolition of evolutionary psychology, among other things,\nDO WE NEED GOD TO BE GOOD?\n‘Evolutionary psychologists’, who claim that our human abilities and traits are very specific adaptations to the problems of pre-historic life on the savannah in East Africa, have not faced up to the fact that we know virtually nothing about what this life involved, about the social relations and organisation of our ancestors in those remote epochs, and still less about their mental capacities. If we are going to use the theory of natural selection to explain the characteristics of any species, it is obviously essential to have a detailed knowledge of their behaviour in relation to their environment. In the case of a social species it is particularly important to observe the relations between individuals, and modern studies of chimpanzees and gorillas are obvious examples of how this should be done.\nBut while it is reasonable to assume that our ancestors in this remote period lived in very small groups of gatherers and scavenger/hunters, and to deduce from this that we must have been an innately sociable species for a very long time, and that some of the well-established gender differences seem to be adaptations to this way of life, it is difficult to be sure about much else. Normal science proceeds from the known to the unknown, but evolutionary psychology tries to do it the other way round.\nLanguage is central to human culture, but we do not even know when our ancestors were first able to utter sentences like ‘Shall we go hunting tomorrow?’, and it is quite possible that they only achieved this level of linguistic ability well within the last 100,000 years or so. But without language there would have been no way of referring to the future or the past, no means of conveying information, no group planning, no way of communicating group norms and ideas of sharing and cheating, and no discussion of technology and other problems of survival. We cannot even imagine what a pre-linguistic human society might have been like. It cannot be sufficiently emphasized, therefore, that our profound ignorance about early humans is quite incompatible with any informed discussion of possible adaptations.\nEven in the case of the earliest Homo sapiens sapiens from around 200,000 years ago we do not know what sort of things they might have said to each other, (or if they could have said much at all), what made them laugh, or even if they laughed, what they quarrelled about or how they organised sharing within the group. Nor do we have any idea when they first had personal names, or when they could form the ideas of ‘grandfather’, or ‘mother’s brother’, or when they developed the idea of some sort of official union between adult men and women, or if they exchanged women between bands, or how hunting co-operation was organized, or what sort of leadership existed. Nor do we know when humans first had ideas of magic and symbolism, gods, ghosts, and spirits, or when or why they first performed religious rituals and disposed of the dead in a more than merely physical manner.\nIgnoring these drastic limitations on our knowledge has meant that many so-called ‘adaptive explanations’ are merely pseudo-scientific ‘Just So Stories’, often made up without any anthropological knowledge, that have increasingly brought evolutionary psychology into disrepute. For example, it has been claimed (in the\nProceedings of the Royal Society\nno less) that more than a million years ago, early humans lost their body hair because it was full of nasty parasites, and potential mates therefore preferred partners with the least amount of hair so that it was eliminated by sexual selection. Instead of body hair, humans took to wearing clothes: ‘clothes, unlike fur, can be changed and cleaned’. We know nothing whatsoever about the sexual preferences of our ancestors a million years ago, but at least we know they could not possibly have had clothes, because these have only been around for a few thousand years since the introduction of farming and weaving. Another example of an adaptive theory, recently published in\nNew Scientist\n, is obviously based on the author’s experience of living in London rather than on any anthropological knowledge about hunter-gatherers. ‘The first, and most ancient function of manners is to solve the problem of how to be social without getting sick [from other people’s germs].’ No it isn’t. If there was a ‘first and most ancient function of manners’ it would have been to reduce social friction among small groups of people who have to live and get along with one another, and a hunter-gatherer band was, in any case, the environment where one had the least chance in human history of catching a disease from someone else.\nSome years previously,\nNew Scientist\nalso published an evolutionary explanation of nightmares: ‘In the ancestral environment human life was short and full of threats’, so that ‘A dream-production mechanism that tends to select threatening events, and to simulate them over and over again in various combinations, would have been valuable for the development of threat-avoiding skills’. Since most people wake up screaming when the threat comes, however, nightmares seem a most unpromising educational tool. And as I write, yet another evolutionary knee-slapper has appeared, in\nBiological Reviews\n, this time maintaining that men’s faces and jaws are more robust than women’s because for millions of years men have engaged in fist fights. The problem here is that we know from anthropological studies that hunter-gatherers are not recorded as engaging in fist fights but in physical conflicts typically use weapons like clubs, spears, or rocks because they are so much more effective than trying to use one’s bare hands. Boxing as such is a skill that has to be deliberately taught and is only found in a small minority of societies which makes it extremely unlikely that it was an important form of human combat for millions of years.\nThe second problem is that if our ancestors were so closely adapted to the environment of prehistoric East Africa, this should be able to tell us a great deal about their subsequent behaviour, especially during the last 10,000 years of maximal social and cultural change. For example, we would expect humans, in their expansion all over the globe, to have chosen environments with a discernible resemblance to the savannah of East Africa, and to have avoided those that differed markedly from it, like rain-forests, deserts, the Arctic, islands in the Pacific Ocean, and high mountain ranges. We would also expect them, after millions of years of simple, egalitarian hunter-gatherer existence in small groups, to have been strongly resistant to the formation of large-scale, highly stratified societies, and again to have had great difficulty in mastering mathematics, science, and modern electronic technology, just to mention a few glaring examples of major cultural change.\nYet we know very well that in these and innumerable other respects, human habitats, social organisation, culture, technology and modes of thought have diverged in wildly different ways from the simple model of Man in his prehistoric environment, so that evolutionary psychology has no predictive value at all in these essential respects. This alone makes it very unlikely that human abilities and dispositions were ever closely adapted to particular ancestral conditions. ‘Among the multitude of animals which scamper, fly, burrow and swim around us, man is the only one who is not locked into his environment. His imagination, his reason, his emotional subtlety and toughness, make it possible for him not to accept the environment but to change it.’\nThirdly, Man’s extraordinary intellectual abilities, in particular, raise the problem that in Darwinian theory biological adaptations can only be to existing circumstances, never to those that might be encountered in the future. We did not acquire our mathematical abilities, for example, so that thousands of years later we could be good with computers. This fundamental point about human abilities was first made by A.R. Wallace, Darwin’s co-formulator of the theory of natural selection, who had extensive first-hand acquaintance with hunter-gatherers of the Amazon and south-east Asia. He noted that on the one hand their mode of life made only very limited intellectual demands on them, and did not require abstract concepts of number and geometry, space, time, music, and advanced ethical principles, yet as individuals they were potentially capable of mastering the highly demanding cognitive skills of modern industrial civilisation if they were given the chance to acquire them. Since, as noted, natural selection can only produce traits that are adapted to existing, and not future, conditions, it ‘could only have endowed savage man with a brain a little superior to that of an ape, where he actually possesses one little inferior to that of a philosopher’.\nThis is particularly obvious in the case of mathematics, where even today many simple cultures, especially hunter-gatherers but including some shifting cultivators may only have words for single, pair, and many. The Tauade of Papua New Guinea with whom I lived were like this, and indeed, the hunter-gatherer Piraha of South America are described as having no number words at all, not even the grammatical distinction between singular and plural. We can get a good idea why this should be so from the example of a Cree hunter from eastern Canada: he was asked in a court case involving land how many rivers there were in his hunting territory, and did not know:\nThe hunter knew every river in his territory individually and therefore had no need to know how many there were. Indeed, he would know each stretch of each river as an individual thing and therefore had no need to know in numerical terms how long the rivers were. The point of the story is that we count things when we are ignorant of their individual identity—this can arise when we don’t have enough experience of the objects, when there are too many of them to know individually, or when they are all the same, none of which conditions obtain very often for a hunter. If he has several knives they will be known individually by their different sizes, shapes, and specialized uses. If he has several pairs of moccasins they will be worn to different degrees, having been made at different times, and may be of different materials and design.\nWhat needs to be emphasised here, therefore, is that our hunter-gatherer ancestors could easily have survived without the need for verbal numerals or for any counting at all, and that consequently there could have been no selective pressure for arithmetical skills to evolve in the specific conditions of the Pleistocene of East Africa. As we all know, mathematics has only flowered in the last few centuries, and among a tiny minority of people, far too brief a time-span for natural selection to have had the least effect. The mathematician Keith Devlin very reasonably concludes: ‘Whatever features of our brain enable (some of) us to do mathematics must have been present long before we had any mathematics. Those crucial features, therefore, must have evolved to fulfil some other purpose’(my emphasis). Because we have no idea what that ‘other purpose’ might have been we are obviously not going to discover the origin of the mathematical features of the human brain from anything we suppose our ancestors might have been doing in pre-history.\nMathematics is only one particularly glaring example of a whole range of advanced human thought in logic, philosophy, and science, of a type known as ‘formal operations’, which has only emerged in literate civilisations, and is never found among hunter-gatherers. This general type of thought must therefore be the result, like mathematics, of the brain using its faculties in novel ways, which therefore cannot be traced back to African prehistory.",
  "tags": [
    "Excerpts"
  ],
  "categories": [],
  "sitemap_lastmod": "2018-05-09T00:26:39+00:00"
}