{
  "url": "https://voxday.net/2018/05/08/fake-opposition-confirmed/",
  "scraped_at": "2025-12-19T21:01:05.230235",
  "title": "Fake Opposition confirmed",
  "date_display": "May 8, 2018",
  "date_iso": "2018-05-08T17:32:29+00:00",
  "date_from_url": "2018-05-08",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p><b><a href=\"https://www.youtube.com/watch?v=yQi8EH38K2s\">Vox Day Exposes Jordan Peterson And The Left’s Plan To Take Control Of The Nationalist Movement</a>: </b><i>Vox Day joins Alex Jones live via Skype to break down how Ben Shapiro and Jordan Peterson are puppets of the left, used to take control of the nationalist movement and destroy its potential. </i></p><p>That is the name of the video that <i>InfoWars </i>posted on May 7, 2018. It inspired the sort of responses that you can probably anticipate by now.</p><p><i>Vox is obviously jealous of Peterson and Shapiro’s success. He’s trying to be as relevant as they are.﻿</i></p><p>So, about that relevance…. The timing of the video was rather timely, and its title was rather prophetic, because the very next day, May 8, 2018, <i>The New York Times</i> posted an article entitled <i><a href=\"https://archive.fo/akLg5\">Meet the Renegades of the Intellectual Dark Web:</a> An alliance of heretics is making an end run around the mainstream conversation. Should we be listening?</i></p><blockquote><p>What is the I.D.W. and who is a member of it? It’s hard to explain, which is both its beauty and its danger.</p><p>Most simply, it is a collection of iconoclastic thinkers, academic renegades and media personalities who are having a rolling conversation — on podcasts, YouTube and Twitter, and in sold-out auditoriums — that sound unlike anything else happening, at least publicly, in the culture right now. Feeling largely locked out of legacy outlets, they are rapidly building their own mass media channels.</p><p>The closest thing to a phone book for the I.D.W. is a sleek website that lists the dramatis personae of the network, including Mr. Harris; Mr. Weinstein and his brother and sister-in-law, the evolutionary biologists Bret Weinstein and Heather Heying; Jordan Peterson, the psychologist and best-selling author; the conservative commentators Ben Shapiro and Douglas Murray; Maajid Nawaz, the former Islamist turned anti-extremist activist; and the feminists Ayaan Hirsi Ali and Christina Hoff Sommers. But in typical dark web fashion, no one knows who put the website up.</p><p>The core members have little in common politically. Bret and Eric Weinstein and Ms. Heying were Bernie Sanders supporters. Mr. Harris was an outspoken Hillary voter. Ben Shapiro is an anti-Trump conservative.</p><p>But they all share three distinct qualities. First, they are willing to disagree ferociously, but talk civilly, about nearly every meaningful subject: religion, abortion, immigration, the nature of consciousness. Second, in an age in which popular feelings about the way things ought to be often override facts about the way things actually are, each is determined to resist parroting what’s politically convenient. And third, some have paid for this commitment by being purged from institutions that have become increasingly hostile to unorthodox thought — and have found receptive audiences elsewhere.</p></blockquote><p>Actually, it’s not difficult to explain at all. The “Intellectual Dark Web” is the Fake Opposition, the roots of the Conservative Media 3.0. William F. Buckley’s Conservative Media 1.0 is literally bankrupt, Bill Kristol’s Conservative Media 2.0 lost its last vestiges of credibility due to the failures of the occupations of Afghanistan and Iraq, and now the mainstream media needs a new squad to put on the uniforms of the Washington Generals to go out in front of the public and take a dive.</p><p>It is NeverTrump: the media edition.</p><p>This is a familiar gambit. Not only are the dramatic portraits of the various Dark Webbers almost identical to those decorating the 2006 <i>Wired </i>piece entitled “<a href=\"https://www.wired.com/2006/11/atheism/\">The Church of the Non-Believers</a>“, but they’ve even recycled both Sam Harris and Michael Shermer as Very Important Intellectuals du Jour. Frankly, I’m a little disappointed that they didn’t dig up the corpse of Christopher Hitchens and include him too while they were at it.</p><p>Who is a member of the IDW? Anyone who a) is not Christian, b) is not a nationalist, c) is vaguely palatable to the political Right, and most importantly, d) will not upset the mainstream media narrative.</p><p>Who put the website up? I would assume Eric Weinstein, Bret Weinstein, and Heather Heying, three media non-entities who are attempting to put themselves on par with far more recognizable media figures like Christina Hoff Summers and Sam Harris, in cooperation with Claire Lehmann, whose site is hosting the little clubhouse.</p><p>More significant figures such as Alex Jones, Milo Yiannopoulos, Stefan Molyneaux, Mike Cernovich, Jack Posobiec, and Ivan Throne are conspicuously absent; one woman, Debra Soh, has less than one-fifteenth the number of Twitter followers that Cernovich has. Needless to say, I’m not exactly surprised by the identities of two of the leading members.</p><blockquote><p>Before September 2016, Jordan Peterson was an obscure psychology professor at the University of Toronto. Then he spoke out against Canada’s Bill C-16, which proposed amending the country’s human-rights act to outlaw discrimination based on gender identity and expression. He resisted on the grounds that the bill risked curtailing free speech by compelling people to use alternative gender pronouns. He made YouTube videos about it. He went on news shows to protest it. He confronted protesters calling him a bigot. When the university asked him to stop talking about it, including sending two warning letters, he refused.</p><p>While most people in the group faced down comrades on the political left, Ben Shapiro confronted the right. He left his job as editor at large of Breitbart News two years ago because he believed it had become, under Steve Bannon’s leadership, “Trump’s personal Pravda.” In short order, he became a primary target of the alt-right and, according to the Anti-Defamation League, the No. 1 target of anti-Semitic tweets during the presidential election.</p></blockquote><p>Now do you see? Jordan Peterson and Ben Shapiro are both Fake Opposition, media con artists to the core. In fact, the very event that reportedly made Peterson famous appears to have been based on <a href=\"http://alexanderofford.com/the-intellectual-fraudulence-of-jordan-peterson-apropos-of-daniel-karasik/\">a mischaracterization of the law</a> by Peterson. So much for the courage of his much-vaunted stand.</p><p>Here is my question for conservatives. If it is correct to reject people for their associations, how can any Christian or conservative not reject Jordan Peterson and Ben Shapiro in light of their membership in this <i>New York Times</i>-approved club? Especially given that <i>The New York Times</i> is very clear about where the line of acceptable opposition is to be drawn.</p><blockquote><p>Go a click in one direction and the group is enhanced by intellectuals with tony affiliations like Steven Pinker at Harvard. But go a click in another and you’ll find alt-right figures like Stefan Molyneux and Milo Yiannopoulos and conspiracy theorists like Mike Cernovich (the #PizzaGate huckster) and Alex Jones (the Sandy Hook shooting denier).</p><p>It’s hard to draw boundaries around an amorphous network, especially when each person in it has a different idea of who is beyond the pale.</p><p>“I don’t know that we are in the position to police it,” Mr. Rubin said. “If this thing becomes something massive — a political or social movement — then maybe we’d need to have some statement of principles. For now, we’re just a crew of people trying to have the kind of important conversations that the mainstream won’t.”</p><p>But is a statement of principles necessary to make a judgment call about people like Mr. Cernovich, Mr. Molyneux and Mr. Yiannopoulos? It seems to me that if you are willing to sit across from an Alex Jones or Mike Cernovich and take him seriously, there’s a high probability that you’re either cynical or stupid.</p></blockquote><p>The Fake Opposition is not even Alt-Lite. They’re simply Not Right at all. And they’re not being invited to speak at Ivy League colleges, appearing on Fox, CNN, and the BBC, and being featured in <i>The New York Times</i> complete with flattering pictures featuring dramatic lighting because they are on our side.</p></div>",
  "content_text": "Vox Day Exposes Jordan Peterson And The Left’s Plan To Take Control Of The Nationalist Movement\n:\nVox Day joins Alex Jones live via Skype to break down how Ben Shapiro and Jordan Peterson are puppets of the left, used to take control of the nationalist movement and destroy its potential.\nThat is the name of the video that\nInfoWars\nposted on May 7, 2018. It inspired the sort of responses that you can probably anticipate by now.\nVox is obviously jealous of Peterson and Shapiro’s success. He’s trying to be as relevant as they are.﻿\nSo, about that relevance…. The timing of the video was rather timely, and its title was rather prophetic, because the very next day, May 8, 2018,\nThe New York Times\nposted an article entitled\nMeet the Renegades of the Intellectual Dark Web:\nAn alliance of heretics is making an end run around the mainstream conversation. Should we be listening?\nWhat is the I.D.W. and who is a member of it? It’s hard to explain, which is both its beauty and its danger.\nMost simply, it is a collection of iconoclastic thinkers, academic renegades and media personalities who are having a rolling conversation — on podcasts, YouTube and Twitter, and in sold-out auditoriums — that sound unlike anything else happening, at least publicly, in the culture right now. Feeling largely locked out of legacy outlets, they are rapidly building their own mass media channels.\nThe closest thing to a phone book for the I.D.W. is a sleek website that lists the dramatis personae of the network, including Mr. Harris; Mr. Weinstein and his brother and sister-in-law, the evolutionary biologists Bret Weinstein and Heather Heying; Jordan Peterson, the psychologist and best-selling author; the conservative commentators Ben Shapiro and Douglas Murray; Maajid Nawaz, the former Islamist turned anti-extremist activist; and the feminists Ayaan Hirsi Ali and Christina Hoff Sommers. But in typical dark web fashion, no one knows who put the website up.\nThe core members have little in common politically. Bret and Eric Weinstein and Ms. Heying were Bernie Sanders supporters. Mr. Harris was an outspoken Hillary voter. Ben Shapiro is an anti-Trump conservative.\nBut they all share three distinct qualities. First, they are willing to disagree ferociously, but talk civilly, about nearly every meaningful subject: religion, abortion, immigration, the nature of consciousness. Second, in an age in which popular feelings about the way things ought to be often override facts about the way things actually are, each is determined to resist parroting what’s politically convenient. And third, some have paid for this commitment by being purged from institutions that have become increasingly hostile to unorthodox thought — and have found receptive audiences elsewhere.\nActually, it’s not difficult to explain at all. The “Intellectual Dark Web” is the Fake Opposition, the roots of the Conservative Media 3.0. William F. Buckley’s Conservative Media 1.0 is literally bankrupt, Bill Kristol’s Conservative Media 2.0 lost its last vestiges of credibility due to the failures of the occupations of Afghanistan and Iraq, and now the mainstream media needs a new squad to put on the uniforms of the Washington Generals to go out in front of the public and take a dive.\nIt is NeverTrump: the media edition.\nThis is a familiar gambit. Not only are the dramatic portraits of the various Dark Webbers almost identical to those decorating the 2006\nWired\npiece entitled “\nThe Church of the Non-Believers\n“, but they’ve even recycled both Sam Harris and Michael Shermer as Very Important Intellectuals du Jour. Frankly, I’m a little disappointed that they didn’t dig up the corpse of Christopher Hitchens and include him too while they were at it.\nWho is a member of the IDW? Anyone who a) is not Christian, b) is not a nationalist, c) is vaguely palatable to the political Right, and most importantly, d) will not upset the mainstream media narrative.\nWho put the website up? I would assume Eric Weinstein, Bret Weinstein, and Heather Heying, three media non-entities who are attempting to put themselves on par with far more recognizable media figures like Christina Hoff Summers and Sam Harris, in cooperation with Claire Lehmann, whose site is hosting the little clubhouse.\nMore significant figures such as Alex Jones, Milo Yiannopoulos, Stefan Molyneaux, Mike Cernovich, Jack Posobiec, and Ivan Throne are conspicuously absent; one woman, Debra Soh, has less than one-fifteenth the number of Twitter followers that Cernovich has. Needless to say, I’m not exactly surprised by the identities of two of the leading members.\nBefore September 2016, Jordan Peterson was an obscure psychology professor at the University of Toronto. Then he spoke out against Canada’s Bill C-16, which proposed amending the country’s human-rights act to outlaw discrimination based on gender identity and expression. He resisted on the grounds that the bill risked curtailing free speech by compelling people to use alternative gender pronouns. He made YouTube videos about it. He went on news shows to protest it. He confronted protesters calling him a bigot. When the university asked him to stop talking about it, including sending two warning letters, he refused.\nWhile most people in the group faced down comrades on the political left, Ben Shapiro confronted the right. He left his job as editor at large of Breitbart News two years ago because he believed it had become, under Steve Bannon’s leadership, “Trump’s personal Pravda.” In short order, he became a primary target of the alt-right and, according to the Anti-Defamation League, the No. 1 target of anti-Semitic tweets during the presidential election.\nNow do you see? Jordan Peterson and Ben Shapiro are both Fake Opposition, media con artists to the core. In fact, the very event that reportedly made Peterson famous appears to have been based on\na mischaracterization of the law\nby Peterson. So much for the courage of his much-vaunted stand.\nHere is my question for conservatives. If it is correct to reject people for their associations, how can any Christian or conservative not reject Jordan Peterson and Ben Shapiro in light of their membership in this\nNew York Times\n-approved club? Especially given that\nThe New York Times\nis very clear about where the line of acceptable opposition is to be drawn.\nGo a click in one direction and the group is enhanced by intellectuals with tony affiliations like Steven Pinker at Harvard. But go a click in another and you’ll find alt-right figures like Stefan Molyneux and Milo Yiannopoulos and conspiracy theorists like Mike Cernovich (the #PizzaGate huckster) and Alex Jones (the Sandy Hook shooting denier).\nIt’s hard to draw boundaries around an amorphous network, especially when each person in it has a different idea of who is beyond the pale.\n“I don’t know that we are in the position to police it,” Mr. Rubin said. “If this thing becomes something massive — a political or social movement — then maybe we’d need to have some statement of principles. For now, we’re just a crew of people trying to have the kind of important conversations that the mainstream won’t.”\nBut is a statement of principles necessary to make a judgment call about people like Mr. Cernovich, Mr. Molyneux and Mr. Yiannopoulos? It seems to me that if you are willing to sit across from an Alex Jones or Mike Cernovich and take him seriously, there’s a high probability that you’re either cynical or stupid.\nThe Fake Opposition is not even Alt-Lite. They’re simply Not Right at all. And they’re not being invited to speak at Ivy League colleges, appearing on Fox, CNN, and the BBC, and being featured in\nThe New York Times\ncomplete with flattering pictures featuring dramatic lighting because they are on our side.",
  "tags": [
    "cuckservative"
  ],
  "categories": [],
  "sitemap_lastmod": "2018-05-08T16:32:29+00:00"
}