{
  "url": "https://voxday.net/2018/05/08/hollywood-values-in-albany/",
  "scraped_at": "2025-12-19T21:01:00.044362",
  "title": "Hollywood values in Albany",
  "date_display": "May 8, 2018",
  "date_iso": "2018-05-08T12:43:32+00:00",
  "date_from_url": "2018-05-08",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>Ronan Farrow <a href=\"https://www.newyorker.com/news/news-desk/four-women-accuse-new-yorks-attorney-general-of-physical-abuse\">takes another scalp</a>. At this point, we’re going to have to consider naming him an honorary Native American.</p><blockquote><p><i>Three hours after the publication of this story, Schneiderman resigned from his position. “While these allegations are unrelated to my professional conduct or the operations of the office, they will effectively prevent me from leading the office’s work at this critical time,” he said in a statement. “I therefore resign my office, effective at the close of business on May 8, 2018.”</i></p><p>Eric Schneiderman, New York’s attorney general, has long been a liberal Democratic champion of women’s rights, and recently he has become an outspoken figure in the #MeToo movement against sexual harassment. As New York State’s highest-ranking law-enforcement officer, Schneiderman, who is sixty-three, has used his authority to take legal action against the disgraced film mogul Harvey Weinstein, and to demand greater compensation for the victims of Weinstein’s alleged sexual crimes. Last month, when the Times and this magazine were awarded a joint Pulitzer Prize for coverage of sexual harassment, Schneiderman issued a congratulatory tweet, praising “the brave women and men who spoke up about the sexual harassment they had endured at the hands of powerful men.” Without these women, he noted, “there would not be the critical national reckoning under way.”</p><p>Now Schneiderman is facing a reckoning of his own. As his prominence as a voice against sexual misconduct has risen, so, too, has the distress of four women with whom he has had romantic relationships or encounters. They accuse Schneiderman of having subjected them to nonconsensual physical violence. All have been reluctant to speak out, fearing reprisal. But two of the women, Michelle Manning Barish and Tanya Selvaratnam, have talked to <i>The New Yorker</i> on the record, because they feel that doing so could protect other women. They allege that he repeatedly hit them, often after drinking, frequently in bed and never with their consent. Manning Barish and Selvaratnam categorize the abuse he inflicted on them as “assault.” They did not report their allegations to the police at the time, but both say that they eventually sought medical attention after having been slapped hard across the ear and face, and also choked. Selvaratnam says that Schneiderman warned her he could have her followed and her phones tapped, and both say that he threatened to kill them if they broke up with him.</p></blockquote><p>I wonder how long it will be before Farrow comes under fire for his relentless anti-Semitism. It can’t be a coincidence that so many of the sex criminals he is exposing happen to be members of the same identity group, can it?</p><p>I wonder how Jordan Peterson would explain this group overrepresentation among sex criminals? Is that a consequence of high mean IQ too?</p></div>",
  "content_text": "Ronan Farrow\ntakes another scalp\n. At this point, we’re going to have to consider naming him an honorary Native American.\nThree hours after the publication of this story, Schneiderman resigned from his position. “While these allegations are unrelated to my professional conduct or the operations of the office, they will effectively prevent me from leading the office’s work at this critical time,” he said in a statement. “I therefore resign my office, effective at the close of business on May 8, 2018.”\nEric Schneiderman, New York’s attorney general, has long been a liberal Democratic champion of women’s rights, and recently he has become an outspoken figure in the #MeToo movement against sexual harassment. As New York State’s highest-ranking law-enforcement officer, Schneiderman, who is sixty-three, has used his authority to take legal action against the disgraced film mogul Harvey Weinstein, and to demand greater compensation for the victims of Weinstein’s alleged sexual crimes. Last month, when the Times and this magazine were awarded a joint Pulitzer Prize for coverage of sexual harassment, Schneiderman issued a congratulatory tweet, praising “the brave women and men who spoke up about the sexual harassment they had endured at the hands of powerful men.” Without these women, he noted, “there would not be the critical national reckoning under way.”\nNow Schneiderman is facing a reckoning of his own. As his prominence as a voice against sexual misconduct has risen, so, too, has the distress of four women with whom he has had romantic relationships or encounters. They accuse Schneiderman of having subjected them to nonconsensual physical violence. All have been reluctant to speak out, fearing reprisal. But two of the women, Michelle Manning Barish and Tanya Selvaratnam, have talked to\nThe New Yorker\non the record, because they feel that doing so could protect other women. They allege that he repeatedly hit them, often after drinking, frequently in bed and never with their consent. Manning Barish and Selvaratnam categorize the abuse he inflicted on them as “assault.” They did not report their allegations to the police at the time, but both say that they eventually sought medical attention after having been slapped hard across the ear and face, and also choked. Selvaratnam says that Schneiderman warned her he could have her followed and her phones tapped, and both say that he threatened to kill them if they broke up with him.\nI wonder how long it will be before Farrow comes under fire for his relentless anti-Semitism. It can’t be a coincidence that so many of the sex criminals he is exposing happen to be members of the same identity group, can it?\nI wonder how Jordan Peterson would explain this group overrepresentation among sex criminals? Is that a consequence of high mean IQ too?",
  "tags": [],
  "categories": [],
  "sitemap_lastmod": "2018-05-08T11:43:32+00:00"
}