{
  "url": "https://voxday.net/2018/05/16/in-defense-of-jordan-peterson/",
  "scraped_at": "2025-12-19T21:02:26.202947",
  "title": "In defense of Jordan Peterson",
  "date_display": "May 16, 2018",
  "date_iso": "2018-05-16T15:45:10+00:00",
  "date_from_url": "2018-05-16",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>You know, Jordan Peterson must be a real threat to the mainstream, a true dark intellectual renegade, when <i>The Weekly Standard</i> <a href=\"https://www.weeklystandard.com/jonah-cohen/the-forward-publishes-a-hit-job-accusing-jordan-peterson-of-jew-hatred\">rushes to his defense</a> because someone suggested that he just might possibly be less than entirely philosemitic. After all, we know that the mainstream media always makes it an absolute top priority to see that false accusations are exposed whenever someone is inaccurately accused of being insufficiently enthusiastic about minorities who are no different than anyone else except for being smarter and harder working and more successful or are falsely accused of membership in the defunct German National Socialist Workers Party, right?</p><p>I know I have always appreciated the forthright way with which <i>The Weekly Standard</i> staunchly defended President Trump, and all his loyal supporters, and GamerGate, and the Sad Puppies, and indeed, myself, from all manner of false and scurrilious charges.</p><blockquote><p>Unscrupulously, Feldman also hid from readers all the notable Jewish individuals from across the political spectrum who’ve written or spoken positively about Jordan Peterson and his work. To name a few: Rabbi Jonathan Sacks, Harvard’s Steven Pinker, psychiatrist Norman Doidge, professor Jonathan Haidt, author Howard Bloom, novelist Melanie Phillips, journalist Barbara Kay, professor Gad Saad, editor Jonathan Kay, comedian Dave Rubin, writer Cathy Young, biologist Bret Weinstein, author Ben Shapiro, comedian Bill Maher, New York Times columnists David Brooks and Bari Weiss.</p><p>It’s frankly astonishing that not one editor at the Forward had the professionalism to insist on gathering some testimony on behalf of the accused from any of these reputable people. Evidently, at the Forward, it’s perfectly acceptable journalism to ask a loaded question about a man and then stack the deck against him by quoting only his accusers. One of those anti-Peterson complainants—Heidi Beirich from the controversial Southern Poverty Law Center—even suggested (without any evidence) that Peterson could be seen as “a possible ally in Holocaust denial.”</p><p>In sum, what Feldman did was to 1) lie about a neo-Nazi’s opinion of Peterson; 2) use that lie to suggest he has a vast neo-Nazi following at the Daily Stormer; 3) conceal all the Jews who like him; and 4) seek out political partisans to smear him as a possible Holocaust denier.</p><p>It’s as unethical as it’s unconvincing. Even the most superficial reading of Peterson’s oeuvre suffices to show he’s an uncompromising enemy of anti-Semitism–and a real friend to the Jewish people. As he demonstrates in his detailed response to Feldman, he has spent the last 30 years “lecturing and teaching about the horrors of the Holocaust.”</p></blockquote><p>It’s interesting, is it not, that it is so important for the media – supposedly Peterson’s enemy, who, we are told are just waiting to pounce on any mistake it can use to ruin him – to defend him from discrediting and disqualification? After this and <i>The New York Times</i> puff piece, how much more confirmation do you require to accept that he is Fake Opposition?</p></div>",
  "content_text": "You know, Jordan Peterson must be a real threat to the mainstream, a true dark intellectual renegade, when\nThe Weekly Standard\nrushes to his defense\nbecause someone suggested that he just might possibly be less than entirely philosemitic. After all, we know that the mainstream media always makes it an absolute top priority to see that false accusations are exposed whenever someone is inaccurately accused of being insufficiently enthusiastic about minorities who are no different than anyone else except for being smarter and harder working and more successful or are falsely accused of membership in the defunct German National Socialist Workers Party, right?\nI know I have always appreciated the forthright way with which\nThe Weekly Standard\nstaunchly defended President Trump, and all his loyal supporters, and GamerGate, and the Sad Puppies, and indeed, myself, from all manner of false and scurrilious charges.\nUnscrupulously, Feldman also hid from readers all the notable Jewish individuals from across the political spectrum who’ve written or spoken positively about Jordan Peterson and his work. To name a few: Rabbi Jonathan Sacks, Harvard’s Steven Pinker, psychiatrist Norman Doidge, professor Jonathan Haidt, author Howard Bloom, novelist Melanie Phillips, journalist Barbara Kay, professor Gad Saad, editor Jonathan Kay, comedian Dave Rubin, writer Cathy Young, biologist Bret Weinstein, author Ben Shapiro, comedian Bill Maher, New York Times columnists David Brooks and Bari Weiss.\nIt’s frankly astonishing that not one editor at the Forward had the professionalism to insist on gathering some testimony on behalf of the accused from any of these reputable people. Evidently, at the Forward, it’s perfectly acceptable journalism to ask a loaded question about a man and then stack the deck against him by quoting only his accusers. One of those anti-Peterson complainants—Heidi Beirich from the controversial Southern Poverty Law Center—even suggested (without any evidence) that Peterson could be seen as “a possible ally in Holocaust denial.”\nIn sum, what Feldman did was to 1) lie about a neo-Nazi’s opinion of Peterson; 2) use that lie to suggest he has a vast neo-Nazi following at the Daily Stormer; 3) conceal all the Jews who like him; and 4) seek out political partisans to smear him as a possible Holocaust denier.\nIt’s as unethical as it’s unconvincing. Even the most superficial reading of Peterson’s oeuvre suffices to show he’s an uncompromising enemy of anti-Semitism–and a real friend to the Jewish people. As he demonstrates in his detailed response to Feldman, he has spent the last 30 years “lecturing and teaching about the horrors of the Holocaust.”\nIt’s interesting, is it not, that it is so important for the media – supposedly Peterson’s enemy, who, we are told are just waiting to pounce on any mistake it can use to ruin him – to defend him from discrediting and disqualification? After this and\nThe New York Times\npuff piece, how much more confirmation do you require to accept that he is Fake Opposition?",
  "tags": [
    "media"
  ],
  "categories": [],
  "sitemap_lastmod": "2018-05-16T14:45:10+00:00"
}