{
  "url": "https://voxday.net/2018/05/08/interview-with-moira-greyland/",
  "scraped_at": "2025-12-19T21:01:01.873141",
  "title": "Interview with Moira Greyland",
  "date_display": "May 8, 2018",
  "date_iso": "2018-05-08T15:00:02+00:00",
  "date_from_url": "2018-05-08",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>Many of those observing my ongoing vivisection of Jordan Peterson’s philosophy are of the opinion that these things don’t really matter very much, that discussion of philosophies and moralities is esoteric discourse best left to intellectuals and that distinguishing between good and evil philosophies is irrelevant.</p><p>But as the experience of Moira Greyland shows, philosophy matters. Because evil philosophy is always utilized to justify, excuse, and even celebrate evil actions by moral monstrosities. Read <a href=\"https://www.lifesitenews.com/news/interview-daughter-of-famed-sci-fi-author-explains-mothers-gay-pedophile-wo\">the whole interview</a>, it will provide new insight even to those who have read <i>The Last Closet</i>.</p><blockquote><p><b>LifeSite: </b>Many science fiction and fantasy authors have treated pedophilia, incest, and homosexuality with a creepy sort of sympathy. For example, Robert Heinlein’s “Time Enough for Love,” has a protagonist who has sexual relations with his adopted daughter, clones himself as two women and “marries” them (as well as two men), and finally travels back in time where he has sexual relations with his own mother. The book was nominated for both the Hugo and Nebula awards and Heinlein was called the “dean of science fiction writers,” and his followers have created a “Robert Heinlein award” for science fiction writing.</p><p>My question is this: as one who grew up in this world and was so terribly victimized by such attitudes, why do you believe sci-fi and fantasy writers and their fans have such a thirst for this kind of material? What is the connection between these genres of literature and these pathological tendencies?</p><p><b>Moira Greyland: </b>People wanted to have promiscuous sex and the books gave them a map.  The authors writing about the promiscuous sex were hailed as Great Thinkers, and it was assumed that if the people in the books were happy and promiscuous, then it would work out that way in real life.</p><p>Throwing off sexual morality meant more sex, more often, with no way for women to refuse without being labeled “prudish.”  It meant an end to the sexual dominance of the biggest and the strongest, and meant any ugly jerk could get laid if he had drugs and a good line.</p><p>Sexual morality is questioned, and all the rules are thrown out.  Suddenly, instead of having one husband and one wife, people are having all kinds of sex with all kinds of people, and a lot of people like it.  Some are too drug-addled, drunk or stupid to think through the implications, and others have weak personalities and go along with anything their husband or wife demands provided they can stay married.</p><p>But here is the trouble.  Since the new social circle operates on a new rulebook, whether it is the Stranger in a Strange Land rulebook or the Darkover rulebook, it is no longer acceptable to do things the old way.  In practice, the wife who has a broken heart because her husband is carrying on with five women, or five small boys, had better keep her mouth shut or risk losing him.</p><p>Since the books delegitimize jealousy and fidelity, troubles in the relationship which normally result from adultery must be blamed on something else.  Now instead of it being normal to hate the other woman, the wife is in the atrocious position of having to blame her own jealousy and possessiveness for her agony.  She can no longer blame her husband for his conduct, and must instead blame herself.</p><p>Naturally, in practice, this is a recipe for disaster.  The result is divorce, abortions, broken homes, single parenthood, and always the blame was misplaced.  Adultery does not work.  Promiscuity does not work.  Polyamory does not work.  But if you are in a social circle where they are normalized, you have to swallow the poison pill or lose your social group.</p><p>Even in the weirdest social circle, there will be a few good couples who love each other and who just can’t get into the poly stuff no matter how fashionable it might be.  One might even think that those people have a moral compass or a backbone, and they are probably the couple that heads on over to church while the rest of their circle are sleeping off the debauchery.   Are they aware that their morality has saved their marriage and their family?  Maybe.  But you can be sure they do not trumpet their differences.  And years after the dust settles, it will be those couples who say “I always felt funny about the weird sex in Marion Zimmer Bradley’s books.”</p><p>And it will be those couples who have stayed together.</p></blockquote><p>Once God is removed from the picture, so are the limits of the moral structure He has imposed on Man. And then, “do what thou wilt” becomes the whole of the law, whether it is “with due regard for the policeman around the corner” or “without overlooking the guidelines of your culture since life is short, and you don’t have time to figure everything out on your own.”</p></div>",
  "content_text": "Many of those observing my ongoing vivisection of Jordan Peterson’s philosophy are of the opinion that these things don’t really matter very much, that discussion of philosophies and moralities is esoteric discourse best left to intellectuals and that distinguishing between good and evil philosophies is irrelevant.\nBut as the experience of Moira Greyland shows, philosophy matters. Because evil philosophy is always utilized to justify, excuse, and even celebrate evil actions by moral monstrosities. Read\nthe whole interview\n, it will provide new insight even to those who have read\nThe Last Closet\n.\nLifeSite:\nMany science fiction and fantasy authors have treated pedophilia, incest, and homosexuality with a creepy sort of sympathy. For example, Robert Heinlein’s “Time Enough for Love,” has a protagonist who has sexual relations with his adopted daughter, clones himself as two women and “marries” them (as well as two men), and finally travels back in time where he has sexual relations with his own mother. The book was nominated for both the Hugo and Nebula awards and Heinlein was called the “dean of science fiction writers,” and his followers have created a “Robert Heinlein award” for science fiction writing.\nMy question is this: as one who grew up in this world and was so terribly victimized by such attitudes, why do you believe sci-fi and fantasy writers and their fans have such a thirst for this kind of material? What is the connection between these genres of literature and these pathological tendencies?\nMoira Greyland:\nPeople wanted to have promiscuous sex and the books gave them a map.  The authors writing about the promiscuous sex were hailed as Great Thinkers, and it was assumed that if the people in the books were happy and promiscuous, then it would work out that way in real life.\nThrowing off sexual morality meant more sex, more often, with no way for women to refuse without being labeled “prudish.”  It meant an end to the sexual dominance of the biggest and the strongest, and meant any ugly jerk could get laid if he had drugs and a good line.\nSexual morality is questioned, and all the rules are thrown out.  Suddenly, instead of having one husband and one wife, people are having all kinds of sex with all kinds of people, and a lot of people like it.  Some are too drug-addled, drunk or stupid to think through the implications, and others have weak personalities and go along with anything their husband or wife demands provided they can stay married.\nBut here is the trouble.  Since the new social circle operates on a new rulebook, whether it is the Stranger in a Strange Land rulebook or the Darkover rulebook, it is no longer acceptable to do things the old way.  In practice, the wife who has a broken heart because her husband is carrying on with five women, or five small boys, had better keep her mouth shut or risk losing him.\nSince the books delegitimize jealousy and fidelity, troubles in the relationship which normally result from adultery must be blamed on something else.  Now instead of it being normal to hate the other woman, the wife is in the atrocious position of having to blame her own jealousy and possessiveness for her agony.  She can no longer blame her husband for his conduct, and must instead blame herself.\nNaturally, in practice, this is a recipe for disaster.  The result is divorce, abortions, broken homes, single parenthood, and always the blame was misplaced.  Adultery does not work.  Promiscuity does not work.  Polyamory does not work.  But if you are in a social circle where they are normalized, you have to swallow the poison pill or lose your social group.\nEven in the weirdest social circle, there will be a few good couples who love each other and who just can’t get into the poly stuff no matter how fashionable it might be.  One might even think that those people have a moral compass or a backbone, and they are probably the couple that heads on over to church while the rest of their circle are sleeping off the debauchery.   Are they aware that their morality has saved their marriage and their family?  Maybe.  But you can be sure they do not trumpet their differences.  And years after the dust settles, it will be those couples who say “I always felt funny about the weird sex in Marion Zimmer Bradley’s books.”\nAnd it will be those couples who have stayed together.\nOnce God is removed from the picture, so are the limits of the moral structure He has imposed on Man. And then, “do what thou wilt” becomes the whole of the law, whether it is “with due regard for the policeman around the corner” or “without overlooking the guidelines of your culture since life is short, and you don’t have time to figure everything out on your own.”",
  "tags": [
    "interview"
  ],
  "categories": [],
  "sitemap_lastmod": "2018-05-08T14:00:02+00:00"
}