{
  "url": "https://voxday.net/2018/05/17/it-doesnt-take-two-to-tango/",
  "scraped_at": "2025-12-19T21:02:31.694037",
  "title": "It doesn’t take two to tango",
  "date_display": "May 17, 2018",
  "date_iso": "2018-05-17T12:34:50+00:00",
  "date_from_url": "2018-05-17",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><div style=\"text-align: center;\"><iframe allow=\"autoplay; encrypted-media\" allowfullscreen=\"\" frameborder=\"0\" height=\"284\" src=\"https://www.youtube.com/embed/BefzeGqA6UY\" width=\"512\"></iframe></div><p><i>In which I address Larry Correia’s disinvitation to Origins in light of my own banning from ConSimWorld over an argument with a proto-SJW demanding the elimination of black SS counters from wargames about 15 years ago <a href=\"https://youtu.be/BefzeGqA6UY\">in a Darkstream</a>.</i></p><p>The thing is that nothing has changed, it’s only gotten worse, things are only getting worse because nobody is fighting back. I mean even someone like Larry Correia, whom I admire, whom I respect, and who in creating Sad Puppies launched what until recently was the only effective response to the SJWs, now even he just wants to be left alone. And that is the fundamental flaw of the Right; you cannot win a war that you refuse to fight, you cannot win a war by being left alone, and the SJWs have made it very very clear that they will never ever leave us alone.</p><p>The woman who complained about Correia to Origins and managed to get him disinvited was bitter at him over a takedown that he had done of her boyfriend back in 2014, four years ago! So these people do not forget and they are going to continue to come after you. They would continue to come after me if they could, you know, if they didn’t know that I am always ready for it, I’m always anticipating it, and they also know damn well that I’m going to go after them harder than they come at me every single time, and so they tend to go, “you know what, maybe we’ll go after easier targets.” I mean it’s not like there aren’t a plethora of them out there.</p><p>And so what what you need to understand is that there is no telling them “that’s enough”, there is no warning them, the point is that you keep reading these articles, you keep seeing these comments, you know, <i>now they’ve gone too far, now it’s too much,</i> and that’s not going to achieve anything. There is a standard boilerplate conservative column that I could probably write in my sleep, I’ve been reading that same column for 30 years now and I call it the conservative dire warning column. <i>If the Left doesn’t watch out, they’re not gonna like what happens!</i> Well, guess what? Nothing’s gonna happen. You’re not going to do anything! You know, and they already know, that you’re not going to do anything. They already know that John Ringo is not going to do anything, they already know that Larry’s not going to do anything.</p><p>I mean, these guys are successful. These guys are successful and it’s not worth it to them. I understand that. I’m not unsympathetic. You know the problem is, that is the response of everybody: <i>well, you know, it’s not that big a deal.</i> Well, it’s not that big a deal to you, but it is a big deal collectively to everyone else that is now affected by it. Now I’m not condemning or criticizing anyone who just wants to wash their hands and walk away from that. I don’t go to conventions, it’s not my thing. I don’t want to be around a bunch of people, so if someone says “hey, you know what, I’m just not gonna go” hey, that makes perfect sense to me.</p><p>But here’s the problem. Every time you do that, you’re conceding space, you’re providing moral comfort to the enemy, and you are encouraging them to continue doing it. And eventually they’re going to push into spaces where it actually affects you. For example, you know someone like John Ringo doesn’t really care about getting disinvited from a convention, right? But he’s going to care a whole lot if he ends up getting dumped by Baen for his political views. Now you might say, oh, that’s ridiculous, he’s very successful, why would they ever do that? Well, because SJWs are not rational people. They don’t look at the situation and say “gee this guy is one of our best-selling authors, we shouldn’t get rid of him”, they’re just going to look and say this is a bad person and we’re going to go after them now.</p><p>If Disney was willing to throw away a billion dollars in order to turn Star Wars into an SJW fest, do you really think that a publisher is going to be unwilling to give up some book sales? They are not primarily motivated by money so you cannot anticipate their behavior on the basis of whether it’s in their economic self-interest or not.</p><p>UPDATE: Neither Bridget Correia nor John C. Wright appear inclined <a href=\"http://www.scifiwright.com/2018/05/larry-correia-on-origins/\">to take this lying down</a>.</p><blockquote><p>The SJWs have already ruined STAR WARS, STAR TREK, DR WHO, Marvel Comics, the Hugo Awards, the News media, the Anglican Church, and the Boy Scouts.</p><p>They ruin the fun for everyone.</p><p>They nag, they lie, they play holier-than-thou, and at the same time promote moral depravity that makes your stomach turn. These are the same people, allegedly so afraid of Larry Correia, who defended and continue to defend Marion Zimmer Bradley and her homosexual husband running a pedophile ring at conventions.</p></blockquote></div>",
  "content_text": "In which I address Larry Correia’s disinvitation to Origins in light of my own banning from ConSimWorld over an argument with a proto-SJW demanding the elimination of black SS counters from wargames about 15 years ago\nin a Darkstream\n.\nThe thing is that nothing has changed, it’s only gotten worse, things are only getting worse because nobody is fighting back. I mean even someone like Larry Correia, whom I admire, whom I respect, and who in creating Sad Puppies launched what until recently was the only effective response to the SJWs, now even he just wants to be left alone. And that is the fundamental flaw of the Right; you cannot win a war that you refuse to fight, you cannot win a war by being left alone, and the SJWs have made it very very clear that they will never ever leave us alone.\nThe woman who complained about Correia to Origins and managed to get him disinvited was bitter at him over a takedown that he had done of her boyfriend back in 2014, four years ago! So these people do not forget and they are going to continue to come after you. They would continue to come after me if they could, you know, if they didn’t know that I am always ready for it, I’m always anticipating it, and they also know damn well that I’m going to go after them harder than they come at me every single time, and so they tend to go, “you know what, maybe we’ll go after easier targets.” I mean it’s not like there aren’t a plethora of them out there.\nAnd so what what you need to understand is that there is no telling them “that’s enough”, there is no warning them, the point is that you keep reading these articles, you keep seeing these comments, you know,\nnow they’ve gone too far, now it’s too much,\nand that’s not going to achieve anything. There is a standard boilerplate conservative column that I could probably write in my sleep, I’ve been reading that same column for 30 years now and I call it the conservative dire warning column.\nIf the Left doesn’t watch out, they’re not gonna like what happens!\nWell, guess what? Nothing’s gonna happen. You’re not going to do anything! You know, and they already know, that you’re not going to do anything. They already know that John Ringo is not going to do anything, they already know that Larry’s not going to do anything.\nI mean, these guys are successful. These guys are successful and it’s not worth it to them. I understand that. I’m not unsympathetic. You know the problem is, that is the response of everybody:\nwell, you know, it’s not that big a deal.\nWell, it’s not that big a deal to you, but it is a big deal collectively to everyone else that is now affected by it. Now I’m not condemning or criticizing anyone who just wants to wash their hands and walk away from that. I don’t go to conventions, it’s not my thing. I don’t want to be around a bunch of people, so if someone says “hey, you know what, I’m just not gonna go” hey, that makes perfect sense to me.\nBut here’s the problem. Every time you do that, you’re conceding space, you’re providing moral comfort to the enemy, and you are encouraging them to continue doing it. And eventually they’re going to push into spaces where it actually affects you. For example, you know someone like John Ringo doesn’t really care about getting disinvited from a convention, right? But he’s going to care a whole lot if he ends up getting dumped by Baen for his political views. Now you might say, oh, that’s ridiculous, he’s very successful, why would they ever do that? Well, because SJWs are not rational people. They don’t look at the situation and say “gee this guy is one of our best-selling authors, we shouldn’t get rid of him”, they’re just going to look and say this is a bad person and we’re going to go after them now.\nIf Disney was willing to throw away a billion dollars in order to turn Star Wars into an SJW fest, do you really think that a publisher is going to be unwilling to give up some book sales? They are not primarily motivated by money so you cannot anticipate their behavior on the basis of whether it’s in their economic self-interest or not.\nUPDATE: Neither Bridget Correia nor John C. Wright appear inclined\nto take this lying down\n.\nThe SJWs have already ruined STAR WARS, STAR TREK, DR WHO, Marvel Comics, the Hugo Awards, the News media, the Anglican Church, and the Boy Scouts.\nThey ruin the fun for everyone.\nThey nag, they lie, they play holier-than-thou, and at the same time promote moral depravity that makes your stomach turn. These are the same people, allegedly so afraid of Larry Correia, who defended and continue to defend Marion Zimmer Bradley and her homosexual husband running a pedophile ring at conventions.",
  "tags": [
    "PinkSF"
  ],
  "categories": [],
  "sitemap_lastmod": "2018-05-17T11:34:50+00:00"
}