{
  "url": "https://voxday.net/2018/05/01/it-was-right-there-all-along/",
  "scraped_at": "2025-12-19T20:59:57.717758",
  "title": "It was right there all along",
  "date_display": "May 1, 2018",
  "date_iso": "2018-05-01T17:00:05+00:00",
  "date_from_url": "2018-05-01",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>I’m deeply – DEEPLY – disappointed in you Jordan Peterson fans. His lunacy was openly on display from the very start. Did you never even read <i>Maps of Meaning</i>? It was all right there right before your eyes, a psychological purloined letter. How did none of you ever spot this nonsense?</p><p>From the 1999 <i><a href=\"https://www.scribd.com/document/99950208/27-1999-Peterson-JB-Maps-of-Meaning-Precis-Psycology#\">Maps of Meaning Precis</a></i></p><p><b>1. We think we live in the “objective” world, but we do not. The objective world is something that has been conjured up for us recently – absurdly recently, from the perspective of evolutionary biology.</b></p><p>Pure existential relativist gobbledygook. And don’t even think of opting for the obvious evasion that it’s just that he defines “objective” differently than the bloody dictionary. If you haven’t learned that bait-and-switch is the first sign of the charlatan, you’re not tall enough for this ride.</p><p>Let’s substitute, then paraphrase, the relevant definition just to show how crazy this is:</p><p><b>We think live in the world “<i>existing independent of thought or an observer as part of reality”</i>, but we do not. The world <i>existing independently as part of reality</i> has been conjured up for us recently.</b><br><b><br/></b>Jordan Peterson’s mind may not live in a world existing independently from him as a part of reality, but those of us who are sane do, and this is <i>particularly </i>true if we are elements of a vast computer simulation. Now do you better trust my sense of discernment? I caught the scent of intellectual wrongness from this lunatic just from that one inexcusable error about intelligence.</br></p></div>",
  "content_text": "I’m deeply – DEEPLY – disappointed in you Jordan Peterson fans. His lunacy was openly on display from the very start. Did you never even read\nMaps of Meaning\n? It was all right there right before your eyes, a psychological purloined letter. How did none of you ever spot this nonsense?\nFrom the 1999\nMaps of Meaning Precis\n1. We think we live in the “objective” world, but we do not. The objective world is something that has been conjured up for us recently – absurdly recently, from the perspective of evolutionary biology.\nPure existential relativist gobbledygook. And don’t even think of opting for the obvious evasion that it’s just that he defines “objective” differently than the bloody dictionary. If you haven’t learned that bait-and-switch is the first sign of the charlatan, you’re not tall enough for this ride.\nLet’s substitute, then paraphrase, the relevant definition just to show how crazy this is:\nWe think live in the world “\nexisting independent of thought or an observer as part of reality”\n, but we do not. The world\nexisting independently as part of reality\nhas been conjured up for us recently.\nJordan Peterson’s mind may not live in a world existing independently from him as a part of reality, but those of us who are sane do, and this is\nparticularly\ntrue if we are elements of a vast computer simulation. Now do you better trust my sense of discernment? I caught the scent of intellectual wrongness from this lunatic just from that one inexcusable error about intelligence.",
  "tags": [
    "philosophy"
  ],
  "categories": [],
  "sitemap_lastmod": "2018-05-01T16:00:05+00:00"
}