{
  "url": "https://voxday.net/2018/05/01/jordan-petersons-existential-relativism/",
  "scraped_at": "2025-12-19T20:59:55.887264",
  "title": "Jordan Peterson’s existential relativism",
  "date_display": "May 1, 2018",
  "date_iso": "2018-05-01T16:08:30+00:00",
  "date_from_url": "2018-05-01",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>I’m sorry, Peterson fans, but now that I have begun to look more closely at him, it increasingly appears your intellectual hero is a complete <i>joke</i> at best. At worst, he is a insane monster of inhuman ethics. Assuming that others have understood him correctly, his definition of “truth” is absolutely and utterly false – which explains his lack of intellectual integrity – and his Darwinian ethics are not only incoherent, they don’t even rise to the functional level of Sam Harris’s hapless utilitarianism.</p><p>Harris, who is far from my idea of a formidable intellect or coherent debater, has absolutely no trouble resoundingly <a href=\"https://samharris.org/speaking-of-truth-with-jordan-b-peterson/\">dismissing Peterson’s shoddy logic</a>:</p><blockquote><p>I recently interviewed the psychologist Jordan B. Peterson on the Waking Up podcast. As I said at the beginning of our conversation, I’d received more listener requests for him than for Neil deGrasse Tyson, Richard Dawkins, Steven Pinker, Edward Snowden—or, indeed, any other person on earth.</p><p>The resulting exchange, however, was not what our mutual fans were hoping for. Rather than discuss religion and atheism, or the relationship between science and ethics, we spent two hours debating what it means to say that a proposition is (or seems to be) “true.” This is a not trivial problem in philosophy. But the place at which Peterson and I got stuck was a strange one. He seemed to be claiming that any belief system compatible with our survival must be true, and any that gets us killed must be false. As I tried to show, this view makes no sense, and I couldn’t quite convince myself that Peterson actually held it.</p></blockquote><p>I found this extremely hard to believe too, and I won’t utilize it until I confirm it from Peterson’s own writings, but the basic idea keeps cropping up again and again when I read what others have written about the man’s ideas, as well as in the man’s own words. Right now, I’m still at the “you have GOT to be fucking kidding me” stage; I am starting to suspect that this guy’s genius lies in piling up so much highly compressed bullshit that the bedazzled reader only sees a mirror of what he wants to believe.</p><ul><li><i>Events as they occurred are only factual but not necessarily true. True is a judgment call and is therefore open to interpretation. The claim of ‘something’s’ validity can only be made when one can see ‘the bigger picture’ — the wellbeing of humanity or ‘life’ itself. Only then can we know if something is true rather than just factual or ‘materialistically true’. – Peterson</i></li><li><i>If it doesn’t serve life, it’s not true. – Peterson</i></li><li><i>He seems to claim that any belief system compatible with our survival must be true, and any that gets us killed must be false.</i></li><li><i>Why is Peterson dishonest in some ways? I think he explained this in the debate with Sam Harris, where he said things like ” something which not benefits /potential harms humanity cant be true”.</i></li></ul><p>This is worse than moral relativism, this is existential relativism. Harris correctly demolishes this absurd, childish, and narcissistic conception of truth in his post-interview response.</p><blockquote><p>In the year 2017, the question “How should we act in the world?” simply isn’t reducible to Darwinism. In fact, most answers to this question arise in utter defiance of the evolutionary imperatives that produced us. Caring for disabled children would most likely have been maladaptive for our ancestors during any conditions of scarcity—while cannibalism recommended itself from time to time in every corner of the globe. How much inspiration should we draw from the fact that killing and eating children is also an ancient “archetype”? Overcoming tribalism, xenophobia, honor violence, and other forms of apish barbarity has been unthinkable for hundreds of millennia—that is, until now. And our moral progress on these fronts is the basis of our most enlightened answers to Peterson’s question.</p><p>We didn’t evolve to do science, or to build institutions that last for generations, but we must do these things to thrive. Thriving requires the survival of the species, of course, but it’s not reducible to that. Getting our genes into the next generation simply isn’t our only (or even our primary) goal—and it surely isn’t the foundation of our ethics. If we were true Darwinians, every man’s deepest desire would be to continually donate sperm to sperm banks so that he could sire thousands of children for whom he’d have no further responsibility. If we really viewed the world from the perspective of our genes, no other answer to the question “How should we act in the world?” would seem more fitting. I’ll let readers judge how closely this maps onto the human minds with which they’re acquainted.</p><p>Peterson believes that there is an inverse symmetry to our views on the relationship between facts and values. According to him, I see “ethics as nested inside scientific realism,” whereas he sees “scientific realism as nested inside Darwinian competition” (which he views in ethical terms).  A clearer way of stating this is that he thinks I locate all values within a system of truth claims, whereas he locates all truth claims in a system that selects for a single value: survival. Hence our stalemate.</p><p>Peterson’s peculiar form of pragmatism, anchored to the lone value of survival, can’t capture what we mean by “truth” (or even what most pragmatists mean by it).</p><p>But I have always said that the scientific worldview presupposes the validity of certain values—logical consistency (up to a point), explanatory elegance, respect for evidence, and so forth. This is why I think Hume’s famous gap between “is” (facts) and “ought” (values) is misleading on the topic of morality. We can easily reverse direction and discover that we won’t get to “is” without first obeying certain “oughts.” For instance, to understand what the cause of an illness is, one ought to pay attention to regularities in the body and in the environment that coincide with it. (Additionally, we now know that one ought to emphasize material causes, rather than sympathetic magic or the evil eye.) Facts and values are connected.</p><p>However, the fact that some values lie at the foundation of our scientific worldview does not suggest that all scientific truth claims can be judged on the basis of the single (Darwinian) criterion of whether the claimants survive long enough to breed.  On the contrary, this assertion is quite obviously false (as I believe I demonstrated throughout our podcast). We can easily imagine our species being outcompeted by one that has no understanding whatsoever of the cosmos. Would a lethal swarm of disease-bearing insects possess a worldview superior to our own by virtue of eradicating us? The question answers itself—because no insect could even pose it. Mere survival doesn’t suggest anything about the intellectual or ethical achievement of the survivors.</p><p>Some who listened to my conversation with Peterson thought that in objecting to his conception of truth, I was endorsing materialism or denying that the mind could play any role in determining the character of reality. But that isn’t the case. I was merely arguing that Peterson’s peculiar form of pragmatism, anchored to the lone value of survival, can’t capture what we mean by “truth” (or even what most pragmatists mean by it).</p></blockquote><p>Peterson is so philosophically incompetent that he quite clearly does not fully comprehend that his idiotic ethical system not only <i>fully justifies </i>the Holocaust, it can actually be logically utilized to <i>require </i>future repetitions on a regular basis! I suspect he may harbor a dim awareness of this, which would explain why he is clinging so desperately to the 115 IQ myth that I disproved.</p><p>I have not yet confirmed for myself that the way Peterson characterized his definition of truth during the interview is fully representative of his actual thinking on the matter, or that Harris and other commenters are correctly describing it. But if this “evolutionary pragmatism” is genuinely the basis for his conception of the truth, then I have absolutely no problem dismissing the man as an architect of an evil philosophy, an intellectual charlatan, and a false prophet whose works merit complete and comprehensive demolition.</p><p>Spare me the “oh, he does so much good for the broken little boys” argument. If this definition of his conception of truth is correct, then Jordan Peterson <i>is not doing anyone any good at all</i>, and unlike more honest atheists like Dawkins and Harris, he is a philosophical wolf in sheep’s clothing, a Pied Piper who is attempting to transform those broken little boys into unethical monstrosities. He appears to have blown up his Gamma delusion bubble into an ethical system and a philosophy of life. I am even beginning to suspect that he isn’t just comprehensively wrong, but that he is mentally ill. Not unlike Google muttering “don’t be evil, don’t be evil” to itself, Peterson is desperately seeking an antidote to the chaos of his mind.</p><p>So, if you’re a Peterson fan, you might want to buckle up. I just read <a href=\"https://www.scribd.com/document/337709796/Sam-Harris-Jordan-B-Peterson-What-is-Truth-Transcript\">the transcript of the Harris interview</a>, then put <i>12 Rules for Life</i> and <i>Maps of Meaning</i> on my tablet. The baleful eye of the Dark Lord is now focused squarely upon the man. And we’re not just looking at the possibility that the emperor has no clothes here, we’re being forced to consider the very real possibility that the emperor is actually a recently shorn sheep that sincerely believes it’s a cat.</p></div>",
  "content_text": "I’m sorry, Peterson fans, but now that I have begun to look more closely at him, it increasingly appears your intellectual hero is a complete\njoke\nat best. At worst, he is a insane monster of inhuman ethics. Assuming that others have understood him correctly, his definition of “truth” is absolutely and utterly false – which explains his lack of intellectual integrity – and his Darwinian ethics are not only incoherent, they don’t even rise to the functional level of Sam Harris’s hapless utilitarianism.\nHarris, who is far from my idea of a formidable intellect or coherent debater, has absolutely no trouble resoundingly\ndismissing Peterson’s shoddy logic\n:\nI recently interviewed the psychologist Jordan B. Peterson on the Waking Up podcast. As I said at the beginning of our conversation, I’d received more listener requests for him than for Neil deGrasse Tyson, Richard Dawkins, Steven Pinker, Edward Snowden—or, indeed, any other person on earth.\nThe resulting exchange, however, was not what our mutual fans were hoping for. Rather than discuss religion and atheism, or the relationship between science and ethics, we spent two hours debating what it means to say that a proposition is (or seems to be) “true.” This is a not trivial problem in philosophy. But the place at which Peterson and I got stuck was a strange one. He seemed to be claiming that any belief system compatible with our survival must be true, and any that gets us killed must be false. As I tried to show, this view makes no sense, and I couldn’t quite convince myself that Peterson actually held it.\nI found this extremely hard to believe too, and I won’t utilize it until I confirm it from Peterson’s own writings, but the basic idea keeps cropping up again and again when I read what others have written about the man’s ideas, as well as in the man’s own words. Right now, I’m still at the “you have GOT to be fucking kidding me” stage; I am starting to suspect that this guy’s genius lies in piling up so much highly compressed bullshit that the bedazzled reader only sees a mirror of what he wants to believe.\nEvents as they occurred are only factual but not necessarily true. True is a judgment call and is therefore open to interpretation. The claim of ‘something’s’ validity can only be made when one can see ‘the bigger picture’ — the wellbeing of humanity or ‘life’ itself. Only then can we know if something is true rather than just factual or ‘materialistically true’. – Peterson\nIf it doesn’t serve life, it’s not true. – Peterson\nHe seems to claim that any belief system compatible with our survival must be true, and any that gets us killed must be false.\nWhy is Peterson dishonest in some ways? I think he explained this in the debate with Sam Harris, where he said things like ” something which not benefits /potential harms humanity cant be true”.\nThis is worse than moral relativism, this is existential relativism. Harris correctly demolishes this absurd, childish, and narcissistic conception of truth in his post-interview response.\nIn the year 2017, the question “How should we act in the world?” simply isn’t reducible to Darwinism. In fact, most answers to this question arise in utter defiance of the evolutionary imperatives that produced us. Caring for disabled children would most likely have been maladaptive for our ancestors during any conditions of scarcity—while cannibalism recommended itself from time to time in every corner of the globe. How much inspiration should we draw from the fact that killing and eating children is also an ancient “archetype”? Overcoming tribalism, xenophobia, honor violence, and other forms of apish barbarity has been unthinkable for hundreds of millennia—that is, until now. And our moral progress on these fronts is the basis of our most enlightened answers to Peterson’s question.\nWe didn’t evolve to do science, or to build institutions that last for generations, but we must do these things to thrive. Thriving requires the survival of the species, of course, but it’s not reducible to that. Getting our genes into the next generation simply isn’t our only (or even our primary) goal—and it surely isn’t the foundation of our ethics. If we were true Darwinians, every man’s deepest desire would be to continually donate sperm to sperm banks so that he could sire thousands of children for whom he’d have no further responsibility. If we really viewed the world from the perspective of our genes, no other answer to the question “How should we act in the world?” would seem more fitting. I’ll let readers judge how closely this maps onto the human minds with which they’re acquainted.\nPeterson believes that there is an inverse symmetry to our views on the relationship between facts and values. According to him, I see “ethics as nested inside scientific realism,” whereas he sees “scientific realism as nested inside Darwinian competition” (which he views in ethical terms).  A clearer way of stating this is that he thinks I locate all values within a system of truth claims, whereas he locates all truth claims in a system that selects for a single value: survival. Hence our stalemate.\nPeterson’s peculiar form of pragmatism, anchored to the lone value of survival, can’t capture what we mean by “truth” (or even what most pragmatists mean by it).\nBut I have always said that the scientific worldview presupposes the validity of certain values—logical consistency (up to a point), explanatory elegance, respect for evidence, and so forth. This is why I think Hume’s famous gap between “is” (facts) and “ought” (values) is misleading on the topic of morality. We can easily reverse direction and discover that we won’t get to “is” without first obeying certain “oughts.” For instance, to understand what the cause of an illness is, one ought to pay attention to regularities in the body and in the environment that coincide with it. (Additionally, we now know that one ought to emphasize material causes, rather than sympathetic magic or the evil eye.) Facts and values are connected.\nHowever, the fact that some values lie at the foundation of our scientific worldview does not suggest that all scientific truth claims can be judged on the basis of the single (Darwinian) criterion of whether the claimants survive long enough to breed.  On the contrary, this assertion is quite obviously false (as I believe I demonstrated throughout our podcast). We can easily imagine our species being outcompeted by one that has no understanding whatsoever of the cosmos. Would a lethal swarm of disease-bearing insects possess a worldview superior to our own by virtue of eradicating us? The question answers itself—because no insect could even pose it. Mere survival doesn’t suggest anything about the intellectual or ethical achievement of the survivors.\nSome who listened to my conversation with Peterson thought that in objecting to his conception of truth, I was endorsing materialism or denying that the mind could play any role in determining the character of reality. But that isn’t the case. I was merely arguing that Peterson’s peculiar form of pragmatism, anchored to the lone value of survival, can’t capture what we mean by “truth” (or even what most pragmatists mean by it).\nPeterson is so philosophically incompetent that he quite clearly does not fully comprehend that his idiotic ethical system not only\nfully justifies\nthe Holocaust, it can actually be logically utilized to\nrequire\nfuture repetitions on a regular basis! I suspect he may harbor a dim awareness of this, which would explain why he is clinging so desperately to the 115 IQ myth that I disproved.\nI have not yet confirmed for myself that the way Peterson characterized his definition of truth during the interview is fully representative of his actual thinking on the matter, or that Harris and other commenters are correctly describing it. But if this “evolutionary pragmatism” is genuinely the basis for his conception of the truth, then I have absolutely no problem dismissing the man as an architect of an evil philosophy, an intellectual charlatan, and a false prophet whose works merit complete and comprehensive demolition.\nSpare me the “oh, he does so much good for the broken little boys” argument. If this definition of his conception of truth is correct, then Jordan Peterson\nis not doing anyone any good at all\n, and unlike more honest atheists like Dawkins and Harris, he is a philosophical wolf in sheep’s clothing, a Pied Piper who is attempting to transform those broken little boys into unethical monstrosities. He appears to have blown up his Gamma delusion bubble into an ethical system and a philosophy of life. I am even beginning to suspect that he isn’t just comprehensively wrong, but that he is mentally ill. Not unlike Google muttering “don’t be evil, don’t be evil” to itself, Peterson is desperately seeking an antidote to the chaos of his mind.\nSo, if you’re a Peterson fan, you might want to buckle up. I just read\nthe transcript of the Harris interview\n, then put\n12 Rules for Life\nand\nMaps of Meaning\non my tablet. The baleful eye of the Dark Lord is now focused squarely upon the man. And we’re not just looking at the possibility that the emperor has no clothes here, we’re being forced to consider the very real possibility that the emperor is actually a recently shorn sheep that sincerely believes it’s a cat.",
  "tags": [
    "philosophy"
  ],
  "categories": [],
  "sitemap_lastmod": "2018-05-01T15:08:30+00:00"
}