{
  "url": "https://voxday.net/2018/05/06/mailvox-thats-exactly-how-good-i-am/",
  "scraped_at": "2025-12-19T21:00:38.074097",
  "title": "Mailvox: that’s EXACTLY how good I am",
  "date_display": "May 6, 2018",
  "date_iso": "2018-05-06T15:22:31+00:00",
  "date_from_url": "2018-05-06",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>Jordan Peterson’s fans are starting to get upset because apparently they think <a href=\"https://www.youtube.com/watch?v=FHF0ZgKEGXo\">I am too mean</a>. Perhaps <b>Warning: Award-Winning Cruelty Artist At Work Ahead</b> should be attached to my Peterson-related videos.</p><blockquote class=\"tr_bq\"><p>By the way, how do you know Jordan Peterson is depressed?  You diagnosed him by reading some of his interviews and 2 chapters of that dumb book?  That’s pretty amazing.  You could put a lot of psycholgists out of business and revolutionize the field with your kind of ability. Peterson has a practice doing psychiatry for decades.  Is it not possible that Peterson picked up a lot of this information and developed these methods, from working with his patients?   How do you know Peterson must be talking about himself all the time?</p></blockquote><p>I didn’t need that much. I could have diagnosed him from nothing more than reading Chapter 2 of <i>12 Rules of Life</i>. Think about it: if you are giving the whole world advice, and you decide that the second-most important thing you have to tell them is <i>“remember to take your pills, because you are not too ugly, ashamed, worthless, and cowardly to deserve to take care of yourself”</i>, then there is absolutely zero chance that you are mentally healthy and the odds are very high that you are suffering from depression, among other mental illnesses.</p><p>I suspect many people don’t realize how much an author’s writing <i>unintentionally </i>reveals about the author, particularly to an editor who has been able to see how many authors approach similar subjects in different ways. Frankly, I know more than I want to about the interior lives of the novelists I edit from nothing more than the choices they instinctively, and habitually, make.</p><p>But, as it happens, I did not have to do so, because I already knew that Peterson was depressed and taking some sort of drugs for it by his own admission. Chapter 2 is merely iron-clad confirmation that Peterson is telling at least part of the truth about his mental health issues and an enlightening illustration of how deep they run.</p><p>Another viewer questions my objectives.</p><blockquote class=\"tr_bq\"><p>Vox, I question where you are going with this and what you are hoping to achieve. I think there’s great value in critiquing Peterson’s work but again you’ve made a series of unverifiable ad hominem claims regarding Peterson’s mindset and motivations. This is completely unnecessary for the purposes of critiquing the subject content. I’m not questioning your analysis of Peterson – you may be correct – I’m questioning your decision to deploy that analysis in your critique. </p></blockquote><p>It’s not merely my purpose to critique the content of the <i>12 Rules of Life</i>. It is my purpose to expose Jordan Peterson for the intellectual charlatan and professional con man that he is. The man is preying upon the intellectually and emotionally vulnerable and is selling them an evil, destructive philosophy while trying to divert them from the objective truths of logic, science, Christianity, and history. My statements about Peterson’s mindset and motivations are far from unverifiable; to the contrary, they are frequently based on Peterson’s own direct statements, verbal and written.</p><p>Yet another commits the genetic fallacy while confusing me with the Fake Right.</p><blockquote class=\"tr_bq\"><p>I’m no huge fan of Peterson, but for someone who repeatedly emphasizes his “high IQ” and how literate and well-read you are, it’s rather astonishing to see you accuse Peterson of being self-obsessed.   Every time I’ve watched your videos, you seem a bit neurotic and thin-skinned, as you routinely call your viewers “morons” and kick them out when they say something that bothers you.  What are you trying to accomplish with these ongoing rants about Peterson, anyways?  The Alt-Right, which you are a self-proclaimed proponent of, is imploding.  They just shut down your buddy Richard Spencer’s website.  Don’t you have other, more important, issues to address?﻿</p></blockquote><p>First, Peterson is self-obsessed. By observation and by his own admission, his talks are more inward-focused self-dialogue than proper lectures. Second, whether I am Hitler or Mother Theresa makes no difference concerning what Peterson is. Third, MPAI. Fourth, I kick people out because they repeatedly attempt to disrupt the Periscope. What I am attempting to accomplish with these “ongoing rants about Peterson” is to expose the truth about Jordan Peterson, which is that he is an intellectual charlatan and professional con man preying upon the intellectually and emotionally vulnerable. And fifth, the Alt-Right is not imploding, but to the contrary, is inevitable. Sixth, Richard Spencer is not my buddy. And seventh, no, I don’t have any more important issue to address.</p><blockquote class=\"tr_bq\"><p>Vox, are you going to formulate a well reasoned argument at some point or  just keep insulting someone because they may have mental health problems? When did you get your PHD in psychiatry?﻿</p></blockquote><p>It’s not an either/or proposition; I intend to do both. That being said, it’s not an insult to observe that Jordan Peterson is mentally ill or that his mental illness has significantly influenced his worldview, his philosophy, and his most recent book. To the contrary, it is a highly pertinent fact. One does not need a PhD in psychiatry or anything else to observe that someone is crazy or to observe the effects of that craziness. Jordan Peterson isn’t wandering through the night with a knife in his hand muttering “don’t be evil” to himself, he’s doing an intellectual version of that by weeping on stage with a mic in his hand as he begs people to not be too ashamed to take their prescribed medication.</p><blockquote class=\"tr_bq\"><p>“remember to take your pills” is more of an analogy of you need to do what you need to do to progress you life even if you don’t want to. </p></blockquote><p>It’s really not. Re-read the chapter, and as you do so, keep in mind that the author has himself been prescribed medication for his mental illness.</p><p>And this emailer obviously didn’t think through the consequences of his question.</p><blockquote class=\"tr_bq\"><p>Criticize Peterson’s ideas and attribute his success to media manufacturing as much as you feel you need to, but do ask yourself why hundreds of people are not lining up to ask you questions like, “My brother committed suicide, and I’m taking care of my sister’s kids (ages 7, 3) until she’s stable. How can I help them cope with the loss of their uncle?”</p></blockquote><p>I don’t need to ask myself that. I haven’t been anointed by the media as the prophet uniquely in touch with the wisdom of the ages and the answers to the meaning of life. I suggest the reader should ask himself whether he thinks it is a good thing that these hurting and vulnerable people are being directed to seek answers from an intellectual charlatan and professional con man who teaches that the Bible is myth and metaphor.</p><p>What is Peterson going to tell them anyhow? Affect dominant postures? Clean their room? Make sure they take their vitamins daily? Don’t holocaust anyone? Or is he just going to get weepy on stage again? Perhaps he can draw upon the deep wellspring of his philosophy and tell the children that their suicidal father was pure evil for unnecessarily causing their suffering. That should do wonders for their psyches.</p><p>Not everyone disagrees with me, of course. Future Israeli has already seen enough to reach a verdict:</p><blockquote class=\"tr_bq\"><p>I was a fan of Vox Day and Jordan Peterson… now I’m just a fan of Vox Day.</p></blockquote><p>And this viewer has figured out the true purpose of Jordan Peterson, which is to preach Holocaustianity to a generation that knows nothing and cares less about WWII-era history. (And that sound you just heard was Avalanche’s tender heart shattering.)</p><blockquote class=\"tr_bq\"><p>I felt something was off as soon as Jordan Peterson showed up he already  teaming up with: Ben Shapiro, Denis Prager, Gaad Saad, Ezra Levant,  Dave Rubin, Christina Hoff Sommers, Mark Levin (CRTV), Bret Weinestine,  Steven Pinker etc etc</p></blockquote><p>His peculiar obsession with Nazis and the Holocaust is the primary reason for Peterson’s unexpected and otherwise inexplicable rise to prominence in the media. Peterson was discovered by TV producer Wodek Szemberg, the producer of <i>Big Ideas</i>, who is, we are told in the Foreword to the <i>12 Rules of Life</i>, “always on the lookout for potential public intellectuals, who knows how to spot people who can really talk in front of a TV camera and who look authentic….” Then he was picked up and pushed heavily by Ezra Levant of <i>Rebel Media</i> until he was embraced by the neocons and Never Trumpers.</p></div>",
  "content_text": "Jordan Peterson’s fans are starting to get upset because apparently they think\nI am too mean\n. Perhaps\nWarning: Award-Winning Cruelty Artist At Work Ahead\nshould be attached to my Peterson-related videos.\nBy the way, how do you know Jordan Peterson is depressed?  You diagnosed him by reading some of his interviews and 2 chapters of that dumb book?  That’s pretty amazing.  You could put a lot of psycholgists out of business and revolutionize the field with your kind of ability. Peterson has a practice doing psychiatry for decades.  Is it not possible that Peterson picked up a lot of this information and developed these methods, from working with his patients?   How do you know Peterson must be talking about himself all the time?\nI didn’t need that much. I could have diagnosed him from nothing more than reading Chapter 2 of\n12 Rules of Life\n. Think about it: if you are giving the whole world advice, and you decide that the second-most important thing you have to tell them is\n“remember to take your pills, because you are not too ugly, ashamed, worthless, and cowardly to deserve to take care of yourself”\n, then there is absolutely zero chance that you are mentally healthy and the odds are very high that you are suffering from depression, among other mental illnesses.\nI suspect many people don’t realize how much an author’s writing\nunintentionally\nreveals about the author, particularly to an editor who has been able to see how many authors approach similar subjects in different ways. Frankly, I know more than I want to about the interior lives of the novelists I edit from nothing more than the choices they instinctively, and habitually, make.\nBut, as it happens, I did not have to do so, because I already knew that Peterson was depressed and taking some sort of drugs for it by his own admission. Chapter 2 is merely iron-clad confirmation that Peterson is telling at least part of the truth about his mental health issues and an enlightening illustration of how deep they run.\nAnother viewer questions my objectives.\nVox, I question where you are going with this and what you are hoping to achieve. I think there’s great value in critiquing Peterson’s work but again you’ve made a series of unverifiable ad hominem claims regarding Peterson’s mindset and motivations. This is completely unnecessary for the purposes of critiquing the subject content. I’m not questioning your analysis of Peterson – you may be correct – I’m questioning your decision to deploy that analysis in your critique.\nIt’s not merely my purpose to critique the content of the\n12 Rules of Life\n. It is my purpose to expose Jordan Peterson for the intellectual charlatan and professional con man that he is. The man is preying upon the intellectually and emotionally vulnerable and is selling them an evil, destructive philosophy while trying to divert them from the objective truths of logic, science, Christianity, and history. My statements about Peterson’s mindset and motivations are far from unverifiable; to the contrary, they are frequently based on Peterson’s own direct statements, verbal and written.\nYet another commits the genetic fallacy while confusing me with the Fake Right.\nI’m no huge fan of Peterson, but for someone who repeatedly emphasizes his “high IQ” and how literate and well-read you are, it’s rather astonishing to see you accuse Peterson of being self-obsessed.   Every time I’ve watched your videos, you seem a bit neurotic and thin-skinned, as you routinely call your viewers “morons” and kick them out when they say something that bothers you.  What are you trying to accomplish with these ongoing rants about Peterson, anyways?  The Alt-Right, which you are a self-proclaimed proponent of, is imploding.  They just shut down your buddy Richard Spencer’s website.  Don’t you have other, more important, issues to address?﻿\nFirst, Peterson is self-obsessed. By observation and by his own admission, his talks are more inward-focused self-dialogue than proper lectures. Second, whether I am Hitler or Mother Theresa makes no difference concerning what Peterson is. Third, MPAI. Fourth, I kick people out because they repeatedly attempt to disrupt the Periscope. What I am attempting to accomplish with these “ongoing rants about Peterson” is to expose the truth about Jordan Peterson, which is that he is an intellectual charlatan and professional con man preying upon the intellectually and emotionally vulnerable. And fifth, the Alt-Right is not imploding, but to the contrary, is inevitable. Sixth, Richard Spencer is not my buddy. And seventh, no, I don’t have any more important issue to address.\nVox, are you going to formulate a well reasoned argument at some point or  just keep insulting someone because they may have mental health problems? When did you get your PHD in psychiatry?﻿\nIt’s not an either/or proposition; I intend to do both. That being said, it’s not an insult to observe that Jordan Peterson is mentally ill or that his mental illness has significantly influenced his worldview, his philosophy, and his most recent book. To the contrary, it is a highly pertinent fact. One does not need a PhD in psychiatry or anything else to observe that someone is crazy or to observe the effects of that craziness. Jordan Peterson isn’t wandering through the night with a knife in his hand muttering “don’t be evil” to himself, he’s doing an intellectual version of that by weeping on stage with a mic in his hand as he begs people to not be too ashamed to take their prescribed medication.\n“remember to take your pills” is more of an analogy of you need to do what you need to do to progress you life even if you don’t want to.\nIt’s really not. Re-read the chapter, and as you do so, keep in mind that the author has himself been prescribed medication for his mental illness.\nAnd this emailer obviously didn’t think through the consequences of his question.\nCriticize Peterson’s ideas and attribute his success to media manufacturing as much as you feel you need to, but do ask yourself why hundreds of people are not lining up to ask you questions like, “My brother committed suicide, and I’m taking care of my sister’s kids (ages 7, 3) until she’s stable. How can I help them cope with the loss of their uncle?”\nI don’t need to ask myself that. I haven’t been anointed by the media as the prophet uniquely in touch with the wisdom of the ages and the answers to the meaning of life. I suggest the reader should ask himself whether he thinks it is a good thing that these hurting and vulnerable people are being directed to seek answers from an intellectual charlatan and professional con man who teaches that the Bible is myth and metaphor.\nWhat is Peterson going to tell them anyhow? Affect dominant postures? Clean their room? Make sure they take their vitamins daily? Don’t holocaust anyone? Or is he just going to get weepy on stage again? Perhaps he can draw upon the deep wellspring of his philosophy and tell the children that their suicidal father was pure evil for unnecessarily causing their suffering. That should do wonders for their psyches.\nNot everyone disagrees with me, of course. Future Israeli has already seen enough to reach a verdict:\nI was a fan of Vox Day and Jordan Peterson… now I’m just a fan of Vox Day.\nAnd this viewer has figured out the true purpose of Jordan Peterson, which is to preach Holocaustianity to a generation that knows nothing and cares less about WWII-era history. (And that sound you just heard was Avalanche’s tender heart shattering.)\nI felt something was off as soon as Jordan Peterson showed up he already  teaming up with: Ben Shapiro, Denis Prager, Gaad Saad, Ezra Levant,  Dave Rubin, Christina Hoff Sommers, Mark Levin (CRTV), Bret Weinestine,  Steven Pinker etc etc\nHis peculiar obsession with Nazis and the Holocaust is the primary reason for Peterson’s unexpected and otherwise inexplicable rise to prominence in the media. Peterson was discovered by TV producer Wodek Szemberg, the producer of\nBig Ideas\n, who is, we are told in the Foreword to the\n12 Rules of Life\n, “always on the lookout for potential public intellectuals, who knows how to spot people who can really talk in front of a TV camera and who look authentic….” Then he was picked up and pushed heavily by Ezra Levant of\nRebel Media\nuntil he was embraced by the neocons and Never Trumpers.",
  "tags": [
    "mailvox"
  ],
  "categories": [],
  "sitemap_lastmod": "2018-05-06T14:22:31+00:00"
}