{
  "url": "https://voxday.net/2018/05/30/moderates-mourn-the-middle-ground/",
  "scraped_at": "2025-12-19T21:04:36.419148",
  "title": "Moderates mourn the middle ground",
  "date_display": "May 30, 2018",
  "date_iso": "2018-05-30T14:02:39+00:00",
  "date_from_url": "2018-05-30",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>It’s interesting to see how the mainstream media is belatedly discovering the fact that <a href=\"https://www.washingtonexaminer.com/washington-secrets/warning-2018-political-civil-war-threatens-fueled-by-media-1\">there is no longer any middle ground</a> between Americans and the 100 million Not-Americans who invaded the dirt that turned out to lack the necessary magic. One has to wonder what they thought was going to happen in light of the post-1965 immigration changes. Were they really that ignorant of the consequences of every previous mass human migration?</p><blockquote><p>More and more voices are raising concerns that the 2018 elections will ignite a terrible clash between supporters of President Trump and his increasingly agitated critics in a partisan battle that has been brewing for years.</p><p>Stanley Greenberg, former President Bill Clinton’s pollster, is warning of a “civil war.” Purdue University President Mitchell E. Daniels, former President Ronald Reagan’s political director and a two-term Indiana Republican governor, sees the nation dividing into feuding “tribes” that gravitate to tyrants who “bludgeon” opponents.</p><p>In two separate reports, the two opposites come to a similar conclusion that the nation and even families are terribly divided and that the media has played a big role in creating the split.</p><p>Daniels is well regarded as level-headed and has been dubbed the best university president in the nation. He has used his commencement addresses to push for openness and understanding, but this year he noted a shift to “tribalism,” where sides cluster in cliques.</p><p>“It’s no longer just a matter of Americans not knowing and understanding each other. We’ve seen these clusters deepen, and harden, until separation has led to anger, misunderstanding turned into hostility. At the individual level, it’s a formula for bitterness and negativity. For a self-governing people, it’s poison,” Daniels told his students this month.</p><p>Among the culprits he cited were biased media, the “anti-social media.” Said Daniels, “Our various modern media lead us to, and feed us from information sources that reinforce our existing biases. They put us in contact with other tribe members, but rarely those who see things differently. We’re starting to resemble ominously our primitive forebearers, trusting no one outside the tribe.”</p><p>And he called that “dangerous,” warning “almost all of history has belonged to the tyrants, the warlords, the autocrats, the totalitarians. And tribes always gravitate toward tyrants.”</p><p>He didn’t name names, mention President Trump or former President Barack Obama, on purpose. The reason: both sides and their mouthpieces are to blame. “It’s a general phenomenon,” he said in an interview in which he bemoaned “there is no overlap anymore.”</p></blockquote><p>What I want every civic nationalist, every centrist, and every moderate to consider, and eventually, come to terms with is the fact that <i>this is precisely the destiny they helped create</i>. Every single identity-conflicted individual to whom I have ever spoken tries to carve out an exception for their wife, their children, their neighbords, their colleagues, their friends, and their immigrant grandparents. <i>Every single one.</i><br><i><br/></i>And that’s understandable. I have no problem understanding the temptation to do so, being an identity-conflicted first-generation immigrant myself. But this is a category error; the vast majority of the micro exceptions are totally irrelevant when it comes to the macro issue. Reality doesn’t care that you think it would be really terrible to be forced to choose between your nation and your neighbor, or between your family and your friend. War does not require your approval in order to take place.</br></p><p>Despite the largest invasion in recorded human history, most people in the United States have not been materially affected in a way they recognize. That is why they are oblivious to the obvious, and why they will most likely remain oblivious until it is far too late to do anything about the situation.</p><p>Donald Trump isn’t even trying to address the situation. The efforts of most politicians will only make things worse. Jordan Peterson’s Hail Mary assault on human nature will fail too. The desperate measures that are now required to salvage the nation and avert a war that will make the Civil War look like a casual warmup are on the level of those utilized for the Spanish Reconquista, and are not even close to being politically viable yet. Six years ago, I was warning you about this. Now the likes of Stanley Greenberg and Mitch Daniels are doing the same.</p><p>You have about 12-15 years to prepare for this now, possibly less, in my estimation.</p></div>",
  "content_text": "It’s interesting to see how the mainstream media is belatedly discovering the fact that\nthere is no longer any middle ground\nbetween Americans and the 100 million Not-Americans who invaded the dirt that turned out to lack the necessary magic. One has to wonder what they thought was going to happen in light of the post-1965 immigration changes. Were they really that ignorant of the consequences of every previous mass human migration?\nMore and more voices are raising concerns that the 2018 elections will ignite a terrible clash between supporters of President Trump and his increasingly agitated critics in a partisan battle that has been brewing for years.\nStanley Greenberg, former President Bill Clinton’s pollster, is warning of a “civil war.” Purdue University President Mitchell E. Daniels, former President Ronald Reagan’s political director and a two-term Indiana Republican governor, sees the nation dividing into feuding “tribes” that gravitate to tyrants who “bludgeon” opponents.\nIn two separate reports, the two opposites come to a similar conclusion that the nation and even families are terribly divided and that the media has played a big role in creating the split.\nDaniels is well regarded as level-headed and has been dubbed the best university president in the nation. He has used his commencement addresses to push for openness and understanding, but this year he noted a shift to “tribalism,” where sides cluster in cliques.\n“It’s no longer just a matter of Americans not knowing and understanding each other. We’ve seen these clusters deepen, and harden, until separation has led to anger, misunderstanding turned into hostility. At the individual level, it’s a formula for bitterness and negativity. For a self-governing people, it’s poison,” Daniels told his students this month.\nAmong the culprits he cited were biased media, the “anti-social media.” Said Daniels, “Our various modern media lead us to, and feed us from information sources that reinforce our existing biases. They put us in contact with other tribe members, but rarely those who see things differently. We’re starting to resemble ominously our primitive forebearers, trusting no one outside the tribe.”\nAnd he called that “dangerous,” warning “almost all of history has belonged to the tyrants, the warlords, the autocrats, the totalitarians. And tribes always gravitate toward tyrants.”\nHe didn’t name names, mention President Trump or former President Barack Obama, on purpose. The reason: both sides and their mouthpieces are to blame. “It’s a general phenomenon,” he said in an interview in which he bemoaned “there is no overlap anymore.”\nWhat I want every civic nationalist, every centrist, and every moderate to consider, and eventually, come to terms with is the fact that\nthis is precisely the destiny they helped create\n. Every single identity-conflicted individual to whom I have ever spoken tries to carve out an exception for their wife, their children, their neighbords, their colleagues, their friends, and their immigrant grandparents.\nEvery single one.\nAnd that’s understandable. I have no problem understanding the temptation to do so, being an identity-conflicted first-generation immigrant myself. But this is a category error; the vast majority of the micro exceptions are totally irrelevant when it comes to the macro issue. Reality doesn’t care that you think it would be really terrible to be forced to choose between your nation and your neighbor, or between your family and your friend. War does not require your approval in order to take place.\nDespite the largest invasion in recorded human history, most people in the United States have not been materially affected in a way they recognize. That is why they are oblivious to the obvious, and why they will most likely remain oblivious until it is far too late to do anything about the situation.\nDonald Trump isn’t even trying to address the situation. The efforts of most politicians will only make things worse. Jordan Peterson’s Hail Mary assault on human nature will fail too. The desperate measures that are now required to salvage the nation and avert a war that will make the Civil War look like a casual warmup are on the level of those utilized for the Spanish Reconquista, and are not even close to being politically viable yet. Six years ago, I was warning you about this. Now the likes of Stanley Greenberg and Mitch Daniels are doing the same.\nYou have about 12-15 years to prepare for this now, possibly less, in my estimation.",
  "tags": [
    "war"
  ],
  "categories": [],
  "sitemap_lastmod": "2018-05-30T13:02:39+00:00"
}