{
  "url": "https://voxday.net/2018/05/09/neoconnery-2-0/",
  "scraped_at": "2025-12-19T21:01:14.326751",
  "title": "Neoconnery 2.0",
  "date_display": "May 9, 2018",
  "date_iso": "2018-05-09T15:23:55+00:00",
  "date_from_url": "2018-05-09",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>Ron Unz reacts to <i>The New York Times’s</i> announcement of its list of approved Fake Opposition members. He is, to put it mildly, <a href=\"http://www.unz.com/isteve/nyt-meet-the-renegades-of-the-intellectual-dark-web/#comment-2322160\">unimpressed</a>.</p><blockquote><p>Ha, ha, ha… Offhand it looks like something from this week’s forthcoming NYT Magazine, which I always prefer to read in hard-copy. But I glanced over it, and found it very, very amusing.</p><p>I was at least somewhat familiar with most of the names, and basically all the “Renegade Intellectuals of the Dark Web” described seem like semi-establishment Neocons. It’s a little like portraying Marco Rubio as a populist-insurgent Republican.</p><p>The author, Bari Weiss, is some WSJ Neocon who recently moved over to the NYT, and she’s presumably trying to rebrand some of her fellow Neocons as radical-rightists, thus giving them more appeal to the Daily Stormer crowd. Also, that way future conservative debates can include everyone from Neocon A to Neocon Z.</p><p>As an example, one of the most prominent figures is some YouTube psychology celebrity named Jordan Peterson, who first came to my attention when David Brooks described him as perhaps the most important intellectual in America or something like that. I guess that makes Brooks a “renegade intellectual” himself.</p><p>I think their “darkest” belief is that there might possibly exist *some* biological differences between men and women. Horrors! And although he’s some sort of psych professor, Peterson is so remarkably ignorant of IQ issues that his recent thing is explaining that the reason Jews control Wall Street, Hollywood, and the US government is because of their astonishing brilliance. I recently needed to jump into a very long comment-thread <a href=\"http://www.unz.com/isteve/sailer-on-semitism-by-jonathan-weisman/#comment-2314406\">to set some facts straight</a>.</p><p>Here’s the way to think about it. Neocon Robert Kagan was a leading foreign policy figure in the George W. Bush Administration. Then when Obama swept in to totally reverse all Bush’s failed policies, a leading figure ended up being Neocon Victoria Nuland…Kagan’s *wife*</p><p>Back in the 1990s, I was quite friendly with the Neocons, and worked closely with them. I remember that Christina Hoff Summers was a leading Neocon feminist-critic back then, speaking at their conferences, and writing for their publications, and she seems to have kept that same role in the quarter century since.</p><p>But characterizing her as some member of a new “radical right,” locked out of the existing media landscape is just totally ridiculous.</p><p>Maybe the next step is to re-brand Heritage and AEI as the central organs of the rising anti-Establishment Right…</p></blockquote><p>The eyes, they roll. Even Jonah Goldberg, a card-carrying member of both NeverTrump and the previous Fake Opposition set, sees that this is nothing <a href=\"https://www.nationalreview.com/corner/intellectual-dark-web-bari-weiss/\">more than rehashed neoconnery</a>:</p><blockquote><p>Having read the essay twice, it seems to me this IDW thing isn’t actually an intellectual movement. It’s just a coalition of thinkers and journalists who happen to share a disdain for the keepers of the liberal orthodoxy. Weiss recounts a bunch of conversion tales where once-respected and iconoclastic liberal types run head-on into the groupthink or party line of the liberal establishment. They suddenly have a revelation about the enforced orthodoxy of their own side, and as they pull on these intellectual threads, they face blowback and reinforcement from unexpected places.</p><p>Where have we heard that before? Well, it’s the story of successive waves of neoconservatives in the 1960s and 1970s. It’s the story of former Communists — Burnham, Meyer, Eastman, et al. — who joined the founding generation of National Review. It’s the story Whittaker Chambers tells in Witness. It’s also the story of many of the progressive intellectuals who were disillusioned by the First World War. Are they exact parallels? Of course not — in part because these are different times. Irving Kristol famously said, “a neoconservative is a liberal who’s been mugged by reality.” New realities may create different muggings, but the pattern is awfully familiar. </p></blockquote></div>",
  "content_text": "Ron Unz reacts to\nThe New York Times’s\nannouncement of its list of approved Fake Opposition members. He is, to put it mildly,\nunimpressed\n.\nHa, ha, ha… Offhand it looks like something from this week’s forthcoming NYT Magazine, which I always prefer to read in hard-copy. But I glanced over it, and found it very, very amusing.\nI was at least somewhat familiar with most of the names, and basically all the “Renegade Intellectuals of the Dark Web” described seem like semi-establishment Neocons. It’s a little like portraying Marco Rubio as a populist-insurgent Republican.\nThe author, Bari Weiss, is some WSJ Neocon who recently moved over to the NYT, and she’s presumably trying to rebrand some of her fellow Neocons as radical-rightists, thus giving them more appeal to the Daily Stormer crowd. Also, that way future conservative debates can include everyone from Neocon A to Neocon Z.\nAs an example, one of the most prominent figures is some YouTube psychology celebrity named Jordan Peterson, who first came to my attention when David Brooks described him as perhaps the most important intellectual in America or something like that. I guess that makes Brooks a “renegade intellectual” himself.\nI think their “darkest” belief is that there might possibly exist *some* biological differences between men and women. Horrors! And although he’s some sort of psych professor, Peterson is so remarkably ignorant of IQ issues that his recent thing is explaining that the reason Jews control Wall Street, Hollywood, and the US government is because of their astonishing brilliance. I recently needed to jump into a very long comment-thread\nto set some facts straight\n.\nHere’s the way to think about it. Neocon Robert Kagan was a leading foreign policy figure in the George W. Bush Administration. Then when Obama swept in to totally reverse all Bush’s failed policies, a leading figure ended up being Neocon Victoria Nuland…Kagan’s *wife*\nBack in the 1990s, I was quite friendly with the Neocons, and worked closely with them. I remember that Christina Hoff Summers was a leading Neocon feminist-critic back then, speaking at their conferences, and writing for their publications, and she seems to have kept that same role in the quarter century since.\nBut characterizing her as some member of a new “radical right,” locked out of the existing media landscape is just totally ridiculous.\nMaybe the next step is to re-brand Heritage and AEI as the central organs of the rising anti-Establishment Right…\nThe eyes, they roll. Even Jonah Goldberg, a card-carrying member of both NeverTrump and the previous Fake Opposition set, sees that this is nothing\nmore than rehashed neoconnery\n:\nHaving read the essay twice, it seems to me this IDW thing isn’t actually an intellectual movement. It’s just a coalition of thinkers and journalists who happen to share a disdain for the keepers of the liberal orthodoxy. Weiss recounts a bunch of conversion tales where once-respected and iconoclastic liberal types run head-on into the groupthink or party line of the liberal establishment. They suddenly have a revelation about the enforced orthodoxy of their own side, and as they pull on these intellectual threads, they face blowback and reinforcement from unexpected places.\nWhere have we heard that before? Well, it’s the story of successive waves of neoconservatives in the 1960s and 1970s. It’s the story of former Communists — Burnham, Meyer, Eastman, et al. — who joined the founding generation of National Review. It’s the story Whittaker Chambers tells in Witness. It’s also the story of many of the progressive intellectuals who were disillusioned by the First World War. Are they exact parallels? Of course not — in part because these are different times. Irving Kristol famously said, “a neoconservative is a liberal who’s been mugged by reality.” New realities may create different muggings, but the pattern is awfully familiar.",
  "tags": [
    "cuckservative"
  ],
  "categories": [],
  "sitemap_lastmod": "2018-05-09T14:23:55+00:00"
}