{
  "url": "https://voxday.net/2018/05/19/should-have-known-better/",
  "scraped_at": "2025-12-19T21:02:53.734783",
  "title": "Should have known better",
  "date_display": "May 19, 2018",
  "date_iso": "2018-05-19T12:59:10+00:00",
  "date_from_url": "2018-05-19",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>Last year I made an exception to my “do not talk to the media” policy when a journalist who contributes to <i>Rolling Stone</i> and has a history of writing relatively fair and substantive stories contacted me about doing a story on Castalia House. We arranged to meet for lunch, and the interview was a reasonably free-ranging one that was not indicative of the usual “bad person du jour” hit piece. So, I felt that it went pretty well and that it would not be a repeat of the usual “isn’t it terrible that you are such an unrepentant badthinker” narrative.</p><p>Spacebunny, of course, knew better. I should have listened to her when she told me to just ignore this request like all the others.</p><p>Last week, the same journalist went to visit Chuck Dixon in the company of another journalist, who turned out to be Al Letson, <a href=\"https://www.revealnews.org/author/al-letson/\">the host of Reveal</a>, a public radio program and podcast <i>showcasing investigative stories</i>. They were not particularly interested in talking to Chuck about Arkhaven, about his books, about the comics industry, about how he “broke the Bat”, or about the fact that he is an industry legend, the most prolific comics writer of all time, who has been openly blackballed by Marvel. Instead, they were primarily interested in playing the “you’re really a bad person, aren’t you” prosecutorial game in support of the usual disqualify-and-discredit narrative for a story that is intended to run jointly in <i>Rolling Stone</i> and <i>National Public Radio</i>.</p><p>Apparently the straight story on Castalia House didn’t sell, because I received a request for a second interview from them yesterday. I declined the request, and informed them that if they require further support for their tedious narrative, they are certainly welcome to report that I literally feed SJWs to my Vile Faceless Minions and drink SJW blood while sitting on a pile of silvered SJW skulls and watching old newsreels of Mussolini. Let’s face it, that’s more accurate than anything they are likely to “report” now.</p><p>So, I will be returning to my previous policy of simply not talking to anyone in the mainstream media. Forget the nonexistent upside, there simply isn’t <i>any point</i> in doing so.<i> </i>One can get the same narrative, more or less, from Wikipedia and RationalWiki, if one so desires. And there is no shortage of books, blog posts, and videos from which one can ascertain my views and quote-mine my words.</p><p>Now, here is what may be a useful observation in case you do happen to make the mistake of talking to the media. The journalistic responsibility of a reporter or interviewer is to give you the opportunity to speak for yourself, in your own words. Contrary to what many of them appear to believe, they are <u>not</u> prosecutors or debate antagonists, so the moment that they start “pushing back”, cross-examining, or attempting to argue with you in any way, end the pseudo-interview and send them packing.</p><p>If a reporter wishes to publicly debate me as an equal on a level playing field, that’s fine. If a journalist wants review copies of a Castalia House book or an Arkhaven comic book, I’ll be happy to send a digital edition. I can’t prevent them from playing the “bad person du jour” game, but I will not participate in it.</p></div>",
  "content_text": "Last year I made an exception to my “do not talk to the media” policy when a journalist who contributes to\nRolling Stone\nand has a history of writing relatively fair and substantive stories contacted me about doing a story on Castalia House. We arranged to meet for lunch, and the interview was a reasonably free-ranging one that was not indicative of the usual “bad person du jour” hit piece. So, I felt that it went pretty well and that it would not be a repeat of the usual “isn’t it terrible that you are such an unrepentant badthinker” narrative.\nSpacebunny, of course, knew better. I should have listened to her when she told me to just ignore this request like all the others.\nLast week, the same journalist went to visit Chuck Dixon in the company of another journalist, who turned out to be Al Letson,\nthe host of Reveal\n, a public radio program and podcast\nshowcasing investigative stories\n. They were not particularly interested in talking to Chuck about Arkhaven, about his books, about the comics industry, about how he “broke the Bat”, or about the fact that he is an industry legend, the most prolific comics writer of all time, who has been openly blackballed by Marvel. Instead, they were primarily interested in playing the “you’re really a bad person, aren’t you” prosecutorial game in support of the usual disqualify-and-discredit narrative for a story that is intended to run jointly in\nRolling Stone\nand\nNational Public Radio\n.\nApparently the straight story on Castalia House didn’t sell, because I received a request for a second interview from them yesterday. I declined the request, and informed them that if they require further support for their tedious narrative, they are certainly welcome to report that I literally feed SJWs to my Vile Faceless Minions and drink SJW blood while sitting on a pile of silvered SJW skulls and watching old newsreels of Mussolini. Let’s face it, that’s more accurate than anything they are likely to “report” now.\nSo, I will be returning to my previous policy of simply not talking to anyone in the mainstream media. Forget the nonexistent upside, there simply isn’t\nany point\nin doing so.\nOne can get the same narrative, more or less, from Wikipedia and RationalWiki, if one so desires. And there is no shortage of books, blog posts, and videos from which one can ascertain my views and quote-mine my words.\nNow, here is what may be a useful observation in case you do happen to make the mistake of talking to the media. The journalistic responsibility of a reporter or interviewer is to give you the opportunity to speak for yourself, in your own words. Contrary to what many of them appear to believe, they are\nnot\nprosecutors or debate antagonists, so the moment that they start “pushing back”, cross-examining, or attempting to argue with you in any way, end the pseudo-interview and send them packing.\nIf a reporter wishes to publicly debate me as an equal on a level playing field, that’s fine. If a journalist wants review copies of a Castalia House book or an Arkhaven comic book, I’ll be happy to send a digital edition. I can’t prevent them from playing the “bad person du jour” game, but I will not participate in it.",
  "tags": [
    "media"
  ],
  "categories": [],
  "sitemap_lastmod": "2018-05-19T11:59:10+00:00"
}