{
  "url": "https://voxday.net/2018/05/01/skin-in-the-game/",
  "scraped_at": "2025-12-19T20:59:52.204475",
  "title": "Skin in the game",
  "date_display": "May 1, 2018",
  "date_iso": "2018-05-01T08:52:39+00:00",
  "date_from_url": "2018-05-01",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>Last week, I was asked how the Israelis regard the Diasporans and their refusal to join the rest of the Jewish nation. <a href=\"http://abuyehuda.com/2018/04/goodbye-jewish-american-busybodies/\">This post</a> by a Jew who lived for nearly 30 years in the USA before moving to Israel  is on the harsh side, but it generally sums up the contemptuous attitude of most of the Israelis I know:</p><blockquote><p>I want a divorce. Not from my wife, whom I love dearly, but from the liberal and progressive American Jewish community. From those American Jews who believe that they have a special right to judge and advise the state of Israel because their parents were Jewish…. Your Jewish DNA does not make you any more knowledgeable than anyone else, nor does it give you a greater stake in the Jewish state, unless you decide to accept the generous offer it has made to all Jews everywhere by its Law of Return.</p><p>The fact that you had a Bar or Bat Mitzvah does not mean that your piece in the Forward or your letter to the New York Times in which you explain why, as a Jew, you are traumatized by Israel’s efforts to defend her southern border, should be published any more than that of any other person’s.</p><p>Even the fact that at some point in your life you have experienced antisemitism doesn’t qualify you to talk about how Israel should behave toward her own antisemitic enemies. If antisemitism in the US is problem for you, there is always that Law of Return.</p><p>There is no reason that the pronouncements of “If Not Now” are any more worth listening to than those of the American Nazi Party. Peter Beinart isn’t a more authoritative source about Israel and the Arabs than David Duke just because he has a bigger nose.</p><p>The head of the Union for Reform Judaism, Rabbi Rick Jacobs, likes to talk about how the demands he makes of Israel are made out of “unconditional love,” because he wants to “repair it” according to his notion of tikkun olam. What he calls “love,” I call hypocrisy. He owns an apartment in Jerusalem. He should live in it, send his kids to be combat soldiers in the army, pay taxes, and learn to practice situational awareness when he walks the streets or gets on a bus. Then he can try to fix things here (he probably would still give wrong advice, but then at least he would suffer the consequences).</p></blockquote><p>It shouldn’t be surprising that the Israelis are little more inclined to put up with the eternal backseat-driving and unrequested tikkun-olaming of their nomadic kindred than anyone else is. The difference is that unlike most other nations, they aren’t hesitant to call out the Diasporans for their hypocrisy and their enmity-inspiring behaviors, especially since the latter tend to actively damage Israel’s standing in the world.</p><p>For example, attempting to eliminate the First Amendment rights of Americans in the name of slowing down the BDS movement is a <i>horrifically </i>bad idea. There are few things more likely to lead to the USA cutting off all foreign aid to Israel; even the most philosemitic Christian Zionist is not going to legally amputate his own tongue for Israel.</p><p>Anyhow, this is the sort of thing that NN Taleb means when he talks about the importance of skin in the game; it is a very clear example of how those with skin in the game are always disinclined to respect or pay any attention to those who lack it.</p></div>",
  "content_text": "Last week, I was asked how the Israelis regard the Diasporans and their refusal to join the rest of the Jewish nation.\nThis post\nby a Jew who lived for nearly 30 years in the USA before moving to Israel  is on the harsh side, but it generally sums up the contemptuous attitude of most of the Israelis I know:\nI want a divorce. Not from my wife, whom I love dearly, but from the liberal and progressive American Jewish community. From those American Jews who believe that they have a special right to judge and advise the state of Israel because their parents were Jewish…. Your Jewish DNA does not make you any more knowledgeable than anyone else, nor does it give you a greater stake in the Jewish state, unless you decide to accept the generous offer it has made to all Jews everywhere by its Law of Return.\nThe fact that you had a Bar or Bat Mitzvah does not mean that your piece in the Forward or your letter to the New York Times in which you explain why, as a Jew, you are traumatized by Israel’s efforts to defend her southern border, should be published any more than that of any other person’s.\nEven the fact that at some point in your life you have experienced antisemitism doesn’t qualify you to talk about how Israel should behave toward her own antisemitic enemies. If antisemitism in the US is problem for you, there is always that Law of Return.\nThere is no reason that the pronouncements of “If Not Now” are any more worth listening to than those of the American Nazi Party. Peter Beinart isn’t a more authoritative source about Israel and the Arabs than David Duke just because he has a bigger nose.\nThe head of the Union for Reform Judaism, Rabbi Rick Jacobs, likes to talk about how the demands he makes of Israel are made out of “unconditional love,” because he wants to “repair it” according to his notion of tikkun olam. What he calls “love,” I call hypocrisy. He owns an apartment in Jerusalem. He should live in it, send his kids to be combat soldiers in the army, pay taxes, and learn to practice situational awareness when he walks the streets or gets on a bus. Then he can try to fix things here (he probably would still give wrong advice, but then at least he would suffer the consequences).\nIt shouldn’t be surprising that the Israelis are little more inclined to put up with the eternal backseat-driving and unrequested tikkun-olaming of their nomadic kindred than anyone else is. The difference is that unlike most other nations, they aren’t hesitant to call out the Diasporans for their hypocrisy and their enmity-inspiring behaviors, especially since the latter tend to actively damage Israel’s standing in the world.\nFor example, attempting to eliminate the First Amendment rights of Americans in the name of slowing down the BDS movement is a\nhorrifically\nbad idea. There are few things more likely to lead to the USA cutting off all foreign aid to Israel; even the most philosemitic Christian Zionist is not going to legally amputate his own tongue for Israel.\nAnyhow, this is the sort of thing that NN Taleb means when he talks about the importance of skin in the game; it is a very clear example of how those with skin in the game are always disinclined to respect or pay any attention to those who lack it.",
  "tags": [
    "philosophy"
  ],
  "categories": [],
  "sitemap_lastmod": "2018-05-01T07:52:39+00:00"
}