{
  "url": "https://voxday.net/2018/05/10/stay-away-from-the-math-jordan/",
  "scraped_at": "2025-12-19T21:01:17.977580",
  "title": "Stay away from the math, Jordan",
  "date_display": "May 10, 2018",
  "date_iso": "2018-05-10T01:37:16+00:00",
  "date_from_url": "2018-05-10",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>My original meme about the man was spot on. Jordan Peterson reports that <a href=\"https://www.youtube.com/watch?v=vnrEwtuYrpU&amp;feature=youtu.be\">his quantitative IQ is between 108 and 123</a>:</p><blockquote class=\"tr_bq\"><p>I don’t know what my IQ is. I had it tested at one point; it’s in excess of a hundred and fifty, but I don’t know exactly where it lands now. I should, I should, what, qualify that to some degree, you know, as your intelligence increases, the scatter between the different subtypes of intelligence such as there are, there are, increases, so you might say that there’s only one way to be stupid but there’s many ways to be intelligent, and so I’m not overwhelmingly intelligent from a quantitative perspective. You know, I think my GRE scores for on the quantitative end of things for about 70, 75th percentile, which isn’t too bad given that you know you’re competing against other people who are going into graduate school, but there’s a big difference between 75th percentile and 99th percentile, and I think that’s where it was verbally, something like that, so I can certainly see that I have gaps in my intelligence when when I’m discussing things with people who have real, who are really quantitatively brilliant.</p></blockquote><p>You might want to keep this admission in mind when contemplating <a href=\"http://voxday.blogspot.com/2018/04/the-myth-of-jordan-petersons-integrity.html\">my original point of contention</a> with the man. My verbal and math SAT scores were very similar, both in the 99th percentile, so while it is certainly not impossible for me to make a mathematical or statistical mistake, the fact that Jordan Peterson has demonstrated himself to be unable to grasp the way in which an excessively high mean on the part of one subset of the population <i>absolutely necessitates</i> an excessively low mean for the majority of the population given the known average for the entire population may be, at least in part, the result of the man being quantitatively challenged.</p><p>On the other hand, I would tend to think that even a quantitative IQ of 108 would be sufficient to grasp what is, after all, a very simple mathematical relationship that dictates an intrinsic tradeoff. But I wouldn’t know.</p></div>",
  "content_text": "My original meme about the man was spot on. Jordan Peterson reports that\nhis quantitative IQ is between 108 and 123\n:\nI don’t know what my IQ is. I had it tested at one point; it’s in excess of a hundred and fifty, but I don’t know exactly where it lands now. I should, I should, what, qualify that to some degree, you know, as your intelligence increases, the scatter between the different subtypes of intelligence such as there are, there are, increases, so you might say that there’s only one way to be stupid but there’s many ways to be intelligent, and so I’m not overwhelmingly intelligent from a quantitative perspective. You know, I think my GRE scores for on the quantitative end of things for about 70, 75th percentile, which isn’t too bad given that you know you’re competing against other people who are going into graduate school, but there’s a big difference between 75th percentile and 99th percentile, and I think that’s where it was verbally, something like that, so I can certainly see that I have gaps in my intelligence when when I’m discussing things with people who have real, who are really quantitatively brilliant.\nYou might want to keep this admission in mind when contemplating\nmy original point of contention\nwith the man. My verbal and math SAT scores were very similar, both in the 99th percentile, so while it is certainly not impossible for me to make a mathematical or statistical mistake, the fact that Jordan Peterson has demonstrated himself to be unable to grasp the way in which an excessively high mean on the part of one subset of the population\nabsolutely necessitates\nan excessively low mean for the majority of the population given the known average for the entire population may be, at least in part, the result of the man being quantitatively challenged.\nOn the other hand, I would tend to think that even a quantitative IQ of 108 would be sufficient to grasp what is, after all, a very simple mathematical relationship that dictates an intrinsic tradeoff. But I wouldn’t know.",
  "tags": [
    "Jordanetics"
  ],
  "categories": [],
  "sitemap_lastmod": "2018-05-10T00:37:16+00:00"
}