{
  "url": "https://voxday.net/2018/05/08/taken-out-of-contexts/",
  "scraped_at": "2025-12-19T21:00:56.389463",
  "title": "Taken out of contexts",
  "date_display": "May 8, 2018",
  "date_iso": "2018-05-08T11:00:16+00:00",
  "date_from_url": "2018-05-08",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>This defense of Jordan Peterson is very typical of the other attempted defenses of the man and his philosophy that I have seen. From a comment on the <i><a href=\"https://www.youtube.com/watch?v=dkBY8eLBp-0\">Darkstream: The Core Purpose of Jordan Peterson</a></i>.</p><blockquote><p>That is completely taken out of contexts. Hes encouraging people to clean up there act. The first step is stop doing things you know to be wrong.  Hes encouraging you not to get mixed up in philosophy of weather or not something is actual wrong because you can end up justifying anything. He says in starting out this process you can use your own standard (although he strongly emphasizes looking at tradition) to guide you in stopping the actions you know you shouldn’t do.</p><p>The “.Perhaps you will then see that if all people did this, in their own lives, the world might stop being an evil place.” comes way later on the page and doesn’t directly follow the “use your own standard” line Vox is quoting. That quote is suggesting if people stooped lying and started taking care of what is right in front of them and fulfilled there responsibility’s to one another then the world might be better. Not “If everyone does what makes them happy everything would be great”</p><p>That is so against Peterson’s world view its not even funny. Vox is deliberately miss-characterizing and slandering Peterson.﻿</p></blockquote><p>Oh, is that so? Well then, let’s read what Peterson actually wrote, in full. The quote I selected and correctly indicated I left out a section of text with ellipses is in bold.</p><blockquote><p><b>You can use your own standards of judgment. You can rely on yourself for guidance. You don’t have to adhere to some external, arbitrary code of behaviour</b> (although you should not overlook the guidelines of your culture. Life is short, and you don’t have time to figure everything out on your own. The wisdom of the past was hard-earned, and your dead ancestors may have something useful to tell you).</p><p>Don’t blame capitalism, the radical left, or the iniquity of your enemies. Don’t reorganize the state until you have ordered your own experience. Have some humility. If you cannot bring peace to your household, how dare you try to rule a city? Let your own soul guide you. Watch what happens over the days and weeks. When you are at work you will begin to say what you really think. You will start to tell your wife, or your husband, or your children, or your parents, what you really want and need. When you know that you have left something undone, you will act to correct the omission. Your head will start to clear up, as you stop filling it with lies. Your experience will improve, as you stop distorting it with inauthentic actions. You will then begin to discover new, more subtle things that you are doing wrong. Stop doing those, too. After some months and years of diligent effort, your life will become simpler and less complicated. Your judgment will improve. You will untangle your past. You will become stronger and less bitter. You will move more confidently into the future. You will stop making your life unnecessarily difficult. You will then be left with the inevitable bare tragedies of life, but they will no longer be compounded with bitterness and deceit.</p><p>Perhaps you will discover that your now less-corrupted soul, much stronger than it might otherwise have been, is now able to bear those remaining, necessary, minimal, inescapable tragedies. Perhaps you will even learn to encounter them so that they stay tragic—merely tragic—instead of degenerating into outright hellishness. Maybe your anxiety, and hopelessness, and resentment, and anger—however murderous, initially—will recede. Perhaps your uncorrupted soul will then see its existence as a genuine good, as something to celebrate, even in the face of your own vulnerability. Perhaps you will become an ever-more-powerful force for peace and whatever is good.</p><p><b>Perhaps you will then see that if all people did this, in their own lives, the world might stop being an evil place.</b> After that, with continued effort, perhaps it could even stop being a tragic place. Who knows what existence might be like if we all decided to strive for the best? Who knows what eternal heavens might be established by our spirits, purified by truth, aiming skyward, right here on the fallen Earth?</p></blockquote></div>",
  "content_text": "This defense of Jordan Peterson is very typical of the other attempted defenses of the man and his philosophy that I have seen. From a comment on the\nDarkstream: The Core Purpose of Jordan Peterson\n.\nThat is completely taken out of contexts. Hes encouraging people to clean up there act. The first step is stop doing things you know to be wrong.  Hes encouraging you not to get mixed up in philosophy of weather or not something is actual wrong because you can end up justifying anything. He says in starting out this process you can use your own standard (although he strongly emphasizes looking at tradition) to guide you in stopping the actions you know you shouldn’t do.\nThe “.Perhaps you will then see that if all people did this, in their own lives, the world might stop being an evil place.” comes way later on the page and doesn’t directly follow the “use your own standard” line Vox is quoting. That quote is suggesting if people stooped lying and started taking care of what is right in front of them and fulfilled there responsibility’s to one another then the world might be better. Not “If everyone does what makes them happy everything would be great”\nThat is so against Peterson’s world view its not even funny. Vox is deliberately miss-characterizing and slandering Peterson.﻿\nOh, is that so? Well then, let’s read what Peterson actually wrote, in full. The quote I selected and correctly indicated I left out a section of text with ellipses is in bold.\nYou can use your own standards of judgment. You can rely on yourself for guidance. You don’t have to adhere to some external, arbitrary code of behaviour\n(although you should not overlook the guidelines of your culture. Life is short, and you don’t have time to figure everything out on your own. The wisdom of the past was hard-earned, and your dead ancestors may have something useful to tell you).\nDon’t blame capitalism, the radical left, or the iniquity of your enemies. Don’t reorganize the state until you have ordered your own experience. Have some humility. If you cannot bring peace to your household, how dare you try to rule a city? Let your own soul guide you. Watch what happens over the days and weeks. When you are at work you will begin to say what you really think. You will start to tell your wife, or your husband, or your children, or your parents, what you really want and need. When you know that you have left something undone, you will act to correct the omission. Your head will start to clear up, as you stop filling it with lies. Your experience will improve, as you stop distorting it with inauthentic actions. You will then begin to discover new, more subtle things that you are doing wrong. Stop doing those, too. After some months and years of diligent effort, your life will become simpler and less complicated. Your judgment will improve. You will untangle your past. You will become stronger and less bitter. You will move more confidently into the future. You will stop making your life unnecessarily difficult. You will then be left with the inevitable bare tragedies of life, but they will no longer be compounded with bitterness and deceit.\nPerhaps you will discover that your now less-corrupted soul, much stronger than it might otherwise have been, is now able to bear those remaining, necessary, minimal, inescapable tragedies. Perhaps you will even learn to encounter them so that they stay tragic—merely tragic—instead of degenerating into outright hellishness. Maybe your anxiety, and hopelessness, and resentment, and anger—however murderous, initially—will recede. Perhaps your uncorrupted soul will then see its existence as a genuine good, as something to celebrate, even in the face of your own vulnerability. Perhaps you will become an ever-more-powerful force for peace and whatever is good.\nPerhaps you will then see that if all people did this, in their own lives, the world might stop being an evil place.\nAfter that, with continued effort, perhaps it could even stop being a tragic place. Who knows what existence might be like if we all decided to strive for the best? Who knows what eternal heavens might be established by our spirits, purified by truth, aiming skyward, right here on the fallen Earth?",
  "tags": [
    "mailvox"
  ],
  "categories": [],
  "sitemap_lastmod": "2018-05-08T10:00:16+00:00"
}