{
  "url": "https://voxday.net/2018/05/25/that-answers-that-question/",
  "scraped_at": "2025-12-19T21:03:50.705797",
  "title": "That answers that question",
  "date_display": "May 25, 2018",
  "date_iso": "2018-05-25T15:52:31+00:00",
  "date_from_url": "2018-05-25",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>In case you ever wondered what would happen if Yui and Moa mastered their guitars and started their own rock band.</p><div style=\"text-align: center;\"><iframe allow=\"autoplay; encrypted-media\" allowfullscreen=\"\" frameborder=\"0\" height=\"284\" src=\"https://www.youtube.com/embed/xmxEuQXTHUU\" width=\"512\"></iframe></div><p>The remarkable thing is the way these young women, intentionally or not, are utterly destroying so many Western feminist notions. There is a subversive element, of course – how could there not be – but they don’t have to make themselves ugly or emasculate men or destroy tradition in order to become successful or attract attention. And they’re each about one thousand times cooler than the Gothiest Goth-chick that ever dyed her hair or thought she was a witch.</p><p>The band’s founder, the rhythm guitarist and backing vocalist, Miku, is clearly a marketing genius. Observe the way in which she has surrounded herself with four musicians who are clearly much better than she is. And if you don’t think they are actually playing the instruments themselves, well, <a href=\"https://youtu.be/i1Sg8hlYz4A\">that’s plainly not the case</a>.</p><p>They’re either becoming pretty good pop songwriters or they have assembled a solid songwriting crew that suits them nicely. <a href=\"https://youtu.be/RCaeUkrItyY\">Daydreaming</a> is a well-written, wistful, 90’s rock-style song that is considerably better than anything Taylor Swift or Rihanna are putting out these days. <a href=\"https://youtu.be/axF56i4spio\">Alone</a> has a serious Lostprophets vibe to it, only without, you know, the pedophilia.</p></div>",
  "content_text": "In case you ever wondered what would happen if Yui and Moa mastered their guitars and started their own rock band.\nThe remarkable thing is the way these young women, intentionally or not, are utterly destroying so many Western feminist notions. There is a subversive element, of course – how could there not be – but they don’t have to make themselves ugly or emasculate men or destroy tradition in order to become successful or attract attention. And they’re each about one thousand times cooler than the Gothiest Goth-chick that ever dyed her hair or thought she was a witch.\nThe band’s founder, the rhythm guitarist and backing vocalist, Miku, is clearly a marketing genius. Observe the way in which she has surrounded herself with four musicians who are clearly much better than she is. And if you don’t think they are actually playing the instruments themselves, well,\nthat’s plainly not the case\n.\nThey’re either becoming pretty good pop songwriters or they have assembled a solid songwriting crew that suits them nicely.\nDaydreaming\nis a well-written, wistful, 90’s rock-style song that is considerably better than anything Taylor Swift or Rihanna are putting out these days.\nAlone\nhas a serious Lostprophets vibe to it, only without, you know, the pedophilia.",
  "tags": [
    "music"
  ],
  "categories": [],
  "sitemap_lastmod": "2018-05-25T14:52:31+00:00"
}