{
  "url": "https://voxday.net/2018/05/09/the-current-state-of-the-idf/",
  "scraped_at": "2025-12-19T21:01:16.146869",
  "title": "The current state of the IDF",
  "date_display": "May 9, 2018",
  "date_iso": "2018-05-09T15:28:52+00:00",
  "date_from_url": "2018-05-09",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p><a href=\"http://www.martin-van-creveld.com/the-israeli-army/\">This recent interview</a> of military historian and Castalia House author Martin van Creveld by a French magazine is particularly interesting in light of <a href=\"https://www.timesofisrael.com/alleged-israeli-strike-reported-in-syria-after-idf-sounds-alarm-in-north/\">the recent Israeli airstrike</a> on Syria, to which Iran has <a href=\"https://www.rt.com/news/426188-iran-israel-security-threats-syria/\">threatened to respond</a>. Read the whole thing <a href=\"http://www.martin-van-creveld.com/the-israeli-army/\">there</a>.</p><blockquote><p><b>Can you give us an overview of the actual situation of the Israeli armed forces?</b></p><p>One could argue that, taking a grand strategic perspective and starting with the establishment of the State of Israel seventy years ago, some things have not changed very much. First, the Israel Defense Forces (IDF) remain the armed organization of a democratic country, one in which it is the politicians who decide and the military which obeys. Second, the objective of the IDF was and remains to defend the country, <i>a outrance</i> if necessary, against any military threats that may confront it. Third, Israel remains in a state of war with several other Middle Eastern countries; nor is there any way in the world it can bring the conflict to an end by defeating them and compelling them to make peace against their will. Fourth, the occupation of the West Bank and the Golan Heights notwithstanding, Israel remains a small country with very little strategic depth. Fifth, the lack of strategic depth implies a heavy reliance on intelligence to detect threats before they materialize. Sixth, and for the same reason, Israeli military doctrine remains basically offensive, with a strong emphasis on destroying the opposing armed forces.</p><p><b>In its short history, the State of Israel often fought and won wars in which it was outnumbered and trapped: is this because of its only technological superiority or is there also a strategic and tactical factor? </b></p><p>Starting in 1948 and ending with the 1973 war inclusive, the most important factor behind Israel’s victories has always been the quality of its troops. Both in terms of education—Israel, unlike its enemies, is not a third-world country but a first-world one with educational, technological and scientific facilities to match. And—which is more critical still—in terms of motivation and fighting morale.</p><p>After 1973, and especially the 1982 First Lebanon War, things began to change. Education, technical skills and scientific development continued to improve, turning this a nation of less than eight million people into a world center of military (and not just military) innovation. There are, however, some signs that, as some of its former enemies concluded peace with it and its own military superiority came to be taken for granted, motivation suffered. To this was added the need to combat terrorists in Gaza and the West Bank—the kind of operations that contribute nothing to overall fighting effectiveness and and even detract from it.</p><p><b>Can the logistic organization represent a decisive factor – militarily -?</b></p><p>Logistics, it has been said, is “that which, if you do not have enough of, the war will not be won as soon as.” As recently as the Second Lebanon War against Hezbollah in 2006, so heavy was expenditure of air-to-surface missiles and other precision-guided munitions that the IDF had to apply for US aid even as hostilities were going on. This situation which has its origins in budget constraints, may well recur.</p><p>Furthermore, in all its wars from 1948 on the IDF has enjoyed near-absolute command of the air. As a result, it was able to attack enemy lines of supply whereas the enemy was unable to do the same. The buildup of reliable and accurate surface-to-surface missiles in the hands of Hezbollah, Syria and Iran may very well change this situation, causing supply bases and ammunition dumps, as well as communications-junctions and even convoys on the move to come under attack. This scenario, which is not at all imaginary, is currently giving the General Staff a lot of headaches.</p><p><b>We know that the intelligence is the decisive element to ensure strength to Israeli Armed Forces: can you explain what is this strength?</b></p><p>Israeli technological, tactical and operational intelligence has always been very good. Two factors help account for this fact. First, there exists in Israel a large community of first-class experts (known as Mizrahanim, “Easterners” who know the countries of the Middle East, their language, culture, traditions, history, and so forth as well as anyone does. Many members of this community spend their periods of reserve duty with the IDF intelligence apparatus.</p><p>Second, modern intelligence rests on electronics, especially various kinds of sensors and computers. As the famous Unit 8200 shows, these are fields where nobody excels the IDF. Nobody.</p><p>That said, it is important to add that Israeli top-level strategic and political intelligence is nowhere as good as it is on the lower levels. Starting at least as early as 1955, and reaching all the way to the present, IDF intelligence has often failed to predict some of the most important events. That included the 1967 war, the 1973 War, the 1987 Palestinian Uprising, the 1991 Gulf War, the “Arab Spring,” and the outbreak of the 2011 Syrian Civil War.</p><p><b>Compared to its actual friends, which are its strengths and weaknesses from a military point of view?</b></p><p>As I said, strengths include a well-educated and highly skilled society, excellent technology, and vast experience in fighting various enemies (though some of that experience is now dated). The chief weaknesses remain the country’s relatively small size and lack of strategic depth—Iran, for example, is eighty times as large as Israel. Perhaps most important of all, there is reason to think that motivation, though much higher than in the NATO countries, is no longer what it used to be.</p><p><b>If the situation between Israel and Iran (or Hezbollah in Lebanon) comes to a showdown, which could be the reactions of some States as Turkey, Syria, Russia, Saudi Arabia, Egypt or USA?</b></p><p>Hard to say. Iran will use Syria as a forward base for fighting Israel. Assuming the regime stays, Saudi Arabia will probably retain its ties with Israel, at least unofficially. Ditto Egypt. Turkey will probably not engage in a shooting war with Israel, but it will support an anti-Israeli coalition in other ways while at the same time fighting the Syrians (and the Kurds). Russia will try to support Hezbollah and Syria, but without becoming deeply involved. The US on its part will support Israel <strike>and </strike>against Hezbollah, but without directly taking on the Russians.</p></blockquote><p>In short, while Israel remains stronger than its enemies, its strategic position has weakened somewhat since it became the primary regional power in the 1980s. It cannot defeat Iran or Turkey the way it defeated Egypt, Jordan, and Syria, and its two primary non-nuclear advantages – air supremacy and troop quality – have declined over time. It is also aware that its regional monopoly on nuclear weapons has a time limit.</p><p>From the Game Theory perspective, this would tend to indicate that another Middle Eastern war is likely sooner rather than later, because the trends suggest the odds of Israeli success are greater now than they will be in the future, especially given the fact that an Israel-friendly US President is now in office following an Arab-friendly one. Of course, since people in general, and politicians in particular, are not logical, and have a natural tendency to want to put off until tomorrow things that can more profitably be addressed today, that does not mean logic will dictate events.</p><p>UPDATE: I checked with Martin to clarify what appeared to be a typo, and he confirmed that he did mean the US supporting Israel AGAINST Hezbollah.</p></div>",
  "content_text": "This recent interview\nof military historian and Castalia House author Martin van Creveld by a French magazine is particularly interesting in light of\nthe recent Israeli airstrike\non Syria, to which Iran has\nthreatened to respond\n. Read the whole thing\nthere\n.\nCan you give us an overview of the actual situation of the Israeli armed forces?\nOne could argue that, taking a grand strategic perspective and starting with the establishment of the State of Israel seventy years ago, some things have not changed very much. First, the Israel Defense Forces (IDF) remain the armed organization of a democratic country, one in which it is the politicians who decide and the military which obeys. Second, the objective of the IDF was and remains to defend the country,\na outrance\nif necessary, against any military threats that may confront it. Third, Israel remains in a state of war with several other Middle Eastern countries; nor is there any way in the world it can bring the conflict to an end by defeating them and compelling them to make peace against their will. Fourth, the occupation of the West Bank and the Golan Heights notwithstanding, Israel remains a small country with very little strategic depth. Fifth, the lack of strategic depth implies a heavy reliance on intelligence to detect threats before they materialize. Sixth, and for the same reason, Israeli military doctrine remains basically offensive, with a strong emphasis on destroying the opposing armed forces.\nIn its short history, the State of Israel often fought and won wars in which it was outnumbered and trapped: is this because of its only technological superiority or is there also a strategic and tactical factor?\nStarting in 1948 and ending with the 1973 war inclusive, the most important factor behind Israel’s victories has always been the quality of its troops. Both in terms of education—Israel, unlike its enemies, is not a third-world country but a first-world one with educational, technological and scientific facilities to match. And—which is more critical still—in terms of motivation and fighting morale.\nAfter 1973, and especially the 1982 First Lebanon War, things began to change. Education, technical skills and scientific development continued to improve, turning this a nation of less than eight million people into a world center of military (and not just military) innovation. There are, however, some signs that, as some of its former enemies concluded peace with it and its own military superiority came to be taken for granted, motivation suffered. To this was added the need to combat terrorists in Gaza and the West Bank—the kind of operations that contribute nothing to overall fighting effectiveness and and even detract from it.\nCan the logistic organization represent a decisive factor – militarily -?\nLogistics, it has been said, is “that which, if you do not have enough of, the war will not be won as soon as.” As recently as the Second Lebanon War against Hezbollah in 2006, so heavy was expenditure of air-to-surface missiles and other precision-guided munitions that the IDF had to apply for US aid even as hostilities were going on. This situation which has its origins in budget constraints, may well recur.\nFurthermore, in all its wars from 1948 on the IDF has enjoyed near-absolute command of the air. As a result, it was able to attack enemy lines of supply whereas the enemy was unable to do the same. The buildup of reliable and accurate surface-to-surface missiles in the hands of Hezbollah, Syria and Iran may very well change this situation, causing supply bases and ammunition dumps, as well as communications-junctions and even convoys on the move to come under attack. This scenario, which is not at all imaginary, is currently giving the General Staff a lot of headaches.\nWe know that the intelligence is the decisive element to ensure strength to Israeli Armed Forces: can you explain what is this strength?\nIsraeli technological, tactical and operational intelligence has always been very good. Two factors help account for this fact. First, there exists in Israel a large community of first-class experts (known as Mizrahanim, “Easterners” who know the countries of the Middle East, their language, culture, traditions, history, and so forth as well as anyone does. Many members of this community spend their periods of reserve duty with the IDF intelligence apparatus.\nSecond, modern intelligence rests on electronics, especially various kinds of sensors and computers. As the famous Unit 8200 shows, these are fields where nobody excels the IDF. Nobody.\nThat said, it is important to add that Israeli top-level strategic and political intelligence is nowhere as good as it is on the lower levels. Starting at least as early as 1955, and reaching all the way to the present, IDF intelligence has often failed to predict some of the most important events. That included the 1967 war, the 1973 War, the 1987 Palestinian Uprising, the 1991 Gulf War, the “Arab Spring,” and the outbreak of the 2011 Syrian Civil War.\nCompared to its actual friends, which are its strengths and weaknesses from a military point of view?\nAs I said, strengths include a well-educated and highly skilled society, excellent technology, and vast experience in fighting various enemies (though some of that experience is now dated). The chief weaknesses remain the country’s relatively small size and lack of strategic depth—Iran, for example, is eighty times as large as Israel. Perhaps most important of all, there is reason to think that motivation, though much higher than in the NATO countries, is no longer what it used to be.\nIf the situation between Israel and Iran (or Hezbollah in Lebanon) comes to a showdown, which could be the reactions of some States as Turkey, Syria, Russia, Saudi Arabia, Egypt or USA?\nHard to say. Iran will use Syria as a forward base for fighting Israel. Assuming the regime stays, Saudi Arabia will probably retain its ties with Israel, at least unofficially. Ditto Egypt. Turkey will probably not engage in a shooting war with Israel, but it will support an anti-Israeli coalition in other ways while at the same time fighting the Syrians (and the Kurds). Russia will try to support Hezbollah and Syria, but without becoming deeply involved. The US on its part will support Israel\nand\nagainst Hezbollah, but without directly taking on the Russians.\nIn short, while Israel remains stronger than its enemies, its strategic position has weakened somewhat since it became the primary regional power in the 1980s. It cannot defeat Iran or Turkey the way it defeated Egypt, Jordan, and Syria, and its two primary non-nuclear advantages – air supremacy and troop quality – have declined over time. It is also aware that its regional monopoly on nuclear weapons has a time limit.\nFrom the Game Theory perspective, this would tend to indicate that another Middle Eastern war is likely sooner rather than later, because the trends suggest the odds of Israeli success are greater now than they will be in the future, especially given the fact that an Israel-friendly US President is now in office following an Arab-friendly one. Of course, since people in general, and politicians in particular, are not logical, and have a natural tendency to want to put off until tomorrow things that can more profitably be addressed today, that does not mean logic will dictate events.\nUPDATE: I checked with Martin to clarify what appeared to be a typo, and he confirmed that he did mean the US supporting Israel AGAINST Hezbollah.",
  "tags": [
    "war"
  ],
  "categories": [],
  "sitemap_lastmod": "2018-05-09T14:28:52+00:00"
}