{
  "url": "https://voxday.net/2018/05/21/the-leopard-and-the-chickenhawk/",
  "scraped_at": "2025-12-19T21:03:06.584637",
  "title": "The Leopard and the Chickenhawk",
  "date_display": "May 21, 2018",
  "date_iso": "2018-05-21T08:41:36+00:00",
  "date_from_url": "2018-05-21",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><div style=\"text-align: center;\"><iframe allow=\"autoplay; encrypted-media\" allowfullscreen=\"\" frameborder=\"0\" height=\"283\" src=\"https://www.youtube.com/embed/hwf6FWEtX5Q\" width=\"512\"></iframe></div><p><i>A partial transcript of the Darkstream: <a href=\"https://youtu.be/hwf6FWEtX5Q\"><b>Ben Shapiro is a Swamp Creature</b></a></i></p><p>Something very significant has just happened, something with global ramifications has just happened, and what that is is that the United States has finally lost its perceived moral superiority. It has lost the perceived moral high ground that it possessed for most of the last 50 or 60 years.</p><p>We’ve been arguing for decades that the US system is better than the Chinese system, that it’s better than the Soviet Union, that it’s better than the other competing systems, in fact, that’s where Francis Fukuyama came up with this idea of the End of History. Because what the End of History meant is that the neo-liberal world order had triumphed finally, once and for all. Now, we know that’s not true, Fukuyama himself has been backtracking on on that just because he wants to maintain his intellectual credibility,  but what we’re seeing is that the United States system is just as corrupt as everywhere else.</p><p>You know I was reading a book called <i>Il Gattopardo</i> by an Italian writer and it’s a fascinating book because the author was a member of the Italian aristocracy himself, although he was writing about his grandfather who was a member of the Sicilian royal house, and what was fascinating to me, and what was very significant is the way that the unification vote in Sicily completely destroyed the faith of the Sicilian people of this particular town in the system because the guy who was conducting the vote falsified it. It was the very first chance they had to vote, they were voting on the unification of Italy which is called the Risorgimento, and all the different towns and and principalities and so forth were given the  opportunity to vote on unification. In that town, the vote was reported as unanimous even though a number of people voted no, and knew they voted no. And the prince is talking to his gamesman, who admitted that he had voted no, and the prince realizes that through that act of faithlessness, through that act of corruption, through that desire to present a united, unanimous front, the people conducting the vote had rendered the entire process corrupt and false.</p><p>And that’s exactly what has happened with the revelations that the FBI was using the swamp creature Stefan Halper to interfere with the most recent presidential election, to interfere in the 2016 election between Donald Trump and Hillary Clinton. But the damning thing the thing that is going to do, and is currently doing so much international damage are the revelations that Halper has been engaged in this activity since the Carter Administration.</p><div style=\"text-align: center;\">⸻</div><p>This is the passage from <i>Il Gattopardo</i>, by Giuseppe di Lampedusa, to which I referred with regards to the false reporting of the vote that took place in Donnafugata, and was reported by Don Calogero Sedara as 512 Yes, 0 No. Don Fabrizio, the Prince of Salina, smells a rat despite having voted yes to unification himself, and asks his ferociously loyal attendant, Don Ciccio, how he voted.</p><blockquote><p>The cool air had dispersed Don Ciccio’s somnolence and the massive grandeur of the Prince dispelled his fears; now all that remained afloat on the surface of Don Ciccio’s conscience was resentment, useless of course but not ignoble. He stood there, spoke in dialect, and gesticulated, a pathetic puppet who in some absurd way was right.</p><p>“I, Excellency, voted ‘no.’ ‘No,’ a hundred times ‘no.’ I know what you told me: necessity, unity, expediency. You may be right; I know nothing of politics. Such things I leave to others. But Ciccio Tumeo is honest, poor though he may be, with his trousers in holes” (and he slapped the carefully mended patches in his shooting breeches), “and I don’t forget favors done me! Those swine in the Town Hall just swallowed up my opinion, chewed it, and then spat it out transformed as they wanted. I said black and they made me say white! The one time when I could say what I thought, that bloodsucker Sedara went and annulled it, behaved as if I never existed, as if I never meant a thing! I, Francesco Tumeo La Manna, son of Leonardo, organist of the Mother Church at Donnafugata, a better man than he is! To think I’d even dedicated to him a mazurka I composed at the birth of that . . .” (he bit his thumb to rein himself in), “that mincing daughter of his! “</p><p>At this point calm descended on Don Fabrizio, who had finally solved the enigma; now he knew who had been killed at Donnafugata, at a hundred other places, in the course of that night of dirty wind: a new-born babe: good faith; just the very child who should have been cared for most, whose strengthening would have justified all the silly vandalisms. Don Ciccio’s negative vote, fifty similar votes at Donnafugata, a hundred thousand “nos” in the whole Kingdom, would have had no effect on the result, would in fact have made it, if anything, more significant; and this maiming of souls would have been avoided.</p><p>Six months before they used to hear a rough despotic voice saying, “Do what I say or you’ll catch it!” Now there was an impression already of such a threat being replaced by the soapy tones of a moneylender: “But you signed it yourself, didn’t you? Can’t you see? It’s quite clear. You must do as we say, for here are the I.O.U.s; your will is identical with mine.”</p><p>Don Fabrizio had always liked Don Ciccio, partly because of the compassion inspired in him by all who from youth had thought of themselves as dedicated to the arts, and in old age, realizing they had no talent, still carried on the same activity at lower levels, pocketing withered dreams; and he was also touched by the dignity of his poverty. But now he also felt a kind of admiration for him, and deep down at the very bottom of his proud conscience a voice was asking if Don Ciccio had not perhaps behaved more nobly than the Prince of Salina. And the Sedaras, all the various Sedaras, from the petty one who violated figures at Donnafugata to the major ones at Palermo and Turin, had they not committed a crime by choking such consciences?</p><p>Don Fabrizio could not know it then, but a great deal of the slackness and acquiescence for which the people of the South were to be criticized during the next decades was due to the stupid annulment of the first expression of liberty ever offered them.</p></blockquote></div>",
  "content_text": "A partial transcript of the Darkstream:\nBen Shapiro is a Swamp Creature\nSomething very significant has just happened, something with global ramifications has just happened, and what that is is that the United States has finally lost its perceived moral superiority. It has lost the perceived moral high ground that it possessed for most of the last 50 or 60 years.\nWe’ve been arguing for decades that the US system is better than the Chinese system, that it’s better than the Soviet Union, that it’s better than the other competing systems, in fact, that’s where Francis Fukuyama came up with this idea of the End of History. Because what the End of History meant is that the neo-liberal world order had triumphed finally, once and for all. Now, we know that’s not true, Fukuyama himself has been backtracking on on that just because he wants to maintain his intellectual credibility,  but what we’re seeing is that the United States system is just as corrupt as everywhere else.\nYou know I was reading a book called\nIl Gattopardo\nby an Italian writer and it’s a fascinating book because the author was a member of the Italian aristocracy himself, although he was writing about his grandfather who was a member of the Sicilian royal house, and what was fascinating to me, and what was very significant is the way that the unification vote in Sicily completely destroyed the faith of the Sicilian people of this particular town in the system because the guy who was conducting the vote falsified it. It was the very first chance they had to vote, they were voting on the unification of Italy which is called the Risorgimento, and all the different towns and and principalities and so forth were given the  opportunity to vote on unification. In that town, the vote was reported as unanimous even though a number of people voted no, and knew they voted no. And the prince is talking to his gamesman, who admitted that he had voted no, and the prince realizes that through that act of faithlessness, through that act of corruption, through that desire to present a united, unanimous front, the people conducting the vote had rendered the entire process corrupt and false.\nAnd that’s exactly what has happened with the revelations that the FBI was using the swamp creature Stefan Halper to interfere with the most recent presidential election, to interfere in the 2016 election between Donald Trump and Hillary Clinton. But the damning thing the thing that is going to do, and is currently doing so much international damage are the revelations that Halper has been engaged in this activity since the Carter Administration.\n⸻\nThis is the passage from\nIl Gattopardo\n, by Giuseppe di Lampedusa, to which I referred with regards to the false reporting of the vote that took place in Donnafugata, and was reported by Don Calogero Sedara as 512 Yes, 0 No. Don Fabrizio, the Prince of Salina, smells a rat despite having voted yes to unification himself, and asks his ferociously loyal attendant, Don Ciccio, how he voted.\nThe cool air had dispersed Don Ciccio’s somnolence and the massive grandeur of the Prince dispelled his fears; now all that remained afloat on the surface of Don Ciccio’s conscience was resentment, useless of course but not ignoble. He stood there, spoke in dialect, and gesticulated, a pathetic puppet who in some absurd way was right.\n“I, Excellency, voted ‘no.’ ‘No,’ a hundred times ‘no.’ I know what you told me: necessity, unity, expediency. You may be right; I know nothing of politics. Such things I leave to others. But Ciccio Tumeo is honest, poor though he may be, with his trousers in holes” (and he slapped the carefully mended patches in his shooting breeches), “and I don’t forget favors done me! Those swine in the Town Hall just swallowed up my opinion, chewed it, and then spat it out transformed as they wanted. I said black and they made me say white! The one time when I could say what I thought, that bloodsucker Sedara went and annulled it, behaved as if I never existed, as if I never meant a thing! I, Francesco Tumeo La Manna, son of Leonardo, organist of the Mother Church at Donnafugata, a better man than he is! To think I’d even dedicated to him a mazurka I composed at the birth of that . . .” (he bit his thumb to rein himself in), “that mincing daughter of his! “\nAt this point calm descended on Don Fabrizio, who had finally solved the enigma; now he knew who had been killed at Donnafugata, at a hundred other places, in the course of that night of dirty wind: a new-born babe: good faith; just the very child who should have been cared for most, whose strengthening would have justified all the silly vandalisms. Don Ciccio’s negative vote, fifty similar votes at Donnafugata, a hundred thousand “nos” in the whole Kingdom, would have had no effect on the result, would in fact have made it, if anything, more significant; and this maiming of souls would have been avoided.\nSix months before they used to hear a rough despotic voice saying, “Do what I say or you’ll catch it!” Now there was an impression already of such a threat being replaced by the soapy tones of a moneylender: “But you signed it yourself, didn’t you? Can’t you see? It’s quite clear. You must do as we say, for here are the I.O.U.s; your will is identical with mine.”\nDon Fabrizio had always liked Don Ciccio, partly because of the compassion inspired in him by all who from youth had thought of themselves as dedicated to the arts, and in old age, realizing they had no talent, still carried on the same activity at lower levels, pocketing withered dreams; and he was also touched by the dignity of his poverty. But now he also felt a kind of admiration for him, and deep down at the very bottom of his proud conscience a voice was asking if Don Ciccio had not perhaps behaved more nobly than the Prince of Salina. And the Sedaras, all the various Sedaras, from the petty one who violated figures at Donnafugata to the major ones at Palermo and Turin, had they not committed a crime by choking such consciences?\nDon Fabrizio could not know it then, but a great deal of the slackness and acquiescence for which the people of the South were to be criticized during the next decades was due to the stupid annulment of the first expression of liberty ever offered them.",
  "tags": [
    "politics"
  ],
  "categories": [],
  "sitemap_lastmod": "2018-05-21T07:41:36+00:00"
}