{
  "url": "https://voxday.net/2018/05/07/the-encyclopedia-of-jordanetics/",
  "scraped_at": "2025-12-19T21:00:49.029950",
  "title": "The encyclopedia of Jordanetics",
  "date_display": "May 7, 2018",
  "date_iso": "2018-05-07T01:02:01+00:00",
  "date_from_url": "2018-05-07",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>The great Umberto Eco unwittingly dismissed the incoherence of Jordanetics without even knowing Jordan Peterson was having nightmares about dogs walking on their hind legs, butchering his cousin and offering flesh to him and other survivors of a nuclear holocaust in <i>FROM THE TREE TO THE LABYRINTH: Historical Studies on the Sign and Interpretation</i>:</p><blockquote><p>While in an ideal encyclopedia there are no differences between necessary and contingent properties, it must be admitted that, within a specific culture, certain properties appear to be more resistant to negation than others, on account of the fact that they are more salient: it could feasibly be denied, for instance, in the light of a new system of classification, that a sheep is ovine, or again this particular trait might not be deemed necessary to the understanding of the term sheep in the sentence: “the sheep was bleating in the field.” There can be no doubt, however, that it is hard to deny that a sheep is an animal—and the characteristic also remains implicit for the comprehension of the example we just cited. It has also been observed (Violi 1997: sect. 2.2.2.3) that some traits seem to be more resistant than others, and that these uncancelable traits are not only categorical labels such as ANIMAL or PHYSICAL OBJECT. In the life of semiosis we realize that we are also reluctant to cancel some “factual” properties that appear more salient and characteristic than others.</p><p>To explain why certain properties appear more resistant than others, Violi (1997: sect. 7.2) distinguishes between essential and typical properties: it is essential that a cat be an animal; it is typical that it meows. The second property can be canceled, but not the first. But if this were to be the case we would be back again to the same old difference between dictionary and encyclopedic properties. Violi (1997: sect. 7.3.1.3) instead considers properties that are functional and certainly encyclopedic in nature to be similarly uncancelable: hence it is difficult to say of something that it is a box and at the same time deny that it can contain objects (if it couldn’t it would be a fake box).<br>Often, however, in order to construct and presuppose a local portion of encyclopedia needed for the comprehension of a determined context, we must resort to simplified local representations that set aside many properties that are otherwise (in other contexts) resistant.</br></p><p>In Eco (1984b: sect. 2.3.4) I gave the example of a dialogue between a wife and her husband at midnight in a suburban home. The wife looks out the window and says with a preoccupied air, “Honey, there’s a man in the garden.” The husband takes a look and says, “No, honey, that’s not a man.” The husband’s reaction certainly violates a pragmatic rule because it provides less information than the situation calls for, since denying the presence of a man could on the one hand suggest that what is there is a child or a cat, while on the other hand it could also lead his wife to imagine something more dangerous (why not an invader from outer space?).</p><p>In this context, when she is afraid there may be a man there, the wife surely does not assign to the term the properties of rationality, bipedality, or the ability to laugh—all properties that in that context are narcotized (cf. Eco 1979a: ch. 5) and considered irrelevant, but instead those of a living being, capable of movement and aggression and therefore potentially—at night and in someone else’s garden—dangerous. Because it is also part and parcel of the infinite encyclopedic properties of man to be prone to take up a life of crime (don’t we all know that homo homini lupus, man is a wolf to men?) The husband ought then to adjust his iteration on the basis of a local encyclopedic representation, one that he conjecturally considers shared (given the circumstances) by his wife.</p><p>If the husband wishes to calm his wife down he must either exclude immediately the property of mobility (by saying, for example, that what she saw was the shadow of a tree) or deny any suggestion of properties suggesting dangerousness (in which case he might say that it wasn’t a man but a stray dog). The ad hoc construction of a local portion of encyclopedia, that organizes only the properties pertinent to the context, is the only strategy that will allow the husband to interact in a reasonable way with his concerned wife.</p></blockquote><p>Jordanetics turns this sort of sensible pragmatism on its head. Consider how it applies to the situation envisioned by Eco. Since truth is determined by whether it serves life or not, the wife’s fear means that the claim that the object in the garden is a man must be true, since the mere possibility that the object is a man and therefore a potential risk to the man’s wife and family would serve life, whereas ignoring, denying, or rejecting that possibility, and by doing so, failing to accept the wife’s narrative, would not only not serve life and therefore be untrue, but would add unnecessarily to the suffering of the wife. Ergo, in the absence of conclusive proof that the object is not a man or otherwise dangerous entity such as an invader from space, it would be evil to do anything except accept the wife’s narrative and behave accordingly.</p><p>Notice too the logical consistency and the precision of Eco’s thought. Peterson’s <i>Maps of Meaning</i>, which I am reading now, reads like a parody of the legitimate academic and intellectual that Eco was, when it is not downright sinister.</p><blockquote><p>My interest in the Cold War transformed itself into a true obsession. I thought about the suicidal and murderous preparation of that war every minute of every day, from the moment I woke up until the second I went to bed. How could such a state of affairs come about? Who was responsible?</p><p>I dreamed that I was running through a mall parking lot, trying to escape from something. I was running through the parked cars, opening one door, crawling across the front seat, opening the other, moving to the next. The doors on one car suddenly slammed shut. I was in the passenger seat. The car started to move by itself. A voice said harshly, “there is no way out of here.” I was on a journey, going somewhere I did not want to go. I was not the driver.</p><p>I became very depressed and anxious. I had vaguely suicidal thoughts, but mostly wished that everything would just go away. I wanted to lie down on my couch, and sink into it, literally, until only my nose was showing—like the snorkel of a diver above the surface of the water. I found my awareness of things unbearable.</p><p>I came home late one night from a college drinking party, self-disgusted and angry. I took a canvas board and some paints. I sketched a harsh, crude picture of a crucified Christ—glaring and demonic—with a cobra wrapped around his naked waist, like a belt. The picture disturbed me—struck me, despite my agnosticism, as sacrilegious. I did not know what it meant, however, or why I had painted it. Where in the world had it come from?</p></blockquote><p>It should not be hard to see that Jordanetics is an incoherent philosophy of fear, concocted by a very fearful and mentally disturbed individual who is not the driver of it. And since we, as Christians, are not given a spirit of fear, Jordanetics is neither a theology nor a philosophy for us.</p><p><b>Research request: </b>Transcripts of Peterson videos would be very useful for a comprehensive deep dive into his philosophy. If you’re willing to transcribe a video for me, please shoot me an email with however many you’d be willing to do, keeping in mind that his lectures usually last around an hour, and I will give you a list. Don’t do any without getting a specific request from me, since we want to avoid redundancy.</p></div>",
  "content_text": "The great Umberto Eco unwittingly dismissed the incoherence of Jordanetics without even knowing Jordan Peterson was having nightmares about dogs walking on their hind legs, butchering his cousin and offering flesh to him and other survivors of a nuclear holocaust in\nFROM THE TREE TO THE LABYRINTH: Historical Studies on the Sign and Interpretation\n:\nWhile in an ideal encyclopedia there are no differences between necessary and contingent properties, it must be admitted that, within a specific culture, certain properties appear to be more resistant to negation than others, on account of the fact that they are more salient: it could feasibly be denied, for instance, in the light of a new system of classification, that a sheep is ovine, or again this particular trait might not be deemed necessary to the understanding of the term sheep in the sentence: “the sheep was bleating in the field.” There can be no doubt, however, that it is hard to deny that a sheep is an animal—and the characteristic also remains implicit for the comprehension of the example we just cited. It has also been observed (Violi 1997: sect. 2.2.2.3) that some traits seem to be more resistant than others, and that these uncancelable traits are not only categorical labels such as ANIMAL or PHYSICAL OBJECT. In the life of semiosis we realize that we are also reluctant to cancel some “factual” properties that appear more salient and characteristic than others.\nTo explain why certain properties appear more resistant than others, Violi (1997: sect. 7.2) distinguishes between essential and typical properties: it is essential that a cat be an animal; it is typical that it meows. The second property can be canceled, but not the first. But if this were to be the case we would be back again to the same old difference between dictionary and encyclopedic properties. Violi (1997: sect. 7.3.1.3) instead considers properties that are functional and certainly encyclopedic in nature to be similarly uncancelable: hence it is difficult to say of something that it is a box and at the same time deny that it can contain objects (if it couldn’t it would be a fake box).\nOften, however, in order to construct and presuppose a local portion of encyclopedia needed for the comprehension of a determined context, we must resort to simplified local representations that set aside many properties that are otherwise (in other contexts) resistant.\nIn Eco (1984b: sect. 2.3.4) I gave the example of a dialogue between a wife and her husband at midnight in a suburban home. The wife looks out the window and says with a preoccupied air, “Honey, there’s a man in the garden.” The husband takes a look and says, “No, honey, that’s not a man.” The husband’s reaction certainly violates a pragmatic rule because it provides less information than the situation calls for, since denying the presence of a man could on the one hand suggest that what is there is a child or a cat, while on the other hand it could also lead his wife to imagine something more dangerous (why not an invader from outer space?).\nIn this context, when she is afraid there may be a man there, the wife surely does not assign to the term the properties of rationality, bipedality, or the ability to laugh—all properties that in that context are narcotized (cf. Eco 1979a: ch. 5) and considered irrelevant, but instead those of a living being, capable of movement and aggression and therefore potentially—at night and in someone else’s garden—dangerous. Because it is also part and parcel of the infinite encyclopedic properties of man to be prone to take up a life of crime (don’t we all know that homo homini lupus, man is a wolf to men?) The husband ought then to adjust his iteration on the basis of a local encyclopedic representation, one that he conjecturally considers shared (given the circumstances) by his wife.\nIf the husband wishes to calm his wife down he must either exclude immediately the property of mobility (by saying, for example, that what she saw was the shadow of a tree) or deny any suggestion of properties suggesting dangerousness (in which case he might say that it wasn’t a man but a stray dog). The ad hoc construction of a local portion of encyclopedia, that organizes only the properties pertinent to the context, is the only strategy that will allow the husband to interact in a reasonable way with his concerned wife.\nJordanetics turns this sort of sensible pragmatism on its head. Consider how it applies to the situation envisioned by Eco. Since truth is determined by whether it serves life or not, the wife’s fear means that the claim that the object in the garden is a man must be true, since the mere possibility that the object is a man and therefore a potential risk to the man’s wife and family would serve life, whereas ignoring, denying, or rejecting that possibility, and by doing so, failing to accept the wife’s narrative, would not only not serve life and therefore be untrue, but would add unnecessarily to the suffering of the wife. Ergo, in the absence of conclusive proof that the object is not a man or otherwise dangerous entity such as an invader from space, it would be evil to do anything except accept the wife’s narrative and behave accordingly.\nNotice too the logical consistency and the precision of Eco’s thought. Peterson’s\nMaps of Meaning\n, which I am reading now, reads like a parody of the legitimate academic and intellectual that Eco was, when it is not downright sinister.\nMy interest in the Cold War transformed itself into a true obsession. I thought about the suicidal and murderous preparation of that war every minute of every day, from the moment I woke up until the second I went to bed. How could such a state of affairs come about? Who was responsible?\nI dreamed that I was running through a mall parking lot, trying to escape from something. I was running through the parked cars, opening one door, crawling across the front seat, opening the other, moving to the next. The doors on one car suddenly slammed shut. I was in the passenger seat. The car started to move by itself. A voice said harshly, “there is no way out of here.” I was on a journey, going somewhere I did not want to go. I was not the driver.\nI became very depressed and anxious. I had vaguely suicidal thoughts, but mostly wished that everything would just go away. I wanted to lie down on my couch, and sink into it, literally, until only my nose was showing—like the snorkel of a diver above the surface of the water. I found my awareness of things unbearable.\nI came home late one night from a college drinking party, self-disgusted and angry. I took a canvas board and some paints. I sketched a harsh, crude picture of a crucified Christ—glaring and demonic—with a cobra wrapped around his naked waist, like a belt. The picture disturbed me—struck me, despite my agnosticism, as sacrilegious. I did not know what it meant, however, or why I had painted it. Where in the world had it come from?\nIt should not be hard to see that Jordanetics is an incoherent philosophy of fear, concocted by a very fearful and mentally disturbed individual who is not the driver of it. And since we, as Christians, are not given a spirit of fear, Jordanetics is neither a theology nor a philosophy for us.\nResearch request:\nTranscripts of Peterson videos would be very useful for a comprehensive deep dive into his philosophy. If you’re willing to transcribe a video for me, please shoot me an email with however many you’d be willing to do, keeping in mind that his lectures usually last around an hour, and I will give you a list. Don’t do any without getting a specific request from me, since we want to avoid redundancy.",
  "tags": [
    "philosophy"
  ],
  "categories": [],
  "sitemap_lastmod": "2018-05-07T00:02:01+00:00"
}