{
  "url": "https://voxday.net/2018/05/18/the-suicide-of-the-conservative-movement/",
  "scraped_at": "2025-12-19T21:02:50.012290",
  "title": "The Suicide of the Conservative Movement",
  "date_display": "May 18, 2018",
  "date_iso": "2018-05-18T19:30:08+00:00",
  "date_from_url": "2018-05-18",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>Paul Gottfried points out that the title of Jonah Goldberg’s recent book could be more accurately named, in <a href=\"http://www.unz.com/pgottfried/gottfried-on-goldberg-suicide-of-the-west-or-of-conservatism/\">his review of <i>Suicide of the West</i></a>:</p><blockquote><p>For his newest venture into deep thought, Goldberg has crassly stolen the title of James Burnham’s great work, <i>Suicide of the West</i>, published in 1964 at the height of the Cold War.</p><p>That is where the similarity ends. Unlike Burnham’s scalding indictment of liberalism as “the ideology of Western suicide,” Goldberg’s random opinions represent the very pathology that Burnham railed against. Goldberg hates national identities (although he makes an exception for Israel), opponents of the Deep State, immigration patriots, and those who imagine that democracy has something to do with the popular will. Rather his “conservative” view of democracy privileges public administration, the operation of multinational corporations, and socially sophisticated journalists such as like himself.</p><p>One need only cite this passage from Burnham’s work to grasp the extent to which Burnham might have been thinking of someone like Goldberg when he described the quintessential liberal:</p><p><i>“Liberalism has always stressed change, reform, the break with encrusted habit whether in the form of old ideas, old customs or old institutions. Thus liberalism has been and continues to be primarily negative in its impact on society: and in point of fact it is through its negative and destructive achievements that liberalism makes its best claim to historical justification.”</i></p><p>By now, however, Burnham’s Leftist hallmarks are “conservative” positions. After all, Goldberg’s book, which abounds in the Leftist virtue-signaling mandatory for Main Stream Media Token Conservatives, is being sold by “conservative” book clubs. It is also featured in a Crown Forum Series devoted to conservative thought. For those who may doubt whether the author is an authorized “conservative,” one need only turn to National Review, a publication at which Goldberg still holds an editorship, or else watch him jaw with other Fox News Allstars as a designated Man Of The Right.</p><p>I regard Goldberg as a prime example of the near-total ideological primacy of the Cultural Marxist Left. We are living in a time and place in which what would be crazy-Left up until about two generations ago is assigned a “Right-Wing” label, in order to keep alive a dialectic that is transparently phony.</p><p>In about a ten-page digression into the nature of conservatism—his entire book is really nothing more than a series of digressions—Goldberg identifies “conservatism” with resisting Donald Trump. The U.S. President, whom Goldberg with other Never-Trumpers has inflexibly opposed, is described as a vulgar throwback to the 1930s “on both sides of the Atlantic.” People back then believed “decadent Western capitalism and ‘Manchester liberalism’ were inadequate to the challenges of the day.”</p><p>All of this coming from Goldberg is utter chutzpah, considering that he now happily accepts massive social engineering in order to overcome “discrimination” against certain groups.</p></blockquote><p>This false dialectic is precisely why <i>The New York Times</i> anointed the Brothers Weinstein, the Littlest Chickenhawk, and Dr. Jordanetics as the Approved Opposition. They are selected as the anti-narrative to the mainstream media’s narrative, which is intended to produce a leftward-trending synthesis.</p></div>",
  "content_text": "Paul Gottfried points out that the title of Jonah Goldberg’s recent book could be more accurately named, in\nhis review of\nSuicide of the West\n:\nFor his newest venture into deep thought, Goldberg has crassly stolen the title of James Burnham’s great work,\nSuicide of the West\n, published in 1964 at the height of the Cold War.\nThat is where the similarity ends. Unlike Burnham’s scalding indictment of liberalism as “the ideology of Western suicide,” Goldberg’s random opinions represent the very pathology that Burnham railed against. Goldberg hates national identities (although he makes an exception for Israel), opponents of the Deep State, immigration patriots, and those who imagine that democracy has something to do with the popular will. Rather his “conservative” view of democracy privileges public administration, the operation of multinational corporations, and socially sophisticated journalists such as like himself.\nOne need only cite this passage from Burnham’s work to grasp the extent to which Burnham might have been thinking of someone like Goldberg when he described the quintessential liberal:\n“Liberalism has always stressed change, reform, the break with encrusted habit whether in the form of old ideas, old customs or old institutions. Thus liberalism has been and continues to be primarily negative in its impact on society: and in point of fact it is through its negative and destructive achievements that liberalism makes its best claim to historical justification.”\nBy now, however, Burnham’s Leftist hallmarks are “conservative” positions. After all, Goldberg’s book, which abounds in the Leftist virtue-signaling mandatory for Main Stream Media Token Conservatives, is being sold by “conservative” book clubs. It is also featured in a Crown Forum Series devoted to conservative thought. For those who may doubt whether the author is an authorized “conservative,” one need only turn to National Review, a publication at which Goldberg still holds an editorship, or else watch him jaw with other Fox News Allstars as a designated Man Of The Right.\nI regard Goldberg as a prime example of the near-total ideological primacy of the Cultural Marxist Left. We are living in a time and place in which what would be crazy-Left up until about two generations ago is assigned a “Right-Wing” label, in order to keep alive a dialectic that is transparently phony.\nIn about a ten-page digression into the nature of conservatism—his entire book is really nothing more than a series of digressions—Goldberg identifies “conservatism” with resisting Donald Trump. The U.S. President, whom Goldberg with other Never-Trumpers has inflexibly opposed, is described as a vulgar throwback to the 1930s “on both sides of the Atlantic.” People back then believed “decadent Western capitalism and ‘Manchester liberalism’ were inadequate to the challenges of the day.”\nAll of this coming from Goldberg is utter chutzpah, considering that he now happily accepts massive social engineering in order to overcome “discrimination” against certain groups.\nThis false dialectic is precisely why\nThe New York Times\nanointed the Brothers Weinstein, the Littlest Chickenhawk, and Dr. Jordanetics as the Approved Opposition. They are selected as the anti-narrative to the mainstream media’s narrative, which is intended to produce a leftward-trending synthesis.",
  "tags": [
    "BookReview"
  ],
  "categories": [],
  "sitemap_lastmod": "2018-05-18T18:30:08+00:00"
}