{
  "url": "https://voxday.net/2018/05/25/the-bullfeathers-party/",
  "scraped_at": "2025-12-19T21:03:48.835419",
  "title": "The Bullfeathers party",
  "date_display": "May 25, 2018",
  "date_iso": "2018-05-25T15:30:07+00:00",
  "date_from_url": "2018-05-25",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>They’ve been roundly defeated by Donald Trump in the GOP and sent to the back of the bus in the Democratic Party. So, the NeverTrumpers, formerly the Neoconservatives, are <a href=\"https://www.buzzfeed.com/henrygomez/bill-kristol-president-trump-challenger?utm_term=.thJlvKqP6N#.ecVLv67zKl\">now looking to create a third party</a>. Since Israel First isn’t really appropriate for a party outside Israel, perhaps they could take a page from the American history that has absolutely nothing to do with them or their immigrant forebears and go with the Bullfeathers brand.</p><blockquote><p>Bill Kristol has not given up on defeating Donald Trump.</p><p>He tried and failed once before to recruit an independent candidate to challenge Trump in 2016. Now, with 2020 on his mind, Kristol badly wants a Republican to primary the president. The conservative commentator has been traveling to Iowa and New Hampshire, running a campaign for a campaign, and evangelizing on behalf of a cause that’s less about policy and more, to him, about morals.</p><p>“I have a feeling,” Kristol said Wednesday at Politics &amp; Eggs, a can’t-miss speaking engagement for White House prospects at Saint Anselm College, “that we are now entering … a turbulent era, when the character of both parties is up for grabs.”</p><p>He’s quick to note that challenges to sitting presidents had big consequences in other turbulent periods: In 1968, Eugene McCarthy and Bobby Kennedy chased then-president Lyndon Johnson from the race at the height of anti–Vietnam War sentiment; in 1976, Ronald Reagan nearly beat then-president Gerald Ford, a preview of the conservative Reagan Revolution to come; and in 1980, Ted Kennedy challenged then-president Jimmy Carter and helped define the liberal direction of the Democratic Party.</p><p>And so, armed with this history and fresh polling (Morning Consult and Politico found 38{434e4795edb8718426f2262f16bc350bda72304c69f2c22d1de5754882bdf177} of Republican voters want Trump to face a primary challenge), Kristol made his case this week to dozens of influential New Hampshire activists during a breakfast buffet beneath blown-up photos of past presidential candidates campaigning in the nation’s first primary state.</p><p>Many Republicans who voted for Trump in the general election last time around did so, Kristol asserts, out of concern over Supreme Court appointments and because they hated Hillary Clinton more.</p></blockquote><p>I’m told Ben Shapiro is “wildly popular” with young conservatives. And he’ll be 35 by 2020. I hear he’s quite the fearsome debater too. It’s not like he’d be any less serious a presidential candidate than David French or Evan McMuffin was. Why not put him on the Bullfeathers ticket? And pair him with a woman of equal appeal to Left and Right, the whip-smart Jennifer Rubin, as Vice-President.</p><p>And who did Morning Consult and Politico poll anyhow, the <i>National Review</i> staff? Donald Trump is not only going to win reelection easily, he is going to wind up his second term more popular, and more lionized, than Ronald Reagan.</p></div>",
  "content_text": "They’ve been roundly defeated by Donald Trump in the GOP and sent to the back of the bus in the Democratic Party. So, the NeverTrumpers, formerly the Neoconservatives, are\nnow looking to create a third party\n. Since Israel First isn’t really appropriate for a party outside Israel, perhaps they could take a page from the American history that has absolutely nothing to do with them or their immigrant forebears and go with the Bullfeathers brand.\nBill Kristol has not given up on defeating Donald Trump.\nHe tried and failed once before to recruit an independent candidate to challenge Trump in 2016. Now, with 2020 on his mind, Kristol badly wants a Republican to primary the president. The conservative commentator has been traveling to Iowa and New Hampshire, running a campaign for a campaign, and evangelizing on behalf of a cause that’s less about policy and more, to him, about morals.\n“I have a feeling,” Kristol said Wednesday at Politics & Eggs, a can’t-miss speaking engagement for White House prospects at Saint Anselm College, “that we are now entering … a turbulent era, when the character of both parties is up for grabs.”\nHe’s quick to note that challenges to sitting presidents had big consequences in other turbulent periods: In 1968, Eugene McCarthy and Bobby Kennedy chased then-president Lyndon Johnson from the race at the height of anti–Vietnam War sentiment; in 1976, Ronald Reagan nearly beat then-president Gerald Ford, a preview of the conservative Reagan Revolution to come; and in 1980, Ted Kennedy challenged then-president Jimmy Carter and helped define the liberal direction of the Democratic Party.\nAnd so, armed with this history and fresh polling (Morning Consult and Politico found 38{434e4795edb8718426f2262f16bc350bda72304c69f2c22d1de5754882bdf177} of Republican voters want Trump to face a primary challenge), Kristol made his case this week to dozens of influential New Hampshire activists during a breakfast buffet beneath blown-up photos of past presidential candidates campaigning in the nation’s first primary state.\nMany Republicans who voted for Trump in the general election last time around did so, Kristol asserts, out of concern over Supreme Court appointments and because they hated Hillary Clinton more.\nI’m told Ben Shapiro is “wildly popular” with young conservatives. And he’ll be 35 by 2020. I hear he’s quite the fearsome debater too. It’s not like he’d be any less serious a presidential candidate than David French or Evan McMuffin was. Why not put him on the Bullfeathers ticket? And pair him with a woman of equal appeal to Left and Right, the whip-smart Jennifer Rubin, as Vice-President.\nAnd who did Morning Consult and Politico poll anyhow, the\nNational Review\nstaff? Donald Trump is not only going to win reelection easily, he is going to wind up his second term more popular, and more lionized, than Ronald Reagan.",
  "tags": [
    "cuckservative"
  ],
  "categories": [],
  "sitemap_lastmod": "2018-05-25T14:30:07+00:00"
}