{
  "url": "https://voxday.net/2018/05/18/the-freaks-of-star-wars/",
  "scraped_at": "2025-12-19T21:02:42.758367",
  "title": "The freaks of Star Wars",
  "date_display": "May 18, 2018",
  "date_iso": "2018-05-18T14:30:02+00:00",
  "date_from_url": "2018-05-18",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>I’m a little surprised that the SJWs aren’t out in force protesting Disney’s <a href=\"https://io9.gizmodo.com/lando-calrissian-is-pansexual-1826116231\">shockingly racist characterization</a> of the only black man in space as a sexual freak who will attempt to molest pretty much anything within reach:</p><blockquote><p><i>Solo: A Star Wars Story</i> is chock full of all kinds of interesting new background information about some of Star Wars’ most iconic characters, and one of the most significant revelations to come out of the film is as subtextual as it is important. In a recent interview with the Huffington Post, <i>Solo </i>screenwriter Jonathan Kasdan confirmed what a significant part of the Star Wars fandom has suspected about Lando Calrissian for quite some time now. Lando’s a ladies’ man, yes, but he’s by no means straight. When asked specifically if Lando was pansexual, Kasdan replied, “I would say yes.”</p><p>Historically, the Star Wars franchise has been doing very poorly when it comes to LGBTQ+ representation, which is weird when you consider the expansive nature of the universe. So when asked about Lando’s sexuality, it was nice to see Kasdan reply thoughtfully. He said that while the smuggler wouldn’t put a specific label on himself, he’d be even less likely to buy into the traditional ideas about sexual preference:</p><p>“There’s a fluidity to Donald and Billy Dee’s [portrayal of Lando’s] sexuality. I mean, I would have loved to have gotten a more explicitly LGBT character into this movie. I think it’s time, certainly, for that, and I love the fluidity ― sort of the spectrum of sexuality that Donald appeals to and that droids are a part of.”</p></blockquote><p>It’s only a matter of time before we are informed that Lando Calrissian is involved in a committed trans-species post-gender polygamous relationship with Chewbacca and BB-8. Shameless doesn’t even begin to describe these lunatic wreckers. I’m only surprised that <i>Solo </i>did not turn out to be a tribute to the young Han’s career as an artistic auto-eroticist when he was young and needed the money.</p><p>From <a href=\"https://disqus.com/by/The_Big_W/\">a comment at John C. Wright’s blog</a>. People may not be quick to accept the truth, but they eventually learn they have no other choice:</p><blockquote><p><i>The Last Jedi</i> is the most franchise destructive movie I’ve ever seen. Worse than <i>Alien 3</i> (which I would actually pay to have removed from my memory). They took something that had something for everyone, made it explicitly female (the force is not gendered you assholes!!!), made it all shades of grey and removed the fight between good and evil, and devastated one of the greatest heroes of our time.</p><p>I think they’ve lost millions upon millions of their most ardent fans in exchange for luke warm SJW fans. I had worries when Disney bought <i>Star Wars</i>, and they were all on display in <i>The Last Jedi</i>.</p><p>My daughter and I waited in line for 2 hours to be one of the first in the theater for <i>The Force Awakens</i>, we waited for 2 hours to be one of the first to Rogue One, and then 3 hours to be the first at <i>The Last Jedi</i>. We aren’t going to <i>Solo </i>opening day or weekend.</p></blockquote></div>",
  "content_text": "I’m a little surprised that the SJWs aren’t out in force protesting Disney’s\nshockingly racist characterization\nof the only black man in space as a sexual freak who will attempt to molest pretty much anything within reach:\nSolo: A Star Wars Story\nis chock full of all kinds of interesting new background information about some of Star Wars’ most iconic characters, and one of the most significant revelations to come out of the film is as subtextual as it is important. In a recent interview with the Huffington Post,\nSolo\nscreenwriter Jonathan Kasdan confirmed what a significant part of the Star Wars fandom has suspected about Lando Calrissian for quite some time now. Lando’s a ladies’ man, yes, but he’s by no means straight. When asked specifically if Lando was pansexual, Kasdan replied, “I would say yes.”\nHistorically, the Star Wars franchise has been doing very poorly when it comes to LGBTQ+ representation, which is weird when you consider the expansive nature of the universe. So when asked about Lando’s sexuality, it was nice to see Kasdan reply thoughtfully. He said that while the smuggler wouldn’t put a specific label on himself, he’d be even less likely to buy into the traditional ideas about sexual preference:\n“There’s a fluidity to Donald and Billy Dee’s [portrayal of Lando’s] sexuality. I mean, I would have loved to have gotten a more explicitly LGBT character into this movie. I think it’s time, certainly, for that, and I love the fluidity ― sort of the spectrum of sexuality that Donald appeals to and that droids are a part of.”\nIt’s only a matter of time before we are informed that Lando Calrissian is involved in a committed trans-species post-gender polygamous relationship with Chewbacca and BB-8. Shameless doesn’t even begin to describe these lunatic wreckers. I’m only surprised that\nSolo\ndid not turn out to be a tribute to the young Han’s career as an artistic auto-eroticist when he was young and needed the money.\nFrom\na comment at John C. Wright’s blog\n. People may not be quick to accept the truth, but they eventually learn they have no other choice:\nThe Last Jedi\nis the most franchise destructive movie I’ve ever seen. Worse than\nAlien 3\n(which I would actually pay to have removed from my memory). They took something that had something for everyone, made it explicitly female (the force is not gendered you assholes!!!), made it all shades of grey and removed the fight between good and evil, and devastated one of the greatest heroes of our time.\nI think they’ve lost millions upon millions of their most ardent fans in exchange for luke warm SJW fans. I had worries when Disney bought\nStar Wars\n, and they were all on display in\nThe Last Jedi\n.\nMy daughter and I waited in line for 2 hours to be one of the first in the theater for\nThe Force Awakens\n, we waited for 2 hours to be one of the first to Rogue One, and then 3 hours to be the first at\nThe Last Jedi\n. We aren’t going to\nSolo\nopening day or weekend.",
  "tags": [
    "movies"
  ],
  "categories": [],
  "sitemap_lastmod": "2018-05-18T13:30:02+00:00"
}