{
  "url": "https://voxday.net/2018/05/06/the-cargo-cult-is-going-down-hard/",
  "scraped_at": "2025-12-19T21:00:32.584783",
  "title": "The cargo cult is going down hard",
  "date_display": "May 6, 2018",
  "date_iso": "2018-05-06T10:34:17+00:00",
  "date_from_url": "2018-05-06",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>I suspect Jordan Peterson’s cargo cult is going to react very, very angrily once they understand how badly they’ve been played by their psycho-charlatan false prophet:</p><blockquote class=\"tr_bq\"><p>You spoke of people thinking you were egotistical, they may have been right. Your whole speech is depressing, and you are unable and just plainly unwilling to say anything genuinely positive about him. You throw out certain things just so people think your being objective but these are not honest. The difference is that Jordan Peterson is honest and people follow him because of that—he is not trying to pull a fast one on anybody. We know he is trying to find truth and is passing those truths he has found. Evidence is him sticking his neck out when defending freedom of speech. He was unwilling to fold although many would have. That’s why the things you say are not believable and honesty it is boring. Difficult to watch. </p></blockquote><p>I note that this is how Jordan Peterson <a href=\"https://www.youtube.com/watch?v=a8zLcMGCedA\">sticks out his neck</a> “defending” freedom of speech.</p><blockquote><p>QUESTION: <i>I understand that Faith Goldy was removed from the original August panel because of her podcast with the controversial Daily Stormer after Charlottesville…. This strategy appears to parallel the SJWs, who wish to deny platforms to conservative speakers. I want to understand why Faithy Goldy was removed from the event simply for associating with identitarians, and if each of the panelists agree with that decision.</i></p><p>JORDAN PETERSON: That’s an excellent question. So, the first thing I should say is that it’s not like we’re unaware of the irony. Number one. So, [unintelligible] cancelled a panel about the cancellation of panels about free speech. That’s irony number one. And then irony number two, the panelists removed a speaker for arguably engaging in the act of free speech. Okay, we got that, believe me.</p><p>All right, so why did we come to this decision? I sat down personally – the other people can say what they have to say – I sat down with my son and we went through Faith’s interview. I know Faith, I don’t believe that she is a reprehensible person. I think that Charlottesville was very shocking to her and I think that she put herself in a very difficult position. And I think some of that was brave, that she went down there to cover it.</p><p>However, I listened very carefully to her podcast, the one that got her in trouble. And my sense was that she wasn’t, she didn’t, she was associating with people whose views she should have questioned. It was her journalistic, um, responsibility to question them. She had to ask at least one hard question. At least one. Three would have been better. You know, and I understand she had to toe a careful line. She was on the podcast, they had invited her on, it’s much more difficult than you might think when you’re facing people, even when you don’t believe them, to be rude enough to challenge them, right? That’s not so easy, especially if you’re an agreeable person and she is a rather agreeable person.</p><p>But I believe she, she failed in her journalistic responsibility. And as a consequence of that, she became too hot a property for us. And not just for us. And, well, that was, that was the reason for the decision. That was, that was my reasoning. So….</p></blockquote><p>This is manifestly not the correct behavior of a principled man or even an honest one. Peterson did something he clearly knew to be wrong, but instead of simply owning up to his obvious failure, he attempted to concoct a ridiculous ex post facto justification to excuse it. He had to know this question was inevitable – he appears to have prepared for it – and yet this was the best that he could manage. If you watch the video, you can even see that Peterson has, he has, a reliable tell that warns you when he’s about to say something that he knows is not true, as well as another tell that indicates when he is going to <i>very carefully </i>attempt to cover up the weakness of one of his assertions or rationalizations.</p><p>My question is this: according to what theory of human rights or journalism does one’s right to free speech rely upon one’s correct performance of nonexistent journalistic responsibilities?</p><p>This is an excellent example of the incoherence of Jordanetics, where dishonesty, hypocrisy, and moral failure is hidden behind bafflegab and straight-up bullshit.</p><blockquote class=\"tr_bq\"><p>Why do the whole video talks about what jordan peterson IS rather than what he SAYS??? And things you “learned” are all things you already “knew” but that jordan peterson “should understand”. Everything in this video is judging him on the bases of your beliefs, and not an open-minded view of what he thinks. You’ve learned nothing, you’ve judged. Also, unsubscribed. You’re a narcissist.﻿ I don’t care if Jordan acts… very intensely. That’s called passion and intensity, something voxday clearly doesn’t have, this guy makes 1 point every 10 minutes. But anyway, that’s not the point. You too judge jordan on superficial details, “how he acts”, not the entierty of what he says. Jordan makes so many points, and he says so many things, based mostly on SCIENCE and a lifetime of exprience and practice in psychology, and this guy “destroyed” him based on his beliefs (christianity, what is evil, chaos and hell… in HIS opinion).﻿</p></blockquote><p>I directly and accurately quoted Peterson’s book to substantiate each of the 12 things I learned about him. I don’t know what more I am supposed to do to speak precisely about the man and his philosophy. Peterson does make lots of points and says lots of things, it is the inherently contradictory and incoherent nature of those points and those statements that illustrates the problem with Peterson’s charlatanry.</p></div>",
  "content_text": "I suspect Jordan Peterson’s cargo cult is going to react very, very angrily once they understand how badly they’ve been played by their psycho-charlatan false prophet:\nYou spoke of people thinking you were egotistical, they may have been right. Your whole speech is depressing, and you are unable and just plainly unwilling to say anything genuinely positive about him. You throw out certain things just so people think your being objective but these are not honest. The difference is that Jordan Peterson is honest and people follow him because of that—he is not trying to pull a fast one on anybody. We know he is trying to find truth and is passing those truths he has found. Evidence is him sticking his neck out when defending freedom of speech. He was unwilling to fold although many would have. That’s why the things you say are not believable and honesty it is boring. Difficult to watch.\nI note that this is how Jordan Peterson\nsticks out his neck\n“defending” freedom of speech.\nQUESTION:\nI understand that Faith Goldy was removed from the original August panel because of her podcast with the controversial Daily Stormer after Charlottesville…. This strategy appears to parallel the SJWs, who wish to deny platforms to conservative speakers. I want to understand why Faithy Goldy was removed from the event simply for associating with identitarians, and if each of the panelists agree with that decision.\nJORDAN PETERSON: That’s an excellent question. So, the first thing I should say is that it’s not like we’re unaware of the irony. Number one. So, [unintelligible] cancelled a panel about the cancellation of panels about free speech. That’s irony number one. And then irony number two, the panelists removed a speaker for arguably engaging in the act of free speech. Okay, we got that, believe me.\nAll right, so why did we come to this decision? I sat down personally – the other people can say what they have to say – I sat down with my son and we went through Faith’s interview. I know Faith, I don’t believe that she is a reprehensible person. I think that Charlottesville was very shocking to her and I think that she put herself in a very difficult position. And I think some of that was brave, that she went down there to cover it.\nHowever, I listened very carefully to her podcast, the one that got her in trouble. And my sense was that she wasn’t, she didn’t, she was associating with people whose views she should have questioned. It was her journalistic, um, responsibility to question them. She had to ask at least one hard question. At least one. Three would have been better. You know, and I understand she had to toe a careful line. She was on the podcast, they had invited her on, it’s much more difficult than you might think when you’re facing people, even when you don’t believe them, to be rude enough to challenge them, right? That’s not so easy, especially if you’re an agreeable person and she is a rather agreeable person.\nBut I believe she, she failed in her journalistic responsibility. And as a consequence of that, she became too hot a property for us. And not just for us. And, well, that was, that was the reason for the decision. That was, that was my reasoning. So….\nThis is manifestly not the correct behavior of a principled man or even an honest one. Peterson did something he clearly knew to be wrong, but instead of simply owning up to his obvious failure, he attempted to concoct a ridiculous ex post facto justification to excuse it. He had to know this question was inevitable – he appears to have prepared for it – and yet this was the best that he could manage. If you watch the video, you can even see that Peterson has, he has, a reliable tell that warns you when he’s about to say something that he knows is not true, as well as another tell that indicates when he is going to\nvery carefully\nattempt to cover up the weakness of one of his assertions or rationalizations.\nMy question is this: according to what theory of human rights or journalism does one’s right to free speech rely upon one’s correct performance of nonexistent journalistic responsibilities?\nThis is an excellent example of the incoherence of Jordanetics, where dishonesty, hypocrisy, and moral failure is hidden behind bafflegab and straight-up bullshit.\nWhy do the whole video talks about what jordan peterson IS rather than what he SAYS??? And things you “learned” are all things you already “knew” but that jordan peterson “should understand”. Everything in this video is judging him on the bases of your beliefs, and not an open-minded view of what he thinks. You’ve learned nothing, you’ve judged. Also, unsubscribed. You’re a narcissist.﻿ I don’t care if Jordan acts… very intensely. That’s called passion and intensity, something voxday clearly doesn’t have, this guy makes 1 point every 10 minutes. But anyway, that’s not the point. You too judge jordan on superficial details, “how he acts”, not the entierty of what he says. Jordan makes so many points, and he says so many things, based mostly on SCIENCE and a lifetime of exprience and practice in psychology, and this guy “destroyed” him based on his beliefs (christianity, what is evil, chaos and hell… in HIS opinion).﻿\nI directly and accurately quoted Peterson’s book to substantiate each of the 12 things I learned about him. I don’t know what more I am supposed to do to speak precisely about the man and his philosophy. Peterson does make lots of points and says lots of things, it is the inherently contradictory and incoherent nature of those points and those statements that illustrates the problem with Peterson’s charlatanry.",
  "tags": [
    "mailvox"
  ],
  "categories": [],
  "sitemap_lastmod": "2018-05-06T09:34:17+00:00"
}