{
  "url": "https://voxday.net/2018/05/16/the-critical-narrative/",
  "scraped_at": "2025-12-19T21:02:28.030999",
  "title": "The critical narrative",
  "date_display": "May 16, 2018",
  "date_iso": "2018-05-16T18:14:58+00:00",
  "date_from_url": "2018-05-16",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>It’s a good thing Man has moved beyond thinking in narrative, unlike the human race before the Sixteenth Century, or one might suspect that <a href=\"http://www.unz.com/isteve/wesley-yang-on-jordan-peterson/#comments\">the collection of Jordanologists at Steve Sailer’s place</a> are guilty of doing so. Of course, this little collection doesn’t even begin to address the many comments at YouTube insisting that I am only criticizing Jordanetics because I am, and one really has to quote one particular gentleman in order to fully appreciate the sentiment, “jelly”.</p><blockquote><p>I’m fascinated by the fact that Jordan Peterson has caused Vox Day to to go completely off the rails. I don’t get it, honestly. Can’t a man have many things to say that you find interesting and worthwhile, and others you disagree with without it causing you to condemn him unreservedly?</p><p>Vox Day is sort of a professional egotist. I suspect that Vox really hates Peterson because he thinks that he deserves Peterson’s large fanbase, salary and media attention.</p><p>It doesn’t surprise me in the least that Vox Day is loosing his cheese-wizz over this. As I said in other words in another post still awaiting moderation: Peterson may be the single greatest existential threat to the alt-right – and the Alt-right understands that. I think the Maoist left understands him as a enemy they are programmed to try to destroy at all costs, but they probably don’t understand that if he succeeds, he’s their death too, as much so as that of the Alt-right.</p><p>People like Vox Day are coming down with PDS (Peterson Derangement Syndrome). It’s most likely because they narcissistically think of themselves as more deserving of delivering the masses from evil.</p><p>Vox Day is an amateur troll who’s obviously chaffing at the reality of Jordan Peterson’s popularity and impact, while he toils away in obscurity, egged on only by his amen chorus of commenters who can’t tolerate even the mildest criticism. His latest Dorkstream is a rambling, incoherent assemblage of ad-homenims, such as saying Peterson is an “intellectual fraud”, whatever that means. Peterson is also claimed to have some five-degrees-of-separation link to John Podesta and George Soros. Yeah, whatever.</p><p>Vox has developed a strange obsession with Peterson, and at this point it’s rather pathetic. Vox is obviously a bright guy, but he has torn into Peterson with the fury of a scorned lover. He has convinced himself that Peterson is a minion of the Anti Christ, and Vox’s fanboys have gone all in with this supposed takedown. Not that Peterson cares, or even knows, who Vox is. Vox is sperging on Peterson and I think there is some serious projection going on.</p><p>Vox Day was never on the rails. Regardless of his ideology it’s pretty clear from his writing style that he’s a psycho.</p><p>I agree with your take on Auster and Vox Day, but Vox is in no way as intelligent as Auster was. Not even in the same league. Vox Day is an angry crank who babbles on and on about his 150+ IQ. If his IQ was above 110 I would be shocked.</p><p>You are right that Poz Day has lost his mind about this. Jealousy? Did JP bag Space Cunny?</p><p>The Vox Day vs. Jordan Peterson/Lawrence Auster vs. Mark Steyn thing is a sufficiently common phenomenon that it’s got a name: “the narcissism of small differences.” Back in the day, I was thoroughly dismayed by Auster’s constant attacks on Steyn, which seemed to surpass in vitriol anything he ever said about genuinely bad actors like, say, David Frum. And Day’s scorched earth tactics against Peterson are, if anything, still more “off the rails” – as you aptly put it. The word “narcissism” is particularly apropos in Day’s case – is there anybody on the internet so quick to toot his own horn – and to toot is so loudly?</p><p>it really is weird. i think VD is a very good ideas man and enjoy reading his thoughts on just about every topic (save sci-fi), but it seems like 15+ posts on JP in the last 3 days means jp is in his head like a blood clot.</p><p>I like Vox, but his reaction to Peterson is a bit cringey, he seems to be disagreeing with him on a different plane than Peterson intends to operate. He’s a shrink, not an Aristotelian philosopher – and he never claims to be. Vox’s reaction to Peterson’s sympathizers is also striking in that it feels unhinged.</p><p>VD is a joke. I stumbled on his blog one time. I saw he was making a big deal of his so-called American Indian heritage for some reason, so I mocked him by calling him Big Chief Blogging Eagle. Then he responded by saying “look how racist these leftist SJWs are” even though I had said nothing that could be construed as leftist. All I had done was mock him, which in his mind automatically makes me an “SJW.”</p></blockquote><p>I find it mildly ironic that Peterson’s defenders are defending an emotionally unstable, mentally ill individual who proclaims his dependence on mood-altering drugs using the narrative that I have lost my mind. The thing is, they are constantly attempting to set up a “I win, you lose” scenario, which is quite funny when you compare the critics of one Darkstream to the critics of a later one.</p><ol><li>How can you criticize him when you haven’t even watched his videos?</li><li>Well, maybe you’ve watched a video or two, but how can you criticize him when you haven’t even read his book?</li><li>He’s just a psychologist helping people, he’s not a philosopher! Wait, he said what?</li><li>Well, just because he is trying to create a new philosophy doesn’t mean it’s a bad one!</li><li>Just because you write a UN report doesn’t mean you agree with it!</li><li>Just because you worked with John Podesta was on doesn’t mean you’re associated with him.</li><li>Just because the media asks you to appear on all the shows and leaps to your defense whenever someone calls you names doesn’t mean you’re not the legitimate opposition to the media.</li><li>Why is Vox so obsessed with this? Something must be wrong with him! He must be jealous. Or crazy!</li></ol><p>They can’t seem to grasp that all I have been doing is systematically responding to their various defenses of the man, which keep popping up anew every time I knock one down. I don’t care about Peterson himself, his life is a living hell of insecurity and fear. How stupid would you have to be to envy a man who sincerely believes that life is suffering; apparently the man can’t even eat chocolate. It’s his philosophy and his defenders with which I have the problem.</p><p>Of course as one wiser commenter noted, <i>I agree in your description of VD’s personality, yet you do not address any of the arguments he has made. Weak sauce, that. And the differences between VD and JP are not small. They are at the foundations of their respective philosophies. Understanding this would require, again, reading what they have written. </i></p><p>As far as the idea that I am jealous of Peterson, to the contrary, what profit a man to top the bestseller lists at the price of his intellectual soul? If I was prone to envy, I’d envy NN Taleb, or perhaps the guy who wrote <i>Who Moved My Cheese</i>. Anyhow, at this point, I’ve said pretty much all I needed to say until the book comes out. If you still take the man seriously at this point, that’s on you now. The information is there.</p></div>",
  "content_text": "It’s a good thing Man has moved beyond thinking in narrative, unlike the human race before the Sixteenth Century, or one might suspect that\nthe collection of Jordanologists at Steve Sailer’s place\nare guilty of doing so. Of course, this little collection doesn’t even begin to address the many comments at YouTube insisting that I am only criticizing Jordanetics because I am, and one really has to quote one particular gentleman in order to fully appreciate the sentiment, “jelly”.\nI’m fascinated by the fact that Jordan Peterson has caused Vox Day to to go completely off the rails. I don’t get it, honestly. Can’t a man have many things to say that you find interesting and worthwhile, and others you disagree with without it causing you to condemn him unreservedly?\nVox Day is sort of a professional egotist. I suspect that Vox really hates Peterson because he thinks that he deserves Peterson’s large fanbase, salary and media attention.\nIt doesn’t surprise me in the least that Vox Day is loosing his cheese-wizz over this. As I said in other words in another post still awaiting moderation: Peterson may be the single greatest existential threat to the alt-right – and the Alt-right understands that. I think the Maoist left understands him as a enemy they are programmed to try to destroy at all costs, but they probably don’t understand that if he succeeds, he’s their death too, as much so as that of the Alt-right.\nPeople like Vox Day are coming down with PDS (Peterson Derangement Syndrome). It’s most likely because they narcissistically think of themselves as more deserving of delivering the masses from evil.\nVox Day is an amateur troll who’s obviously chaffing at the reality of Jordan Peterson’s popularity and impact, while he toils away in obscurity, egged on only by his amen chorus of commenters who can’t tolerate even the mildest criticism. His latest Dorkstream is a rambling, incoherent assemblage of ad-homenims, such as saying Peterson is an “intellectual fraud”, whatever that means. Peterson is also claimed to have some five-degrees-of-separation link to John Podesta and George Soros. Yeah, whatever.\nVox has developed a strange obsession with Peterson, and at this point it’s rather pathetic. Vox is obviously a bright guy, but he has torn into Peterson with the fury of a scorned lover. He has convinced himself that Peterson is a minion of the Anti Christ, and Vox’s fanboys have gone all in with this supposed takedown. Not that Peterson cares, or even knows, who Vox is. Vox is sperging on Peterson and I think there is some serious projection going on.\nVox Day was never on the rails. Regardless of his ideology it’s pretty clear from his writing style that he’s a psycho.\nI agree with your take on Auster and Vox Day, but Vox is in no way as intelligent as Auster was. Not even in the same league. Vox Day is an angry crank who babbles on and on about his 150+ IQ. If his IQ was above 110 I would be shocked.\nYou are right that Poz Day has lost his mind about this. Jealousy? Did JP bag Space Cunny?\nThe Vox Day vs. Jordan Peterson/Lawrence Auster vs. Mark Steyn thing is a sufficiently common phenomenon that it’s got a name: “the narcissism of small differences.” Back in the day, I was thoroughly dismayed by Auster’s constant attacks on Steyn, which seemed to surpass in vitriol anything he ever said about genuinely bad actors like, say, David Frum. And Day’s scorched earth tactics against Peterson are, if anything, still more “off the rails” – as you aptly put it. The word “narcissism” is particularly apropos in Day’s case – is there anybody on the internet so quick to toot his own horn – and to toot is so loudly?\nit really is weird. i think VD is a very good ideas man and enjoy reading his thoughts on just about every topic (save sci-fi), but it seems like 15+ posts on JP in the last 3 days means jp is in his head like a blood clot.\nI like Vox, but his reaction to Peterson is a bit cringey, he seems to be disagreeing with him on a different plane than Peterson intends to operate. He’s a shrink, not an Aristotelian philosopher – and he never claims to be. Vox’s reaction to Peterson’s sympathizers is also striking in that it feels unhinged.\nVD is a joke. I stumbled on his blog one time. I saw he was making a big deal of his so-called American Indian heritage for some reason, so I mocked him by calling him Big Chief Blogging Eagle. Then he responded by saying “look how racist these leftist SJWs are” even though I had said nothing that could be construed as leftist. All I had done was mock him, which in his mind automatically makes me an “SJW.”\nI find it mildly ironic that Peterson’s defenders are defending an emotionally unstable, mentally ill individual who proclaims his dependence on mood-altering drugs using the narrative that I have lost my mind. The thing is, they are constantly attempting to set up a “I win, you lose” scenario, which is quite funny when you compare the critics of one Darkstream to the critics of a later one.\nHow can you criticize him when you haven’t even watched his videos?\nWell, maybe you’ve watched a video or two, but how can you criticize him when you haven’t even read his book?\nHe’s just a psychologist helping people, he’s not a philosopher! Wait, he said what?\nWell, just because he is trying to create a new philosophy doesn’t mean it’s a bad one!\nJust because you write a UN report doesn’t mean you agree with it!\nJust because you worked with John Podesta was on doesn’t mean you’re associated with him.\nJust because the media asks you to appear on all the shows and leaps to your defense whenever someone calls you names doesn’t mean you’re not the legitimate opposition to the media.\nWhy is Vox so obsessed with this? Something must be wrong with him! He must be jealous. Or crazy!\nThey can’t seem to grasp that all I have been doing is systematically responding to their various defenses of the man, which keep popping up anew every time I knock one down. I don’t care about Peterson himself, his life is a living hell of insecurity and fear. How stupid would you have to be to envy a man who sincerely believes that life is suffering; apparently the man can’t even eat chocolate. It’s his philosophy and his defenders with which I have the problem.\nOf course as one wiser commenter noted,\nI agree in your description of VD’s personality, yet you do not address any of the arguments he has made. Weak sauce, that. And the differences between VD and JP are not small. They are at the foundations of their respective philosophies. Understanding this would require, again, reading what they have written.\nAs far as the idea that I am jealous of Peterson, to the contrary, what profit a man to top the bestseller lists at the price of his intellectual soul? If I was prone to envy, I’d envy NN Taleb, or perhaps the guy who wrote\nWho Moved My Cheese\n. Anyhow, at this point, I’ve said pretty much all I needed to say until the book comes out. If you still take the man seriously at this point, that’s on you now. The information is there.",
  "tags": [
    "Jordanetics"
  ],
  "categories": [],
  "sitemap_lastmod": "2018-05-16T17:14:58+00:00"
}