{
  "url": "https://voxday.net/2018/05/06/the-reluctant-messiah/",
  "scraped_at": "2025-12-19T21:00:36.254973",
  "title": "The Reluctant Messiah",
  "date_display": "May 6, 2018",
  "date_iso": "2018-05-06T15:11:37+00:00",
  "date_from_url": "2018-05-06",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>Matt Welch of <i>Reason </i>notices that <a href=\"https://reason.com/archives/2018/05/05/jordan-peterson-is-not-the-sec\">something is seriously off</a> about Jordan Peterson:</p><blockquote><p>There are three truly weird moments in <i>12 Rules for Life</i> that have largely escaped notice, though they should have set off alarm bells among reviewer and author alike. The first comes in the introduction, where Peterson describes a dream he had while writing <i>Maps of Meaning</i> in which he was “suspended in mid-air, clinging to a chandelier, many stories above the ground, directly under the dome of a massive cathedral.” Messiah much? He keeps going: “My dream placed me at the centre of Being itself, and there was no escape. It took me months to understand what this meant.…The centre is marked by the cross, as X marks the spot. Existence at that cross is suffering and transformation—and that fact, above all, needs to be voluntarily accepted.”</p><p>The second is another dream about halfway through the book, in which our hero was again in the air, this time with a view of massive glass pyramids, “all full of people striving to reach each pyramid’s very pinnacle.” Yet there was a further space above all that, “the privileged position of the eye that could or perhaps chose to soar freely about the fray; that chose not to dominate any specific group or cause but instead to somehow simultaneously transcend all.” Jesus.</p><p>The final eyebrow-raiser comes in the coda, where Peterson tells a symbolic story about being wowed by a friend’s night-lighted pen, asking for it as a gift, writing down on a piece of paper, What shall I do with my newfound pen of light? then waiting for revelatory response. Among the answers about life that tumbled forth: “Aim for Paradise, and concentrate on today” and “honour your wife as a Mother of God.” Among the questions, What shall I do with a fallen soul? and How shall I educate my people? The final couplet of this inspirational session: “What shall I do when the great crowd beckons? Stand tall and utter my broken truths.”</p><p>The only question is whether he’s the second coming or merely John the Baptist.</p></blockquote><p>Neither. He’s not even a plausible antichrist figure, he’s simply a whack job desperately trying to hold his mind together. If Welch thought those three moments in 12 Rules for Life were truly weird, he’s going to be seriously freaked out by Peterson’s posturing in <i>Maps of Meaning</i>. From the preface, which is entitled DESCENSUS AD INFEROS, which means “The Descent into Hell.”</p><blockquote><p>My parents lived in a standard ranch-style house, in a middle-class neighborhood, in a small town in northern Alberta. I was sitting in the darkened basement of this house, in the family room, watching TV, with my cousin Diane, who was in truth—in waking life—the most beautiful woman I had ever seen. A newscaster suddenly interrupted the program. The television picture and sound distorted, and static filled the screen. My cousin stood up and went behind the TV to check the electrical cord. She touched it, and started convulsing and frothing at the mouth, frozen upright by intense current.</p><p>A brilliant flash of light from a small window flooded the basement. I rushed upstairs. There was nothing left of the ground floor of the house. It had been completely and cleanly sheared away, leaving only the floor, which now served the basement as a roof. Red and orange flames filled the sky, from horizon to horizon. Nothing was left as far as I could see, except skeletal black ruins sticking up here and there: no houses, no trees, no signs of other human beings or of any life whatsoever. The entire town and everything that surrounded it on the flat prairie had been completely obliterated.</p><p>It started to rain mud, heavily. The mud blotted out everything, and left the earth brown, wet, flat and dull, and the sky leaden, even gray. A few distraught and shell-shocked people started to gather together. They were carrying unlabeled and dented cans of food, which contained nothing but mush and vegetables. They stood in the mud looking exhausted and disheveled. Some dogs emerged, out from under the basement stairs, where they had inexplicably taken residence. They were standing upright, on their hind legs. They were thin, like greyhounds, and had pointed noses. They looked like creatures of ritual—like Anubis, from the Egyptian tombs. They were carrying plates in front of them, which contained pieces of seared meat. They wanted to trade the meat for the cans. I took a plate. In the center of it was a circular slab of flesh four inches in diameter and one inch thick, foully cooked, oily, with a marrow bone in the center of it. Where did it come from?</p><p>I had a terrible thought. I rushed downstairs to my cousin. The dogs had butchered her, and were offering the meat to the survivors of the disaster.</p><p>I dreamed apocalyptic dreams of this intensity two or three times a week for a year or more….</p></blockquote><p>The eye in the pyramid. The spirit writing. And now the cannibalism of the beautiful cousin. How much more evidence do you require? Do you still doubt my take on the man? Do you still doubt my opinion that following this lunatic’s philosophical, theological, or psychological lead is not going to lead anyone anywhere good? Maybe you still can’t smell the bullshit, but how can you fail to recognize the stink of sulfur?</p></div>",
  "content_text": "Matt Welch of\nReason\nnotices that\nsomething is seriously off\nabout Jordan Peterson:\nThere are three truly weird moments in\n12 Rules for Life\nthat have largely escaped notice, though they should have set off alarm bells among reviewer and author alike. The first comes in the introduction, where Peterson describes a dream he had while writing\nMaps of Meaning\nin which he was “suspended in mid-air, clinging to a chandelier, many stories above the ground, directly under the dome of a massive cathedral.” Messiah much? He keeps going: “My dream placed me at the centre of Being itself, and there was no escape. It took me months to understand what this meant.…The centre is marked by the cross, as X marks the spot. Existence at that cross is suffering and transformation—and that fact, above all, needs to be voluntarily accepted.”\nThe second is another dream about halfway through the book, in which our hero was again in the air, this time with a view of massive glass pyramids, “all full of people striving to reach each pyramid’s very pinnacle.” Yet there was a further space above all that, “the privileged position of the eye that could or perhaps chose to soar freely about the fray; that chose not to dominate any specific group or cause but instead to somehow simultaneously transcend all.” Jesus.\nThe final eyebrow-raiser comes in the coda, where Peterson tells a symbolic story about being wowed by a friend’s night-lighted pen, asking for it as a gift, writing down on a piece of paper, What shall I do with my newfound pen of light? then waiting for revelatory response. Among the answers about life that tumbled forth: “Aim for Paradise, and concentrate on today” and “honour your wife as a Mother of God.” Among the questions, What shall I do with a fallen soul? and How shall I educate my people? The final couplet of this inspirational session: “What shall I do when the great crowd beckons? Stand tall and utter my broken truths.”\nThe only question is whether he’s the second coming or merely John the Baptist.\nNeither. He’s not even a plausible antichrist figure, he’s simply a whack job desperately trying to hold his mind together. If Welch thought those three moments in 12 Rules for Life were truly weird, he’s going to be seriously freaked out by Peterson’s posturing in\nMaps of Meaning\n. From the preface, which is entitled DESCENSUS AD INFEROS, which means “The Descent into Hell.”\nMy parents lived in a standard ranch-style house, in a middle-class neighborhood, in a small town in northern Alberta. I was sitting in the darkened basement of this house, in the family room, watching TV, with my cousin Diane, who was in truth—in waking life—the most beautiful woman I had ever seen. A newscaster suddenly interrupted the program. The television picture and sound distorted, and static filled the screen. My cousin stood up and went behind the TV to check the electrical cord. She touched it, and started convulsing and frothing at the mouth, frozen upright by intense current.\nA brilliant flash of light from a small window flooded the basement. I rushed upstairs. There was nothing left of the ground floor of the house. It had been completely and cleanly sheared away, leaving only the floor, which now served the basement as a roof. Red and orange flames filled the sky, from horizon to horizon. Nothing was left as far as I could see, except skeletal black ruins sticking up here and there: no houses, no trees, no signs of other human beings or of any life whatsoever. The entire town and everything that surrounded it on the flat prairie had been completely obliterated.\nIt started to rain mud, heavily. The mud blotted out everything, and left the earth brown, wet, flat and dull, and the sky leaden, even gray. A few distraught and shell-shocked people started to gather together. They were carrying unlabeled and dented cans of food, which contained nothing but mush and vegetables. They stood in the mud looking exhausted and disheveled. Some dogs emerged, out from under the basement stairs, where they had inexplicably taken residence. They were standing upright, on their hind legs. They were thin, like greyhounds, and had pointed noses. They looked like creatures of ritual—like Anubis, from the Egyptian tombs. They were carrying plates in front of them, which contained pieces of seared meat. They wanted to trade the meat for the cans. I took a plate. In the center of it was a circular slab of flesh four inches in diameter and one inch thick, foully cooked, oily, with a marrow bone in the center of it. Where did it come from?\nI had a terrible thought. I rushed downstairs to my cousin. The dogs had butchered her, and were offering the meat to the survivors of the disaster.\nI dreamed apocalyptic dreams of this intensity two or three times a week for a year or more….\nThe eye in the pyramid. The spirit writing. And now the cannibalism of the beautiful cousin. How much more evidence do you require? Do you still doubt my take on the man? Do you still doubt my opinion that following this lunatic’s philosophical, theological, or psychological lead is not going to lead anyone anywhere good? Maybe you still can’t smell the bullshit, but how can you fail to recognize the stink of sulfur?",
  "tags": [
    "Jordanetics"
  ],
  "categories": [],
  "sitemap_lastmod": "2018-05-06T14:11:37+00:00"
}