{
  "url": "https://voxday.net/2018/05/14/the-dog-whistler/",
  "scraped_at": "2025-12-19T21:01:52.600045",
  "title": "The dog-whistler",
  "date_display": "May 14, 2018",
  "date_iso": "2018-05-14T00:52:46+00:00",
  "date_from_url": "2018-05-14",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><div style=\"text-align: center;\"><iframe allow=\"autoplay; encrypted-media\" allowfullscreen=\"\" frameborder=\"0\" height=\"284\" src=\"https://www.youtube.com/embed/4YKIMwWLhx8\" width=\"512\"></iframe></div><p>A partial transcript of <a href=\"https://youtu.be/4YKIMwWLhx8\">last night’s Darkstream.</a></p><p>Jordan Peterson is an absolutely shameless and filthy liar, but he is now tweeting about how angry and upset he is, and how pathetic Ari Feldman is, because Feldman is doing the same thing to Peterson that Peterson is doing to the Right. I didn’t like Peterson before. I thought that he was wrong and I thought that his philosophy was evil. I picked that up relatively quickly, but I didn’t really have anything against the guy personally. You know, I felt pity for him because he’s somebody who has clearly known a lot of suffering and tragedy in his life, but you know what, after I read those tweets where he was saying that you have no right to be proud of your culture, you have no right to be proud of your race, you have no right to be proud of your nation, you have no right to be proud of your tribe, you have no right to be proud of your people… you know what? <i>Fuck </i>him!</p><p>Anyone who is going tell me that I should not take pride in the tradition that my grandfather established for me, for my brothers, and for my children, can go to Hell. I have nothing but utter contempt for that attitude. You know, Petersen goes around saying “oh you should you should create your own standards and define your own truth and do your own thing” and all this kind of crap, that is not something that is going to preserve Western civilization, that is not something that is going to preserve the West’s traditions, and I’ll tell you something else. Jordan Peterson absolutely lies, because he says the goal of the far right is “to unjustly bathe in the glories of the past.”</p><p>That is totally false. What we on the right want to do is we want to be <i>worthy </i>of the glories of the past. When we look at the story of Leonidas and the 300 Spartans we want to be inspired by that, we want to be worthy of that. You do not develop courage on your own, you develop courage by seeing the example in others, and especially in others like you, especially in your family members.</p><p>Jordan Peterson is a man without honor. Jordan Peterson is a man without courage, and while I don’t think it’s true that Jordan Peterson is an anti-semite, I don’t think that it is true that Jordan Peterson is a dog-whistler, I think Jordan Peterson is <i>scum</i>. I think Jordan Peterson is a man without balls and I think Jordan Peterson is one of the very last people on Earth that anyone should be listening to. He is not going to teach young men to become men, he is not going to teach men, to become heroes. His path is the path of the rabbit.</p><p><b><i>“Ever to excel, to do better than others, and to bring glory to your forebears, who indeed were very great … This is my ancestry; this is the blood I am proud to inherit.”</i></b></p><div style=\"text-align: right;\">– Homer, <i>The Iliad</i><br><i><br/></i><div style=\"text-align: left;\">UPDATE: The new <a href=\"https://www.youtube.com/watch?v=BiCfEcDw_Dg\">Darkstream </a>which cites the newly exposed evidence that Jordan Peterson is a globalist snake in the grass is up.</div></br></div></div>",
  "content_text": "A partial transcript of\nlast night’s Darkstream.\nJordan Peterson is an absolutely shameless and filthy liar, but he is now tweeting about how angry and upset he is, and how pathetic Ari Feldman is, because Feldman is doing the same thing to Peterson that Peterson is doing to the Right. I didn’t like Peterson before. I thought that he was wrong and I thought that his philosophy was evil. I picked that up relatively quickly, but I didn’t really have anything against the guy personally. You know, I felt pity for him because he’s somebody who has clearly known a lot of suffering and tragedy in his life, but you know what, after I read those tweets where he was saying that you have no right to be proud of your culture, you have no right to be proud of your race, you have no right to be proud of your nation, you have no right to be proud of your tribe, you have no right to be proud of your people… you know what?\nFuck\nhim!\nAnyone who is going tell me that I should not take pride in the tradition that my grandfather established for me, for my brothers, and for my children, can go to Hell. I have nothing but utter contempt for that attitude. You know, Petersen goes around saying “oh you should you should create your own standards and define your own truth and do your own thing” and all this kind of crap, that is not something that is going to preserve Western civilization, that is not something that is going to preserve the West’s traditions, and I’ll tell you something else. Jordan Peterson absolutely lies, because he says the goal of the far right is “to unjustly bathe in the glories of the past.”\nThat is totally false. What we on the right want to do is we want to be\nworthy\nof the glories of the past. When we look at the story of Leonidas and the 300 Spartans we want to be inspired by that, we want to be worthy of that. You do not develop courage on your own, you develop courage by seeing the example in others, and especially in others like you, especially in your family members.\nJordan Peterson is a man without honor. Jordan Peterson is a man without courage, and while I don’t think it’s true that Jordan Peterson is an anti-semite, I don’t think that it is true that Jordan Peterson is a dog-whistler, I think Jordan Peterson is\nscum\n. I think Jordan Peterson is a man without balls and I think Jordan Peterson is one of the very last people on Earth that anyone should be listening to. He is not going to teach young men to become men, he is not going to teach men, to become heroes. His path is the path of the rabbit.\n“Ever to excel, to do better than others, and to bring glory to your forebears, who indeed were very great … This is my ancestry; this is the blood I am proud to inherit.”\n– Homer,\nThe Iliad\nUPDATE: The new\nDarkstream\nwhich cites the newly exposed evidence that Jordan Peterson is a globalist snake in the grass is up.",
  "tags": [
    "Darkstream"
  ],
  "categories": [],
  "sitemap_lastmod": "2018-05-13T23:52:46+00:00"
}