{
  "url": "https://voxday.net/2018/05/24/the-poverty-of-sex/",
  "scraped_at": "2025-12-19T21:03:41.154691",
  "title": "The poverty of sex",
  "date_display": "May 24, 2018",
  "date_iso": "2018-05-24T17:04:17+00:00",
  "date_from_url": "2018-05-24",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>I note, with some satisfaction, that I am now Bucknell University’s Greatest Living Novelist. Not that they are likely to brag about that fact any time soon or ask me to speak at graduation. The thing is, for all his much-ballyhooed and oft-awarded literary talent, Philip Roth was a boring and trivial novelist because he could never get his damned hands <a href=\"https://nypost.com/2018/05/23/philip-roths-pitiless-take-on-the-sexual-revolution/\">out of his own pants</a>.</p><blockquote><p>Roth’s enduring subject matter was the American male’s carnality in the age of the Sexual Revolution, and he was honest and pitiless and unsentimental about it. In his 2001 novel “The Human Stain” he railed against the neo-Puritanism that he said resulted in the impeachment of Bill Clinton, but his own work offers a horrifyingly bleak view of Americans liberated from puritanical attitudes that would warm the heart of any present-day Cotton Mather.</p><p>He began with sexuality denied. The title story of “Goodbye Columbus” concerns a couple of New Jersey kids in their early 20s — young, attractive, full of life — and how their relationship cannot survive her mother’s discovery that they are having sex. Though Roth was not a writer whose work ever delivered a message, “Goodbye Columbus” certainly makes you think that the social stricture against premarital sex was something not protective but corrosive.</p><p>Ten years later, in “Portnoy’s Complaint,” the title character pleasures himself with a piece of liver during his adolescence and goes on to a series of ruinous relationships with inappropriate women that land him (maybe for eternity) on a psychoanalyst’s couch.</p><p>Roth lays Portnoy’s complaint firmly at the feet of his simultaneously emasculating and stimulating monster of a mother. Surely a more enlightened kind of mother was emerging in 1969, when the book was published, a new kind of mother who wouldn’t distort her son in this way.</p><p>But how did this all turn out for Roth’s characters, most of whom are versions of Roth himself? Not well. His novels from “Portnoy” onward feature variegated portraits of crippled men for whom there is no liberation. The world of freer sex isn’t freeing for any of them. And like Roth himself, none of his male characters (with one exception) ever finds any real happiness or contentment in marriage or as a parent.</p><p>The novelist Nathan Zuckerman is felled by mysterious back pain that makes it impossible for him to write. This metaphor for impotence becomes literal in later books. In 1995’s “American Pastoral,” Zuckerman has become literally impotent after prostate surgery and even seems slightly relieved to have been taken out of the game.</p><p>In “The Human Stain,” published six years later, a professor in his 70s takes Viagra in a desperate effort to perform with his illiterate cleaning-lady girlfriend, barely out of her 20s.</p><p>The late novels “Exit Ghost,” “The Dying Animal” and “The Humbling” offer an unsparing and despairing view of a man no longer able to perform — a problem made especially acute by the fact that the Roth stand-ins here are alone and solitary with little to distract them but their failing bodies.</p><p>Only once, in “American Pastoral,” did Roth find the imaginative power to conjure up a person unlike himself who embraces bourgeois life and bourgeois domesticity.</p></blockquote><p>The arc of Roth’s literary career should be shown to sex-obsessed schoolboys in order to demonstrate to them that there is vastly more to life than getting laid. Sex is natural and sex is good, but for the love of all that is beautiful, good, and true, it’s very, very far from the only interesting thing in life.</p></div>",
  "content_text": "I note, with some satisfaction, that I am now Bucknell University’s Greatest Living Novelist. Not that they are likely to brag about that fact any time soon or ask me to speak at graduation. The thing is, for all his much-ballyhooed and oft-awarded literary talent, Philip Roth was a boring and trivial novelist because he could never get his damned hands\nout of his own pants\n.\nRoth’s enduring subject matter was the American male’s carnality in the age of the Sexual Revolution, and he was honest and pitiless and unsentimental about it. In his 2001 novel “The Human Stain” he railed against the neo-Puritanism that he said resulted in the impeachment of Bill Clinton, but his own work offers a horrifyingly bleak view of Americans liberated from puritanical attitudes that would warm the heart of any present-day Cotton Mather.\nHe began with sexuality denied. The title story of “Goodbye Columbus” concerns a couple of New Jersey kids in their early 20s — young, attractive, full of life — and how their relationship cannot survive her mother’s discovery that they are having sex. Though Roth was not a writer whose work ever delivered a message, “Goodbye Columbus” certainly makes you think that the social stricture against premarital sex was something not protective but corrosive.\nTen years later, in “Portnoy’s Complaint,” the title character pleasures himself with a piece of liver during his adolescence and goes on to a series of ruinous relationships with inappropriate women that land him (maybe for eternity) on a psychoanalyst’s couch.\nRoth lays Portnoy’s complaint firmly at the feet of his simultaneously emasculating and stimulating monster of a mother. Surely a more enlightened kind of mother was emerging in 1969, when the book was published, a new kind of mother who wouldn’t distort her son in this way.\nBut how did this all turn out for Roth’s characters, most of whom are versions of Roth himself? Not well. His novels from “Portnoy” onward feature variegated portraits of crippled men for whom there is no liberation. The world of freer sex isn’t freeing for any of them. And like Roth himself, none of his male characters (with one exception) ever finds any real happiness or contentment in marriage or as a parent.\nThe novelist Nathan Zuckerman is felled by mysterious back pain that makes it impossible for him to write. This metaphor for impotence becomes literal in later books. In 1995’s “American Pastoral,” Zuckerman has become literally impotent after prostate surgery and even seems slightly relieved to have been taken out of the game.\nIn “The Human Stain,” published six years later, a professor in his 70s takes Viagra in a desperate effort to perform with his illiterate cleaning-lady girlfriend, barely out of her 20s.\nThe late novels “Exit Ghost,” “The Dying Animal” and “The Humbling” offer an unsparing and despairing view of a man no longer able to perform — a problem made especially acute by the fact that the Roth stand-ins here are alone and solitary with little to distract them but their failing bodies.\nOnly once, in “American Pastoral,” did Roth find the imaginative power to conjure up a person unlike himself who embraces bourgeois life and bourgeois domesticity.\nThe arc of Roth’s literary career should be shown to sex-obsessed schoolboys in order to demonstrate to them that there is vastly more to life than getting laid. Sex is natural and sex is good, but for the love of all that is beautiful, good, and true, it’s very, very far from the only interesting thing in life.",
  "tags": [
    "writing"
  ],
  "categories": [],
  "sitemap_lastmod": "2018-05-24T16:04:17+00:00"
}