{
  "url": "https://voxday.net/2018/05/27/the-cargo-cultists-respond/",
  "scraped_at": "2025-12-19T21:04:10.911055",
  "title": "The Cargo Cultists respond",
  "date_display": "May 27, 2018",
  "date_iso": "2018-05-27T18:29:09+00:00",
  "date_from_url": "2018-05-27",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>A Jordan Peterson fan responds to my apology to Jordan Peterson:</p><blockquote><p>Vox Day is an arrogant creep who thinks he’s the burning bush and everyone else is stupid. If you met him in real life, or ever tried to correspond with him in any serious way, you would know that. He’s also envious of anyone who achieves more success and notoriety than him, or even threatens to achieve more of a following.</p><p>In short, this is not a good person who is the least bit interested in anything approaching unity on the alt-right or new right or whatever you want to call it. He is only interested in his own self promotion and achieving some level of fame and fortune by hawking his own books and maybe latching on to some of his own sycophants if he thinks they can sell some books on his label too, so he can make more money off people he views as his intellectual inferiors and does not really view as a threat.</p><p>Basically he’s a failed musicians who tries to give you this impression that he is on Jordan Peterson’s level as an intellectual, with these phony claims about his supposed genius IQ, and BTW it wouldn’t even matter if that were true because it doesn’t make you a good person, and he’s not. Lastly, Jordan Peterson was raised in a tough place around tough men, and that teaches you things like humility and respect for others, cause the alternative could be a punch in the face. Vox Day, OTOH, grew up with a silver spoon in his mouth, around other effeminate male who were no threat to him physically, and it shows in his demeanor. Thats why he’s such an arrogant pr*ck with a smart mouth.</p><p>In closing, I’ll guarantee you Peterson is the kind of guy you would want to have a few drinks and laughs with, whereas Vox Day wouldn’t give you the time of day, unless he thought you could help advance his career and perhaps make him some money. I know his fan-club will jump all over me for this, but I’ve encountered the man and he is NOT a nice guy, he’s only not nearly as smart as he wants you to believe that he is. In that respect he is not even in Jordan Peterson’s league.</p></blockquote><p>Far from being upset by these imprecations, I find these retreats to attempted rebuttal by <i>ad hominem</i> to be very satisfying indeed. They make it very clear to all and sundry that Peterson’s most enthusiastic defenders have no way to even begin trying to defend his evil philosophy, his inept syllogisms, or his insane mission.</p><p>After all, what possible reason could anyone have for questioning the intellectual and philosophical legitimacy of a man who has already <i>done so much good </i>for the world and only wishes to do even more by eliminating group identification, war, and evil.</p><ol><li>It’s very strange that no one believes I am envious of Jensen Huang, NN Taleb, John Carmack, Richard Garriott, or Neal Stephenson, the men of talent I admire who happen to have considerably more success than the individuals I criticize. It’s downright inexplicable that no one ever accuses me of envying Milo, Mike Cernovich, Jack Posobiec, or Stefan Molyneux despite the fact that they all have much larger followings than I do.</li><li>If I was primarily interested in self-promotion, then why do I turn down 99 percent of the interviews and media appearances that are offered to me? All one has to do is ask anyone who has tried to get me on their show or podcast, or interview me for their newspaper or magazine or television show, to learn how interested in self-promotion I am. I don’t have an agent, I don’t send out press releases and I don’t ask to appear on anyone’s show. Not even my friends’ shows when I have a new book out. I don’t think people understand how often the media contacts me for various reasons; I literally just got off the phone with my friend James Delingpole from <i>Breitbart </i>and <i>The Spectator</i> after he called me with some questions about a piece he is working on. It’s not about me and it may not even mention me.</li><li>The band I founded, Psykosonik, had four Billboard Top 40 Club Chart hits, (three of which I co-wrote), beat out Prince for Best Dance Record at the Minnesota Music Awards, had our music featured in movies and Nintendo games, played live at First Avenue and Glam Slam, and was invited to play at the second Lollapalooza. I do not consider that to be a failure.</li><li>Jordan Peterson is, by his own admission, a physical coward who literally ran from fights in his school days. I spent six years in the best mixed martial arts school in the state, have sparred with several national Tang Soo Do and Karate champions, have won school fights, street fights, and ring fights, and was given the name “Berserker” by a nationally respected sensei. The reason I don’t fear being punched in the mouth isn’t because I am surrounded by effeminate males, but because I know for a fact that I can take a punch and I can give it back with interest.</li><li>I have no idea who this “Whiskey Slick” is. I suspect our “encounters” are limited to him reading my blog.</li></ol><p>Another cargo cultist can’t believe that Peterson claimed human thought was fundamentally different as little as five centuries ago.</p><blockquote class=\"tr_bq\"><p>Yeah…….where in the world did you read JBP say men 500 years ago thought differently? One of JBP’s arguments is that a significant part of our behvior and thought processes are older than trees…﻿</p></blockquote><p>In <i>Maps of Meaning</i>, by Jordan Peterson.</p><ol><li>Prior to the time of Descartes, Bacon and Newton, man lived in an animated, spiritual world, saturated with meaning, imbued with moral purpose. The nature of this purpose was revealed in the stories people told each other—stories about the structure of the cosmos and the place of man. But now we think empirically (at least we think we think empirically), and the spirits that once inhabited the universe have vanished.</li><li>The consequence of exploration that allows for emotional regulation (that generates security, essentially) is not objective description, as the scientist might have it, but categorization of the implications of an unexpected occurrence for specification of means and ends. Such categorization is what an object “is,” from the perspective of archaic affect and subjective experience. The orienting reflex, and the exploratory behavior following its manifestation, also allows for the differentiation of the unknown into the familiar categories of objective reality. However, this ability is a late development, emerging only four hundred years ago, and cannot be considered basic to “thinking.” Specification of the collectively apprehensible sensory qualities of something—generally considered, in the modern world, as the essential aspect of the description of reality—merely serves as an aid to the more fundamental process of evaluation, determining the precise nature of relevant or potentially relevant phenomena.</li><li>The distance between the idea and the action has widened within the course of recent evolutionary history. Medieval people, unused to rhetorical speech, were easily seized emotionally or inspired to action by passionate words.</li></ol><p>Perhaps he doesn’t realize that the furthest back we can place that reference to Descartes, Bacon, and Newton is 1561 AD, when Francis Bacon was born. And then we have this double-team:</p><blockquote><p><i>So the argument from this guy is that because he doesn’t understand Dr. Peterson, that Peterson must be crazy? Isn’t that called Dunning-Kreuger effect?﻿ </i></p><p>Vox Day frequently discusses the 30 IQ point communication gap. If this Peterson affair has taught me nothing else, it has driven this point home. Dr Peterson is rumored to have an IQ of 158 btw.﻿ I’ve kept a close eye on Vox’s commentary at the blog. The “arguments” made against Peterson there are no more substantive there than they are here–at least to someone who refrains from using the term “Dark Lord”.</p></blockquote><p>To the contrary, it is because, unlike nearly all of his fans, I do understand what Jordan Peterson is writing that I say he is crazy. It seems strange that this is in any way debatable, considering that the man is open about being prescribed medication for his mental illness. And if the arguments I have presented here are not real, actual, of a considerable amount quantity, or having practical effect, then obviously I shall have to continue to dig deeper and present even more substantial evidence and arguments against Dr. Peterson.</p><p>I note that this implication that all the combined arguments presented in the videos and on the blog are not substantive was made just <i>yesterday</i>. And then, there are a fair collection of comments like these.</p><blockquote class=\"tr_bq\"><p>You are a master at double speak! and very snide. People need to watch out for sophists like you. You try to look intelligent with your leather bound books but your thinking is as shallow as a paddling pool.﻿</p></blockquote><p>Always nice to hear from the rhetoricals. But this comment probably takes the cake.</p><blockquote class=\"tr_bq\"><p>Alright….. Just stepping into the war-room you have going against Jordan Peterson here…. How’s it going, guys? Just pouring myself some coffee, don’t mind me…. Okay…. We’ve got the map over the table, the radar-reports coming in, the jeeps rolling by…. The choppers thundering overhead…. Cool cool cool! Good to see us all making progress, hey? At this rate, our forces will be in Toronto by as early as NEXT WEEK! Ahh, yes! There’s Admiral-Lieutenant-Commander mastermind, Vox Day I see entering the headquaters tent…. TEN HUTT!!! …..Say, Vox, like…. What’s the VICTORY CONDITION here anyway? Assuming you do win this rather sad and autistic deathstruggle you have going against Peterson and his people…. (Ohh, and I’m sure it’s ALL VERY EPIC AND AWESOME AND THOROUGHLY PLANNED OUT TO THE LAST ACT, DUDE! -Stop looking at me like that, Vox! Stop looking at me like I’m some spy sent from the Enemy to sabotage your incredible efforts here! I’m just a neutral observer from a Foriegn Power taking notes, alright? Don’t mind me!) Like…. What do you hope to GAIN, by helping Peterson’s enemies, even if you DO manage to win and take the guy down, huh Vox? A kiss from Kathy Newman? Is THAT what you’re looking for? How about a handjob from Yvette Flarka? Have a thing for Mrs. Flarka, Vox? Is THAT what this anti-Peterson crusade of your’s is about? How about an endorsement from Black Lives Matter? Maybe a gold star awarded to you from King Richard Spencer to cherish and show your family when you get home from this war? I’m sure THAT fake-ass “Conservative” race-pimp Sociaoist creep would like to see Peterson out of the way as well! Maybe, uhhh….. Hillary Clinton might spend a little more time with you, Vox? Gain you some of that noteriety you seem desperate for? Yeah- I’m sure praise from the Clintons or the Treudeaus for taking out an annoying rival of their’s will be JUST THE KIND OF GOOD PR you need, huh boy? Look, what I’m getting at here, Vox Day, is that you can tell a hell of alot from a man by the enemies he makes, can’t you? All the characters I mentioned above really would be quite pleased if you took Jordan Peterson down for them, believe me they would! What the fuck do you think you’re trying to accomplish here, Vox? Seriously? My own people would like to know…. Who’s side are you REALLY on? You and the halfbrained fools who kiss YOUR ass for a pat on the head? Antifa, Vox? Are you some Antifa pig in disguise? I’m wondering about that, you know? I mean, just recently, these last two weeks, you certainly have decided that you are MIGHTY THREATENED by the likes of Jordan Peterson, and that the time has come to mobilize against him. I’m telling you, Vox- if you ever needed a way to commit politocal suicide for you, your website and your publishing company, this is it, right here! I’d laugh at how ridiculous you are being about this, if I didn’t suspect some other plot you have cooking is up, and that taking down Peterson is only the tip of the iceberg. It’s gotta be something hidden and Machiavellian like that, because, Vox- honestly- I KNOW you’re not a fucking moron, dude….. There MUST be an actual reason you want Peterson off the board! </p></blockquote><p>It’s utterly bizarre to me to see how Peterson fans like these still believe that Jordan Peterson isn’t on the same team as Hillary Clinton, George Soros, Jacob Zuma, John Podesta and all the other globalists and eminent persons. As I mentioned to the Peterson die-hard Rick Flair, Peterson isn’t opposed to globalism, the United Nations, or utopianism. He’s trying to FIX globalism by creating a dynamic utopianism that works because he is aware that the static utopianism of the 20th Century variety doesn’t.</p></div>",
  "content_text": "A Jordan Peterson fan responds to my apology to Jordan Peterson:\nVox Day is an arrogant creep who thinks he’s the burning bush and everyone else is stupid. If you met him in real life, or ever tried to correspond with him in any serious way, you would know that. He’s also envious of anyone who achieves more success and notoriety than him, or even threatens to achieve more of a following.\nIn short, this is not a good person who is the least bit interested in anything approaching unity on the alt-right or new right or whatever you want to call it. He is only interested in his own self promotion and achieving some level of fame and fortune by hawking his own books and maybe latching on to some of his own sycophants if he thinks they can sell some books on his label too, so he can make more money off people he views as his intellectual inferiors and does not really view as a threat.\nBasically he’s a failed musicians who tries to give you this impression that he is on Jordan Peterson’s level as an intellectual, with these phony claims about his supposed genius IQ, and BTW it wouldn’t even matter if that were true because it doesn’t make you a good person, and he’s not. Lastly, Jordan Peterson was raised in a tough place around tough men, and that teaches you things like humility and respect for others, cause the alternative could be a punch in the face. Vox Day, OTOH, grew up with a silver spoon in his mouth, around other effeminate male who were no threat to him physically, and it shows in his demeanor. Thats why he’s such an arrogant pr*ck with a smart mouth.\nIn closing, I’ll guarantee you Peterson is the kind of guy you would want to have a few drinks and laughs with, whereas Vox Day wouldn’t give you the time of day, unless he thought you could help advance his career and perhaps make him some money. I know his fan-club will jump all over me for this, but I’ve encountered the man and he is NOT a nice guy, he’s only not nearly as smart as he wants you to believe that he is. In that respect he is not even in Jordan Peterson’s league.\nFar from being upset by these imprecations, I find these retreats to attempted rebuttal by\nad hominem\nto be very satisfying indeed. They make it very clear to all and sundry that Peterson’s most enthusiastic defenders have no way to even begin trying to defend his evil philosophy, his inept syllogisms, or his insane mission.\nAfter all, what possible reason could anyone have for questioning the intellectual and philosophical legitimacy of a man who has already\ndone so much good\nfor the world and only wishes to do even more by eliminating group identification, war, and evil.\nIt’s very strange that no one believes I am envious of Jensen Huang, NN Taleb, John Carmack, Richard Garriott, or Neal Stephenson, the men of talent I admire who happen to have considerably more success than the individuals I criticize. It’s downright inexplicable that no one ever accuses me of envying Milo, Mike Cernovich, Jack Posobiec, or Stefan Molyneux despite the fact that they all have much larger followings than I do.\nIf I was primarily interested in self-promotion, then why do I turn down 99 percent of the interviews and media appearances that are offered to me? All one has to do is ask anyone who has tried to get me on their show or podcast, or interview me for their newspaper or magazine or television show, to learn how interested in self-promotion I am. I don’t have an agent, I don’t send out press releases and I don’t ask to appear on anyone’s show. Not even my friends’ shows when I have a new book out. I don’t think people understand how often the media contacts me for various reasons; I literally just got off the phone with my friend James Delingpole from\nBreitbart\nand\nThe Spectator\nafter he called me with some questions about a piece he is working on. It’s not about me and it may not even mention me.\nThe band I founded, Psykosonik, had four Billboard Top 40 Club Chart hits, (three of which I co-wrote), beat out Prince for Best Dance Record at the Minnesota Music Awards, had our music featured in movies and Nintendo games, played live at First Avenue and Glam Slam, and was invited to play at the second Lollapalooza. I do not consider that to be a failure.\nJordan Peterson is, by his own admission, a physical coward who literally ran from fights in his school days. I spent six years in the best mixed martial arts school in the state, have sparred with several national Tang Soo Do and Karate champions, have won school fights, street fights, and ring fights, and was given the name “Berserker” by a nationally respected sensei. The reason I don’t fear being punched in the mouth isn’t because I am surrounded by effeminate males, but because I know for a fact that I can take a punch and I can give it back with interest.\nI have no idea who this “Whiskey Slick” is. I suspect our “encounters” are limited to him reading my blog.\nAnother cargo cultist can’t believe that Peterson claimed human thought was fundamentally different as little as five centuries ago.\nYeah…….where in the world did you read JBP say men 500 years ago thought differently? One of JBP’s arguments is that a significant part of our behvior and thought processes are older than trees…﻿\nIn\nMaps of Meaning\n, by Jordan Peterson.\nPrior to the time of Descartes, Bacon and Newton, man lived in an animated, spiritual world, saturated with meaning, imbued with moral purpose. The nature of this purpose was revealed in the stories people told each other—stories about the structure of the cosmos and the place of man. But now we think empirically (at least we think we think empirically), and the spirits that once inhabited the universe have vanished.\nThe consequence of exploration that allows for emotional regulation (that generates security, essentially) is not objective description, as the scientist might have it, but categorization of the implications of an unexpected occurrence for specification of means and ends. Such categorization is what an object “is,” from the perspective of archaic affect and subjective experience. The orienting reflex, and the exploratory behavior following its manifestation, also allows for the differentiation of the unknown into the familiar categories of objective reality. However, this ability is a late development, emerging only four hundred years ago, and cannot be considered basic to “thinking.” Specification of the collectively apprehensible sensory qualities of something—generally considered, in the modern world, as the essential aspect of the description of reality—merely serves as an aid to the more fundamental process of evaluation, determining the precise nature of relevant or potentially relevant phenomena.\nThe distance between the idea and the action has widened within the course of recent evolutionary history. Medieval people, unused to rhetorical speech, were easily seized emotionally or inspired to action by passionate words.\nPerhaps he doesn’t realize that the furthest back we can place that reference to Descartes, Bacon, and Newton is 1561 AD, when Francis Bacon was born. And then we have this double-team:\nSo the argument from this guy is that because he doesn’t understand Dr. Peterson, that Peterson must be crazy? Isn’t that called Dunning-Kreuger effect?﻿\nVox Day frequently discusses the 30 IQ point communication gap. If this Peterson affair has taught me nothing else, it has driven this point home. Dr Peterson is rumored to have an IQ of 158 btw.﻿ I’ve kept a close eye on Vox’s commentary at the blog. The “arguments” made against Peterson there are no more substantive there than they are here–at least to someone who refrains from using the term “Dark Lord”.\nTo the contrary, it is because, unlike nearly all of his fans, I do understand what Jordan Peterson is writing that I say he is crazy. It seems strange that this is in any way debatable, considering that the man is open about being prescribed medication for his mental illness. And if the arguments I have presented here are not real, actual, of a considerable amount quantity, or having practical effect, then obviously I shall have to continue to dig deeper and present even more substantial evidence and arguments against Dr. Peterson.\nI note that this implication that all the combined arguments presented in the videos and on the blog are not substantive was made just\nyesterday\n. And then, there are a fair collection of comments like these.\nYou are a master at double speak! and very snide. People need to watch out for sophists like you. You try to look intelligent with your leather bound books but your thinking is as shallow as a paddling pool.﻿\nAlways nice to hear from the rhetoricals. But this comment probably takes the cake.\nAlright….. Just stepping into the war-room you have going against Jordan Peterson here…. How’s it going, guys? Just pouring myself some coffee, don’t mind me…. Okay…. We’ve got the map over the table, the radar-reports coming in, the jeeps rolling by…. The choppers thundering overhead…. Cool cool cool! Good to see us all making progress, hey? At this rate, our forces will be in Toronto by as early as NEXT WEEK! Ahh, yes! There’s Admiral-Lieutenant-Commander mastermind, Vox Day I see entering the headquaters tent…. TEN HUTT!!! …..Say, Vox, like…. What’s the VICTORY CONDITION here anyway? Assuming you do win this rather sad and autistic deathstruggle you have going against Peterson and his people…. (Ohh, and I’m sure it’s ALL VERY EPIC AND AWESOME AND THOROUGHLY PLANNED OUT TO THE LAST ACT, DUDE! -Stop looking at me like that, Vox! Stop looking at me like I’m some spy sent from the Enemy to sabotage your incredible efforts here! I’m just a neutral observer from a Foriegn Power taking notes, alright? Don’t mind me!) Like…. What do you hope to GAIN, by helping Peterson’s enemies, even if you DO manage to win and take the guy down, huh Vox? A kiss from Kathy Newman? Is THAT what you’re looking for? How about a handjob from Yvette Flarka? Have a thing for Mrs. Flarka, Vox? Is THAT what this anti-Peterson crusade of your’s is about? How about an endorsement from Black Lives Matter? Maybe a gold star awarded to you from King Richard Spencer to cherish and show your family when you get home from this war? I’m sure THAT fake-ass “Conservative” race-pimp Sociaoist creep would like to see Peterson out of the way as well! Maybe, uhhh….. Hillary Clinton might spend a little more time with you, Vox? Gain you some of that noteriety you seem desperate for? Yeah- I’m sure praise from the Clintons or the Treudeaus for taking out an annoying rival of their’s will be JUST THE KIND OF GOOD PR you need, huh boy? Look, what I’m getting at here, Vox Day, is that you can tell a hell of alot from a man by the enemies he makes, can’t you? All the characters I mentioned above really would be quite pleased if you took Jordan Peterson down for them, believe me they would! What the fuck do you think you’re trying to accomplish here, Vox? Seriously? My own people would like to know…. Who’s side are you REALLY on? You and the halfbrained fools who kiss YOUR ass for a pat on the head? Antifa, Vox? Are you some Antifa pig in disguise? I’m wondering about that, you know? I mean, just recently, these last two weeks, you certainly have decided that you are MIGHTY THREATENED by the likes of Jordan Peterson, and that the time has come to mobilize against him. I’m telling you, Vox- if you ever needed a way to commit politocal suicide for you, your website and your publishing company, this is it, right here! I’d laugh at how ridiculous you are being about this, if I didn’t suspect some other plot you have cooking is up, and that taking down Peterson is only the tip of the iceberg. It’s gotta be something hidden and Machiavellian like that, because, Vox- honestly- I KNOW you’re not a fucking moron, dude….. There MUST be an actual reason you want Peterson off the board!\nIt’s utterly bizarre to me to see how Peterson fans like these still believe that Jordan Peterson isn’t on the same team as Hillary Clinton, George Soros, Jacob Zuma, John Podesta and all the other globalists and eminent persons. As I mentioned to the Peterson die-hard Rick Flair, Peterson isn’t opposed to globalism, the United Nations, or utopianism. He’s trying to FIX globalism by creating a dynamic utopianism that works because he is aware that the static utopianism of the 20th Century variety doesn’t.",
  "tags": [
    "anklebiters"
  ],
  "categories": [],
  "sitemap_lastmod": "2018-05-27T17:29:09+00:00"
}