{
  "url": "https://voxday.net/2018/05/08/truth-and-the-true-purpose-of-jordanetics/",
  "scraped_at": "2025-12-19T21:01:03.750211",
  "title": "Truth and the true purpose of Jordanetics",
  "date_display": "May 8, 2018",
  "date_iso": "2018-05-08T16:51:33+00:00",
  "date_from_url": "2018-05-08",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>Just a few of the typical responses of Jordan Peterson’s cargo cultists to my latest critiques. The interesting thing, to me, is the way the goalposts keep moving, and the way they keep getting more hysterical, the more directly I address what their Broken Prophet has written or said.</p><blockquote><p>I thought Vox Day was supposed to be some deep thinker of the Alt Right (or was it something called The Dark Enlightenment?) I never bothered to follow it up. My Latin is small to none but isn’t Vox Dei the “voice of God”? Hard to take someone with that handle seriously. Now I see all these meandering videos attacking JBP and his book.  VD’s attacks are embarrasingly weak. If he doesn’t like JBP’s squeals against The Right he should just suck it up and watch the drama.</p><p>This video is reminiscent of a Cenk Uygur TYT hit piece. You sir, have not represented yourself well here.﻿</p><p>You are a fucking moron. He’s never claimed to be of the Left, on the Right, conservative, Christian,……..nothing. Your straw-manning and emotionally driven OPINION of what he may or may not be is no criticism. You Vox, don’t define Conservatism, Christianity, philosophy, psychology, and certainly not Jordan Peterson with your armchair quarter-backing sideline “criticisms”.﻿</p><p>I’d like to show you how much of a Gamma male you are now Vox, and not you 6th grade self either. You are pompous, self-aggrandizing coward. You sir, are a jealous loser.﻿</p><p>Your such a scrounge little bitch Vox.﻿</p><p>Wow. Rekt. Wait, no, it’s just more self congratulatory Vox Day overestimating himself as he’s been doing for decades.﻿</p><p>How do you know what someone thinks without direct engagement of question and answer to clarify? That is communication 101.﻿</p><p>New it! All this a ploy for you to get attention. Dude Peterson doesnt even know you exist. Peterson fans barely know you exist.﻿ He became an intellectual figure through his book Maps of Meaning and his peer reviewed studies that have over 10,000 citations. Your a bloger and failed writer.﻿</p><p>Dude. You have less then 3k subscribers. Your comment section on that video is bellow 300. The only People watching you and agreeing with are your mindless fans. How bad do you have be at this game to have been around for a decade, upload regularly, appear on big shows like Stefans and only 2.4k subs. Your a hack.</p><p>This guy is projecting harder than anyone I’ve ever seen﻿.</p><p>Obviously, you have neither read Maps of Meaning nor watched his lectures. JP is a psychologist not a philosopher like you. JP is writing for an audience of lower IQ , immature folks. You are not his audience.</p><p>It honestly just seems like you’re trying to get attention and are jealous of his success﻿</p><p>Vox seems to be jealous of petersons succes. You have become irrelevant vox﻿</p><p>What seems nuts to me is devoting so much time to a man you obviously disrespect. Why does it bother you so bad that a great many people resonate with Peterson and seem to be helped by him? When you write your book let’s see how well it sells. You come across as a jealous narcissist. Maybe people like Peterson because he doesn’t talk down to them. I got more out of just the contents page of his book than your entire video. Grandiose word salad is a perfect description if you look in the mirror. Would love to see a debate between a man with common sense and one with a chip on his shoulder. Good luck with your Sour Grapes series.﻿﻿</p></blockquote><p>An interesting way to defend the man who supposedly encourages criticism, to be sure. The other thing that is interesting about the responses to my critiques is the way that the definitions of Jordan Peterson’s “truth” keep growing in number. Here are four of the various definitions presently on offer.</p><ol><li>If you are going to go for a definition of truth that JBP subscribes to, one should probably go with the one that JBP mentions: pragmatism and the book that he recommends: <i>The Metaphysical Club </i>by Louis Menand.</li><li>Peterson subscribes to a pragmatist version of the Coherence theory of truth…. On Peterson’s stated theory of truth, an idea can be thought to be true (or false) at a “micro” or “proximal” level – e.g., at the level of a scientific experiment, or at some other level that does not take the morality of the idea into account – yet actually be false (or true) at a “macro” or “distal” level that includes a consideration of whether the idea is pro-survival or anti-survival (i.e., good or evil). For Peterson, it is the macro/distal level – the level that includes a consideration of the morality of the effects of an idea – that determines the idea’s truth or falsity.  For Peterson, the standard of the moral truth – i.e., of the goodness – of an idea is that the effect of the using or acting upon an idea is ultimately pro-survival (of the individual, or a number of individuals, or all of humanity).</li><li>Peterson isn’t so much ascribing to a coherence theory of truth, its more a pragmatic form of Nietzsche’s Perspectivism. Perspectivism would hold that there are no objective metaphysical truths, or if there are they are completely unknowable so it doesn’t matter anyways. This is a bit rooted in subjective idealism and phenomology and existenitalism…something something about consciousness/mind being fundamental, that reality is only the perceptions of human consciouness and not in any way independently existening. And then you add on the Will to Power and the human Will being the central force in the universe, yada yada yada. (We are talking about a literal madman here…) So with that basis every Will is subjected to its perspectives, its own way of interpreting its perceptions. Thus no truth is absolute and objective, for any such truth would need to be capable of transcending all limits on perception. </li><li>My understanding is that Peterson argues that human interaction and agency works through logos and narrative, and so can be considered a separate system from objective, scientific reality. Following from that, he says that the narrative structure is embedded in the psyche, and its archetypes can embody psychological truths that he considers more meaningful than scientific truths.</li></ol><p>Keep in mind that Peterson fans insist that he speaks with precision and clarity, even though they subscribe to at least five different versions of his definition of truth. So let’s hear what Jordan Peterson himself has to say about truth:</p><ul><li><i>I don’t think facts are necessarily true. So I don’t think this scientiﬁc facts, even if they’re correct from within the domain that they were generated, I don’t think that that necessarily makes them true. And I know that I am gerrymandering the deﬁnition of truth, but I’m doing that on purpose.</i></li><li><i>Your truth is something only you can tell, based as it is on the unique circumstances of your life. Apprehend your personal truth.</i></li></ul><p>Now, what other school of thought do we know that insists truth depends upon adherence to a narrative? Contrast those seven definitions of truth with the two that I favor:</p><ul><li>Aristotle: <i>To say that that which is, is not or that which is not is, is a falsehood; and to say that that which is, is and that which is not is not, is true.</i></li><li>Jesus Christ: <i>Let your Yes be Yes, and your No, No. For whatever is more than these is from the evil one.</i></li></ul><p>In any event, I believe I have finally ascertained the central purpose of Jordanetics and identified the core of Jordan Peterson’s perception of himself as a world savior, thanks to <i>Maps of Meaning</i>. I will go into more detail in a future post and Darkstream, but in essence, Jordanetics is the consequence of the failure of the New Atheism and the neo-liberal world order, particularly as it relates to immigration. No one can believe in the sexy secular science fiction future anymore, and the fruits of mass immigration and multiculturalism have created a growing longing for the Western societal ideal of 1950s Christian White America, which, unlike all the various alternatives proposed, has the benefit of actually having existed and known to function more or less as advertised.</p><p>Jordanetics is a desperate attempt to stave off the grand historical trends presently playing out, to prevent the pendulum from swinging back, to avert the growing pressure to rebuild Western societies that are European and Christian. But it won’t work, it <i>can’t </i>work, because by every historical and sociological measure, Man is long overdue for war on a societal level, if not a civilizational one. And remember, homogeneous nations have usually risen out of the ashes of heterogeneous empires.</p></div>",
  "content_text": "Just a few of the typical responses of Jordan Peterson’s cargo cultists to my latest critiques. The interesting thing, to me, is the way the goalposts keep moving, and the way they keep getting more hysterical, the more directly I address what their Broken Prophet has written or said.\nI thought Vox Day was supposed to be some deep thinker of the Alt Right (or was it something called The Dark Enlightenment?) I never bothered to follow it up. My Latin is small to none but isn’t Vox Dei the “voice of God”? Hard to take someone with that handle seriously. Now I see all these meandering videos attacking JBP and his book.  VD’s attacks are embarrasingly weak. If he doesn’t like JBP’s squeals against The Right he should just suck it up and watch the drama.\nThis video is reminiscent of a Cenk Uygur TYT hit piece. You sir, have not represented yourself well here.﻿\nYou are a fucking moron. He’s never claimed to be of the Left, on the Right, conservative, Christian,……..nothing. Your straw-manning and emotionally driven OPINION of what he may or may not be is no criticism. You Vox, don’t define Conservatism, Christianity, philosophy, psychology, and certainly not Jordan Peterson with your armchair quarter-backing sideline “criticisms”.﻿\nI’d like to show you how much of a Gamma male you are now Vox, and not you 6th grade self either. You are pompous, self-aggrandizing coward. You sir, are a jealous loser.﻿\nYour such a scrounge little bitch Vox.﻿\nWow. Rekt. Wait, no, it’s just more self congratulatory Vox Day overestimating himself as he’s been doing for decades.﻿\nHow do you know what someone thinks without direct engagement of question and answer to clarify? That is communication 101.﻿\nNew it! All this a ploy for you to get attention. Dude Peterson doesnt even know you exist. Peterson fans barely know you exist.﻿ He became an intellectual figure through his book Maps of Meaning and his peer reviewed studies that have over 10,000 citations. Your a bloger and failed writer.﻿\nDude. You have less then 3k subscribers. Your comment section on that video is bellow 300. The only People watching you and agreeing with are your mindless fans. How bad do you have be at this game to have been around for a decade, upload regularly, appear on big shows like Stefans and only 2.4k subs. Your a hack.\nThis guy is projecting harder than anyone I’ve ever seen﻿.\nObviously, you have neither read Maps of Meaning nor watched his lectures. JP is a psychologist not a philosopher like you. JP is writing for an audience of lower IQ , immature folks. You are not his audience.\nIt honestly just seems like you’re trying to get attention and are jealous of his success﻿\nVox seems to be jealous of petersons succes. You have become irrelevant vox﻿\nWhat seems nuts to me is devoting so much time to a man you obviously disrespect. Why does it bother you so bad that a great many people resonate with Peterson and seem to be helped by him? When you write your book let’s see how well it sells. You come across as a jealous narcissist. Maybe people like Peterson because he doesn’t talk down to them. I got more out of just the contents page of his book than your entire video. Grandiose word salad is a perfect description if you look in the mirror. Would love to see a debate between a man with common sense and one with a chip on his shoulder. Good luck with your Sour Grapes series.﻿﻿\nAn interesting way to defend the man who supposedly encourages criticism, to be sure. The other thing that is interesting about the responses to my critiques is the way that the definitions of Jordan Peterson’s “truth” keep growing in number. Here are four of the various definitions presently on offer.\nIf you are going to go for a definition of truth that JBP subscribes to, one should probably go with the one that JBP mentions: pragmatism and the book that he recommends:\nThe Metaphysical Club\nby Louis Menand.\nPeterson subscribes to a pragmatist version of the Coherence theory of truth…. On Peterson’s stated theory of truth, an idea can be thought to be true (or false) at a “micro” or “proximal” level – e.g., at the level of a scientific experiment, or at some other level that does not take the morality of the idea into account – yet actually be false (or true) at a “macro” or “distal” level that includes a consideration of whether the idea is pro-survival or anti-survival (i.e., good or evil). For Peterson, it is the macro/distal level – the level that includes a consideration of the morality of the effects of an idea – that determines the idea’s truth or falsity.  For Peterson, the standard of the moral truth – i.e., of the goodness – of an idea is that the effect of the using or acting upon an idea is ultimately pro-survival (of the individual, or a number of individuals, or all of humanity).\nPeterson isn’t so much ascribing to a coherence theory of truth, its more a pragmatic form of Nietzsche’s Perspectivism. Perspectivism would hold that there are no objective metaphysical truths, or if there are they are completely unknowable so it doesn’t matter anyways. This is a bit rooted in subjective idealism and phenomology and existenitalism…something something about consciousness/mind being fundamental, that reality is only the perceptions of human consciouness and not in any way independently existening. And then you add on the Will to Power and the human Will being the central force in the universe, yada yada yada. (We are talking about a literal madman here…) So with that basis every Will is subjected to its perspectives, its own way of interpreting its perceptions. Thus no truth is absolute and objective, for any such truth would need to be capable of transcending all limits on perception.\nMy understanding is that Peterson argues that human interaction and agency works through logos and narrative, and so can be considered a separate system from objective, scientific reality. Following from that, he says that the narrative structure is embedded in the psyche, and its archetypes can embody psychological truths that he considers more meaningful than scientific truths.\nKeep in mind that Peterson fans insist that he speaks with precision and clarity, even though they subscribe to at least five different versions of his definition of truth. So let’s hear what Jordan Peterson himself has to say about truth:\nI don’t think facts are necessarily true. So I don’t think this scientiﬁc facts, even if they’re correct from within the domain that they were generated, I don’t think that that necessarily makes them true. And I know that I am gerrymandering the deﬁnition of truth, but I’m doing that on purpose.\nYour truth is something only you can tell, based as it is on the unique circumstances of your life. Apprehend your personal truth.\nNow, what other school of thought do we know that insists truth depends upon adherence to a narrative? Contrast those seven definitions of truth with the two that I favor:\nAristotle:\nTo say that that which is, is not or that which is not is, is a falsehood; and to say that that which is, is and that which is not is not, is true.\nJesus Christ:\nLet your Yes be Yes, and your No, No. For whatever is more than these is from the evil one.\nIn any event, I believe I have finally ascertained the central purpose of Jordanetics and identified the core of Jordan Peterson’s perception of himself as a world savior, thanks to\nMaps of Meaning\n. I will go into more detail in a future post and Darkstream, but in essence, Jordanetics is the consequence of the failure of the New Atheism and the neo-liberal world order, particularly as it relates to immigration. No one can believe in the sexy secular science fiction future anymore, and the fruits of mass immigration and multiculturalism have created a growing longing for the Western societal ideal of 1950s Christian White America, which, unlike all the various alternatives proposed, has the benefit of actually having existed and known to function more or less as advertised.\nJordanetics is a desperate attempt to stave off the grand historical trends presently playing out, to prevent the pendulum from swinging back, to avert the growing pressure to rebuild Western societies that are European and Christian. But it won’t work, it\ncan’t\nwork, because by every historical and sociological measure, Man is long overdue for war on a societal level, if not a civilizational one. And remember, homogeneous nations have usually risen out of the ashes of heterogeneous empires.",
  "tags": [
    "mailvox"
  ],
  "categories": [],
  "sitemap_lastmod": "2018-05-08T15:51:33+00:00"
}