{
  "url": "https://voxday.net/2018/05/06/why-i-am-crucifying-the-crazy-christ/",
  "scraped_at": "2025-12-19T21:00:41.707276",
  "title": "Why I am crucifying the Crazy Christ",
  "date_display": "May 6, 2018",
  "date_iso": "2018-05-06T15:23:06+00:00",
  "date_from_url": "2018-05-06",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>Because that is what one should do with false prophets who attempt to pass off madness and lies as truth. Real, objective, Aristotelian correspondent truth.</p><p>I find it mildly amusing that Jordan Peterson’s dismayed fans don’t seem to realize that their responses to my recent Darkstreams <a href=\"https://www.youtube.com/watch?v=pi3OrIT1gbs\">on the subject</a> such as the one below don’t dissuade me in the slightest, but to the contrary, confirm for me that they are very, very nervous about their hero’s ability to successfully defend himself from my critical analysis.</p><p><i>What is basically going on here: “SJWs Always Double Down” isn’t selling nearly as well as its predecessor and so you are trying to attract attention, and more potential sales, by attacking one of currently hottest public figures. What happened to you man? You used to be one of good guys but now you are bitter, shallow, barely eloquent and on your way to joining other online right has-beens like Nick Land &amp; co.</i></p><p>What happened to me is that I caught the unmistakable scent of bullshit and sulfur. Contrast the response of the Peterson fan with the response of the Dread Ilk to people like Greg Johnson and Andrew Anglin calling me out. The Dread Ilk knew they had no need to defend me, and they also knew that I would not hesitate to face my critics directly in order to <a href=\"https://archive.org/details/youtube-j72M9wHvEzw\">defend my case against the Fake Right</a>. Peterson’s fans, to the contrary, appear to be well-aware that he fears to even address the fact of my existence, let alone attempt to answer for his intellectual crimes.</p><p>Jordan Peterson set off my BS radar like no one since Paul Krugman and his repeated post-2008 attempts to claim that <a href=\"https://www.jeremyrhammond.com/2013/11/22/yes-paul-krugman-actually-did-call-for-a-housing-bubble-in-2002/\">he never called for a housing bubble</a>, and I quickly noticed the bizarre way in which Peterson’s fans were repeatedly offering multiple different and contradictory alibis for his intellectual crimes, but I had <i>no idea</i> that the Crazy Christ was building up an quasi-cult around him to make the now-defunct New Atheist fan club of Richard Dawkins look downright moderate and sane.</p><p>Consider, for example, the following comments, all culled from a single video of an appearance on Stefan Molyneux’s show.</p><ul><li><i>Genius is not a strong enough word to describe the level of insight Jordan Peterson has into the world. Wow, he’s impressive on the worst of days but this one just absolutely blew me away.</i></li><li><i>the word you are looking for to describe JBP is a prophet, or someone who can see into the future and correct and sort things out now while there’s still time.﻿</i></li><li><i>One of the two most important voices in the world today.﻿</i></li><li><i>Dr. Peterson is such an impressive man. In ~1 year of watching and listening to his lectures and speeches/debates I learned more about myself, society, mythology and religion than I did in 4 years of college.</i></li><li><i>my hero emerging in a time of darkness.﻿</i></li><li><i>We in the West, are fortunate to have this great mind during this time of great social turmoil, to guide us and to help us understand and survive the coming deluge of this media manufactured communist typhoon.﻿</i></li><li><i>This great man embodies the emergence of the hero in a positively inspiring way.</i></li><li><i>The world’s center of gravity is always located with Dr. Peterson.﻿</i></li><li><i>Anyone at any age can improve themselves and find missing meaning. Dr. Peterson has been essentially my advisor through his YouTube videos, online tools and books. What a gift he is to humanity.﻿</i></li><li><i>Another fascinating discussion with one of our age’s great minds﻿.</i></li><li><i>If one does not comprehend Jordan Peterson, one does not comprehend the warrior.﻿</i></li><li><i>Jordan Peterson – what a mind!  Impressive – also, I noticed that the question that they were rhetorically asking earlier in the show got answered later in the show.  It was about why Christianity – desert religion – would have found such fertile ground in Europe.  And the answer was all about sacrifice – the whole idea about Jesus being sacrificed for people’s sins, meshing with the sacrifice of present consumption for future planning and storage for a tough winter in Europe. </i></li><li><i>Jordan Peterson is a genius person’s smart person.﻿</i></li><li><i>Jordan Peterson is the most interesting person I have ever heard speak.</i></li><li><i>Jordan Peterson, the new almighty.</i></li><li><i>Thank you Mr Peterson for saving my generation.﻿</i></li><li><i>My first time really watching Peterson. He is quite wise and sharp as most consider him, and he seems pretty genuine and well meaning as well. </i></li><li><i>Jordan Peterson at his brilliant best. This man is a gift to humanity. Unfortunately most of humanity cannot even settle long enough to hear him and understand.﻿</i></li></ul><p>There aren’t enough hands on the planet for all the facepalms required. And the fact that the Crazy Christ has now publicly aligned himself with <a href=\"http://www.wnd.com/2005/08/32037/\">the Littlest Chickenhawk</a> merely serves to further confirm my sense of the man, to the extent one can even call him that.</p><p>After all, if we are to utilize what we are informed is the Coherence Theory of Truth to which Peterson supposedly adheres, the truth is that within my specified set of propositions and beliefs is the firmly held belief that a man does not cry in public, much less on camera, over anything less than the death of a) a close friend, b) a family member, or c) his dog. It is both consistent and coherent with that belief to state that since Jordan Peterson cries on camera like a girl on a reality television show who failed to get into either of her two preferred sororities, that property is sufficient to prove the coherent truth of the matter. Which is to say that it is coherently true to observe that the Crazy Christ is neither god nor man.</p><p>But to return to a perspective based on the Aristotelian Correspondence Theory of Truth, and therefore, to the real objective world we all actually inhabit, Jordan Peterson is a smart, sensitive man with a broken mind who is little more than a purveyor of psychological snake oil and pernicious philosophy. He is <a href=\"https://www.esquire.com/news-politics/a19834137/jordan-peterson-interview/?src=socialflowTW\">a parody of a prophet</a>, an enemy of Christianity and Western civilization, and there is very little “correspondent truth” in him or in his endless, meandering self-dialogue.</p><p><i>Peterson’s intellectual project is exceedingly immodest, and can be stated in a sentence: He aims at nothing short of a refounding of Western civilization, to provide a rational justification for why the materialists of the digital age should root themselves in the soil of Christian ethics despite having long ago lost the capacity for faith.</i></p><p>That being said, you need not accept my conclusions now. I am merely, as is my custom, calling my shot. I have not even begun to present my case, let alone prove it conclusively. But if you want an idea of what is coming down the pike, you might want to give a listen to a few of <a href=\"https://www.amazon.com/Irrational-Atheist-Dissecting-Trinity-Hitchens/dp/B01NBNFXUK\">my previous vivisections</a>.</p></div>",
  "content_text": "Because that is what one should do with false prophets who attempt to pass off madness and lies as truth. Real, objective, Aristotelian correspondent truth.\nI find it mildly amusing that Jordan Peterson’s dismayed fans don’t seem to realize that their responses to my recent Darkstreams\non the subject\nsuch as the one below don’t dissuade me in the slightest, but to the contrary, confirm for me that they are very, very nervous about their hero’s ability to successfully defend himself from my critical analysis.\nWhat is basically going on here: “SJWs Always Double Down” isn’t selling nearly as well as its predecessor and so you are trying to attract attention, and more potential sales, by attacking one of currently hottest public figures. What happened to you man? You used to be one of good guys but now you are bitter, shallow, barely eloquent and on your way to joining other online right has-beens like Nick Land & co.\nWhat happened to me is that I caught the unmistakable scent of bullshit and sulfur. Contrast the response of the Peterson fan with the response of the Dread Ilk to people like Greg Johnson and Andrew Anglin calling me out. The Dread Ilk knew they had no need to defend me, and they also knew that I would not hesitate to face my critics directly in order to\ndefend my case against the Fake Right\n. Peterson’s fans, to the contrary, appear to be well-aware that he fears to even address the fact of my existence, let alone attempt to answer for his intellectual crimes.\nJordan Peterson set off my BS radar like no one since Paul Krugman and his repeated post-2008 attempts to claim that\nhe never called for a housing bubble\n, and I quickly noticed the bizarre way in which Peterson’s fans were repeatedly offering multiple different and contradictory alibis for his intellectual crimes, but I had\nno idea\nthat the Crazy Christ was building up an quasi-cult around him to make the now-defunct New Atheist fan club of Richard Dawkins look downright moderate and sane.\nConsider, for example, the following comments, all culled from a single video of an appearance on Stefan Molyneux’s show.\nGenius is not a strong enough word to describe the level of insight Jordan Peterson has into the world. Wow, he’s impressive on the worst of days but this one just absolutely blew me away.\nthe word you are looking for to describe JBP is a prophet, or someone who can see into the future and correct and sort things out now while there’s still time.﻿\nOne of the two most important voices in the world today.﻿\nDr. Peterson is such an impressive man. In ~1 year of watching and listening to his lectures and speeches/debates I learned more about myself, society, mythology and religion than I did in 4 years of college.\nmy hero emerging in a time of darkness.﻿\nWe in the West, are fortunate to have this great mind during this time of great social turmoil, to guide us and to help us understand and survive the coming deluge of this media manufactured communist typhoon.﻿\nThis great man embodies the emergence of the hero in a positively inspiring way.\nThe world’s center of gravity is always located with Dr. Peterson.﻿\nAnyone at any age can improve themselves and find missing meaning. Dr. Peterson has been essentially my advisor through his YouTube videos, online tools and books. What a gift he is to humanity.﻿\nAnother fascinating discussion with one of our age’s great minds﻿.\nIf one does not comprehend Jordan Peterson, one does not comprehend the warrior.﻿\nJordan Peterson – what a mind!  Impressive – also, I noticed that the question that they were rhetorically asking earlier in the show got answered later in the show.  It was about why Christianity – desert religion – would have found such fertile ground in Europe.  And the answer was all about sacrifice – the whole idea about Jesus being sacrificed for people’s sins, meshing with the sacrifice of present consumption for future planning and storage for a tough winter in Europe.\nJordan Peterson is a genius person’s smart person.﻿\nJordan Peterson is the most interesting person I have ever heard speak.\nJordan Peterson, the new almighty.\nThank you Mr Peterson for saving my generation.﻿\nMy first time really watching Peterson. He is quite wise and sharp as most consider him, and he seems pretty genuine and well meaning as well.\nJordan Peterson at his brilliant best. This man is a gift to humanity. Unfortunately most of humanity cannot even settle long enough to hear him and understand.﻿\nThere aren’t enough hands on the planet for all the facepalms required. And the fact that the Crazy Christ has now publicly aligned himself with\nthe Littlest Chickenhawk\nmerely serves to further confirm my sense of the man, to the extent one can even call him that.\nAfter all, if we are to utilize what we are informed is the Coherence Theory of Truth to which Peterson supposedly adheres, the truth is that within my specified set of propositions and beliefs is the firmly held belief that a man does not cry in public, much less on camera, over anything less than the death of a) a close friend, b) a family member, or c) his dog. It is both consistent and coherent with that belief to state that since Jordan Peterson cries on camera like a girl on a reality television show who failed to get into either of her two preferred sororities, that property is sufficient to prove the coherent truth of the matter. Which is to say that it is coherently true to observe that the Crazy Christ is neither god nor man.\nBut to return to a perspective based on the Aristotelian Correspondence Theory of Truth, and therefore, to the real objective world we all actually inhabit, Jordan Peterson is a smart, sensitive man with a broken mind who is little more than a purveyor of psychological snake oil and pernicious philosophy. He is\na parody of a prophet\n, an enemy of Christianity and Western civilization, and there is very little “correspondent truth” in him or in his endless, meandering self-dialogue.\nPeterson’s intellectual project is exceedingly immodest, and can be stated in a sentence: He aims at nothing short of a refounding of Western civilization, to provide a rational justification for why the materialists of the digital age should root themselves in the soil of Christian ethics despite having long ago lost the capacity for faith.\nThat being said, you need not accept my conclusions now. I am merely, as is my custom, calling my shot. I have not even begun to present my case, let alone prove it conclusively. But if you want an idea of what is coming down the pike, you might want to give a listen to a few of\nmy previous vivisections\n.",
  "tags": [
    "philosophy"
  ],
  "categories": [],
  "sitemap_lastmod": "2018-05-06T14:23:06+00:00"
}