{
  "url": "https://voxday.net/2006/07/12/ferrari-of-feminis/",
  "scraped_at": "2026-01-08T21:12:11.393762",
  "title": "The Ferrari of feminism",
  "date_display": "July 12, 2006",
  "date_iso": "2006-07-12T08:17:00+00:00",
  "date_from_url": "2006-07-12",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>The most astounding thing about feminists is not how they believe the personal is political, it’s how they regard <a href=\"http://pandagon.net/2006/07/11/threats-arent-loudly-announced-they-are-usually-whispered/\">the aggregate as personal</a>:</p><blockquote><p>I would add to Raza’s excellent observation that Materazzi employed the art of the practiced oppressive taunter, which is to create a aura of plausible deniability around himself while provoking his victim to react in a public way that’s sure to bring the criticism on the victim. I’m white and haven’t been on the receiving end of much racist taunting but I’ve been the victim of tons of sexual harassment in my time and 95% of it happens in just this fashion—the assailant creates a sense of privacy in some fashion, either by getting chummy or taking advantage of a situation where there’s either no witnesses or it’s so crowded that your reaction will disturb the peace, and then he drops the taunt, gropes or at worst rapes his victim.</p></blockquote><p>From the Mondiale to rape in two sentences, while slipping in personal victimhood almost effortlessly along the way. <em>Che forza!</em> You have to hand it to her, she is the Ferrari of feminism.  The most amusing thing is the way in which Amanda conveys her envy of those who have been the target of more racist taunting than her, (so sadly handicapped by her unfortunate Caucasian ancestry, oh, to be black!) and how she is quick to establish her cherished victimhood despite that sad dearth of desirable experience.</p><p>I am thinking of designing a game wherein women draw a card which contains a random subject.  It’s like the Kevin Bacon game, except the object is to connect the subject drawn to oppression, or personal victimization (2x points) or rape (3x points) with the minimum number of links.  Bonus points for relevant quotes from Friedan, MacKinnnon, Steinhem or Dworkin or tying it in with a “near-rape experience”.</p><p>It will be right up there with my classic design for Strippers: the card game.  Oh, so Lexus got breast implants?  Well, now she’s got a coke habit too, how do you like that, my friend?</p><p>I also found it interesting how she believes physical violence is a more effective response to groping than verbal confrontation.  Does that mean that men whose butts and pecs get patted by strange women, or whose biceps and triceps are groped <em>with both hands</em> are now approved to punch women in response?  I daresay the average male weightlifter has been groped by women he doesn’t know more often than the average feminist has been groped by men.</p></div>",
  "content_text": "The most astounding thing about feminists is not how they believe the personal is political, it’s how they regard\nthe aggregate as personal\n:\nI would add to Raza’s excellent observation that Materazzi employed the art of the practiced oppressive taunter, which is to create a aura of plausible deniability around himself while provoking his victim to react in a public way that’s sure to bring the criticism on the victim. I’m white and haven’t been on the receiving end of much racist taunting but I’ve been the victim of tons of sexual harassment in my time and 95% of it happens in just this fashion—the assailant creates a sense of privacy in some fashion, either by getting chummy or taking advantage of a situation where there’s either no witnesses or it’s so crowded that your reaction will disturb the peace, and then he drops the taunt, gropes or at worst rapes his victim.\nFrom the Mondiale to rape in two sentences, while slipping in personal victimhood almost effortlessly along the way.\nChe forza!\nYou have to hand it to her, she is the Ferrari of feminism.  The most amusing thing is the way in which Amanda conveys her envy of those who have been the target of more racist taunting than her, (so sadly handicapped by her unfortunate Caucasian ancestry, oh, to be black!) and how she is quick to establish her cherished victimhood despite that sad dearth of desirable experience.\nI am thinking of designing a game wherein women draw a card which contains a random subject.  It’s like the Kevin Bacon game, except the object is to connect the subject drawn to oppression, or personal victimization (2x points) or rape (3x points) with the minimum number of links.  Bonus points for relevant quotes from Friedan, MacKinnnon, Steinhem or Dworkin or tying it in with a “near-rape experience”.\nIt will be right up there with my classic design for Strippers: the card game.  Oh, so Lexus got breast implants?  Well, now she’s got a coke habit too, how do you like that, my friend?\nI also found it interesting how she believes physical violence is a more effective response to groping than verbal confrontation.  Does that mean that men whose butts and pecs get patted by strange women, or whose biceps and triceps are groped\nwith both hands\nare now approved to punch women in response?  I daresay the average male weightlifter has been groped by women he doesn’t know more often than the average feminist has been groped by men.",
  "tags": [],
  "categories": [],
  "sitemap_lastmod": "2006-07-12T07:17:00+00:00"
}