{
  "url": "https://voxday.net/2006/07/21/i-hope-you-dont-hold-it-against-me/",
  "scraped_at": "2026-01-08T21:12:54.602719",
  "title": "I hope you don’t hold it against me",
  "date_display": "July 21, 2006",
  "date_iso": "2006-07-21T13:10:00+00:00",
  "date_from_url": "2006-07-21",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p><a href=\"http://pandagon.net/2006/07/19/congratulations-whether-you-like-it-or-not-you-are-at-least-asshole-of-the-week/\">that I killed your baby</a>….  Unsurprisingly, the High Priestess of Cthulhu’s Coven is primarily worried about the woman’s mental health.  Screw the kid.  Screw the guy who would otherwise have been expected to provide for, protect and love that child.  Because it’s all about what women want right now… in nine years, that same woman will probably be single and getting shot up with fertility drugs and anonymously donated sperm.</p><blockquote><p><em>I strongly suspect that my wife’s miscarriage last year was intentional, i.e., she had an induced abortion. At the time we were both 31 years old with a combined income of just over 100K. We were married for about a year. My wife was on medication for depression and anxiety (Paxil with the occasional Xanax). The pregnancy was unplanned and she expressed a desire to terminate the pregnancy a few days after we found out, saying she wasn’t ready to have kids yet, maybe in another year. I really wanted to have a baby and was very upset that she felt this way. We made an appointment for counseling about two weeks out. However, prior to that she claims she had a miscarriage.</em></p><p>From the sound of his letter, I suspect he’s right that his wife is lying to him. He doesn’t really sound like the kind of guy you can tell the truth to, since the options he gave her when she told the truth were, “Have a baby against your will” or “Be harangued until it’s too late for you to terminate.”</p></blockquote><p>If he harbored such serious doubts as to her veracity, this guy should have gone ahead and examined his wife’s medical records, because as Amanda clearly demonstrates, merely believing that you have the right to an opinion about your wife’s desire to murder your unborn child makes you an evil person anyhow.  You’re already there, dude, might as well learn the truth.</p><p>I wouldn’t hesitate to recommend an immediate slashing of ties to a man whose wife secretly aborted his child, much less one who is evidently a neurotic murderess.  (I’m sorry, perhaps you’d prefer “is receiving chemical treatment for mental instability and was not ready for motherhood”.)  The first duty of a man is to protect his children, and that includes protecting them from their mother if necessary.</p><p>As usual, feminists want it both ways.  They want women to be able to murder a child if she doesn’t want it, but they want to use Big Daddy Government to make a man who doesn’t want a child to provide for it and its mother for 18 years.  This makes no sense, but then, if feminists were capable of grasping logic, they wouldn’t be feminists.  Equality demands that a man have an equal right to reject responsibility for a child he does not want, which is only one of the many reasons that I reject the concept of equality.</p><p>Anyhow, I don’t see why anyone would ever marry a woman who believes in abortion rights in the first place.  If she buys into that reasoning, she’ll buy into the idea that marriage is an outmoded, unnecessary and Patriarchal institution oppressive to women too.  Run that one past her a few times along with a few strategically-timed Friedan quotes and she’ll soon feel guilty for even wanting to get married, let alone pressuring you for it.</p><p>UPDATE – Coven member JBR adds this:</p><blockquote><p>Does my husband have an interest on whether I take birth control pills for menstrual suppression? Whether I have an epidural for my child’s birth? Whether I breastfeed? How far does his opinion hold when it’s my body?</p></blockquote><p>Well, I’m sure men will be glad to relinquish any interest in that sort of thing just as soon as women relinquish their interest in what men put in their bodies.  It seems to me I’ve heard more women expressing a strong belief that they have some say in what their men eat, drink, smoke, dip and snort in a week than I’ve ever heard about epidurals in a lifetime.</p><p>So remember that the next time your girlfriend makes a disapproving face and a comment about how she doesn’t think you need that tequila shot.  “Keep your matriarchy off of my body!”</p></div>",
  "content_text": "that I killed your baby\n….  Unsurprisingly, the High Priestess of Cthulhu’s Coven is primarily worried about the woman’s mental health.  Screw the kid.  Screw the guy who would otherwise have been expected to provide for, protect and love that child.  Because it’s all about what women want right now… in nine years, that same woman will probably be single and getting shot up with fertility drugs and anonymously donated sperm.\nI strongly suspect that my wife’s miscarriage last year was intentional, i.e., she had an induced abortion. At the time we were both 31 years old with a combined income of just over 100K. We were married for about a year. My wife was on medication for depression and anxiety (Paxil with the occasional Xanax). The pregnancy was unplanned and she expressed a desire to terminate the pregnancy a few days after we found out, saying she wasn’t ready to have kids yet, maybe in another year. I really wanted to have a baby and was very upset that she felt this way. We made an appointment for counseling about two weeks out. However, prior to that she claims she had a miscarriage.\nFrom the sound of his letter, I suspect he’s right that his wife is lying to him. He doesn’t really sound like the kind of guy you can tell the truth to, since the options he gave her when she told the truth were, “Have a baby against your will” or “Be harangued until it’s too late for you to terminate.”\nIf he harbored such serious doubts as to her veracity, this guy should have gone ahead and examined his wife’s medical records, because as Amanda clearly demonstrates, merely believing that you have the right to an opinion about your wife’s desire to murder your unborn child makes you an evil person anyhow.  You’re already there, dude, might as well learn the truth.\nI wouldn’t hesitate to recommend an immediate slashing of ties to a man whose wife secretly aborted his child, much less one who is evidently a neurotic murderess.  (I’m sorry, perhaps you’d prefer “is receiving chemical treatment for mental instability and was not ready for motherhood”.)  The first duty of a man is to protect his children, and that includes protecting them from their mother if necessary.\nAs usual, feminists want it both ways.  They want women to be able to murder a child if she doesn’t want it, but they want to use Big Daddy Government to make a man who doesn’t want a child to provide for it and its mother for 18 years.  This makes no sense, but then, if feminists were capable of grasping logic, they wouldn’t be feminists.  Equality demands that a man have an equal right to reject responsibility for a child he does not want, which is only one of the many reasons that I reject the concept of equality.\nAnyhow, I don’t see why anyone would ever marry a woman who believes in abortion rights in the first place.  If she buys into that reasoning, she’ll buy into the idea that marriage is an outmoded, unnecessary and Patriarchal institution oppressive to women too.  Run that one past her a few times along with a few strategically-timed Friedan quotes and she’ll soon feel guilty for even wanting to get married, let alone pressuring you for it.\nUPDATE – Coven member JBR adds this:\nDoes my husband have an interest on whether I take birth control pills for menstrual suppression? Whether I have an epidural for my child’s birth? Whether I breastfeed? How far does his opinion hold when it’s my body?\nWell, I’m sure men will be glad to relinquish any interest in that sort of thing just as soon as women relinquish their interest in what men put in their bodies.  It seems to me I’ve heard more women expressing a strong belief that they have some say in what their men eat, drink, smoke, dip and snort in a week than I’ve ever heard about epidurals in a lifetime.\nSo remember that the next time your girlfriend makes a disapproving face and a comment about how she doesn’t think you need that tequila shot.  “Keep your matriarchy off of my body!”",
  "tags": [],
  "categories": [],
  "sitemap_lastmod": "2006-07-21T12:10:00+00:00"
}