{
  "url": "https://voxday.net/2006/07/23/ideal-divider/",
  "scraped_at": "2026-01-08T21:13:05.576038",
  "title": "An ideal divider",
  "date_display": "July 23, 2006",
  "date_iso": "2006-07-23T10:19:00+00:00",
  "date_from_url": "2006-07-23",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>Men who have wondered how to reduce their risk of further divorce finally have an answer:</p><blockquote><p>Once, couples put their children’s needs first. Today, significant numbers are less willing to do so. Asked, “Should a couple stay together for the sake of the children,” 81 percent of today’s women say no, a jump from 51 percent in 1962.</p></blockquote><p>This is an almost perfect identification point.  If you’re involved with a woman, be sure to have one of her female friends ask her that question.  If she answers no, then don’t even think about marrying her, since it’s clear that she puts herself ahead of her children.  If she’s willing to do that, let’s just say that her concern for abiding by any commitment to you will rank somewhere around the level of her interest in Zambian water table levels.</p><p>And note, never ask anyone a significant question about relationships yourself if you want an honest answer.  It’s like asking people if they’d vote for a gay, black woman president.  No one is going to publicly confess that they’d never vote for <s>Condoleeza Rice</s> one, but that doesn’t mean they would actually consider doing so for a second.</p></div>",
  "content_text": "Men who have wondered how to reduce their risk of further divorce finally have an answer:\nOnce, couples put their children’s needs first. Today, significant numbers are less willing to do so. Asked, “Should a couple stay together for the sake of the children,” 81 percent of today’s women say no, a jump from 51 percent in 1962.\nThis is an almost perfect identification point.  If you’re involved with a woman, be sure to have one of her female friends ask her that question.  If she answers no, then don’t even think about marrying her, since it’s clear that she puts herself ahead of her children.  If she’s willing to do that, let’s just say that her concern for abiding by any commitment to you will rank somewhere around the level of her interest in Zambian water table levels.\nAnd note, never ask anyone a significant question about relationships yourself if you want an honest answer.  It’s like asking people if they’d vote for a gay, black woman president.  No one is going to publicly confess that they’d never vote for\nCondoleeza Rice\none, but that doesn’t mean they would actually consider doing so for a second.",
  "tags": [],
  "categories": [],
  "sitemap_lastmod": "2006-07-23T09:19:00+00:00"
}