{
  "url": "https://voxday.net/2006/07/30/in-defense-of-anti-semitism-ii/",
  "scraped_at": "2026-01-08T21:13:47.899539",
  "title": "In defense of anti-semitism II",
  "date_display": "July 30, 2006",
  "date_iso": "2006-07-30T17:19:00+00:00",
  "date_from_url": "2006-07-30",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>From <a href=\"http://www.nytimes.com/2006/07/29/us/29delaware.html?ex=1154404800&amp;en=110051f4a7138b82&amp;ei=5087%0A\">the NY Times</a>:</p><blockquote><p>After her family moved to this small town 30 years ago, Mona Dobrich grew up as the only Jew in school. Mrs. Dobrich, 39, married a local man, bought the house behind her parents’ home and brought up her two children as Jews.  For years, she and her daughter, Samantha, listened to Christian prayers at public school potlucks, award dinners and parent-teacher group meetings, she said. But at Samantha’s high school graduation in June 2004, a minister’s prayer proclaiming Jesus as the only way to the truth nudged Mrs. Dobrich to act….</p><p>The Dobriches eventually sued the Indian River School District, challenging what they asserted was the pervasiveness of religion in the schools and seeking financial damages.</p></blockquote><p>This reads like a caricature of stereotypically Jewish behavior.  If an author made up something like this in a novel, he’d be reasonably castigated for overt anti-semitism.  But if there are any Jews who still can’t figure out why so many people come to hate them, this should serve as a sufficiently explanatory example.  People have been living in this town for hundreds of years, then a single Jewish family moves in and eventually files a lawsuit demanding that literally everyone else in town modify their behavior in order to accomodate their delicate sensibilities and pay them off on top of it.</p><p>This isn’t merely outrageous, it is the sort of behavior more remniscent of an overt agent provocateur than anything else.  And, sure enough, negative results became quickly apparent.</p><p><em>Mrs. Dobrich, who is Orthodox, said that when she was a girl, Christians here had treated her faith with respectful interest. Now, she said, her son was ridiculed in school for wearing his yarmulke. She described a classmate of his drawing a picture of a pathway to heaven for everyone except “Alex the Jew.”</em></p><p>In other words, the townspeople were perfectly happy to leave her alone and allow her to live her life in peace as long as she was willing to do likewise.  Then, their latent “anti-semitism” appeared as if by magic once she started filing lawsuits against them in an attempt to exert control over their behavior.  No doubt the townspeople would have been just fine with everything had it only been a Hindu or a Muslim trying to wax dictatorial….</p><p>It seems that some particularly short-sighted Jews are eager to expand the definition of anti-semitism to encompass a desire to live according to one’s own beliefs.  If so, they should not be surprised when everyone who values individual freedom then embraces anti-semitism.  Already the once-explosive charge has become ineffectual in Europe, where political leaders on the right and the left alike are immune from it, and if Jews continue to behave in the reprehensibly boorish and dictatorial manner exhibited by Mrs. Dobrich, they will fully deserve any future unpopularity in the USA as well.</p><p>I’m not anti-semitic myself, (at least by the classic definition of <em>Judenhassen</em>, although by Abe Foxman’s expansive definition, I, along with every animal, vegetable and mineral on the planet, would be), I’m sure my Jewish business partner would take at least passing exception to that.  And I fully support Israel’s right to attack Hezbollah in response to an open act of war, even if their attempt to win by the use of air power is doomed to failure.  But it’s not hard to understand how anti-semitism develops as a response to what appear to be intentional acts of provocation such as Mrs. Dobrich’s.  As I’ve written previously <a href=\"http://www.voxday.net/archive/2002/073002.html\">in a column entitled “Christkillers”</a>, I think there is a spiritual element to this as well, but this cycle of provoke-and-suffer appears to be the way in which that spiritual element repeatedly creates such predictable ill will.</p></div>",
  "content_text": "From\nthe NY Times\n:\nAfter her family moved to this small town 30 years ago, Mona Dobrich grew up as the only Jew in school. Mrs. Dobrich, 39, married a local man, bought the house behind her parents’ home and brought up her two children as Jews.  For years, she and her daughter, Samantha, listened to Christian prayers at public school potlucks, award dinners and parent-teacher group meetings, she said. But at Samantha’s high school graduation in June 2004, a minister’s prayer proclaiming Jesus as the only way to the truth nudged Mrs. Dobrich to act….\nThe Dobriches eventually sued the Indian River School District, challenging what they asserted was the pervasiveness of religion in the schools and seeking financial damages.\nThis reads like a caricature of stereotypically Jewish behavior.  If an author made up something like this in a novel, he’d be reasonably castigated for overt anti-semitism.  But if there are any Jews who still can’t figure out why so many people come to hate them, this should serve as a sufficiently explanatory example.  People have been living in this town for hundreds of years, then a single Jewish family moves in and eventually files a lawsuit demanding that literally everyone else in town modify their behavior in order to accomodate their delicate sensibilities and pay them off on top of it.\nThis isn’t merely outrageous, it is the sort of behavior more remniscent of an overt agent provocateur than anything else.  And, sure enough, negative results became quickly apparent.\nMrs. Dobrich, who is Orthodox, said that when she was a girl, Christians here had treated her faith with respectful interest. Now, she said, her son was ridiculed in school for wearing his yarmulke. She described a classmate of his drawing a picture of a pathway to heaven for everyone except “Alex the Jew.”\nIn other words, the townspeople were perfectly happy to leave her alone and allow her to live her life in peace as long as she was willing to do likewise.  Then, their latent “anti-semitism” appeared as if by magic once she started filing lawsuits against them in an attempt to exert control over their behavior.  No doubt the townspeople would have been just fine with everything had it only been a Hindu or a Muslim trying to wax dictatorial….\nIt seems that some particularly short-sighted Jews are eager to expand the definition of anti-semitism to encompass a desire to live according to one’s own beliefs.  If so, they should not be surprised when everyone who values individual freedom then embraces anti-semitism.  Already the once-explosive charge has become ineffectual in Europe, where political leaders on the right and the left alike are immune from it, and if Jews continue to behave in the reprehensibly boorish and dictatorial manner exhibited by Mrs. Dobrich, they will fully deserve any future unpopularity in the USA as well.\nI’m not anti-semitic myself, (at least by the classic definition of\nJudenhassen\n, although by Abe Foxman’s expansive definition, I, along with every animal, vegetable and mineral on the planet, would be), I’m sure my Jewish business partner would take at least passing exception to that.  And I fully support Israel’s right to attack Hezbollah in response to an open act of war, even if their attempt to win by the use of air power is doomed to failure.  But it’s not hard to understand how anti-semitism develops as a response to what appear to be intentional acts of provocation such as Mrs. Dobrich’s.  As I’ve written previously\nin a column entitled “Christkillers”\n, I think there is a spiritual element to this as well, but this cycle of provoke-and-suffer appears to be the way in which that spiritual element repeatedly creates such predictable ill will.",
  "tags": [],
  "categories": [],
  "sitemap_lastmod": "2006-07-30T16:19:00+00:00"
}