{
  "url": "https://voxday.net/2006/07/05/its-frogs-v-wogs/",
  "scraped_at": "2026-01-08T21:11:46.701840",
  "title": "It’s Frogs v. Wogs",
  "date_display": "July 5, 2006",
  "date_iso": "2006-07-05T21:13:00+00:00",
  "date_from_url": "2006-07-05",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>France looked rather tired tonight, although they were still much better than a very shady Portugeuse team.  I counted no less than six yellows that should have been given for “simulation”, as the Portos were going down untouched in the box every time a ball came within eight feet of them.  I did enjoy the way in which Ronaldo was roundly booed every time he touched the ball from start to finish, it’s clear that he is the villain of this World Cup.</p><p>This will be a repeat of the Euro 2000 final, which France won when Trezeguet scored in extra time.  However, I don’t think France can do it a second time because Lippi is a much better manager than Domenech.  You could see the difference between the two managers rather clearly by comparing the way in which the Italians continued to push forward and finished off the last two minutes of the extra time with how France sat on a one-goal lead for an entire half.  As happened in Korea, they nearly came to grief at the end with an ill-timed combination of blunders; had it not been for a poorly timed offsides run by Pauleta, they would have found themselves in extra time as well.</p><p>Domenech’s worst move was substituting Louis Saha for Thierry Henry with five minutes left.  Instead of putting in David Trezeguet, a serviceable striker from a little club called Juventus of which you may have heard, he puts in Saha <em>who is already on a yellow</em>!  Naturally, being a striker called into defensive duty, Saha commits a stupid foul, picks up a yellow and is out for the final.  Brilliant… but good for the Azzurri.</p><p>The French do have the experience, but the Italians not only want it more, they need it more considering what they have waiting for them upon their return home.  More than half of the national team players may not even be in Serie A next year, so winning the World Cup is the only way they’ll be able to separate themselves from the Moggi scandal and the madness that is calcio today.  But then, Zizou and Henry have already shown that it is dangerous to count them out, so it should be an entertaining game regardless of how it ends up.</p><p>UPDATE: By the way, I forgot to mention one thing.  You may not have noticed it, but Zinedine Zidane demonstrated again why he is one of the coolest men on the planet.  After the England game, the Portuguese keeper Ricardo said that he had seen fear in the eyes of the England players before the penalty kicks started.  (This was entirely credible, given how the entire English nation was dreading the possibility even before the game started.)  Now, understand that a player taking penalties almost never looks at the goalkeeper in order to avoid giving him a clue as to where he’s going to put the ball.</p><p>But Zidane, after placing the ball on the spot, took one step back then deliberately looked up and met Ricardo’s eyes.  It was as if he asked the question: “Do you see any fear here, my little friend?  I don’t think so.”  One step, bang, and despite Ricardo making a great move on the ball, it was in the back of the net.</p><p>I love Zidane.  Not only is he a world champion and the author of the most unconsciously arrogant statement in sporting history, but he constantly demonstrates that all-too-rare mixture of grace, class and skill.  Enjoy his last international game on Sunday, in victory or defeat he will long be remembered as one of the great ones.</p></div>",
  "content_text": "France looked rather tired tonight, although they were still much better than a very shady Portugeuse team.  I counted no less than six yellows that should have been given for “simulation”, as the Portos were going down untouched in the box every time a ball came within eight feet of them.  I did enjoy the way in which Ronaldo was roundly booed every time he touched the ball from start to finish, it’s clear that he is the villain of this World Cup.\nThis will be a repeat of the Euro 2000 final, which France won when Trezeguet scored in extra time.  However, I don’t think France can do it a second time because Lippi is a much better manager than Domenech.  You could see the difference between the two managers rather clearly by comparing the way in which the Italians continued to push forward and finished off the last two minutes of the extra time with how France sat on a one-goal lead for an entire half.  As happened in Korea, they nearly came to grief at the end with an ill-timed combination of blunders; had it not been for a poorly timed offsides run by Pauleta, they would have found themselves in extra time as well.\nDomenech’s worst move was substituting Louis Saha for Thierry Henry with five minutes left.  Instead of putting in David Trezeguet, a serviceable striker from a little club called Juventus of which you may have heard, he puts in Saha\nwho is already on a yellow\n!  Naturally, being a striker called into defensive duty, Saha commits a stupid foul, picks up a yellow and is out for the final.  Brilliant… but good for the Azzurri.\nThe French do have the experience, but the Italians not only want it more, they need it more considering what they have waiting for them upon their return home.  More than half of the national team players may not even be in Serie A next year, so winning the World Cup is the only way they’ll be able to separate themselves from the Moggi scandal and the madness that is calcio today.  But then, Zizou and Henry have already shown that it is dangerous to count them out, so it should be an entertaining game regardless of how it ends up.\nUPDATE: By the way, I forgot to mention one thing.  You may not have noticed it, but Zinedine Zidane demonstrated again why he is one of the coolest men on the planet.  After the England game, the Portuguese keeper Ricardo said that he had seen fear in the eyes of the England players before the penalty kicks started.  (This was entirely credible, given how the entire English nation was dreading the possibility even before the game started.)  Now, understand that a player taking penalties almost never looks at the goalkeeper in order to avoid giving him a clue as to where he’s going to put the ball.\nBut Zidane, after placing the ball on the spot, took one step back then deliberately looked up and met Ricardo’s eyes.  It was as if he asked the question: “Do you see any fear here, my little friend?  I don’t think so.”  One step, bang, and despite Ricardo making a great move on the ball, it was in the back of the net.\nI love Zidane.  Not only is he a world champion and the author of the most unconsciously arrogant statement in sporting history, but he constantly demonstrates that all-too-rare mixture of grace, class and skill.  Enjoy his last international game on Sunday, in victory or defeat he will long be remembered as one of the great ones.",
  "tags": [],
  "categories": [],
  "sitemap_lastmod": "2006-07-05T20:13:00+00:00"
}