{
  "url": "https://voxday.net/2006/07/14/let-off-lightly/",
  "scraped_at": "2026-01-08T21:12:24.560797",
  "title": "Let off lightly",
  "date_display": "July 14, 2006",
  "date_iso": "2006-07-14T08:45:00+00:00",
  "date_from_url": "2006-07-14",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>From the Corriere della Sera:</p><blockquote><p>Ecco come finirà, almeno secondo la clamorosa anticipazione riportata in prima pagina dalla Gazzetta dello Sport. Juventus, Fiorentina e Lazio retrocesse in serie B. Milan in A , ma senza la possibilità di partecipare alle coppe europee. In più ci sarà una partenza ad handicap molto forte in termini di punti per i bianconeri nella serie cadetta. Penalizzazione di 6-7 punti, invece, per gigliati e biancazzurri. Per la Juventus si parla invece di un handicap di 20 punti. Quanto al Milan, oltre alla sanzione afflittiva da scontare nel campionato appena concluso, in modo da non poter partecipare alle coppe, si parla di una possibile, ma improbabile penalizzazione di 15 punti nel prossimo campionato.</p></blockquote><p><em>It will end like this, at least according to the early report on the first page of the Gazetto dello Sport.  Juventus, Fiorentina and Lazio are relegated to Serie B, AC Milan will stay in Serie A but without the possibility of competing in the European tournaments.  Additionally, there will be a severe handicap for Juve in the lower leage.  The penalty will be 6 or 7 points, instead, for Fiorentina and Lazio.  For Juventus they are talking about a handicap of 20 points.  As for AC Milan, other than the sanctions effected on the season already concluded, which will prevent them from playing in the Champions League or the UEFA Cup, they are talking about the possibile, but unlikely penalty of 15 points next season.</em></p><p>I’m disappointed.  Juve deserved to suffer far worse than either Fiorentina or Lazio, as the entire affair was directed by its president and this is hardly the first time that the <em>bianconeri</em> have been proven to be corrupt, cheating bastards.  I wanted them to go down to Serie C at a minimum, I’m not sure that forcing them to start less than seven games back will prove enough to keep them from bouncing right back to Serie A next season.  Sure, they’ll take a solid financial hit, but that’s meaningless to a team financed by Khadafi’s oil wealth.  What’s ridiculous is that this penalty is harsher on Fiorentina or Lazio than it is on the team most responsible for the entire Calcipoli affair.  I’m glad that Milan hasn’t been too hard hit, though, and it will be interesting to see what is done about the last two tainted scudetti.  If Juve is stripped of both championships but both Milan is deducted points from last season, then theoretically Milan will claim the title from two years ago, but Inter will claim last year’s.</p></div>",
  "content_text": "From the Corriere della Sera:\nEcco come finirà, almeno secondo la clamorosa anticipazione riportata in prima pagina dalla Gazzetta dello Sport. Juventus, Fiorentina e Lazio retrocesse in serie B. Milan in A , ma senza la possibilità di partecipare alle coppe europee. In più ci sarà una partenza ad handicap molto forte in termini di punti per i bianconeri nella serie cadetta. Penalizzazione di 6-7 punti, invece, per gigliati e biancazzurri. Per la Juventus si parla invece di un handicap di 20 punti. Quanto al Milan, oltre alla sanzione afflittiva da scontare nel campionato appena concluso, in modo da non poter partecipare alle coppe, si parla di una possibile, ma improbabile penalizzazione di 15 punti nel prossimo campionato.\nIt will end like this, at least according to the early report on the first page of the Gazetto dello Sport.  Juventus, Fiorentina and Lazio are relegated to Serie B, AC Milan will stay in Serie A but without the possibility of competing in the European tournaments.  Additionally, there will be a severe handicap for Juve in the lower leage.  The penalty will be 6 or 7 points, instead, for Fiorentina and Lazio.  For Juventus they are talking about a handicap of 20 points.  As for AC Milan, other than the sanctions effected on the season already concluded, which will prevent them from playing in the Champions League or the UEFA Cup, they are talking about the possibile, but unlikely penalty of 15 points next season.\nI’m disappointed.  Juve deserved to suffer far worse than either Fiorentina or Lazio, as the entire affair was directed by its president and this is hardly the first time that the\nbianconeri\nhave been proven to be corrupt, cheating bastards.  I wanted them to go down to Serie C at a minimum, I’m not sure that forcing them to start less than seven games back will prove enough to keep them from bouncing right back to Serie A next season.  Sure, they’ll take a solid financial hit, but that’s meaningless to a team financed by Khadafi’s oil wealth.  What’s ridiculous is that this penalty is harsher on Fiorentina or Lazio than it is on the team most responsible for the entire Calcipoli affair.  I’m glad that Milan hasn’t been too hard hit, though, and it will be interesting to see what is done about the last two tainted scudetti.  If Juve is stripped of both championships but both Milan is deducted points from last season, then theoretically Milan will claim the title from two years ago, but Inter will claim last year’s.",
  "tags": [],
  "categories": [],
  "sitemap_lastmod": "2006-07-14T07:45:00+00:00"
}