{
  "url": "https://voxday.net/2015/05/16/400000-comments/",
  "scraped_at": "2025-12-16T12:55:59.194838",
  "title": "400,000 Comments!",
  "date_display": "May 16, 2015",
  "date_iso": "2015-05-16T12:00:00+00:00",
  "date_from_url": "2015-05-16",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><blockquote class=\"tr_bq\"><p> John Scalzi @scalzi<br> Sometime in the last couple of days, my site reached the 400,000 comment marker. That’s, uh, a lot of comments.</br></p></blockquote><p>400,000 comments is certainly a lot of comments. But then, you all know that since you have left 447,022 Blogger comments… since March 2012.</p><p>I keep hearing people claim these metrics don’t matter, but the strange thing is that they observably were said to matter quite a bit a few years ago when media publications from Lightspeed to the New York Times were marveling at Scalzi’s false claims. Not that I doubt his claims to have reached 400k comments, as based on our relative traffic, I assume his commenters were able to do in 7 years what took the commenters here only three. In fact, it was the observable discrepancy between the number of comments and his traffic claims that was the first hint that Johnny Con had a propensity for lying about the latter.</p><p>On a tangential note, since we’re speaking of someone with A DEGREE IN THE PHILOSOPHY OF THE ABUSE OF LANGUAGE or whatever it was, this comment from File 770 is an amusing exercise in completely missing the point:</p><blockquote class=\"tr_bq\"><p> Anna Feruglio Dal Dan on May 15, 2015 at 1:54 am said:<br> This is the point at which, as somebody who has actually STUDIED PHILOSOPHY AT COLLEGE LEVEL, I want to scream and cry.</br></p><p>Don’t get me wrong, Aristotele is a great mind. His contribution to philosophy and the history of human thought has been great, although he did stop science and logic and many other things in their tracks for several centuries – but that was not his fault, as anybody who has read The Name Of The Rose knows (yes, if you are a) Italian and b) a philosophy student, TNOTR is a fun read).</p><p>But he did not invent dialectic and what he meant by it is different from what Socrates, and Plato, and Kant, and Fichte, and Hegel, and Marx, and many others, mean by it. Kant in particular is rather scathing towards Aristotelian dialectic, saying, in short (I don’t have my copy of Critique of Pure Reason with me to check the exact quote) that the ancient Greeks thought they were so smart but they couldn’t reason their way out of a paper bag, which makes sense if you have the mind of Kant.</p><p>I suppose the most widely use of dialectic that I found is the hegelian sense: there are two opposing principles, which Hegel saw as fundamental principles of reality rather than logical propositions, and history proceeds by “finding out” that there is a third fundamental principle that makes both of them not so much false as superseded (well, history is what happens when the third principle unfolds itself, from what I understand of Hegel’s writings, but you know what I mean). This is all very abstract which is why I am not so fond of Hegel, but Marx’s idea of class struggle is a concrete example: there is a class that holds oppressive power over another, and in their interaction there arises a new state of affairs in which there is only one class that is neither the oppressive nor the oppressed one and everybody is happy.</p><p>The scientific method is also an example of dialectic, in a sense: if you want to stretch the definitions somewhat. Say that you contemplate the different models of the solar system, heliocentric and geocentric, and as a matter of fact both are valid explanation of observable facts, until Newton comes along with a better explanation that makes both of the models obsolete. (Yes, I know, gross simplification).</p><p>The history of the concept of dialectic is endlessly fascinating and stimulating. But one of the things any kind of dialectic presupposes is the ability to change, to discover the truth, or at least get endlessly closer to it.</p><p>The fact that somebody might seize on what we have left of the thoughts of a man who lived and died 2,300 years ago and think that that is the be all and end all of human thinking and call that dialectic just shows… well, a monumental lack of knowledge of the rest of the history of Western thought.</p></blockquote><p>Lei non vuole gridare o piangere, invece lei vorebbe solo mostrare che l’ha una laurea in filosofia. In ogni caso, leggevo <i>Il Nome Della Rosa</i> tante volte, in inglese e ancora in italiano, in fatti, ho discusso quel libro due volte col stesso autore. Inoltre anch’io ho preso diversi corsi di filosofia all’universita’. Non significa nulla.</p><p>In any event, for all her very impressive philosophical book-larnin’, the signorina has managed to completely miss the point. I am not ignorant of Kant or Hegel or Marx, and I am perfectly aware that what Aristotle meant by dialectic is very, very different than what later definers of the term meant by it. That’s precisely why I am always careful to explain my reliance upon the <i>Aristotelian </i>form as opposed to the Marxian one I learned from the Marxian economists from whom I obtained my economics degree or any of the others. Instead of showing “a monumental lack of knowledge of the rest of the history of Western thought” on my part, she has demonstrated an impressive quantity of educated stupidity on her own.</p><p>What the signorina is doing is posturing in the modern fashion in which recognition of a thing is expected to pass for genuine knowledge of it. And yet, she doesn’t understand Aristotelian dialectic enough to do more than regurgitate some dimly remembered things she was told about it, or recognize that I am not pretending to make any use of Aristotelian dialectic to prove anything. As it happens, I tend to prefer the Thomistic method despite its various shortcomings.</p><p>All I am doing is utilizing the Aristotelian distinction between the dialectical and rhetorical populations as a useful heuristic that reliably proves useful in distinguishing between serious critics who merit serious responses and unserious ones who merit nothing more than contemptuous dismissal and a rhetorical kick in the empty head. I leave it to the reader to determine which population Ms Dal Dan most clearly belongs.</p><p>I find it reliably amusing to see how they cling to their pose of being intellectually superior and better educated even when they observably don’t understand what they’re reading.</p><p>Meanwhile, Glenn Haumann, the anti-Puppy who publicly called for posting fake reviews on Amazon, suggests a way The Most Despised Man in Science Fiction could rehabilitate himself in the eyes of science fiction fandom:</p><blockquote class=\"tr_bq\"><p> (Of course, science fiction reserves the right to re-evaluate your standing if you’re ever suspected of being involved in pedophilia.)</p></blockquote><p>Apparently all one needs to do is to rape a few minors, unrepentantly  write about it in the most graphic terms, and one can then not unreasonably expect to be named an SFWA Grand Master or win a  World Fantasy Award for Lifetime Achievement Award. From Arthur C. Clarke to Tony Alleyne, from Marion Zimmer Bradley to <a href=\"http://www.sfgate.com/bayarea/article/Charges-shatter-Asimov-son-s-reclusion-3099867.php\">David Asimov</a>,  from Walter Breen to Ed Kramer, the science fiction community is one of the biggest collections of known pedophiles outside the British Parliament.</p><p>The widespread sexual aberrancy in the SF community was one of the many reasons I wanted nothing to do with it after my one mercifully brief encounter with Sad Freakville at Minicon. You have not seen true human wreckage until you’ve been to a science fiction convention. I’ve seen physically and psychologically healthier people on reservations and in refugee camps; one can hardly blame them for being drawn to escapism.</p></div>",
  "content_text": "John Scalzi @scalzi\nSometime in the last couple of days, my site reached the 400,000 comment marker. That’s, uh, a lot of comments.\n400,000 comments is certainly a lot of comments. But then, you all know that since you have left 447,022 Blogger comments… since March 2012.\nI keep hearing people claim these metrics don’t matter, but the strange thing is that they observably were said to matter quite a bit a few years ago when media publications from Lightspeed to the New York Times were marveling at Scalzi’s false claims. Not that I doubt his claims to have reached 400k comments, as based on our relative traffic, I assume his commenters were able to do in 7 years what took the commenters here only three. In fact, it was the observable discrepancy between the number of comments and his traffic claims that was the first hint that Johnny Con had a propensity for lying about the latter.\nOn a tangential note, since we’re speaking of someone with A DEGREE IN THE PHILOSOPHY OF THE ABUSE OF LANGUAGE or whatever it was, this comment from File 770 is an amusing exercise in completely missing the point:\nAnna Feruglio Dal Dan on May 15, 2015 at 1:54 am said:\nThis is the point at which, as somebody who has actually STUDIED PHILOSOPHY AT COLLEGE LEVEL, I want to scream and cry.\nDon’t get me wrong, Aristotele is a great mind. His contribution to philosophy and the history of human thought has been great, although he did stop science and logic and many other things in their tracks for several centuries – but that was not his fault, as anybody who has read The Name Of The Rose knows (yes, if you are a) Italian and b) a philosophy student, TNOTR is a fun read).\nBut he did not invent dialectic and what he meant by it is different from what Socrates, and Plato, and Kant, and Fichte, and Hegel, and Marx, and many others, mean by it. Kant in particular is rather scathing towards Aristotelian dialectic, saying, in short (I don’t have my copy of Critique of Pure Reason with me to check the exact quote) that the ancient Greeks thought they were so smart but they couldn’t reason their way out of a paper bag, which makes sense if you have the mind of Kant.\nI suppose the most widely use of dialectic that I found is the hegelian sense: there are two opposing principles, which Hegel saw as fundamental principles of reality rather than logical propositions, and history proceeds by “finding out” that there is a third fundamental principle that makes both of them not so much false as superseded (well, history is what happens when the third principle unfolds itself, from what I understand of Hegel’s writings, but you know what I mean). This is all very abstract which is why I am not so fond of Hegel, but Marx’s idea of class struggle is a concrete example: there is a class that holds oppressive power over another, and in their interaction there arises a new state of affairs in which there is only one class that is neither the oppressive nor the oppressed one and everybody is happy.\nThe scientific method is also an example of dialectic, in a sense: if you want to stretch the definitions somewhat. Say that you contemplate the different models of the solar system, heliocentric and geocentric, and as a matter of fact both are valid explanation of observable facts, until Newton comes along with a better explanation that makes both of the models obsolete. (Yes, I know, gross simplification).\nThe history of the concept of dialectic is endlessly fascinating and stimulating. But one of the things any kind of dialectic presupposes is the ability to change, to discover the truth, or at least get endlessly closer to it.\nThe fact that somebody might seize on what we have left of the thoughts of a man who lived and died 2,300 years ago and think that that is the be all and end all of human thinking and call that dialectic just shows… well, a monumental lack of knowledge of the rest of the history of Western thought.\nLei non vuole gridare o piangere, invece lei vorebbe solo mostrare che l’ha una laurea in filosofia. In ogni caso, leggevo\nIl Nome Della Rosa\ntante volte, in inglese e ancora in italiano, in fatti, ho discusso quel libro due volte col stesso autore. Inoltre anch’io ho preso diversi corsi di filosofia all’universita’. Non significa nulla.\nIn any event, for all her very impressive philosophical book-larnin’, the signorina has managed to completely miss the point. I am not ignorant of Kant or Hegel or Marx, and I am perfectly aware that what Aristotle meant by dialectic is very, very different than what later definers of the term meant by it. That’s precisely why I am always careful to explain my reliance upon the\nAristotelian\nform as opposed to the Marxian one I learned from the Marxian economists from whom I obtained my economics degree or any of the others. Instead of showing “a monumental lack of knowledge of the rest of the history of Western thought” on my part, she has demonstrated an impressive quantity of educated stupidity on her own.\nWhat the signorina is doing is posturing in the modern fashion in which recognition of a thing is expected to pass for genuine knowledge of it. And yet, she doesn’t understand Aristotelian dialectic enough to do more than regurgitate some dimly remembered things she was told about it, or recognize that I am not pretending to make any use of Aristotelian dialectic to prove anything. As it happens, I tend to prefer the Thomistic method despite its various shortcomings.\nAll I am doing is utilizing the Aristotelian distinction between the dialectical and rhetorical populations as a useful heuristic that reliably proves useful in distinguishing between serious critics who merit serious responses and unserious ones who merit nothing more than contemptuous dismissal and a rhetorical kick in the empty head. I leave it to the reader to determine which population Ms Dal Dan most clearly belongs.\nI find it reliably amusing to see how they cling to their pose of being intellectually superior and better educated even when they observably don’t understand what they’re reading.\nMeanwhile, Glenn Haumann, the anti-Puppy who publicly called for posting fake reviews on Amazon, suggests a way The Most Despised Man in Science Fiction could rehabilitate himself in the eyes of science fiction fandom:\n(Of course, science fiction reserves the right to re-evaluate your standing if you’re ever suspected of being involved in pedophilia.)\nApparently all one needs to do is to rape a few minors, unrepentantly  write about it in the most graphic terms, and one can then not unreasonably expect to be named an SFWA Grand Master or win a  World Fantasy Award for Lifetime Achievement Award. From Arthur C. Clarke to Tony Alleyne, from Marion Zimmer Bradley to\nDavid Asimov\n,  from Walter Breen to Ed Kramer, the science fiction community is one of the biggest collections of known pedophiles outside the British Parliament.\nThe widespread sexual aberrancy in the SF community was one of the many reasons I wanted nothing to do with it after my one mercifully brief encounter with Sad Freakville at Minicon. You have not seen true human wreckage until you’ve been to a science fiction convention. I’ve seen physically and psychologically healthier people on reservations and in refugee camps; one can hardly blame them for being drawn to escapism.",
  "tags": [
    "McRapey",
    "philosophy"
  ],
  "categories": [],
  "sitemap_lastmod": "2015-05-16T11:00:00+00:00"
}