{
  "url": "https://voxday.net/2015/05/16/a-historic-privilege/",
  "scraped_at": "2025-12-16T12:55:57.347263",
  "title": "A historic privilege",
  "date_display": "May 16, 2015",
  "date_iso": "2015-05-16T08:57:00+00:00",
  "date_from_url": "2015-05-16",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>In his landmark economics textbook, Paul Samuelson pointed out that domestic debt did not matter in the aggregate, with one notable exception.  He wrote: <i>“The<br> interest on an internal debt is paid by Americans to Americans; there<br> is no direct loss of goods and services. When interest on the debt is<br> paid out of taxation, there is no direct loss of disposable income; Paul<br> receives what Peter loses, and sometimes – but only sometimes – Paul<br> and Peter are one and the same person…. In the future, some of our<br> grandchildren will be giving up goods and services to other<br> grandchildren. That is the nub of the matter. The only way we can impose<br> a direct burden on the future nation as a whole is by incurring an<br> external debt or by passing along less capital equipment to posterity.”</br></br></br></br></br></br></br></br></br></i></p><p>Setting aside whether it matters or not who owes what to whom, <a href=\"http://hosted.ap.org/dynamic/stories/U/US_FOREIGN_HOLDINGS?SITE=AP&amp;SECTION=HOME&amp;TEMPLATE=DEFAULT&amp;CTIME=2015-05-15-16-26-49\">the recent report on external debt owed</a> would therefore appear to be not entirely irrelevant in this regard.<i> </i></p><blockquote class=\"tr_bq\"><p> The Treasury Department says overseas ownership of U.S. debt rose 2.1 percent in March to $6.18 trillion. That is below January’s record of $6.22 trillion. China added $37.3 billion of Treasury debt, bringing its stockpile to $1.26 trillion. That’s ahead of Japan, which added just $2.5 billion, lifting its total to $1.23 trillion.</p><p>In February, Japan became the leading owner of U.S. debt for the first time since August 2008. China overtook Japan that year as the Great Recession, higher government spending and a steep drop in tax revenue pushed up U.S. government borrowing. <i><br/></i></p></blockquote><p>As of the end of 2014, US government debt outstanding stood at $13 trillion. That means that with $6.18 trillion of it owed externally, 47.5 percent of the US public debt is of the sort that, even in Keynesian/Samuelsonian terms, imposes a direct burden on the future nation as a whole. And when you consider that the future USA – one can hardly call it a “nation” at this point – will be less white, less intelligent, and less productive on average, it should be readily apparent that the economy has absolutely no chance of growing itself out of the external debt owed regardless of which economic school of thought you belong.</p><p>What we are witnessing is nothing less than the gradual demise of the biggest, wealthiest economy in world history. It is truly a privilege and an education to behold. It is rather like being able to witness the death of the last Tyrannosaurus Rex. Regardless of how the fallout from the event may affect us personally, we have seen and experienced something that very few men have ever known.</p><p>I still remember living in Japan at the height of the Heisei Boom; I flew out of Narita less than five months before the consumption tax and the first round of monetary tightening marked the peak of that Golden Age and brought it to an end. In nearly three decades since, Japan has never again approached those heights of ease and luxury. Now we are looking at much the same thing, albeit on a considerably larger scale. But rather than mourn the recent past, we should appreciate it for the rare moment in history it was.</p><p>The Hobbesian Law was never abolished, it was merely held in abeyance for a time.</p></div>",
  "content_text": "In his landmark economics textbook, Paul Samuelson pointed out that domestic debt did not matter in the aggregate, with one notable exception.  He wrote:\n“The\ninterest on an internal debt is paid by Americans to Americans; there\nis no direct loss of goods and services. When interest on the debt is\npaid out of taxation, there is no direct loss of disposable income; Paul\nreceives what Peter loses, and sometimes – but only sometimes – Paul\nand Peter are one and the same person…. In the future, some of our\ngrandchildren will be giving up goods and services to other\ngrandchildren. That is the nub of the matter. The only way we can impose\na direct burden on the future nation as a whole is by incurring an\nexternal debt or by passing along less capital equipment to posterity.”\nSetting aside whether it matters or not who owes what to whom,\nthe recent report on external debt owed\nwould therefore appear to be not entirely irrelevant in this regard.\nThe Treasury Department says overseas ownership of U.S. debt rose 2.1 percent in March to $6.18 trillion. That is below January’s record of $6.22 trillion. China added $37.3 billion of Treasury debt, bringing its stockpile to $1.26 trillion. That’s ahead of Japan, which added just $2.5 billion, lifting its total to $1.23 trillion.\nIn February, Japan became the leading owner of U.S. debt for the first time since August 2008. China overtook Japan that year as the Great Recession, higher government spending and a steep drop in tax revenue pushed up U.S. government borrowing.\nAs of the end of 2014, US government debt outstanding stood at $13 trillion. That means that with $6.18 trillion of it owed externally, 47.5 percent of the US public debt is of the sort that, even in Keynesian/Samuelsonian terms, imposes a direct burden on the future nation as a whole. And when you consider that the future USA – one can hardly call it a “nation” at this point – will be less white, less intelligent, and less productive on average, it should be readily apparent that the economy has absolutely no chance of growing itself out of the external debt owed regardless of which economic school of thought you belong.\nWhat we are witnessing is nothing less than the gradual demise of the biggest, wealthiest economy in world history. It is truly a privilege and an education to behold. It is rather like being able to witness the death of the last Tyrannosaurus Rex. Regardless of how the fallout from the event may affect us personally, we have seen and experienced something that very few men have ever known.\nI still remember living in Japan at the height of the Heisei Boom; I flew out of Narita less than five months before the consumption tax and the first round of monetary tightening marked the peak of that Golden Age and brought it to an end. In nearly three decades since, Japan has never again approached those heights of ease and luxury. Now we are looking at much the same thing, albeit on a considerably larger scale. But rather than mourn the recent past, we should appreciate it for the rare moment in history it was.\nThe Hobbesian Law was never abolished, it was merely held in abeyance for a time.",
  "tags": [
    "economics",
    "history"
  ],
  "categories": [],
  "sitemap_lastmod": "2015-05-16T07:57:00+00:00"
}