{
  "url": "https://voxday.net/2015/05/06/a-lesson-in-rhetoric/",
  "scraped_at": "2025-12-16T12:54:50.356170",
  "title": "A lesson in rhetoric",
  "date_display": "May 6, 2015",
  "date_iso": "2015-05-06T17:27:00+00:00",
  "date_from_url": "2015-05-06",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p><a href=\"http://file770.com/?p=22348&amp;cpage=3#comment-257518\">VOX DAY:</a><b><a href=\"http://file770.com/?p=22348&amp;cpage=3#comment-257518\"> </a>  </b>Dialectic is based on the construction of syllogisms, so it’s very<br> obvious when one is lying. Rhetoric is “the faculty of observing in any<br> given case the available means of persuasion.”</br></br></p><p>It’s not even strictly true to say one CAN lie rhetorically, since an<br> enthymeme is not a true logical syllogism, all that matters is that the<br> persuasion is achieved by proof or apparent proof.”</br></br></p><p>It might be easier to think in terms of “logically sound” and “not<br> logically” sound than true and false. The point is that I can construct a<br> logical syllogism that proves or a pseudo-logical enthymeme that<br> apparently proves, but in either case, they point towards the relevant<br> truth of the matter.</br></br></br></br></p><p>For example, if I say “SJWs occasionally lie” in response to your<br> false statement, this is good dialectic but poor rhetoric that is likely<br> to fail to persuade a rhetorical of the actual truth, namely, that you<br> are lying in the present circumstance. The better rhetorical statement<br> is “SJWs always lie”, which is not dialectically true, but persuades the<br> rhetorical to believe the truth, which is that you are lying.</br></br></br></br></br></p><p>Hence the importance of knowing your audience. When you speak in<br> rhetoric to a dialectical, it sounds very dishonest even when it is good<br> rhetoric in line with the truth. But you can’t speak dialectic to a<br> rhetorical for the obvious reason that they cannot be persuaded by it.<br> They simply don’t have the capacity.<br> <i></i></br></br></br></br></br></p><div class=\"comment-content\"></div><div class=\"comment-content\"> SETH GORDON: <i>And yet, I remain unpersuaded. Either I am not “a rhetorical” or VD is not very competent at using rhetoric.</i><i><br/></i><br> <i>(That was a dialectical statement.)</i><br> <b><i><br/></i></b><br> <b><i>“SJWs always lie. First, you all do care how I feel. That’s why you constantly twist and pervert and attack at every opportunity.”</i></b><br> <i><br/></i><br> <i>Because, of course, it has to be all about VD, the man more popular<br> than John Scalzi, the man whose approval we all seek more than anything<br> else in the world.</br></br></i><br> <i><br/></i><br> <i>(That was a rhetorical statement.)</i><p> VOX DAY: You are unpersuaded, but your inability to be persuaded by a<br> particular enthymeme does not mean you can be persuaded by a logical<br> syllogism. The first horn of the dilemma is false.</br></br></p><p>You are unpersuaded, but your inability to be persuaded merely means<br> that a single enthymeme failed to persuade a single individual. Since even<br> rhetorical masters fail to universally persuade everyone at all times,<br> this single failure of rhetoric on my part is insufficient to support<br> the claim of rhetorical incompetence. The second horn of the dilemma is<br> false.</br></br></br></br></br></p><p>You constructed a false syllogism, proposed a twice-false<br> non-dilemma, and your assertion of incompetence was meant to resonate on<br> the emotional level. Ergo your statement was not dialectic, but merely pseudo-dialectical rhetoric.</br></br></p><p>But yes, the rhetorical statement was rhetoric. One out of two isn’t bad.</p><p> Will, on the other hand, sticks to pure rhetoric and does rather better with it.</p><p><i>“Come on down to Rhetoricalville: We have no idea what we’re talking about it, but somehow, we’re happy and free of rabies.” </i><b><br/></b></p></br></br></br></br></br></br></br></div></div>",
  "content_text": "VOX DAY:\nDialectic is based on the construction of syllogisms, so it’s very\nobvious when one is lying. Rhetoric is “the faculty of observing in any\ngiven case the available means of persuasion.”\nIt’s not even strictly true to say one CAN lie rhetorically, since an\nenthymeme is not a true logical syllogism, all that matters is that the\npersuasion is achieved by proof or apparent proof.”\nIt might be easier to think in terms of “logically sound” and “not\nlogically” sound than true and false. The point is that I can construct a\nlogical syllogism that proves or a pseudo-logical enthymeme that\napparently proves, but in either case, they point towards the relevant\ntruth of the matter.\nFor example, if I say “SJWs occasionally lie” in response to your\nfalse statement, this is good dialectic but poor rhetoric that is likely\nto fail to persuade a rhetorical of the actual truth, namely, that you\nare lying in the present circumstance. The better rhetorical statement\nis “SJWs always lie”, which is not dialectically true, but persuades the\nrhetorical to believe the truth, which is that you are lying.\nHence the importance of knowing your audience. When you speak in\nrhetoric to a dialectical, it sounds very dishonest even when it is good\nrhetoric in line with the truth. But you can’t speak dialectic to a\nrhetorical for the obvious reason that they cannot be persuaded by it.\nThey simply don’t have the capacity.\nSETH GORDON:\nAnd yet, I remain unpersuaded. Either I am not “a rhetorical” or VD is not very competent at using rhetoric.\n(That was a dialectical statement.)\n“SJWs always lie. First, you all do care how I feel. That’s why you constantly twist and pervert and attack at every opportunity.”\nBecause, of course, it has to be all about VD, the man more popular\nthan John Scalzi, the man whose approval we all seek more than anything\nelse in the world.\n(That was a rhetorical statement.)\nVOX DAY: You are unpersuaded, but your inability to be persuaded by a\nparticular enthymeme does not mean you can be persuaded by a logical\nsyllogism. The first horn of the dilemma is false.\nYou are unpersuaded, but your inability to be persuaded merely means\nthat a single enthymeme failed to persuade a single individual. Since even\nrhetorical masters fail to universally persuade everyone at all times,\nthis single failure of rhetoric on my part is insufficient to support\nthe claim of rhetorical incompetence. The second horn of the dilemma is\nfalse.\nYou constructed a false syllogism, proposed a twice-false\nnon-dilemma, and your assertion of incompetence was meant to resonate on\nthe emotional level. Ergo your statement was not dialectic, but merely pseudo-dialectical rhetoric.\nBut yes, the rhetorical statement was rhetoric. One out of two isn’t bad.\nWill, on the other hand, sticks to pure rhetoric and does rather better with it.\n“Come on down to Rhetoricalville: We have no idea what we’re talking about it, but somehow, we’re happy and free of rabies.”",
  "tags": [
    "debate",
    "philosophy"
  ],
  "categories": [],
  "sitemap_lastmod": "2015-05-06T16:27:00+00:00"
}