{
  "url": "https://voxday.net/2015/05/20/a-new-line-of-attack/",
  "scraped_at": "2025-12-16T12:56:24.488734",
  "title": "Delenda est",
  "date_display": "May 20, 2015",
  "date_iso": "2015-05-20T10:00:00+00:00",
  "date_from_url": "2015-05-20",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>I couldn’t help but smile yesterday when the gentleman at File 770 mentioned that he had asked several pro-Puppies what they wanted and they answered “SJW delenda est.” That was beautiful. It touched me to such an extent that a single tear trickled down my cheek beneath the iron mask. And speaking of tears, <a href=\"http://ohdeargodbees.tumblr.com/post/119343938684/risky-business\">this <i>cri de coeur</i> by Zoe Quinn</a> about her unemployed and now-unhireable boyfriend is a good summary of what we want to see repeated over and over by SJWs in science fiction in the future:</p><blockquote class=\"tr_bq\"><p> How has the industry responded to his loyalty? Dubbing him a hiring risk. Too hot to touch. Heaven forbid some teenagers spam them with meme-laden emails. SmegmaDan’s blog said Alex hated gamers, better not hire him it could be risky.</p><p>Elephants afraid of mice.</p><p>God could you imagine how much worse it’d be if he was a marginalized person? Look at what happened to The Mighty No 9’s Dina Abou Karam? Look at her google search.</p><p>When you combine this with all of the other barriers marginalized people face, combined with how they are targeted for mob hatred at an exceptionally higher rate, it has a chilling effect on speaking out. There are countless marginalized people I’ve spoken to in the industry who are too afraid to support their friends in even the most lukewarm ways because they don’t want their employers to retaliate. There are so many women and people of color that have expressed private support alongside an apology for their fear of making it public because they have to keep their search results clean for a potential studio’s HR department.</p><p>You know that’s done to people like us on purpose, right? That running away at the first sign of smoke without fire is a tactic used against targets of online mobs CONSTANTLY? That they abuse SEO as a tool of social warfare? That the only power this carries is the kind major companies give to them by not bothering to see if it’s smoke without fire?</p><p>What if someone like Alex wants to go independent (leaving aside the question of if indies even hire producers for a second)? I cast a long shadow. He gets fucked over not just once from the industry’s general fear, but twice because his story has been looked over or lumped in with mine because he wasn’t “loud enough” about his own trouble. Not only does he get targeted because of being with me, but people look past his suffering, sacrifice, his work, and efforts to rebuild. People thoughtlessly treat him as an appendage. It’s infuriating. Look at some of the articles written about Crash Override. Look how often he’s missing or thought of simply as “a boyfriend” and not the cofounder he is. Look at how people attribute his work to me.  The man works his face off, gets results, and still gets screwed out of some of the credit.</p><p>Does that sound familiar? It does to me. I’ve fucking been there myself. It sounds like what USUALLY happens when I work with any men on a project. If you’re a marginalized person at all, you KNOW this feeling of frustration, of being whitewashed, of seeing your work being downplayed.</p><p>It’s not just Alex either. I’ve watched people who have been targets keep their heads down to try to keep themselves safe, just to have people all collectively forget what has happened to them. They’re stuck in a no-win position because speaking out means more hurt gets hurled their way, and more of their privacy is lost, but the cost of staying silent is that it seems that the world forgets about what happened to you at all. You’re left to wonder why people weren’t standing up for you like that, and if they cared about your suffering at all.</p><p>And since people with the power and reach need to speak up when those without are being hurt. Since I have been given the privlege to have this platform, I can’t just watch this, I have to speak up: THIS INDUSTRY IS CREATING A RISK OF SPEAKING OUT BY CALLING THOSE WHO SPEAK OUT A RISK.</p><p>We are bleeding assets to this industry, to this medium, at an alarming pace because of this risk aversion and shortsightedness. I would be dead or totally lost if not for Alex and the other folks who have been targeted by GamerGate and quietly faded away because it got to be too much. To see so many of them treated as footnotes is heartbreaking. To see my partner who has endured all of the hell I have and more treated as a fashion accessory and not the fully fledged and fucking impressive human being he is insults both of us and the things we have built *together*. For a risk adverse industry to treat him and other activists like lepers because a teenager might go “ur game sux” shows some pretty fucked up priorities.</p></blockquote><p>The #GamerGate response has been worthy of the Vile Faceless Minions themselves: <a href=\"https://twitter.com/PottyMouthGamer/status/600898816083124224\">“Schadenfreudelicious!”</a> One thing we’ll be discussing at Brainstorm tonight is how to bring successful #GamerGate tactics into science fiction, as Zoe Quinn points to one obvious possibility. It’s readily apparent that Tor Books doesn’t care in the slightest that PNH calls himself a racist or that John Scalzi launches vulgar attacks on everyone to the right of Hilary Clinton who crosses his path. But then, Tor Books is not their ultimate employer….</p><blockquote class=\"tr_bq\"><p> The employer stood behind us. They saw the horde for what it was. But<br> it didn’t stop there. Studios he never worked at got brigaded. Then his<br> employer’s employer got brigaded, and upped the pressure. One of the<br> things that makes mob harassment so insidious is how it attacks from<br> every possible angle, and some you didn’t even think of. All it takes in<br> any system is one point of failure, one person to make the wrong<br> decision, one person to not understand what’s going on, one person to be<br> a coward.</br></br></br></br></br></br></br></p></blockquote><p>The SJWs have been playing this game of DISQUALIFY for a long time. They love to hurl the threat “you’ll never work in this industry again” at their enemies; Charles Stross, to his eternal credit, even warned me about it ten years ago. So it’s tremendously rewarding to see an SJW literally crying over the tactic being successfully brought to bear against them.</p><p>The secret of #GamerGate’s amazing success is emails, sent out on a daily basis in a series of coordinated campaigns against specified targets. Few corporations can resist a steady barrage of emails; as Quinn herself points out, it only takes one person somewhere in the system to crack and the target will be cut loose. And given the poor sales and financial performance of the science fiction publishing houses in recent years, it is unlikely that their corporate masters are likely to continue to tolerate actions and behavior which have quite observably turned a statistically significant percentage of the science fiction-buying public against them.</p><p>Zoe Quinn claims “20 accounts owned by 3 guys” have been sufficient to DISQUALIFY her boyfriend from industry employment. There are 364 Vile Faceless Minions. There are another 200+ Dread Ilk, plus an unknown quantity of Ilk, Rabid Puppies, and #GamerGate sympathizers. Even if we assume that Ms Quinn is lying (she is an SJW after all), I expect we can accomplish more than most of us might think if we were to follow #GamerGate’s lead in this regard. And in case you’re feeling sorry for the unemployable SJW lowlife, do keep this in mind.</p><div class=\"separator\" style=\"clear: both; text-align: center;\"> <a href=\"https://pbs.twimg.com/media/CFYwbv3W0AAu6OU.png\" imageanchor=\"1\" style=\"margin-left: 1em; margin-right: 1em;\"><noscript><img border=\"0\" decoding=\"async\" src=\"https://pbs.twimg.com/media/CFYwbv3W0AAu6OU.png\"/></noscript><img border=\"0\" class=\"lazyload\" data-src=\"https://pbs.twimg.com/media/CFYwbv3W0AAu6OU.png\" decoding=\"async\" src=\"data:image/svg+xml,%3Csvg%20xmlns=%22http://www.w3.org/2000/svg%22%20viewBox=%220%200%20210%20140%22%3E%3C/svg%3E\">|</img></a></div><p><i><br/></i><br> <i>SJWs only get sick of culture wars when they start losing. Until then it’s “Full Speed Ahead!” and “Remember the Misogyny!” </i><br> – Daddy Warpig</br></br></p></div>",
  "content_text": "I couldn’t help but smile yesterday when the gentleman at File 770 mentioned that he had asked several pro-Puppies what they wanted and they answered “SJW delenda est.” That was beautiful. It touched me to such an extent that a single tear trickled down my cheek beneath the iron mask. And speaking of tears,\nthis\ncri de coeur\nby Zoe Quinn\nabout her unemployed and now-unhireable boyfriend is a good summary of what we want to see repeated over and over by SJWs in science fiction in the future:\nHow has the industry responded to his loyalty? Dubbing him a hiring risk. Too hot to touch. Heaven forbid some teenagers spam them with meme-laden emails. SmegmaDan’s blog said Alex hated gamers, better not hire him it could be risky.\nElephants afraid of mice.\nGod could you imagine how much worse it’d be if he was a marginalized person? Look at what happened to The Mighty No 9’s Dina Abou Karam? Look at her google search.\nWhen you combine this with all of the other barriers marginalized people face, combined with how they are targeted for mob hatred at an exceptionally higher rate, it has a chilling effect on speaking out. There are countless marginalized people I’ve spoken to in the industry who are too afraid to support their friends in even the most lukewarm ways because they don’t want their employers to retaliate. There are so many women and people of color that have expressed private support alongside an apology for their fear of making it public because they have to keep their search results clean for a potential studio’s HR department.\nYou know that’s done to people like us on purpose, right? That running away at the first sign of smoke without fire is a tactic used against targets of online mobs CONSTANTLY? That they abuse SEO as a tool of social warfare? That the only power this carries is the kind major companies give to them by not bothering to see if it’s smoke without fire?\nWhat if someone like Alex wants to go independent (leaving aside the question of if indies even hire producers for a second)? I cast a long shadow. He gets fucked over not just once from the industry’s general fear, but twice because his story has been looked over or lumped in with mine because he wasn’t “loud enough” about his own trouble. Not only does he get targeted because of being with me, but people look past his suffering, sacrifice, his work, and efforts to rebuild. People thoughtlessly treat him as an appendage. It’s infuriating. Look at some of the articles written about Crash Override. Look how often he’s missing or thought of simply as “a boyfriend” and not the cofounder he is. Look at how people attribute his work to me.  The man works his face off, gets results, and still gets screwed out of some of the credit.\nDoes that sound familiar? It does to me. I’ve fucking been there myself. It sounds like what USUALLY happens when I work with any men on a project. If you’re a marginalized person at all, you KNOW this feeling of frustration, of being whitewashed, of seeing your work being downplayed.\nIt’s not just Alex either. I’ve watched people who have been targets keep their heads down to try to keep themselves safe, just to have people all collectively forget what has happened to them. They’re stuck in a no-win position because speaking out means more hurt gets hurled their way, and more of their privacy is lost, but the cost of staying silent is that it seems that the world forgets about what happened to you at all. You’re left to wonder why people weren’t standing up for you like that, and if they cared about your suffering at all.\nAnd since people with the power and reach need to speak up when those without are being hurt. Since I have been given the privlege to have this platform, I can’t just watch this, I have to speak up: THIS INDUSTRY IS CREATING A RISK OF SPEAKING OUT BY CALLING THOSE WHO SPEAK OUT A RISK.\nWe are bleeding assets to this industry, to this medium, at an alarming pace because of this risk aversion and shortsightedness. I would be dead or totally lost if not for Alex and the other folks who have been targeted by GamerGate and quietly faded away because it got to be too much. To see so many of them treated as footnotes is heartbreaking. To see my partner who has endured all of the hell I have and more treated as a fashion accessory and not the fully fledged and fucking impressive human being he is insults both of us and the things we have built *together*. For a risk adverse industry to treat him and other activists like lepers because a teenager might go “ur game sux” shows some pretty fucked up priorities.\nThe #GamerGate response has been worthy of the Vile Faceless Minions themselves:\n“Schadenfreudelicious!”\nOne thing we’ll be discussing at Brainstorm tonight is how to bring successful #GamerGate tactics into science fiction, as Zoe Quinn points to one obvious possibility. It’s readily apparent that Tor Books doesn’t care in the slightest that PNH calls himself a racist or that John Scalzi launches vulgar attacks on everyone to the right of Hilary Clinton who crosses his path. But then, Tor Books is not their ultimate employer….\nThe employer stood behind us. They saw the horde for what it was. But\nit didn’t stop there. Studios he never worked at got brigaded. Then his\nemployer’s employer got brigaded, and upped the pressure. One of the\nthings that makes mob harassment so insidious is how it attacks from\nevery possible angle, and some you didn’t even think of. All it takes in\nany system is one point of failure, one person to make the wrong\ndecision, one person to not understand what’s going on, one person to be\na coward.\nThe SJWs have been playing this game of DISQUALIFY for a long time. They love to hurl the threat “you’ll never work in this industry again” at their enemies; Charles Stross, to his eternal credit, even warned me about it ten years ago. So it’s tremendously rewarding to see an SJW literally crying over the tactic being successfully brought to bear against them.\nThe secret of #GamerGate’s amazing success is emails, sent out on a daily basis in a series of coordinated campaigns against specified targets. Few corporations can resist a steady barrage of emails; as Quinn herself points out, it only takes one person somewhere in the system to crack and the target will be cut loose. And given the poor sales and financial performance of the science fiction publishing houses in recent years, it is unlikely that their corporate masters are likely to continue to tolerate actions and behavior which have quite observably turned a statistically significant percentage of the science fiction-buying public against them.\nZoe Quinn claims “20 accounts owned by 3 guys” have been sufficient to DISQUALIFY her boyfriend from industry employment. There are 364 Vile Faceless Minions. There are another 200+ Dread Ilk, plus an unknown quantity of Ilk, Rabid Puppies, and #GamerGate sympathizers. Even if we assume that Ms Quinn is lying (she is an SJW after all), I expect we can accomplish more than most of us might think if we were to follow #GamerGate’s lead in this regard. And in case you’re feeling sorry for the unemployable SJW lowlife, do keep this in mind.\n|\nSJWs only get sick of culture wars when they start losing. Until then it’s “Full Speed Ahead!” and “Remember the Misogyny!”\n– Daddy Warpig",
  "tags": [
    "#GamerGate",
    "SJW"
  ],
  "categories": [],
  "sitemap_lastmod": "2015-05-20T09:00:00+00:00"
}