{
  "url": "https://voxday.net/2015/05/06/a-secret-masters-summary/",
  "scraped_at": "2025-12-16T12:54:48.541518",
  "title": "A Secret Master’s summary",
  "date_display": "May 6, 2015",
  "date_iso": "2015-05-06T12:00:00+00:00",
  "date_from_url": "2015-05-06",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>Mike Glyer has not only been doing yeoman’s work in allowing all sides of the Hugo 2015 controversy to speak their bit, he’s also presented one of the most balanced summaries of the situation <a href=\"http://uncannymagazine.com/article/its-the-big-one/\">while putting it in historical perspective</a>:</p><blockquote class=\"tr_bq\"><p> Participation in the Hugo nominating phase has always been anemic compared to the final round. Often less than a hundred votes are needed to land something on the ballot in most categories. It’s the most vulnerable point of the award, for obviously nothing can win that doesn’t get on that list. Past incidents of bloc voting have been few and obvious—for example, L. Ron Hubbard’s posthumously published Black Genesis was nominated in 1987, while in 1989 a couple withdrew their collaborative work from the ballot after learning around 20 questionable ballots were cast for it. However, not all attempts to organize blocs have been criticized, especially in the fan categories where a demonstration of social media clout has tended to be applauded.</p><p>Only by tapping into anger over the culture wars has someone succeeded in motivating the requisite number of fans to buy supporting memberships at $40 a pop and take control of the Hugo ballot.</p><p>Among fans who are critical of the outcome there has been widespread talk of voting “No Award” ahead of nominees from the slate (again). There is also a great deal of technical discussion of rules changes designed to limit the influence of voting slates without creating any barriers to new voters.</p><p>Perhaps the most surprising thing was the rash of articles in the mainstream media in Britain and Australia, denouncing the “Sad Puppies” slate as the work of misogynists and racists. Surprising, because the news rarely covers this early phase of the awards. Nor was it clear how reporters decided slates with eight women, or a number of Hispanic writers, could be characterized in those terms, and one of the outlets, Entertainment Weekly, subsequently issued a correction on that score.</p><p>A writer for Salon also gave the back of his hand to the Hugo’s democratic rule structure: “We should have learned a long, long time ago that ‘Just let the public give their input’ is a lazy, useless and above all dangerous way to make decisions.”</p><p>The Federation of Heinlein’s Starship Troopers may have felt the same way; however, the story is more commonly admired than its philosophy of government.</p><p>The Road Ahead: Hugo Awards lore comes in both an idealized Disney version and a noir Oliver Stone version. If someone says Hugo voters are trying to pick the best stories of the year, you can find someone else who’ll say it’s just a popularity award. The enthusiast will point out growing participation has produced record–breaking numbers of Hugo voters. The cynic will dismiss that number as trivially small. But just now the only thing anyone can say about the future of the Hugos is that it’s unlikely to resemble the past; even idealists and cynics have to agree on that.</p></blockquote><p>Yes, it was indeed strange that there was so much coverage of the Hugo nominations in the international media. I wonder how that may have come about? Perhaps an enterprising investigative reporter should consider looking into that. It is certainly rather remarkable how many people writing about the Hugo Awards for the Guardian have links with a certain SF publishing house that didn’t do quite as well as it is accustomed in 2015.</p><p>Speaking of Secret Masters of Fandom and Mike Glyer, <a href=\"http://file770.com/?p=22330&amp;cpage=6#comment-257298\">this comment at File 770</a> will likely amuse the Ilk:</p><blockquote class=\"tr_bq\"><p> It doesn’t take a genius that the regulars at Vox Populi would do it<br> for entertainment value alone (leaving aside their philosophical<br> beliefs).  And despite the apparent belief of some, they are, in<br> general, very intelligent and perfectly willing to light a match. For those who doubt me, spend a few days quietly reading his site.  I<br> can’t decide if it’s closer in character to a Pirate’s Den or a Wild<br> West town.</br></br></br></br></br></p></blockquote><p>He’s referring to us responding to a proposed change in the rules in which we’d need to split up and coordinate our actions, and his conclusion is entirely correct. It’s amusing to think that anyone imagines we’re going to be dissuaded by the threat of being accused of “behaving in bad faith” when, as Mike Glyer noted, we’re already being accused of misogyny, racism, crimethink, and perpetrating badfeels everywhere from the UK to New Zealand.</p><p>As for this site, I tend to lean towards Pirate’s Den, but then, we do rather like our showdowns and seeing overconfident challengers gunned down in a hail of dialectic too. I also find it a little bizarre that some sort of contradiction between “people willing to vote along [my] recommended lines” and “mindless posters” is postulated. Forget 4GW, the basic concept of “flash mob” must be totally impossible for some of these people to grasp.</p><p>Nobody has to pay $40. Nobody has to vote at all. Nobody has to vote the way that I recommend. I’m not a dictator, nobody elected me to anything, and I’m not holding anyone’s kitten hostage. They can bitch and whine all they want about “slates” and “bloc-voting”, but there is nothing new about the former and there is no statistical evidence of the latter. In fact, the statistical evidence absolutely disproves the false accusation of “bloc-voting”, as there is a greater variance among the ballots cast for various Rabid Puppies nominees in both absolute and percentage terms than seen in many past years.</p><p>I’ve sent out the material for the Hugo Voters’s Packet, which should be going out later this month. I will be posting my voting recommendations in July, after I get the chance to read the works I haven’t read yet.</p></div>",
  "content_text": "Mike Glyer has not only been doing yeoman’s work in allowing all sides of the Hugo 2015 controversy to speak their bit, he’s also presented one of the most balanced summaries of the situation\nwhile putting it in historical perspective\n:\nParticipation in the Hugo nominating phase has always been anemic compared to the final round. Often less than a hundred votes are needed to land something on the ballot in most categories. It’s the most vulnerable point of the award, for obviously nothing can win that doesn’t get on that list. Past incidents of bloc voting have been few and obvious—for example, L. Ron Hubbard’s posthumously published Black Genesis was nominated in 1987, while in 1989 a couple withdrew their collaborative work from the ballot after learning around 20 questionable ballots were cast for it. However, not all attempts to organize blocs have been criticized, especially in the fan categories where a demonstration of social media clout has tended to be applauded.\nOnly by tapping into anger over the culture wars has someone succeeded in motivating the requisite number of fans to buy supporting memberships at $40 a pop and take control of the Hugo ballot.\nAmong fans who are critical of the outcome there has been widespread talk of voting “No Award” ahead of nominees from the slate (again). There is also a great deal of technical discussion of rules changes designed to limit the influence of voting slates without creating any barriers to new voters.\nPerhaps the most surprising thing was the rash of articles in the mainstream media in Britain and Australia, denouncing the “Sad Puppies” slate as the work of misogynists and racists. Surprising, because the news rarely covers this early phase of the awards. Nor was it clear how reporters decided slates with eight women, or a number of Hispanic writers, could be characterized in those terms, and one of the outlets, Entertainment Weekly, subsequently issued a correction on that score.\nA writer for Salon also gave the back of his hand to the Hugo’s democratic rule structure: “We should have learned a long, long time ago that ‘Just let the public give their input’ is a lazy, useless and above all dangerous way to make decisions.”\nThe Federation of Heinlein’s Starship Troopers may have felt the same way; however, the story is more commonly admired than its philosophy of government.\nThe Road Ahead: Hugo Awards lore comes in both an idealized Disney version and a noir Oliver Stone version. If someone says Hugo voters are trying to pick the best stories of the year, you can find someone else who’ll say it’s just a popularity award. The enthusiast will point out growing participation has produced record–breaking numbers of Hugo voters. The cynic will dismiss that number as trivially small. But just now the only thing anyone can say about the future of the Hugos is that it’s unlikely to resemble the past; even idealists and cynics have to agree on that.\nYes, it was indeed strange that there was so much coverage of the Hugo nominations in the international media. I wonder how that may have come about? Perhaps an enterprising investigative reporter should consider looking into that. It is certainly rather remarkable how many people writing about the Hugo Awards for the Guardian have links with a certain SF publishing house that didn’t do quite as well as it is accustomed in 2015.\nSpeaking of Secret Masters of Fandom and Mike Glyer,\nthis comment at File 770\nwill likely amuse the Ilk:\nIt doesn’t take a genius that the regulars at Vox Populi would do it\nfor entertainment value alone (leaving aside their philosophical\nbeliefs).  And despite the apparent belief of some, they are, in\ngeneral, very intelligent and perfectly willing to light a match. For those who doubt me, spend a few days quietly reading his site.  I\ncan’t decide if it’s closer in character to a Pirate’s Den or a Wild\nWest town.\nHe’s referring to us responding to a proposed change in the rules in which we’d need to split up and coordinate our actions, and his conclusion is entirely correct. It’s amusing to think that anyone imagines we’re going to be dissuaded by the threat of being accused of “behaving in bad faith” when, as Mike Glyer noted, we’re already being accused of misogyny, racism, crimethink, and perpetrating badfeels everywhere from the UK to New Zealand.\nAs for this site, I tend to lean towards Pirate’s Den, but then, we do rather like our showdowns and seeing overconfident challengers gunned down in a hail of dialectic too. I also find it a little bizarre that some sort of contradiction between “people willing to vote along [my] recommended lines” and “mindless posters” is postulated. Forget 4GW, the basic concept of “flash mob” must be totally impossible for some of these people to grasp.\nNobody has to pay $40. Nobody has to vote at all. Nobody has to vote the way that I recommend. I’m not a dictator, nobody elected me to anything, and I’m not holding anyone’s kitten hostage. They can bitch and whine all they want about “slates” and “bloc-voting”, but there is nothing new about the former and there is no statistical evidence of the latter. In fact, the statistical evidence absolutely disproves the false accusation of “bloc-voting”, as there is a greater variance among the ballots cast for various Rabid Puppies nominees in both absolute and percentage terms than seen in many past years.\nI’ve sent out the material for the Hugo Voters’s Packet, which should be going out later this month. I will be posting my voting recommendations in July, after I get the chance to read the works I haven’t read yet.",
  "tags": [
    "Hugo Award"
  ],
  "categories": [],
  "sitemap_lastmod": "2015-05-06T11:00:00+00:00"
}