{
  "url": "https://voxday.net/2015/05/09/bad-news-for-boston/",
  "scraped_at": "2025-12-16T12:55:06.307899",
  "title": "Bad news for Boston",
  "date_display": "May 9, 2015",
  "date_iso": "2015-05-09T10:28:00+00:00",
  "date_from_url": "2015-05-09",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>Tom Brady <a href=\"http://www.nydailynews.com/sports/football/myers-roger-goodell-suspend-tom-brady-deflategate-article-1.2215881\">is going to be suspended</a> by the NFL and Bill Simmons is going to be fired by ESPN.</p><blockquote class=\"tr_bq\"><p> Tom Brady will be the highest-profile player ever suspended in the 96-year history of the NFL. Roger Goodell’s decision is expected to be announced next week, and it is no longer a matter of if the NFL commissioner will suspend Brady, but for how long he will suspend him. In conversations I’ve had with several key sources who always have a good sense of what goes on at 345 Park Ave., there is little doubt that Goodell considers Brady’s role in DeflateGate a serious violation.</p><p>The NFL is convinced, according to sources, that connecting all the<br> dots of the evidence supplied by Ted Wells leads to one conclusion: Brady cheated.</br></p></blockquote><p>Peter King made a good point about the fact that most of the evidence of Brady’s guilt is circumstantial: ex-Patriot Aaron Hernandez was recently found guilty of murder and convicted to life in prison on the basis of circumstantial evidence. Speaking of Roger Goodell, one imagines that he might have had a little something to do with ESPN’s otherwise inexplicable decision <a href=\"http://www.nytimes.com/2015/05/09/sports/bill-simmons-and-espn-are-parting-ways.html?_r=0\">to rid themselves of The Sports Guy</a>:</p><blockquote class=\"tr_bq\"><div class=\"story-body-text story-content\" data-para-count=\"173\" data-total-count=\"332\" itemprop=\"articleBody\"> When Bill Simmons learned on Friday morning that his nearly 15-year-old relationship with <a class=\"meta-org\" href=\"http://topics.nytimes.com/top/news/business/companies/espn/index.html?inline=nyt-org\" title=\"More articles about ESPN.\">ESPN</a> was over, he responded with something uncharacteristic: silence. He<br> said nothing to his 3.7 million followers on Twitter. He did not pick<br> up the phone or answer requests for comment. His agent and publicist<br> followed his sounds of silence.<p>Simmons’s<br> decision not to respond to the announcement by John Skipper, the<br> president of ESPN, that his contract was not being renewed was<br> surprising. He had built an empire on having his voice heard, often<br> quite loudly, in a variety of roles: columnist, podcaster, editor in<br> chief of the website Grantland, television analyst, and one of the<br> creators of the “30 for 30” documentary series.</br></br></br></br></br></br></p><p>Simmons<br> seemed to have been blindsided by the timing of ESPN’s decision, which<br> came more than four months before his contract is to expire, at the end<br> of September. An ESPN executive, who was not authorized to speak<br> publicly, said Skipper had told Simmons’s agent, James Dixon, that a<br> decision had been made to end the relationship and that an announcement<br> was coming. But Skipper did not call Simmons before going public, the<br> ESPN executive said.</br></br></br></br></br></br></br></p><p>In an interview Friday morning, Skipper said: “I’ve decided that I’m not<br> going to renew his contract. We’ve been talking to Bill, and it was<br> clear that we weren’t going to get to the terms, so we were better off<br> focusing on transition.”</br></br></br></p></br></br></br></div></blockquote><p> I’m actually glad to see Simmons leaving ESPN. He’ll not only do fine without them, I expect him to be more interesting again once he’s free of the corporate leash. Don’t fear freedom, Bill!</p><p>UPDATE: This is apparently the phrase that sealed Simmons’s fate.</p><blockquote class=\"tr_bq\"><p>  I think it’s pathetic. Roger Goodell has handled so many things so<br> poorly that it’s reached a point now where you have something like this,<br> where it’s taken four months to release the report, and he knew<br> everything that was in it. He knows the results before the report is<br> released to the public, and yet doesn’t have the testicular fortitude to<br> do anything about it until he gauges the public reaction.</br></br></br></br></br></p></blockquote><p>I’m wondering if it was less the criticism of Goodell and more the reference to manhood being a positive thing that more offended the ESPN executives who cut him loose. One thing is clear. They did NOT like him:<i> “Ding Dong the witch is dead.” (That’s how one ESPN staffer describes the vibe in Bristol.) </i>And it is perfectly clear that while his politics lean left, <a href=\"http://deadspin.com/the-sports-guy-vs-espn-how-bill-simmons-lost-bristol-1639533260\">he is no SJW</a>.<i><br/></i></p></div>",
  "content_text": "Tom Brady\nis going to be suspended\nby the NFL and Bill Simmons is going to be fired by ESPN.\nTom Brady will be the highest-profile player ever suspended in the 96-year history of the NFL. Roger Goodell’s decision is expected to be announced next week, and it is no longer a matter of if the NFL commissioner will suspend Brady, but for how long he will suspend him. In conversations I’ve had with several key sources who always have a good sense of what goes on at 345 Park Ave., there is little doubt that Goodell considers Brady’s role in DeflateGate a serious violation.\nThe NFL is convinced, according to sources, that connecting all the\ndots of the evidence supplied by Ted Wells leads to one conclusion: Brady cheated.\nPeter King made a good point about the fact that most of the evidence of Brady’s guilt is circumstantial: ex-Patriot Aaron Hernandez was recently found guilty of murder and convicted to life in prison on the basis of circumstantial evidence. Speaking of Roger Goodell, one imagines that he might have had a little something to do with ESPN’s otherwise inexplicable decision\nto rid themselves of The Sports Guy\n:\nWhen Bill Simmons learned on Friday morning that his nearly 15-year-old relationship with\nESPN\nwas over, he responded with something uncharacteristic: silence. He\nsaid nothing to his 3.7 million followers on Twitter. He did not pick\nup the phone or answer requests for comment. His agent and publicist\nfollowed his sounds of silence.\nSimmons’s\ndecision not to respond to the announcement by John Skipper, the\npresident of ESPN, that his contract was not being renewed was\nsurprising. He had built an empire on having his voice heard, often\nquite loudly, in a variety of roles: columnist, podcaster, editor in\nchief of the website Grantland, television analyst, and one of the\ncreators of the “30 for 30” documentary series.\nSimmons\nseemed to have been blindsided by the timing of ESPN’s decision, which\ncame more than four months before his contract is to expire, at the end\nof September. An ESPN executive, who was not authorized to speak\npublicly, said Skipper had told Simmons’s agent, James Dixon, that a\ndecision had been made to end the relationship and that an announcement\nwas coming. But Skipper did not call Simmons before going public, the\nESPN executive said.\nIn an interview Friday morning, Skipper said: “I’ve decided that I’m not\ngoing to renew his contract. We’ve been talking to Bill, and it was\nclear that we weren’t going to get to the terms, so we were better off\nfocusing on transition.”\nI’m actually glad to see Simmons leaving ESPN. He’ll not only do fine without them, I expect him to be more interesting again once he’s free of the corporate leash. Don’t fear freedom, Bill!\nUPDATE: This is apparently the phrase that sealed Simmons’s fate.\nI think it’s pathetic. Roger Goodell has handled so many things so\npoorly that it’s reached a point now where you have something like this,\nwhere it’s taken four months to release the report, and he knew\neverything that was in it. He knows the results before the report is\nreleased to the public, and yet doesn’t have the testicular fortitude to\ndo anything about it until he gauges the public reaction.\nI’m wondering if it was less the criticism of Goodell and more the reference to manhood being a positive thing that more offended the ESPN executives who cut him loose. One thing is clear. They did NOT like him:\n“Ding Dong the witch is dead.” (That’s how one ESPN staffer describes the vibe in Bristol.)\nAnd it is perfectly clear that while his politics lean left,\nhe is no SJW\n.",
  "tags": [
    "media",
    "sports"
  ],
  "categories": [],
  "sitemap_lastmod": "2015-05-09T09:28:00+00:00"
}