{
  "url": "https://voxday.net/2015/05/08/david-gerrold-needs-neurologis/",
  "scraped_at": "2025-12-16T12:54:58.653630",
  "title": "Get him to neurology, stat!",
  "date_display": "May 8, 2015",
  "date_iso": "2015-05-08T01:08:00+00:00",
  "date_from_url": "2015-05-08",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>Seriously, David Gerrold is not merely incoherent, <a href=\"https://www.facebook.com/david.gerrold/posts/10205517432107535\">he’s directly contradicting himself</a>:</p><blockquote class=\"tr_bq\"><p> Here’s what I suggest. Consider this a starting place for the conversation, not a finished proposal. First, we as a community need to reaffirm our commitment to<br> inclusiveness — everybody’s welcome, regardless of political views,<br> religion, sexual orientation, gender, skin color, ethnicity, place of<br> national origin, body shape, disability, age, whatever. The only<br> requirement is a love of fantasy and science fiction and respect for<br> other participants.</br></br></br></br></br></p><p>My own rule about discussion is that<br> disagreement should be about issues, not personalities. This is because<br> most of us have issues, not all of us have personalities. I would<br> recommend this as a general policy as well. I might think that X or Y is<br> a big stinky poo-poo head, but speaking it aloud is not the best way to<br> win points in a debate.</br></br></br></br></br></p><p>Second, after we reaffirm our commitment to inclusiveness, we need to<br> consider whether or not the Hugo nominating rules need to be adjusted. I<br> believe that the administrators of the award should have the power to<br> disqualify slate-ballots, but the mechanisms for this might be<br> controversial….</br></br></br></br></p><p>But the point I’m working toward is a difficult one — it’s a<br> conversation that we tend to shy away from. But any functioning<br> community, does have the right to protect itself from disruptive<br> agencies. Groups can and do disinvite those who spoil the party.</br></br></br></p><p>The SFWA expelled Vox Day for his unprofessional behavior. Fandom as a<br> community, and the Worldcon as an institution, should have the same<br> power to invite someone to the egress. Other conventions have taken<br> steps to protect themselves from toxic and disruptive individuals — and<br> based on the back-and-forth conversations I’ve seen, and as unpleasant a<br> discussion as this will be, maybe it’s time to have a discussion about<br> the mechanisms for shutting down someone who has publicly declared his<br> intention to destroy the awards.</br></br></br></br></br></br></br></p><p>That’s the point. We cannot<br> talk about healing while the knife is still being twisted in the wound. I<br> can’t speak for the sad puppies, I can’t tell them what to do — but I<br> would hope that they would recognize that  being perceived as standing<br> next to a man who wants to destroy the system is not the best place to<br> stand.</br></br></br></br></br></p></blockquote><p>TL;DR: Worldcon must be inclusive and tolerant, so we must expel Vox Day and anyone associated with him in any way who fails to publicly denounce him before presenting themselves to us and requesting absolution.</p><p>Gerrold still hasn’t figured out that there is no way to expel someone from a group who doesn’t belong to it and doesn’t want to belong to it. But I like where he’s going with his suggestions. As I have often pointed out, it’s hard to destroy things from the outside, and it’s a lot easier if you can get the insiders to do it for you.</p><p>It’s also amusing to see them insist that they are not at all political, when the first point is a call to establish SJW ideology as a core principle. As Brad Torgersen has said, the fish don’t understand that the water in which they swim is wet.</p></div>",
  "content_text": "Seriously, David Gerrold is not merely incoherent,\nhe’s directly contradicting himself\n:\nHere’s what I suggest. Consider this a starting place for the conversation, not a finished proposal. First, we as a community need to reaffirm our commitment to\ninclusiveness — everybody’s welcome, regardless of political views,\nreligion, sexual orientation, gender, skin color, ethnicity, place of\nnational origin, body shape, disability, age, whatever. The only\nrequirement is a love of fantasy and science fiction and respect for\nother participants.\nMy own rule about discussion is that\ndisagreement should be about issues, not personalities. This is because\nmost of us have issues, not all of us have personalities. I would\nrecommend this as a general policy as well. I might think that X or Y is\na big stinky poo-poo head, but speaking it aloud is not the best way to\nwin points in a debate.\nSecond, after we reaffirm our commitment to inclusiveness, we need to\nconsider whether or not the Hugo nominating rules need to be adjusted. I\nbelieve that the administrators of the award should have the power to\ndisqualify slate-ballots, but the mechanisms for this might be\ncontroversial….\nBut the point I’m working toward is a difficult one — it’s a\nconversation that we tend to shy away from. But any functioning\ncommunity, does have the right to protect itself from disruptive\nagencies. Groups can and do disinvite those who spoil the party.\nThe SFWA expelled Vox Day for his unprofessional behavior. Fandom as a\ncommunity, and the Worldcon as an institution, should have the same\npower to invite someone to the egress. Other conventions have taken\nsteps to protect themselves from toxic and disruptive individuals — and\nbased on the back-and-forth conversations I’ve seen, and as unpleasant a\ndiscussion as this will be, maybe it’s time to have a discussion about\nthe mechanisms for shutting down someone who has publicly declared his\nintention to destroy the awards.\nThat’s the point. We cannot\ntalk about healing while the knife is still being twisted in the wound. I\ncan’t speak for the sad puppies, I can’t tell them what to do — but I\nwould hope that they would recognize that  being perceived as standing\nnext to a man who wants to destroy the system is not the best place to\nstand.\nTL;DR: Worldcon must be inclusive and tolerant, so we must expel Vox Day and anyone associated with him in any way who fails to publicly denounce him before presenting themselves to us and requesting absolution.\nGerrold still hasn’t figured out that there is no way to expel someone from a group who doesn’t belong to it and doesn’t want to belong to it. But I like where he’s going with his suggestions. As I have often pointed out, it’s hard to destroy things from the outside, and it’s a lot easier if you can get the insiders to do it for you.\nIt’s also amusing to see them insist that they are not at all political, when the first point is a call to establish SJW ideology as a core principle. As Brad Torgersen has said, the fish don’t understand that the water in which they swim is wet.",
  "tags": [
    "Hugo Award",
    "SJW"
  ],
  "categories": [],
  "sitemap_lastmod": "2015-05-08T00:08:00+00:00"
}