{
  "url": "https://voxday.net/2015/05/01/david-pakman-interview-shenanigans-i/",
  "scraped_at": "2025-12-16T12:54:17.119652",
  "title": "David Pakman: Interview shenanigans I",
  "date_display": "May 1, 2015",
  "date_iso": "2015-05-01T15:25:00+00:00",
  "date_from_url": "2015-05-01",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>Last week, I was invited to be interviewed about GamerGate and game development by a YouTube show with which I was unfamiliar, the David Pakman Show. The invitation was as follows:</p><p>On Wed, Apr 22, 2015 at 4:30 PM<br> From: VD <br> Subject: show appearance</br></br></p><p>Message Body:<br> You tweeted at me and asked me if I would appear on the show. That’s fine, you can contact me via this email.</br></p><p>Regards,<br> Vox</br></p><p><i>Terrific, would love to set something up. We do our interviews via skype<br> video. If that works in principle it would be great to set something up<br> for sooner than later. Would you be available this Friday at 11am<br> eastern time? I’d love to discuss your views on gamergate and just more<br> broadly how you general views inform your views on gamergate and the<br> gaming industry. It will be a casual discussion, likely 25 or so<br> minutes, just between you and I.</br></br></br></br></br></br></i><br> <i><br/></i><br> <i>best,</i><br> <i><br clear=\"all\"/></i><br> <i>David Pakman</i><br> <i>Host / The David Pakman Show / www.davidpakman.com</i></br></br></br></br></br></p><p>David has been insisting that the subsequent interview, which lightly touched on GamerGate and barely addressed the game industry at all, much less 23 years of experience in it or my current game development work, was not an ambush, even though he spent about 40 of the 49 minutes (24 more than requested), asking me to justify past blog posts, past WND columns, and in one case, the headline that the editors wrote for the column.<br> <i><br/></i><br> When called on this by Mike Cernovich and others on Twitter today, David claimed that I eagerly encouraged asking about his “controversial” statements.</br></br></p><blockquote class=\"tr_bq\"><p> Mike Cernovich@PlayDangerously<br> So @dpakman claims my assertion is laughable…yet he keeps dodging this question: Why not ask Kluwe about underage girls and rape jokes?</br></p><p>David Pakman ‏@dpakman<br> Interview with Chris came up quickly to specifically discuss why he was angry with our show, that was focus. Who are you?</br></p><p>Mr. Bones ‏@wellplayd_ggate<br> “to specifically discuss” “that was focus” You couldn’t focus on #GamerGate with Vox for 5 minutes, despite title</br></p><p>Bill Wilson ‏@piefke4<br> not only “despite title” but also despite the email he has sent to vox.</br></p><p>David Pakman ‏@dpakman<br> .@piefke4 @PlayDangerously thing is that before interview started @voxday eagerly encouraged asking about his “controversial” statements</br></p><p>Vox Day ‏@voxday<br> You asked me to talk about #GG and game dev. I’m lead on 6 games in development and you asked about ZERO!</br></p><p>David Pakman ‏@dpakman<br> right before we started you eagerly said you like focusing on the controversial stuff and to ask you q’s</br></p><p>Vox Day ‏@voxday<br> I will publish the transcript. The fact I don’t run from controversy doesn’t excuse gotcha journalism.</br></p><p>David Pakman ‏@dpakman<br> no idea what you’re talking about. that conversation took place before interview. there’s no transcript.</br></p><p>Vox Day ‏@voxday <br> There most certainly is. Like I said, you’re an amateur, David. I’ll publish it later today.</br></p><p>K Gallagher ‏@miles670 <br> Well holy shit, INTERESTING.</br></p><p>David Pakman ‏@dpakman <br> How could there be transcript of something that happened before interview? Did @voxday secretly write it down by hand?<i><br/></i></br></p></blockquote><p>From the pre-interview transcript:<i> </i></p><blockquote class=\"tr_bq\"><p> <b>David Pakman: </b><i>So what I’m thinking is that I’ve just been reading a ton of your stuff and doing research and all that. The kind of, like, entry door to our conversation will be #GamerGate, since that’s kind of like where your name surfaced to us. But then I plan on talking to you more generally about your work and other stuff you’ve done too.</i></p><p>Vox Day: That’s fine, and if you want to broach any controversial topic, I’m not afraid to address it.<i></i></p><p><b>David Pakman:</b><i> Okay, sounds good.</i></p></blockquote><p>Now, not being afraid to address a controversial subject, such as the one that has been almost constantly in the news for the last month, and about which I was contacted by the <i>Wall Street Journal</i>, and which has been covered in a fair amount of detail (if not much accuracy) everywhere from the UK <i>Guardian </i>to the <i>New Zealand Herald</i>, is not reasonably described as being eager to discuss the headlines of old columns I didn’t write or a single blog post cherry-picked from the 15,080+ posts available here.</p><p>When he said he wanted to talk more generally about my work, since I provided him with a description that said I am Lead Designer of Alpenwolf and Lead Editor of Castalia House, I assumed it would be about either the games I am developing or the books I am publishing.</p><blockquote class=\"tr_bq\"><p> On 4/22/2015 11:03 PM, David Pakman wrote:</p><div><div><div> <i>Perfect. What I need from you to lock this<br> in:</br></i></div><p><i><br> </br></i></p></div></div><p><i><br> -a one line introduction for introducing you on the<br> show</br></br></i></p><p>One line intro: Vox Day is the Lead Editor of Castalia House, a<br> professional game designer who supports GamerGate, and a 2015 Hugo<br> Award finalist in the Best Editor category.</br></br></p></blockquote><p>I certainly did not expect that “my work” encompassed a syndicated op/ed column that has been defunct for several years just as I didn’t expect to<br> be asked about my job shingling rooftops in an American Air<br> Force base in Japan either. It is deceitful, and demonstrates a complete lack of journalistic integrity, for a would-be journalist to ambush his interview subjects this way. It’s not hard to see, from the sly way David expands the possible range of the interview in the pre-interview from what he wrote in the email, that the ambush was not only intended, but premeditated.</br></br></p><p>And David’s attempt to falsely characterize my “eagerness” to discuss controversial subjects in an ex post facto defense of his ambush underlines his fundamental unreliability and lack of integrity in this regard.</p><p>I wouldn’t have had any problem with David Pakman bringing up any of the controversial subjects that have repeatedly appeared in places like <i>the Weekly Standard</i> or <i>Entertainment Weekly</i>. They were at least tangentially relevant given the Hugo coverage. But to bring up non-controversies that literally no major media source anywhere has discussed anywhere in relation to me cannot possibly be justified. This was a shameless attempt to make a story, not discuss or analyze an existing one.</p></div>",
  "content_text": "Last week, I was invited to be interviewed about GamerGate and game development by a YouTube show with which I was unfamiliar, the David Pakman Show. The invitation was as follows:\nOn Wed, Apr 22, 2015 at 4:30 PM\nFrom: VD\nSubject: show appearance\nMessage Body:\nYou tweeted at me and asked me if I would appear on the show. That’s fine, you can contact me via this email.\nRegards,\nVox\nTerrific, would love to set something up. We do our interviews via skype\nvideo. If that works in principle it would be great to set something up\nfor sooner than later. Would you be available this Friday at 11am\neastern time? I’d love to discuss your views on gamergate and just more\nbroadly how you general views inform your views on gamergate and the\ngaming industry. It will be a casual discussion, likely 25 or so\nminutes, just between you and I.\nbest,\nDavid Pakman\nHost / The David Pakman Show / www.davidpakman.com\nDavid has been insisting that the subsequent interview, which lightly touched on GamerGate and barely addressed the game industry at all, much less 23 years of experience in it or my current game development work, was not an ambush, even though he spent about 40 of the 49 minutes (24 more than requested), asking me to justify past blog posts, past WND columns, and in one case, the headline that the editors wrote for the column.\nWhen called on this by Mike Cernovich and others on Twitter today, David claimed that I eagerly encouraged asking about his “controversial” statements.\nMike Cernovich@PlayDangerously\nSo @dpakman claims my assertion is laughable…yet he keeps dodging this question: Why not ask Kluwe about underage girls and rape jokes?\nDavid Pakman ‏@dpakman\nInterview with Chris came up quickly to specifically discuss why he was angry with our show, that was focus. Who are you?\nMr. Bones ‏@wellplayd_ggate\n“to specifically discuss” “that was focus” You couldn’t focus on #GamerGate with Vox for 5 minutes, despite title\nBill Wilson ‏@piefke4\nnot only “despite title” but also despite the email he has sent to vox.\nDavid Pakman ‏@dpakman\n.@piefke4 @PlayDangerously thing is that before interview started @voxday eagerly encouraged asking about his “controversial” statements\nVox Day ‏@voxday\nYou asked me to talk about #GG and game dev. I’m lead on 6 games in development and you asked about ZERO!\nDavid Pakman ‏@dpakman\nright before we started you eagerly said you like focusing on the controversial stuff and to ask you q’s\nVox Day ‏@voxday\nI will publish the transcript. The fact I don’t run from controversy doesn’t excuse gotcha journalism.\nDavid Pakman ‏@dpakman\nno idea what you’re talking about. that conversation took place before interview. there’s no transcript.\nVox Day ‏@voxday\nThere most certainly is. Like I said, you’re an amateur, David. I’ll publish it later today.\nK Gallagher ‏@miles670\nWell holy shit, INTERESTING.\nDavid Pakman ‏@dpakman\nHow could there be transcript of something that happened before interview? Did @voxday secretly write it down by hand?\nFrom the pre-interview transcript:\nDavid Pakman:\nSo what I’m thinking is that I’ve just been reading a ton of your stuff and doing research and all that. The kind of, like, entry door to our conversation will be #GamerGate, since that’s kind of like where your name surfaced to us. But then I plan on talking to you more generally about your work and other stuff you’ve done too.\nVox Day: That’s fine, and if you want to broach any controversial topic, I’m not afraid to address it.\nDavid Pakman:\nOkay, sounds good.\nNow, not being afraid to address a controversial subject, such as the one that has been almost constantly in the news for the last month, and about which I was contacted by the\nWall Street Journal\n, and which has been covered in a fair amount of detail (if not much accuracy) everywhere from the UK\nGuardian\nto the\nNew Zealand Herald\n, is not reasonably described as being eager to discuss the headlines of old columns I didn’t write or a single blog post cherry-picked from the 15,080+ posts available here.\nWhen he said he wanted to talk more generally about my work, since I provided him with a description that said I am Lead Designer of Alpenwolf and Lead Editor of Castalia House, I assumed it would be about either the games I am developing or the books I am publishing.\nOn 4/22/2015 11:03 PM, David Pakman wrote:\nPerfect. What I need from you to lock this\nin:\n-a one line introduction for introducing you on the\nshow\nOne line intro: Vox Day is the Lead Editor of Castalia House, a\nprofessional game designer who supports GamerGate, and a 2015 Hugo\nAward finalist in the Best Editor category.\nI certainly did not expect that “my work” encompassed a syndicated op/ed column that has been defunct for several years just as I didn’t expect to\nbe asked about my job shingling rooftops in an American Air\nForce base in Japan either. It is deceitful, and demonstrates a complete lack of journalistic integrity, for a would-be journalist to ambush his interview subjects this way. It’s not hard to see, from the sly way David expands the possible range of the interview in the pre-interview from what he wrote in the email, that the ambush was not only intended, but premeditated.\nAnd David’s attempt to falsely characterize my “eagerness” to discuss controversial subjects in an ex post facto defense of his ambush underlines his fundamental unreliability and lack of integrity in this regard.\nI wouldn’t have had any problem with David Pakman bringing up any of the controversial subjects that have repeatedly appeared in places like\nthe Weekly Standard\nor\nEntertainment Weekly\n. They were at least tangentially relevant given the Hugo coverage. But to bring up non-controversies that literally no major media source anywhere has discussed anywhere in relation to me cannot possibly be justified. This was a shameless attempt to make a story, not discuss or analyze an existing one.",
  "tags": [
    "media"
  ],
  "categories": [],
  "sitemap_lastmod": "2015-05-01T14:25:00+00:00"
}