{
  "url": "https://voxday.net/2015/05/13/eco-on-animal-sou/",
  "scraped_at": "2025-12-16T12:55:33.550988",
  "title": "Eco on the animal soul",
  "date_display": "May 13, 2015",
  "date_iso": "2015-05-13T08:25:00+00:00",
  "date_from_url": "2015-05-13",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>Umberto Eco <a href=\"http://espresso.repubblica.it/opinioni/la-bustina-di-minerva/2015/04/29/news/sull-anima-delle-bestie-1.209924\">reviews an anthology of ancient works</a> devoted to considering the ensoulment of the animals:</p><blockquote class=\"tr_bq\"><p> <b>On the animal soul</b></p><p>Acording to the ancients, animals possessed rational knowledge. But<br> they also had feelings. And, according to this theology, they can<br> therefore go to Heaven.</br></br></p><p>Einaudi published a lovely anthology of ancient writings on “The<br> Soul of the Animals” (at 85 euros it is an expensive book but it is<br> a really nice one.) It is not only we of contemporary times who are<br> preoccupied with our dog or decide to go on a vegan diet in order to avoid killing animated beings. The ancients already considered the problem<br> of when an animal possessed reason. In his <i>Historia animalium</i>,<br> Aristotle said that in many animals could be seen traces of the<br> quality of soul, by which animals demonstrated gentleness and<br> courage, timidity, fear, and slyness, and even something that bears some similarities to wisdom.</br></br></br></br></br></br></br></p><p>It is in a stoic form that an argument appears, unanimously<br> attributed to Chrysippus of Soli, that was destined to be of great<br> popularity. It exists in two versions, but we will cite the more<br> notable, that of Sextus Empiricus, in which he recounted a dog that,<br> upon arriving at the meeting point of three paths and recognizing<br> with its sense of smell that the prey had not taken two of them,<br> deduced that it must have gone the third way. He thus proved that the dog<br> knew reason according to the principles of logic.</br></br></br></br></br></br></br></p><p>Another fundamental text is <i>“de sollertia animalium”</i> by<br> Plutarch, in which it is admitted that animal rationality is less<br> perfect than human reason, but also notes that diverse grades of<br> perfection are also found amongst human beings (an elegant way of<br> insinuating that we are beings who reason like the animals.). In<br> another text, <i>“Bruta animalia ratioe uti”</i>, to those who objected<br> that one could not attribute reason to beings that did not have an<br> innate notion of the divine, Plutarch responds by recalling that<br> Sisyphus, too, was an atheist. It is on that basis that he rejects a carnivorous diet, albeit with many exceptions,</br></br></br></br></br></br></br></br></p><p>We have a radical vegeterian thesis in the <i>“De abstinentia”</i> of<br> Porphyry. For Porphyry, the animals express the ideal interior state<br> and the fact that they don’t understand us is no more embarrassing to<br> them than the fact that we don’t understand the language or the<br> thought of the Indians or the Scythians.</br></br></br></br></p><p>It is too bad that the Einaudian account ends with Porphyry, although<br> the volume has more than 500 pages as it is. It would have been interesting to<br> have an anthology series in multiple volumes that contained the<br> succeeding discussions, from the beautiful pages of Montaigne<br> refuting Cartesian mechanics to the long and protracted polemics<br> involving Leibniz, Locke, Cudworth, More, Shaftesbury, Cordemoy,<br> Fontenelle, Bayle, Buffon, Rousseau, Condillac and others.</br></br></br></br></br></br></p></blockquote><p>I don’t know if all dogs go to Heaven or not. But frankly, it is very, very difficult to imagine a place that could be reasonably called Heaven, or be considered anything even remotely akin to a paradise, without them.</p></div>",
  "content_text": "Umberto Eco\nreviews an anthology of ancient works\ndevoted to considering the ensoulment of the animals:\nOn the animal soul\nAcording to the ancients, animals possessed rational knowledge. But\nthey also had feelings. And, according to this theology, they can\ntherefore go to Heaven.\nEinaudi published a lovely anthology of ancient writings on “The\nSoul of the Animals” (at 85 euros it is an expensive book but it is\na really nice one.) It is not only we of contemporary times who are\npreoccupied with our dog or decide to go on a vegan diet in order to avoid killing animated beings. The ancients already considered the problem\nof when an animal possessed reason. In his\nHistoria animalium\n,\nAristotle said that in many animals could be seen traces of the\nquality of soul, by which animals demonstrated gentleness and\ncourage, timidity, fear, and slyness, and even something that bears some similarities to wisdom.\nIt is in a stoic form that an argument appears, unanimously\nattributed to Chrysippus of Soli, that was destined to be of great\npopularity. It exists in two versions, but we will cite the more\nnotable, that of Sextus Empiricus, in which he recounted a dog that,\nupon arriving at the meeting point of three paths and recognizing\nwith its sense of smell that the prey had not taken two of them,\ndeduced that it must have gone the third way. He thus proved that the dog\nknew reason according to the principles of logic.\nAnother fundamental text is\n“de sollertia animalium”\nby\nPlutarch, in which it is admitted that animal rationality is less\nperfect than human reason, but also notes that diverse grades of\nperfection are also found amongst human beings (an elegant way of\ninsinuating that we are beings who reason like the animals.). In\nanother text,\n“Bruta animalia ratioe uti”\n, to those who objected\nthat one could not attribute reason to beings that did not have an\ninnate notion of the divine, Plutarch responds by recalling that\nSisyphus, too, was an atheist. It is on that basis that he rejects a carnivorous diet, albeit with many exceptions,\nWe have a radical vegeterian thesis in the\n“De abstinentia”\nof\nPorphyry. For Porphyry, the animals express the ideal interior state\nand the fact that they don’t understand us is no more embarrassing to\nthem than the fact that we don’t understand the language or the\nthought of the Indians or the Scythians.\nIt is too bad that the Einaudian account ends with Porphyry, although\nthe volume has more than 500 pages as it is. It would have been interesting to\nhave an anthology series in multiple volumes that contained the\nsucceeding discussions, from the beautiful pages of Montaigne\nrefuting Cartesian mechanics to the long and protracted polemics\ninvolving Leibniz, Locke, Cudworth, More, Shaftesbury, Cordemoy,\nFontenelle, Bayle, Buffon, Rousseau, Condillac and others.\nI don’t know if all dogs go to Heaven or not. But frankly, it is very, very difficult to imagine a place that could be reasonably called Heaven, or be considered anything even remotely akin to a paradise, without them.",
  "tags": [
    "Eco",
    "philosophy"
  ],
  "categories": [],
  "sitemap_lastmod": "2015-05-13T07:25:00+00:00"
}