{
  "url": "https://voxday.net/2015/05/28/george-martin-loves-rape/",
  "scraped_at": "2025-12-16T12:57:23.623095",
  "title": "George Martin really really likes rape",
  "date_display": "May 28, 2015",
  "date_iso": "2015-05-28T15:30:00+00:00",
  "date_from_url": "2015-05-28",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>Like the worm, the SJW <a href=\"http://tafkarfanfic.tumblr.com/post/119770640640/rape-in-asoiaf-vs-game-of-thrones-a-statistical\">always turns on his own</a>:</p><blockquote class=\"tr_bq\"><p> Rape acts in Game of Thrones the TV series (to date): 50<br> Rape victims in Game of Thrones (to date): 29</br></p><p>Rape acts in ASOIAF the book series (to date): 214<br> Rape victims in ASOIAF (to date): 117</br></p><p>The books contain over 4 times as much rape as the show (and probably even more; the method of analysis likely underestimates the rape in the books – see below).</p><p>Before the barrage of anon hate mail floods in: that’s not to say the show’s not problematic. It’s to say that the books are problematic. ETA: Please see <a href=\"http://tafkarfanfic.tumblr.com/post/119891015455/a-song-of-ice-and-fire-has-a-rape-problem\">A Song of Ice and Fire Has a Rape Problem</a> for a detailed discussion on why the rapes in the books aren’t any better than those in the show. Spoiler: the only women who get vengeance on their rapists are villains.</p></blockquote><p>Those 214 rape acts are particularly astonishing if you compare them to the number of times a married couple has sex. Which, if my memory serves correctly, happens about twice in five books.</p><p>Nor are the various defenses of Martin that have been offered valid. As Tafkar notes: <i>“the only thing that protects a woman from rape is being one of Martin’s POV characters.” </i></p><p>More damning is this conclusion: <i>“</i><i>The stories of rapists are important to George R. R. Martin. Those are<br> the stories he tells. Our point of view characters are the rapists, not<br> the victims.” </br></br></i></p><p>George R.R. Martin well merits his fate. </p></div>",
  "content_text": "Like the worm, the SJW\nalways turns on his own\n:\nRape acts in Game of Thrones the TV series (to date): 50\nRape victims in Game of Thrones (to date): 29\nRape acts in ASOIAF the book series (to date): 214\nRape victims in ASOIAF (to date): 117\nThe books contain over 4 times as much rape as the show (and probably even more; the method of analysis likely underestimates the rape in the books – see below).\nBefore the barrage of anon hate mail floods in: that’s not to say the show’s not problematic. It’s to say that the books are problematic. ETA: Please see\nA Song of Ice and Fire Has a Rape Problem\nfor a detailed discussion on why the rapes in the books aren’t any better than those in the show. Spoiler: the only women who get vengeance on their rapists are villains.\nThose 214 rape acts are particularly astonishing if you compare them to the number of times a married couple has sex. Which, if my memory serves correctly, happens about twice in five books.\nNor are the various defenses of Martin that have been offered valid. As Tafkar notes:\n“the only thing that protects a woman from rape is being one of Martin’s POV characters.”\nMore damning is this conclusion:\n“\nThe stories of rapists are important to George R. R. Martin. Those are\nthe stories he tells. Our point of view characters are the rapists, not\nthe victims.”\nGeorge R.R. Martin well merits his fate.",
  "tags": [
    "Pink SF",
    "SJW"
  ],
  "categories": [],
  "sitemap_lastmod": "2015-05-28T14:30:00+00:00"
}