{
  "url": "https://voxday.net/2015/05/14/islands-in-sea-of-rhetoric/",
  "scraped_at": "2025-12-16T12:55:44.286161",
  "title": "Islands in a sea of rhetoric",
  "date_display": "May 14, 2015",
  "date_iso": "2015-05-14T23:17:00+00:00",
  "date_from_url": "2015-05-14",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>I stopped commenting at File 770 as it proved to be another exercise in demonstrating the truth of Aristotle’s dictum about those who cannot be instructed. Give them dialectic and they shamelessly attempt to pick it apart, some honestly, most dishonestly, while constantly declaring that any errors or falsehoods on their part are irrelevant. Give them rhetoric to meet them at their level and they either cry about it or concoct pseudo-dialectic to explain why it’s not valid.</p><p><u>Example 1</u><br> VD: SJWs always lie.<br> SJW: I told the truth once back in 2007. See, you’re totally wrong. Your whole argument is disproved. You are a bad person. DISQUALIFIED!</br></br></p><p><u>Example 2</u><br> VD: I stopped commenting at File 770.<br> SJW: You said you stopped commenting and then LEFT ONE MORE COMMENT THERE! See, you’re totally wrong. Your whole argument is disproved. Aristotle! You are a bad person. DISQUALIFIED!</br></br></p><p>Quod erat demonstrandum.</p><p>But the SJW theatre of the absurd aside, the continuing Hugo coverage at File 770 makes for interesting reading, particularly as the few remaining commenters possessing intellectual integrity one-by-one throw up their hands and stop trying to force the relevant facts through the SJW’s cast-iron skulls. A pair of neutrals recounted typical experiences, as one of them juxstaposed his treatment at various Puppy sites versus SF-SJW Central:</p><blockquote class=\"tr_bq\"><p> Brief Side note re: Making Light. I posted there, maybe 4 times in a discussion a month or so ago. Never a name called, never a nasty word, did not attack anyone, and was in the middle of a dialogue with another poster that came across as reasonable. My posts were disemvowelled and the board owner called me a liar. I’ve posted several times here, and at Larry’s, Brad’s, and Sarah Hoyt’s boards. At least one time I got shouted at a little, but no one edited me away to nonsense. That makes me more sympathetic with the folks not grooming their comment sections /shrug</p></blockquote><blockquote><p> AG on May 14, 2015 at 3:20 pm said: Regarding disemvowelling at Making Light, I took part in the initial discussion about voting rules, which as a mathematician I found very interesting. There was a contributor there (I don’t remember his name) who was an expert on voting systems and made the most valuable contributions. I certainly learned a lot from his posts. Then he made a post where he mentioned his web site (which was on topic, because it was about voting systems and potentially of interest to the people who were taking part in that discussion) and he was disemvowelled, which is something that I had never seen before and found absolutely bizarre.</p><p>Ostensibly the reason was for spamming, although as I said the poster was the one who had made the most valuable contributions to the discussion and the link was not off-topic. Talking about it, he got several more posts disemvowelled. I respect owners’ right to moderate content in their sites, but I found the practice of disemvoweling abusive and humiliating, more indicative of a petty bully in charge showing her power than of a serious moderator, and it convinced me that I did not want to have anything to do with that site.</p></blockquote><p>The Making Light crew is what it is, and what it has been for the past decade. Another former neutral expressed some degree of surprise at the insistence that the Puppy tactics have been in any way worse than past tactics utilized in the SF field:</p><blockquote class=\"tr_bq\"><p> Steve Moss on May 14, 2015 at 3:20 pm said:</p><p>David W. @ 3:08 pm- So log-rolling is acceptable, with all that implies, but slates are not?</p><p>Accepting for argument’s sake the definitions of some, a slate is a list of public recommendation with a common political interest. That’s bad.</p><p>Log-rolling, quietly horse-trading votes based on self-interest (I want to win and need to be “strategic”), that’s okay.</p><p>Leaving aside the debated to death argument on slates (which I disagree is bad), it occurs to me the greatest sin the SP/RP have committed is exposing the Hugo process to the light of day. Now that more fans know: 1) that it didn’t/doesn’t take much to get a nomination; and, 2) about the behind the scenes chicanery, the Hugo loses some of its luster.</p><p>I think the position of some in fandom is laughable. What SP/RP did is the exact same thing; they just did it better and publicly. And that’s unforgivable.</p></blockquote><p>It’s not surprising that the SJWs are already working very hard to change the rules because we’ve shown up and operated in an above-board manner. Instead of playing coy and disingenuous and plausibly deniable, we simply said “hey, vote for these works.” Note that it wasn’t all that long ago that SJWs in SFWA changed the Nebula rules to HIDE the evidence of all the log-rolling that was taking place there. They are always determined to hide what is actually taking place under the rocks where they dwell, which is why our straightforward tactics are so abhorrent to them.</p><p>UPDATE: While this will no doubt set the rhetoricals spinning again, it was too painful to watch people opining ineptly about whether Scalzi’s LOCK IN was a relative failure (truth) or a massive success that only proves that John Scalzi is a massive success in everything he does (SJW narrative). So, against my better judgment, <a href=\"http://file770.com/?p=22527&amp;cpage=2#comment-262112\">I pointed out the completely obvious</a> that had somehow managed to elude the rocket scientists commenting at File 770:</p><div class=\"comment-content\"><blockquote class=\"tr_bq\"><p> Forget Old Man’s War and all the<br> hardcover vs softcover vs audio and so forth. The reason both Scalzi and<br> PNH were so disappointed by Lock In’s sales is obvious:</br></br></p><p>“Lock In’s sales are for the first 8 months”: 10,000</p><p>Redshirts first seven months: 26,604</p><p>As every writer here knows, success is a) relative and b) takes<br> trajectory into account. Doing one-third the numbers with considerably<br> more marketing expense than your previous book is not, in most quarters,<br> considered a desirable trajectory.</br></br></br></p><p>Scalzi is an inflated midlist writer. He has likely peaked at a point<br> much higher than most SF writers ever reach. It’s an incredible<br> accomplishment, especially if one takes into account how little talent<br> or originality he possesses. There is no shame in that.</br></br></br></p><p>Where there is shame is claiming that you have 2 million pageviews<br> when you truly have only 305,000. Where there is shame is aggressively<br> campaigning for nine Hugo nominations, and then campaigning for more<br> because two more than Arthur C. Clarke is not enough.</br></br></br></p></blockquote></div><p>That is an apples-to-apples comparison. Hardcover to hardcover. And if that simple recitation of relevant facts isn’t sufficient to convince you, then obviously no information is sufficient to instruct you or change your mind.</p></div>",
  "content_text": "I stopped commenting at File 770 as it proved to be another exercise in demonstrating the truth of Aristotle’s dictum about those who cannot be instructed. Give them dialectic and they shamelessly attempt to pick it apart, some honestly, most dishonestly, while constantly declaring that any errors or falsehoods on their part are irrelevant. Give them rhetoric to meet them at their level and they either cry about it or concoct pseudo-dialectic to explain why it’s not valid.\nExample 1\nVD: SJWs always lie.\nSJW: I told the truth once back in 2007. See, you’re totally wrong. Your whole argument is disproved. You are a bad person. DISQUALIFIED!\nExample 2\nVD: I stopped commenting at File 770.\nSJW: You said you stopped commenting and then LEFT ONE MORE COMMENT THERE! See, you’re totally wrong. Your whole argument is disproved. Aristotle! You are a bad person. DISQUALIFIED!\nQuod erat demonstrandum.\nBut the SJW theatre of the absurd aside, the continuing Hugo coverage at File 770 makes for interesting reading, particularly as the few remaining commenters possessing intellectual integrity one-by-one throw up their hands and stop trying to force the relevant facts through the SJW’s cast-iron skulls. A pair of neutrals recounted typical experiences, as one of them juxstaposed his treatment at various Puppy sites versus SF-SJW Central:\nBrief Side note re: Making Light. I posted there, maybe 4 times in a discussion a month or so ago. Never a name called, never a nasty word, did not attack anyone, and was in the middle of a dialogue with another poster that came across as reasonable. My posts were disemvowelled and the board owner called me a liar. I’ve posted several times here, and at Larry’s, Brad’s, and Sarah Hoyt’s boards. At least one time I got shouted at a little, but no one edited me away to nonsense. That makes me more sympathetic with the folks not grooming their comment sections /shrug\nAG on May 14, 2015 at 3:20 pm said: Regarding disemvowelling at Making Light, I took part in the initial discussion about voting rules, which as a mathematician I found very interesting. There was a contributor there (I don’t remember his name) who was an expert on voting systems and made the most valuable contributions. I certainly learned a lot from his posts. Then he made a post where he mentioned his web site (which was on topic, because it was about voting systems and potentially of interest to the people who were taking part in that discussion) and he was disemvowelled, which is something that I had never seen before and found absolutely bizarre.\nOstensibly the reason was for spamming, although as I said the poster was the one who had made the most valuable contributions to the discussion and the link was not off-topic. Talking about it, he got several more posts disemvowelled. I respect owners’ right to moderate content in their sites, but I found the practice of disemvoweling abusive and humiliating, more indicative of a petty bully in charge showing her power than of a serious moderator, and it convinced me that I did not want to have anything to do with that site.\nThe Making Light crew is what it is, and what it has been for the past decade. Another former neutral expressed some degree of surprise at the insistence that the Puppy tactics have been in any way worse than past tactics utilized in the SF field:\nSteve Moss on May 14, 2015 at 3:20 pm said:\nDavid W. @ 3:08 pm- So log-rolling is acceptable, with all that implies, but slates are not?\nAccepting for argument’s sake the definitions of some, a slate is a list of public recommendation with a common political interest. That’s bad.\nLog-rolling, quietly horse-trading votes based on self-interest (I want to win and need to be “strategic”), that’s okay.\nLeaving aside the debated to death argument on slates (which I disagree is bad), it occurs to me the greatest sin the SP/RP have committed is exposing the Hugo process to the light of day. Now that more fans know: 1) that it didn’t/doesn’t take much to get a nomination; and, 2) about the behind the scenes chicanery, the Hugo loses some of its luster.\nI think the position of some in fandom is laughable. What SP/RP did is the exact same thing; they just did it better and publicly. And that’s unforgivable.\nIt’s not surprising that the SJWs are already working very hard to change the rules because we’ve shown up and operated in an above-board manner. Instead of playing coy and disingenuous and plausibly deniable, we simply said “hey, vote for these works.” Note that it wasn’t all that long ago that SJWs in SFWA changed the Nebula rules to HIDE the evidence of all the log-rolling that was taking place there. They are always determined to hide what is actually taking place under the rocks where they dwell, which is why our straightforward tactics are so abhorrent to them.\nUPDATE: While this will no doubt set the rhetoricals spinning again, it was too painful to watch people opining ineptly about whether Scalzi’s LOCK IN was a relative failure (truth) or a massive success that only proves that John Scalzi is a massive success in everything he does (SJW narrative). So, against my better judgment,\nI pointed out the completely obvious\nthat had somehow managed to elude the rocket scientists commenting at File 770:\nForget Old Man’s War and all the\nhardcover vs softcover vs audio and so forth. The reason both Scalzi and\nPNH were so disappointed by Lock In’s sales is obvious:\n“Lock In’s sales are for the first 8 months”: 10,000\nRedshirts first seven months: 26,604\nAs every writer here knows, success is a) relative and b) takes\ntrajectory into account. Doing one-third the numbers with considerably\nmore marketing expense than your previous book is not, in most quarters,\nconsidered a desirable trajectory.\nScalzi is an inflated midlist writer. He has likely peaked at a point\nmuch higher than most SF writers ever reach. It’s an incredible\naccomplishment, especially if one takes into account how little talent\nor originality he possesses. There is no shame in that.\nWhere there is shame is claiming that you have 2 million pageviews\nwhen you truly have only 305,000. Where there is shame is aggressively\ncampaigning for nine Hugo nominations, and then campaigning for more\nbecause two more than Arthur C. Clarke is not enough.\nThat is an apples-to-apples comparison. Hardcover to hardcover. And if that simple recitation of relevant facts isn’t sufficient to convince you, then obviously no information is sufficient to instruct you or change your mind.",
  "tags": [
    "Hugo Award",
    "SJW"
  ],
  "categories": [],
  "sitemap_lastmod": "2015-05-14T22:17:00+00:00"
}