{
  "url": "https://voxday.net/2015/05/22/its-not-nice-to-kick-puppy/",
  "scraped_at": "2025-12-16T12:56:40.004473",
  "title": "Just a reminder",
  "date_display": "May 22, 2015",
  "date_iso": "2015-05-22T12:00:00+00:00",
  "date_from_url": "2015-05-22",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>Kicking Puppies is not nice. Glenn Hauman issued a second call for anti-Puppy Amazon reviews, this time on File 770:</p><blockquote class=\"tr_bq\"><p> Glenn Hauman on <a href=\"https://archive.is/UCk4j\">April 15, 2015 </a><br> You can game Amazon ratings as well. Here’s a list of all of Mr. Beale’s nominees, complete with handy links to Amazon. It might be a good idea to take a look at the reviews and see which ones are helpful. If you’ve read the works, you should add your own review. Oh, and to answer the title question: what do you do to rabid puppies? <b style=\"border-color: white; border-style: none; border-width: 0px; font-family: inherit; font-size: 100%; font-style: inherit; font-weight: 700; margin: 0px; outline: invert none 0px; padding: 0px; text-align: left; vertical-align: baseline;\">You put them down.</b></br></p><p>Glenn Hauman on <a href=\"http://file770.com/?p=22634&amp;cpage=1#comment-265683\">May 20, 2015</a> at 10:51 pm said:<br> Just a reminder to all Hugo voters: After you’ve read items in the Hugo packet, you don’t have to confine any reviews of them to your own blogs and social media. Feel free to add them to Amazon as well.</br></p></blockquote><p>And once again, SJWs have obediently responded to his call. Mr. Hauman’s actions strike me as a very good way to encourage publishers to stop participating in future Hugo Packets. I mean, why should we do so if it’s only going to provide the SJWs in science fiction with another means of attack? Mr. Hauman has demonstrated how the Hugo Packet can be destroyed in a single year; what publisher is going to even be willing to include excerpts when inclusion in the Packet means several hundred one-star reviews on Amazon within weeks?</p><blockquote class=\"tr_bq\"><p> BIG BOYS DON’T CRY<br> <b><br>Not recommended</br></b><br> This is not a very good story. To be honest, it is not my kind of SF and the only reason I read it was because of the Hugo nomination. <br> Published 3 hours ago by Hampus Eckerman</br></br></br></p><p><b>Lame Whiny Book</b>.<br> (Disclaimer: I didn’t buy the book here; got it as part of the Hugo ballot packet.) David Weber can write cartoon villains and cowardly REMFs and it’s fun to read, even… <br> Published 10 hours ago by Bill Stewart</br></br></p><p><b>What a Waste of Time</b><br> This must have been a rough year for novellas if this is one of the front-runners for a major award. Did he pay his friends to nominate him? <br> Published 11 hours ago by Janelle Wilbanks</br></br></p><p><b>Dated and amateurish MilSF</b><br> Another 2015 Hugo nominee from the Puppies.<br> Magnolia, a.k.a. Maggie, is a Ratha, an armored war machine in the military forces of a starfaring and aggressive Earth… Read more<br> Published 21 hours ago by Elisabeth Carey</br></br></br></p></blockquote><p>These reviews averaged 1.5 stars, whereas the 142 other reviews averaged 4.3 stars. Elisabeth Carey is also attacking John C. Wright, giving ONE BRIGHT STAR TO GUIDE THEM <a href=\"http://www.amazon.com/review/R2691PTX0VT0HE/ref=cm_cr_rdp_perm?ie=UTF8&amp;ASIN=B00N9760GO\">its only two-star rating</a> in 80 reviews which otherwise average 4.5 stars. No doubt this is merely a matter of differing tastes combined with some coincidental timing. Again.</p><p>Of course, BIG BOYS DON’T CRY and ONE BRIGHT STAR TO GUIDE THEM are not the only Hugo nominees included in the Hugo Packet. <a href=\"http://www.amazon.com/Ancillary-Sword-Imperial-Radch-Leckie/dp/0316246654/ref=sr_1_1?ie=UTF8&amp;qid=1432297724&amp;sr=8-1&amp;keywords=ancillary+sword\">ANCILLARY SWORD</a> presently has 204 reviews and a 4.1 rating. <a href=\"http://www.amazon.com/Goblin-Emperor-Katherine-Addison-ebook/dp/B00FO6NPIO/ref=sr_1_8?ie=UTF8&amp;qid=1432297724&amp;sr=8-8&amp;keywords=ancillary+sword\">THE GOBLIN EMPEROR</a> has 232 reviews and a 4.4 rating. To quote Mr. Hauman: <i>“Just a reminder to all Hugo voters: After you’ve read items in the Hugo<br> packet, you don’t have to confine any reviews of them to your own blogs<br> and social media. Feel free to add them to Amazon as well.”</br></br></i></p><p>Feel free, the man says. Feel free. On a tangential note, while Chuck D brought us the concept of the one-man riot, Lori Coulson has invented the one-woman blacklist. She’s going to continue to not read books by authors she had never read before:</p><blockquote class=\"tr_bq\"><p> Lori Coulson on May 21, 2015 at 8:38 pm said:<br> The one thing the Hugo packet has demonstrated to me? That there are a bunch of authors out there I never want to read again, and not only will I not read anything more by them, I definitely won’t be reading anything the “Evil League of Evil” writes, edits or publishes. After being wowed by “The Crucible” in High School and taking the lesson within to heart, I find I’m starting my own personal blacklist. And it makes me very unhappy that it’s necessary to do so.</br></p></blockquote><p>And here we were told blacklists were bad. Anyhow, this sounds rather like MSNBC’s audience threatening to never watch Fox News again.</p></div>",
  "content_text": "Kicking Puppies is not nice. Glenn Hauman issued a second call for anti-Puppy Amazon reviews, this time on File 770:\nGlenn Hauman on\nApril 15, 2015\nYou can game Amazon ratings as well. Here’s a list of all of Mr. Beale’s nominees, complete with handy links to Amazon. It might be a good idea to take a look at the reviews and see which ones are helpful. If you’ve read the works, you should add your own review. Oh, and to answer the title question: what do you do to rabid puppies?\nYou put them down.\nGlenn Hauman on\nMay 20, 2015\nat 10:51 pm said:\nJust a reminder to all Hugo voters: After you’ve read items in the Hugo packet, you don’t have to confine any reviews of them to your own blogs and social media. Feel free to add them to Amazon as well.\nAnd once again, SJWs have obediently responded to his call. Mr. Hauman’s actions strike me as a very good way to encourage publishers to stop participating in future Hugo Packets. I mean, why should we do so if it’s only going to provide the SJWs in science fiction with another means of attack? Mr. Hauman has demonstrated how the Hugo Packet can be destroyed in a single year; what publisher is going to even be willing to include excerpts when inclusion in the Packet means several hundred one-star reviews on Amazon within weeks?\nBIG BOYS DON’T CRY\nNot recommended\nThis is not a very good story. To be honest, it is not my kind of SF and the only reason I read it was because of the Hugo nomination.\nPublished 3 hours ago by Hampus Eckerman\nLame Whiny Book\n.\n(Disclaimer: I didn’t buy the book here; got it as part of the Hugo ballot packet.) David Weber can write cartoon villains and cowardly REMFs and it’s fun to read, even…\nPublished 10 hours ago by Bill Stewart\nWhat a Waste of Time\nThis must have been a rough year for novellas if this is one of the front-runners for a major award. Did he pay his friends to nominate him?\nPublished 11 hours ago by Janelle Wilbanks\nDated and amateurish MilSF\nAnother 2015 Hugo nominee from the Puppies.\nMagnolia, a.k.a. Maggie, is a Ratha, an armored war machine in the military forces of a starfaring and aggressive Earth… Read more\nPublished 21 hours ago by Elisabeth Carey\nThese reviews averaged 1.5 stars, whereas the 142 other reviews averaged 4.3 stars. Elisabeth Carey is also attacking John C. Wright, giving ONE BRIGHT STAR TO GUIDE THEM\nits only two-star rating\nin 80 reviews which otherwise average 4.5 stars. No doubt this is merely a matter of differing tastes combined with some coincidental timing. Again.\nOf course, BIG BOYS DON’T CRY and ONE BRIGHT STAR TO GUIDE THEM are not the only Hugo nominees included in the Hugo Packet.\nANCILLARY SWORD\npresently has 204 reviews and a 4.1 rating.\nTHE GOBLIN EMPEROR\nhas 232 reviews and a 4.4 rating. To quote Mr. Hauman:\n“Just a reminder to all Hugo voters: After you’ve read items in the Hugo\npacket, you don’t have to confine any reviews of them to your own blogs\nand social media. Feel free to add them to Amazon as well.”\nFeel free, the man says. Feel free. On a tangential note, while Chuck D brought us the concept of the one-man riot, Lori Coulson has invented the one-woman blacklist. She’s going to continue to not read books by authors she had never read before:\nLori Coulson on May 21, 2015 at 8:38 pm said:\nThe one thing the Hugo packet has demonstrated to me? That there are a bunch of authors out there I never want to read again, and not only will I not read anything more by them, I definitely won’t be reading anything the “Evil League of Evil” writes, edits or publishes. After being wowed by “The Crucible” in High School and taking the lesson within to heart, I find I’m starting my own personal blacklist. And it makes me very unhappy that it’s necessary to do so.\nAnd here we were told blacklists were bad. Anyhow, this sounds rather like MSNBC’s audience threatening to never watch Fox News again.",
  "tags": [
    "Puppies",
    "SJW"
  ],
  "categories": [],
  "sitemap_lastmod": "2015-05-22T11:00:00+00:00"
}