{
  "url": "https://voxday.net/2015/05/11/mailvox-brainstorm-club/",
  "scraped_at": "2025-12-16T12:55:22.887703",
  "title": "Mailvox: the Brainstorm Club",
  "date_display": "May 11, 2015",
  "date_iso": "2015-05-11T21:44:00+00:00",
  "date_from_url": "2015-05-11",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><div> Several people seem to very much want to explore the limits of sanity. Minion #38 painstakingly inscribed the following note on a bone that was left outside my chambers this morning.</div><blockquote class=\"tr_bq\"><div> In one of your replies to a commenter on today’s VP post entitled<br> “Why kids hate nerds,” you mentioned that you dial down a lot of your<br> thoughts before presenting them on your blogs, and that they would be<br> more interesting if you could openly brainstorm.  As a VFM and daily<br> reader of both VP and AG, I couldn’t agree more.  I rarely comment on<br> your blogs, but I find your theories to be some of the most thought<br> provoking ideas I’ve ever read.  I’d love to hear more. Would<br> you ever consider sharing more of your “crazy theories and random<br> notions” somewhere other than on your blogs without as much of the<br> dialing down required for a wider audience?  Maybe via a members only<br> message board, youtube channel, voice/chat server, or really any medium<br> of your choosing?</br></br></br></br></br></br></br></br></br></br></br></div></blockquote><p>I don’t object to the idea in principle, but I’m slightly reluctant to dabble in such things because I always want to provide unquestioned value for money. I have no problem with capitalism, obviously, but as should be obvious from the lack of advertising and tip jars and so forth, I’m not into the Patreon model either. You guys have been absolutely superb about supporting Castalia House for over a year now, and not only do I appreciate that, I’m perfectly aware that no well of goodwill is endless.</p><p>That being said, I also know that I would have leaped at the chance to take part in something like what is being suggested were the individual at the center someone like Umberto Eco. My interviews with him, John Julius Norwich, and Steve Keen have been some of the intellectual high points of my life.</p><p>My thought is that what might be interesting as well as useful would be a monthly members-only Skypecast, with a transcript that would be sent out to members afterward. Members could suggest topics and when possible, the topics would be listed ahead of time so that those interested could sign up and take part. I imagine it could be done for not much more than the price of a movie, although it might be desirable to not make it so inexpensive that too many people would take part. Memberships would be purchased through Castalia House, either one-time or annual with a discount.</p><p>Anyhow, if it’s of interest, feel free to throw out your own ideas here. I’m not saying that anything will be done at all because I am extremely busy. But given the amount of collective brainpower here, it wouldn’t be surprising if the concept proved to be worthwhile. The main questions, to my mind, are the number of members, the price of membership, and the frequency. The maximum number of Skype video is 10, and 25 for voice, while GoToMeeting Plus permits up to 100 video participants.</p></div>",
  "content_text": "Several people seem to very much want to explore the limits of sanity. Minion #38 painstakingly inscribed the following note on a bone that was left outside my chambers this morning.\nIn one of your replies to a commenter on today’s VP post entitled\n“Why kids hate nerds,” you mentioned that you dial down a lot of your\nthoughts before presenting them on your blogs, and that they would be\nmore interesting if you could openly brainstorm.  As a VFM and daily\nreader of both VP and AG, I couldn’t agree more.  I rarely comment on\nyour blogs, but I find your theories to be some of the most thought\nprovoking ideas I’ve ever read.  I’d love to hear more. Would\nyou ever consider sharing more of your “crazy theories and random\nnotions” somewhere other than on your blogs without as much of the\ndialing down required for a wider audience?  Maybe via a members only\nmessage board, youtube channel, voice/chat server, or really any medium\nof your choosing?\nI don’t object to the idea in principle, but I’m slightly reluctant to dabble in such things because I always want to provide unquestioned value for money. I have no problem with capitalism, obviously, but as should be obvious from the lack of advertising and tip jars and so forth, I’m not into the Patreon model either. You guys have been absolutely superb about supporting Castalia House for over a year now, and not only do I appreciate that, I’m perfectly aware that no well of goodwill is endless.\nThat being said, I also know that I would have leaped at the chance to take part in something like what is being suggested were the individual at the center someone like Umberto Eco. My interviews with him, John Julius Norwich, and Steve Keen have been some of the intellectual high points of my life.\nMy thought is that what might be interesting as well as useful would be a monthly members-only Skypecast, with a transcript that would be sent out to members afterward. Members could suggest topics and when possible, the topics would be listed ahead of time so that those interested could sign up and take part. I imagine it could be done for not much more than the price of a movie, although it might be desirable to not make it so inexpensive that too many people would take part. Memberships would be purchased through Castalia House, either one-time or annual with a discount.\nAnyhow, if it’s of interest, feel free to throw out your own ideas here. I’m not saying that anything will be done at all because I am extremely busy. But given the amount of collective brainpower here, it wouldn’t be surprising if the concept proved to be worthwhile. The main questions, to my mind, are the number of members, the price of membership, and the frequency. The maximum number of Skype video is 10, and 25 for voice, while GoToMeeting Plus permits up to 100 video participants.",
  "tags": [
    "conspiracy",
    "mailvox"
  ],
  "categories": [],
  "sitemap_lastmod": "2015-05-11T20:44:00+00:00"
}