{
  "url": "https://voxday.net/2015/05/25/mcrapey-locks-in-retiremen/",
  "scraped_at": "2025-12-16T12:56:57.987432",
  "title": "A lesson in con artistry",
  "date_display": "May 25, 2015",
  "date_iso": "2015-05-25T12:00:00+00:00",
  "date_from_url": "2015-05-25",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>I thought <a href=\"http://www.nytimes.com/2015/05/25/business/media/science-fiction-writer-signs-a-3-4-million-deal.html\">John Scalzi’s new book deal</a> to lock in his retirement was an interesting indication of his intrinsic insecurity as well as the practicality that distinguishes him from most of his SF colleagues.</p><blockquote class=\"tr_bq\"><p> John Scalzi, a best-selling author of science fiction, has signed a $3.4 million, 10-year deal with the publisher Tor Books that will cover his next 13 books.</p><p>Mr. Scalzi’s works include a series known as the “Old Man’s War” and the more recent “Redshirts,” a Hugo-award-winning sendup of the luckless lives of nonfeatured characters on shows like the original “Star Trek.” Three of his works are being developed for television, including “Redshirts” and “Lock In,” a science-inflected medical thriller that evokes Michael Crichton. Mr. Scalzi’s hyper-caffeinated Internet presence through his blog, Whatever, has made him an online celebrity as well.</p><p>Mr. Scalzi approached Tor Books, his longtime publisher, with proposals for 10 adult novels and three young adult novels over 10 years. Some of the books will extend the popular “Old Man’s War” series, building on an existing audience, and one will be a sequel to “Lock In.” Mr. Scalzi said he hoped books like “Lock In” could draw more readers toward science fiction, since many, he said, are still “gun-shy” about the genre.</p><p>Patrick Nielsen Hayden, the executive editor for Tor, said the decision was an easy one.</p></blockquote><p>I imagine it was a very easy one. Scalzi is, nominally, Tor’s big dog. He’s not a proper big dog, as he isn’t one of their ten annual biggest sellers or even a bestselling author, but he’s their most important SF figurehead author. Who else do they have? Of their better-selling authors, Frank Herbert is dead, Robert Jordan is dead, Orson Scott Card is hated by their core audience, and they can’t control Microsoft or the game companies whose tie-in novels are their biggest sellers. They have Scalzi and Brandon Sanderson, both of whom appear to have more or less peaked in terms of their careers. It’s not as if the award-winning Jo Walton or the award-winning Catharine Asaro or any of their other award-winning authors sell enough books to support all the SJW non-SF they keep trying to push on an unwilling public.</p><p>So to be gifted the opportunity to lock in one of their top authors for a decade at little more than 250k per book at an initial cost of $1 million up front is an absolute no-brainer. Scalzi is a hack in the positive sense of the term; unless he’s dead there is no chance he’s not going to be able to churn out the sort of mediocre material he produces. To break even on the initial advance, (the payments are usually divided into signing, delivery, and acceptance these days), Tor only has to sell an average of about 15k books each. Assuming all 13 books are delivered and paid for, they have to sell around 40k copies apiece, which should be doable considering that Redshirts sold nearly that many ebooks alone in the first eight months of its release. It’s a great deal for them, especially since they likely have the ability to get out of it down the road without paying two-thirds of it if they wish.</p><p>NB: The mainstream publishers now pay book advances in thirds. One-third on signature, one-third on delivery, and one third on either acceptance or publication. So, the contract is most likely $1 million up front, with two payments of $75k for each book upon a) delivery, and b) acceptance or publication.</p><p>This isn’t a bad deal for Scalzi, it is merely a very <i>conservative </i>deal. What Johnny Con is attempting to do is to secure his retirement and look for any upside to come out of the various media deals he’s got going. It’s a perfectly reasonable strategy, particularly in these uncertain economic times. The bolder strategy would have been for him to go into self-publishing, where as I’ve demonstrated, <a href=\"http://www.milobookclub.com/2013/03/11/how-not-to-be-sfwa-president-ii/\">there is considerably more upside</a> to be had. But Scalzi is neither a self-confident man nor an entrepreneur, so it is entirely in character that he’d prefer to give up the equivalent of about five birds in the bush in favor of the one in Tor’s hand.</p><p>There is absolutely nothing wrong with that. And since he has a reasonable shot at other upsides, I think it’s an entirely sensible deal on his part. Lock in the base, then see what you can leverage elsewhere. It’s a conservative move, but not one that I would criticize him for making. Everyone has different appetites for risk. Indeed, as I have often said, McRapey has an unusual talent for self-promotion. The fact that a mediocre and derivative hack without any discernible talent beyond self-promotion and petty snark could turn 300k monthly pageviews and a color-by-numbers Heinlein ripoff into a near-guaranteed $250k per year is borderline astonishing. If he’d somehow managed to do it without repeatedly lying his ample ass off and consistently misrepresenting himself, I’d consider him to be downright brilliant.</p><p>What is much more important is what the deal indicates for science fiction publishing, and that is where I see problems on the horizon. If one of the best-known authors in science fiction can only command $260k per book from the biggest science fiction publisher, then conventional publishing does not appear to be long for this world. Which is, in fact, exactly what I believe to be the case.</p><p>Of course, I was genuinely amused to see McRapey omit making any traffic claims for the blog that made him “an online celebrity”. I wonder why he doesn’t brag about those two million monthly pageviews or 50 THOUSAND DAILY VISITS to reporters anymore?</p></div>",
  "content_text": "I thought\nJohn Scalzi’s new book deal\nto lock in his retirement was an interesting indication of his intrinsic insecurity as well as the practicality that distinguishes him from most of his SF colleagues.\nJohn Scalzi, a best-selling author of science fiction, has signed a $3.4 million, 10-year deal with the publisher Tor Books that will cover his next 13 books.\nMr. Scalzi’s works include a series known as the “Old Man’s War” and the more recent “Redshirts,” a Hugo-award-winning sendup of the luckless lives of nonfeatured characters on shows like the original “Star Trek.” Three of his works are being developed for television, including “Redshirts” and “Lock In,” a science-inflected medical thriller that evokes Michael Crichton. Mr. Scalzi’s hyper-caffeinated Internet presence through his blog, Whatever, has made him an online celebrity as well.\nMr. Scalzi approached Tor Books, his longtime publisher, with proposals for 10 adult novels and three young adult novels over 10 years. Some of the books will extend the popular “Old Man’s War” series, building on an existing audience, and one will be a sequel to “Lock In.” Mr. Scalzi said he hoped books like “Lock In” could draw more readers toward science fiction, since many, he said, are still “gun-shy” about the genre.\nPatrick Nielsen Hayden, the executive editor for Tor, said the decision was an easy one.\nI imagine it was a very easy one. Scalzi is, nominally, Tor’s big dog. He’s not a proper big dog, as he isn’t one of their ten annual biggest sellers or even a bestselling author, but he’s their most important SF figurehead author. Who else do they have? Of their better-selling authors, Frank Herbert is dead, Robert Jordan is dead, Orson Scott Card is hated by their core audience, and they can’t control Microsoft or the game companies whose tie-in novels are their biggest sellers. They have Scalzi and Brandon Sanderson, both of whom appear to have more or less peaked in terms of their careers. It’s not as if the award-winning Jo Walton or the award-winning Catharine Asaro or any of their other award-winning authors sell enough books to support all the SJW non-SF they keep trying to push on an unwilling public.\nSo to be gifted the opportunity to lock in one of their top authors for a decade at little more than 250k per book at an initial cost of $1 million up front is an absolute no-brainer. Scalzi is a hack in the positive sense of the term; unless he’s dead there is no chance he’s not going to be able to churn out the sort of mediocre material he produces. To break even on the initial advance, (the payments are usually divided into signing, delivery, and acceptance these days), Tor only has to sell an average of about 15k books each. Assuming all 13 books are delivered and paid for, they have to sell around 40k copies apiece, which should be doable considering that Redshirts sold nearly that many ebooks alone in the first eight months of its release. It’s a great deal for them, especially since they likely have the ability to get out of it down the road without paying two-thirds of it if they wish.\nNB: The mainstream publishers now pay book advances in thirds. One-third on signature, one-third on delivery, and one third on either acceptance or publication. So, the contract is most likely $1 million up front, with two payments of $75k for each book upon a) delivery, and b) acceptance or publication.\nThis isn’t a bad deal for Scalzi, it is merely a very\nconservative\ndeal. What Johnny Con is attempting to do is to secure his retirement and look for any upside to come out of the various media deals he’s got going. It’s a perfectly reasonable strategy, particularly in these uncertain economic times. The bolder strategy would have been for him to go into self-publishing, where as I’ve demonstrated,\nthere is considerably more upside\nto be had. But Scalzi is neither a self-confident man nor an entrepreneur, so it is entirely in character that he’d prefer to give up the equivalent of about five birds in the bush in favor of the one in Tor’s hand.\nThere is absolutely nothing wrong with that. And since he has a reasonable shot at other upsides, I think it’s an entirely sensible deal on his part. Lock in the base, then see what you can leverage elsewhere. It’s a conservative move, but not one that I would criticize him for making. Everyone has different appetites for risk. Indeed, as I have often said, McRapey has an unusual talent for self-promotion. The fact that a mediocre and derivative hack without any discernible talent beyond self-promotion and petty snark could turn 300k monthly pageviews and a color-by-numbers Heinlein ripoff into a near-guaranteed $250k per year is borderline astonishing. If he’d somehow managed to do it without repeatedly lying his ample ass off and consistently misrepresenting himself, I’d consider him to be downright brilliant.\nWhat is much more important is what the deal indicates for science fiction publishing, and that is where I see problems on the horizon. If one of the best-known authors in science fiction can only command $260k per book from the biggest science fiction publisher, then conventional publishing does not appear to be long for this world. Which is, in fact, exactly what I believe to be the case.\nOf course, I was genuinely amused to see McRapey omit making any traffic claims for the blog that made him “an online celebrity”. I wonder why he doesn’t brag about those two million monthly pageviews or 50 THOUSAND DAILY VISITS to reporters anymore?",
  "tags": [
    "books",
    "McRapey"
  ],
  "categories": [],
  "sitemap_lastmod": "2015-05-25T11:00:00+00:00"
}