{
  "url": "https://voxday.net/2015/05/20/men-dont-matter-to-sjws/",
  "scraped_at": "2025-12-16T12:56:26.667284",
  "title": "Men don’t matter to SJWs",
  "date_display": "May 20, 2015",
  "date_iso": "2015-05-20T12:00:00+00:00",
  "date_from_url": "2015-05-20",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>Nero observes <a href=\"http://www.breitbart.com/london/2015/05/19/game-of-thrones-is-relentlessly-sexist-but-not-against-women/\">the uneven and sexist reaction</a> to acts of violence in A GAME OF THRONES:</p><blockquote class=\"tr_bq\"><p>     D&amp;D are trash bags go back to the sewerage where you belong<br>     — ziggy (@foxfeuer) May 18, 2015</br></p><p>    D&amp;D are so gross I hope they burn in hell.<br>     — stevebucky asun (@mybaabyblue) May 18, 2015</br></p><p>    I AM FUCKING FURIOUS I WANT D&amp;D TO DIE THOSE PIECES OF SHIT<br>     — JUSTICE FOR SANSA (@sansaslady) May 18, 2015</br></p><p>“D&amp;D” refers to the show’s creators, Daniel Benioff and Daniel Weiss.</p><p>If any other group were caught making tweets like this, they would probably be labelled a hate group. But that can’t happen to feminists, so publications like Vox instead blamed the show’s creators for “provoking the ire of the internet”. It’s hardly surprising, of course. These are the same people who had nothing to say about #killallmen.</p><p>This isn’t the first time that violence against female characters in Game of Thrones has attracted attention. The first was over the graphic murder of a prostitute by the sadistic King Joffrey. Then people were upset when Robb Stark’s pregnant wife was stabbed in the belly. Robb himself was impaled with a sword before his corpse was decapitated and paraded around with a wolf’s head stuck on his neck, but no one minded so much about that.</p><p>But the latest outrage has surpassed all the others, with odious, risible “geek feminist” blog The Mary Sue announcing that they would no longer promote the series.</p><p>    Here’s our new policy re: @GameOfThrones. http://t.co/OkqrSawZaI #GameOfThrones</p><p>    — The Mary Sue (@TheMarySue) May 19, 2015</p><p>If these aggrieved Tumblrinas took a minute to think, they might figure out why violence against female characters seems so shocking: it’s because on-screen violence against men is so common that it doesn’t surprise us, and that in turn makes on-screen violence against women stand out.</p></blockquote><p>It’s no different in games. Remember all the protests against GTA because you COULD kill prostitutes in a game where you MUST kill copious men in a broad variety of ways just in order to play. Meanwhile, an SJW-approved version of A GAME OF THRONES <a href=\"http://stopgamergate.com/post/119331314885/social-justice-approved-game-of-thrones\">is suggested</a>:</p><blockquote class=\"tr_bq\"><p> Daenerys Targaryean withdraws from marrying Khal Drogo after realizing she’s a strong independent Khaleesi that don’t need no Dothraki. Daenrys still takes the dragon eggs that were a wedding gift. As she never burns though the eggs never hatch.</p><p>Sansa cuts her long red hair short and dyes it rainbow colours. Starts a social media raven campaign for the awareness of how tough the daughters of Lords have it. Spends the rest of her time telling peasant boys to check their privilege.</p></blockquote><p>I’ve previously pointed out how the basic story of A GAME OF THRONES isn’t even possible if the author had been properly feminist, and how a single change to a single character in <i>A Song of Ice and Fire</i><br> would have eviscerated the entire series and eliminated the<br> greater part of its plot.  Consider the consequences of changing Cersei<br> Lannister from an oppressed woman used as a dynastic piece by her father<br> to a strong and independent warrior woman of the sort that is presently<br> ubiquitous in third-generation fantasy, science fiction, and paranormal<br> fiction.</br></br></br></br></br></br></p><ol><li>Cersei doesn’t marry Robert Baratheon.  She’s strong and independent like her twin, not a royal brood mare!</li><li>House Lannister’s ambitions are reduced from establishing a royal line to finding a wife for Tyrion.</li><li>Cersei’s children are not bastards.  Robert’s heirs have black hair.</li><li>Jon Arryn isn’t murdered to keep a nonexistent secret.  Ned Stark isn’t named to replace him.</li><li>Robert doesn’t have a hunting accident arranged by the Lannisters, who don’t dominate the court and will not benefit from his fall.</li><li>Robert’s heirs being legitimate, Stannis and Renly Baratheon remain loyal.</li><li>The Starks never come south and never revolt against King’s<br> Landing.  Theon Greyjoy goes home to the Ironborn and never returns to<br> Winterfell.  Jon Snow still goes to the Wall, but Arya remains home and<br> learns to become a lady, not an assassin, whether she wants to or not.</br></br></br></li></ol><p>So, what was a war of five kings that spans five continents abruptly<br> becomes a minor debate over whether Robert Baratheon’s black-haired son<br> and heir marries Sansa Stark, a princess of Dorne, or Danerys<br> Targaryen.</br></br></br></p></div>",
  "content_text": "Nero observes\nthe uneven and sexist reaction\nto acts of violence in A GAME OF THRONES:\nD&D are trash bags go back to the sewerage where you belong\n— ziggy (@foxfeuer) May 18, 2015\nD&D are so gross I hope they burn in hell.\n— stevebucky asun (@mybaabyblue) May 18, 2015\nI AM FUCKING FURIOUS I WANT D&D TO DIE THOSE PIECES OF SHIT\n— JUSTICE FOR SANSA (@sansaslady) May 18, 2015\n“D&D” refers to the show’s creators, Daniel Benioff and Daniel Weiss.\nIf any other group were caught making tweets like this, they would probably be labelled a hate group. But that can’t happen to feminists, so publications like Vox instead blamed the show’s creators for “provoking the ire of the internet”. It’s hardly surprising, of course. These are the same people who had nothing to say about #killallmen.\nThis isn’t the first time that violence against female characters in Game of Thrones has attracted attention. The first was over the graphic murder of a prostitute by the sadistic King Joffrey. Then people were upset when Robb Stark’s pregnant wife was stabbed in the belly. Robb himself was impaled with a sword before his corpse was decapitated and paraded around with a wolf’s head stuck on his neck, but no one minded so much about that.\nBut the latest outrage has surpassed all the others, with odious, risible “geek feminist” blog The Mary Sue announcing that they would no longer promote the series.\nHere’s our new policy re: @GameOfThrones. http://t.co/OkqrSawZaI #GameOfThrones\n— The Mary Sue (@TheMarySue) May 19, 2015\nIf these aggrieved Tumblrinas took a minute to think, they might figure out why violence against female characters seems so shocking: it’s because on-screen violence against men is so common that it doesn’t surprise us, and that in turn makes on-screen violence against women stand out.\nIt’s no different in games. Remember all the protests against GTA because you COULD kill prostitutes in a game where you MUST kill copious men in a broad variety of ways just in order to play. Meanwhile, an SJW-approved version of A GAME OF THRONES\nis suggested\n:\nDaenerys Targaryean withdraws from marrying Khal Drogo after realizing she’s a strong independent Khaleesi that don’t need no Dothraki. Daenrys still takes the dragon eggs that were a wedding gift. As she never burns though the eggs never hatch.\nSansa cuts her long red hair short and dyes it rainbow colours. Starts a social media raven campaign for the awareness of how tough the daughters of Lords have it. Spends the rest of her time telling peasant boys to check their privilege.\nI’ve previously pointed out how the basic story of A GAME OF THRONES isn’t even possible if the author had been properly feminist, and how a single change to a single character in\nA Song of Ice and Fire\nwould have eviscerated the entire series and eliminated the\ngreater part of its plot.  Consider the consequences of changing Cersei\nLannister from an oppressed woman used as a dynastic piece by her father\nto a strong and independent warrior woman of the sort that is presently\nubiquitous in third-generation fantasy, science fiction, and paranormal\nfiction.\nCersei doesn’t marry Robert Baratheon.  She’s strong and independent like her twin, not a royal brood mare!\nHouse Lannister’s ambitions are reduced from establishing a royal line to finding a wife for Tyrion.\nCersei’s children are not bastards.  Robert’s heirs have black hair.\nJon Arryn isn’t murdered to keep a nonexistent secret.  Ned Stark isn’t named to replace him.\nRobert doesn’t have a hunting accident arranged by the Lannisters, who don’t dominate the court and will not benefit from his fall.\nRobert’s heirs being legitimate, Stannis and Renly Baratheon remain loyal.\nThe Starks never come south and never revolt against King’s\nLanding.  Theon Greyjoy goes home to the Ironborn and never returns to\nWinterfell.  Jon Snow still goes to the Wall, but Arya remains home and\nlearns to become a lady, not an assassin, whether she wants to or not.\nSo, what was a war of five kings that spans five continents abruptly\nbecomes a minor debate over whether Robert Baratheon’s black-haired son\nand heir marries Sansa Stark, a princess of Dorne, or Danerys\nTargaryen.",
  "tags": [
    "media",
    "SJW"
  ],
  "categories": [],
  "sitemap_lastmod": "2015-05-20T11:00:00+00:00"
}