{
  "url": "https://voxday.net/2015/05/11/mras-against-marital-rape/",
  "scraped_at": "2025-12-16T12:55:21.024030",
  "title": "MRAs against marital rape",
  "date_display": "May 11, 2015",
  "date_iso": "2015-05-11T16:00:00+00:00",
  "date_from_url": "2015-05-11",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>David King writes <a href=\"http://www.avoiceformen.com/sexual-politics/marital-rape-why-it-is-a-thing/\">an embarrassingly bad article</a> in an attempt to bring the men’s rights position on marital rape in line with the feminist one.</p><blockquote class=\"tr_bq\"><p> The core thesis of <a href=\"http://www.avoiceformen.com/mens-rights/marital-rape-a-feminist-tool-to-criminalize-marriage-in-india/\">Talukdar’s article</a> is that the notion of marital rape is a contradiction in terms on the ground that marriage is irrevocable, explicit and on-going consent to sex. I disagree and, further, I think that this position is incompatible with the values and moral basis of the Men’s Human Rights Movement….</p><p>Since frequently arguments of this nature revolve around the meanings of<br> words I will spell out what I understand these core concepts to be and<br> the meaning with which I use these core words, just like a contract<br> would.</br></br></br></p></blockquote><p>And there is the first sign that he’s going to get it completely wrong. He’s presenting a legal argument on the basis of what HE understands the core concepts to be and HIS definition of the core words. At this point, we already know he’s going to get it wrong, the only question is how.</p><blockquote class=\"tr_bq\"><p> Western definitions of marriage include provisions for alimony and division of marital assets after divorce, but I’m not aware that there is (now) any explicit obligation to provide for maintenance during marriage (the assumption being that, in cohabitation and in providing for himself, he provides for his wife also).</p></blockquote><p>He already blew it. He’s ignoring the fact that a husband is legally obligated for his wife’s debts, legally obligated to pay support for her children, and more importantly, the fact that the obligation precedes the very existence of the written law.</p><p>“The husband’s duty to support his wife (and, under later common law decisions, his children also), and the wife’s duty to render services to her husband (and a less clearly defined duty to render services to her children), are two of the most ancient concepts of the common law.”<br> – <a href=\"https://ecf.cand.uscourts.gov/cand/09cv2292/evidence/PX1328.pdf\">Virginia Law Review</a>, 1943</br></p><p>There is actually  LESS question concerning a man’s duty to provide for maintence during marriage than there is concerning a wife’s duty to provide for her children.</p><blockquote class=\"tr_bq\"><p> So, we have an explicit law that criminalises rape and, to my knowledge (though I am no legal scholar), there is no explicit legal obligation, by either spouse, to submit to sexual intercourse — at least, not in any western jurisdiction I know of. Whether there is such an explicit provision in Indian law, I cannot say. On the face of it, therefore, the law requires that, even within marriage, sex requires consent from both spouses or it is a crime.</p></blockquote><p> This is ridiculous, because without consummation, the marriage isn’t even completed. The focus on “explicit legal obligation” indicates the problem, David King thinks that the law is limited to “black letter law”, which is simply not the case. Both the common law and case law are not only relevant, in most cases they trump black letter law, which is the reason the various courts are able to throw out black letter law and declare it to be invalid.</p><blockquote class=\"tr_bq\"><p> It should be noted that <i>Historia Placitorum Coronæ</i> (the original<br> title of Hale’s treatise) is a chronicle, a contemporary description of<br> facts and events as they were understood at the time; such works were<br> and are not law and have no judicial authority (then or now), and can be<br> nothing more than of historical interest.</br></br></br></br></p><p>It should also be noted that <i>Historia </i>was written in 1736, and that both the law and social mores change over time. Once, slavery was lawful and only landed people (which included women, by the way) had the right to vote. If defences of such law offered before slavery was abolished have no moral relevance in the 21st Century, then Hale’s nearly 280-year-old interpretation of marital consent is of questionable relevance today.</p></blockquote><p>First, King fails to grasp that the intrepretation is not Hale’s. He is merely repeating the “the position of the common law, which is that a husband cannot be guilty of the rape of his wife because<br> the wife “hath given up herself in this kind to her husband, which she<br> cannot retract”” What King is ignoring is that this is not only settled law, it has been settled law for considerably more than three centuries.</br></br></p><p>The depths of absurdity to which the denial of marital consent takes King is finally revealed towards the end of his article, where he inadvertently reveals that denying marital consent is tantamount to denying marriage altogether.</p><blockquote class=\"tr_bq\"><p> There’s something to that, insofaras Talukdar quite reasonably questions what rights the man has in return for the obligation to support and maintain his wife. But, the point could equally be used to argue for abolition of the man’s obligation to maintain his wife as much as to argue that his wife owes him sex in exchange for that obligation.</p></blockquote><p> In other words, marriage neither grants a right of support to the wife nor a right of services to the husband. Which, one can only wonder, raises the obvious question of why any man or any woman would get married in the first place, if they literally get nothing out of it?</p><p>The fact of the matter is perfectly plain. Marriage grants sexual consent, which is precisely why nearly 100 percent of all couples regularly have sex without either party ever granting verbal or written consent to the other. In his desire to play the legal white knight, David King has managed to transform what he claims are the “values and moral basis” of men’s rights into something all but indistinguishable from the Neo-Dworkinian position that all sex is rape.</p><p>This is one of the many reasons I am not a Men’s Rights Activist. With friends like these, enemies are superfluous.</p></div>",
  "content_text": "David King writes\nan embarrassingly bad article\nin an attempt to bring the men’s rights position on marital rape in line with the feminist one.\nThe core thesis of\nTalukdar’s article\nis that the notion of marital rape is a contradiction in terms on the ground that marriage is irrevocable, explicit and on-going consent to sex. I disagree and, further, I think that this position is incompatible with the values and moral basis of the Men’s Human Rights Movement….\nSince frequently arguments of this nature revolve around the meanings of\nwords I will spell out what I understand these core concepts to be and\nthe meaning with which I use these core words, just like a contract\nwould.\nAnd there is the first sign that he’s going to get it completely wrong. He’s presenting a legal argument on the basis of what HE understands the core concepts to be and HIS definition of the core words. At this point, we already know he’s going to get it wrong, the only question is how.\nWestern definitions of marriage include provisions for alimony and division of marital assets after divorce, but I’m not aware that there is (now) any explicit obligation to provide for maintenance during marriage (the assumption being that, in cohabitation and in providing for himself, he provides for his wife also).\nHe already blew it. He’s ignoring the fact that a husband is legally obligated for his wife’s debts, legally obligated to pay support for her children, and more importantly, the fact that the obligation precedes the very existence of the written law.\n“The husband’s duty to support his wife (and, under later common law decisions, his children also), and the wife’s duty to render services to her husband (and a less clearly defined duty to render services to her children), are two of the most ancient concepts of the common law.”\n–\nVirginia Law Review\n, 1943\nThere is actually  LESS question concerning a man’s duty to provide for maintence during marriage than there is concerning a wife’s duty to provide for her children.\nSo, we have an explicit law that criminalises rape and, to my knowledge (though I am no legal scholar), there is no explicit legal obligation, by either spouse, to submit to sexual intercourse — at least, not in any western jurisdiction I know of. Whether there is such an explicit provision in Indian law, I cannot say. On the face of it, therefore, the law requires that, even within marriage, sex requires consent from both spouses or it is a crime.\nThis is ridiculous, because without consummation, the marriage isn’t even completed. The focus on “explicit legal obligation” indicates the problem, David King thinks that the law is limited to “black letter law”, which is simply not the case. Both the common law and case law are not only relevant, in most cases they trump black letter law, which is the reason the various courts are able to throw out black letter law and declare it to be invalid.\nIt should be noted that\nHistoria Placitorum Coronæ\n(the original\ntitle of Hale’s treatise) is a chronicle, a contemporary description of\nfacts and events as they were understood at the time; such works were\nand are not law and have no judicial authority (then or now), and can be\nnothing more than of historical interest.\nIt should also be noted that\nHistoria\nwas written in 1736, and that both the law and social mores change over time. Once, slavery was lawful and only landed people (which included women, by the way) had the right to vote. If defences of such law offered before slavery was abolished have no moral relevance in the 21st Century, then Hale’s nearly 280-year-old interpretation of marital consent is of questionable relevance today.\nFirst, King fails to grasp that the intrepretation is not Hale’s. He is merely repeating the “the position of the common law, which is that a husband cannot be guilty of the rape of his wife because\nthe wife “hath given up herself in this kind to her husband, which she\ncannot retract”” What King is ignoring is that this is not only settled law, it has been settled law for considerably more than three centuries.\nThe depths of absurdity to which the denial of marital consent takes King is finally revealed towards the end of his article, where he inadvertently reveals that denying marital consent is tantamount to denying marriage altogether.\nThere’s something to that, insofaras Talukdar quite reasonably questions what rights the man has in return for the obligation to support and maintain his wife. But, the point could equally be used to argue for abolition of the man’s obligation to maintain his wife as much as to argue that his wife owes him sex in exchange for that obligation.\nIn other words, marriage neither grants a right of support to the wife nor a right of services to the husband. Which, one can only wonder, raises the obvious question of why any man or any woman would get married in the first place, if they literally get nothing out of it?\nThe fact of the matter is perfectly plain. Marriage grants sexual consent, which is precisely why nearly 100 percent of all couples regularly have sex without either party ever granting verbal or written consent to the other. In his desire to play the legal white knight, David King has managed to transform what he claims are the “values and moral basis” of men’s rights into something all but indistinguishable from the Neo-Dworkinian position that all sex is rape.\nThis is one of the many reasons I am not a Men’s Rights Activist. With friends like these, enemies are superfluous.",
  "tags": [
    "law",
    "trainwreck"
  ],
  "categories": [],
  "sitemap_lastmod": "2015-05-11T15:00:00+00:00"
}