{
  "url": "https://voxday.net/2015/05/28/neocons-attack-paul-seque/",
  "scraped_at": "2025-12-16T12:57:27.288855",
  "title": "Neocons attack Paul, the sequel",
  "date_display": "May 28, 2015",
  "date_iso": "2015-05-28T20:30:00+00:00",
  "date_from_url": "2015-05-28",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>Now the people who brought you failure in Afghanistan, failure in Iraq, a puppet government in Ukraine and the Islamic State are gunning for Rand Paul because he is willing to tell the truth about them and the foreign policy failures of the last Republican president. Roger Simon is running around claiming that Paul has <a href=\"http://pjmedia.com/diaryofamadvoter/2015/05/28/rand-reveals-his-true-colors-and-destroys-himself/?singlepage=true\">“shown his true colors” and “destroyed himself”</a>:</p><blockquote class=\"tr_bq\"><p> Alas Rand (I had higher hopes for him), like father Ron, has a mega-chauvanistic view of the world.  The USA is so big and strong it causes everything, including, at one point, 9-11, and now ISIS, if you can believe that. Never mind that the Islamic State is just another avatar of Islamic imperialism’s desire for a world caliphate that has been going on for centuries, long before our country was in existence — the Battle of Tours (732), the Siege of Vienna (1683) and on and on. The violence has been there forever, too.  As any literate person knows, it’s in the Koran and the Hadith.  Beheadings were part of Mohammed’s game plan. It’s what he did and what he called for. This was not invented by a cabal of neocons in Chevy Chase, Maryland, in 2003.</p><p>And of course ISIS is part of a straight line that goes from the Muslim Brotherhood (founded in Egypt in 1928, long before the current crop of Republicans were even alive) to Al Qaeda via Zawahiri and on into the modern age with ISIS, all working from the same ideological playbook, as are Boko Haram, Hamas, al Shabab, al Nusra, etc., etc.</p><p>Rand, again like father Ron, is essentially racist in blaming this on America and not recognizing other cultures have belief systems to which they truly adhere and that those belief systems may be dangerous, even evil.  America did not evolve Islamist ideology anymore than it did Nazism, but the Islamists have the potential to wreak just as much havoc if they are not stopped.</p></blockquote><p> And what did Paul actually say?</p><blockquote class=\"tr_bq\"><p> The freshman senator from Kentucky said Wednesday that the GOP’s foreign policy hawks “created these people.” . . .  “ISIS exists and grew stronger because of the hawks in our party who gave arms indiscriminately,” Paul said on MSNBC’s “Morning Joe.” He continued: “They created these people. ISIS is all over Libya because these same hawks in my party loved – they loved Hillary Clinton’s war in Libya. They just wanted more of it.”</p></blockquote><p>That’s <a href=\"http://www.globalresearch.ca/america-created-al-qaeda-and-the-isis-terror-group/5402881\">absolutely true</a>. Simon and the other neocons can sing and dance all they like, but the fact is that the US invasion and occupation of Iraq created ISIS. Military experts like William S. Lind even predicted it back in 2003:</p><blockquote class=\"tr_bq\"><p> The current phase of the war in Iraq is driven by three different<br> elements: chaos, a war of national liberation (which is inflicting most<br> of the casualties) and 4th Generation War. In time, the 4th Generation<br> elements will come to predominate, as they fill the vacuum created by<br> the destruction of the Iraqi state.</br></br></br></br></p></blockquote><p>He then pointed out how it would proceed in  2004:</p><blockquote class=\"tr_bq\"><p> An article in the Friday, March 29 Washington Post pointed to the long-expected opening of Phase III of America’s war with Iraq. Phase I was the jousting contest, the formal “war” between America’s and Iraq’s armies that ended with the fall of Baghdad. Phase II was the War of National Liberation waged by the Baath Party and fought guerilla-style. Phase III, which is likely to prove the decisive phase, is true Fourth Generation war, war waged by a wide variety of non-state Iraqi and other Islamic forces for objectives and motives that reach far beyond politics.</p><p>    The Post article, “Iraq Attacks Blamed on Islamic Extremists,” contains the following revealing paragraph:</p><p><i>    In the intelligence operations room at the 1st Armored Division’s headquarters (in Baghdad), wall-mounted charts identifying and linking insurgents depict the changing battlefield. Last fall the organizational chart of Baathist fighters and leaders stretched for 10 feet, while charts listing known Islamic radicals took up a few pieces of paper. Now, the chart of Iraqi religious extremists dominates the room, while the poster depicting Baathist activity has shrunk to half of its previous size.</i></p><p>The article goes on to quote a U.S. intelligence officer as adding, “There is no single organization that’s behind all this. It’s far more decentralized than that.”</p><p>Welcome to Phase III. The remaining Ba’athists will of course continue their War of National Liberation, and Fourth Generation elements have been active from the outset. But the situation map in the 1st Armored Division’s headquarters reveals the “tipping point”: Fourth Generation war is now the dominant form of war against the Americans in Iraq.</p></blockquote><p>The neocons are desperate to avoid responsibility for their failures because they want to keep doing the same stupid shit that caused the current problems. Far from destroying himself, Paul is telling Americans what is necessary just to <i>begin</i> saving what is left of their nation. Ron Paul was right back in 2001. Rand Paul is right now.</p></div>",
  "content_text": "Now the people who brought you failure in Afghanistan, failure in Iraq, a puppet government in Ukraine and the Islamic State are gunning for Rand Paul because he is willing to tell the truth about them and the foreign policy failures of the last Republican president. Roger Simon is running around claiming that Paul has\n“shown his true colors” and “destroyed himself”\n:\nAlas Rand (I had higher hopes for him), like father Ron, has a mega-chauvanistic view of the world.  The USA is so big and strong it causes everything, including, at one point, 9-11, and now ISIS, if you can believe that. Never mind that the Islamic State is just another avatar of Islamic imperialism’s desire for a world caliphate that has been going on for centuries, long before our country was in existence — the Battle of Tours (732), the Siege of Vienna (1683) and on and on. The violence has been there forever, too.  As any literate person knows, it’s in the Koran and the Hadith.  Beheadings were part of Mohammed’s game plan. It’s what he did and what he called for. This was not invented by a cabal of neocons in Chevy Chase, Maryland, in 2003.\nAnd of course ISIS is part of a straight line that goes from the Muslim Brotherhood (founded in Egypt in 1928, long before the current crop of Republicans were even alive) to Al Qaeda via Zawahiri and on into the modern age with ISIS, all working from the same ideological playbook, as are Boko Haram, Hamas, al Shabab, al Nusra, etc., etc.\nRand, again like father Ron, is essentially racist in blaming this on America and not recognizing other cultures have belief systems to which they truly adhere and that those belief systems may be dangerous, even evil.  America did not evolve Islamist ideology anymore than it did Nazism, but the Islamists have the potential to wreak just as much havoc if they are not stopped.\nAnd what did Paul actually say?\nThe freshman senator from Kentucky said Wednesday that the GOP’s foreign policy hawks “created these people.” . . .  “ISIS exists and grew stronger because of the hawks in our party who gave arms indiscriminately,” Paul said on MSNBC’s “Morning Joe.” He continued: “They created these people. ISIS is all over Libya because these same hawks in my party loved – they loved Hillary Clinton’s war in Libya. They just wanted more of it.”\nThat’s\nabsolutely true\n. Simon and the other neocons can sing and dance all they like, but the fact is that the US invasion and occupation of Iraq created ISIS. Military experts like William S. Lind even predicted it back in 2003:\nThe current phase of the war in Iraq is driven by three different\nelements: chaos, a war of national liberation (which is inflicting most\nof the casualties) and 4th Generation War. In time, the 4th Generation\nelements will come to predominate, as they fill the vacuum created by\nthe destruction of the Iraqi state.\nHe then pointed out how it would proceed in  2004:\nAn article in the Friday, March 29 Washington Post pointed to the long-expected opening of Phase III of America’s war with Iraq. Phase I was the jousting contest, the formal “war” between America’s and Iraq’s armies that ended with the fall of Baghdad. Phase II was the War of National Liberation waged by the Baath Party and fought guerilla-style. Phase III, which is likely to prove the decisive phase, is true Fourth Generation war, war waged by a wide variety of non-state Iraqi and other Islamic forces for objectives and motives that reach far beyond politics.\nThe Post article, “Iraq Attacks Blamed on Islamic Extremists,” contains the following revealing paragraph:\nIn the intelligence operations room at the 1st Armored Division’s headquarters (in Baghdad), wall-mounted charts identifying and linking insurgents depict the changing battlefield. Last fall the organizational chart of Baathist fighters and leaders stretched for 10 feet, while charts listing known Islamic radicals took up a few pieces of paper. Now, the chart of Iraqi religious extremists dominates the room, while the poster depicting Baathist activity has shrunk to half of its previous size.\nThe article goes on to quote a U.S. intelligence officer as adding, “There is no single organization that’s behind all this. It’s far more decentralized than that.”\nWelcome to Phase III. The remaining Ba’athists will of course continue their War of National Liberation, and Fourth Generation elements have been active from the outset. But the situation map in the 1st Armored Division’s headquarters reveals the “tipping point”: Fourth Generation war is now the dominant form of war against the Americans in Iraq.\nThe neocons are desperate to avoid responsibility for their failures because they want to keep doing the same stupid shit that caused the current problems. Far from destroying himself, Paul is telling Americans what is necessary just to\nbegin\nsaving what is left of their nation. Ron Paul was right back in 2001. Rand Paul is right now.",
  "tags": [
    "trainwreck",
    "war"
  ],
  "categories": [],
  "sitemap_lastmod": "2015-05-28T19:30:00+00:00"
}