{
  "url": "https://voxday.net/2015/05/04/never-retreat-never-apologize/",
  "scraped_at": "2025-12-16T12:54:35.352130",
  "title": "Never retreat, never apologize",
  "date_display": "May 4, 2015",
  "date_iso": "2015-05-04T17:03:00+00:00",
  "date_from_url": "2015-05-04",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><blockquote class=\"tr_bq\"><p> Brad Torgersen<br> Correia also likes women. We’re not sure about Scalzi on that count. If you know what I mean.</br></p><p>John Scalzi ‏@scalzi<br> Brad Torgersen attempts to insult me by implying I’m gay; I respond. He attempts an apology; I respond to that too.</br></p></blockquote><p>Does no one listen or learn? Never, EVER apologize to SJWs! Case in point: <i>“The apology was worse than the ini­tial attempted slur — it rein­forced<br> the fact that Torg­ersen thinks calling someone gay is a slur.”</br></i></p><p>I repeat. NEVER APOLOGIZE TO SJWs. They will see it as fear, take the apology, and use it as a club with which to beat you. Never back down to them, never retreat, never apologize.Notice that this was all posted AFTER Torgersen apologized to Scalzi.</p><p>    Hur hur, homophobia’s a gas when you’re a Sad Puppy!<br>     — John Scalzi (@scalzi) May 4, 2015</br></p><p>    Again: I’m mostly sad for the Sad Puppies. So much insecurity and envy and anger and need. For their own sakes, I wish they were happy.<br>     — John Scalzi (@scalzi) May 4, 2015</br></p><p>    Note that my pity for the Sad Puppies doesn’t preclude me pointing out they are assholes. And that they’ve made the active choice to be so.<br>     — John Scalzi (@scalzi) May 4, 2015</br></p><p>    Also, if I DID like men more than women, so what? That would be a perfectly good thing, nor would I be the slightest bit ashamed of it.<br>     — John Scalzi (@scalzi) May 4, 2015</br></p><p>    If Brad Torgersen wants to insult me, insinuating I’m gay won’t work. It’s not an insult to be gay. Be an insult to be a Sad Puppy, however.<br>     — John Scalzi (@scalzi) May 4, 2015</br></p><p>If it’s not an insult to be gay, then why is McRapey acting as if it is an insult? And how has Brad Torgersen damaged his potentially promising career by not insulting someone?</p><blockquote class=\"tr_bq\"><p> mintwitch ‏@mintwitch<br> Brad is just… so sad. He’s completely lost his grip, and unfortunately probably damaged a potentially promising career.</br></p><p>John Scalzi ‏@scalzi<br> If he has, I suspect he will attribute it to his politics rather than his personal behavior.</br></p></blockquote><p>So, just a single insult of the wrong individual is sufficient to damage a promising career. That’s fascinating, in light of how we have been repeatedly assured that there isn’t any cabal or conspiracy or collection of people who will attempt to torpedo your career in science fiction over mere differences of opinion. After all, was it not Orson Scott Card’s <i>personal behavior</i> to which the SJWs objected when they attacked the Ender’s Game movie?</p><p>Was it not my <i>personal behavior</i> to which they objected when they attacked me on the basis of a syndicated op/ed column?</p><p>In the meantime, AN EDUCATIONAL DIALOGUE from the Evil Legion of Evil:</p><blockquote class=\"tr_bq\"><p> John Scalzi: “I’d rather like men than to be a Sad Puppy.”</p><p>Minion 189: “What do you mean when you say ‘like men’? Do you mean in the manner of owing someone a big favor in the Ground Forces?</p><p>John Scalzi: “Um, yeah.”</p><p>Big Gay Steve: “This can be arranged. I know a guy.”</p><p>John Scalzi: “SQUEEEE!”</p><p>The End</p></blockquote><p>I don’t know about you, but I find it somewhat surprising that McRapey would publicly express a preference for being sodomized to seeing the likes of Jim Butcher or John C. Wright win a Hugo Award. It’s not exactly what you’d call a binary option.</p></div>",
  "content_text": "Brad Torgersen\nCorreia also likes women. We’re not sure about Scalzi on that count. If you know what I mean.\nJohn Scalzi ‏@scalzi\nBrad Torgersen attempts to insult me by implying I’m gay; I respond. He attempts an apology; I respond to that too.\nDoes no one listen or learn? Never, EVER apologize to SJWs! Case in point:\n“The apology was worse than the ini­tial attempted slur — it rein­forced\nthe fact that Torg­ersen thinks calling someone gay is a slur.”\nI repeat. NEVER APOLOGIZE TO SJWs. They will see it as fear, take the apology, and use it as a club with which to beat you. Never back down to them, never retreat, never apologize.Notice that this was all posted AFTER Torgersen apologized to Scalzi.\nHur hur, homophobia’s a gas when you’re a Sad Puppy!\n— John Scalzi (@scalzi) May 4, 2015\nAgain: I’m mostly sad for the Sad Puppies. So much insecurity and envy and anger and need. For their own sakes, I wish they were happy.\n— John Scalzi (@scalzi) May 4, 2015\nNote that my pity for the Sad Puppies doesn’t preclude me pointing out they are assholes. And that they’ve made the active choice to be so.\n— John Scalzi (@scalzi) May 4, 2015\nAlso, if I DID like men more than women, so what? That would be a perfectly good thing, nor would I be the slightest bit ashamed of it.\n— John Scalzi (@scalzi) May 4, 2015\nIf Brad Torgersen wants to insult me, insinuating I’m gay won’t work. It’s not an insult to be gay. Be an insult to be a Sad Puppy, however.\n— John Scalzi (@scalzi) May 4, 2015\nIf it’s not an insult to be gay, then why is McRapey acting as if it is an insult? And how has Brad Torgersen damaged his potentially promising career by not insulting someone?\nmintwitch ‏@mintwitch\nBrad is just… so sad. He’s completely lost his grip, and unfortunately probably damaged a potentially promising career.\nJohn Scalzi ‏@scalzi\nIf he has, I suspect he will attribute it to his politics rather than his personal behavior.\nSo, just a single insult of the wrong individual is sufficient to damage a promising career. That’s fascinating, in light of how we have been repeatedly assured that there isn’t any cabal or conspiracy or collection of people who will attempt to torpedo your career in science fiction over mere differences of opinion. After all, was it not Orson Scott Card’s\npersonal behavior\nto which the SJWs objected when they attacked the Ender’s Game movie?\nWas it not my\npersonal behavior\nto which they objected when they attacked me on the basis of a syndicated op/ed column?\nIn the meantime, AN EDUCATIONAL DIALOGUE from the Evil Legion of Evil:\nJohn Scalzi: “I’d rather like men than to be a Sad Puppy.”\nMinion 189: “What do you mean when you say ‘like men’? Do you mean in the manner of owing someone a big favor in the Ground Forces?\nJohn Scalzi: “Um, yeah.”\nBig Gay Steve: “This can be arranged. I know a guy.”\nJohn Scalzi: “SQUEEEE!”\nThe End\nI don’t know about you, but I find it somewhat surprising that McRapey would publicly express a preference for being sodomized to seeing the likes of Jim Butcher or John C. Wright win a Hugo Award. It’s not exactly what you’d call a binary option.",
  "tags": [
    "SJW"
  ],
  "categories": [],
  "sitemap_lastmod": "2015-05-04T16:03:00+00:00"
}