{
  "url": "https://voxday.net/2015/05/24/no-reason-to-reac/",
  "scraped_at": "2025-12-16T12:56:51.031078",
  "title": "No reason to react",
  "date_display": "May 24, 2015",
  "date_iso": "2015-05-24T13:36:00+00:00",
  "date_from_url": "2015-05-24",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>There are more reports of <a href=\"http://www.dailymail.co.uk/news/article-3094956/ISIS-slaughters-400-women-children-ancient-Syria-city-Palmyra-hundreds-bodies-line-street.html\">ISIS atrocities in Syria</a>:</p><blockquote class=\"tr_bq\"><p> Islamic State militants have executed at least 400 mostly women and children in Syria’s ancient city of Palmyra. Eye-witnesses have reported the streets are strewn with bodies – the latest victims of the Islamic State’s unrelenting savagery – on the same day photographs of captured Syrian soldiers have emerged.</p><p>It follows the killing of nearly 300 pro-government troops two days after they captured the city, now symbolised by a black ISIS flag flying above an ancient citadel.</p></blockquote><p>However, keep in mind that false reports of atrocities have been used to whip up support for war for centuries. That doesn’t mean the reports are inaccurate, particularly in the electronic age when it’s easier to document events, but it’s important not to rush to judgment.</p><p>In my opinion, there is no reason to even contemplate military intervention in the Islamic world as long as Muslims reside in the West. This is the third great wave of Islamic expansion of a form that long predates the Westphalian system of nation-states and any policy that is based on Westphalian or post-Westphalian principles is bound to fail. Remember, a significant percentage of Muslims in the West openly sympathize with ISIS, and perhaps more importantly, it was Western governments that <a href=\"https://medium.com/insurge-intelligence/secret-pentagon-report-reveals-west-saw-isis-as-strategic-asset-b99ad7a29092\">made the Caliphate possible</a>:</p><blockquote class=\"tr_bq\"><p> A declassified secret US government document obtained by the conservative public interest law firm Judicial Watch, shows that Western governments deliberately allied with al-Qaeda and other Islamist extremist groups to topple Syrian dictator Bashir al-Assad. The document reveals that in coordination with the Gulf states and Turkey, the West intentionally sponsored violent Islamist groups to destabilize Assad, and that these “supporting powers” desired the emergence of a “Salafist Principality” in Syria to “isolate the Syrian regime.”</p></blockquote><p>Yet another strike against the principle of foreign intervention. The devil you don’t know is often considerably worse than the one you are trying to cast out.</p></div>",
  "content_text": "There are more reports of\nISIS atrocities in Syria\n:\nIslamic State militants have executed at least 400 mostly women and children in Syria’s ancient city of Palmyra. Eye-witnesses have reported the streets are strewn with bodies – the latest victims of the Islamic State’s unrelenting savagery – on the same day photographs of captured Syrian soldiers have emerged.\nIt follows the killing of nearly 300 pro-government troops two days after they captured the city, now symbolised by a black ISIS flag flying above an ancient citadel.\nHowever, keep in mind that false reports of atrocities have been used to whip up support for war for centuries. That doesn’t mean the reports are inaccurate, particularly in the electronic age when it’s easier to document events, but it’s important not to rush to judgment.\nIn my opinion, there is no reason to even contemplate military intervention in the Islamic world as long as Muslims reside in the West. This is the third great wave of Islamic expansion of a form that long predates the Westphalian system of nation-states and any policy that is based on Westphalian or post-Westphalian principles is bound to fail. Remember, a significant percentage of Muslims in the West openly sympathize with ISIS, and perhaps more importantly, it was Western governments that\nmade the Caliphate possible\n:\nA declassified secret US government document obtained by the conservative public interest law firm Judicial Watch, shows that Western governments deliberately allied with al-Qaeda and other Islamist extremist groups to topple Syrian dictator Bashir al-Assad. The document reveals that in coordination with the Gulf states and Turkey, the West intentionally sponsored violent Islamist groups to destabilize Assad, and that these “supporting powers” desired the emergence of a “Salafist Principality” in Syria to “isolate the Syrian regime.”\nYet another strike against the principle of foreign intervention. The devil you don’t know is often considerably worse than the one you are trying to cast out.",
  "tags": [
    "Clash of Civilizations",
    "war"
  ],
  "categories": [],
  "sitemap_lastmod": "2015-05-24T12:36:00+00:00"
}