{
  "url": "https://voxday.net/2015/05/03/patience-is-strategic-virtue/",
  "scraped_at": "2025-12-16T12:54:26.303740",
  "title": "Patience is a strategic virtue",
  "date_display": "May 3, 2015",
  "date_iso": "2015-05-03T10:05:00+00:00",
  "date_from_url": "2015-05-03",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>An informative dialogue between members of the Dread Ilk:</p><blockquote class=\"tr_bq\"><p> Ticticboom: “Larry Correia and Brad Torgensen have mentioned that most of their<br> interactions with Vox have been asking him not to burn the Hugos down.<br> What the SJWs don’t realize is how downright forgiving and tolerant Vox<br> is compared to what they think of as his followers.”</br></br></br></p><p>Vile Faceless Minion 156: “Agreed. When I see interviews where the left twists Vox’s (or another truthteller’s) words, calls names and basically spit on those I appreciate for standing up for Western Civilization… I feel blinding rage and a desire to destroy. Vox shrugs and presses onwards. I don’t understand this calm moderation and cannot maintain it.”</p></blockquote><p>I feel flashes of emotional reaction just like anyone else. I know what it is like to feel the blinding rage and harbor the intense desire to destroy. The difference is that I spent six years in a very hard school learning not to trust such feelings or to give into them. In the martial arts, when you react emotionally, when you throw caution to the wind, you pay for it, and you often pay for it in pain.</p><p>The best, fastest, hardest kick I ever threw in my life was in my fifth year, when I was sparring my sensei one afternoon. We were going at it hard and fast. I was holding nothing back and he was probably going about 90 percent. He feinted with a left jab, then pulled back-and-up as he often did; reading it correctly, I moved in and launched a skipping front sidekick that would have taken a lesser fighter’s head off. I mean, it was a rocket! I had him absolutely dead to rights and I knew it.</p><p>But somehow, he managed to lift his head up and turn it so that my heel barely brushed the side of his chin. He ducked and leaped sideways to safety before I could follow it up, smiled broadly, and said, “Now THAT was close. But not close enough!”</p><p>I completely lost it. It was maddening. I couldn’t BELIEVE that I’d read him perfectly, timed him perfectly, threw the perfect kick, and STILL didn’t catch the bastard cleanly. I went after him hard with my hands, he retreated, blocking everything, until finally, in frustration, I literally leaped at him and threw a haymaker at his head. This was <i>insanely</i> stupid, and in five years I’d never made such an unmitigated error before, but I was seeing red. My sensei told me later that he had so much time, and I’d left myself so open by leaving my feet and extending myself, that he actually had time to think “I cannot believe he did that” as he ducked under the wild punch and came up and across with a rear-hand shot to the body, which in combination with my forward momentum hit me so hard that it not only knocked the wind out of me, it actually lifted me higher off the ground on his fist.</p><p>I was lucky that I didn’t rupture anything. I’ve been knocked out and I’ve had bones broken, but that was the hardest anyone has ever hit me. I went down in what we called the full “armadillo” and stayed down. Getting up was not an option;  I couldn’t breathe and I couldn’t even roll over onto my back. It felt like I’d been hit by a charging bull. My abdomen was bruised for days and if he’d hit me just a few inches to the left, I’d have had several broken ribs.</p><p>In light of that experience, consider the completely unsurprising news that Floyd Mayweather not only won last night, but won rather easily against a very highly-regarded fighter.</p><blockquote class=\"tr_bq\"><p> Floyd Mayweather Jr. spent Saturday night doing — for the most part<br> — what he’s done in the vast majority of his championship bouts over<br> the last decade. He fought strategically. He landed counterpunchers. He held to offset rallies. The significance of this one was that the opponent was Manny Pacquiao. In<br> a welterweight bout that’s seemingly been a generation in the making,<br> Mayweather controlled the action in mid ring, eluded prolonged damage<br> along the ropes and worked his way to a unanimous decision that earned<br> him the WBO welterweight title to go along with the WBA and WBC belts he<br> arrived with. The win boosted him to 48-0 as a pro in a 19-year career. Pacquiao is 57-6-2.</br></br></br></br></br></br></br></p></blockquote><p>“He fought strategically.” That’s the significant quote here. Now let’s look at how fighting strategically applies to the Hugo 2015 situation. We know, beyond any shadow of a doubt, that <a href=\"http://amazingstoriesmag.com/2015/05/no-award-not-nuclear-option/\">the SJWs are going to vote No Award</a> on most of the Puppy-recommended works. Some will claim to have read them all, some will proudly proclaim that they have read none, others will pretend to genuinely believe that there is not a single award-worthy work in the lot, and a few particularly foolish ones will even convince themselves they believe as much. That’s fine, we all know what their opinions are worth as the list of past winners are well-documented. The only relevant point is that they are going to do it.</p><p>So why shouldn’t we join them? Why not pour on the gasoline as they run around shrieking and lighting matches? After all, getting things nominated that the other side would No Award, then turning around and joining them to ensure no awards were given out was my original idea, which I set aside in favor of SP3 and <a href=\"http://file770.com/?p=22293\">Brad Torgersen’s ultimately futile attempt</a> to save the Hugos from the SJWs. The reason to abandon this original objective now that it is firmly in our grasp is that the situation has developed in ways that I did not fully anticipate, thereby indicating a strategic adjustment. Why settle for burning Munich when Berlin may be within reach, <i>especially if the munchkins are promising to burn Munich for us</i> as we advance? <a href=\"http://www.contrapositivediary.com/?p=3402\">Jeff Duntemann’s summary</a> to which Mike Glyer directed our attention yesterday is informative in this regard.</p><blockquote class=\"tr_bq\"><p> It’s something like a sociological law: <i>Commotion attracts attention</i>.<br> Attention is unpredictable, because it reaches friend and foe alike. It<br> can go your way, or it can go the other way. There’s no way to control<br> the polarity of adverse attention. The only way to limit adverse<br> attention is to stop the commotion.</br></br></br></br></p><p>In other words, <i>just shut up</i>.</p><p>I know, this is difficult. For some psychologies, hate is delicious<br> to the point of being psychological crack, so it’s hard to just lecture<br> them on the fact that hate has consequences, including but hardly<br> limited to adverse attention.</br></br></br></p><p>My conclusion is this: <i>The opponents of Sad Puppies 3 put them on the map</i>,<br> and probably took them from a fluke to a viable long-term institution. I<br> don’t think this is what the APs intended. In the wake of the April 4<br> announcement of the final Hugo ballot, I’d guess the opposition has<br> generated several hundred kilostreisands of adverse attention, and the<br> numbers will continue to increase.</br></br></br></br></br></p></blockquote><p>In other words, thanks to the SJW overreaction, our capabilities may now permit us to accomplish more than we had reasonably believed possible at the start. Brad wanted to do something that was always impossible because the SJWs are much more poisonous than he naively believed them to be. I was not surprised by their nature (which is why I was always dubious about the SP3 goal), but I was surprised by how astonishingly stupid and self-destructive their post-shortlist reactions have been. So, thanks to them, the strategic situation has now changed and it behooves us to take advantage of their mistakes. The original options as I saw them, prior to the nominations being announced, were as follows:</p><ol><li>SJWs and Puppies play it straight. Puppies win between 1 and 3 awards. Vox Day collects two more 6th of 5 participation prizes.</li><li>SJWs choose nuclear option and Puppies play it straight. No Award wins<br> the majority of categories. Vox Day collects two more 6th of 5<br> participation prizes.</br></br></li><li>SJWs and Puppies choose nuclear option. No Award wins the majority of<br> categories. Vox Day collects two more 6th of 5 participation prize.</br></li></ol><p>Three options, two outcomes. From a strategic perspective, Option 3 is obviously the preferable one there. It may be little hard on John C. Wright, Jim Butcher, Toni Weisskopf, and other strong finalists who might genuinely appreciate winning an award, but as I have consistently pointed out from the start, I don’t care about awards. Neither do the hundreds of Vile Faceless Minions of the Evil Legion of Evil. <i>But this situation no longer applies.</i> Now, with the influx of THOUSANDS of new voters, whose allegiances are unknown, there are <i>three </i>possible outcomes.</p><ol><li>SJWs and Puppies play it straight. Puppies win between 3 and 6 awards. Vox Day collects neither Hugo Awards nor 6th of 5 participation prizes.</li><li>SJWs and Puppies choose nuclear option. No Award wins the majority of categories.Vox Day collects two more 6th of 5 participation prizes.</li><li>SJWs choose nuclear option and Puppies play it straight. No Award wins the majority of categories. Vox Day collects two more 6th of 5 participation prizes.</li><li>SJWs choose nuclear option and Puppies play it straight. Puppies win between 10 and 12 awards. Vox Day wins Best Editor, Short Form and finishes third, behind Toni Weisskopf and Jim Minz, in the other editorial category.</li></ol><p>The Option 4 is a legitimate possibility if two-thirds or more of the new supporting members are Puppy sympathizers. The reason Option 4 is the more desirable outcome is because a) the results of Option 2 and Option 3 are exactly the same, and b) it will publicly break the perceived power of the SJWs under the current rules. Option 2/3 interrupts their inability to hand out awards to themselves for a single year, but Option 4 will reveal the hard limits of their influence and render them relatively impotent for the foreseeable future.</p><p>The best possible outcome is not to see them nuke themselves, as amusing as that would be, but to see them <i>try to nuke themselves and fail</i>, thereby demonstrating that they don’t even possess the nukes they think they have. And even if Option 4 turns out to have been beyond our reach this year, its failure is still within the range of our victory conditions. This is what it means to successfully execute a Xanatos Gambit. If we fail, we win. If we succeed, we win even bigger. Why settle for victory when we can vanquish?</p><p>Now that the science fiction SJWs have publicly declared No Award, the best possible outcome for us is for them to try to burn down the awards and fail. And that is why we should not help them do it. I very much understand the temptation to cry havoc, run amok, and gleefully set fires, but keep this in mind: while strategic arson is good, strategic <i>occupation </i>is glorious.</p><p>Translation: stow the flamethrowers. For now. And as for those who are tempted to freak out and overreact simply because the other side is throwing punches, keep in mind how the great champions react to getting hit.</p><p><i>Floyd Mayweather let Manny Pacquiao hit him with a slew of body blows, then looked Pacquiao in the eye, shook his head, and said NOPE. </i></p></div>",
  "content_text": "An informative dialogue between members of the Dread Ilk:\nTicticboom: “Larry Correia and Brad Torgensen have mentioned that most of their\ninteractions with Vox have been asking him not to burn the Hugos down.\nWhat the SJWs don’t realize is how downright forgiving and tolerant Vox\nis compared to what they think of as his followers.”\nVile Faceless Minion 156: “Agreed. When I see interviews where the left twists Vox’s (or another truthteller’s) words, calls names and basically spit on those I appreciate for standing up for Western Civilization… I feel blinding rage and a desire to destroy. Vox shrugs and presses onwards. I don’t understand this calm moderation and cannot maintain it.”\nI feel flashes of emotional reaction just like anyone else. I know what it is like to feel the blinding rage and harbor the intense desire to destroy. The difference is that I spent six years in a very hard school learning not to trust such feelings or to give into them. In the martial arts, when you react emotionally, when you throw caution to the wind, you pay for it, and you often pay for it in pain.\nThe best, fastest, hardest kick I ever threw in my life was in my fifth year, when I was sparring my sensei one afternoon. We were going at it hard and fast. I was holding nothing back and he was probably going about 90 percent. He feinted with a left jab, then pulled back-and-up as he often did; reading it correctly, I moved in and launched a skipping front sidekick that would have taken a lesser fighter’s head off. I mean, it was a rocket! I had him absolutely dead to rights and I knew it.\nBut somehow, he managed to lift his head up and turn it so that my heel barely brushed the side of his chin. He ducked and leaped sideways to safety before I could follow it up, smiled broadly, and said, “Now THAT was close. But not close enough!”\nI completely lost it. It was maddening. I couldn’t BELIEVE that I’d read him perfectly, timed him perfectly, threw the perfect kick, and STILL didn’t catch the bastard cleanly. I went after him hard with my hands, he retreated, blocking everything, until finally, in frustration, I literally leaped at him and threw a haymaker at his head. This was\ninsanely\nstupid, and in five years I’d never made such an unmitigated error before, but I was seeing red. My sensei told me later that he had so much time, and I’d left myself so open by leaving my feet and extending myself, that he actually had time to think “I cannot believe he did that” as he ducked under the wild punch and came up and across with a rear-hand shot to the body, which in combination with my forward momentum hit me so hard that it not only knocked the wind out of me, it actually lifted me higher off the ground on his fist.\nI was lucky that I didn’t rupture anything. I’ve been knocked out and I’ve had bones broken, but that was the hardest anyone has ever hit me. I went down in what we called the full “armadillo” and stayed down. Getting up was not an option;  I couldn’t breathe and I couldn’t even roll over onto my back. It felt like I’d been hit by a charging bull. My abdomen was bruised for days and if he’d hit me just a few inches to the left, I’d have had several broken ribs.\nIn light of that experience, consider the completely unsurprising news that Floyd Mayweather not only won last night, but won rather easily against a very highly-regarded fighter.\nFloyd Mayweather Jr. spent Saturday night doing — for the most part\n— what he’s done in the vast majority of his championship bouts over\nthe last decade. He fought strategically. He landed counterpunchers. He held to offset rallies. The significance of this one was that the opponent was Manny Pacquiao. In\na welterweight bout that’s seemingly been a generation in the making,\nMayweather controlled the action in mid ring, eluded prolonged damage\nalong the ropes and worked his way to a unanimous decision that earned\nhim the WBO welterweight title to go along with the WBA and WBC belts he\narrived with. The win boosted him to 48-0 as a pro in a 19-year career. Pacquiao is 57-6-2.\n“He fought strategically.” That’s the significant quote here. Now let’s look at how fighting strategically applies to the Hugo 2015 situation. We know, beyond any shadow of a doubt, that\nthe SJWs are going to vote No Award\non most of the Puppy-recommended works. Some will claim to have read them all, some will proudly proclaim that they have read none, others will pretend to genuinely believe that there is not a single award-worthy work in the lot, and a few particularly foolish ones will even convince themselves they believe as much. That’s fine, we all know what their opinions are worth as the list of past winners are well-documented. The only relevant point is that they are going to do it.\nSo why shouldn’t we join them? Why not pour on the gasoline as they run around shrieking and lighting matches? After all, getting things nominated that the other side would No Award, then turning around and joining them to ensure no awards were given out was my original idea, which I set aside in favor of SP3 and\nBrad Torgersen’s ultimately futile attempt\nto save the Hugos from the SJWs. The reason to abandon this original objective now that it is firmly in our grasp is that the situation has developed in ways that I did not fully anticipate, thereby indicating a strategic adjustment. Why settle for burning Munich when Berlin may be within reach,\nespecially if the munchkins are promising to burn Munich for us\nas we advance?\nJeff Duntemann’s summary\nto which Mike Glyer directed our attention yesterday is informative in this regard.\nIt’s something like a sociological law:\nCommotion attracts attention\n.\nAttention is unpredictable, because it reaches friend and foe alike. It\ncan go your way, or it can go the other way. There’s no way to control\nthe polarity of adverse attention. The only way to limit adverse\nattention is to stop the commotion.\nIn other words,\njust shut up\n.\nI know, this is difficult. For some psychologies, hate is delicious\nto the point of being psychological crack, so it’s hard to just lecture\nthem on the fact that hate has consequences, including but hardly\nlimited to adverse attention.\nMy conclusion is this:\nThe opponents of Sad Puppies 3 put them on the map\n,\nand probably took them from a fluke to a viable long-term institution. I\ndon’t think this is what the APs intended. In the wake of the April 4\nannouncement of the final Hugo ballot, I’d guess the opposition has\ngenerated several hundred kilostreisands of adverse attention, and the\nnumbers will continue to increase.\nIn other words, thanks to the SJW overreaction, our capabilities may now permit us to accomplish more than we had reasonably believed possible at the start. Brad wanted to do something that was always impossible because the SJWs are much more poisonous than he naively believed them to be. I was not surprised by their nature (which is why I was always dubious about the SP3 goal), but I was surprised by how astonishingly stupid and self-destructive their post-shortlist reactions have been. So, thanks to them, the strategic situation has now changed and it behooves us to take advantage of their mistakes. The original options as I saw them, prior to the nominations being announced, were as follows:\nSJWs and Puppies play it straight. Puppies win between 1 and 3 awards. Vox Day collects two more 6th of 5 participation prizes.\nSJWs choose nuclear option and Puppies play it straight. No Award wins\nthe majority of categories. Vox Day collects two more 6th of 5\nparticipation prizes.\nSJWs and Puppies choose nuclear option. No Award wins the majority of\ncategories. Vox Day collects two more 6th of 5 participation prize.\nThree options, two outcomes. From a strategic perspective, Option 3 is obviously the preferable one there. It may be little hard on John C. Wright, Jim Butcher, Toni Weisskopf, and other strong finalists who might genuinely appreciate winning an award, but as I have consistently pointed out from the start, I don’t care about awards. Neither do the hundreds of Vile Faceless Minions of the Evil Legion of Evil.\nBut this situation no longer applies.\nNow, with the influx of THOUSANDS of new voters, whose allegiances are unknown, there are\nthree\npossible outcomes.\nSJWs and Puppies play it straight. Puppies win between 3 and 6 awards. Vox Day collects neither Hugo Awards nor 6th of 5 participation prizes.\nSJWs and Puppies choose nuclear option. No Award wins the majority of categories.Vox Day collects two more 6th of 5 participation prizes.\nSJWs choose nuclear option and Puppies play it straight. No Award wins the majority of categories. Vox Day collects two more 6th of 5 participation prizes.\nSJWs choose nuclear option and Puppies play it straight. Puppies win between 10 and 12 awards. Vox Day wins Best Editor, Short Form and finishes third, behind Toni Weisskopf and Jim Minz, in the other editorial category.\nThe Option 4 is a legitimate possibility if two-thirds or more of the new supporting members are Puppy sympathizers. The reason Option 4 is the more desirable outcome is because a) the results of Option 2 and Option 3 are exactly the same, and b) it will publicly break the perceived power of the SJWs under the current rules. Option 2/3 interrupts their inability to hand out awards to themselves for a single year, but Option 4 will reveal the hard limits of their influence and render them relatively impotent for the foreseeable future.\nThe best possible outcome is not to see them nuke themselves, as amusing as that would be, but to see them\ntry to nuke themselves and fail\n, thereby demonstrating that they don’t even possess the nukes they think they have. And even if Option 4 turns out to have been beyond our reach this year, its failure is still within the range of our victory conditions. This is what it means to successfully execute a Xanatos Gambit. If we fail, we win. If we succeed, we win even bigger. Why settle for victory when we can vanquish?\nNow that the science fiction SJWs have publicly declared No Award, the best possible outcome for us is for them to try to burn down the awards and fail. And that is why we should not help them do it. I very much understand the temptation to cry havoc, run amok, and gleefully set fires, but keep this in mind: while strategic arson is good, strategic\noccupation\nis glorious.\nTranslation: stow the flamethrowers. For now. And as for those who are tempted to freak out and overreact simply because the other side is throwing punches, keep in mind how the great champions react to getting hit.\nFloyd Mayweather let Manny Pacquiao hit him with a slew of body blows, then looked Pacquiao in the eye, shook his head, and said NOPE.",
  "tags": [
    "Hugo Award",
    "SJW"
  ],
  "categories": [],
  "sitemap_lastmod": "2015-05-03T09:05:00+00:00"
}