{
  "url": "https://voxday.net/2015/05/27/paul-gottfried-reviews-victoria/",
  "scraped_at": "2025-12-16T12:57:10.652428",
  "title": "Paul Gottfried reviews VICTORIA",
  "date_display": "May 27, 2015",
  "date_iso": "2015-05-27T08:26:00+00:00",
  "date_from_url": "2015-05-27",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>I don’t think anyone with any grasp of history doubts that the USA is in the process of going the way of the Byzantine Empire, the Austro-Hungarian Empire, Yugoslavia, and the Soviet Union at this point. It is a now a centralized multi-ethnic empire held together by the threat of military force, after all, and such empires always fracture sooner or later. And for all the various unpleasantries it recounts, <a href=\"http://www.amazon.com/Victoria-Novel-4th-Generation-War-ebook/dp/B00PNU8XFG\"><b><i>VICTORIA: A Novel of 4th Generation War </i></b></a>represents one of the more rosy-hued outcomes possible. Paul Gottfried <a href=\"http://www.vdare.com/articles/william-linds-victoria-heralds-coming-america-breakup?stf=reveals%20his%20connection\">reviewed it on VDARE</a>.</p><blockquote class=\"tr_bq\"><p> William Lind’s VICTORIA Heralds Coming America Breakup<br>By Paul Gottfried</br></p><p>William S. Lind is a man of many talents. He’s an institution of the American conservative movement, formerly the Director of the Center for Cultural Conservatism of the Free Congress Foundation (under the late Paul Weyrich), a regular contributor to The American Conservative, and a noted military theorist. And now, with the publication of Victoria he is a novelist, putting forward a highly readable vision of the breakup of the United States and a traditionalist restoration. It’s a sign of the times that we can no longer regard such a story as implausible.</p><p>Victoria is subtitled “A Novel of Fourth Generation Warfare,” and Lind’s writings on warfare bleed (perhaps too much) into his storytelling. His theory of Fourth Generation Warfare contends that warfare has ceased between states with standing armies and operative governments. Instead, it is decentralized, on at least one side, lacking a regular command structure and no longer identified with an established state or regular army. Countries like the U.S. find themselves in partisan struggles around the world that violate the “rules of war” built up under the old European state system.</p><p>Bill’s ideas about changing forms of warfare may have been influenced by the German political-legal theorist Carl Schmitt, who wrote on partisan warfare after the Second World War. His novel is written under the nom de plume “Thomas Hobbes,” so even in this he reveals his connection to Schmitt, as the German jurist profoundly admired the seventeenth-century Englishman who wrote about the rise of the state [The Leviathan in the State Theory of Thomas Hobbes, by Carl Schmitt] (I wrote an intellectual biography of Schmitt and also deeply respect the philosopher who wished to protect us against “the war of all against all.”)</p><p>In Victoria, all Hell breaks loose in a way that Hobbes might have understood. Yet it is only the Time of Tribulations before the golden age of social restoration that ends the novel. Indeed, we are told the ending in advance in the opening scene when we learn “The triumph of the Recovery was marked most clearly by the burning of the Episcopal bishop of Maine.”</p></blockquote><p>The revival of witch-burning in New England was certainly an eye-opener, but I’d have to say that my favorite scene was the rather egregious violation of academic freedom at Dartmouth. It’s kind of funny to imagine what the reaction would have been if I’d recommended <i>VICTORIA </i>for a Hugo instead of <i>THE CHAPLAIN’S WAR</i>. But it’s not science fiction, it’s political fiction, so that wouldn’t have been proper and neither Mr. Hobbes, nor his agent, Mr. Lind, would have approved.</p><p>In any event, <i>VICTORIA </i>is now <a href=\"http://www.amazon.com/Victoria-Novel-4th-Generation-War/dp/9527065453\">available as a 592-page paperback</a>. And speaking of Mr. Lind, I should also mention that Martin van Creveld’s <i>A HISTORY OF STRATEGY: From Sun Tzu to William S. Lind</i> <a href=\"http://www.amazon.com/History-Strategy-Sun-William-Lind/dp/9527065542\">is now available in hardcover</a>.</p></div>",
  "content_text": "I don’t think anyone with any grasp of history doubts that the USA is in the process of going the way of the Byzantine Empire, the Austro-Hungarian Empire, Yugoslavia, and the Soviet Union at this point. It is a now a centralized multi-ethnic empire held together by the threat of military force, after all, and such empires always fracture sooner or later. And for all the various unpleasantries it recounts,\nVICTORIA: A Novel of 4th Generation War\nrepresents one of the more rosy-hued outcomes possible. Paul Gottfried\nreviewed it on VDARE\n.\nWilliam Lind’s VICTORIA Heralds Coming America Breakup\nBy Paul Gottfried\nWilliam S. Lind is a man of many talents. He’s an institution of the American conservative movement, formerly the Director of the Center for Cultural Conservatism of the Free Congress Foundation (under the late Paul Weyrich), a regular contributor to The American Conservative, and a noted military theorist. And now, with the publication of Victoria he is a novelist, putting forward a highly readable vision of the breakup of the United States and a traditionalist restoration. It’s a sign of the times that we can no longer regard such a story as implausible.\nVictoria is subtitled “A Novel of Fourth Generation Warfare,” and Lind’s writings on warfare bleed (perhaps too much) into his storytelling. His theory of Fourth Generation Warfare contends that warfare has ceased between states with standing armies and operative governments. Instead, it is decentralized, on at least one side, lacking a regular command structure and no longer identified with an established state or regular army. Countries like the U.S. find themselves in partisan struggles around the world that violate the “rules of war” built up under the old European state system.\nBill’s ideas about changing forms of warfare may have been influenced by the German political-legal theorist Carl Schmitt, who wrote on partisan warfare after the Second World War. His novel is written under the nom de plume “Thomas Hobbes,” so even in this he reveals his connection to Schmitt, as the German jurist profoundly admired the seventeenth-century Englishman who wrote about the rise of the state [The Leviathan in the State Theory of Thomas Hobbes, by Carl Schmitt] (I wrote an intellectual biography of Schmitt and also deeply respect the philosopher who wished to protect us against “the war of all against all.”)\nIn Victoria, all Hell breaks loose in a way that Hobbes might have understood. Yet it is only the Time of Tribulations before the golden age of social restoration that ends the novel. Indeed, we are told the ending in advance in the opening scene when we learn “The triumph of the Recovery was marked most clearly by the burning of the Episcopal bishop of Maine.”\nThe revival of witch-burning in New England was certainly an eye-opener, but I’d have to say that my favorite scene was the rather egregious violation of academic freedom at Dartmouth. It’s kind of funny to imagine what the reaction would have been if I’d recommended\nVICTORIA\nfor a Hugo instead of\nTHE CHAPLAIN’S WAR\n. But it’s not science fiction, it’s political fiction, so that wouldn’t have been proper and neither Mr. Hobbes, nor his agent, Mr. Lind, would have approved.\nIn any event,\nVICTORIA\nis now\navailable as a 592-page paperback\n. And speaking of Mr. Lind, I should also mention that Martin van Creveld’s\nA HISTORY OF STRATEGY: From Sun Tzu to William S. Lind\nis now available in hardcover\n.",
  "tags": [
    "Book Review",
    "Castalia House"
  ],
  "categories": [],
  "sitemap_lastmod": "2015-05-27T07:26:00+00:00"
}