{
  "url": "https://voxday.net/2015/05/02/police-accountability/",
  "scraped_at": "2025-12-16T12:54:20.775927",
  "title": "Police accountability",
  "date_display": "May 2, 2015",
  "date_iso": "2015-05-02T10:53:00+00:00",
  "date_from_url": "2015-05-02",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>It appears there has been at least <a href=\"http://www.wsj.com/articles/baltimore-prosecutor-probable-cause-to-charge-police-in-freddie-gray-death-1430492304\">one positive consequence</a> of the Baltimore riots:</p><blockquote class=\"tr_bq\"><p> Six city police officers were charged Friday in the death of Freddie Gray, a 25-year-old man who suffered fatal spinal injuries last month while in custody, a swift development in a case that has heightened the national focus on policing in black communities.</p><p>The announcement by State’s Attorney Marilyn Mosby, the city’s chief prosecutor, surprised many in a city where officials had cautioned for days that the investigation might not come to a quick resolution. Spontaneous celebrations broke out in some neighborhoods that were roiled by looting and violence after Mr. Gray’s funeral on Monday, while police union officials said they were disappointed in what they called a rush to judgment.</p><p>The most serious charges were brought against Officer Caesar Goodson, who was driving a police transport van that brought Mr. Gray to a police station after his April 12 arrest. Mr. Goodson, 45 years old, was charged with second-degree murder, involuntary manslaughter and other charges.</p><p>Officers William Porter, 25, Lt. <a href=\"http://topics.wsj.com/person/R/Brian-Rice/1219\">Brian Rice</a>, 41, and Sgt. Alicia White, 30, were each charged with involuntary manslaughter, second-degree assault and misconduct in office. Officers Edward Nero, 29, and Garrett Miller,<br> 26, were charged with second-degree assault and misconduct in office.<br> Lt. Rice and Messrs. Nero and Miller were also charged with false<br> imprisonment for making what Ms. Mosby termed an illegal arrest of Mr.<br> Gray.</br></br></br></br></p><p> The officers surrendered to police and bail was set in<br> amounts ranging from $250,000 to $350,000, according to court records<br> and state officials. By Friday night, all six officers had posted bail<br> and been released, according to public records. Like Mr. Gray, three of<br> the officers, including Mr. Goodson, are African-American.</br></br></br></br></p></blockquote><p>I have no doubt that the six officers will get off without a penalty, but at least the case will draw further attention to the problem of US police believing they are able to freely murder US citizens without being held accountable. Even though they will probably be “exonerated” by the legal system, the arrest and trial itself serves as a moderate deterrent for future officers tempted to impose rough justice on the public.</p></div>",
  "content_text": "It appears there has been at least\none positive consequence\nof the Baltimore riots:\nSix city police officers were charged Friday in the death of Freddie Gray, a 25-year-old man who suffered fatal spinal injuries last month while in custody, a swift development in a case that has heightened the national focus on policing in black communities.\nThe announcement by State’s Attorney Marilyn Mosby, the city’s chief prosecutor, surprised many in a city where officials had cautioned for days that the investigation might not come to a quick resolution. Spontaneous celebrations broke out in some neighborhoods that were roiled by looting and violence after Mr. Gray’s funeral on Monday, while police union officials said they were disappointed in what they called a rush to judgment.\nThe most serious charges were brought against Officer Caesar Goodson, who was driving a police transport van that brought Mr. Gray to a police station after his April 12 arrest. Mr. Goodson, 45 years old, was charged with second-degree murder, involuntary manslaughter and other charges.\nOfficers William Porter, 25, Lt.\nBrian Rice\n, 41, and Sgt. Alicia White, 30, were each charged with involuntary manslaughter, second-degree assault and misconduct in office. Officers Edward Nero, 29, and Garrett Miller,\n26, were charged with second-degree assault and misconduct in office.\nLt. Rice and Messrs. Nero and Miller were also charged with false\nimprisonment for making what Ms. Mosby termed an illegal arrest of Mr.\nGray.\nThe officers surrendered to police and bail was set in\namounts ranging from $250,000 to $350,000, according to court records\nand state officials. By Friday night, all six officers had posted bail\nand been released, according to public records. Like Mr. Gray, three of\nthe officers, including Mr. Goodson, are African-American.\nI have no doubt that the six officers will get off without a penalty, but at least the case will draw further attention to the problem of US police believing they are able to freely murder US citizens without being held accountable. Even though they will probably be “exonerated” by the legal system, the arrest and trial itself serves as a moderate deterrent for future officers tempted to impose rough justice on the public.",
  "tags": [
    "NWA was right"
  ],
  "categories": [],
  "sitemap_lastmod": "2015-05-02T09:53:00+00:00"
}