{
  "url": "https://voxday.net/2015/05/30/publishing-negative-sum-game/",
  "scraped_at": "2025-12-16T12:57:33.941173",
  "title": "Publishing: the negative-sum game",
  "date_display": "May 30, 2015",
  "date_iso": "2015-05-30T10:56:00+00:00",
  "date_from_url": "2015-05-30",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>It is both amusing and a little tragic to see the brave face that the File 770 wannabes put on when contemplating the state of the traditional publishing world. They keep insisting that it is not a zero-sum game, which is true in a sense, because it is actually <a href=\"http://www.beyondintractability.org/essay/sum\">a negative-sum game</a>.</p><blockquote class=\"tr_bq\"><p> The most difficult problems are negative-sum situations, where the pie is shrinking. In the end, the gains and losses will all add up to less than zero. This means that the only way for a party to maintain its position is to take something from another party, and even if everyone takes his or her share of the “losses,” everyone still loses in comparison to what they currently have or really need. This type of situation often sparks serious competition.</p><p>However, negative-sum disputes are not always lose-lose because if the parties know the pie is shrinking, it is possible their expectations will be low. A perfect example of a negative-sum dispute is the allocation of budget cuts within an organization. In this case, each department expects to have some funds taken away, but whether the outcome is a win or loss depends on how much money a particular branch gets in comparison to what they expected to have cut from their budget. So, if a branch was expecting to get a 30 percent cut and they only got cut 20 percent, which would be a win, even in a diminishing resource situation.</p></blockquote><p>The present negative-sum situation was probably inevitable, not only due to the primary factor of men’s increasing preference for electronic forms of entertainment, but there is also the secondary factor of changing ethnic demographics. In the USA, for example, Hispanics don’t read as much as Anglos and they don’t buy as many books.</p><p><i>Among all American adults, the average (mean) number of books read or<br> listened to in the past year is 12 and the median (midpoint) number is 5. The White average is 13 and the median is 5, the Black average is 12 and the median is 4, the Hispanic average is 7 and the median is 3.</br></i></p><p>Throw in the number of non-English speakers into the mix and it should not be a surprise that prospects for the traditional publishing world were not good despite a growing population even before the SJW invasion of genre publishing is taken into account. But that doesn’t mean that the advocates of Pink SF haven’t made the situation worse, as the corporate masters are apparently <a href=\"http://www.thebookseller.com/news/julie-crisp-departs-tor\">beginning to understand</a>. <i>“Tor’s editorial director Julie Crisp has left Pan Macmillan following a<br> review of the company’s science fiction and fantasy publishing.”</br></i></p><p>Does that mean that Castalia has stupidly entered a declining market in the hopes of carving off a slice of a shrinking pie? Not at all. Because we have no intention whatsoever of becoming a traditional publisher, our cost structure will keep us competitive despite the higher royalties and lower prices we offer, and we know there is still a significant market for the Campbellian science fiction created by beardy, middle-aged white men in which the traditional SF publishers are aggressively disinterested.</p><p>Moreover, as the Brainstorm crowd knows, we are developing the technology to massively expand that market by reaching the young men who have, quite reasonably, abandoned the traditional SF market. I started reading Neal Stephenson’s latest novel, <i>Seveneves</i>, and it is truly depressing. Less because nearly everyone on Earth dies than because he appears to have gone full SJW with a Gamma sauce. It’s the first time I’ve found it necessary to force myself to keep reading one of his books, and the first time one of his books has struck me as being proper Pink SF. Female presidents, token ethnic melanges, you name it, he’s got it to such an extent that were it not for Stephenson’s past gamma markers, I would almost suspect an epic, master-class trolling of the current genre.</p><p>On a tangential note, as Aristotle has informed us, some people are simply incapable of learning.</p><blockquote class=\"tr_bq\"><p> Julie Crisp ‏@julieacrisp May 20<br> So I’ve had a lot of submissions in recently. And do you know how excited I am to see how many of those are SF novels written by women?!!</br></p><p>Julie Crisp ‏@julieacrisp May 20<br> The answer is VERY!! 🙂</br></p></blockquote><p>Her doubling-down on her enthusiasm for female SF authors is intriguing in light of <a href=\"http://io9.com/5831380/tor-uk-looking-to-expand----and-possibly-move-into-urban-fantasy\">this news report from 2011</a>:</p><blockquote class=\"tr_bq\"><p> But with the hiring of Bella Pagan away from Orbit, Tor UK does hope to grow — and diversify — its line. Crisp explains:</p><p><i>With Bella joining us, we’re looking to grow our list in size, direction and selection. While, as of yet – everything is still under wraps concerning the new innovations we’ll be putting in place (watch this space!) I can tell you that Bella has a particular interest in urban fantasy and paranormal romances – an area that Tor UK hasn’t explored to its potential previously. So that’s one area we’ll be looking to expand into. </i></p></blockquote><p>It doesn’t look like that strategy worked out all that well, does it. I’ve even seen some rumors floating around that Pan Macmillan is in the process of shutting down Tor UK altogether. Meanwhile, Tor.com <a href=\"http://www.thepassivevoice.com/02/2015/tor-com-explains-why-novellas-are-the-future-of-publishing/\">is abandoning the novel</a> in favor of the novella:</p><blockquote class=\"tr_bq\"><p> When the book wars sweep across the galaxy, and the blood of publishers runs down the gutters of every interstellar metropolis, the resource we fight for will not be paper, or ink, or even money. It will be time. For our readers, time is the precious commodity they invest in every book they decide to purchase and read. But time is being ground down into smaller and smaller units, long nights of reflection replaced with fragmentary bursts of free time. It’s just harder to make time for that thousand-page novel than it used to be, and there are more and more thousand-page novels to suffer from that temporal fragmentation.</p><p>Enter the novella, an old form with a new lease on life. We expect that the reader who has to fit their reading into their daily commute will appreciate a novella they can finish in a week, rather than a year. We’ll be releasing books that can be begun and completed on just one of those rare evenings of uninterrupted reading pleasure.</p></blockquote><p>Apparently they believe Pink SF is more digestible in smaller doses.</p></div>",
  "content_text": "It is both amusing and a little tragic to see the brave face that the File 770 wannabes put on when contemplating the state of the traditional publishing world. They keep insisting that it is not a zero-sum game, which is true in a sense, because it is actually\na negative-sum game\n.\nThe most difficult problems are negative-sum situations, where the pie is shrinking. In the end, the gains and losses will all add up to less than zero. This means that the only way for a party to maintain its position is to take something from another party, and even if everyone takes his or her share of the “losses,” everyone still loses in comparison to what they currently have or really need. This type of situation often sparks serious competition.\nHowever, negative-sum disputes are not always lose-lose because if the parties know the pie is shrinking, it is possible their expectations will be low. A perfect example of a negative-sum dispute is the allocation of budget cuts within an organization. In this case, each department expects to have some funds taken away, but whether the outcome is a win or loss depends on how much money a particular branch gets in comparison to what they expected to have cut from their budget. So, if a branch was expecting to get a 30 percent cut and they only got cut 20 percent, which would be a win, even in a diminishing resource situation.\nThe present negative-sum situation was probably inevitable, not only due to the primary factor of men’s increasing preference for electronic forms of entertainment, but there is also the secondary factor of changing ethnic demographics. In the USA, for example, Hispanics don’t read as much as Anglos and they don’t buy as many books.\nAmong all American adults, the average (mean) number of books read or\nlistened to in the past year is 12 and the median (midpoint) number is 5. The White average is 13 and the median is 5, the Black average is 12 and the median is 4, the Hispanic average is 7 and the median is 3.\nThrow in the number of non-English speakers into the mix and it should not be a surprise that prospects for the traditional publishing world were not good despite a growing population even before the SJW invasion of genre publishing is taken into account. But that doesn’t mean that the advocates of Pink SF haven’t made the situation worse, as the corporate masters are apparently\nbeginning to understand\n.\n“Tor’s editorial director Julie Crisp has left Pan Macmillan following a\nreview of the company’s science fiction and fantasy publishing.”\nDoes that mean that Castalia has stupidly entered a declining market in the hopes of carving off a slice of a shrinking pie? Not at all. Because we have no intention whatsoever of becoming a traditional publisher, our cost structure will keep us competitive despite the higher royalties and lower prices we offer, and we know there is still a significant market for the Campbellian science fiction created by beardy, middle-aged white men in which the traditional SF publishers are aggressively disinterested.\nMoreover, as the Brainstorm crowd knows, we are developing the technology to massively expand that market by reaching the young men who have, quite reasonably, abandoned the traditional SF market. I started reading Neal Stephenson’s latest novel,\nSeveneves\n, and it is truly depressing. Less because nearly everyone on Earth dies than because he appears to have gone full SJW with a Gamma sauce. It’s the first time I’ve found it necessary to force myself to keep reading one of his books, and the first time one of his books has struck me as being proper Pink SF. Female presidents, token ethnic melanges, you name it, he’s got it to such an extent that were it not for Stephenson’s past gamma markers, I would almost suspect an epic, master-class trolling of the current genre.\nOn a tangential note, as Aristotle has informed us, some people are simply incapable of learning.\nJulie Crisp ‏@julieacrisp May 20\nSo I’ve had a lot of submissions in recently. And do you know how excited I am to see how many of those are SF novels written by women?!!\nJulie Crisp ‏@julieacrisp May 20\nThe answer is VERY!! 🙂\nHer doubling-down on her enthusiasm for female SF authors is intriguing in light of\nthis news report from 2011\n:\nBut with the hiring of Bella Pagan away from Orbit, Tor UK does hope to grow — and diversify — its line. Crisp explains:\nWith Bella joining us, we’re looking to grow our list in size, direction and selection. While, as of yet – everything is still under wraps concerning the new innovations we’ll be putting in place (watch this space!) I can tell you that Bella has a particular interest in urban fantasy and paranormal romances – an area that Tor UK hasn’t explored to its potential previously. So that’s one area we’ll be looking to expand into.\nIt doesn’t look like that strategy worked out all that well, does it. I’ve even seen some rumors floating around that Pan Macmillan is in the process of shutting down Tor UK altogether. Meanwhile, Tor.com\nis abandoning the novel\nin favor of the novella:\nWhen the book wars sweep across the galaxy, and the blood of publishers runs down the gutters of every interstellar metropolis, the resource we fight for will not be paper, or ink, or even money. It will be time. For our readers, time is the precious commodity they invest in every book they decide to purchase and read. But time is being ground down into smaller and smaller units, long nights of reflection replaced with fragmentary bursts of free time. It’s just harder to make time for that thousand-page novel than it used to be, and there are more and more thousand-page novels to suffer from that temporal fragmentation.\nEnter the novella, an old form with a new lease on life. We expect that the reader who has to fit their reading into their daily commute will appreciate a novella they can finish in a week, rather than a year. We’ll be releasing books that can be begun and completed on just one of those rare evenings of uninterrupted reading pleasure.\nApparently they believe Pink SF is more digestible in smaller doses.",
  "tags": [
    "books",
    "Pink SF"
  ],
  "categories": [],
  "sitemap_lastmod": "2015-05-30T09:56:00+00:00"
}