{
  "url": "https://voxday.net/2015/05/31/sad-puppies-cant-be-wrong/",
  "scraped_at": "2025-12-16T12:57:40.917615",
  "title": "Sad Puppies can’t be wrong",
  "date_display": "May 31, 2015",
  "date_iso": "2015-05-31T08:25:00+00:00",
  "date_from_url": "2015-05-31",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>Not when the very worst writer in science fiction and fantasy opposes us:</p><blockquote class=\"tr_bq\"><p> Mercedes Lackey says:    <br> <a href=\"http://www.ericflint.net/index.php/2015/05/14/and-again-on-the-hugo-awards/comment-page-1/#comment-2586359\">May 15, 2015 at 9:00 PM </a>  </br></p><p>I’ve said it before in your blog and I’ll say it again. The Puppies of both orders picked the perfect name for themselves. Puppies piss and shit all over everything, they never stop whining and yapping, they destroy everything they get their teeth into and plenty of them are too damn dumb not to shit and piss in their own bed. And then lie in it.</p><p>And then they are shocked–SHOCKED!–when someone comes along, rubs their noses in it, and smacks them. And they’ll be even more shocked when someone lock them in their crate, or sends them to the pound.</p><p>See, one thing Larry (my husband Larry Dixon) and I have learned is that editors don’t appreciate trouble. Trouble doesn’t sell books. In the long run, trouble loses sales, in a business already precarious.</p><p>I’m going to predict that someone is going to be crated over this. If they are less lucky…someone’s going to be sent to the pound.</p></blockquote><p>No wonder her hastily scribbled–5.5 per year on average according to Wikipedia–are so appallingly dreadful. The woman makes the logic-challenged Eric Flint look like a genius in comparison. I’d rather read John Scalzi’s entire oeuvre twice than another Mercedes Lackey book. She’s the anti-Tanith Lee; her works were among the first Pink SF works I noticed corrupting the genre. A year ago, I would have called her an Marion Zimmer Bradley-imitator who can’t write, except that would be a bit harsh given the recent revelations of her predecessor’s problematic pasttimes. And if I was as determined to unilaterally destroy the Hugos as the SJWs claim, RP’s Best Novel category would have been as follows:</p><ul><li><i>Closer to Home</i>: Book One of Herald Spy by Mercedes Lackey</li><li><i>Bastion</i>: Book Five of the Collegium Chronicles by Mercedes Lackey</li><li><i>Children of the Night</i> (Diana Tregarde Investigation #2) by Mercedes Lackey</li><li><i>Steadfast</i> (Elemental Masters #8) by Mercedes Lackey</li><li><i>Blood Red</i> (Elemental Masters #9) by Mercedes Lackey</li></ul><p>As to how shocked–SHOCKED!–we are by the behavior of the SJWs in science fiction, I will simply quote Martin van Creveld in <i>The Changing Face of War</i>.<br> <b><br/></b><br> <b><i>“As Schlieffen himself had once written, for a great victory (what he called a “Cannae” to take place, it was necessary for the commanders on both sides to cooperate, each in his own way.”</i></b></br></br></p><p>Let’s just say their behavior shocked me about as much as the discovery that the sun rose again this morning. There are precisely four things that have surprised me about the SJW response to date:</p><ol><li>John Scalzi more or less keeping his mouth shut. Now we know why.</li><li>Charles Stross attempting to doxx Castalia and his insane Finnish Nazi theories. I genuinely thought he was smarter than that.</li><li>The public approval of Mary Kowal openly buying supporting memberships for other people. It’s so hard to imagine anyone else making effective use of that tactic in the future.</li><li><i>Popular Science</i> being one of the publications in which they planted their hit stories. I knew from past experience they would plant hit pieces in the media. But that would not have been among the first 250 publications I would have guessed.</li></ol><p>On the other hand, it is entirely unsurprising to see that Lackey is stupid enough to not realize that her prediction about Puppy-supporting authors suffering at the hands of their editors is additional testimony in support of our original contentions. And it’s not the only testimony in this regard either. I rather enjoyed Brian Z’s Stalinistic <a href=\"http://file770.com/?p=22807&amp;cpage=10#comment-272521\">ritual denunciation under pressure</a>:</p><p><a href=\"http://s2.quickmeme.com/img/ed/ed18f21776b3e03d40f1cebe2fb04bc3052ef013beac82398023cf6e4e5cb977.jpg\" imageanchor=\"1\" style=\"clear: right; float: right; margin-bottom: 1em; margin-left: 1em;\"><img border=\"0\" decoding=\"async\" fetchpriority=\"high\" height=\"400\" src=\"http://s2.quickmeme.com/img/ed/ed18f21776b3e03d40f1cebe2fb04bc3052ef013beac82398023cf6e4e5cb977.jpg\" width=\"267\"/></a><i>“In case this might be misunderstood as an endorsement of that site<br> moderator’s views or tactics, I denounce everything Vox Populi stands<br> for.” </br></br></i></p><p>Do you, SJW, renounce the Supreme Dark Lord and all his works? And then there was <a href=\"http://file770.com/?p=22807&amp;cpage=10#comment-272531\">Influxus’s admission</a> of what many SJWs are thinking, but most are sensible enough to deny in public:<i> </i></p><p><i>Of course VD loves it because it perpetuates his narrative that the Sads<br> are scape-goated by the SJWs of Fandom, when really the only person<br> that most people want to get rid of is him.</br></br></i></p><p>Nearly everything the SJWs do tends to support that narrative. And while I may top the list, based on their behavior towards Larry Correia and Brad Torgersen and John C. Wright and Mike Resnick and Barry Malzberg and John Norman, I very much doubt I am the only troublesome individual of whom they wish to be rid. As for the pound, it is obvious that the SJWs of Fandom simply do not understand the relevant dynamic here….</p><p>UPDATE: Speaking of the Puppy narrative, <a href=\"http://www.ericflint.net/index.php/2015/05/14/and-again-on-the-hugo-awards/comment-page-1/#comment-2586338\">further support for it</a> from SJWs.</p><blockquote class=\"tr_bq\"><p> “I suspect that some of these sad and rabid folk will soon have to start writing under new pen names if they expect their work to survive the editorial sniff-test with most of today’s publishers.”</p></blockquote><p>This, of course, is the same thing Charles Stross was telling me 10 years ago. Submit to the SJW gatekeepers or be cast out. As for me and my House, we choose out.</p></div>",
  "content_text": "Not when the very worst writer in science fiction and fantasy opposes us:\nMercedes Lackey says:\nMay 15, 2015 at 9:00 PM\nI’ve said it before in your blog and I’ll say it again. The Puppies of both orders picked the perfect name for themselves. Puppies piss and shit all over everything, they never stop whining and yapping, they destroy everything they get their teeth into and plenty of them are too damn dumb not to shit and piss in their own bed. And then lie in it.\nAnd then they are shocked–SHOCKED!–when someone comes along, rubs their noses in it, and smacks them. And they’ll be even more shocked when someone lock them in their crate, or sends them to the pound.\nSee, one thing Larry (my husband Larry Dixon) and I have learned is that editors don’t appreciate trouble. Trouble doesn’t sell books. In the long run, trouble loses sales, in a business already precarious.\nI’m going to predict that someone is going to be crated over this. If they are less lucky…someone’s going to be sent to the pound.\nNo wonder her hastily scribbled–5.5 per year on average according to Wikipedia–are so appallingly dreadful. The woman makes the logic-challenged Eric Flint look like a genius in comparison. I’d rather read John Scalzi’s entire oeuvre twice than another Mercedes Lackey book. She’s the anti-Tanith Lee; her works were among the first Pink SF works I noticed corrupting the genre. A year ago, I would have called her an Marion Zimmer Bradley-imitator who can’t write, except that would be a bit harsh given the recent revelations of her predecessor’s problematic pasttimes. And if I was as determined to unilaterally destroy the Hugos as the SJWs claim, RP’s Best Novel category would have been as follows:\nCloser to Home\n: Book One of Herald Spy by Mercedes Lackey\nBastion\n: Book Five of the Collegium Chronicles by Mercedes Lackey\nChildren of the Night\n(Diana Tregarde Investigation #2) by Mercedes Lackey\nSteadfast\n(Elemental Masters #8) by Mercedes Lackey\nBlood Red\n(Elemental Masters #9) by Mercedes Lackey\nAs to how shocked–SHOCKED!–we are by the behavior of the SJWs in science fiction, I will simply quote Martin van Creveld in\nThe Changing Face of War\n.\n“As Schlieffen himself had once written, for a great victory (what he called a “Cannae” to take place, it was necessary for the commanders on both sides to cooperate, each in his own way.”\nLet’s just say their behavior shocked me about as much as the discovery that the sun rose again this morning. There are precisely four things that have surprised me about the SJW response to date:\nJohn Scalzi more or less keeping his mouth shut. Now we know why.\nCharles Stross attempting to doxx Castalia and his insane Finnish Nazi theories. I genuinely thought he was smarter than that.\nThe public approval of Mary Kowal openly buying supporting memberships for other people. It’s so hard to imagine anyone else making effective use of that tactic in the future.\nPopular Science\nbeing one of the publications in which they planted their hit stories. I knew from past experience they would plant hit pieces in the media. But that would not have been among the first 250 publications I would have guessed.\nOn the other hand, it is entirely unsurprising to see that Lackey is stupid enough to not realize that her prediction about Puppy-supporting authors suffering at the hands of their editors is additional testimony in support of our original contentions. And it’s not the only testimony in this regard either. I rather enjoyed Brian Z’s Stalinistic\nritual denunciation under pressure\n:\n“In case this might be misunderstood as an endorsement of that site\nmoderator’s views or tactics, I denounce everything Vox Populi stands\nfor.”\nDo you, SJW, renounce the Supreme Dark Lord and all his works? And then there was\nInfluxus’s admission\nof what many SJWs are thinking, but most are sensible enough to deny in public:\nOf course VD loves it because it perpetuates his narrative that the Sads\nare scape-goated by the SJWs of Fandom, when really the only person\nthat most people want to get rid of is him.\nNearly everything the SJWs do tends to support that narrative. And while I may top the list, based on their behavior towards Larry Correia and Brad Torgersen and John C. Wright and Mike Resnick and Barry Malzberg and John Norman, I very much doubt I am the only troublesome individual of whom they wish to be rid. As for the pound, it is obvious that the SJWs of Fandom simply do not understand the relevant dynamic here….\nUPDATE: Speaking of the Puppy narrative,\nfurther support for it\nfrom SJWs.\n“I suspect that some of these sad and rabid folk will soon have to start writing under new pen names if they expect their work to survive the editorial sniff-test with most of today’s publishers.”\nThis, of course, is the same thing Charles Stross was telling me 10 years ago. Submit to the SJW gatekeepers or be cast out. As for me and my House, we choose out.",
  "tags": [
    "Puppies",
    "SJW"
  ],
  "categories": [],
  "sitemap_lastmod": "2015-05-31T07:25:00+00:00"
}