{
  "url": "https://voxday.net/2015/05/08/sci-phi-journal-5/",
  "scraped_at": "2025-12-16T12:55:04.447494",
  "title": "Sci Phi Journal #5",
  "date_display": "May 8, 2015",
  "date_iso": "2015-05-08T16:00:00+00:00",
  "date_from_url": "2015-05-08",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><div class=\"separator\" style=\"clear: both; text-align: center;\"> <i><b><a href=\"http://www.castaliahouse.com/wp-content/uploads/2015/04/SPJ5_256.jpg\" imageanchor=\"1\" style=\"clear: left; float: left; margin-bottom: 1em; margin-right: 1em;\"><noscript><img border=\"0\" decoding=\"async\" src=\"http://www.castaliahouse.com/wp-content/uploads/2015/04/SPJ5_256.jpg\"/></noscript><img border=\"0\" class=\"lazyload\" data-src=\"http://www.castaliahouse.com/wp-content/uploads/2015/04/SPJ5_256.jpg\" decoding=\"async\" src=\"data:image/svg+xml,%3Csvg%20xmlns=%22http://www.w3.org/2000/svg%22%20viewBox=%220%200%20210%20140%22%3E%3C/svg%3E\"/></a></b></i></div><p><i><a href=\"http://www.castaliahouse.com/downloads/sci-phi-journal-5/\"><b>SCI PHI Journal #5</b></a></i> is out. This issue is particularly strong on the non-fiction, even the book reviews are fascinating. I particularly enjoyed THE PHILOSOPHY OF SERENITY by Anthony Marchetta, an excerpt from which is posted below.</p><p>SCI PHI Journal #5 is <a href=\"http://www.castaliahouse.com/downloads/sci-phi-journal-5/\">available at Castalia House</a> in EPUB or MOBI formats for $3.99. It is also available on Amazon. SCI PHIL Journals 1-4 <a href=\"http://www.castaliahouse.com/downloads/tag/sciphi-journal/\">are also available</a>.</p><p>From <i>THE PHILOSOPHY OF SERENITY</i></p><p>“Joss Whedon is a famously virulent and ultra-feminist atheist. He is also, of course, an excellent writer, and, in my experience, good writers will tend to echo known truths about human nature even when they don’t necessarily want to face it themselves. You can see a lot of this in atheist Douglas Adams. <i>The Hitchhiker’s Guide</i> books are really about a man staring into the void and seeing nothing back. The only way to keep from crying in the face of such nothingness is to laugh. Adams recognized this, and it’s this philosophical underpinning that makes the series so brilliant.</p><p>“And so it is with Joss Whedon’s <i>Serenity</i>. The real theme of the movie is man’s underlying need for faith. Shepherd Book says it the most clearly when he tells Mal, “I don’t care what you believe in, just believe in it”  Of course, there’s something deeper going on with that line that Whedon probably never intended. He is literally saying that it’s better to believe in a lie than to look into the void and find nothing; it’s better just to make up a substitute to fool yourself.</p><p>“This isn’t only an atheist idea. C.S. Lewis explores this concept in the climactic scene of the fourth Chronicles of Narnia book, <i>The Silver Chair</i>. The character of Puddlegum is talking to the Lady of the Green Kirtle. The children and he are being enchanted to believe that the real world is only make-believe and the dark underworld they’re in is the only world that is:</p><blockquote class=\"tr_bq\"><p> “Suppose we have only dreamed, or made up, all those things—trees and grass and sun and moon and stars and Aslan himself. Suppose we have. Then all I can say is that, in that case, the made-up things seem a good deal more important than the real ones. Suppose this black pit of a kingdom of yours is the only world. Well, it strikes me as a pretty poor one. And that’s a funny thing, when you come to think of it. We’re just babies making up a game, if you’re right. But four babies playing a game can make a play-world which licks your real world hollow. That’s why I’m going to stand by the play world. I’m on Aslan’s side even if there isn’t any Aslan to lead it. I’m going to live as like a Narnian as I can even if there isn’t any Narnia. So, thanking you kindly for our supper, if these two gentlemen and the young lady are ready, we’re leaving your court at once and setting out in the dark to spend our lives looking for Overland. Not that our lives will be very long, I should think; but that’s a small loss if the world’s as dull a place as you say.”</p></blockquote><p>“This seems to us like a radical line of thought. It’s practically blasphemous by modern standards. Lewis is literally saying that it’s better to believe in a lie than believe in nothing at all. But does Whedon really say anything different?</p><p>“Shepherd Book is supposedly a Christian. This entails belief in things like the Resurrection of Christ and the importance of evangelization and repentance. Mal is supposedly an atheist. Book’s number one priority, then, should be to convert Mal to Christianity. But that’s not what he does! For Book, being a Christian is of secondary importance to Mal leaving behind the black hole of unbelief he has fallen into. Book doesn’t care what Mal believes in. Like Lewis, Book recognizes that even believing in a lie is better than believing in nothing. Whedon, an excellent writer, senses this even if he doesn’t state the idea outright. Atheism as a worldview is ultimately dead; the only way to survive it is to avoid its implications.</p><p>“And so <i>Serenity </i>is really Mal’s story about finding a meaning and a purpose to his life in the absence of a God to guide him.”</p></div>",
  "content_text": "SCI PHI Journal #5\nis out. This issue is particularly strong on the non-fiction, even the book reviews are fascinating. I particularly enjoyed THE PHILOSOPHY OF SERENITY by Anthony Marchetta, an excerpt from which is posted below.\nSCI PHI Journal #5 is\navailable at Castalia House\nin EPUB or MOBI formats for $3.99. It is also available on Amazon. SCI PHIL Journals 1-4\nare also available\n.\nFrom\nTHE PHILOSOPHY OF SERENITY\n“Joss Whedon is a famously virulent and ultra-feminist atheist. He is also, of course, an excellent writer, and, in my experience, good writers will tend to echo known truths about human nature even when they don’t necessarily want to face it themselves. You can see a lot of this in atheist Douglas Adams.\nThe Hitchhiker’s Guide\nbooks are really about a man staring into the void and seeing nothing back. The only way to keep from crying in the face of such nothingness is to laugh. Adams recognized this, and it’s this philosophical underpinning that makes the series so brilliant.\n“And so it is with Joss Whedon’s\nSerenity\n. The real theme of the movie is man’s underlying need for faith. Shepherd Book says it the most clearly when he tells Mal, “I don’t care what you believe in, just believe in it”  Of course, there’s something deeper going on with that line that Whedon probably never intended. He is literally saying that it’s better to believe in a lie than to look into the void and find nothing; it’s better just to make up a substitute to fool yourself.\n“This isn’t only an atheist idea. C.S. Lewis explores this concept in the climactic scene of the fourth Chronicles of Narnia book,\nThe Silver Chair\n. The character of Puddlegum is talking to the Lady of the Green Kirtle. The children and he are being enchanted to believe that the real world is only make-believe and the dark underworld they’re in is the only world that is:\n“Suppose we have only dreamed, or made up, all those things—trees and grass and sun and moon and stars and Aslan himself. Suppose we have. Then all I can say is that, in that case, the made-up things seem a good deal more important than the real ones. Suppose this black pit of a kingdom of yours is the only world. Well, it strikes me as a pretty poor one. And that’s a funny thing, when you come to think of it. We’re just babies making up a game, if you’re right. But four babies playing a game can make a play-world which licks your real world hollow. That’s why I’m going to stand by the play world. I’m on Aslan’s side even if there isn’t any Aslan to lead it. I’m going to live as like a Narnian as I can even if there isn’t any Narnia. So, thanking you kindly for our supper, if these two gentlemen and the young lady are ready, we’re leaving your court at once and setting out in the dark to spend our lives looking for Overland. Not that our lives will be very long, I should think; but that’s a small loss if the world’s as dull a place as you say.”\n“This seems to us like a radical line of thought. It’s practically blasphemous by modern standards. Lewis is literally saying that it’s better to believe in a lie than believe in nothing at all. But does Whedon really say anything different?\n“Shepherd Book is supposedly a Christian. This entails belief in things like the Resurrection of Christ and the importance of evangelization and repentance. Mal is supposedly an atheist. Book’s number one priority, then, should be to convert Mal to Christianity. But that’s not what he does! For Book, being a Christian is of secondary importance to Mal leaving behind the black hole of unbelief he has fallen into. Book doesn’t care what Mal believes in. Like Lewis, Book recognizes that even believing in a lie is better than believing in nothing. Whedon, an excellent writer, senses this even if he doesn’t state the idea outright. Atheism as a worldview is ultimately dead; the only way to survive it is to avoid its implications.\n“And so\nSerenity\nis really Mal’s story about finding a meaning and a purpose to his life in the absence of a God to guide him.”",
  "tags": [
    "Castalia House",
    "philosophy"
  ],
  "categories": [],
  "sitemap_lastmod": "2015-05-08T15:00:00+00:00"
}