{
  "url": "https://voxday.net/2015/05/28/science-is-not-science/",
  "scraped_at": "2025-12-16T12:57:19.979224",
  "title": "SCIENCE is not science",
  "date_display": "May 28, 2015",
  "date_iso": "2015-05-28T08:21:00+00:00",
  "date_from_url": "2015-05-28",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>Whatever happened to the idea that <a href=\"https://ricochet.com/scandal-political-science/\">science is self-correcting?</a></p><blockquote class=\"tr_bq\"><p> Over the past few days a scandal has begun to plague political science. A UCLA graduate student, Michael LaCour, appears to have faked a data set that was the basis for an article that he published in the highly prestigious journal <i>Science</i>. I have examined a second paper by LaCour. As I’ll explain, I’m convinced that it also is the product of faked results.</p><p>The <i>Science </i>article purportedly showed that personalized, door-to-door canvassing is effective at changing political views. LaCour and his co-author, Don Green of Columbia University, enlisted members of an LGBT organization at UCLA to contact voters who had earlier indicated on a survey that they opposed gay marriage. The article shows, based on follow-up surveys, that the LGBT door-to-door canvassing had a significant effect in shifting voters toward pro-gay-marriage views.</p><p>Two graduate students at UC Berkeley, however, had significant difficulties in replicating the study. They called the private firm that LaCour had supposedly enlisted to conduct his survey. The firm, however, said that it did not conduct such a survey. LaCour had also reported to the grad students the name of an employee of the survey firm with whom he worked. The firm, however, said that it had no records of such an employee ever working at the firm.</p><p>After confronting his coauthor, Green requested that <i>Science </i>retract the article. LaCour still stands by his results. <i>Science</i>, faced with this dilemma, has not (yet) retracted the paper.</p></blockquote><p>That pretty much settles the question of whether <i>Science </i>concerns scientody – the scientific method – or scientistry – the scientific profession. An “editorial expression of concern” is not sufficient. The study could not be replicated and there is evidence that the first study was not legitimate. Therefore, a reputable publication that was actually dedicated to scientody would retract the study immediately pending further evidence of its replicability. <i>Science </i>is observably not such a publication.</p><p>Especially when the man who developed the method that researcher utilized has come out very strongly against the legitimacy of LaCour’s work:</p><blockquote class=\"tr_bq\"><p> I think the bulk of the evidence suggests that LaCour faked at least some of the results of this second paper. Not only would I be willing to bet on this conclusion, I would be willing to give 10:1 odds on it. Still, I’m not certain, and I would be hesitant to give 100:1 odds. And I would refuse to give 1,000:1 odds.</p><p>Regardless, I am certain that LaCour faked the results of the original paper—the one published in <i>Science</i>. I predict that UCLA will refuse to award him a PhD, and I predict that Princeton will retract the assistant professorship that it offered him. I predict that UCLA or Princeton or both will conduct an investigation. I suspect that they will find that LaCour faked results in a few papers, not just one.</p></blockquote><p>But the most damning thing, as far as the credibility of Science goes, is this observation, <i>“It is very rare for political scientists to have our results mentioned alongside results from the “hard” sciences.”</i> So why, then, was this apparently fraudulent paper selected for such unusual publication in the first place?</p></div>",
  "content_text": "Whatever happened to the idea that\nscience is self-correcting?\nOver the past few days a scandal has begun to plague political science. A UCLA graduate student, Michael LaCour, appears to have faked a data set that was the basis for an article that he published in the highly prestigious journal\nScience\n. I have examined a second paper by LaCour. As I’ll explain, I’m convinced that it also is the product of faked results.\nThe\nScience\narticle purportedly showed that personalized, door-to-door canvassing is effective at changing political views. LaCour and his co-author, Don Green of Columbia University, enlisted members of an LGBT organization at UCLA to contact voters who had earlier indicated on a survey that they opposed gay marriage. The article shows, based on follow-up surveys, that the LGBT door-to-door canvassing had a significant effect in shifting voters toward pro-gay-marriage views.\nTwo graduate students at UC Berkeley, however, had significant difficulties in replicating the study. They called the private firm that LaCour had supposedly enlisted to conduct his survey. The firm, however, said that it did not conduct such a survey. LaCour had also reported to the grad students the name of an employee of the survey firm with whom he worked. The firm, however, said that it had no records of such an employee ever working at the firm.\nAfter confronting his coauthor, Green requested that\nScience\nretract the article. LaCour still stands by his results.\nScience\n, faced with this dilemma, has not (yet) retracted the paper.\nThat pretty much settles the question of whether\nScience\nconcerns scientody – the scientific method – or scientistry – the scientific profession. An “editorial expression of concern” is not sufficient. The study could not be replicated and there is evidence that the first study was not legitimate. Therefore, a reputable publication that was actually dedicated to scientody would retract the study immediately pending further evidence of its replicability.\nScience\nis observably not such a publication.\nEspecially when the man who developed the method that researcher utilized has come out very strongly against the legitimacy of LaCour’s work:\nI think the bulk of the evidence suggests that LaCour faked at least some of the results of this second paper. Not only would I be willing to bet on this conclusion, I would be willing to give 10:1 odds on it. Still, I’m not certain, and I would be hesitant to give 100:1 odds. And I would refuse to give 1,000:1 odds.\nRegardless, I am certain that LaCour faked the results of the original paper—the one published in\nScience\n. I predict that UCLA will refuse to award him a PhD, and I predict that Princeton will retract the assistant professorship that it offered him. I predict that UCLA or Princeton or both will conduct an investigation. I suspect that they will find that LaCour faked results in a few papers, not just one.\nBut the most damning thing, as far as the credibility of Science goes, is this observation,\n“It is very rare for political scientists to have our results mentioned alongside results from the “hard” sciences.”\nSo why, then, was this apparently fraudulent paper selected for such unusual publication in the first place?",
  "tags": [
    "media",
    "science"
  ],
  "categories": [],
  "sitemap_lastmod": "2015-05-28T07:21:00+00:00"
}