{
  "url": "https://voxday.net/2015/05/17/sexism-and-ideological-bias-in-science/",
  "scraped_at": "2025-12-16T12:56:07.993306",
  "title": "Sexism and ideological bias in science fiction",
  "date_display": "May 17, 2015",
  "date_iso": "2015-05-17T19:30:00+00:00",
  "date_from_url": "2015-05-17",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>Since we’re often informed by the SJWs how vital it is that more women are given awards on the basis of inclusivity, let’s begin with putting the facts out there. We already know, per Mike Glyer, that Hugos have been awarded to 19 conservative winners since 1996. I went through the list of <a href=\"http://www.thehugoawards.org/hugo-history/\">Hugo Awards by Year</a> and counted the number of women awarded, then counted the total number of awards given out. When more than one individual was awarded, I added the relevant percentage of that particular award (so one women in a group of four counted as 0.25, for example), and rounded up to a single decimal at the end.</p><p>2014: 9 of 17<br> 2013: 4.8 of 17<br> 2012: 8.8 of 17<br> 2011: 6 of 16<br> 2010: 2.8 of 16<br> 2009: 4.5 of 15<br> 2008: 1.3 of 14<br> 2007: 3 of 14<br> 2006: 3 of 13<br> 2005: 4.8 of 14<br> 2004: 4.7 of 13<br> 2003: 4 of 13<br> 2002: 1.5 of 13<br> 2001: 2 of 13<br> 2000: 1 of 12<br> 1999: 1 of 12<br> 1998: 0.5 of 12<br> 1997: 1.5 of 12<br> 1996: 1.5 of 13</br></br></br></br></br></br></br></br></br></br></br></br></br></br></br></br></br></br></p><p>TOTAL: 65.7 women have won 24.7 percent and 19 conservatives have won 7.1 percent of the 266 Hugo Awards given out since 1996. This is despite the fact that <a href=\"http://www.gallup.com/poll/180452/liberals-record-trail-conservatives.aspx\">conservatives outnumber liberals by a factor of 1.6 in the USA</a>, which means that conservatives are underrepresented by a factor of 11.3, versus women being underrepresented by a factor of 2.</p><p>Now, if the SJWs are to be believed, sexism is a serious problem but there is absolutely no evidence of left wing ideological bias. They keep repeating this despite the fact that the anti-right wing bias in science fiction is observably 5.6 times worse than the purported sexism about which they so often complain.</p><p>Which merely points us once more towards the truth of the lesson: SJWs always lie. And if the numbers aren’t enough to convince the more rhetorically minded, there is also a considerable quantity of anecdotal evidence of bias such as this comment from Martin Wisse:</p><blockquote class=\"tr_bq\"><p> To be honest, Worldcon fandom has been caught with its pants down by the Puppies, too slow to react to the first two attempts to game the Hugos. We all thought, and I was no exception, that after the Puppy nominees were trashed in the actual voting last year, the spoiled brats behind it would get the hint and fuck off.</p></blockquote><p>Well, not so much. But at least we all know how seriously to take their pose of inclusivity.</p></div>",
  "content_text": "Since we’re often informed by the SJWs how vital it is that more women are given awards on the basis of inclusivity, let’s begin with putting the facts out there. We already know, per Mike Glyer, that Hugos have been awarded to 19 conservative winners since 1996. I went through the list of\nHugo Awards by Year\nand counted the number of women awarded, then counted the total number of awards given out. When more than one individual was awarded, I added the relevant percentage of that particular award (so one women in a group of four counted as 0.25, for example), and rounded up to a single decimal at the end.\n2014: 9 of 17\n2013: 4.8 of 17\n2012: 8.8 of 17\n2011: 6 of 16\n2010: 2.8 of 16\n2009: 4.5 of 15\n2008: 1.3 of 14\n2007: 3 of 14\n2006: 3 of 13\n2005: 4.8 of 14\n2004: 4.7 of 13\n2003: 4 of 13\n2002: 1.5 of 13\n2001: 2 of 13\n2000: 1 of 12\n1999: 1 of 12\n1998: 0.5 of 12\n1997: 1.5 of 12\n1996: 1.5 of 13\nTOTAL: 65.7 women have won 24.7 percent and 19 conservatives have won 7.1 percent of the 266 Hugo Awards given out since 1996. This is despite the fact that\nconservatives outnumber liberals by a factor of 1.6 in the USA\n, which means that conservatives are underrepresented by a factor of 11.3, versus women being underrepresented by a factor of 2.\nNow, if the SJWs are to be believed, sexism is a serious problem but there is absolutely no evidence of left wing ideological bias. They keep repeating this despite the fact that the anti-right wing bias in science fiction is observably 5.6 times worse than the purported sexism about which they so often complain.\nWhich merely points us once more towards the truth of the lesson: SJWs always lie. And if the numbers aren’t enough to convince the more rhetorically minded, there is also a considerable quantity of anecdotal evidence of bias such as this comment from Martin Wisse:\nTo be honest, Worldcon fandom has been caught with its pants down by the Puppies, too slow to react to the first two attempts to game the Hugos. We all thought, and I was no exception, that after the Puppy nominees were trashed in the actual voting last year, the spoiled brats behind it would get the hint and fuck off.\nWell, not so much. But at least we all know how seriously to take their pose of inclusivity.",
  "tags": [
    "Hugo Award",
    "SJW"
  ],
  "categories": [],
  "sitemap_lastmod": "2015-05-17T18:30:00+00:00"
}