{
  "url": "https://voxday.net/2015/05/13/sjws-always-chea/",
  "scraped_at": "2025-12-16T12:55:36.886195",
  "title": "SJWs always cheat",
  "date_display": "May 13, 2015",
  "date_iso": "2015-05-13T23:56:00+00:00",
  "date_from_url": "2015-05-13",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>The Making Light SJWs are upset because Tor isn’t collecting its usual Hugo tribute for its predictably mediocre romances in space, sanctimonious PC space lectures, and red-hot necrobestials, so naturally they are lobbying hard to change the rules. WCJ <a href=\"https://bradrtorgersen.wordpress.com/2015/05/13/musings-not-sorted/#comment-12401\">points out what they’re up to</a>:</p><blockquote class=\"tr_bq\"><p> The method that the Making Light cabal used to evaluate these satisfaction formulae was to simulate elections using the different formulae and look at the outcome. They decided in advance which outcomes would be considered “satisfying:” those that closely replicate the 2013 Hugo shortlists given the known data from the 2013 ballot, and those that excluded or reduced the quantity of nominees of a hypothetical collection of Sad Puppy voters added to the simulations. A “satisfaction” function was regarded as good by the Making Light cabal if it answered positively to that criterion.</p><p>This isn’t just sinister, it’s diabolical. Because what they’re doing, quite literally, is defining “satisfaction” not to be YOUR satisfaction, but rather THEIR satisfaction. The function that is supposed to model your happiness as a voter was chosen by someone who is not you, based on criteria that were designed entirely for their benefit and not yours, without any reference whatsoever to your opinion.</p></blockquote><p>It’s vastly amusing that they are doing exactly what we predicted and are trying to change the rules even though no one has won anything yet. However, speaking as a game designer, I can tell you that there is absolutely nothing anyone can do about stopping intelligent exploits without a process that allows for dynamic responses. For example, let’s say they manage to ram through the 4/6 plan, whose author, Chris Gerrib, foolishly believes is somehow magically capable of preventing Rabid Puppies from locking the SJWs out of the awards again in the future.</p><p>The answer is entirely obvious. You didn’t seriously think there was no shadowy <i>purpose </i>behind the numbering of the minions, did you? Am I not your Supreme Dark Lord? And are you not entertained?</p></div>",
  "content_text": "The Making Light SJWs are upset because Tor isn’t collecting its usual Hugo tribute for its predictably mediocre romances in space, sanctimonious PC space lectures, and red-hot necrobestials, so naturally they are lobbying hard to change the rules. WCJ\npoints out what they’re up to\n:\nThe method that the Making Light cabal used to evaluate these satisfaction formulae was to simulate elections using the different formulae and look at the outcome. They decided in advance which outcomes would be considered “satisfying:” those that closely replicate the 2013 Hugo shortlists given the known data from the 2013 ballot, and those that excluded or reduced the quantity of nominees of a hypothetical collection of Sad Puppy voters added to the simulations. A “satisfaction” function was regarded as good by the Making Light cabal if it answered positively to that criterion.\nThis isn’t just sinister, it’s diabolical. Because what they’re doing, quite literally, is defining “satisfaction” not to be YOUR satisfaction, but rather THEIR satisfaction. The function that is supposed to model your happiness as a voter was chosen by someone who is not you, based on criteria that were designed entirely for their benefit and not yours, without any reference whatsoever to your opinion.\nIt’s vastly amusing that they are doing exactly what we predicted and are trying to change the rules even though no one has won anything yet. However, speaking as a game designer, I can tell you that there is absolutely nothing anyone can do about stopping intelligent exploits without a process that allows for dynamic responses. For example, let’s say they manage to ram through the 4/6 plan, whose author, Chris Gerrib, foolishly believes is somehow magically capable of preventing Rabid Puppies from locking the SJWs out of the awards again in the future.\nThe answer is entirely obvious. You didn’t seriously think there was no shadowy\npurpose\nbehind the numbering of the minions, did you? Am I not your Supreme Dark Lord? And are you not entertained?",
  "tags": [
    "ELoE",
    "Hugo Award",
    "SJW"
  ],
  "categories": [],
  "sitemap_lastmod": "2015-05-13T22:56:00+00:00"
}