{
  "url": "https://voxday.net/2015/05/23/sjws-always-lie_23/",
  "scraped_at": "2025-12-16T12:56:43.690931",
  "title": "SJWs always lie",
  "date_display": "May 23, 2015",
  "date_iso": "2015-05-23T08:23:00+00:00",
  "date_from_url": "2015-05-23",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>It’s as if they have to constantly spin false narratives or they’ll stop breathing”<br/></p><blockquote class=\"tr_bq\"><div class=\"comment-author vcard\"> Glenn Hauman on <a href=\"http://file770.com/?p=22668&amp;cpage=1#comment-267311\">May 23, 2015 at 12:37 am</a> said:</div><p>At least Mr. Beale isn’t claiming I’m calling for false reviews anymore, though he still hasn’t retracted that statement.</p></blockquote><p>I am absolutely claiming that Glenn Hauman has called and is still calling for false reviews of certain works to be posted on Amazon. He has publicly, and disingenuously, called for them twice now.  Ten negative reviews, at least five of them confirmed by the reviewer to be false, have now been posted, some by his known associates. Mr. Hauman is either lying or woefully mistaken when he says I am not claiming that he’s calling for false reviews anymore.</p><p>This is standard SJW behavior. They say something in a passive-aggressive, plausibly deniable manner that they expect others to interpret in a certain way and act accordingly. This is why they are always talking about “dog whistles”; that is how they communicate amongst themselves.</p><p>Then, when criticized for the very consequences they intended, they deny having done what they did, reject all responsibility for the consequences of their words, and insist that everyone accept the false narrative of the disconnect between their call to action and the subsequent actions.</p><p>Hauman points out that he said people should read the various Puppy works before the reviewers “put them down”, but some of the reviewers didn’t, by their own admission, read them, nor did Hauman give a damn whether they did or not. His objective was for the Puppy works to receive negative reviews, which they subsequently received. Mission accomplished. The pretense the SJW attempts to maintain is usually a childishly transparent one, and it both confuses and alarms them when one simply ignores the verbal fog of nominal “plausibility” with which they try to preemptively defend themselves and focuses on the intention and the effect.</p><p>As, one notes, the justice system likewise does. No drug dealer has ever escaped conviction because he said “melons and cantaloupes” in the place of marijuana and cocaine when wire-tapped. What he said may be true, but it is irrelevant. His intentions are best judged by the response to the words, and not the words themselves.</p><p>The reason we know it is disingenuousness and dishonesty and not an inability to connect cause-and-effect is that SJWs are not similarly inclined to respect <i>genuine</i> deniability whenever they are accusing someone of one of the many isms they wield as weapons to DISQUALIFY. In fact, SJWs regularly claim the ability to read minds and discern intentions even when there are no actual consequences to observe.</p><p>Don’t ever take an SJW’s spun narrative at face value. That’s exactly what they expect you to do; that’s exactly what they <i>need </i>you to do. Punch through it and expose them. You can be sure that the narrative will be false <i>because SJWs always lie.</i></p><p>Speaking of which, these two false narratives are excellent examples:</p><blockquote class=\"tr_bq\"><p> <b>Stevie on May 22, 2015 at 7:24 pm said:</b><br> One thing you will discover is that the canine conspirators are now in total disarray, because the Sads didn’t realise that they would be Shanghaid by the Rabids. Equally, the Rabids are in total disarray because Beale really thought he was going to be treated as an entrepreneurial mastermind by the WSJ and therefore was completely blindsided when the WSJ laughed at him. In other words, all they’ve got left is to be as destructive as possible, and do their best to make everyone else miserable.</br></p><p><b>Chris Hensley on May 22, 2015 at 7:37 pm said:</b><br> <i>“Equally, the Rabids are in total disarray because Beale really thought he was going to be treated as an entrepreneurial mastermind by the WSJ and therefore was completely blindsided when the WSJ laughed at him.” </i></br></p><p>All the while Vox Day is screaming “Why are you running? We have them right where we want them!”</p></blockquote><p>Are you in total disarray, Rabid Puppies? As for the idea that I was “completely blindsided” by Michael Rappoport’s article in the Wall Street Journal, this is exactly what I wrote to the Evil Legion of Evil about it two weeks before it ran: <i>“Wall Street Journal piece coming soon, possibly tomorrow. Strangely enough, they didn’t even ask me if I hate black lesbians or kick kittens. It will probably be moderately against us, in my opinion. He wasn’t<br> hostile, but he played “devil’s advocate”, in his own words, several<br> times.”</br></br></i></p><p><a href=\"http://www.milobookclub.com/wp-content/uploads/2015/05/Barnett-Scalzi_tweets.jpg\" imageanchor=\"1\" style=\"clear: right; float: right; margin-bottom: 1em; margin-left: 1em;\"><img border=\"0\" decoding=\"async\" fetchpriority=\"high\" height=\"320\" src=\"http://www.milobookclub.com/wp-content/uploads/2015/05/Barnett-Scalzi_tweets.jpg\" width=\"276\"/></a>I was, of course, under absolutely no illusions that the piece would have anything to do with entrepreneurship or my being a mastermind of any kind for the obvious reason that I actually talked to the reporter for about ten minutes. Not only were his questions mildly accusatory in nature, but the fact that he was also talking with two people who had nothing to do with the story, George Martin and John Scalzi, was sufficient to tell me which way he was going to spin it. As in fact, turned out to be the case. But the tone of the article was considerably less poisonous than the <i>Entertainment Weekly</i>, <i>Guardian</i>, and <i>Popular Science</i> stories that were planted by the Torlings. Which was nice, and I also noticed that the comments on the WSJ web site ran about 10-1 in our favor.</p><p><a href=\"http://www.milobookclub.com/wp-content/uploads/2015/05/@davidbarnett.png\" imageanchor=\"1\" style=\"clear: left; float: left; margin-bottom: 1em; margin-right: 1em;\"><noscript><img border=\"0\" decoding=\"async\" height=\"191\" src=\"http://www.milobookclub.com/wp-content/uploads/2015/05/@davidbarnett.png\" width=\"320\"/></noscript><img border=\"0\" class=\"lazyload\" data-src=\"http://www.milobookclub.com/wp-content/uploads/2015/05/@davidbarnett.png\" decoding=\"async\" height=\"191\" src=\"data:image/svg+xml,%3Csvg%20xmlns=%22http://www.w3.org/2000/svg%22%20viewBox=%220%200%20320%20191%22%3E%3C/svg%3E\" width=\"320\"/></a>As for the clueless wonders at File 770 who don’t understand how the Torlings plant stories in the mainstream media, they should look at <a href=\"http://www.amazon.com/Gideon-Smith-Mechanical-David-Barnett/dp/0765334240\">who publishes</a> the authors of some of those “journo things”. </p></div>",
  "content_text": "It’s as if they have to constantly spin false narratives or they’ll stop breathing”\nGlenn Hauman on\nMay 23, 2015 at 12:37 am\nsaid:\nAt least Mr. Beale isn’t claiming I’m calling for false reviews anymore, though he still hasn’t retracted that statement.\nI am absolutely claiming that Glenn Hauman has called and is still calling for false reviews of certain works to be posted on Amazon. He has publicly, and disingenuously, called for them twice now.  Ten negative reviews, at least five of them confirmed by the reviewer to be false, have now been posted, some by his known associates. Mr. Hauman is either lying or woefully mistaken when he says I am not claiming that he’s calling for false reviews anymore.\nThis is standard SJW behavior. They say something in a passive-aggressive, plausibly deniable manner that they expect others to interpret in a certain way and act accordingly. This is why they are always talking about “dog whistles”; that is how they communicate amongst themselves.\nThen, when criticized for the very consequences they intended, they deny having done what they did, reject all responsibility for the consequences of their words, and insist that everyone accept the false narrative of the disconnect between their call to action and the subsequent actions.\nHauman points out that he said people should read the various Puppy works before the reviewers “put them down”, but some of the reviewers didn’t, by their own admission, read them, nor did Hauman give a damn whether they did or not. His objective was for the Puppy works to receive negative reviews, which they subsequently received. Mission accomplished. The pretense the SJW attempts to maintain is usually a childishly transparent one, and it both confuses and alarms them when one simply ignores the verbal fog of nominal “plausibility” with which they try to preemptively defend themselves and focuses on the intention and the effect.\nAs, one notes, the justice system likewise does. No drug dealer has ever escaped conviction because he said “melons and cantaloupes” in the place of marijuana and cocaine when wire-tapped. What he said may be true, but it is irrelevant. His intentions are best judged by the response to the words, and not the words themselves.\nThe reason we know it is disingenuousness and dishonesty and not an inability to connect cause-and-effect is that SJWs are not similarly inclined to respect\ngenuine\ndeniability whenever they are accusing someone of one of the many isms they wield as weapons to DISQUALIFY. In fact, SJWs regularly claim the ability to read minds and discern intentions even when there are no actual consequences to observe.\nDon’t ever take an SJW’s spun narrative at face value. That’s exactly what they expect you to do; that’s exactly what they\nneed\nyou to do. Punch through it and expose them. You can be sure that the narrative will be false\nbecause SJWs always lie.\nSpeaking of which, these two false narratives are excellent examples:\nStevie on May 22, 2015 at 7:24 pm said:\nOne thing you will discover is that the canine conspirators are now in total disarray, because the Sads didn’t realise that they would be Shanghaid by the Rabids. Equally, the Rabids are in total disarray because Beale really thought he was going to be treated as an entrepreneurial mastermind by the WSJ and therefore was completely blindsided when the WSJ laughed at him. In other words, all they’ve got left is to be as destructive as possible, and do their best to make everyone else miserable.\nChris Hensley on May 22, 2015 at 7:37 pm said:\n“Equally, the Rabids are in total disarray because Beale really thought he was going to be treated as an entrepreneurial mastermind by the WSJ and therefore was completely blindsided when the WSJ laughed at him.”\nAll the while Vox Day is screaming “Why are you running? We have them right where we want them!”\nAre you in total disarray, Rabid Puppies? As for the idea that I was “completely blindsided” by Michael Rappoport’s article in the Wall Street Journal, this is exactly what I wrote to the Evil Legion of Evil about it two weeks before it ran:\n“Wall Street Journal piece coming soon, possibly tomorrow. Strangely enough, they didn’t even ask me if I hate black lesbians or kick kittens. It will probably be moderately against us, in my opinion. He wasn’t\nhostile, but he played “devil’s advocate”, in his own words, several\ntimes.”\nI was, of course, under absolutely no illusions that the piece would have anything to do with entrepreneurship or my being a mastermind of any kind for the obvious reason that I actually talked to the reporter for about ten minutes. Not only were his questions mildly accusatory in nature, but the fact that he was also talking with two people who had nothing to do with the story, George Martin and John Scalzi, was sufficient to tell me which way he was going to spin it. As in fact, turned out to be the case. But the tone of the article was considerably less poisonous than the\nEntertainment Weekly\n,\nGuardian\n, and\nPopular Science\nstories that were planted by the Torlings. Which was nice, and I also noticed that the comments on the WSJ web site ran about 10-1 in our favor.\nAs for the clueless wonders at File 770 who don’t understand how the Torlings plant stories in the mainstream media, they should look at\nwho publishes\nthe authors of some of those “journo things”.",
  "tags": [
    "SJW"
  ],
  "categories": [],
  "sitemap_lastmod": "2015-05-23T07:23:00+00:00"
}