{
  "url": "https://voxday.net/2015/05/02/sjws-always-lie-2/",
  "scraped_at": "2025-12-16T12:54:22.614730",
  "title": "SJWs always lie",
  "date_display": "May 2, 2015",
  "date_iso": "2015-05-02T13:00:00+00:00",
  "date_from_url": "2015-05-02",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p><i>“Being a “social justice warrior” means I get to read (and incidentally,<br> vote for on award ballots) what I want, rather than waiting to be told<br> by someone else what I should like and what I shouldn’t.”</br></br></i><br>  – John Scalzi, 1 May 2015</br></p><p>Actually, that’s almost exactly the opposite of what it means to be an SJW. That sounds considerably more like a #GamerGate position, which McRapey vehemently opposes.</p><p>Translation: Johnny Con knows he’s on the losing side and he’s trying to run his “make nice” routine. Yep.</p><p><i>“You’ll note I’m addressing Mr. Ringo’s argument here and not Mr.<br> Ringo himself. He and I get on tolerably well as humans. Do likewise,<br> please.<b> </b>Likewise, avoid gratuitous slamming of Baen,<br> please. This all is less about the publisher itself than it is about the<br> publisher being used as a stand-in for a particular worldview, which it<br> (or its individual employees or authors) may or may not endorse.”</br></br></br></br></br></i><br>   – John Scalzi, 1 May 2015</br></p><p><i>“I think both Toni Weisskopf and Jim Minz are eminently worthy of Hugo<br> Award editor nominations; I regret the presence of the slates makes the<br> argument of their consideration more complicated for so many people.”</br></br></i><br>    – John Scalzi, 1 May 2015</br></p><p>Contrast with this:</p><blockquote class=\"tr_bq\"><p> When Ms. Weisskopf addresses the Baen true faithful like this (as she<br> does both in the Baen’s Bar and on the site of Ms. Hoyt, a Baen author),<br> aside from anything else she’s doing, she’s engaging in the laudable<br> tactic of binding — or rebinding — her company’s host to her company’s<br> product: <i>Baen fans are the real science fiction fans, and real science fiction fans want real science fiction, which comes from Baen</i>. It’s a nice bit of commercial epistemic closure. So good job, Ms. Weisskopf.</br></br></br></br></p><p>Ms. Weisskopf’s unilateral attempt to establish fans of her publishing house as the One True Church, with Heinlein as its graven image, is flat out wrong. Not only are they not the One True Church, they don’t even get Robert Heinlein to themselves. They have to timeshare him with me and with many other fans who love his work, see him as an influence, and at the same time are happy to welcome anyone who wants to be part of the science fiction and fantasy community into the fold, no matter how they got there. Try to take Robert Heinlein from me, guys. See where that gets you. He’s not yours alone. You can’t gatekeep him from me.</p><p>Likewise, Ms. Weisskopf’s handwringing about what should be done about the interlopers and heretics incorrectly arrogates to her little group the ability to make any sort of decision on the matter. They can’t. Baen is not, in fact, the core of science fiction and fantasy; people who identify as Baen fans are not the only “real” science fiction and fantasy fans.  <br> – John Scalzi, 11 March, 2014</br></p></blockquote><p> Yeah, I tend to doubt she’s likely to buy it, Johnny Con. And “tolerably well as humans” should be translated as “John Ringo regards me with contempt, but I’m not done trying to suck up to him yet.”</p><p>And then there is, as usual, this:<i> “Pretty sure that’s not the reason as far as regards Beale. I think his problem is straight-up envy.”</i></p><p>Mm-hmmm. Keep telling yourself that, Johnny. Perhaps one day you’ll even start to believe it.<i> </i></p></div>",
  "content_text": "“Being a “social justice warrior” means I get to read (and incidentally,\nvote for on award ballots) what I want, rather than waiting to be told\nby someone else what I should like and what I shouldn’t.”\n– John Scalzi, 1 May 2015\nActually, that’s almost exactly the opposite of what it means to be an SJW. That sounds considerably more like a #GamerGate position, which McRapey vehemently opposes.\nTranslation: Johnny Con knows he’s on the losing side and he’s trying to run his “make nice” routine. Yep.\n“You’ll note I’m addressing Mr. Ringo’s argument here and not Mr.\nRingo himself. He and I get on tolerably well as humans. Do likewise,\nplease.\nLikewise, avoid gratuitous slamming of Baen,\nplease. This all is less about the publisher itself than it is about the\npublisher being used as a stand-in for a particular worldview, which it\n(or its individual employees or authors) may or may not endorse.”\n– John Scalzi, 1 May 2015\n“I think both Toni Weisskopf and Jim Minz are eminently worthy of Hugo\nAward editor nominations; I regret the presence of the slates makes the\nargument of their consideration more complicated for so many people.”\n– John Scalzi, 1 May 2015\nContrast with this:\nWhen Ms. Weisskopf addresses the Baen true faithful like this (as she\ndoes both in the Baen’s Bar and on the site of Ms. Hoyt, a Baen author),\naside from anything else she’s doing, she’s engaging in the laudable\ntactic of binding — or rebinding — her company’s host to her company’s\nproduct:\nBaen fans are the real science fiction fans, and real science fiction fans want real science fiction, which comes from Baen\n. It’s a nice bit of commercial epistemic closure. So good job, Ms. Weisskopf.\nMs. Weisskopf’s unilateral attempt to establish fans of her publishing house as the One True Church, with Heinlein as its graven image, is flat out wrong. Not only are they not the One True Church, they don’t even get Robert Heinlein to themselves. They have to timeshare him with me and with many other fans who love his work, see him as an influence, and at the same time are happy to welcome anyone who wants to be part of the science fiction and fantasy community into the fold, no matter how they got there. Try to take Robert Heinlein from me, guys. See where that gets you. He’s not yours alone. You can’t gatekeep him from me.\nLikewise, Ms. Weisskopf’s handwringing about what should be done about the interlopers and heretics incorrectly arrogates to her little group the ability to make any sort of decision on the matter. They can’t. Baen is not, in fact, the core of science fiction and fantasy; people who identify as Baen fans are not the only “real” science fiction and fantasy fans.\n– John Scalzi, 11 March, 2014\nYeah, I tend to doubt she’s likely to buy it, Johnny Con. And “tolerably well as humans” should be translated as “John Ringo regards me with contempt, but I’m not done trying to suck up to him yet.”\nAnd then there is, as usual, this:\n“Pretty sure that’s not the reason as far as regards Beale. I think his problem is straight-up envy.”\nMm-hmmm. Keep telling yourself that, Johnny. Perhaps one day you’ll even start to believe it.",
  "tags": [
    "McRapey",
    "SJW"
  ],
  "categories": [],
  "sitemap_lastmod": "2015-05-02T12:00:00+00:00"
}