{
  "url": "https://voxday.net/2015/05/19/sjws-eat-their-own/",
  "scraped_at": "2025-12-16T12:56:17.532724",
  "title": "SJWs eat their own",
  "date_display": "May 19, 2015",
  "date_iso": "2015-05-19T09:53:00+00:00",
  "date_from_url": "2015-05-19",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>There is a wonderful scene in Garrison Keillor’s <i>Wobegon Boy</i> when the protagonist, a true red SJW who runs a public radio station at a private university, returns from a conference where he received an award for excellence in public broadcasting to learn that the women who report to him have turned on him and are accusing him of sexism in order to oust him from his position as the station manager. Led by his secretary, a card-carrying member of Wounded Daughters of Distant Fathers, they plant a story in the local media prior to taking their manufactured complaints about him to the university administration.</p><p><i>The reporter was Sandra Welles, who had called me the day after my dinner with Jean. The story was a real torpedo… It said that I had “a problem” with assertive women, being from the Midwest, and that I tried to “psychologically seduce” women in meetings and charm my way around them. I had paternalized the decision structure and made women afraid to speak up….</i></p><p><i>My heart sank. These slanders had come from people who knew me. They worked at WSJO and had come to my house and drunk my wine and eaten my Chinese spareribs…. Why would people be so angry and bitter toward me? I had built this station from the ground up and had managed it reasonably well, and what was their beef?</i></p><p>Their beef, of course, was that said protagonist, John Tollefson, was a white man from the Midwest who played white male classical music at the station he built and managed. Ergo, he had to go in order to make way for the station’s transformation into a vehicle for social justice and women’s issues. After his ouster has been successfully orchestrated and is all but complete, Tollefson reflects on what will happen to the station, but like a good SJW, he completely fails to learn anything from his experience.</p><p><i>I sat in bed, drinking water and gazing out at the snowy backyard and thinking about the radio station and Dean Baird. In a few months, WJSO would change over, from classical music to talk: the Gay-Lesbian Parenting Hour at one P.M. and the Men Dealing with Impotence Hour at one-fifteen, the Hearing Impaired Hour at one-thirty, Wounded Nephews of Distant Uncles at one forty-five, People in Grief for Former Lovers at two, the Herpes Hour at two-fifteen, People in Search of Closure at two-thirty – each with its own smug host and tiny clientele, its own style of vacuity – and should I fight this? No, I did not think so.</i></p><p>This seemed apt in light of the recent SJW declaration of disavowal of George R.R. Martin, who has gone from repeatedly attacking the wintery, chaotic evil of the Rabid Puppies and Vox Day <a href=\"http://grrm.livejournal.com/427713.html\">to refusing to talk</a> about <a href=\"http://www.themarysue.com/we-will-no-longer-be-promoting-hbos-game-of-thrones/\">the feminist attacks on him</a> and his television show.</p><blockquote class=\"tr_bq\"><p> I am getting a flood of emails and off-topic comments on this blog about<br> tonight’s episode of GAME OF THRONES.  It’s not unanticipated. The<br> comments… regardless of tone… have been deleted.  I have been<br> saying since season one that this is not the place to debate or discuss<br> the TV series.  Please respect that….</br></br></br></br></p><p>There has seldom been any TV series as faithful to its source material, by and large (if you doubt that, talk to the Harry Dresden fans, or readers of the Sookie Stackhouse novels, or the fans of the original WALKING DEAD comic books)… but the longer the show goes on, the bigger the butterflies become. And now we have reached the point where the beat of butterfly wings is stirring up storms, like the one presently engulfing my email.</p><p>Prose and television have different strengths, different weaknesses, different requirements.</p><p>David and Dan and Bryan and HBO are trying to make the best television series that they can.</p><p>And over here I am trying to write the best novels that I can.</p><p>And yes, more and more, they differ. Two roads diverging in the dark of the woods, I suppose… but all of us are still intending that at the end we will arrive at the same place.</p><p>In the meantime, we hope that the readers and viewers both enjoy the journey. Or journeys, as the case may be. Sometimes butterflies grow into dragons.</p><p>((I am closing comments on this post. Take your discussions to the other sites I have mentioned….)</p></blockquote><p>They’re just doing the best they can, people! Translation: “Please stop hitting me! Also, please go away and leave me alone.” What a complete fucking coward! Whatever happened to all that “debate and honest dialogue” for which you were calling, George? I also enjoy his resort to the patented Sam Harris Defense, in which the ex post facto claim of having anticipated a response is considered tantamount to rebutting it.</p><p>Keep in mind that <i>Wobegon Boy</i> was published in 1997. SJW women turning on the white men in their midst is nothing new, and yet every Tollefson and Martin and Scalzi and Sanford and Hines believes it can’t possibly happen to them because their little SJW hearts are pure.</p></div>",
  "content_text": "There is a wonderful scene in Garrison Keillor’s\nWobegon Boy\nwhen the protagonist, a true red SJW who runs a public radio station at a private university, returns from a conference where he received an award for excellence in public broadcasting to learn that the women who report to him have turned on him and are accusing him of sexism in order to oust him from his position as the station manager. Led by his secretary, a card-carrying member of Wounded Daughters of Distant Fathers, they plant a story in the local media prior to taking their manufactured complaints about him to the university administration.\nThe reporter was Sandra Welles, who had called me the day after my dinner with Jean. The story was a real torpedo… It said that I had “a problem” with assertive women, being from the Midwest, and that I tried to “psychologically seduce” women in meetings and charm my way around them. I had paternalized the decision structure and made women afraid to speak up….\nMy heart sank. These slanders had come from people who knew me. They worked at WSJO and had come to my house and drunk my wine and eaten my Chinese spareribs…. Why would people be so angry and bitter toward me? I had built this station from the ground up and had managed it reasonably well, and what was their beef?\nTheir beef, of course, was that said protagonist, John Tollefson, was a white man from the Midwest who played white male classical music at the station he built and managed. Ergo, he had to go in order to make way for the station’s transformation into a vehicle for social justice and women’s issues. After his ouster has been successfully orchestrated and is all but complete, Tollefson reflects on what will happen to the station, but like a good SJW, he completely fails to learn anything from his experience.\nI sat in bed, drinking water and gazing out at the snowy backyard and thinking about the radio station and Dean Baird. In a few months, WJSO would change over, from classical music to talk: the Gay-Lesbian Parenting Hour at one P.M. and the Men Dealing with Impotence Hour at one-fifteen, the Hearing Impaired Hour at one-thirty, Wounded Nephews of Distant Uncles at one forty-five, People in Grief for Former Lovers at two, the Herpes Hour at two-fifteen, People in Search of Closure at two-thirty – each with its own smug host and tiny clientele, its own style of vacuity – and should I fight this? No, I did not think so.\nThis seemed apt in light of the recent SJW declaration of disavowal of George R.R. Martin, who has gone from repeatedly attacking the wintery, chaotic evil of the Rabid Puppies and Vox Day\nto refusing to talk\nabout\nthe feminist attacks on him\nand his television show.\nI am getting a flood of emails and off-topic comments on this blog about\ntonight’s episode of GAME OF THRONES.  It’s not unanticipated. The\ncomments… regardless of tone… have been deleted.  I have been\nsaying since season one that this is not the place to debate or discuss\nthe TV series.  Please respect that….\nThere has seldom been any TV series as faithful to its source material, by and large (if you doubt that, talk to the Harry Dresden fans, or readers of the Sookie Stackhouse novels, or the fans of the original WALKING DEAD comic books)… but the longer the show goes on, the bigger the butterflies become. And now we have reached the point where the beat of butterfly wings is stirring up storms, like the one presently engulfing my email.\nProse and television have different strengths, different weaknesses, different requirements.\nDavid and Dan and Bryan and HBO are trying to make the best television series that they can.\nAnd over here I am trying to write the best novels that I can.\nAnd yes, more and more, they differ. Two roads diverging in the dark of the woods, I suppose… but all of us are still intending that at the end we will arrive at the same place.\nIn the meantime, we hope that the readers and viewers both enjoy the journey. Or journeys, as the case may be. Sometimes butterflies grow into dragons.\n((I am closing comments on this post. Take your discussions to the other sites I have mentioned….)\nThey’re just doing the best they can, people! Translation: “Please stop hitting me! Also, please go away and leave me alone.” What a complete fucking coward! Whatever happened to all that “debate and honest dialogue” for which you were calling, George? I also enjoy his resort to the patented Sam Harris Defense, in which the ex post facto claim of having anticipated a response is considered tantamount to rebutting it.\nKeep in mind that\nWobegon Boy\nwas published in 1997. SJW women turning on the white men in their midst is nothing new, and yet every Tollefson and Martin and Scalzi and Sanford and Hines believes it can’t possibly happen to them because their little SJW hearts are pure.",
  "tags": [
    "SJW"
  ],
  "categories": [],
  "sitemap_lastmod": "2015-05-19T08:53:00+00:00"
}