{
  "url": "https://voxday.net/2015/05/09/sjws-attack-open-source-software/",
  "scraped_at": "2025-12-16T12:55:09.995260",
  "title": "SJWs attack Open Source Software",
  "date_display": "May 9, 2015",
  "date_iso": "2015-05-09T16:54:00+00:00",
  "date_from_url": "2015-05-09",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>Paging ESR… paging ESR… ERS, please report with your weapons loaded. We have an SJW breach in OSS. #OSSGATE operatives, please report to your activation nodes.</p><blockquote class=\"tr_bq\"><p> 8 May 2015 Eve Braun (<a href=\"mailto:eve.t.braun@gmail.com\">eve.t.braun@gmail.com</a>) wrote: Two other things we implemented which aided the recruitment<br> process:</br></p><p>We followed advice which is quickly becoming the industry<br> norm. Never look at someones Github profile until you have made the<br> decision to hire or not hire them and do not let it influence you.<br> Github profiles tend to favor CIS White men over most minorities in<br> a number of ways. CIS white men often have more spare time or chose<br> to pursue building up an impressive portfolio of code rather than<br> women or minorities who have to deal with things like raising<br> children or instiutionalised racism. Some in the SocJus community<br> have even said that technically companies could possibly even be<br> breaking discriminatory law by allowing peoples github profiles and<br> publicly available code to influence their hiring decisions – watch<br> this space.</br></br></br></br></br></br></br></br></br></br></br></p><p>(More info: <a href=\"http://www.ashedryden.com/blog/the-ethics-of-unpaid-labor-and-the-oss-community\">http://www.ashedryden.com/blog/the-ethics-of-unpaid-labor-and-the-oss-community</a>)</p><p>We used Randi Harper’s (<a href=\"https://twitter.com/freebsdgirl\">https://twitter.com/freebsdgirl</a>)<br> blockbot to assess applicants twitter profiles for problematic or<br> toxic viewpoints. This may sound a bit extreme but some of the<br> staff here suffer from Aspergers &amp; PTSD and our top priority is<br> to ensure that they don’t get put in triggering situations.Making a<br> wrong hire could present a scenario where the employee could be<br> triggered on a daily basis by another employee with an oppressive<br> viewpoint. Other than from a diversity standpoint, from a business<br> standpoint these sorts of negative interactions can cost a company<br> a huge amount of time &amp; money in employees taking off sick<br> days. When all the employees are on the same page the synergy in<br> the office aids productivity.</br></br></br></br></br></br></br></br></br></br></br></p></blockquote><p>Still think the anti-SJW crusade is an overreaction? There is only one answer to them, only one cure: relentless rejection. Look to #GamerGate and #SadPuppies for inspiration and ideas on how to push them back.</p><div> <br> Notice that the SJW Eve Braun is trying to make a corporate virtue out of saving company time and money by not hiring “CIS white men with “problematic or toxic viewpoints”. Of course, SJWs always lie.</br></div></div>",
  "content_text": "Paging ESR… paging ESR… ERS, please report with your weapons loaded. We have an SJW breach in OSS. #OSSGATE operatives, please report to your activation nodes.\n8 May 2015 Eve Braun (\neve.t.braun@gmail.com\n) wrote: Two other things we implemented which aided the recruitment\nprocess:\nWe followed advice which is quickly becoming the industry\nnorm. Never look at someones Github profile until you have made the\ndecision to hire or not hire them and do not let it influence you.\nGithub profiles tend to favor CIS White men over most minorities in\na number of ways. CIS white men often have more spare time or chose\nto pursue building up an impressive portfolio of code rather than\nwomen or minorities who have to deal with things like raising\nchildren or instiutionalised racism. Some in the SocJus community\nhave even said that technically companies could possibly even be\nbreaking discriminatory law by allowing peoples github profiles and\npublicly available code to influence their hiring decisions – watch\nthis space.\n(More info:\nhttp://www.ashedryden.com/blog/the-ethics-of-unpaid-labor-and-the-oss-community\n)\nWe used Randi Harper’s (\nhttps://twitter.com/freebsdgirl\n)\nblockbot to assess applicants twitter profiles for problematic or\ntoxic viewpoints. This may sound a bit extreme but some of the\nstaff here suffer from Aspergers & PTSD and our top priority is\nto ensure that they don’t get put in triggering situations.Making a\nwrong hire could present a scenario where the employee could be\ntriggered on a daily basis by another employee with an oppressive\nviewpoint. Other than from a diversity standpoint, from a business\nstandpoint these sorts of negative interactions can cost a company\na huge amount of time & money in employees taking off sick\ndays. When all the employees are on the same page the synergy in\nthe office aids productivity.\nStill think the anti-SJW crusade is an overreaction? There is only one answer to them, only one cure: relentless rejection. Look to #GamerGate and #SadPuppies for inspiration and ideas on how to push them back.\nNotice that the SJW Eve Braun is trying to make a corporate virtue out of saving company time and money by not hiring “CIS white men with “problematic or toxic viewpoints”. Of course, SJWs always lie.",
  "tags": [
    "SJW",
    "technology"
  ],
  "categories": [],
  "sitemap_lastmod": "2015-05-09T15:54:00+00:00"
}