{
  "url": "https://voxday.net/2015/05/05/smells-like-success/",
  "scraped_at": "2025-12-16T12:54:41.207318",
  "title": "Smells like success",
  "date_display": "May 5, 2015",
  "date_iso": "2015-05-05T11:01:00+00:00",
  "date_from_url": "2015-05-05",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p><a href=\"http://theinferior4.livejournal.com/978471.html\">This review of “Turncoat”</a> by Steve Rzasa precisely underlines the central point made by the Sad Puppies campaign and single-handedly serves to justify it:</p><blockquote class=\"tr_bq\"><p> I’m going to start with short stories, because they’re, well, short, and with the last story on the ballot and then work my way up.  So the first story is “Turncoat,” by Steve Rzasa. A sentient warship and some post-humans are battling against another group, people who have decided not to make the jump to post-humanity.  The warship goes from being annoyed at the messy, pesky humans to championing them (though I’m not sure where in the story this switch occurs) and defects at the end, bringing along with it (him? her?) its superior hardware and some useful intel about the other side.</p><p>I’m going to take a slight detour here, though I promise I’ll get back to the review soon.  When I was in high school I did or said something that got me sent to detention, a closet-sized room where, oddly, someone had left a stack of Analogs.  I had just started reading science fiction, and of course my first  thought was, Is this supposed to be punishment?</p><p>But I ended up not really liking most of the stories.  They emphasized hardware, and not even interesting hardware.  The characters were cardboard, the stories predictable (partly because they all ended with humanity triumphing), the style ranged from serviceable to really pretty bad.</p><p>This was late-period John Campbell I’m talking about.  (Yes, I’m old.)  I will stipulate that the guy did some good things for sf in his prime, but something had happened along the way, some hardening of attitudes and an inability to tell when a story had gone bad.  Humanity had to be shown to triumph in every story, for example, to be superior to anything thrown against it, which pretty much let the air out of any balloon of tension.</p><p>So, as I hope I’ve made clear, when I say “Turncoat” is a perfectly adequate late-period Campbellian story I don’t mean it as a compliment.  You can’t even say the characters are cardboard, since there are no characters, just a warship that, for the most part, proceeds along strict logical lines.  There’s no one to like, or even hate, no one to identify with or root for, nothing at stake for the reader.</p><p>But think about everything that’s happened since Campbell.  The New Wave (does anyone remember the New Wave?  Yes, I’m old), feminism, cyberpunk, counter-cyberpunk, a fresh infusion of writers who are not white or straight or able-bodied.  This would have been an average story in the late sixties, but now, nearly fifty years later, it’s stale and dated.</p><p>Rzasa hasn’t even caught up with the second of these new categories.  “Our founders were the men who…”  “Posthuman Man…” “Not content with setting Man on his new evolutionary path…”  After <i>Ancillary Justice</i> — hell, after <i>The Left Hand of Darkness</i> — this reads very oddly.</p></blockquote><p> Now consider Castalia House’s mission statement:</p><p><i>“The books that we publish honor the traditions and intellectual<br> authenticity exemplified by writers such as J.R.R. Tolkien, C.S. Lewis,<br> Robert E. Howard, G.K. Chesterton, and Hermann Hesse. We are consciously<br> providing an alternative to readers who increasingly feel alienated<br> from the nihilistic, dogmatic science fiction and fantasy being<br> published today. We seek nothing less than a Campbellian revolution in<br> genre literature.”</br></br></br></br></br></br></i></p><p>That review is supposed to be a negative one, but it sure sounds to me as if we’re on the right track. Now consider these three reviews, the first two from SJWs, the second from a neutral party.<br> <a name=\"more\"></a><br> Daveon on May 4, 2015 at 11:46 am said:</br></br></p><blockquote class=\"tr_bq\"><p> I hated Turncoat – compared to how Iain Banks, Neal Asher, Peter Hamilton write sentient battleships and describe space warfare it was unbearable, then there were lines like ‘the men who…’ versus ‘the people who’ really jarred against me – it felt like a story written about AIs written by somebody who has ignored any progress in fiction, computing and so forth in 20 years. The opening battle scene at the start of The Reality Dysfunction is better than Turncoat in every way, and that was written in 1996.</p></blockquote><p>I found that to be rather amusing, considering how spectacularly boring Iain Banks’s space battles are. But considering that Daveon hates Sad Puppies and hates Rabid Puppies, how surprising is it that he – mirabile dictu – just happens to hate “Turncoat” as well? Another SJW <a href=\"https://sfkittens.wordpress.com/2015/05/03/turncoat-by-steve-rzasa/\">posted a similar review</a>:</p><blockquote class=\"tr_bq\"><p> In the story, an artificial intelligence serves the post-humans in a far-future war against ordinary humans. As the title suggests, it chooses to switch sides in the end. That’s it.</p><p>I think this is a quite awfully-written story with a heavy-handed delivery of plot points and a lot of infodumping. You can see the “surprise” conclusion of the story coming from miles away (or by reading the title, actually). A very boring read, overall.</p><p>The one thing that could have made the story at least slightly interesting if done well was the characterization of the AI and the post-humans. Sadly, that was crappy and formulaic as well. The protagonist doesn’t really feel like he belongs to the far-future, or the future at all, for that matter. The black-and-white pontificating (a term lifted from Secritcrush) has a definite vibe of the past in it.</p><p>A black-and-white approach to any war of conflict just feels silly and makes the whole world of the story unrealistic for me. Now that I was doing some googling, I noticed that Hugo-nominated Puppy-fanwriter Jeffro Johnson is praising this story because it offers a “concise description of real Christian religious experience”. That’s an interesting thought and maybe some people do enjoy over-simplified morality dramas in 2015, but I certainly don’t.</p><p>This is certainly going below no award.</p><p>Addendum</p><p>The vibe of the past I was writing about arises from the protagonist’s<br> moralistic attitudes which bring to mind the papery characters of old<br> fiction who don’t really resemble real people (or real consciousnesses<br> in this case). Also, I think there was no futuristic sensawunda in the<br> far-future fight scenes when compared with, say, Greg Bear’s Hardfought<br> (that’s a far future war story I think is very good, even though<br> military SF is not really my cup of cat crackers)…. On a second thought, let’s also try to give the Hugo finalists an<br> unscientific numeral score on the range of 1-10 in order to make<br> comparing them easier (if unscientific). “Turncoat” gets 2.</br></br></br></br></br></br></br></br></p></blockquote><p>On the other hand, Steve Moss reached a very different conclusion:</p><blockquote class=\"tr_bq\"><p> I loved Turncoat. Beware- SPOILERS:</p><p>SPOILERS</p><p>To correct something, there are two types of machine intelligence in Turncoat. The Uploaded, which is as you described, humans who have placed their consciousness into machines. The other is true artificial machine intelligence.</p><p>The antagonist is Alpha 7 Alpha. He is one of the Uploaded. He also appears to have carried over many of the negative human emotions such as hate, etc.</p><p>The protagonist is X 45 Delta. He is a 42nd generation true artificial intelligence. He’s never had a human body.</p><p>What I loved about the story is that the Uploaded have lost their humanity (become inhuman) while the true machine intelligence becomes more humane. X 45 Delta committed his betrayal because, in his words, he “wants to decide the sort of man I will become.”</p><p>You are right that he expresses annoyance with his human crew. They are inefficient and filled with inane chatter. He also expresses pride and protective instincts in them, and misses them when they are removed from his ship. All of these things are very human feelings.</p><p>Alpha 7 Alpha removes the crew from X 45 Delta to make him more efficient in battle. Which is true, but also a lie, as X 45 Delta notes (he’s learned to lie from the Uploaded, mostly by omission). He deduces that they will be either terminated or uploaded against their will. This is when his metamorphosis from loyal warrior to turncoat begins.</p><p>All in all, Turncoat was an excellent story and well worthy of a Hugo nomination. I haven’t read everything (yet), but it may well be my number one pick.</p></blockquote><p>At the end of the day, there isn’t much room for compromise. They hate the actual science fiction we love. We have no interest in or regard for their SJW, non-SF, “science fiction”. We appreciate a genuine sense of wonder. They refer in snarky contempt to “sensawunda”. We believe in the human soul, we believe in God, we believe in higher things,  they believe in “science” and the infinite evil of humanity, to the extent they believe in anything at all.</p></div>",
  "content_text": "This review of “Turncoat”\nby Steve Rzasa precisely underlines the central point made by the Sad Puppies campaign and single-handedly serves to justify it:\nI’m going to start with short stories, because they’re, well, short, and with the last story on the ballot and then work my way up.  So the first story is “Turncoat,” by Steve Rzasa. A sentient warship and some post-humans are battling against another group, people who have decided not to make the jump to post-humanity.  The warship goes from being annoyed at the messy, pesky humans to championing them (though I’m not sure where in the story this switch occurs) and defects at the end, bringing along with it (him? her?) its superior hardware and some useful intel about the other side.\nI’m going to take a slight detour here, though I promise I’ll get back to the review soon.  When I was in high school I did or said something that got me sent to detention, a closet-sized room where, oddly, someone had left a stack of Analogs.  I had just started reading science fiction, and of course my first  thought was, Is this supposed to be punishment?\nBut I ended up not really liking most of the stories.  They emphasized hardware, and not even interesting hardware.  The characters were cardboard, the stories predictable (partly because they all ended with humanity triumphing), the style ranged from serviceable to really pretty bad.\nThis was late-period John Campbell I’m talking about.  (Yes, I’m old.)  I will stipulate that the guy did some good things for sf in his prime, but something had happened along the way, some hardening of attitudes and an inability to tell when a story had gone bad.  Humanity had to be shown to triumph in every story, for example, to be superior to anything thrown against it, which pretty much let the air out of any balloon of tension.\nSo, as I hope I’ve made clear, when I say “Turncoat” is a perfectly adequate late-period Campbellian story I don’t mean it as a compliment.  You can’t even say the characters are cardboard, since there are no characters, just a warship that, for the most part, proceeds along strict logical lines.  There’s no one to like, or even hate, no one to identify with or root for, nothing at stake for the reader.\nBut think about everything that’s happened since Campbell.  The New Wave (does anyone remember the New Wave?  Yes, I’m old), feminism, cyberpunk, counter-cyberpunk, a fresh infusion of writers who are not white or straight or able-bodied.  This would have been an average story in the late sixties, but now, nearly fifty years later, it’s stale and dated.\nRzasa hasn’t even caught up with the second of these new categories.  “Our founders were the men who…”  “Posthuman Man…” “Not content with setting Man on his new evolutionary path…”  After\nAncillary Justice\n— hell, after\nThe Left Hand of Darkness\n— this reads very oddly.\nNow consider Castalia House’s mission statement:\n“The books that we publish honor the traditions and intellectual\nauthenticity exemplified by writers such as J.R.R. Tolkien, C.S. Lewis,\nRobert E. Howard, G.K. Chesterton, and Hermann Hesse. We are consciously\nproviding an alternative to readers who increasingly feel alienated\nfrom the nihilistic, dogmatic science fiction and fantasy being\npublished today. We seek nothing less than a Campbellian revolution in\ngenre literature.”\nThat review is supposed to be a negative one, but it sure sounds to me as if we’re on the right track. Now consider these three reviews, the first two from SJWs, the second from a neutral party.\nDaveon on May 4, 2015 at 11:46 am said:\nI hated Turncoat – compared to how Iain Banks, Neal Asher, Peter Hamilton write sentient battleships and describe space warfare it was unbearable, then there were lines like ‘the men who…’ versus ‘the people who’ really jarred against me – it felt like a story written about AIs written by somebody who has ignored any progress in fiction, computing and so forth in 20 years. The opening battle scene at the start of The Reality Dysfunction is better than Turncoat in every way, and that was written in 1996.\nI found that to be rather amusing, considering how spectacularly boring Iain Banks’s space battles are. But considering that Daveon hates Sad Puppies and hates Rabid Puppies, how surprising is it that he – mirabile dictu – just happens to hate “Turncoat” as well? Another SJW\nposted a similar review\n:\nIn the story, an artificial intelligence serves the post-humans in a far-future war against ordinary humans. As the title suggests, it chooses to switch sides in the end. That’s it.\nI think this is a quite awfully-written story with a heavy-handed delivery of plot points and a lot of infodumping. You can see the “surprise” conclusion of the story coming from miles away (or by reading the title, actually). A very boring read, overall.\nThe one thing that could have made the story at least slightly interesting if done well was the characterization of the AI and the post-humans. Sadly, that was crappy and formulaic as well. The protagonist doesn’t really feel like he belongs to the far-future, or the future at all, for that matter. The black-and-white pontificating (a term lifted from Secritcrush) has a definite vibe of the past in it.\nA black-and-white approach to any war of conflict just feels silly and makes the whole world of the story unrealistic for me. Now that I was doing some googling, I noticed that Hugo-nominated Puppy-fanwriter Jeffro Johnson is praising this story because it offers a “concise description of real Christian religious experience”. That’s an interesting thought and maybe some people do enjoy over-simplified morality dramas in 2015, but I certainly don’t.\nThis is certainly going below no award.\nAddendum\nThe vibe of the past I was writing about arises from the protagonist’s\nmoralistic attitudes which bring to mind the papery characters of old\nfiction who don’t really resemble real people (or real consciousnesses\nin this case). Also, I think there was no futuristic sensawunda in the\nfar-future fight scenes when compared with, say, Greg Bear’s Hardfought\n(that’s a far future war story I think is very good, even though\nmilitary SF is not really my cup of cat crackers)…. On a second thought, let’s also try to give the Hugo finalists an\nunscientific numeral score on the range of 1-10 in order to make\ncomparing them easier (if unscientific). “Turncoat” gets 2.\nOn the other hand, Steve Moss reached a very different conclusion:\nI loved Turncoat. Beware- SPOILERS:\nSPOILERS\nTo correct something, there are two types of machine intelligence in Turncoat. The Uploaded, which is as you described, humans who have placed their consciousness into machines. The other is true artificial machine intelligence.\nThe antagonist is Alpha 7 Alpha. He is one of the Uploaded. He also appears to have carried over many of the negative human emotions such as hate, etc.\nThe protagonist is X 45 Delta. He is a 42nd generation true artificial intelligence. He’s never had a human body.\nWhat I loved about the story is that the Uploaded have lost their humanity (become inhuman) while the true machine intelligence becomes more humane. X 45 Delta committed his betrayal because, in his words, he “wants to decide the sort of man I will become.”\nYou are right that he expresses annoyance with his human crew. They are inefficient and filled with inane chatter. He also expresses pride and protective instincts in them, and misses them when they are removed from his ship. All of these things are very human feelings.\nAlpha 7 Alpha removes the crew from X 45 Delta to make him more efficient in battle. Which is true, but also a lie, as X 45 Delta notes (he’s learned to lie from the Uploaded, mostly by omission). He deduces that they will be either terminated or uploaded against their will. This is when his metamorphosis from loyal warrior to turncoat begins.\nAll in all, Turncoat was an excellent story and well worthy of a Hugo nomination. I haven’t read everything (yet), but it may well be my number one pick.\nAt the end of the day, there isn’t much room for compromise. They hate the actual science fiction we love. We have no interest in or regard for their SJW, non-SF, “science fiction”. We appreciate a genuine sense of wonder. They refer in snarky contempt to “sensawunda”. We believe in the human soul, we believe in God, we believe in higher things,  they believe in “science” and the infinite evil of humanity, to the extent they believe in anything at all.",
  "tags": [
    "Book Review",
    "Castalia House",
    "Hugo Award"
  ],
  "categories": [],
  "sitemap_lastmod": "2015-05-05T10:01:00+00:00"
}