{
  "url": "https://voxday.net/2015/05/20/the-sjws-review-shortlis/",
  "scraped_at": "2025-12-16T12:56:29.987685",
  "title": "The SJWs review the shortlist",
  "date_display": "May 20, 2015",
  "date_iso": "2015-05-20T20:33:00+00:00",
  "date_from_url": "2015-05-20",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>Not that the outcomes were ever in any doubt, but it’s always interesting to see what justifications the SJWs produce for their DISQUALIFY. Here are a few commenting at File 770:</p><blockquote class=\"tr_bq\"><p> <b>Hampus Eckerman on May 19, 2015 at 9:04 am said:</b></p><p>Just finished the Related Works. Not satisfied again.</p><p>Wisdoms from my Internet was mostly a collection of tweets. Some were funny, some were well thought out, others were boring and a few were… well, lets say they catered to people with another political taste than me. Ranting about “SJWs” is not the way to get votes from me. Anyhow, who wants to read that amount of tweets? Nah, this is a no award.</p><p>Why Science is Never Settled was the standard article about the scientific methods, one of hundreds, just not as well done as many others. No award again.</p><p>Wright is as horrible as usual in his Transhuman and Subhuman:</p><p><i>“The female spirit is wise rather than cunning, deep in understanding rather than adroit in deductive logic, gentle and supportive rather than boastful and self-aggrandizing.”</i></p><p>“Contrariwise, when women in the kitchen or the nursery use the name of the Lord in vain, and the children they are nursing and teaching hear them, the vulgarity has the negative effect of deadening the emotions of the youngsters and making them vulgar and indifferent to vulgarity.”</p><p><i>“Also a woman who is crude inspires contempt, because she has contempt for God and man. The difference is that a woman who loses her native delicacy and modesty does not become an object of fear and respect, but an object of contempt and loathing, because the aura of sanctity women naturally inspire in men is tossed away.”</i><br> And so on. Bollocks I say.</br></p><p>Hot Equations might be very interesting for a weapons nerd or for someone who loves reading about exactly how weapons work. Sorry to say, I’m not that person.</p><p>Which leaves Letters from Gardner which was just damned weird. A mix of a guys memoire, writing tips and then stories. As I had never heard of him before, the memoire part was kind of boring. The writing tips weren’t anchored in anything. Stories in the mix of this just felt strange. So, nah.</p><p>And thats it. No award I guess.</p><p><b>clif on May 20, 2015 at 9:39 am said:</b></p><p>so I’ve read all I’m going to read of the short stories … preliminary voting …</p><p>1. Totaled<br> 2. A Single Samurai<br> 3. No Award<br> 4. Turncoat<br> 5. On a Spiritual Plain<br> 6. The Parliament of Beasts and Birds</br></br></br></br></br></p><p> <b>Nate Harada on May 20, 2015 at 7:27 am said:</b></p><p>I will confess that I No Awarded four full categories and I’m pretty &gt;_&lt; about it. I *wanted* to like “A Single Samurai.” I did, really! But, well, yeah. No. But it was good of Baen to include the entire anthology in which it appeared.</p><p> <b>Katya on May 20, 2015 at 4:54 am said:</b></p><p>@Happy Turtle I’ve read<br> most of 3 categories (Short Fiction, Novel, Graphic Story). In one of<br> those categories, only two of the works are strong enough that I would<br> have finished reading them if I came across them in a magazine. While<br> both are OK, neither has strong enough writing or storytelling or<br> characterization to be ‘award’ level writing. I’ve read short stories<br> published this year that are much, much stronger than both of those<br> works. I don’t feel it is right to give a prestigious award to works<br> that are middle-of-the-pack. To me, it devalues the award.</br></br></br></br></br></br></br></br></p><p> <b>nickpheas on May 20, 2015 at 1:08 am said:</b></p><p>OK, reads Hugo Packet. One Bright Star To Guide Me By.</p><p>Is there an in story reason why Wright seems to use Sally and Sarah to describe one of his characters, or just did he forget what he called her?</p><p> <b>rob_matic on May 20, 2015 at 1:58 am said:</b></p><p>He may be using Sally as a diminutive of Sarah, although I can imagine it reading oddly if both are being used.</p><p>Peace Is My Middle Name on May 20, 2015 at 2:07 am said:<br> Given Wright’s stated attitudes towards women, I find it utterly unsurprising that he cannot even remember the name of his own character.</br></p><p><b><br/></b><br> <b>SocialInjusticeWorrier on May 20, 2015 at 4:43 am said:</b></br></p><p>I don’t<br> think switching between Sally and Sarah is a problem, so long as the<br> author has a good reason for doing it. I could see O. Henry, for<br> example, using the shift in names very effectively to make a point about<br> how different someone is/appears in a formal setting (as Sarah) as<br> opposed to their normal life (as Sally). What I don’t see is John C<br> Wright having any such purpose in his narrative, which argues for<br> incompetence or carelessness.</br></br></br></br></br></br></br></p><p> <b>GSLamb on May 19, 2015 at 7:18 pm said:</b></p><p>Had a few days convalescence (and a few more ahead), so I thought it a fine time to catch up on my Hugo reading.</p><p>Thanks<br> to a very good local library, I have been reading most of the Best<br> Novel nominees on the traditional Ent-corpse editions. “Skin Game” was<br> everything I thought it would be – no more, no less. “Three Body<br> Problem” was either over my head or not something to read on medication<br> (I will revisit next month). Even though I had not read the first novel,<br> I enjoyed “Ancillary Sword”. It wasn’t until the end when I realized<br> that not every “She” was female (again, medication).</br></br></br></br></br></br></br></p><p>With renewed access to my laptop, I started greedily digesting the Hugo packet.</p><p>Oy.</p><p>The<br> worst thing about the packet is that I have to wait until they release<br> the list of what would have made the Hugo ballot sans-slate so that I<br> can read those works.</br></br></br></p><p>Having read that one story by John C.<br> Wright (do not bother me with quibbles – they are all the same story*)<br> five times was, admittedly, rough work. Luckily I had left the Graphic<br> Story for afterwards. I nearly ruptured something reading “Rat Queens”.</br></br></br></p></blockquote><p> Now, this might all sound very convincing were it not for the sort of works they were awarding in recent years. Or if you weren’t able to see for yourself what “Rat Queens” is like. No, there can be no compromise, as those who were formerly neutral are coming to understand.</p><blockquote class=\"tr_bq\"><p> <b>Will on May 19, 2015 at 4:43 pm said:</b></p><p>Until now, until tonight, I thought they were full of BS. Utter BS. But you make their case better than they do. Congratulations.</p><p><b>Will on May 19, 2015 at 4:49 pm said:</b></p><p>You couldn’t be helping Vox more if he was paying you.</p></blockquote><p> And where would we be without SJWs to not only explain what is good and acceptable science fiction versus what is bad and unacceptable science fiction, but also our own principles.  After all, they obviously understand us so very well.</p><blockquote class=\"tr_bq\"><p> <b>Bruce Baugh on May 20, 2015 at 8:26 am said:</b></p><p>Nate’s monologue reminds me of the thing that really chafes me about a lot of noisy, disruptive modern conservatives: how much time the rest of us end up explaining their own principles to them.</p><p><b><br/></b><br> <b>Aaron on May 20, 2015 at 5:30 am said:</b></br></p><p>The Puppies have already lost. Even if one of their authors wins a Hugo, the Puppies lose, because what none of the Puppies seem to understand is the award doesn’t confer the prestige you all so clearly crave. The prestige has to come first, or the award will be seen as tainted and undeserved. Every Puppy campaign has been an admission on the part of the organizers that the works they are touting are too weak to get nominated on their own merits. Every Puppy campaign is an admission that the Puppy touted authors are simply too lousy at their profession to earn recognition for their actual work. Every Puppy campaign is itself a loss for the Puppies.</p></blockquote></div>",
  "content_text": "Not that the outcomes were ever in any doubt, but it’s always interesting to see what justifications the SJWs produce for their DISQUALIFY. Here are a few commenting at File 770:\nHampus Eckerman on May 19, 2015 at 9:04 am said:\nJust finished the Related Works. Not satisfied again.\nWisdoms from my Internet was mostly a collection of tweets. Some were funny, some were well thought out, others were boring and a few were… well, lets say they catered to people with another political taste than me. Ranting about “SJWs” is not the way to get votes from me. Anyhow, who wants to read that amount of tweets? Nah, this is a no award.\nWhy Science is Never Settled was the standard article about the scientific methods, one of hundreds, just not as well done as many others. No award again.\nWright is as horrible as usual in his Transhuman and Subhuman:\n“The female spirit is wise rather than cunning, deep in understanding rather than adroit in deductive logic, gentle and supportive rather than boastful and self-aggrandizing.”\n“Contrariwise, when women in the kitchen or the nursery use the name of the Lord in vain, and the children they are nursing and teaching hear them, the vulgarity has the negative effect of deadening the emotions of the youngsters and making them vulgar and indifferent to vulgarity.”\n“Also a woman who is crude inspires contempt, because she has contempt for God and man. The difference is that a woman who loses her native delicacy and modesty does not become an object of fear and respect, but an object of contempt and loathing, because the aura of sanctity women naturally inspire in men is tossed away.”\nAnd so on. Bollocks I say.\nHot Equations might be very interesting for a weapons nerd or for someone who loves reading about exactly how weapons work. Sorry to say, I’m not that person.\nWhich leaves Letters from Gardner which was just damned weird. A mix of a guys memoire, writing tips and then stories. As I had never heard of him before, the memoire part was kind of boring. The writing tips weren’t anchored in anything. Stories in the mix of this just felt strange. So, nah.\nAnd thats it. No award I guess.\nclif on May 20, 2015 at 9:39 am said:\nso I’ve read all I’m going to read of the short stories … preliminary voting …\n1. Totaled\n2. A Single Samurai\n3. No Award\n4. Turncoat\n5. On a Spiritual Plain\n6. The Parliament of Beasts and Birds\nNate Harada on May 20, 2015 at 7:27 am said:\nI will confess that I No Awarded four full categories and I’m pretty >_< about it. I *wanted* to like “A Single Samurai.” I did, really! But, well, yeah. No. But it was good of Baen to include the entire anthology in which it appeared.\nKatya on May 20, 2015 at 4:54 am said:\n@Happy Turtle I’ve read\nmost of 3 categories (Short Fiction, Novel, Graphic Story). In one of\nthose categories, only two of the works are strong enough that I would\nhave finished reading them if I came across them in a magazine. While\nboth are OK, neither has strong enough writing or storytelling or\ncharacterization to be ‘award’ level writing. I’ve read short stories\npublished this year that are much, much stronger than both of those\nworks. I don’t feel it is right to give a prestigious award to works\nthat are middle-of-the-pack. To me, it devalues the award.\nnickpheas on May 20, 2015 at 1:08 am said:\nOK, reads Hugo Packet. One Bright Star To Guide Me By.\nIs there an in story reason why Wright seems to use Sally and Sarah to describe one of his characters, or just did he forget what he called her?\nrob_matic on May 20, 2015 at 1:58 am said:\nHe may be using Sally as a diminutive of Sarah, although I can imagine it reading oddly if both are being used.\nPeace Is My Middle Name on May 20, 2015 at 2:07 am said:\nGiven Wright’s stated attitudes towards women, I find it utterly unsurprising that he cannot even remember the name of his own character.\nSocialInjusticeWorrier on May 20, 2015 at 4:43 am said:\nI don’t\nthink switching between Sally and Sarah is a problem, so long as the\nauthor has a good reason for doing it. I could see O. Henry, for\nexample, using the shift in names very effectively to make a point about\nhow different someone is/appears in a formal setting (as Sarah) as\nopposed to their normal life (as Sally). What I don’t see is John C\nWright having any such purpose in his narrative, which argues for\nincompetence or carelessness.\nGSLamb on May 19, 2015 at 7:18 pm said:\nHad a few days convalescence (and a few more ahead), so I thought it a fine time to catch up on my Hugo reading.\nThanks\nto a very good local library, I have been reading most of the Best\nNovel nominees on the traditional Ent-corpse editions. “Skin Game” was\neverything I thought it would be – no more, no less. “Three Body\nProblem” was either over my head or not something to read on medication\n(I will revisit next month). Even though I had not read the first novel,\nI enjoyed “Ancillary Sword”. It wasn’t until the end when I realized\nthat not every “She” was female (again, medication).\nWith renewed access to my laptop, I started greedily digesting the Hugo packet.\nOy.\nThe\nworst thing about the packet is that I have to wait until they release\nthe list of what would have made the Hugo ballot sans-slate so that I\ncan read those works.\nHaving read that one story by John C.\nWright (do not bother me with quibbles – they are all the same story*)\nfive times was, admittedly, rough work. Luckily I had left the Graphic\nStory for afterwards. I nearly ruptured something reading “Rat Queens”.\nNow, this might all sound very convincing were it not for the sort of works they were awarding in recent years. Or if you weren’t able to see for yourself what “Rat Queens” is like. No, there can be no compromise, as those who were formerly neutral are coming to understand.\nWill on May 19, 2015 at 4:43 pm said:\nUntil now, until tonight, I thought they were full of BS. Utter BS. But you make their case better than they do. Congratulations.\nWill on May 19, 2015 at 4:49 pm said:\nYou couldn’t be helping Vox more if he was paying you.\nAnd where would we be without SJWs to not only explain what is good and acceptable science fiction versus what is bad and unacceptable science fiction, but also our own principles.  After all, they obviously understand us so very well.\nBruce Baugh on May 20, 2015 at 8:26 am said:\nNate’s monologue reminds me of the thing that really chafes me about a lot of noisy, disruptive modern conservatives: how much time the rest of us end up explaining their own principles to them.\nAaron on May 20, 2015 at 5:30 am said:\nThe Puppies have already lost. Even if one of their authors wins a Hugo, the Puppies lose, because what none of the Puppies seem to understand is the award doesn’t confer the prestige you all so clearly crave. The prestige has to come first, or the award will be seen as tainted and undeserved. Every Puppy campaign has been an admission on the part of the organizers that the works they are touting are too weak to get nominated on their own merits. Every Puppy campaign is an admission that the Puppy touted authors are simply too lousy at their profession to earn recognition for their actual work. Every Puppy campaign is itself a loss for the Puppies.",
  "tags": [
    "Hugo Award",
    "SJW"
  ],
  "categories": [],
  "sitemap_lastmod": "2015-05-20T19:33:00+00:00"
}