{
  "url": "https://voxday.net/2015/05/29/the-olympian-indifference-of-johnny-con/",
  "scraped_at": "2025-12-16T12:57:29.176967",
  "title": "The Olympian indifference of Johnny Con",
  "date_display": "May 29, 2015",
  "date_iso": "2015-05-29T10:40:00+00:00",
  "date_from_url": "2015-05-29",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>John Scalzi attempts to spin the narrative about his book deal on Twitter:</p><blockquote class=\"tr_bq\"><p> John Scalzi @scalzi <br> I’d like to thank @torbooks for taking a chance on me even though I don’t actually sell any books.</br></p><p>John Scalzi @scalzi<br> Also, yeah, if you’re one of those people who thinks I’m ruining science fiction, it’s gonna be a bad next decade for you. Oh well!</br></p><p>John Scalzi retweeted<br> Jim C. Hines @jimchines<br> 1. @scalzi signs a $3.4 million deal with Tor.<br> 2. People authorsplain how he’d have earned even more if he’d only done ________.</br></br></br></p><p>#Facepalm</p><p>John Scalzi @scalzi<br> Reading commentary on the deal reminds me that a large majority of people do not know how publishing works. Which is fine, but interesting.</br></p><p>John Scalzi @scalzi<br> Most people don’t HAVE to know publishing economics, mind you. Why would they? But if you’re going to opine on them, it does help.</br></p><p>John Scalzi @scalzi <br> Schadenfreude: Watching people who’ve been sooo wrong about my career desperately try to spin this deal as a bad thing for me. Wrong again!</br></p><p>John Scalzi @scalzi<br> For those interested in compare and contrast: The advance for my first published novel — “Old Man’s War” — was $6,500.</br></p><p>John Scalzi@scalzi<br> Someone living off of daddy’s money probably shouldn’t try to lecture others about finances.</br></p></blockquote><p>What else is new? SJWs always lie. Mike Cernovich summed up the salient point yesterday.</p><p>Mike Cernovich @Cernovich<br> <i>As a white straight male capitalist, I’m happy for @scalzi’s $3.4 million book deal. But how many women/POC are squeezed out because of it?</i></br></p><p>I had estimated 680 on the basis of other SF publishers’ current initial advances, but I stand corrected. According to McRapey<i>(1)</i> himself, Tor is funding 13 more John Scalzi books at the opportunity cost of no less than <b>523</b> initial advances to new science fiction authors. As a side note, it is informative to see how much initial advances from major publishers have shrunk over time; the advance for my first published novel in 1996 was <strike>$20,000</strike> $25,000.</p><p>CORRECTION: For the benefit of those who don’t know, I brought in Bruce Bethke as a co-writer AFTER being offered my first book contract with Pocket Books. Also, it was the advance for my first solo novel, <i>The War in Heaven</i>, that was $20,000. Those who think publishing isn’t a zero-sum game are correct in a sense, it is worse than a zero-sum game. It is a negative-sum game, which is why first advances are now one-fifth to one-tenth of what they were 20 years ago.</p><p>Those who have thrown hissy fits over Sad Puppies supposedly slate-blocking as many as 12 authors and preventing them from receiving recognition for their work at the Hugo Awards would do well to consider the fact that Patrick Nielsen Hayden and John Scalzi have combined to prevent <i>more than 500 authors </i>from getting published and receiving paid advances. Opportunity cost is a bitch, especially when you’re the one upon whose fingers the window of opportunity has closed.</p><p>As Scalzi himself says, it’s going to be a bad decade for them. But at least we’ll have a few more snarky, derivative and mediocre novels from Tor to not read. So that’s nice.</p><p>It’s a little strange that people have claimed that my head is exploding or that I’m somehow upset by this deal. That’s not the case at all. In fact, I’m very, very, very pleased that Tor has decided to bet its future on John Scalzi rather than on any of the 523 other authors in whom they could have invested. I wish it had been a 13-book deal at $3.4 million <i>per book</i>. Scalzi isn’t the problem, after all, Scalzi is just one of the uglier public faces of the problem.</p><p>Castalia House was never going to publish Johnny Con because we don’t publish Pink SF snark-fic or work with people we know to be liars. But if you’re one of those 523 authors left out in the cold and you have a really good science fiction novel you want to publish, then we would certainly be interested in hearing from you.<i>(2)</i></p><p> <i>(1) I have been asked if John Scalzi will be relinquishing the “McRapey” title in light of George R.R. Martin’s astonishing accomplishment in rape fiction. Upon consideration, the answer is no, but GRRM will henceforth be known as “George Rape Rape Martin”.  </i></p><p><i>(2) Yes, we are behind in responding to our submissions. I’ll be working on them this weekend. </i></p></div>",
  "content_text": "John Scalzi attempts to spin the narrative about his book deal on Twitter:\nJohn Scalzi @scalzi\nI’d like to thank @torbooks for taking a chance on me even though I don’t actually sell any books.\nJohn Scalzi @scalzi\nAlso, yeah, if you’re one of those people who thinks I’m ruining science fiction, it’s gonna be a bad next decade for you. Oh well!\nJohn Scalzi retweeted\nJim C. Hines @jimchines\n1. @scalzi signs a $3.4 million deal with Tor.\n2. People authorsplain how he’d have earned even more if he’d only done ________.\n#Facepalm\nJohn Scalzi @scalzi\nReading commentary on the deal reminds me that a large majority of people do not know how publishing works. Which is fine, but interesting.\nJohn Scalzi @scalzi\nMost people don’t HAVE to know publishing economics, mind you. Why would they? But if you’re going to opine on them, it does help.\nJohn Scalzi @scalzi\nSchadenfreude: Watching people who’ve been sooo wrong about my career desperately try to spin this deal as a bad thing for me. Wrong again!\nJohn Scalzi @scalzi\nFor those interested in compare and contrast: The advance for my first published novel — “Old Man’s War” — was $6,500.\nJohn Scalzi@scalzi\nSomeone living off of daddy’s money probably shouldn’t try to lecture others about finances.\nWhat else is new? SJWs always lie. Mike Cernovich summed up the salient point yesterday.\nMike Cernovich @Cernovich\nAs a white straight male capitalist, I’m happy for @scalzi’s $3.4 million book deal. But how many women/POC are squeezed out because of it?\nI had estimated 680 on the basis of other SF publishers’ current initial advances, but I stand corrected. According to McRapey\n(1)\nhimself, Tor is funding 13 more John Scalzi books at the opportunity cost of no less than\n523\ninitial advances to new science fiction authors. As a side note, it is informative to see how much initial advances from major publishers have shrunk over time; the advance for my first published novel in 1996 was\n$20,000\n$25,000.\nCORRECTION: For the benefit of those who don’t know, I brought in Bruce Bethke as a co-writer AFTER being offered my first book contract with Pocket Books. Also, it was the advance for my first solo novel,\nThe War in Heaven\n, that was $20,000. Those who think publishing isn’t a zero-sum game are correct in a sense, it is worse than a zero-sum game. It is a negative-sum game, which is why first advances are now one-fifth to one-tenth of what they were 20 years ago.\nThose who have thrown hissy fits over Sad Puppies supposedly slate-blocking as many as 12 authors and preventing them from receiving recognition for their work at the Hugo Awards would do well to consider the fact that Patrick Nielsen Hayden and John Scalzi have combined to prevent\nmore than 500 authors\nfrom getting published and receiving paid advances. Opportunity cost is a bitch, especially when you’re the one upon whose fingers the window of opportunity has closed.\nAs Scalzi himself says, it’s going to be a bad decade for them. But at least we’ll have a few more snarky, derivative and mediocre novels from Tor to not read. So that’s nice.\nIt’s a little strange that people have claimed that my head is exploding or that I’m somehow upset by this deal. That’s not the case at all. In fact, I’m very, very, very pleased that Tor has decided to bet its future on John Scalzi rather than on any of the 523 other authors in whom they could have invested. I wish it had been a 13-book deal at $3.4 million\nper book\n. Scalzi isn’t the problem, after all, Scalzi is just one of the uglier public faces of the problem.\nCastalia House was never going to publish Johnny Con because we don’t publish Pink SF snark-fic or work with people we know to be liars. But if you’re one of those 523 authors left out in the cold and you have a really good science fiction novel you want to publish, then we would certainly be interested in hearing from you.\n(2)\n(1) I have been asked if John Scalzi will be relinquishing the “McRapey” title in light of George R.R. Martin’s astonishing accomplishment in rape fiction. Upon consideration, the answer is no, but GRRM will henceforth be known as “George Rape Rape Martin”.\n(2) Yes, we are behind in responding to our submissions. I’ll be working on them this weekend.",
  "tags": [
    "McRapey",
    "Pink SF"
  ],
  "categories": [],
  "sitemap_lastmod": "2015-05-29T09:40:00+00:00"
}