{
  "url": "https://voxday.net/2015/05/25/the-campbell-delany-divide/",
  "scraped_at": "2025-12-16T12:56:56.168280",
  "title": "Racists vs Child Rapists",
  "date_display": "May 25, 2015",
  "date_iso": "2015-05-25T09:01:00+00:00",
  "date_from_url": "2015-05-25",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>The Campbell-Delany divide pretty well sums up the two sides in the science fiction culture war. To translate how the <i>New Republic</i> describes it, it is <a href=\"http://www.uexpress.com/new-republic/2015/5/24/science-fictions-white-male-problem\">scientagic realists against child-molesting pedophiles</a> and their defenders in the science fiction community:</p><blockquote class=\"tr_bq\"><p> To outsiders, the struggle over the Hugos can be confusing. It involves the arcane details of a complex nomination procedure and factions named Sad Puppies 3 and Rabid Puppies. But the ruckus makes a lot more sense in the context of science fiction’s historical lack of diversity, and there’s perhaps no better illustration of that problem than the career of Samuel R. Delany…. John W. Campbell, Analog’s editor, claimed that he enjoyed shaking up his audience with outrageous ideas, but [Delany’s] “Nova” proved too much for him. According to Delany, Campbell called the author’s agent and said that while he liked the novel, “he didn’t feel his readership would be able to relate to a black main character.” Campbell’s contention that fans weren’t ready for a book like “Nova” was belied by the fact that it was shortlisted for a Hugo in 1969.</p><p>Campbell used his audience as a cover for his own racism. He had published editorials arguing that slavery was a perfectly sensible system for pre-industrial societies, championing the racial theory that whites have a fundamentally higher level of intelligence than blacks and asserting, “One of the major reasons the Negro people are having so much trouble gaining acceptance is, simply, that the Negroes are not doing an adequate job of disciplining their own people, themselves.” Campbell was no fringe kook. He was the most influential science-fiction editor of the last century, whose vision of rule-based, scientifically informed fiction shaped the careers of such canonical writers as Heinlein, Isaac Asimov, Theodore Sturgeon and Frank Herbert.</p><p>Amid the strife of the 1960s, which polarized science fiction no less than the rest of culture, it was easy to cast Campbell and Delany as diametric opposites: Campbell as the old reactionary apostle of heroic, manly tales of space cowboys, and Delany as the young subversive practitioner of cutting-edge speculative fiction that challenged certitudes about identity.</p></blockquote><p>We have called for a Cambellian revolution in science fiction; to a certain extent, that’s what Blue SF is. And “subversive speculative fiction that challenges certitudes about identity, morality, religion, sexual orientation, and tradition” is about as good a way as any to describe the Pink SF we oppose. Campbellian SF vs Delanyite SF. Science vs Subversion. White Male Racists vs Gay Child Rapists.</p><p>One thing you’ll note that the mainstream media never does is to dig up and expose the evil that lies at the heart of Pink SF. They love to point-and-shriek at the late Campbell’s racism, never mind that he was, and is, absolutely correct, as whites have been reliably observed to possess a higher average intelligence than blacks. One would expect a top science fiction editor to be up on the relevant science, after all. Here is <a href=\"http://www.rense.com/general79/dut.htm\">a quote from William Saletan</a>, a writer of whom Delany himself cites respectfully:</p><p><i>Among white Americans, the average IQ, as of a decade or so ago, was 103. Among Asian-Americans, it was 106. Among Jewish Americans, it was 113. Among Latino Americans, it was 89. Among African-Americans, it was 85. Around the world, studies find the same general pattern: whites 100, East Asians 106, sub-Sarahan Africans 70.</i></p><p>So, are we all East Asian supremacists now? Is science intrinsically racist and therefore anathema? In the meantime, both the media and the science fiction community resolutely avoid looking into the likelihood that good old “Chip” Delany is a criminal pedophile, like Walter Breen, like Marion Zimmer Bradley, like Ed Kramer, like David Asimov, and like other members of the science fiction community whose sex crimes the science fiction community has either ignored or defended for decades.</p><p>The <i>New Republic</i> article quoted Delany talking about Campell; what a pity they didn’t quote Delany talking about himself.<br> <i><br/></i><br> <i>“I read the NAMBLA [Bulletin] fairly regularly and I think it is one of the most intelligent discussions of sexuality I’ve ever found.  I think before you start judging what NAMBLA is about, expose yourself to it and see what it is really about.”</i><br> – Samuel R. Delany, <a href=\"http://nambla.org/delaney.html\">June 25, 1994</a>. <br> <i><br/></i><br> <i>“Since I spent eighteen years of my life as a child, and nine years of that life as a pretty sexually active gay child, my complaint against the current attitudes is that they work mightily to silence the voices of children first and secondarily ignore what adults have to say who have been through these situations. One size fits all is never the way to handle any situation with a human dimension. Many, many children—and I was one of them—are desperate to establish some sort of sexual relation with an older and even adult figure.”</i><br> – Samuel R. Delany, Wednesday, <a href=\"http://shetterly.blogspot.ch/2014/07/a-conversation-with-samuel-r-delany.html\">July 9, 2014</a></br></br></br></br></br></br></p><p><i>“Adults hurting children is my notion of a bad thing, whether it is through corporal punishment or in any other way. Children hurting children is equally bad. Pain is not a good teaching tool. So that’s where I tend to stop.”</i><br> – Samuel R. Delany, Wednesday, <a href=\"http://shetterly.blogspot.ch/2014/07/a-conversation-with-samuel-r-delany.html\">July 9, 2014</a></br></p><p>That last quote is particularly problematic, as contra his self-appointed public defenders’ claims, Delany is clearly referring to physical pain, not sexual contact, when he says “hurting children” is his “notion of a bad thing”. Most people assume that sexual contact is intrinsically harmful to children. Delany actively denies this.</p><p>Delany has admitted to being in sexual contact with adult men since the age of 6 and considers himself to have been sexually active since the age of 9. He has attacked the idea that children cannot consent to sexual activity with adults and only opposes children being hurt <i>in the sense of physical pain</i>, and has even quoted a Carlin joke in claiming that it is less harmful to a boy to receive oral sex than be spanked. He has written, repeatedly and at great length, about his fantasies of pre-adolescent boys and girls being raped and otherwise sexually molested by men in a number of his novels, most particularly <i>Hogg: A Novel</i>, which was published in 2004 and is described as follows by <i>Publishers Weekly</i>:</p><blockquote class=\"tr_bq\"><p> Hugo-and Nebula Award-winner Delany – whose early books were fascinating but whose recent efforts have grown increasingly obtuse – has been trying to get this pornographic novel published since 1973. The main narrator here is an 11-year-old boy who joins up with a raping, murdering pederast named Hogg. Coprophiliac Hogg violates women for pay. He enlists the help of other pedophiliac murdering rapists – Nigg, Dago and Denny – and the group sets off to perform acts of hideous violence. After the attacks, a biker friend of Hogg’s sells the boy into sexual slavery to dockyard slum resident Big Sambo, who keeps his 12-year-old daughter for prostitution and his own perversions. The traumatized little girl is gang-raped by Hogg’s crew as well. Meanwhile, teenaged Denny goes on an insane mutilating and mass-murder spree, eludes the police and finally returns to Hogg and the hopelessly confused narrator, who has been “rescued” after Hogg murders Big Sambo. Gang-rape attacks and criminal sex orgies are detailed at excruciating length, with photographic realism. This potent emetic is all the more disturbing for want of modulators of honest outrage. </p></blockquote><p>If one can reasonably declare John W. Campbell a racist on the basis of his essays and reported words, then one can absolutely, and with utter certainty, declare Samuel R. Delany to be a child-raping pedophile on the basis of his own stated beliefs and published fantasies. This is true despite our limited information about his actual historical actions. Whether or not Delany is a literal child rapist, he certainly has child rapist views. And as for his past actions, we certainly know a hell of a lot more about the SFWA Grand Master pedophilic inclinations than we did about Marion Zimmer Bradley’s only eleven months ago. Is anyone going to even pretend to be surprised should evidence be uncovered that good old “Chip” acted on his criminal fantasies at some point in the past?</p><p>Here are two questions for Samuel R. Delany. If the media or SFWA continue to avoid asking them, you’ll know they’re simply afraid to receive the answer; even Will Shetterly, who otherwise addressed the issue in a forthright manner, failed to ask the obvious and important question. I will say one thing for Mr. Delany, he is alarmingly forthcoming, he hasn’t been afraid to answer difficult questions posed to him in the past, and one can’t blame him for not answering questions that were never asked. So here they are:</p><ol><li>Have you ever had any form of sexual contact with an individual under the age of 17?</li><li>What is the oldest age at which you had some form of sexual contact with an individual under the age of 17?</li></ol><p>Until those two questions are answered honestly by Mr. Delany, anyone who denies that good old “Chip” Delany, SFWA Grand Master has ever behaved inappropriately is doing so dishonestly on the basis of no information at all and in the face of considerable evidence to the contrary. What a pity that Delany didn’t throw a few spaceships into <i>Hogg </i>or it might have made the Hugo shortlist too.</p><p>On a lighter note, this quote from George R.R. Martin cracked me up:</p><blockquote class=\"tr_bq\"><p> “We’re SCIENCE FICTION AND FANTASY FANS, we love to read about aliens<br> and vampires and elves. Are we really going to freak about Asians and<br> Native Americans?”</br></br></p></blockquote><p>Well, George, judging by the continuing series of articles about Sad Puppies and the Hugo Awards, to say nothing of your own copious posting on the subject, you certainly appear to be freaking out about this Native American.</p></div>",
  "content_text": "The Campbell-Delany divide pretty well sums up the two sides in the science fiction culture war. To translate how the\nNew Republic\ndescribes it, it is\nscientagic realists against child-molesting pedophiles\nand their defenders in the science fiction community:\nTo outsiders, the struggle over the Hugos can be confusing. It involves the arcane details of a complex nomination procedure and factions named Sad Puppies 3 and Rabid Puppies. But the ruckus makes a lot more sense in the context of science fiction’s historical lack of diversity, and there’s perhaps no better illustration of that problem than the career of Samuel R. Delany…. John W. Campbell, Analog’s editor, claimed that he enjoyed shaking up his audience with outrageous ideas, but [Delany’s] “Nova” proved too much for him. According to Delany, Campbell called the author’s agent and said that while he liked the novel, “he didn’t feel his readership would be able to relate to a black main character.” Campbell’s contention that fans weren’t ready for a book like “Nova” was belied by the fact that it was shortlisted for a Hugo in 1969.\nCampbell used his audience as a cover for his own racism. He had published editorials arguing that slavery was a perfectly sensible system for pre-industrial societies, championing the racial theory that whites have a fundamentally higher level of intelligence than blacks and asserting, “One of the major reasons the Negro people are having so much trouble gaining acceptance is, simply, that the Negroes are not doing an adequate job of disciplining their own people, themselves.” Campbell was no fringe kook. He was the most influential science-fiction editor of the last century, whose vision of rule-based, scientifically informed fiction shaped the careers of such canonical writers as Heinlein, Isaac Asimov, Theodore Sturgeon and Frank Herbert.\nAmid the strife of the 1960s, which polarized science fiction no less than the rest of culture, it was easy to cast Campbell and Delany as diametric opposites: Campbell as the old reactionary apostle of heroic, manly tales of space cowboys, and Delany as the young subversive practitioner of cutting-edge speculative fiction that challenged certitudes about identity.\nWe have called for a Cambellian revolution in science fiction; to a certain extent, that’s what Blue SF is. And “subversive speculative fiction that challenges certitudes about identity, morality, religion, sexual orientation, and tradition” is about as good a way as any to describe the Pink SF we oppose. Campbellian SF vs Delanyite SF. Science vs Subversion. White Male Racists vs Gay Child Rapists.\nOne thing you’ll note that the mainstream media never does is to dig up and expose the evil that lies at the heart of Pink SF. They love to point-and-shriek at the late Campbell’s racism, never mind that he was, and is, absolutely correct, as whites have been reliably observed to possess a higher average intelligence than blacks. One would expect a top science fiction editor to be up on the relevant science, after all. Here is\na quote from William Saletan\n, a writer of whom Delany himself cites respectfully:\nAmong white Americans, the average IQ, as of a decade or so ago, was 103. Among Asian-Americans, it was 106. Among Jewish Americans, it was 113. Among Latino Americans, it was 89. Among African-Americans, it was 85. Around the world, studies find the same general pattern: whites 100, East Asians 106, sub-Sarahan Africans 70.\nSo, are we all East Asian supremacists now? Is science intrinsically racist and therefore anathema? In the meantime, both the media and the science fiction community resolutely avoid looking into the likelihood that good old “Chip” Delany is a criminal pedophile, like Walter Breen, like Marion Zimmer Bradley, like Ed Kramer, like David Asimov, and like other members of the science fiction community whose sex crimes the science fiction community has either ignored or defended for decades.\nThe\nNew Republic\narticle quoted Delany talking about Campell; what a pity they didn’t quote Delany talking about himself.\n“I read the NAMBLA [Bulletin] fairly regularly and I think it is one of the most intelligent discussions of sexuality I’ve ever found.  I think before you start judging what NAMBLA is about, expose yourself to it and see what it is really about.”\n– Samuel R. Delany,\nJune 25, 1994\n.\n“Since I spent eighteen years of my life as a child, and nine years of that life as a pretty sexually active gay child, my complaint against the current attitudes is that they work mightily to silence the voices of children first and secondarily ignore what adults have to say who have been through these situations. One size fits all is never the way to handle any situation with a human dimension. Many, many children—and I was one of them—are desperate to establish some sort of sexual relation with an older and even adult figure.”\n– Samuel R. Delany, Wednesday,\nJuly 9, 2014\n“Adults hurting children is my notion of a bad thing, whether it is through corporal punishment or in any other way. Children hurting children is equally bad. Pain is not a good teaching tool. So that’s where I tend to stop.”\n– Samuel R. Delany, Wednesday,\nJuly 9, 2014\nThat last quote is particularly problematic, as contra his self-appointed public defenders’ claims, Delany is clearly referring to physical pain, not sexual contact, when he says “hurting children” is his “notion of a bad thing”. Most people assume that sexual contact is intrinsically harmful to children. Delany actively denies this.\nDelany has admitted to being in sexual contact with adult men since the age of 6 and considers himself to have been sexually active since the age of 9. He has attacked the idea that children cannot consent to sexual activity with adults and only opposes children being hurt\nin the sense of physical pain\n, and has even quoted a Carlin joke in claiming that it is less harmful to a boy to receive oral sex than be spanked. He has written, repeatedly and at great length, about his fantasies of pre-adolescent boys and girls being raped and otherwise sexually molested by men in a number of his novels, most particularly\nHogg: A Novel\n, which was published in 2004 and is described as follows by\nPublishers Weekly\n:\nHugo-and Nebula Award-winner Delany – whose early books were fascinating but whose recent efforts have grown increasingly obtuse – has been trying to get this pornographic novel published since 1973. The main narrator here is an 11-year-old boy who joins up with a raping, murdering pederast named Hogg. Coprophiliac Hogg violates women for pay. He enlists the help of other pedophiliac murdering rapists – Nigg, Dago and Denny – and the group sets off to perform acts of hideous violence. After the attacks, a biker friend of Hogg’s sells the boy into sexual slavery to dockyard slum resident Big Sambo, who keeps his 12-year-old daughter for prostitution and his own perversions. The traumatized little girl is gang-raped by Hogg’s crew as well. Meanwhile, teenaged Denny goes on an insane mutilating and mass-murder spree, eludes the police and finally returns to Hogg and the hopelessly confused narrator, who has been “rescued” after Hogg murders Big Sambo. Gang-rape attacks and criminal sex orgies are detailed at excruciating length, with photographic realism. This potent emetic is all the more disturbing for want of modulators of honest outrage.\nIf one can reasonably declare John W. Campbell a racist on the basis of his essays and reported words, then one can absolutely, and with utter certainty, declare Samuel R. Delany to be a child-raping pedophile on the basis of his own stated beliefs and published fantasies. This is true despite our limited information about his actual historical actions. Whether or not Delany is a literal child rapist, he certainly has child rapist views. And as for his past actions, we certainly know a hell of a lot more about the SFWA Grand Master pedophilic inclinations than we did about Marion Zimmer Bradley’s only eleven months ago. Is anyone going to even pretend to be surprised should evidence be uncovered that good old “Chip” acted on his criminal fantasies at some point in the past?\nHere are two questions for Samuel R. Delany. If the media or SFWA continue to avoid asking them, you’ll know they’re simply afraid to receive the answer; even Will Shetterly, who otherwise addressed the issue in a forthright manner, failed to ask the obvious and important question. I will say one thing for Mr. Delany, he is alarmingly forthcoming, he hasn’t been afraid to answer difficult questions posed to him in the past, and one can’t blame him for not answering questions that were never asked. So here they are:\nHave you ever had any form of sexual contact with an individual under the age of 17?\nWhat is the oldest age at which you had some form of sexual contact with an individual under the age of 17?\nUntil those two questions are answered honestly by Mr. Delany, anyone who denies that good old “Chip” Delany, SFWA Grand Master has ever behaved inappropriately is doing so dishonestly on the basis of no information at all and in the face of considerable evidence to the contrary. What a pity that Delany didn’t throw a few spaceships into\nHogg\nor it might have made the Hugo shortlist too.\nOn a lighter note, this quote from George R.R. Martin cracked me up:\n“We’re SCIENCE FICTION AND FANTASY FANS, we love to read about aliens\nand vampires and elves. Are we really going to freak about Asians and\nNative Americans?”\nWell, George, judging by the continuing series of articles about Sad Puppies and the Hugo Awards, to say nothing of your own copious posting on the subject, you certainly appear to be freaking out about this Native American.",
  "tags": [
    "freakshow",
    "Pink SF"
  ],
  "categories": [],
  "sitemap_lastmod": "2015-05-25T08:01:00+00:00"
}