{
  "url": "https://voxday.net/2015/05/18/the-excluded/",
  "scraped_at": "2025-12-16T12:56:13.754595",
  "title": "The Excluded",
  "date_display": "May 18, 2015",
  "date_iso": "2015-05-18T16:00:00+00:00",
  "date_from_url": "2015-05-18",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>This concept of <a href=\"http://polymatharchives.blogspot.ca/2015/01/the-inappropriately-excluded.html\">intellectual exclusion</a> may help explain why the credentialed elite are so often at odds with me. They can’t believe I am willing and able to challenge them so successfully, and I can’t believe what clueless idiots they are despite their credentialed positions of intellectual authority. It explains an awful lot; I thought they were smarter than they apparently are:</p><blockquote class=\"tr_bq\"><p> The probability of entering and remaining in an intellectually elite profession such as Physician, Judge, Professor, Scientist, Corporate Executive, etc. increases with IQ to about 133.  It then falls about 1/3 by 140.  By 150 IQ the probability has fallen by 97%!  In other words, a significant percentage of people with IQs over 140 are being systematically and, most likely inappropriately, excluded from the population that addresses the biggest problems of our time or who are responsible for assuring the efficient operation of social, scientific, political and economic institutions.</p><p>“Over an extensive range of studies and with remarkable consistency, from Physicians to Professors to CEOs, the mean IQ of intellectually elite professions is about 125 and the standard deviation is about 6.5.  For example, Gibson and Light found that 148 members of the Cambridge University faculty had a mean IQ of 126 with a standard deviation of 6.3.  The highest score was 139.”</p><p>“From a theoretical standpoint, democratic meritocracies should evolve five IQ defined ‘castes’, The Leaders, The Advisors, The Followers, The Clueless and The Excluded. These castes are natural in that they are the result of how people of different intellectual abilities relate to one another.  This is based on research done by Leta Hollingworth in the 1930’s and the more recent work of D.K. Simonton.”</p><p>“Leta Hollingworth studied profoundly gifted children.  She reported them as having IQs of 180+, which was a R16 score.  As such, on today’s tests this equates to 159+.  Her conclusion was that when IQ differences are greater than 30 points, leader/follower relationships will break down or will not form.  It establishes an absolute limit to the intellectual gulf between leader and followers.”</p></blockquote><p>In other words, more than a few PhDs at elite universities are more than two standard deviations below me in IQ terms. And here I am supposed to be impressed by a Bachelor’s degree in Philosophy of Language from a second-tier Midwestern university? In fact, given the ability of the Ilk and my Vile Faceless Minions to not only follow my lead in a disciplined manner but also correctly anticipate my intentions without having them explained, the evidence would tend to suggest that the mean intelligence of the regulars here is higher than the Cambridge faculty.</p><p>Based on my interactions with “intellectually elite professionals” this doesn’t shock me, although I’m a little surprised that both the mean and the ceiling as as low as they are.</p><p>So it should be no surprise that I’ve been “systematically and, most likely inappropriately, excluded” from the science fiction community, as its mean is probably around 1.5 standard deviations below the university professors. (Although in my estimation there are a few SF people with whom I have interacted who clearly have IQs over 139.) But in most instances, the intellectual gulf is simply too great.</p><p><i>Garth Zietsman has said, referring to people with D15IQs over 152, ‘A<br> common experience with people in this category or higher is that they<br> are not wanted – the masses (including the professional classes) find<br> them an affront of some sort.’  While true, it is more likely a symptom<br> than a cause of the exclusion.  We need to understand why they are an<br> affront.</br></br></br></br></br></i></p><p>I can tell him that. People who work very hard and spend years in order to climb to what they regard as the pinnacle of achievement actively resent those who can simply leap up to the peak. And because their knowledge is hard won, they tend to cling to it much more tenaciously than the more intelligent individual who is no more tied to one piece of information than the next. What makes it worse is that they cannot fathom that the more intelligent individuals do not think like they do.</p><p><i>Members of high IQ societies, especially those that require D15IQs above<br> 145, often comment that around this IQ, qualitatively different<br> thinking emerges.  By this they mean that the 145+ D15IQ person doesn’t<br> just do the same things, intellectually, as a lower IQ person, just<br> faster and more accurately, but actually engages in fundamentally<br> different intellectual processes.   </br></br></br></br></br></i></p><p>I’ve been pointing this out for years, if you recall. But because I don’t think like the less intelligent, I am regularly labeled everything from stupid to racist. In my experience, the 150 IQ individual does not resent the<br> individual with the 160 or the 175 IQ, and this may be because being above 145, we all tend to engage in similar thought processes, albeit with different capabilities. The 135 IQ individual dislikes<br> and fears the 150+ individuals, while the 115 IQ individual either<br> doesn’t believe the 150+ individuals exist or blithely insists that they are crazy.</br></br></br></p><p>That’s<br> why I despise midwits. You simply can’t talk to them. They don’t even<br> try to understand you, but instead move to disqualify you as fast as they can. I have much more sensible conversations with<br> people in the 75 to 100 range than I do with most in the 105 to 120<br> range. The 125 to 140 crowd is okay as long as they don’t have an<br> inferiority complex, but when they do, they’re the biggest annoyances of<br> all.</br></br></br></br></br></br></p><p><i>People with D15IQs over 150 are effectively ‘The Excluded’, routinely<br> finding their thoughts to be unconvincing in the public discourse and in<br> productive environments.  If placed in a leadership position, they will<br> not succeed. </br></br></br></i></p><p>Now you know why I have such an allergy to being asked to lead in any way, shape, or form. In any event, this may be one of the more interesting aspects of Brainstorm (a reminder, there are 20 places left for the Wednesday session at 7:30 PM Eastern), as even those who aren’t +3SD or higher are, at least, open in principle to the wild and crazy thoughts being expressed by the higher intelligences. If we can figure out how to best harness a community of High IQ Excluded, we should be able to come up with more than a few interesting projects.</p></div>",
  "content_text": "This concept of\nintellectual exclusion\nmay help explain why the credentialed elite are so often at odds with me. They can’t believe I am willing and able to challenge them so successfully, and I can’t believe what clueless idiots they are despite their credentialed positions of intellectual authority. It explains an awful lot; I thought they were smarter than they apparently are:\nThe probability of entering and remaining in an intellectually elite profession such as Physician, Judge, Professor, Scientist, Corporate Executive, etc. increases with IQ to about 133.  It then falls about 1/3 by 140.  By 150 IQ the probability has fallen by 97%!  In other words, a significant percentage of people with IQs over 140 are being systematically and, most likely inappropriately, excluded from the population that addresses the biggest problems of our time or who are responsible for assuring the efficient operation of social, scientific, political and economic institutions.\n“Over an extensive range of studies and with remarkable consistency, from Physicians to Professors to CEOs, the mean IQ of intellectually elite professions is about 125 and the standard deviation is about 6.5.  For example, Gibson and Light found that 148 members of the Cambridge University faculty had a mean IQ of 126 with a standard deviation of 6.3.  The highest score was 139.”\n“From a theoretical standpoint, democratic meritocracies should evolve five IQ defined ‘castes’, The Leaders, The Advisors, The Followers, The Clueless and The Excluded. These castes are natural in that they are the result of how people of different intellectual abilities relate to one another.  This is based on research done by Leta Hollingworth in the 1930’s and the more recent work of D.K. Simonton.”\n“Leta Hollingworth studied profoundly gifted children.  She reported them as having IQs of 180+, which was a R16 score.  As such, on today’s tests this equates to 159+.  Her conclusion was that when IQ differences are greater than 30 points, leader/follower relationships will break down or will not form.  It establishes an absolute limit to the intellectual gulf between leader and followers.”\nIn other words, more than a few PhDs at elite universities are more than two standard deviations below me in IQ terms. And here I am supposed to be impressed by a Bachelor’s degree in Philosophy of Language from a second-tier Midwestern university? In fact, given the ability of the Ilk and my Vile Faceless Minions to not only follow my lead in a disciplined manner but also correctly anticipate my intentions without having them explained, the evidence would tend to suggest that the mean intelligence of the regulars here is higher than the Cambridge faculty.\nBased on my interactions with “intellectually elite professionals” this doesn’t shock me, although I’m a little surprised that both the mean and the ceiling as as low as they are.\nSo it should be no surprise that I’ve been “systematically and, most likely inappropriately, excluded” from the science fiction community, as its mean is probably around 1.5 standard deviations below the university professors. (Although in my estimation there are a few SF people with whom I have interacted who clearly have IQs over 139.) But in most instances, the intellectual gulf is simply too great.\nGarth Zietsman has said, referring to people with D15IQs over 152, ‘A\ncommon experience with people in this category or higher is that they\nare not wanted – the masses (including the professional classes) find\nthem an affront of some sort.’  While true, it is more likely a symptom\nthan a cause of the exclusion.  We need to understand why they are an\naffront.\nI can tell him that. People who work very hard and spend years in order to climb to what they regard as the pinnacle of achievement actively resent those who can simply leap up to the peak. And because their knowledge is hard won, they tend to cling to it much more tenaciously than the more intelligent individual who is no more tied to one piece of information than the next. What makes it worse is that they cannot fathom that the more intelligent individuals do not think like they do.\nMembers of high IQ societies, especially those that require D15IQs above\n145, often comment that around this IQ, qualitatively different\nthinking emerges.  By this they mean that the 145+ D15IQ person doesn’t\njust do the same things, intellectually, as a lower IQ person, just\nfaster and more accurately, but actually engages in fundamentally\ndifferent intellectual processes.\nI’ve been pointing this out for years, if you recall. But because I don’t think like the less intelligent, I am regularly labeled everything from stupid to racist. In my experience, the 150 IQ individual does not resent the\nindividual with the 160 or the 175 IQ, and this may be because being above 145, we all tend to engage in similar thought processes, albeit with different capabilities. The 135 IQ individual dislikes\nand fears the 150+ individuals, while the 115 IQ individual either\ndoesn’t believe the 150+ individuals exist or blithely insists that they are crazy.\nThat’s\nwhy I despise midwits. You simply can’t talk to them. They don’t even\ntry to understand you, but instead move to disqualify you as fast as they can. I have much more sensible conversations with\npeople in the 75 to 100 range than I do with most in the 105 to 120\nrange. The 125 to 140 crowd is okay as long as they don’t have an\ninferiority complex, but when they do, they’re the biggest annoyances of\nall.\nPeople with D15IQs over 150 are effectively ‘The Excluded’, routinely\nfinding their thoughts to be unconvincing in the public discourse and in\nproductive environments.  If placed in a leadership position, they will\nnot succeed.\nNow you know why I have such an allergy to being asked to lead in any way, shape, or form. In any event, this may be one of the more interesting aspects of Brainstorm (a reminder, there are 20 places left for the Wednesday session at 7:30 PM Eastern), as even those who aren’t +3SD or higher are, at least, open in principle to the wild and crazy thoughts being expressed by the higher intelligences. If we can figure out how to best harness a community of High IQ Excluded, we should be able to come up with more than a few interesting projects.",
  "tags": [
    "science"
  ],
  "categories": [],
  "sitemap_lastmod": "2015-05-18T15:00:00+00:00"
}