{
  "url": "https://voxday.net/2015/05/15/the-most-despised-man-in-science-fiction/",
  "scraped_at": "2025-12-16T12:55:51.893698",
  "title": "“the most despised man in science fiction”",
  "date_display": "May 15, 2015",
  "date_iso": "2015-05-15T17:03:00+00:00",
  "date_from_url": "2015-05-15",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>Despised, feared, it’s pretty much all the same, isn’t it? <i>The Wall Street Journal </i>takes note of the Hugo Awards, with an article entitled <a href=\"http://www.wsj.com/articles/the-culture-wars-invade-science-fiction-1431707195\">“The Culture Wars Invade Science Fiction Online campaigners are pushing to give SF’s annual Hugo Awards to popular space yarns, not more literary fiction or tales of diversity”</a>. It’s not entirely negative despite the reporter feeling the need to get the opinion of two writers, John Scalzi and George Martin, who don’t know a damn thing about what the Puppies are doing. But regardless, the main thing is that the reporter correctly grasped that this is a new front in the cultural war and not a self-serving attempt to pick up meaningless trophies.</p><blockquote class=\"tr_bq\"><p> Theodore Beale had a big day when the nominations for science fiction’s annual Hugo Awards were announced last month: He received two nominations for his editing work, and nine stories and books from Castalia House, the tiny publisher where he is lead editor, won nominations.</p><p>Quite a feat, since Mr. Beale—better known in the science-fiction world by his pen name, Vox Day—is probably now the most despised man in science fiction. In 2013, he was expelled from the Science Fiction and Fantasy Writers of America after he used the group’s Twitter feed to link to his criticisms of a black female writer as an “ignorant half-savage.” He has called women’s rights “a disease” and homosexuality a “birth defect.”</p><p>So why are he and the Castalia House authors being honored? Because two online campaigns by self-styled conservatives, one led by Mr. Beale, flooded the Hugo ballot box</p><p>The two groups—which call themselves the “Sad Puppies” and the “Rabid Puppies”—urged the science-fiction fans who vote for the awards to nominate slates of books and authors that the Puppies say have been ignored by the Hugos. The Puppies’ supporters contend that the awards are clique-ridden and biased, rewarding liberal perspectives and self-consciously “literary” fiction rather than traditional, popular tales of space battles and fantasy quests.</p><p>The Puppies succeeded wildly…. “This is an important symbol in one particular area of the culture war, and so we took it away from the other side,” said Mr. Beale, who headed the “Rabid Puppies” campaign.</p></blockquote><p>Let them hear us howl… and be afraid. Next stop, Fox News. I thought it was about as balanced an article as one can reasonably expect from the mainstream media, but I did send the reporter the following corrections.</p><ol><li>I wasn’t expelled<br> from SFWA. The SFWA Board voted unanimously to expel me, but the<br> membership never voted as required by the bylaws and Massachusetts<br> state law. Note that SFWA has never stated that I was expelled, for the obvious<br> reason that I was not. </br></br></br></br></li><li>The feed concerned<br> isn’t the group’s Twitter feed, which is @SFWA, but an unofficial feed called @SFWAauthors.</br></li><li>“probably”? Come on, who else is there?</li></ol><p>Of course, I’m not a conservative either, nor are many of you, but in my opinion, that’s within the reasonable margin of error. We’re certainly “conservative” in comparison with the SJW freaks in science fiction. All that really matters is that he got the cultural war aspect right.</p><p>As for the black hat, I don’t mind it at all. Let’s face it, I look pretty damn good in black. Let them open up their hate and let it flow into me.</p></div>",
  "content_text": "Despised, feared, it’s pretty much all the same, isn’t it?\nThe Wall Street Journal\ntakes note of the Hugo Awards, with an article entitled\n“The Culture Wars Invade Science Fiction Online campaigners are pushing to give SF’s annual Hugo Awards to popular space yarns, not more literary fiction or tales of diversity”\n. It’s not entirely negative despite the reporter feeling the need to get the opinion of two writers, John Scalzi and George Martin, who don’t know a damn thing about what the Puppies are doing. But regardless, the main thing is that the reporter correctly grasped that this is a new front in the cultural war and not a self-serving attempt to pick up meaningless trophies.\nTheodore Beale had a big day when the nominations for science fiction’s annual Hugo Awards were announced last month: He received two nominations for his editing work, and nine stories and books from Castalia House, the tiny publisher where he is lead editor, won nominations.\nQuite a feat, since Mr. Beale—better known in the science-fiction world by his pen name, Vox Day—is probably now the most despised man in science fiction. In 2013, he was expelled from the Science Fiction and Fantasy Writers of America after he used the group’s Twitter feed to link to his criticisms of a black female writer as an “ignorant half-savage.” He has called women’s rights “a disease” and homosexuality a “birth defect.”\nSo why are he and the Castalia House authors being honored? Because two online campaigns by self-styled conservatives, one led by Mr. Beale, flooded the Hugo ballot box\nThe two groups—which call themselves the “Sad Puppies” and the “Rabid Puppies”—urged the science-fiction fans who vote for the awards to nominate slates of books and authors that the Puppies say have been ignored by the Hugos. The Puppies’ supporters contend that the awards are clique-ridden and biased, rewarding liberal perspectives and self-consciously “literary” fiction rather than traditional, popular tales of space battles and fantasy quests.\nThe Puppies succeeded wildly…. “This is an important symbol in one particular area of the culture war, and so we took it away from the other side,” said Mr. Beale, who headed the “Rabid Puppies” campaign.\nLet them hear us howl… and be afraid. Next stop, Fox News. I thought it was about as balanced an article as one can reasonably expect from the mainstream media, but I did send the reporter the following corrections.\nI wasn’t expelled\nfrom SFWA. The SFWA Board voted unanimously to expel me, but the\nmembership never voted as required by the bylaws and Massachusetts\nstate law. Note that SFWA has never stated that I was expelled, for the obvious\nreason that I was not.\nThe feed concerned\nisn’t the group’s Twitter feed, which is @SFWA, but an unofficial feed called @SFWAauthors.\n“probably”? Come on, who else is there?\nOf course, I’m not a conservative either, nor are many of you, but in my opinion, that’s within the reasonable margin of error. We’re certainly “conservative” in comparison with the SJW freaks in science fiction. All that really matters is that he got the cultural war aspect right.\nAs for the black hat, I don’t mind it at all. Let’s face it, I look pretty damn good in black. Let them open up their hate and let it flow into me.",
  "tags": [
    "Hugo Award",
    "media"
  ],
  "categories": [],
  "sitemap_lastmod": "2015-05-15T16:03:00+00:00"
}