{
  "url": "https://voxday.net/2015/05/17/the-common-factor/",
  "scraped_at": "2025-12-16T12:56:02.510840",
  "title": "The common factor",
  "date_display": "May 17, 2015",
  "date_iso": "2015-05-17T09:26:00+00:00",
  "date_from_url": "2015-05-17",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>XDPaul points out that the parties responsible for what the Worldcon community is lamenting are not either the Sad or Rabid Puppies:</p><blockquote class=\"tr_bq\"><p> <i>This is supposed to be a literary award, not playground taunts and bullying</i></p><p>If that was generally understood Sad Puppies would’ve never happened in the first place!</p><p>Exactly.</p><p>Scalzi should never have – unprovoked – called that guy he didn’t know a “a jackass, and a fairly ignorant jackass at that” in order to curry favor with established authors. All of this could have been prevented, had Scalzi not turned fandom into his private personal playground specially designed for these taunts and bullying of which you complain.</p><p>Taunts, bullying…and awards-gathering, of course. I know, let’s call it “Your Hate Mail Will Be Graded,” that epic scholarly work so highly regarded in the annals of SF.</p><p>If you want to condemn the one who set this all off, I think the former President of the SFWA, initial taunter, rape humorist, “easiest difficulty setting there is,” master of the recommendation list, and award-winning Professional Fan Writer John Scalzi is not a bad place to look.</p></blockquote><p>Everyone here knows why I went to the trouble of getting John Scalzi’s traffic statistics and unmasking him as the liar and fraud that he is. Perhaps fewer understand why Larry Correia is no fonder of the little charlatan, but Steve Moss explains:</p><blockquote class=\"tr_bq\"><p>  From what I can determine,the Corriea-Scalzi feud started as follows:<br> 1. Ms. USA makes comments about women’s self-defense.<br> 2. Corriea supports her comments.<br> 3. Jim Hines’ criticizes Ms. USA and Corriea, in not too pleasant terms.<br> 4. Corriea pins Hines’ ears back.<br> 5. Scalzi goes after Corriea, and is his usually condescending and insulting self.<br> 6. Scalzi gets his butt kicked in the Twitter exchange.<br> 7. Many hot tempered words follow for the next <strike>2-3 years</strike> year, with no sign of abating.</br></br></br></br></br></br></br></p></blockquote><p>And then, of course, I would be remiss if I failed to recall this hilarious exchange:</p><blockquote class=\"tr_bq\"><p> John Scalzi ‏@scalzi Apr 8<br> I wish Larry Corriea had the balls to admit the reason he started the Sad Puppies campaign was that he just wanted a Hugo so fucking bad.<br> 45 retweets 66 favorites</br></br></p><p>Larry Correia @monsterhunter45 <br> I turned down my Hugo nomination and you still didn’t make the ballot. <br> 360 retweets 501 favorites</br></br></p></blockquote><div class=\"separator\" style=\"clear: both; text-align: center;\"> <a href=\"https://pbs.twimg.com/media/CCE7Rz3WYAAoZRC.jpg\" imageanchor=\"1\" style=\"clear: left; float: left; margin-bottom: 1em; margin-right: 1em;\"><noscript><img border=\"0\" decoding=\"async\" src=\"https://pbs.twimg.com/media/CCE7Rz3WYAAoZRC.jpg\"/></noscript><img border=\"0\" class=\"lazyload\" data-src=\"https://pbs.twimg.com/media/CCE7Rz3WYAAoZRC.jpg\" decoding=\"async\" src=\"data:image/svg+xml,%3Csvg%20xmlns=%22http://www.w3.org/2000/svg%22%20viewBox=%220%200%20210%20140%22%3E%3C/svg%3E\"/></a></div><p>The post-Loncon period in which <a href=\"http://www.milobookclub.com/2014/08/18/larrys-summary-of-hugo-2014/\">McRapey repeated the very sort of falsehoods</a> that the International Lord of Hate predicted the SJWs would attempt to put forth also merits mention. Meanwhile, Hugo nominee Kary English notes that the self-proclaimed inclusivity crowd has been more than a little bit hostile to outsiders, even to the point of harassing us with violent language.</p><p><i>“I’ve pretty much lost count of all the times I’ve seen someone say the Puppies should be shot, euthanized, put down, drowned, etc. It’s not cool. It’s not acceptable”</i></p><p>Perhaps someone should enquire of Sasquan if people who have harassed Hugo nominees in such violent fashion will be banned from the con, as I expect such statements are likely in clear violation of their Harassment Code. And finally, we have more evidence of the oft-observed truism; SJWs always lie:</p><blockquote class=\"tr_bq\"><p> Owlmirror on May 16, 2015 at 9:43 pm said:</p><p><i>    Scalzi should never have – unprovoked – called that guy he didn’t know a “a jackass, and a fairly ignorant jackass at that”</i></p><p>You mean VD’s anti-Semitism and misogyny don’t count as provocation?</p><p>    <i>All of this could have been prevented, had Scalzi not turned fandom into his private personal playground specially designed for these taunts and bullying of which you complain. </i></p><p>You mean, VD would have not taunted and bullied anyone if not for Scalzi? What about the fact that he taunted and bullied women SF writers in the first place?</p></blockquote><p>Yes, nonexistent anti-Semitism and misogyny don’t count as provocation, for the obvious reason that they do not exist. Nor does <a href=\"http://www.wnd.com/2005/02/29022/\">a single column addressing an attack</a> on a disease-stricken Michael Kinsley by Susan Estrich and explaining the toxic effect of feminism on female intellects qualify as taunting and bullying women SF writers.</p><p>It’s fascinating to see how the SJWs resolutely refuse to see the obvious and recongize the single common factor in everything from award campaigning and pro Fan Writers to the culture war and the increased incivility in SF. This is particularly obvious once you take into account that I was an SFWA member participating in various events and activities without incident for seven years prior to McRapey first surfacing in the SF community.</p><p>However, the most interesting bit in the comments might have been easily missed, as <a href=\"http://t.co/7PhhOp4s0U\">Mike Glyer raised one of the few relevant points</a> to be found amidst the lunatic sea of SJW rhetoric:</p><blockquote class=\"tr_bq\"><p> <i>“How many conservatives have won the Hugo in the past 2 decades again?”</i></p><p>I just did a count and found 19 Hugos have been won by conservatives since 1996.</p></blockquote><p>The determination of who is and who is not a conservative may be arbitrary, but as Mike has shown himself to be impartial throughout, there is no reason to quibble over it. This means that out of the <strike>approximately 304</strike> 266 Hugo Awards* that have been given out since 1996, <b>only 7.1 percent have gone to conservatives</b>. It will probably surprise no one here to learn that this factual observation of extreme left-wing bias in science fiction fandom was immediately met with the suggestion that conservatives simply aren’t very good at writing science fiction and fantasy.</p><p><i>“It could be just that Conservatives are not (at the present) very good at creating art…. Certainly (some) Conservative art in the PAST was good.  Maybe there is<br> something about the current Conservative movement which curtails their<br> ability to create art?  IDK.”</br></br></i></p><p>That could be. Or, you know, perhaps there is something to the assertion that nearly every single right-of-center author, male and female alike, has made about aggressive left-wing ideological gatekeeping in science fiction and fantasy. After all, the mere possibility that a few more right-of-center authors might win a Hugo has not only prompted a hate campaign in the international media, but open calls for changing the rules.</p><p>*This is a correction. I originally multiplied the number of years by the number of awards given out in 2014, but fewer awards were given in previous years.</p></div>",
  "content_text": "XDPaul points out that the parties responsible for what the Worldcon community is lamenting are not either the Sad or Rabid Puppies:\nThis is supposed to be a literary award, not playground taunts and bullying\nIf that was generally understood Sad Puppies would’ve never happened in the first place!\nExactly.\nScalzi should never have – unprovoked – called that guy he didn’t know a “a jackass, and a fairly ignorant jackass at that” in order to curry favor with established authors. All of this could have been prevented, had Scalzi not turned fandom into his private personal playground specially designed for these taunts and bullying of which you complain.\nTaunts, bullying…and awards-gathering, of course. I know, let’s call it “Your Hate Mail Will Be Graded,” that epic scholarly work so highly regarded in the annals of SF.\nIf you want to condemn the one who set this all off, I think the former President of the SFWA, initial taunter, rape humorist, “easiest difficulty setting there is,” master of the recommendation list, and award-winning Professional Fan Writer John Scalzi is not a bad place to look.\nEveryone here knows why I went to the trouble of getting John Scalzi’s traffic statistics and unmasking him as the liar and fraud that he is. Perhaps fewer understand why Larry Correia is no fonder of the little charlatan, but Steve Moss explains:\nFrom what I can determine,the Corriea-Scalzi feud started as follows:\n1. Ms. USA makes comments about women’s self-defense.\n2. Corriea supports her comments.\n3. Jim Hines’ criticizes Ms. USA and Corriea, in not too pleasant terms.\n4. Corriea pins Hines’ ears back.\n5. Scalzi goes after Corriea, and is his usually condescending and insulting self.\n6. Scalzi gets his butt kicked in the Twitter exchange.\n7. Many hot tempered words follow for the next\n2-3 years\nyear, with no sign of abating.\nAnd then, of course, I would be remiss if I failed to recall this hilarious exchange:\nJohn Scalzi ‏@scalzi Apr 8\nI wish Larry Corriea had the balls to admit the reason he started the Sad Puppies campaign was that he just wanted a Hugo so fucking bad.\n45 retweets 66 favorites\nLarry Correia @monsterhunter45\nI turned down my Hugo nomination and you still didn’t make the ballot.\n360 retweets 501 favorites\nThe post-Loncon period in which\nMcRapey repeated the very sort of falsehoods\nthat the International Lord of Hate predicted the SJWs would attempt to put forth also merits mention. Meanwhile, Hugo nominee Kary English notes that the self-proclaimed inclusivity crowd has been more than a little bit hostile to outsiders, even to the point of harassing us with violent language.\n“I’ve pretty much lost count of all the times I’ve seen someone say the Puppies should be shot, euthanized, put down, drowned, etc. It’s not cool. It’s not acceptable”\nPerhaps someone should enquire of Sasquan if people who have harassed Hugo nominees in such violent fashion will be banned from the con, as I expect such statements are likely in clear violation of their Harassment Code. And finally, we have more evidence of the oft-observed truism; SJWs always lie:\nOwlmirror on May 16, 2015 at 9:43 pm said:\nScalzi should never have – unprovoked – called that guy he didn’t know a “a jackass, and a fairly ignorant jackass at that”\nYou mean VD’s anti-Semitism and misogyny don’t count as provocation?\nAll of this could have been prevented, had Scalzi not turned fandom into his private personal playground specially designed for these taunts and bullying of which you complain.\nYou mean, VD would have not taunted and bullied anyone if not for Scalzi? What about the fact that he taunted and bullied women SF writers in the first place?\nYes, nonexistent anti-Semitism and misogyny don’t count as provocation, for the obvious reason that they do not exist. Nor does\na single column addressing an attack\non a disease-stricken Michael Kinsley by Susan Estrich and explaining the toxic effect of feminism on female intellects qualify as taunting and bullying women SF writers.\nIt’s fascinating to see how the SJWs resolutely refuse to see the obvious and recongize the single common factor in everything from award campaigning and pro Fan Writers to the culture war and the increased incivility in SF. This is particularly obvious once you take into account that I was an SFWA member participating in various events and activities without incident for seven years prior to McRapey first surfacing in the SF community.\nHowever, the most interesting bit in the comments might have been easily missed, as\nMike Glyer raised one of the few relevant points\nto be found amidst the lunatic sea of SJW rhetoric:\n“How many conservatives have won the Hugo in the past 2 decades again?”\nI just did a count and found 19 Hugos have been won by conservatives since 1996.\nThe determination of who is and who is not a conservative may be arbitrary, but as Mike has shown himself to be impartial throughout, there is no reason to quibble over it. This means that out of the\napproximately 304\n266 Hugo Awards* that have been given out since 1996,\nonly 7.1 percent have gone to conservatives\n. It will probably surprise no one here to learn that this factual observation of extreme left-wing bias in science fiction fandom was immediately met with the suggestion that conservatives simply aren’t very good at writing science fiction and fantasy.\n“It could be just that Conservatives are not (at the present) very good at creating art…. Certainly (some) Conservative art in the PAST was good.  Maybe there is\nsomething about the current Conservative movement which curtails their\nability to create art?  IDK.”\nThat could be. Or, you know, perhaps there is something to the assertion that nearly every single right-of-center author, male and female alike, has made about aggressive left-wing ideological gatekeeping in science fiction and fantasy. After all, the mere possibility that a few more right-of-center authors might win a Hugo has not only prompted a hate campaign in the international media, but open calls for changing the rules.\n*This is a correction. I originally multiplied the number of years by the number of awards given out in 2014, but fewer awards were given in previous years.",
  "tags": [
    "McRapey",
    "SJW"
  ],
  "categories": [],
  "sitemap_lastmod": "2015-05-17T08:26:00+00:00"
}