{
  "url": "https://voxday.net/2015/05/04/the-limits-of-vaccines/",
  "scraped_at": "2025-12-16T12:54:31.984875",
  "title": "The limits of vaccines",
  "date_display": "May 4, 2015",
  "date_iso": "2015-05-04T08:22:00+00:00",
  "date_from_url": "2015-05-04",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>Tetyana Obukhanych, PhD, <a href=\"http://www.thepeoplesvoice.org/TPV3/Voices.php/2015/04/30/harvard-trained-immunologist-demolishes-\">writes an open letter to the California legislature</a> that is foolishly, and unconstitutionally, considering putting an end to all legal vaccine exemptions:</p><blockquote class=\"tr_bq\"><p> Dear Legislator:</p><p>My name is Tetyana Obukhanych. I hold a PhD in Immunology. I am writing this letter in the hope that it will correct several common misperceptions about vaccines in order to help you formulate a fair and balanced understanding that is supported by accepted vaccine theory and new scientific findings.</p><p><b>Do unvaccinated children pose a higher threat to the public than the vaccinated?</b></p><p>It is often stated that those who choose not to vaccinate their children for reasons of conscience endanger the rest of the public, and this is the rationale behind most of the legislation to end vaccine exemptions currently being considered by federal and state legislators country-wide. You should be aware that the nature of protection afforded by many modern vaccines – and that includes most of the vaccines recommended by the CDC for children – is not consistent with such a statement. I have outlined below the recommended vaccines that cannot prevent transmission of disease either because they are not designed to prevent the transmission of infection (rather, they are intended to prevent disease symptoms), or because they are for non-communicable diseases. People who have not received the vaccines mentioned below pose no higher threat to the general public than those who have, implying that discrimination against non-immunized children in a public school setting may not be warranted.</p><p><b>How often do serious vaccine adverse events happen?</b></p><p>It is often stated that vaccination rarely leads to serious adverse<br> events.  Unfortunately, this statement is not supported by science.  A<br> recent study done in Ontario, Canada, established that vaccination<br> actually leads to an emergency room visit for 1 in 168 children<br> following their 12-month vaccination appointment and for 1 in 730<br> children following their 18-month vaccination appointment (see appendix<br> for a scientific study, Item #5).</br></br></br></br></br></br></p><p>When the risk of an adverse event requiring an ER visit after<br> well-baby vaccinations is demonstrably so high, vaccination must remain a<br> choice for parents, who may understandably be unwilling to assume this<br> immediate risk in order to protect their children from diseases that are<br> generally considered mild or that their children may never be exposed<br> to.</br></br></br></br></br></p><p>In summary: 1) due to the properties of modern vaccines,<br> non-vaccinated individuals pose no greater risk of transmission of<br> polio, diphtheria, pertussis, and numerous non-type b H. influenzae<br> strains than vaccinated individuals do, non-vaccinated individuals pose<br> virtually no danger of transmission of hepatitis B in a school setting,<br> and tetanus is not transmissible at all; 2) there is a significantly<br> elevated risk of emergency room visits after childhood vaccination<br> appointments attesting that vaccination is  not risk-free; 3) outbreaks<br> of measles cannot be entirely prevented even if we had nearly perfect<br> vaccination compliance; and 4) an effective method of preventing measles<br> and other viral diseases in vaccine-ineligible infants and the<br> immunocompromised, immunoglobulin, is available for those who may be<br> exposed to these diseases.</br></br></br></br></br></br></br></br></br></br></br></br></p><p>Taken together, these four facts make it clear that discrimination in<br> a public school setting against children who are not vaccinated for<br> reasons of conscience is completely unwarranted as the vaccine status of<br> conscientious objectors poses no undue public health risk. </br></br></br></p></blockquote><p>Unlike most vaccine advocates, who invariably point to irrelevant historical statistics that a) preceded the introduction of vaccines and b) involve vaccines that are very different than the vaccines now administered today, most vaccine skeptics pay close attention to the actual vaccines and vaccine schedules that are presently relevant today. If you’re not reasonably up to date on either when the various vaccines were first introduced or the historical and current death rates, I would advise that you get yourself up to speed before leaping in and saying something both stupid and easily disproved.</p><p>And it is important to be up to speed before trying to discuss the subject, because as Dr. Obukhanych observes, the vaccines that are being given today are not the same vaccines that helped wipe out the last vestiges of the various communicable diseases that had already declined dramatically as a result of improved sewage and health care systems.</p><p>Furthermore, there is very good reason to doubt the linear efficacy of vaccines that is commonly assumed due to the presence of the 5 percent of the population who are low-vaccine responders. If one factors in the additional percent of the population that is vaccine-sensitive, which is presently unknown but is unlikely to be any smaller than the low-vaccine responder population, somewhere between 5 and 15 percent of the population are simply never going to fit the “one size fits all approach”, which means that any law that would impose such a draconian vaccine regime on the general population is unconscionable, guaranteed to cause more harm than it prevents, and certain to fail in its stated objectives.</p><p>But even if one sets aside the science and the history of vaccines, one doesn’t need to be against vaccines or even to question the idea of their unmitigated beneficence in order to strongly oppose the idea of the government universally and forcibly dictating the injection of substances for which there is no legal liability by people for whom there is no legal accountability, without consent or even parental consent, into every single infant in the nation.</p><p>And the fact is that vaccines are not an unmitigated good. Like most things, they come with costs and benefits. It is foolish, even criminal, to attempt to set public policy without taking the downside aspects into account as well as the upside ones.</p><p>Furthermore, the scare tactics of vaccine advocates are based on absolute and utter absurdities that require complete ignorance <a href=\"http://www.milobookclub.com/2015/02/05/measles-actual-risks/\">of the historical facts</a> to take seriously. Even in a completely<br> unvaccinated scenario with 90 percent infection rates that assumes<br> absolutely no improvement in health care in 55 years, we’re talking<br> about 450 deaths per year.  Realistically, we’re probably talking around<br> 200, given the advancements in medical technology. THAT is what all the<br> pro-vaccine scaremongers are going on about. Americans would do far better<br> to ban bicycles, as they would save three times more lives per year.</br></br></br></br></br></br></p><p>383,542: Automobile deaths in last 10 years<br> 6,770: Bicycle deaths in last 10 years<br> 0: Measles deaths in last 10 years</br></br></p><p>As it happens, since 2003, 108 more Americans have died from reactions to the measles vaccine than have died from measles. Vaccine apologists like to claim that anti-vaxxers “have blood on their hands” due to hypothetical deaths that could theoretically occur as a result of imagined transmissions of communicable diseases that haven’t actually taken place, but the fact is that they have real blood from actual deaths on their own.</p></div>",
  "content_text": "Tetyana Obukhanych, PhD,\nwrites an open letter to the California legislature\nthat is foolishly, and unconstitutionally, considering putting an end to all legal vaccine exemptions:\nDear Legislator:\nMy name is Tetyana Obukhanych. I hold a PhD in Immunology. I am writing this letter in the hope that it will correct several common misperceptions about vaccines in order to help you formulate a fair and balanced understanding that is supported by accepted vaccine theory and new scientific findings.\nDo unvaccinated children pose a higher threat to the public than the vaccinated?\nIt is often stated that those who choose not to vaccinate their children for reasons of conscience endanger the rest of the public, and this is the rationale behind most of the legislation to end vaccine exemptions currently being considered by federal and state legislators country-wide. You should be aware that the nature of protection afforded by many modern vaccines – and that includes most of the vaccines recommended by the CDC for children – is not consistent with such a statement. I have outlined below the recommended vaccines that cannot prevent transmission of disease either because they are not designed to prevent the transmission of infection (rather, they are intended to prevent disease symptoms), or because they are for non-communicable diseases. People who have not received the vaccines mentioned below pose no higher threat to the general public than those who have, implying that discrimination against non-immunized children in a public school setting may not be warranted.\nHow often do serious vaccine adverse events happen?\nIt is often stated that vaccination rarely leads to serious adverse\nevents.  Unfortunately, this statement is not supported by science.  A\nrecent study done in Ontario, Canada, established that vaccination\nactually leads to an emergency room visit for 1 in 168 children\nfollowing their 12-month vaccination appointment and for 1 in 730\nchildren following their 18-month vaccination appointment (see appendix\nfor a scientific study, Item #5).\nWhen the risk of an adverse event requiring an ER visit after\nwell-baby vaccinations is demonstrably so high, vaccination must remain a\nchoice for parents, who may understandably be unwilling to assume this\nimmediate risk in order to protect their children from diseases that are\ngenerally considered mild or that their children may never be exposed\nto.\nIn summary: 1) due to the properties of modern vaccines,\nnon-vaccinated individuals pose no greater risk of transmission of\npolio, diphtheria, pertussis, and numerous non-type b H. influenzae\nstrains than vaccinated individuals do, non-vaccinated individuals pose\nvirtually no danger of transmission of hepatitis B in a school setting,\nand tetanus is not transmissible at all; 2) there is a significantly\nelevated risk of emergency room visits after childhood vaccination\nappointments attesting that vaccination is  not risk-free; 3) outbreaks\nof measles cannot be entirely prevented even if we had nearly perfect\nvaccination compliance; and 4) an effective method of preventing measles\nand other viral diseases in vaccine-ineligible infants and the\nimmunocompromised, immunoglobulin, is available for those who may be\nexposed to these diseases.\nTaken together, these four facts make it clear that discrimination in\na public school setting against children who are not vaccinated for\nreasons of conscience is completely unwarranted as the vaccine status of\nconscientious objectors poses no undue public health risk.\nUnlike most vaccine advocates, who invariably point to irrelevant historical statistics that a) preceded the introduction of vaccines and b) involve vaccines that are very different than the vaccines now administered today, most vaccine skeptics pay close attention to the actual vaccines and vaccine schedules that are presently relevant today. If you’re not reasonably up to date on either when the various vaccines were first introduced or the historical and current death rates, I would advise that you get yourself up to speed before leaping in and saying something both stupid and easily disproved.\nAnd it is important to be up to speed before trying to discuss the subject, because as Dr. Obukhanych observes, the vaccines that are being given today are not the same vaccines that helped wipe out the last vestiges of the various communicable diseases that had already declined dramatically as a result of improved sewage and health care systems.\nFurthermore, there is very good reason to doubt the linear efficacy of vaccines that is commonly assumed due to the presence of the 5 percent of the population who are low-vaccine responders. If one factors in the additional percent of the population that is vaccine-sensitive, which is presently unknown but is unlikely to be any smaller than the low-vaccine responder population, somewhere between 5 and 15 percent of the population are simply never going to fit the “one size fits all approach”, which means that any law that would impose such a draconian vaccine regime on the general population is unconscionable, guaranteed to cause more harm than it prevents, and certain to fail in its stated objectives.\nBut even if one sets aside the science and the history of vaccines, one doesn’t need to be against vaccines or even to question the idea of their unmitigated beneficence in order to strongly oppose the idea of the government universally and forcibly dictating the injection of substances for which there is no legal liability by people for whom there is no legal accountability, without consent or even parental consent, into every single infant in the nation.\nAnd the fact is that vaccines are not an unmitigated good. Like most things, they come with costs and benefits. It is foolish, even criminal, to attempt to set public policy without taking the downside aspects into account as well as the upside ones.\nFurthermore, the scare tactics of vaccine advocates are based on absolute and utter absurdities that require complete ignorance\nof the historical facts\nto take seriously. Even in a completely\nunvaccinated scenario with 90 percent infection rates that assumes\nabsolutely no improvement in health care in 55 years, we’re talking\nabout 450 deaths per year.  Realistically, we’re probably talking around\n200, given the advancements in medical technology. THAT is what all the\npro-vaccine scaremongers are going on about. Americans would do far better\nto ban bicycles, as they would save three times more lives per year.\n383,542: Automobile deaths in last 10 years\n6,770: Bicycle deaths in last 10 years\n0: Measles deaths in last 10 years\nAs it happens, since 2003, 108 more Americans have died from reactions to the measles vaccine than have died from measles. Vaccine apologists like to claim that anti-vaxxers “have blood on their hands” due to hypothetical deaths that could theoretically occur as a result of imagined transmissions of communicable diseases that haven’t actually taken place, but the fact is that they have real blood from actual deaths on their own.",
  "tags": [
    "vaccines"
  ],
  "categories": [],
  "sitemap_lastmod": "2015-05-04T07:22:00+00:00"
}