{
  "url": "https://voxday.net/2015/05/21/the-diversity-camp-crumbles/",
  "scraped_at": "2025-12-16T12:56:31.874063",
  "title": "The diversity camp crumbles",
  "date_display": "May 21, 2015",
  "date_iso": "2015-05-21T07:59:00+00:00",
  "date_from_url": "2015-05-21",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>Anyone who has studied the history of racially and culturally diverse societies <a href=\"http://www.wsj.com/articles/asian-american-organizations-seek-federal-probe-of-harvard-admission-policies-1431719348\">knew this was inevitable</a>:</p><blockquote class=\"tr_bq\"><p> A complaint Friday alleged that Harvard University discriminates<br> against Asian-American applicants by setting a higher bar for admissions<br> than that faced by other groups.</br></br></p><p> The complaint, filed by a<br> coalition of 64 organizations, says the university has set quotas to<br> keep the numbers of Asian-American students significantly lower than the<br> quality of their applications merits. It cites third-party academic<br> research on the SAT exam showing that Asian-Americans have to score on<br> average about 140 points higher than white students, 270 points higher<br> than Hispanic students and 450 points higher than African-American<br> students to equal their chances of gaining admission to Harvard. The<br> exam is scored on a 2400-point scale.</br></br></br></br></br></br></br></br></p><p> The complaint was filed with the U.S. Education Department’s Office for Civil Rights.</p><p> “Many<br> studies have indicated that Harvard University has been engaged in<br> systemic and continuous discrimination against Asian-Americans during<br> its very subjective ‘Holistic’ college admissions process,” the<br> complaint alleges. The coalition is seeking a federal<br> investigation and is requesting Harvard “immediately cease and desist<br> from using stereotypes, racial biases and other discriminatory means in<br> evaluating Asian-American applicants.”</br></br></br></br></br></br></br></p></blockquote><p>This action is particularly significant for its symbolism; Harvard is the throne of American left-liberalism. But the nominally ideological alliance of minorities against the white majority was only going to last as long as the minorities felt they benefited more from that alliance than from flexing their muscle in their own direct interests. Based on what we’re seeing from the Asians in the political world, they are all but done with their “liberal” alliance with blacks, Jews, and Hispanics.</p><p>It won’t surprise me if Asians magically become more “conservative” in the next decade as they switch to a Yellow-White (Blue) alliance against the White (Red)-Black-Brown alliance. Politics in the USA and in the UK are becoming less about ideology and more about the straightforward racial power struggles that have historically characterized most diverse societies.</p><p>And yes, I use the Red-Blue colors in their original form; Red being the appropriate color for those of the more socialist inclinations.</p></div>",
  "content_text": "Anyone who has studied the history of racially and culturally diverse societies\nknew this was inevitable\n:\nA complaint Friday alleged that Harvard University discriminates\nagainst Asian-American applicants by setting a higher bar for admissions\nthan that faced by other groups.\nThe complaint, filed by a\ncoalition of 64 organizations, says the university has set quotas to\nkeep the numbers of Asian-American students significantly lower than the\nquality of their applications merits. It cites third-party academic\nresearch on the SAT exam showing that Asian-Americans have to score on\naverage about 140 points higher than white students, 270 points higher\nthan Hispanic students and 450 points higher than African-American\nstudents to equal their chances of gaining admission to Harvard. The\nexam is scored on a 2400-point scale.\nThe complaint was filed with the U.S. Education Department’s Office for Civil Rights.\n“Many\nstudies have indicated that Harvard University has been engaged in\nsystemic and continuous discrimination against Asian-Americans during\nits very subjective ‘Holistic’ college admissions process,” the\ncomplaint alleges. The coalition is seeking a federal\ninvestigation and is requesting Harvard “immediately cease and desist\nfrom using stereotypes, racial biases and other discriminatory means in\nevaluating Asian-American applicants.”\nThis action is particularly significant for its symbolism; Harvard is the throne of American left-liberalism. But the nominally ideological alliance of minorities against the white majority was only going to last as long as the minorities felt they benefited more from that alliance than from flexing their muscle in their own direct interests. Based on what we’re seeing from the Asians in the political world, they are all but done with their “liberal” alliance with blacks, Jews, and Hispanics.\nIt won’t surprise me if Asians magically become more “conservative” in the next decade as they switch to a Yellow-White (Blue) alliance against the White (Red)-Black-Brown alliance. Politics in the USA and in the UK are becoming less about ideology and more about the straightforward racial power struggles that have historically characterized most diverse societies.\nAnd yes, I use the Red-Blue colors in their original form; Red being the appropriate color for those of the more socialist inclinations.",
  "tags": [
    "education",
    "politics"
  ],
  "categories": [],
  "sitemap_lastmod": "2015-05-21T06:59:00+00:00"
}