{
  "url": "https://voxday.net/2015/05/28/there-is-no-solution/",
  "scraped_at": "2025-12-16T12:57:21.808463",
  "title": "There is no solution",
  "date_display": "May 28, 2015",
  "date_iso": "2015-05-28T12:01:00+00:00",
  "date_from_url": "2015-05-28",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>It has largely ceased to be funny to see the demography ostriches burying their heads in the sand about the total failure of Melting Pot America, even as it rapidly disappears like a timer that’s been turned over.</p><blockquote class=\"tr_bq\"><p> YANKEE: VD thinks non westerners are too Dunb<br> to maintain a Republic like the U.S. When they are a majority.”</br></p><p>DAVID: And<br> non-Westerners continue to steadfastly prove him right. Look, it’s<br> really just this simple: if they were capable of doing so they would<br> have done so in their own countries. They have not, ergo, they can’t.</br></br></br></p><p>YANKEE: “Fine!<br> What’s the solution, VD? Furthermore, what’s your solution to America<br> housing all these blacks that you also believe Are incapable of<br> maintaining the U.S,?”</br></br></br></p></blockquote><p>There is no solution. There is no shiny secular science fiction “It’s a Small World” societies in the making. There are only the inevitable historical consequences of the demographic destruction of Anglo-Saxon America, which will likely follow one of the usual paths: a) subjection and eventual elimination of minorities, b) subjection and eventual elimination of the majority, c) partition, d) ethnic subsumption. For various reasons, I expect (c) to be the most likely in the USA and (a) to be the most likely in Europe.</p><p>Before you stick your head back in the sand, keep in mind that I am a Native American, an American Indian. Some of my relatives live on a small reservation of worthless land their conquerors have permitted them to keep, with a handful of people who know how to speak a language that is now almost entirely extinct. So, don’t tell me that the survival of your people, of your traditions, or of your way of life is a given. Because I can assure you, they most certainly are not.</p><p>The future belongs to those who show up for it. The future belongs to those who are determined to survive and are willing to defend their culture, their language, their genetics, and their traditions. Those who aren’t, won’t.</p></div>",
  "content_text": "It has largely ceased to be funny to see the demography ostriches burying their heads in the sand about the total failure of Melting Pot America, even as it rapidly disappears like a timer that’s been turned over.\nYANKEE: VD thinks non westerners are too Dunb\nto maintain a Republic like the U.S. When they are a majority.”\nDAVID: And\nnon-Westerners continue to steadfastly prove him right. Look, it’s\nreally just this simple: if they were capable of doing so they would\nhave done so in their own countries. They have not, ergo, they can’t.\nYANKEE: “Fine!\nWhat’s the solution, VD? Furthermore, what’s your solution to America\nhousing all these blacks that you also believe Are incapable of\nmaintaining the U.S,?”\nThere is no solution. There is no shiny secular science fiction “It’s a Small World” societies in the making. There are only the inevitable historical consequences of the demographic destruction of Anglo-Saxon America, which will likely follow one of the usual paths: a) subjection and eventual elimination of minorities, b) subjection and eventual elimination of the majority, c) partition, d) ethnic subsumption. For various reasons, I expect (c) to be the most likely in the USA and (a) to be the most likely in Europe.\nBefore you stick your head back in the sand, keep in mind that I am a Native American, an American Indian. Some of my relatives live on a small reservation of worthless land their conquerors have permitted them to keep, with a handful of people who know how to speak a language that is now almost entirely extinct. So, don’t tell me that the survival of your people, of your traditions, or of your way of life is a given. Because I can assure you, they most certainly are not.\nThe future belongs to those who show up for it. The future belongs to those who are determined to survive and are willing to defend their culture, their language, their genetics, and their traditions. Those who aren’t, won’t.",
  "tags": [
    "decline and fall",
    "Vibrancy is our strength"
  ],
  "categories": [],
  "sitemap_lastmod": "2015-05-28T11:01:00+00:00"
}