{
  "url": "https://voxday.net/2015/05/21/three-options/",
  "scraped_at": "2025-12-16T12:56:36.692031",
  "title": "Three options",
  "date_display": "May 21, 2015",
  "date_iso": "2015-05-21T21:28:00+00:00",
  "date_from_url": "2015-05-21",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>This is one of the first rational things I’ve seen the SJWs at File 770 produce in weeks:</p><blockquote class=\"tr_bq\"><p> <b>Nick Mamatas on May 21, 2015 at 9:21 am said: </b></p><p>There are three options as far I can tell:</p><p>The Hugos being a product a fandom, much of the discussion around “fixing” the issue boils down either angry blog posts about white people (ie, admissions of pathetic whining defeat) or statistical wonkery (ie foolishness). These are all wrongheaded—slating is essentially a political issue, and political issues need political responses. There are three possible ones:</p><p>1. Suck It Up.<br> Probably a pretty good idea. This bed was made some years ago when blogging culture sparked a shift from significant social sanction when people tried to get votes by asking publicly for consideration to “obligatory” posts promoting their own work, and later, the work of their friends. Loud Blogs win; Loud Blogs Plus Online Workshop-Clubhouses win more; and Loud Blogs plus political discipline win even more. Why should only the Loud Bloggers people have decided that they personally like and are “friends”* with win? Eventually, it’ll all even out, especially as what is most likely to happen is that the SPs get nominated and then lose decisively year after year.</br></p><p>2. Castigate all campaigning, not just the campaigning you don’t like<br> Pandora’s Box isn’t necessarily open forever. However, you can’t close half a lid. It would take significant effort to change widespread attitudes, but it is not as though those attitudes have not changed before. If campaigning was always met with eye-rolling or even outright disgust, it would stop being so effective. Some people would betray and try to promote, but if the audience was inured to such appeals, it just wouldn’t work and hopefuls would eventually stop.</br></p><p>3. Counter-slates<br> We’ll almost certainly see attempts at counter-slates. I’m against the idea, but the current cry to vote “No Award” in all SP-dominated categories is itself a counter-slate after a fashion. Someone will come up with Happy Kittens and stump for non-binary PoCs or stories with lots of scene breaks or or or…well, that’s the problem. One counter-slate would likely thwart the SPs, more than one would not. And we’re sure to see more than one. Disciplined slate voting works best when only one side does it and the other side isn’t even a side. Two slates split demographically. Three or more, uh… At any rate, it all comes around to political discipline again. If some party were to launch a counter-slate next year, would others who found that slate imperfect let it by without critique and another alternative slate. (There are actually two Puppy slates, but they are largely similar.) There can be slates that are so attractive that many more people sign up to vote for the Hugos, but I strongly suspect that people overestimate the amount of outside “pull” these slates have; general Hugo chatter across blogs and Twitter in general is driving increased education about supporting Worldcon memberships, and then there are all the free books voters might receive, which is also a new thing. One counter-slate would be effective, though of course the cure could be worse than the disease, and more than one would likely not.</br></p><p>So aggrieved Hugo Award followers, which shall it be?</p><p>Two is still the best bet.</p></blockquote><p>This is at least dealing with observable reality, unlike those who fantasize that tinkering with the rules is going to slow down any group that contains at least one individual with a brain, or worse, those who think that MOAR DISQUALIFY is magically going to accomplish anything. So, let’s consider their options from our perspective.</p><p>1. Suck it up</p><p>This is what they should have done. It would have taken a fair amount of the wind out of our sails. However, most of the potential benefits are now lost since they’ve already motivated our side through their histrionics and media-planted stories.</p><p>2. Castigate all campaigning</p><p>Won’t happen. Far too many people on their side are guilty of it, and far too many people are already invested in the idea that what is very, very bad for us is just fine for the Tor set and everyone who bought memberships for their children and extended families.</p><p>3. Counter-slates</p><p>This is the only real option for them now. It’s also the one that is most frightening for them, because it puts an end to their gentleman’s agreement to stick to logrolling and whisper campaigns as long as no one gets too greedy, and forces them to come out and compete in the open. They hate open competition on principle and the idea that they might come out for a fair fight next year and lose will strike them as so terrifying as to be beyond imagining. Furthermore, because they really, really care about winning awards, it’s going to be much harder for them to put together a slate, much less find the numbers to support it in the disciplined manner required now that a bloc of 40 votes is no longer sufficient to put something on the shortlist.</p><p>I’m not saying that Sad Puppies will automatically win a battle of slates, but that sort of honest and open competition suits us much better than it suits them. But I expect that next year there will be at least two rival slates, one of which will be centered around the Torlings.</p></div>",
  "content_text": "This is one of the first rational things I’ve seen the SJWs at File 770 produce in weeks:\nNick Mamatas on May 21, 2015 at 9:21 am said:\nThere are three options as far I can tell:\nThe Hugos being a product a fandom, much of the discussion around “fixing” the issue boils down either angry blog posts about white people (ie, admissions of pathetic whining defeat) or statistical wonkery (ie foolishness). These are all wrongheaded—slating is essentially a political issue, and political issues need political responses. There are three possible ones:\n1. Suck It Up.\nProbably a pretty good idea. This bed was made some years ago when blogging culture sparked a shift from significant social sanction when people tried to get votes by asking publicly for consideration to “obligatory” posts promoting their own work, and later, the work of their friends. Loud Blogs win; Loud Blogs Plus Online Workshop-Clubhouses win more; and Loud Blogs plus political discipline win even more. Why should only the Loud Bloggers people have decided that they personally like and are “friends”* with win? Eventually, it’ll all even out, especially as what is most likely to happen is that the SPs get nominated and then lose decisively year after year.\n2. Castigate all campaigning, not just the campaigning you don’t like\nPandora’s Box isn’t necessarily open forever. However, you can’t close half a lid. It would take significant effort to change widespread attitudes, but it is not as though those attitudes have not changed before. If campaigning was always met with eye-rolling or even outright disgust, it would stop being so effective. Some people would betray and try to promote, but if the audience was inured to such appeals, it just wouldn’t work and hopefuls would eventually stop.\n3. Counter-slates\nWe’ll almost certainly see attempts at counter-slates. I’m against the idea, but the current cry to vote “No Award” in all SP-dominated categories is itself a counter-slate after a fashion. Someone will come up with Happy Kittens and stump for non-binary PoCs or stories with lots of scene breaks or or or…well, that’s the problem. One counter-slate would likely thwart the SPs, more than one would not. And we’re sure to see more than one. Disciplined slate voting works best when only one side does it and the other side isn’t even a side. Two slates split demographically. Three or more, uh… At any rate, it all comes around to political discipline again. If some party were to launch a counter-slate next year, would others who found that slate imperfect let it by without critique and another alternative slate. (There are actually two Puppy slates, but they are largely similar.) There can be slates that are so attractive that many more people sign up to vote for the Hugos, but I strongly suspect that people overestimate the amount of outside “pull” these slates have; general Hugo chatter across blogs and Twitter in general is driving increased education about supporting Worldcon memberships, and then there are all the free books voters might receive, which is also a new thing. One counter-slate would be effective, though of course the cure could be worse than the disease, and more than one would likely not.\nSo aggrieved Hugo Award followers, which shall it be?\nTwo is still the best bet.\nThis is at least dealing with observable reality, unlike those who fantasize that tinkering with the rules is going to slow down any group that contains at least one individual with a brain, or worse, those who think that MOAR DISQUALIFY is magically going to accomplish anything. So, let’s consider their options from our perspective.\n1. Suck it up\nThis is what they should have done. It would have taken a fair amount of the wind out of our sails. However, most of the potential benefits are now lost since they’ve already motivated our side through their histrionics and media-planted stories.\n2. Castigate all campaigning\nWon’t happen. Far too many people on their side are guilty of it, and far too many people are already invested in the idea that what is very, very bad for us is just fine for the Tor set and everyone who bought memberships for their children and extended families.\n3. Counter-slates\nThis is the only real option for them now. It’s also the one that is most frightening for them, because it puts an end to their gentleman’s agreement to stick to logrolling and whisper campaigns as long as no one gets too greedy, and forces them to come out and compete in the open. They hate open competition on principle and the idea that they might come out for a fair fight next year and lose will strike them as so terrifying as to be beyond imagining. Furthermore, because they really, really care about winning awards, it’s going to be much harder for them to put together a slate, much less find the numbers to support it in the disciplined manner required now that a bloc of 40 votes is no longer sufficient to put something on the shortlist.\nI’m not saying that Sad Puppies will automatically win a battle of slates, but that sort of honest and open competition suits us much better than it suits them. But I expect that next year there will be at least two rival slates, one of which will be centered around the Torlings.",
  "tags": [
    "Hugo Award"
  ],
  "categories": [],
  "sitemap_lastmod": "2015-05-21T20:28:00+00:00"
}