{
  "url": "https://voxday.net/2015/05/07/violence-women-and-war/",
  "scraped_at": "2025-12-16T12:54:51.848015",
  "title": "Violence, women, and war",
  "date_display": "May 7, 2015",
  "date_iso": "2015-05-07T09:51:00+00:00",
  "date_from_url": "2015-05-07",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>One Owlmirror <a href=\"http://file770.com/?p=22330&amp;cpage=7#comment-257785\">attempts to claim it is reasonable</a> to conclude that I approve of violence towards feminist women:</p><blockquote class=\"tr_bq\"><p> I have something of a rant simmering on how it’s still reasonable to conclude that Vox Day approves of violence towards women (or more specifically, feminist women), despite the point (which you emphasized) that that’s not exactly what he wrote, but it’s long and kinda off-topic.”</p></blockquote><p>It is also false. I do not approve of initiating violence period. Not towards women, not towards feminist women, not towards anyone.</p><p>Is that insufficiently clear? Do I need to type more slowly for the message to sink in?</p><p>The idea that I approve of violence against women is entirely based on false accusations. Just to give one example, despite the fact that I have never addressed the shooting of Malala Yousafzai in any detail, much less supported it, a number of people have repeated the totally false claims by Popular Science and NPR that I am “on the record as supporting the Taliban’s attempt to assassinate Nobel Peace Prize winner Malala Yousifazi”. In fact, there is not a single post about Miss Yousafzai on this blog and my only reference to her was in a passing reference on Alpha Game in a post dealing with <a href=\"http://alphagameplan.blogspot.com/2013/10/the-wages-of-female-education.html\">the demographic implosion of Japan</a>.</p><p><i>“In light of the strong correlation between female education and demographic decline, a purely empirical perspective on Malala Yousafzai,<br> the poster girl for global female education, may indicate that the<br> Taliban’s attempt to silence her was perfectly rational and<br> scientifically justifiable.”</br></br></br></i></p><p>So, in the interest of setting the record straight, let’s go ahead and look at the Taliban’s attack on the young Pakistani woman to see whether the attack can reasonably be considered rational or not. (I will address the scientific element below.) And once you take the time to actually read about the historical context of the shooting, it rapidly becomes obvious that the decision of the Taliban to attack Malala Yousafzai was not a random act of irrational violence against women, but rather the rational and purposeful targeting of an individual they correctly considered to be a traitor in the employ of their enemies.</p><p>Most people are entirely unaware that Yousafzai was no mere “innocent<br> schoolgirl” who just happened to attend school, she was the daughter of a pro-Western activist, she had worked as a<br> paid propagandist for the BBC and other Western organizations for four<br> years, and she had even met with Richard Holbrooke before the “irrational”<br> Taliban finally decided to silence her. Given that her family “ran a chain of schools”, you could even make a reasonable case for her pro-education activism having been little more than a cynical marketing device on the part of her elders.</br></br></br></br></p><p>The Taliban has been fighting to defend their traditional way of life in their own tribal lands for 36 years. They have killed tens of thousands of people, from elite Spetsnaz soldiers to unarmed young women, in order to do so. It is quite clear that they will kill anyone who threatens that way of life, and considering how they have survived two invasions and occupations by two superpowers, their ruthlessness is not only rational, but understandable and even, from a strategic perspective, necessary and admirable. Less determined forces would have collapsed and surrendered years ago.</p><p>Does that mean I support the Taliban? Absolutely not. Does that mean I share their views? No. Does that mean I want to live the way they do? No.</p><p>But unlike PZ Myers and many people who apparently consider them nothing more than a momentarily useful rhetorical device, I take the Taliban seriously, for the obvious reason that anyone who can fight two numerically and technologically superior enemies to a standstill is obviously formidable and had damn well better be taken seriously. Fortunately, unlike ISIS, the Taliban appears to wish little more than to be left alone in Afghanistan and Pakistan.</p><p>Here is the question for the left-leaning seculars in our midst. Suppose a young girl in your country adopted a strongly anti-homosexual ideology, was employed by Iraqi and Syrian agencies, met in secret with a top Syrian official, and over the course of four years was successful in convincing tens of thousands of people in your country that homosexuals should be killed by throwing them off rooftops. Suppose hundreds of homosexuals had already been killed in this way thanks to her public calls for such executions. Would you support her arrest and execution or would you oppose it?</p><p>Even if you would oppose it on moral or legal grounds, isn’t it easier to see the Taliban’s attack as being an entirely rational one when framed in that context? I see the shooting of Malala Yousafzai as being very little different than the English burning of Joan of Arc or the UK’s hanging of William Joyce. It was an act of war aimed at an enemy effective, not a random and irrational act of violence rooted in prejudice.</p><p>It is also worth noting that the Taliban have<br> left Yousafzai alone now that she’s no longer living in Pakistan. They don’t appear to care if she wants to take her message to foreign populations elsewhere, but they will not permit her to spread pro-Western propaganda among their own people.</br></p><p>Cantus asked me a few questions about this a few days ago that I did not see until now:</p><blockquote class=\"tr_bq\"><p> How do you justify the assertion that you’ve “never gone on the record<br> as supporting the Taliban’s attempt on her life”? Are you arguing that<br> an action being “scientifically justifiable” does not amount to<br> supporting it? </br></br></br></p></blockquote><p>Because I did not support the Taliban’s attempt on Miss Yousafzai’s life. I merely observed that the attempt was a rational act given their perspective, which I do not share. Yes, I unequivocally state that the fact that an action is justifiable from a scientific perspective neither makes it moral nor desirable. There are many things I consider to be scientifically justifiable that I nevertheless do not support because I do not believe science to be an appropriate or reliable guide to human behavior.</p></div>",
  "content_text": "One Owlmirror\nattempts to claim it is reasonable\nto conclude that I approve of violence towards feminist women:\nI have something of a rant simmering on how it’s still reasonable to conclude that Vox Day approves of violence towards women (or more specifically, feminist women), despite the point (which you emphasized) that that’s not exactly what he wrote, but it’s long and kinda off-topic.”\nIt is also false. I do not approve of initiating violence period. Not towards women, not towards feminist women, not towards anyone.\nIs that insufficiently clear? Do I need to type more slowly for the message to sink in?\nThe idea that I approve of violence against women is entirely based on false accusations. Just to give one example, despite the fact that I have never addressed the shooting of Malala Yousafzai in any detail, much less supported it, a number of people have repeated the totally false claims by Popular Science and NPR that I am “on the record as supporting the Taliban’s attempt to assassinate Nobel Peace Prize winner Malala Yousifazi”. In fact, there is not a single post about Miss Yousafzai on this blog and my only reference to her was in a passing reference on Alpha Game in a post dealing with\nthe demographic implosion of Japan\n.\n“In light of the strong correlation between female education and demographic decline, a purely empirical perspective on Malala Yousafzai,\nthe poster girl for global female education, may indicate that the\nTaliban’s attempt to silence her was perfectly rational and\nscientifically justifiable.”\nSo, in the interest of setting the record straight, let’s go ahead and look at the Taliban’s attack on the young Pakistani woman to see whether the attack can reasonably be considered rational or not. (I will address the scientific element below.) And once you take the time to actually read about the historical context of the shooting, it rapidly becomes obvious that the decision of the Taliban to attack Malala Yousafzai was not a random act of irrational violence against women, but rather the rational and purposeful targeting of an individual they correctly considered to be a traitor in the employ of their enemies.\nMost people are entirely unaware that Yousafzai was no mere “innocent\nschoolgirl” who just happened to attend school, she was the daughter of a pro-Western activist, she had worked as a\npaid propagandist for the BBC and other Western organizations for four\nyears, and she had even met with Richard Holbrooke before the “irrational”\nTaliban finally decided to silence her. Given that her family “ran a chain of schools”, you could even make a reasonable case for her pro-education activism having been little more than a cynical marketing device on the part of her elders.\nThe Taliban has been fighting to defend their traditional way of life in their own tribal lands for 36 years. They have killed tens of thousands of people, from elite Spetsnaz soldiers to unarmed young women, in order to do so. It is quite clear that they will kill anyone who threatens that way of life, and considering how they have survived two invasions and occupations by two superpowers, their ruthlessness is not only rational, but understandable and even, from a strategic perspective, necessary and admirable. Less determined forces would have collapsed and surrendered years ago.\nDoes that mean I support the Taliban? Absolutely not. Does that mean I share their views? No. Does that mean I want to live the way they do? No.\nBut unlike PZ Myers and many people who apparently consider them nothing more than a momentarily useful rhetorical device, I take the Taliban seriously, for the obvious reason that anyone who can fight two numerically and technologically superior enemies to a standstill is obviously formidable and had damn well better be taken seriously. Fortunately, unlike ISIS, the Taliban appears to wish little more than to be left alone in Afghanistan and Pakistan.\nHere is the question for the left-leaning seculars in our midst. Suppose a young girl in your country adopted a strongly anti-homosexual ideology, was employed by Iraqi and Syrian agencies, met in secret with a top Syrian official, and over the course of four years was successful in convincing tens of thousands of people in your country that homosexuals should be killed by throwing them off rooftops. Suppose hundreds of homosexuals had already been killed in this way thanks to her public calls for such executions. Would you support her arrest and execution or would you oppose it?\nEven if you would oppose it on moral or legal grounds, isn’t it easier to see the Taliban’s attack as being an entirely rational one when framed in that context? I see the shooting of Malala Yousafzai as being very little different than the English burning of Joan of Arc or the UK’s hanging of William Joyce. It was an act of war aimed at an enemy effective, not a random and irrational act of violence rooted in prejudice.\nIt is also worth noting that the Taliban have\nleft Yousafzai alone now that she’s no longer living in Pakistan. They don’t appear to care if she wants to take her message to foreign populations elsewhere, but they will not permit her to spread pro-Western propaganda among their own people.\nCantus asked me a few questions about this a few days ago that I did not see until now:\nHow do you justify the assertion that you’ve “never gone on the record\nas supporting the Taliban’s attempt on her life”? Are you arguing that\nan action being “scientifically justifiable” does not amount to\nsupporting it?\nBecause I did not support the Taliban’s attempt on Miss Yousafzai’s life. I merely observed that the attempt was a rational act given their perspective, which I do not share. Yes, I unequivocally state that the fact that an action is justifiable from a scientific perspective neither makes it moral nor desirable. There are many things I consider to be scientifically justifiable that I nevertheless do not support because I do not believe science to be an appropriate or reliable guide to human behavior.",
  "tags": [
    "media",
    "war"
  ],
  "categories": [],
  "sitemap_lastmod": "2015-05-07T08:51:00+00:00"
}