{
  "url": "https://voxday.net/2015/05/26/voxs-first-law-at-work/",
  "scraped_at": "2025-12-16T12:57:08.783904",
  "title": "Vox’s First Law at work",
  "date_display": "May 26, 2015",
  "date_iso": "2015-05-26T16:57:00+00:00",
  "date_from_url": "2015-05-26",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>Vox’s First Law: Any sufficiently advanced intelligence is indistinguishable from insanity. Or, in this case, <a href=\"http://wakeup-world.com/2013/06/04/autistic-boy-discovers-gift-after-removal-from-state-run-therapy/\">autism</a>:</p><blockquote class=\"tr_bq\"><div style=\"text-align: justify;\"> State therapy specialists claimed Jacob<br> Barnett would never tie his shoes, read or function normally in society.<br> But the boy’s mother realized when Jacob was not in therapy, he was<br> doing “spectacular things” completely on his own.</br></br></br></div><div style=\"text-align: justify;\"></div><div style=\"text-align: justify;\"> She decided to trust her instinct and<br> disregard the advice of the professionals. Instead of following a<br> standardized special needs educational protocol, she surrounded Jacob<br> with all the things that inspired passion for him – and was astonished<br> at the transformation that took place.</br></br></br></br></div><div style=\"text-align: justify;\"> <b></b></div><p> Following a diagnosis of autism at age<br> two, Jacob was subjected to a cookie cutter special education system<br> that focused on correcting what he couldn’t do compared to normal<br> children. For years, teachers attempted to convince Kristine Barnett<br> that her son would only be able to learn the most basic of life skills….</br></br></br></br></p><div style=\"text-align: justify;\"></div><div style=\"text-align: justify;\"> By the time Jacob reached the age of 11, he entered college and is currently studying condensed matter physics at <i>Indiana University-Purdue University</i> in Indianapolis. According to an email Professor Scott Tremaine wrote to Jacob’s family:</div><blockquote><div style=\"text-align: justify;\"> “The theory that he’s working on<br> involves several of the toughest problems in astrophysics and<br> theoretical physics … Anyone who solves these will be in line for a<br> Nobel Prize.”</br></br></br></div></blockquote><p>Jacob also has an IQ of 170 — higher than that of Einstein.</p></blockquote><p>This is an object lesson in what we discussed at the May Brainstorm. Never, ever, blindly trust the so-called experts. Respect, but <i>verify</i>.</p></div>",
  "content_text": "Vox’s First Law: Any sufficiently advanced intelligence is indistinguishable from insanity. Or, in this case,\nautism\n:\nState therapy specialists claimed Jacob\nBarnett would never tie his shoes, read or function normally in society.\nBut the boy’s mother realized when Jacob was not in therapy, he was\ndoing “spectacular things” completely on his own.\nShe decided to trust her instinct and\ndisregard the advice of the professionals. Instead of following a\nstandardized special needs educational protocol, she surrounded Jacob\nwith all the things that inspired passion for him – and was astonished\nat the transformation that took place.\nFollowing a diagnosis of autism at age\ntwo, Jacob was subjected to a cookie cutter special education system\nthat focused on correcting what he couldn’t do compared to normal\nchildren. For years, teachers attempted to convince Kristine Barnett\nthat her son would only be able to learn the most basic of life skills….\nBy the time Jacob reached the age of 11, he entered college and is currently studying condensed matter physics at\nIndiana University-Purdue University\nin Indianapolis. According to an email Professor Scott Tremaine wrote to Jacob’s family:\n“The theory that he’s working on\ninvolves several of the toughest problems in astrophysics and\ntheoretical physics … Anyone who solves these will be in line for a\nNobel Prize.”\nJacob also has an IQ of 170 — higher than that of Einstein.\nThis is an object lesson in what we discussed at the May Brainstorm. Never, ever, blindly trust the so-called experts. Respect, but\nverify\n.",
  "tags": [
    "Brainstorm",
    "education"
  ],
  "categories": [],
  "sitemap_lastmod": "2015-05-26T15:57:00+00:00"
}