{
  "url": "https://voxday.net/2015/05/23/what-part-of-cruelty-artist-dont-you/",
  "scraped_at": "2025-12-16T12:56:45.520087",
  "title": "What part of “cruelty artist” don’t you understand?",
  "date_display": "May 23, 2015",
  "date_iso": "2015-05-23T12:00:00+00:00",
  "date_from_url": "2015-05-23",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><blockquote class=\"tr_bq\"><p> <a href=\"https://twitter.com/rooshv/status/601531577491927040\">Roosh@rooshv</a><br> Surprise: one of my committed haters @Popehat <a href=\"http://popehat.com/2015/05/21/happy-to-be-here/\">is mentally ill</a>, served time in an institution. I wish him the best</br></p><p> Popehat ‏@Popehat <br> @rooshv “committed haters” is actually pretty clever.</br></p><p>Popehat ‏@Popehat<br> .@rooshv Ken isn’t the Popehat blogger who hates you. Patrick is the one who hates you, you scrofulous little Ben-wa ball.</br></p><p>Vox Day @voxday<br> .@Popehat @rooshv Is this “Patrick” an actual person or one of the 16 Personalities of Popehat?</br></p></blockquote><p>I find it rather astonishing that anyone would be so naive as to imagine, in this day and Information Age, to think that it is a good idea to simultaneously a) be mentally ill and b) play attack dog on the Internet. If being medicated or otherwise under treatment for mental illness meant that one was to be regarded as off limits, it would be impossible to respond to an estimated one-in-five people and <a href=\"http://wilwheaton.net/2012/09/depression-lies/\">four-in-five SJWs</a>. So that’s a complete non-starter.</p><p>Now, I don’t wish disease of any kind on anyone. I never have and never will. I would very much like for everyone, even those who most hate me, to be healthy, happy, and well. But if you have a mental illness and you are foolish enough to attack me, then you can be certain that I will exploit your weakness to whatever extent I happen to find useful or amusing. Why? Because you gave up any claim to my sympathy or civility of your own free will when you decided to attack me or mine without provocation.</p><p>My advice to Ken White is threefold:</p><ol><li>Get off the Internet for your own good. Seriously. It’s no place for the depressed, the bipolar, or the schizophrenic. There is no way the form of conflict-laden communication it fosters will do anything but undermine your mental health.</li><li>If you won’t do that, then try to stay out of the hot zones. Based on my observations of the behavior of other mentally unstable individuals active on the Internet, at some point your illness is likely to lead you to write checks that your mental stability can’t cash.</li><li>If you insist on mixing it up on the Internet, then at the very least do not seek out and attack notoriously ruthless individuals like Roosh and me. We won’t hesitate to strike at your vulnerabilities and we don’t care about the opinion of the delicate souls who will dramatically take to their fainting couches at the horror of it all. Just leave us alone and we’ll leave you alone.</li></ol><p>My code of behavior is very simple and straightforward. Leave me alone and I will leave you alone. Start something and I will do my level best to finish it to my satisfaction, no matter how long it takes. So, once you’ve made it personal, don’t whine about how cruelly I take advantage of your feelings of worthlessness or complain about how viciously I exploit your sense of being a failure. All you had to do was leave me alone. And if you can’t manage something as simple as that, well, then perhaps you really are a stupid and worthless individual doomed to inevitable failure in life.</p><p>If you are weak, then for the love of God and anything else in which you happen to believe, <b><i>do not attack the strong!</i></b></p><p>One thing I think might be useful to keep in mind that the genuinely stable and self-confident individual has as much trouble understanding the perspective of the unstable and insecure person as the latter does the former. When I read Ken’s post about his breakdown and his struggles, my overwhelming impression was sheer bewilderment. He might as well have written it in Chinese for all that I related to it. And what’s more, in writing this post, I begin to understand just how evil and pernicious the behavior of the SJWs who constantly try to spin the false narrative of my incessant failure really is: I now understand that being mentally unstable themselves, they are intentionally attempting to provoke me into a psychological tailspin.</p><p>That is foolish for two reasons. First, I’m not susceptible to it. It will never, ever work on me because the effect is precisely the opposite of the one intended. In fact, it’s exactly what my track coach at university used to do in order to <i>motivate </i>my sprinters group on speed day. (NB: in the track world, sprinters are well known for being the most self-confident of athletes. As it is said, sprinters are born, not made, and you either have it or you don’t.) Second, and more important, their use of the tactic tells me precisely who is going to be most vulnerable to it.</p><p><i>And the Dark Lord laughed….</i></p></div>",
  "content_text": "Roosh@rooshv\nSurprise: one of my committed haters @Popehat\nis mentally ill\n, served time in an institution. I wish him the best\nPopehat ‏@Popehat\n@rooshv “committed haters” is actually pretty clever.\nPopehat ‏@Popehat\n.@rooshv Ken isn’t the Popehat blogger who hates you. Patrick is the one who hates you, you scrofulous little Ben-wa ball.\nVox Day @voxday\n.@Popehat @rooshv Is this “Patrick” an actual person or one of the 16 Personalities of Popehat?\nI find it rather astonishing that anyone would be so naive as to imagine, in this day and Information Age, to think that it is a good idea to simultaneously a) be mentally ill and b) play attack dog on the Internet. If being medicated or otherwise under treatment for mental illness meant that one was to be regarded as off limits, it would be impossible to respond to an estimated one-in-five people and\nfour-in-five SJWs\n. So that’s a complete non-starter.\nNow, I don’t wish disease of any kind on anyone. I never have and never will. I would very much like for everyone, even those who most hate me, to be healthy, happy, and well. But if you have a mental illness and you are foolish enough to attack me, then you can be certain that I will exploit your weakness to whatever extent I happen to find useful or amusing. Why? Because you gave up any claim to my sympathy or civility of your own free will when you decided to attack me or mine without provocation.\nMy advice to Ken White is threefold:\nGet off the Internet for your own good. Seriously. It’s no place for the depressed, the bipolar, or the schizophrenic. There is no way the form of conflict-laden communication it fosters will do anything but undermine your mental health.\nIf you won’t do that, then try to stay out of the hot zones. Based on my observations of the behavior of other mentally unstable individuals active on the Internet, at some point your illness is likely to lead you to write checks that your mental stability can’t cash.\nIf you insist on mixing it up on the Internet, then at the very least do not seek out and attack notoriously ruthless individuals like Roosh and me. We won’t hesitate to strike at your vulnerabilities and we don’t care about the opinion of the delicate souls who will dramatically take to their fainting couches at the horror of it all. Just leave us alone and we’ll leave you alone.\nMy code of behavior is very simple and straightforward. Leave me alone and I will leave you alone. Start something and I will do my level best to finish it to my satisfaction, no matter how long it takes. So, once you’ve made it personal, don’t whine about how cruelly I take advantage of your feelings of worthlessness or complain about how viciously I exploit your sense of being a failure. All you had to do was leave me alone. And if you can’t manage something as simple as that, well, then perhaps you really are a stupid and worthless individual doomed to inevitable failure in life.\nIf you are weak, then for the love of God and anything else in which you happen to believe,\ndo not attack the strong!\nOne thing I think might be useful to keep in mind that the genuinely stable and self-confident individual has as much trouble understanding the perspective of the unstable and insecure person as the latter does the former. When I read Ken’s post about his breakdown and his struggles, my overwhelming impression was sheer bewilderment. He might as well have written it in Chinese for all that I related to it. And what’s more, in writing this post, I begin to understand just how evil and pernicious the behavior of the SJWs who constantly try to spin the false narrative of my incessant failure really is: I now understand that being mentally unstable themselves, they are intentionally attempting to provoke me into a psychological tailspin.\nThat is foolish for two reasons. First, I’m not susceptible to it. It will never, ever work on me because the effect is precisely the opposite of the one intended. In fact, it’s exactly what my track coach at university used to do in order to\nmotivate\nmy sprinters group on speed day. (NB: in the track world, sprinters are well known for being the most self-confident of athletes. As it is said, sprinters are born, not made, and you either have it or you don’t.) Second, and more important, their use of the tactic tells me precisely who is going to be most vulnerable to it.\nAnd the Dark Lord laughed….",
  "tags": [
    "trainwreck"
  ],
  "categories": [],
  "sitemap_lastmod": "2015-05-23T11:00:00+00:00"
}