{
  "url": "https://voxday.net/2015/05/11/why-kids-hate-nerds/",
  "scraped_at": "2025-12-16T12:55:17.374824",
  "title": "Why kids hate nerds",
  "date_display": "May 11, 2015",
  "date_iso": "2015-05-11T10:30:00+00:00",
  "date_from_url": "2015-05-11",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p><a href=\"http://www.paulgraham.com/nerds.html\">Vanity is seldom popular</a>, but it is considerably less bearable for the average person in those who are more intelligent than the norm than in those who are more beautiful than the norm. At least with the physically vain, one has only to look at them. With the intellectually vain, one is far too often subjected to lectures in which the primary purpose is not to educate, inform, or discuss, but merely to demonstrate the knowledge and intellectual superiority of the lecturer.</p><blockquote class=\"tr_bq\"><p> I know a lot of people who were nerds in school, and they all tell the same story: there is a strong correlation between being smart and being a nerd, and an even stronger inverse correlation between being a nerd and being popular. Being smart seems to make you unpopular.</p><p>Why? To someone in school now, that may seem an odd question to ask. The mere fact is so overwhelming that it may seem strange to imagine that it could be any other way. But it could. Being smart doesn’t make you an outcast in elementary school. Nor does it harm you in the real world. Nor, as far as I can tell, is the problem so bad in most other countries. But in a typical American secondary school, being smart is likely to make your life difficult. Why?</p><p>The key to this mystery is to rephrase the question slightly. Why don’t smart kids make themselves popular? If they’re so smart, why don’t they figure out how popularity works and beat the system, just as they do for standardized tests?</p><p>One argument says that this would be impossible, that the smart kids are unpopular because the other kids envy them for being smart, and nothing they could do could make them popular. I wish. If the other kids in junior high school envied me, they did a great job of concealing it. And in any case, if being smart were really an enviable quality, the girls would have broken ranks. The guys that guys envy, girls like.</p><p>In the schools I went to, being smart just didn’t matter much. Kids didn’t admire it or despise it. All other things being equal, they would have preferred to be on the smart side of average rather than the dumb side, but intelligence counted far less than, say, physical appearance, charisma, or athletic ability.</p><p>So if intelligence in itself is not a factor in popularity, why are smart kids so consistently unpopular? The answer, I think, is that they don’t really want to be popular.</p><p>If someone had told me that at the time, I would have laughed at him. Being unpopular in school makes kids miserable, some of them so miserable that they commit suicide. Telling me that I didn’t want to be popular would have seemed like telling someone dying of thirst in a desert that he didn’t want a glass of water. Of course I wanted to be popular.</p><p>But in fact I didn’t, not enough. There was something else I wanted more: to be smart.</p></blockquote><p>I would go so far as to say that most smart people are considerably more vain about their intelligence than most beautiful people are vain about their beauty. And because intelligence is less easily perceived than beauty, they tend to go further out of their way to ensure that others know about it. In fact, one could even go so far as to suggest that the primary purpose of “nerd culture” is to foster nerd vanity by publicly staking an implied claim of superior intelligence that otherwise might go unremarked.</p><p>The vanity theme is supported by the observation that modestly smart people are far bitchier and hateful to those of genuinely high intelligence than the pretty girls are to the beautiful girls. As we’ve so often seen here, there is no one nastier on the subject of intelligence, or more dubious about the validity of IQ, than the +1 SD midwit whose illusions of intellectual superiority have been shattered.</p><p>The highly intelligent don’t want to be smart. It’s merely a simple fact of life, to be utilized or navigated as necessary. We are entirely accustomed to meeting with blank, uncomprehending faces practically every time we open our mouths without consciously dialing down our thoughts. (The befuddled response of the File 770 commenters to my simple reference to Aristotelian rhetoric is a good case in point.) The fact that we might occasionally use our intelligence to torment annoying midwits should be no more surprising than a beautiful girl using her looks to outshine a less attractive, self-appointed rival who has been relentlessly talking about her behind her back.</p><p>Should we, as adults, be beyond this things? Perhaps, but it’s readily observable that we are not. I daresay that even inside a Buddhist monastery, the same hierarchical social patterns can be readily observed.</p><p>I have to admit, I never got into nerd culture outside of its overlap with games. I didn’t join any of the defensive little nerd posses in school, although it is interesting to look back and observe that my three best friends from first grade were all National Merit scholars or semifinalists who went to RPI, Stanford, and Bucknell. Like tends to attract like. To this day, I still prefer to eat alone so that I can read while I’m eating. But I don’t dislike nerds either, except when they get intellectually insecure and start posturing and pontificating in defense of their easily wounded vanity.</p><p>It’s rather amusing, really. Any time I see someone going on and on about my supposed obsession with intelligence, I know exactly where to place him. The highly intelligent are much more inclined to shrug and say “so he’s smart, BFD, who isn’t?”</p></div>",
  "content_text": "Vanity is seldom popular\n, but it is considerably less bearable for the average person in those who are more intelligent than the norm than in those who are more beautiful than the norm. At least with the physically vain, one has only to look at them. With the intellectually vain, one is far too often subjected to lectures in which the primary purpose is not to educate, inform, or discuss, but merely to demonstrate the knowledge and intellectual superiority of the lecturer.\nI know a lot of people who were nerds in school, and they all tell the same story: there is a strong correlation between being smart and being a nerd, and an even stronger inverse correlation between being a nerd and being popular. Being smart seems to make you unpopular.\nWhy? To someone in school now, that may seem an odd question to ask. The mere fact is so overwhelming that it may seem strange to imagine that it could be any other way. But it could. Being smart doesn’t make you an outcast in elementary school. Nor does it harm you in the real world. Nor, as far as I can tell, is the problem so bad in most other countries. But in a typical American secondary school, being smart is likely to make your life difficult. Why?\nThe key to this mystery is to rephrase the question slightly. Why don’t smart kids make themselves popular? If they’re so smart, why don’t they figure out how popularity works and beat the system, just as they do for standardized tests?\nOne argument says that this would be impossible, that the smart kids are unpopular because the other kids envy them for being smart, and nothing they could do could make them popular. I wish. If the other kids in junior high school envied me, they did a great job of concealing it. And in any case, if being smart were really an enviable quality, the girls would have broken ranks. The guys that guys envy, girls like.\nIn the schools I went to, being smart just didn’t matter much. Kids didn’t admire it or despise it. All other things being equal, they would have preferred to be on the smart side of average rather than the dumb side, but intelligence counted far less than, say, physical appearance, charisma, or athletic ability.\nSo if intelligence in itself is not a factor in popularity, why are smart kids so consistently unpopular? The answer, I think, is that they don’t really want to be popular.\nIf someone had told me that at the time, I would have laughed at him. Being unpopular in school makes kids miserable, some of them so miserable that they commit suicide. Telling me that I didn’t want to be popular would have seemed like telling someone dying of thirst in a desert that he didn’t want a glass of water. Of course I wanted to be popular.\nBut in fact I didn’t, not enough. There was something else I wanted more: to be smart.\nI would go so far as to say that most smart people are considerably more vain about their intelligence than most beautiful people are vain about their beauty. And because intelligence is less easily perceived than beauty, they tend to go further out of their way to ensure that others know about it. In fact, one could even go so far as to suggest that the primary purpose of “nerd culture” is to foster nerd vanity by publicly staking an implied claim of superior intelligence that otherwise might go unremarked.\nThe vanity theme is supported by the observation that modestly smart people are far bitchier and hateful to those of genuinely high intelligence than the pretty girls are to the beautiful girls. As we’ve so often seen here, there is no one nastier on the subject of intelligence, or more dubious about the validity of IQ, than the +1 SD midwit whose illusions of intellectual superiority have been shattered.\nThe highly intelligent don’t want to be smart. It’s merely a simple fact of life, to be utilized or navigated as necessary. We are entirely accustomed to meeting with blank, uncomprehending faces practically every time we open our mouths without consciously dialing down our thoughts. (The befuddled response of the File 770 commenters to my simple reference to Aristotelian rhetoric is a good case in point.) The fact that we might occasionally use our intelligence to torment annoying midwits should be no more surprising than a beautiful girl using her looks to outshine a less attractive, self-appointed rival who has been relentlessly talking about her behind her back.\nShould we, as adults, be beyond this things? Perhaps, but it’s readily observable that we are not. I daresay that even inside a Buddhist monastery, the same hierarchical social patterns can be readily observed.\nI have to admit, I never got into nerd culture outside of its overlap with games. I didn’t join any of the defensive little nerd posses in school, although it is interesting to look back and observe that my three best friends from first grade were all National Merit scholars or semifinalists who went to RPI, Stanford, and Bucknell. Like tends to attract like. To this day, I still prefer to eat alone so that I can read while I’m eating. But I don’t dislike nerds either, except when they get intellectually insecure and start posturing and pontificating in defense of their easily wounded vanity.\nIt’s rather amusing, really. Any time I see someone going on and on about my supposed obsession with intelligence, I know exactly where to place him. The highly intelligent are much more inclined to shrug and say “so he’s smart, BFD, who isn’t?”",
  "tags": [
    "anklebiters",
    "society"
  ],
  "categories": [],
  "sitemap_lastmod": "2015-05-11T09:30:00+00:00"
}