{
  "url": "https://voxday.net/2015/05/26/you-dont-like-medicine-doctor/",
  "scraped_at": "2025-12-16T12:57:05.117452",
  "title": "You don’t like the medicine, doctor?",
  "date_display": "May 26, 2015",
  "date_iso": "2015-05-26T11:42:00+00:00",
  "date_from_url": "2015-05-26",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>Glenn Hauman on <a href=\"http://file770.com/?p=22740&amp;cpage=1#comment-269196\">May 26, 2015 at 2:20 am</a> said:<br/></p><blockquote class=\"tr_bq\"><p> Dave Freer: <i>No-one has called for a<br> boycott or blacklist of David Gerrold, or Glenn Hauman, or to have<br> their reputations tarnished and Amazon reviews deliberately lowered.</br></br></i></p><p>And yet they got bad reviews? What a coincidence! I <i>also</i> didn’t call for a boycott or blacklist, and yet somehow there’s a sudden rash of bad reviews of <i>my</i> books up on Amazon. See <a href=\"http://www.amazon.com/Star-Trek-Engineers-Creative-Couplings-ebook/dp/B000WJSA3I/ref=asap_bc?ie=UTF8\" rel=\"nofollow\">http://www.amazon.com/Star-Trek-Engineers-Creative-Couplings-ebook/dp/B000WJSA3I/ref=asap_bc?ie=UTF8</a></p></blockquote><p>No, Glenn Hauman didn’t call for a boycott or a blacklist, <i>he called for fake negative reviews to be posted on Amazon</i>, fake negative reviews which were immediately posted on Amazon in response to his calls for them.</p><blockquote class=\"tr_bq\"><p> Glenn Hauman on <a href=\"https://archive.is/UCk4j\">April 15, 2015</a><br> You can game Amazon ratings as well. Here’s a list of all of Mr. Beale’s nominees, complete with handy links to Amazon. It might be a good idea to take a look at the reviews and see which ones are helpful. If you’ve read the works, you should add your own review. Oh, and to answer the title question: what do you do to rabid puppies? <b>You put them down.</b></br></p><p>Glenn Hauman on <a href=\"http://file770.com/?p=22634&amp;cpage=1#comment-265683\">May 20, 2015</a><br> Just a reminder to all Hugo voters: After you’ve read items in the Hugo packet, you don’t have to confine any reviews of them to your own blogs and social media. Feel free to add them to Amazon as well.</br></p></blockquote><p>I see absolutely no evidence that the sudden rash of bad reviews of Mr. Hauman’s books reflect anything but the opinions of people who have read it and are honestly expressing their disappointment with their inferior quality. After all, absolutely no one has called for anyone to review or otherwise pay attention to his work at all. It must be, as Mr. “Put Them Down” himself has said, a mere coincidence.</p><p>And because Public Enemy is always appropriate:</p><p><i>He book-reviewed, he S.J.W’d<br>Vile minions viewed his anti-Puppy feud</br></i><br> <i>One-star the rating, listen to him double trouble<br>He signs in now he’s pushing for the lower level<br>Like crashing cars he’s out there stealing stars</br></br></i><br> <i>From books he took without a single look.<br>Taking a toll ’cause his soul broke with the poll<br>From the revelation… of a Puppy Nation.</br></br></i><br> <i>Now this is what I mean an anti-Puppy machine</i><br> <i>If Hugo come out at all, he won’t come out clean<br>But look around here go the sound of the wrecking clown<br>Boom and pound when he put ’em down </br></br></i></br></br></br></br></p></div>",
  "content_text": "Glenn Hauman on\nMay 26, 2015 at 2:20 am\nsaid:\nDave Freer:\nNo-one has called for a\nboycott or blacklist of David Gerrold, or Glenn Hauman, or to have\ntheir reputations tarnished and Amazon reviews deliberately lowered.\nAnd yet they got bad reviews? What a coincidence! I\nalso\ndidn’t call for a boycott or blacklist, and yet somehow there’s a sudden rash of bad reviews of\nmy\nbooks up on Amazon. See\nhttp://www.amazon.com/Star-Trek-Engineers-Creative-Couplings-ebook/dp/B000WJSA3I/ref=asap_bc?ie=UTF8\nNo, Glenn Hauman didn’t call for a boycott or a blacklist,\nhe called for fake negative reviews to be posted on Amazon\n, fake negative reviews which were immediately posted on Amazon in response to his calls for them.\nGlenn Hauman on\nApril 15, 2015\nYou can game Amazon ratings as well. Here’s a list of all of Mr. Beale’s nominees, complete with handy links to Amazon. It might be a good idea to take a look at the reviews and see which ones are helpful. If you’ve read the works, you should add your own review. Oh, and to answer the title question: what do you do to rabid puppies?\nYou put them down.\nGlenn Hauman on\nMay 20, 2015\nJust a reminder to all Hugo voters: After you’ve read items in the Hugo packet, you don’t have to confine any reviews of them to your own blogs and social media. Feel free to add them to Amazon as well.\nI see absolutely no evidence that the sudden rash of bad reviews of Mr. Hauman’s books reflect anything but the opinions of people who have read it and are honestly expressing their disappointment with their inferior quality. After all, absolutely no one has called for anyone to review or otherwise pay attention to his work at all. It must be, as Mr. “Put Them Down” himself has said, a mere coincidence.\nAnd because Public Enemy is always appropriate:\nHe book-reviewed, he S.J.W’d\nVile minions viewed his anti-Puppy feud\nOne-star the rating, listen to him double trouble\nHe signs in now he’s pushing for the lower level\nLike crashing cars he’s out there stealing stars\nFrom books he took without a single look.\nTaking a toll ’cause his soul broke with the poll\nFrom the revelation… of a Puppy Nation.\nNow this is what I mean an anti-Puppy machine\nIf Hugo come out at all, he won’t come out clean\nBut look around here go the sound of the wrecking clown\nBoom and pound when he put ’em down",
  "tags": [
    "SJW"
  ],
  "categories": [],
  "sitemap_lastmod": "2015-05-26T10:42:00+00:00"
}