{
  "url": "https://voxday.net/2010/02/23/arrest-banksters/",
  "scraped_at": "2026-01-08T23:20:16.413013",
  "title": "Arrest the banksters",
  "date_display": "February 23, 2010",
  "date_iso": "2010-02-23T18:15:00+00:00",
  "date_from_url": "2010-02-23",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>At this point in the depressionary spiral, I’d just about be willing to settle for the “stop” sense of the word.  Karl Denninger <a href=\"http://market-ticker.denninger.net/archives/1993-How-Long-Before-You-Wake-Up,-Politicos.html\">correctly points out that the American people absolutely will not accept another AIG bailout</a>, this time of sovereign debt of European countries:</p><blockquote><p>Yes, I know all about the stock market rally from last March.  I know all about the claimed GDP “improvement.”  But I also know that we got both by adding more than $2 trillion in debt to the United States – or roughly 14% of GDP – over the space of the last 18 months.  That’s about 10% of GDP annualized, and incidentally, a 10% GDP contraction is the common economist’s definition of an Economic Depression.</p><p>So let’s cut the crap – we are in a Depression right now.  We are pretending we are not, just like you can pretend you didn’t really lose your job so long as your credit card does not reach its limit.  We have been in that depression for about 18 months and there is no evidence that we will exit it, as we have yet to find a way to pull back the deficit spending without an instantaneous collapse in the economy.</p><p>Yet at some point we must and will stop.  We will either do so of our own volition, or we will do so when the cost of borrowing skyrockets, as others get tired of funding our profligacy.  If we attempt to “print” our way out of it the cost of petroleum products will shoot the moon and destroy our economy anyway.</p><p>You haven’t seen the half of what happened though – not yet.  It appears that AIG – the company we have bailed out (thus far) to the tune of some $100 billion plus, in fact isn’t done.  It appears they may have written credit protection on Greece.  If this allegation by the German equivalent to The New York Times is true Americans are going to be asked to pay billions of dollars – or more likely, hundreds of billions (since Greece is almost certainly not the only place – try Spain, Portugal, Ireland, etc) to bail out a bunch of FOREIGN NATIONS.</p><p>Do you both think Americans can and will pay that bill?  A bill that has been forced on us, and yet benefits not The United States economy, but foreigners?</p><p>Wars – big wars – start over much less, my friends.</p></blockquote><p>It’s time for the federal government to start arresting and jailing the banksters, now, because I suspect the alternative to being prosecuted for their criminal financial rape of America is going to be even less pleasant .  The sense of popular fury is palpably building even though Washington is still managing to hold things together through this last-ditch gigantic spending spree.  Once it becomes obvious that it has failed – just to give one example, the FDIC reported today that in Q409 it managed to lose nearly half the $45 billion in three years of pre-paid fees it collected – it is likely to get very ugly indeed.</p><p>This isn’t rocket science.  It really isn’t.  Because it is simply not possible to shift from a manufacturing economy to a “service” economy wherein the services consist of little more than gambling with imaginary numbers and still expect a society to remain stable.  The apparent failure to understand that bread and circuses <i>requires not screwing around with the reliable delivery of bread and circuses</i> is really astonishing.  The Romans understood this; the one place they didn’t let the provincial governors use as a tool for personal enrichment was Egypt, for the very good reason was that it was Rome’s granary.</p><p>I’m not a fan of unaccountable ruling elites, but as long as we’re stuck with one, is it really too much to expect them to be at least a somewhat competent?</p></div>",
  "content_text": "At this point in the depressionary spiral, I’d just about be willing to settle for the “stop” sense of the word.  Karl Denninger\ncorrectly points out that the American people absolutely will not accept another AIG bailout\n, this time of sovereign debt of European countries:\nYes, I know all about the stock market rally from last March.  I know all about the claimed GDP “improvement.”  But I also know that we got both by adding more than $2 trillion in debt to the United States – or roughly 14% of GDP – over the space of the last 18 months.  That’s about 10% of GDP annualized, and incidentally, a 10% GDP contraction is the common economist’s definition of an Economic Depression.\nSo let’s cut the crap – we are in a Depression right now.  We are pretending we are not, just like you can pretend you didn’t really lose your job so long as your credit card does not reach its limit.  We have been in that depression for about 18 months and there is no evidence that we will exit it, as we have yet to find a way to pull back the deficit spending without an instantaneous collapse in the economy.\nYet at some point we must and will stop.  We will either do so of our own volition, or we will do so when the cost of borrowing skyrockets, as others get tired of funding our profligacy.  If we attempt to “print” our way out of it the cost of petroleum products will shoot the moon and destroy our economy anyway.\nYou haven’t seen the half of what happened though – not yet.  It appears that AIG – the company we have bailed out (thus far) to the tune of some $100 billion plus, in fact isn’t done.  It appears they may have written credit protection on Greece.  If this allegation by the German equivalent to The New York Times is true Americans are going to be asked to pay billions of dollars – or more likely, hundreds of billions (since Greece is almost certainly not the only place – try Spain, Portugal, Ireland, etc) to bail out a bunch of FOREIGN NATIONS.\nDo you both think Americans can and will pay that bill?  A bill that has been forced on us, and yet benefits not The United States economy, but foreigners?\nWars – big wars – start over much less, my friends.\nIt’s time for the federal government to start arresting and jailing the banksters, now, because I suspect the alternative to being prosecuted for their criminal financial rape of America is going to be even less pleasant .  The sense of popular fury is palpably building even though Washington is still managing to hold things together through this last-ditch gigantic spending spree.  Once it becomes obvious that it has failed – just to give one example, the FDIC reported today that in Q409 it managed to lose nearly half the $45 billion in three years of pre-paid fees it collected – it is likely to get very ugly indeed.\nThis isn’t rocket science.  It really isn’t.  Because it is simply not possible to shift from a manufacturing economy to a “service” economy wherein the services consist of little more than gambling with imaginary numbers and still expect a society to remain stable.  The apparent failure to understand that bread and circuses\nrequires not screwing around with the reliable delivery of bread and circuses\nis really astonishing.  The Romans understood this; the one place they didn’t let the provincial governors use as a tool for personal enrichment was Egypt, for the very good reason was that it was Rome’s granary.\nI’m not a fan of unaccountable ruling elites, but as long as we’re stuck with one, is it really too much to expect them to be at least a somewhat competent?",
  "tags": [
    "banks"
  ],
  "categories": [],
  "sitemap_lastmod": "2010-02-23T18:15:00+00:00"
}