{
  "url": "https://voxday.net/2010/02/16/atheists-dont-respect-invididual-rights/",
  "scraped_at": "2026-01-08T23:19:36.426268",
  "title": "Atheists hate individual rights",
  "date_display": "February 16, 2010",
  "date_iso": "2010-02-16T10:09:00+00:00",
  "date_from_url": "2010-02-16",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>It is much easier to understand Christianity once one comes to an acceptance of the existence of evil.  In like manner, it is much easier to understand the link between Christianity and the concept of unalienable individual rights once one realizes that atheists who hate the former almost always hate the latter as well.  As he does so well, PZ Myers once more provides the useful service of giving us <a href=\"http://scienceblogs.com/pharyngula/2010/02/libertarianism_defined.php\">a glimpse into the warped and irrational mind</a> of the militant atheist:</p><blockquote><p>It has been revealed that I’m a fan of Iain Banks. On my last long flight, I read his latest, Transition, which is a SF novel about people who can shift to alternate streams of reality, and who choose to meddle. One of the heroes of the story, Mrs Mulverhill, is explaining to another character about the various bizarre forms of government they find in alternate time-lines, and she defines one of the more freakishly weird.</p><p>“Libertarianism. A simple-minded right-wing ideology ideally suited to those unable or unwilling to see past their own sociopathic self-regard.”</p><p>That is perfectly in line with my own sentiments. Libertarianism isn’t so much a political and economic movement as it is a widespread pathology.</p></blockquote><p>It is truly remarkable how an educated skepticism regarding the factual realities of the abuse of government power over millennia of recorded human history is somehow translated into “sociopathic self-regard” in the mind of the militant atheist.  The godless Left, from Meslier and Marx to Kim Jong-Il and the Eurocrats, is obsessed with the notion of remaking Man in its own vision.  There is never any possibility of principled, educated, and intelligent opposition to their fanciful visions of collectivist utopia, there is only pathology that <i>ist verboten</i>.  The atheist left is always, without fail, totalitarian at heart.  Consider these chilling words from <a href=\"http://www.socialistreview.org.uk/article.php?articlenumber=10267\">Iain Banks’s interview with Socialist Review</a>:</p><p><i><b>Is the Culture your vision of what humanity could, or should, be in the future?</b></i></p><p>“Yes! We’ll be lucky ever to achieve it. I think the only way a species like us could ever get to be like the Culture in the first place would be through genetic manipulation. Suppose there is some sort of mix of genes that predisposes us to racism, sexism and homophobia – I think we’d need to knock that out and we could become quite nice people…. for me it’s the ideal functioning utopia”</p><p>Banks is a very good science fiction writer with a Leninesque soul.  In addition to being entertaining, his works show how the twin specters of eugenics and totalitarian dictatorship are always lurking in the shadowy hearts of the scientific godless.  This is because fools who lack the beginning of knowledge will always seek to make themselves gods.  It is not an accident that Christopher Hitchens still refuses to hear one word against Marx and dialectical materialism.  It is not happenstance that the first atheist philosopher was honored by the Bolsheviks after the October Revolution.  And it is not a coincidence that so many atheists happen to loathe both God and individual liberty.</p><p>And this comment from Banks says all you need to know about the total futility of atheist attempts to synthesize morality: <i>“They are a very, very advanced society with quite good morals really. They occasionally resort to dirty tricks, but they can always prove it was the right thing to do because they use statistics.”</i></p><p>Statistics….  Aristotle wept.</p></div>",
  "content_text": "It is much easier to understand Christianity once one comes to an acceptance of the existence of evil.  In like manner, it is much easier to understand the link between Christianity and the concept of unalienable individual rights once one realizes that atheists who hate the former almost always hate the latter as well.  As he does so well, PZ Myers once more provides the useful service of giving us\na glimpse into the warped and irrational mind\nof the militant atheist:\nIt has been revealed that I’m a fan of Iain Banks. On my last long flight, I read his latest, Transition, which is a SF novel about people who can shift to alternate streams of reality, and who choose to meddle. One of the heroes of the story, Mrs Mulverhill, is explaining to another character about the various bizarre forms of government they find in alternate time-lines, and she defines one of the more freakishly weird.\n“Libertarianism. A simple-minded right-wing ideology ideally suited to those unable or unwilling to see past their own sociopathic self-regard.”\nThat is perfectly in line with my own sentiments. Libertarianism isn’t so much a political and economic movement as it is a widespread pathology.\nIt is truly remarkable how an educated skepticism regarding the factual realities of the abuse of government power over millennia of recorded human history is somehow translated into “sociopathic self-regard” in the mind of the militant atheist.  The godless Left, from Meslier and Marx to Kim Jong-Il and the Eurocrats, is obsessed with the notion of remaking Man in its own vision.  There is never any possibility of principled, educated, and intelligent opposition to their fanciful visions of collectivist utopia, there is only pathology that\nist verboten\n.  The atheist left is always, without fail, totalitarian at heart.  Consider these chilling words from\nIain Banks’s interview with Socialist Review\n:\nIs the Culture your vision of what humanity could, or should, be in the future?\n“Yes! We’ll be lucky ever to achieve it. I think the only way a species like us could ever get to be like the Culture in the first place would be through genetic manipulation. Suppose there is some sort of mix of genes that predisposes us to racism, sexism and homophobia – I think we’d need to knock that out and we could become quite nice people…. for me it’s the ideal functioning utopia”\nBanks is a very good science fiction writer with a Leninesque soul.  In addition to being entertaining, his works show how the twin specters of eugenics and totalitarian dictatorship are always lurking in the shadowy hearts of the scientific godless.  This is because fools who lack the beginning of knowledge will always seek to make themselves gods.  It is not an accident that Christopher Hitchens still refuses to hear one word against Marx and dialectical materialism.  It is not happenstance that the first atheist philosopher was honored by the Bolsheviks after the October Revolution.  And it is not a coincidence that so many atheists happen to loathe both God and individual liberty.\nAnd this comment from Banks says all you need to know about the total futility of atheist attempts to synthesize morality:\n“They are a very, very advanced society with quite good morals really. They occasionally resort to dirty tricks, but they can always prove it was the right thing to do because they use statistics.”\nStatistics….  Aristotle wept.",
  "tags": [
    "atheism",
    "politics"
  ],
  "categories": [],
  "sitemap_lastmod": "2010-02-16T10:09:00+00:00"
}