{
  "url": "https://voxday.net/2010/02/18/bankocracy-and-consequences-of-mora/",
  "scraped_at": "2026-01-08T23:19:45.552856",
  "title": "Bankocracy and the consequences of moral hazard",
  "date_display": "February 18, 2010",
  "date_iso": "2010-02-18T10:31:00+00:00",
  "date_from_url": "2010-02-18",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>I strongly suspect that <a href=\"http://blog.atimes.net/?p=1357\">this widespread fury and total disrespect</a> for the ruling bankocracy that passes for “law” is on its way to America.  And it will probably be much sooner than anyone imagines:</p><blockquote><p>The country is sliding into psychological despair within a cocoon of unrequited desires that have been inflamed and legitimized over the years. Anger is rampant. Yesterday on the bus a student gave his ticket to a lady, telling her that she should use his ticket because he was getting off. Someone called out that this was shameful “thievery” to which the youngster responded: “I am stealing 50 cents but the government and the banks have stolen 50 billion!” Many nodded in approval.</p><p>Prime Minister Papandreou was on television last night, white as a ghost. He was telling the Greek press that he was thankful that the IMF was “offering” their technical expertise (technognosia) to Greece. Yes money is not coming, but how sweet of the IMF to be sending its experts to dictate terms over the next few weeks. It seems that someone in Europe gave him the unexpected news that the party is over. This reality has not yet even remotely begun to set in here. The media are giving the message that “the Europeans can’t afford to let Greece go under….that Europe stands to lose too much….that Merkel and those stuffy Northerners will have to come to Greece’s aid.”</p><p>When the reality does start seeping in—hold on to your hats….</p></blockquote><p>The unmitigated evil of TARP, the nationalization of Fannie and Freddie, and the banking bailouts really cannot be exaggerated.  The total fiction of the necessity to guarantee bank profits, the total disregard for the rule of law involved in the sorcerous transmutation of Goldman Sachs and Morgan Stanley from leaden insolvent investment banks into golden government-backed bank holding companies, and the utter contempt for the will of the American people has planted the seed for a number of extraordinarily negative consequences that will far outweigh the costs of a few big banks going out of business and a few thousand banksters losing their jobs.</p><p>I always wondered why the peasants didn’t recognize that the medieval aristocracy was shamelessly feeding off them without offering them anything substantial in return.  That historical mystery is much easier to understand now, as people are losing their jobs, losing their homes, struggling to feed their children, and facing an increasingly bleak future while banksters are paying themselves literal billions for successfully defrauding the government, the politicians, the taxpayers through selling the myth of their societal necessity.  This is not the result of the free market, this is not capitalism, and this is most certainly not human liberty, this is nothing more than bankocracy every bit as oligarchic, dishonest, and terminally short-sighted as the nominally socialist Soviet nomenklatura system.</p><p>And it will fail, as such systems always fail, because the final generations of the ruling aristocracy are so much more short-sighted and greedy than their fathers.  They are too blinded by their misguided belief in their own importance to realize that the system will only work so long as the workers, the middle class, and the entrepeneurs receive a sufficient share of the wealth to play along with the game.  Once the productive masses of society realize that the deck is stacked so heavily against them, they’ll not only quit playing, they will begin imitating their betters and turning to theft in the place of hard work and fraud in the place of frugality.  Naturally, the praetorian authorities will crack down hard; witness how the bureaucratic leeches in the UK have blatantly – and suicidally – <a href=\"http://business.timesonline.co.uk/tol/business/law/article7029806.ece\">ignored UK law</a> in order to attempt expanding their tax reach while simultaneously attempting to <a href=\"http://www.telegraph.co.uk/news/uknews/7259289/Councils-afraid-to-say-how-much-they-pay-chiefs.html\">hide from the public how much they are paid</a>.</p><p>But such efforts are always doomed to failure and the mere fact that governments are engaging in them is a strong indicator of a coming structural collapse.  And the harder that they try to grip, the more people will slip out of their control by the mechanism of simply abandoning their roles as honest, productive members of society.  After all, how can one possibly object to those who steal cents when the bankocracy is stealing billions?</p></div>",
  "content_text": "I strongly suspect that\nthis widespread fury and total disrespect\nfor the ruling bankocracy that passes for “law” is on its way to America.  And it will probably be much sooner than anyone imagines:\nThe country is sliding into psychological despair within a cocoon of unrequited desires that have been inflamed and legitimized over the years. Anger is rampant. Yesterday on the bus a student gave his ticket to a lady, telling her that she should use his ticket because he was getting off. Someone called out that this was shameful “thievery” to which the youngster responded: “I am stealing 50 cents but the government and the banks have stolen 50 billion!” Many nodded in approval.\nPrime Minister Papandreou was on television last night, white as a ghost. He was telling the Greek press that he was thankful that the IMF was “offering” their technical expertise (technognosia) to Greece. Yes money is not coming, but how sweet of the IMF to be sending its experts to dictate terms over the next few weeks. It seems that someone in Europe gave him the unexpected news that the party is over. This reality has not yet even remotely begun to set in here. The media are giving the message that “the Europeans can’t afford to let Greece go under….that Europe stands to lose too much….that Merkel and those stuffy Northerners will have to come to Greece’s aid.”\nWhen the reality does start seeping in—hold on to your hats….\nThe unmitigated evil of TARP, the nationalization of Fannie and Freddie, and the banking bailouts really cannot be exaggerated.  The total fiction of the necessity to guarantee bank profits, the total disregard for the rule of law involved in the sorcerous transmutation of Goldman Sachs and Morgan Stanley from leaden insolvent investment banks into golden government-backed bank holding companies, and the utter contempt for the will of the American people has planted the seed for a number of extraordinarily negative consequences that will far outweigh the costs of a few big banks going out of business and a few thousand banksters losing their jobs.\nI always wondered why the peasants didn’t recognize that the medieval aristocracy was shamelessly feeding off them without offering them anything substantial in return.  That historical mystery is much easier to understand now, as people are losing their jobs, losing their homes, struggling to feed their children, and facing an increasingly bleak future while banksters are paying themselves literal billions for successfully defrauding the government, the politicians, the taxpayers through selling the myth of their societal necessity.  This is not the result of the free market, this is not capitalism, and this is most certainly not human liberty, this is nothing more than bankocracy every bit as oligarchic, dishonest, and terminally short-sighted as the nominally socialist Soviet nomenklatura system.\nAnd it will fail, as such systems always fail, because the final generations of the ruling aristocracy are so much more short-sighted and greedy than their fathers.  They are too blinded by their misguided belief in their own importance to realize that the system will only work so long as the workers, the middle class, and the entrepeneurs receive a sufficient share of the wealth to play along with the game.  Once the productive masses of society realize that the deck is stacked so heavily against them, they’ll not only quit playing, they will begin imitating their betters and turning to theft in the place of hard work and fraud in the place of frugality.  Naturally, the praetorian authorities will crack down hard; witness how the bureaucratic leeches in the UK have blatantly – and suicidally –\nignored UK law\nin order to attempt expanding their tax reach while simultaneously attempting to\nhide from the public how much they are paid\n.\nBut such efforts are always doomed to failure and the mere fact that governments are engaging in them is a strong indicator of a coming structural collapse.  And the harder that they try to grip, the more people will slip out of their control by the mechanism of simply abandoning their roles as honest, productive members of society.  After all, how can one possibly object to those who steal cents when the bankocracy is stealing billions?",
  "tags": [
    "banks",
    "politics"
  ],
  "categories": [],
  "sitemap_lastmod": "2010-02-18T10:31:00+00:00"
}