{
  "url": "https://voxday.net/2010/02/21/but-but-hes-unelectable-2/",
  "scraped_at": "2026-01-08T23:20:03.419570",
  "title": "But, but… he’s UNELECTABLE",
  "date_display": "February 21, 2010",
  "date_iso": "2010-02-21T14:29:00+00:00",
  "date_from_url": "2010-02-21",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>Ron Paul <a href=\"http://www.cnn.com/2010/POLITICS/02/20/conservatives.meeting/index.html?section=cnn_latest\">wins the CPAC straw poll</a>:</p><blockquote><p>U.S. Rep. Ron Paul, R-Texas, a stalwart foe of government spending, won a blowout victory Saturday in the annual Conservative Political Action Conference presidential straw poll.  With participants naming “reducing the size of federal government” as their top issue, the 74-year old libertarian hero captured 31 percent of the 2,400 votes cast in the annual contest, usually seen as a barometer of how the GOP’s conservative wing regards their potential presidential candidates.</p><p>Former Massachusetts Gov. Mitt Romney finished second with 22 percent of the vote, ending a three-year winning streak at CPAC. Former Alaska Gov. Sarah Palin finished third with 7 percent of the vote, followed by Minnesota Gov. Tim Pawlenty at 6 percent and Indiana Rep. Mike Pence at 5 percent.</p></blockquote><p>Needless to say, this straw poll win won’t be trumpeted by the NY/DC Axis Republicans the way it would have if Romney or Jindal had won.  It is astonishing how they continue to argue that a liberal Mormon from Massachusetts or an Indian from Louisiana is going to have more national appeal than the libertarian Texan who everyone now knows was correct about the failed World Democratic Revolution, correct about the financial crisis, and correct about TARP and the banking bailouts.</p><p>Ron Paul would have beaten Obama because his positions were in alignment with the American people rather than with the financial elite.  John McCain couldn’t because his weren’t.  McCain had the election and threw it away by siding with Goldman Sachs, Citigroup, and the Federal Reserve rather than with the voters.  Look at the alternatives now.  Romney is a liberal Mormon; he’s about as electable as an Aztec priest.  Palin is a political rock star, but she’s a lightweight and won’t be running if she has any sense at all because she’d be throwing away a very lucrative career in what passes for political commentary these days.  Jindal is a lightweight who looks and talks funny.  Pawlenty is an unprincipled snake, which is probably why the neocons are talking him up.   I don’t like Huckabee, but he’s probably the only other serious candidate in the bunch.</p><p>With apologies to Ann Coulter, if you call yourself a conservative but don’t support Ron Paul due to his foreign policy, you’re neither economically literate nor are you truly conservative.  It doesn’t matter how afraid of Iranian nukes you are or how sexually aroused you become at the thought of invading foreign lands because the great terrorist hunt and the world democratic revolution are rapidly coming to an end for lack of funding.  This will become abundantly clear with the first failed Treasury auction or when the bank meltdowns begin to pick up speed.  Ron Paul is the only Republican candidate who realizes this, which is precisely why he is the only viable Republican candidate in 2012 in much the same way that he was the only viable candidate in 2008.</p><p>Running another Wall Street-approved, neocon-vetted presidential candidate is about the only way the Republicans can guarantee an Obama victory in 2012.  So, it won’t surprise me in the least if that is precisely what they do.  If, on the other hand, they actually want to win, the ideal candidacy would probably be a Paul-Palin ticket.  The economic situation is not about to get better, so the bipartisan appeal of Paul’s message is only going to grow.</p><p>It seems Robert Costa is, along with Jonah Goldberg and John Derbyshire, one of the few remaining voices of sanity at National Review: <i>“There may have been some boos, but Paul was by far one of the more popular speakers at CPAC this year. “End the Fed!” was one of most-heard chants and his “Campaign for Liberty” group was everywhere… Unlike the 2012 wannabes, Paul doesn’t play coy: He has a manifesto and wants to broadcast it. Period. No worries about the media spin or whether the speech gets headlines (see Pawlenty, Tiger doctrine). And, instead of the usual anti-Obama talk, Paul framed a hefty chunk of his CPAC address upon a critique of Woodrow Wilson. And the crowd dug it.</i></p><p>Some older CPAC attendees don’t seem to care much for the Texas congressman, sure, but many young activists seem to regard him as a hero of sorts. When he talks about the debt, like he did on Friday, calling it a “monster” that will “eat up” our future, it was with a passion that you can’t fake in politics. He also didn’t mind challenging many of the room’s security hawks on foreign policy. “There is nothing wrong with being a conservative and having a conservative belief in foreign policy where we have a strong national defense and don’t go to war so carelessly,” Paul said. That line was met with a lot of silence, some nods, but, based on my conservations with activists afterward, strong respect from many for not simply pandering.”</p></div>",
  "content_text": "Ron Paul\nwins the CPAC straw poll\n:\nU.S. Rep. Ron Paul, R-Texas, a stalwart foe of government spending, won a blowout victory Saturday in the annual Conservative Political Action Conference presidential straw poll.  With participants naming “reducing the size of federal government” as their top issue, the 74-year old libertarian hero captured 31 percent of the 2,400 votes cast in the annual contest, usually seen as a barometer of how the GOP’s conservative wing regards their potential presidential candidates.\nFormer Massachusetts Gov. Mitt Romney finished second with 22 percent of the vote, ending a three-year winning streak at CPAC. Former Alaska Gov. Sarah Palin finished third with 7 percent of the vote, followed by Minnesota Gov. Tim Pawlenty at 6 percent and Indiana Rep. Mike Pence at 5 percent.\nNeedless to say, this straw poll win won’t be trumpeted by the NY/DC Axis Republicans the way it would have if Romney or Jindal had won.  It is astonishing how they continue to argue that a liberal Mormon from Massachusetts or an Indian from Louisiana is going to have more national appeal than the libertarian Texan who everyone now knows was correct about the failed World Democratic Revolution, correct about the financial crisis, and correct about TARP and the banking bailouts.\nRon Paul would have beaten Obama because his positions were in alignment with the American people rather than with the financial elite.  John McCain couldn’t because his weren’t.  McCain had the election and threw it away by siding with Goldman Sachs, Citigroup, and the Federal Reserve rather than with the voters.  Look at the alternatives now.  Romney is a liberal Mormon; he’s about as electable as an Aztec priest.  Palin is a political rock star, but she’s a lightweight and won’t be running if she has any sense at all because she’d be throwing away a very lucrative career in what passes for political commentary these days.  Jindal is a lightweight who looks and talks funny.  Pawlenty is an unprincipled snake, which is probably why the neocons are talking him up.   I don’t like Huckabee, but he’s probably the only other serious candidate in the bunch.\nWith apologies to Ann Coulter, if you call yourself a conservative but don’t support Ron Paul due to his foreign policy, you’re neither economically literate nor are you truly conservative.  It doesn’t matter how afraid of Iranian nukes you are or how sexually aroused you become at the thought of invading foreign lands because the great terrorist hunt and the world democratic revolution are rapidly coming to an end for lack of funding.  This will become abundantly clear with the first failed Treasury auction or when the bank meltdowns begin to pick up speed.  Ron Paul is the only Republican candidate who realizes this, which is precisely why he is the only viable Republican candidate in 2012 in much the same way that he was the only viable candidate in 2008.\nRunning another Wall Street-approved, neocon-vetted presidential candidate is about the only way the Republicans can guarantee an Obama victory in 2012.  So, it won’t surprise me in the least if that is precisely what they do.  If, on the other hand, they actually want to win, the ideal candidacy would probably be a Paul-Palin ticket.  The economic situation is not about to get better, so the bipartisan appeal of Paul’s message is only going to grow.\nIt seems Robert Costa is, along with Jonah Goldberg and John Derbyshire, one of the few remaining voices of sanity at National Review:\n“There may have been some boos, but Paul was by far one of the more popular speakers at CPAC this year. “End the Fed!” was one of most-heard chants and his “Campaign for Liberty” group was everywhere… Unlike the 2012 wannabes, Paul doesn’t play coy: He has a manifesto and wants to broadcast it. Period. No worries about the media spin or whether the speech gets headlines (see Pawlenty, Tiger doctrine). And, instead of the usual anti-Obama talk, Paul framed a hefty chunk of his CPAC address upon a critique of Woodrow Wilson. And the crowd dug it.\nSome older CPAC attendees don’t seem to care much for the Texas congressman, sure, but many young activists seem to regard him as a hero of sorts. When he talks about the debt, like he did on Friday, calling it a “monster” that will “eat up” our future, it was with a passion that you can’t fake in politics. He also didn’t mind challenging many of the room’s security hawks on foreign policy. “There is nothing wrong with being a conservative and having a conservative belief in foreign policy where we have a strong national defense and don’t go to war so carelessly,” Paul said. That line was met with a lot of silence, some nods, but, based on my conservations with activists afterward, strong respect from many for not simply pandering.”",
  "tags": [
    "politics"
  ],
  "categories": [],
  "sitemap_lastmod": "2010-02-21T14:29:00+00:00"
}