{
  "url": "https://voxday.net/2010/02/06/dantes-inferno-canto-i/",
  "scraped_at": "2026-01-08T23:18:53.957560",
  "title": "Dante’s Inferno – Canto I",
  "date_display": "February 6, 2010",
  "date_iso": "2010-02-06T15:00:00+00:00",
  "date_from_url": "2010-02-06",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p><iframe frameborder=\"0\" height=\"500\" id=\"proprofs\" marginheight=\"0\" marginwidth=\"0\" name=\"proprofs\" src=\"http://www.proprofs.com/quiz-school/widget/v2/?id=95216&amp;bgcolor=c1d4ee&amp;fcolor=2b405b&amp;tcolor=2b405b\" style=\"overflow-x: hidden;\" width=\"440\"></iframe></p><p>After reading five translations in detail this week and comparing them to the original Italian, I think we’re going to switch to Longfellow’s translation as our primary text; even though Cary’s is superficially more similar to the Binyon translation that I prefer, I am coming to believe that Longfellow’s is the best of <a href=\"http://www.danteinferno.info/translations/canto1.html\">the three freely available ones</a>, at least for our purposes.  I am increasingly unenthusiastic about Pinsky’s pedestrian translation, the credible justification he offers for his metaphorically prosaic approach notwithstanding.  As should be obvious after taking the quiz, I am focusing on content, not interpretation.  Unless the various meanings behind the metaphors are spelled out explicitly and unmistakeably in the text, I will not ask you questions about them.  Such matters of interpretation rather than content will be reserved for discussion in the comments.  The reading for next week is Cantos II and III.</p><p>It would appear I am not alone in <a href=\"http://www.nybooks.com/articles/5562\">my preference for Binyon</a>. <i>“If he wants to read Dante, he had best go to Binyon, but since Binyon’s English is sometimes as difficult and contorted as Dante’s Italian, he may prefer Ciardi.”</i> If you’re planning on actually buying a text rather than downloading one, I’d recommend the Viking portable edition.</p></div>",
  "content_text": "After reading five translations in detail this week and comparing them to the original Italian, I think we’re going to switch to Longfellow’s translation as our primary text; even though Cary’s is superficially more similar to the Binyon translation that I prefer, I am coming to believe that Longfellow’s is the best of\nthe three freely available ones\n, at least for our purposes.  I am increasingly unenthusiastic about Pinsky’s pedestrian translation, the credible justification he offers for his metaphorically prosaic approach notwithstanding.  As should be obvious after taking the quiz, I am focusing on content, not interpretation.  Unless the various meanings behind the metaphors are spelled out explicitly and unmistakeably in the text, I will not ask you questions about them.  Such matters of interpretation rather than content will be reserved for discussion in the comments.  The reading for next week is Cantos II and III.\nIt would appear I am not alone in\nmy preference for Binyon\n.\n“If he wants to read Dante, he had best go to Binyon, but since Binyon’s English is sometimes as difficult and contorted as Dante’s Italian, he may prefer Ciardi.”\nIf you’re planning on actually buying a text rather than downloading one, I’d recommend the Viking portable edition.",
  "tags": [
    "Voxiversity"
  ],
  "categories": [],
  "sitemap_lastmod": "2010-02-06T15:00:00+00:00"
}