{
  "url": "https://voxday.net/2010/02/23/for-excellence-in-paying-attention/",
  "scraped_at": "2026-01-08T23:20:12.641558",
  "title": "For excellence in paying attention",
  "date_display": "February 23, 2010",
  "date_iso": "2010-02-23T07:28:00+00:00",
  "date_from_url": "2010-02-23",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>After bestowing a well-deserved Dynamite Prize <a href=\"http://rwer.wordpress.com/2010/02/22/greenspan-friedman-and-summers-win-dynamite-prize-in-economics/\">to Alan Greenspan</a> for being the economist “most responsible for blowing up the global economy”, the Real-World Economics Blog is <a href=\"http://rwer.wordpress.com/nominations-for-the-revere-award-in-economics/\">now accepting nominations for the Revere Award</a>:</p><blockquote><p><b>The Revere Award in Economics</b></p><p>The economics establishment has attempted to evade responsibility for the Global Financial Collapse by calling it an unpredictable, “Black Swan” event.  But in fact some non-neoclassical economists foresaw the crisis and warned the public of its approach. The Revere Award aims to give these economists the professional and public recognition that they deserve, to encourage others to utilize their methods, and to increase the likelihood that, for the benefit of humankind, empirically responsible economists will be listened to in the future</p><p>You may nominate up to three candidates by leaving a comment below.  They must be economists, and we are looking for the three who first and most cogently warned of the coming calamity.</p></blockquote><p>Nominations are to be made in the comments.  While I seem to recall that I may have made <a href=\"http://admin.returnofthegreatdepression.com/about/predictions/\">a few predictions related to the matter</a>, here are the three candidates I believe to best merit the award:</p><p><b>Ludwig von Mises.</b> He long preceded Hyman Minsky in describing the nature of the boom-bust cycle and assigning responsibility for it to the expansion of bank credit.  He provided the best conceptual model for anticipating and recognizing both the housing bubble and its consequences for the financial system.  Granted, he didn’t predict this specific boom-and-bust due to the obvious disadvantage of his having been long deceased, so he may not be eligible.</p><p><b>Edward Gramlich.</b> RGD readers will recall him as the Federal Reserve governor who told Alan Greenspan that making home mortgages available to low-income borrowers would lead to widespread loan defaults having extremely negative effects on the national economy. And he did this in 2000! Greenspan blew him off because – seriously – he was afraid of undermining the availability of subprime credit.</p><p><b>Robert Prechter.</b> He forecast both the housing bubble and the threat to the global financial system very early on.  Some will complain that he did so too early, but Prechter, by his own admission, usually gets it too early.  The much more important point is that he usually also gets it right.</p></div>",
  "content_text": "After bestowing a well-deserved Dynamite Prize\nto Alan Greenspan\nfor being the economist “most responsible for blowing up the global economy”, the Real-World Economics Blog is\nnow accepting nominations for the Revere Award\n:\nThe Revere Award in Economics\nThe economics establishment has attempted to evade responsibility for the Global Financial Collapse by calling it an unpredictable, “Black Swan” event.  But in fact some non-neoclassical economists foresaw the crisis and warned the public of its approach. The Revere Award aims to give these economists the professional and public recognition that they deserve, to encourage others to utilize their methods, and to increase the likelihood that, for the benefit of humankind, empirically responsible economists will be listened to in the future\nYou may nominate up to three candidates by leaving a comment below.  They must be economists, and we are looking for the three who first and most cogently warned of the coming calamity.\nNominations are to be made in the comments.  While I seem to recall that I may have made\na few predictions related to the matter\n, here are the three candidates I believe to best merit the award:\nLudwig von Mises.\nHe long preceded Hyman Minsky in describing the nature of the boom-bust cycle and assigning responsibility for it to the expansion of bank credit.  He provided the best conceptual model for anticipating and recognizing both the housing bubble and its consequences for the financial system.  Granted, he didn’t predict this specific boom-and-bust due to the obvious disadvantage of his having been long deceased, so he may not be eligible.\nEdward Gramlich.\nRGD readers will recall him as the Federal Reserve governor who told Alan Greenspan that making home mortgages available to low-income borrowers would lead to widespread loan defaults having extremely negative effects on the national economy. And he did this in 2000! Greenspan blew him off because – seriously – he was afraid of undermining the availability of subprime credit.\nRobert Prechter.\nHe forecast both the housing bubble and the threat to the global financial system very early on.  Some will complain that he did so too early, but Prechter, by his own admission, usually gets it too early.  The much more important point is that he usually also gets it right.",
  "tags": [
    "economics"
  ],
  "categories": [],
  "sitemap_lastmod": "2010-02-23T07:28:00+00:00"
}