{
  "url": "https://voxday.net/2010/02/25/hey-its-what-they-do/",
  "scraped_at": "2026-01-08T23:20:27.418826",
  "title": "Hey, it’s what they do",
  "date_display": "February 25, 2010",
  "date_iso": "2010-02-25T15:15:00+00:00",
  "date_from_url": "2010-02-25",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>What is applied atheism about anyway, <a href=\"http://realityismyreligion.wordpress.com/2010/02/23/locked-entry-will-open-soon/\">if not eliminating freedoms and killing communities</a>?  History teaches quite clearly that this is what atheists do best.</p><blockquote><p>“Congratulations, you killed the forum.</p><p>Not just the forum, but the community as well. I’ll stay on until the new site and continue with my mod duties. But not with the format you propose. What you have proposed is going to kill the community, and many people will leave. Opening threads and speaking our mind freely is why we are here. Not being able to do that, not being able to talk about different things, not being able to debunk bad ideas, and more… those are some of the things that we are here for….</p><p>“The secretive way this has been handled and the exclusion of the hard working staff is an insult. We were promised input into the new site and to be able to test its functionality. We were led to believe that we were going to be included in the process and aid in the transition.</p><p>Now it’s presented as a done deal, and we’re condescendingly told to shut up about it and not cause trouble? To not dare contact Richard Dawkins about it?</p></blockquote><p>It’s a familiar pattern.  The upset forum moderators should be happy that it’s only a virtual community.  And there are few things more amusing than <a href=\"http://forum.richarddawkins.net/viewtopic.php?f=60&amp;t=110356\">Richard Dawkins’s belated discovery</a> that his biggest fans are socially maladjusted pricks given to “splenetic hysteria”, “remarkable bile” and “ludicrously hyperbolic animosity”.  Dickie dear, don’t you know that they’re just following your lead?</p></div>",
  "content_text": "What is applied atheism about anyway,\nif not eliminating freedoms and killing communities\n?  History teaches quite clearly that this is what atheists do best.\n“Congratulations, you killed the forum.\nNot just the forum, but the community as well. I’ll stay on until the new site and continue with my mod duties. But not with the format you propose. What you have proposed is going to kill the community, and many people will leave. Opening threads and speaking our mind freely is why we are here. Not being able to do that, not being able to talk about different things, not being able to debunk bad ideas, and more… those are some of the things that we are here for….\n“The secretive way this has been handled and the exclusion of the hard working staff is an insult. We were promised input into the new site and to be able to test its functionality. We were led to believe that we were going to be included in the process and aid in the transition.\nNow it’s presented as a done deal, and we’re condescendingly told to shut up about it and not cause trouble? To not dare contact Richard Dawkins about it?\nIt’s a familiar pattern.  The upset forum moderators should be happy that it’s only a virtual community.  And there are few things more amusing than\nRichard Dawkins’s belated discovery\nthat his biggest fans are socially maladjusted pricks given to “splenetic hysteria”, “remarkable bile” and “ludicrously hyperbolic animosity”.  Dickie dear, don’t you know that they’re just following your lead?",
  "tags": [
    "atheism"
  ],
  "categories": [],
  "sitemap_lastmod": "2010-02-25T15:15:00+00:00"
}