{
  "url": "https://voxday.net/2010/02/24/idol-crumbles/",
  "scraped_at": "2026-01-08T23:20:23.762109",
  "title": "The idol crumbles",
  "date_display": "February 24, 2010",
  "date_iso": "2010-02-24T18:45:00+00:00",
  "date_from_url": "2010-02-24",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>From a review of Fodor and Piatelli-Palmarini’s new book, <a href=\"http://www.amazon.com/What-Darwin-Wrong-Jerry-Fodor/dp/0374288798/ref=sr_1_1?ie=UTF8&amp;s=books&amp;qid=1267034938&amp;sr=8-1\">What Darwin Got Wrong</a>:</p><blockquote><p>I really enjoyed this book; however, it may only appeal to a very small audience – those who believe in a thoroughly natural evolutionary process, but are also unhappy with the current state of evolutionary theory (the Modern Synthesis). I happen to fall into this category so I appreciated Fodor and Palmarini’s book, but I can also understand why this book may receive negative reviews. The gist of the book is this: “…we will run a line of argument that goes like this: there is at the heart of adaptationist theories of evolution, a confusion between (1) the claim that evolution is a process in which creatures with adaptive traits are selected and (2) the claim that evolution is a process in which creatures are selected for their adaptive traits. We will argue that: Darwinism is committed to inferring (2) from (1); that this inference is invalid (in fact it’s what philosophers call an `intensional fallacy’); and that there is no way to repair the damage consonant with commitment to naturalism, which we take to be common ground. Getting clear on all this will be a main goal of the book.”</p></blockquote><p>This is only the first step in the eventual abandonment of Darwinism and evolution by natural selection that has been inevitable since Mendel, but it’s an interesting one.  It should eventually make clear what a religion Darwinism actually is, as atheist and agnostic materialists begin moving away from the Darwinian model for very different reasons than most Creationist theists.  I’m looking forward to reading this book because I believe that unlike the intelligent design people, Fodor and Piatelli-Palmarini are looking in the correct place for proving the model incorrect in a scientific manner, assuming that it is actually incorrect.  As I have pointed out on numerous occasions, the natural selection component of TENS is a logical and philosophical hypothesis, not a scientific one.  Even Richard Dawkins has reluctantly admitted in his latest book that it is entirely plausible natural selection is not the mechanism by which evolution operates, and since after 150 years there is still no significant scientific evidence that Darwinian natural selection takes place, I expect that it will not be too terribly long before Darwinism takes its rightful place with phrenology, astrology, and other pseudo-sciences.  And in the meantime, it is always amusing to see not-very-bright biologists shrieking about how their intellectual superiors don’t understand the tremendously complicated concepts to which they are so emotionally attached.</p><p>Since we’re on the subject of evolution, I would be remiss if I did not mention that <a href=\"http://monkeytrials.blogspot.com/2009/12/vox-re-dux.html\">Scott Hatfield has concluded</a> that the Pagel paper about which I posted back in December apparently does not call natural selection’s time scale into question in quite the manner that the Physorg.com article to which I linked had claimed.  Scott says: <i>“It turns out that Pagel’s group actually endorses the Red Queen hypothesis of constant speciation rates, but proposes a novel reinterpretation of the data uncoupling the former from phyletic gradualism.”</i></p><p>It would seem that physicists can be trusted to write accurately about evolution as biologists write about military history, theology, and pretty much anything outside of biology.  And yet, <a href=\"http://www.milobookclub.com/2009/12/26/fractured-physics-and-death-of-darwin/\">the point I made in the original post</a> stands regardless, especially in light of the recent range reduction in the hunt for the Higgs boson.</p><p><i>“Now, this research deals with the matter of natural selection’s time scale rather than its existence, but nevertheless underlines my point that the natural selection hypothesis has always been logic, not science. The fact that it is difficult and dangerous to paint grizzly bears pink in order to see if they breed less successfully doesn’t change the fact that no one has ever tested the widespread assumption of why polar bears are white. And while the jury is still out on both matters, the exposed cracks in the major theories naturally leads to a philosophical question: since the foundations of both modern physics and modern Darwinism appear to be wobbling, what is the basis for considering materialism to be rational given such demonstrably flawed understandings of what the material happens to be?”</i></p></div>",
  "content_text": "From a review of Fodor and Piatelli-Palmarini’s new book,\nWhat Darwin Got Wrong\n:\nI really enjoyed this book; however, it may only appeal to a very small audience – those who believe in a thoroughly natural evolutionary process, but are also unhappy with the current state of evolutionary theory (the Modern Synthesis). I happen to fall into this category so I appreciated Fodor and Palmarini’s book, but I can also understand why this book may receive negative reviews. The gist of the book is this: “…we will run a line of argument that goes like this: there is at the heart of adaptationist theories of evolution, a confusion between (1) the claim that evolution is a process in which creatures with adaptive traits are selected and (2) the claim that evolution is a process in which creatures are selected for their adaptive traits. We will argue that: Darwinism is committed to inferring (2) from (1); that this inference is invalid (in fact it’s what philosophers call an `intensional fallacy’); and that there is no way to repair the damage consonant with commitment to naturalism, which we take to be common ground. Getting clear on all this will be a main goal of the book.”\nThis is only the first step in the eventual abandonment of Darwinism and evolution by natural selection that has been inevitable since Mendel, but it’s an interesting one.  It should eventually make clear what a religion Darwinism actually is, as atheist and agnostic materialists begin moving away from the Darwinian model for very different reasons than most Creationist theists.  I’m looking forward to reading this book because I believe that unlike the intelligent design people, Fodor and Piatelli-Palmarini are looking in the correct place for proving the model incorrect in a scientific manner, assuming that it is actually incorrect.  As I have pointed out on numerous occasions, the natural selection component of TENS is a logical and philosophical hypothesis, not a scientific one.  Even Richard Dawkins has reluctantly admitted in his latest book that it is entirely plausible natural selection is not the mechanism by which evolution operates, and since after 150 years there is still no significant scientific evidence that Darwinian natural selection takes place, I expect that it will not be too terribly long before Darwinism takes its rightful place with phrenology, astrology, and other pseudo-sciences.  And in the meantime, it is always amusing to see not-very-bright biologists shrieking about how their intellectual superiors don’t understand the tremendously complicated concepts to which they are so emotionally attached.\nSince we’re on the subject of evolution, I would be remiss if I did not mention that\nScott Hatfield has concluded\nthat the Pagel paper about which I posted back in December apparently does not call natural selection’s time scale into question in quite the manner that the Physorg.com article to which I linked had claimed.  Scott says:\n“It turns out that Pagel’s group actually endorses the Red Queen hypothesis of constant speciation rates, but proposes a novel reinterpretation of the data uncoupling the former from phyletic gradualism.”\nIt would seem that physicists can be trusted to write accurately about evolution as biologists write about military history, theology, and pretty much anything outside of biology.  And yet,\nthe point I made in the original post\nstands regardless, especially in light of the recent range reduction in the hunt for the Higgs boson.\n“Now, this research deals with the matter of natural selection’s time scale rather than its existence, but nevertheless underlines my point that the natural selection hypothesis has always been logic, not science. The fact that it is difficult and dangerous to paint grizzly bears pink in order to see if they breed less successfully doesn’t change the fact that no one has ever tested the widespread assumption of why polar bears are white. And while the jury is still out on both matters, the exposed cracks in the major theories naturally leads to a philosophical question: since the foundations of both modern physics and modern Darwinism appear to be wobbling, what is the basis for considering materialism to be rational given such demonstrably flawed understandings of what the material happens to be?”",
  "tags": [
    "evolution"
  ],
  "categories": [],
  "sitemap_lastmod": "2010-02-24T18:45:00+00:00"
}