{
  "url": "https://voxday.net/2010/02/08/interview-with-james-delingpole/",
  "scraped_at": "2026-01-08T23:19:01.520499",
  "title": "Interview with James Delingpole",
  "date_display": "February 8, 2010",
  "date_iso": "2010-02-08T06:00:00+00:00",
  "date_from_url": "2010-02-08",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p><i>Vox Day interviewed James Delingpole, the British journalist and author of <i><a href=\"http://www.amazon.com/Welcome-Obamaland-Have-Future-Doesnt/dp/1596985887/ref=sr_1_1?ie=UTF8&amp;s=books&amp;qid=1265619485&amp;sr=8-1\">Welcome to Obamaland: I Have Seen Your Future and It Doesn’t Work</a></i>, on February 4th, 2010.</i></p><p><b>When did you first become skeptical about the idea of man-made global warming?</b></p><p>There was no Saul-line moment of conversion, it was a gradual dawning.  One thing that the global warming lobby likes to do is to make out that people who disagree with them somehow hate nature and that the reason they object to global warming is not on scientific grounds but because they aren’t prepared to make the necessary lifestyle changes.  This is nonsense.  In a way, I think my love of nature is the reason I care so much about this battle.  For example, the measures adopted by the British government to deal with  so-called man-made global warming involve carpeting the most beautiful countryside on Earth with wind farms that are inefficient, can only operate economically if heavily subsidized by the government and therefore the taxpayer, and utterly destroy the landscape.  I don’t believe in this thing they call “the precautionary principle” because sometimes doing something can be much, much, much worse than doing nothing.</p><p><b>Historians are aware that Greenland used to be farmed and that the Romans grew grapes in England.  Are the global warming scientists historical illiterates or were they just hoping that no one would remember that the world was quite a bit warmer a few centuries ago.</b></p><p>It’s a very interesting question.  The first part of the answer is that scientists stick to their particular field.  I think what’s happened with some of these climate change scientists is that they’ve been so engrossed in their little corner of the picture that they haven’t bothered to look at the bigger one.  And the second part is that in some cases they have actively sought to rewrite history, as in those Climategate emails where you see Michael Mann mulling aloud how he might get rid of the Medieval Warm Period.   That’s the kindest complexion one can put upon it.  The Medieval Warm Period is an embarrassment to them.  The fact is that the majority of scientists in that field agree that during the Medieval Warm Period it was warmer than it is now.   There was no industrial civilization then, so how do you explain it?  You can see why it’s a huge embarrassment to them.  The same applies to the Roman history.  They were growing grapes by Hadrian’s Wall.</p><p><b>I think it’s natural to be skeptical of global warming when you come from Minnesota, which was once covered by ice.  And of course, around this time of year, global warming sounds pretty good.</b></p><p>There is a very interesting report that was sent to me recently written by one of the numerous lobbying foundations that advises the propagandists of how best to advance the cause of global warming in the minds of the various people around the world.  And it said precisely this: in warmer countries it clearly makes sense to talk in terms of global warming.  But in other places, where the weather was unlikely to behave in the correct manner, they should call it climate change and be sure to claim that any form of extreme weather event, be it cold or hot, was definitely further proof of this “climate change”.  The dishonesty of what is being foisted upon us is extraordinary.</p><p><b>Why did it take so long for the global warming proponents to realize that Climategate was a serious blow to their efforts?</b></p><p>Denial.  Denial is the obvious answer.  Even now, you’re getting a lot of warmists, particularly the environment correspondents in the mainstream newspapers and at the BBC, they’re kind of finessing their position.  They’re preparing their lines of defense.  A lot of them are saying things about the recent IPCC revelations like “this of course is much more important than the totally insignificant Climategate emails”.  This is a) an attempt to justify how they were sniffy and didn’t report the Climategate emails when they happened, and, b) they want to give their opponents as little ammunition as possible.  They want to credit their opponents with as little intelligence or journalistic skill as possible.  For me, the significance about the Climategate emails was not due to any new and specific revelations, but that for the first time, we had emails confirming what a handful of journalists and dissenting scientists had been saying for over a decade.  You know, that the global warming scientists had been cooking the books and fiddling the data, that they had been suppressing the research of scientists who disagreed with them.  All of these things that people had suspected before but never been able to prove were suddenly there.  The Climategate emails were the smoking gun.</p><p><b>Do you think we’ve seen the last of the scandalous revelations to come out of the IPCC and the CRU?</b></p><p>No, it’s the gift that goes on giving.  First of all, we had Glaciergate, then we had Amazongate, and of course before that we had Pachaurigate.  Yesterday we had Hollandgate, where it was discovered that the IPCC report had exaggerated the extent to which lowland Holland is at threat from global warming and exaggerated, by a significant factor, the number of people there who were endangered by flooding being caused by global warming.</p><p><b>When I consider how wildly off these reports have been, I’m beginning to worry that the real danger is being overrun by hordes of ravenous polar bears.</b></p><p>I would think this is almost certainly the case.  We’re actually in more danger of being frozen as well.</p><p><b>Copenhagen fell out of the news rather rapidly.  Was that the result of Climategate or the economic situation?</b></p><p>I think Climategate had very, very, very little to do with the failure of Copenhagen.  The fact is that the policymakers, the NGOs, and the lobbying groups were sitting in a bubble and carried on talking their talk as if nothing had changed at all.  The reason that Copenhagen failed was the reason it was going to fail long before Climategate happened.  People were talking about it inevitably being a failure and that the policymakers wouldn’t get their act together because the countries could not agree.  It was in the midst of a recession.</p><p><b>Why has the international media been so quick to believe the claims of the global warming scientists and why has the British press been more skeptical than the American press?</b></p><p>You need to look at it historically.  In the 1990s, there was a general feeling abroad among the chattering classes that they had had it too good for too long.  People were enjoying the inflationary boom, the debt-fueled boom, but at the same time, in the way that middle classes do, they were starting to feel guilty about it.  Maybe we’ve had it too good for too long.  Maybe we should start thinking about more important things than money.  And so you had lots of people going organic and talking about ethical lifestyles.  This intellectual climate coincided with activists like James Hansen of NASA and Al Gore pushing for this vision of a world that was doomed by Man’s greed and consumption.  It hit the spot perfectly.  There was the famous conference that Al Gore staged in Washington on the hottest day of the year.  They opened all the windows the night before, then closed them in the morning so the air conditioning broke down.  Of course, it was sweltering inside as they announced the news that the world was in trouble and it was all Man’s fault.  So you had suddenly an exciting story that the newspapers could get their teeth into and it gelled with their chattering class readership.  This meme took off very quickly.  At the newspapers you also had these environment correspondents, who I think are probably the most partisan correspondents in any genre you can imagine.  They were not objective at all.  These were environmental activists taking their cue from the propaganda of organizations like the World Wildlife Fund, which is effectively a Marxist revolutionary organization closely associated with people like Maurice Strong, the one-world government guy.  So all these activist groups were feeding this information into the newspapers where it was reported uncritically and people read it because it was what they wanted to hear.  You had this great big movement going on and no one wanted to say that the emperor was wearing no clothes.  Anyone who pointed it out was marginalized.</p><p>As for the second part of your question, the grass is always greener on the other side.  I don’t think the record of the British press has actually been much better than the American press.  You’ve got papers like the Washington Times that’s taken the skeptical position, hasn’t it?  I know you’ve got lots of papers like the New York Times pushing the warmist agenda, but if you look at most British newspapers, and also the BBC, you will find that they have been taking the same abject position as most American newspapers, reporting this AGW as if it were indisputable fact and expressly squashing the work of anyone who disagrees with it.</p><p><b>You mentioned the connection of some of the environmental organizations to the one-world advocates.  Geoffrey Lean was writing that the idea global warming is a hoax perpetrated by a conspiracy of the world’s scientists and political leaders pushing a one-world agenda is far-fetched.  Have the British learned nothing from the example of the European Union?  It was always sworn up and down that the European Common Market had nothing to do with politics until it suddenly turned into a political entity?</b></p><p>Well, he would say that, wouldn’t he.  Listen, why do you think I want to emigrate so badly?  It is precisely this.  I feel that we are living in an eco-fascist tyranny.  Many of us look aghast at what has been done by the European Union.  80 percent of all new laws passed in Britain emanate, not from the British government,  but from the European Union.  These are laws over which we have no democratic control.  The people in the European Union are democratically unaccountable.  And unfortunately, AGW is the European Union mark two.  It’s no coincidence that the European Union has been pushing the AGW agenda harder than almost any political entity in the world.  The reason for that is very simple.  As Jonah Goldberg argues in <i>Liberal Fascism</i>, in order for fascist regimes to impose their power on the populace, what they need is an excuse, a crisis so apparently grave that only the most dire and stringent government action is justified.  And this action, of course, can circumvent the wishes of the populace.  It is perfectly okay for unelected bureaucrats and technocrats to impose unwanted policies on people because the world is doomed and if we don’t do something now, we’ve had it.</p><p><b>I always find this to be an interesting argument in light of the great government successes in eradicating poverty, drug use, and crime.</b></p><p>Exactly, exactly!  I despair, I really do, of what’s happening and what’s going to happen.  Since November, we have seen AGW unraveling at the most extraordinary rate.  What has been the response among our lawmakers and what has been the response at the scientific institutions implicated in these scandals?  Why, it has been to close ranks, to cover up, and to pretend nothing has changed as the caravan moves on!  In Britain, we have the energy and climate minister, Ed Miliband, and the conservative opposition both saying effectively the same thing.  They’re saying we must cut carbon by massive amounts, they’re talking about green jobs and expecting people to believe them!  They’re saying this when we know from the evidence of Spain that for every green job created by the government, 2.2 jobs are lost in the real economy.  The idea that green jobs are going to bail us out of this economic situation is pie in the sky, it’s Enron accounting.</p><p><b>I have one final question.  Why are Guardian readers such wankers?</b></p><p>They are, aren’t they!  Actually, having said that, one of my great pleasures in life, one of the few pleasures left for those of us who don’t believe in one-world government, is rooting through the comments below articles written by people like George Monbiot and seeing just how many of them have been censored by the moderators and how many more are antipathetic to George Monbiot’s point of view.  What you realize is that certainly out in the blogosphere and on the Internet generally, skepticism is growing.  There are a lot of very informed, clever, funny people out there who are saying “we won’t buy this shit, enough is enough!”  I’m hoping that this revolutionary spirit that we see on the Internet spreads out into the real world too, because I think the Internet is our best defense against the one-world government tyranny that is being imposed upon us in the name of global warming.  This is a battle worth fighting.  The future of Western civilization depends on the outcome. I think it’s that serious.</p><p> <i>On a tangentially related note, this Audi “Green Police” ad is a timely and light-hearted demonstration of the eco-fascism of which Delingpole is warning.  The ad is funny, but the reality won’t be, if the people of what were once known as the Western democracies are foolish enough to allow it to come to pass.</i></p></div>",
  "content_text": "Vox Day interviewed James Delingpole, the British journalist and author of\nWelcome to Obamaland: I Have Seen Your Future and It Doesn’t Work\n, on February 4th, 2010.\nWhen did you first become skeptical about the idea of man-made global warming?\nThere was no Saul-line moment of conversion, it was a gradual dawning.  One thing that the global warming lobby likes to do is to make out that people who disagree with them somehow hate nature and that the reason they object to global warming is not on scientific grounds but because they aren’t prepared to make the necessary lifestyle changes.  This is nonsense.  In a way, I think my love of nature is the reason I care so much about this battle.  For example, the measures adopted by the British government to deal with  so-called man-made global warming involve carpeting the most beautiful countryside on Earth with wind farms that are inefficient, can only operate economically if heavily subsidized by the government and therefore the taxpayer, and utterly destroy the landscape.  I don’t believe in this thing they call “the precautionary principle” because sometimes doing something can be much, much, much worse than doing nothing.\nHistorians are aware that Greenland used to be farmed and that the Romans grew grapes in England.  Are the global warming scientists historical illiterates or were they just hoping that no one would remember that the world was quite a bit warmer a few centuries ago.\nIt’s a very interesting question.  The first part of the answer is that scientists stick to their particular field.  I think what’s happened with some of these climate change scientists is that they’ve been so engrossed in their little corner of the picture that they haven’t bothered to look at the bigger one.  And the second part is that in some cases they have actively sought to rewrite history, as in those Climategate emails where you see Michael Mann mulling aloud how he might get rid of the Medieval Warm Period.   That’s the kindest complexion one can put upon it.  The Medieval Warm Period is an embarrassment to them.  The fact is that the majority of scientists in that field agree that during the Medieval Warm Period it was warmer than it is now.   There was no industrial civilization then, so how do you explain it?  You can see why it’s a huge embarrassment to them.  The same applies to the Roman history.  They were growing grapes by Hadrian’s Wall.\nI think it’s natural to be skeptical of global warming when you come from Minnesota, which was once covered by ice.  And of course, around this time of year, global warming sounds pretty good.\nThere is a very interesting report that was sent to me recently written by one of the numerous lobbying foundations that advises the propagandists of how best to advance the cause of global warming in the minds of the various people around the world.  And it said precisely this: in warmer countries it clearly makes sense to talk in terms of global warming.  But in other places, where the weather was unlikely to behave in the correct manner, they should call it climate change and be sure to claim that any form of extreme weather event, be it cold or hot, was definitely further proof of this “climate change”.  The dishonesty of what is being foisted upon us is extraordinary.\nWhy did it take so long for the global warming proponents to realize that Climategate was a serious blow to their efforts?\nDenial.  Denial is the obvious answer.  Even now, you’re getting a lot of warmists, particularly the environment correspondents in the mainstream newspapers and at the BBC, they’re kind of finessing their position.  They’re preparing their lines of defense.  A lot of them are saying things about the recent IPCC revelations like “this of course is much more important than the totally insignificant Climategate emails”.  This is a) an attempt to justify how they were sniffy and didn’t report the Climategate emails when they happened, and, b) they want to give their opponents as little ammunition as possible.  They want to credit their opponents with as little intelligence or journalistic skill as possible.  For me, the significance about the Climategate emails was not due to any new and specific revelations, but that for the first time, we had emails confirming what a handful of journalists and dissenting scientists had been saying for over a decade.  You know, that the global warming scientists had been cooking the books and fiddling the data, that they had been suppressing the research of scientists who disagreed with them.  All of these things that people had suspected before but never been able to prove were suddenly there.  The Climategate emails were the smoking gun.\nDo you think we’ve seen the last of the scandalous revelations to come out of the IPCC and the CRU?\nNo, it’s the gift that goes on giving.  First of all, we had Glaciergate, then we had Amazongate, and of course before that we had Pachaurigate.  Yesterday we had Hollandgate, where it was discovered that the IPCC report had exaggerated the extent to which lowland Holland is at threat from global warming and exaggerated, by a significant factor, the number of people there who were endangered by flooding being caused by global warming.\nWhen I consider how wildly off these reports have been, I’m beginning to worry that the real danger is being overrun by hordes of ravenous polar bears.\nI would think this is almost certainly the case.  We’re actually in more danger of being frozen as well.\nCopenhagen fell out of the news rather rapidly.  Was that the result of Climategate or the economic situation?\nI think Climategate had very, very, very little to do with the failure of Copenhagen.  The fact is that the policymakers, the NGOs, and the lobbying groups were sitting in a bubble and carried on talking their talk as if nothing had changed at all.  The reason that Copenhagen failed was the reason it was going to fail long before Climategate happened.  People were talking about it inevitably being a failure and that the policymakers wouldn’t get their act together because the countries could not agree.  It was in the midst of a recession.\nWhy has the international media been so quick to believe the claims of the global warming scientists and why has the British press been more skeptical than the American press?\nYou need to look at it historically.  In the 1990s, there was a general feeling abroad among the chattering classes that they had had it too good for too long.  People were enjoying the inflationary boom, the debt-fueled boom, but at the same time, in the way that middle classes do, they were starting to feel guilty about it.  Maybe we’ve had it too good for too long.  Maybe we should start thinking about more important things than money.  And so you had lots of people going organic and talking about ethical lifestyles.  This intellectual climate coincided with activists like James Hansen of NASA and Al Gore pushing for this vision of a world that was doomed by Man’s greed and consumption.  It hit the spot perfectly.  There was the famous conference that Al Gore staged in Washington on the hottest day of the year.  They opened all the windows the night before, then closed them in the morning so the air conditioning broke down.  Of course, it was sweltering inside as they announced the news that the world was in trouble and it was all Man’s fault.  So you had suddenly an exciting story that the newspapers could get their teeth into and it gelled with their chattering class readership.  This meme took off very quickly.  At the newspapers you also had these environment correspondents, who I think are probably the most partisan correspondents in any genre you can imagine.  They were not objective at all.  These were environmental activists taking their cue from the propaganda of organizations like the World Wildlife Fund, which is effectively a Marxist revolutionary organization closely associated with people like Maurice Strong, the one-world government guy.  So all these activist groups were feeding this information into the newspapers where it was reported uncritically and people read it because it was what they wanted to hear.  You had this great big movement going on and no one wanted to say that the emperor was wearing no clothes.  Anyone who pointed it out was marginalized.\nAs for the second part of your question, the grass is always greener on the other side.  I don’t think the record of the British press has actually been much better than the American press.  You’ve got papers like the Washington Times that’s taken the skeptical position, hasn’t it?  I know you’ve got lots of papers like the New York Times pushing the warmist agenda, but if you look at most British newspapers, and also the BBC, you will find that they have been taking the same abject position as most American newspapers, reporting this AGW as if it were indisputable fact and expressly squashing the work of anyone who disagrees with it.\nYou mentioned the connection of some of the environmental organizations to the one-world advocates.  Geoffrey Lean was writing that the idea global warming is a hoax perpetrated by a conspiracy of the world’s scientists and political leaders pushing a one-world agenda is far-fetched.  Have the British learned nothing from the example of the European Union?  It was always sworn up and down that the European Common Market had nothing to do with politics until it suddenly turned into a political entity?\nWell, he would say that, wouldn’t he.  Listen, why do you think I want to emigrate so badly?  It is precisely this.  I feel that we are living in an eco-fascist tyranny.  Many of us look aghast at what has been done by the European Union.  80 percent of all new laws passed in Britain emanate, not from the British government,  but from the European Union.  These are laws over which we have no democratic control.  The people in the European Union are democratically unaccountable.  And unfortunately, AGW is the European Union mark two.  It’s no coincidence that the European Union has been pushing the AGW agenda harder than almost any political entity in the world.  The reason for that is very simple.  As Jonah Goldberg argues in\nLiberal Fascism\n, in order for fascist regimes to impose their power on the populace, what they need is an excuse, a crisis so apparently grave that only the most dire and stringent government action is justified.  And this action, of course, can circumvent the wishes of the populace.  It is perfectly okay for unelected bureaucrats and technocrats to impose unwanted policies on people because the world is doomed and if we don’t do something now, we’ve had it.\nI always find this to be an interesting argument in light of the great government successes in eradicating poverty, drug use, and crime.\nExactly, exactly!  I despair, I really do, of what’s happening and what’s going to happen.  Since November, we have seen AGW unraveling at the most extraordinary rate.  What has been the response among our lawmakers and what has been the response at the scientific institutions implicated in these scandals?  Why, it has been to close ranks, to cover up, and to pretend nothing has changed as the caravan moves on!  In Britain, we have the energy and climate minister, Ed Miliband, and the conservative opposition both saying effectively the same thing.  They’re saying we must cut carbon by massive amounts, they’re talking about green jobs and expecting people to believe them!  They’re saying this when we know from the evidence of Spain that for every green job created by the government, 2.2 jobs are lost in the real economy.  The idea that green jobs are going to bail us out of this economic situation is pie in the sky, it’s Enron accounting.\nI have one final question.  Why are Guardian readers such wankers?\nThey are, aren’t they!  Actually, having said that, one of my great pleasures in life, one of the few pleasures left for those of us who don’t believe in one-world government, is rooting through the comments below articles written by people like George Monbiot and seeing just how many of them have been censored by the moderators and how many more are antipathetic to George Monbiot’s point of view.  What you realize is that certainly out in the blogosphere and on the Internet generally, skepticism is growing.  There are a lot of very informed, clever, funny people out there who are saying “we won’t buy this shit, enough is enough!”  I’m hoping that this revolutionary spirit that we see on the Internet spreads out into the real world too, because I think the Internet is our best defense against the one-world government tyranny that is being imposed upon us in the name of global warming.  This is a battle worth fighting.  The future of Western civilization depends on the outcome. I think it’s that serious.\nOn a tangentially related note, this Audi “Green Police” ad is a timely and light-hearted demonstration of the eco-fascism of which Delingpole is warning.  The ad is funny, but the reality won’t be, if the people of what were once known as the Western democracies are foolish enough to allow it to come to pass.",
  "tags": [
    "AGW/CC",
    "WND"
  ],
  "categories": [],
  "sitemap_lastmod": "2010-02-08T06:00:00+00:00"
}