{
  "url": "https://voxday.net/2010/02/24/killing-corpse-of-keynes/",
  "scraped_at": "2026-01-08T23:20:21.903361",
  "title": "Killing the corpse of Keynes",
  "date_display": "February 24, 2010",
  "date_iso": "2010-02-24T15:30:00+00:00",
  "date_from_url": "2010-02-24",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>The UK is doing its best to do so through <a href=\"http://www.bloomberg.com/apps/news?pid=email_en&amp;sid=a5t.xQdllnbo\">its Keynesian response</a> to the Great Depression 2.0:</p><blockquote><p>The U.K. has produced notable economists over the years, but John Maynard Keynes, the guru of government intervention, was one of truly global significance.</p><p>So it may be fitting that the U.K. will also become the deathbed of Keynesian economics.</p><p>Britain has been following the mainstream prescriptions of his followers more than any developed nation. It has cut interest rates, pumped up government spending, printed money like crazy, and nationalized almost half the banking industry.</p><p>Short of digging Karl Marx out of his London grave, and putting him in charge, it is hard to see how the state could get more involved in the economy.</p><p>The results will be dire. The economy is flat on its back, unemployment is rising, the pound is sinking, and the bond markets are bracketing the country with Greece and Portugal in the category marked “bankruptcy imminent.” At some point soon, even the most loyal disciples of Keynes will have to admit defeat, and accept that a radical change of direction is needed.</p></blockquote><p>The usual Keynesian defense of “well, it just wasn’t <i>enough</i> stimulus isn’t going to wash this time, no matter how often that Paul Krugman complains that a <i>bigger</i> stimulus plan than the one he prescribed himself was too small.  Their myopic cluelessness simply knows no bounds; reading <a href=\"http://delong.typepad.com/sdj/2010/02/does-brian-riedl-of-national-review-finally-get-it.html\">Brad DeLong’s attempt to school Brian Riedl</a> is like watching two little girls in a slapfight where neither of them knows how to fight.</p><p><i>“When–in conditions in which there are masses of unemployed–the government spends money to hire people who were previously among the involuntarily unemployed, their productivity increases. It goes from zero to whatever the value of what the government hires them to do is. This increases income and demand, all in tandem.”</i></p><p>No, you blithering idiot with a PhD, it doesn’t necessarily do anything of the sort.  The number of incorrect assumptions contained in those three paragraphs are remarkable.  These cretins babble on and on about irrelevant factors while constantly ignoring the elephant in the room, namely, the debt-imposed <a href=\"http://www.milobookclub.com/2009/06/18/limits-of-demand/\">limits of demand</a>.  Aside from the obvious fact that there is a high probability that there will be no productivity gain whatsoever from the nonexistent demand being “met” by the government employment and the fact that unemployed people do not immediately go into a frozen stasis where they do absolutely nothing economically productive, the mere fact of providing employment and income to a worker does not create demand.</p><p>Keynesians simply don’t understand debt or demand, at either the micro or macro levels.  They’re not equipped to do so because of the structural flaws of their conceptual models.  And that is one of the primary reasons why the various economies around the world are not only in terrible shape, but are going to get worse.</p></div>",
  "content_text": "The UK is doing its best to do so through\nits Keynesian response\nto the Great Depression 2.0:\nThe U.K. has produced notable economists over the years, but John Maynard Keynes, the guru of government intervention, was one of truly global significance.\nSo it may be fitting that the U.K. will also become the deathbed of Keynesian economics.\nBritain has been following the mainstream prescriptions of his followers more than any developed nation. It has cut interest rates, pumped up government spending, printed money like crazy, and nationalized almost half the banking industry.\nShort of digging Karl Marx out of his London grave, and putting him in charge, it is hard to see how the state could get more involved in the economy.\nThe results will be dire. The economy is flat on its back, unemployment is rising, the pound is sinking, and the bond markets are bracketing the country with Greece and Portugal in the category marked “bankruptcy imminent.” At some point soon, even the most loyal disciples of Keynes will have to admit defeat, and accept that a radical change of direction is needed.\nThe usual Keynesian defense of “well, it just wasn’t\nenough\nstimulus isn’t going to wash this time, no matter how often that Paul Krugman complains that a\nbigger\nstimulus plan than the one he prescribed himself was too small.  Their myopic cluelessness simply knows no bounds; reading\nBrad DeLong’s attempt to school Brian Riedl\nis like watching two little girls in a slapfight where neither of them knows how to fight.\n“When–in conditions in which there are masses of unemployed–the government spends money to hire people who were previously among the involuntarily unemployed, their productivity increases. It goes from zero to whatever the value of what the government hires them to do is. This increases income and demand, all in tandem.”\nNo, you blithering idiot with a PhD, it doesn’t necessarily do anything of the sort.  The number of incorrect assumptions contained in those three paragraphs are remarkable.  These cretins babble on and on about irrelevant factors while constantly ignoring the elephant in the room, namely, the debt-imposed\nlimits of demand\n.  Aside from the obvious fact that there is a high probability that there will be no productivity gain whatsoever from the nonexistent demand being “met” by the government employment and the fact that unemployed people do not immediately go into a frozen stasis where they do absolutely nothing economically productive, the mere fact of providing employment and income to a worker does not create demand.\nKeynesians simply don’t understand debt or demand, at either the micro or macro levels.  They’re not equipped to do so because of the structural flaws of their conceptual models.  And that is one of the primary reasons why the various economies around the world are not only in terrible shape, but are going to get worse.",
  "tags": [
    "economics"
  ],
  "categories": [],
  "sitemap_lastmod": "2010-02-24T15:30:00+00:00"
}