{
  "url": "https://voxday.net/2010/02/09/land-of-free/",
  "scraped_at": "2026-01-08T23:19:08.812189",
  "title": "Land of the Free",
  "date_display": "February 9, 2010",
  "date_iso": "2010-02-09T21:41:00+00:00",
  "date_from_url": "2010-02-09",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>Not so much <a href=\"http://news.antiwar.com/2010/02/03/blair-us-govt-can-kill-citizens-overseas-as-part-of-defined-policy/\">in these latter days</a> of what used to be the Republic:</p><blockquote><p>In testimony before the House Intelligence Committee today, National Intelligence Director Dennis Blair told representatives that American citizens can be assassinated by the US government when they are oveseas.  Blair said the comments were intended to “reassure” Americans that there was a “set of defined policy and legal procedures” in place and that such assassinations are always carried out by the book.</p><p>Rep. Pete Hoekstra (R – MI) inquired about the procedures involved, asking what the legal framework was under which Americans could be killed by the intelligence community.</p><p>Blair insisted that under no circumstances would Americans be assassinated overseas for criticizing the government, adding “we don’t target people for free speech.” Rather they are subject to assassination when the government decides they are a threat and when they “get specific permission.” Exactly who was giving that permission was unclear.</p></blockquote><p>It would certainly be interesting to know precisely what defines threat these days.  Are they talking about employment in a secret Iranian nuclear weapons facility, making fun of Obama’s teleprompter, or shorting the stock market?  Regardless, one would think that <i>an official U.S. government policy of assassinating American citizens</i> might be of some small interest to the Tea Party movement, given their much-ballyhooed concerns about government overstepping its bounds.</p><p>No matter how neoconservative you are, no matter how much of a pro-war National Greatness Conservative you might be, no matter what a complete Obama Democrat you have been since his glorious ascension to the Cherry Blossom Throne began, you cannot possibly condone your government targeting your fellow American citizens for execution sans arrest, trial, or conviction.</p></div>",
  "content_text": "Not so much\nin these latter days\nof what used to be the Republic:\nIn testimony before the House Intelligence Committee today, National Intelligence Director Dennis Blair told representatives that American citizens can be assassinated by the US government when they are oveseas.  Blair said the comments were intended to “reassure” Americans that there was a “set of defined policy and legal procedures” in place and that such assassinations are always carried out by the book.\nRep. Pete Hoekstra (R – MI) inquired about the procedures involved, asking what the legal framework was under which Americans could be killed by the intelligence community.\nBlair insisted that under no circumstances would Americans be assassinated overseas for criticizing the government, adding “we don’t target people for free speech.” Rather they are subject to assassination when the government decides they are a threat and when they “get specific permission.” Exactly who was giving that permission was unclear.\nIt would certainly be interesting to know precisely what defines threat these days.  Are they talking about employment in a secret Iranian nuclear weapons facility, making fun of Obama’s teleprompter, or shorting the stock market?  Regardless, one would think that\nan official U.S. government policy of assassinating American citizens\nmight be of some small interest to the Tea Party movement, given their much-ballyhooed concerns about government overstepping its bounds.\nNo matter how neoconservative you are, no matter how much of a pro-war National Greatness Conservative you might be, no matter what a complete Obama Democrat you have been since his glorious ascension to the Cherry Blossom Throne began, you cannot possibly condone your government targeting your fellow American citizens for execution sans arrest, trial, or conviction.",
  "tags": [
    "politics"
  ],
  "categories": [],
  "sitemap_lastmod": "2010-02-09T21:41:00+00:00"
}