{
  "url": "https://voxday.net/2010/02/23/lomborg-returns-fire/",
  "scraped_at": "2026-01-08T23:20:14.577845",
  "title": "Lomborg returns fire",
  "date_display": "February 23, 2010",
  "date_iso": "2010-02-23T15:15:00+00:00",
  "date_from_url": "2010-02-23",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p><a href=\"http://www.lomborg.com/dyn/files/basic_items/118-file/BL%20reply%20to%20Howard%20Friel.pdf\">Bjorn Lomborg responds</a> to what appears to be an incompetent, would-be hatchet job on his climate books:</p><blockquote><p>Howard Friel’s book The Lomborg Deception (LD) focuses on two of my books, The Skeptical Environmentalist (TSE) and the U.S. edition of Cool It (CIUS). It is heartening to write books that engage others, and I welcome his critique.<br> Unfortunately, it is obvious that Friel has no interest in fair-minded criticism or honest disagreement. Rather, he seems determined to portray me as devious, deceptive, and intellectually dishonest. Ironically, in his zeal to do so, he repeatedly commits the very sins he accuses me of – selective or incomplete quotation, misrepresentation of source material, and even outright fabrication. Rather than engaging with my books on their own terms, he caricatures my work and then attacks it.</br></p><p>Friel makes his intent clear in an author’s note at the beginning of his book, in which he identifies what he calls “Lomborg’s Theorem”: the idea that “global warming is no catastrophe” (p. xi).1 His aim, he says, is to discredit this idea—“to show that Lomborg’s Theorem is grounded in highly questionable data and analysis, and that there is little if any factual or analytic basis for the theorem” (p. xi). Fair enough. This is the stuff of academic debate: are my data accurate and is my analysis valid? I have no problem with anyone questioning the basis of my work, provided the questions are honest and fair-minded. But as I will document below, what Friel does in The Lomborg Deception is something else entirely. In his attempt to prove that my data and analysis are misleading and/or dishonest, he quotes source material out of context, mangles source figures and tables, misrepresents my text and source material, relies more on news reports than on peer-reviewed research, and consistently avoids engaging with the central arguments of my work.</p></blockquote><p>Having written a book that is a response to the arguments of other individuals, I can testify that it is vitally important to attack the target’s strongest arguments rather than sniping away at the trivial and peripheral issues and attempting to portray them in a false light.  The fact that I directly addressed the New Atheists’ most important arguments – Harris’s Extinction Equation, Dawkins’s Ultimate 747, and Dennett’s Division of Doxastic Labor – meant that it was impossible for their defenders to get away with their false accusations of strawmen construction.  Not that that prevented a few of the less intelligent ones from trying, of course….</p><p>Another reason that it is always a mistake to address the side issues in lieu of the central ones and fail to give your target a reasonable benefit of the doubt is that even when you have correctly addressed the relative trivialities, it is usually possible for people to play the interpretation game in an attempt to circumvent a solid rebuttal.  For example, it was only because I directly corresponded with Sam Harris that I was able to explode several excuses manufactured for him by his defenders.  In this case, after reading Lombjorg’s response, it would appear that Friel chose rather poorly in selecting a target who is clearly not afraid to stand by his works and present a detailed defense of them.</p><p>Just to be clear, I read <i>Cool It</i> and was unimpressed by it, albeit not for the reasons that Friel manufactures.  I was unimpressed mostly because it is obvious that global warming is not taking place, therefore Man is not causing it, and I have little interest in the alternative “save people from themselves” schemes which Lomborg would prefer to tax people in order to fund.</p></div>",
  "content_text": "Bjorn Lomborg responds\nto what appears to be an incompetent, would-be hatchet job on his climate books:\nHoward Friel’s book The Lomborg Deception (LD) focuses on two of my books, The Skeptical Environmentalist (TSE) and the U.S. edition of Cool It (CIUS). It is heartening to write books that engage others, and I welcome his critique.\nUnfortunately, it is obvious that Friel has no interest in fair-minded criticism or honest disagreement. Rather, he seems determined to portray me as devious, deceptive, and intellectually dishonest. Ironically, in his zeal to do so, he repeatedly commits the very sins he accuses me of – selective or incomplete quotation, misrepresentation of source material, and even outright fabrication. Rather than engaging with my books on their own terms, he caricatures my work and then attacks it.\nFriel makes his intent clear in an author’s note at the beginning of his book, in which he identifies what he calls “Lomborg’s Theorem”: the idea that “global warming is no catastrophe” (p. xi).1 His aim, he says, is to discredit this idea—“to show that Lomborg’s Theorem is grounded in highly questionable data and analysis, and that there is little if any factual or analytic basis for the theorem” (p. xi). Fair enough. This is the stuff of academic debate: are my data accurate and is my analysis valid? I have no problem with anyone questioning the basis of my work, provided the questions are honest and fair-minded. But as I will document below, what Friel does in The Lomborg Deception is something else entirely. In his attempt to prove that my data and analysis are misleading and/or dishonest, he quotes source material out of context, mangles source figures and tables, misrepresents my text and source material, relies more on news reports than on peer-reviewed research, and consistently avoids engaging with the central arguments of my work.\nHaving written a book that is a response to the arguments of other individuals, I can testify that it is vitally important to attack the target’s strongest arguments rather than sniping away at the trivial and peripheral issues and attempting to portray them in a false light.  The fact that I directly addressed the New Atheists’ most important arguments – Harris’s Extinction Equation, Dawkins’s Ultimate 747, and Dennett’s Division of Doxastic Labor – meant that it was impossible for their defenders to get away with their false accusations of strawmen construction.  Not that that prevented a few of the less intelligent ones from trying, of course….\nAnother reason that it is always a mistake to address the side issues in lieu of the central ones and fail to give your target a reasonable benefit of the doubt is that even when you have correctly addressed the relative trivialities, it is usually possible for people to play the interpretation game in an attempt to circumvent a solid rebuttal.  For example, it was only because I directly corresponded with Sam Harris that I was able to explode several excuses manufactured for him by his defenders.  In this case, after reading Lombjorg’s response, it would appear that Friel chose rather poorly in selecting a target who is clearly not afraid to stand by his works and present a detailed defense of them.\nJust to be clear, I read\nCool It\nand was unimpressed by it, albeit not for the reasons that Friel manufactures.  I was unimpressed mostly because it is obvious that global warming is not taking place, therefore Man is not causing it, and I have little interest in the alternative “save people from themselves” schemes which Lomborg would prefer to tax people in order to fund.",
  "tags": [
    "AGW/CC",
    "books"
  ],
  "categories": [],
  "sitemap_lastmod": "2010-02-23T15:15:00+00:00"
}