{
  "url": "https://voxday.net/2010/02/26/mailvox-lets-describe-certain-female/",
  "scraped_at": "2026-01-08T23:20:31.065320",
  "title": "Mailvox: Let’s describe a certain female",
  "date_display": "February 26, 2010",
  "date_iso": "2010-02-26T12:44:00+00:00",
  "date_from_url": "2010-02-26",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>A few of you asked me why I came down so hard on Dana Loesch aka Mamalogues after her moronic blathering about how she’s all for small government and Ron Paul <a href=\"http://www.milobookclub.com/2010/02/11/stick-to-mommyblogging/\">so long as it doesn’t get in the way</a> of invading and occupying every country that might conceivably harbor a terrorist somewhere.  Here’s a reminder of <a href=\"http://www.mamalogues.com/2008/07/ill-be-your-huckleberry.html\">how remarkably clueless she was even before</a> she jumped on the hapless Tea Party bandwagon and threw over mommyblogging* for life on the road as an Instapundit groupie:</p><blockquote><p>The ripples of this extended all the way over to World Net Daily, whose columnist by the pseudonym of Vox Day (seriously, I think there were like 20 of those pseudonyms back in my junior high AOL chatroom days) – excuse me – Christian columnist Vox Day (real name Theodore Beale; he’s a rich kid and his dad was on the board at WND, which undoubtedly helped Beale to get some ink) decided to go on a rant against women with emphasis on mothers who blog and basically called us all stupid. I realize that intelligence is probably very important to a man who works “I’m in Mensa” in every biographical footnote and pick-up lines, all the while juxtaposing it next to a standard Myspace headshot replete with a hairstyle and goatee sported by every teenage male member of my Ozark family…. I would go so far as to say Day is acting like a “manazi.</p></blockquote><p>It’s hard to know where to begin cataloging the dumb bitch’s errors… I suppose the fact that I’ve never had a goatee would probably be a reasonable one.  I had no idea who the blithering little idiot was until she took exception to my pointing out that one of her fellow mommybloggers was a vacuous cow.  (Stops and consults blog archives.)  Excuse me, I stand corrected.  A <a href=\"http://www.milobookclub.com/2008/07/29/rule-1/\">narcissistic, brainless, lactating cow</a>.  Now she’s followed Michelle Malkin’s lead in parlaying her attractive-for-a-thirty-something looks into a minor degree of Internet notoriety, but she clearly hasn’t gotten any smarter.  And, of course, <a href=\"http://www.milobookclub.com/2008/08/01/mailvox-read-more-carefully-before-you/\">she’s a confirmed liar</a> as well.</p><p>So it is more than a little amusing to see wannabee political analysts like her rambling on and on about the interfactional horse races and engaging in pointless Tea Party posturing while the very ground beneath the vast edifice that sustains their superficial activities <a href=\"http://finance.yahoo.com/banking-budgeting/article/108901/death-of-american-capitalism-the-10-final-scenes;_ylt=AlVXjz2tDpT66kgrE9TsB7G7YWsA;_ylu=X3oDMTFmc2F2c3NyBHBvcwM0BHNlYwNleHBlcnRPcGluaW9uRHluYW1pYwRzbGsDdGhlZW5kb2ZhbWVy\">continues to crumble</a>.  It’s not unlike watching partisans of the Greens and Blues argue about who has the better charioteer as a giant Persian army storms the undefended walls.  Also, in my experience, I’ve noticed that the only people who give a damn about my Mensa membership are those who are almost, but not quite, qualified to join.</p><p>In case you haven’t figured it out yet, I’m not interested in US politics per se.  They’re irrelevant, as Scott Brown’s support of Obama’s $15 billion jobs bill shows.  Huge victory there, Tea Partiers!  Who could have ever seen that one coming?  And I’m even less interested in the commentator-as-career game.  I don’t care who ends up on Fox or MSNBC since I don’t watch it and no amount of television appearances or radio cameos will make anything one says or writes any more intelligent.  Not only does the accuracy of one’s analysis have no positive correlation to the size of one’s audience, but recent media history strongly suggests that the relationship between accuracy and audience size is a negative one.  Most people are idiots, after all, and Ms Loesch is clearly a woman of the people.</p><p>Always outnumbered, never outgunned.</p><p>*<i>The woman may actually still be mommyblogging for all I know.  I don’t read her and never have.</i></p></div>",
  "content_text": "A few of you asked me why I came down so hard on Dana Loesch aka Mamalogues after her moronic blathering about how she’s all for small government and Ron Paul\nso long as it doesn’t get in the way\nof invading and occupying every country that might conceivably harbor a terrorist somewhere.  Here’s a reminder of\nhow remarkably clueless she was even before\nshe jumped on the hapless Tea Party bandwagon and threw over mommyblogging* for life on the road as an Instapundit groupie:\nThe ripples of this extended all the way over to World Net Daily, whose columnist by the pseudonym of Vox Day (seriously, I think there were like 20 of those pseudonyms back in my junior high AOL chatroom days) – excuse me – Christian columnist Vox Day (real name Theodore Beale; he’s a rich kid and his dad was on the board at WND, which undoubtedly helped Beale to get some ink) decided to go on a rant against women with emphasis on mothers who blog and basically called us all stupid. I realize that intelligence is probably very important to a man who works “I’m in Mensa” in every biographical footnote and pick-up lines, all the while juxtaposing it next to a standard Myspace headshot replete with a hairstyle and goatee sported by every teenage male member of my Ozark family…. I would go so far as to say Day is acting like a “manazi.\nIt’s hard to know where to begin cataloging the dumb bitch’s errors… I suppose the fact that I’ve never had a goatee would probably be a reasonable one.  I had no idea who the blithering little idiot was until she took exception to my pointing out that one of her fellow mommybloggers was a vacuous cow.  (Stops and consults blog archives.)  Excuse me, I stand corrected.  A\nnarcissistic, brainless, lactating cow\n.  Now she’s followed Michelle Malkin’s lead in parlaying her attractive-for-a-thirty-something looks into a minor degree of Internet notoriety, but she clearly hasn’t gotten any smarter.  And, of course,\nshe’s a confirmed liar\nas well.\nSo it is more than a little amusing to see wannabee political analysts like her rambling on and on about the interfactional horse races and engaging in pointless Tea Party posturing while the very ground beneath the vast edifice that sustains their superficial activities\ncontinues to crumble\n.  It’s not unlike watching partisans of the Greens and Blues argue about who has the better charioteer as a giant Persian army storms the undefended walls.  Also, in my experience, I’ve noticed that the only people who give a damn about my Mensa membership are those who are almost, but not quite, qualified to join.\nIn case you haven’t figured it out yet, I’m not interested in US politics per se.  They’re irrelevant, as Scott Brown’s support of Obama’s $15 billion jobs bill shows.  Huge victory there, Tea Partiers!  Who could have ever seen that one coming?  And I’m even less interested in the commentator-as-career game.  I don’t care who ends up on Fox or MSNBC since I don’t watch it and no amount of television appearances or radio cameos will make anything one says or writes any more intelligent.  Not only does the accuracy of one’s analysis have no positive correlation to the size of one’s audience, but recent media history strongly suggests that the relationship between accuracy and audience size is a negative one.  Most people are idiots, after all, and Ms Loesch is clearly a woman of the people.\nAlways outnumbered, never outgunned.\n*\nThe woman may actually still be mommyblogging for all I know.  I don’t read her and never have.",
  "tags": [
    "trainwreck"
  ],
  "categories": [],
  "sitemap_lastmod": "2010-02-26T12:44:00+00:00"
}