{
  "url": "https://voxday.net/2010/02/05/mailvox-gammas-and-churc/",
  "scraped_at": "2026-01-08T23:18:48.398032",
  "title": "Mailvox: gammas and the church",
  "date_display": "February 5, 2010",
  "date_iso": "2010-02-05T11:09:00+00:00",
  "date_from_url": "2010-02-05",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>JM wonders about the transformation of the church:</p><blockquote><p>I am sure you’ve gotten quite a bit of mail on the while alpha, delta, sigma discussions, but I have some questions.  Just as a delta can model alpha behavior, is it possible that our overly feminized society is creating betas and gammas from alphas (or sigmas)?  Would a true alpha tell mom to go pound sand during sensitivity training?</p><p>How do you distinguish between socipathic behavior and alpha behavior OR a sigma’s attitudes toward the world and Asperger’s Syndrome?  For instance, for all my life, my attitude as been mostly sigma-like, but recently, it’s been pointed out to me that my withdrawal and disinterest is a result of Asperger’s.  It bothered me at first, but after thinking about it, I don’t care. I just wish I could make it work for me a little better.</p><p>And finally, I have seen gammas (and to a lesser extent omegas) attempt to behave as alphas in situations where there are few true alphas – church groups come to mind.  I know many “pastors” who are slimly little, ass kissers who will do anything to get people to like them, but when someone asks them a question beyond their pay grade that challenges their authority, they go into a bitchy little approximation of an uber male.  How would you categorize this or is this expected from gammas?</p></blockquote><p>I would say that Western feminized societies are primarily turning betas into deltas and deltas into gammas.  The imaginations of many commenters here notwithstanding, there are very few genuine alphas and sigmas about and they tend to be much less subject to social pressures than normal men.  Game is threatening to the feminist agenda because it teaches Deltas and Gammas to surmount their assigned status in the social hierarchy by willful and synthetic means.  A true alpha isn’t likely to be at for “sensitivity training” in the first place, so I think it would most likely be a Beta who would go, but resist.  Alpha behavior is easily distinguished from sociopathic behavior because Alphas are successful, charismatic <i>group</i> animals.  It’s the Sigmas and Omegas who are the sociopaths; the Sigmas are the charming ones and the Omegas are the creepy ones.  The difference between the Aspie – who is almost always going to be a Gamma or Omega – and the Sigma is that the Aspie has fundamental difficulties with human relations whereas the Sigma makes friends and seduces women with ease.  It’s not about introversion vs extroversion and a few people don’t seem to have grasped the point that Sigmas are almost always confused with Alphas, not Gammas or Omegas.</p><p>The most important thing to understand is that one’s role in the social structure is not defined by one’s internal motivations, but by the perception of others.  One can alter this perception over time, but it’s the perceptions that are the ultimate metric, not the internal dialogue.</p><p>As for the pastoral behavior, what you are describing is textbook Gamma behavior.  Gammas who find themselves in charge almost invariably behave like petty, micromanaging dictators; Gamma male behavior is very similar to normal female behavior in a lot of ways.  It should be no surprise that as the feminization of the church proceeds, the only men who will be left in it will be Gammas since they are quite comfortable with all the bitchy, passive-aggressive political infighting and petty rule-mongering that is the hallmark of female-dominated institutions.  Academia is another area that now tends to be overloaded with Gammas, as they are the only men who are not reluctant to submit to female domination.  But as various Protestant denominations have been demonstrating in real time, the church that worships at the altar of sexual equality is not a church that will worship Jesus Christ for long.</p></div>",
  "content_text": "JM wonders about the transformation of the church:\nI am sure you’ve gotten quite a bit of mail on the while alpha, delta, sigma discussions, but I have some questions.  Just as a delta can model alpha behavior, is it possible that our overly feminized society is creating betas and gammas from alphas (or sigmas)?  Would a true alpha tell mom to go pound sand during sensitivity training?\nHow do you distinguish between socipathic behavior and alpha behavior OR a sigma’s attitudes toward the world and Asperger’s Syndrome?  For instance, for all my life, my attitude as been mostly sigma-like, but recently, it’s been pointed out to me that my withdrawal and disinterest is a result of Asperger’s.  It bothered me at first, but after thinking about it, I don’t care. I just wish I could make it work for me a little better.\nAnd finally, I have seen gammas (and to a lesser extent omegas) attempt to behave as alphas in situations where there are few true alphas – church groups come to mind.  I know many “pastors” who are slimly little, ass kissers who will do anything to get people to like them, but when someone asks them a question beyond their pay grade that challenges their authority, they go into a bitchy little approximation of an uber male.  How would you categorize this or is this expected from gammas?\nI would say that Western feminized societies are primarily turning betas into deltas and deltas into gammas.  The imaginations of many commenters here notwithstanding, there are very few genuine alphas and sigmas about and they tend to be much less subject to social pressures than normal men.  Game is threatening to the feminist agenda because it teaches Deltas and Gammas to surmount their assigned status in the social hierarchy by willful and synthetic means.  A true alpha isn’t likely to be at for “sensitivity training” in the first place, so I think it would most likely be a Beta who would go, but resist.  Alpha behavior is easily distinguished from sociopathic behavior because Alphas are successful, charismatic\ngroup\nanimals.  It’s the Sigmas and Omegas who are the sociopaths; the Sigmas are the charming ones and the Omegas are the creepy ones.  The difference between the Aspie – who is almost always going to be a Gamma or Omega – and the Sigma is that the Aspie has fundamental difficulties with human relations whereas the Sigma makes friends and seduces women with ease.  It’s not about introversion vs extroversion and a few people don’t seem to have grasped the point that Sigmas are almost always confused with Alphas, not Gammas or Omegas.\nThe most important thing to understand is that one’s role in the social structure is not defined by one’s internal motivations, but by the perception of others.  One can alter this perception over time, but it’s the perceptions that are the ultimate metric, not the internal dialogue.\nAs for the pastoral behavior, what you are describing is textbook Gamma behavior.  Gammas who find themselves in charge almost invariably behave like petty, micromanaging dictators; Gamma male behavior is very similar to normal female behavior in a lot of ways.  It should be no surprise that as the feminization of the church proceeds, the only men who will be left in it will be Gammas since they are quite comfortable with all the bitchy, passive-aggressive political infighting and petty rule-mongering that is the hallmark of female-dominated institutions.  Academia is another area that now tends to be overloaded with Gammas, as they are the only men who are not reluctant to submit to female domination.  But as various Protestant denominations have been demonstrating in real time, the church that worships at the altar of sexual equality is not a church that will worship Jesus Christ for long.",
  "tags": [
    "mailvox",
    "society"
  ],
  "categories": [],
  "sitemap_lastmod": "2010-02-05T11:09:00+00:00"
}