{
  "url": "https://voxday.net/2010/02/12/observing-obvious/",
  "scraped_at": "2026-01-08T23:19:19.976942",
  "title": "Observing the obvious",
  "date_display": "February 12, 2010",
  "date_iso": "2010-02-12T14:45:00+00:00",
  "date_from_url": "2010-02-12",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>Nate W objects to a statement of the obvious:</p><blockquote><p>Flies, honey &amp; vinegar Vox. Flies, honey &amp; vinegar. Calling someone a “fucking moron” is not usually the best way to gain allies. And Dana certainly comes off as a potential ally.</p></blockquote><p>As Nate pointed out, I am not looking for allies.  I have no need of them since I am neither looking to build a media career nor am I seeking to influence the political process.  I am certainly not attempting to save the people of the United States from themselves since I do not believe it is possible at this point for anything or anyone to save them from the bankruptcy and serfdom that they have collectively and democratically chosen.  The Tea Party movement is an irrelevant means of harmlessly releasing populist steam from the system and I have seen no indication that it is capable of accomplishing even the least of the trivial goals espoused by its members.  The economic pressures of incipient bankruptcy and rising interest payments will eventually do more to reduce tax revenues than ten million people dressed up in 18th century attire waving placards.</p><p>Second, if someone publicly demonstrates he is a moron, he has usually done so without my assistance and he can be correctly judged on the basis of his actions regardless of whether I happen to recognize them or not.  If Ms Loesch was asserting that two plus two equaled negative thirty-seven, I expect you would quite readily accept that she was either insane or a complete moron.  But the belief that eradicating terrorism from the world is in any way, shape, or form compatible with small and limited government is no more credible than the aforementioned calculation of the sum.  And I don’t think the woman is insane.</p><p>Terrorism isn’t a mystical force of chthonic evil, it’s primarily a weapon utilized by the weaker side against the stronger side in a military conflict, often one involving the military occupation of an emotionally significant territory.  The only way to end it is to a) eliminate the weaker side, or, b) reduce the emotional stakes, ideally by ending the conflict.  It should be very clear that the World Democratic Revolution strategery of the last 10 years has completely failed, and moreover, failed by its own Rumsfeldian metric.  More terrorists have been created than were killed.  And, as those who have read Umberto Eco’s essay, <i>Striking at the Heart of the State?</i> know, terrorism is an aspect of big government.</p><p><i>“Terrorism is not the enemy of the great systems.  On the contrary, it is their natural, accepted, taken-for-granted counterpart….  Terrorism helps justify the existence of armies and police forces which are otherwise left idle and need to be given something more active to get on with.  Finally, terrorism provides a justification for disciplinary intervention in circumstances where an excess of democracy is making a situation ungovernable.”</i></p><p>It might have sounded more precise had Eco written “populism” rather than “democracy”, (NB: the Italian sense of the term is closer to the former as it does involve the American vote fetish), but nevertheless, he provides a remarkably apt description of the situation despite the obvious handicap of having written it 30 years prior to the present events.</p><blockquote><p>There is the possibility that a small, restricted government with limited funds could be distracted with “overseas” operations rather than harassing their citizens, no?</p></blockquote><p>No, that is not a credible possibility. You might as reasonably posit the possibility of a small and limited government of Playboy playmates whose sole interaction with the citizenry is entertaining them by disrobing nightly on PBS.  While it is theoretically possible, it is historically, logically, and practically impossible.</p><blockquote><p>2nd question: who would you rather vote for?<br> A socialist isolationist<br> Or a libertarian(ish) interventionist.</br></br></p></blockquote><p>This is a ridiculous question.  It’s akin to asking if one would rather vote for an oxymoron or a contradiction in terms.  Socialists, at least the dominant Marxian strain, are not isolationists by definition.  Libertarians are not interventionists.  And, even if we assume these nonexistent beasts existed, I would no more vote for either than I voted for Obama or McCain.  Regardless of whether you drive north to Massachusetts or Maine, it isn’t getting you any closer to Miami.</p></div>",
  "content_text": "Nate W objects to a statement of the obvious:\nFlies, honey & vinegar Vox. Flies, honey & vinegar. Calling someone a “fucking moron” is not usually the best way to gain allies. And Dana certainly comes off as a potential ally.\nAs Nate pointed out, I am not looking for allies.  I have no need of them since I am neither looking to build a media career nor am I seeking to influence the political process.  I am certainly not attempting to save the people of the United States from themselves since I do not believe it is possible at this point for anything or anyone to save them from the bankruptcy and serfdom that they have collectively and democratically chosen.  The Tea Party movement is an irrelevant means of harmlessly releasing populist steam from the system and I have seen no indication that it is capable of accomplishing even the least of the trivial goals espoused by its members.  The economic pressures of incipient bankruptcy and rising interest payments will eventually do more to reduce tax revenues than ten million people dressed up in 18th century attire waving placards.\nSecond, if someone publicly demonstrates he is a moron, he has usually done so without my assistance and he can be correctly judged on the basis of his actions regardless of whether I happen to recognize them or not.  If Ms Loesch was asserting that two plus two equaled negative thirty-seven, I expect you would quite readily accept that she was either insane or a complete moron.  But the belief that eradicating terrorism from the world is in any way, shape, or form compatible with small and limited government is no more credible than the aforementioned calculation of the sum.  And I don’t think the woman is insane.\nTerrorism isn’t a mystical force of chthonic evil, it’s primarily a weapon utilized by the weaker side against the stronger side in a military conflict, often one involving the military occupation of an emotionally significant territory.  The only way to end it is to a) eliminate the weaker side, or, b) reduce the emotional stakes, ideally by ending the conflict.  It should be very clear that the World Democratic Revolution strategery of the last 10 years has completely failed, and moreover, failed by its own Rumsfeldian metric.  More terrorists have been created than were killed.  And, as those who have read Umberto Eco’s essay,\nStriking at the Heart of the State?\nknow, terrorism is an aspect of big government.\n“Terrorism is not the enemy of the great systems.  On the contrary, it is their natural, accepted, taken-for-granted counterpart….  Terrorism helps justify the existence of armies and police forces which are otherwise left idle and need to be given something more active to get on with.  Finally, terrorism provides a justification for disciplinary intervention in circumstances where an excess of democracy is making a situation ungovernable.”\nIt might have sounded more precise had Eco written “populism” rather than “democracy”, (NB: the Italian sense of the term is closer to the former as it does involve the American vote fetish), but nevertheless, he provides a remarkably apt description of the situation despite the obvious handicap of having written it 30 years prior to the present events.\nThere is the possibility that a small, restricted government with limited funds could be distracted with “overseas” operations rather than harassing their citizens, no?\nNo, that is not a credible possibility. You might as reasonably posit the possibility of a small and limited government of Playboy playmates whose sole interaction with the citizenry is entertaining them by disrobing nightly on PBS.  While it is theoretically possible, it is historically, logically, and practically impossible.\n2nd question: who would you rather vote for?\nA socialist isolationist\nOr a libertarian(ish) interventionist.\nThis is a ridiculous question.  It’s akin to asking if one would rather vote for an oxymoron or a contradiction in terms.  Socialists, at least the dominant Marxian strain, are not isolationists by definition.  Libertarians are not interventionists.  And, even if we assume these nonexistent beasts existed, I would no more vote for either than I voted for Obama or McCain.  Regardless of whether you drive north to Massachusetts or Maine, it isn’t getting you any closer to Miami.",
  "tags": [
    "politics"
  ],
  "categories": [],
  "sitemap_lastmod": "2010-02-12T14:45:00+00:00"
}