{
  "url": "https://voxday.net/2010/02/02/peak-beauty/",
  "scraped_at": "2026-01-08T23:18:32.364840",
  "title": "Peak beauty",
  "date_display": "February 2, 2010",
  "date_iso": "2010-02-02T14:15:00+00:00",
  "date_from_url": "2010-02-02",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>And the female descent into invisibility.  An aging British woman <a href=\"http://www.timesonline.co.uk/tol/comment/columnists/minette_marrin/article7009663.ece\">laments the inevitable</a>:</p><blockquote><p>As every woman of a certain age comes to learn, there is a point when you become invisible. People stop paying you attention. No doubt evolutionary biologists have explanations for this. But we know, unless we choose to ignore it, that there is all too much truth in the words of the old song: keep young and beautiful if you want to be loved and — which is part of the same thing — if you want to hold on to whatever power you had in your prime.</p></blockquote><p>This female invisibility is nothing more than the natural and obvious consequence of completely failing to develop an attractive personality or interests outside of yourself.  It’s also something for which no man is likely to feel the even the slightest bit of sympathy, since only the Alphas don’t know what it’s like to have been invisible to the opposite sex and they’re not inclined to be overly concerned about how an old woman not worth bagging happens to feel.  As we can also see from what Roissy describes as <a href=\"http://en.wordpress.com/tag/hitting-the-wall/\">The Wall</a>, female invisibility actually proceeds in stages; what Ms Marrin is describing is merely the final stage in a long process which begins when the average woman hits her peak beauty somewhere between 25-27.  How quickly the decline takes place depends upon the individual woman’s genetics, commitment to fitness, and diet, but it’s a natural and unavoidable process.</p><p>Of course, all this does is place the older woman on an equal footing with virtually all men, wherein she must earn social visibility through merit.  However, it is difficult for those who have never had to develop their personalities or their minds, but have gotten by on their superficial attributes instead, to begin to do so after a lifetime of neglect.  I once asked one of my philandering friends why he can’t seem to be content for long with any of the very beautiful women with whom he is always involved.  (He’s a smart and very successful guy, definite Alpha.)  His answer was that once the novelty of the new wore off, he inevitably discovered they never had anything interesting to say, which caused them to first become boring, and then downright burdensome.</p><p>But beauty does not necessarily preclude being interesting.  My recommendation to women who don’t want to gradually decline into invisibility is to develop a genuine interest in things outside one’s self and one’s social circle.  The fading of the superficialities may be inevitable, but the concomitant social invisibility doesn’t have to be.  Just as the male athlete has to accept that his time in the spotlight is one day going to come to an end and his fans will turn their attention to younger, more capable performers, the attractive woman has to accept that the enjoyable experience of basking in the immediate arousal of the men around her will also cease in time.</p><p>What a woman does about this, either in anticipation or in response, depends entirely upon what a woman wants out of life.  There is no correct answer.  I’m not saying that a woman shouldn’t enjoy her moment in the sun while it lasts anymore than an athlete shouldn’t exert himself to the utmost of his potential.  But I am saying that the sun will go down on your beauty, usually sooner than later, and graceless denial of the inevitable is never attractive to anyone.</p></div>",
  "content_text": "And the female descent into invisibility.  An aging British woman\nlaments the inevitable\n:\nAs every woman of a certain age comes to learn, there is a point when you become invisible. People stop paying you attention. No doubt evolutionary biologists have explanations for this. But we know, unless we choose to ignore it, that there is all too much truth in the words of the old song: keep young and beautiful if you want to be loved and — which is part of the same thing — if you want to hold on to whatever power you had in your prime.\nThis female invisibility is nothing more than the natural and obvious consequence of completely failing to develop an attractive personality or interests outside of yourself.  It’s also something for which no man is likely to feel the even the slightest bit of sympathy, since only the Alphas don’t know what it’s like to have been invisible to the opposite sex and they’re not inclined to be overly concerned about how an old woman not worth bagging happens to feel.  As we can also see from what Roissy describes as\nThe Wall\n, female invisibility actually proceeds in stages; what Ms Marrin is describing is merely the final stage in a long process which begins when the average woman hits her peak beauty somewhere between 25-27.  How quickly the decline takes place depends upon the individual woman’s genetics, commitment to fitness, and diet, but it’s a natural and unavoidable process.\nOf course, all this does is place the older woman on an equal footing with virtually all men, wherein she must earn social visibility through merit.  However, it is difficult for those who have never had to develop their personalities or their minds, but have gotten by on their superficial attributes instead, to begin to do so after a lifetime of neglect.  I once asked one of my philandering friends why he can’t seem to be content for long with any of the very beautiful women with whom he is always involved.  (He’s a smart and very successful guy, definite Alpha.)  His answer was that once the novelty of the new wore off, he inevitably discovered they never had anything interesting to say, which caused them to first become boring, and then downright burdensome.\nBut beauty does not necessarily preclude being interesting.  My recommendation to women who don’t want to gradually decline into invisibility is to develop a genuine interest in things outside one’s self and one’s social circle.  The fading of the superficialities may be inevitable, but the concomitant social invisibility doesn’t have to be.  Just as the male athlete has to accept that his time in the spotlight is one day going to come to an end and his fans will turn their attention to younger, more capable performers, the attractive woman has to accept that the enjoyable experience of basking in the immediate arousal of the men around her will also cease in time.\nWhat a woman does about this, either in anticipation or in response, depends entirely upon what a woman wants out of life.  There is no correct answer.  I’m not saying that a woman shouldn’t enjoy her moment in the sun while it lasts anymore than an athlete shouldn’t exert himself to the utmost of his potential.  But I am saying that the sun will go down on your beauty, usually sooner than later, and graceless denial of the inevitable is never attractive to anyone.",
  "tags": [
    "women"
  ],
  "categories": [],
  "sitemap_lastmod": "2010-02-02T14:15:00+00:00"
}