{
  "url": "https://voxday.net/2010/02/27/question-for-ed-brayton/",
  "scraped_at": "2026-01-08T23:20:36.575325",
  "title": "A question for Ed Brayton",
  "date_display": "February 27, 2010",
  "date_iso": "2010-02-27T17:31:00+00:00",
  "date_from_url": "2010-02-27",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>Michael Heath attempts an illogical defense of Ed Brayton:</p><blockquote><p>Ed’s response to the comments regarding him in this thread <a href=\"http://scienceblogs.com/dispatches/2010/02/vox_day_ellis_washington_and_m.php\">is here</a>.  Ed does have a debating background. He is not a scientist in a relevant field, however he’s scientifically literate and has an in-depth understanding of both the evidence for evolution and creationist attempts to discredit those claims.</p><p>One of his commentors in the link above regarding this debate suggested Ed only debate in written form, I agree. I’ve yet to experience a creationist that can debate this subject without complete dependence on rhetorical and logical fallacies coupled to frequent use of the Gish Gallop. A written debate provides no cover for such intellectual dishonesty.</p><p>We such a rhetorical fallacy here where Mr. Day fails to address Mr. Brayton’s point and instead moves straight into avoidance mode.</p></blockquote><p>We have absolutely nothing of the kind here.  Ed Brayton asked Ellis Washington a question for the apparent purposes of evading a debate with him.  Calling my non-response to a question asked of Ellis Washington “a rhetorical fallacy” isn’t just ridiculous, it doesn’t even make sense.   First, asking such a question is not an appropriate response to a debate challenge; one does not engage in the debate prior to it actually taking place.  Second, asking a question in lieu of a clear yes-or-no response strongly suggests that the individual asking the question does not wish to engage in the debate.  Third, it’s a ridiculous and logically fallacious question because the absence of an alternative hypothesis does not, in itself, testify to the accuracy of the current hypothesis.  For example, Keynesian general theory has been shown to be false on both logical and empirical grounds and it would still be false on those grounds even in the absence of Neo-Classical, Austrian, or Post-Keynesian Minskyan models.</p><p>Of course, one can’t expect much in the way of logic from either biologists or journalists who are said to possess “an in-depth understanding” of “the evidence for evolution”.  So, what does Brayton himself <a href=\"http://scienceblogs.com/dispatches/2010/02/vox_day_ellis_washington_and_m.php\">have to say</a>?</p><p><i>“Someone went and posted a link to my response to Ellis Washington and my question about endogenous retroviruses in a comment  on Vox Day’s blog. Vox did manage to stop combing his mohawk and counting his world class IQ long enough to make a couple of nasty and substanceless comments about me, as did several of his readers. Guess what none of them attempted to do? Explain the patterns found in retroviruses without common descent. I bet Ellis won’t either. What he will do, as I predicted earlier, is try to change the subject from evolution and common descent to atheism. What else can he do?”</i></p><p>Nasty and substanceless comments?  Let’s see, what did I say:</p><p>1. <b> Brayton doesn’t want to debate Washington.</b> That’s neither nasty nor substanceless.  Notice that in neither of his two posts has he answered the obvious question of whether he wants to or not.</p><p>2. <b>Brayton wants to avoid debating Washington without looking like he is ducking Washington.</b> That’s neither nasty nor substanceless, that’s exactly what it looks like.  And if this is incorrect, Brayton can make it clear that he will debate Washington and will ask Washington the question during their debate.</p><p>3. <b>Brayton is a coward.</b> Nasty, perhaps.  Not substanceless.  Possibly true.  That’s exactly what it looks like now to me and pretty much everyone else on both sides of the issue.  Michael Heath’s assertion that “Ed has a debating background” says absolutely nothing about whether he wants to debate Washington or not.  Now, I know nothing about Ellis Washington and am perfectly open to the possibility that Brayton would destroy him.  But, <a href=\"http://www.milobookclub.com/2009/01/02/dispatches-from-clueless-atheis/\">considering Brayton’s past demonstration of illogical infelicities</a>, it is by no means a given.</p><p>4. <b>Brayton isn’t very bright.</b> That’s neither nasty nor substanceless, it’s just <a href=\"http://www.milobookclub.com/2009/01/02/dispatches-from-clueless-atheis/\">an observation</a>.  He’s a journalist, which is a field well-known for being filled with poorly educated bubbleheads, and his blog shows little in the way of evidence for intelligence much higher than the average literate individual.  Furthermore, the fact that he thinks Washington has no options other than turning the discussion from evolution and common descent to atheism shows that his “in-depth understanding of evolution” is nothing of the kind.  Brayton appears to be engaging in psychological projection here, for as the past discussions of evolution on this blog will testify, it is usually atheist supporters of evolution who prefer to turn the subject to religion whenever direct questions addressing the various flaws in the theory of evolution by natural selection and common descent are asked.</p><p>Anyhow, it’s quite easy to establish if I am correct in my suspicions about Ed Brayton by asking him one simple yes-or-no question. <i><b>Mr. Brayton, do you want to debate Ellis Washington?</b></i></p><p>UPDATE: Further evidence supporting my hypothesis that Brayton <a href=\"http://scienceblogs.com/dispatches/2010/02/vox_day_ellis_washington_and_m.php#comment-2308128\">isn’t that bright</a>: <i>“I made a simple factual claim: there is no coherent, reasonable explanation for the patterns found in endogenous retroviruses other than comment descent (i.e. the theory of evolution). If that’s wrong, show why it’s wrong; if you can’t, then all this talk of arrogance, snobbery and “Christophobia” is irrelevant.”</i></p><p>Brayton clearly doesn’t understand that it does not matter if his “simple factual claim” is wrong or not.  What matters is that the truth or falsehood of that “simple factual claim” says nothing about the truth or falsehood of the theory of evolution by natural selection, which happens to be the subject that Washington raised with him.  The proposition that there is only one coherent, reasonable explanation for something is not tantamount to the proposition that the coherent, reasonable explanation is actually correct.</p></div>",
  "content_text": "Michael Heath attempts an illogical defense of Ed Brayton:\nEd’s response to the comments regarding him in this thread\nis here\n.  Ed does have a debating background. He is not a scientist in a relevant field, however he’s scientifically literate and has an in-depth understanding of both the evidence for evolution and creationist attempts to discredit those claims.\nOne of his commentors in the link above regarding this debate suggested Ed only debate in written form, I agree. I’ve yet to experience a creationist that can debate this subject without complete dependence on rhetorical and logical fallacies coupled to frequent use of the Gish Gallop. A written debate provides no cover for such intellectual dishonesty.\nWe such a rhetorical fallacy here where Mr. Day fails to address Mr. Brayton’s point and instead moves straight into avoidance mode.\nWe have absolutely nothing of the kind here.  Ed Brayton asked Ellis Washington a question for the apparent purposes of evading a debate with him.  Calling my non-response to a question asked of Ellis Washington “a rhetorical fallacy” isn’t just ridiculous, it doesn’t even make sense.   First, asking such a question is not an appropriate response to a debate challenge; one does not engage in the debate prior to it actually taking place.  Second, asking a question in lieu of a clear yes-or-no response strongly suggests that the individual asking the question does not wish to engage in the debate.  Third, it’s a ridiculous and logically fallacious question because the absence of an alternative hypothesis does not, in itself, testify to the accuracy of the current hypothesis.  For example, Keynesian general theory has been shown to be false on both logical and empirical grounds and it would still be false on those grounds even in the absence of Neo-Classical, Austrian, or Post-Keynesian Minskyan models.\nOf course, one can’t expect much in the way of logic from either biologists or journalists who are said to possess “an in-depth understanding” of “the evidence for evolution”.  So, what does Brayton himself\nhave to say\n?\n“Someone went and posted a link to my response to Ellis Washington and my question about endogenous retroviruses in a comment  on Vox Day’s blog. Vox did manage to stop combing his mohawk and counting his world class IQ long enough to make a couple of nasty and substanceless comments about me, as did several of his readers. Guess what none of them attempted to do? Explain the patterns found in retroviruses without common descent. I bet Ellis won’t either. What he will do, as I predicted earlier, is try to change the subject from evolution and common descent to atheism. What else can he do?”\nNasty and substanceless comments?  Let’s see, what did I say:\n1.\nBrayton doesn’t want to debate Washington.\nThat’s neither nasty nor substanceless.  Notice that in neither of his two posts has he answered the obvious question of whether he wants to or not.\n2.\nBrayton wants to avoid debating Washington without looking like he is ducking Washington.\nThat’s neither nasty nor substanceless, that’s exactly what it looks like.  And if this is incorrect, Brayton can make it clear that he will debate Washington and will ask Washington the question during their debate.\n3.\nBrayton is a coward.\nNasty, perhaps.  Not substanceless.  Possibly true.  That’s exactly what it looks like now to me and pretty much everyone else on both sides of the issue.  Michael Heath’s assertion that “Ed has a debating background” says absolutely nothing about whether he wants to debate Washington or not.  Now, I know nothing about Ellis Washington and am perfectly open to the possibility that Brayton would destroy him.  But,\nconsidering Brayton’s past demonstration of illogical infelicities\n, it is by no means a given.\n4.\nBrayton isn’t very bright.\nThat’s neither nasty nor substanceless, it’s just\nan observation\n.  He’s a journalist, which is a field well-known for being filled with poorly educated bubbleheads, and his blog shows little in the way of evidence for intelligence much higher than the average literate individual.  Furthermore, the fact that he thinks Washington has no options other than turning the discussion from evolution and common descent to atheism shows that his “in-depth understanding of evolution” is nothing of the kind.  Brayton appears to be engaging in psychological projection here, for as the past discussions of evolution on this blog will testify, it is usually atheist supporters of evolution who prefer to turn the subject to religion whenever direct questions addressing the various flaws in the theory of evolution by natural selection and common descent are asked.\nAnyhow, it’s quite easy to establish if I am correct in my suspicions about Ed Brayton by asking him one simple yes-or-no question.\nMr. Brayton, do you want to debate Ellis Washington?\nUPDATE: Further evidence supporting my hypothesis that Brayton\nisn’t that bright\n:\n“I made a simple factual claim: there is no coherent, reasonable explanation for the patterns found in endogenous retroviruses other than comment descent (i.e. the theory of evolution). If that’s wrong, show why it’s wrong; if you can’t, then all this talk of arrogance, snobbery and “Christophobia” is irrelevant.”\nBrayton clearly doesn’t understand that it does not matter if his “simple factual claim” is wrong or not.  What matters is that the truth or falsehood of that “simple factual claim” says nothing about the truth or falsehood of the theory of evolution by natural selection, which happens to be the subject that Washington raised with him.  The proposition that there is only one coherent, reasonable explanation for something is not tantamount to the proposition that the coherent, reasonable explanation is actually correct.",
  "tags": [
    "evolution",
    "trainwreck"
  ],
  "categories": [],
  "sitemap_lastmod": "2010-02-27T17:31:00+00:00"
}