{
  "url": "https://voxday.net/2010/02/13/science-self-corrects/",
  "scraped_at": "2026-01-08T23:19:23.630078",
  "title": "Science self-corrects",
  "date_display": "February 13, 2010",
  "date_iso": "2010-02-13T09:09:00+00:00",
  "date_from_url": "2010-02-13",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>No worries, it’s just <a href=\"http://www.nytimes.com/2010/02/13/us/13alabama.html\">evolution in action</a>:</p><blockquote><p>Three faculty members at the University of Alabama in Huntsville were shot to death, and three other people were seriously wounded at a biology faculty meeting on Friday afternoon, university officials said.  The Associated Press reported that a biology professor, identified as Amy Bishop, was charged with murder.</p></blockquote><p>Since we’ve been informed so many times that scientists are trained to be rational and objective, and that science is what scientists do, it is clear that Prof. Bishop’s actions should be considered an experiment in natural selection rather than a crime.  For as we know from the regrettable slanders stemming from Hackergate, no scientist would ever do something terrible like invent data, much less shoot anyone, in the tawdry, unscientific pursuit of filthy lucre.</p><p>UPDATE: It’s hard to be a butterfly collector.  There’s a lot of stress, especially when they are so cruel as to make you do a little math. <i>“As members of the biotechnology program, students have to pass core classes in biology, chemistry and chemical engineering. But Ms. Bishop became convinced, he said, that the chemical engineering professors were trying to keep biology students from succeeding by making the classes too difficult.”</i></p></div>",
  "content_text": "No worries, it’s just\nevolution in action\n:\nThree faculty members at the University of Alabama in Huntsville were shot to death, and three other people were seriously wounded at a biology faculty meeting on Friday afternoon, university officials said.  The Associated Press reported that a biology professor, identified as Amy Bishop, was charged with murder.\nSince we’ve been informed so many times that scientists are trained to be rational and objective, and that science is what scientists do, it is clear that Prof. Bishop’s actions should be considered an experiment in natural selection rather than a crime.  For as we know from the regrettable slanders stemming from Hackergate, no scientist would ever do something terrible like invent data, much less shoot anyone, in the tawdry, unscientific pursuit of filthy lucre.\nUPDATE: It’s hard to be a butterfly collector.  There’s a lot of stress, especially when they are so cruel as to make you do a little math.\n“As members of the biotechnology program, students have to pass core classes in biology, chemistry and chemical engineering. But Ms. Bishop became convinced, he said, that the chemical engineering professors were trying to keep biology students from succeeding by making the classes too difficult.”",
  "tags": [
    "science"
  ],
  "categories": [],
  "sitemap_lastmod": "2010-02-13T09:09:00+00:00"
}