{
  "url": "https://voxday.net/2010/02/01/so-kill-yourself-already/",
  "scraped_at": "2026-01-08T23:18:28.708690",
  "title": "So kill yourself already",
  "date_display": "February 1, 2010",
  "date_iso": "2010-02-01T18:15:00+00:00",
  "date_from_url": "2010-02-01",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>Terry Pratchett is an author of wonderful fantasy books.  He is also, quite lamentably, a victim of early-onset Alzheimers.  And as an ethicist, logician, and political activist I can only say that <a href=\"http://www.timesonline.co.uk/tol/life_and_style/health/article7010209.ece\">he makes a wonderful fantasy author</a>:</p><blockquote><p>Sir Terry said that if he knew he could end his life at a time of his choosing, without the fear of incriminating a friend or family member, he would enjoy the rest of his life far more.  “If I knew that I could die at any time I wanted, then suddenly every day would be as precious as a million pounds. If I knew that I could die, I would live. My life, my death, my choice,”</p></blockquote><p>Sir Terry can already die at any time he likes.  He can walk out in front of an onrushing truck today.  He can blow out his brains with a .50 Desert Eagle tomorrow.  Alternatively, next Thursday he can walk into one of the many mosques of Londonistan and wave around a penciled caricature of a certain individual who is not under any circumstances to be depicted.  The motto: “My life, my death, my choice” is not only misleading, it is a cowardly evasion of the obvious.  It is the frightened cry of a stricken man who is afraid to kill himself and prefers for someone else to take the responsibility from him.</p><p>There is room for reasonable disagreement about how those who are unexpectedly rendered helpless are treated, particularly if their previous wishes are clearly expressed in notarized writing.  But any man who is capable of giving a public lecture on <s>assisted suicide</s>consensual murder is also clearly capable of exercising his own choice with regards to the continuation of his present existence.  Do not misunderstand me here; I don’t dislike Terry Pratchett nor do I want him to die.  I would vastly prefer that he survive long enough for them to find a cure so that he can keep writing his excellent and underrated books.  And while I have sympathy for the man, I have none for the suicide activist.</p><p>If the man really wants to die for fear of his disease, then he should simply go ahead and take responsibility for the act himself, whether that is today, tomorrow, or two years from now.  It’s precisely <i>because</i> it is his own decision that no one else can assume the responsibility for ending his life.  It is evil and stupid and cowardly to attempt to lay the foundation for what is already known to have led to <a href=\"http://news.bbc.co.uk/2/hi/europe/4198993.stm\">the murder of more than 15 children per year</a> in the Netherlands simply because you don’t have the fortitude to commit suicide while you’re of sufficiently sound mind and body.</p><p>I hope that Mr. Pratchett has not seriously thought the matter through, as it’s hard to imagine that he genuinely desires the English infanticide that would inevitably follow to become a part of his legacy.  Law should not be based on enjoyment, especially when a more accurate description of what Pratchett is saying is “my life, my death, my choice, your action.”</p></div>",
  "content_text": "Terry Pratchett is an author of wonderful fantasy books.  He is also, quite lamentably, a victim of early-onset Alzheimers.  And as an ethicist, logician, and political activist I can only say that\nhe makes a wonderful fantasy author\n:\nSir Terry said that if he knew he could end his life at a time of his choosing, without the fear of incriminating a friend or family member, he would enjoy the rest of his life far more.  “If I knew that I could die at any time I wanted, then suddenly every day would be as precious as a million pounds. If I knew that I could die, I would live. My life, my death, my choice,”\nSir Terry can already die at any time he likes.  He can walk out in front of an onrushing truck today.  He can blow out his brains with a .50 Desert Eagle tomorrow.  Alternatively, next Thursday he can walk into one of the many mosques of Londonistan and wave around a penciled caricature of a certain individual who is not under any circumstances to be depicted.  The motto: “My life, my death, my choice” is not only misleading, it is a cowardly evasion of the obvious.  It is the frightened cry of a stricken man who is afraid to kill himself and prefers for someone else to take the responsibility from him.\nThere is room for reasonable disagreement about how those who are unexpectedly rendered helpless are treated, particularly if their previous wishes are clearly expressed in notarized writing.  But any man who is capable of giving a public lecture on\nassisted suicide\nconsensual murder is also clearly capable of exercising his own choice with regards to the continuation of his present existence.  Do not misunderstand me here; I don’t dislike Terry Pratchett nor do I want him to die.  I would vastly prefer that he survive long enough for them to find a cure so that he can keep writing his excellent and underrated books.  And while I have sympathy for the man, I have none for the suicide activist.\nIf the man really wants to die for fear of his disease, then he should simply go ahead and take responsibility for the act himself, whether that is today, tomorrow, or two years from now.  It’s precisely\nbecause\nit is his own decision that no one else can assume the responsibility for ending his life.  It is evil and stupid and cowardly to attempt to lay the foundation for what is already known to have led to\nthe murder of more than 15 children per year\nin the Netherlands simply because you don’t have the fortitude to commit suicide while you’re of sufficiently sound mind and body.\nI hope that Mr. Pratchett has not seriously thought the matter through, as it’s hard to imagine that he genuinely desires the English infanticide that would inevitably follow to become a part of his legacy.  Law should not be based on enjoyment, especially when a more accurate description of what Pratchett is saying is “my life, my death, my choice, your action.”",
  "tags": [
    "politics"
  ],
  "categories": [],
  "sitemap_lastmod": "2010-02-01T18:15:00+00:00"
}