{
  "url": "https://voxday.net/2010/02/11/stick-to-mommyblogging/",
  "scraped_at": "2026-01-08T23:19:16.326553",
  "title": "Stick to mommyblogging",
  "date_display": "February 11, 2010",
  "date_iso": "2010-02-11T07:39:00+00:00",
  "date_from_url": "2010-02-11",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>This is what happens <a href=\"http://thedanashow.wordpress.com/2010/02/09/ron-paul-and-the-tea-parties/\">when a Mommyblogger strays</a> outside her areas of competence:</p><blockquote><p>I love Ron Paul immensely with one exception: I vehemently disagree with his foreign policy. A nation alone in a world of enemies is a nation that does not last long. It’s part of a strategy in protecting American citizens. Big difference from “nation building,” a broad, sweeping term tossed at anyone who dares look to protect America from outside her borders – that and “neoconservatism” which just, ugh, gag me….</p><p>I don’t speak for all tea partiers, but having been involved in politics most of my life, this movement for a year, and having met thousands of tea partiers, I’ve yet to met one who thinks that eradicating terrorism, beyond our borders if need be, isn’t a good idea. There isn’t a concrete policy on anything but limited government power, low taxes, and devotion to the American government’s first (and only, really) priority which is protecting its people.</p></blockquote><p>Eradicating terrorism beyond our borders is a good idea?  It appears that the woman doesn’t understand that this is <i>significantly</i> less tenable than simply eradicating crime, poverty, and drug abuse within them.  As the recently confirmed federal policy on <a href=\"http://www.milobookclub.com/2010/02/09/land-of-free/\">assassinating American citizens abroad</a> proves, it is also tantamount to handing Washington an unlimited license for lethal abuse.  And it is absolutely neoconservative in two of the primary senses of the word to support the Global Struggle Against Violent Extremism, to use the Bush administration’s neocon parlance.  There is simply no way that supporting a limited government and low taxes is consistent with an endless hunt for terrorists, both real and imaginary, around the world.</p><p>If Americans don’t want to be targeted by terrorists, the answer is very clear.  Stop the military occupation of foreign countries and stop permitting nationals from countries with whom we are at whatever passes for war these days to enter the country.  Most terrorism, past and present, is directly tied to military occupations and is directed at ending the occupation of specific territory.</p><p>At least Ms Loesch doesn’t claim to speak for the Tea Partiers.  Even so, this is only one of what will be many attempts to hijack the movement for various Republican and neoconservative causes.</p></div>",
  "content_text": "This is what happens\nwhen a Mommyblogger strays\noutside her areas of competence:\nI love Ron Paul immensely with one exception: I vehemently disagree with his foreign policy. A nation alone in a world of enemies is a nation that does not last long. It’s part of a strategy in protecting American citizens. Big difference from “nation building,” a broad, sweeping term tossed at anyone who dares look to protect America from outside her borders – that and “neoconservatism” which just, ugh, gag me….\nI don’t speak for all tea partiers, but having been involved in politics most of my life, this movement for a year, and having met thousands of tea partiers, I’ve yet to met one who thinks that eradicating terrorism, beyond our borders if need be, isn’t a good idea. There isn’t a concrete policy on anything but limited government power, low taxes, and devotion to the American government’s first (and only, really) priority which is protecting its people.\nEradicating terrorism beyond our borders is a good idea?  It appears that the woman doesn’t understand that this is\nsignificantly\nless tenable than simply eradicating crime, poverty, and drug abuse within them.  As the recently confirmed federal policy on\nassassinating American citizens abroad\nproves, it is also tantamount to handing Washington an unlimited license for lethal abuse.  And it is absolutely neoconservative in two of the primary senses of the word to support the Global Struggle Against Violent Extremism, to use the Bush administration’s neocon parlance.  There is simply no way that supporting a limited government and low taxes is consistent with an endless hunt for terrorists, both real and imaginary, around the world.\nIf Americans don’t want to be targeted by terrorists, the answer is very clear.  Stop the military occupation of foreign countries and stop permitting nationals from countries with whom we are at whatever passes for war these days to enter the country.  Most terrorism, past and present, is directly tied to military occupations and is directed at ending the occupation of specific territory.\nAt least Ms Loesch doesn’t claim to speak for the Tea Partiers.  Even so, this is only one of what will be many attempts to hijack the movement for various Republican and neoconservative causes.",
  "tags": [
    "politics"
  ],
  "categories": [],
  "sitemap_lastmod": "2010-02-11T07:39:00+00:00"
}