{
  "url": "https://voxday.net/2010/02/09/theyre-going-to-need-bigger-bar/",
  "scraped_at": "2026-01-08T23:19:05.190266",
  "title": "They’re going to need a bigger bar",
  "date_display": "February 9, 2010",
  "date_iso": "2010-02-09T09:57:00+00:00",
  "date_from_url": "2010-02-09",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>I tend to suspect that the Fed’s recession bar on the TOTLL graph shown below is going to need to be widened in the relatively near future.  As is clear from the graph, total bank loans are falling at an increasing rate; the January 27th report is down 9.25% from the October 2008 peak and in the first month of 2010, deleveraging is occurring at a pace that would lead to the first double-digit credit contraction since the Fed began keeping records in 1947.  Keep in mind that this does not take into account all of the loans <a href=\"http://market-ticker.denninger.net/archives/1939-More-Examples-Massive-BS-Accounting.html\">that have effectively defaulted already</a> but have not yet been recognized as doing so.</p><div class=\"separator\" style=\"clear: both; text-align: center;\"><a href=\"http://research.stlouisfed.org/fred2/data/TOTLL_Max_630_378.png\" imageanchor=\"1\" style=\"margin-left: 1em; margin-right: 1em;\"><img border=\"0\" decoding=\"async\" fetchpriority=\"high\" height=\"192\" src=\"http://research.stlouisfed.org/fred2/data/TOTLL_Max_630_378.png\" width=\"320\"/></a></div><p> If the default situation is as grave as debt-deflationists such as Mike Shedlock, Steve Keen, and Karl Denninger have been warning, there could be a 20% bank credit contraction over the course of this year.  Such a credit collapse would completely overwhelm Washington’s present strategy of substituting government debt for private debt; as we’ve seen, the Obama administration had to produce a record $1.4 trillion deficit in 2009 in order to keep the overall debt level from falling more than one percent.  A further 20% contraction in bank credit, (which makes up about 15% of total credit market debt), would require an <i>additional</i> $1.34 trillion in government debt to replace it and keep the economy “growing”.  It should be obvious that this is not a stable or sustainable situation.</p><p>Of course, when your GDP is made up of nothing more than borrowed G, you don’t have a free market economy.  You don’t really have anything that can even be reasonably described as an economy.  On a related note, Steve Keen brings to our attention <a href=\"http://rwer.wordpress.com/\">the Real-World Economic Review’s Dynamite Prize poll</a> where one can vote for the economist most responsible for the Great Financial Collapse of 2008.  You can cast up to three votes; I voted for Alan Greenspan and Paul Samuelson.</p></div>",
  "content_text": "I tend to suspect that the Fed’s recession bar on the TOTLL graph shown below is going to need to be widened in the relatively near future.  As is clear from the graph, total bank loans are falling at an increasing rate; the January 27th report is down 9.25% from the October 2008 peak and in the first month of 2010, deleveraging is occurring at a pace that would lead to the first double-digit credit contraction since the Fed began keeping records in 1947.  Keep in mind that this does not take into account all of the loans\nthat have effectively defaulted already\nbut have not yet been recognized as doing so.\nIf the default situation is as grave as debt-deflationists such as Mike Shedlock, Steve Keen, and Karl Denninger have been warning, there could be a 20% bank credit contraction over the course of this year.  Such a credit collapse would completely overwhelm Washington’s present strategy of substituting government debt for private debt; as we’ve seen, the Obama administration had to produce a record $1.4 trillion deficit in 2009 in order to keep the overall debt level from falling more than one percent.  A further 20% contraction in bank credit, (which makes up about 15% of total credit market debt), would require an\nadditional\n$1.34 trillion in government debt to replace it and keep the economy “growing”.  It should be obvious that this is not a stable or sustainable situation.\nOf course, when your GDP is made up of nothing more than borrowed G, you don’t have a free market economy.  You don’t really have anything that can even be reasonably described as an economy.  On a related note, Steve Keen brings to our attention\nthe Real-World Economic Review’s Dynamite Prize poll\nwhere one can vote for the economist most responsible for the Great Financial Collapse of 2008.  You can cast up to three votes; I voted for Alan Greenspan and Paul Samuelson.",
  "tags": [
    "banks"
  ],
  "categories": [],
  "sitemap_lastmod": "2010-02-09T09:57:00+00:00"
}