{
  "url": "https://voxday.net/2010/02/15/tia-welcome-correction/",
  "scraped_at": "2026-01-08T23:19:32.762554",
  "title": "Mailvox: correcting TIA",
  "date_display": "February 15, 2010",
  "date_iso": "2010-02-15T20:04:00+00:00",
  "date_from_url": "2010-02-15",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>In which we are treated to a history lesson that corrects my description of the multiverse theory mentioned in TIA.  In the chapter titled “Darwin’s Judas”, I wrote: <i>“Those indisposed to accept the anthropic principle attempt to get around the massive improbability problem it presents by imagining that there are billions and billions of universes, for all things are possible through the scientist who postulates very large numbers. Only by postulating a potentially infinite number of universes can our wildly improbable universe become mathematically probable. Of course, there are no signs of any of these other universes, nor did science ever take the idea of parallel universes seriously until the alternative was accepting the apparent evidence for a universal designer. But not only is multiverse theory every bit as unfalsifiable and untestable as the God Hypothesis, it is demonstrably more improbable. If we accept Dawkins’s naked assertion that a universal designer is more complex than the one known universe, a designer is probably less complex than any two universes and infinitely less complex than an infinity of them.”</i></p><p>However, it appears I am entirely wrong about the multiverse concept being developed as a reaction to the anthropic principle.  The gentleman writes:</p><blockquote><p>One point that I think I should mention, though…. the “many worlds” interpretation of what’s going on was not invented by Darwinists in a desperate attempt to widen the playing field and give chance a chance–although they may well have seized upon it. The proposition actually predated the present debate by many years as the 1957 doctoral dissertation of Hugh Everett III at Princeton, who took the scientifically impeccable approach of accepting the mathematical formalism of quantum theory as meaning what it said. Collapsing wave functions and the assignment of statistical weights to the possible outcomes do not follow from anything inherent in the theory itself, but are consequences of the conventional imposed interpretation. Everett’s treatment effectively denies the existence of a separate classical realm, as distinct from a ghostlike superposition of potentialities, and asserts the existence of a universal wave function which never collapses, but decomposes naturally into a multitude of mutually unobserved but equally real worlds, each evolving in time, and in which the familiar statistical quantum laws will be found to apply.</p></blockquote><p>I stand corrected.  And, to be honest, also a little shocked that one of my favorite living authors, whose books rank highly in my personal top 100, actually happened to read one of my books.  This is an excellent lesson in the importance of doing all of the tangentially relevant research; I researched the anthropic principle, but only bothered to read up on the various anti-theological attacks on it rather than investigating the multiverse theory itself.</p></div>",
  "content_text": "In which we are treated to a history lesson that corrects my description of the multiverse theory mentioned in TIA.  In the chapter titled “Darwin’s Judas”, I wrote:\n“Those indisposed to accept the anthropic principle attempt to get around the massive improbability problem it presents by imagining that there are billions and billions of universes, for all things are possible through the scientist who postulates very large numbers. Only by postulating a potentially infinite number of universes can our wildly improbable universe become mathematically probable. Of course, there are no signs of any of these other universes, nor did science ever take the idea of parallel universes seriously until the alternative was accepting the apparent evidence for a universal designer. But not only is multiverse theory every bit as unfalsifiable and untestable as the God Hypothesis, it is demonstrably more improbable. If we accept Dawkins’s naked assertion that a universal designer is more complex than the one known universe, a designer is probably less complex than any two universes and infinitely less complex than an infinity of them.”\nHowever, it appears I am entirely wrong about the multiverse concept being developed as a reaction to the anthropic principle.  The gentleman writes:\nOne point that I think I should mention, though…. the “many worlds” interpretation of what’s going on was not invented by Darwinists in a desperate attempt to widen the playing field and give chance a chance–although they may well have seized upon it. The proposition actually predated the present debate by many years as the 1957 doctoral dissertation of Hugh Everett III at Princeton, who took the scientifically impeccable approach of accepting the mathematical formalism of quantum theory as meaning what it said. Collapsing wave functions and the assignment of statistical weights to the possible outcomes do not follow from anything inherent in the theory itself, but are consequences of the conventional imposed interpretation. Everett’s treatment effectively denies the existence of a separate classical realm, as distinct from a ghostlike superposition of potentialities, and asserts the existence of a universal wave function which never collapses, but decomposes naturally into a multitude of mutually unobserved but equally real worlds, each evolving in time, and in which the familiar statistical quantum laws will be found to apply.\nI stand corrected.  And, to be honest, also a little shocked that one of my favorite living authors, whose books rank highly in my personal top 100, actually happened to read one of my books.  This is an excellent lesson in the importance of doing all of the tangentially relevant research; I researched the anthropic principle, but only bothered to read up on the various anti-theological attacks on it rather than investigating the multiverse theory itself.",
  "tags": [
    "books",
    "TIA"
  ],
  "categories": [],
  "sitemap_lastmod": "2010-02-15T20:04:00+00:00"
}