{
  "url": "https://voxday.net/2023/09/06/a-uatv-offer/",
  "scraped_at": "2026-01-08T14:08:29.842865",
  "title": "A UATV Offer",
  "date_display": "September 6, 2023",
  "date_iso": "2023-09-06T19:09:01+00:00",
  "date_from_url": "2023-09-06",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>It’s become clear that a lot of readers are very interested in contemplating what is likely to come next in WWIII. As a wargamer and game developer, it’s also of particular interest to me.</p><p>Here’s the deal. If there are 10 new Premium subscriptions or 25 new Basic subscriptions <a href=\"https://unauthorized.tv/account/new/\">in the next 24 hours</a>, I will broadcast a supersized Darkstream dedicated to reviewing in detail the 165-page report on the CSIS summary of the 24 US vs China wargames conducted in January, entitled <em>The First Battle of the Next War: Wargaming a Chinese Invasion of Taiwan</em>.</p><p>By the way, there are now 5,463 videos available on UATV, with 3-6 more being added every single day. The duplicate set of servers has already been installed at the European data center and is expected to go operational before the end of the month.</p><p><strong>UPDATE: </strong>Apparently there is considerable interest in WWIII. The 24 hours aren’t even close to being up and BOTH targets were blown away. So it’s on. I’m up to page 30 already, and I’m also working on seeing if I can obtain the rules of the wargame. They’re not necessary for the detailed analysis as I should be able to glean their assumptions from the results, but I like to read wargame rules.</p><p>Also, in order to express my appreciation for the high degree of interest indicated and support provided, I’m going to add a second review of the CNAS wargame conducted in June 2022.</p><p><em><a href=\"https://social.infogalactic.com/micropost/b8f7861d-f280-4c09-97ac-3a6bb374abfc\">DISCUSS ON SG</a></em></p></div>",
  "content_text": "It’s become clear that a lot of readers are very interested in contemplating what is likely to come next in WWIII. As a wargamer and game developer, it’s also of particular interest to me.\nHere’s the deal. If there are 10 new Premium subscriptions or 25 new Basic subscriptions\nin the next 24 hours\n, I will broadcast a supersized Darkstream dedicated to reviewing in detail the 165-page report on the CSIS summary of the 24 US vs China wargames conducted in January, entitled\nThe First Battle of the Next War: Wargaming a Chinese Invasion of Taiwan\n.\nBy the way, there are now 5,463 videos available on UATV, with 3-6 more being added every single day. The duplicate set of servers has already been installed at the European data center and is expected to go operational before the end of the month.\nUPDATE:\nApparently there is considerable interest in WWIII. The 24 hours aren’t even close to being up and BOTH targets were blown away. So it’s on. I’m up to page 30 already, and I’m also working on seeing if I can obtain the rules of the wargame. They’re not necessary for the detailed analysis as I should be able to glean their assumptions from the results, but I like to read wargame rules.\nAlso, in order to express my appreciation for the high degree of interest indicated and support provided, I’m going to add a second review of the CNAS wargame conducted in June 2022.\nDISCUSS ON SG",
  "tags": [
    "China",
    "games",
    "UATV",
    "war"
  ],
  "categories": [],
  "sitemap_lastmod": "2023-09-07T08:45:21+00:00"
}