{
  "url": "https://voxday.net/2023/09/09/adieu-divine-right/",
  "scraped_at": "2026-01-08T14:08:40.987093",
  "title": "Adieu Divine Right",
  "date_display": "September 9, 2023",
  "date_iso": "2023-09-09T11:23:39+00:00",
  "date_from_url": "2023-09-09",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>You can put this one squarely in my list of failures. This morning, I relinquished all of the development and publication rights to the excellent fantasy wargame <em>Divine Right</em>, nine months before our rights to it expired, due to my inability to get <em>Divine Right</em> reprinted or get the computer game developed. The project wasn’t a complete failure, as we did manage to get <em>Minarian Legends</em> published, but I didn’t have the bandwidth to oversee the other aspects of the project and the volunteer project leaders didn’t have the ability to complete either the boardgame or the computer wargame.</p><p>Anyhow, as a fan of the game and its creator, I wish the next group of developers great success with the updated <em>Divine Right</em>, and eventually, one hopes, <em>Scarlet Empire</em>. Sadly, it will not be featuring this excellent cover, based on the original artwork, that we had produced for our now-cancelled edition.</p><div class=\"wp-block-image\"><figure class=\"aligncenter size-full\"><img alt=\"\" class=\"wp-image-59458\" decoding=\"async\" fetchpriority=\"high\" height=\"657\" sizes=\"(max-width: 512px) 100vw, 512px\" src=\"https://voxday.net/wp-content/uploads/2023/09/image-4.png\" srcset=\"https://voxday.net/wp-content/uploads/2023/09/image-4.png 512w, https://voxday.net/wp-content/uploads/2023/09/image-4-234x300.png 234w\" width=\"512\"/></figure></div><p>For some reason, it appears that gaming volunteers are reliably less able to get a job done than those who volunteer in various other areas of development, from print books to open source office projects. I was very briefly involved in what was supposed to be a Linux distro dedicated to games, and I have never, ever, observed a more useless horde of worthless gammas, all of whom had multiple, often contradictory, opinions, and none of whom were willing to lift a finger to actually do anything at all. I quit the project three weeks after being given responsibility for overseeing the development of the first demo game for the distro.</p><p>Despite being 21 years old, <em>The Battle for Wesnoth</em> is still the flagship for open source game development.</p><p>My theory is that those who are actually willing and able to successfully develop games are mostly already doing it on their own, as the thriving independent game scene demonstrates. That leaves a lot of people who very much like the <em>idea </em>of game development, but are more interested in the trappings than in actually dealing with the decidedly less-romantic <em>reality </em>of it. The same is true of those who want to be a writer more than they want to write anything; it was surprising to observe how many of the members of a much-accomplished Minnesota writers’ group of which I briefly was a guest never actually wrote anything at all. However, it’s important to keep in mind that one can’t actually know if one has the ability to do something new until one tries; volunteers must always be respected for being willing to try rather than criticized for an inability to do.</p><p>That being said, it’s still rather remarkable that the Arkhaven, SocialGalactic, and UATV teams have been able to accomplish bigger and more difficult tasks in less time than the various groups of game volunteers have. I have some ideas as to why, but nothing concrete enough to state an opinion on them.</p><p>So, if you want to know why we’re not planning to pursue anything in the game space beyond finishing the ALT-HERO RPG for the backers and possibly licensing various properties to other game companies, now you know why. I’m not blaming anyone but myself here; that experience with the Linux project was 14 years ago, and I should have reached the correct conclusions at the time.</p><p>This doesn’t mean I won’t do any game design, but in the future, I’ll do the development myself or we’ll hire a proven professional team to do it. And let’s face it, it’s not the worst thing to give up the <em>Divine Right</em> license, as this means we’ll own all the rights to whatever fantasy wargame I end up designing in the future.</p><p><em><a href=\"https://social.infogalactic.com/micropost/84d49396-1149-41e7-8aad-873dcb0a8de5\">DISCUSS ON SG</a></em></p></div>",
  "content_text": "You can put this one squarely in my list of failures. This morning, I relinquished all of the development and publication rights to the excellent fantasy wargame\nDivine Right\n, nine months before our rights to it expired, due to my inability to get\nDivine Right\nreprinted or get the computer game developed. The project wasn’t a complete failure, as we did manage to get\nMinarian Legends\npublished, but I didn’t have the bandwidth to oversee the other aspects of the project and the volunteer project leaders didn’t have the ability to complete either the boardgame or the computer wargame.\nAnyhow, as a fan of the game and its creator, I wish the next group of developers great success with the updated\nDivine Right\n, and eventually, one hopes,\nScarlet Empire\n. Sadly, it will not be featuring this excellent cover, based on the original artwork, that we had produced for our now-cancelled edition.\nFor some reason, it appears that gaming volunteers are reliably less able to get a job done than those who volunteer in various other areas of development, from print books to open source office projects. I was very briefly involved in what was supposed to be a Linux distro dedicated to games, and I have never, ever, observed a more useless horde of worthless gammas, all of whom had multiple, often contradictory, opinions, and none of whom were willing to lift a finger to actually do anything at all. I quit the project three weeks after being given responsibility for overseeing the development of the first demo game for the distro.\nDespite being 21 years old,\nThe Battle for Wesnoth\nis still the flagship for open source game development.\nMy theory is that those who are actually willing and able to successfully develop games are mostly already doing it on their own, as the thriving independent game scene demonstrates. That leaves a lot of people who very much like the\nidea\nof game development, but are more interested in the trappings than in actually dealing with the decidedly less-romantic\nreality\nof it. The same is true of those who want to be a writer more than they want to write anything; it was surprising to observe how many of the members of a much-accomplished Minnesota writers’ group of which I briefly was a guest never actually wrote anything at all. However, it’s important to keep in mind that one can’t actually know if one has the ability to do something new until one tries; volunteers must always be respected for being willing to try rather than criticized for an inability to do.\nThat being said, it’s still rather remarkable that the Arkhaven, SocialGalactic, and UATV teams have been able to accomplish bigger and more difficult tasks in less time than the various groups of game volunteers have. I have some ideas as to why, but nothing concrete enough to state an opinion on them.\nSo, if you want to know why we’re not planning to pursue anything in the game space beyond finishing the ALT-HERO RPG for the backers and possibly licensing various properties to other game companies, now you know why. I’m not blaming anyone but myself here; that experience with the Linux project was 14 years ago, and I should have reached the correct conclusions at the time.\nThis doesn’t mean I won’t do any game design, but in the future, I’ll do the development myself or we’ll hire a proven professional team to do it. And let’s face it, it’s not the worst thing to give up the\nDivine Right\nlicense, as this means we’ll own all the rights to whatever fantasy wargame I end up designing in the future.\nDISCUSS ON SG",
  "tags": [
    "books",
    "games"
  ],
  "categories": [],
  "sitemap_lastmod": "2023-09-09T12:31:04+00:00"
}