{
  "url": "https://voxday.net/2023/09/03/changes-in-comics-news/",
  "scraped_at": "2026-01-08T14:08:07.739137",
  "title": "Changes in Comics News",
  "date_display": "September 3, 2023",
  "date_iso": "2023-09-03T10:18:01+00:00",
  "date_from_url": "2023-09-03",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>Bleeding Cool used to be one of the leading comic book sites on the Internet. It was sufficiently influential that <a href=\"https://voxday.net/2018/10/11/interview-with-bleeding-cool/\">the 2018 interview of me</a> by its chief editor and founder Mark Siefert led directly to the post-crowdfund deplatforming of Arkhaven’s <em>Alt-Hero: Q</em> campaign, but the subsequent firing of Siefert and the decline of DC Comics and Marvel, and its refusal to cover major independent players from Arkhaven, Ethan van Sciver, Eric July, and Razorfist to the various ‘toons sites have left Bleeding Cool in a state of decline that mirrors that of the overall mainstream US comics industry.</p><p>So while it’s encouraging to see the Arkhaven-friendly site <a href=\"https://boundingintocomics.com/\">Bounding Into Comics</a> passing Bleeding Cool in terms of popularity, traffic, and influence, it was always inevitable given the SJW convergence of the latter. There isn’t much use for a comics site that doesn’t cover what is not only an entire section of the industry, but the growing section of the industry, after all, and one gets a much more accurate picture of what is actually happening in comics these days from Bounding Into Comics.</p><p>But congratulations to John Trent and company for this major competitive milestone as noted by Similarweb. It’s good to see that there is still one news organization in the industry that reports actual news with some degree of impartiality and objectivity.</p><div class=\"wp-block-image\"><figure class=\"aligncenter size-full\"><img alt=\"\" class=\"wp-image-59384\" decoding=\"async\" fetchpriority=\"high\" height=\"462\" sizes=\"(max-width: 512px) 100vw, 512px\" src=\"https://voxday.net/wp-content/uploads/2023/09/image.png\" srcset=\"https://voxday.net/wp-content/uploads/2023/09/image.png 512w, https://voxday.net/wp-content/uploads/2023/09/image-300x271.png 300w\" width=\"512\"/></figure></div><p>In tangential news, John Trent wonders why anyone would want to read <a href=\"https://boundingintocomics.com/2023/08/31/new-punisher-writer-reveals-one-of-his-goals-for-the-series-is-to-reimagine-and-revamp-some-very-cool-preexisting-villains-he-also-makes-the-punisher-report-to-a-woman/\">Marvel’s new erstatz <em>Punisher</em></a>, in light of how SHIELD agent Joe Garrison has replaced the iconic Frank Castle.</p><blockquote class=\"wp-block-quote is-layout-flow wp-block-quote-is-layout-flow\"><p>It’s unclear why anyone would purchase this series after the first issue. The entire series as described by Pepose in this interview and how it was initially announced at San Diego Comic-Con appears it’s just a derivative version of Frank Castle.</p><p>Not only does Garrison sound like a derivative version of Castle, but, of course, Marvel has to push the demasculinization and demoralization narrative with having Garrison report to a woman. It’s also not hard to imagine that they “very cool preexisting villains” will be reimagined to fit the same demoralization narrative. Furthermore, we don’t know what kind of “family” Joe Garrison has. One can only imagine it fits the agenda.</p><p>Readers looking for new Punisher stories are probably better served diving back into their long boxes and reading the classic The Punisher War Journal stories or Garth Ennis’ Punisher Max.</p></blockquote><p>Or, better yet, reading Arkhaven’s forthcoming <em>Black Warrant</em>, written by ex-<em>Punisher </em>writer Chuck Dixon.</p><p><em><a href=\"https://social.infogalactic.com/micropost/65e8e670-3d8e-420d-ab3b-9f4f6c15a800\">DISCUSS ON SG</a></em></p></div>",
  "content_text": "Bleeding Cool used to be one of the leading comic book sites on the Internet. It was sufficiently influential that\nthe 2018 interview of me\nby its chief editor and founder Mark Siefert led directly to the post-crowdfund deplatforming of Arkhaven’s\nAlt-Hero: Q\ncampaign, but the subsequent firing of Siefert and the decline of DC Comics and Marvel, and its refusal to cover major independent players from Arkhaven, Ethan van Sciver, Eric July, and Razorfist to the various ‘toons sites have left Bleeding Cool in a state of decline that mirrors that of the overall mainstream US comics industry.\nSo while it’s encouraging to see the Arkhaven-friendly site\nBounding Into Comics\npassing Bleeding Cool in terms of popularity, traffic, and influence, it was always inevitable given the SJW convergence of the latter. There isn’t much use for a comics site that doesn’t cover what is not only an entire section of the industry, but the growing section of the industry, after all, and one gets a much more accurate picture of what is actually happening in comics these days from Bounding Into Comics.\nBut congratulations to John Trent and company for this major competitive milestone as noted by Similarweb. It’s good to see that there is still one news organization in the industry that reports actual news with some degree of impartiality and objectivity.\nIn tangential news, John Trent wonders why anyone would want to read\nMarvel’s new erstatz\nPunisher\n, in light of how SHIELD agent Joe Garrison has replaced the iconic Frank Castle.\nIt’s unclear why anyone would purchase this series after the first issue. The entire series as described by Pepose in this interview and how it was initially announced at San Diego Comic-Con appears it’s just a derivative version of Frank Castle.\nNot only does Garrison sound like a derivative version of Castle, but, of course, Marvel has to push the demasculinization and demoralization narrative with having Garrison report to a woman. It’s also not hard to imagine that they “very cool preexisting villains” will be reimagined to fit the same demoralization narrative. Furthermore, we don’t know what kind of “family” Joe Garrison has. One can only imagine it fits the agenda.\nReaders looking for new Punisher stories are probably better served diving back into their long boxes and reading the classic The Punisher War Journal stories or Garth Ennis’ Punisher Max.\nOr, better yet, reading Arkhaven’s forthcoming\nBlack Warrant\n, written by ex-\nPunisher\nwriter Chuck Dixon.\nDISCUSS ON SG",
  "tags": [
    "comics",
    "media"
  ],
  "categories": [],
  "sitemap_lastmod": "2023-09-03T10:48:09+00:00"
}