{
  "url": "https://voxday.net/2023/09/21/delingpole-has-his-doubts/",
  "scraped_at": "2026-01-08T14:09:40.514983",
  "title": "Delingpole Has His Doubts",
  "date_display": "September 21, 2023",
  "date_iso": "2023-09-21T17:51:37+00:00",
  "date_from_url": "2023-09-21",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>About <a href=\"https://delingpole.substack.com/p/he-makes-the-mark-of-the-beast-sign\">the legitimacy of Russell Brand</a> in the aftermath of his apparent cancellation:</p><blockquote class=\"wp-block-quote is-layout-flow wp-block-quote-is-layout-flow\"><p>Brand employs language not to so much to communicate as to beglamour. Like a cut-price Jimmy Savile – reputedly he was a wizard and his catchphrase ‘Now then, now then’ was calculated to throw listeners off their temporal balance – he is an enchanter weaving a spell. The message he strives to get across is “yes I know I’m a shifty sleazebag but you can’t help loving me because I’m a cheeky chappy, you can tell from my accent that I’m a man of the people, yet I’m also above average bright because listen to all my long words and how quickly I join them together in sentences which sound like they make sense.”</p><p>Lots of people fell for this – and continue to fall for this – for words indeed work as powerful spells for those who know how to use them. But mainly people fell for it because they were told to fall for it: by the telly; by that loveable Jonathan Woss; by chat shows; by Hollywood; by the organisers of the 2012 Olympics ceremony; by the publishers who put out My Booky-Wook; and, most recently, by all those allegedly Awake fans of Brand’s podcast who’ve been protesting for the last two or three years “No, it’s OK, you don’t understand, he really has changed, he’s one of us now.” Or, if you prefer, “But I LOVE him, Dad.”</p><p>This is how the Narrative prevails. It wears you down with its relentlessness and its ubiquity. We can sometimes appreciate this with hindsight – the way, for example, it’s now impossible to watch old footage of Jimmy Savile without wondering whatever we saw in this obvious creep. What we forget is that at the time it was almost impossible not to think Jimmy Savile was a good thing. He had been endorsed and promoted by so many sources – the charidees, the royals, Top of the Pops, his dear old Mum… – that our natural instinct to be utterly repelled by him was bludgeoned into quietude. It was like the Asch conformity test. You couldn’t help giving the wrong answer even when you knew it wasn’t the right one…</p><p>This is why there is such division, even among the Awake, about Russell Brand. What it comes down to, essentially, is whether or not you believe he’s an Illuminati foot soldier who has sold his soul to the devil and serves no other cause than the Luciferian agenda of the occult predator class.</p><p>If you don’t, if you think all that occult/Masonic/Babylonian Mystery School stuff is a bit too bonkers to accept, then you’ll find it easy to make earthbound excuses for his behaviour. If, on the other hand, you know that it’s all real, that when, in the course of a supposedly self-exculpatory video Brand forms his fingers into the shape of the Number of the Beast it’s not because he’s got arthritis, then you’ll wonder why anyone could be so deluded as to fall for the oldest trick in the book.</p></blockquote><p>And a hand gesture is never <a href=\"https://twitter.com/CathyCathyFox/status/1703024780582981639\">just a hand gesture</a>. Personally, I couldn’t care less about a celebrity who may or may not be, but probably isn’t, on our side. Unless he’s openly proclaiming Jesus Christ, defending the three pillars of Western civilization, and publicly denouncing every aspect of Clown World, including its master, I consider it safe to assume that he’s been assigned to a new role as the latest gatekeeper and celebrity icon for the naive Christian Right, which unfortunately sometimes seems to comprise most of it.</p><p><em><a href=\"https://social.infogalactic.com/micropost/9ff343a8-b692-40a9-bec2-c9108e36564e\">DISCUSS ON SG</a></em></p></div>",
  "content_text": "About\nthe legitimacy of Russell Brand\nin the aftermath of his apparent cancellation:\nBrand employs language not to so much to communicate as to beglamour. Like a cut-price Jimmy Savile – reputedly he was a wizard and his catchphrase ‘Now then, now then’ was calculated to throw listeners off their temporal balance – he is an enchanter weaving a spell. The message he strives to get across is “yes I know I’m a shifty sleazebag but you can’t help loving me because I’m a cheeky chappy, you can tell from my accent that I’m a man of the people, yet I’m also above average bright because listen to all my long words and how quickly I join them together in sentences which sound like they make sense.”\nLots of people fell for this – and continue to fall for this – for words indeed work as powerful spells for those who know how to use them. But mainly people fell for it because they were told to fall for it: by the telly; by that loveable Jonathan Woss; by chat shows; by Hollywood; by the organisers of the 2012 Olympics ceremony; by the publishers who put out My Booky-Wook; and, most recently, by all those allegedly Awake fans of Brand’s podcast who’ve been protesting for the last two or three years “No, it’s OK, you don’t understand, he really has changed, he’s one of us now.” Or, if you prefer, “But I LOVE him, Dad.”\nThis is how the Narrative prevails. It wears you down with its relentlessness and its ubiquity. We can sometimes appreciate this with hindsight – the way, for example, it’s now impossible to watch old footage of Jimmy Savile without wondering whatever we saw in this obvious creep. What we forget is that at the time it was almost impossible not to think Jimmy Savile was a good thing. He had been endorsed and promoted by so many sources – the charidees, the royals, Top of the Pops, his dear old Mum… – that our natural instinct to be utterly repelled by him was bludgeoned into quietude. It was like the Asch conformity test. You couldn’t help giving the wrong answer even when you knew it wasn’t the right one…\nThis is why there is such division, even among the Awake, about Russell Brand. What it comes down to, essentially, is whether or not you believe he’s an Illuminati foot soldier who has sold his soul to the devil and serves no other cause than the Luciferian agenda of the occult predator class.\nIf you don’t, if you think all that occult/Masonic/Babylonian Mystery School stuff is a bit too bonkers to accept, then you’ll find it easy to make earthbound excuses for his behaviour. If, on the other hand, you know that it’s all real, that when, in the course of a supposedly self-exculpatory video Brand forms his fingers into the shape of the Number of the Beast it’s not because he’s got arthritis, then you’ll wonder why anyone could be so deluded as to fall for the oldest trick in the book.\nAnd a hand gesture is never\njust a hand gesture\n. Personally, I couldn’t care less about a celebrity who may or may not be, but probably isn’t, on our side. Unless he’s openly proclaiming Jesus Christ, defending the three pillars of Western civilization, and publicly denouncing every aspect of Clown World, including its master, I consider it safe to assume that he’s been assigned to a new role as the latest gatekeeper and celebrity icon for the naive Christian Right, which unfortunately sometimes seems to comprise most of it.\nDISCUSS ON SG",
  "tags": [
    "Hellmouth",
    "media"
  ],
  "categories": [],
  "sitemap_lastmod": "2023-09-21T17:51:39+00:00"
}