{
  "url": "https://voxday.net/2023/09/10/exercise-your-skepticism/",
  "scraped_at": "2026-01-08T14:08:49.463597",
  "title": "Exercise Your Skepticism",
  "date_display": "September 10, 2023",
  "date_iso": "2023-09-10T18:55:29+00:00",
  "date_from_url": "2023-09-10",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>Nassim Nicholas Taleb on the importance of exercising skepticism, from <a href=\"https://tim.blog/2023/09/08/nassim-nicholas-taleb-scott-patterson-transcript/\">an interview with Tim Ferriss</a>:</p><blockquote class=\"wp-block-quote is-layout-flow wp-block-quote-is-layout-flow\"><p><strong>Nassim Nicholas Taleb: </strong>I noticed a lot of people are skeptical, particularly conspiracy theorists, they’re skeptical of small things, but not about big ones. So they get taken for a ride. Find me a conspiracy theorist or find me someone who’s naturally skeptical of all things and I’ll show you a turkey. So I wanted to find people who are fundamentally skeptic, being skeptic about important things, not about small things, because —</p><p><strong>Tim Ferriss: </strong>What would be an example of a big thing that they would be skeptical of?</p><p><strong>Nassim Nicholas Taleb: </strong>A big thing like — let me give you an example. I wrote a paper, it never ended up in a book, on the stock market and religion. It’s called “The Bishop and the Economist.” And I said that those who are skeptical about the existence of God or the non-existence of God, that are skeptical about religious matters, typically tend to be complete suckers when it comes to stocks. They believe in a stock market, or believe in some kind of pseudo-scientific theory on whatever it is, they believe in, but they don’t believe in religion. And the reverse, and people who are religious typically they’re harder. And there’s some, I don’t have research on that. There’s a guy called [inaudible], I think, who did some studies about skepticism, people go to religion about affairs, skepticism where it matters. And I wrote about it, I think in The Black Swan, skepticism where it matters. And I noticed that a lot of these big skeptics were not skeptical of God and things you can’t do anything about. They were skeptical of the charlatan. They are skeptical of things, of someone trying to take advantage of you. That’s where you exercise your skepticism.</p></blockquote><p>I could not agree more. It’s a pity, nay, I daresay it is a tragedy, that NN Taleb was not more skeptical about the vaxx. But perhaps that was a big thing.</p><p><em><a href=\"https://social.infogalactic.com/micropost/f1a66141-abb1-40cd-9663-de58da215669\">DISCUSS ON SG</a></em></p></div>",
  "content_text": "Nassim Nicholas Taleb on the importance of exercising skepticism, from\nan interview with Tim Ferriss\n:\nNassim Nicholas Taleb:\nI noticed a lot of people are skeptical, particularly conspiracy theorists, they’re skeptical of small things, but not about big ones. So they get taken for a ride. Find me a conspiracy theorist or find me someone who’s naturally skeptical of all things and I’ll show you a turkey. So I wanted to find people who are fundamentally skeptic, being skeptic about important things, not about small things, because —\nTim Ferriss:\nWhat would be an example of a big thing that they would be skeptical of?\nNassim Nicholas Taleb:\nA big thing like — let me give you an example. I wrote a paper, it never ended up in a book, on the stock market and religion. It’s called “The Bishop and the Economist.” And I said that those who are skeptical about the existence of God or the non-existence of God, that are skeptical about religious matters, typically tend to be complete suckers when it comes to stocks. They believe in a stock market, or believe in some kind of pseudo-scientific theory on whatever it is, they believe in, but they don’t believe in religion. And the reverse, and people who are religious typically they’re harder. And there’s some, I don’t have research on that. There’s a guy called [inaudible], I think, who did some studies about skepticism, people go to religion about affairs, skepticism where it matters. And I wrote about it, I think in The Black Swan, skepticism where it matters. And I noticed that a lot of these big skeptics were not skeptical of God and things you can’t do anything about. They were skeptical of the charlatan. They are skeptical of things, of someone trying to take advantage of you. That’s where you exercise your skepticism.\nI could not agree more. It’s a pity, nay, I daresay it is a tragedy, that NN Taleb was not more skeptical about the vaxx. But perhaps that was a big thing.\nDISCUSS ON SG",
  "tags": [
    "atheism",
    "philosophy",
    "religion"
  ],
  "categories": [],
  "sitemap_lastmod": "2023-09-10T18:55:31+00:00"
}