{
  "url": "https://voxday.net/2023/09/12/genius-trumps-expertise/",
  "scraped_at": "2026-01-08T14:08:59.711306",
  "title": "Genius Trumps Expertise",
  "date_display": "September 12, 2023",
  "date_iso": "2023-09-12T09:42:10+00:00",
  "date_from_url": "2023-09-12",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>There are two important business lessons here in this story about <a href=\"https://www.gearpatrol.com/home/a519958/how-microplane-was-invented/\">the success of a humble kitchen tool</a>:</p><blockquote class=\"wp-block-quote is-layout-flow wp-block-quote-is-layout-flow\"><p>Richard Grace, inventor of one of the greatest tools the kitchen has ever seen, neither knows how to cook nor cares to learn. In the mid-’90s, he set out to make a wood-carving rasper and ended up with a culinary masterpiece called the Microplane: a cheese-grating, citrus-zesting, nutmeg-dusting revelation that today costs as little as $12 on Amazon. He’s an inventor in the truest spirit of the word, someone who treats ideation as a profession, not a calling. He doesn’t speak in buzzwords and has never hosted a TED Talk. He simply makes things and finds uses for them later.</p><p>Lorraine, a baker with an affinity for Armenian orange cake, wasn’t happy with her old kitchen grater. So she slid her husband’s Microplane over an orange. She was so astounded by the results, she had the description of the product changed in the store catalog to include its effectiveness at this seemingly niche kitchen task. This is how the story, “Test Kitchen; A Gift for the Cook, or Carpenter,” published by The New York Times four years later, began.</p><p>Before the Microplane brass could blink, they had become a kitchenware company — whether they liked it or not. Penned by Amanda Hesser, who later cofounded the award-winning food publication Food52, this 516-word story was to become Microplane’s crossing of the Rubicon, from carpentry to culinary.</p><p>“After the Times article, basically everybody who sells anything contacted us,” Arivett told me. “Williams Sonoma; Bed, Bath &amp; Beyond; Sur La Table — everybody. It was almost too much to keep up with.”</p><p>Before the Microplane brass could blink, they had become a kitchenware company — whether they liked it or not. Within the first month following the article’s publication, the brand saw its kitchen customers eclipse its woodworking customers ten times over. Microplane, the wood rasp, sold between $300,000 and $400,000 a year; by 2002, Microplane, the kitchen gadget, did that in a month.</p><p>Then came an even bigger boom, one fueled by the power of the original kitchen influencers: celebrity chefs. Martha Stewart, Ina Garten, Rachel Ray and virtually anyone that mattered used a Microplane on their shows, calling it out by name for their audience. Julia Child liked the product so much, it earned a permanent spot hanging on the wall of her kitchen, which was later replicated at the Smithsonian. And Oprah’s personal chef, Art Smith, once called it “the most coveted tool in chefdom.”</p><p>But for all the brilliance of the original invention and the Grace family business savvy, they still weren’t sure what they were selling. “None of us were cooks,” Chris said when I asked him if the Grace family was culinarily inclined.</p></blockquote><p><strong>Lesson One: </strong>The experts know what has been done before. That’s what makes them experts. However, they do not know what is possible nor are they usually psychologically inclined to explore the various possibilities and tangents related to their knowledge. So, if you’re doing something new, do not permit yourself to be guided solely by their expertise. This is something we’ve been learning with regards to the bindery operation.</p><p><strong>Lesson Two: </strong>Don’t be married to your business plan. I would bet that less than one-third of the most successful companies are actually successful doing what they initially started out to do. For example, Castalia intended to avoid doing print editions and focus on selling ebooks through Amazon. My favorite example, however, is the Connecticut Leather Company, which started out making leather goods in 1932, and later began producing plastic wading pools, which led to it making children’s plush toys, and eventually, the home video game system called Colecovision.</p><p>Of course, Coleco offers another lesson, which is the danger of success. Despite average sales of one million Colecovisions a year for six years, the company that started in and survived the Great Depression collapsed in 1988 after digging a hole for itself with its attempt to produce its own computer.</p><p><em><a href=\"https://social.infogalactic.com/micropost/270f3daf-8fee-4518-9d8c-b9b86648cb13\">DISCUSS ON SG</a></em></p></div>",
  "content_text": "There are two important business lessons here in this story about\nthe success of a humble kitchen tool\n:\nRichard Grace, inventor of one of the greatest tools the kitchen has ever seen, neither knows how to cook nor cares to learn. In the mid-’90s, he set out to make a wood-carving rasper and ended up with a culinary masterpiece called the Microplane: a cheese-grating, citrus-zesting, nutmeg-dusting revelation that today costs as little as $12 on Amazon. He’s an inventor in the truest spirit of the word, someone who treats ideation as a profession, not a calling. He doesn’t speak in buzzwords and has never hosted a TED Talk. He simply makes things and finds uses for them later.\nLorraine, a baker with an affinity for Armenian orange cake, wasn’t happy with her old kitchen grater. So she slid her husband’s Microplane over an orange. She was so astounded by the results, she had the description of the product changed in the store catalog to include its effectiveness at this seemingly niche kitchen task. This is how the story, “Test Kitchen; A Gift for the Cook, or Carpenter,” published by The New York Times four years later, began.\nBefore the Microplane brass could blink, they had become a kitchenware company — whether they liked it or not. Penned by Amanda Hesser, who later cofounded the award-winning food publication Food52, this 516-word story was to become Microplane’s crossing of the Rubicon, from carpentry to culinary.\n“After the Times article, basically everybody who sells anything contacted us,” Arivett told me. “Williams Sonoma; Bed, Bath & Beyond; Sur La Table — everybody. It was almost too much to keep up with.”\nBefore the Microplane brass could blink, they had become a kitchenware company — whether they liked it or not. Within the first month following the article’s publication, the brand saw its kitchen customers eclipse its woodworking customers ten times over. Microplane, the wood rasp, sold between $300,000 and $400,000 a year; by 2002, Microplane, the kitchen gadget, did that in a month.\nThen came an even bigger boom, one fueled by the power of the original kitchen influencers: celebrity chefs. Martha Stewart, Ina Garten, Rachel Ray and virtually anyone that mattered used a Microplane on their shows, calling it out by name for their audience. Julia Child liked the product so much, it earned a permanent spot hanging on the wall of her kitchen, which was later replicated at the Smithsonian. And Oprah’s personal chef, Art Smith, once called it “the most coveted tool in chefdom.”\nBut for all the brilliance of the original invention and the Grace family business savvy, they still weren’t sure what they were selling. “None of us were cooks,” Chris said when I asked him if the Grace family was culinarily inclined.\nLesson One:\nThe experts know what has been done before. That’s what makes them experts. However, they do not know what is possible nor are they usually psychologically inclined to explore the various possibilities and tangents related to their knowledge. So, if you’re doing something new, do not permit yourself to be guided solely by their expertise. This is something we’ve been learning with regards to the bindery operation.\nLesson Two:\nDon’t be married to your business plan. I would bet that less than one-third of the most successful companies are actually successful doing what they initially started out to do. For example, Castalia intended to avoid doing print editions and focus on selling ebooks through Amazon. My favorite example, however, is the Connecticut Leather Company, which started out making leather goods in 1932, and later began producing plastic wading pools, which led to it making children’s plush toys, and eventually, the home video game system called Colecovision.\nOf course, Coleco offers another lesson, which is the danger of success. Despite average sales of one million Colecovisions a year for six years, the company that started in and survived the Great Depression collapsed in 1988 after digging a hole for itself with its attempt to produce its own computer.\nDISCUSS ON SG",
  "tags": [
    "business",
    "history",
    "philosophy"
  ],
  "categories": [],
  "sitemap_lastmod": "2023-09-12T09:42:12+00:00"
}