{
  "url": "https://voxday.net/2023/09/04/i-was-wrong-2/",
  "scraped_at": "2026-01-08T14:08:12.586348",
  "title": "I Was Wrong",
  "date_display": "September 4, 2023",
  "date_iso": "2023-09-04T12:32:26+00:00",
  "date_from_url": "2023-09-04",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>After considerable review of statistics and video highlights in the aftermath of Argentina winning the World Cup, I have been forced to conclude that my previous opinion was in error. There simply isn’t any question about it.</p><p><strong><em>Lionel Messi is the greatest soccer player of all time.</em></strong></p><p>I’ve always considered Pele to be number one, with Maradona a close number two. But the fact is that Messi’s creative abilities, vision, and generosity make him a more complete, more effective player on the field than either Pele or Maradona. As for modern players, Cristiano Ronaldo is an incredible scorer and an inspirational leader for Portugal, and his speed, size, and aerial abilities are certainly superior to Messi’s, but the fact is that Messi is arguably more valuable as a goal-maker than he is as a goal-scorer.</p><p>This is unprecedented at the highest level of scoring even when one removes penalty goals from the equation. In his five-year peak at Barcelona, Messi averaged 1.03 non-penalty goals per game and 0.46 assists per game for a combined average of 1.5 goals per game.</p><p>Consider that the consummate midfielder, Zinedine Zidane, universally regarded as one of the ten-greatest to ever play the game, averaged 0.26 assists per game across his entire career. In Zidane’s best-ever season, at Juventus, he averaged 0.46 assists per game. Messi did that <em>for five straight years</em>. And he did that in addition to scoring a goal in every game himself.</p><p>His closest rival, Cristiano Ronaldo, scored fewer non-penalty goals and had 25 percent fewer assists during his own five-year peak at Real Madrid. CR7’s combined average of 1.3 goals per game is still historically excellent to the point of being very nearly unprecedented, but across the 170 games played, that 0.2 delta is a difference of 34 goals in five seasons!</p><p>Statistically speaking, at their mutual peaks, Messi was worth one more goal every five games than Cristiano Ronaldo. That’s the statistical equivalent of having one additional mediocre striker or one above-average midfielder on the field every single game. <em>And this peak-to-peak comparison is actually favorable to CR7</em>. The career delta between Messi and Ronaldo is 0.32 despite the latter’s Saudi league-inflated numbers. To put that into perspective, 0.32 happens to be the career average of Andrés Iniesta, an excellent Spanish international who was named to the FIFA Pro World XI no less than nine times.</p><p>So the cold hard tangibles are perfectly clear. What about the intangibles? All you need to do is to forget about the goals and watch one highlight reel of Messi dribbling, followed by another one of him making assists. Only Maradona can compare to his dribbling and I’ve never seen anyone who creates opportunities for others as well as Messi does. Any lingering doubts about his ability to win the biggest competitions were settled once and for all when Argentina beat Brazil in the 2021 Copa America, then followed that up by winning the 2022 World Cup.</p><p>Dennis Bergkamp will always be my favorite player, and I’ll always harbor the utmost respect for Pele, Maradona, and CR7. But the unquestionable fact, <em>the undeniable fact</em>, is that Lionel Messi is the greatest footballer to ever play the game.</p><p>And Americans are very fortunate to be able to watch him doing what he does at Inter Miami. Cristiano Ronaldo and Neymar took the Saudi money, but what Messi is doing with David Beckham in Miami is more important, as they are building stronger foundations for the beautiful game.</p><p><em><a href=\"https://social.infogalactic.com/micropost/0fd17bab-9e5a-449b-91ae-50cad7f5df44\">DISCUSS ON SG</a></em></p></div>",
  "content_text": "After considerable review of statistics and video highlights in the aftermath of Argentina winning the World Cup, I have been forced to conclude that my previous opinion was in error. There simply isn’t any question about it.\nLionel Messi is the greatest soccer player of all time.\nI’ve always considered Pele to be number one, with Maradona a close number two. But the fact is that Messi’s creative abilities, vision, and generosity make him a more complete, more effective player on the field than either Pele or Maradona. As for modern players, Cristiano Ronaldo is an incredible scorer and an inspirational leader for Portugal, and his speed, size, and aerial abilities are certainly superior to Messi’s, but the fact is that Messi is arguably more valuable as a goal-maker than he is as a goal-scorer.\nThis is unprecedented at the highest level of scoring even when one removes penalty goals from the equation. In his five-year peak at Barcelona, Messi averaged 1.03 non-penalty goals per game and 0.46 assists per game for a combined average of 1.5 goals per game.\nConsider that the consummate midfielder, Zinedine Zidane, universally regarded as one of the ten-greatest to ever play the game, averaged 0.26 assists per game across his entire career. In Zidane’s best-ever season, at Juventus, he averaged 0.46 assists per game. Messi did that\nfor five straight years\n. And he did that in addition to scoring a goal in every game himself.\nHis closest rival, Cristiano Ronaldo, scored fewer non-penalty goals and had 25 percent fewer assists during his own five-year peak at Real Madrid. CR7’s combined average of 1.3 goals per game is still historically excellent to the point of being very nearly unprecedented, but across the 170 games played, that 0.2 delta is a difference of 34 goals in five seasons!\nStatistically speaking, at their mutual peaks, Messi was worth one more goal every five games than Cristiano Ronaldo. That’s the statistical equivalent of having one additional mediocre striker or one above-average midfielder on the field every single game.\nAnd this peak-to-peak comparison is actually favorable to CR7\n. The career delta between Messi and Ronaldo is 0.32 despite the latter’s Saudi league-inflated numbers. To put that into perspective, 0.32 happens to be the career average of Andrés Iniesta, an excellent Spanish international who was named to the FIFA Pro World XI no less than nine times.\nSo the cold hard tangibles are perfectly clear. What about the intangibles? All you need to do is to forget about the goals and watch one highlight reel of Messi dribbling, followed by another one of him making assists. Only Maradona can compare to his dribbling and I’ve never seen anyone who creates opportunities for others as well as Messi does. Any lingering doubts about his ability to win the biggest competitions were settled once and for all when Argentina beat Brazil in the 2021 Copa America, then followed that up by winning the 2022 World Cup.\nDennis Bergkamp will always be my favorite player, and I’ll always harbor the utmost respect for Pele, Maradona, and CR7. But the unquestionable fact,\nthe undeniable fact\n, is that Lionel Messi is the greatest footballer to ever play the game.\nAnd Americans are very fortunate to be able to watch him doing what he does at Inter Miami. Cristiano Ronaldo and Neymar took the Saudi money, but what Messi is doing with David Beckham in Miami is more important, as they are building stronger foundations for the beautiful game.\nDISCUSS ON SG",
  "tags": [
    "sports"
  ],
  "categories": [],
  "sitemap_lastmod": "2023-09-04T15:03:21+00:00"
}