{
  "url": "https://voxday.net/2023/09/29/that-escalated-quickly/",
  "scraped_at": "2026-01-08T14:10:25.696757",
  "title": "That Escalated Quickly",
  "date_display": "September 29, 2023",
  "date_iso": "2023-09-29T10:40:41+00:00",
  "date_from_url": "2023-09-29",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>There will be no Armenian Front. Despite the best efforts of NATO to stir up trouble on Russia’s southern border, the Azeri’s quickly ended any possibility of war with Armenia by conclusively putting to <a href=\"https://www.rt.com/russia/583685-nagorno-karabakh-republic-no-longer-exist/\">an end the ethnic Armenian republic of Nagorno-Karabakh</a>, which broke away from Azerbaijan in 1989, with the assistance of the Russians.</p><blockquote class=\"wp-block-quote is-layout-flow wp-block-quote-is-layout-flow\"><p>The authorities of Azerbaijan’s breakaway region of Nagorno-Karabakh have announced the dissolution of the self-proclaimed republic after a Russian-mediated truce ended a flare-up of hostilities between Stepanakert and Baku.</p><p>Samvel Shahramanyan, the president of the unrecognized republic, issued a decree on Thursday ordering the “dissolution of all state institutions and their branches by January 1, 2024.”</p><p>“The Republic of Nagorno-Karabakh (Artsakh) ceases to exist,” the announcement declared, as quoted by the NKR InfoCenter.</p><p>The document also says that the region’s inhabitants, including those who have fled, should “familiarize themselves with the conditions of reintegration offered by the Republic of Azerbaijan,” and make an independent decision about whether to return to Nagorno-Karabakh.</p><p>The landmark presidential decree puts an end to the history of the unrecognized republic, which seceded from Azerbaijan in the waning days of the Soviet Union.</p></blockquote><p>It is explained that “the announcement came after Azerbaijan completed a military operation in the breakaway region”. The subsequent reaction by the former republican government, and the speed with which the region is being homogenized indicates how rapid demographic changes are likely to take place in the USA and Europe if things are relatively peaceful; the region is being ethnically cleansed with a minimum of fuss and violence because the alternative is too terrible to contemplate.</p><p>It’s reported that more than 70 percent of the 120,000 Armenians resident in Nagorno-Karabakh had already completed <a href=\"https://keyt.com/news/2023/09/29/more-than-70-of-nagorno-karabakhs-population-flees-as-separatist-government-says-it-will-dissolve/\">their return to Armenia</a> as of last week.</p><p><em>By Friday morning 84,770 people had left Nagorno-Karabakh, according to Armenian officials, continuing a mass exodus from the region of ethnic Armenians that began Sunday. The region’s population was around 120,000 before the exodus began.</em></p><p>However, it should be kept in mind that these recently-departed Armenians have the advantage of knowing full well how things would likely have gone for them if they insisted on relying upon violence since they have already fought, and lost, <a href=\"https://infogalactic.com/info/2020_Nagorno-Karabakh_war\">two wars with the Azeris</a> over the disputed territory. Which, no doubt, accounts for their sensible collective decision to abandon the secessionist project and return to Armenia.</p><p>As is customary, <a href=\"https://www.npr.org/2023/09/29/1202576206/the-fall-of-an-enclave-in-azerbaijan-stuns-the-armenian-diaspora-shattering-a-dr\">the Armenian diaspora is more militant</a> on the subject, because they have no skin in the game.</p><p><em>The swift fall of the Armenian-majority enclave of Nagorno-Karabakh to Azerbaijani troops and exodus of much of its population has stunned the large Armenian diaspora around the world. Traumatized by genocide a century ago, they now fear the erasure of what they consider a central and beloved part of their historic homeland. Many in the diaspora had pinned dreams on it gaining independence or being joined to Armenia.</em></p><p>If it was so central and beloved to them, perhaps they shouldn’t have moved to Lebanon and Los Angeles. There are as many Armenians living in Lebanon as there were in Nagorno-Karabakh at the beginning of this year.</p><p><em><a href=\"https://social.infogalactic.com/micropost/f09596dc-a24a-4362-8240-4c6b6e6591bf\">DISCUSS ON SG</a></em></p></div>",
  "content_text": "There will be no Armenian Front. Despite the best efforts of NATO to stir up trouble on Russia’s southern border, the Azeri’s quickly ended any possibility of war with Armenia by conclusively putting to\nan end the ethnic Armenian republic of Nagorno-Karabakh\n, which broke away from Azerbaijan in 1989, with the assistance of the Russians.\nThe authorities of Azerbaijan’s breakaway region of Nagorno-Karabakh have announced the dissolution of the self-proclaimed republic after a Russian-mediated truce ended a flare-up of hostilities between Stepanakert and Baku.\nSamvel Shahramanyan, the president of the unrecognized republic, issued a decree on Thursday ordering the “dissolution of all state institutions and their branches by January 1, 2024.”\n“The Republic of Nagorno-Karabakh (Artsakh) ceases to exist,” the announcement declared, as quoted by the NKR InfoCenter.\nThe document also says that the region’s inhabitants, including those who have fled, should “familiarize themselves with the conditions of reintegration offered by the Republic of Azerbaijan,” and make an independent decision about whether to return to Nagorno-Karabakh.\nThe landmark presidential decree puts an end to the history of the unrecognized republic, which seceded from Azerbaijan in the waning days of the Soviet Union.\nIt is explained that “the announcement came after Azerbaijan completed a military operation in the breakaway region”. The subsequent reaction by the former republican government, and the speed with which the region is being homogenized indicates how rapid demographic changes are likely to take place in the USA and Europe if things are relatively peaceful; the region is being ethnically cleansed with a minimum of fuss and violence because the alternative is too terrible to contemplate.\nIt’s reported that more than 70 percent of the 120,000 Armenians resident in Nagorno-Karabakh had already completed\ntheir return to Armenia\nas of last week.\nBy Friday morning 84,770 people had left Nagorno-Karabakh, according to Armenian officials, continuing a mass exodus from the region of ethnic Armenians that began Sunday. The region’s population was around 120,000 before the exodus began.\nHowever, it should be kept in mind that these recently-departed Armenians have the advantage of knowing full well how things would likely have gone for them if they insisted on relying upon violence since they have already fought, and lost,\ntwo wars with the Azeris\nover the disputed territory. Which, no doubt, accounts for their sensible collective decision to abandon the secessionist project and return to Armenia.\nAs is customary,\nthe Armenian diaspora is more militant\non the subject, because they have no skin in the game.\nThe swift fall of the Armenian-majority enclave of Nagorno-Karabakh to Azerbaijani troops and exodus of much of its population has stunned the large Armenian diaspora around the world. Traumatized by genocide a century ago, they now fear the erasure of what they consider a central and beloved part of their historic homeland. Many in the diaspora had pinned dreams on it gaining independence or being joined to Armenia.\nIf it was so central and beloved to them, perhaps they shouldn’t have moved to Lebanon and Los Angeles. There are as many Armenians living in Lebanon as there were in Nagorno-Karabakh at the beginning of this year.\nDISCUSS ON SG",
  "tags": [
    "immigration",
    "war"
  ],
  "categories": [],
  "sitemap_lastmod": "2023-09-29T11:04:12+00:00"
}