{
  "url": "https://voxday.net/2023/09/17/the-cancellation-of-russell-brand/",
  "scraped_at": "2026-01-08T14:09:21.199065",
  "title": "The Cancellation of Russell Brand",
  "date_display": "September 17, 2023",
  "date_iso": "2023-09-17T13:35:00+00:00",
  "date_from_url": "2023-09-17",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>The Clown signal has gone out and <a href=\"https://www.dailymail.co.uk/news/article-12527955/Russell-Brands-sinister-behaviour-open-secret-senior-TV-radio-executives-BBC-Channel-4-bombshell-investigation-claims-chiefs-face-grilling-star-treated-female-staff.html\">Russell Brand is being mass-swarmed</a> in the media by women accusing him of rape, sexual assault, emotional abuse, and sinister behavior toward women:</p><blockquote class=\"wp-block-quote is-layout-flow wp-block-quote-is-layout-flow\"><p>TV bosses have been accused of offering to take female staff members off shows fronted by Russell Brand after concerns about his alleged behaviour were raised.</p><p>It comes amid reports that accusations about his ‘sinister’ behaviour towards women were an ‘open secret’ among TV and radio executives.</p><p>Some former staff members who worked with him during his time on Big Brother’s EFourum claimed they were ‘acting like pimps to Russell Brand’s needs’ as he demanded they get the numbers of girls from the audience for him.</p><p>Bosses at the BBC and Channel 4 are accused of turning a blind eye towards the entertainer’s behaviour while he worked for them as a presenter between 2006 and 2013.</p><p>The broadcasters have insisted they took all necessary steps deal with him, but executives could still be called before a Government select committee where MPs will grill them over what they knew.</p><p>The 48-year-old’s behaviour is alleged to have been common knowledge among female performers on the comedy circuit, who are said to have warned each other about him.</p><p>Brand has been accused of rape, sexual assault and emotional abuse by multiple women, including one who says she was 16 at the time.</p></blockquote><p>I’m not defending Russell Brand. He’s an awful guy, a drug addict who was embraced by the Hellmouth and married to an Illuminati princess. He has eminently earned his cancellation, and the public discourse will not be harmed one iota by his public and permanent erasure from it. He does not have, and has never had, anything of substance to offer the stream of public consciousness.</p><p>That being said, it is interesting to ask why he is being cancelled at this late date and at this juncture. Is it because he is genuinely reformed and repentant, and therefore must be destroyed like any other ticket-taker who reneges on his contract <em>pour encourager les autres</em>? Is it part of a masquerade to set him up as a new gatekeeper in the mode of other fake-cancellations like Jordan Peterson and Andrew Tate? Did he simply cross the wrong dark master at the wrong time? Or does he know something that Clown World is desperate to prevent him revealing to the rest of the planet?</p><p>Regardless of what the real reason is, never forget that neither cancellation nor opprobrium from Clown World makes an individual a hero, a good guy, a leader, or someone worthy of taking seriously.</p><p><strong>UPDATE:</strong> It’s fascinating to see how celebrities are protected from every form of criticism and investigation, <a href=\"https://www.dailymail.co.uk/news/article-12528407/TV-production-company-Big-Brother-launches-probe-Russell-Brand.html\">until they’re not</a>.</p><p><em>Channel 4, BBC and the police have all launched probes into Russell Brand’s behaviour in light of rape and sexual assault allegations</em></p><p><em><a href=\"https://social.infogalactic.com/micropost/bfa3a7fc-769b-4dfa-9d0d-d059b2defc65\">DISCUSS ON SG</a></em></p></div>",
  "content_text": "The Clown signal has gone out and\nRussell Brand is being mass-swarmed\nin the media by women accusing him of rape, sexual assault, emotional abuse, and sinister behavior toward women:\nTV bosses have been accused of offering to take female staff members off shows fronted by Russell Brand after concerns about his alleged behaviour were raised.\nIt comes amid reports that accusations about his ‘sinister’ behaviour towards women were an ‘open secret’ among TV and radio executives.\nSome former staff members who worked with him during his time on Big Brother’s EFourum claimed they were ‘acting like pimps to Russell Brand’s needs’ as he demanded they get the numbers of girls from the audience for him.\nBosses at the BBC and Channel 4 are accused of turning a blind eye towards the entertainer’s behaviour while he worked for them as a presenter between 2006 and 2013.\nThe broadcasters have insisted they took all necessary steps deal with him, but executives could still be called before a Government select committee where MPs will grill them over what they knew.\nThe 48-year-old’s behaviour is alleged to have been common knowledge among female performers on the comedy circuit, who are said to have warned each other about him.\nBrand has been accused of rape, sexual assault and emotional abuse by multiple women, including one who says she was 16 at the time.\nI’m not defending Russell Brand. He’s an awful guy, a drug addict who was embraced by the Hellmouth and married to an Illuminati princess. He has eminently earned his cancellation, and the public discourse will not be harmed one iota by his public and permanent erasure from it. He does not have, and has never had, anything of substance to offer the stream of public consciousness.\nThat being said, it is interesting to ask why he is being cancelled at this late date and at this juncture. Is it because he is genuinely reformed and repentant, and therefore must be destroyed like any other ticket-taker who reneges on his contract\npour encourager les autres\n? Is it part of a masquerade to set him up as a new gatekeeper in the mode of other fake-cancellations like Jordan Peterson and Andrew Tate? Did he simply cross the wrong dark master at the wrong time? Or does he know something that Clown World is desperate to prevent him revealing to the rest of the planet?\nRegardless of what the real reason is, never forget that neither cancellation nor opprobrium from Clown World makes an individual a hero, a good guy, a leader, or someone worthy of taking seriously.\nUPDATE:\nIt’s fascinating to see how celebrities are protected from every form of criticism and investigation,\nuntil they’re not\n.\nChannel 4, BBC and the police have all launched probes into Russell Brand’s behaviour in light of rape and sexual assault allegations\nDISCUSS ON SG",
  "tags": [
    "Clown World",
    "Hellmouth",
    "media"
  ],
  "categories": [],
  "sitemap_lastmod": "2023-09-17T20:53:03+00:00"
}