{
  "url": "https://voxday.net/2023/09/04/the-satanic-essence-of-globalism/",
  "scraped_at": "2026-01-08T14:08:11.051939",
  "title": "The Satanic Essence of Globalism",
  "date_display": "September 4, 2023",
  "date_iso": "2023-09-04T09:14:54+00:00",
  "date_from_url": "2023-09-04",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>The Archbishop explains <a href=\"https://remnantnewspaper.com/web/index.php/fetzen-fliegen/item/6775-vigano-responds-to-mediapressinfo-on-the-request-for-dissolution-of-civitas\">the nature of modern Babelism</a> and why it seeks to erase every aspect of Christianity from society:</p><blockquote class=\"wp-block-quote is-layout-flow wp-block-quote-is-layout-flow\"><p>The essence of globalism is satanic, and the essence of Satanism is globalist. Because Satan’s plan is to establish the reign of the Antichrist, allowing him to parody Christ’s earthly life, to imitate His miracles with grotesque wonders, to lead crowds not with the simplicity of Truth but with deception and lies. Globalism is, so to speak, the staging, the script and the scenario that must prepare humanity for the political ascent of the Antichrist, to whom the leaders of the world – his servants – will cede national sovereignty so that he becomes a kind of global tyrant.</p><p>But the kingdom of the Antichrist is not created out of nothing: it is first necessary to erase what remains of the kingdom of Christ in the institutions, in the culture and in the daily life of the citizens. Moral dissolution is one of the simplest means of subjugating the masses, encouraging them to vice, ridiculing virtue; and, of course, by destroying the natural family, the fundamental cell of society. Once the family is demolished, the children become commodities, products that those with money can order over the Internet, fuelling the vast and growing criminal network, not to mention the surrogacy industry. Divorce, abortion, euthanasia, homosexuality and pan- sexualism, mutilation for gender transition have proven to be effective tools for eliminating not only the revealed Faith, but also the most sacred principles of Natural Law.</p><p>And it is indeed a religion, the one that is being established with the Woke ideology; a religion which, like the true Religion but with diametrically opposed goals, intends to impose itself in society, to imbue its dogmas into the institutions, the laws, the education, the culture, the arts and human activities. The globalists apply the Catholic principles of “social kingship,” but proclaim Satan king of society: <em>Te nationum præsides honore tollant publico: colant magistri, judices; leges et artes exprimant. </em>May the rulers of the world publicly honour and extol Thee; May teachers and judges reverence Thee; May the laws and the arts bear Thy mark. These are the words of the hymn of Christ the King, but we see them applied blasphemously by the priests of the New World Order to their king, the prince of this world, and to the Antichrist in his time.</p><p>Beware though: globalism, as an emanation of Masonic and revolutionary thought, apparently proclaims democracy and condemns absolute regimes; but in fact, it knows very well that the Monarchy of Divine Right is the best possible form of government, because it subjugates everyone – including the king himself, who is the Vicar of Christ in temporal things – to a transcendent law to which everyone owes obedience.</p></blockquote><p>It’s a hard thing for many Americans to accept that the revolutionary concepts of freedom and liberty and equality around which the original Republic was founded were evil philosophical seeds planted during the Enlightenment. But the wicked nature of their fruits, and the bitter harvest they have entailed, can hardly be denied.</p><p><em><a href=\"https://social.infogalactic.com/micropost/49285381-2c02-4ccc-80e4-1255f57fe3f2\">DISCUSS ON SG</a></em></p></div>",
  "content_text": "The Archbishop explains\nthe nature of modern Babelism\nand why it seeks to erase every aspect of Christianity from society:\nThe essence of globalism is satanic, and the essence of Satanism is globalist. Because Satan’s plan is to establish the reign of the Antichrist, allowing him to parody Christ’s earthly life, to imitate His miracles with grotesque wonders, to lead crowds not with the simplicity of Truth but with deception and lies. Globalism is, so to speak, the staging, the script and the scenario that must prepare humanity for the political ascent of the Antichrist, to whom the leaders of the world – his servants – will cede national sovereignty so that he becomes a kind of global tyrant.\nBut the kingdom of the Antichrist is not created out of nothing: it is first necessary to erase what remains of the kingdom of Christ in the institutions, in the culture and in the daily life of the citizens. Moral dissolution is one of the simplest means of subjugating the masses, encouraging them to vice, ridiculing virtue; and, of course, by destroying the natural family, the fundamental cell of society. Once the family is demolished, the children become commodities, products that those with money can order over the Internet, fuelling the vast and growing criminal network, not to mention the surrogacy industry. Divorce, abortion, euthanasia, homosexuality and pan- sexualism, mutilation for gender transition have proven to be effective tools for eliminating not only the revealed Faith, but also the most sacred principles of Natural Law.\nAnd it is indeed a religion, the one that is being established with the Woke ideology; a religion which, like the true Religion but with diametrically opposed goals, intends to impose itself in society, to imbue its dogmas into the institutions, the laws, the education, the culture, the arts and human activities. The globalists apply the Catholic principles of “social kingship,” but proclaim Satan king of society:\nTe nationum præsides honore tollant publico: colant magistri, judices; leges et artes exprimant.\nMay the rulers of the world publicly honour and extol Thee; May teachers and judges reverence Thee; May the laws and the arts bear Thy mark. These are the words of the hymn of Christ the King, but we see them applied blasphemously by the priests of the New World Order to their king, the prince of this world, and to the Antichrist in his time.\nBeware though: globalism, as an emanation of Masonic and revolutionary thought, apparently proclaims democracy and condemns absolute regimes; but in fact, it knows very well that the Monarchy of Divine Right is the best possible form of government, because it subjugates everyone – including the king himself, who is the Vicar of Christ in temporal things – to a transcendent law to which everyone owes obedience.\nIt’s a hard thing for many Americans to accept that the revolutionary concepts of freedom and liberty and equality around which the original Republic was founded were evil philosophical seeds planted during the Enlightenment. But the wicked nature of their fruits, and the bitter harvest they have entailed, can hardly be denied.\nDISCUSS ON SG",
  "tags": [
    "Christianity",
    "globalism"
  ],
  "categories": [],
  "sitemap_lastmod": "2023-09-04T09:14:56+00:00"
}