{
  "url": "https://voxday.net/2023/09/18/the-us-will-lose-the-next-war/",
  "scraped_at": "2026-01-08T14:09:24.514191",
  "title": "The US Will Lose the Next War",
  "date_display": "September 18, 2023",
  "date_iso": "2023-09-18T13:05:00+00:00",
  "date_from_url": "2023-09-18",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>The US military of 2023 <a href=\"https://www.theatlantic.com/international/archive/2023/09/russia-ukraine-war-us-aid-weapons-spending/675343/\">is not the US military of 1943</a>. More to the point, the US military production infrastructure of 2023 is not the US military production infrastructure of 1939. The media is finally beginning to figure this out in the aftermath of Russia’s comprehensive defeat of NATO’s proxy army in Ukraine.</p><blockquote class=\"wp-block-quote is-layout-flow wp-block-quote-is-layout-flow\"><p>Our country could very well lose a large-scale war for lack of weapons and ammunition—but not because of aid to Ukraine. In a major conflict, the U.S. would run out of munitions in a few weeks, and in less than a week for some crucial categories. The quantity of weapons we are providing Ukraine is marginal compared with necessary weapons that we have not stocked… Nor can we rely on our allies to supply themselves or engineer a lend-lease program to send us weapons if we should be fighting but they are not. For instance, even before it began sending weapons to Ukraine, the British military was so poorly stocked that in a major war, it would have run out of ammunition in a week.</p><p>In 1942, Admiral Chester Nimitz fought on the Midway Islands with only three aircraft carriers at his disposal. Less than three years later, he commenced operations against the Marianas with 15 new, larger, and faster carriers to feed into the fight. China has built a defense industry capable of such rapid production—but today, the United States couldn’t pull it off.</p></blockquote><p>No, the US Navy will lose an attrition war with China, even if it wins an initial battle or two. The situation is actually worse than the situation that Japan faced in 1941. The neoclowns thought there would be no need for peer-level warfare because history had ended in favor of liberal democracy, and everyone knows that nation-states that harbor McDonalds never go to war with each other. Hence their obsession with turning every Main Street from Albania to Vietnam into a clone of a mall circa 1989.</p><p>But both the Chinese and the Russians have been gearing up for full-scale conflict with the US military for more than 20 years. And they’re just about ready, if the recent decision to sanction two of the five US corporations still producing military vehicles is any guide.</p><blockquote class=\"wp-block-quote is-layout-flow wp-block-quote-is-layout-flow\"><p><strong>China Daily: </strong><em>Lately the US has provided advanced weaponry to China’s Taiwan region through arms sales, military assistance and loans. China’s foreign ministry spokesperson said earlier that China would take strong measures to defend its sovereignty and territorial integrity. I wonder if you have anything new on that?</em></p><p><strong>Mao Ning: </strong>In disregard of China’s firm opposition, the US government deliberately supplies weapons to China’s Taiwan region. This seriously violates the one-China principle and the stipulations of the three China-US joint communiqués, contravenes international law and basic norms governing international relations, and undermines China’s sovereignty and security interests. The US is going further down the wrong and dangerous path of arming Taiwan.</p><p>Lockheed Martin Corporation, St. Louis, MO directly participated in the US arms sale to Taiwan announced on August 24 as the principal contractor. Northrop Grumman participated in several US arms sales to Taiwan. In accordance with the Anti-Foreign Sanctions Law of the People’s Republic of China, China decides to impose sanctions on these two above-mentioned US defense corporations.</p><p>Let me stress, the Chinese government never wavers in its resolve of safeguarding national sovereignty and territorial integrity. We call on the US to earnestly abide by the one-China principle and the stipulations of the three China-US joint communiqués, stop arms sales to Taiwan, stop military collusion with Taiwan, and stop arming Taiwan, otherwise it will be met with China’s resolute response.</p></blockquote><p>Even though it should, the US will not preemptively surrender on the issue of Taiwan. This means that war is coming to the West, probably sooner than most people expect. And it isn’t going to end well, because the rulers of the West are not Western in any way, nor do they care in the least for the people of the West over whom they presently rule.</p><p><em><a href=\"https://social.infogalactic.com/micropost/6954594e-42c2-43e5-b6ff-87e275ef5bef\">DISCUSS ON SG</a></em></p></div>",
  "content_text": "The US military of 2023\nis not the US military of 1943\n. More to the point, the US military production infrastructure of 2023 is not the US military production infrastructure of 1939. The media is finally beginning to figure this out in the aftermath of Russia’s comprehensive defeat of NATO’s proxy army in Ukraine.\nOur country could very well lose a large-scale war for lack of weapons and ammunition—but not because of aid to Ukraine. In a major conflict, the U.S. would run out of munitions in a few weeks, and in less than a week for some crucial categories. The quantity of weapons we are providing Ukraine is marginal compared with necessary weapons that we have not stocked… Nor can we rely on our allies to supply themselves or engineer a lend-lease program to send us weapons if we should be fighting but they are not. For instance, even before it began sending weapons to Ukraine, the British military was so poorly stocked that in a major war, it would have run out of ammunition in a week.\nIn 1942, Admiral Chester Nimitz fought on the Midway Islands with only three aircraft carriers at his disposal. Less than three years later, he commenced operations against the Marianas with 15 new, larger, and faster carriers to feed into the fight. China has built a defense industry capable of such rapid production—but today, the United States couldn’t pull it off.\nNo, the US Navy will lose an attrition war with China, even if it wins an initial battle or two. The situation is actually worse than the situation that Japan faced in 1941. The neoclowns thought there would be no need for peer-level warfare because history had ended in favor of liberal democracy, and everyone knows that nation-states that harbor McDonalds never go to war with each other. Hence their obsession with turning every Main Street from Albania to Vietnam into a clone of a mall circa 1989.\nBut both the Chinese and the Russians have been gearing up for full-scale conflict with the US military for more than 20 years. And they’re just about ready, if the recent decision to sanction two of the five US corporations still producing military vehicles is any guide.\nChina Daily:\nLately the US has provided advanced weaponry to China’s Taiwan region through arms sales, military assistance and loans. China’s foreign ministry spokesperson said earlier that China would take strong measures to defend its sovereignty and territorial integrity. I wonder if you have anything new on that?\nMao Ning:\nIn disregard of China’s firm opposition, the US government deliberately supplies weapons to China’s Taiwan region. This seriously violates the one-China principle and the stipulations of the three China-US joint communiqués, contravenes international law and basic norms governing international relations, and undermines China’s sovereignty and security interests. The US is going further down the wrong and dangerous path of arming Taiwan.\nLockheed Martin Corporation, St. Louis, MO directly participated in the US arms sale to Taiwan announced on August 24 as the principal contractor. Northrop Grumman participated in several US arms sales to Taiwan. In accordance with the Anti-Foreign Sanctions Law of the People’s Republic of China, China decides to impose sanctions on these two above-mentioned US defense corporations.\nLet me stress, the Chinese government never wavers in its resolve of safeguarding national sovereignty and territorial integrity. We call on the US to earnestly abide by the one-China principle and the stipulations of the three China-US joint communiqués, stop arms sales to Taiwan, stop military collusion with Taiwan, and stop arming Taiwan, otherwise it will be met with China’s resolute response.\nEven though it should, the US will not preemptively surrender on the issue of Taiwan. This means that war is coming to the West, probably sooner than most people expect. And it isn’t going to end well, because the rulers of the West are not Western in any way, nor do they care in the least for the people of the West over whom they presently rule.\nDISCUSS ON SG",
  "tags": [
    "China",
    "neoclowns",
    "war"
  ],
  "categories": [],
  "sitemap_lastmod": "2023-09-18T13:05:00+00:00"
}