{
  "url": "https://voxday.net/2023/09/21/the-artillery-dilemma/",
  "scraped_at": "2026-01-08T14:09:38.632672",
  "title": "The Artillery Dilemma",
  "date_display": "September 21, 2023",
  "date_iso": "2023-09-21T12:46:00+00:00",
  "date_from_url": "2023-09-21",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>It’s obvious to any rational observer that NATO is losing the war in Ukraine, and is losing it badly. And by badly, I mean in terms that exceed Arabs vs IDF and are beginning to approach British regulars vs Zulus. But it was always perfectly clear to everyone who understood the nature of modern land war that the US military <span style=\"text-decoration: underline;\">never</span> had <span style=\"text-decoration: underline;\">any chance whatsoever</span> of winning either a direct or a proxy war against the Russians in Ukraine.</p><p>Just as the coming naval war with China will depend almost entirely upon shipbuilding capacity to replace the ships on both sides that are inevitably sunk, the war in Ukraine depends upon the production of artillery shells. Consider the following four points.</p><ol class=\"wp-block-list\"><li>Artillery is the king of the battlefield again, accounting for 85 percent of the casualties in Ukraine.</li><li>One 155mm round made in the USA by USA contractors costs 5,500 dollars, while a 152mm round made in Russia costs 600 dollars.</li><li>One 152mm made in North Korea probably costs less than 60 dollars. The Russians just bought 10 million of them, and due to their oil production, can afford to buy as many shells as the North Koreans can make.</li><li>Outsourcing ammunition production to China is not exactly an option these days.</li></ol><p><em>Quod erat demonstrandum</em>. Apparently this new shell-supply arrangement is very upsetting to the South Koreans. Or rather, <a href=\"https://smoothiex12.blogspot.com/2023/09/practical-geopolitics.html\">to their puppet masters in the US</a> who are speaking through them. Only the USA is permitted to have allies, right?</p><p><em>SEOUL, Sept 19 (Reuters) – South Korea summoned Russia’s ambassador to warn Moscow against any military cooperation with North Korea on Tuesday after last week’s summit between North Korean leader Kim Jong Un and President Vladimir Putin raised concerns about a possible arms deal. First Vice Foreign Minister Chang Ho-jin summoned Russia’s ambassador in Seoul to urge “Russia to immediately halt any moves to expand military cooperation with North Korea and to abide by (UN) Security Council Resolutions,” South Korea’s foreign ministry said in a statement.</em></p><p>No doubt the Russians will be duly chastened and refrain from further military cooperation with the North Koreans. In the meantime, and in not-unrelated news, <a href=\"https://www.zerohedge.com/geopolitical/nato-fractures-u-turn-poland-announces-will-no-longer-arm-ukraine\">Poland is out</a> of the Ukrainian arms business.</p><p><em>“Poland will no longer arm Ukraine to focus on its own defense,” Polish prime minister Mateusz Morawiecki announced just hours after Warsaw summoned Ukraine’s ambassador related to a fresh war of words and spat over blocked grain, according to the AFP. Warsaw has throughout more than a year-and-a-half of the Ukraine-Russia war been Kiev’s staunchest and most outspoken supporter.</em></p><p><em><a href=\"https://social.infogalactic.com/micropost/bd9fe9d6-ee6c-41af-b31a-2bd3587df89c\">DISCUSS ON SG</a></em></p></div>",
  "content_text": "It’s obvious to any rational observer that NATO is losing the war in Ukraine, and is losing it badly. And by badly, I mean in terms that exceed Arabs vs IDF and are beginning to approach British regulars vs Zulus. But it was always perfectly clear to everyone who understood the nature of modern land war that the US military\nnever\nhad\nany chance whatsoever\nof winning either a direct or a proxy war against the Russians in Ukraine.\nJust as the coming naval war with China will depend almost entirely upon shipbuilding capacity to replace the ships on both sides that are inevitably sunk, the war in Ukraine depends upon the production of artillery shells. Consider the following four points.\nArtillery is the king of the battlefield again, accounting for 85 percent of the casualties in Ukraine.\nOne 155mm round made in the USA by USA contractors costs 5,500 dollars, while a 152mm round made in Russia costs 600 dollars.\nOne 152mm made in North Korea probably costs less than 60 dollars. The Russians just bought 10 million of them, and due to their oil production, can afford to buy as many shells as the North Koreans can make.\nOutsourcing ammunition production to China is not exactly an option these days.\nQuod erat demonstrandum\n. Apparently this new shell-supply arrangement is very upsetting to the South Koreans. Or rather,\nto their puppet masters in the US\nwho are speaking through them. Only the USA is permitted to have allies, right?\nSEOUL, Sept 19 (Reuters) – South Korea summoned Russia’s ambassador to warn Moscow against any military cooperation with North Korea on Tuesday after last week’s summit between North Korean leader Kim Jong Un and President Vladimir Putin raised concerns about a possible arms deal. First Vice Foreign Minister Chang Ho-jin summoned Russia’s ambassador in Seoul to urge “Russia to immediately halt any moves to expand military cooperation with North Korea and to abide by (UN) Security Council Resolutions,” South Korea’s foreign ministry said in a statement.\nNo doubt the Russians will be duly chastened and refrain from further military cooperation with the North Koreans. In the meantime, and in not-unrelated news,\nPoland is out\nof the Ukrainian arms business.\n“Poland will no longer arm Ukraine to focus on its own defense,” Polish prime minister Mateusz Morawiecki announced just hours after Warsaw summoned Ukraine’s ambassador related to a fresh war of words and spat over blocked grain, according to the AFP. Warsaw has throughout more than a year-and-a-half of the Ukraine-Russia war been Kiev’s staunchest and most outspoken supporter.\nDISCUSS ON SG",
  "tags": [
    "economics",
    "Russia",
    "war"
  ],
  "categories": [],
  "sitemap_lastmod": "2023-09-21T15:16:50+00:00"
}