{
  "url": "https://voxday.net/2012/07/26/africans-kill-each-other-whites-to-blame/",
  "scraped_at": "2025-12-14T04:59:53.542706",
  "title": "Africans kill each other, white disarmament the answer",
  "date_display": "July 26, 2012",
  "date_iso": "2012-07-26T16:09:00+00:00",
  "date_from_url": "2012-07-26",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>Obama comes out of the closet <a href=\"http://www.washingtontimes.com/news/2012/jul/25/obama-calls-measures-against-gun-violence/\">on gun control</a>:</p><blockquote><p>Faced with a clamor in his party for stricter gun control in the wake of the Colorado movie-theater massacre, President Obama said Wednesday night he would “leave no stone unturned” in seeking new measures to reduce violence nationwide, including more restrictive background checks on gun purchases.</p><p>“A lot of gun owners would agree that AK-47s belong in the hands of soldiers, not in the hands of criminals,” Mr. Obama said at the annual National Urban League convention in New Orleans. “They belong on the battlefield of war, not on the streets of our cities.”</p><p>The president blamed “politics and lobbying” for defeating gun-control measures when outcries arise after mass shootings in the U.S. And he said the nation’s attention should not just be focused on mass shootings, such as the one on Friday in Aurora, Colo., but on the daily shooting deaths of youths from gun violence in major cities.</p><p>“Every day, the number of young people we lose to violence is about the same as the number of people we lost in that movie theater,” Mr. Obama said. “For every Columbine or Virginia Tech, there are dozens gunned down on the streets of Chicago or Atlanta, here in New Orleans.</p></blockquote><p>Let me see here.  If young Africans are regularly gunning down other young Africans in large cities where there are already stringent gun control laws, how is <s>disarming</s>attempting to disarm white suburbanites and exurbanites going to reduce the level of violence in any way?</p><p>It seems to me that disarming suburban white America is much more likely to lead to <a href=\"http://www.dailymail.co.uk/news/article-2179171/Walkerville-family-murders-Horrific-death-boy-12-drowned-boiling-water-robbers-raped-mother.html\">this sort of thing</a>.  One of the reason the urban Africans tend to restrict their violence to their own turf is because they know they’re both outnumbered and outgunned outside it.</p><p>And as far as I’m concerned, every adult male citizen should be required by law to own an AK-47, a handgun, a shotgun, and a rifle with a scope.  If the Republicans had any real balls, they would pass such a law and dare the Democrats to oppose it.</p></div>",
  "content_text": "Obama comes out of the closet\non gun control\n:\nFaced with a clamor in his party for stricter gun control in the wake of the Colorado movie-theater massacre, President Obama said Wednesday night he would “leave no stone unturned” in seeking new measures to reduce violence nationwide, including more restrictive background checks on gun purchases.\n“A lot of gun owners would agree that AK-47s belong in the hands of soldiers, not in the hands of criminals,” Mr. Obama said at the annual National Urban League convention in New Orleans. “They belong on the battlefield of war, not on the streets of our cities.”\nThe president blamed “politics and lobbying” for defeating gun-control measures when outcries arise after mass shootings in the U.S. And he said the nation’s attention should not just be focused on mass shootings, such as the one on Friday in Aurora, Colo., but on the daily shooting deaths of youths from gun violence in major cities.\n“Every day, the number of young people we lose to violence is about the same as the number of people we lost in that movie theater,” Mr. Obama said. “For every Columbine or Virginia Tech, there are dozens gunned down on the streets of Chicago or Atlanta, here in New Orleans.\nLet me see here.  If young Africans are regularly gunning down other young Africans in large cities where there are already stringent gun control laws, how is\ndisarming\nattempting to disarm white suburbanites and exurbanites going to reduce the level of violence in any way?\nIt seems to me that disarming suburban white America is much more likely to lead to\nthis sort of thing\n.  One of the reason the urban Africans tend to restrict their violence to their own turf is because they know they’re both outnumbered and outgunned outside it.\nAnd as far as I’m concerned, every adult male citizen should be required by law to own an AK-47, a handgun, a shotgun, and a rifle with a scope.  If the Republicans had any real balls, they would pass such a law and dare the Democrats to oppose it.",
  "tags": [
    "Vibrancy is our strength"
  ],
  "categories": [],
  "sitemap_lastmod": "2012-07-26T15:09:00+00:00"
}