{
  "url": "https://voxday.net/2012/07/16/book-review-debunking-economics/",
  "scraped_at": "2025-12-14T04:59:08.434029",
  "title": "Book Review:Debunking Economics",
  "date_display": "July 16, 2012",
  "date_iso": "2012-07-16T07:45:00+00:00",
  "date_from_url": "2012-07-16",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p><b><a href=\"http://www.wnd.com/2012/07/staking-the-undead-economist/\">Staking the Undead Economist</a></b></p><p>After nearly three decades of reading across a broad spectrum of economic thought, the two books on the subject I would most recommend are Joseph Schumpeter’s <i>History of Economic Analysis</i> and Murray Rothbard’s <i>An Austrian Perspective on the History of Economic Thought</i>. But now there is a third. After finishing <i>Debunking Economics: The Naked Emperor Dethroned?</i> I have to assert that Keen’s book is not only an absolute masterpiece, but may, in fact, represent the most important intellectual development in economics since <i>The General Theory of Employment, Interest and Money</i> was published in 1936. And if some of Keen’s more controversial assertions hold up over time, it will be the most important contribution to the literature since <i>The Wealth of Nations</i>.</p></div>",
  "content_text": "Staking the Undead Economist\nAfter nearly three decades of reading across a broad spectrum of economic thought, the two books on the subject I would most recommend are Joseph Schumpeter’s\nHistory of Economic Analysis\nand Murray Rothbard’s\nAn Austrian Perspective on the History of Economic Thought\n. But now there is a third. After finishing\nDebunking Economics: The Naked Emperor Dethroned?\nI have to assert that Keen’s book is not only an absolute masterpiece, but may, in fact, represent the most important intellectual development in economics since\nThe General Theory of Employment, Interest and Money\nwas published in 1936. And if some of Keen’s more controversial assertions hold up over time, it will be the most important contribution to the literature since\nThe Wealth of Nations\n.",
  "tags": [
    "books",
    "economics",
    "WND"
  ],
  "categories": [],
  "sitemap_lastmod": "2012-07-16T06:45:00+00:00"
}