{
  "url": "https://voxday.net/2012/07/27/building-jerusale/",
  "scraped_at": "2025-12-14T04:59:57.214840",
  "title": "Building Jerusalem",
  "date_display": "July 27, 2012",
  "date_iso": "2012-07-27T10:23:00+00:00",
  "date_from_url": "2012-07-27",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p><i>And did those feet in ancient time.<br> Walk upon Englands mountains green:<br> And was the holy Lamb of God,<br> On Englands pleasant pastures seen!</br></br></br></i></p><p>And did the Countenance Divine,<br> Shine forth upon our clouded hills?<br> And was Jerusalem builded here,<br> Among these dark Satanic Mills?</br></br></br></p><p>Bring me my Bow of burning gold;<br> Bring me my Arrows of desire:<br> Bring me my Spear: O clouds unfold!<br> Bring me my Chariot of fire!</br></br></br></p><p>I will not cease from Mental Fight,<br> Nor shall my Sword sleep in my hand:<br> Till we have built Jerusalem,<br> In Englands green &amp; pleasant Land</br></br></br></p><p>The London Olympics site <a href=\"http://www.london2012.com/spectators/ceremonies/opening-ceremony/\">describes tonight’s opening ceremony</a> thusly: “London 2012 gives athletes a magical welcome”.  The laudable habit of the enlightened courteously telling everyone exactly what they’re doing is always educational.  No doubt the generation will be inspired… by what, exactly, we shall learn tonight.</p></div>",
  "content_text": "And did those feet in ancient time.\nWalk upon Englands mountains green:\nAnd was the holy Lamb of God,\nOn Englands pleasant pastures seen!\nAnd did the Countenance Divine,\nShine forth upon our clouded hills?\nAnd was Jerusalem builded here,\nAmong these dark Satanic Mills?\nBring me my Bow of burning gold;\nBring me my Arrows of desire:\nBring me my Spear: O clouds unfold!\nBring me my Chariot of fire!\nI will not cease from Mental Fight,\nNor shall my Sword sleep in my hand:\nTill we have built Jerusalem,\nIn Englands green & pleasant Land\nThe London Olympics site\ndescribes tonight’s opening ceremony\nthusly: “London 2012 gives athletes a magical welcome”.  The laudable habit of the enlightened courteously telling everyone exactly what they’re doing is always educational.  No doubt the generation will be inspired… by what, exactly, we shall learn tonight.",
  "tags": [
    "sports"
  ],
  "categories": [],
  "sitemap_lastmod": "2012-07-27T09:23:00+00:00"
}