{
  "url": "https://voxday.net/2012/07/25/complexity-and-fall-of-empires-i/",
  "scraped_at": "2025-12-14T04:59:46.620712",
  "title": "Complexity and the fall of empires I",
  "date_display": "July 25, 2012",
  "date_iso": "2012-07-25T09:36:00+00:00",
  "date_from_url": "2012-07-25",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>Ugo Bardi has a fascinating post on the way in which <a href=\"http://www.financialsense.com/contributors/ugo-bardi/peak-civilization\">Rome hit its limits</a> and how even those Romans who perceived its decline failed to understand why it was happening:</p><blockquote><p>The <i>Meditations</i> [of Marcus Aurelius] is a statement from a man who was seeing his world crumbling down around him and who strove nevertheless to maintain a personal balance; to keep a moral stance. Aurelius surely understood that something was wrong with the Empire: during all their history, the Romans had been almost always on the offensive. Now, they were always defending themselves. That wasn’t right; of course.</p><p>But you never find in the <i>Meditations </i>a single line that lets you suspect that the Emperor thought that there was something to be done other than simply fighting to keep the barbarians out. You never read that the Emperor was considering, say, things like social reform, or maybe something to redress the disastrous situation of the economy. He had no concern, apparently, that the Empire could actually fall one day or another.</p><p>Now, I’d like to show you an excerpt from another document; written perhaps by late 4th century. Probably after the battle of Adrianopolis; that was one of last important battles fought (and lost) by the Roman Empire. This is a curious document. It is called, normally, “Of matters of war” because the title and the name of the author have been lost. But we have the bulk of the text and we can say that the author was probably somebody high up in the imperial bureaucracy. Someone very creative – clearly – you can see that from the illustrations of the book. Of course what we see now are not the original illustrations, but copies made during the Middle Ages. But the fact that the book had these illustration was probably what made it survive: people liked these colorful illustrations and had the book copied. So it wasn’t lost. The author described all sorts of curious weaponry. One that you can see here is a warship powered by oxen.</p><p>Of course, a ship like this one would never have worked. Think of how to feed the oxen. And think of how to manage the final results of feeding the oxen. Probably none of the curious weapons invented by our anonymous author would ever have worked. It all reminds me of Jeremy Rifkin and his hydrogen based economy. Rifkin understands what is the problem, but the solutions he proposes, well, are a little like the end result of feeding the oxen; but let me not go into that. The point is that our 4th century author does understand that the Roman Empire is in trouble. Actually, he seems to be scared to death because of what’s happening. Read this sentence, I am showing it to you in the original Latin to give you a sense of the flavor of this text.</p><p><i>“In primis sciendum est quod imperium romanum circumlatrantium ubique nationum perstringat insania et omne latus limitum tecta naturalibus locis appetat dolosa barbaries.”</i></p><p>Of course you may not be able to translate from Latin on the spot. For that, being Italian gives you a definite advantage. But let me just point out a word to you:”circumlatrantium” . which refers to barbarians who are, literally, “barking around” the empire’s borders. They are like dogs barking and running around; and not just barking – they are trying hard to get in. It is almost a scene from a horror movie. A nightmare. So the author of “Of matters of war” is thinking of how to get rid of these monsters. But his solutions were not so good. Actually it was just wishful thinking. None of these strange weapons were ever built. Even our 4th century author, therefore, fails completely in understanding what were the real problems of the Empire.</p><p>Now, I would like to show you just another document from the time of the Roman Empire. It is “De Reditu suo”, by Rutilius Namatianus. The title means “of his return”. Namatianus was a patrician who lived in the early 5th century; he was a contemporary of St. Patrick, the Irish saint. He had some kind of job with the imperial administration in Rome. It was some decades before the “official” disappearance of the Western Roman Empire; that was in 476, when the last emperor, Romolus Augustulus, was deposed. You may have seen Romulus Augustulus as protagonist of the movie “The Last Legion”. 1Of course that is not a movie that pretends to be historically accurate, but it is fun to think that after so many years we are still interested in the last years of the Roman Empire – it is a subject of endless fascination. Even the book by Namatianus has been transformed into a movie, as you can see in the figure. It is a work of fantasy, but they have tried to be faithful to the spirit of Namatianus’ report. It must be an interesting movie, but it has been shown only in theaters in Italy, and even there for a very short time; so I missed it. But let’s move on.</p><p>Namatianus lived at a time that was very close to the last gasp of the Empire. He found that, at some point, it wasn’t possible to live in Rome any longer. Everything was collapsing around him and he decided to take a boat and leave. He was born in Gallia, that we call “France” today, and apparently he had some properties there. So, that is where he headed for. That is the reason for the title “of his return”. He must have arrived there and survived for some time, because the document that he wrote about his travel has survived and we can still read it, even though the end is missing. So, Namatianus gives us this chilling report. Just read this excerpt:</p><p><i>“I have chosen the sea, since roads by land, if on the level, are flooded by rivers; if on higher ground, are beset with rocks. Since Tuscany and since the Aurelian highway, after suffering the outrages of Goths with fire or sword, can no longer control forest with homestead or river with bridge, it is better to entrust my sails to the wayward.”</i></p><p>Can you believe that? If there was a thing that the Romans had always been proud of were their roads. These roads had a military purpose, of course, but everybody could use them. A Roman Empire without roads is not the Roman Empire, it is something else altogether. Think of Los Angeles without highways. “Sic transit gloria mundi” , as the Romans would say; there goes the glory of the world. Namatianus tells us also of silted harbors, deserted cities, a landscape of ruins that he sees as he moves north along the Italian coast.</p><p>But what does Namatianus think of all this? Well, he sees the collapse all around him, but he can’t understand it. For him, the reasons of the fall of Rome are totally incomprehensible…. There would be much more to say on this matter, but I think it is enough to say that the Romans did not really understand what was happening to their Empire, except in terms of military setbacks that they always saw as temporary. They always seemed to think that these setbacks could be redressed by increasing the size of the army and building more fortifications. Also, it gives us an idea of what it is like living a collapse “from the inside”. Most people just don’t see it happening – it is like being a fish: you don’t see the water.</p></blockquote><p>What Bardi’s illustration of complex system dynamics and decline make very clear is that Robert Prechter is almost surely correct and collapse is not only unavoidable, but we are already firmly into the decline.  One need merely look at the decaying state of American infrastructure to see an echo of the decline of Roman roads; travel is still safe but that may not be the case in another century.</p><p>The most important thing to draw from Bardi’s article is the realization that most people, including those at the very top, will find the process incomprehensible and whatever policies are taken will prove to be irrelevant and pointless.  As with companies, it is the success of the great societies that sows the seeds of their eventual failure, with Rome it was the limits of legionary utility, with the USA it is more likely to be the limits of trade and immigration utility.  It is the continued reliance upon that which made a society strong that tends to prove ultimately fatal because nothing proceeds on linear paths.</p><p>One thing the discussion with the free traders has taught me is that most Americans can no more grasp the idea that too much trade is possible any more than most Romans could understand that too much farming or too many legions were possible.  After all, those two pillars of the Roman economy were the historical basis of Rome’s original enrichment, so how could a source of enrichment ever prove to be a source of impoverishment, let alone societal decline?</p><p>I’ll have more thoughts on this in another post tomorrow.</p></div>",
  "content_text": "Ugo Bardi has a fascinating post on the way in which\nRome hit its limits\nand how even those Romans who perceived its decline failed to understand why it was happening:\nThe\nMeditations\n[of Marcus Aurelius] is a statement from a man who was seeing his world crumbling down around him and who strove nevertheless to maintain a personal balance; to keep a moral stance. Aurelius surely understood that something was wrong with the Empire: during all their history, the Romans had been almost always on the offensive. Now, they were always defending themselves. That wasn’t right; of course.\nBut you never find in the\nMeditations\na single line that lets you suspect that the Emperor thought that there was something to be done other than simply fighting to keep the barbarians out. You never read that the Emperor was considering, say, things like social reform, or maybe something to redress the disastrous situation of the economy. He had no concern, apparently, that the Empire could actually fall one day or another.\nNow, I’d like to show you an excerpt from another document; written perhaps by late 4th century. Probably after the battle of Adrianopolis; that was one of last important battles fought (and lost) by the Roman Empire. This is a curious document. It is called, normally, “Of matters of war” because the title and the name of the author have been lost. But we have the bulk of the text and we can say that the author was probably somebody high up in the imperial bureaucracy. Someone very creative – clearly – you can see that from the illustrations of the book. Of course what we see now are not the original illustrations, but copies made during the Middle Ages. But the fact that the book had these illustration was probably what made it survive: people liked these colorful illustrations and had the book copied. So it wasn’t lost. The author described all sorts of curious weaponry. One that you can see here is a warship powered by oxen.\nOf course, a ship like this one would never have worked. Think of how to feed the oxen. And think of how to manage the final results of feeding the oxen. Probably none of the curious weapons invented by our anonymous author would ever have worked. It all reminds me of Jeremy Rifkin and his hydrogen based economy. Rifkin understands what is the problem, but the solutions he proposes, well, are a little like the end result of feeding the oxen; but let me not go into that. The point is that our 4th century author does understand that the Roman Empire is in trouble. Actually, he seems to be scared to death because of what’s happening. Read this sentence, I am showing it to you in the original Latin to give you a sense of the flavor of this text.\n“In primis sciendum est quod imperium romanum circumlatrantium ubique nationum perstringat insania et omne latus limitum tecta naturalibus locis appetat dolosa barbaries.”\nOf course you may not be able to translate from Latin on the spot. For that, being Italian gives you a definite advantage. But let me just point out a word to you:”circumlatrantium” . which refers to barbarians who are, literally, “barking around” the empire’s borders. They are like dogs barking and running around; and not just barking – they are trying hard to get in. It is almost a scene from a horror movie. A nightmare. So the author of “Of matters of war” is thinking of how to get rid of these monsters. But his solutions were not so good. Actually it was just wishful thinking. None of these strange weapons were ever built. Even our 4th century author, therefore, fails completely in understanding what were the real problems of the Empire.\nNow, I would like to show you just another document from the time of the Roman Empire. It is “De Reditu suo”, by Rutilius Namatianus. The title means “of his return”. Namatianus was a patrician who lived in the early 5th century; he was a contemporary of St. Patrick, the Irish saint. He had some kind of job with the imperial administration in Rome. It was some decades before the “official” disappearance of the Western Roman Empire; that was in 476, when the last emperor, Romolus Augustulus, was deposed. You may have seen Romulus Augustulus as protagonist of the movie “The Last Legion”. 1Of course that is not a movie that pretends to be historically accurate, but it is fun to think that after so many years we are still interested in the last years of the Roman Empire – it is a subject of endless fascination. Even the book by Namatianus has been transformed into a movie, as you can see in the figure. It is a work of fantasy, but they have tried to be faithful to the spirit of Namatianus’ report. It must be an interesting movie, but it has been shown only in theaters in Italy, and even there for a very short time; so I missed it. But let’s move on.\nNamatianus lived at a time that was very close to the last gasp of the Empire. He found that, at some point, it wasn’t possible to live in Rome any longer. Everything was collapsing around him and he decided to take a boat and leave. He was born in Gallia, that we call “France” today, and apparently he had some properties there. So, that is where he headed for. That is the reason for the title “of his return”. He must have arrived there and survived for some time, because the document that he wrote about his travel has survived and we can still read it, even though the end is missing. So, Namatianus gives us this chilling report. Just read this excerpt:\n“I have chosen the sea, since roads by land, if on the level, are flooded by rivers; if on higher ground, are beset with rocks. Since Tuscany and since the Aurelian highway, after suffering the outrages of Goths with fire or sword, can no longer control forest with homestead or river with bridge, it is better to entrust my sails to the wayward.”\nCan you believe that? If there was a thing that the Romans had always been proud of were their roads. These roads had a military purpose, of course, but everybody could use them. A Roman Empire without roads is not the Roman Empire, it is something else altogether. Think of Los Angeles without highways. “Sic transit gloria mundi” , as the Romans would say; there goes the glory of the world. Namatianus tells us also of silted harbors, deserted cities, a landscape of ruins that he sees as he moves north along the Italian coast.\nBut what does Namatianus think of all this? Well, he sees the collapse all around him, but he can’t understand it. For him, the reasons of the fall of Rome are totally incomprehensible…. There would be much more to say on this matter, but I think it is enough to say that the Romans did not really understand what was happening to their Empire, except in terms of military setbacks that they always saw as temporary. They always seemed to think that these setbacks could be redressed by increasing the size of the army and building more fortifications. Also, it gives us an idea of what it is like living a collapse “from the inside”. Most people just don’t see it happening – it is like being a fish: you don’t see the water.\nWhat Bardi’s illustration of complex system dynamics and decline make very clear is that Robert Prechter is almost surely correct and collapse is not only unavoidable, but we are already firmly into the decline.  One need merely look at the decaying state of American infrastructure to see an echo of the decline of Roman roads; travel is still safe but that may not be the case in another century.\nThe most important thing to draw from Bardi’s article is the realization that most people, including those at the very top, will find the process incomprehensible and whatever policies are taken will prove to be irrelevant and pointless.  As with companies, it is the success of the great societies that sows the seeds of their eventual failure, with Rome it was the limits of legionary utility, with the USA it is more likely to be the limits of trade and immigration utility.  It is the continued reliance upon that which made a society strong that tends to prove ultimately fatal because nothing proceeds on linear paths.\nOne thing the discussion with the free traders has taught me is that most Americans can no more grasp the idea that too much trade is possible any more than most Romans could understand that too much farming or too many legions were possible.  After all, those two pillars of the Roman economy were the historical basis of Rome’s original enrichment, so how could a source of enrichment ever prove to be a source of impoverishment, let alone societal decline?\nI’ll have more thoughts on this in another post tomorrow.",
  "tags": [
    "decline and fall",
    "history"
  ],
  "categories": [],
  "sitemap_lastmod": "2012-07-25T08:36:00+00:00"
}