{
  "url": "https://voxday.net/2012/07/26/complexity-and-fall-of-empires-ii/",
  "scraped_at": "2025-12-14T04:59:51.724878",
  "title": "Complexity and the fall of empires II",
  "date_display": "July 26, 2012",
  "date_iso": "2012-07-26T11:35:00+00:00",
  "date_from_url": "2012-07-26",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>In which we delve deeper into <a href=\"http://www.financialsense.com/contributors/ugo-bardi/peak-civilization\">Ugo Bardi’s explanation of complexity</a>, collapse, and the way in which the collapse of the Roman Empire offers a means of understanding the ongoing collapse of the American empire and the global financial system:</p><blockquote><p>Tainter goes well beyond the simplistic interpretation of many earlier authors and identifies a key point in the question of collapse.  Societies are complex entities; he understands that. And, hence, their collapse must be related to complexity. Here is an excerpt of Tainter’s way of thinking. It is a transcription of a interview that Tainter gave in the film “Blind Spot” (2008)</p><p><i>“In ancient societies that I studied, for example the Roman Empire, the great problem that they faced was when they would have to incur very high costs just to maintain the status quo. Invest very high amounts in solving problems that don’t yield a net positive return, but instead simply allowed them to maintain what they already got. This decreases the net benefit of being a complex society.”</i></p><p>So, you see that Tainter has one thing very clear: complexity gives a benefit, but it is also a cost. This cost is related to energy, as he makes clear in his book. And in emphasizing complexity, Tainter gives us a good definition of what we intend for collapse. Very often people have been discussing the collapse of ancient societies without specifying what they meant for “collapse”. For a while, there has been a school of thought that maintained that the Roman Empire had never really “collapsed”. It had simply transformed itself into something else. But if you take collapse defined as “a rapid reduction of complexity” then you have a good definition and that’s surely what happened to the Roman Empire.</p><p>The Romans kept increasing the size of their army even after the economic returns that they got from military activities went down, actually may have become negative. It is exactly the same behavior of whalers in 19th century who kept increasing the size of the whaling fleet even it was clear that there weren’t enough whales to catch to justify that….</p><p>So, I think we have enough data, here, to prove the validity of the model – at least in qualitative terms. Maybe somebody should collect good data, archaeological and historical, and made a complete dynamic model of the Roman Empire. That would be very interesting, but it is beyond my possibilities for now. Anyway, even from these qualitative data we should be able to understand why the Empire was in trouble. One of the main causes of the trouble was that it had this big military apparatus, the legions, that needed to be paid and didn’t bring in any profit. It was the start of an hemorrhage of gold that couldn’t be reversed. In addition, the Empire bled itself even more by building an extensive system of fortifications – the limes that had to be maintained and manned, besides being expensive in themselves.</p><p>The story of the fortifications is a good example of what we had said; the attempt of a complex system to maintain homeostasis. The Romans must have understood that legions were too expensive if you had to keep so many of them to keep the borders safe. So, they built these walls. I imagine that the walls were built by slaves; and a slave surely cost less than a legionnaire. Slaves, however, were not good as fighters – I suppose that if you gave a sword to a slave he might think to run away or to use it against you. You know the story of Spartacus, the leader of a slave revolt in Roman times. I am sure that the Romans didn’t want to risk that again. But with walls the Romans had found a way to replace legionnaires with slaves. You needed less legionnaires to defend a fortification than to defend an open field. That was a way to save money, to keep homeostasis. But it wasn’t enough – obviously. The Romans still needed to pay for the legions and – as a disadvantage – the walls were a rigid system of defense that couldn’t be changed. The Romans were forced to man the walls all along their extension and that must have been awfully expensive. The Empire had locked itself in a cage from which it would never be able to escape. Negative feedback kills.</p><p>Military expenses were not the only cause of the fall. With erosion gnawing at agricultural yields and mine productivity going down, we should not be surprised if the empire collapsed. It simply couldn’t do otherwise. So, you see that the collapse of the Roman Empire was a complex phenomenon where different negative factors reinforced each other. It was a cascade of negative feedbacks, not a single one, that brought down the empire.</p></blockquote><p>The key phrase, and the one that is particularly relevant to the current situation, is this: “the great problem… was when they would have to incur very high costs just to maintain the status quo”.  So, what are the primary aspects of the current status quo that require increasingly expensive maintenance?</p><p>I see two areas that fit the description of a response to a problem that creates a destructive series of feedback loops.  The first is debt and the second is immigration.  The debt issue is obvious, since new debt keeps being created to pay off the old debts; this strategy will work right up until new debt can’t be created, in which case default which destroys a significant percentage of the powerful financial institutions or increased inflation which further hammers the economy and the populace is inevitable.</p><p>Immigration was posited as the solution for the declining native birthrates that threatened the intergenerational Ponzi scheme of entitlements, but it is proving to be far more expensive in a broad variety of ways than its advocates expected.  It was intriguing to see Ann Coulter finally, after all these years, <a href=\"http://www.anncoulter.com/columns/2012-07-18.html\">turn openly against legal immigration</a>, although she unsurprisingly, and erroneously, attempted to blame it on Democrats despite the Republican elite’s unstinting support of it.  I note that one seldom hears the Bush-era claim that Hispanics are “natural conservatives” any longer, which I and others pointed out was totally ludicrous at the time.</p><p>There are, of course, other elements that have contributed heavily to American decline and fall, indeed, Bardi and Trainer both specifically deny the idea that there is any one causal factor in societal collapses.  But for all that free trade, domestic spending, and foreign wars have added pressure to the structure, they have not created negative feedback cycles of the sort that debt and population demographics have.</p></div>",
  "content_text": "In which we delve deeper into\nUgo Bardi’s explanation of complexity\n, collapse, and the way in which the collapse of the Roman Empire offers a means of understanding the ongoing collapse of the American empire and the global financial system:\nTainter goes well beyond the simplistic interpretation of many earlier authors and identifies a key point in the question of collapse.  Societies are complex entities; he understands that. And, hence, their collapse must be related to complexity. Here is an excerpt of Tainter’s way of thinking. It is a transcription of a interview that Tainter gave in the film “Blind Spot” (2008)\n“In ancient societies that I studied, for example the Roman Empire, the great problem that they faced was when they would have to incur very high costs just to maintain the status quo. Invest very high amounts in solving problems that don’t yield a net positive return, but instead simply allowed them to maintain what they already got. This decreases the net benefit of being a complex society.”\nSo, you see that Tainter has one thing very clear: complexity gives a benefit, but it is also a cost. This cost is related to energy, as he makes clear in his book. And in emphasizing complexity, Tainter gives us a good definition of what we intend for collapse. Very often people have been discussing the collapse of ancient societies without specifying what they meant for “collapse”. For a while, there has been a school of thought that maintained that the Roman Empire had never really “collapsed”. It had simply transformed itself into something else. But if you take collapse defined as “a rapid reduction of complexity” then you have a good definition and that’s surely what happened to the Roman Empire.\nThe Romans kept increasing the size of their army even after the economic returns that they got from military activities went down, actually may have become negative. It is exactly the same behavior of whalers in 19th century who kept increasing the size of the whaling fleet even it was clear that there weren’t enough whales to catch to justify that….\nSo, I think we have enough data, here, to prove the validity of the model – at least in qualitative terms. Maybe somebody should collect good data, archaeological and historical, and made a complete dynamic model of the Roman Empire. That would be very interesting, but it is beyond my possibilities for now. Anyway, even from these qualitative data we should be able to understand why the Empire was in trouble. One of the main causes of the trouble was that it had this big military apparatus, the legions, that needed to be paid and didn’t bring in any profit. It was the start of an hemorrhage of gold that couldn’t be reversed. In addition, the Empire bled itself even more by building an extensive system of fortifications – the limes that had to be maintained and manned, besides being expensive in themselves.\nThe story of the fortifications is a good example of what we had said; the attempt of a complex system to maintain homeostasis. The Romans must have understood that legions were too expensive if you had to keep so many of them to keep the borders safe. So, they built these walls. I imagine that the walls were built by slaves; and a slave surely cost less than a legionnaire. Slaves, however, were not good as fighters – I suppose that if you gave a sword to a slave he might think to run away or to use it against you. You know the story of Spartacus, the leader of a slave revolt in Roman times. I am sure that the Romans didn’t want to risk that again. But with walls the Romans had found a way to replace legionnaires with slaves. You needed less legionnaires to defend a fortification than to defend an open field. That was a way to save money, to keep homeostasis. But it wasn’t enough – obviously. The Romans still needed to pay for the legions and – as a disadvantage – the walls were a rigid system of defense that couldn’t be changed. The Romans were forced to man the walls all along their extension and that must have been awfully expensive. The Empire had locked itself in a cage from which it would never be able to escape. Negative feedback kills.\nMilitary expenses were not the only cause of the fall. With erosion gnawing at agricultural yields and mine productivity going down, we should not be surprised if the empire collapsed. It simply couldn’t do otherwise. So, you see that the collapse of the Roman Empire was a complex phenomenon where different negative factors reinforced each other. It was a cascade of negative feedbacks, not a single one, that brought down the empire.\nThe key phrase, and the one that is particularly relevant to the current situation, is this: “the great problem… was when they would have to incur very high costs just to maintain the status quo”.  So, what are the primary aspects of the current status quo that require increasingly expensive maintenance?\nI see two areas that fit the description of a response to a problem that creates a destructive series of feedback loops.  The first is debt and the second is immigration.  The debt issue is obvious, since new debt keeps being created to pay off the old debts; this strategy will work right up until new debt can’t be created, in which case default which destroys a significant percentage of the powerful financial institutions or increased inflation which further hammers the economy and the populace is inevitable.\nImmigration was posited as the solution for the declining native birthrates that threatened the intergenerational Ponzi scheme of entitlements, but it is proving to be far more expensive in a broad variety of ways than its advocates expected.  It was intriguing to see Ann Coulter finally, after all these years,\nturn openly against legal immigration\n, although she unsurprisingly, and erroneously, attempted to blame it on Democrats despite the Republican elite’s unstinting support of it.  I note that one seldom hears the Bush-era claim that Hispanics are “natural conservatives” any longer, which I and others pointed out was totally ludicrous at the time.\nThere are, of course, other elements that have contributed heavily to American decline and fall, indeed, Bardi and Trainer both specifically deny the idea that there is any one causal factor in societal collapses.  But for all that free trade, domestic spending, and foreign wars have added pressure to the structure, they have not created negative feedback cycles of the sort that debt and population demographics have.",
  "tags": [
    "decline and fall"
  ],
  "categories": [],
  "sitemap_lastmod": "2012-07-26T10:35:00+00:00"
}