{
  "url": "https://voxday.net/2012/07/16/contemplating-quitting/",
  "scraped_at": "2025-12-14T04:59:12.105258",
  "title": "In defense of mass murder",
  "date_display": "July 16, 2012",
  "date_iso": "2012-07-16T21:08:00+00:00",
  "date_from_url": "2012-07-16",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>I find myself contemplating quitting.  No, not the blog.  And not writing in general.  But it is really incredible to see how few people at WND are interested in substantive matters like a conceptual revolution in economics versus other, considerably less significant issues.</p><p>There are all of two comments on today’s WND column.  That’s less than one-twentieth of how many comment on any given column.  And it’s not the WND readership, it wouldn’t be any better if I wrote for Salon, the New York Times, or the Daily Show.  I mean, it’s not that I don’t understand MPAI, I coined the acronym after all.  But that’s true for varying degrees of “most” and sometimes the percentage is just a little higher than I can fathom.  I mean, the world is on the brink of a total economic meltdown, and <i>still</i> no one gives a damn about why?  I feel like Jonah staring at the walls of Nineveh, stomping up and down the beach, gesticulating wildly and saying: “Go ahead and do it, Lord, let them have it, you know they deserve it!”</p><p>Seriously, I’m not sure I can deal with trying to pretend I don’t think a world where the best-selling novel is <i>Twilight fan fiction</i> deserves to perish in fire and ice.  I used to wonder to whom the old Norse pagan religion held any appeal, but now I understand completely.  If I read one more idiot Republican bank apologist claiming that the root cause of the financial crisis was Democratic politicians forcing banks to provide home loans to minorities, I may climb the Rainbow Bridge, wrest the horn from Heimdall and blow it myself.  Then I’ll sit there and cheer for the frost giants and fire demons.</p><p>I’m considering a literary experiment of sorts.  I’m wondering how much more interest would be expressed in the dumbest, most lowbrow column I can get past the editors devoted to the simple and straightforward concept of Obama being bad.  Bad for the nation.  Bad for the world!  Bad.  So bad.  I’m thinking of calling it: Obama is Bad.  Subtitled: Obama is really and truly very bad for America.</p><p>And if the column hits Drudge and results in an offer from Fox News to host my own cable news show, I’m going to give up op/ed, study genetics, build a lab, and start creating customized killer viruses.</p></div>",
  "content_text": "I find myself contemplating quitting.  No, not the blog.  And not writing in general.  But it is really incredible to see how few people at WND are interested in substantive matters like a conceptual revolution in economics versus other, considerably less significant issues.\nThere are all of two comments on today’s WND column.  That’s less than one-twentieth of how many comment on any given column.  And it’s not the WND readership, it wouldn’t be any better if I wrote for Salon, the New York Times, or the Daily Show.  I mean, it’s not that I don’t understand MPAI, I coined the acronym after all.  But that’s true for varying degrees of “most” and sometimes the percentage is just a little higher than I can fathom.  I mean, the world is on the brink of a total economic meltdown, and\nstill\nno one gives a damn about why?  I feel like Jonah staring at the walls of Nineveh, stomping up and down the beach, gesticulating wildly and saying: “Go ahead and do it, Lord, let them have it, you know they deserve it!”\nSeriously, I’m not sure I can deal with trying to pretend I don’t think a world where the best-selling novel is\nTwilight fan fiction\ndeserves to perish in fire and ice.  I used to wonder to whom the old Norse pagan religion held any appeal, but now I understand completely.  If I read one more idiot Republican bank apologist claiming that the root cause of the financial crisis was Democratic politicians forcing banks to provide home loans to minorities, I may climb the Rainbow Bridge, wrest the horn from Heimdall and blow it myself.  Then I’ll sit there and cheer for the frost giants and fire demons.\nI’m considering a literary experiment of sorts.  I’m wondering how much more interest would be expressed in the dumbest, most lowbrow column I can get past the editors devoted to the simple and straightforward concept of Obama being bad.  Bad for the nation.  Bad for the world!  Bad.  So bad.  I’m thinking of calling it: Obama is Bad.  Subtitled: Obama is really and truly very bad for America.\nAnd if the column hits Drudge and results in an offer from Fox News to host my own cable news show, I’m going to give up op/ed, study genetics, build a lab, and start creating customized killer viruses.",
  "tags": [
    "politics",
    "trainwreck"
  ],
  "categories": [],
  "sitemap_lastmod": "2012-07-16T20:08:00+00:00"
}