{
  "url": "https://voxday.net/2012/07/09/eternal-warriors-ebooks-available/",
  "scraped_at": "2025-12-14T04:58:34.921200",
  "title": "Eternal Warriors ebooks released today",
  "date_display": "July 9, 2012",
  "date_iso": "2012-07-09T12:24:00+00:00",
  "date_from_url": "2012-07-09",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><div class=\"separator\" style=\"clear: both; text-align: center;\"><a href=\"http://1.bp.blogspot.com/-jcclHmfX5zE/T_rL56KBEWI/AAAAAAAAAUU/iU3o3wuADDU/s1600/EW_ebooks.png\" imageanchor=\"1\" style=\"margin-left:1em; margin-right:1em\"><img border=\"0\" decoding=\"async\" fetchpriority=\"high\" height=\"172\" src=\"http://www.milobookclub.com/wp-content/uploads/2012/07/EW_ebooks.png\" width=\"400\"/></a></div><p>I’m pleased to announce that the three Eternal Warriors ebooks are now available for purchase. <a href=\"http://www.amazon.com/dp/B008IV9YQ4\">The War in Heaven</a>, <a href=\"http://www.amazon.com/dp/B008IVECM0\">The World in Shadow</a>, and <a href=\"http://www.amazon.com/dp/B008IVED4C\">The Wrath of Angels</a> are all priced at $2.99 for Kindle at Amazon.</p><p>If you have a Nook or Kobo, the ebooks can also be purchased in EPUB format from Barnes and Noble: <a href=\"http://www.barnesandnoble.com/w/the-war-in-heaven-theodore-beale/1003812234?ean=2940014668040\">War</a>, <a href=\"http://www.barnesandnoble.com/w/world-in-shadow-theodore-beale/1013485972\">World</a>, and <a href=\"http://www.barnesandnoble.com/w/the-wrath-of-angels-theodore-beale/1007500831\">Wrath</a>.  Special thanks to Markku, who reformatted them from the original text, to JartStar, who created a new cover for Shadow and created a new typography to eliminate the dichotomy between the Rowena covers and the Pocket covers, and to the Original Cyberpunk, who actually got them out the door. Also, thanks to the eagle-eyed proofreaders, who did a much better job than Pocket’s line-editors in spotting over 100 typos across the three books.  Please let me know, Jamsco, Peter, and the others who participated, if you would like copies of the final epubs.  And if you can resist the temptation to send me any new discoveries for at least a week, I would appreciate that….</p></div>",
  "content_text": "I’m pleased to announce that the three Eternal Warriors ebooks are now available for purchase.\nThe War in Heaven\n,\nThe World in Shadow\n, and\nThe Wrath of Angels\nare all priced at $2.99 for Kindle at Amazon.\nIf you have a Nook or Kobo, the ebooks can also be purchased in EPUB format from Barnes and Noble:\nWar\n,\nWorld\n, and\nWrath\n.  Special thanks to Markku, who reformatted them from the original text, to JartStar, who created a new cover for Shadow and created a new typography to eliminate the dichotomy between the Rowena covers and the Pocket covers, and to the Original Cyberpunk, who actually got them out the door. Also, thanks to the eagle-eyed proofreaders, who did a much better job than Pocket’s line-editors in spotting over 100 typos across the three books.  Please let me know, Jamsco, Peter, and the others who participated, if you would like copies of the final epubs.  And if you can resist the temptation to send me any new discoveries for at least a week, I would appreciate that….",
  "tags": [
    "books"
  ],
  "categories": [],
  "sitemap_lastmod": "2012-07-09T11:24:00+00:00"
}