{
  "url": "https://voxday.net/2012/07/06/free-fascistthoughtblogs/",
  "scraped_at": "2025-12-14T04:58:22.075708",
  "title": "FreeFascistThoughtBlogs",
  "date_display": "July 6, 2012",
  "date_iso": "2012-07-06T23:37:00+00:00",
  "date_from_url": "2012-07-06",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>The funniest thing about all of this isn’t the irony that FreeThoughtBlogs doesn’t support actual free thought.  For all that atheists have attempted, with some success, to steal the concept, <i>joch sint iedoch gedanke frî</i> was, in fact, not only a Christian concept but a Catholic one.  But the atheist “freethinker” supports genuine freedom of thought about as sincerely as the American liberal supports genuine liberalism.  What is actually funny is the idea that despite all of the copious evidence readily available on the Internet, there are still a few people who believe that PZ Myers has any integrity at all, academic or otherwise.</p><p>And what was his thoughtcrime?  Pointing out that Skepchick is a lunatic and that hundreds of atheists are not, in fact, attempting to rape her every time she attends an atheist conference.  Or something to that effect, I couldn’t care less.  But I stand corrected.  The funniest part of this kerfluffle, at least so far, is when Thunderfoot not only succinctly describes PZ’s customary method of argument, but actually expresses surprise at it.</p><p><i>1.  The pointless use of invective.<br> 2.  The extensive use of strawmen.<br> 3.  The lack of any actual attempt to engage with the argument made.</br></br></i></p><p>Needless to say, longtime readers know that I’ve been pointing this sort of thing out ever since I was under the impression that PZ was a girl bitching about my WND columns.  He’s always been a liar, he’s always been an inept polemicist, and it’s simply astonishing how long it has taken many atheists to realize this.</p><p>It’s also informative to read the shamelessly dishonest attempts of the Pharyngulans to defend PZ while completely missing the point.  Of course FreeThoughtBlogs has the right to police the content being posted by its bloggers.  That’s not the problem, the problem is that PZ promised that he would not do that.  And then he did precisely what he promised he would not do.  Which is what makes him a liar and is the reason this Thunderfoot is correctly accusing him of lacking integrity.</p></div>",
  "content_text": "The funniest thing about all of this isn’t the irony that FreeThoughtBlogs doesn’t support actual free thought.  For all that atheists have attempted, with some success, to steal the concept,\njoch sint iedoch gedanke frî\nwas, in fact, not only a Christian concept but a Catholic one.  But the atheist “freethinker” supports genuine freedom of thought about as sincerely as the American liberal supports genuine liberalism.  What is actually funny is the idea that despite all of the copious evidence readily available on the Internet, there are still a few people who believe that PZ Myers has any integrity at all, academic or otherwise.\nAnd what was his thoughtcrime?  Pointing out that Skepchick is a lunatic and that hundreds of atheists are not, in fact, attempting to rape her every time she attends an atheist conference.  Or something to that effect, I couldn’t care less.  But I stand corrected.  The funniest part of this kerfluffle, at least so far, is when Thunderfoot not only succinctly describes PZ’s customary method of argument, but actually expresses surprise at it.\n1.  The pointless use of invective.\n2.  The extensive use of strawmen.\n3.  The lack of any actual attempt to engage with the argument made.\nNeedless to say, longtime readers know that I’ve been pointing this sort of thing out ever since I was under the impression that PZ was a girl bitching about my WND columns.  He’s always been a liar, he’s always been an inept polemicist, and it’s simply astonishing how long it has taken many atheists to realize this.\nIt’s also informative to read the shamelessly dishonest attempts of the Pharyngulans to defend PZ while completely missing the point.  Of course FreeThoughtBlogs has the right to police the content being posted by its bloggers.  That’s not the problem, the problem is that PZ promised that he would not do that.  And then he did precisely what he promised he would not do.  Which is what makes him a liar and is the reason this Thunderfoot is correctly accusing him of lacking integrity.",
  "tags": [
    "atheism"
  ],
  "categories": [],
  "sitemap_lastmod": "2012-07-06T22:37:00+00:00"
}