{
  "url": "https://voxday.net/2012/07/01/in-which-opinions-are-soug/",
  "scraped_at": "2025-12-14T04:57:56.842716",
  "title": "In which opinions are sought",
  "date_display": "July 1, 2012",
  "date_iso": "2012-07-01T10:03:00+00:00",
  "date_from_url": "2012-07-01",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>Marcher Lord and I have been having some discussions about what the cover for the forthcoming first novel in the <i>Arts of Dark and Light</i> series should look like.  On the one hand, it is a continuation of the story begun in <i>Summa Elvetica</i>, so there is a good reason to do it in the style of the SE cover.  On the other hand, SE was a highly esoteric experimental novel with absolutely no pretensions of mass appeal whatsoever, so there is an equally good reason to go with a different approach.  Below is an image with both possible cover styles shown side-by-side; click on it to see the high-res version.</p><p><a href=\"http://4.bp.blogspot.com/-R35eIX7Gl1E/T_AeDW78RWI/AAAAAAAAAUE/hZWJ6PwGYPQ/s1600/2covers.png\" imageanchor=\"1\" style=\"clear: left; float: left; margin-bottom: 1em; margin-right: 1em;\"><img border=\"0\" decoding=\"async\" fetchpriority=\"high\" height=\"309\" src=\"http://www.milobookclub.com/wp-content/uploads/2012/07/2covers.png\" width=\"400\"/></a>Please note that all I’m looking for here is to get everyone’s opinion on which style they happen to prefer.  I’m not looking for value judgments or long essays on the relative artistic merits.  Obviously, the covers are not done and so it’s not at all necessary to point out that my name is misspelled or any other minor and easily corrected issues.  So, please express your preference in the comments; I originally put up a poll, but some retard from 173.245.5x didn’t realize that ProProfs tracks IP addresses and kept voting repeatedly so we’ll have to do this manually.  Needless to say, Anonymous votes won’t be counted.</p><p>Thanks, and in case you’re interested, I expect to have some additional book-related news early next week.</p></div>",
  "content_text": "Marcher Lord and I have been having some discussions about what the cover for the forthcoming first novel in the\nArts of Dark and Light\nseries should look like.  On the one hand, it is a continuation of the story begun in\nSumma Elvetica\n, so there is a good reason to do it in the style of the SE cover.  On the other hand, SE was a highly esoteric experimental novel with absolutely no pretensions of mass appeal whatsoever, so there is an equally good reason to go with a different approach.  Below is an image with both possible cover styles shown side-by-side; click on it to see the high-res version.\nPlease note that all I’m looking for here is to get everyone’s opinion on which style they happen to prefer.  I’m not looking for value judgments or long essays on the relative artistic merits.  Obviously, the covers are not done and so it’s not at all necessary to point out that my name is misspelled or any other minor and easily corrected issues.  So, please express your preference in the comments; I originally put up a poll, but some retard from 173.245.5x didn’t realize that ProProfs tracks IP addresses and kept voting repeatedly so we’ll have to do this manually.  Needless to say, Anonymous votes won’t be counted.\nThanks, and in case you’re interested, I expect to have some additional book-related news early next week.",
  "tags": [
    "books"
  ],
  "categories": [],
  "sitemap_lastmod": "2012-07-01T09:03:00+00:00"
}