{
  "url": "https://voxday.net/2012/07/24/intergenerational-dynamics/",
  "scraped_at": "2025-12-14T04:59:39.294897",
  "title": "Intergenerational dynamics",
  "date_display": "July 24, 2012",
  "date_iso": "2012-07-24T07:39:00+00:00",
  "date_from_url": "2012-07-24",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>I’ve been having a little email debate with John Xenakis, who I suspect has somewhat misapplied his own Generational Dynamics theory to the financial crisis as a result of Boomer idealism failing to grasp the full extent of Gen-X cynicism.  His interpretation is as follows:</p><p><i>“The evidence is overwhelming that Gen-Xers were the perpetrators of the crimes related to the financial crisis simply because it was only the Gen-X financial engineers who had the education and skills to create fraudulent residential mortgage backed collaterized debt obligations (RMB CDOs).  And the evidence is overwhelming that they created and sold these fraudulent synthetic securities knowing full well that they were fraudulent.  And the evidence is overwhelming that their Boomer bosses knew what was going on, but let it go on because they were making too much money.  I’ve written about this evidence dozens of times.”</i></p><p>Now, in support of this interpretation, here is the question that he has asked of his Gen-X interlocutors:</p><p>1. <i>“Jon Corzine should go to jail, and any Gen-Xers reporting to Corzine who committed fraud or who participated in co-mingling investor funds illegally should also go to jail.  Do you agree with that or not?”</i></p><p>To which I will add three more questions.</p><p>2. To what generational cohort do you belong: Greatest, Silent, Boomer, Gen-X, Millennial?</p><p>3. Do you believe there is any chance, however remote, of an investigation that will dig into the organizations, find all the perpetrators, and send them all to jail, including Corzine?</p><p>4. It is the members of the _______ generation that are primarily responsible for the perpetration of the crimes related to the financial crisis.</p><p>Answers in the comments, please.  I’ll tabulate and send the results to John later.  I’ll have some more on the exchange between the two of us in a future post, which I suspect a few of you here may find interesting.  I do find his theories to be remarkable, inasmuch as it is almost creepy to listen to the original <i>Down to the Ground</i> and see how some of his themes are readily apparent in lyrics written 15 years before I first encountered his theories.</p></div>",
  "content_text": "I’ve been having a little email debate with John Xenakis, who I suspect has somewhat misapplied his own Generational Dynamics theory to the financial crisis as a result of Boomer idealism failing to grasp the full extent of Gen-X cynicism.  His interpretation is as follows:\n“The evidence is overwhelming that Gen-Xers were the perpetrators of the crimes related to the financial crisis simply because it was only the Gen-X financial engineers who had the education and skills to create fraudulent residential mortgage backed collaterized debt obligations (RMB CDOs).  And the evidence is overwhelming that they created and sold these fraudulent synthetic securities knowing full well that they were fraudulent.  And the evidence is overwhelming that their Boomer bosses knew what was going on, but let it go on because they were making too much money.  I’ve written about this evidence dozens of times.”\nNow, in support of this interpretation, here is the question that he has asked of his Gen-X interlocutors:\n1.\n“Jon Corzine should go to jail, and any Gen-Xers reporting to Corzine who committed fraud or who participated in co-mingling investor funds illegally should also go to jail.  Do you agree with that or not?”\nTo which I will add three more questions.\n2. To what generational cohort do you belong: Greatest, Silent, Boomer, Gen-X, Millennial?\n3. Do you believe there is any chance, however remote, of an investigation that will dig into the organizations, find all the perpetrators, and send them all to jail, including Corzine?\n4. It is the members of the _______ generation that are primarily responsible for the perpetration of the crimes related to the financial crisis.\nAnswers in the comments, please.  I’ll tabulate and send the results to John later.  I’ll have some more on the exchange between the two of us in a future post, which I suspect a few of you here may find interesting.  I do find his theories to be remarkable, inasmuch as it is almost creepy to listen to the original\nDown to the Ground\nand see how some of his themes are readily apparent in lyrics written 15 years before I first encountered his theories.",
  "tags": [
    "generational dynamics"
  ],
  "categories": [],
  "sitemap_lastmod": "2012-07-24T06:39:00+00:00"
}