{
  "url": "https://voxday.net/2012/07/22/mailvox-aussie-logic/",
  "scraped_at": "2025-12-14T04:59:33.811522",
  "title": "Mailvox: Aussie logic",
  "date_display": "July 22, 2012",
  "date_iso": "2012-07-22T14:43:00+00:00",
  "date_from_url": "2012-07-22",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>Freddy suggests that America should follow Australia’s example in fighting crime by banning guns:</p><blockquote><p>Australia has very strict gun laws following several mass shootings. People get shot but mainly as a result of gangs who fight their vendettas out between themselves. It is rare for people to shot in domestic violence or random attacks. Most people don’t carry or own guns. Americans would do well to consider that many non Americans think it is insane to be able to buy a firearm off the counter.</p></blockquote><p>Actually, <a href=\"http://www.ncpa.org/sub/dpd/index.php?Article_ID=17847\">if the Australian Bureau of Criminology can be believed</a>, Americans would be insane to concern themselves with what non-Americans think about American gun rights.</p><p><i>In 2002 — five years after enacting its gun ban — the Australian Bureau of Criminology acknowledged there is no correlation between gun control and the use of firearms in violent crime.  In fact, the percent of murders committed with a firearm was the highest it had ever been in 2006 (16.3 percent), says the D.C. Examiner.</i></p><p>Even Australia’s Bureau of Crime Statistics and Research acknowledges that the gun ban had no significant impact on the amount of gun-involved crime:</p><p> In 2006, assault rose 49.2 percent and robbery 6.2 percent.<br> Sexual assault — Australia’s equivalent term for rape — increased 29.9 percent.<br> Overall, Australia’s violent crime rate rose 42.2 percent.</br></br></p><p>Moreover, Australia and the United States — where no gun-ban exists — both experienced similar decreases in murder rates:</p><p> Between 1995 and 2007, Australia saw a 31.9 percent decrease; without a gun ban, America’s rate dropped 31.7 percent.<br> During the same time period, all other violent crime indices increased in Australia: assault rose 49.2 percent and robbery 6.2 percent.<br> Sexual assault — Australia’s equivalent term for rape — increased 29.9 percent.<br> Overall, Australia’s violent crime rate rose 42.2 percent.<br> At the same time, U.S. violent crime decreased 31.8 percent: rape dropped 19.2 percent; robbery decreased 33.2 percent; aggravated assault dropped 32.2 percent.<br> Australian women are now raped over three times as often as American women.</br></br></br></br></br></p><p>So, if the USA follows Australia’s lead in banning guns, it should expect a 42 percent increase in violent crime, a higher percentage of murders committed with a gun, and three times more rape.  One wonders if Freddy even bothered to look up <a href=\"http://www.kc3.com/news/britt_aussie_crime.htm\">the relative crime statistics</a>.</p><p><i>The International Crime Victims Survey, conducted by Leiden University in Holland, found that England and Wales ranked second overall in violent crime among industrialized nations.  Twenty-six percent of English citizens — roughly one-quarter of the population — have been victimized by violent crime. Australia led the list with more than 30 percent of its population victimized.  The United States didn’t even make the “top 10” list of industrialized nations whose citizens were victimized by crime.</i></p><p>I wonder why that might be?</p></div>",
  "content_text": "Freddy suggests that America should follow Australia’s example in fighting crime by banning guns:\nAustralia has very strict gun laws following several mass shootings. People get shot but mainly as a result of gangs who fight their vendettas out between themselves. It is rare for people to shot in domestic violence or random attacks. Most people don’t carry or own guns. Americans would do well to consider that many non Americans think it is insane to be able to buy a firearm off the counter.\nActually,\nif the Australian Bureau of Criminology can be believed\n, Americans would be insane to concern themselves with what non-Americans think about American gun rights.\nIn 2002 — five years after enacting its gun ban — the Australian Bureau of Criminology acknowledged there is no correlation between gun control and the use of firearms in violent crime.  In fact, the percent of murders committed with a firearm was the highest it had ever been in 2006 (16.3 percent), says the D.C. Examiner.\nEven Australia’s Bureau of Crime Statistics and Research acknowledges that the gun ban had no significant impact on the amount of gun-involved crime:\nIn 2006, assault rose 49.2 percent and robbery 6.2 percent.\nSexual assault — Australia’s equivalent term for rape — increased 29.9 percent.\nOverall, Australia’s violent crime rate rose 42.2 percent.\nMoreover, Australia and the United States — where no gun-ban exists — both experienced similar decreases in murder rates:\nBetween 1995 and 2007, Australia saw a 31.9 percent decrease; without a gun ban, America’s rate dropped 31.7 percent.\nDuring the same time period, all other violent crime indices increased in Australia: assault rose 49.2 percent and robbery 6.2 percent.\nSexual assault — Australia’s equivalent term for rape — increased 29.9 percent.\nOverall, Australia’s violent crime rate rose 42.2 percent.\nAt the same time, U.S. violent crime decreased 31.8 percent: rape dropped 19.2 percent; robbery decreased 33.2 percent; aggravated assault dropped 32.2 percent.\nAustralian women are now raped over three times as often as American women.\nSo, if the USA follows Australia’s lead in banning guns, it should expect a 42 percent increase in violent crime, a higher percentage of murders committed with a gun, and three times more rape.  One wonders if Freddy even bothered to look up\nthe relative crime statistics\n.\nThe International Crime Victims Survey, conducted by Leiden University in Holland, found that England and Wales ranked second overall in violent crime among industrialized nations.  Twenty-six percent of English citizens — roughly one-quarter of the population — have been victimized by violent crime. Australia led the list with more than 30 percent of its population victimized.  The United States didn’t even make the “top 10” list of industrialized nations whose citizens were victimized by crime.\nI wonder why that might be?",
  "tags": [
    "mailvox",
    "society"
  ],
  "categories": [],
  "sitemap_lastmod": "2012-07-22T13:43:00+00:00"
}