{
  "url": "https://voxday.net/2012/07/13/mailvox-rethinking-paterno/",
  "scraped_at": "2025-12-14T04:58:53.244081",
  "title": "Mailvox: rethinking Paterno",
  "date_display": "July 13, 2012",
  "date_iso": "2012-07-13T10:15:00+00:00",
  "date_from_url": "2012-07-13",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>Adognameop asks about the <i>Vox, What do you make of the recent FBI report regarding Penn State? It seems to reveal what everybody already knew; that Paterno was an accomplice to child rape. Does it affect your opinion of Paterno?</i></p><p>First, I would note that Paterno’s actions did not, in any way, make him “an accomplice to child rape”.  An an accomplice is a person who is present at the scene of the crime, actively participates in its commission, and has the same degree of guilt as the person he or she is assisting, is subject to prosecution for the same crime, and faces the same criminal penalties.  None of this applies to Paterno.</p><p>So, let’s take a look at <a href=\"http://www.nytimes.com/2012/07/13/sports/ncaafootball/13pennstate.html?_r=2&amp;hp\">what Paterno actually did</a>, as opposed to the rhetorical exaggerations of the preening moralists who are presently in competition to see who can feign the most outrage:</p><blockquote><p>Louis J. Freeh, the former federal judge and director of the F.B.I. who spent the last seven months examining the Sandusky scandal at Penn State, issued a damning conclusion Thursday:  The most senior officials at Penn State had shown a “total and consistent disregard” for the welfare of children, had worked together to actively conceal Mr. Sandusky’s assaults, and had done so for one central reason: fear of bad publicity. That publicity, Mr. Freeh said Thursday, would have hurt the nationally ranked football program, Mr. Paterno’s reputation as a coach of high principles, the Penn State “brand” and the university’s ability to raise money as one of the most respected public institutions in the country….</p><p>Mr. Freeh’s investigation makes clear it was Mr. Paterno, long regarded as the single most powerful official at the university, who persuaded the university president and others not to report Mr. Sandusky to the authorities in 2001 after he had violently assaulted another boy in the football showers.</p></blockquote><p>What is new here is that whereas before we knew that Paterno had reported Sandusky’s actions to the correct authorities, now we know that he was the one primarily responsible for matters not going any further.  Whereas before it appeared that his only failing was the excusable moral one of doing no more than his legally defined duty, now we know that he was the main instigator of the coverup.  This is a very different thing, and I note that it is actually considerably worse than anything Paterno’s most vehement critics accused him of doing previously.</p><p>And yes, it does change my opinion to a certain extent.  In light of the latest revelations, I think it would be appropriate for the Penn State football program to receive the death sentence for three or four years from the NCAA.  That would send the most unmistakable message to everyone, and would be the one punishment that Paterno would have felt most deeply.  How Penn State chooses to respond is really no concern of mine, but as a general rule, I don’t favor whitewashing history.  If I were the responsible individual at Penn State, I would not remove Paterno’s name from the various buildings he funded and tear down his statue, but rather seek to use him as an example to teach about the dangers that hubris poses to even the most upstanding and successful.</p><p>All men are fallen.  I still think Paterno was, for the most part, a good man who made a very foolish and counterproductive attempt to protect his reputation and his football program.  Was it wrong?  Certainly.  Did it have evil consequences?  Most likely.  Does it merit a harsh punishment?  Definitely.  But was it indicative of an evil or malevolent intent?  I don’t believe so, and to conflate the moral failings of a Paterno with the overt and predatory evil of a Sandusky is a fundamental mistake.  It is important to remember that this is not simply a Joe Paterno scandal, but rather a <i>Penn State</i> scandal.</p><p>The Freeh report is somewhat ironic in that Louis Freeh would certainly know a coverup when he sees one, given his involvement in similar whitewashes of Ruby Ridge and Waco.</p></div>",
  "content_text": "Adognameop asks about the\nVox, What do you make of the recent FBI report regarding Penn State? It seems to reveal what everybody already knew; that Paterno was an accomplice to child rape. Does it affect your opinion of Paterno?\nFirst, I would note that Paterno’s actions did not, in any way, make him “an accomplice to child rape”.  An an accomplice is a person who is present at the scene of the crime, actively participates in its commission, and has the same degree of guilt as the person he or she is assisting, is subject to prosecution for the same crime, and faces the same criminal penalties.  None of this applies to Paterno.\nSo, let’s take a look at\nwhat Paterno actually did\n, as opposed to the rhetorical exaggerations of the preening moralists who are presently in competition to see who can feign the most outrage:\nLouis J. Freeh, the former federal judge and director of the F.B.I. who spent the last seven months examining the Sandusky scandal at Penn State, issued a damning conclusion Thursday:  The most senior officials at Penn State had shown a “total and consistent disregard” for the welfare of children, had worked together to actively conceal Mr. Sandusky’s assaults, and had done so for one central reason: fear of bad publicity. That publicity, Mr. Freeh said Thursday, would have hurt the nationally ranked football program, Mr. Paterno’s reputation as a coach of high principles, the Penn State “brand” and the university’s ability to raise money as one of the most respected public institutions in the country….\nMr. Freeh’s investigation makes clear it was Mr. Paterno, long regarded as the single most powerful official at the university, who persuaded the university president and others not to report Mr. Sandusky to the authorities in 2001 after he had violently assaulted another boy in the football showers.\nWhat is new here is that whereas before we knew that Paterno had reported Sandusky’s actions to the correct authorities, now we know that he was the one primarily responsible for matters not going any further.  Whereas before it appeared that his only failing was the excusable moral one of doing no more than his legally defined duty, now we know that he was the main instigator of the coverup.  This is a very different thing, and I note that it is actually considerably worse than anything Paterno’s most vehement critics accused him of doing previously.\nAnd yes, it does change my opinion to a certain extent.  In light of the latest revelations, I think it would be appropriate for the Penn State football program to receive the death sentence for three or four years from the NCAA.  That would send the most unmistakable message to everyone, and would be the one punishment that Paterno would have felt most deeply.  How Penn State chooses to respond is really no concern of mine, but as a general rule, I don’t favor whitewashing history.  If I were the responsible individual at Penn State, I would not remove Paterno’s name from the various buildings he funded and tear down his statue, but rather seek to use him as an example to teach about the dangers that hubris poses to even the most upstanding and successful.\nAll men are fallen.  I still think Paterno was, for the most part, a good man who made a very foolish and counterproductive attempt to protect his reputation and his football program.  Was it wrong?  Certainly.  Did it have evil consequences?  Most likely.  Does it merit a harsh punishment?  Definitely.  But was it indicative of an evil or malevolent intent?  I don’t believe so, and to conflate the moral failings of a Paterno with the overt and predatory evil of a Sandusky is a fundamental mistake.  It is important to remember that this is not simply a Joe Paterno scandal, but rather a\nPenn State\nscandal.\nThe Freeh report is somewhat ironic in that Louis Freeh would certainly know a coverup when he sees one, given his involvement in similar whitewashes of Ruby Ridge and Waco.",
  "tags": [
    "mailvox"
  ],
  "categories": [],
  "sitemap_lastmod": "2012-07-13T09:15:00+00:00"
}