{
  "url": "https://voxday.net/2012/07/10/mailvox-hazlitt-international-trade/",
  "scraped_at": "2025-12-14T04:58:38.592189",
  "title": "Mailvox: the Hazlitt international trade challenge III",
  "date_display": "July 10, 2012",
  "date_iso": "2012-07-10T08:41:00+00:00",
  "date_from_url": "2012-07-10",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>In which my critique of Chapter 11 of Henry Hazlitt’s <i>Economics in One Lesson</i> is completed.  It has been just over a year since I wrote the first two parts of it, so if your memory requires refreshing, you may find it helpful to refer to <a href=\"http://www.milobookclub.com/2011/06/14/mailvox-hazlitt-international-trade-2/\">part one</a> and <a href=\"http://www.milobookclub.com/2011/06/18/mailvox-hazlitt-international-trade_18/\">part two</a> of the critique.  In order to make the errors in his argument easier to locate when reading my explications of them, I have taken the liberty of identifiying them with numbers (N) in the text.</p><p>In concluding his chapter on free trade, Hazlitt writes: <i>For the erection of tariff walls has the same effect as the erection of real walls. It is significant that the protectionists habitually use the language of warfare. They talk of “repelling an invasion” of foreign products. And the means they suggest in the fiscal field are like those of the battlefield. The tariff barriers that are put up to repel this invasion are like the tank traps, trenches and barbed-wire entanglements created to repel or slow down attempted invasion by a foreign army.(1)</i></p><p>And just as the foreign army is compelled to employ more expensive means to surmount those obstacles — bigger tanks, mine detectors, engineer corps to cut wires, ford streams and build bridges—so more expensive and efficient transportation means must be developed to surmount tariff obstacles. On the one hand, we try to reduce the cost of transportation between England and America, or Canada and the United States, by developing faster and more efficient planes and ships, better roads and bridges, better locomotives and motor trucks. On the other hand, we offset this investment in efficient transportation by a tariff that makes it commercially even more difficult to transport goods than it was before. We make it a dollar cheaper to ship the sweaters, and then increase the tariff by two dollars to prevent the sweaters from being shipped. By reducing the freight that can be profitably carried, we reduce the value of the investment in transport efficiency.</p><p>The tariff has been described as a means of benefiting the producer at the expense of the consumer. In a sense this is correct. Those who favor it think only of the interests of the producers immediately benefited by the particular duties involved. They forget the interests of the consumers who are immediately injured by being forced to pay these duties. But it is wrong to think of the tariff issue as if it represented a conflict between the interests of producers as a unit against those of consumers as a unit. It is true that the tariff hurts all consumers as such.(2) It is not true that it benefits all producers as such. On the contrary, as we have just seen, it helps the protected producers at the expense of all other American producers, and particularly of those who have a comparatively large potential export market.  We can perhaps make this last point clearer by an exaggerated example. Suppose we make our tariff wall so high that it becomes absolutely prohibitive, and no imports come in from the outside world at all. Suppose, as a result of this, that the price of sweaters in America goes up only $5. Then American consumers, because they have to pay $5 more for a sweater, will spend on the average five cents less in each of a hundred other American industries.(3) (The figures are chosen merely to illustrate a principle: there will, of course, be no such symmetrical distribution of the loss; moreover, the sweater industry itself will doubtless be hurt because of protection of still other industries. But these complications may be put aside for the moment.)</p><p>Now because foreign industries will find their market in America totally cut off, they will get no dollar exchange, and therefore they will be unable to buy any American goods at all.(4) As a result of this, American industries will suffer in direct proportion to the percentage of their sales previously made abroad.(5) Those that will be most injured, in the first instance, will be such industries as raw cotton producers, copper producers, makers of sewing machines, agricultural machinery, typewriters, commercial airplanes, and so on.</p><p>A higher tariff wall, which, however, is not prohibitive, will produce the same kind of results as this, but merely to a smaller degree.</p><p>The effect of a tariff, therefore, is to change the structure of American production. It changes the number of occupations, the kind of occupations, and the relative size of one industry as compared with another. It makes the industries in which we are comparatively inefficient larger, and the industries in which we are comparatively efficient smaller. Its net effect, therefore, is to reduce American efficiency, as well as to reduce efficiency in the countries with which we would otherwise have traded more largely.<br> In the long run, notwithstanding the mountains of argument pro and con, a tariff is irrelevant to the question of employment.(6) (True, sudden changes in the tariff, either upward or downward, can create temporary unemployment, as they force corresponding changes in the structure of production. Such sudden changes can even cause a depression.) But a tariff is not irrelevant to the question of wages. In the long run it always reduces real wages, because it reduces efficiency, production and wealth.(7)<br> Thus all the chief tariff fallacies stem from the central fallacy with which this book is concerned. They are the result of looking only at the immediate effects of a single tariff rate on one group of producers, and forgetting the long-run effects both on consumers as a whole and on all other producers.(8)</br></br></p><p>(I hear some reader asking: “Why not solve this by giving tariff protection to all producers?” But the fallacy here is that this cannot help producers uniformly, and cannot help at all domestic producers who already “outsell” foreign producers: these efficient producers must necessarily suffer from the diversion of purchasing power brought about by the tariff.)</p><p>On the subject of the tariff we must keep in mind one final precaution. It is the same precaution that we found necessary in examining the effects of machinery. It is useless to deny that a tariff does benefit—or at least can benefit—special interests. True, it benefits them at the expense of every one else. But it does benefit them. If one industry alone could get protection, while its owners and workers enjoyed the benefits of free trade in everything else they bought, that industry would benefit, even on net balance. As an attempt is made to extend the tariff blessings, however, even people in the protected industries, both as producers and consumers, begin to suffer from other people’s protection, and may finally be worse off even on net balance than if neither they nor anybody else had protection.(9)</p><p>But we should not deny, as enthusiastic free traders have so often done, the possibility of these tariff benefits to special groups. We should not pretend, for example, that a reduction of the tariff would help everybody and hurt nobody. It is true that its reduction would help the country on net balance. But somebody would be hurt. Groups previously enjoying high protection would be hurt. That in fact is one reason why it is not good to bring such protected interests into existence in the first place. But clarity and candor of thinking compel us to see and acknowledge that some industries are right when they say that a removal of the tariff on their product would throw them out of business and throw their workers (at least temporarily) out of jobs. And if their workers have developed specialized skills, they may even suffer permanently, or until they have at long last learnt equal skills. In tracing the effects of tariffs, as in tracing the effects of machinery, we should endeavor to see all the chief effects, in both the short run and the long run, on all groups.</p><p>As a postscript to this chapter I should add that its argument is not directed against all tariffs, including duties collected mainly for revenue, or to keep alive industries needed for war; nor is it directed against all arguments for tariffs. It is merely directed against the fallacy that a tariff on net balance “provides employment,” “raises wages,” or “protects the American standard of living.” It does none of these things; and so far as wages and the standard of living are concerned, it does the precise opposite.(10) But an examination of duties imposed for other purposes would carry us beyond our present subject.  Nor need we here examine the effect of import quotas, exchange controls, bilateralism and other means of reducing, diverting or preventing international trade. Such devices have, in general, the same effects as high or prohibitive tariffs, and often worse effects. They present more complicated issues, but their net results can be traced through the same kind of reasoning that we have just applied to tariff barriers.</p><p>In this third section of the chapter, Hazlitt commits ten errors while offering the observant reader a foreshadowing of anti-free trade arguments to come.  Indeed, in his careless failure to think through some of his own statements, he very nearly lays the groundwork for some of the more effective modern arguments against free trade.</p><p>1.  Hazlitt fails to realize that the reason for the habitual use of the language of warfare by protectionists is because free trade in its labor and services aspect is a literal form of invasion.  The Mexican invasion of the United States is ten times larger in scope than Operation Barbarossa, and especially in a quasi-democracy where voting rights are quickly and readily granted, a free trade-led invasion and occupation will lead to the political subjugation of the invaded that will last longer and can be more oppressive than an actual military occupation.  Most of the 3.9 million Axis soldiers who invaded the Soviet Union in 1941 never fired a shot and the only substantive difference between a military invasion and a labor invasion is the failure to react by the government of the invaded nation.  Support for this statement can be seen in the way defenders of immigration claim these peaceful immigrants will not leave the invaded nation without the use of lethal state-sanctioned violence.</p><p>2. Hazlitt correctly notes that it is wrong to consider the effects of a tariff from a crude perspective that lumps all producers and consumers into separate units of competing interests.  But he is manifestly wrong to claim that tariffs harm all consumers, because consumers are also workers and the small cost of the tariff to the consumer-worker is more than mitigated by its benefit to him.  The root of his error here is revealed in a subsequent error.</p><p>3.  Here Hazlitt ironically forgets that as a champion of free trade, he cannot assume an increased <s>tariff</s>price of $5 on sweaters means five cents less spent on 100 other American products.  Since imports previously represented 17.3 percent of GDP, the increased $5 <s>tariff</s>price actually means about <i>4.14</i> cents less spent on other American products.  Since he also leaves debt and savings out of the equation, it is entirely possible that the imposition of a ban on imports will not shift the domestic consumption pattern in the way he envisions.  And finally, he also ignores the law of supply and demand, which suggests that the increased price will reduce the demand for sweaters, thereby indicating no net effect on other American goods at all.</p><p>4.  This is a massive and major blunder.  Perhaps it is not Hazlitt’s fault that he didn’t understand the global reserve currency effect at the time he was writing his book in 1946, (although as an advocate of the gold standard, he should have at least been aware of the obvious implications), but that doesn’t change the fact that his conclusion is simply false.  Barring retaliatory protectionist measures that actually ban the purchase of American goods, it is absolutely ludicrous to claim that foreigners will be unable to purchase American goods due to a lack of dollar exchange.  Forget the trillions in Eurodollars already floating around outside US borders and the hundreds of trillions in derivatives, the creative magnitude of various financial devices means that foreign markets will always be able to acquire American goods even they cannot trade in dollars.  This also erroneously assumes that American manufacturers would not accept foreign currencies or debt instruments in exchange for their goods.  And if we take the Eurodollars into account, they are the largest source of global finance, accounting for more than 90 percent of international loans according to Wikipedia.</p><p>5.  Hazlitt’s fifth error in this section follows directly from his fourth.  Since American industries will not necessarily suffer at all, they obviously will not suffer in direct proportion to the percentage of their sales previously made abroad.</p><p>6.  This is a brutal mistake.  It is simply laughable, to assert as nakedly as Hazlitt does, that “a tariff is irrelevant to the question of employment”.  History has clearly demonstrated is that the effects on employment are not merely temporary ones that result from sudden changes in the tariff, and indeed, the negative long-term effects of free trade on employment has become one of the primary economic arguments for protectionism.  Both the logic and the empirical evidence weigh heavily against Hazlitt here.</p><p>7.  Hazlitt errs when he states that tariffs always reduces real wages because they reduces efficiency, production and wealth.  Even if we accept his statements about reducing efficiency, production, and wealth at face value, we have repeatedly seen that it is freer trade, not tariffs, that reduces real wages, because the first-order reduction in the demand for domestic labor outweighs the proposed second-order effects of reductions in efficiency, production, and wealth.  It was inexcusable for Hazlitt to miss this, <i>since the shift of production to lower-wage countries is one of the core mechanisms of free trade</i> and is one of the primary causes of capital movement.</p><p>8.  This is such a monstrously hypocritical statement that it amazes me Hazlitt could have made it.  To accuse the advocates of <i>tariffs</i> of “forgetting the long-run effects both on consumers as a whole and on all other producers” might be apt when considering centuries-old arguments against free trade, but simply cannot be reasonably applied in any way to modern critics, whose arguments are very broad-based and primarily focused on the <i>harm</i> to producers brought about be free trade.  As those who have followed this ongoing discourse will recognize, it is the protectionists who are looking at the societal effects and the free traders who are not only ignoring them, but openly stating their indifference to them.</p><p>9.  Hazlitt extends his flawed arguments into the realm of fiction by proposing a fictional scenario where the second- and third-order costs of protectionism outweigh the first-order benefits of having one’s industry protected.  It’s not entirely absurd, however, as one can envision the inutility of having a profitable business in a protected market that has grown technologically stagnant.  However, in doing so, he neatly anticipates, in reverse, the modern protectionist argument, which points out that the benefits to corporations of sending their capital and labor abroad come at a severe cost to the society in which the shareholders in that corporation have to live, potentially so severe that it will outweigh their greater profits.</p><p>10.  Hazlitt not only fails to provide any support for his claim that tariffs do not provide employment, raise wages or protect the American standard of living, his claim is demonstrably false in economic, logical and empirical terms.  His argument is outdated, is based primarily on naked assertions, and is undermined by more than sixty years of historical evidence directly contradicting the lofty promises of the free trade doctrine he champions here.</p><p>Thus concludes my critique of Hazlitt’s argument for free trade, which identifies 23 specific errors in his argument, all of which will have to be defended by the true believers in free trade doctrine without resort to irrelevant tangents such as Mr. North’s uneconomic “guns and badges” defense before it can be appealed to again.  Next up: Mises and his defense of free trade as presented in <i>Liberalism</i>.</p></div>",
  "content_text": "In which my critique of Chapter 11 of Henry Hazlitt’s\nEconomics in One Lesson\nis completed.  It has been just over a year since I wrote the first two parts of it, so if your memory requires refreshing, you may find it helpful to refer to\npart one\nand\npart two\nof the critique.  In order to make the errors in his argument easier to locate when reading my explications of them, I have taken the liberty of identifiying them with numbers (N) in the text.\nIn concluding his chapter on free trade, Hazlitt writes:\nFor the erection of tariff walls has the same effect as the erection of real walls. It is significant that the protectionists habitually use the language of warfare. They talk of “repelling an invasion” of foreign products. And the means they suggest in the fiscal field are like those of the battlefield. The tariff barriers that are put up to repel this invasion are like the tank traps, trenches and barbed-wire entanglements created to repel or slow down attempted invasion by a foreign army.(1)\nAnd just as the foreign army is compelled to employ more expensive means to surmount those obstacles — bigger tanks, mine detectors, engineer corps to cut wires, ford streams and build bridges—so more expensive and efficient transportation means must be developed to surmount tariff obstacles. On the one hand, we try to reduce the cost of transportation between England and America, or Canada and the United States, by developing faster and more efficient planes and ships, better roads and bridges, better locomotives and motor trucks. On the other hand, we offset this investment in efficient transportation by a tariff that makes it commercially even more difficult to transport goods than it was before. We make it a dollar cheaper to ship the sweaters, and then increase the tariff by two dollars to prevent the sweaters from being shipped. By reducing the freight that can be profitably carried, we reduce the value of the investment in transport efficiency.\nThe tariff has been described as a means of benefiting the producer at the expense of the consumer. In a sense this is correct. Those who favor it think only of the interests of the producers immediately benefited by the particular duties involved. They forget the interests of the consumers who are immediately injured by being forced to pay these duties. But it is wrong to think of the tariff issue as if it represented a conflict between the interests of producers as a unit against those of consumers as a unit. It is true that the tariff hurts all consumers as such.(2) It is not true that it benefits all producers as such. On the contrary, as we have just seen, it helps the protected producers at the expense of all other American producers, and particularly of those who have a comparatively large potential export market.  We can perhaps make this last point clearer by an exaggerated example. Suppose we make our tariff wall so high that it becomes absolutely prohibitive, and no imports come in from the outside world at all. Suppose, as a result of this, that the price of sweaters in America goes up only $5. Then American consumers, because they have to pay $5 more for a sweater, will spend on the average five cents less in each of a hundred other American industries.(3) (The figures are chosen merely to illustrate a principle: there will, of course, be no such symmetrical distribution of the loss; moreover, the sweater industry itself will doubtless be hurt because of protection of still other industries. But these complications may be put aside for the moment.)\nNow because foreign industries will find their market in America totally cut off, they will get no dollar exchange, and therefore they will be unable to buy any American goods at all.(4) As a result of this, American industries will suffer in direct proportion to the percentage of their sales previously made abroad.(5) Those that will be most injured, in the first instance, will be such industries as raw cotton producers, copper producers, makers of sewing machines, agricultural machinery, typewriters, commercial airplanes, and so on.\nA higher tariff wall, which, however, is not prohibitive, will produce the same kind of results as this, but merely to a smaller degree.\nThe effect of a tariff, therefore, is to change the structure of American production. It changes the number of occupations, the kind of occupations, and the relative size of one industry as compared with another. It makes the industries in which we are comparatively inefficient larger, and the industries in which we are comparatively efficient smaller. Its net effect, therefore, is to reduce American efficiency, as well as to reduce efficiency in the countries with which we would otherwise have traded more largely.\nIn the long run, notwithstanding the mountains of argument pro and con, a tariff is irrelevant to the question of employment.(6) (True, sudden changes in the tariff, either upward or downward, can create temporary unemployment, as they force corresponding changes in the structure of production. Such sudden changes can even cause a depression.) But a tariff is not irrelevant to the question of wages. In the long run it always reduces real wages, because it reduces efficiency, production and wealth.(7)\nThus all the chief tariff fallacies stem from the central fallacy with which this book is concerned. They are the result of looking only at the immediate effects of a single tariff rate on one group of producers, and forgetting the long-run effects both on consumers as a whole and on all other producers.(8)\n(I hear some reader asking: “Why not solve this by giving tariff protection to all producers?” But the fallacy here is that this cannot help producers uniformly, and cannot help at all domestic producers who already “outsell” foreign producers: these efficient producers must necessarily suffer from the diversion of purchasing power brought about by the tariff.)\nOn the subject of the tariff we must keep in mind one final precaution. It is the same precaution that we found necessary in examining the effects of machinery. It is useless to deny that a tariff does benefit—or at least can benefit—special interests. True, it benefits them at the expense of every one else. But it does benefit them. If one industry alone could get protection, while its owners and workers enjoyed the benefits of free trade in everything else they bought, that industry would benefit, even on net balance. As an attempt is made to extend the tariff blessings, however, even people in the protected industries, both as producers and consumers, begin to suffer from other people’s protection, and may finally be worse off even on net balance than if neither they nor anybody else had protection.(9)\nBut we should not deny, as enthusiastic free traders have so often done, the possibility of these tariff benefits to special groups. We should not pretend, for example, that a reduction of the tariff would help everybody and hurt nobody. It is true that its reduction would help the country on net balance. But somebody would be hurt. Groups previously enjoying high protection would be hurt. That in fact is one reason why it is not good to bring such protected interests into existence in the first place. But clarity and candor of thinking compel us to see and acknowledge that some industries are right when they say that a removal of the tariff on their product would throw them out of business and throw their workers (at least temporarily) out of jobs. And if their workers have developed specialized skills, they may even suffer permanently, or until they have at long last learnt equal skills. In tracing the effects of tariffs, as in tracing the effects of machinery, we should endeavor to see all the chief effects, in both the short run and the long run, on all groups.\nAs a postscript to this chapter I should add that its argument is not directed against all tariffs, including duties collected mainly for revenue, or to keep alive industries needed for war; nor is it directed against all arguments for tariffs. It is merely directed against the fallacy that a tariff on net balance “provides employment,” “raises wages,” or “protects the American standard of living.” It does none of these things; and so far as wages and the standard of living are concerned, it does the precise opposite.(10) But an examination of duties imposed for other purposes would carry us beyond our present subject.  Nor need we here examine the effect of import quotas, exchange controls, bilateralism and other means of reducing, diverting or preventing international trade. Such devices have, in general, the same effects as high or prohibitive tariffs, and often worse effects. They present more complicated issues, but their net results can be traced through the same kind of reasoning that we have just applied to tariff barriers.\nIn this third section of the chapter, Hazlitt commits ten errors while offering the observant reader a foreshadowing of anti-free trade arguments to come.  Indeed, in his careless failure to think through some of his own statements, he very nearly lays the groundwork for some of the more effective modern arguments against free trade.\n1.  Hazlitt fails to realize that the reason for the habitual use of the language of warfare by protectionists is because free trade in its labor and services aspect is a literal form of invasion.  The Mexican invasion of the United States is ten times larger in scope than Operation Barbarossa, and especially in a quasi-democracy where voting rights are quickly and readily granted, a free trade-led invasion and occupation will lead to the political subjugation of the invaded that will last longer and can be more oppressive than an actual military occupation.  Most of the 3.9 million Axis soldiers who invaded the Soviet Union in 1941 never fired a shot and the only substantive difference between a military invasion and a labor invasion is the failure to react by the government of the invaded nation.  Support for this statement can be seen in the way defenders of immigration claim these peaceful immigrants will not leave the invaded nation without the use of lethal state-sanctioned violence.\n2. Hazlitt correctly notes that it is wrong to consider the effects of a tariff from a crude perspective that lumps all producers and consumers into separate units of competing interests.  But he is manifestly wrong to claim that tariffs harm all consumers, because consumers are also workers and the small cost of the tariff to the consumer-worker is more than mitigated by its benefit to him.  The root of his error here is revealed in a subsequent error.\n3.  Here Hazlitt ironically forgets that as a champion of free trade, he cannot assume an increased\ntariff\nprice of $5 on sweaters means five cents less spent on 100 other American products.  Since imports previously represented 17.3 percent of GDP, the increased $5\ntariff\nprice actually means about\n4.14\ncents less spent on other American products.  Since he also leaves debt and savings out of the equation, it is entirely possible that the imposition of a ban on imports will not shift the domestic consumption pattern in the way he envisions.  And finally, he also ignores the law of supply and demand, which suggests that the increased price will reduce the demand for sweaters, thereby indicating no net effect on other American goods at all.\n4.  This is a massive and major blunder.  Perhaps it is not Hazlitt’s fault that he didn’t understand the global reserve currency effect at the time he was writing his book in 1946, (although as an advocate of the gold standard, he should have at least been aware of the obvious implications), but that doesn’t change the fact that his conclusion is simply false.  Barring retaliatory protectionist measures that actually ban the purchase of American goods, it is absolutely ludicrous to claim that foreigners will be unable to purchase American goods due to a lack of dollar exchange.  Forget the trillions in Eurodollars already floating around outside US borders and the hundreds of trillions in derivatives, the creative magnitude of various financial devices means that foreign markets will always be able to acquire American goods even they cannot trade in dollars.  This also erroneously assumes that American manufacturers would not accept foreign currencies or debt instruments in exchange for their goods.  And if we take the Eurodollars into account, they are the largest source of global finance, accounting for more than 90 percent of international loans according to Wikipedia.\n5.  Hazlitt’s fifth error in this section follows directly from his fourth.  Since American industries will not necessarily suffer at all, they obviously will not suffer in direct proportion to the percentage of their sales previously made abroad.\n6.  This is a brutal mistake.  It is simply laughable, to assert as nakedly as Hazlitt does, that “a tariff is irrelevant to the question of employment”.  History has clearly demonstrated is that the effects on employment are not merely temporary ones that result from sudden changes in the tariff, and indeed, the negative long-term effects of free trade on employment has become one of the primary economic arguments for protectionism.  Both the logic and the empirical evidence weigh heavily against Hazlitt here.\n7.  Hazlitt errs when he states that tariffs always reduces real wages because they reduces efficiency, production and wealth.  Even if we accept his statements about reducing efficiency, production, and wealth at face value, we have repeatedly seen that it is freer trade, not tariffs, that reduces real wages, because the first-order reduction in the demand for domestic labor outweighs the proposed second-order effects of reductions in efficiency, production, and wealth.  It was inexcusable for Hazlitt to miss this,\nsince the shift of production to lower-wage countries is one of the core mechanisms of free trade\nand is one of the primary causes of capital movement.\n8.  This is such a monstrously hypocritical statement that it amazes me Hazlitt could have made it.  To accuse the advocates of\ntariffs\nof “forgetting the long-run effects both on consumers as a whole and on all other producers” might be apt when considering centuries-old arguments against free trade, but simply cannot be reasonably applied in any way to modern critics, whose arguments are very broad-based and primarily focused on the\nharm\nto producers brought about be free trade.  As those who have followed this ongoing discourse will recognize, it is the protectionists who are looking at the societal effects and the free traders who are not only ignoring them, but openly stating their indifference to them.\n9.  Hazlitt extends his flawed arguments into the realm of fiction by proposing a fictional scenario where the second- and third-order costs of protectionism outweigh the first-order benefits of having one’s industry protected.  It’s not entirely absurd, however, as one can envision the inutility of having a profitable business in a protected market that has grown technologically stagnant.  However, in doing so, he neatly anticipates, in reverse, the modern protectionist argument, which points out that the benefits to corporations of sending their capital and labor abroad come at a severe cost to the society in which the shareholders in that corporation have to live, potentially so severe that it will outweigh their greater profits.\n10.  Hazlitt not only fails to provide any support for his claim that tariffs do not provide employment, raise wages or protect the American standard of living, his claim is demonstrably false in economic, logical and empirical terms.  His argument is outdated, is based primarily on naked assertions, and is undermined by more than sixty years of historical evidence directly contradicting the lofty promises of the free trade doctrine he champions here.\nThus concludes my critique of Hazlitt’s argument for free trade, which identifies 23 specific errors in his argument, all of which will have to be defended by the true believers in free trade doctrine without resort to irrelevant tangents such as Mr. North’s uneconomic “guns and badges” defense before it can be appealed to again.  Next up: Mises and his defense of free trade as presented in\nLiberalism\n.",
  "tags": [
    "economics",
    "free trade"
  ],
  "categories": [],
  "sitemap_lastmod": "2012-07-10T07:41:00+00:00"
}