{
  "url": "https://voxday.net/2012/07/15/mailvox-best-defense/",
  "scraped_at": "2025-12-14T04:59:02.934070",
  "title": "Mailvox: the best defense",
  "date_display": "July 15, 2012",
  "date_iso": "2012-07-15T07:39:00+00:00",
  "date_from_url": "2012-07-15",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>In which the self-appointed champion of free trade doctrine, Unger, demonstrates that he literally does not know what he is defending:</p><blockquote><p>Free trade does not require the free movement of labor, dumbass. If I buy a hamburger, I don’t have to move in with the cook, or vice versa. Maybe it works differently on Planet Stupid, where the Superintelligent natives can’t so much as buy a stick of gum without inviting comparisons to U-haul-driving lesbians; here on Earth, it thankfully ain’t so.</p></blockquote><p>Free trade most certainly does require the free movement of labor.  This is self-evident because it does so by its very definition.  An immigration limitation is, quite obviously, a restraint on trade every bit as restrictive as a tariff or a control on capital.  Unger here demonstrates that he knows absolutely nothing about the doctrine he is so dogmatically and so ineptly defending.  I don’t mind being called childish names by such an interlocutor, indeed, I would be more concerned if anyone so intellectually hapless claimed to follow my reasoning, let alone agree with it.</p><p>Contra his illogical and incorrect insistence that free trade does not require open immigration, I cite Ludwig von Mises in <a href=\"http://mises.org/liberal/ch3sec7.asp\">Liberalism</a>: <i>“Under a system of completely free trade, capital and labor would be employed wherever conditions are most favorable for production….  Capital and labor tend to move from areas where conditions are less favorable for production to those in which they are more favorable.  But the migration of capital and labor presupposes not only complete freedom of trade, but also the complete absence of obstacles to their movement from one country to another.”</i></p><p>Once more, we see that the defenders of free trade aren’t merely anti-American, they are either ignorant of their own doctrine or astonishingly intellectually dishonest.  And it is beyond irony to see a free trader present an appeal to how things work on Earth in the real world.</p></div>",
  "content_text": "In which the self-appointed champion of free trade doctrine, Unger, demonstrates that he literally does not know what he is defending:\nFree trade does not require the free movement of labor, dumbass. If I buy a hamburger, I don’t have to move in with the cook, or vice versa. Maybe it works differently on Planet Stupid, where the Superintelligent natives can’t so much as buy a stick of gum without inviting comparisons to U-haul-driving lesbians; here on Earth, it thankfully ain’t so.\nFree trade most certainly does require the free movement of labor.  This is self-evident because it does so by its very definition.  An immigration limitation is, quite obviously, a restraint on trade every bit as restrictive as a tariff or a control on capital.  Unger here demonstrates that he knows absolutely nothing about the doctrine he is so dogmatically and so ineptly defending.  I don’t mind being called childish names by such an interlocutor, indeed, I would be more concerned if anyone so intellectually hapless claimed to follow my reasoning, let alone agree with it.\nContra his illogical and incorrect insistence that free trade does not require open immigration, I cite Ludwig von Mises in\nLiberalism\n:\n“Under a system of completely free trade, capital and labor would be employed wherever conditions are most favorable for production….  Capital and labor tend to move from areas where conditions are less favorable for production to those in which they are more favorable.  But the migration of capital and labor presupposes not only complete freedom of trade, but also the complete absence of obstacles to their movement from one country to another.”\nOnce more, we see that the defenders of free trade aren’t merely anti-American, they are either ignorant of their own doctrine or astonishingly intellectually dishonest.  And it is beyond irony to see a free trader present an appeal to how things work on Earth in the real world.",
  "tags": [
    "free trade",
    "mailvox"
  ],
  "categories": [],
  "sitemap_lastmod": "2012-07-15T06:39:00+00:00"
}