{
  "url": "https://voxday.net/2012/07/17/mailvox-improving-rgd/",
  "scraped_at": "2025-12-14T04:59:13.912033",
  "title": "Mailvox: improving RGD",
  "date_display": "July 17, 2012",
  "date_iso": "2012-07-17T09:26:00+00:00",
  "date_from_url": "2012-07-17",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>PR has a suggestion or two:</p><blockquote><p>I just got done with Return of the Great Depression.  Great read.  Thanks for the Nook version.  I thought you did a pretty good job of dumbing things down enough that I could make sense of what you were saying, but you managed to do it in a way that it didn’t seem like you were talking down to me at all.  I really appreciated that dictionary since I was reading it in a location where I didn’t have web access and therefore couldn’t use any outside references to help me out.</p><p>If you care for any criticism on it, here’s my effort:</p><p>1.  You made me laugh about the apocalypse scenario.  But I would’ve also appreciated a little more of an explanation as to why you think it’s not likely at all.  Something a little more than telling me that no serious economists take that scenario seriously.  So what!  I want(ed) to know why YOU think it’s unlikely.</p><p>2.  I would suggest maybe even a little bit more of a dictionary at the end.  I’ll show a little bit of my ignorance here and confess that I wasn’t really sure what a “sub-prime” loan was and why it was a crisis.  I did figure it out.  But I started off thinking that “sub-prime” meant something like “below the ‘prime’ interest rate”.  That sounds like some loan that would be given to only the best risks.  I am certainly more knowledgeable now that I realize it’s quite the opposite.  But a quick dictionary note would’ve helped me.</p><p>Anyway, I’m not even sure you care about feedback like this.  But I thought it only right that since you gave me such a bargain, that I would give you my best critique.  I’m looking forward to your next economics book.</p></blockquote><p>In answer to (1), my reasoning is that despite the expectations of those anticipating the Eschaton, it never arrives.  Societies seldom perish in blood and fire except at the hands of an implacable and merciless enemy; the fact that it is hard to think of many such societies besides some of the Slavic ones overrun by the Mongol hordes and the Carthaginian society wiped out by Rome is an indicator that when the global economy collapses, it will reduce living standards without ending civilization.</p><p>I’ve been reading <i>Vanished Kingdoms</i>, by Norman Davies, and one of the things that becomes eminently clear is that for the most part, societies are absorbed and replaced by larger societies that overwhelm them, either by invasion, immigration, or political amalgamation.  So, America is much more likely to either devolve into a Brazilian-style second world country or break apart into a Europe of sovereign American states than to shatter into some sort of post-apocalyptic chaos out of Robert Adams or Walter Miller.  Even a hypothetical Round 2 isn’t likely to be particularly apocalyptic, although it would certainly be interesting to see the South rise again once Aztlan separatism draws the primary focus of the American Unionists.</p><p>The big thing that is missing from the scenarios drawn up by those prophesying apocalypse is the Aztlan factor.  Most people are thinking in Red/Blue, urban/rural, black/white terms, but possibly the most important question is whether the Hispanics simply return to Mexico once the flow of benefits end or if they stay to carve out their own state.  I would tend to assume the latter, but no one actually knows.</p><p>I digress.  In response to number two, if I do an updated RGD, I will certainly consider expanding the appendix to include the various non-economic terms that may be unfamiliar to some readers.  It’s a good idea that simply had never occurred to me.</p><p>I should point out that although I’m not currently planning to write the economics book that melds Keensian Post-Keynesian economics with modified Austrian theory that some suggested yesterday, I do plan to begin working on an economics-related project after I finish the current novel in October.</p></div>",
  "content_text": "PR has a suggestion or two:\nI just got done with Return of the Great Depression.  Great read.  Thanks for the Nook version.  I thought you did a pretty good job of dumbing things down enough that I could make sense of what you were saying, but you managed to do it in a way that it didn’t seem like you were talking down to me at all.  I really appreciated that dictionary since I was reading it in a location where I didn’t have web access and therefore couldn’t use any outside references to help me out.\nIf you care for any criticism on it, here’s my effort:\n1.  You made me laugh about the apocalypse scenario.  But I would’ve also appreciated a little more of an explanation as to why you think it’s not likely at all.  Something a little more than telling me that no serious economists take that scenario seriously.  So what!  I want(ed) to know why YOU think it’s unlikely.\n2.  I would suggest maybe even a little bit more of a dictionary at the end.  I’ll show a little bit of my ignorance here and confess that I wasn’t really sure what a “sub-prime” loan was and why it was a crisis.  I did figure it out.  But I started off thinking that “sub-prime” meant something like “below the ‘prime’ interest rate”.  That sounds like some loan that would be given to only the best risks.  I am certainly more knowledgeable now that I realize it’s quite the opposite.  But a quick dictionary note would’ve helped me.\nAnyway, I’m not even sure you care about feedback like this.  But I thought it only right that since you gave me such a bargain, that I would give you my best critique.  I’m looking forward to your next economics book.\nIn answer to (1), my reasoning is that despite the expectations of those anticipating the Eschaton, it never arrives.  Societies seldom perish in blood and fire except at the hands of an implacable and merciless enemy; the fact that it is hard to think of many such societies besides some of the Slavic ones overrun by the Mongol hordes and the Carthaginian society wiped out by Rome is an indicator that when the global economy collapses, it will reduce living standards without ending civilization.\nI’ve been reading\nVanished Kingdoms\n, by Norman Davies, and one of the things that becomes eminently clear is that for the most part, societies are absorbed and replaced by larger societies that overwhelm them, either by invasion, immigration, or political amalgamation.  So, America is much more likely to either devolve into a Brazilian-style second world country or break apart into a Europe of sovereign American states than to shatter into some sort of post-apocalyptic chaos out of Robert Adams or Walter Miller.  Even a hypothetical Round 2 isn’t likely to be particularly apocalyptic, although it would certainly be interesting to see the South rise again once Aztlan separatism draws the primary focus of the American Unionists.\nThe big thing that is missing from the scenarios drawn up by those prophesying apocalypse is the Aztlan factor.  Most people are thinking in Red/Blue, urban/rural, black/white terms, but possibly the most important question is whether the Hispanics simply return to Mexico once the flow of benefits end or if they stay to carve out their own state.  I would tend to assume the latter, but no one actually knows.\nI digress.  In response to number two, if I do an updated RGD, I will certainly consider expanding the appendix to include the various non-economic terms that may be unfamiliar to some readers.  It’s a good idea that simply had never occurred to me.\nI should point out that although I’m not currently planning to write the economics book that melds Keensian Post-Keynesian economics with modified Austrian theory that some suggested yesterday, I do plan to begin working on an economics-related project after I finish the current novel in October.",
  "tags": [
    "books",
    "mailvox"
  ],
  "categories": [],
  "sitemap_lastmod": "2012-07-17T08:26:00+00:00"
}