{
  "url": "https://voxday.net/2012/07/20/mailvox-correction-on-hazli/",
  "scraped_at": "2025-12-14T04:59:24.637631",
  "title": "Mailvox: a correction on Hazlitt",
  "date_display": "July 20, 2012",
  "date_iso": "2012-07-20T08:38:00+00:00",
  "date_from_url": "2012-07-20",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>I finally banned the highly unpleasant Unger a few days ago, after first forcing him to back up his claim about my supposed errors on the subject of free trade, then examining those claims and determining them to be almost entirely false.  I don’t mind being criticized in the slightest, but the mistakes have to be genuine and the corrections not only correct, but substantive, otherwise the criticism is actually worse than worthless because it reduces the amount of attention that can be paid to more significant matters.</p><p>I value substantive criticism, which is why I am willing to tolerate highly critical jerks so long as their criticism is dialectical and correct, or at least reasonably founded.  On the other hand, I’m not the least bit interested in rhetorical critics or permitting dogmatic ideologues to litter the comments with their emotional incontinence here on a regular basis.</p><p>That being said, Unger did point out one legitimate mistake when I wrote “Here Hazlitt ironically forgets that as a champion of free trade, he cannot assume an increased tariff of $5 on sweaters means five cents less spent on 100 other American products.”  I should have written “an increased <i>price</i> of $5 on sweaters”.  Of course, he promptly revealed his customary intellectual dishonesty by making the ludicrous claim that this mistake not only rendered Hazlitt’s original point correct – it did not – but somehow invalidated everything I had written about the flaws in Hazlitt’s chapter on free trade.</p><blockquote><p>In which I demonstrate a gross misreading and consequent misrepresentation of Hazlitt, which you’ve ignored for the better part of a week now, because I’m unarguably right and the point is critical enough to where the whole essay now needs to be scrapped.</p><p><i>The essay was more crap, and proof that Vox is singularly incapable of understanding an argument. I haven’t the time to go point by point, but Vox’s reasoning, or lack thereof, with regard to point 3, is typical of the piece, and since most of the other points depend in one way or another on the validity of that point’s reasoning, it make an excellent target. And since Vox didn’t even bother reading what Hazlitt actually said, it makes a very easy target.</i></p><p>First, Hazlitt said nothing about a $5 tariff on anything at all, least of all sweaters. Hazlitt wrote – emphasis added for the benefit of the semiliterate: <b>“We can perhaps make this last point clearer by an exaggerated example. Suppose we make our tariff wall so high that it becomes absolutely prohibitive, and no imports come in from the outside world at all. Suppose, as a result of this, that the price of sweaters in America goes up only $5.”</b></p><p>Just to make absolutely sure that there’s no excuse for anyone to misunderstand what Hazlitt wrote – not that there was any excuse before, and not that it will stop some of you publik-skuled clowns from continuing to misunderstand: Hazlitt presents an hypothetical example of America isolating itself from the world. It once traded; henceforth it will not import anything. The country is not imposing a $5 tariff on sweaters or any other doodads. The actual tariff amount is left unspecified. It could be ten gazillion dollars per item for all anyone cares. The point is that it is prohibitive and completely effective. And the $5 figure Hazlitt gives is something else entirely – namely, the effect of this prohibition is to raise the price of sweaters $5.</p><p>Now you should see, immediately, that historical data like ‘imports presently represent 17.3 percent of GDP’ are irrelevant. If you do not, you’re a walking argument for eugenics, and I address myself solely to your intellectual betters. Under Hazlitt’s hypothetical example, imports represent precisely 0% of GDP, along with 0% of every other possible economic metric, and, while I don’t want to spoil anyone’s fun with any complicated math shit, I have to say that this likely has something to do with them not existing.</p><p>Shit. I said I was going to limit myself to (point) 3, but I can’t help but poke some fun at (point) 6, too. Yes, tariffs and the lack thereof are totally irrelevant to the question of employment. Barring legal restrictions, former steel workers can flip burgers, do laundry, or even sell their affectionate manly embraces for coin, and whether they will do any of those things or hold out for other employment has nothing whatsoever to do with trade theory. Any evidence purporting to show a link between trade policy and long-term unemployment is nonsensical, for the same reason any evidence purporting to show a link between trade policy and Martian ice cap expansion is nonsensical: the causes are elsewhere.</p></blockquote><p>First, let me admit to my misreading.  Unger was correct to point out that Hazlitt does not, as I had said, postulate the imposition of a $5 tariff on imported sweaters, but rather a complete ban on imports that has the effect of raising the prices of domestic sweaters by $5.  So far, so good.  Mea culpa.</p><p>However, Unger is completely wrong to claim that this mistake invalidated, or even altered in the slightest, my correction of Hazlitt and that this additional $5 now spent on sweaters means that 100 other domestic producers are not robbed of 5 cents each, but rather 4.14 cents apiece.  His claim about the irrelevance of previous imports is not only incorrect, but underlines how his ability to reason is demonstrably lower than that of those he asserted were “a walking argument for eugenics”.</p><p>Unger himself admits that the tariff wall did not previously exist, but is a change from the previous situation.  He writes of the nation-state: “It once traded; henceforth it will not import anything.”  This means that of the additional $5 now being spent on the sweaters due to the unspecified tariff wall, 17.3 percent of it was previously being spent abroad, <i>just as stated in the case of the erroneous $5 sweater tariff</i>.  The 100 other domestic producers cannot be losing the entire $5 amount to the sweater manufacturers because they were only receiving a maximum of the $4.14 cents that was being spent domestically anyway.</p><p>So, despite the misreading, my correction of Hazlitt stands.  Moreoever, it should be readily apparent that because the erroneous substitution of a specific $5 tariff for an unspecified tariff wall with a $5 effect didn’t alter the correctness of my critique on that point, it is not critical enough to require the scrapping of the other 22 identifications of Hazlitt’s errors.  This is little more than wishful thinking and blatant dishonesty on Unger’s part.</p><p>While I genuinely value honest criticism, this sort of exaggerated rhetoric is simply ridiculous, adds nothing to the debate, and in fact detracts significantly from it by wasting time on nonexistent and insubstantial matters rather than genuine ones.  It would have been perfectly reasonable to simply point out the misreading without attempting to use the mistake as a foundation upon which to build a fictitious case in defense of Hazlitt.  Some mistakes are critical, others are not, and the honest critic will always be careful to distinguish between the two.  Note that I did not claim that Hazlitt’s 86-cent error in any way invalidated his entire case for free trade, it merely happened to be a minor mistake which tends to illustrate the careless and outdated nature of his reasoning.</p><p>UPDATE: Just to underline Unger’s unusual combination of ineptitude and dishonesty, he popped up here to complain about how I initially omitted the part now seen above in italics.</p><p><i>“How nice of you to ‘selectively quote’ (read: lie about) what I wrote. You left out a paragraph, which explained what Hazlitt said and why he was right.  I said a few days ago that you weren’t a fraud, but it looks like I was wrong.”</i></p><p>Of course, I omitted it because it was irrelevant, neither helping his case nor hindering mine.  In fact, I probably should have left it in, since “most of the other points depend in one way or another on the validity of that point’s reasoning” is obviously a false assertion.  This sort of thing is precisely why I ban incompetent but energetic critics like Unger; it doesn’t matter how many times you show them to be wrong, they will just keep swinging wildly and ineffectively at you.  Leaving out irrelevant elements of an argument is selectively quoting, but it is most certainly not lying about anything.  Selective quoting can be dishonest but it is not, in itself, an indication of dishonesty by the person quoting.</p></div>",
  "content_text": "I finally banned the highly unpleasant Unger a few days ago, after first forcing him to back up his claim about my supposed errors on the subject of free trade, then examining those claims and determining them to be almost entirely false.  I don’t mind being criticized in the slightest, but the mistakes have to be genuine and the corrections not only correct, but substantive, otherwise the criticism is actually worse than worthless because it reduces the amount of attention that can be paid to more significant matters.\nI value substantive criticism, which is why I am willing to tolerate highly critical jerks so long as their criticism is dialectical and correct, or at least reasonably founded.  On the other hand, I’m not the least bit interested in rhetorical critics or permitting dogmatic ideologues to litter the comments with their emotional incontinence here on a regular basis.\nThat being said, Unger did point out one legitimate mistake when I wrote “Here Hazlitt ironically forgets that as a champion of free trade, he cannot assume an increased tariff of $5 on sweaters means five cents less spent on 100 other American products.”  I should have written “an increased\nprice\nof $5 on sweaters”.  Of course, he promptly revealed his customary intellectual dishonesty by making the ludicrous claim that this mistake not only rendered Hazlitt’s original point correct – it did not – but somehow invalidated everything I had written about the flaws in Hazlitt’s chapter on free trade.\nIn which I demonstrate a gross misreading and consequent misrepresentation of Hazlitt, which you’ve ignored for the better part of a week now, because I’m unarguably right and the point is critical enough to where the whole essay now needs to be scrapped.\nThe essay was more crap, and proof that Vox is singularly incapable of understanding an argument. I haven’t the time to go point by point, but Vox’s reasoning, or lack thereof, with regard to point 3, is typical of the piece, and since most of the other points depend in one way or another on the validity of that point’s reasoning, it make an excellent target. And since Vox didn’t even bother reading what Hazlitt actually said, it makes a very easy target.\nFirst, Hazlitt said nothing about a $5 tariff on anything at all, least of all sweaters. Hazlitt wrote – emphasis added for the benefit of the semiliterate:\n“We can perhaps make this last point clearer by an exaggerated example. Suppose we make our tariff wall so high that it becomes absolutely prohibitive, and no imports come in from the outside world at all. Suppose, as a result of this, that the price of sweaters in America goes up only $5.”\nJust to make absolutely sure that there’s no excuse for anyone to misunderstand what Hazlitt wrote – not that there was any excuse before, and not that it will stop some of you publik-skuled clowns from continuing to misunderstand: Hazlitt presents an hypothetical example of America isolating itself from the world. It once traded; henceforth it will not import anything. The country is not imposing a $5 tariff on sweaters or any other doodads. The actual tariff amount is left unspecified. It could be ten gazillion dollars per item for all anyone cares. The point is that it is prohibitive and completely effective. And the $5 figure Hazlitt gives is something else entirely – namely, the effect of this prohibition is to raise the price of sweaters $5.\nNow you should see, immediately, that historical data like ‘imports presently represent 17.3 percent of GDP’ are irrelevant. If you do not, you’re a walking argument for eugenics, and I address myself solely to your intellectual betters. Under Hazlitt’s hypothetical example, imports represent precisely 0% of GDP, along with 0% of every other possible economic metric, and, while I don’t want to spoil anyone’s fun with any complicated math shit, I have to say that this likely has something to do with them not existing.\nShit. I said I was going to limit myself to (point) 3, but I can’t help but poke some fun at (point) 6, too. Yes, tariffs and the lack thereof are totally irrelevant to the question of employment. Barring legal restrictions, former steel workers can flip burgers, do laundry, or even sell their affectionate manly embraces for coin, and whether they will do any of those things or hold out for other employment has nothing whatsoever to do with trade theory. Any evidence purporting to show a link between trade policy and long-term unemployment is nonsensical, for the same reason any evidence purporting to show a link between trade policy and Martian ice cap expansion is nonsensical: the causes are elsewhere.\nFirst, let me admit to my misreading.  Unger was correct to point out that Hazlitt does not, as I had said, postulate the imposition of a $5 tariff on imported sweaters, but rather a complete ban on imports that has the effect of raising the prices of domestic sweaters by $5.  So far, so good.  Mea culpa.\nHowever, Unger is completely wrong to claim that this mistake invalidated, or even altered in the slightest, my correction of Hazlitt and that this additional $5 now spent on sweaters means that 100 other domestic producers are not robbed of 5 cents each, but rather 4.14 cents apiece.  His claim about the irrelevance of previous imports is not only incorrect, but underlines how his ability to reason is demonstrably lower than that of those he asserted were “a walking argument for eugenics”.\nUnger himself admits that the tariff wall did not previously exist, but is a change from the previous situation.  He writes of the nation-state: “It once traded; henceforth it will not import anything.”  This means that of the additional $5 now being spent on the sweaters due to the unspecified tariff wall, 17.3 percent of it was previously being spent abroad,\njust as stated in the case of the erroneous $5 sweater tariff\n.  The 100 other domestic producers cannot be losing the entire $5 amount to the sweater manufacturers because they were only receiving a maximum of the $4.14 cents that was being spent domestically anyway.\nSo, despite the misreading, my correction of Hazlitt stands.  Moreoever, it should be readily apparent that because the erroneous substitution of a specific $5 tariff for an unspecified tariff wall with a $5 effect didn’t alter the correctness of my critique on that point, it is not critical enough to require the scrapping of the other 22 identifications of Hazlitt’s errors.  This is little more than wishful thinking and blatant dishonesty on Unger’s part.\nWhile I genuinely value honest criticism, this sort of exaggerated rhetoric is simply ridiculous, adds nothing to the debate, and in fact detracts significantly from it by wasting time on nonexistent and insubstantial matters rather than genuine ones.  It would have been perfectly reasonable to simply point out the misreading without attempting to use the mistake as a foundation upon which to build a fictitious case in defense of Hazlitt.  Some mistakes are critical, others are not, and the honest critic will always be careful to distinguish between the two.  Note that I did not claim that Hazlitt’s 86-cent error in any way invalidated his entire case for free trade, it merely happened to be a minor mistake which tends to illustrate the careless and outdated nature of his reasoning.\nUPDATE: Just to underline Unger’s unusual combination of ineptitude and dishonesty, he popped up here to complain about how I initially omitted the part now seen above in italics.\n“How nice of you to ‘selectively quote’ (read: lie about) what I wrote. You left out a paragraph, which explained what Hazlitt said and why he was right.  I said a few days ago that you weren’t a fraud, but it looks like I was wrong.”\nOf course, I omitted it because it was irrelevant, neither helping his case nor hindering mine.  In fact, I probably should have left it in, since “most of the other points depend in one way or another on the validity of that point’s reasoning” is obviously a false assertion.  This sort of thing is precisely why I ban incompetent but energetic critics like Unger; it doesn’t matter how many times you show them to be wrong, they will just keep swinging wildly and ineffectively at you.  Leaving out irrelevant elements of an argument is selectively quoting, but it is most certainly not lying about anything.  Selective quoting can be dishonest but it is not, in itself, an indication of dishonesty by the person quoting.",
  "tags": [
    "free trade",
    "mailvox"
  ],
  "categories": [],
  "sitemap_lastmod": "2012-07-20T07:38:00+00:00"
}