{
  "url": "https://voxday.net/2012/07/11/mostest-and-importantest-again/",
  "scraped_at": "2025-12-14T04:58:44.109779",
  "title": "Mostest and importantest again",
  "date_display": "July 11, 2012",
  "date_iso": "2012-07-11T08:20:00+00:00",
  "date_from_url": "2012-07-11",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>Joe Farah cracks under <a href=\"http://www.wnd.com/2012/07/none-of-the-above-in-2012/\">The Fear of a Black Second Term</a>:</p><blockquote><p>Do we hold our noses and vote for Mitt Romney? Or do we follow the none-of-the-above prescription?</p><p>Based on his long and contradictory political record, I do not have much hope that Romney is going to do a 180 if he wins. I don’t think he will steer the nation on the U-turn course that is absolutely necessary to save us from the brink of disaster.</p><p>However, the idea of a second term for Obama genuinely scares me. I don’t believe America could ever recover from such a cataclysm. The country will suffer irreparable harm, if it hasn’t done so already.</p><p>While I remain a principled constitutionalist who doesn’t believe in voting for anyone who does not understand and embrace its limitations on federal power, I believe 2012 is one of those rare election years in which freedom-loving Americans will, out of necessity, be forced to vote defensively.</p><p>I won’t be voting for Romney because I think he will save America or reverse our dangerous course. But I will likely be voting for him to buy America the time it needs to avoid catastrophe. It’s just that simple – and sad.</p></blockquote><p>Yeah, that’s a new one.  Principles are important, except of course when they are trumped by the frightening possibility of someone becoming president <i>who is already president</i>.  It’s disappointing to see Farah buying the usual nonsense, which we have heard every four years since 1992, especially since he is throwing a lot of his hard-won credibility out the window.</p><p>Is President Goldman Sachs really that much worse than President Bain Capital?  Is he actually worse than Satan himself?  After all, less than seven months ago, Farah wrote: “I would not vote for Mitt Romney if he were running against Satan himself.”</p><p>My prediction: if Farah does vote for Romney and Romney wins, we’ll be reading a self-flagellating column sometime in 2013 where he laments having sacrificed his principles and voting for a man who so badly betrayed all the conservatives and the small-r republicans who voted for him.  Doesn’t anyone ever learn from the past?  Can’t anyone see how the game is played?</p><p>And in tangentially related news, it’s nice to see that conservatives attempting to manipulate others into voting against their principles are <a href=\"http://www.foxnews.com/entertainment/2012/07/10/brad-pitts-mom-gets-death-threats-after-penning-anti-obama-letter-to-editor/?intcmp=features\">still mathematically illiterate</a>.</p><blockquote><p>“Any Christian who does not vote or writes in a name is casting a vote for Romney’s opponent, Barack Hussein Obama – a man who sat in Jeremiah Wright’s church for years, did not hold a public ceremony to mark the National Day of Prayer, and is a liberal who supports the killing of unborn babies and same-sex marriage,” [Brad Pitt’s mother Jane Pitt] continued. “I hope all Christians give their vote prayerful consideration because voting is a sacred privilege and a serious responsibility.”</p></blockquote><p>If you truly do not understand that a non-vote for Romney <i>is absolutely not</i> a vote for Obama, you are an astonishingly stupid individual.  1+0!=2.  A vote for Obama is a vote for Obama.  Not voting for Obama cannot, in any sense, be considered a vote for Obama.  Political applications do not alter mathematics.  If you cannot master basic addition, I not only don’t want to hear your opinion about the election, I don’t think you should be permitted to vote.  Negative, “pragmatic” voting is an inherently self-defeating concept that only guarantees the very results it is supposed to oppose.</p></div>",
  "content_text": "Joe Farah cracks under\nThe Fear of a Black Second Term\n:\nDo we hold our noses and vote for Mitt Romney? Or do we follow the none-of-the-above prescription?\nBased on his long and contradictory political record, I do not have much hope that Romney is going to do a 180 if he wins. I don’t think he will steer the nation on the U-turn course that is absolutely necessary to save us from the brink of disaster.\nHowever, the idea of a second term for Obama genuinely scares me. I don’t believe America could ever recover from such a cataclysm. The country will suffer irreparable harm, if it hasn’t done so already.\nWhile I remain a principled constitutionalist who doesn’t believe in voting for anyone who does not understand and embrace its limitations on federal power, I believe 2012 is one of those rare election years in which freedom-loving Americans will, out of necessity, be forced to vote defensively.\nI won’t be voting for Romney because I think he will save America or reverse our dangerous course. But I will likely be voting for him to buy America the time it needs to avoid catastrophe. It’s just that simple – and sad.\nYeah, that’s a new one.  Principles are important, except of course when they are trumped by the frightening possibility of someone becoming president\nwho is already president\n.  It’s disappointing to see Farah buying the usual nonsense, which we have heard every four years since 1992, especially since he is throwing a lot of his hard-won credibility out the window.\nIs President Goldman Sachs really that much worse than President Bain Capital?  Is he actually worse than Satan himself?  After all, less than seven months ago, Farah wrote: “I would not vote for Mitt Romney if he were running against Satan himself.”\nMy prediction: if Farah does vote for Romney and Romney wins, we’ll be reading a self-flagellating column sometime in 2013 where he laments having sacrificed his principles and voting for a man who so badly betrayed all the conservatives and the small-r republicans who voted for him.  Doesn’t anyone ever learn from the past?  Can’t anyone see how the game is played?\nAnd in tangentially related news, it’s nice to see that conservatives attempting to manipulate others into voting against their principles are\nstill mathematically illiterate\n.\n“Any Christian who does not vote or writes in a name is casting a vote for Romney’s opponent, Barack Hussein Obama – a man who sat in Jeremiah Wright’s church for years, did not hold a public ceremony to mark the National Day of Prayer, and is a liberal who supports the killing of unborn babies and same-sex marriage,” [Brad Pitt’s mother Jane Pitt] continued. “I hope all Christians give their vote prayerful consideration because voting is a sacred privilege and a serious responsibility.”\nIf you truly do not understand that a non-vote for Romney\nis absolutely not\na vote for Obama, you are an astonishingly stupid individual.  1+0!=2.  A vote for Obama is a vote for Obama.  Not voting for Obama cannot, in any sense, be considered a vote for Obama.  Political applications do not alter mathematics.  If you cannot master basic addition, I not only don’t want to hear your opinion about the election, I don’t think you should be permitted to vote.  Negative, “pragmatic” voting is an inherently self-defeating concept that only guarantees the very results it is supposed to oppose.",
  "tags": [
    "politics"
  ],
  "categories": [],
  "sitemap_lastmod": "2012-07-11T07:20:00+00:00"
}