{
  "url": "https://voxday.net/2012/07/10/so-much-for-science-is-settled_10/",
  "scraped_at": "2025-12-14T04:58:42.262289",
  "title": "So much for “the science is settled”",
  "date_display": "July 10, 2012",
  "date_iso": "2012-07-10T17:00:00+00:00",
  "date_from_url": "2012-07-10",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>Now it is the turn of evolutionary scientists discover that Richard Dawkins is <a href=\"http://www.guardian.co.uk/science/2012/jun/24/battle-of-the-professors\">a deeply unpleasant individual</a>:</p><blockquote><p>A disagreement between the twin giants of genetic theory, Richard Dawkins and EO Wilson, is now being fought out by rival academic camps in an effort to understand how species evolve.</p><p>The learned spat was prompted by the publication of a searingly critical review of Wilson’s new book, The Social Conquest of Earth, in Prospect magazine this month. The review, written by Dawkins, author of the popular and influential books The Selfish Gene, The Blind Watchmaker and The God Delusion, has prompted more letters and on-line comment than any other article in the recent history of the magazine and attacks Wilson’s theory “as implausible and as unsupported by evidence”.</p><p>“I am not being funny when I say of Edward Wilson’s latest book that there are interesting and informative chapters on human evolution, and on the ways of social insects (which he knows better than any man alive), and it was a good idea to write a book comparing these two pinnacles of social evolution, but unfortunately one is obliged to wade through many pages of erroneous and downright perverse misunderstandings of evolutionary theory,” Dawkins writes.</p><p>The Oxford evolutionary biologist, 71, has also infuriated many readers by listing other established academics who, he says, are on his side when it comes to accurately representing the mechanism by which species evolve. Wilson, in a short piece penned promptly in response to Dawkins’s negative review, was also clearly annoyed by this attempt to outflank him.</p><p>“In any case,” Wilson writes, “making such lists is futile. If science depended on rhetoric and polls, we would still be burning objects with phlogiston [a mythical fire-like element] and navigating with geocentric maps.”</p></blockquote><p>As I noted a few years ago in <i>The Irrational Atheist</i>, Richard Dawkins is not a scientist, he is an <i>ex-scientist</i>.  Dawkins has always been inept when it comes to arguing against intelligent and informed interlocutors, so it should come as no surprise that he would blunder badly when trying to take on EO Wilson, even in the event that he happens to be right.</p><p>Dawkins’s statement also raises a serious question.  If a famous and heavily credentialed biologist like EO Wilson truly does not understand evolutionary theory, what could possibly be the use of attempting to teach it in public schools?</p></div>",
  "content_text": "Now it is the turn of evolutionary scientists discover that Richard Dawkins is\na deeply unpleasant individual\n:\nA disagreement between the twin giants of genetic theory, Richard Dawkins and EO Wilson, is now being fought out by rival academic camps in an effort to understand how species evolve.\nThe learned spat was prompted by the publication of a searingly critical review of Wilson’s new book, The Social Conquest of Earth, in Prospect magazine this month. The review, written by Dawkins, author of the popular and influential books The Selfish Gene, The Blind Watchmaker and The God Delusion, has prompted more letters and on-line comment than any other article in the recent history of the magazine and attacks Wilson’s theory “as implausible and as unsupported by evidence”.\n“I am not being funny when I say of Edward Wilson’s latest book that there are interesting and informative chapters on human evolution, and on the ways of social insects (which he knows better than any man alive), and it was a good idea to write a book comparing these two pinnacles of social evolution, but unfortunately one is obliged to wade through many pages of erroneous and downright perverse misunderstandings of evolutionary theory,” Dawkins writes.\nThe Oxford evolutionary biologist, 71, has also infuriated many readers by listing other established academics who, he says, are on his side when it comes to accurately representing the mechanism by which species evolve. Wilson, in a short piece penned promptly in response to Dawkins’s negative review, was also clearly annoyed by this attempt to outflank him.\n“In any case,” Wilson writes, “making such lists is futile. If science depended on rhetoric and polls, we would still be burning objects with phlogiston [a mythical fire-like element] and navigating with geocentric maps.”\nAs I noted a few years ago in\nThe Irrational Atheist\n, Richard Dawkins is not a scientist, he is an\nex-scientist\n.  Dawkins has always been inept when it comes to arguing against intelligent and informed interlocutors, so it should come as no surprise that he would blunder badly when trying to take on EO Wilson, even in the event that he happens to be right.\nDawkins’s statement also raises a serious question.  If a famous and heavily credentialed biologist like EO Wilson truly does not understand evolutionary theory, what could possibly be the use of attempting to teach it in public schools?",
  "tags": [
    "evolution",
    "science"
  ],
  "categories": [],
  "sitemap_lastmod": "2012-07-10T16:00:00+00:00"
}