{
  "url": "https://voxday.net/2012/07/19/the-outdated-myth-of-integration/",
  "scraped_at": "2025-12-14T04:59:21.251516",
  "title": "The outdated myth of integration",
  "date_display": "July 19, 2012",
  "date_iso": "2012-07-19T11:54:00+00:00",
  "date_from_url": "2012-07-19",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>There is a fundamental logical error being displayed in the assumption that because Italian, German, and Swedish-speakers learned English and integrated substantially – although not wholly – into American culture, <a href=\"http://www.dailymail.co.uk/news/article-2150667/Second-generation-migrants-struggle-understand-basic-instructions-English.html\">other ethnic groups will necessarily do so</a>, particularly given the way in which technology reduces any need to do so:</p><blockquote><p>They were born in the UK, but many second and third generation immigrants speak or understand hardly any English, it was revealed today.  Their poor understanding of the language means they are unable to take notes or understand basic instructions on training courses ranging from engineering to electronics.  Experts warn that low standards of English in some minority groups have been blamed for widening ethnic divisions and creating communities where it is the second language.</p></blockquote><p>There are several reasons why immigrants are no longer integrating much, if at all, into the larger cultures.  The first reason is that they come from different ethnic groups.  It is a mistake to assume that all cultures and national identities are equally willing to submit themselves to another one.  Italy, for example, wasn’t even a singular nation until 1870 and the Irish hadn’t been independent for centuries, so it should come as no surprise that they did not cling to national identities that many of them did not even possess in the first place.</p><p>The second reason is demographic.  To what culture and social mores is a new Guatemalan immigrant to southern California going to integrate when most of the people surrounding him in his new place of residence are Spanish-speaking Mexicans?  Once immigration is permitted beyond certain highly restricted levels, the possibility of integration is necessarily reduced, if not eliminated entirely.  And the third reason is technological.  With Skype and satellite entertainment systems, it is entirely possible to live in a foreign country without any actual contact with the local populace and culture beyond the occasional visit to the grocery store.  I’ve known English-speakers living in Italy who after 15 years of living there still don’t speak twenty words of Italian; they have no intention or need to integrate.</p></div>",
  "content_text": "There is a fundamental logical error being displayed in the assumption that because Italian, German, and Swedish-speakers learned English and integrated substantially – although not wholly – into American culture,\nother ethnic groups will necessarily do so\n, particularly given the way in which technology reduces any need to do so:\nThey were born in the UK, but many second and third generation immigrants speak or understand hardly any English, it was revealed today.  Their poor understanding of the language means they are unable to take notes or understand basic instructions on training courses ranging from engineering to electronics.  Experts warn that low standards of English in some minority groups have been blamed for widening ethnic divisions and creating communities where it is the second language.\nThere are several reasons why immigrants are no longer integrating much, if at all, into the larger cultures.  The first reason is that they come from different ethnic groups.  It is a mistake to assume that all cultures and national identities are equally willing to submit themselves to another one.  Italy, for example, wasn’t even a singular nation until 1870 and the Irish hadn’t been independent for centuries, so it should come as no surprise that they did not cling to national identities that many of them did not even possess in the first place.\nThe second reason is demographic.  To what culture and social mores is a new Guatemalan immigrant to southern California going to integrate when most of the people surrounding him in his new place of residence are Spanish-speaking Mexicans?  Once immigration is permitted beyond certain highly restricted levels, the possibility of integration is necessarily reduced, if not eliminated entirely.  And the third reason is technological.  With Skype and satellite entertainment systems, it is entirely possible to live in a foreign country without any actual contact with the local populace and culture beyond the occasional visit to the grocery store.  I’ve known English-speakers living in Italy who after 15 years of living there still don’t speak twenty words of Italian; they have no intention or need to integrate.",
  "tags": [
    "immigration"
  ],
  "categories": [],
  "sitemap_lastmod": "2012-07-19T10:54:00+00:00"
}