{
  "url": "https://voxday.net/2012/07/18/the-sports-guy-was-rig/",
  "scraped_at": "2025-12-14T04:59:17.617506",
  "title": "The Sports Guy was right",
  "date_display": "July 18, 2012",
  "date_iso": "2012-07-18T11:13:00+00:00",
  "date_from_url": "2012-07-18",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>Women ruin everything. <a href=\"http://www.hollywoodreporter.com/heat-vision/comic-con-2012-hobbit-footage-peter-jackson-349341\">Everything</a>.  This is why women have to be ruthlessly kept out of places to which their sex have neither created nor contributed anything.  In most such cases, literally the only thing women truly care about accomplishing is adding more women.</p><blockquote><p>Co-producer Philippa Boyens addressed some changes made for the movie adaptation, especially the addition of a new character or two, something that could be seen as heresy by the literary community or Tolkien fans.  Boyens said the story felt weighed down by males, so they created a female elf, being played by Evangeline Lilly and seen briefly in the footage.</p><p>“We created her to bring that feminine energy,” Boyens said. “We believe it’s completely within the spirit of Tolkien. We didn’t want her to be a ploy.”</p></blockquote><p><i>What.  The.  Fuck?</i> Tolkien’s novels are a masterpiece.  A classic.  They define a genre.  So Philippa Fucking Boyens decides she can improve upon them by adding a female character to do what, discuss tampons and boy bands?  Does Tokenlass spend her screen time regaling the dwarves with tedious gossip about elves that none of them have ever met?  Does she have sex with Borin before making a hypergamous upgrade to Thorin, then demanding that the dwarves replace their battleaxes and warhammers with lighter ones that she can carry?</p><p>The problem with Jackson’s LOTR trilogy wasn’t the omission of Tom Bombadil but the addition of the idiotic dialogue invented by Boyens; HBO’s adaptation of <i>A Game of Thrones</i> is much superior due to the fact that Martin himself is being used to create the additional dialogue required by the new medium.  Now, I’ll still watch <i>The Hobbit</i> when it comes out.  Like <i>The Lord of the Rings</i>, the source material is too good to be ruined by the “contributions” of Ms Boyens’s script.  But it’s unsurprising that the Tolkien estate is less than ecstatic about Jackson’s films, which fortunately means there will be future films that will be conceived and advertised as being more faithful to Tolkien’s text instead of presenting the Ms Magazine version of them.</p><p>Anyhow, to Hell with Boyens, her feminine energy, and her fear of an excessively male story.</p></div>",
  "content_text": "Women ruin everything.\nEverything\n.  This is why women have to be ruthlessly kept out of places to which their sex have neither created nor contributed anything.  In most such cases, literally the only thing women truly care about accomplishing is adding more women.\nCo-producer Philippa Boyens addressed some changes made for the movie adaptation, especially the addition of a new character or two, something that could be seen as heresy by the literary community or Tolkien fans.  Boyens said the story felt weighed down by males, so they created a female elf, being played by Evangeline Lilly and seen briefly in the footage.\n“We created her to bring that feminine energy,” Boyens said. “We believe it’s completely within the spirit of Tolkien. We didn’t want her to be a ploy.”\nWhat.  The.  Fuck?\nTolkien’s novels are a masterpiece.  A classic.  They define a genre.  So Philippa Fucking Boyens decides she can improve upon them by adding a female character to do what, discuss tampons and boy bands?  Does Tokenlass spend her screen time regaling the dwarves with tedious gossip about elves that none of them have ever met?  Does she have sex with Borin before making a hypergamous upgrade to Thorin, then demanding that the dwarves replace their battleaxes and warhammers with lighter ones that she can carry?\nThe problem with Jackson’s LOTR trilogy wasn’t the omission of Tom Bombadil but the addition of the idiotic dialogue invented by Boyens; HBO’s adaptation of\nA Game of Thrones\nis much superior due to the fact that Martin himself is being used to create the additional dialogue required by the new medium.  Now, I’ll still watch\nThe Hobbit\nwhen it comes out.  Like\nThe Lord of the Rings\n, the source material is too good to be ruined by the “contributions” of Ms Boyens’s script.  But it’s unsurprising that the Tolkien estate is less than ecstatic about Jackson’s films, which fortunately means there will be future films that will be conceived and advertised as being more faithful to Tolkien’s text instead of presenting the Ms Magazine version of them.\nAnyhow, to Hell with Boyens, her feminine energy, and her fear of an excessively male story.",
  "tags": [
    "movies"
  ],
  "categories": [],
  "sitemap_lastmod": "2012-07-18T10:13:00+00:00"
}