{
  "url": "https://voxday.net/2012/07/24/universal-suffrage-vs-democracy/",
  "scraped_at": "2025-12-14T04:59:41.115256",
  "title": "Universal suffrage vs democracy",
  "date_display": "July 24, 2012",
  "date_iso": "2012-07-24T13:30:00+00:00",
  "date_from_url": "2012-07-24",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>This post by Roissy should help explain <a href=\"https://heartiste.wordpress.com/2012/07/23/obedience-to-authority-game/\">why the Founding Fathers limited the vote</a> to about one-fifth of the male population:</p><blockquote><p>If you are apt to align your lifestyle with whatever is the latest fashion, (and ostracize those who don’t), you are probably also apt to blindly obey high status authority figures telling you what is good for you. If true, then we might speculate that women make better cultural foot soldiers for whichever elite authority is most tangible in their lives, owing to women’s greater propensity to accept authority dictums without question.</p><p>We may add to this speculation not only personal observation and confirmatory heaps of anecdotes, but in addition scientific evidence that women are, indeed, more obedient to authority than are men. Courtesy of reader uh pointing us to this Milgram experiment replication:</p><p><i>Charles Sheridan and Richard King hypothesized that some of Milgram’s subjects may have suspected that the victim was faking, so they repeated the experiment with a real victim: a “cute, fluffy puppy” who was given real, albeit harmless, electric shocks. They found similar findings to Milgram: half of the male subjects and all of the females obeyed to the end. Many subjects showed high levels of distress during the experiment and some openly wept. In addition, Sheridan and King found that the duration for which the shock button was pressed decreased as the shocks got higher, meaning that for higher shock levels, subjects showed more hesitance towards delivering the shocks.</i></p><p>Always remember: All female participants in the Milgram obedience to authority experiment continued shocking the puppy despite their tears.</p></blockquote><p>Contemplate this: if all women are willing to shock cute little puppies simply because an authority figure told them to do so, what <i>won’t</i> they be willing to do?  No doubt the women who participated in the experiment had no desire to harm puppies and would explain their behavior by saying “he made me do it”, but that malleability is the entire point.</p><p>Resistance to evil requires the ability to stand up to it and refuse to submit.  Jesus was not merely obedient to His Father, he also refused to bow down before the Prince of the World.  And note that it’s not only women who lack the ability to resist perceived authority, but half of all men as well.  It’s not merely women’s suffrage, but universal suffrage that caused democracies to become dictatorial.</p><p>It also underlines the importance of watching women’s actions, not listening to their words.  If asked “would you ever subject a puppy to a painful electric shock of no possible benefit to it?”, most of those women would quite vehemently deny the very idea.  However, the evidence indicates that if instructed to do so, they would, in fact, do it, even though the action caused them significant personal stress.</p><p>Anyhow, I’d be interested to know how many people here, male or female, believe they would shock the puppy at the behest of the men in white coats.  I don’t think I would object to giving it a mild shock or three in the interest of science, but if this experiment truly mimicked the Milgram one and I was told that the voltage was high enough to seriously harm or even kill the puppy, there is a non-zero chance I’d punch out the scientist before hooking him up to his device and giving him a shock or two.  At the very least, I believe I would deliver a solid “WTF is wrong with you people” rant before kidnapping the puppy.</p><p>But then, it is well known that I regard scientists with nearly as much suspicion as male elementary teachers who just love children.  So I suppose it wouldn’t be much of a test of authority in my case.</p></div>",
  "content_text": "This post by Roissy should help explain\nwhy the Founding Fathers limited the vote\nto about one-fifth of the male population:\nIf you are apt to align your lifestyle with whatever is the latest fashion, (and ostracize those who don’t), you are probably also apt to blindly obey high status authority figures telling you what is good for you. If true, then we might speculate that women make better cultural foot soldiers for whichever elite authority is most tangible in their lives, owing to women’s greater propensity to accept authority dictums without question.\nWe may add to this speculation not only personal observation and confirmatory heaps of anecdotes, but in addition scientific evidence that women are, indeed, more obedient to authority than are men. Courtesy of reader uh pointing us to this Milgram experiment replication:\nCharles Sheridan and Richard King hypothesized that some of Milgram’s subjects may have suspected that the victim was faking, so they repeated the experiment with a real victim: a “cute, fluffy puppy” who was given real, albeit harmless, electric shocks. They found similar findings to Milgram: half of the male subjects and all of the females obeyed to the end. Many subjects showed high levels of distress during the experiment and some openly wept. In addition, Sheridan and King found that the duration for which the shock button was pressed decreased as the shocks got higher, meaning that for higher shock levels, subjects showed more hesitance towards delivering the shocks.\nAlways remember: All female participants in the Milgram obedience to authority experiment continued shocking the puppy despite their tears.\nContemplate this: if all women are willing to shock cute little puppies simply because an authority figure told them to do so, what\nwon’t\nthey be willing to do?  No doubt the women who participated in the experiment had no desire to harm puppies and would explain their behavior by saying “he made me do it”, but that malleability is the entire point.\nResistance to evil requires the ability to stand up to it and refuse to submit.  Jesus was not merely obedient to His Father, he also refused to bow down before the Prince of the World.  And note that it’s not only women who lack the ability to resist perceived authority, but half of all men as well.  It’s not merely women’s suffrage, but universal suffrage that caused democracies to become dictatorial.\nIt also underlines the importance of watching women’s actions, not listening to their words.  If asked “would you ever subject a puppy to a painful electric shock of no possible benefit to it?”, most of those women would quite vehemently deny the very idea.  However, the evidence indicates that if instructed to do so, they would, in fact, do it, even though the action caused them significant personal stress.\nAnyhow, I’d be interested to know how many people here, male or female, believe they would shock the puppy at the behest of the men in white coats.  I don’t think I would object to giving it a mild shock or three in the interest of science, but if this experiment truly mimicked the Milgram one and I was told that the voltage was high enough to seriously harm or even kill the puppy, there is a non-zero chance I’d punch out the scientist before hooking him up to his device and giving him a shock or two.  At the very least, I believe I would deliver a solid “WTF is wrong with you people” rant before kidnapping the puppy.\nBut then, it is well known that I regard scientists with nearly as much suspicion as male elementary teachers who just love children.  So I suppose it wouldn’t be much of a test of authority in my case.",
  "tags": [
    "politics",
    "science"
  ],
  "categories": [],
  "sitemap_lastmod": "2012-07-24T12:30:00+00:00"
}