{
  "url": "https://voxday.net/2012/07/14/upending-economics/",
  "scraped_at": "2025-12-14T04:58:59.289394",
  "title": "Upending economics",
  "date_display": "July 14, 2012",
  "date_iso": "2012-07-14T12:41:00+00:00",
  "date_from_url": "2012-07-14",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>Steve Keen’s <i>Debunking Economics</i> is less a critique than slashing out the legs upon which economics has rested for centuries.  One of the pillars he topples has a direct connection to the deflation dichotomy, as he attempts to explain to Mish why the Federal Reserve’s big increase in bank reserves <a href=\"http://globaleconomicanalysis.blogspot.com/2012/07/notes-from-steve-keen-on-lending.html\">has not led to more lending</a>:</p><blockquote><p>That “increase reserves to increase lending” argument is so hard to shake, but reserves can’t be lent from simply from a double-entry bookkeeping point of view.</p><p>The way that accountants keep track of the “assets equals liabilities plus equity” rule is to record an increase in assets as a positive and an increase in liabilities as a negative (your liabilities rise, so a negative gets bigger). Reserves are an asset, as are loans, and shown as a positive. Deposits–which are created by a loan–are a liability and shown as a negative</p><p>So to lend to a customer, a bank has to show a negative on that customer’s accounts. This can be matched by a positive on the loans entry–because the loan has increased in size. No problem.</p><p>But if banks were to lend from reserves, they would need to record a minus there–reserves have fallen. And on the liabilities side, they want to … also show a negative. Whoops! No can do.</p><p>The end result of this logic is that reserves are there for settlement of accounts between banks, and for the government’s interface with the private banking sector, but not for lending from.</p><p>Banks themselves may (if they are allowed–I simply don’t know the rules here) swap those assets for other forms of assets that are income-yielding, but they are not able to lend from them.</p></blockquote><p>As Keen points out in his book, it’s not merely an accounting perspective that suggests the conventional economic understanding of the relationship between deposits and loans in a fractional reserve system cannot be correct, but the empirical observation of banker’s activities as well.  Loans not only don’t depend upon deposits, they usually <i>precede</i> them.</p><p>This also helps explain why the artificially low interest rates maintained by the Bank of Japan and the Federal Reserve, have not, as the monetarists expected, produced increased borrowing.</p></div>",
  "content_text": "Steve Keen’s\nDebunking Economics\nis less a critique than slashing out the legs upon which economics has rested for centuries.  One of the pillars he topples has a direct connection to the deflation dichotomy, as he attempts to explain to Mish why the Federal Reserve’s big increase in bank reserves\nhas not led to more lending\n:\nThat “increase reserves to increase lending” argument is so hard to shake, but reserves can’t be lent from simply from a double-entry bookkeeping point of view.\nThe way that accountants keep track of the “assets equals liabilities plus equity” rule is to record an increase in assets as a positive and an increase in liabilities as a negative (your liabilities rise, so a negative gets bigger). Reserves are an asset, as are loans, and shown as a positive. Deposits–which are created by a loan–are a liability and shown as a negative\nSo to lend to a customer, a bank has to show a negative on that customer’s accounts. This can be matched by a positive on the loans entry–because the loan has increased in size. No problem.\nBut if banks were to lend from reserves, they would need to record a minus there–reserves have fallen. And on the liabilities side, they want to … also show a negative. Whoops! No can do.\nThe end result of this logic is that reserves are there for settlement of accounts between banks, and for the government’s interface with the private banking sector, but not for lending from.\nBanks themselves may (if they are allowed–I simply don’t know the rules here) swap those assets for other forms of assets that are income-yielding, but they are not able to lend from them.\nAs Keen points out in his book, it’s not merely an accounting perspective that suggests the conventional economic understanding of the relationship between deposits and loans in a fractional reserve system cannot be correct, but the empirical observation of banker’s activities as well.  Loans not only don’t depend upon deposits, they usually\nprecede\nthem.\nThis also helps explain why the artificially low interest rates maintained by the Bank of Japan and the Federal Reserve, have not, as the monetarists expected, produced increased borrowing.",
  "tags": [
    "economics"
  ],
  "categories": [],
  "sitemap_lastmod": "2012-07-14T11:41:00+00:00"
}