{
  "url": "https://voxday.net/2023/11/17/a-gatekeeper-in-action/",
  "scraped_at": "2026-01-08T14:15:38.716545",
  "title": "A Gatekeeper in Action",
  "date_display": "November 17, 2023",
  "date_iso": "2023-11-17T10:54:12+00:00",
  "date_from_url": "2023-11-17",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>Tim Pool does NOT want <a href=\"https://www.youtube.com/live/lSINdoDOLts?si=fQSZTxMBWs_sRNw4&amp;t=5742\">to let his guest talk</a> about the 1967 Israeli attack on the <em>USS Liberty</em> or its potential implications for the current US Navy presence in the Eastern Mediterranean.</p><blockquote class=\"wp-block-quote is-layout-flow wp-block-quote-is-layout-flow\"><p><strong>GUEST:</strong> I’m concerned with having American aircraft carriers over there, like what I keep being told about the <em>USS Liberty</em>, that’s something with the Israeli government-</p><p><strong>TIM POOL: </strong>You should, you should be careful about that one!</p><p><strong>SIDEKICK: </strong>Allegedly, the Israeli Air Force, jet fighter aircraft, I mean, they did end up paying out the American government.</p><p><strong>GUEST: </strong>So I’m concerned, like false flag operation, like a missile comes out of Gaza and hits one of our aircraft carriers, but it was actually an Israeli missile. I don’t want, we should get out of there, it doesn’t-</p><p><strong><strong>TIM POOL: </strong></strong>Let me stop you there. It doesn’t matter where the missile comes from. If a missile comes out of the Middle East in any capacity and hits a US target, everyone will claim it was exactly what they want it<br/>to be, exactly. The US military will say Iran did it, the pro-Palestinians will say Israel did it, the pro-Israel will say Hamas did it.</p><p><strong>GUEST:</strong> Yeah, if it comes out of a foreign country other than Israel, then it’ll be hard to deny.</p><p><strong>TIM POOL: </strong>It doesn’t matter where it comes from! The US will say Iran did it.</p><p><strong>GUEST:</strong> Right, well, if it comes out of Tel Aviv it’s going to be hard to sell that.</p><p><strong>TIM POOL: </strong>But prove it came out of Tel Aviv! How do you know? You read the news! You are going to get American intelligence agencies going to news organizations, saying “tell them it came out of Iran”!</p><p><strong>GUEST:</strong> I don’t think the Americans want their carrier to be hit as a false flag. Maybe the <em>USS Liberty</em> thing was an accident.</p><p><strong>SIDEKICK: </strong>That’s the controversy over it. The Israeli government claims it was an accident, but some survivors say that they don’t think it was an accident, so was it a false flag? That’s why people talk about it.</p><p><strong>GUEST:</strong> Did America get involved in the 1967 war after that?</p><p><strong>SIDEKICK: </strong>No, because it ended up it ended up being really short but-</p><p><strong>TIM POOL: </strong>We are, we’re going to go to super chats so if you haven’t already would you kindly smash that Like button, and subscribe to this channel.</p></blockquote><p>I’m not saying Tim Pool is wrong, although I think there is zero chance that any Israeli missiles will be launched at any American ships; the fact that the US media still avoids the subject of the USS Liberty like vampires avoiding holy water tends to indicate that the Israelis don’t have any desire to risk repeating that sort of debacle, not when the US Navy is perfectly capable of sinking its own ships without any help from friend, foe, or greatest ally. And, depending upon the captain, possibly without even intentionally trying to do so.</p><p>Also, there are no shortage of influential neocons in the US government and media who want war with Iran far worse than the Israelis do. They are both less attached to reality and more distanced from the potential consequences. Israeli military historian Martin van Creveld once said, in an ironic turn of phrase, that US neocons are willing to fight to the very last Israeli.</p><p>What is most interesting about the interview, however, is the way in which Pool tells the guest to “be careful” after he brings up the incident, and then immediately attempts to change the subject, twice. It would be very interesting to ask Mr. Pool why he believes one has to “be careful” about a minor military engagement that took place 56 years ago and is such a matter of public record that it has <a href=\"https://en.wikipedia.org/wiki/USS_Liberty_incident\">its own Wikipedia page</a>.</p><p>This is what media gatekeeping looks like in action. It’s the avoidance of certain topics and the steering of the public discourse away from those topics when they are, for some reason, accidentally brought up.</p><div class=\"wp-block-image\"><figure class=\"aligncenter size-full\"><img alt=\"\" class=\"wp-image-60476\" decoding=\"async\" fetchpriority=\"high\" height=\"554\" sizes=\"(max-width: 512px) 100vw, 512px\" src=\"https://voxday.net/wp-content/uploads/2023/11/image-41.png\" srcset=\"https://voxday.net/wp-content/uploads/2023/11/image-41.png 512w, https://voxday.net/wp-content/uploads/2023/11/image-41-277x300.png 277w\" width=\"512\"/></figure></div><p><em><a href=\"https://social.infogalactic.com/micropost/8c3dffb3-9571-447c-acdc-7d2ddbc10952\">DISCUSS ON SG</a></em></p></div>",
  "content_text": "Tim Pool does NOT want\nto let his guest talk\nabout the 1967 Israeli attack on the\nUSS Liberty\nor its potential implications for the current US Navy presence in the Eastern Mediterranean.\nGUEST:\nI’m concerned with having American aircraft carriers over there, like what I keep being told about the\nUSS Liberty\n, that’s something with the Israeli government-\nTIM POOL:\nYou should, you should be careful about that one!\nSIDEKICK:\nAllegedly, the Israeli Air Force, jet fighter aircraft, I mean, they did end up paying out the American government.\nGUEST:\nSo I’m concerned, like false flag operation, like a missile comes out of Gaza and hits one of our aircraft carriers, but it was actually an Israeli missile. I don’t want, we should get out of there, it doesn’t-\nTIM POOL:\nLet me stop you there. It doesn’t matter where the missile comes from. If a missile comes out of the Middle East in any capacity and hits a US target, everyone will claim it was exactly what they want it\nto be, exactly. The US military will say Iran did it, the pro-Palestinians will say Israel did it, the pro-Israel will say Hamas did it.\nGUEST:\nYeah, if it comes out of a foreign country other than Israel, then it’ll be hard to deny.\nTIM POOL:\nIt doesn’t matter where it comes from! The US will say Iran did it.\nGUEST:\nRight, well, if it comes out of Tel Aviv it’s going to be hard to sell that.\nTIM POOL:\nBut prove it came out of Tel Aviv! How do you know? You read the news! You are going to get American intelligence agencies going to news organizations, saying “tell them it came out of Iran”!\nGUEST:\nI don’t think the Americans want their carrier to be hit as a false flag. Maybe the\nUSS Liberty\nthing was an accident.\nSIDEKICK:\nThat’s the controversy over it. The Israeli government claims it was an accident, but some survivors say that they don’t think it was an accident, so was it a false flag? That’s why people talk about it.\nGUEST:\nDid America get involved in the 1967 war after that?\nSIDEKICK:\nNo, because it ended up it ended up being really short but-\nTIM POOL:\nWe are, we’re going to go to super chats so if you haven’t already would you kindly smash that Like button, and subscribe to this channel.\nI’m not saying Tim Pool is wrong, although I think there is zero chance that any Israeli missiles will be launched at any American ships; the fact that the US media still avoids the subject of the USS Liberty like vampires avoiding holy water tends to indicate that the Israelis don’t have any desire to risk repeating that sort of debacle, not when the US Navy is perfectly capable of sinking its own ships without any help from friend, foe, or greatest ally. And, depending upon the captain, possibly without even intentionally trying to do so.\nAlso, there are no shortage of influential neocons in the US government and media who want war with Iran far worse than the Israelis do. They are both less attached to reality and more distanced from the potential consequences. Israeli military historian Martin van Creveld once said, in an ironic turn of phrase, that US neocons are willing to fight to the very last Israeli.\nWhat is most interesting about the interview, however, is the way in which Pool tells the guest to “be careful” after he brings up the incident, and then immediately attempts to change the subject, twice. It would be very interesting to ask Mr. Pool why he believes one has to “be careful” about a minor military engagement that took place 56 years ago and is such a matter of public record that it has\nits own Wikipedia page\n.\nThis is what media gatekeeping looks like in action. It’s the avoidance of certain topics and the steering of the public discourse away from those topics when they are, for some reason, accidentally brought up.\nDISCUSS ON SG",
  "tags": [
    "history",
    "media",
    "neocons",
    "war"
  ],
  "categories": [],
  "sitemap_lastmod": "2023-11-17T10:58:03+00:00"
}