{
  "url": "https://voxday.net/2023/11/05/boomer-is-a-philosophical-path/",
  "scraped_at": "2026-01-08T14:14:31.567814",
  "title": "Boomer is a Philosophical Path",
  "date_display": "November 5, 2023",
  "date_iso": "2023-11-05T12:50:57+00:00",
  "date_from_url": "2023-11-05",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>Recently, some self-styled advocates of the white race, most of whom are anti-nationalist racial imperialists whose historically-ignorant views merit being taken about as seriously as those of the Black Israelites, the Christian Zionists, and the ADL, have been trying to push the idea that “Boomer” is an anti-white slur that is being used to “divide” white citizens of the USA.</p><p>First, the idea is obviously absurd because US whites have always been divided, for the obvious reason that <em>race is a superset of nation</em>. Americans are British. They’re not of German descent, Chinese descent, or Martian descent. The American Revolution wasn’t fought against the Holy Roman Emperor, the Tsar of Russia, the King of France, or the Galactic Overlord, it was fought against King George III of Great Britain and the British Parliament.</p><p>The fact that other Europeans “of good character” were permitted to enter and reside in the United States, and that the Indian tribes were conquered, and that the Spanish territories were forcibly seized in war, and that the global floodgates were opened in 1965 leading to the single greatest invasion in recorded human history no more makes those US citizens “American” than the US soldiers occupying Japan for the last 78 years have become Japanese.</p><p>Because the USA is an empire established by military force and occupation in 1865 that refers to all of its subjects as “Americans”, people are usually blind to the fact that the USA is not a “nation-state” at all, but rather, a literal empire of many states and nations very similar to the the British and Roman empires. Somehow, this obvious observation escapes most “Americans” even though they literally live in formerly sovereign States like Massachusetts and Texas. A casual term cannot define history; recall that the citizens of Argentina, Mexico, and Uruguay have as much historical claim to call themselves “American” as does the average US citizen who is not of British descent. Neither citizen nor subject necessarily denotes national, which is why economists had to stop using GNP and switch to GDP.</p><p>Second, Boomer was never coined as a pejorative term and wasn’t viewed as one for decades. It was accepted by those it described and is still borne with pride by most of them to this day. It gradually, and organically, became seen as a negative due to the behavior of those it described, in much the same way that “gay” and “Negro” are now viewed as slurs. Now Boomer has come to describe a negative philosophy and a historical path, to describe those who consciously chose Hell over Heaven.</p><div class=\"wp-block-image\"><figure class=\"aligncenter size-full\"><img alt=\"\" class=\"wp-image-60300\" decoding=\"async\" fetchpriority=\"high\" height=\"512\" sizes=\"(max-width: 512px) 100vw, 512px\" src=\"https://voxday.net/wp-content/uploads/2023/11/image-10.png\" srcset=\"https://voxday.net/wp-content/uploads/2023/11/image-10.png 512w, https://voxday.net/wp-content/uploads/2023/11/image-10-300x300.png 300w, https://voxday.net/wp-content/uploads/2023/11/image-10-150x150.png 150w\" width=\"512\"/></figure></div><p>A recent dialogue on social media:</p><p><strong>BOOMERBOT</strong>: <em>“Boomer.” Another anti white slur. Divide and conquer, rather than trying to figure out why whites of ALL generations are being destroyed by the anti white propaganda</em></p><p><strong>SPACEBUNNY: </strong>Actually this attitude is more of destroyer of white culture than your moronic “divide and conquer” bs, dear. We should be able to call out the mistakes and police our own culture, that the Silents didn’t call out the Boomers who were there children is part of the reason we’re where we are today. If you can’t acknowledge and admit mistakes you’re a failure as a human. Grow up, Boomer, take some responsibility for once in your life. Most of the Boomer hate would evaporate in a heartbeat if you all took responsibility for where the West in general, and the US in particular, is right now. But no, you just whine about how it’s not really your fault everyone is so mean…..</p><p><strong>VD: </strong>Defending Boomers and trying to <em>ex post facto</em> redefine “Boomer” as an anti-white slur is one way to ensure that virtually no GenX or Millennial will ever pay any attention to you. <em>Because we were there.</em> We saw what they consciously chose from our earliest years. We lived in the America that they smugly rejected and ruined. The Boomers collectively were, and are, a wicked generation. They remain wicked and they revel in their collective identity to this day. The fact that evil influences exist does not excuse in any way those who chose evil new ways in preference to that which is traditional and good. And if you are defending Boomers and their dreadful choices that have led to the consequences we observe today, then you are an enemy of the Good, the Beautiful, and the True.</p><p>Here is the point: you are always responsible for whom you choose to follow. The temptation is not the sin. The Boomers were tempted by, and consciously chose, a broad and easy path with cheap credit, easy morals, and great ethnic food. We are attempting to forge a different path.</p><p><strong>UPDATE: </strong>This may be the best summation of the Boomer philosophy that I’ve seen:</p><p><em>“The moralizing of objectively false platitudes in the face of their observable failure.”</em></p><p><strong>UPDATE: </strong>The Boomers <a href=\"https://gab.com/voxday/posts/111357694328435047\">will hear no criticism of their actions</a>, and they believe the only reason anyone would ever criticize them is due to bitterness at their own failures. Words are insufficient for how utterly despicable they are. To hear the Boomer is to hate the Boomer.</p><p><a href=\"https://social.infogalactic.com/micropost/06519e82-2b50-4992-8e8d-aec128ed5c97\"><em>DISCUSS ON SG</em></a></p></div>",
  "content_text": "Recently, some self-styled advocates of the white race, most of whom are anti-nationalist racial imperialists whose historically-ignorant views merit being taken about as seriously as those of the Black Israelites, the Christian Zionists, and the ADL, have been trying to push the idea that “Boomer” is an anti-white slur that is being used to “divide” white citizens of the USA.\nFirst, the idea is obviously absurd because US whites have always been divided, for the obvious reason that\nrace is a superset of nation\n. Americans are British. They’re not of German descent, Chinese descent, or Martian descent. The American Revolution wasn’t fought against the Holy Roman Emperor, the Tsar of Russia, the King of France, or the Galactic Overlord, it was fought against King George III of Great Britain and the British Parliament.\nThe fact that other Europeans “of good character” were permitted to enter and reside in the United States, and that the Indian tribes were conquered, and that the Spanish territories were forcibly seized in war, and that the global floodgates were opened in 1965 leading to the single greatest invasion in recorded human history no more makes those US citizens “American” than the US soldiers occupying Japan for the last 78 years have become Japanese.\nBecause the USA is an empire established by military force and occupation in 1865 that refers to all of its subjects as “Americans”, people are usually blind to the fact that the USA is not a “nation-state” at all, but rather, a literal empire of many states and nations very similar to the the British and Roman empires. Somehow, this obvious observation escapes most “Americans” even though they literally live in formerly sovereign States like Massachusetts and Texas. A casual term cannot define history; recall that the citizens of Argentina, Mexico, and Uruguay have as much historical claim to call themselves “American” as does the average US citizen who is not of British descent. Neither citizen nor subject necessarily denotes national, which is why economists had to stop using GNP and switch to GDP.\nSecond, Boomer was never coined as a pejorative term and wasn’t viewed as one for decades. It was accepted by those it described and is still borne with pride by most of them to this day. It gradually, and organically, became seen as a negative due to the behavior of those it described, in much the same way that “gay” and “Negro” are now viewed as slurs. Now Boomer has come to describe a negative philosophy and a historical path, to describe those who consciously chose Hell over Heaven.\nA recent dialogue on social media:\nBOOMERBOT\n:\n“Boomer.” Another anti white slur. Divide and conquer, rather than trying to figure out why whites of ALL generations are being destroyed by the anti white propaganda\nSPACEBUNNY:\nActually this attitude is more of destroyer of white culture than your moronic “divide and conquer” bs, dear. We should be able to call out the mistakes and police our own culture, that the Silents didn’t call out the Boomers who were there children is part of the reason we’re where we are today. If you can’t acknowledge and admit mistakes you’re a failure as a human. Grow up, Boomer, take some responsibility for once in your life. Most of the Boomer hate would evaporate in a heartbeat if you all took responsibility for where the West in general, and the US in particular, is right now. But no, you just whine about how it’s not really your fault everyone is so mean…..\nVD:\nDefending Boomers and trying to\nex post facto\nredefine “Boomer” as an anti-white slur is one way to ensure that virtually no GenX or Millennial will ever pay any attention to you.\nBecause we were there.\nWe saw what they consciously chose from our earliest years. We lived in the America that they smugly rejected and ruined. The Boomers collectively were, and are, a wicked generation. They remain wicked and they revel in their collective identity to this day. The fact that evil influences exist does not excuse in any way those who chose evil new ways in preference to that which is traditional and good. And if you are defending Boomers and their dreadful choices that have led to the consequences we observe today, then you are an enemy of the Good, the Beautiful, and the True.\nHere is the point: you are always responsible for whom you choose to follow. The temptation is not the sin. The Boomers were tempted by, and consciously chose, a broad and easy path with cheap credit, easy morals, and great ethnic food. We are attempting to forge a different path.\nUPDATE:\nThis may be the best summation of the Boomer philosophy that I’ve seen:\n“The moralizing of objectively false platitudes in the face of their observable failure.”\nUPDATE:\nThe Boomers\nwill hear no criticism of their actions\n, and they believe the only reason anyone would ever criticize them is due to bitterness at their own failures. Words are insufficient for how utterly despicable they are. To hear the Boomer is to hate the Boomer.\nDISCUSS ON SG",
  "tags": [
    "Baby Boomers",
    "history",
    "philosophy"
  ],
  "categories": [],
  "sitemap_lastmod": "2023-11-05T20:10:36+00:00"
}