{
  "url": "https://voxday.net/2023/11/20/ideology-is-rhetoric/",
  "scraped_at": "2026-01-08T14:15:56.348351",
  "title": "Ideology is Rhetoric",
  "date_display": "November 20, 2023",
  "date_iso": "2023-11-20T14:08:13+00:00",
  "date_from_url": "2023-11-20",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><div class=\"wp-block-image\"><figure class=\"aligncenter size-full\"><img alt=\"\" class=\"wp-image-60523\" decoding=\"async\" fetchpriority=\"high\" height=\"390\" sizes=\"(max-width: 512px) 100vw, 512px\" src=\"https://voxday.net/wp-content/uploads/2023/11/image-50.png\" srcset=\"https://voxday.net/wp-content/uploads/2023/11/image-50.png 512w, https://voxday.net/wp-content/uploads/2023/11/image-50-300x229.png 300w\" width=\"512\"/></figure></div><p>I wouldn’t get too excited about the election of Javier Milei in Argentina. If there is one thing that we have learned from more than 100 years of democracy in America and elsewhere, it is that ideology is usually an irrelevant mask for the true objectives of those the elected politician serves.</p><p>In <em>END TIMES</em>, Peter Turchin cites compelling and reasonably comprehensive data analysis that proves the democratic will of the people in the United States <em>has absolutely no influence</em> on the policies put into place by their elected leaders, by means of a large-scale comparison of their policy preferences with the resulting policies put into place by their government.</p><blockquote class=\"wp-block-quote is-layout-flow wp-block-quote-is-layout-flow\"><p>The political scientist Martin Gilens, aided by a small army of research assistants, gathered a large data set—nearly two thousand policy issues between 1981 and 2002. Each case matched a proposed policy change to a national opinion survey asking a favor/oppose question about the initiative. The raw survey data provided information that enabled Gilens to separate the preferences of the poor (in the lowest decile of the income distribution) and the typical (the median of the distribution) from the affluent (the top 10 percent).</p><p>Statistical analysis of this remarkable data set showed that the preferences of the poor had no effect on policy changes. This is not entirely unexpected. What is surprising is that there was no—zilch, nada—effect of the average voter. The main effect on the direction of change was due to the policy preferences of the affluent. There was also an additional effect of interest groups, the most influential ones being business-oriented lobbies. Once you include in the statistical model the preferences of the top 10 percent and the interest groups, the effect of the commoners is statistically indistinguishable from zero.</p> <cite>Peter Turchin, END TIMES: Elites, Counterelites, and the Path of Political Disintegration, 2023</cite></blockquote><p>In a highly relevant essay, the Bronze Age Pervert explains why “economic populists” <a href=\"https://mansworldmag.online/the-populist-moment-never-happened/\">always end up betraying the nation</a> they are nominally supposed to represent, regardless of whether they are considered “right-wing” or “left-wing”. This is why ideology is irrelevant. It doesn’t matter very much if you elect Ronald Reagan, Donald Trump, Barack Obama, Tony Blair, Boris Johnson, or the Irish Republican Army, as their collective answer to everything is always: <em>open the doors wider, bring in more immigrants, flood the nation!</em></p><p>It is also why China, and to a lesser extent, Russia, are very good bets to defeat the denationalized remnants of the adulterated nations of the West. In both great powers, the nation always comes before ideology. Stalin transmuted the international socialist revolution into national communism, while in China nationalism is built right into the ideology, as even socialism is required to have “Chinese characteristics”.</p><blockquote class=\"wp-block-quote is-layout-flow wp-block-quote-is-layout-flow\"><p>Consider for example that the doors of Argentina have been busted wide open to mass migration. This has been done despite the economic populist and nationalist language that Bannonites invoke in America and that Peronists have used even more aggressively in Argentina. I find it fascinating that all left-populist and economic populist platform nations or regions have this same result by the way. Ireland did, so does Basque Country in Spain — ETA being the spirit of that region and along with the Kurdish PKK one of the old and dependable factions of the international “nationalist left.” But all are flooded with migrants. To look into the reasons why I will again leave for another time but I suspect that, although when out of power such parties insinuate that migrants are being let in for “cheap labor” as a conspiracy by Capital or devious capitalists who plan to build an orbital station like in Elysium movie; and so they promise — maybe genuinely — the lower middle and middle classes that they will stop this migration and improve the labor market, wages, and their economic condition. But then once in power, left-populist parties discover that the migrants were never being brought in by capitalists for Machiavellian reasons; that at most, the capitalists were being bought off, and not all the capitalists but only some industries, who were allowed to profit and who therefore complied… although it’s unclear their willingness to comply or not would have been at all relevant. That the migrants were in fact being brought in primarily as political clients and political tools for the left and by those who opposed “the rich” — a shifting definition that often comes to include much of the middle class as well. And so the logic of this is irresistible to “economic populist” parties once in power for some time, regardless of their initial rhetoric about the “pauperization of the proletariat finally coming true through the vehicle of mass migration.” If your position is “the poor and conservative many against the decadent and predatory Elite and rich,” why wouldn’t you come to see millions of foreign poor “decent family people” as your allies? Economic populists, even when they have open nationalist and ethnic rhetoric in their beginnings, will always abandon this in favor of importing new clients, and it is rational for them to do so. In many cases they don’t in fact have specifically racial, or national or ethnic-cultural language even by the way: many rightists are dumbly misled when a leftist starts to inveigh against “globalism,” the “IMF,” “international Anglo-Liberalism,” “the transnational elites,” and many such things, into thinking that such a person must surely want to preserve the demographic and cultural characteristics of a particular country or region. But that’s almost never the case: importing millions of Paraguayans, Peruvians, Bolivians in Argentina, or migrants in Basque Country or Ireland may actually come to be seen as “yes we are importing good family people who will stand with us in native solidarity against globalism, Capital, and Neoliberal atomization.” And that is in fact what happened.</p> <cite>The Populist Moment Never Happened</cite></blockquote><p>The point is that if <a href=\"https://social.infogalactic.com/micropost/618668d3-243d-4389-bd92-2b7c6fed90df\">Ben Shapiro is publicly celebrating </a>the election of a political leader who is an immigrant Catholic apostate, the chances that the new president-elect has any intention of governing the Argentine nation to its actual benefit are not very favorable, no matter what ideology he purports to espouse.</p><p><em><a href=\"https://social.infogalactic.com/micropost/5275a35f-d20c-4e83-ac9b-095979534244\">DISCUSS ON SG</a></em></p></div>",
  "content_text": "I wouldn’t get too excited about the election of Javier Milei in Argentina. If there is one thing that we have learned from more than 100 years of democracy in America and elsewhere, it is that ideology is usually an irrelevant mask for the true objectives of those the elected politician serves.\nIn\nEND TIMES\n, Peter Turchin cites compelling and reasonably comprehensive data analysis that proves the democratic will of the people in the United States\nhas absolutely no influence\non the policies put into place by their elected leaders, by means of a large-scale comparison of their policy preferences with the resulting policies put into place by their government.\nThe political scientist Martin Gilens, aided by a small army of research assistants, gathered a large data set—nearly two thousand policy issues between 1981 and 2002. Each case matched a proposed policy change to a national opinion survey asking a favor/oppose question about the initiative. The raw survey data provided information that enabled Gilens to separate the preferences of the poor (in the lowest decile of the income distribution) and the typical (the median of the distribution) from the affluent (the top 10 percent).\nStatistical analysis of this remarkable data set showed that the preferences of the poor had no effect on policy changes. This is not entirely unexpected. What is surprising is that there was no—zilch, nada—effect of the average voter. The main effect on the direction of change was due to the policy preferences of the affluent. There was also an additional effect of interest groups, the most influential ones being business-oriented lobbies. Once you include in the statistical model the preferences of the top 10 percent and the interest groups, the effect of the commoners is statistically indistinguishable from zero.\nPeter Turchin, END TIMES: Elites, Counterelites, and the Path of Political Disintegration, 2023\nIn a highly relevant essay, the Bronze Age Pervert explains why “economic populists”\nalways end up betraying the nation\nthey are nominally supposed to represent, regardless of whether they are considered “right-wing” or “left-wing”. This is why ideology is irrelevant. It doesn’t matter very much if you elect Ronald Reagan, Donald Trump, Barack Obama, Tony Blair, Boris Johnson, or the Irish Republican Army, as their collective answer to everything is always:\nopen the doors wider, bring in more immigrants, flood the nation!\nIt is also why China, and to a lesser extent, Russia, are very good bets to defeat the denationalized remnants of the adulterated nations of the West. In both great powers, the nation always comes before ideology. Stalin transmuted the international socialist revolution into national communism, while in China nationalism is built right into the ideology, as even socialism is required to have “Chinese characteristics”.\nConsider for example that the doors of Argentina have been busted wide open to mass migration. This has been done despite the economic populist and nationalist language that Bannonites invoke in America and that Peronists have used even more aggressively in Argentina. I find it fascinating that all left-populist and economic populist platform nations or regions have this same result by the way. Ireland did, so does Basque Country in Spain — ETA being the spirit of that region and along with the Kurdish PKK one of the old and dependable factions of the international “nationalist left.” But all are flooded with migrants. To look into the reasons why I will again leave for another time but I suspect that, although when out of power such parties insinuate that migrants are being let in for “cheap labor” as a conspiracy by Capital or devious capitalists who plan to build an orbital station like in Elysium movie; and so they promise — maybe genuinely — the lower middle and middle classes that they will stop this migration and improve the labor market, wages, and their economic condition. But then once in power, left-populist parties discover that the migrants were never being brought in by capitalists for Machiavellian reasons; that at most, the capitalists were being bought off, and not all the capitalists but only some industries, who were allowed to profit and who therefore complied… although it’s unclear their willingness to comply or not would have been at all relevant. That the migrants were in fact being brought in primarily as political clients and political tools for the left and by those who opposed “the rich” — a shifting definition that often comes to include much of the middle class as well. And so the logic of this is irresistible to “economic populist” parties once in power for some time, regardless of their initial rhetoric about the “pauperization of the proletariat finally coming true through the vehicle of mass migration.” If your position is “the poor and conservative many against the decadent and predatory Elite and rich,” why wouldn’t you come to see millions of foreign poor “decent family people” as your allies? Economic populists, even when they have open nationalist and ethnic rhetoric in their beginnings, will always abandon this in favor of importing new clients, and it is rational for them to do so. In many cases they don’t in fact have specifically racial, or national or ethnic-cultural language even by the way: many rightists are dumbly misled when a leftist starts to inveigh against “globalism,” the “IMF,” “international Anglo-Liberalism,” “the transnational elites,” and many such things, into thinking that such a person must surely want to preserve the demographic and cultural characteristics of a particular country or region. But that’s almost never the case: importing millions of Paraguayans, Peruvians, Bolivians in Argentina, or migrants in Basque Country or Ireland may actually come to be seen as “yes we are importing good family people who will stand with us in native solidarity against globalism, Capital, and Neoliberal atomization.” And that is in fact what happened.\nThe Populist Moment Never Happened\nThe point is that if\nBen Shapiro is publicly celebrating\nthe election of a political leader who is an immigrant Catholic apostate, the chances that the new president-elect has any intention of governing the Argentine nation to its actual benefit are not very favorable, no matter what ideology he purports to espouse.\nDISCUSS ON SG",
  "tags": [
    "history",
    "immigration",
    "politics",
    "rhetoric"
  ],
  "categories": [],
  "sitemap_lastmod": "2023-11-20T14:08:15+00:00"
}