{
  "url": "https://voxday.net/2023/11/05/in-which-i-express-a-heartfelt-apology/",
  "scraped_at": "2026-01-08T14:14:26.399136",
  "title": "In Which I Express A Heartfelt Apology",
  "date_display": "November 5, 2023",
  "date_iso": "2023-11-05T00:15:03+00:00",
  "date_from_url": "2023-11-05",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p><em>This beautiful piece by my PR agent, Pax Dickenson, appears to be disappearing from the various archive sites, which themselves appear to be disappearing as the Zero Historians attack the Internet now that racism and problematic history in statuary has been satisfactorily addressed. And we simply cannot permit that to happen to what is nothing less than a glorious work of performance art and the pinnacle of positive media relations.</em></p><p>A fortnight ago I was contacted by a Ms. Amanda Robb, who identified herself as a journalist. Having had a <a href=\"https://reason.com/archives/2015/07/09/the-social-media-shaming-of-pax-dickinso\">personal history of difficulty</a> with unsavory wretches of that sort, and being a <a href=\"https://archive.fo/RaVto\">well-known proponent of a harsh criminal punishment</a> for their un-American collectivist scribblings, I of course immediately recommended that Ms. Robb engage in a vigorous act of self-procreation.</p><p>Ms. Robb, however, would not be deterred. She (I did not ask her pronoun, regrettably, so I must assume) was earnestly seeking my comment regarding traditionalist superhero comic books and the manners and methods of aggregating funds for the production of such. The aggressively persistent Ms. Robb told me she is a journalist for the widely known (none would say ‘popular’, but it is widely known) Rolling Stone magazine; which magazine, I learned, is not actually solely published for <a href=\"https://www.rollingstone.com/movies/features/johnny-depp-lawsuit-marriage-w521671\">manipulative character assassinations of washed-up entertainers</a> and the dissemination of <a href=\"https://en.wikipedia.org/wiki/A_Rape_on_Campus\">libelous false rape accusations against innocent frat boys</a>, but purports to do Actual Journalism. I questioned this ambition, of course, but Ms. Robb assured me that the former incautious Rolling Stone editors responsible for the recent libelous rape fiction had been quite thoroughly sacked after the <a href=\"https://www.nytimes.com/2017/06/13/business/media/rape-uva-rolling-stone-frat.html\">massive financial settlement</a> and had been replaced by a new crop of editors who were assuredly much cleverer about not being found responsible for making things up in any legally actionable way.</p><p>Upon perusing Ms. Robb’s prior work at <a href=\"https://www.marieclaire.com/author/3432/amanda-robb/\">Marie Claire</a>, <a href=\"https://www.theguardian.com/commentisfree/2014/oct/01/george-zimmerman-darren-wilson-crowd-sourced-legal-fees\">The Guardian</a> and with <a href=\"https://www.theinvestigativefund.org/\">The Investigative Fund</a> of <a href=\"https://www.thenation.com/\">The Nation Magazine</a>, which focused on <a href=\"https://www.marieclaire.com/health-fitness/news/a271/mcx10-06-lastclinic-10-06/\">baby-killing tips</a>, a <a href=\"https://www.rollingstone.com/politics/news/pizzagate-anatomy-of-a-fake-news-scandal-w511904\">convenient debunking of investigations of elite pedophile rings</a>, and <a href=\"https://www.nationalobserver.com/2016/07/01/opinion/amanda-robb-hell-inner-beauty\">Ms. Robb’s personal experiences with extensive plastic surgery</a>, I could only conclude Ms. Robb must be undoubtedly amongst the finest of politically axe-grinding journalists working in stale Boomer left-wing pop music magazines today.</p><p>I explained to Ms. Robb that I have retired to the quiet life of a simple gentleman farmer, knew and cared little about comic books, and did not seek further attention from the media-propaganda complex. I further explained that I considered her employers and her “profession” (such that it is) to be distasteful at best and criminal at worst, and that I expected she might not have the best of intentions toward me given my <a href=\"http://blog.dilbert.com/2017/03/22/some-fake-news-about-me-from-bloomberg/\">knowledge about how modern journalism is done</a> and my <a href=\"http://valleywag.gawker.com/business-insider-ctos-is-your-new-tech-bro-nightmare-1280336916\">past experiences being a subject of the yellow press</a>. I directly and forthrightly informed Ms. Robb that I considered her to be my enemy and refused to help her. Ms. Robb, however, was not to be discouraged by any such declaration.</p><p>Ms. Robb insisted on an interview despite my pugnacious resistance and emphatically asserted that it would be helpful for her story. Worn down by her insipid pleadings, I reluctantly agreed, and set up a meeting with her in New York City for the next afternoon. I wasn’t in New York City, and in fact I was at my home over one hundred miles away from New York City. I had absolutely no ability or plans to be in New York City by that next day, but Ms. Robb was so insistent that I decided to just make the appointment with her and hope for the best.</p><p>At the appointed time, for security reasons, I texted Ms. Robb to change the location to a different one at which I hoped to somehow be, despite never having left my home, which is, as I said, over one hundred miles away. She “never got” my message until she was home, so it all worked out. Except for the small detail of actually doing an interview. I was quite comfortable with this outcome but regrettably Ms. Robb was less than satisfied.</p><p>I explained to Ms. Robb that I lived over one hundred miles away from New York City and I wasn’t planning any trips to New York City in the foreseeable future, so any interview was simply impossible. Ms. Robb immediately suggested driving the three hours to rural Pennsylvania to talk to me. I demurred, but she explained that comic books and the manners and methods of procuring funds for the production of such was of such importance, she would gladly drive over one hundred miles to talk to me despite my repeated professions of ignorance and declarations of refusal to help.</p><p>I agreed but explained that I required significant security measures for meetings with the disreputable journalist class she represented, and she would have to follow my security directives to the letter in order to get her interview.</p><p>First, I ordered her to purchase a bright red Make America Great Again hat at Trump Tower before her trip. I explained that the fashionable hat would cost $35 due to its quality American-made construction, but assured her that her paymasters at Rolling Stone magazine would certainly reimburse her. I explained that I needed her to have the hat for identification purposes later. I also sent her an address to a closed restaurant 3 hours drive from New York and told her to go to that location and await further instructions.</p><p>On the appointed date, she eventually arrived, later than the expected time as is the wont of her gender and profession, but arrived nonetheless. I directed her to the next rendezvous point, a small restaurant with outdoor seating 30 minutes drive further west. I told her that upon arrival at this location, she should sit outside and send me a ‘selfie’ with the red MAGA hat on, in order to confirm her arrival and help me identify her.</p><div class=\"wp-block-image\"><figure class=\"aligncenter size-full\"><img alt=\"\" class=\"wp-image-60292\" decoding=\"async\" fetchpriority=\"high\" height=\"259\" src=\"https://voxday.net/wp-content/uploads/2023/11/image-8.png\" width=\"194\"/></figure></div><p>At this point, the entire endeavor had been going precisely according to plan, so I’m not sure what explains Ms. Robb’s clear expression of annoyance in the selfie I received. Perhaps she had a premonition of the unfortunate disappointment to come, via some oracular power, as some of the distaff sex have been known to possess. However, given the remainder of this tale, Ms. Robb’s psychic ability seems scant.</p><p>I directed Ms. Robb up the hill and to a pleasant location near the lake in the nearby State Park where I imagine that I might have waited, had I actually left my house, which I hadn’t. She expressed reluctance, and then seemingly became confused, sending me a picture of a park sign at the shale pit instead of the lake.</p><p>As if a knowledgeable and well-placed journalistic source like myself would imagine hanging out in a dusty shale pit. In retrospect, I suppose a state park with dozens of ambiguous signs marking half a dozen non-interconnecting entrances and extremely spotty cell phone service was not the best choice of rendezvous location. By the time Ms. Robb had arrived at the exact location where I had imagined I might be, I unfortunately was no longer imagining myself there anymore. I certainly tried my best to find Ms. Robb, despite never having left my house, which was, as I said, over a dozen miles away from the park.</p><p>Having imagined myself in a place with such spotty cell phone service, I was unable to reply to Ms. Robb’s repeated messages looking for me until quite a while later. When I was able to imagine myself in better conditions, I found that she had meandered all over the park in a futile attempt to find the place I had imagined I might be. After a distinct lack of success she then booked a nearby hotel room and informed me that she was prepared to await a more auspicious outcome on the morrow. Not wanting to disappoint, I proposed a very early 6:30 a.m. meeting at Cracker Barrel for the next morning, which Ms. Robb graciously accepted.</p><p>Unfortunately, that breakfast was to remain one cracker short of a barrel. In an unforeseen turn of events, I was hypothetically summoned at sunrise to aid a neighbor in rounding up a dozen escaped hogs.</p><p>Engaged as I was in these pretend porcine shenanigans, I quite reasonably missed the time for my breakfast meeting with Ms. Robb. I communicated my regrets to her shortly thereafter. She asked if we could instead meet that afternoon but I suggested meeting that evening after I had sufficiently recovered from my swine herding efforts.</p><p>That night I changed the time of our dinner from 7:30 p.m. to 9:00 p.m., on a whim, just to keep Ms. Robb entertained. At this time she informed me that her editors were getting irritated. The thought of the finest political editors in the Boomer Left pop music magazine business being personally irritated with my humble antics left me filled with amused pity. Later, I messaged Ms. Robb to tell her I had been delayed by a henway. She not unreasonably asked, “What’s a henway?” to which I of course replied, “About three pounds.” She didn’t understand this, and then began to rudely question my subsequent promise to arrive in a “BOFA” (Brisk Or Fast Arrival–a well-known acronym).</p><p>I finally decided that I had had enough of the rudeness of the press for that day, and let her know that the only BOFA she should be expecting was BOFA DEEZ NUTZ.</p><p>In conclusion, I’d like to say that I’m truly sorry we had such trouble arranging to meet up, Ms. Robb.</p><p>I realize that journalism depends on good faith and trust between journalists and sources, and I’d hate to see our repeated poor luck inspire unscrupulous or mischievous fellows to waste the time of well-meaning journalists like yourself. If journalists had to wonder every time they made an appointment and were required to buy a right-wing hat if this was some sort of trick to embarrass them, it’s possible that no journalism would ever get done at all. Is that the kind of world you want to live in? I don’t. I’d be worried about all the blood rushing out of my brain from the massive schadenfreude erection I would get.</p><p>P.S. Ms. Robb, shall we try once more? I’ll be at Famous Ray’s pizza in Brooklyn on Tuesday at noon. No, the other one. This time, I swear I’ll show up.</p><p>P.P.S. Wear the hat.</p><p><em><a href=\"https://social.infogalactic.com/micropost/d004ddcc-b5d4-4475-bc5b-18b8a961b7a0\">DISCUSS ON SG</a></em></p></div>",
  "content_text": "This beautiful piece by my PR agent, Pax Dickenson, appears to be disappearing from the various archive sites, which themselves appear to be disappearing as the Zero Historians attack the Internet now that racism and problematic history in statuary has been satisfactorily addressed. And we simply cannot permit that to happen to what is nothing less than a glorious work of performance art and the pinnacle of positive media relations.\nA fortnight ago I was contacted by a Ms. Amanda Robb, who identified herself as a journalist. Having had a\npersonal history of difficulty\nwith unsavory wretches of that sort, and being a\nwell-known proponent of a harsh criminal punishment\nfor their un-American collectivist scribblings, I of course immediately recommended that Ms. Robb engage in a vigorous act of self-procreation.\nMs. Robb, however, would not be deterred. She (I did not ask her pronoun, regrettably, so I must assume) was earnestly seeking my comment regarding traditionalist superhero comic books and the manners and methods of aggregating funds for the production of such. The aggressively persistent Ms. Robb told me she is a journalist for the widely known (none would say ‘popular’, but it is widely known) Rolling Stone magazine; which magazine, I learned, is not actually solely published for\nmanipulative character assassinations of washed-up entertainers\nand the dissemination of\nlibelous false rape accusations against innocent frat boys\n, but purports to do Actual Journalism. I questioned this ambition, of course, but Ms. Robb assured me that the former incautious Rolling Stone editors responsible for the recent libelous rape fiction had been quite thoroughly sacked after the\nmassive financial settlement\nand had been replaced by a new crop of editors who were assuredly much cleverer about not being found responsible for making things up in any legally actionable way.\nUpon perusing Ms. Robb’s prior work at\nMarie Claire\n,\nThe Guardian\nand with\nThe Investigative Fund\nof\nThe Nation Magazine\n, which focused on\nbaby-killing tips\n, a\nconvenient debunking of investigations of elite pedophile rings\n, and\nMs. Robb’s personal experiences with extensive plastic surgery\n, I could only conclude Ms. Robb must be undoubtedly amongst the finest of politically axe-grinding journalists working in stale Boomer left-wing pop music magazines today.\nI explained to Ms. Robb that I have retired to the quiet life of a simple gentleman farmer, knew and cared little about comic books, and did not seek further attention from the media-propaganda complex. I further explained that I considered her employers and her “profession” (such that it is) to be distasteful at best and criminal at worst, and that I expected she might not have the best of intentions toward me given my\nknowledge about how modern journalism is done\nand my\npast experiences being a subject of the yellow press\n. I directly and forthrightly informed Ms. Robb that I considered her to be my enemy and refused to help her. Ms. Robb, however, was not to be discouraged by any such declaration.\nMs. Robb insisted on an interview despite my pugnacious resistance and emphatically asserted that it would be helpful for her story. Worn down by her insipid pleadings, I reluctantly agreed, and set up a meeting with her in New York City for the next afternoon. I wasn’t in New York City, and in fact I was at my home over one hundred miles away from New York City. I had absolutely no ability or plans to be in New York City by that next day, but Ms. Robb was so insistent that I decided to just make the appointment with her and hope for the best.\nAt the appointed time, for security reasons, I texted Ms. Robb to change the location to a different one at which I hoped to somehow be, despite never having left my home, which is, as I said, over one hundred miles away. She “never got” my message until she was home, so it all worked out. Except for the small detail of actually doing an interview. I was quite comfortable with this outcome but regrettably Ms. Robb was less than satisfied.\nI explained to Ms. Robb that I lived over one hundred miles away from New York City and I wasn’t planning any trips to New York City in the foreseeable future, so any interview was simply impossible. Ms. Robb immediately suggested driving the three hours to rural Pennsylvania to talk to me. I demurred, but she explained that comic books and the manners and methods of procuring funds for the production of such was of such importance, she would gladly drive over one hundred miles to talk to me despite my repeated professions of ignorance and declarations of refusal to help.\nI agreed but explained that I required significant security measures for meetings with the disreputable journalist class she represented, and she would have to follow my security directives to the letter in order to get her interview.\nFirst, I ordered her to purchase a bright red Make America Great Again hat at Trump Tower before her trip. I explained that the fashionable hat would cost $35 due to its quality American-made construction, but assured her that her paymasters at Rolling Stone magazine would certainly reimburse her. I explained that I needed her to have the hat for identification purposes later. I also sent her an address to a closed restaurant 3 hours drive from New York and told her to go to that location and await further instructions.\nOn the appointed date, she eventually arrived, later than the expected time as is the wont of her gender and profession, but arrived nonetheless. I directed her to the next rendezvous point, a small restaurant with outdoor seating 30 minutes drive further west. I told her that upon arrival at this location, she should sit outside and send me a ‘selfie’ with the red MAGA hat on, in order to confirm her arrival and help me identify her.\nAt this point, the entire endeavor had been going precisely according to plan, so I’m not sure what explains Ms. Robb’s clear expression of annoyance in the selfie I received. Perhaps she had a premonition of the unfortunate disappointment to come, via some oracular power, as some of the distaff sex have been known to possess. However, given the remainder of this tale, Ms. Robb’s psychic ability seems scant.\nI directed Ms. Robb up the hill and to a pleasant location near the lake in the nearby State Park where I imagine that I might have waited, had I actually left my house, which I hadn’t. She expressed reluctance, and then seemingly became confused, sending me a picture of a park sign at the shale pit instead of the lake.\nAs if a knowledgeable and well-placed journalistic source like myself would imagine hanging out in a dusty shale pit. In retrospect, I suppose a state park with dozens of ambiguous signs marking half a dozen non-interconnecting entrances and extremely spotty cell phone service was not the best choice of rendezvous location. By the time Ms. Robb had arrived at the exact location where I had imagined I might be, I unfortunately was no longer imagining myself there anymore. I certainly tried my best to find Ms. Robb, despite never having left my house, which was, as I said, over a dozen miles away from the park.\nHaving imagined myself in a place with such spotty cell phone service, I was unable to reply to Ms. Robb’s repeated messages looking for me until quite a while later. When I was able to imagine myself in better conditions, I found that she had meandered all over the park in a futile attempt to find the place I had imagined I might be. After a distinct lack of success she then booked a nearby hotel room and informed me that she was prepared to await a more auspicious outcome on the morrow. Not wanting to disappoint, I proposed a very early 6:30 a.m. meeting at Cracker Barrel for the next morning, which Ms. Robb graciously accepted.\nUnfortunately, that breakfast was to remain one cracker short of a barrel. In an unforeseen turn of events, I was hypothetically summoned at sunrise to aid a neighbor in rounding up a dozen escaped hogs.\nEngaged as I was in these pretend porcine shenanigans, I quite reasonably missed the time for my breakfast meeting with Ms. Robb. I communicated my regrets to her shortly thereafter. She asked if we could instead meet that afternoon but I suggested meeting that evening after I had sufficiently recovered from my swine herding efforts.\nThat night I changed the time of our dinner from 7:30 p.m. to 9:00 p.m., on a whim, just to keep Ms. Robb entertained. At this time she informed me that her editors were getting irritated. The thought of the finest political editors in the Boomer Left pop music magazine business being personally irritated with my humble antics left me filled with amused pity. Later, I messaged Ms. Robb to tell her I had been delayed by a henway. She not unreasonably asked, “What’s a henway?” to which I of course replied, “About three pounds.” She didn’t understand this, and then began to rudely question my subsequent promise to arrive in a “BOFA” (Brisk Or Fast Arrival–a well-known acronym).\nI finally decided that I had had enough of the rudeness of the press for that day, and let her know that the only BOFA she should be expecting was BOFA DEEZ NUTZ.\nIn conclusion, I’d like to say that I’m truly sorry we had such trouble arranging to meet up, Ms. Robb.\nI realize that journalism depends on good faith and trust between journalists and sources, and I’d hate to see our repeated poor luck inspire unscrupulous or mischievous fellows to waste the time of well-meaning journalists like yourself. If journalists had to wonder every time they made an appointment and were required to buy a right-wing hat if this was some sort of trick to embarrass them, it’s possible that no journalism would ever get done at all. Is that the kind of world you want to live in? I don’t. I’d be worried about all the blood rushing out of my brain from the massive schadenfreude erection I would get.\nP.S. Ms. Robb, shall we try once more? I’ll be at Famous Ray’s pizza in Brooklyn on Tuesday at noon. No, the other one. This time, I swear I’ll show up.\nP.P.S. Wear the hat.\nDISCUSS ON SG",
  "tags": [
    "media",
    "SJW"
  ],
  "categories": [],
  "sitemap_lastmod": "2023-11-05T00:18:01+00:00"
}