{
  "url": "https://voxday.net/2023/11/15/interview-with-john-julius-norwich/",
  "scraped_at": "2026-01-08T14:15:26.524036",
  "title": "Interview with John Julius Norwich",
  "date_display": "November 15, 2023",
  "date_iso": "2023-11-15T11:18:51+00:00",
  "date_from_url": "2023-11-15",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>This is an automated transcription of an interview with the late English popular historian, John Julius Cooper, 2nd Viscount Norwich, CVO, recorded in 2011.</p><p><strong>VOX DAY: </strong>I’m delighted to be able to tell you today that my guest is one of my favourite historians, John Julius Norwich. He’s the author of more than 20 books including <em>A History of Venice</em>, <em>Byzantium: The Decline and Fall</em>, <em>Shakespeare’s Kings</em>, as well as his recently published memoirs entitled <em>Trying to Please</em>. Lord Norwich, welcome to the podcast. Western culture has always been obsessed with the Western Roman Empire, and paid relatively little attention to the Eastern Roman Empire, so to what do you attribute this general lack of attention or interest in the Byzantines versus the ancient Greeks and Romans?</p><p><strong>JOHN JULIUS NORWICH: </strong>I think largely that… I mean, I didn’t. I had the sort of ordinary interest in the Greeks and Romans, because that’s what you have. If you go to school in England, you know, you go to public school education, you learn a lot about the Greeks and the Romans. But the interesting thing in England is that you never, never get any education at all about the Eastern Roman Empire, about Byzantium. It’s a conspiracy of silence, and it has been for the last 200 years. And I fell in love with the Byzantine Empire really, largely because of my friend, <a href=\"https://infogalactic.com/info/Patrick_Leigh_Fermor\">Patrick Leigh Fermor</a>, who died last week, who was the greatest archeologist and a scholar of it, and who I went on a cruise around Eastern Mediterranean with. And also when, in 1955, when I joined the Foreign Service, My first post was Belgrade, in Serbia, or Yugoslavia as it was in those days, and I was just sort of swept up in the whole. That seemed to me the sort of the whole mystery and the magic of the Orthodox Church and the Eastern Roman Empire and Byzantium and all that. I suppose I’ve been swept up in it ever since.</p><p>VD: To what do you attribute the fact that it was a mystery to you? I mean, it’s certainly a mystery to Americans, we don’t spend any time learning about it either. Why is there such ignorance of it?</p><p>JJN: Why is there a conspiracy of silence? Precisely. I wish I knew. I went through what I’m sure would have been considered a very good English public school education at Eton. And I hardly knew what Byzantium was. I’m not sure that I knew whether it was Christian or Muslim. I’m not sure whether I don’t think I knew anything about it at all. And because nobody ever mentioned it all throughout my schooling. And I think I was not alone in this. I mean, people just didn’t. It was never taken seriously by English educationists.</p><p>VD: Constantine’s decision to move his capital from Rome to Byzantium was one of the more monumental decisions in history.</p><p>JJN: Yes, it tends to distract the reader, as if Obama had suddenly decided to move the US Capitol from Washington, DC to Mexico City.</p><p>VD: What was behind Constantine’s decision to establish a new capital? And why did the eastern half of the Empire survive so much longer than the Western one did?</p><p>JJN: Well, the capital had really, to all intents and purposes already left Rome. I mean, what happened already in this, in the second century? The second century AD, the whole focus of political and cultural activity, is moving to the east, is moving east from Rome, to the eastern Mediterranean. I mean, if you read the Acts of the Apostles, or if, if you read any of that stuff, I mean, it is it is in Asia Minor on the eastern Mediterranean, that everything is happening. Rome has become a backwater, it’s too far away. By this time. The Empire’s principal enemy is Persia, Rome to Persia. I mean, it’s, I don’t know, three or four months probably travel. And it was no it was absolutely necessary to move the capitol to where all the action was. Diocletian did it first. I mean, he, he decided to divide the imprint of the empire into four. And each one had a what he called a Tetrarch. But all four of them were in the east. None of them are in Rome, even then. So when Constantine decided in 332, to move to move the Capitol, it wasn’t a terribly new or revolutionary idea at all. I mean, he was really doing what had already happened. He was just choosing a new a new place. You know, I mean, Nicomedia. Antioquia was three or four other places, which had been tried out and they were very successful. So he just found this new place. which was superbly in a superb defensive position, and said, right, this is it, this is going to be in future capital. Apart from that we’re exactly the same Empire we’ve always been, where we’re Romans whether our empire is the empire of Adios, Nero and Hadrian and Trajan and all that lot. There’s no change, except that we’ve moved to a new capital.</p><p>VD: Why did the eastern half of the Empire survive so much longer than the Western one did?</p><p>JJN: Well, I mean, it’s survived. Very, very surprisingly, it remained. Except for 50 years in the 13th century, it remained undefeated, I mean, the Roman Empire continued under the new capital in Constantinople, and got incredibly powerful and is by far the richest, by far the most powerful state in the in the civilised world. Until two terrible things happen. One was the the surge of checks, the first wave of tax arrived, and defeated the Byzantine army. This was intense. And more or less flooded all over the whole of Asia Minor, which was where Byzantium got most of its food, and nearly all its manpower. And, and then, and then, that was the that was the first great disaster from which from which you’ve never recovered. And the second great disaster, of course, was the Fourth Crusade when the the Christian armies, who should have done everything they could to protect and defend and strengthen this last great outpost of Christianity in the east, turned against it and destroyed it, and left it a poor, pale shred of what it had been before, to the point where, although it lasted another 250 years, God knows how it did it. It really had completely lost its importance.</p><div class=\"wp-block-image\"><figure class=\"aligncenter size-full\"><img alt=\"\" class=\"wp-image-60429\" decoding=\"async\" fetchpriority=\"high\" height=\"521\" sizes=\"(max-width: 512px) 100vw, 512px\" src=\"https://voxday.net/wp-content/uploads/2023/11/image-36.png\" srcset=\"https://voxday.net/wp-content/uploads/2023/11/image-36.png 512w, https://voxday.net/wp-content/uploads/2023/11/image-36-295x300.png 295w\" width=\"512\"/></figure></div> <span id=\"more-60428\"></span><p>VD: Speaking of the Crusades, I don’t know if you bother paying much attention to atheists like Richard Dawkins or not. But one meme that appears over and over again, in the discussion of religion and war, is the Crusades. And is it reasonable to attribute the primary cause of the Crusades to Christian fanaticism? Or is it more complicated than that?</p><p>JJN: The point is really that that after the the Muslims had taken over the, the Holy Land, Palestine and replaces the Christians had always had this idea of obviously trying to win them back for Christianity. And, at last at the very, very end of the 11th century. They did. And the First Crusade, of course, worked. I mean, they recaptured Jerusalem. And they behaved absolutely abominably. I mean, having recaptured Jerusalem, they slaughtered all the Muslims in the city. And they built and they burnt all the Jews alive in the main synagogue. And then they settled down and formed a kingdom. But that was as far as they ever got. Because then the second and third and fourth crusades, which were meant to, I mean, they lost Jerusalem again. In forget about the Second Crusade, it’s important rally, the Third Crusade, they lost Jerusalem to Saladin, and then they all set off again to try and recover it. But they failed. And they had they made their capital in Acre because they no longer had Jerusalem. And they limped along in Acre until the 13th century. And then eventually the the the Turks destroyed them, you know, but I suppose basically as fanaticism is maybe putting it a bit strong, they just wanted to win back the holy places for Christianity. That was really all they tried to do, and ultimately, they failed.</p><p>VD: I always find it a bit interesting given that, as you mentioned, with the fourth crusades, if the focus was the Holy Lands and religion, how on earth did they end up spending the entire war, attacking the Christian capital of Constantinople?</p><p>JJN: Well, I mean, it was perfectly ridiculous. They shouldn’t have. There were the Venetians really were running the show at this point when they were on their way. There had been a palace revolution in Constantinople. And the emperor had been dethroned. And they put it very briefly, he said to the Venetian and the Crusader army, look, if you will put me back on the throne, then I will open up all the Treasury, and I’ll give you all our army, and we will be much stronger, and we will march off against, hold it down, and a far better state than we would have, if you. So would you please reinstate me? Well, they tried to do this, but it was fatal because he was hopeless and everybody was hopeless. So there was sort of chaos for about 18 months, during which time they waited, they, you know, they were still waiting to be paid and, and have all these wonderful new troops and will this money provided for the mother and it didn’t come and it didn’t come? And then it turned out of course, it wasn’t any anyway. So they just turned against the whole of Byzantium and sacked it and destroyed it. In Shia. Anger, rarely, I think Byzantium at this particular moment was very, very hopeless. Indeed, it was under a completely ridiculous hopeless dinners take all the Angela, none of whom was worth anything at all. And they just didn’t keep their promises. And they you know, they were sort of feckless and hopeless. And so the Venetians and the Crusaders just turned against them and took them over and set up a bunch of Frankish crusaders on the threads of the Emperor’s for the next half century.</p><p>VD: One of my favourite histories has always been Stephen Runciman’s three-volume history.</p><p>JJN: Yes, yes, indeed, I know it well.</p><p>VD: And to an amateur like me, there appear to be some similarities between his works on Sicily and the crusades, and your own works on Venice, the Mediterranean and the Byzantine Empire was Runciman, ever an influence on you?</p><p>JJN: Well, I mean, I’m very flattered that you should say so. The difference is that Runciman, whom I knew well and hugely admired, and enjoyed – he was great fun to be with. But he was a serious, serious scholar. I am not, I set about writing history of Byzantium, without knowing a word of Byzantine Greek. Well, that’s not a serious thing for a scholar to do. You know, I don’t write as a scholar, I don’t write I’d never try and find out any, any new bit of history at all. What I try and do is, is to tell a really good story as accurately and as interestingly and amusing as I possibly can. Which is, I’m not I’m not writing for scholars, no scholar, reading any work of mine will find anything he doesn’t know already.</p><p>VD: On the other hand, those of us who are just learning about it for the first time tend to find your work much more accessible.</p><p>JJN: Well, I mean, that’s the point I try to be I try and be accessible, you know, I just try and write it write or write a really good story, for the benefit of people who, like me, are not experts. But maybe they’re going to Istanbul or maybe I don’t know why. And you know, we just like to know a little bit more about where they’re going.</p><p> VD: Who are some of your own favourite historians? JJN: Well, the first and the greatest of all, is Edward Gibbon. I think who is the greatest of them all after him? If we’re talking about, if we’re talking about Byzantium and the eastern Mediterranean, I think after Stephen, I’d probably put Andrew Mango. But Gibbon and Runciman, I think, stand out a mile, above any other.</p><p>VD: In your introduction to a history of Venice, you mentioned that the city made a distinct impression on you at the age of 16. Even though you’re only there for a few hours. Yeah. What happened while you were there to make it such a momentous occasion in your life.</p><p>JJN: I just fell in love with it. I mean, I just find it the most beautiful place I’ve ever been. My father took me around on this long walk all that afternoon. And I hadn’t travelled very much. I mean, the war was just just over So I hadn’t travelled at all during during that time. And before that I was tired. But I just thought this is the most beautiful city I’ve ever been to in my life. And I just couldn’t bear the thought we were going to have to leave it. The same evening as we arrived, you know, we weren’t even there to spend the night. And I set my heart on going back as often as I could. And indeed did. I was lucky. I mean, I went back to well, first of all, very often in those early days, and then, from 1970, I was, I spent half my time writing about his past and the other half trying to look after its future as chairman of the Venice and CO found from 1970 on Venice really sort of took over my life,</p><p>VD: I noticed that you have a lot of Italian language sources in your bibliography in the history of Venice. Do you also speak Italian?</p><p>JJN: I can read Italian quite well, not as easy as I can read English, but I can, I can read it without very much difficulty. My spoken Italian is not spectacularly good. I mean, I can I can get along, you know, but um, I didn’t speak Italian, for example, the way I can speak French. Largely because I’ve never actually taken a lesson in Italian in my life. I’ve just sort of picked up, picked up the language gradually, over many, many, many visits. So all right, I can I can read it all right, which is the important thing. I mean, I, I did find that absolutely necessary when I was writing about Venice, because there are really not enough books in English and French. So there were two or three remarkably good. Italian ones. The best was a man by a man called Rama Nene, who was actually a Venetian. And they were reading my principal source materials.</p><p>VD: If you don’t mind, let’s turn a bit from the past to the present. After a long period of relative peace, Islam appears to have entered another expansionary phase, is this something the West is better equipped to handle now that it has become increasingly secular?</p><p>JJN: I don’t think it’s a total better equipped to handle it. No, I think it may be worse equipped. I mean, I find I find it I find what I see going on around me in this respect, very, very worrying. Indeed. I had thought until 10 years ago, perhaps and until 911, I had thought that the rest of the years of religious wars were virtually now a long, long last over. The last place they continue to edit was in Ireland, where there was still this violence, Protestant Catholic division, and killings, were still going on on quite an important scale. But then when when that was settled with it, it hasn’t actually been completely settled now, as we know, I mean, it still goes on, but we thought it had been settled them. And I thought, well, that’s that now. We really don’t need to worry about religious walls anymore. We’re all okay. We know where we stand and that’s fine. Well, then suddenly, there comes this tremendous upswing of, of Muslim fundamentalism. 911 and all that and suddenly, we’re back to the beginning. And in it looks to me, I go quite often to the Middle East, parts of the Muslim world, but particularly, particularly to Turkey. And I’ve been in Turkey was a completely secular state, as you know, I mean, after, after the First World War, it was as much as your career was worse to be seen going into a mosque. But now the prime minister goes to the mosque every Friday, and everybody’s wearing headscarves. And a lot of a lot of young women in the university. It will be wearing even more I mean, wearing those awful sort of pale pastel coloured overcoats to the ankle, which has always been particularly I think, IBM was in fashion. And there was so many of these girls I saw about seven or eight years ago, wandering around in the In these clothes, but there were also quite a few who weren’t, which meant that the ones who were doing it because they wanted to not because they’ve been told to or were being forced to. They were doing it voluntary because they felt they felt happier that way. And that’s that, that worries me. Because it’s it’s I think I mean, it leads ultimately to, to access and we then get that ridiculous sort of situation where people now far more than ever, in my lifetime, you’ll just see Muslim women were wearing vast black hats covering covering everything, but the slip for the eyes. And these a lot of these women are trying to apply to be become school teachers in England, but there’s no way you can teach. Without showing your face, it seems to me, you know, you can’t just have a voice emerging from a black tent, you need a person, you need a personality, you need a, you know, a character you can identify with. I’m very worried by this by this trend, because it is getting worse, in London every single year. There are more of these back tension rages around, you know.</p><p>VD: Looking at it from the historical perspective, not the political perspective, but the historical perspective. There’s about 500,000 immigrants arriving every year in Great Britain. Yeah. What is the outcome that this sort of mass migration is likely to have?</p><p>JJN: It really depends, I think, on the proportion, who decide to integrate, who decided to say, Okay, we’re in England, we will read on ordinary English life, we won’t wear black tents, or veils or anything, we’ll put ourselves through school and university. And that’s fine. And I mean, those will obviously get absorbed. But for every one of those, I don’t know how many there are of the other sides, who will not want to be absorbed, who will want to go on carrying on the Muslim way, ways of life. And this will lead to a greater and greater gulf, in the population of the country.</p><p>VD: But from a historical perspective, does the culture usually tend to change the immigrants? Or did the immigrants tend to change the culture?</p><p>JJN: Well, I think it works both ways. Lot of cases where the immigrants have actually changed the culture when there has been an enormous immigration. It depends on the size of the immigration, if it’s quite a small immigration, then I think on the whole it doesn’t really affect the culture very much. But with a really huge one, of course it can it can swamp it. And that’s what I’m hoping is not going to happen in this country, but I’m very much afraid it is.</p><p>VD: I always think about the fact that Lombardia, in Italy, is named that way not because the Lombards used to live there, but rather because the Lombards migrated there.</p><p>JJN: Yes, everywhere in Italy, really the people who have migrated. Italy has been such a tremendous melting pot and cauldron of various people and races over so long. That it’s almost impossible now to separate them out, I think 500 years hence, 1000 years hence.</p><p>VD: How do you think the historians of the future will categorise the post world war two period in the West, or the post war period is now been going on about what 760 70 years?</p><p>JJN: We haven’t had another world war. You know, we’ve had a lot of near misses and one or two extremely unpleasant hostilities, these least one of which is still going on today. But on the whole I would say that we have been successful in staving off another world war in staving off the the use of nuclear war warheads weapons of mass destruction which have not touch word thank God being used and which With any luck, we shall be able to continue to to to avoid to keep off. I think that’s that I think that’s all we can say over the future looking back on it because means there are too many imponderables, you really can’t tell you no,</p><p>VD: I have to confess that I haven’t read all of your books I’ve only read-</p><p>JJN: I should be very surprised if you had!</p><p>VD: I’ve only read about seven of them. And <em>The Popes </em>is next on my list. My favourite is probably the Byzantine trilogy. I’m curious to know, looking back on your literary career thus far, which is the work that pleases you the most.</p><p>JJN: I think the first one, or the first two I should say, perhaps, that I ever wrote, on Norman Sicily. The first was called <em>The Normans in the South</em>. And the second was called <em>The Kingdom in the Sun</em>. One was just as equal to the other. And they were the first books I ever wrote. And I was incredibly lucky to find this wonderful subject, which hadn’t been touched before, or barely anywhere have been touched before. And nobody had written about it with any knowledge or enthusiasm. And so I managed to get in there. Yes, I think it still remains my favourite. I’ve enjoyed I really have it. I’ve enjoyed them all. I mean, because I actually liked the process of writing. And I find it satisfying and I find it frequently, actually fun. If if I had to choose another one, I suppose it would be <em>Venice </em>or possibly the Mediterranean, <em>The Middle Sea</em>, one of those two. But I say I really. I’ve enjoyed writing, quite frankly, and I’m pretty pleased with them on the whole. I mean, I don’t think there’s anyone that certainly that I’m ashamed of. On the whole, I’m pretty satisfied with the output.</p><p>VD: Lord Norwich, thank you so much for your time.</p><p>JJN: It’s been a great pleasure talking to you. Likewise, sir. Thank you so much.</p><p><em><a href=\"https://social.infogalactic.com/micropost/6991c2ec-94d1-4c67-803b-2aef2350aaf2\">DISCUSS ON SG</a></em></p></div>",
  "content_text": "This is an automated transcription of an interview with the late English popular historian, John Julius Cooper, 2nd Viscount Norwich, CVO, recorded in 2011.\nVOX DAY:\nI’m delighted to be able to tell you today that my guest is one of my favourite historians, John Julius Norwich. He’s the author of more than 20 books including\nA History of Venice\n,\nByzantium: The Decline and Fall\n,\nShakespeare’s Kings\n, as well as his recently published memoirs entitled\nTrying to Please\n. Lord Norwich, welcome to the podcast. Western culture has always been obsessed with the Western Roman Empire, and paid relatively little attention to the Eastern Roman Empire, so to what do you attribute this general lack of attention or interest in the Byzantines versus the ancient Greeks and Romans?\nJOHN JULIUS NORWICH:\nI think largely that… I mean, I didn’t. I had the sort of ordinary interest in the Greeks and Romans, because that’s what you have. If you go to school in England, you know, you go to public school education, you learn a lot about the Greeks and the Romans. But the interesting thing in England is that you never, never get any education at all about the Eastern Roman Empire, about Byzantium. It’s a conspiracy of silence, and it has been for the last 200 years. And I fell in love with the Byzantine Empire really, largely because of my friend,\nPatrick Leigh Fermor\n, who died last week, who was the greatest archeologist and a scholar of it, and who I went on a cruise around Eastern Mediterranean with. And also when, in 1955, when I joined the Foreign Service, My first post was Belgrade, in Serbia, or Yugoslavia as it was in those days, and I was just sort of swept up in the whole. That seemed to me the sort of the whole mystery and the magic of the Orthodox Church and the Eastern Roman Empire and Byzantium and all that. I suppose I’ve been swept up in it ever since.\nVD: To what do you attribute the fact that it was a mystery to you? I mean, it’s certainly a mystery to Americans, we don’t spend any time learning about it either. Why is there such ignorance of it?\nJJN: Why is there a conspiracy of silence? Precisely. I wish I knew. I went through what I’m sure would have been considered a very good English public school education at Eton. And I hardly knew what Byzantium was. I’m not sure that I knew whether it was Christian or Muslim. I’m not sure whether I don’t think I knew anything about it at all. And because nobody ever mentioned it all throughout my schooling. And I think I was not alone in this. I mean, people just didn’t. It was never taken seriously by English educationists.\nVD: Constantine’s decision to move his capital from Rome to Byzantium was one of the more monumental decisions in history.\nJJN: Yes, it tends to distract the reader, as if Obama had suddenly decided to move the US Capitol from Washington, DC to Mexico City.\nVD: What was behind Constantine’s decision to establish a new capital? And why did the eastern half of the Empire survive so much longer than the Western one did?\nJJN: Well, the capital had really, to all intents and purposes already left Rome. I mean, what happened already in this, in the second century? The second century AD, the whole focus of political and cultural activity, is moving to the east, is moving east from Rome, to the eastern Mediterranean. I mean, if you read the Acts of the Apostles, or if, if you read any of that stuff, I mean, it is it is in Asia Minor on the eastern Mediterranean, that everything is happening. Rome has become a backwater, it’s too far away. By this time. The Empire’s principal enemy is Persia, Rome to Persia. I mean, it’s, I don’t know, three or four months probably travel. And it was no it was absolutely necessary to move the capitol to where all the action was. Diocletian did it first. I mean, he, he decided to divide the imprint of the empire into four. And each one had a what he called a Tetrarch. But all four of them were in the east. None of them are in Rome, even then. So when Constantine decided in 332, to move to move the Capitol, it wasn’t a terribly new or revolutionary idea at all. I mean, he was really doing what had already happened. He was just choosing a new a new place. You know, I mean, Nicomedia. Antioquia was three or four other places, which had been tried out and they were very successful. So he just found this new place. which was superbly in a superb defensive position, and said, right, this is it, this is going to be in future capital. Apart from that we’re exactly the same Empire we’ve always been, where we’re Romans whether our empire is the empire of Adios, Nero and Hadrian and Trajan and all that lot. There’s no change, except that we’ve moved to a new capital.\nVD: Why did the eastern half of the Empire survive so much longer than the Western one did?\nJJN: Well, I mean, it’s survived. Very, very surprisingly, it remained. Except for 50 years in the 13th century, it remained undefeated, I mean, the Roman Empire continued under the new capital in Constantinople, and got incredibly powerful and is by far the richest, by far the most powerful state in the in the civilised world. Until two terrible things happen. One was the the surge of checks, the first wave of tax arrived, and defeated the Byzantine army. This was intense. And more or less flooded all over the whole of Asia Minor, which was where Byzantium got most of its food, and nearly all its manpower. And, and then, and then, that was the that was the first great disaster from which from which you’ve never recovered. And the second great disaster, of course, was the Fourth Crusade when the the Christian armies, who should have done everything they could to protect and defend and strengthen this last great outpost of Christianity in the east, turned against it and destroyed it, and left it a poor, pale shred of what it had been before, to the point where, although it lasted another 250 years, God knows how it did it. It really had completely lost its importance.\nVD: Speaking of the Crusades, I don’t know if you bother paying much attention to atheists like Richard Dawkins or not. But one meme that appears over and over again, in the discussion of religion and war, is the Crusades. And is it reasonable to attribute the primary cause of the Crusades to Christian fanaticism? Or is it more complicated than that?\nJJN: The point is really that that after the the Muslims had taken over the, the Holy Land, Palestine and replaces the Christians had always had this idea of obviously trying to win them back for Christianity. And, at last at the very, very end of the 11th century. They did. And the First Crusade, of course, worked. I mean, they recaptured Jerusalem. And they behaved absolutely abominably. I mean, having recaptured Jerusalem, they slaughtered all the Muslims in the city. And they built and they burnt all the Jews alive in the main synagogue. And then they settled down and formed a kingdom. But that was as far as they ever got. Because then the second and third and fourth crusades, which were meant to, I mean, they lost Jerusalem again. In forget about the Second Crusade, it’s important rally, the Third Crusade, they lost Jerusalem to Saladin, and then they all set off again to try and recover it. But they failed. And they had they made their capital in Acre because they no longer had Jerusalem. And they limped along in Acre until the 13th century. And then eventually the the the Turks destroyed them, you know, but I suppose basically as fanaticism is maybe putting it a bit strong, they just wanted to win back the holy places for Christianity. That was really all they tried to do, and ultimately, they failed.\nVD: I always find it a bit interesting given that, as you mentioned, with the fourth crusades, if the focus was the Holy Lands and religion, how on earth did they end up spending the entire war, attacking the Christian capital of Constantinople?\nJJN: Well, I mean, it was perfectly ridiculous. They shouldn’t have. There were the Venetians really were running the show at this point when they were on their way. There had been a palace revolution in Constantinople. And the emperor had been dethroned. And they put it very briefly, he said to the Venetian and the Crusader army, look, if you will put me back on the throne, then I will open up all the Treasury, and I’ll give you all our army, and we will be much stronger, and we will march off against, hold it down, and a far better state than we would have, if you. So would you please reinstate me? Well, they tried to do this, but it was fatal because he was hopeless and everybody was hopeless. So there was sort of chaos for about 18 months, during which time they waited, they, you know, they were still waiting to be paid and, and have all these wonderful new troops and will this money provided for the mother and it didn’t come and it didn’t come? And then it turned out of course, it wasn’t any anyway. So they just turned against the whole of Byzantium and sacked it and destroyed it. In Shia. Anger, rarely, I think Byzantium at this particular moment was very, very hopeless. Indeed, it was under a completely ridiculous hopeless dinners take all the Angela, none of whom was worth anything at all. And they just didn’t keep their promises. And they you know, they were sort of feckless and hopeless. And so the Venetians and the Crusaders just turned against them and took them over and set up a bunch of Frankish crusaders on the threads of the Emperor’s for the next half century.\nVD: One of my favourite histories has always been Stephen Runciman’s three-volume history.\nJJN: Yes, yes, indeed, I know it well.\nVD: And to an amateur like me, there appear to be some similarities between his works on Sicily and the crusades, and your own works on Venice, the Mediterranean and the Byzantine Empire was Runciman, ever an influence on you?\nJJN: Well, I mean, I’m very flattered that you should say so. The difference is that Runciman, whom I knew well and hugely admired, and enjoyed – he was great fun to be with. But he was a serious, serious scholar. I am not, I set about writing history of Byzantium, without knowing a word of Byzantine Greek. Well, that’s not a serious thing for a scholar to do. You know, I don’t write as a scholar, I don’t write I’d never try and find out any, any new bit of history at all. What I try and do is, is to tell a really good story as accurately and as interestingly and amusing as I possibly can. Which is, I’m not I’m not writing for scholars, no scholar, reading any work of mine will find anything he doesn’t know already.\nVD: On the other hand, those of us who are just learning about it for the first time tend to find your work much more accessible.\nJJN: Well, I mean, that’s the point I try to be I try and be accessible, you know, I just try and write it write or write a really good story, for the benefit of people who, like me, are not experts. But maybe they’re going to Istanbul or maybe I don’t know why. And you know, we just like to know a little bit more about where they’re going.\nVD: Who are some of your own favourite historians? JJN: Well, the first and the greatest of all, is Edward Gibbon. I think who is the greatest of them all after him? If we’re talking about, if we’re talking about Byzantium and the eastern Mediterranean, I think after Stephen, I’d probably put Andrew Mango. But Gibbon and Runciman, I think, stand out a mile, above any other.\nVD: In your introduction to a history of Venice, you mentioned that the city made a distinct impression on you at the age of 16. Even though you’re only there for a few hours. Yeah. What happened while you were there to make it such a momentous occasion in your life.\nJJN: I just fell in love with it. I mean, I just find it the most beautiful place I’ve ever been. My father took me around on this long walk all that afternoon. And I hadn’t travelled very much. I mean, the war was just just over So I hadn’t travelled at all during during that time. And before that I was tired. But I just thought this is the most beautiful city I’ve ever been to in my life. And I just couldn’t bear the thought we were going to have to leave it. The same evening as we arrived, you know, we weren’t even there to spend the night. And I set my heart on going back as often as I could. And indeed did. I was lucky. I mean, I went back to well, first of all, very often in those early days, and then, from 1970, I was, I spent half my time writing about his past and the other half trying to look after its future as chairman of the Venice and CO found from 1970 on Venice really sort of took over my life,\nVD: I noticed that you have a lot of Italian language sources in your bibliography in the history of Venice. Do you also speak Italian?\nJJN: I can read Italian quite well, not as easy as I can read English, but I can, I can read it without very much difficulty. My spoken Italian is not spectacularly good. I mean, I can I can get along, you know, but um, I didn’t speak Italian, for example, the way I can speak French. Largely because I’ve never actually taken a lesson in Italian in my life. I’ve just sort of picked up, picked up the language gradually, over many, many, many visits. So all right, I can I can read it all right, which is the important thing. I mean, I, I did find that absolutely necessary when I was writing about Venice, because there are really not enough books in English and French. So there were two or three remarkably good. Italian ones. The best was a man by a man called Rama Nene, who was actually a Venetian. And they were reading my principal source materials.\nVD: If you don’t mind, let’s turn a bit from the past to the present. After a long period of relative peace, Islam appears to have entered another expansionary phase, is this something the West is better equipped to handle now that it has become increasingly secular?\nJJN: I don’t think it’s a total better equipped to handle it. No, I think it may be worse equipped. I mean, I find I find it I find what I see going on around me in this respect, very, very worrying. Indeed. I had thought until 10 years ago, perhaps and until 911, I had thought that the rest of the years of religious wars were virtually now a long, long last over. The last place they continue to edit was in Ireland, where there was still this violence, Protestant Catholic division, and killings, were still going on on quite an important scale. But then when when that was settled with it, it hasn’t actually been completely settled now, as we know, I mean, it still goes on, but we thought it had been settled them. And I thought, well, that’s that now. We really don’t need to worry about religious walls anymore. We’re all okay. We know where we stand and that’s fine. Well, then suddenly, there comes this tremendous upswing of, of Muslim fundamentalism. 911 and all that and suddenly, we’re back to the beginning. And in it looks to me, I go quite often to the Middle East, parts of the Muslim world, but particularly, particularly to Turkey. And I’ve been in Turkey was a completely secular state, as you know, I mean, after, after the First World War, it was as much as your career was worse to be seen going into a mosque. But now the prime minister goes to the mosque every Friday, and everybody’s wearing headscarves. And a lot of a lot of young women in the university. It will be wearing even more I mean, wearing those awful sort of pale pastel coloured overcoats to the ankle, which has always been particularly I think, IBM was in fashion. And there was so many of these girls I saw about seven or eight years ago, wandering around in the In these clothes, but there were also quite a few who weren’t, which meant that the ones who were doing it because they wanted to not because they’ve been told to or were being forced to. They were doing it voluntary because they felt they felt happier that way. And that’s that, that worries me. Because it’s it’s I think I mean, it leads ultimately to, to access and we then get that ridiculous sort of situation where people now far more than ever, in my lifetime, you’ll just see Muslim women were wearing vast black hats covering covering everything, but the slip for the eyes. And these a lot of these women are trying to apply to be become school teachers in England, but there’s no way you can teach. Without showing your face, it seems to me, you know, you can’t just have a voice emerging from a black tent, you need a person, you need a personality, you need a, you know, a character you can identify with. I’m very worried by this by this trend, because it is getting worse, in London every single year. There are more of these back tension rages around, you know.\nVD: Looking at it from the historical perspective, not the political perspective, but the historical perspective. There’s about 500,000 immigrants arriving every year in Great Britain. Yeah. What is the outcome that this sort of mass migration is likely to have?\nJJN: It really depends, I think, on the proportion, who decide to integrate, who decided to say, Okay, we’re in England, we will read on ordinary English life, we won’t wear black tents, or veils or anything, we’ll put ourselves through school and university. And that’s fine. And I mean, those will obviously get absorbed. But for every one of those, I don’t know how many there are of the other sides, who will not want to be absorbed, who will want to go on carrying on the Muslim way, ways of life. And this will lead to a greater and greater gulf, in the population of the country.\nVD: But from a historical perspective, does the culture usually tend to change the immigrants? Or did the immigrants tend to change the culture?\nJJN: Well, I think it works both ways. Lot of cases where the immigrants have actually changed the culture when there has been an enormous immigration. It depends on the size of the immigration, if it’s quite a small immigration, then I think on the whole it doesn’t really affect the culture very much. But with a really huge one, of course it can it can swamp it. And that’s what I’m hoping is not going to happen in this country, but I’m very much afraid it is.\nVD: I always think about the fact that Lombardia, in Italy, is named that way not because the Lombards used to live there, but rather because the Lombards migrated there.\nJJN: Yes, everywhere in Italy, really the people who have migrated. Italy has been such a tremendous melting pot and cauldron of various people and races over so long. That it’s almost impossible now to separate them out, I think 500 years hence, 1000 years hence.\nVD: How do you think the historians of the future will categorise the post world war two period in the West, or the post war period is now been going on about what 760 70 years?\nJJN: We haven’t had another world war. You know, we’ve had a lot of near misses and one or two extremely unpleasant hostilities, these least one of which is still going on today. But on the whole I would say that we have been successful in staving off another world war in staving off the the use of nuclear war warheads weapons of mass destruction which have not touch word thank God being used and which With any luck, we shall be able to continue to to to avoid to keep off. I think that’s that I think that’s all we can say over the future looking back on it because means there are too many imponderables, you really can’t tell you no,\nVD: I have to confess that I haven’t read all of your books I’ve only read-\nJJN: I should be very surprised if you had!\nVD: I’ve only read about seven of them. And\nThe Popes\nis next on my list. My favourite is probably the Byzantine trilogy. I’m curious to know, looking back on your literary career thus far, which is the work that pleases you the most.\nJJN: I think the first one, or the first two I should say, perhaps, that I ever wrote, on Norman Sicily. The first was called\nThe Normans in the South\n. And the second was called\nThe Kingdom in the Sun\n. One was just as equal to the other. And they were the first books I ever wrote. And I was incredibly lucky to find this wonderful subject, which hadn’t been touched before, or barely anywhere have been touched before. And nobody had written about it with any knowledge or enthusiasm. And so I managed to get in there. Yes, I think it still remains my favourite. I’ve enjoyed I really have it. I’ve enjoyed them all. I mean, because I actually liked the process of writing. And I find it satisfying and I find it frequently, actually fun. If if I had to choose another one, I suppose it would be\nVenice\nor possibly the Mediterranean,\nThe Middle Sea\n, one of those two. But I say I really. I’ve enjoyed writing, quite frankly, and I’m pretty pleased with them on the whole. I mean, I don’t think there’s anyone that certainly that I’m ashamed of. On the whole, I’m pretty satisfied with the output.\nVD: Lord Norwich, thank you so much for your time.\nJJN: It’s been a great pleasure talking to you. Likewise, sir. Thank you so much.\nDISCUSS ON SG",
  "tags": [
    "books",
    "history",
    "interview",
    "writing"
  ],
  "categories": [],
  "sitemap_lastmod": "2023-11-15T11:28:37+00:00"
}