{
  "url": "https://voxday.net/2023/11/08/mailvox-in-defense-of-doug-wilson/",
  "scraped_at": "2026-01-08T14:14:51.007404",
  "title": "MAILVOX: In Defense of Doug Wilson",
  "date_display": "November 8, 2023",
  "date_iso": "2023-11-08T13:57:09+00:00",
  "date_from_url": "2023-11-08",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>In response to <a href=\"https://voxday.net/2022/09/27/doug-wilson-is-a-boomer-fraud/\">a previous post</a> on the anti-nationalist evangelical pastor, a reader submits what he believes to be a defense of the fraudulent Boomangelical:</p><blockquote class=\"wp-block-quote is-layout-flow wp-block-quote-is-layout-flow\"><p>Firstly, I acknowledge your critiques of Doug, and recognise that he has some enormous Boomer tendencies. </p><p>But. </p><p>He has a growing appeal to disaffected young evangelical men (of whom I belonged). He spearheaded an enormous push towards Classical Christian schooling, founded on Western Civilisation (including the Greco-Roman underpinnings). It’s a huge movement, that is reintroducing the youth to the Good, Beautiful, and True. They have cleaned up church liturgy, and recaptured theological maximalism, with many offshoot ministries pushing phrases like ‘Rebuilding the New Christendom.’ This is all important foundational work to waking up Christians. It has led to me creating a homeschool co-op teaching the Classical method, and we are exposing our children to the glorious things that the Christian West has to offer. </p><p>Ministries like G3 ministries are on the warpath against ‘kinism’ which has significant sway over the Reformed Conservative movements. Guys like Doug want more mainstream appeal, so they have opted to go soft on the racial issue. They have ousted guys like Thomas Achord, which shows they mean business. </p><p>But it is worth noting that there are more guys like Thomas Achord in these organisations who will eventually start speaking out. The time doesn’t seem to have come for that yet. </p><p>I’m sure you’re aware that racism is perhaps one of the most unforgivable sins in the Evangelical church and will get a robust and powerful reaction from the Evangelical base (especially the Boomers). He is pushing young men in the right direction, and Christian Nationalism, as promoted by Stephen Wolfe, is gaining significant traction. </p></blockquote><p>I will first note that this is precisely the same defense that is regularly offered up on behalf of other gatekeepers like Jordan Peterson and Ben Shapiro, and also of books like the Harry Potter series. Don’t criticize the obvious errors and the demonstrable falsehoods when they are otherwise doing so much good? Don’t you understand that if they tell the truth instead of lying, they won’t be able to reach as many of those who need the truth? Isn’t it better that they read godless tales of evil being portrayed as good than not read at all?</p><p>And the answer is no. This is a false, pernicious, and fundamentally short-sighted perspective. It is less a defense than an attempt to negotiate a guilty plea in exchange for a lesser penalty.</p><p>Racism, as coined, properly defined, and practically applied today, is not and has never been a sin. The Churchians like Wilson are speaking with forked tongues when they a) define it falsely and in a way that no one actually applies it, and b) therefore falsely claim it to be a sin.</p><p>The reader claims Wilson spearheads “a huge movement, that is reintroducing the youth to the Good, Beautiful, and True”, but that is obviously false because nothing that is build on a foundation of lies and sand will stand. The fact that Wilson and company “want more mainstream appeal” and that they “mean business” is not an argument for them, it is evidence against them. By that standard, Joel Osteen and Russell Moore are role models for the modern Evangelical.</p><p>It’s great that people are being inspired to homeschool, regardless of whether the inspiration comes from a Churchian evangelical or a Buddhist hippy. But there is no truth in Doug Wilson or in any other so-called “Evangelical” who preaches the Gospel of Civil Rights instead of the Gospel of Jesus Christ and who teaches from <em>To Kill a Mockingbird</em> and <em>I Know Why the Caged Bird Sings</em> instead of the Bible.</p><p>Let me be perfectly clear: No one who advocates equality of any kind, and no one who is a civic nationalist of any variety, and no one who falsely asserts that which is not a sin is a sin, should ever be considered a genuine or reliable advocate of the Good, the Beautiful, and the True, no matter what their other positive attributes might be.</p><p>Because liars cannot, and will not, defend the truth. They will always produce one reason or another for refusing to do so. And if you are foolish enough to trust or follow a liar, you will come to regret it, as all of you – and readers here should recall, <em>the vast majority of you</em> – who used to lionize Jordan Peterson and consider him to be a great intellectual champion should know.</p><p><strong>PS: </strong>Stephen Wolfe’s Christian Nationalism is fake nationalism. It’s a religious form of civic nationalism that substitutes Christianity for US citizenship. He’s just another gatekeeper.</p><p><em><a href=\"https://social.infogalactic.com/micropost/b89eef6e-4236-4cc8-a3bb-06dc480c4d16\">DISCUSS ON SG</a></em></p></div>",
  "content_text": "In response to\na previous post\non the anti-nationalist evangelical pastor, a reader submits what he believes to be a defense of the fraudulent Boomangelical:\nFirstly, I acknowledge your critiques of Doug, and recognise that he has some enormous Boomer tendencies.\nBut.\nHe has a growing appeal to disaffected young evangelical men (of whom I belonged). He spearheaded an enormous push towards Classical Christian schooling, founded on Western Civilisation (including the Greco-Roman underpinnings). It’s a huge movement, that is reintroducing the youth to the Good, Beautiful, and True. They have cleaned up church liturgy, and recaptured theological maximalism, with many offshoot ministries pushing phrases like ‘Rebuilding the New Christendom.’ This is all important foundational work to waking up Christians. It has led to me creating a homeschool co-op teaching the Classical method, and we are exposing our children to the glorious things that the Christian West has to offer.\nMinistries like G3 ministries are on the warpath against ‘kinism’ which has significant sway over the Reformed Conservative movements. Guys like Doug want more mainstream appeal, so they have opted to go soft on the racial issue. They have ousted guys like Thomas Achord, which shows they mean business.\nBut it is worth noting that there are more guys like Thomas Achord in these organisations who will eventually start speaking out. The time doesn’t seem to have come for that yet.\nI’m sure you’re aware that racism is perhaps one of the most unforgivable sins in the Evangelical church and will get a robust and powerful reaction from the Evangelical base (especially the Boomers). He is pushing young men in the right direction, and Christian Nationalism, as promoted by Stephen Wolfe, is gaining significant traction.\nI will first note that this is precisely the same defense that is regularly offered up on behalf of other gatekeepers like Jordan Peterson and Ben Shapiro, and also of books like the Harry Potter series. Don’t criticize the obvious errors and the demonstrable falsehoods when they are otherwise doing so much good? Don’t you understand that if they tell the truth instead of lying, they won’t be able to reach as many of those who need the truth? Isn’t it better that they read godless tales of evil being portrayed as good than not read at all?\nAnd the answer is no. This is a false, pernicious, and fundamentally short-sighted perspective. It is less a defense than an attempt to negotiate a guilty plea in exchange for a lesser penalty.\nRacism, as coined, properly defined, and practically applied today, is not and has never been a sin. The Churchians like Wilson are speaking with forked tongues when they a) define it falsely and in a way that no one actually applies it, and b) therefore falsely claim it to be a sin.\nThe reader claims Wilson spearheads “a huge movement, that is reintroducing the youth to the Good, Beautiful, and True”, but that is obviously false because nothing that is build on a foundation of lies and sand will stand. The fact that Wilson and company “want more mainstream appeal” and that they “mean business” is not an argument for them, it is evidence against them. By that standard, Joel Osteen and Russell Moore are role models for the modern Evangelical.\nIt’s great that people are being inspired to homeschool, regardless of whether the inspiration comes from a Churchian evangelical or a Buddhist hippy. But there is no truth in Doug Wilson or in any other so-called “Evangelical” who preaches the Gospel of Civil Rights instead of the Gospel of Jesus Christ and who teaches from\nTo Kill a Mockingbird\nand\nI Know Why the Caged Bird Sings\ninstead of the Bible.\nLet me be perfectly clear: No one who advocates equality of any kind, and no one who is a civic nationalist of any variety, and no one who falsely asserts that which is not a sin is a sin, should ever be considered a genuine or reliable advocate of the Good, the Beautiful, and the True, no matter what their other positive attributes might be.\nBecause liars cannot, and will not, defend the truth. They will always produce one reason or another for refusing to do so. And if you are foolish enough to trust or follow a liar, you will come to regret it, as all of you – and readers here should recall,\nthe vast majority of you\n– who used to lionize Jordan Peterson and consider him to be a great intellectual champion should know.\nPS:\nStephen Wolfe’s Christian Nationalism is fake nationalism. It’s a religious form of civic nationalism that substitutes Christianity for US citizenship. He’s just another gatekeeper.\nDISCUSS ON SG",
  "tags": [
    "boomers",
    "Christianity",
    "Churchianity",
    "mailvox"
  ],
  "categories": [],
  "sitemap_lastmod": "2023-11-08T13:58:53+00:00"
}