{
  "url": "https://voxday.net/2023/11/24/mailvox-the-post-morten-convergence-of-cs-lewis/",
  "scraped_at": "2026-01-08T14:16:24.680695",
  "title": "Mailvox: The Post-Morten Convergence of CS Lewis",
  "date_display": "November 24, 2023",
  "date_iso": "2023-11-24T19:47:51+00:00",
  "date_from_url": "2023-11-24",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>A reminder, as if any could possibly be necessary anymore, of the importance of Castalia Library preserving the original texts that are being actively disappeared by the publishing industry:</p><blockquote class=\"wp-block-quote is-layout-flow wp-block-quote-is-layout-flow\"><p>We were given tickets to the stage version of <em>The Lion and Witch and the Wardrobe</em>. It was terrible. I was waiting to see what SJW stuff would be included. It started with about eight or so army guys, and only one of them was black, so I thought maybe we will be lucky… then the kids walked out. They were black. It was abysmal. Although it did put a different spin on a few of the lines – like when Mr Beaver is asking if they’re human or not…</p><p>The kids got to the house after being evacuated from London, and one of the two housemaids was a big burly man with a beard. He was wearing a maid’s outfit. It was grotesque. They stripped away all Christian references and undertones, which was impressive in an awful way given the subject material.</p><p>They even removed Santa. He was now Sinta Klause, and looked like a fat Turkish man who had been caught in an explosion at a fabric factory.</p></blockquote><p>The West has fallen to Clown World. We are the remnant. We will rebuild anew and wiser than before.</p><p><em>“The Shadow that bred them can only mock, it cannot make: not real new things of its own. I don’t think it gave life to the orcs, it only ruined them and twisted them.”</em></p><p>— JRR Tolkien, <em>The Return of the King</em></p><p><em><a href=\"https://social.infogalactic.com/micropost/ff74de0d-42ff-451f-a8f2-386e7c6a4088\">DISCUSS ON SG</a></em></p></div>",
  "content_text": "A reminder, as if any could possibly be necessary anymore, of the importance of Castalia Library preserving the original texts that are being actively disappeared by the publishing industry:\nWe were given tickets to the stage version of\nThe Lion and Witch and the Wardrobe\n. It was terrible. I was waiting to see what SJW stuff would be included. It started with about eight or so army guys, and only one of them was black, so I thought maybe we will be lucky… then the kids walked out. They were black. It was abysmal. Although it did put a different spin on a few of the lines – like when Mr Beaver is asking if they’re human or not…\nThe kids got to the house after being evacuated from London, and one of the two housemaids was a big burly man with a beard. He was wearing a maid’s outfit. It was grotesque. They stripped away all Christian references and undertones, which was impressive in an awful way given the subject material.\nThey even removed Santa. He was now Sinta Klause, and looked like a fat Turkish man who had been caught in an explosion at a fabric factory.\nThe West has fallen to Clown World. We are the remnant. We will rebuild anew and wiser than before.\n“The Shadow that bred them can only mock, it cannot make: not real new things of its own. I don’t think it gave life to the orcs, it only ruined them and twisted them.”\n— JRR Tolkien,\nThe Return of the King\nDISCUSS ON SG",
  "tags": [
    "books",
    "Clown World",
    "mailvox",
    "SJW"
  ],
  "categories": [],
  "sitemap_lastmod": "2023-11-24T19:47:52+00:00"
}