{
  "url": "https://voxday.net/2023/11/03/mailvox-why-international-opinion-matters/",
  "scraped_at": "2026-01-08T14:14:17.491015",
  "title": "Mailvox: Why International Opinion Matters",
  "date_display": "November 3, 2023",
  "date_iso": "2023-11-03T09:20:47+00:00",
  "date_from_url": "2023-11-03",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>An SGer asks a reasonable question:</p><p><em>Why does Israel care what the international community thinks?</em></p><p>Because the nation is too small and too weak to survive without being provided resources and protection by other nations. Only large nations with abundant natural resources such as China, the USA, and Russia can afford to ignore international opinion without rapidly regressing into a pre-industrial state of starvation. Unfortunately, the current Israeli elite has transformed what was once excellent diplomacy into an abusive parasitism over time, which is short-term advantageous but long-term self-destructive.</p><p>The current crisis is almost certainly related to the fact that Benjamin Netanyahu is the Prime Minister of Israel. In the eyes of the world, Israel had a just cause to use force to take its hostages back. But it does not see Israel having just cause to ethnically cleanse Gaza or bomb the civilian population there. Hence the rapid loss of global sympathy, and the concomitant increase of global antipathy.</p><p>Here’s a hint: if you’re appealing to the historical examples of Dresden and Nagasaki, <em>you are absolutely going to lose the rhetorical war every single time</em>. Even many Americans regard those wartime acts as inexcusable war crimes, as does most of the planet.</p><p>Scott Ritter’s article <a href=\"https://www.scottritterextra.com/p/why-i-no-longer-stand-with-israel\">on his complicated personal history with Israel</a> is, as is often the case with Ritter, somewhat hit or miss – at this point, the current state of South Africa is better seen as an <em>ex post facto</em> justification of apartheid than as a positive example for Israel or anyone else – but he does manage to demonstrate why no world leaders, and even many Israelis, have absolutely no trust in Netanyahu or his leadership in this war.</p><blockquote class=\"wp-block-quote is-layout-flow wp-block-quote-is-layout-flow\"><p>I didn’t blame Israel as a whole, but rather the individual Israelis involved, first and foremost the man who had taken over from Yitzhak Rabin as the Prime Minister of Israel, Benjamin Netanyahu.</p><p>Netanyahu’s incompetence as a political leader had resulted in him being voted out of office in 1999, replaced by Ehud Barack (who had apparently learned to lie to a degree sufficient to the task of being an Israeli politician). In September 2002, Netanyahu testified before the US Congress about Iraq’s nuclear weapons program. Even though he did so as a private citizen, his status as a former Prime Minister gave his words credibility they did not deserve.</p><p>“There is no question whatsoever that Saddam is seeking, is working, is advancing towards the development of nuclear weapons,” Netanyahu said. “Once Saddam has nuclear weapons, the terror network will have nuclear weapons.”</p><p>Netanyahu’s statements directly contradicted the findings that my Israeli colleagues and I had reached—findings that were shared by the International Atomic Energy Agency, responsible for overseeing the dismantling of Iraq’s nuclear program—that the Iraqi nuclear program had been eliminated, and that there was no evidence of its reconstitution.</p><p>But Netanyahu’s job wasn’t to tell the truth about Iraq’s nuclear program, but rather use the fear generated by the specter of an Iraqi nuclear weapon to justify a war with Iraq that would remove Saddam Husein from power. “If you take out Saddam, Saddam’s regime, I guarantee you that it will have enormous positive reverberations on the region,” Netanyahu told his receptive congressional audience. “And I think that people sitting right next door in Iran, young people, and many others, will say the time of such regimes, of such despots is gone.”</p><p>Looking back today, at the horrific consequences of America’s illegal invasion and occupation of Iraq, at an Iranian regime firmly entrenched behind a nuclear program that is not going away, one can clearly see that Benjamin Netanyahu was wrong about everything. But that has been his modus operendi from the start—to exaggerate and lie about threats faced by Israel to justify military action which invariably resulted in disaster.</p></blockquote><p>Now, regardless of what one thinks of Ritter, the fact that Netanhayu’s known <em>modus operand</em>i for more than two decades has been “to exaggerate and lie about threats faced by Israel to justify military action which invariably resulted in disaster” does not leave one with a great deal of confidence in a positive outcome of this recent war between Israel and the organization it helped create, Hamas.</p><p>This is Netanyahu’s war, one that he has long sought, and quite possibly one of which it will eventually be learned that he arranged and staged. We may even need to coin a new term for this sort of war, because if it is true that Netanyahu not only permitted, but was involved in encouraging the attacks, “green flag” wouldn’t suffice to describe it. “Puppet flag” would be more accurate.</p><p>And as for any objections that it would require a sociopath to contemplate and actually do such a contemptible thing, well, there appears to be considerable evidence that Netanyahu is not only a sociopath, but one whose psyche was deeply affected by the death of his heroic older brother at Entebbe. As the Germans learned to their great detriment, as the Ukrainians are presently learning to theirs, it is very costly to a nation to permit a psychologically-damaged individual to hold the reins of government.</p><p><strong>UPDATE: </strong>Oh, Sweet Moses. Israeli PR <a href=\"https://www.rt.com/news/586490-israel-no-neutrality-hamas/\">doubles down</a> on the rhetorical retardery.</p><p><em>Nations that have failed to support Israel’s response to the atrocities committed by Hamas on October 7 are on the side of the militant group in the conflict, the Israeli Foreign Ministry has declared. There can be no neutrality regarding the conflict, a ministry spokesman has insisted.</em></p><p><em><a href=\"https://social.infogalactic.com/micropost/c4679d80-fbea-4c4c-b576-4046a6c13d23\">DISCUSS ON SG</a></em></p></div>",
  "content_text": "An SGer asks a reasonable question:\nWhy does Israel care what the international community thinks?\nBecause the nation is too small and too weak to survive without being provided resources and protection by other nations. Only large nations with abundant natural resources such as China, the USA, and Russia can afford to ignore international opinion without rapidly regressing into a pre-industrial state of starvation. Unfortunately, the current Israeli elite has transformed what was once excellent diplomacy into an abusive parasitism over time, which is short-term advantageous but long-term self-destructive.\nThe current crisis is almost certainly related to the fact that Benjamin Netanyahu is the Prime Minister of Israel. In the eyes of the world, Israel had a just cause to use force to take its hostages back. But it does not see Israel having just cause to ethnically cleanse Gaza or bomb the civilian population there. Hence the rapid loss of global sympathy, and the concomitant increase of global antipathy.\nHere’s a hint: if you’re appealing to the historical examples of Dresden and Nagasaki,\nyou are absolutely going to lose the rhetorical war every single time\n. Even many Americans regard those wartime acts as inexcusable war crimes, as does most of the planet.\nScott Ritter’s article\non his complicated personal history with Israel\nis, as is often the case with Ritter, somewhat hit or miss – at this point, the current state of South Africa is better seen as an\nex post facto\njustification of apartheid than as a positive example for Israel or anyone else – but he does manage to demonstrate why no world leaders, and even many Israelis, have absolutely no trust in Netanyahu or his leadership in this war.\nI didn’t blame Israel as a whole, but rather the individual Israelis involved, first and foremost the man who had taken over from Yitzhak Rabin as the Prime Minister of Israel, Benjamin Netanyahu.\nNetanyahu’s incompetence as a political leader had resulted in him being voted out of office in 1999, replaced by Ehud Barack (who had apparently learned to lie to a degree sufficient to the task of being an Israeli politician). In September 2002, Netanyahu testified before the US Congress about Iraq’s nuclear weapons program. Even though he did so as a private citizen, his status as a former Prime Minister gave his words credibility they did not deserve.\n“There is no question whatsoever that Saddam is seeking, is working, is advancing towards the development of nuclear weapons,” Netanyahu said. “Once Saddam has nuclear weapons, the terror network will have nuclear weapons.”\nNetanyahu’s statements directly contradicted the findings that my Israeli colleagues and I had reached—findings that were shared by the International Atomic Energy Agency, responsible for overseeing the dismantling of Iraq’s nuclear program—that the Iraqi nuclear program had been eliminated, and that there was no evidence of its reconstitution.\nBut Netanyahu’s job wasn’t to tell the truth about Iraq’s nuclear program, but rather use the fear generated by the specter of an Iraqi nuclear weapon to justify a war with Iraq that would remove Saddam Husein from power. “If you take out Saddam, Saddam’s regime, I guarantee you that it will have enormous positive reverberations on the region,” Netanyahu told his receptive congressional audience. “And I think that people sitting right next door in Iran, young people, and many others, will say the time of such regimes, of such despots is gone.”\nLooking back today, at the horrific consequences of America’s illegal invasion and occupation of Iraq, at an Iranian regime firmly entrenched behind a nuclear program that is not going away, one can clearly see that Benjamin Netanyahu was wrong about everything. But that has been his modus operendi from the start—to exaggerate and lie about threats faced by Israel to justify military action which invariably resulted in disaster.\nNow, regardless of what one thinks of Ritter, the fact that Netanhayu’s known\nmodus operand\ni for more than two decades has been “to exaggerate and lie about threats faced by Israel to justify military action which invariably resulted in disaster” does not leave one with a great deal of confidence in a positive outcome of this recent war between Israel and the organization it helped create, Hamas.\nThis is Netanyahu’s war, one that he has long sought, and quite possibly one of which it will eventually be learned that he arranged and staged. We may even need to coin a new term for this sort of war, because if it is true that Netanyahu not only permitted, but was involved in encouraging the attacks, “green flag” wouldn’t suffice to describe it. “Puppet flag” would be more accurate.\nAnd as for any objections that it would require a sociopath to contemplate and actually do such a contemptible thing, well, there appears to be considerable evidence that Netanyahu is not only a sociopath, but one whose psyche was deeply affected by the death of his heroic older brother at Entebbe. As the Germans learned to their great detriment, as the Ukrainians are presently learning to theirs, it is very costly to a nation to permit a psychologically-damaged individual to hold the reins of government.\nUPDATE:\nOh, Sweet Moses. Israeli PR\ndoubles down\non the rhetorical retardery.\nNations that have failed to support Israel’s response to the atrocities committed by Hamas on October 7 are on the side of the militant group in the conflict, the Israeli Foreign Ministry has declared. There can be no neutrality regarding the conflict, a ministry spokesman has insisted.\nDISCUSS ON SG",
  "tags": [
    "history",
    "mailvox",
    "rhetoric",
    "war",
    "Zion"
  ],
  "categories": [],
  "sitemap_lastmod": "2023-11-03T15:57:08+00:00"
}