{
  "url": "https://voxday.net/2023/11/22/the-payments-never-end/",
  "scraped_at": "2026-01-08T14:16:10.343048",
  "title": "The Payments Never End",
  "date_display": "November 22, 2023",
  "date_iso": "2023-11-22T12:12:37+00:00",
  "date_from_url": "2023-11-22",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>When you take the ticket to achieve what passes for “success” in Clown World, the demands upon you <a href=\"https://www.dailymail.co.uk/tvshowbiz/article-12772779/Kanye-West-believes-Harley-Pasternak-FOLLOWING-Dubai.html\">will never end</a>.</p><blockquote class=\"wp-block-quote is-layout-flow wp-block-quote-is-layout-flow\"><p>Kanye West believes his ex personal trainer Harley Pasternak has been following him in Dubai – one year after the rapper leaked alleged texts from his ‘creepy’ former employee threatening to get him ‘institutionalized again’. Photo and video obtained exclusively by DailyMail.com shows Pasternak, 49, in the lobby of a hotel on Monday where West is staying with his children – which a source called ‘extremely suspect’.</p><p>West, 46, was notably hospitalized in November 2016 after suffering a temporary psychosis at Pasternak’s home in West Hollywood – reportedly brought on by sleep deprivation and extreme dehydration following a stream of Twitter posting frenzies, political and personal rants at his fans and cancelled concerts.</p><p>West was diagnosed with bipolar disorder but has claimed in the years since that he was ‘mentally misdiagnosed’ and that Pasternak was allegedly to blame – later leaking texts Pasternak had reportedly sent him in the wake of the musician’s 2022 anti-Semitic rants.</p><p>An insider told DailyMail.com of Pasternak: ‘We have grave concerns as to what this creepy operative is doing in Ye’s hotel. ‘The timing is extremely suspect. We are very concerned indeed about his motives and intentions. This is the man who threatened to “drug Ye to Zombieland”. Why has he suddenly shown up here?’</p> <cite>Kanye West believes ex personal trainer Harley Pasternak is FOLLOWING him in Dubai, 22 November 2023</cite></blockquote><p>Notice how Kanye West’s straightforward observation that he’s being followed around the world by his Clown World handler – and yes, of course, Every Single Time – is being portrayed as a “belief”, thereby attempting to further the idea that West is paranoid, even though he’s being literally stalked around the world.</p><p>It doesn’t matter if it’s acting, business, music, or writing, there is no amount of fame, money, sex, or drugs that is worth the price that is demanded of anyone who seeks success in their field. And there is no shame whatsoever in seeing your inferiors surpass you and garner all the inorganic praise, plaudits, sales, and “success”, because if you are doing your best work, any success that you achieve is both real and entirely merited.</p><p>Unlike the “successful” celebrities, you will never have “imposter syndrome”, because, unlike them, you are not an imposter. <em>There is no such thing as “imposter syndrome”, there are only imposters.</em> Imposter syndrome, truly described, is the belated realization of the imposter that his success, such as it is, is manufactured, has not been earned, and he is fundamentally a fraud.</p><p>It may also be informative to observe that a Wikipedia editor named Hemiauchenia keeps changing the page to say “Harley Samuel Pasternak is a Canadian personal trainer” instead of “”Harley Samuel Pasternak is a Jewish Canadian-American personal trainer” and removing the link to <a href=\"https://forward.com/news/174793/harley-pasternak-jewish-fitness-trainer-to-the-sta/\">a well-sourced article</a> entitled “Harley Pasternak, Jewish Fitness Trainer to the Stars.”</p><p><em><a href=\"https://social.infogalactic.com/micropost/c3d04559-55da-433e-b0da-3c5b296ad6dc\">DISCUSS ON SG</a></em></p></div>",
  "content_text": "When you take the ticket to achieve what passes for “success” in Clown World, the demands upon you\nwill never end\n.\nKanye West believes his ex personal trainer Harley Pasternak has been following him in Dubai – one year after the rapper leaked alleged texts from his ‘creepy’ former employee threatening to get him ‘institutionalized again’. Photo and video obtained exclusively by DailyMail.com shows Pasternak, 49, in the lobby of a hotel on Monday where West is staying with his children – which a source called ‘extremely suspect’.\nWest, 46, was notably hospitalized in November 2016 after suffering a temporary psychosis at Pasternak’s home in West Hollywood – reportedly brought on by sleep deprivation and extreme dehydration following a stream of Twitter posting frenzies, political and personal rants at his fans and cancelled concerts.\nWest was diagnosed with bipolar disorder but has claimed in the years since that he was ‘mentally misdiagnosed’ and that Pasternak was allegedly to blame – later leaking texts Pasternak had reportedly sent him in the wake of the musician’s 2022 anti-Semitic rants.\nAn insider told DailyMail.com of Pasternak: ‘We have grave concerns as to what this creepy operative is doing in Ye’s hotel. ‘The timing is extremely suspect. We are very concerned indeed about his motives and intentions. This is the man who threatened to “drug Ye to Zombieland”. Why has he suddenly shown up here?’\nKanye West believes ex personal trainer Harley Pasternak is FOLLOWING him in Dubai, 22 November 2023\nNotice how Kanye West’s straightforward observation that he’s being followed around the world by his Clown World handler – and yes, of course, Every Single Time – is being portrayed as a “belief”, thereby attempting to further the idea that West is paranoid, even though he’s being literally stalked around the world.\nIt doesn’t matter if it’s acting, business, music, or writing, there is no amount of fame, money, sex, or drugs that is worth the price that is demanded of anyone who seeks success in their field. And there is no shame whatsoever in seeing your inferiors surpass you and garner all the inorganic praise, plaudits, sales, and “success”, because if you are doing your best work, any success that you achieve is both real and entirely merited.\nUnlike the “successful” celebrities, you will never have “imposter syndrome”, because, unlike them, you are not an imposter.\nThere is no such thing as “imposter syndrome”, there are only imposters.\nImposter syndrome, truly described, is the belated realization of the imposter that his success, such as it is, is manufactured, has not been earned, and he is fundamentally a fraud.\nIt may also be informative to observe that a Wikipedia editor named Hemiauchenia keeps changing the page to say “Harley Samuel Pasternak is a Canadian personal trainer” instead of “”Harley Samuel Pasternak is a Jewish Canadian-American personal trainer” and removing the link to\na well-sourced article\nentitled “Harley Pasternak, Jewish Fitness Trainer to the Stars.”\nDISCUSS ON SG",
  "tags": [
    "Clown World",
    "Hellmouth",
    "philosophy"
  ],
  "categories": [],
  "sitemap_lastmod": "2023-11-22T12:40:55+00:00"
}