{
  "url": "https://voxday.net/2023/11/06/the-last-lesson-of-bobby-knight/",
  "scraped_at": "2026-01-08T14:14:34.850289",
  "title": "The Last Lesson of Bobby Knight",
  "date_display": "November 6, 2023",
  "date_iso": "2023-11-06T11:23:43+00:00",
  "date_from_url": "2023-11-06",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p><a href=\"https://www.washingtonpost.com/sports/2023/11/02/bob-knight-john-feinstein/\">An intriguing epitaph</a> of the late, great Indiana basketball coach:</p><blockquote class=\"wp-block-quote is-layout-flow wp-block-quote-is-layout-flow\"><p>Knight was an almost Shakespearean character: brilliant, thoughtful and tragically flawed. In the late 1980s, he happened to show up on a rare evening when high school recruit Calbert Cheaney had a bad night. He upbraided his assistants for dragging him to see a player clearly not good enough for Indiana. They explained he had caught Cheaney on a bad night and should see him play again. Knight told them he wouldn’t waste any more time, nor should they.</p><p>Cheaney committed to Evansville — coached by Jim Crews, who had played on Indiana’s 1976 team and coached under Knight for eight years. Knight was at a summer camp game a few months later and saw Cheaney again. This time, the real Calbert Cheaney showed up.</p><p>“Why aren’t we recruiting that kid?” Knight asked his assistants.</p><p>The assistants told him he had ordered them not to recruit Cheaney. “Why don’t you just give him a call and see if he might have any interest in Indiana?” Knight said.</p><p>Cheaney, quite naturally, was thrilled. He chose Indiana, was the star of Knight’s last Final Four team in 1992 and is still the Big Ten’s all-time leading scorer. Crews was stunned that his old coach had recruited a player who had committed to him.</p><p>“If some other coach did that to me, you’d call him every name in the book,” Crews said to Knight. “I know coaches do this sort of thing, but how could you do this to me?”</p><p>Knight responded by telling Crews he would be nothing in basketball if not for him. Crews finally said, “You know something, Coach: The saddest part of your life is that you treat your enemies better than you treat your friends.”</p><p>The truth in that statement is very sad.</p></blockquote><p>Peter King, in his <em>NFL Football</em> column, makes an accurate observation about how younger sports fans will wonder why anyone cares about the death of a coach of a minor university in a lesser sport: <em>“It’s understandable that many will note the death of Knight and wonder how possibly could the basketball coach at Indiana be one of the five most dominant people in sports for 15, 20 years. He just was.”</em> But if Bobby Knight had been a military general instead of a basketball coach, he would have been as famous as George Patton was, and probably more successful. He was a rare individual whose obvious talent was only exceeded by the force of his will.</p><div class=\"wp-block-image\"><figure class=\"aligncenter size-full\"><img alt=\"\" class=\"wp-image-60312\" decoding=\"async\" fetchpriority=\"high\" height=\"354\" sizes=\"(max-width: 512px) 100vw, 512px\" src=\"https://voxday.net/wp-content/uploads/2023/11/image-12.png\" srcset=\"https://voxday.net/wp-content/uploads/2023/11/image-12.png 512w, https://voxday.net/wp-content/uploads/2023/11/image-12-300x207.png 300w\" width=\"512\"/></figure></div><p>But Knight’s career is a cautionary tale in how one should not treat others, no matter how talented, driven, or successful one is. For some reason, all too many people insist on treating their enemies better than they treat their friends. This is wrong, in every application, and ultimately leads to failure in everything from marriage to business marketing.</p><p>In your personal life, you should, you <em>must</em>, treat your partner, your family, and your friends better than you treat anyone else, most especially strangers. The idea that the closer you are to someone, the more you can “truly be yourself” and “be unconditionally accepted” despite your worst behavior is a pernicious one that is all too common today.</p><p>And in your professional life, you should, you <em>must</em>, treat your core market and your loyal customers better than anyone else. The idea that you should focus your efforts on the periphery and on potential new customers in different markets is much in vogue, but it has reliably led to complete failure in everything from beer and NASCAR to Hollywood and video games.</p><blockquote class=\"wp-block-quote is-layout-flow wp-block-quote-is-layout-flow\"><p>He always insisted he didn’t care what anyone cared about him when, in fact, he cared desperately and went so far out of his way to prove it that he hurt himself figuratively — and literally. Worse than that, he always had to have the last word — whether it was with referees, other coaches, players, the media and even his family.</p></blockquote><p>This is another important lesson. Two, in fact. First, nearly everyone cares what most people think about them. The only people who genuinely don’t are either a) neuroatypical, b) 3SD+ more intelligent than the norm,(1) c) psychologically scarred from childhood,(2) or some combination therein. So, attempting to erect an uncaring facade is both futile and transparent. And worse, most of the efforts required to protect that facade tend to harm the person behind it.</p><p>As for needing to have the last word, this is just retarded and unnecessary. There is absolutely no point in repeating the same point over and over and over again, as most people do, much less resorting to insults and attacks because your feelings have been hurt when someone doesn’t agree with you. Did you somehow forget that you claimed you didn’t care what others thought? Then why are your feelings hurt, and why do you assume that they care what you think?</p><p>So, RIP Bobby Knight. The remarkable thing about the General is that even in death, he is still capable of teaching important life lessons.</p><p><em>(1) Contemplate the extent to which you care about a child or a literal retard thinks. Then consider the fact that in terms of IQ, they are closer to you than you are to Chris Langan.</em></p><p><em>(2) It’s virtually impossible to replicate, or even simulate, those psychologies shaped by childhood experience, particularly prior to puberty. For good or for ill.</em></p><p><em><a href=\"https://social.infogalactic.com/micropost/d3f9dc66-1a43-40a1-8a32-8ff4b4b4d607\">DISCUSS ON SG</a></em></p></div>",
  "content_text": "An intriguing epitaph\nof the late, great Indiana basketball coach:\nKnight was an almost Shakespearean character: brilliant, thoughtful and tragically flawed. In the late 1980s, he happened to show up on a rare evening when high school recruit Calbert Cheaney had a bad night. He upbraided his assistants for dragging him to see a player clearly not good enough for Indiana. They explained he had caught Cheaney on a bad night and should see him play again. Knight told them he wouldn’t waste any more time, nor should they.\nCheaney committed to Evansville — coached by Jim Crews, who had played on Indiana’s 1976 team and coached under Knight for eight years. Knight was at a summer camp game a few months later and saw Cheaney again. This time, the real Calbert Cheaney showed up.\n“Why aren’t we recruiting that kid?” Knight asked his assistants.\nThe assistants told him he had ordered them not to recruit Cheaney. “Why don’t you just give him a call and see if he might have any interest in Indiana?” Knight said.\nCheaney, quite naturally, was thrilled. He chose Indiana, was the star of Knight’s last Final Four team in 1992 and is still the Big Ten’s all-time leading scorer. Crews was stunned that his old coach had recruited a player who had committed to him.\n“If some other coach did that to me, you’d call him every name in the book,” Crews said to Knight. “I know coaches do this sort of thing, but how could you do this to me?”\nKnight responded by telling Crews he would be nothing in basketball if not for him. Crews finally said, “You know something, Coach: The saddest part of your life is that you treat your enemies better than you treat your friends.”\nThe truth in that statement is very sad.\nPeter King, in his\nNFL Football\ncolumn, makes an accurate observation about how younger sports fans will wonder why anyone cares about the death of a coach of a minor university in a lesser sport:\n“It’s understandable that many will note the death of Knight and wonder how possibly could the basketball coach at Indiana be one of the five most dominant people in sports for 15, 20 years. He just was.”\nBut if Bobby Knight had been a military general instead of a basketball coach, he would have been as famous as George Patton was, and probably more successful. He was a rare individual whose obvious talent was only exceeded by the force of his will.\nBut Knight’s career is a cautionary tale in how one should not treat others, no matter how talented, driven, or successful one is. For some reason, all too many people insist on treating their enemies better than they treat their friends. This is wrong, in every application, and ultimately leads to failure in everything from marriage to business marketing.\nIn your personal life, you should, you\nmust\n, treat your partner, your family, and your friends better than you treat anyone else, most especially strangers. The idea that the closer you are to someone, the more you can “truly be yourself” and “be unconditionally accepted” despite your worst behavior is a pernicious one that is all too common today.\nAnd in your professional life, you should, you\nmust\n, treat your core market and your loyal customers better than anyone else. The idea that you should focus your efforts on the periphery and on potential new customers in different markets is much in vogue, but it has reliably led to complete failure in everything from beer and NASCAR to Hollywood and video games.\nHe always insisted he didn’t care what anyone cared about him when, in fact, he cared desperately and went so far out of his way to prove it that he hurt himself figuratively — and literally. Worse than that, he always had to have the last word — whether it was with referees, other coaches, players, the media and even his family.\nThis is another important lesson. Two, in fact. First, nearly everyone cares what most people think about them. The only people who genuinely don’t are either a) neuroatypical, b) 3SD+ more intelligent than the norm,(1) c) psychologically scarred from childhood,(2) or some combination therein. So, attempting to erect an uncaring facade is both futile and transparent. And worse, most of the efforts required to protect that facade tend to harm the person behind it.\nAs for needing to have the last word, this is just retarded and unnecessary. There is absolutely no point in repeating the same point over and over and over again, as most people do, much less resorting to insults and attacks because your feelings have been hurt when someone doesn’t agree with you. Did you somehow forget that you claimed you didn’t care what others thought? Then why are your feelings hurt, and why do you assume that they care what you think?\nSo, RIP Bobby Knight. The remarkable thing about the General is that even in death, he is still capable of teaching important life lessons.\n(1) Contemplate the extent to which you care about a child or a literal retard thinks. Then consider the fact that in terms of IQ, they are closer to you than you are to Chris Langan.\n(2) It’s virtually impossible to replicate, or even simulate, those psychologies shaped by childhood experience, particularly prior to puberty. For good or for ill.\nDISCUSS ON SG",
  "tags": [
    "philosophy",
    "RIP",
    "sports"
  ],
  "categories": [],
  "sitemap_lastmod": "2023-11-06T11:23:45+00:00"
}