{
  "url": "https://voxday.net/2023/11/16/the-vanishing-letter/",
  "scraped_at": "2026-01-08T14:15:31.686422",
  "title": "The Vanishing Letter",
  "date_display": "November 16, 2023",
  "date_iso": "2023-11-16T10:45:24+00:00",
  "date_from_url": "2023-11-16",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p><em>Osama bin Laden wanted to speak directly to the American people.</em> <em>An undated letter promising endless war is one of hundreds of documents collected in the May 2, 2011 raid on his compound in Pakistan that was released Wednesday. The full text is below.</em></p><p>However, <a href=\"https://foreignpolicy.com/2015/05/20/heres-osama-bin-ladens-letter-to-the-american-people/\">the full text</a> of the letter was not actually provided by Foreign Policy. Two lines, highlighted below in bold italics, were omitted with the following note.</p><p><em>(TN: Two lines of poetry that say the Mujahidin will not stop fighting until the United States leaves their land.)</em></p><p>Even more intriguing, <em>The Guardian</em> <a href=\"https://www.theguardian.com/info/2023/nov/15/removed-document\">just disappeared the page</a> on which the letter had been published for the last 21 years.</p><p><em>Removed: document<br/>Wed 15 Nov 2023 21.19 CET<br/>This page previously displayed a document containing, in translation, the full text of Osama bin Laden’s “letter to the American people”, as reported in the Observer on Sunday 24 November 2002. The document, which was published here on the same day, was removed on 15 November 2023.</em></p><blockquote class=\"wp-block-quote is-layout-flow wp-block-quote-is-layout-flow\"><p>In the name of Allah, the Compassionate, the Merciful.</p><p>From Usama Bin Muhammad Bin Ladin to the American people,</p><p>I speak to you about the subject of the ongoing war between you and us. Even though the consensus of your wise thinkers and others is that your time (TN: of defeat) will come, compassion for the women and children who are being unjustly killed, wounded, and displaced in Iraq, Afghanistan, and Pakistan motivates me to speak to you.</p><p>First of all, I would like to say that your war with us is the longest war in your history and the most expensive for you financially. As for us, we see it as being only halfway finished. If you were to ask your wise thinkers, they would tell you that there is no way to win it because the indications are<br/>against it. How will you win a war whose leaders are pessimistic and whose soldiers are committing suicide? If fear enters the hearts of men, winning the war becomes impossible. How will you<br/>win a war whose cost is like a hurricane blowing violently at your economy and weakening your dollar?</p><p>The Bush administration got you into these wars on the premise that they were vital to your security. He promised that it would be a quick war, won within six days or six weeks; however, six years have passed, and they are still promising you victory and not achieving it. Then Obama came and delayed the withdrawal that he had promised you by 16 more months. He promised you victory in Afghanistan and set a date for withdrawal from there. Six months later, Petraeus came to you once again with the number six, requesting that the withdrawal be delayed six months beyond the date that had been set. All the while you continue to bleed in Iraq and Afghanistan. You are wading into a war with no end in sight on the horizon and which has no connection to your security, which was confirmed by the operation of ‘Umar al-Faruq, which was not launched from the battlefield and could have been launched from any place in the world.</p><p>As for us, jihad against the tyrants and the aggressors is a form of great worship in our religion. It is more precious to us than our fathers and sons. Thus, our jihad against you is worship, and your killing us is a testimony. Thanks to God, Almighty, we have been waging jihad for 30 years, against the Russians and<br/>then against you. Not a single one of our men has committed suicide, whereas every 30 days 30 of your men commit suicide.</p><p>Continue the war if you will.</p><p><em><strong>Palestine shall not be seen captive for we will try to break its shackles.<br/>The United States shall pay for its arrogance with the blood of Christians and their funds.</strong></em></p><p>Peace be upon those who follow right guidance.</p><p>Justice is the strongest army, and security is the best way of life, but it slipped out of your grasp the day you made the Jews victorious in occupying our land and killing our brothers in Palestine. The path to security is for you to lift your oppression from us.</p></blockquote><div class=\"wp-block-image\"><figure class=\"aligncenter size-full\"><img alt=\"\" class=\"wp-image-60441\" decoding=\"async\" fetchpriority=\"high\" height=\"512\" sizes=\"(max-width: 512px) 100vw, 512px\" src=\"https://voxday.net/wp-content/uploads/2023/11/image-37.png\" srcset=\"https://voxday.net/wp-content/uploads/2023/11/image-37.png 512w, https://voxday.net/wp-content/uploads/2023/11/image-37-300x300.png 300w, https://voxday.net/wp-content/uploads/2023/11/image-37-150x150.png 150w\" width=\"512\"/></figure></div><p>There can’t be much doubt as to why Bin Ladin’s “Letter to the American People” is being disappeared, in light of the recent Hamas attacks, the Israeli invasion of Gaza, and the rush of US men and material to the Middle East. The neocons in the US and UK media are obviously attempting to prevent the pro-Palestinian side from presenting its perspective to the public, and more importantly, they are trying to hide the material link between the past US military defeats in Iraq and Afghanistan with the present US military presence in Syria, Israel, and the Eastern Mediterranean Sea.</p><p>I doubt it matters in the slightest. As even the ADL has reported, the youngest generation in the West is solidly against the Israeli position in the Gaza conflict, while only the Boomers generally support it. While the Millennials and Generation X are more balanced – or in the case of GenX, characteristically apathetic – neither of them are even remotely interested in fighting anyone in the Middle East for any reason.</p><p>But there can be little question that this is an all-hands-on-deck situation for the neocons, so it will be very informative to observe which public figures fall in line with the demands of the Narrative, and which ones are not being controlled.</p><p><strong>UPDATE: </strong>The media is officially upset that its attempt to disappear the Bin Ladin letter has failed:</p><blockquote class=\"wp-block-quote is-layout-flow wp-block-quote-is-layout-flow\"><p>A vile letter written by the warlord behind the 9/11 atrocities has gone viral on TikTok with users saying that reading it has led to them ‘understanding’ as to why the horrific attacks were carried out in 2001. The letter began to gain traction online after UK newspaper The Guardian linked to a 2002 article which translated it in full in an article about the ongoing Israel-Hamas war. It was subsequently deleted with the outlet telling DailyMail.com in a statement that it was removed because was being shared ‘without its original context.’</p></blockquote><p>They’re not even attempting to pretend to be journalists anymore. The letter is “vile”? The attacks were “horrific”? Furthermore, <em>The Guardian</em> linked to the article in 2002, so the letter began to gain traction 21 years later, which is indeed “after” the link, but is a very misleading way to describe what happened and why people are paying attention to the vanished letter.</p><p>Remember, facts provided without approved context consistent with the Narrative is misinformation.</p><p><em><a href=\"https://social.infogalactic.com/micropost/b4986ba8-2e24-48e4-b0c0-8baea10b35e6\">DISCUSS ON SG</a></em></p></div>",
  "content_text": "Osama bin Laden wanted to speak directly to the American people.\nAn undated letter promising endless war is one of hundreds of documents collected in the May 2, 2011 raid on his compound in Pakistan that was released Wednesday. The full text is below.\nHowever,\nthe full text\nof the letter was not actually provided by Foreign Policy. Two lines, highlighted below in bold italics, were omitted with the following note.\n(TN: Two lines of poetry that say the Mujahidin will not stop fighting until the United States leaves their land.)\nEven more intriguing,\nThe Guardian\njust disappeared the page\non which the letter had been published for the last 21 years.\nRemoved: document\nWed 15 Nov 2023 21.19 CET\nThis page previously displayed a document containing, in translation, the full text of Osama bin Laden’s “letter to the American people”, as reported in the Observer on Sunday 24 November 2002. The document, which was published here on the same day, was removed on 15 November 2023.\nIn the name of Allah, the Compassionate, the Merciful.\nFrom Usama Bin Muhammad Bin Ladin to the American people,\nI speak to you about the subject of the ongoing war between you and us. Even though the consensus of your wise thinkers and others is that your time (TN: of defeat) will come, compassion for the women and children who are being unjustly killed, wounded, and displaced in Iraq, Afghanistan, and Pakistan motivates me to speak to you.\nFirst of all, I would like to say that your war with us is the longest war in your history and the most expensive for you financially. As for us, we see it as being only halfway finished. If you were to ask your wise thinkers, they would tell you that there is no way to win it because the indications are\nagainst it. How will you win a war whose leaders are pessimistic and whose soldiers are committing suicide? If fear enters the hearts of men, winning the war becomes impossible. How will you\nwin a war whose cost is like a hurricane blowing violently at your economy and weakening your dollar?\nThe Bush administration got you into these wars on the premise that they were vital to your security. He promised that it would be a quick war, won within six days or six weeks; however, six years have passed, and they are still promising you victory and not achieving it. Then Obama came and delayed the withdrawal that he had promised you by 16 more months. He promised you victory in Afghanistan and set a date for withdrawal from there. Six months later, Petraeus came to you once again with the number six, requesting that the withdrawal be delayed six months beyond the date that had been set. All the while you continue to bleed in Iraq and Afghanistan. You are wading into a war with no end in sight on the horizon and which has no connection to your security, which was confirmed by the operation of ‘Umar al-Faruq, which was not launched from the battlefield and could have been launched from any place in the world.\nAs for us, jihad against the tyrants and the aggressors is a form of great worship in our religion. It is more precious to us than our fathers and sons. Thus, our jihad against you is worship, and your killing us is a testimony. Thanks to God, Almighty, we have been waging jihad for 30 years, against the Russians and\nthen against you. Not a single one of our men has committed suicide, whereas every 30 days 30 of your men commit suicide.\nContinue the war if you will.\nPalestine shall not be seen captive for we will try to break its shackles.\nThe United States shall pay for its arrogance with the blood of Christians and their funds.\nPeace be upon those who follow right guidance.\nJustice is the strongest army, and security is the best way of life, but it slipped out of your grasp the day you made the Jews victorious in occupying our land and killing our brothers in Palestine. The path to security is for you to lift your oppression from us.\nThere can’t be much doubt as to why Bin Ladin’s “Letter to the American People” is being disappeared, in light of the recent Hamas attacks, the Israeli invasion of Gaza, and the rush of US men and material to the Middle East. The neocons in the US and UK media are obviously attempting to prevent the pro-Palestinian side from presenting its perspective to the public, and more importantly, they are trying to hide the material link between the past US military defeats in Iraq and Afghanistan with the present US military presence in Syria, Israel, and the Eastern Mediterranean Sea.\nI doubt it matters in the slightest. As even the ADL has reported, the youngest generation in the West is solidly against the Israeli position in the Gaza conflict, while only the Boomers generally support it. While the Millennials and Generation X are more balanced – or in the case of GenX, characteristically apathetic – neither of them are even remotely interested in fighting anyone in the Middle East for any reason.\nBut there can be little question that this is an all-hands-on-deck situation for the neocons, so it will be very informative to observe which public figures fall in line with the demands of the Narrative, and which ones are not being controlled.\nUPDATE:\nThe media is officially upset that its attempt to disappear the Bin Ladin letter has failed:\nA vile letter written by the warlord behind the 9/11 atrocities has gone viral on TikTok with users saying that reading it has led to them ‘understanding’ as to why the horrific attacks were carried out in 2001. The letter began to gain traction online after UK newspaper The Guardian linked to a 2002 article which translated it in full in an article about the ongoing Israel-Hamas war. It was subsequently deleted with the outlet telling DailyMail.com in a statement that it was removed because was being shared ‘without its original context.’\nThey’re not even attempting to pretend to be journalists anymore. The letter is “vile”? The attacks were “horrific”? Furthermore,\nThe Guardian\nlinked to the article in 2002, so the letter began to gain traction 21 years later, which is indeed “after” the link, but is a very misleading way to describe what happened and why people are paying attention to the vanished letter.\nRemember, facts provided without approved context consistent with the Narrative is misinformation.\nDISCUSS ON SG",
  "tags": [
    "history",
    "neocons",
    "war"
  ],
  "categories": [],
  "sitemap_lastmod": "2023-11-16T15:53:14+00:00"
}