{
  "url": "https://voxday.net/2023/11/01/the-rage-is-boundless/",
  "scraped_at": "2026-01-08T14:14:09.339082",
  "title": "The Rage is Boundless",
  "date_display": "November 1, 2023",
  "date_iso": "2023-11-01T17:06:16+00:00",
  "date_from_url": "2023-11-01",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>I don’t mean to elevate the blood pressure of anyone who is reading alternative media, but I fear it has been reliably reported on social media that <a href=\"https://gab.com/NeonRevolt/posts/111336219958927947\">new Hamas outrages</a> have been discovered.</p><ul class=\"wp-block-list\"><li>Hamas hands Israeli babies bottles but they are actually dynamite sticks painted to look like bottles, and they explode after the babies realize the fuse is lit.</li><li>Hamas paints walls to look like tunnels and then makes Israeli babies drive into the walls thinking it was a road the whole time.</li><li>Hamas puts Israeli babies on see-saws and then drops anvils on the opposite side, launching the Israeli babies into the stratosphere.</li></ul><p>There is only one solution to these unconceivable horrors committed by subhuman animals, and that is to send in every single soldier in the US Army and the US Marine Corps to genocide the entire Gaza Strip, West Bank, and the East Bank. Also, Syria, Iran, and southern… what the hell, all of Lebanon too. After which, gold-plated condominiums will be constructed, at US expense, to console the shattered survivors of these unprecedented outrages.</p><p>Anything less would be an anti-semitic hate crime. Write your congressman!</p><p><strong>UPDATE: </strong>The media elites <a href=\"https://blogs.timesofisrael.com/why-israel-is-fast-losing-the-public-relations-war/\">really don’t get it</a>. The lack of self-awareness is astonishing.</p><blockquote class=\"wp-block-quote is-layout-flow wp-block-quote-is-layout-flow\"><p>Israel has made two major mistakes.</p><ul class=\"wp-block-list\"><li>First, the goals of the war have been poorly articulated.</li><li> It has failed sufficiently to emphasize that an entire army of accomplices stands behind Hamas.</li></ul> <cite>Why Israel is fast losing the public relations war, THE TIMES OF ISRAEL, 1 November 2023</cite></blockquote><p>The first point is relevant, the second one is not, but neither explain the global loss of sympathy for the Israelis in the aftermath of the October 7th attacks. The reason Israel is now losing the public relations war is because a) the response is observably and statistically disproportionate, b) the misguided attempt to capitalize on the initial world reaction through <em>argumentum iniuriae</em> has failed due to both a lack of credibility and a complete failure to read the crowd, c) the media narrative contradicts the Ukraine media narrative of the last 20 months, and d) neocon + ADL overreach.</p><p><strong>UPDATE:</strong> It appears the Israeli propagandists failed to learn the lesson of Sandy Hook, which is this: <em>Americans don’t give a fuck</em> <em>anymore</em>. GenX and the younger generations are not gullible Silents and Boomers. We all know that governments have historically done terrible things in order to get the people to buy into whatever their cause du jour is. So, the elites can fly false flags and slaughter every kindergartener in New Jersey, they can rape every puppy and kitten in Tel Aviv, and it still won’t move us to support them one little bit.</p><p>Also, you might not want to run with “dead babies” when you support abortion. Your rhetoric is DOA. I mean, what’s the real problem there, the lack of maternal consent to the murder?</p><p><a href=\"https://social.infogalactic.com/micropost/d041839c-8b7b-4854-87a4-f6377663cd25\">DISCUSS ON SG</a></p></div>",
  "content_text": "I don’t mean to elevate the blood pressure of anyone who is reading alternative media, but I fear it has been reliably reported on social media that\nnew Hamas outrages\nhave been discovered.\nHamas hands Israeli babies bottles but they are actually dynamite sticks painted to look like bottles, and they explode after the babies realize the fuse is lit.\nHamas paints walls to look like tunnels and then makes Israeli babies drive into the walls thinking it was a road the whole time.\nHamas puts Israeli babies on see-saws and then drops anvils on the opposite side, launching the Israeli babies into the stratosphere.\nThere is only one solution to these unconceivable horrors committed by subhuman animals, and that is to send in every single soldier in the US Army and the US Marine Corps to genocide the entire Gaza Strip, West Bank, and the East Bank. Also, Syria, Iran, and southern… what the hell, all of Lebanon too. After which, gold-plated condominiums will be constructed, at US expense, to console the shattered survivors of these unprecedented outrages.\nAnything less would be an anti-semitic hate crime. Write your congressman!\nUPDATE:\nThe media elites\nreally don’t get it\n. The lack of self-awareness is astonishing.\nIsrael has made two major mistakes.\nFirst, the goals of the war have been poorly articulated.\nIt has failed sufficiently to emphasize that an entire army of accomplices stands behind Hamas.\nWhy Israel is fast losing the public relations war, THE TIMES OF ISRAEL, 1 November 2023\nThe first point is relevant, the second one is not, but neither explain the global loss of sympathy for the Israelis in the aftermath of the October 7th attacks. The reason Israel is now losing the public relations war is because a) the response is observably and statistically disproportionate, b) the misguided attempt to capitalize on the initial world reaction through\nargumentum iniuriae\nhas failed due to both a lack of credibility and a complete failure to read the crowd, c) the media narrative contradicts the Ukraine media narrative of the last 20 months, and d) neocon + ADL overreach.\nUPDATE:\nIt appears the Israeli propagandists failed to learn the lesson of Sandy Hook, which is this:\nAmericans don’t give a fuck\nanymore\n. GenX and the younger generations are not gullible Silents and Boomers. We all know that governments have historically done terrible things in order to get the people to buy into whatever their cause du jour is. So, the elites can fly false flags and slaughter every kindergartener in New Jersey, they can rape every puppy and kitten in Tel Aviv, and it still won’t move us to support them one little bit.\nAlso, you might not want to run with “dead babies” when you support abortion. Your rhetoric is DOA. I mean, what’s the real problem there, the lack of maternal consent to the murder?\nDISCUSS ON SG",
  "tags": [
    "rhetoric",
    "war",
    "Zion"
  ],
  "categories": [],
  "sitemap_lastmod": "2023-11-01T19:25:45+00:00"
}