{
  "url": "https://voxday.net/2023/11/26/the-dangers-of-the-moment/",
  "scraped_at": "2026-01-08T14:16:34.617219",
  "title": "The Dangers of the Moment",
  "date_display": "November 26, 2023",
  "date_iso": "2023-11-26T11:59:46+00:00",
  "date_from_url": "2023-11-26",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>Even U.S. Senators <a href=\"https://twitter.com/AmericazOutlaw/status/1728146267245572115\">are now publicly testifying</a> to the existence of “an elite group of people” who are attempting to take “total control” by using global events like the pandemic through methods like the Covid vaccines:</p><blockquote class=\"wp-block-quote is-layout-flow wp-block-quote-is-layout-flow\"><p><strong>MARIA BARTIROMO:</strong> It’s just extraordinary to me that, you know, the government was working with social media to amplify the lies and suppress truth, and has been doing so repeatedly. Why can’t the American people know that there were side effects to the vaccine?</p><p><strong>SENATOR RON JOHNSON (R-WI): </strong>This is all pre-planned by an elite group of people. That’s what I’m talking about. Event 201 occurred in late 2019, prior to the rest of us knowing about this pandemic. This is very concerning in terms of what has happened, what is happening, what continues to be planned for our loss of freedom. Again, it needs to be exposed, but unfortunately, there are very few people, even in Congress, who are willing to take a look at this. They all pushed the vaccine. They don’t want to be made aware of the fact the vaccines might have caused injuries, might have caused deaths. So many people simply don’t want to admit they were wrong and they’re going to makes sure to do everything they can to ensure they’re not proven wrong.</p><p>We’re up against a very powerful group of people here, Maria. We need the truth to be exposed, we need more Americans to listen to the truth, to be exposed to the truth, to pull their heads out of the sand, quite honestly, to open up their eyes and understand what is happening to this country. We are going down a very dangerous path, but it is a path that is being laid out and planned by an elite group of people that want to take total control over our lives. And that’s what they’re doing, bit by bit. They do it by massively increasing government spending, increasing the size of government, these amendments that are coming up that are going to be voted on in 2024, the WHO, are frightening and they really risk taking away all of our sovereignty. People have to awaken to the dangers of the moment.</p></blockquote><p>The evidence is not only out there, it is literally right in front of everyone. It’s not 1950 in America anymore and the Dark is literally rising. This isn’t a situation that one can hope to avoid by sitting on the fence or by averting one’s eyes.</p><p><em><a href=\"https://social.infogalactic.com/micropost/6148de33-4ceb-43d8-8d42-f46d1c45fd1b\">DISCUSS ON SG</a></em></p></div>",
  "content_text": "Even U.S. Senators\nare now publicly testifying\nto the existence of “an elite group of people” who are attempting to take “total control” by using global events like the pandemic through methods like the Covid vaccines:\nMARIA BARTIROMO:\nIt’s just extraordinary to me that, you know, the government was working with social media to amplify the lies and suppress truth, and has been doing so repeatedly. Why can’t the American people know that there were side effects to the vaccine?\nSENATOR RON JOHNSON (R-WI):\nThis is all pre-planned by an elite group of people. That’s what I’m talking about. Event 201 occurred in late 2019, prior to the rest of us knowing about this pandemic. This is very concerning in terms of what has happened, what is happening, what continues to be planned for our loss of freedom. Again, it needs to be exposed, but unfortunately, there are very few people, even in Congress, who are willing to take a look at this. They all pushed the vaccine. They don’t want to be made aware of the fact the vaccines might have caused injuries, might have caused deaths. So many people simply don’t want to admit they were wrong and they’re going to makes sure to do everything they can to ensure they’re not proven wrong.\nWe’re up against a very powerful group of people here, Maria. We need the truth to be exposed, we need more Americans to listen to the truth, to be exposed to the truth, to pull their heads out of the sand, quite honestly, to open up their eyes and understand what is happening to this country. We are going down a very dangerous path, but it is a path that is being laid out and planned by an elite group of people that want to take total control over our lives. And that’s what they’re doing, bit by bit. They do it by massively increasing government spending, increasing the size of government, these amendments that are coming up that are going to be voted on in 2024, the WHO, are frightening and they really risk taking away all of our sovereignty. People have to awaken to the dangers of the moment.\nThe evidence is not only out there, it is literally right in front of everyone. It’s not 1950 in America anymore and the Dark is literally rising. This isn’t a situation that one can hope to avoid by sitting on the fence or by averting one’s eyes.\nDISCUSS ON SG",
  "tags": [
    "Clown World",
    "conspiracy",
    "vaccines"
  ],
  "categories": [],
  "sitemap_lastmod": "2023-11-26T15:37:51+00:00"
}