{
  "url": "https://voxday.net/2023/11/23/you-never-were-kemosabe/",
  "scraped_at": "2026-01-08T14:16:15.791020",
  "title": "You Never Were, Kemosabe",
  "date_display": "November 23, 2023",
  "date_iso": "2023-11-23T08:58:52+00:00",
  "date_from_url": "2023-11-23",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>All of the fraudulent “dual-citizen” nonsense was fake and false from the moment of <a href=\"https://infogalactic.com/info/Afroyim_v._Rusk\">its invention by the Supreme Court</a> in 1967. No matter how much Ben Shapiro swears up and down that he’s a real American and insists that he doesn’t even hold an Israeli passport, it’s been obvious and observable for literal decades that his sympathies and true allegiances lie elsewhere despite his citizenship papers.</p><p>For example, all it took <a href=\"https://www.rt.com/business/587391-israel-banks-segregation-russian-assets/\">to expose the true colors</a> of Russian-Israeli citizens was the US sanctions regime imposed upon the European financial institutions:</p><blockquote class=\"wp-block-quote is-layout-flow wp-block-quote-is-layout-flow\"><p>Several leading Israeli banks have begun to segregate accounts belonging to Russian citizens or Russian tax residents, Forbes and RBK reported on Thursday, citing lawyers and financiers. According to Mark Oigman, founder of international financial company SmartGen, the measures stem from EU sanctions, in particular restrictions introduced against Russians by the Belgian-based depositary Euroclear.</p><p><em>“Israeli banks began verbally warning some of their clients – most likely many – about the risks of blocking last week. Many people last week sold everything they could sell to avoid segregation. According to my estimates, few securities were blocked, since a lot of work was done, and at least private banking clients, wealthy Russians, managed to sell assets subject to segregation,”</em> Oigman told RBK.</p><p>According to Aleksey Kovalenko of Israel-based legal firm Kovalenko and Partners, Israeli banks are currently negotiating the details of asset segregations with Euroclear, as many account holders have duel Russian-Israeli citizenship, and permanently live in Israel.</p><p><em>“The Israeli side insists that those who have an Israeli passport are in fact Israelis and should not be subject to the restrictions that should affect Russians, even despite having a second Russian passport,” </em>the lawyer stated.</p> <cite>Israeli banks blocking Russian assets, RUSSIA TODAY, 16 November 2023</cite></blockquote><p>It didn’t even take that much <a href=\"https://blogs.timesofisrael.com/im-getting-more-jewish-by-the-day/\">to expose the falsity</a> of some paper Americans:</p><blockquote class=\"wp-block-quote is-layout-flow wp-block-quote-is-layout-flow\"><p>The ONLY people I care about are <strong>my </strong>people, Israel. I have my reasons. I have some thoughts. However unconnected they seem, they are, I am connecting the dots. <strong>October 7th, the day we will never forget.</strong> I cried, non-stop for a week. felt the shock and devastation of my people like I have never felt before. I am ashamed to have thought in the past, I’m an American first. An American Jew, raised Conservative, practicing, not practicing, and practicing again, the <strong>only </strong>comfort now is in the company of other Jews.</p> <cite>Lauren Herman, THE TIMES OF ISRAEL, 25 October 2023</cite></blockquote><p>Americans know this. We have always known. To paraphrase an imaginary American Indian: <em>“who is this ‘we’, kemosabe?”</em> The only thing that has changed is that some of the “dual-citizens” no longer find it in their interests to pretend anymore, and so they are finally admitting that they were never Americans, or Russians, or Frenchmen, at all.</p><p>There is absolutely nothing wrong with being proud of your people and putting the interests of your nation first. That’s precisely what Israelis should do, whether it is a time of war or not. But pretending to be Americans, or Russians, or anything else at the same time is not only wrong, it is insidious and it is intrinsically untruthful, which is why it required the usual 1960s-era emanations and penumbras to provide a judicially-contorted basis for the false foundation of dual-citizenry.</p><p><em><a href=\"https://social.infogalactic.com/micropost/845bbc4f-efe6-447c-adc2-976aafb24e2a\">DISCUSS ON SG</a></em></p></div>",
  "content_text": "All of the fraudulent “dual-citizen” nonsense was fake and false from the moment of\nits invention by the Supreme Court\nin 1967. No matter how much Ben Shapiro swears up and down that he’s a real American and insists that he doesn’t even hold an Israeli passport, it’s been obvious and observable for literal decades that his sympathies and true allegiances lie elsewhere despite his citizenship papers.\nFor example, all it took\nto expose the true colors\nof Russian-Israeli citizens was the US sanctions regime imposed upon the European financial institutions:\nSeveral leading Israeli banks have begun to segregate accounts belonging to Russian citizens or Russian tax residents, Forbes and RBK reported on Thursday, citing lawyers and financiers. According to Mark Oigman, founder of international financial company SmartGen, the measures stem from EU sanctions, in particular restrictions introduced against Russians by the Belgian-based depositary Euroclear.\n“Israeli banks began verbally warning some of their clients – most likely many – about the risks of blocking last week. Many people last week sold everything they could sell to avoid segregation. According to my estimates, few securities were blocked, since a lot of work was done, and at least private banking clients, wealthy Russians, managed to sell assets subject to segregation,”\nOigman told RBK.\nAccording to Aleksey Kovalenko of Israel-based legal firm Kovalenko and Partners, Israeli banks are currently negotiating the details of asset segregations with Euroclear, as many account holders have duel Russian-Israeli citizenship, and permanently live in Israel.\n“The Israeli side insists that those who have an Israeli passport are in fact Israelis and should not be subject to the restrictions that should affect Russians, even despite having a second Russian passport,”\nthe lawyer stated.\nIsraeli banks blocking Russian assets, RUSSIA TODAY, 16 November 2023\nIt didn’t even take that much\nto expose the falsity\nof some paper Americans:\nThe ONLY people I care about are\nmy\npeople, Israel. I have my reasons. I have some thoughts. However unconnected they seem, they are, I am connecting the dots.\nOctober 7th, the day we will never forget.\nI cried, non-stop for a week. felt the shock and devastation of my people like I have never felt before. I am ashamed to have thought in the past, I’m an American first. An American Jew, raised Conservative, practicing, not practicing, and practicing again, the\nonly\ncomfort now is in the company of other Jews.\nLauren Herman, THE TIMES OF ISRAEL, 25 October 2023\nAmericans know this. We have always known. To paraphrase an imaginary American Indian:\n“who is this ‘we’, kemosabe?”\nThe only thing that has changed is that some of the “dual-citizens” no longer find it in their interests to pretend anymore, and so they are finally admitting that they were never Americans, or Russians, or Frenchmen, at all.\nThere is absolutely nothing wrong with being proud of your people and putting the interests of your nation first. That’s precisely what Israelis should do, whether it is a time of war or not. But pretending to be Americans, or Russians, or anything else at the same time is not only wrong, it is insidious and it is intrinsically untruthful, which is why it required the usual 1960s-era emanations and penumbras to provide a judicially-contorted basis for the false foundation of dual-citizenry.\nDISCUSS ON SG",
  "tags": [
    "law",
    "nationalism"
  ],
  "categories": [],
  "sitemap_lastmod": "2023-11-23T09:08:31+00:00"
}