{
  "url": "https://voxday.net/2019/05/03/attacking-american-history/",
  "scraped_at": "2025-12-20T05:39:50.405187",
  "title": "Attacking American history",
  "date_display": "May 3, 2019",
  "date_iso": "2019-05-03T15:49:11+00:00",
  "date_from_url": "2019-05-03",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>Once America’s Christian heritage was replaced by “Judeo-Christian heritage”, once the immigrant propaganda about “melting pots” and “huddled masses” and “a nation of immigrants” was accepted, it was only a matter of time before the successionist Replacement Americans began demanding the removal of every trace of America’s founders. Now <a href=\"https://www.campusreform.org/?ID=12043\">the target is the much-hated Thomas Jefferson</a>, who was objectively far more racist than Robert E. Lee ever was and whose words remind the successionists that they are not, and never will be, Americans.</p><blockquote><p>Students at Hofstra University protested a statue of Thomas Jefferson on Friday at the second annual event, titled “Jefferson Has Gotta Go!”</p><p>The statue has been the center of controversy on the campus and has been defaced with “DECOLONIZE” and “Black Lives Matter” signs and stickers. According to a media advisory sent by the Jefferson Has Gotta Go (JGG) campaign, the protest was held at Hofstra Breslin Hall. Organizers included “students of Hofstra University, staff from Planned Parenthood of Nassau County, and supporters of Hempstead community.”</p><p>The group gathered on campus to “expose the culture of bias and discrimination,” as stated in the media advisory, and to demand “the statue of Thomas Jefferson is removed.”</p><p>Hofstra College Democrats “want the statue to be removed and [we] stand with the Jefferson Has Gotta Go Campaign,” the group’s president, Brynne Levine, told Campus Reform.</p><p>Former College Democrats executive board member Miranda Pino also professed her support. “JGG isn’t just about a statue,” she told Campus Reform. “Yes, the removal of the statue is important, but it is about what the statue represents: a legacy of racism and bigotry on college campuses.”</p></blockquote><p>The moment you compromise the truth in order to assuage some minority’s feelings, you have abandoned everything. There is literally no defense for the conservative anti-racists, the cuckservatives, or the civic nationalists who proudly claim to not see color. They abandoned the truth and they abandoned history the moment that they compromised themselves in the name of equality.</p></div>",
  "content_text": "Once America’s Christian heritage was replaced by “Judeo-Christian heritage”, once the immigrant propaganda about “melting pots” and “huddled masses” and “a nation of immigrants” was accepted, it was only a matter of time before the successionist Replacement Americans began demanding the removal of every trace of America’s founders. Now\nthe target is the much-hated Thomas Jefferson\n, who was objectively far more racist than Robert E. Lee ever was and whose words remind the successionists that they are not, and never will be, Americans.\nStudents at Hofstra University protested a statue of Thomas Jefferson on Friday at the second annual event, titled “Jefferson Has Gotta Go!”\nThe statue has been the center of controversy on the campus and has been defaced with “DECOLONIZE” and “Black Lives Matter” signs and stickers. According to a media advisory sent by the Jefferson Has Gotta Go (JGG) campaign, the protest was held at Hofstra Breslin Hall. Organizers included “students of Hofstra University, staff from Planned Parenthood of Nassau County, and supporters of Hempstead community.”\nThe group gathered on campus to “expose the culture of bias and discrimination,” as stated in the media advisory, and to demand “the statue of Thomas Jefferson is removed.”\nHofstra College Democrats “want the statue to be removed and [we] stand with the Jefferson Has Gotta Go Campaign,” the group’s president, Brynne Levine, told Campus Reform.\nFormer College Democrats executive board member Miranda Pino also professed her support. “JGG isn’t just about a statue,” she told Campus Reform. “Yes, the removal of the statue is important, but it is about what the statue represents: a legacy of racism and bigotry on college campuses.”\nThe moment you compromise the truth in order to assuage some minority’s feelings, you have abandoned everything. There is literally no defense for the conservative anti-racists, the cuckservatives, or the civic nationalists who proudly claim to not see color. They abandoned the truth and they abandoned history the moment that they compromised themselves in the name of equality.",
  "tags": [
    "history"
  ],
  "categories": [],
  "sitemap_lastmod": "2019-05-03T14:49:11+00:00"
}