{
  "url": "https://voxday.net/2019/05/01/brother-esau/",
  "scraped_at": "2025-12-20T05:39:33.865056",
  "title": "Brother Esau",
  "date_display": "May 1, 2019",
  "date_iso": "2019-05-01T13:13:52+00:00",
  "date_from_url": "2019-05-01",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>The Orthosphere delves into <a href=\"https://orthosphere.wordpress.com/2019/04/19/you-scratch-my-back-ill-stab-yours/\">the intrinsic falsity of the “Judeo-Christian” meme</a> that is being used to attack everything from American history to Western Civilization and Christianity itself:</p><blockquote><p>The notion that Western civilization rests on a Judeo-Christian basis is very largely an invention of the 1940s, when Jews felt a sudden and unprecedented desire to join the Western club and lock arms with their Christian “brothers.” Although a palpable oxymoron, the phrase prospered in the years that followed, and is now well established as one of the hardier weeds in the unlovely garden of American political cant.</p><p>Obviously, there can be no such thing as Judeo-Christian values when Jews specifically reject the highest Christian value, which is Christ.</p><p>We might go so far as to call Judeo-Christian values a canard, and say that this canard serves mainly to de-divinize Christ, and thus dissolve Christianity into a purely ethical system. Curiously, the solvent power of this canard is somehow neutralized when it comes to doctrines that are distinctly Jewish. I would add that the canard also serves to reconcile Christians to the fact that they nowadays receive so much of their moral, political and theological instruction from strongly self-identified Jews.  Curiously, the respect that Jews feel for the teaching authority of strongly self-identified Christians remains as low as ever.</p><p>What this suggests is that modern Judeo-Christianity is Christianity made acceptable to Jews.  It does not seem to involve reciprocal modifications to Judaism.  Indeed, the basic Judeo-Christian condominium would seem to be that Christians shall say only nice things about Jews, while Jews shall go on gifting Christians with their withering criticism.</p><p>Now that Jews and Christians are brothers, we see that the Christians are brother Esau.</p></blockquote><p>There is considerably more there. Read the whole thing. To be blunt, it would be more accurate to describe “Judeo-Christianity” as “Luciferianity”. There is a fundamental difference to being “in the world, but not of it” and “healing the world”. It is literally the most fundamental precept of Christianity to accept that the world is fallen, is ruled by spiritual evil, and <i>cannot be healed</i>.</p><p>To insist otherwise is to deny the necessity for the Incarnation, the Crucifixion, and the Resurrection. Which, of course, is precisely why the Ben Shapiros and Dennis Pragers and <i>San Francisco Chronicle</i>‘s of the world are now attempting to sell this literally Satanic concept to an increasingly clueless and demoralized West.</p></div>",
  "content_text": "The Orthosphere delves into\nthe intrinsic falsity of the “Judeo-Christian” meme\nthat is being used to attack everything from American history to Western Civilization and Christianity itself:\nThe notion that Western civilization rests on a Judeo-Christian basis is very largely an invention of the 1940s, when Jews felt a sudden and unprecedented desire to join the Western club and lock arms with their Christian “brothers.” Although a palpable oxymoron, the phrase prospered in the years that followed, and is now well established as one of the hardier weeds in the unlovely garden of American political cant.\nObviously, there can be no such thing as Judeo-Christian values when Jews specifically reject the highest Christian value, which is Christ.\nWe might go so far as to call Judeo-Christian values a canard, and say that this canard serves mainly to de-divinize Christ, and thus dissolve Christianity into a purely ethical system. Curiously, the solvent power of this canard is somehow neutralized when it comes to doctrines that are distinctly Jewish. I would add that the canard also serves to reconcile Christians to the fact that they nowadays receive so much of their moral, political and theological instruction from strongly self-identified Jews.  Curiously, the respect that Jews feel for the teaching authority of strongly self-identified Christians remains as low as ever.\nWhat this suggests is that modern Judeo-Christianity is Christianity made acceptable to Jews.  It does not seem to involve reciprocal modifications to Judaism.  Indeed, the basic Judeo-Christian condominium would seem to be that Christians shall say only nice things about Jews, while Jews shall go on gifting Christians with their withering criticism.\nNow that Jews and Christians are brothers, we see that the Christians are brother Esau.\nThere is considerably more there. Read the whole thing. To be blunt, it would be more accurate to describe “Judeo-Christianity” as “Luciferianity”. There is a fundamental difference to being “in the world, but not of it” and “healing the world”. It is literally the most fundamental precept of Christianity to accept that the world is fallen, is ruled by spiritual evil, and\ncannot be healed\n.\nTo insist otherwise is to deny the necessity for the Incarnation, the Crucifixion, and the Resurrection. Which, of course, is precisely why the Ben Shapiros and Dennis Pragers and\nSan Francisco Chronicle\n‘s of the world are now attempting to sell this literally Satanic concept to an increasingly clueless and demoralized West.",
  "tags": [
    "NeoCon"
  ],
  "categories": [],
  "sitemap_lastmod": "2019-05-01T12:13:52+00:00"
}