{
  "url": "https://voxday.net/2019/05/18/catholicism-is-not-paganism/",
  "scraped_at": "2025-12-20T05:41:23.008150",
  "title": "Catholicism is not paganism",
  "date_display": "May 18, 2019",
  "date_iso": "2019-05-18T16:59:56+00:00",
  "date_from_url": "2019-05-18",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>I have no idea who this “Red Pill Religion” moron is or what he is smoking <a href=\"https://www.youtube.com/watch?v=E2PR0bQEtbU\">with regards to my theological opinions</a>:</p><blockquote class=\"tr_bq\"><p><b>Red Pill Religion</b><br>Vox Day, Rockin MrE, and others these days suggest Catholic Christianity is “Pagan.” Or even that the Trinity is “pagan.” Do those who make this suggestion know what they’re saying, especially when they try to defend “Western Civilization?”</br></p></blockquote><p>All we know at this point is that he is both a) an acquaintance of John C. Wright and b) a shameless liar who is observably bearing false witness against me. <u>At no point</u> have I <u>ever</u> stated, suggested, or even implied that either Catholic Christianity or the concept of the Trinity is pagan. To the contrary, note that even <a href=\"https://www.youtube.com/redirect?v=E2PR0bQEtbU&amp;redir_token=h2ETTACSMwA348lO-4AvMnxENPN8MTU1ODI2NzMxN0AxNTU4MTgwOTE3&amp;event=video_description&amp;q=https{078d2fa92d2710998490ec6979ca31630e0fb1e1550511b9ab87370364231a3d}3A{078d2fa92d2710998490ec6979ca31630e0fb1e1550511b9ab87370364231a3d}2F{078d2fa92d2710998490ec6979ca31630e0fb1e1550511b9ab87370364231a3d}2Fvoxday.blogspot.com{078d2fa92d2710998490ec6979ca31630e0fb1e1550511b9ab87370364231a3d}2F2012{078d2fa92d2710998490ec6979ca31630e0fb1e1550511b9ab87370364231a3d}2F03{078d2fa92d2710998490ec6979ca31630e0fb1e1550511b9ab87370364231a3d}2Ffalse-doctrine-of-trinity.html\">the link provided to my blog</a> contains a quote from Isaac Newton which states that the concept of the Trinity dates back to Athanasius, a 4th-century Christian.</p><p>Now to be clear, the Trinity is <u>NOT</u> a theological concept that appears explicitly in either the Nicene Creed or the Bible. Like the Rapture and the Immaculate Conception, the Trinity is non-Scriptural theological dogma that is historical conjecture based on what appears to me to be incorrect logic applied to Scripture. And I have made my position on these extra-Biblical traditions very clear:</p><p><i>I have no religious regard whatsoever for the various extra-Biblical traditions of the various Christian churches, although I do respect them in the same manner I respect many of the non-religious traditions of Man. But I consider Churchian dogma such as the Trinity, the Rapture, infant baptism, transubstantiation, purgatory, female pastors, bans on alchohol and dancing, Papal infallibility, and Bishop Ussher’s historical chronology to be no more theologically legitimate or Biblically supported than I do the sale of indulgences, Dante’s geography of Hell, or Milton’s history of Lucifer’s Fall.</i></p><p>The fact that I believe these various traditions to be erroneous does not mean that I believe them to be pagan or even materially detrimental to the faith. After all, are we not told that every Christian, beginning with the Apostle Paul, sees the truth as though through a glass, darkly? Furthermore, as I have noted previously, what most people incorrectly believe to be the Nicene Creed is not the Nicene Creed at all, but rather, a later declaration more accurately known as the Niceno-Constanopolitan Creed, which was adopted 56 years later by a council that did not even meet in Nicaea.</p><p>In fact, it’s even possible that the later Trinitarian creed is fictitious and was produced more than a century after the original Nicene Creed. <i>“A local council of Constantinople in 382 and the third ecumenical council (Ephesus, 431) made no mention of it, with the latter affirming the 325 creed of Nicaea as a valid statement of the faith… No extant document gives its text or makes explicit mention of it earlier than the fourth ecumenical council at Chalcedon in 451.”</i></p><p>Finally, anyone who is stupid enough to claim that my opinion has anything whatsoever to do with Arianism is either a liar or very, very stupid indeed, as <a href=\"http://infogalactic.com/info/Nicene_Creed\">the original Nicene Creed</a>, the actual and only Nicene Creed, the Nicene Creed to which I subscribe, was adopted specifically in order to <u>reject</u> Arianism.</p><blockquote class=\"tr_bq\"><p>The Nicene Creed was adopted to resolve the Arian controversy, whose leader, Arius, a clergyman of Alexandria, “objected to Alexander’s (the bishop of the time) apparent carelessness in blurring the distinction of nature between the Father and the Son by his emphasis on eternal generation”. In reply, Alexander accused Arius of denying the divinity of the Son and also of being too “Jewish” and “Greek” in his thought. Alexander and his supporters created the Nicene Creed to clarify the key tenets of the Christian faith in response to the widespread adoption of Arius’ doctrine, which was henceforth marked as heresy.</p></blockquote><p>Whoever runs the Red Pill Religion channel may or may not be a Christian, but he is obviously both ignorant and untruthful. As for defending Western civilization, it should be obvious that I know considerably more about its history than he does.</p></div>",
  "content_text": "I have no idea who this “Red Pill Religion” moron is or what he is smoking\nwith regards to my theological opinions\n:\nRed Pill Religion\nVox Day, Rockin MrE, and others these days suggest Catholic Christianity is “Pagan.” Or even that the Trinity is “pagan.” Do those who make this suggestion know what they’re saying, especially when they try to defend “Western Civilization?”\nAll we know at this point is that he is both a) an acquaintance of John C. Wright and b) a shameless liar who is observably bearing false witness against me.\nAt no point\nhave I\never\nstated, suggested, or even implied that either Catholic Christianity or the concept of the Trinity is pagan. To the contrary, note that even\nthe link provided to my blog\ncontains a quote from Isaac Newton which states that the concept of the Trinity dates back to Athanasius, a 4th-century Christian.\nNow to be clear, the Trinity is\nNOT\na theological concept that appears explicitly in either the Nicene Creed or the Bible. Like the Rapture and the Immaculate Conception, the Trinity is non-Scriptural theological dogma that is historical conjecture based on what appears to me to be incorrect logic applied to Scripture. And I have made my position on these extra-Biblical traditions very clear:\nI have no religious regard whatsoever for the various extra-Biblical traditions of the various Christian churches, although I do respect them in the same manner I respect many of the non-religious traditions of Man. But I consider Churchian dogma such as the Trinity, the Rapture, infant baptism, transubstantiation, purgatory, female pastors, bans on alchohol and dancing, Papal infallibility, and Bishop Ussher’s historical chronology to be no more theologically legitimate or Biblically supported than I do the sale of indulgences, Dante’s geography of Hell, or Milton’s history of Lucifer’s Fall.\nThe fact that I believe these various traditions to be erroneous does not mean that I believe them to be pagan or even materially detrimental to the faith. After all, are we not told that every Christian, beginning with the Apostle Paul, sees the truth as though through a glass, darkly? Furthermore, as I have noted previously, what most people incorrectly believe to be the Nicene Creed is not the Nicene Creed at all, but rather, a later declaration more accurately known as the Niceno-Constanopolitan Creed, which was adopted 56 years later by a council that did not even meet in Nicaea.\nIn fact, it’s even possible that the later Trinitarian creed is fictitious and was produced more than a century after the original Nicene Creed.\n“A local council of Constantinople in 382 and the third ecumenical council (Ephesus, 431) made no mention of it, with the latter affirming the 325 creed of Nicaea as a valid statement of the faith… No extant document gives its text or makes explicit mention of it earlier than the fourth ecumenical council at Chalcedon in 451.”\nFinally, anyone who is stupid enough to claim that my opinion has anything whatsoever to do with Arianism is either a liar or very, very stupid indeed, as\nthe original Nicene Creed\n, the actual and only Nicene Creed, the Nicene Creed to which I subscribe, was adopted specifically in order to\nreject\nArianism.\nThe Nicene Creed was adopted to resolve the Arian controversy, whose leader, Arius, a clergyman of Alexandria, “objected to Alexander’s (the bishop of the time) apparent carelessness in blurring the distinction of nature between the Father and the Son by his emphasis on eternal generation”. In reply, Alexander accused Arius of denying the divinity of the Son and also of being too “Jewish” and “Greek” in his thought. Alexander and his supporters created the Nicene Creed to clarify the key tenets of the Christian faith in response to the widespread adoption of Arius’ doctrine, which was henceforth marked as heresy.\nWhoever runs the Red Pill Religion channel may or may not be a Christian, but he is obviously both ignorant and untruthful. As for defending Western civilization, it should be obvious that I know considerably more about its history than he does.",
  "tags": [
    "anklebiters"
  ],
  "categories": [],
  "sitemap_lastmod": "2019-05-18T15:59:56+00:00"
}