{
  "url": "https://voxday.net/2019/05/29/ever-so-clever/",
  "scraped_at": "2025-12-20T05:42:29.540429",
  "title": "Ever so clever",
  "date_display": "May 29, 2019",
  "date_iso": "2019-05-29T10:46:33+00:00",
  "date_from_url": "2019-05-29",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>Further evidence that gammas will never, ever, understand that men who are higher up the social totem pole simply do not think like they do or share their concerns. Some illuminating comments in this regard from the Darkstream on YouTube.</p><blockquote><p>Billy Barnett<br>Revenge of the the sissy gammas are winning. don’t let them. They ain’t shit but shit posting faggots that havent done shit besides dogpile on the weak. Slap those bullies in the face and send em home crying to mommy.</br></p><p>Billy Barnett<br>Vox stop being a bitch and confront these gamma bitchs. Ask them wtf they have done and that you will teddy spaghetti all over their bitch ass faces. Its like yoir running bro. Dont!</br></p><p>Roland Black<br>Vox- you can turn the tables on ROTC by just embracing teddy spaghetti. Seriously, come out with a big bowl of spaghetti and chef boy ardee hat. It’s actually getting you tons of free publicity, embrace and enjoy. Show you have a sense of humor. Memes are part of the recipe to Alex Jones’ massive success. Embrace it!</br></p></blockquote><p>Notice how the gamma first pretends to be on your side, then attempts to convince you to do what he wants through appeals to what he assumes are your concerns about how you look to others. He never realizes either the transparency of his actions – the gamma always thinks he is fooling everyone – or the fact that normal men are much less concerned about what other people think than the gamma is.</p><p>Their problem is that I simply don’t care what these irrelevant YouTube gammas think, do, or say. Are they really under the impression that they are the first group to target me for a campaign of one sort or another? Just to put these things into perspective, I was targeted by the Council on American-Islamic Relations back in 2001, was attacked by Tor Books and its various authors and hangers-on in 2005, then by the entire SFWA in 2013, then by the international media from <i>Popular Science</i> to the <i>New Zealand Herald</i> in revenge for the success of Sad Puppies in 2015. I’ve been a subject of hit pieces by <i>National Public Radio</i> and <i>Wired</i>, just to name two, and was pointed out as a malignant influence in the <i>New York Times</i> as recently last week.</p><p>So, perhaps that brief and very incomplete summary will help people can understand that my level of indifference towards a hate campaign by a few attention-seeking YouTubers with a microscopic audience approaches infinity. They will have to find their Internet drama elsewhere. And if something becomes tedious for me, I simply shut it down. Considering that I abandoned a popular blog simply because I grew bored with the repetitious nature of the comments there, it should hardly be surprising that I am not even remotely reluctant to shut down the YouTube chat.</p></div>",
  "content_text": "Further evidence that gammas will never, ever, understand that men who are higher up the social totem pole simply do not think like they do or share their concerns. Some illuminating comments in this regard from the Darkstream on YouTube.\nBilly Barnett\nRevenge of the the sissy gammas are winning. don’t let them. They ain’t shit but shit posting faggots that havent done shit besides dogpile on the weak. Slap those bullies in the face and send em home crying to mommy.\nBilly Barnett\nVox stop being a bitch and confront these gamma bitchs. Ask them wtf they have done and that you will teddy spaghetti all over their bitch ass faces. Its like yoir running bro. Dont!\nRoland Black\nVox- you can turn the tables on ROTC by just embracing teddy spaghetti. Seriously, come out with a big bowl of spaghetti and chef boy ardee hat. It’s actually getting you tons of free publicity, embrace and enjoy. Show you have a sense of humor. Memes are part of the recipe to Alex Jones’ massive success. Embrace it!\nNotice how the gamma first pretends to be on your side, then attempts to convince you to do what he wants through appeals to what he assumes are your concerns about how you look to others. He never realizes either the transparency of his actions – the gamma always thinks he is fooling everyone – or the fact that normal men are much less concerned about what other people think than the gamma is.\nTheir problem is that I simply don’t care what these irrelevant YouTube gammas think, do, or say. Are they really under the impression that they are the first group to target me for a campaign of one sort or another? Just to put these things into perspective, I was targeted by the Council on American-Islamic Relations back in 2001, was attacked by Tor Books and its various authors and hangers-on in 2005, then by the entire SFWA in 2013, then by the international media from\nPopular Science\nto the\nNew Zealand Herald\nin revenge for the success of Sad Puppies in 2015. I’ve been a subject of hit pieces by\nNational Public Radio\nand\nWired\n, just to name two, and was pointed out as a malignant influence in the\nNew York Times\nas recently last week.\nSo, perhaps that brief and very incomplete summary will help people can understand that my level of indifference towards a hate campaign by a few attention-seeking YouTubers with a microscopic audience approaches infinity. They will have to find their Internet drama elsewhere. And if something becomes tedious for me, I simply shut it down. Considering that I abandoned a popular blog simply because I grew bored with the repetitious nature of the comments there, it should hardly be surprising that I am not even remotely reluctant to shut down the YouTube chat.",
  "tags": [
    "Gamma"
  ],
  "categories": [],
  "sitemap_lastmod": "2019-05-29T09:46:33+00:00"
}