{
  "url": "https://voxday.net/2019/05/14/little-servants-of-the-lie/",
  "scraped_at": "2025-12-20T05:40:56.102274",
  "title": "Little servants of the lie",
  "date_display": "May 14, 2019",
  "date_iso": "2019-05-14T16:13:29+00:00",
  "date_from_url": "2019-05-14",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>It’s interesting to see how these gamma losers who hate Owen Benjamin think they can be more successful with their lies than their mainstream counterparts:</p><blockquote class=\"tr_bq\"><p>r/owenbenjamin<br>•Posted by u/TomaszLuniewski<br>2 days ago<br><i>Vox live now. Mob it up with owen uploading to vimeo questions!!</i></br></br></br></p></blockquote><p>Now that their strategy – such as it is – of saying anything they can imagine might inspire a rift between Owen and me is clear, it will be even easier to deal with them. They don’t seem to grasp that I’ve been successfully dealing with anklebiters, trolls, and mobs without any trouble since 2001. And I’ve had gammas trying to cause rifts between me and Joseph Farah, Milo, Mike Cernovich, Stefan Molyneux, Roosh, Roissy, Rollo Tomassi, and others for years.</p><blockquote class=\"tr_bq\"><p>OsoDeMaricon<br>People need to stay on Teddy’s ass and make him either defend or denounce Owen on every stream. Between the constant badgering on every stream and the extremely low traffic to unstreamable.tv, he eventually WILL get sick of Owen and give him some sort of ultimatum.</br></p></blockquote><p>It’s amazing how little they know me, that they think persistence will work against me when SJWs have been attacking me relentlessly for at least 14 years. Their newest line is that Unauthorized is a scam, which indicates that they have no idea what the investment opportunity I have mentioned is about. Which, I’m sure is more than a little amusing to all of the Arkhaven backers.</p><p>UPDATE: They’re just ever so clever. No one could possibly see through them!</p><blockquote class=\"tr_bq\"><p>Vox the revenge of the cis guys are crazy you have to address this their relentlessly mocking you and trying slander you and discredit you. Only a gamma would allow them to do that to you I know your not a gamma but if you dont refute them it’ll be harder to respect you </p></blockquote><p>Demonstrating, once more, that gammas simply don’t understand sigmas <i>at all</i>. They don’t understand alphas either, of course, but at least the misunderstandings aren’t comically off base. It’s downright funny to see how they imagine I want their respect when they don’t even respect themselves enough to shower or stop cramming doughnuts into their porcine faces.</p></div>",
  "content_text": "It’s interesting to see how these gamma losers who hate Owen Benjamin think they can be more successful with their lies than their mainstream counterparts:\nr/owenbenjamin\n•Posted by u/TomaszLuniewski\n2 days ago\nVox live now. Mob it up with owen uploading to vimeo questions!!\nNow that their strategy – such as it is – of saying anything they can imagine might inspire a rift between Owen and me is clear, it will be even easier to deal with them. They don’t seem to grasp that I’ve been successfully dealing with anklebiters, trolls, and mobs without any trouble since 2001. And I’ve had gammas trying to cause rifts between me and Joseph Farah, Milo, Mike Cernovich, Stefan Molyneux, Roosh, Roissy, Rollo Tomassi, and others for years.\nOsoDeMaricon\nPeople need to stay on Teddy’s ass and make him either defend or denounce Owen on every stream. Between the constant badgering on every stream and the extremely low traffic to unstreamable.tv, he eventually WILL get sick of Owen and give him some sort of ultimatum.\nIt’s amazing how little they know me, that they think persistence will work against me when SJWs have been attacking me relentlessly for at least 14 years. Their newest line is that Unauthorized is a scam, which indicates that they have no idea what the investment opportunity I have mentioned is about. Which, I’m sure is more than a little amusing to all of the Arkhaven backers.\nUPDATE: They’re just ever so clever. No one could possibly see through them!\nVox the revenge of the cis guys are crazy you have to address this their relentlessly mocking you and trying slander you and discredit you. Only a gamma would allow them to do that to you I know your not a gamma but if you dont refute them it’ll be harder to respect you\nDemonstrating, once more, that gammas simply don’t understand sigmas\nat all\n. They don’t understand alphas either, of course, but at least the misunderstandings aren’t comically off base. It’s downright funny to see how they imagine I want their respect when they don’t even respect themselves enough to shower or stop cramming doughnuts into their porcine faces.",
  "tags": [
    "Unauthorized"
  ],
  "categories": [],
  "sitemap_lastmod": "2019-05-14T15:13:29+00:00"
}