{
  "url": "https://voxday.net/2019/05/19/the-syrian-false-flag/",
  "scraped_at": "2025-12-20T05:41:26.756107",
  "title": "The Syrian false flag",
  "date_display": "May 19, 2019",
  "date_iso": "2019-05-19T09:41:58+00:00",
  "date_from_url": "2019-05-19",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>Don’t believe any of the new stories about Iranian “attacks” that are now beginning to appear as the neocons continue banging their idiot war drums. <u>All</u> of these purported justifications for military action in the Middle East and the Gulf are fraudulent and they have been for decades. It has now been reported that the “poison gas attacks” supposedly conducted by Syrian government forces <a href=\"https://www.dailymail.co.uk/debate/article-7045469/PETER-HITCHENS-green-seats-prove-careering-catastrophe.html\">were no more real</a> than Saddam Hussein’s “weapons of mass destruction”.</p><blockquote><p>A huge international news story broke last week, but I doubt you will hear about it anywhere else. It seems very likely that the decision we, France and the USA made in April 2018 to bomb Syria was based on a mistake as big as the fictional weapons of mass destruction in Iraq in 2003.</p><p>The Organisation for the Prohibition of Chemical Weapons (OPCW), the international body which examines alleged incidents of the use of poison gas, has just confirmed to me that a devastating leaked document from its Dutch HQ is genuine.</p><p>The document, written by one of the OPCW’s most experienced investigators, shows that it is highly unlikely that gas canisters found at the scene of an alleged poison gas attack in Douma, Syria, were actually dropped from helicopters – as has been widely believed and claimed. The claim is crucial to the case for bombing Syria. A copy of the leaked document can be found on my blog on Mail Online.</p><p>Yet the OPCW’s official report on the event made no mention of any such doubts. What is going on? The OPCW is a valuable organisation, containing many fine people, with a noble purpose, but has it been placed under pressure, or even hijacked, by political forces which seek a justification for military intervention in Syria?</p><p>Given that a decision between war or peace, affecting the whole planet, could one day hang on its judgments, I think the world is entitled to an inquiry into what is happening behind its closed doors.</p></blockquote><p>The treason committed by the FBI isn’t the only treason that has been committed in the last twenty years. There are a whole host of warmongers in Washington DC whose lies are directly responsible for tens of thousands of American dead and wounded. And the inevitable false flags directed at Iran <a href=\"https://apnews.com/1097699ac34342f8b657325bcb580eb9\">are the one thing</a> that have real potential to derail the 2020 Trumpslide, but only if President Trump is foolish enough to fall for them:</p><blockquote><p>Asked this week if the U.S. was going to war with Iran, Trump said simply: “I hope not.” Aware of the potential backlash from within his party, the president is trying to play down the possibility of hostilities. He held the door open for negotiations over Iran’s nuclear program and malign activities in the region amid reports that he was pushing back against his more hawkish advisers’ preference for a military solution.</p><p>Prominent Trump supporters offered a pointed warning on Friday about the prospect of a new war, which they view as a direct violation of his “America First” pledge.</p><p>“It would be a disaster for him and for the country getting into another military engagement in the Middle East,” said Corey Stewart, who led Trump’s 2016 campaign in Virginia. “It does concern me that the president has (national security adviser John) Bolton and a lot of these neocons advising him. That’s clearly not what he ran on and what most Americans want.”</p></blockquote><p>No more war in the Middle East. It is neither America’s concern nor America’s business. If the New Palestinians want war with Iran, then they can go and fight it themselves. It would certainly be entertaining to see Ben Shapiro, Bill Kristol, and Max Boot go up against the Revolutionary Guard.</p></div>",
  "content_text": "Don’t believe any of the new stories about Iranian “attacks” that are now beginning to appear as the neocons continue banging their idiot war drums.\nAll\nof these purported justifications for military action in the Middle East and the Gulf are fraudulent and they have been for decades. It has now been reported that the “poison gas attacks” supposedly conducted by Syrian government forces\nwere no more real\nthan Saddam Hussein’s “weapons of mass destruction”.\nA huge international news story broke last week, but I doubt you will hear about it anywhere else. It seems very likely that the decision we, France and the USA made in April 2018 to bomb Syria was based on a mistake as big as the fictional weapons of mass destruction in Iraq in 2003.\nThe Organisation for the Prohibition of Chemical Weapons (OPCW), the international body which examines alleged incidents of the use of poison gas, has just confirmed to me that a devastating leaked document from its Dutch HQ is genuine.\nThe document, written by one of the OPCW’s most experienced investigators, shows that it is highly unlikely that gas canisters found at the scene of an alleged poison gas attack in Douma, Syria, were actually dropped from helicopters – as has been widely believed and claimed. The claim is crucial to the case for bombing Syria. A copy of the leaked document can be found on my blog on Mail Online.\nYet the OPCW’s official report on the event made no mention of any such doubts. What is going on? The OPCW is a valuable organisation, containing many fine people, with a noble purpose, but has it been placed under pressure, or even hijacked, by political forces which seek a justification for military intervention in Syria?\nGiven that a decision between war or peace, affecting the whole planet, could one day hang on its judgments, I think the world is entitled to an inquiry into what is happening behind its closed doors.\nThe treason committed by the FBI isn’t the only treason that has been committed in the last twenty years. There are a whole host of warmongers in Washington DC whose lies are directly responsible for tens of thousands of American dead and wounded. And the inevitable false flags directed at Iran\nare the one thing\nthat have real potential to derail the 2020 Trumpslide, but only if President Trump is foolish enough to fall for them:\nAsked this week if the U.S. was going to war with Iran, Trump said simply: “I hope not.” Aware of the potential backlash from within his party, the president is trying to play down the possibility of hostilities. He held the door open for negotiations over Iran’s nuclear program and malign activities in the region amid reports that he was pushing back against his more hawkish advisers’ preference for a military solution.\nProminent Trump supporters offered a pointed warning on Friday about the prospect of a new war, which they view as a direct violation of his “America First” pledge.\n“It would be a disaster for him and for the country getting into another military engagement in the Middle East,” said Corey Stewart, who led Trump’s 2016 campaign in Virginia. “It does concern me that the president has (national security adviser John) Bolton and a lot of these neocons advising him. That’s clearly not what he ran on and what most Americans want.”\nNo more war in the Middle East. It is neither America’s concern nor America’s business. If the New Palestinians want war with Iran, then they can go and fight it themselves. It would certainly be entertaining to see Ben Shapiro, Bill Kristol, and Max Boot go up against the Revolutionary Guard.",
  "tags": [
    "NeoCon"
  ],
  "categories": [],
  "sitemap_lastmod": "2019-05-19T08:41:58+00:00"
}