{
  "url": "https://voxday.net/2019/05/14/the-deployments-will-continue/",
  "scraped_at": "2025-12-20T05:40:54.279748",
  "title": "The deployments will continue",
  "date_display": "May 14, 2019",
  "date_iso": "2019-05-14T12:00:01+00:00",
  "date_from_url": "2019-05-14",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>Until the occupations succeed. Neo-Palestinians are attempting to sucker President Trump into <a href=\"https://www.rt.com/news/459268-us-plans-to-deploy-120000/\">yet <i>another </i>useless foreign war</a>, presumably on behalf of Israel:</p><blockquote><p>Donald Trump has reportedly been presented with a plan to send as many as 120,000 troops to the Middle East to counter the so-called Iranian threat, the <i>New York Times</i> reported.</p><p>Acting Defense Secretary Patrick Shanahan disclosed the updated military plan at a meeting of Trump’s top security aides on Thursday, the publication said, quoting anonymous sources inside the administration.</p><p>Several options to tackle Tehran in the region were outlined to the president during the briefing, while “the uppermost option called for deploying 120,000 troops, which would take weeks or months to complete,” the Times said.</p><p>While the revisions “ordered” by “hard-liners” do not promulgate a land invasion of Iran, “the development reflects the influence of Mr. Bolton, one of the administration’s most virulent Iran hawks,” The Times reported. Bolton has been a long-time advocate of using military force against Tehran, even penning an op-ed in 2015 titled “Top Stop Iran’s Bomb, Bomb Iran.”</p><p>The proposal to send additional reinforcements comes amid accusations from Secretary of State Mike Pompeo that Tehran has been engaging in “an escalating series of threatening actions and statements in recent weeks.” To counter the unspecified threat, the Pentagon has already deployed the USS ‘Abraham Lincoln’ carrier strike group and bomber task force, including B-52s, to the region.</p></blockquote><p>If the United States is insane enough to start another war, this one with Iran, you can go ahead and move up that 2033 estimate for its collapse. Unnecessary attempts at expansion meeting with completely unexpected military defeat is probably the second-most-common way for empires to fall throughout recorded history.</p><p>I thought Iraq risked being the USA’s Syracuse. But Iran would make for a much better candidate.</p><p>The thing is, we KNOW the US empire is going to fail catastrophically and lead to the eventual collapse of the state. We absolutely know this, what we don’t know yet is <i>when </i>and <i>why</i>. But the picture does appear to be coming into focus.</p></div>",
  "content_text": "Until the occupations succeed. Neo-Palestinians are attempting to sucker President Trump into\nyet\nanother\nuseless foreign war\n, presumably on behalf of Israel:\nDonald Trump has reportedly been presented with a plan to send as many as 120,000 troops to the Middle East to counter the so-called Iranian threat, the\nNew York Times\nreported.\nActing Defense Secretary Patrick Shanahan disclosed the updated military plan at a meeting of Trump’s top security aides on Thursday, the publication said, quoting anonymous sources inside the administration.\nSeveral options to tackle Tehran in the region were outlined to the president during the briefing, while “the uppermost option called for deploying 120,000 troops, which would take weeks or months to complete,” the Times said.\nWhile the revisions “ordered” by “hard-liners” do not promulgate a land invasion of Iran, “the development reflects the influence of Mr. Bolton, one of the administration’s most virulent Iran hawks,” The Times reported. Bolton has been a long-time advocate of using military force against Tehran, even penning an op-ed in 2015 titled “Top Stop Iran’s Bomb, Bomb Iran.”\nThe proposal to send additional reinforcements comes amid accusations from Secretary of State Mike Pompeo that Tehran has been engaging in “an escalating series of threatening actions and statements in recent weeks.” To counter the unspecified threat, the Pentagon has already deployed the USS ‘Abraham Lincoln’ carrier strike group and bomber task force, including B-52s, to the region.\nIf the United States is insane enough to start another war, this one with Iran, you can go ahead and move up that 2033 estimate for its collapse. Unnecessary attempts at expansion meeting with completely unexpected military defeat is probably the second-most-common way for empires to fall throughout recorded history.\nI thought Iraq risked being the USA’s Syracuse. But Iran would make for a much better candidate.\nThe thing is, we KNOW the US empire is going to fail catastrophically and lead to the eventual collapse of the state. We absolutely know this, what we don’t know yet is\nwhen\nand\nwhy\n. But the picture does appear to be coming into focus.",
  "tags": [
    "war"
  ],
  "categories": [],
  "sitemap_lastmod": "2019-05-14T11:00:01+00:00"
}