{
  "url": "https://voxday.net/2019/05/26/the-european-elections/",
  "scraped_at": "2025-12-20T05:42:13.766767",
  "title": "The European elections",
  "date_display": "May 26, 2019",
  "date_iso": "2019-05-26T23:33:42+00:00",
  "date_from_url": "2019-05-26",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>Discuss amongst yourselves. The left-wing Greek government has already called for a general election after unexpectedly losing to the center-right party. In the UK, the Brexit party is expected to take 37 percent of the vote, so it will be interesting to see if they underperform or overperform the polls. In that vein, although Brexit is supposed to take most of its votes from UKIP and the Conservatives, one of its first two seats won tonight was taken from Labour.</p><p>Salvini and La Lega are projected to have won in Italy, with nearly one-third of the vote, which will tend to confirm their strength vis-a-vis their governing partner M5, which looks like it will finish third, behind the Socialists. Forza Italia, the other right-wing party, is also doing quite well and will finish fourth.</p><p>BNL reports <i>the BREXIT party is doing better than expected in rural areas and that Theresa May’s Conservative party is doing far worse than expected. Labour and Liberal Democrats doing what was expected.</i><br><i><br/></i><b>UPDATE: </b>Brexit just surpassed UKIP’s total in 2014… and there are still 17 seats left. This is the worst election result for the <strike>Cuck</strike>Conservative Party in 185 years. I was sorry to see Daniel Hannan lose his seat as an MEP, but then, I did tell him to throw in with Farage the last time we talked.</br></p><p>56/73 seats declared:</p><p>BREXIT: 25 MEPs<br>LDem: 13 MEPs<br>Lab: 8 MEPs<br>Greens: 6 MEPs<br>Con: 3 MEPs</br></br></br></br></p><p>PC: 1 MEP</p></div>",
  "content_text": "Discuss amongst yourselves. The left-wing Greek government has already called for a general election after unexpectedly losing to the center-right party. In the UK, the Brexit party is expected to take 37 percent of the vote, so it will be interesting to see if they underperform or overperform the polls. In that vein, although Brexit is supposed to take most of its votes from UKIP and the Conservatives, one of its first two seats won tonight was taken from Labour.\nSalvini and La Lega are projected to have won in Italy, with nearly one-third of the vote, which will tend to confirm their strength vis-a-vis their governing partner M5, which looks like it will finish third, behind the Socialists. Forza Italia, the other right-wing party, is also doing quite well and will finish fourth.\nBNL reports\nthe BREXIT party is doing better than expected in rural areas and that Theresa May’s Conservative party is doing far worse than expected. Labour and Liberal Democrats doing what was expected.\nUPDATE:\nBrexit just surpassed UKIP’s total in 2014… and there are still 17 seats left. This is the worst election result for the\nCuck\nConservative Party in 185 years. I was sorry to see Daniel Hannan lose his seat as an MEP, but then, I did tell him to throw in with Farage the last time we talked.\n56/73 seats declared:\nBREXIT: 25 MEPs\nLDem: 13 MEPs\nLab: 8 MEPs\nGreens: 6 MEPs\nCon: 3 MEPs\nPC: 1 MEP",
  "tags": [
    "politics"
  ],
  "categories": [],
  "sitemap_lastmod": "2019-05-26T22:33:42+00:00"
}