{
  "url": "https://voxday.net/2019/05/02/where-is-the-fake-baby/",
  "scraped_at": "2025-12-20T05:39:43.130819",
  "title": "Where is the fake baby?",
  "date_display": "May 2, 2019",
  "date_iso": "2019-05-02T12:55:51+00:00",
  "date_from_url": "2019-05-02",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>This Sussex Sparkles thing has turned out to be more interesting than Suits ever was:</p><blockquote><p>torontopaper @torontopaper1<br>Darling, actions speak louder than words. A more united family than ever is exposing your lies. Your house of cards is collapsing. You will get the Tower instead of the paycheck!</br></p><p>torontopaper @torontopaper1<br>Darling, very telling that you are using your old US cellphone number again lately. By the way the 9 months are over already. Are you expecting an elephant or still looking for a way out where no way out is?</br></p><p>torontopaper @torontopaper1<br>9 months are over! Your husband is on his family’s side! No paycheck! Your threats are making them laugh! They have more against you and you are alone! And now? Game over! Checkmate!</br></p><p>torontopaper @torontopaper1<br>Darling, so you are sitting there alone and humiliated in your house of glass with cracks everywhere. People have seen that the rumours became true. Lord Watchdog has shut you down!</br></p></blockquote><p>Translation: Megan Markles is a complete trainwreck who faked her pregnancy by using a surrogate, but is trying to extort the British Royal Family into some sort of financial settlement before the whole scheme comes crashing down.</p><p>I have absolutely no idea what may or may not be true, but I am still astonished that the Queen permitted Prince Harry to marry the woman in the first place. My theory is that they were first married in secret in the United States and then presented the Queen with a fait accompli.</p><p>If any of this is true, it strikes me as a very, very bad idea and the very, very wrong people with whom to play this kind of game. One would tend to expect a tragic death in childbirth after delivering a stillborn child.</p><p>Seriously, though, where is the baby? And why is Prince Harry off to the Netherlands?</p></div>",
  "content_text": "This Sussex Sparkles thing has turned out to be more interesting than Suits ever was:\ntorontopaper @torontopaper1\nDarling, actions speak louder than words. A more united family than ever is exposing your lies. Your house of cards is collapsing. You will get the Tower instead of the paycheck!\ntorontopaper @torontopaper1\nDarling, very telling that you are using your old US cellphone number again lately. By the way the 9 months are over already. Are you expecting an elephant or still looking for a way out where no way out is?\ntorontopaper @torontopaper1\n9 months are over! Your husband is on his family’s side! No paycheck! Your threats are making them laugh! They have more against you and you are alone! And now? Game over! Checkmate!\ntorontopaper @torontopaper1\nDarling, so you are sitting there alone and humiliated in your house of glass with cracks everywhere. People have seen that the rumours became true. Lord Watchdog has shut you down!\nTranslation: Megan Markles is a complete trainwreck who faked her pregnancy by using a surrogate, but is trying to extort the British Royal Family into some sort of financial settlement before the whole scheme comes crashing down.\nI have absolutely no idea what may or may not be true, but I am still astonished that the Queen permitted Prince Harry to marry the woman in the first place. My theory is that they were first married in secret in the United States and then presented the Queen with a fait accompli.\nIf any of this is true, it strikes me as a very, very bad idea and the very, very wrong people with whom to play this kind of game. One would tend to expect a tragic death in childbirth after delivering a stillborn child.\nSeriously, though, where is the baby? And why is Prince Harry off to the Netherlands?",
  "tags": [
    "UK"
  ],
  "categories": [],
  "sitemap_lastmod": "2019-05-02T11:55:51+00:00"
}