{
  "url": "https://voxday.net/2007/05/03/dont-forget-angels-of-dea/",
  "scraped_at": "2026-01-08T21:39:58.099480",
  "title": "Don’t forget the angels of death",
  "date_display": "May 3, 2007",
  "date_iso": "2007-05-03T14:57:00+00:00",
  "date_from_url": "2007-05-03",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>Dr. Helen is amused by a fellow forensic psychologist <a href=\"http://drhelen.blogspot.com/2007/05/do-women-commit-mass-murder.html\">with a poor grasp of history</a>:</p><blockquote><p>Perhaps Dr. Schlesinger has a poor memory, because if she thought about it, she would know that the famous song by the BoomTown Rats entitled, “I Don’t Like Mondays” was written about “non-existent” (at least to some experts) Brenda Spencer. Spencer was a seventeen-year-old high school senior in San Diego who in January of 1979 opened fire into a crowded elementary school across the street from her home.</p></blockquote><p>Because women tend to do things rather differently than men, people sometimes errantly conclude that they don’t do them at all.  Given how many deaths take place in hospitals, I wouldn’t be surprised if it turned out that more people are <a href=\"http://findarticles.com/p/articles/mi_m1282/is_10_53/ai_74362323\">killed by murderous nurses</a> every year than by angry school and workplace shooters.</p><p>Of course, a quiet injection every now and then doesn’t create quite as much noise in the media.</p></div>",
  "content_text": "Dr. Helen is amused by a fellow forensic psychologist\nwith a poor grasp of history\n:\nPerhaps Dr. Schlesinger has a poor memory, because if she thought about it, she would know that the famous song by the BoomTown Rats entitled, “I Don’t Like Mondays” was written about “non-existent” (at least to some experts) Brenda Spencer. Spencer was a seventeen-year-old high school senior in San Diego who in January of 1979 opened fire into a crowded elementary school across the street from her home.\nBecause women tend to do things rather differently than men, people sometimes errantly conclude that they don’t do them at all.  Given how many deaths take place in hospitals, I wouldn’t be surprised if it turned out that more people are\nkilled by murderous nurses\nevery year than by angry school and workplace shooters.\nOf course, a quiet injection every now and then doesn’t create quite as much noise in the media.",
  "tags": [],
  "categories": [],
  "sitemap_lastmod": "2007-05-03T13:57:00+00:00"
}