{
  "url": "https://voxday.net/2007/05/28/down-with-clinton/",
  "scraped_at": "2026-01-08T21:42:45.210658",
  "title": "Down with Clinton",
  "date_display": "May 28, 2007",
  "date_iso": "2007-05-28T10:11:00+00:00",
  "date_from_url": "2007-05-28",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>Portis, that is.  I’m extremely interested in <a href=\"http://sports.espn.go.com/nfl/news/story?id=2884063\">the Michael Vick dogfighting story</a> due to its potential to influence the coming season, and I understand that if the laws have been broken, then NFL Commissioner Goodell will have no choice but to suspend Vick and any other NFL players that are involved.  Although I suspect that Atlanta would be much better off without Vick than with him… especially if such a suspension would save them from having to pay part of his massive salary.</p><p>However, I don’t understand the rationale for banning dogfighting and cockfighting in the first place, let alone the laws against being a spectator at such events.  There is something deeply twisted about a society that bans dogfights while simultaneously funding abortions, gassing millions of canines and running massive state lotteries.  It’s especially bizarre that people who support dogfighting bans often wish to ban “dangerous breeds” entirely.</p><p>In other words, they believe that canine genoocide is desirable because certain breeds are prone to enjoy killing, but it’s undesirable to let the dogs kill one another.  This isn’t just a massive violation of private property rights, it’s simply irrational.  Shouldn’t we also prosecute National Geographic cameramen who not only attend Bighorn ram fights, but ACTUALLY GO SO FAR AS TO FILM THEM!</p><p>I very much like dogs.  And while I enjoy human martial arts, I have no interest in ever attending a dogfight, nor has the thought of pitting my Viszla against anything more dangerous than a squirrel ever occurred to me.  (And to be honest, it was entirely his idea, I was surprised he wasn’t afraid of the ferocious killer tree-rat.)  But I see no legitimate moral or ethical basis for either banning dogfights or exterminating dog breeds.</p><p>For those who say it should be banned because it’s cruel to derive entertainment from pain, I note that I don’t see any moral or ethical basis for cutting out the tongues of teenage gossips either.</p><p>This <a href=\"http://www.time.com/time/magazine/article/0,9171,789432,00.html\">Time Magazine article</a> appears to note the ironies involved:</p><blockquote><p>In the U. S. men can fight men in public, but the law decrees that it is cruel for them to match their dogs or chickens….  At week’s end, after tender care by Missouri Humane Society’s Veterinarian Carl Brenner, both dogs were in fine fettle, but were being held for probable asphyxiation….</p></blockquote><p>I’m sure the dogs were tremendously grateful for their “rescue”.</p></div>",
  "content_text": "Portis, that is.  I’m extremely interested in\nthe Michael Vick dogfighting story\ndue to its potential to influence the coming season, and I understand that if the laws have been broken, then NFL Commissioner Goodell will have no choice but to suspend Vick and any other NFL players that are involved.  Although I suspect that Atlanta would be much better off without Vick than with him… especially if such a suspension would save them from having to pay part of his massive salary.\nHowever, I don’t understand the rationale for banning dogfighting and cockfighting in the first place, let alone the laws against being a spectator at such events.  There is something deeply twisted about a society that bans dogfights while simultaneously funding abortions, gassing millions of canines and running massive state lotteries.  It’s especially bizarre that people who support dogfighting bans often wish to ban “dangerous breeds” entirely.\nIn other words, they believe that canine genoocide is desirable because certain breeds are prone to enjoy killing, but it’s undesirable to let the dogs kill one another.  This isn’t just a massive violation of private property rights, it’s simply irrational.  Shouldn’t we also prosecute National Geographic cameramen who not only attend Bighorn ram fights, but ACTUALLY GO SO FAR AS TO FILM THEM!\nI very much like dogs.  And while I enjoy human martial arts, I have no interest in ever attending a dogfight, nor has the thought of pitting my Viszla against anything more dangerous than a squirrel ever occurred to me.  (And to be honest, it was entirely his idea, I was surprised he wasn’t afraid of the ferocious killer tree-rat.)  But I see no legitimate moral or ethical basis for either banning dogfights or exterminating dog breeds.\nFor those who say it should be banned because it’s cruel to derive entertainment from pain, I note that I don’t see any moral or ethical basis for cutting out the tongues of teenage gossips either.\nThis\nTime Magazine article\nappears to note the ironies involved:\nIn the U. S. men can fight men in public, but the law decrees that it is cruel for them to match their dogs or chickens….  At week’s end, after tender care by Missouri Humane Society’s Veterinarian Carl Brenner, both dogs were in fine fettle, but were being held for probable asphyxiation….\nI’m sure the dogs were tremendously grateful for their “rescue”.",
  "tags": [],
  "categories": [],
  "sitemap_lastmod": "2007-05-28T09:11:00+00:00"
}