{
  "url": "https://voxday.net/2007/05/31/dr-pz-myers-ignores-evidence/",
  "scraped_at": "2026-01-08T21:43:06.780702",
  "title": "Dr. PZ Myers ignores the evidence",
  "date_display": "May 31, 2007",
  "date_iso": "2007-05-31T11:33:00+00:00",
  "date_from_url": "2007-05-31",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>Regarding <a href=\"http://scienceblogs.com/pharyngula/2007/05/i_had_no_idea_christopher_hitc.php#comments\">his hypothesis</a> that Christopher Hitchens is an impressive debater:</p><blockquote><p>Minuscule, even. Flea-sized. How else am I to interpret Dinesh D’Souza’s challenge that he should pick on someone his own size, meaning D’Souza? I’ve heard D’Souza. He’s a babbling pipsqueak. But now he thinks he is a worthy opponent to confront Hitchens, because all the pastors that Hitchens knocks aside as if wielding the jawbone of an ass are such weak and timid little flowers.</p></blockquote><p>I don’t know how D’Souza would do against Hitchens.  But I know that I will obliterate Hitchens, Dawkins or Harris without ever breaking a sweat should I ever get the chance, simply because all three of them base their primary arguments against religion on ludicrous assertions that are demonstrably and unequivocally false.  I’d even be happy to have PZ moderate any such debate, such is my confidence in the empirical superiority of my case.</p><p>Dennett is the only one of the four New Atheists – five if you count Michael Onfray – who will likely survive with a reputation for intellectual integrity intact.</p><p>Hitchens, despite his superior vocabulary, is actually the weakest of the three best-known figures, as can be seen in his <a href=\"http://www.christianitytoday.com/ct/2007/mayweb-only/119-12.0.html\">spectacularly poor performance</a> in getting bulldozed by Douglas Wilson at Christianity Today.</p><p>This bit was particularly funny: <em>I have been asking you to provide a warrant for morality, given atheism, and you have mostly responded with assertions that atheists can make what some people call moral choices. Well, sure. But what I have been after is what rational warrant they can give for calling one choice “moral” and another choice “not moral.” You finally appealed to “innate human solidarity”….</em></p><p>I wonder how long it will take Hitchens to finally get around to basic utilitarianism.  What’s most amusing about the New Atheists isn’t that they think they’re presenting new and clever arguments, it’s that so many other maleducated morons believe they are.</p></div>",
  "content_text": "Regarding\nhis hypothesis\nthat Christopher Hitchens is an impressive debater:\nMinuscule, even. Flea-sized. How else am I to interpret Dinesh D’Souza’s challenge that he should pick on someone his own size, meaning D’Souza? I’ve heard D’Souza. He’s a babbling pipsqueak. But now he thinks he is a worthy opponent to confront Hitchens, because all the pastors that Hitchens knocks aside as if wielding the jawbone of an ass are such weak and timid little flowers.\nI don’t know how D’Souza would do against Hitchens.  But I know that I will obliterate Hitchens, Dawkins or Harris without ever breaking a sweat should I ever get the chance, simply because all three of them base their primary arguments against religion on ludicrous assertions that are demonstrably and unequivocally false.  I’d even be happy to have PZ moderate any such debate, such is my confidence in the empirical superiority of my case.\nDennett is the only one of the four New Atheists – five if you count Michael Onfray – who will likely survive with a reputation for intellectual integrity intact.\nHitchens, despite his superior vocabulary, is actually the weakest of the three best-known figures, as can be seen in his\nspectacularly poor performance\nin getting bulldozed by Douglas Wilson at Christianity Today.\nThis bit was particularly funny:\nI have been asking you to provide a warrant for morality, given atheism, and you have mostly responded with assertions that atheists can make what some people call moral choices. Well, sure. But what I have been after is what rational warrant they can give for calling one choice “moral” and another choice “not moral.” You finally appealed to “innate human solidarity”….\nI wonder how long it will take Hitchens to finally get around to basic utilitarianism.  What’s most amusing about the New Atheists isn’t that they think they’re presenting new and clever arguments, it’s that so many other maleducated morons believe they are.",
  "tags": [],
  "categories": [],
  "sitemap_lastmod": "2007-05-31T10:33:00+00:00"
}