{
  "url": "https://voxday.net/2007/05/08/fred-thompson-is-dead/",
  "scraped_at": "2026-01-08T21:40:34.915263",
  "title": "Fred Thompson is dead",
  "date_display": "May 8, 2007",
  "date_iso": "2007-05-08T09:45:00+00:00",
  "date_from_url": "2007-05-08",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>As Rudy Giuliani is already in the process of learning, the Republican base is not going to turn out for anyone <a href=\"http://www.nysunpolitics.com/blog/2007/05/thompsons-1994-issue-positions.html\">who is pro-abortion</a>, even if they loudly declaim their personal hate, hate, hate for the slaughter of unborn children:</p><blockquote><p>Under abortion: He [Thompson] checked the box for: “<b>Abortions should be legal in all circumstances</b> as long as the procedure is completed within the first trimester of the pregnancy.” He did, however, support a number of restrictions on abortion: requiring parental notification, allowing states to impose waiting periods, and eliminating all federal funding of abortion. Lastly, he said Congress should leave legislation on abortion to the states.</p></blockquote><p>No doubt Thompson will pull a Kerry-Romney double-reverse gainer should he decide to throw his hat in the ring.  I wouldn’t be surprised if he stays out, though.  Most of the “enthusiasm” for him isn’t genuine, it’s merely the predicted dissatisfaction with the party’s chosen frontrunners.</p><p>If a liberal Massachusetts governor wearing a poorly-fitting Ronald Reagan mask is the most convincing thing on offer, no wonder the Republican base has been desperately casting about for something better.  But Thompson is simply more of the same, only uglier.</p><p>As for the notion of him as some sort of Hillary-killer, that’s simply laughable.  It’s as obviously baseless as the idea that Texans, Iowans and Montanans would be impressed by the Savior of New York City.  Due to his unique stance that combines anti-war and anti-illegal alien positions, Ron Paul is the only Republican candidate who has even a snowball’s chance of beating the Lizard Queen, his relative anonymity notwithstanding.</p><p><em>“We have the duty to protect the life of an unborn child.”</em><br>– Ronald Reagan</br></p><p>UPDATE: Rudy <a href=\"http://www.politico.com/news/stories/0507/3876.html\">should be dropping out</a> any day now.  “Federal tax returns made public by the former New York mayor show that he and his then-wife, Donna Hanover, made personal donations to national, state and city chapters of Planned Parenthood totaling $900 in 1993, 1994, 1998 and 1999.”</p><p>He can try to blame it on his ex-wife, but he’s toast anyhow.  Good riddance.</p></div>",
  "content_text": "As Rudy Giuliani is already in the process of learning, the Republican base is not going to turn out for anyone\nwho is pro-abortion\n, even if they loudly declaim their personal hate, hate, hate for the slaughter of unborn children:\nUnder abortion: He [Thompson] checked the box for: “\nAbortions should be legal in all circumstances\nas long as the procedure is completed within the first trimester of the pregnancy.” He did, however, support a number of restrictions on abortion: requiring parental notification, allowing states to impose waiting periods, and eliminating all federal funding of abortion. Lastly, he said Congress should leave legislation on abortion to the states.\nNo doubt Thompson will pull a Kerry-Romney double-reverse gainer should he decide to throw his hat in the ring.  I wouldn’t be surprised if he stays out, though.  Most of the “enthusiasm” for him isn’t genuine, it’s merely the predicted dissatisfaction with the party’s chosen frontrunners.\nIf a liberal Massachusetts governor wearing a poorly-fitting Ronald Reagan mask is the most convincing thing on offer, no wonder the Republican base has been desperately casting about for something better.  But Thompson is simply more of the same, only uglier.\nAs for the notion of him as some sort of Hillary-killer, that’s simply laughable.  It’s as obviously baseless as the idea that Texans, Iowans and Montanans would be impressed by the Savior of New York City.  Due to his unique stance that combines anti-war and anti-illegal alien positions, Ron Paul is the only Republican candidate who has even a snowball’s chance of beating the Lizard Queen, his relative anonymity notwithstanding.\n“We have the duty to protect the life of an unborn child.”\n– Ronald Reagan\nUPDATE: Rudy\nshould be dropping out\nany day now.  “Federal tax returns made public by the former New York mayor show that he and his then-wife, Donna Hanover, made personal donations to national, state and city chapters of Planned Parenthood totaling $900 in 1993, 1994, 1998 and 1999.”\nHe can try to blame it on his ex-wife, but he’s toast anyhow.  Good riddance.",
  "tags": [],
  "categories": [],
  "sitemap_lastmod": "2007-05-08T08:45:00+00:00"
}