{
  "url": "https://voxday.net/2007/05/04/good-answer/",
  "scraped_at": "2026-01-08T21:40:09.721605",
  "title": "A good answer",
  "date_display": "May 4, 2007",
  "date_iso": "2007-05-04T15:03:00+00:00",
  "date_from_url": "2007-05-04",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>I found it interesting that Peggy Noonan had the grace to admit that Ron Paul is the intellectually serious candidate following <a href=\"http://www.nytimes.com/2007/05/03/us/politics/04transcript.html?_r=3&amp;oref=slogin&amp;oref=slogin&amp;oref=slogin\">the Republican debate</a>.  But he does deserve the description, his national obscurity notwithstanding:</p><blockquote><p> MR. HARRIS: Congressman Paul, you voted against the war. Why are all your fellow Republicans up here wrong?</p><p>REP. PAUL: That’s a very good question. And you might ask the question why are 70 percent of the American people now wanting us out of there and why did the Republicans do so poorly last year. So I would suggest that we should look at foreign policy.</p><p>I’m suggesting very strongly that we should have a foreign policy of non-intervention, the traditional American foreign policy and a Republican foreign policy. Throughout the 20th century, the Republican Party benefited from a non-interventionist foreign policy. Think of how Eisenhower came in to stop the Korean War. Think of how Nixon was elected to stop the mess in Vietnam. How did we win the election in the year 2000? We talked about a humble foreign policy. No nation-building. Don’t police the world. That is a conservative, it’s a Republican, it’s a pro-American, it follows the Founding Fathers. And besides, it follows the Constitution.</p><p>I tried very hard to solve this problem before we went to war, by saying declare war if you want to go to war; go to war, fight it and win it, but don’t get into it for political reasons or to enforce U.N. resolutions or pretend the Iraqis were a national threat to us.</p></blockquote><p>The fact that this foreign policy position is now considered obscure, outdated and exotic by the Republican Party only demonstrates what a hole the Republican leaders have dug for themselves.  Jonah Goldberg <a href=\"http://corner.nationalreview.com/post/?q=M2Q1OWZhMDU4NDc4MmY1ZWUxMWZkZTgxOWYxM2RkNWQ=\">comments</a>: “I’m no huge fan, but he did a very good job of making his quasi isolationist position seem hawkish and American. I think it was the best answer given so far.”</p><p>It’s also interesting to note that the impression of the previously pro-Giuliani National Reviewers appears to be that Giuliani did very poorly.  I’m not surprised at all as I don’t regard him as a serious candidate in any way and I still believe he’ll withdraw from the race long before the convention hits St. Paul.</p><p>Also, full credit to the party elders for resisting the temptation to play games and including all the candidates.</p><p>UPDATE – And this is why America <a href=\"http://article.nationalreview.com/?q=NmQ3NjEzYzBlMDA4YTM5NzI2YjI4YmJmMzM4NzA5YTA=\">deserves the leaders it gets</a>:</p><blockquote><p>Mitt Romney won Thursday night’s debate by every objective standard of style and substance. First, the style: At six-feet-two-inches tall with perfect hair and impeccable tailoring, Romney was Ronald Reagan incarnate. Romney was George Clooney/George Hamilton cool (complete with the tan) surrounded by a dorm-room full of average dudes….</p><p>Ron Paul has the unfortunate distinction of looking and sounding wacky and impish, even when he says entirely reasonable things. He brilliantly and succinctly positioned his opposition to the current war within the context of Eisenhower getting us out of Korea, Nixon having a plan to get us out of Vietnam and Bush vowing not to start “nation-building” (in the 2000 campaign) that must have left a lot of Republican viewers thinking “this guy makes a lot of sense.”</p><p>Unfortunately for Paul, he looks like a combination of My Favorite Martian’s Ray Walston and a comedian who habitually ran for president, Pat Paulsen; not helpful.</p></blockquote><p>But, you know, focusing on a guy’s underwear and not his hair or his tan, that’s just crazy shallow.</p></div>",
  "content_text": "I found it interesting that Peggy Noonan had the grace to admit that Ron Paul is the intellectually serious candidate following\nthe Republican debate\n.  But he does deserve the description, his national obscurity notwithstanding:\nMR. HARRIS: Congressman Paul, you voted against the war. Why are all your fellow Republicans up here wrong?\nREP. PAUL: That’s a very good question. And you might ask the question why are 70 percent of the American people now wanting us out of there and why did the Republicans do so poorly last year. So I would suggest that we should look at foreign policy.\nI’m suggesting very strongly that we should have a foreign policy of non-intervention, the traditional American foreign policy and a Republican foreign policy. Throughout the 20th century, the Republican Party benefited from a non-interventionist foreign policy. Think of how Eisenhower came in to stop the Korean War. Think of how Nixon was elected to stop the mess in Vietnam. How did we win the election in the year 2000? We talked about a humble foreign policy. No nation-building. Don’t police the world. That is a conservative, it’s a Republican, it’s a pro-American, it follows the Founding Fathers. And besides, it follows the Constitution.\nI tried very hard to solve this problem before we went to war, by saying declare war if you want to go to war; go to war, fight it and win it, but don’t get into it for political reasons or to enforce U.N. resolutions or pretend the Iraqis were a national threat to us.\nThe fact that this foreign policy position is now considered obscure, outdated and exotic by the Republican Party only demonstrates what a hole the Republican leaders have dug for themselves.  Jonah Goldberg\ncomments\n: “I’m no huge fan, but he did a very good job of making his quasi isolationist position seem hawkish and American. I think it was the best answer given so far.”\nIt’s also interesting to note that the impression of the previously pro-Giuliani National Reviewers appears to be that Giuliani did very poorly.  I’m not surprised at all as I don’t regard him as a serious candidate in any way and I still believe he’ll withdraw from the race long before the convention hits St. Paul.\nAlso, full credit to the party elders for resisting the temptation to play games and including all the candidates.\nUPDATE – And this is why America\ndeserves the leaders it gets\n:\nMitt Romney won Thursday night’s debate by every objective standard of style and substance. First, the style: At six-feet-two-inches tall with perfect hair and impeccable tailoring, Romney was Ronald Reagan incarnate. Romney was George Clooney/George Hamilton cool (complete with the tan) surrounded by a dorm-room full of average dudes….\nRon Paul has the unfortunate distinction of looking and sounding wacky and impish, even when he says entirely reasonable things. He brilliantly and succinctly positioned his opposition to the current war within the context of Eisenhower getting us out of Korea, Nixon having a plan to get us out of Vietnam and Bush vowing not to start “nation-building” (in the 2000 campaign) that must have left a lot of Republican viewers thinking “this guy makes a lot of sense.”\nUnfortunately for Paul, he looks like a combination of My Favorite Martian’s Ray Walston and a comedian who habitually ran for president, Pat Paulsen; not helpful.\nBut, you know, focusing on a guy’s underwear and not his hair or his tan, that’s just crazy shallow.",
  "tags": [],
  "categories": [],
  "sitemap_lastmod": "2007-05-04T14:03:00+00:00"
}