{
  "url": "https://voxday.net/2007/05/11/he-does-have-his-moments/",
  "scraped_at": "2026-01-08T21:41:04.369892",
  "title": "He does have his moments",
  "date_display": "May 11, 2007",
  "date_iso": "2007-05-11T12:20:00+00:00",
  "date_from_url": "2007-05-11",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>I thought Andrew Sullivan did an absolutely pathetic job throughout the bulk of his debate with Sam Harris – I could stop Harris in his tracks and make him look like the ignorant fraud that he is by simply forcing him to answer five questions – but I thought <a href=\"http://www.beliefnet.com/story/214/story_21446_2.html\">he redeemed himself in the end</a> with this bit, which reveals a greater understanding of the core of the Christian faith than I often see in most of my fellow fundamentalists:</p><blockquote><p>The relevant categories are therefore not, I would submit, faith and reason. The categories are those who rely on reason alone, those who use faith to trump reason in all respects, and those who understand that human life is inherently a balance between the two. Your faith-free world is not a human one; and it is not in that sense a rational one. My response is a balance, a triangulation of sorts. And a triangulation is not a contradiction.</p><p>In trying to address the global crisis we agree upon, I have two responses. The first is classical liberalism, as expressed in the American constitution, and constructed by Hobbes, Locke and their Enlightenment successors. That is my first political response, and it is central to my book on political conservatism. (My Oakeshottian politics amounts to a contingent and conservative defense of Anglo-American liberal constitutionalism.)</p><p>But the second and deeper response is Christianity itself, at the core of which is <b>a radical refusal to force anyone to do anything</b>.</p></blockquote><p>Andrew Sullivan is a sinner.  He knows it.  I know it.  But then, so am I.  The only difference between the two of us in this regard is that he publicly identifies himself by one of his sins whereas I don’t advertise mine with a big shining disco ball rotating to the tune of the Pet Shop Boys.  (Although I suppose one might reasonably argue that my arrogance is even more glaringly apparent than his homosexuality.)  Anyhow, the highlighted phrase is absolutely integral to understanding Christianity… if you don’t grok that, you can’t even begin to discuss it rationally.  Well done.</p><p>And Sullivan might have been retroactively embarrassed by his uncharacteristically forthright confession of his faith in the Lord Jesus Christ, but despite being a fairly vicious critic who has never particularly liked Sullivan nor hesitated to slam him for his advocation of various absurdities, I unexpectedly found myself feeling rather proud of him as a brother in the Christian faith.</p><p>But next time, Andrew, for the love of all that’s genetically replicated and naturally selected, do kick him in the teeth for me.</p></div>",
  "content_text": "I thought Andrew Sullivan did an absolutely pathetic job throughout the bulk of his debate with Sam Harris – I could stop Harris in his tracks and make him look like the ignorant fraud that he is by simply forcing him to answer five questions – but I thought\nhe redeemed himself in the end\nwith this bit, which reveals a greater understanding of the core of the Christian faith than I often see in most of my fellow fundamentalists:\nThe relevant categories are therefore not, I would submit, faith and reason. The categories are those who rely on reason alone, those who use faith to trump reason in all respects, and those who understand that human life is inherently a balance between the two. Your faith-free world is not a human one; and it is not in that sense a rational one. My response is a balance, a triangulation of sorts. And a triangulation is not a contradiction.\nIn trying to address the global crisis we agree upon, I have two responses. The first is classical liberalism, as expressed in the American constitution, and constructed by Hobbes, Locke and their Enlightenment successors. That is my first political response, and it is central to my book on political conservatism. (My Oakeshottian politics amounts to a contingent and conservative defense of Anglo-American liberal constitutionalism.)\nBut the second and deeper response is Christianity itself, at the core of which is\na radical refusal to force anyone to do anything\n.\nAndrew Sullivan is a sinner.  He knows it.  I know it.  But then, so am I.  The only difference between the two of us in this regard is that he publicly identifies himself by one of his sins whereas I don’t advertise mine with a big shining disco ball rotating to the tune of the Pet Shop Boys.  (Although I suppose one might reasonably argue that my arrogance is even more glaringly apparent than his homosexuality.)  Anyhow, the highlighted phrase is absolutely integral to understanding Christianity… if you don’t grok that, you can’t even begin to discuss it rationally.  Well done.\nAnd Sullivan might have been retroactively embarrassed by his uncharacteristically forthright confession of his faith in the Lord Jesus Christ, but despite being a fairly vicious critic who has never particularly liked Sullivan nor hesitated to slam him for his advocation of various absurdities, I unexpectedly found myself feeling rather proud of him as a brother in the Christian faith.\nBut next time, Andrew, for the love of all that’s genetically replicated and naturally selected, do kick him in the teeth for me.",
  "tags": [],
  "categories": [],
  "sitemap_lastmod": "2007-05-11T11:20:00+00:00"
}