{
  "url": "https://voxday.net/2007/05/04/i-thought-it-was-womans-choice/",
  "scraped_at": "2026-01-08T21:40:03.567246",
  "title": "I thought it was a woman’s choice",
  "date_display": "May 4, 2007",
  "date_iso": "2007-05-04T09:08:00+00:00",
  "date_from_url": "2007-05-04",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>Feminists are all for choice, so long as women only choose to kill their unborn children <a href=\"http://www.thesun.co.uk/article/0,,2007200670,00.html\">for reasons of which they approve</a>:</p><blockquote><p>CAMPAIGNERS last night warned couples “not to play God” with a revolutionary home test that reveals an unborn baby’s sex at six weeks.  They fear the £189 kit will create a massive leap in abortions if would-be parents are not having the gender they want.</p><p>Michaela Aston, spokeswoman for the charity LIFE, said: “This test is very dangerous. It could lead to babies being aborted simply for being the ‘wrong’ sex.”  And Julia Millington, of the Prolife Alliance, said: “There is a real risk that some people would choose to abort babies of a certain gender.”</p><p>The earliest couples had previously known the gender of their baby was at the 20-week scan — four weeks before the legal limit for an abortion….</p><p>Prolife Alliance’s Ms Millington added: “We have already reached an alarming situation where hospitals in some parts of the UK will no longer disclose the gender of an unborn child.</p></blockquote><p>As is dependably the case, the feminist position is hopelessly self-contradictory.  They have absolutely no rationale for denying sex-based abortions, thus in the name of women’s equality, they are increasingly complicit in the murders of millions of little girls.</p><p>So, naturally, they’ll try to deny women information about the sex of the unborn child… just as they try to deny women information about abortion’s effects on them.  Given their blatant attempts to keep women ignorant and uninformed, one really has to wonder just how dedicated to female empowerment they truly are.</p><p>Feminists are not merely disgusting, evil creatures, they’re demonstrably stupid as well.</p><p>UPDATE – Come on.  Is it really plausible that hospitals are refusing to disclose the gender of the unborn child because they’re pro-life?  I’m not accusing feminists of hypocrisy here… yet, only pointing out that their position is a rationally untenable one.  The significance of the article to which I linked isn’t what anyone is saying right now, it’s the mere fact that this inexpensive and early test is now available.  The current silence of American feminists on the issue notwithstanding, it’s already clear which way they’re going to have to jump in the near future:</p><p><em>At CSW 51, [Commission on the Status of Women] the United Nations Development Fund for Women (UNIFEM) supported a resolution banning sex-selection abortions.</em></p><p>One of UNIFEM’s publications on eliminating violence against women begins with an acknowledgment that the abortion of females is violence against women and girls: “The range of violence against women and girls is devastating, occurring quite literally from womb to tomb. It includes: abortion of female babies.”</p><p>Even in the more female-friendly West, it’s obvious which way the sex selection dial will usually be turned: <em>That North Americans may not use new technologies to produce huge numbers of “extra” boys does not, however, mean that sex selection and sexism are unrelated. One study, by Roberta Steinbacher at Cleveland State University, found that 81% of women and 94% of men who say they would use sex selection would want their firstborn to be a boy.</em></p><p>But is that sexism or is it choice?  And is there really a difference anyhow?</p></div>",
  "content_text": "Feminists are all for choice, so long as women only choose to kill their unborn children\nfor reasons of which they approve\n:\nCAMPAIGNERS last night warned couples “not to play God” with a revolutionary home test that reveals an unborn baby’s sex at six weeks.  They fear the £189 kit will create a massive leap in abortions if would-be parents are not having the gender they want.\nMichaela Aston, spokeswoman for the charity LIFE, said: “This test is very dangerous. It could lead to babies being aborted simply for being the ‘wrong’ sex.”  And Julia Millington, of the Prolife Alliance, said: “There is a real risk that some people would choose to abort babies of a certain gender.”\nThe earliest couples had previously known the gender of their baby was at the 20-week scan — four weeks before the legal limit for an abortion….\nProlife Alliance’s Ms Millington added: “We have already reached an alarming situation where hospitals in some parts of the UK will no longer disclose the gender of an unborn child.\nAs is dependably the case, the feminist position is hopelessly self-contradictory.  They have absolutely no rationale for denying sex-based abortions, thus in the name of women’s equality, they are increasingly complicit in the murders of millions of little girls.\nSo, naturally, they’ll try to deny women information about the sex of the unborn child… just as they try to deny women information about abortion’s effects on them.  Given their blatant attempts to keep women ignorant and uninformed, one really has to wonder just how dedicated to female empowerment they truly are.\nFeminists are not merely disgusting, evil creatures, they’re demonstrably stupid as well.\nUPDATE – Come on.  Is it really plausible that hospitals are refusing to disclose the gender of the unborn child because they’re pro-life?  I’m not accusing feminists of hypocrisy here… yet, only pointing out that their position is a rationally untenable one.  The significance of the article to which I linked isn’t what anyone is saying right now, it’s the mere fact that this inexpensive and early test is now available.  The current silence of American feminists on the issue notwithstanding, it’s already clear which way they’re going to have to jump in the near future:\nAt CSW 51, [Commission on the Status of Women] the United Nations Development Fund for Women (UNIFEM) supported a resolution banning sex-selection abortions.\nOne of UNIFEM’s publications on eliminating violence against women begins with an acknowledgment that the abortion of females is violence against women and girls: “The range of violence against women and girls is devastating, occurring quite literally from womb to tomb. It includes: abortion of female babies.”\nEven in the more female-friendly West, it’s obvious which way the sex selection dial will usually be turned:\nThat North Americans may not use new technologies to produce huge numbers of “extra” boys does not, however, mean that sex selection and sexism are unrelated. One study, by Roberta Steinbacher at Cleveland State University, found that 81% of women and 94% of men who say they would use sex selection would want their firstborn to be a boy.\nBut is that sexism or is it choice?  And is there really a difference anyhow?",
  "tags": [],
  "categories": [],
  "sitemap_lastmod": "2007-05-04T08:08:00+00:00"
}