{
  "url": "https://voxday.net/2007/05/08/literary-one-trick-ponies/",
  "scraped_at": "2026-01-08T21:40:38.554363",
  "title": "Literary one-trick ponies",
  "date_display": "May 8, 2007",
  "date_iso": "2007-05-08T15:45:00+00:00",
  "date_from_url": "2007-05-08",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>This <a href=\"http://www.nytimes.com/2007/05/07/books/07masl.html?_r=1&amp;oref=slogin\">doesn’t surprise me</a> in the least:</p><blockquote><p>The very outrageousness of “Rant” is supposedly part of its appeal. But Mr. Palahniuk has been walking a thin line lately. In this book and its unpalatable predecessor, “Haunted,” his outrages feel perfunctory, and his new tricks are old tricks, executed by a writer recycling his best gambits for less and less coherent reasons.</p><p>So “Rant” is a mash-up of earlier, better Palahniuk sucker punches, with elements of his “Fight Club” especially conspicuous this time. This book, like that one, has a violent, ritualistic secret society and a shocking identity switcheroo at its finale.</p></blockquote><p>This cracked me up, after having spent a fair amount of time delving into Fight Club over the last two weeks.  Never get excited about a writer who has early success with a novel or even a work of non-fiction that is largely self-referential.  Palahniuk is following the same path previously trod by McInerney and Eggers, and to a certain lamentable extent, Camille Paglia.</p><p>The ability to write about yourself and your life is very, very different than the ability to write about your ideas.  Switching to non-fiction for the time being has turned out to be a really productive move for me, as it’s enabled me to see how my fiction has been stuck in a bit of a thematic rut.</p><p>By the way, someone asked what Paglia book is worth reading.  She has only written one book, really, <i>Sexual Personae</i>.  And it is very worth reading; after reading it for the second time, it definitely gave me some ideas that found their way into <i>Wrath</i>.  The various collections of essays and selections of her favorite poems are basically fluff that you can either read if it amuses you or ignore without missing anything.</p></div>",
  "content_text": "This\ndoesn’t surprise me\nin the least:\nThe very outrageousness of “Rant” is supposedly part of its appeal. But Mr. Palahniuk has been walking a thin line lately. In this book and its unpalatable predecessor, “Haunted,” his outrages feel perfunctory, and his new tricks are old tricks, executed by a writer recycling his best gambits for less and less coherent reasons.\nSo “Rant” is a mash-up of earlier, better Palahniuk sucker punches, with elements of his “Fight Club” especially conspicuous this time. This book, like that one, has a violent, ritualistic secret society and a shocking identity switcheroo at its finale.\nThis cracked me up, after having spent a fair amount of time delving into Fight Club over the last two weeks.  Never get excited about a writer who has early success with a novel or even a work of non-fiction that is largely self-referential.  Palahniuk is following the same path previously trod by McInerney and Eggers, and to a certain lamentable extent, Camille Paglia.\nThe ability to write about yourself and your life is very, very different than the ability to write about your ideas.  Switching to non-fiction for the time being has turned out to be a really productive move for me, as it’s enabled me to see how my fiction has been stuck in a bit of a thematic rut.\nBy the way, someone asked what Paglia book is worth reading.  She has only written one book, really,\nSexual Personae\n.  And it is very worth reading; after reading it for the second time, it definitely gave me some ideas that found their way into\nWrath\n.  The various collections of essays and selections of her favorite poems are basically fluff that you can either read if it amuses you or ignore without missing anything.",
  "tags": [],
  "categories": [],
  "sitemap_lastmod": "2007-05-08T14:45:00+00:00"
}