{
  "url": "https://voxday.net/2007/05/10/oh-it-will-be/",
  "scraped_at": "2026-01-08T21:41:00.740146",
  "title": "Oh, it will be",
  "date_display": "May 10, 2007",
  "date_iso": "2007-05-10T18:59:00+00:00",
  "date_from_url": "2007-05-10",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>I have to confess, it was a bit more detail than I was expecting:</p><blockquote><p>This has got to be the <a href=\"http://scienceblogs.com/pharyngula/2007/05/christianitys_sins_against_sci.php#more\">best Pharyngula post ever</a>. It should be in a book.</p></blockquote><p>Not in its entirety, unless Dr. Myers grants me permission, of course, but I think his list of Christianity’s sins against science is an intriguing one.  He put together a nice list in response to an email I sent to Brent of Unscrewing the Inscrutable – <a href=\"http://brentrasmussen.com/log/node/1323\">Brent put together an interesting response too</a>, even if it required some minor modifications once he realized that I wasn’t bearbaiting for once – and the ironic thing is that I don’t even necessarily disagree with some of the points raised by PZ or his readers.</p><p>The reason I asked the question of Brent wasn’t to misquote anyone or play <i>j’accuse</i> with the Hellbound, but simply because I was curious if my impression that the offense Christianity causes the scientific community and its emanations and penumbras in the populace is primarily environmental in cause rather than specific.  I think both Brent and PZ’s responses tend to support this notion, after all, who really cares about opposition to federal funding for stem cell research, that’s really a political issue that an atheist scientist might reasonably oppose even more vigorously than an illiterate Bible-thumper, not a scientific one.</p><p>As Brent has correctly surmised, I’m not interested in writing a pure polemic.  Oh, of course I’ll hose a few folks down with the rhetorical flamethrower, that’s what I do, after all.  (Especially Sam Harris, although I’m shocked to discover how much I tend to agree with Daniel Dennett after reading four of his books.)  But for the book to be genuinely interesting, it can’t just be a flamefest, it has to be substantive and it has to be reasonable.  And one of the best ways to accomplish that is to do people the courtesy of asking them what they think and accepting their answers without putting a spin on them.  And in order to make sure I’m doing that, each chapter I’m writing has two people checking it out and poking holes in it, one atheist and one theist, a different pair for each chapter.</p><p>So, if you’re an atheist or agnostic who is interested, just email you and I’ll put you on the list, I’ve still got a few spots left.  Maybe you don’t like me, you don’t like my opinions and you may not like my conclusions, but that’s fine.  All I care is that you tear apart the logic, if you can.</p><p>Anyhow, I’m glad to be of some small utility in inspiring such an acclaimed post… and many thanks to Brent for helping me out as well.</p></div>",
  "content_text": "I have to confess, it was a bit more detail than I was expecting:\nThis has got to be the\nbest Pharyngula post ever\n. It should be in a book.\nNot in its entirety, unless Dr. Myers grants me permission, of course, but I think his list of Christianity’s sins against science is an intriguing one.  He put together a nice list in response to an email I sent to Brent of Unscrewing the Inscrutable –\nBrent put together an interesting response too\n, even if it required some minor modifications once he realized that I wasn’t bearbaiting for once – and the ironic thing is that I don’t even necessarily disagree with some of the points raised by PZ or his readers.\nThe reason I asked the question of Brent wasn’t to misquote anyone or play\nj’accuse\nwith the Hellbound, but simply because I was curious if my impression that the offense Christianity causes the scientific community and its emanations and penumbras in the populace is primarily environmental in cause rather than specific.  I think both Brent and PZ’s responses tend to support this notion, after all, who really cares about opposition to federal funding for stem cell research, that’s really a political issue that an atheist scientist might reasonably oppose even more vigorously than an illiterate Bible-thumper, not a scientific one.\nAs Brent has correctly surmised, I’m not interested in writing a pure polemic.  Oh, of course I’ll hose a few folks down with the rhetorical flamethrower, that’s what I do, after all.  (Especially Sam Harris, although I’m shocked to discover how much I tend to agree with Daniel Dennett after reading four of his books.)  But for the book to be genuinely interesting, it can’t just be a flamefest, it has to be substantive and it has to be reasonable.  And one of the best ways to accomplish that is to do people the courtesy of asking them what they think and accepting their answers without putting a spin on them.  And in order to make sure I’m doing that, each chapter I’m writing has two people checking it out and poking holes in it, one atheist and one theist, a different pair for each chapter.\nSo, if you’re an atheist or agnostic who is interested, just email you and I’ll put you on the list, I’ve still got a few spots left.  Maybe you don’t like me, you don’t like my opinions and you may not like my conclusions, but that’s fine.  All I care is that you tear apart the logic, if you can.\nAnyhow, I’m glad to be of some small utility in inspiring such an acclaimed post… and many thanks to Brent for helping me out as well.",
  "tags": [],
  "categories": [],
  "sitemap_lastmod": "2007-05-10T17:59:00+00:00"
}