{
  "url": "https://voxday.net/2007/05/07/remedial-home-economics/",
  "scraped_at": "2026-01-08T21:40:26.557649",
  "title": "Remedial home economics",
  "date_display": "May 7, 2007",
  "date_iso": "2007-05-07T14:33:00+00:00",
  "date_from_url": "2007-05-07",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>It’s so unfair that men <a href=\"http://www.tallahassee.com/special/blogs/abnalley/2007/05/dont-mop-dont-sweep-what-do-you-do.html\">won’t clean to a woman’s standard</a>:</p><blockquote><p>We’ve had this fight about a dozen times in the three years we’ve been together. Sometimes the fight ends because I just get sick of talking about it, sometimes he pushes hard to do a little extra and I feel better. Once, we chocked it up to having “different levels of cleanliness.” Sure we do but that shouldn’t mean one of us gets stuck doing most of the work.</p><p>Right now, it’s ticking me off because I spend almost an entire day of my weekend doing stuff for the house. (Note: We have two completely separate days off from each other). I complained last week and this weekend he actually took out the recycling and trash but that was ALL.</p></blockquote><p>IF YOU WANT IT DONE TO YOUR SPECIFICATIONS, DO IT YOURSELF.  This doesn’t just apply to housework, but nearly everything in life.  The sooner you accept this, the happier and more successful you will be.</p><p>But regarding a clean house or whatever, I suspect that if women were more willing to meet men halfway on what they want, men might be a lot more open to meeting women halfway on their desires.  Instead of nagging the guy every time he doesn’t do something you want, or do it the way you want it, why not try using positive reinforcement temporally tied to the task at hand?</p><p>Of course, very few women in a relationship are ever going to sign up for any sort of quid pro quo, because then they might actually be accountable for performing once they get what they want.  I’ve never understand why women’s desires are supposed to be, at a minimum, regarded seriously at all times, (and ideally catered to), while men are supposed to be grateful if a woman makes the occasional half-hearted gesture in their direction every so often.</p><p>Anyhow, few women understand the incredible male capacity for ignoring negative reinforcement.  The more she yaps, the less he’ll listen.  Turning the volume up to eleven isn’t going to accomplish anything either, unless the goal is to drive him away.  I’ve seen it happen to couples again and again, and no one ever seems to learn anything.</p><p>Seriously, what are women thinking? <em>I know he really likes to have sex with me hanging on the chandelier…. and I really want the fence painted… I know!  I’ll make indirect and passive-aggressive comments about how I wish the fence wasn’t peeling… and if that doesn’t work then I’ll act like a complete bitch and wait for him to ask me why! Surely then he’ll give me what I want!</em></p><p>No wonder so many women are socialists.  Forget capitalism, they can’t even figure out the basic principles of barter.</p></div>",
  "content_text": "It’s so unfair that men\nwon’t clean to a woman’s standard\n:\nWe’ve had this fight about a dozen times in the three years we’ve been together. Sometimes the fight ends because I just get sick of talking about it, sometimes he pushes hard to do a little extra and I feel better. Once, we chocked it up to having “different levels of cleanliness.” Sure we do but that shouldn’t mean one of us gets stuck doing most of the work.\nRight now, it’s ticking me off because I spend almost an entire day of my weekend doing stuff for the house. (Note: We have two completely separate days off from each other). I complained last week and this weekend he actually took out the recycling and trash but that was ALL.\nIF YOU WANT IT DONE TO YOUR SPECIFICATIONS, DO IT YOURSELF.  This doesn’t just apply to housework, but nearly everything in life.  The sooner you accept this, the happier and more successful you will be.\nBut regarding a clean house or whatever, I suspect that if women were more willing to meet men halfway on what they want, men might be a lot more open to meeting women halfway on their desires.  Instead of nagging the guy every time he doesn’t do something you want, or do it the way you want it, why not try using positive reinforcement temporally tied to the task at hand?\nOf course, very few women in a relationship are ever going to sign up for any sort of quid pro quo, because then they might actually be accountable for performing once they get what they want.  I’ve never understand why women’s desires are supposed to be, at a minimum, regarded seriously at all times, (and ideally catered to), while men are supposed to be grateful if a woman makes the occasional half-hearted gesture in their direction every so often.\nAnyhow, few women understand the incredible male capacity for ignoring negative reinforcement.  The more she yaps, the less he’ll listen.  Turning the volume up to eleven isn’t going to accomplish anything either, unless the goal is to drive him away.  I’ve seen it happen to couples again and again, and no one ever seems to learn anything.\nSeriously, what are women thinking?\nI know he really likes to have sex with me hanging on the chandelier…. and I really want the fence painted… I know!  I’ll make indirect and passive-aggressive comments about how I wish the fence wasn’t peeling… and if that doesn’t work then I’ll act like a complete bitch and wait for him to ask me why! Surely then he’ll give me what I want!\nNo wonder so many women are socialists.  Forget capitalism, they can’t even figure out the basic principles of barter.",
  "tags": [],
  "categories": [],
  "sitemap_lastmod": "2007-05-07T13:33:00+00:00"
}