{
  "url": "https://voxday.net/2009/09/25/agw-biggest-science-fraud-ye/",
  "scraped_at": "2026-01-08T23:07:41.396570",
  "title": "AGW: the biggest science fraud yet",
  "date_display": "September 25, 2009",
  "date_iso": "2009-09-25T07:41:00+00:00",
  "date_from_url": "2009-09-25",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>The budding scandal about <a href=\"http://article.nationalreview.com/?q=ZTBiMTRlMDQxNzEyMmRhZjU3ZmYzODI5MGY4ZWI5OWM\">the disappearing global warming data</a> doesn’t surprise me in the least.  The whole thing has been an obvious scam from the beginning.  What it demonstrates is that science hasn’t merely been corrupted, it has been co-opted.  It is rapidly becoming obvious that due to the increased dependence upon government funding by scientists, they can be expected to provide information of approximately the same reliable quality as employees at the Department of Motor Vehicles provide service.</p><blockquote><p>In the early 1980s, with funding from the U.S. Department of Energy, scientists at the United Kingdom’s University of East Anglia established the Climate Research Unit (CRU) to produce the world’s first comprehensive history of surface temperature. It’s known in the trade as the “Jones and Wigley” record for its authors, Phil Jones and Tom Wigley, and it served as the primary reference standard for the U.N. Intergovernmental Panel on Climate Change (IPCC) until 2007. It was this record that prompted the IPCC to claim a “discernible human influence on global climate.”…</p><p>Warwick Hughes, an Australian scientist, wondered where that “+/–” came from, so he politely wrote Phil Jones in early 2005, asking for the original data. Jones’s response to a fellow scientist attempting to replicate his work was, “We have 25 years or so invested in the work. Why should I make the data available to you, when your aim is to try and find something wrong with it?”</p><p>Reread that statement, for it is breathtaking in its anti-scientific thrust. In fact, the entire purpose of replication is to “try and find something wrong.” The ultimate objective of science is to do things so well that, indeed, nothing is wrong.</p><p>Then the story changed. In June 2009, Georgia Tech’s Peter Webster told Canadian researcher Stephen McIntyre that he had requested raw data, and Jones freely gave it to him. So McIntyre promptly filed a Freedom of Information Act request for the same data. Despite having been invited by the National Academy of Sciences to present his analyses of millennial temperatures, McIntyre was told that he couldn’t have the data because he wasn’t an “academic.” So his colleague Ross McKitrick, an economist at the University of Guelph, asked for the data. He was turned down, too.</p></blockquote><p>I think Vox’s Second Law applies here: If a government agency says X, then Not-X is true.  I’m just wondering which would be considered the bigger science scandal.  The AGW/CC fraud or the so-called Moon landings if the discovery of Moon water turns out to prove that Man never landed there.</p><p>On a related note, assuming Krugman’s Keynesianism doesn’t destroy his reputation once it becomes clear that this second stimulus plan has failed because economic theory is over the average NYT reader’s head, <a href=\"http://www.nytimes.com/2009/09/25/opinion/25krugman.html?_r=1\">this conclusion to his column today</a> should eventually suffice: “<i>The claim that climate legislation will kill the economy deserves the same disdain as the claim that global warming is a hoax. The truth about the economics of climate change is that it’s relatively easy being green.”</i></p></div>",
  "content_text": "The budding scandal about\nthe disappearing global warming data\ndoesn’t surprise me in the least.  The whole thing has been an obvious scam from the beginning.  What it demonstrates is that science hasn’t merely been corrupted, it has been co-opted.  It is rapidly becoming obvious that due to the increased dependence upon government funding by scientists, they can be expected to provide information of approximately the same reliable quality as employees at the Department of Motor Vehicles provide service.\nIn the early 1980s, with funding from the U.S. Department of Energy, scientists at the United Kingdom’s University of East Anglia established the Climate Research Unit (CRU) to produce the world’s first comprehensive history of surface temperature. It’s known in the trade as the “Jones and Wigley” record for its authors, Phil Jones and Tom Wigley, and it served as the primary reference standard for the U.N. Intergovernmental Panel on Climate Change (IPCC) until 2007. It was this record that prompted the IPCC to claim a “discernible human influence on global climate.”…\nWarwick Hughes, an Australian scientist, wondered where that “+/–” came from, so he politely wrote Phil Jones in early 2005, asking for the original data. Jones’s response to a fellow scientist attempting to replicate his work was, “We have 25 years or so invested in the work. Why should I make the data available to you, when your aim is to try and find something wrong with it?”\nReread that statement, for it is breathtaking in its anti-scientific thrust. In fact, the entire purpose of replication is to “try and find something wrong.” The ultimate objective of science is to do things so well that, indeed, nothing is wrong.\nThen the story changed. In June 2009, Georgia Tech’s Peter Webster told Canadian researcher Stephen McIntyre that he had requested raw data, and Jones freely gave it to him. So McIntyre promptly filed a Freedom of Information Act request for the same data. Despite having been invited by the National Academy of Sciences to present his analyses of millennial temperatures, McIntyre was told that he couldn’t have the data because he wasn’t an “academic.” So his colleague Ross McKitrick, an economist at the University of Guelph, asked for the data. He was turned down, too.\nI think Vox’s Second Law applies here: If a government agency says X, then Not-X is true.  I’m just wondering which would be considered the bigger science scandal.  The AGW/CC fraud or the so-called Moon landings if the discovery of Moon water turns out to prove that Man never landed there.\nOn a related note, assuming Krugman’s Keynesianism doesn’t destroy his reputation once it becomes clear that this second stimulus plan has failed because economic theory is over the average NYT reader’s head,\nthis conclusion to his column today\nshould eventually suffice: “\nThe claim that climate legislation will kill the economy deserves the same disdain as the claim that global warming is a hoax. The truth about the economics of climate change is that it’s relatively easy being green.”",
  "tags": [],
  "categories": [],
  "sitemap_lastmod": "2009-09-25T06:41:00+00:00"
}