{
  "url": "https://voxday.net/2009/09/09/attn-boomers-you-are-old/",
  "scraped_at": "2026-01-08T23:06:09.838126",
  "title": "Attn Boomers: you are old",
  "date_display": "September 9, 2009",
  "date_iso": "2009-09-09T14:15:00+00:00",
  "date_from_url": "2009-09-09",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>So for the love of your bell-bottoms, pre-Raphaelite hair, and shaggy gay mustaches, just shut up and deal with it already. <a href=\"http://www.telegraph.co.uk/culture/music/the-beatles/6157544/Are-they-still-cool.html\">The Beatles are not cool</a> and even if we assume that they were at some point in the distant past, they have not been for literal decades, except, of course, in the manner that a corpse is cold.</p><blockquote><p>But why should kids care about a group their grandparents danced to forty years ago? There is always a sneaking suspicion that the continued obsession with The Beatles is driven by media nostalgia.</p></blockquote><p>They don’t care.  Their <i>parents</i> don’t care.  No one under the age of sixty is obsessed with The Beatles except for a few retro-crazed would-be hipsters pretending they are John Cusack selling LPs at independent record stores.  And even their obsession is only ironic.  As I see it, The Beatles were little more than the Jonas Brothers of their day, which is very, very far from even beginning to approach anything that can reasonably be described as cool.  So they wrote a lot of pop songs, had some big hits, and met with a Tiger Beat reception in America.  BFD.</p><p>Can you even imagine an elderly Generation Xer writing an article about Duran Duran entitled “Are They Still Cool?” in the year 2027?</p><p>If you happen to dig The Beatles, then pick up the new Guitar Hero game and have yourself a groovy time.  But please also accept the fact of your own mortality and understand that the world does not revolve around the ephemeral tastes of your generation.  It never did.</p></div>",
  "content_text": "So for the love of your bell-bottoms, pre-Raphaelite hair, and shaggy gay mustaches, just shut up and deal with it already.\nThe Beatles are not cool\nand even if we assume that they were at some point in the distant past, they have not been for literal decades, except, of course, in the manner that a corpse is cold.\nBut why should kids care about a group their grandparents danced to forty years ago? There is always a sneaking suspicion that the continued obsession with The Beatles is driven by media nostalgia.\nThey don’t care.  Their\nparents\ndon’t care.  No one under the age of sixty is obsessed with The Beatles except for a few retro-crazed would-be hipsters pretending they are John Cusack selling LPs at independent record stores.  And even their obsession is only ironic.  As I see it, The Beatles were little more than the Jonas Brothers of their day, which is very, very far from even beginning to approach anything that can reasonably be described as cool.  So they wrote a lot of pop songs, had some big hits, and met with a Tiger Beat reception in America.  BFD.\nCan you even imagine an elderly Generation Xer writing an article about Duran Duran entitled “Are They Still Cool?” in the year 2027?\nIf you happen to dig The Beatles, then pick up the new Guitar Hero game and have yourself a groovy time.  But please also accept the fact of your own mortality and understand that the world does not revolve around the ephemeral tastes of your generation.  It never did.",
  "tags": [],
  "categories": [],
  "sitemap_lastmod": "2009-09-09T13:15:00+00:00"
}