{
  "url": "https://voxday.net/2009/09/27/democratic-integrity/",
  "scraped_at": "2026-01-08T23:07:50.400938",
  "title": "Democratic integrity",
  "date_display": "September 27, 2009",
  "date_iso": "2009-09-27T15:12:00+00:00",
  "date_from_url": "2009-09-27",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>Peter Schiff <a href=\"http://www.politico.com/news/stories/0909/27497_Page2.html\">does the right thing</a>:</p><blockquote><p>While Peter Schiff has the money to hire an experienced campaign team, he’s shied away from that approach. Andrew Schiff said that when his brother first formed an exploratory committee, he put together a team of Washington-based consultants to help hone his campaign message. When they expressed doubt about the political viability of his libertarian message, Schiff let them all go.</p><p>“We decided we didn’t want to be put in a standard box, and Peter wasn’t impressed with their ideas and how they wanted to sell him,” said Andrew Schiff. “The guys in D.C. wanted to spend lots of money, and we saw how the game was played and how they got their money. It left a bad taste in our mouth, and we moved on.”</p></blockquote><p>There’s no point in playing bait-and-switch with the American people.  If they genuinely want to be impoverished serfs living in a post-apocalyptic economic landscape, that’s their right.  Schiff is giving them the option to choose freedom, and that’s all one can reasonably hope to do.  If you focus on winning <i>uber alles</i> on the grounds that you can’t effect change without holding political office, you have already lost regardless of how the election turns out.</p></div>",
  "content_text": "Peter Schiff\ndoes the right thing\n:\nWhile Peter Schiff has the money to hire an experienced campaign team, he’s shied away from that approach. Andrew Schiff said that when his brother first formed an exploratory committee, he put together a team of Washington-based consultants to help hone his campaign message. When they expressed doubt about the political viability of his libertarian message, Schiff let them all go.\n“We decided we didn’t want to be put in a standard box, and Peter wasn’t impressed with their ideas and how they wanted to sell him,” said Andrew Schiff. “The guys in D.C. wanted to spend lots of money, and we saw how the game was played and how they got their money. It left a bad taste in our mouth, and we moved on.”\nThere’s no point in playing bait-and-switch with the American people.  If they genuinely want to be impoverished serfs living in a post-apocalyptic economic landscape, that’s their right.  Schiff is giving them the option to choose freedom, and that’s all one can reasonably hope to do.  If you focus on winning\nuber alles\non the grounds that you can’t effect change without holding political office, you have already lost regardless of how the election turns out.",
  "tags": [],
  "categories": [],
  "sitemap_lastmod": "2009-09-27T14:12:00+00:00"
}