{
  "url": "https://voxday.net/2009/09/30/fdic-cant-borrow-solvency/",
  "scraped_at": "2026-01-08T23:08:09.123194",
  "title": "The FDIC can’t borrow solvency",
  "date_display": "September 30, 2009",
  "date_iso": "2009-09-30T13:06:00+00:00",
  "date_from_url": "2009-09-30",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>I’ve been repeatedly asserting that the FDIC’s Deposit Insurance Fund has run dry, while most economic sites have been insisting that the running DIF balance doesn’t actually matter because the FDIC has access to the $500 billion credit line with the Treasury established in May.  That argument never quite made sense to me.  Someone who is bankrupt is still bankrupt even if someone else promises to lend him more money, because taking that loan would only increase his liabilities and put him in a worse position than before.</p><p>This statement <a href=\"http://www.fdic.gov/news/board/Sept29no1.pdf\">from the FDIC yesterday</a> should settle the matter:</p><blockquote><p>An alternative—borrowing from the Treasury or the Federal Financing Bank (FFB)— would also increase the liquid assets available to fund future resolutions <i>but would not increase the Fund balance as there would be a corresponding liability recorded.</i> Nevertheless, the FDIC has several options for returning the reserve ratio to the statutorily mandated 1.15 percent and meeting its liquidity needs.<br> Restoration Plan and Assessment Rates Staff projects that failures will peak in 2009 and 2010 and that industry earnings will have recovered sufficiently by 2011 to absorb a 3 basis point increase in deposit insurance assessments. Adopting a uniform increase in assessment rates of 3 basis points now, effective January 1, 2011, should ensure that the prepaid assessments would address current liquidity needs without materially impairing the capital or earnings of insured institutions. Advance adoption of the rate increase also should help institutions plan for future assessment expenses….</br></p><p>In staff’s view, requiring that institutions prepay assessments is also preferable to borrowing from the U.S. Treasury or the Federal Financing Bank (FFB). Prepayment of assessments ensures that the deposit insurance system remains directly industry-funded. Additionally, staff believes that, unlike borrowing from the Treasury or the FFB, requiring prepaid assessments would not count toward the public debt limit. Finally, collecting prepaid assessments would be the least costly option to the Fund for raising liquidity as there would be no interest cost.</p></blockquote><p>In other words, the FDIC is doing essentially the same thing as Cash for Clunkers and every other federal stimulus program by spending tomorrow’s cash today in the hopes that it will allow them to survive long enough until the recovery magically begins.  They’re gambling that $77 billion in cash and liquid assets will be enough to get them through 2009 and 2010.</p><p>Of course, this strategy is predicated on the worst case being the “jobless recovery” scenario.  These <a href=\"http://www.fdic.gov/deposit/insurance/risk/2007_01/DIFoutlookmay2007_revd05072007.html\">reserve ratio projections from mid-2007</a> should demonstrate the precision and reliability of their forecasts – their worst case scenario for 2009 was 1.18 percent vs 0.27 percent for last quarter.  And given that they’ve already blown through at least $45 billion in the first half of 2009 alone, (they admit to $25 billion in the report, but the FDIC Quarterly shows otherwise), I expect that even with three years of pre-paid assessments, the DIF will run dry again before the third quarter of 2010.  Notice that the requirement to return the DIF to the statutorily mandated minimum reserve ratio of 1.15 percent has been increased <i>twice</i> in seven months, giving them <i>eight</i> years just to get back to normal. And notice that they’re announcing their intention to hide the data henceforth because the DIF as previously calculated is empty and the reserve ratio is negative.</p><blockquote><p>Near the end of the third and fourth quarters of 2009, if there is a reasonable possibility that the reserve ratio has declined to a level that could undermine public confidence in federal deposit insurance or to a level which shall be close to or below zero, staff will estimate the reserve ratio for that quarter from available data on, or estimates of, insurance fund assessment income, investment income, operating expenses, other revenue and expenses, and loss provisions (including provisions for anticipated failures).</p></blockquote><p>On a tangential note, there’s some evidence that the loss-share deals the FDIC is striking with banks that are acquiring the asserts of failed banks <a href=\"http://activerain.com/blogsview/1243528/is-the-fdic-killing-short-sales\">are driving up foreclosure rates</a>, thus putting more downward pressure on housing prices.  And if that’s not bad enough, Denninger is now calculating that <a href=\"http://market-ticker.denninger.net/archives/1476-The-Banking-System-Is-Insolvent.html\">the entire banking system is insolvent</a>, since it faces the absorption of a conservatively estimated $869 billion in single-family mortgage defaults alone.</p><p><i>“The entire banking system and likely The Fed, given the quantity of Fannie and Freddie paper it has been and is “eating”, is insolvent.  These facts are why the government is lying – they’re well-aware of the near-zero cure rates and know that these facts mean that the banking industry has nowhere near sufficient capital to withstand these losses without folding like a paper cup getting stomped on by an elephant.  (Remember that these numbers do not include any commercial real estate losses and we have found that banks are frequently over-stating their claimed values for these loans by 50% or more – as was seen with Colonial.)”</i></p></div>",
  "content_text": "I’ve been repeatedly asserting that the FDIC’s Deposit Insurance Fund has run dry, while most economic sites have been insisting that the running DIF balance doesn’t actually matter because the FDIC has access to the $500 billion credit line with the Treasury established in May.  That argument never quite made sense to me.  Someone who is bankrupt is still bankrupt even if someone else promises to lend him more money, because taking that loan would only increase his liabilities and put him in a worse position than before.\nThis statement\nfrom the FDIC yesterday\nshould settle the matter:\nAn alternative—borrowing from the Treasury or the Federal Financing Bank (FFB)— would also increase the liquid assets available to fund future resolutions\nbut would not increase the Fund balance as there would be a corresponding liability recorded.\nNevertheless, the FDIC has several options for returning the reserve ratio to the statutorily mandated 1.15 percent and meeting its liquidity needs.\nRestoration Plan and Assessment Rates Staff projects that failures will peak in 2009 and 2010 and that industry earnings will have recovered sufficiently by 2011 to absorb a 3 basis point increase in deposit insurance assessments. Adopting a uniform increase in assessment rates of 3 basis points now, effective January 1, 2011, should ensure that the prepaid assessments would address current liquidity needs without materially impairing the capital or earnings of insured institutions. Advance adoption of the rate increase also should help institutions plan for future assessment expenses….\nIn staff’s view, requiring that institutions prepay assessments is also preferable to borrowing from the U.S. Treasury or the Federal Financing Bank (FFB). Prepayment of assessments ensures that the deposit insurance system remains directly industry-funded. Additionally, staff believes that, unlike borrowing from the Treasury or the FFB, requiring prepaid assessments would not count toward the public debt limit. Finally, collecting prepaid assessments would be the least costly option to the Fund for raising liquidity as there would be no interest cost.\nIn other words, the FDIC is doing essentially the same thing as Cash for Clunkers and every other federal stimulus program by spending tomorrow’s cash today in the hopes that it will allow them to survive long enough until the recovery magically begins.  They’re gambling that $77 billion in cash and liquid assets will be enough to get them through 2009 and 2010.\nOf course, this strategy is predicated on the worst case being the “jobless recovery” scenario.  These\nreserve ratio projections from mid-2007\nshould demonstrate the precision and reliability of their forecasts – their worst case scenario for 2009 was 1.18 percent vs 0.27 percent for last quarter.  And given that they’ve already blown through at least $45 billion in the first half of 2009 alone, (they admit to $25 billion in the report, but the FDIC Quarterly shows otherwise), I expect that even with three years of pre-paid assessments, the DIF will run dry again before the third quarter of 2010.  Notice that the requirement to return the DIF to the statutorily mandated minimum reserve ratio of 1.15 percent has been increased\ntwice\nin seven months, giving them\neight\nyears just to get back to normal. And notice that they’re announcing their intention to hide the data henceforth because the DIF as previously calculated is empty and the reserve ratio is negative.\nNear the end of the third and fourth quarters of 2009, if there is a reasonable possibility that the reserve ratio has declined to a level that could undermine public confidence in federal deposit insurance or to a level which shall be close to or below zero, staff will estimate the reserve ratio for that quarter from available data on, or estimates of, insurance fund assessment income, investment income, operating expenses, other revenue and expenses, and loss provisions (including provisions for anticipated failures).\nOn a tangential note, there’s some evidence that the loss-share deals the FDIC is striking with banks that are acquiring the asserts of failed banks\nare driving up foreclosure rates\n, thus putting more downward pressure on housing prices.  And if that’s not bad enough, Denninger is now calculating that\nthe entire banking system is insolvent\n, since it faces the absorption of a conservatively estimated $869 billion in single-family mortgage defaults alone.\n“The entire banking system and likely The Fed, given the quantity of Fannie and Freddie paper it has been and is “eating”, is insolvent.  These facts are why the government is lying – they’re well-aware of the near-zero cure rates and know that these facts mean that the banking industry has nowhere near sufficient capital to withstand these losses without folding like a paper cup getting stomped on by an elephant.  (Remember that these numbers do not include any commercial real estate losses and we have found that banks are frequently over-stating their claimed values for these loans by 50% or more – as was seen with Colonial.)”",
  "tags": [
    "economics"
  ],
  "categories": [],
  "sitemap_lastmod": "2009-09-30T12:06:00+00:00"
}