{
  "url": "https://voxday.net/2009/09/18/fearful-hypocrites/",
  "scraped_at": "2026-01-08T23:07:04.026720",
  "title": "Fearful hypocrites",
  "date_display": "September 18, 2009",
  "date_iso": "2009-09-18T19:45:00+00:00",
  "date_from_url": "2009-09-18",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>Richard Dawkins and PZ Myers are frightened that <a href=\"http://scienceblogs.com/pharyngula/2009/09/foil_the_depraved_designs_of_a.php\">someone, somewhere, might read</a> <i>Kirk Cameron and Ray Comfort’s</i> introduction to <i>On the Origin of Species by Means of Natural Selection, or the Preservation of Favoured Races in the Struggle for Life</i>:</p><blockquote><p>Back in June, I reported on this new sleazy tactic by Ray Comfort: he produced an abridged edition of Darwin’s Origin of Species, and then had the gall to tag on a preface that he had written himself, full of the standard creationist misconceptions.</p></blockquote><p>Sleazy?  Gall?  Only two cowardly charlatans who consistently run away from debating anyone they suspect will make them look like the hopeless buffoons they are could possibly have a problem with what is nothing more than <i>an introduction to an abridged text</i>.   This is hardly the first time a book has been abridged or that an introduction is written by someone who a) isn’t the author, and b) doesn’t believe in the sacrosanct nature of the work being introduced, but of course, <i>this is the sacred text of Saint Darwin of the Galapagos</i> with which we are concerned here.</p><p>Obviously, it should be bound in gold plates and read only by the favored few possessed of the holy <i>science degrees</i>.</p><blockquote><p><a href=\"http://richarddawkins.net/article,4319,Kirk-Cameron-has-gone-too-far-But-we-can-stop-him,-Kirk-Cameron-has-gone-too-far-But-we-can-stop-him---Facebook\">If this outrages you, then you’re not alone</a>. There’s something we can do though. We can amass as many of these books as possible, remove the 50 page intro, and then donate perfectly good copies of ‘Origin of Species’ to schools, libraries, and Goodwill….  This is a shameful thing that Kirk Cameron and the Banana Guy are doing by altering another person’s book in order to push their agenda. But we can help to restore the book to how it was intended and keep young minds from being brainwashed by misinformation.</p></blockquote><p>In case you’re not convinced yet that the New Atheists and their acolytes are genuine morons, read that last paragraph again while keeping in mind that these are the people who genuinely believe they are particularly gifted in the reason department.  But regardless of whether Cameron and Comfort can produce effective arguments against evolution or not, and I have my own doubts on that score, <i>they have not altered anyone’s book!</i> Have they altered a single word from the text?  Is the abridgment a dishonest cut-and-paste job?  Do they pretend that their own words are Darwin’s?  If not, then there is clearly nothing objectionable about what they are doing, no matter how effective or ineffective their arguments are.</p><p>Atheism may not be a religion, but Darwinism has clearly become one for some.  And such sensitivity from the very people who proudly piss all over the sacred texts of other religions is astonishingly hypocritical.</p></div>",
  "content_text": "Richard Dawkins and PZ Myers are frightened that\nsomeone, somewhere, might read\nKirk Cameron and Ray Comfort’s\nintroduction to\nOn the Origin of Species by Means of Natural Selection, or the Preservation of Favoured Races in the Struggle for Life\n:\nBack in June, I reported on this new sleazy tactic by Ray Comfort: he produced an abridged edition of Darwin’s Origin of Species, and then had the gall to tag on a preface that he had written himself, full of the standard creationist misconceptions.\nSleazy?  Gall?  Only two cowardly charlatans who consistently run away from debating anyone they suspect will make them look like the hopeless buffoons they are could possibly have a problem with what is nothing more than\nan introduction to an abridged text\n.   This is hardly the first time a book has been abridged or that an introduction is written by someone who a) isn’t the author, and b) doesn’t believe in the sacrosanct nature of the work being introduced, but of course,\nthis is the sacred text of Saint Darwin of the Galapagos\nwith which we are concerned here.\nObviously, it should be bound in gold plates and read only by the favored few possessed of the holy\nscience degrees\n.\nIf this outrages you, then you’re not alone\n. There’s something we can do though. We can amass as many of these books as possible, remove the 50 page intro, and then donate perfectly good copies of ‘Origin of Species’ to schools, libraries, and Goodwill….  This is a shameful thing that Kirk Cameron and the Banana Guy are doing by altering another person’s book in order to push their agenda. But we can help to restore the book to how it was intended and keep young minds from being brainwashed by misinformation.\nIn case you’re not convinced yet that the New Atheists and their acolytes are genuine morons, read that last paragraph again while keeping in mind that these are the people who genuinely believe they are particularly gifted in the reason department.  But regardless of whether Cameron and Comfort can produce effective arguments against evolution or not, and I have my own doubts on that score,\nthey have not altered anyone’s book!\nHave they altered a single word from the text?  Is the abridgment a dishonest cut-and-paste job?  Do they pretend that their own words are Darwin’s?  If not, then there is clearly nothing objectionable about what they are doing, no matter how effective or ineffective their arguments are.\nAtheism may not be a religion, but Darwinism has clearly become one for some.  And such sensitivity from the very people who proudly piss all over the sacred texts of other religions is astonishingly hypocritical.",
  "tags": [],
  "categories": [],
  "sitemap_lastmod": "2009-09-18T18:45:00+00:00"
}