{
  "url": "https://voxday.net/2009/09/17/girl-is-d-u-m-b/",
  "scraped_at": "2026-01-08T23:06:53.020900",
  "title": "The girl is D-U-M-B",
  "date_display": "September 17, 2009",
  "date_iso": "2009-09-17T07:35:00+00:00",
  "date_from_url": "2009-09-17",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>The world’s most clueless econoblogger <a href=\"http://meganmcardle.theatlantic.com/archives/2009/09/limbaugh_hits_a_new_low.php\">makes an ass of herself again</a>… albeit with <a href=\"http://blog.beliefnet.com/crunchycon/2009/09/rush-limbaugh-hits-racial-bott.html\">an assist from Rod Dreher</a>:</p><blockquote><p>Limbaugh Hits a New Low….  I really did not think it was possible for me to like Rush Limbaugh any less.  Now I realize that I was mentally excluding all sorts of activities from the realm of the possible, like murdering boatloads of Guatamalan orphans, or this sort of vileness.  It won’t be the last time I’m wrong, but I certainly hope it’s the last time I’m that wrong about talk radio’s capacity for socially destructive quasi-populist virulent nonsense.</p></blockquote><p>McArdle hits a new low of her own… I really did not think it was possible for me to think she was any dumber after her post that supported thought-policing the Right.  And what does she have her granny panties in a twist about now?  A bitingly sarcastic piece by Limbaugh about the Obama administration, Newsweek’s racist baby, and the white kid getting beat up by black kids on the school bus: <i>“Look, this thing on the bus cannot possibly be a hate crime. The cops are probably lying about what happened even though we have the video. The video was probably doctored and edited. We all know that cops are liars, racist pigs and that the white kid deserved it. I mean that’s modern 2009 going into 2010 America.”</i></p><p>The reality is that as much as <a href=\"http://andrewsullivan.theatlantic.com/the_daily_dish/2009/09/calling-out-racebaiting.html\">the various twits</a> at the Atlantic <a href=\"http://jeffreygoldberg.theatlantic.com/archives/2009/09/race-baiting_at_drudge.php\">would like to sweep it under the table</a>, (to Dreher’s credit, he does not), violent black-on-white crime is far more common than the reverse and one of the many reasons for this is that the same guilty white liberals who were piddling themselves with joy over Obama have been making excuses for violent black criminals for nearly fifty years.</p><p>As long as we’re on the subject, it’s worth noting that statistics readily demonstrate that the racist lynchings of the past were far less of a problem than violent black crime is today.  The Tuskegee Institute reports 3,437 lynchings of black Americans between 1882 and 1968.  If one takes into account the 1,293 lynchings of white Americans as well as the relative population difference, this means there were roughly 38 race-motivated lynchings per year.  In 2005, the FBI reported <a href=\"http://frontpagemag.com/readArticle.aspx?ARTID=26368\">37,460 white women were raped or sexually assaulted</a> by black men.  By contrast, zero black women were raped or sexually assaulted by white men.  In other words, over the course of a year, 990 white women are now attacked by black men for every racist lynching of the past.  Naturally, guilty white liberals are much more deeply concerned about the latter than the former.  Nor is it only a problem for white women, as an additional 964 black women were raped or sexually assaulted by black men for each of those lynchings as well.</p><p>The strange thing about this is that it’s fairly apparent that none of the four individuals commenting on Rush’s broadcast, including Dreher, appear to have bothered to read the transcript, much less listen to a recording of the actual show, before spouting off.  To condemn a man for saying something without quoting or even <i>linking</i> to his actual words smacks of serious intellectual dishonesty.</p><p>UPDATE – On the other hand, statistical probability doesn’t mean that charges of rape against black men can be considered inherently credible, as <a href=\"http://wcbstv.com/breakingnewsalerts/hofstra.rape.case.2.1189029.html\">this example of morning-after remorse</a> clearly demonstrates: <i>Moments ago my office moved to dismiss all charges against four men accused of committing a sexual assault on the campus of Hofstra University.  Late this evening, during the continuation of the Nassau County Police Department’s investigation of the allegation, and under questioning by my office’s chief trial attorney and chief sex crimes prosecutor, the alleged victim of the sexual assault admitted that the encounter that took place early Sunday morning was consensual.</i> One hopes that the lying woman will be prosecuted and jailed, as crying rape harms the interests of innocent men and real female victims alike.  A woman who lies in an attempt to press rape charges should not only be prosecuted and jailed for years, but her picture should also be distributed as widely throughout the media as were the pictures of those she falsely accused.</p></div>",
  "content_text": "The world’s most clueless econoblogger\nmakes an ass of herself again\n… albeit with\nan assist from Rod Dreher\n:\nLimbaugh Hits a New Low….  I really did not think it was possible for me to like Rush Limbaugh any less.  Now I realize that I was mentally excluding all sorts of activities from the realm of the possible, like murdering boatloads of Guatamalan orphans, or this sort of vileness.  It won’t be the last time I’m wrong, but I certainly hope it’s the last time I’m that wrong about talk radio’s capacity for socially destructive quasi-populist virulent nonsense.\nMcArdle hits a new low of her own… I really did not think it was possible for me to think she was any dumber after her post that supported thought-policing the Right.  And what does she have her granny panties in a twist about now?  A bitingly sarcastic piece by Limbaugh about the Obama administration, Newsweek’s racist baby, and the white kid getting beat up by black kids on the school bus:\n“Look, this thing on the bus cannot possibly be a hate crime. The cops are probably lying about what happened even though we have the video. The video was probably doctored and edited. We all know that cops are liars, racist pigs and that the white kid deserved it. I mean that’s modern 2009 going into 2010 America.”\nThe reality is that as much as\nthe various twits\nat the Atlantic\nwould like to sweep it under the table\n, (to Dreher’s credit, he does not), violent black-on-white crime is far more common than the reverse and one of the many reasons for this is that the same guilty white liberals who were piddling themselves with joy over Obama have been making excuses for violent black criminals for nearly fifty years.\nAs long as we’re on the subject, it’s worth noting that statistics readily demonstrate that the racist lynchings of the past were far less of a problem than violent black crime is today.  The Tuskegee Institute reports 3,437 lynchings of black Americans between 1882 and 1968.  If one takes into account the 1,293 lynchings of white Americans as well as the relative population difference, this means there were roughly 38 race-motivated lynchings per year.  In 2005, the FBI reported\n37,460 white women were raped or sexually assaulted\nby black men.  By contrast, zero black women were raped or sexually assaulted by white men.  In other words, over the course of a year, 990 white women are now attacked by black men for every racist lynching of the past.  Naturally, guilty white liberals are much more deeply concerned about the latter than the former.  Nor is it only a problem for white women, as an additional 964 black women were raped or sexually assaulted by black men for each of those lynchings as well.\nThe strange thing about this is that it’s fairly apparent that none of the four individuals commenting on Rush’s broadcast, including Dreher, appear to have bothered to read the transcript, much less listen to a recording of the actual show, before spouting off.  To condemn a man for saying something without quoting or even\nlinking\nto his actual words smacks of serious intellectual dishonesty.\nUPDATE – On the other hand, statistical probability doesn’t mean that charges of rape against black men can be considered inherently credible, as\nthis example of morning-after remorse\nclearly demonstrates:\nMoments ago my office moved to dismiss all charges against four men accused of committing a sexual assault on the campus of Hofstra University.  Late this evening, during the continuation of the Nassau County Police Department’s investigation of the allegation, and under questioning by my office’s chief trial attorney and chief sex crimes prosecutor, the alleged victim of the sexual assault admitted that the encounter that took place early Sunday morning was consensual.\nOne hopes that the lying woman will be prosecuted and jailed, as crying rape harms the interests of innocent men and real female victims alike.  A woman who lies in an attempt to press rape charges should not only be prosecuted and jailed for years, but her picture should also be distributed as widely throughout the media as were the pictures of those she falsely accused.",
  "tags": [],
  "categories": [],
  "sitemap_lastmod": "2009-09-17T06:35:00+00:00"
}