{
  "url": "https://voxday.net/2009/09/21/i-told-you-he-wasnt-that-smar/",
  "scraped_at": "2026-01-08T23:07:18.827177",
  "title": "I told you he wasn’t that smart",
  "date_display": "September 21, 2009",
  "date_iso": "2009-09-21T14:15:00+00:00",
  "date_from_url": "2009-09-21",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>The Obama administration is certainly living up to its comedic potential – Obama’s ignorance and illogic even manages <a href=\"http://www.nytimes.com/2009/09/21/opinion/21krugman.html?_r=1\">to stun Paul Krugman</a>:</p><blockquote><p>I was startled last week when Mr. Obama, in an interview with Bloomberg News, questioned the case for limiting financial-sector pay: “Why is it,” he asked, “that we’re going to cap executive compensation for Wall Street bankers but not Silicon Valley entrepreneurs or N.F.L. football players?”</p><p>That’s an astonishing remark — and not just because the National Football League does, in fact, have pay caps. Tech firms don’t crash the whole world’s operating system when they go bankrupt; quarterbacks who make too many risky passes don’t have to be rescued with hundred-billion-dollar bailouts. Banking is a special case — and the president is surely smart enough to know that.</p></blockquote><p>Surely?  I wouldn’t bet on it, given the growing amount of evidence to the contrary.  And the special case of banking is irrelevant anyhow.  The reason why we’re going to cap banking compensation and not the compensation of entrepeneurs and NFL players is that entrepeneurs and NFL players actually create value.  They’re not being kept out of insolvency by forced contributions from the American taxpayer.  No industry that receives hundreds of billions of taxpayer money should be permitted to pay more than the average American income in salary to its executives, much less the $18 billion in bonuses that was paid out in 2008.</p><p>And if those limits mean that banksters will stop banksting as they occasionally threaten, that’s great!  The truth is America’s banksters don’t deserve a cap in their compensation so much as they merit a cap in their fat collective asses.</p><p><a href=\"http://www.hoocoodanode.org/node/7896#comment-927072\">This comment</a> from a Calculated Risk reader made me laugh: <i>“That is truly one heartbreaking statement of staggering stupidity straight out of the mouth of the man who has finished shattering any hope I had that we could steer this ship back on course. I will and must admit, that I was totally taken in, hook line and sinker by this fraud. Im quite disappointed in myself, although my only other option would have been to not vote at all.”</i></p><p>Well, better late than never.  He is far from the only disenchanted Obama voter.  I assume we can soon look forward to Obama attempting to demonstrate that he’s a big NFL fan… with about the same success he had with his bowling.</p></div>",
  "content_text": "The Obama administration is certainly living up to its comedic potential – Obama’s ignorance and illogic even manages\nto stun Paul Krugman\n:\nI was startled last week when Mr. Obama, in an interview with Bloomberg News, questioned the case for limiting financial-sector pay: “Why is it,” he asked, “that we’re going to cap executive compensation for Wall Street bankers but not Silicon Valley entrepreneurs or N.F.L. football players?”\nThat’s an astonishing remark — and not just because the National Football League does, in fact, have pay caps. Tech firms don’t crash the whole world’s operating system when they go bankrupt; quarterbacks who make too many risky passes don’t have to be rescued with hundred-billion-dollar bailouts. Banking is a special case — and the president is surely smart enough to know that.\nSurely?  I wouldn’t bet on it, given the growing amount of evidence to the contrary.  And the special case of banking is irrelevant anyhow.  The reason why we’re going to cap banking compensation and not the compensation of entrepeneurs and NFL players is that entrepeneurs and NFL players actually create value.  They’re not being kept out of insolvency by forced contributions from the American taxpayer.  No industry that receives hundreds of billions of taxpayer money should be permitted to pay more than the average American income in salary to its executives, much less the $18 billion in bonuses that was paid out in 2008.\nAnd if those limits mean that banksters will stop banksting as they occasionally threaten, that’s great!  The truth is America’s banksters don’t deserve a cap in their compensation so much as they merit a cap in their fat collective asses.\nThis comment\nfrom a Calculated Risk reader made me laugh:\n“That is truly one heartbreaking statement of staggering stupidity straight out of the mouth of the man who has finished shattering any hope I had that we could steer this ship back on course. I will and must admit, that I was totally taken in, hook line and sinker by this fraud. Im quite disappointed in myself, although my only other option would have been to not vote at all.”\nWell, better late than never.  He is far from the only disenchanted Obama voter.  I assume we can soon look forward to Obama attempting to demonstrate that he’s a big NFL fan… with about the same success he had with his bowling.",
  "tags": [],
  "categories": [],
  "sitemap_lastmod": "2009-09-21T13:15:00+00:00"
}