{
  "url": "https://voxday.net/2009/09/19/letter-to-vox-day-i/",
  "scraped_at": "2026-01-08T23:07:05.876764",
  "title": "1st Letter to Vox Day",
  "date_display": "September 19, 2009",
  "date_iso": "2009-09-19T07:34:00+00:00",
  "date_from_url": "2009-09-19",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>Luke is the atheist blogger at Common Sense Atheism and is interested in a friendly discourse on the topic of Christianity and atheism.  At his suggestion, we will attempt to avoid regurgitating all the usual arguments for and against the existence of God. <a href=\"http://commonsenseatheism.com/?p=3589\">Here is the opening letter</a> of our discussion. I will respond to it within a week.</p><blockquote><p> I’d like to start with a question about why you believe what you believe about God. But I’d like to skip all the usual arguments. In fact, for the sake of argument let’s say all the theistic arguments succeed, and all the atheistic arguments fail. Let’s say the modal ontological argument establishes the existence of an omniscient, omnipotent, and all-good being. Cosmological arguments establish this God as the creator of the universe. Design arguments establish that he purposely designed the universe to host intelligent life. Historical analysis shows that Jesus rose from the dead.</p></blockquote><p> Read <a href=\"http://commonsenseatheism.com/?p=3589\">the rest of it</a> at Common Sense Atheism.</p></div>",
  "content_text": "Luke is the atheist blogger at Common Sense Atheism and is interested in a friendly discourse on the topic of Christianity and atheism.  At his suggestion, we will attempt to avoid regurgitating all the usual arguments for and against the existence of God.\nHere is the opening letter\nof our discussion. I will respond to it within a week.\nI’d like to start with a question about why you believe what you believe about God. But I’d like to skip all the usual arguments. In fact, for the sake of argument let’s say all the theistic arguments succeed, and all the atheistic arguments fail. Let’s say the modal ontological argument establishes the existence of an omniscient, omnipotent, and all-good being. Cosmological arguments establish this God as the creator of the universe. Design arguments establish that he purposely designed the universe to host intelligent life. Historical analysis shows that Jesus rose from the dead.\nRead\nthe rest of it\nat Common Sense Atheism.",
  "tags": [
    "atheism"
  ],
  "categories": [],
  "sitemap_lastmod": "2009-09-19T06:34:00+00:00"
}