{
  "url": "https://voxday.net/2009/09/06/little-less-than-that-actually/",
  "scraped_at": "2026-01-08T23:05:57.020116",
  "title": "A little less than that, actually",
  "date_display": "September 6, 2009",
  "date_iso": "2009-09-06T17:45:00+00:00",
  "date_from_url": "2009-09-06",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>It’s always funny to see a fat old dog <a href=\"http://www.npr.org/templates/transcript/transcript.php?storyId=5015557\">attempt to perform a new trick</a>:</p><blockquote><p>I don’t travel in circles where people say, `I have faith, I believe this in my heart, and nothing you can say or do can shake my faith.’ That’s just a long-winded religious way to say `Shut up’ or another two words that the FCC likes less. But all obscenity is less insulting than `How I was brought up and my imaginary friend means more to me than anything you could ever say or do.’</p></blockquote><p>Forget my upbringing and my imaginary friends.  The lingering odor of the dried sweat in the socks I wore to the gym last week means more to me than anything Penn Jillette or any other comedian moonlighting as a philosopher could ever say or do.  And why would anyone possibly care what one particular collection of atoms might happen to “think” anyhow, assuming, of course, that “thinking” even means anything at all given the absence of scientific evidence for material consciousness.</p><p>My dear atheists, you desperately need to find some better champions.  The Sam Harris debacle should have taught you the intrinsic danger of relying upon comedians.  Now, if you don’t mind a little helpful advice, I suggest not settling for the first Asperger’s victim to start yapping away about his personal unhappiness with history and human society and finding someone who is at least capable of reading a book or ten.  Speaking of which, I read with some amusement Victor Stenger’s comment in his latest book: <i>“Day and other anti-atheists refuse to accept the new atheist argument that the communists did not commit their crimes in the name of atheism.”</i></p><p>Well, yes, that’s quite true.  We do refuse to accept it.  What Mr. Stenger unaccountably fails to mention is that we do so on the perfectly rational basis of it being an absolutely stupid argument that is obviously and verifiably false and is not accepted in any other context.  Second, it would not matter in the least if the atheist communists did not commit their crimes in the name of either communism or atheism, as the pertinent and inescapable fact is that they committed those crimes.  Third, as it happens, it is undeniable that statistical and documentary evidence alike shows that both their atheism and their communism played important roles in their decisions to commit those crimes.</p><p>UPDATE – It’s worth noting that anti-semitism is not merely left-wing, the concept, which is specific, ethnic, and distinct from generic religion-based Jew-hating, <a href=\"http://corner.nationalreview.com/post/?q=NGExYjJmNDU1MTU2OGIxOTcyOGE1NmRkOWY4NDE1NDI=\">was literally invented by an atheist</a>:</p><blockquote><p>As for anti-Semitism, which is more specific than mere Jew hatred, it’s simply not true to say that it was invented by the political right. It was invented by Wilhelm Marr, a German radical, atheist and leftist.  He coined the word, and concept, in his 1879 tract <i>The Way to Victory of Germanicism over Judaism</i> (Der Weg zum Siege des Germanentums über das Judentum). Unlike the old-fashioned Judenhass — Jew hatred — anti-Semitism was modern and scientific, unconcerned with theology. It was progressive! Indeed, Marr hated assimilated Jews more than orthodox ones.</p></blockquote></div>",
  "content_text": "It’s always funny to see a fat old dog\nattempt to perform a new trick\n:\nI don’t travel in circles where people say, `I have faith, I believe this in my heart, and nothing you can say or do can shake my faith.’ That’s just a long-winded religious way to say `Shut up’ or another two words that the FCC likes less. But all obscenity is less insulting than `How I was brought up and my imaginary friend means more to me than anything you could ever say or do.’\nForget my upbringing and my imaginary friends.  The lingering odor of the dried sweat in the socks I wore to the gym last week means more to me than anything Penn Jillette or any other comedian moonlighting as a philosopher could ever say or do.  And why would anyone possibly care what one particular collection of atoms might happen to “think” anyhow, assuming, of course, that “thinking” even means anything at all given the absence of scientific evidence for material consciousness.\nMy dear atheists, you desperately need to find some better champions.  The Sam Harris debacle should have taught you the intrinsic danger of relying upon comedians.  Now, if you don’t mind a little helpful advice, I suggest not settling for the first Asperger’s victim to start yapping away about his personal unhappiness with history and human society and finding someone who is at least capable of reading a book or ten.  Speaking of which, I read with some amusement Victor Stenger’s comment in his latest book:\n“Day and other anti-atheists refuse to accept the new atheist argument that the communists did not commit their crimes in the name of atheism.”\nWell, yes, that’s quite true.  We do refuse to accept it.  What Mr. Stenger unaccountably fails to mention is that we do so on the perfectly rational basis of it being an absolutely stupid argument that is obviously and verifiably false and is not accepted in any other context.  Second, it would not matter in the least if the atheist communists did not commit their crimes in the name of either communism or atheism, as the pertinent and inescapable fact is that they committed those crimes.  Third, as it happens, it is undeniable that statistical and documentary evidence alike shows that both their atheism and their communism played important roles in their decisions to commit those crimes.\nUPDATE – It’s worth noting that anti-semitism is not merely left-wing, the concept, which is specific, ethnic, and distinct from generic religion-based Jew-hating,\nwas literally invented by an atheist\n:\nAs for anti-Semitism, which is more specific than mere Jew hatred, it’s simply not true to say that it was invented by the political right. It was invented by Wilhelm Marr, a German radical, atheist and leftist.  He coined the word, and concept, in his 1879 tract\nThe Way to Victory of Germanicism over Judaism\n(Der Weg zum Siege des Germanentums über das Judentum). Unlike the old-fashioned Judenhass — Jew hatred — anti-Semitism was modern and scientific, unconcerned with theology. It was progressive! Indeed, Marr hated assimilated Jews more than orthodox ones.",
  "tags": [],
  "categories": [],
  "sitemap_lastmod": "2009-09-06T16:45:00+00:00"
}