{
  "url": "https://voxday.net/2009/09/18/mailvox-domestic-nation-building/",
  "scraped_at": "2026-01-08T23:06:58.522687",
  "title": "Mailvox: Domestic nation building",
  "date_display": "September 18, 2009",
  "date_iso": "2009-09-18T09:53:00+00:00",
  "date_from_url": "2009-09-18",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>The OC considers the long-term ineffectiveness of domestic social policy:</p><blockquote><p>Am I just imagining it, or does no one else understand that the “war on poverty” (and the “war on racism” and “urban renewal” and all the rest of that associated LBJ-era social engineering tripe) is <i>exactly</i> the same thing as “nation building,” and springs from exactly the same set of arrogant and sanctimonious late 19th-century Utopian beliefs?  E.g.</p><p>a.) that mankind can be improved and perfected by purely scientific and socioeconomic means</p><p>b.) that some people are too benighted to uplift themselves any time reasonably soon, ergo,</p><p>c.) it is the White Man’s Burden to uplift these people and bring them into the full glory of modern Western scientific civilization, whether they want it or not.</p><p>Perhaps it’s time to strip away the cruft and just call it what it is: nation building. Whether foreign or domestic, both forms are equally doomed to fail, because of a fundamental principle of human nature. <i>You can’t help people who don’t want to be helped</i>.</p></blockquote><p>This is a perspicacious observation.  Nation-building in Iraq and Afghanistan is no different than the structural societal modifications that have been forced on Americans by Washington for the last 45 years.  Civil rights have been a disaster for the black and white communities alike, immigration has destroyed the economic supports for the poor and working classes, and globalization has forced the middle classes into massive debt.</p><p>We know nation-building doesn’t work.  We know planned societal restructuring doesn’t work.  The marvel, then, is that so many people continue to believe that it is possible.  The reason, of course, is the religious belief in the improvability, if not perfectibility, of Man.</p></div>",
  "content_text": "The OC considers the long-term ineffectiveness of domestic social policy:\nAm I just imagining it, or does no one else understand that the “war on poverty” (and the “war on racism” and “urban renewal” and all the rest of that associated LBJ-era social engineering tripe) is\nexactly\nthe same thing as “nation building,” and springs from exactly the same set of arrogant and sanctimonious late 19th-century Utopian beliefs?  E.g.\na.) that mankind can be improved and perfected by purely scientific and socioeconomic means\nb.) that some people are too benighted to uplift themselves any time reasonably soon, ergo,\nc.) it is the White Man’s Burden to uplift these people and bring them into the full glory of modern Western scientific civilization, whether they want it or not.\nPerhaps it’s time to strip away the cruft and just call it what it is: nation building. Whether foreign or domestic, both forms are equally doomed to fail, because of a fundamental principle of human nature.\nYou can’t help people who don’t want to be helped\n.\nThis is a perspicacious observation.  Nation-building in Iraq and Afghanistan is no different than the structural societal modifications that have been forced on Americans by Washington for the last 45 years.  Civil rights have been a disaster for the black and white communities alike, immigration has destroyed the economic supports for the poor and working classes, and globalization has forced the middle classes into massive debt.\nWe know nation-building doesn’t work.  We know planned societal restructuring doesn’t work.  The marvel, then, is that so many people continue to believe that it is possible.  The reason, of course, is the religious belief in the improvability, if not perfectibility, of Man.",
  "tags": [],
  "categories": [],
  "sitemap_lastmod": "2009-09-18T08:53:00+00:00"
}