{
  "url": "https://voxday.net/2009/09/14/mailvox-when-late-is-never_14/",
  "scraped_at": "2026-01-08T23:06:33.931979",
  "title": "Mailvox: when late is never",
  "date_display": "September 14, 2009",
  "date_iso": "2009-09-14T14:15:00+00:00",
  "date_from_url": "2009-09-14",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>SS writes of her belated realization of feminism’s false promises:</p><blockquote><p>I discovered your blog through your book, “The Irrational Atheist,” which I am reading with great relish. A quick search on your blog using the term “feminism” revealed a treasure-trove of commentary that I am enjoying very much.</p><p>You see, I am a woman and a professional, and at the age of 38 after gobs of education and freedom and equal opportunities, am wishing only to remain home and raise children. I have a Ph.D. in a hard science, am a professor and researcher at prestigious institutions, have the respect of my peers and students, and have come to realize that in spite of this I feel utterly empty. None of this success compensates for simple biological urges. I crave tradition, and it is a comfort to realize that there are sound reasons, rooted in reality, for feeling this way. Thank you for expressing, in such a succinct and entertaining way, the utter failure of feminism.</p></blockquote><p>SS is clearly an elite and exceptional example, but she is nevertheless describing the sad reality for far too many women of my generation.  They are smart, educated, and successful, and yet, regardless of whether one looks at them from a traditional perspective or a secular evolutionary one, they are failures as women.  Now, this is not to say that a woman should not be permitted  to choose a path as an evolutionary dead end who primarily contributes to society by creating Powerpoint demonstrations, reading celebrity magazines, and raising felines.  We all possess the inherent right to go to Hell – or if you prefer, Oblivion – in our own particular way.  But a woman should <i>consciously choose</i> that path, she should not be forced to realize that she had it chosen for her twenty years ago.  I note that few of these solitary, childless women ever intentionally chose their path, instead, they discovered themselves insensibly walking it after being subjected to years of subtle pressure from family, friends, and the entertainment media.</p><p>It may or may not be too late for SS to realize her heart’s true desires.  But it is not too late for her to teach a vital lesson in the importance of resisting both overt and subliminal pressure to the next generation of women.</p></div>",
  "content_text": "SS writes of her belated realization of feminism’s false promises:\nI discovered your blog through your book, “The Irrational Atheist,” which I am reading with great relish. A quick search on your blog using the term “feminism” revealed a treasure-trove of commentary that I am enjoying very much.\nYou see, I am a woman and a professional, and at the age of 38 after gobs of education and freedom and equal opportunities, am wishing only to remain home and raise children. I have a Ph.D. in a hard science, am a professor and researcher at prestigious institutions, have the respect of my peers and students, and have come to realize that in spite of this I feel utterly empty. None of this success compensates for simple biological urges. I crave tradition, and it is a comfort to realize that there are sound reasons, rooted in reality, for feeling this way. Thank you for expressing, in such a succinct and entertaining way, the utter failure of feminism.\nSS is clearly an elite and exceptional example, but she is nevertheless describing the sad reality for far too many women of my generation.  They are smart, educated, and successful, and yet, regardless of whether one looks at them from a traditional perspective or a secular evolutionary one, they are failures as women.  Now, this is not to say that a woman should not be permitted  to choose a path as an evolutionary dead end who primarily contributes to society by creating Powerpoint demonstrations, reading celebrity magazines, and raising felines.  We all possess the inherent right to go to Hell – or if you prefer, Oblivion – in our own particular way.  But a woman should\nconsciously choose\nthat path, she should not be forced to realize that she had it chosen for her twenty years ago.  I note that few of these solitary, childless women ever intentionally chose their path, instead, they discovered themselves insensibly walking it after being subjected to years of subtle pressure from family, friends, and the entertainment media.\nIt may or may not be too late for SS to realize her heart’s true desires.  But it is not too late for her to teach a vital lesson in the importance of resisting both overt and subliminal pressure to the next generation of women.",
  "tags": [],
  "categories": [],
  "sitemap_lastmod": "2009-09-14T13:15:00+00:00"
}