{
  "url": "https://voxday.net/2009/09/15/new-history/",
  "scraped_at": "2026-01-08T23:06:39.458139",
  "title": "A new history",
  "date_display": "September 15, 2009",
  "date_iso": "2009-09-15T09:37:00+00:00",
  "date_from_url": "2009-09-15",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>It appears that Sam Harris isn’t the only one <a href=\"http://news.sky.com/skynews/Home/World-News/Kremlin-Bans-Joseph-Stalin-Comparison-To-Hitler-Hero-Or-Villain-In-Volgograd---Stalingrad/Article/200909215381466?lpos=World_News_Second_Home_Page_Feature_Teaser_Region_0&amp;lid=ARTICLE_15381466_Kremlin_Bans_Joseph_Stalin_Comparison_To_Hitler%3A_Hero_Or_Villain_In_Volgograd_-_Stalingrad\">attempting to revise history</a> regarding Stalin’s mass murders:</p><blockquote><p>A government-backed drive is promoting textbooks which say his reign of terror was entirely rational and necessary to make Russia great.  We visited a school in Volgograd – formerly Stalingrad – and found patriotism and pride for Russia and its pivotal role in the Second World War are still strong. During a history lesson pupils learned about Joseph Stalin the hero – not the villain….</p><p>A new law in Russia means that anyone who falsifies the Kremlin’s version of history, for example comparing Stalin with Hitler, may be prosecuted.</p></blockquote><p>So much for Harris’s notion that there is no rational justification for committing mass murder.  I wonder if anyone would like to bet that those behind these new laws proclaiming Stalin a rational hero are devout Christians?  The astonishing thing is that many of today’s atheists are still so desperate to deny any possible connection between a historical atheist mass murderer and his atheism even as other atheists are actively slaughtering large quantities of religious people for their religious beliefs… despite the fact that this connection has no bearing whatsoever on the existence or nonexistence of God.</p><p>Now, as I pointed out in <i>The Irrational Atheist</i>, atheism alone cannot possibly be responsible for turning an individual into a mass slaughterer.  The overwhelming majority of atheists will never kill anyone for any reason.  But, the disproportional tendency of atheists who find themselves in positions of sufficient power to commit mass slaughter that subsequently engage in it cannot be dismissed as a mere coincidence or irrelevant correlation either.  Because atheists practice a morality of one, both logic and history dictate that there always be some who redefine good and evil in a manner that directly contradicts the way it is defined by Christians and more conventionally moral atheists alike.</p><p>Mao is a prime example of such an atheist, as he explicitly declared that conventional morality did not apply to him; by his logic, the desire for absolute power was in itself license to exercise it in any manner he saw fit.  He concocted a rationalization for his lethal actions long before he committed them in his commentary on Friedrich Paulsen’s <i>A System of Ethics</i>:</p><p><i>“I do not agree with the view that to be moral, the motive of one’s actions has to be benefiting others. Morality does not have to be defined in relation to others. . . . [People like me want to] satisfy our hearts to the full and in doing so we automatically have the most valuable moral codes. Of course there are people and objects in the world, but they are all there only for me. . . . I have my desire and act on it. I am responsible to no one.”</i><br> – <i>Mao: The Unknown Story</i> p. 15</br></p><p>“I am responsible to no one.”  That, right there, explains the intrinsic danger of atheism.  The perception of freedom from the invisible shackles of religion that many atheists celebrate is precisely the source of the problem.  While this is relatively harmless in the average atheist, it is absolutely lethal in those extraordinary individuals who possess ruthless personalities, exceptional ambitions and utopian visions.  And it is telling, too, that like Richard Dawkins and other atheist champions, Mao claimed he not only possessed a moral code, but a moral code that was superior to conventional religious moralities.</p></div>",
  "content_text": "It appears that Sam Harris isn’t the only one\nattempting to revise history\nregarding Stalin’s mass murders:\nA government-backed drive is promoting textbooks which say his reign of terror was entirely rational and necessary to make Russia great.  We visited a school in Volgograd – formerly Stalingrad – and found patriotism and pride for Russia and its pivotal role in the Second World War are still strong. During a history lesson pupils learned about Joseph Stalin the hero – not the villain….\nA new law in Russia means that anyone who falsifies the Kremlin’s version of history, for example comparing Stalin with Hitler, may be prosecuted.\nSo much for Harris’s notion that there is no rational justification for committing mass murder.  I wonder if anyone would like to bet that those behind these new laws proclaiming Stalin a rational hero are devout Christians?  The astonishing thing is that many of today’s atheists are still so desperate to deny any possible connection between a historical atheist mass murderer and his atheism even as other atheists are actively slaughtering large quantities of religious people for their religious beliefs… despite the fact that this connection has no bearing whatsoever on the existence or nonexistence of God.\nNow, as I pointed out in\nThe Irrational Atheist\n, atheism alone cannot possibly be responsible for turning an individual into a mass slaughterer.  The overwhelming majority of atheists will never kill anyone for any reason.  But, the disproportional tendency of atheists who find themselves in positions of sufficient power to commit mass slaughter that subsequently engage in it cannot be dismissed as a mere coincidence or irrelevant correlation either.  Because atheists practice a morality of one, both logic and history dictate that there always be some who redefine good and evil in a manner that directly contradicts the way it is defined by Christians and more conventionally moral atheists alike.\nMao is a prime example of such an atheist, as he explicitly declared that conventional morality did not apply to him; by his logic, the desire for absolute power was in itself license to exercise it in any manner he saw fit.  He concocted a rationalization for his lethal actions long before he committed them in his commentary on Friedrich Paulsen’s\nA System of Ethics\n:\n“I do not agree with the view that to be moral, the motive of one’s actions has to be benefiting others. Morality does not have to be defined in relation to others. . . . [People like me want to] satisfy our hearts to the full and in doing so we automatically have the most valuable moral codes. Of course there are people and objects in the world, but they are all there only for me. . . . I have my desire and act on it. I am responsible to no one.”\n–\nMao: The Unknown Story\np. 15\n“I am responsible to no one.”  That, right there, explains the intrinsic danger of atheism.  The perception of freedom from the invisible shackles of religion that many atheists celebrate is precisely the source of the problem.  While this is relatively harmless in the average atheist, it is absolutely lethal in those extraordinary individuals who possess ruthless personalities, exceptional ambitions and utopian visions.  And it is telling, too, that like Richard Dawkins and other atheist champions, Mao claimed he not only possessed a moral code, but a moral code that was superior to conventional religious moralities.",
  "tags": [],
  "categories": [],
  "sitemap_lastmod": "2009-09-15T08:37:00+00:00"
}